{
  "class":[
  {
    "start": [""],
    "end": ["CSCI 1133"],
    "name": "Introduction to Computing and Programming Concept",
    "info": "Fundamental programming concepts using Python language. Problem solving skills, recursion, object-oriented programming. Algorithm development techniques. Use of abstractions/modularity. Data structures/abstract data types. Develop programs to solve real-world problems. prereq: concurrent registration is required (or allowed) in MATH 1271 or concurrent registration is required (or allowed) in MATH 1371 or concurrent registration is required (or allowed) in MATH 1571H or instr consent"
  },
  {
    "start": ["MATH 1271","MATH 1371"],
    "end": ["CSCI 2033"],
    "name": "Elementary Computational Linear Algebra",
    "info": "Matrices/linear transformations, basic theory. Linear vector spaces. Inner product spaces. Systems of linear equations, Eigenvalues, singular values. Algorithms/computational matrix methods using MATLAB. Use of matrix methods to solve variety of computer science problems. prereq: [MATH 1271 or MATH 1371], [1113 or 1133 or knowledge of programming concepts]"
  },
  {
    "start": ["MATH 1271","MATH 1371"],
    "end": ["CSCI 2011"],
    "name": "Discrete Structures of Computer Science",
    "info": "Foundations of discrete mathematics. Sets, sequences, functions, big-O, propositional/predicate logic, proof methods, counting methods, recursion/recurrences, relations, trees/graph fundamentals. prereq: MATH 1271 or MATH 1371 or instr consent"
  },
  {
    "start": ["CSCI 1133"],
    "end": ["CSCI 1933"],
    "name": "Introduction to Algorithms and Data Structures",
    "info": "Advanced object oriented programming to implement abstract data types (stacks, queues, linked lists, hash tables, binary trees) using Java language. Inheritance. Searching/sorting algorithms. Basic algorithmic analysis. Use of software development tools. Weekly lab. prereq: 1133 or instr consent"
    

  },
  {
    "start": ["CSCI 1933","CSCI 2011"],
    "end": ["CSCI 2041"],
    "name": "Advanced Programming Principles",
    "info": "Principles/techniques for creating correct, robust, modular programs. Computing with symbolic data, recursion/induction, functional programming, impact of evaluation strategies, parallelism. Organizing data/computations around types. Search-based programming, concurrency, modularity. prereq: [1913 or 1933], 2011"

  },
  {
    "start": ["CSCI 1933"],
    "end": ["CSCI 2021"],
    "name": "Maching Architecture and Organization",
    "info": "Introduction to hardware/software components of computer system. Data representation, boolean algebra, machine-level programs, instruction set architecture, processor organization, memory hierarchy, virtual memory, compiling, linking. Programming in C. prereq: 1913 or 1933 or instr consent"
  },
  {
    "start": ["CSCI 2041","CSCI 2021"],
    "end": ["CSCI 3081W"],
    "name": "Program Design and Development",
    "info": "Principles of programming design/analysis. Concepts in software development. Uses a programming project to illustrate key ideas in program design/development, data structures, debugging, files, I/O, testing, and coding standards. prereq: [2021, 2041]; CS upper div, CS grad, or dept. permission"
  },
  {
    "start": ["CSCI 2021"],
    "end": ["CSCI 4061"],
    "name": "Introduction to Operating System",
    "info": "Processes/threads, process coordination, interprocess communication, asynchronous events, memory management/file systems. Systems programming projects using operating system interfaces and program development tools. prereq: 2021 or EE 2361; CS upper div, CS minor, CompE upper div., EE upper div., EE grad, ITI upper div., Univ. honors student, or dept. permission; no cr for grads in CSci."
  },
  {
    "start": ["CSCI 2011","CSCI 1933"],
    "end": ["CSCI 4041"],
    "name": "Algorithms and Data Structures",
    "info": "Rigorous analysis of algorithms/implementation. Algorithm analysis, sorting algorithms, binary trees, heaps, priority queues, heapsort, balanced binary search trees, AVL trees, hash tables and hashing, graphs, graph traversal, single source shortest path, minimum cost spanning trees. prereq: [(1913 or 1933) and 2011] or instr consent; cannot be taken for grad CSci cr"
  },
  {
    "start": ["STAT 3021","CSCI 2033"],
    "end": ["CSCI 5521"],
    "name": "Machine Learning Fundamentals",
    "info": "Problems of pattern recognition, feature selection, measurement techniques. Statistical decision theory, nonstatistical techniques. Automatic feature selection/data clustering. Syntactic pattern recognition. Mathematical pattern recognition/artificial intelligence. Prereq: [2031 or 2033], STAT 3021, and knowledge of partial derivatives"
    

  },
  {
    "start": ["STAT 3021","CSCI 5551"],
    "end": ["CSCI 5552"],
    "name": "Sensing and Estimation in Robotics",
    "info": "Bayesian estimation, maximum likelihood estimation, Kalman filtering, particle filtering. Sensor modeling and fusion. Mobile robot motion estimation (odometry, inertial,laser scan matching, vision-based) and path planning. Map representations, landmark-based localization, Markov localization, simultaneous localization/mapping (SLAM), multi-robot localization/mapping. prereq: [5551, Stat 3021] or instr consent"
  },
  {
    "start": ["CSCI 2033"],
    "end": ["CSCI 5304"],
    "name": "Computational Aspects of Matrix Theory",
    "info": "Perturbation theory for linear systems and eigenvalue problems. Direct/iterative solution of large linear systems. Matrix factorizations. Computation of eigenvalues/eigenvectors. Singular value decomposition. LAPACK/other software packages. Introduction to sparse matrix methods. prereq: 2031 or 2033 or instr consent"
  },
  {
    "start": ["CSCI 2033"],
    "end": ["CSCI 5551"],
    "name": "Introduction to Intelligent Robotic Systems",
    "info": "Transformations, kinematics/inverse kinematics, dynamics, control. Sensing (robot vision, force control, tactile sensing), applications of sensor-based robot control, robot programming, mobile robotics, microrobotics. prereq: 2031 or 2033 or instr consent"
  },
  {
    "start": ["CSCI 2033"],
    "end": ["CSCI 5302"],
    "name": "Analysis of Numerical Algorithms",
    "info":"Additional topics in numerical analysis. Interpolation, approximation, extrapolation, numerical integration/differentiation, numerical solutions of ordinary differential equations. Introduction to optimization techniques. prereq: 2031 or 2033 or instr consent"
  },
  {
    "start": ["CSCI 2033"],
    "end": ["CSCI 5563"],
    "name": "Multiview 3D Geometry in Computer Vision",
    "info":"The 3D spatial relationship between cameras and scenes in computer vision. Application to tasks such as planning robots, reconstructing scenes from photos, and understanding human behaviors from body-worn cameras data. Multiview theory fundamentals, structure-from-motion, state-of-the-art approaches, and current research integration. prereq: Undergraduate students enrolling in the course must have completed CSCI 2033 or have instructor consent."
  },
  {
    "start": ["CSCI 2041"],
    "end": ["CSCI 5801"],
    "name": "Software Engineering I",
    "info": "Advanced introduction to software engineering. Software life cycle, development models, software requirements analysis, software design, coding, maintenance. prereq: 2041 or instr consent"
    
  },
  {
    "start": ["CSCI 5801"],
    "end": ["CSCI 5802"],
    "name": "Software Engineering II",
    "info": "Introduction to software testing, software maturity models, cost specification models, bug estimation, software reliability models, software complexity, quality control, and experience report. Student groups specify, design, implement, and test partial software systems. Application of general software development methods and principles from 5801. prereq: 5801 or instr consent"
  },
  {
    "start": ["CSCI 2041"],
    "end": ["CSCI 5511"],
    "name": "Artificial Intelligence I",
    "info": "Introduction to AI. Problem solving, search, inference techniques. Logic/theorem proving. Knowledge representation, rules, frames, semantic networks. Planning/scheduling. Lisp programming language. prereq: [2041 or instr consent], grad student"
  },
  {
    "start": ["CSCI 5511"],
    "end": ["CSCI 5561"],
    "name": "Computer Vision",
    "info": "Issues in perspective transformations, edge detection, image filtering, image segmentation, and feature tracking. Complex problems in shape recovery, stereo, active vision, autonomous navigation, shadows, and physics-based vision. Applications. prereq: CSci 5511, 5521, or instructor consent."
  },
  {
    "start": ["CSCI 4041","STAT 3021"],
    "end": ["CSCI 5512"],
    "name": "Aritificial Intelligence II",
    "info": "Uncertainty in artificial intelligence. Probability as a model of uncertainty, methods for reasoning/learning under uncertainty, utility theory, decision-theoretic methods. prereq: [STAT 3021, 4041] or instr consent"
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 5523"],
    "name": "Introduction to Data Mining",
    "info": "Data pre-processing techniques, data types, similarity measures, data visualization/exploration. Predictive models (e.g., decision trees, SVM, Bayes, K-nearest neighbors, bagging, boosting). Model evaluation techniques, Clustering (hierarchical, partitional, density-based), association analysis, anomaly detection. Case studies from areas such as earth science, the Web, network intrusion, and genomics. Hands-on projects. prereq: 4041 or equiv or instr consent"
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 5115"],
    "name": "User Interface Design, Implementation and Evaluation",
    "info": "Theory, design, programming, and evaluation of interactive application interfaces. Human capabilities and limitations, interface design and engineering, prototyping and interface construction, interface evaluation, and topics such as data visualization and World Wide Web. Course is built around a group project. prereq: 4041 or instr consent"
  },
  {
    "start": ["CSCI 5115"],
    "end": ["CSCI 5125"],
    "name": "Collaborative and Social Computing",
    "info": "Introduction to computer-supported cooperative work, social computing. Technology, research methods, theory, case studies of group computing systems. Readings, hands-on experience. prereq: 5115 or instr consent"
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 5609"],
    "name": "Visualization",
    "info": "Fundamental theory/practice in data visualization. Programming applications. Perceptual issues in effective data representation, multivariate visualization, information visualization, vector field/volume visualization. prereq: [1913, 4041] or equiv or instr consent"
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 5421"],
    "name": "Advanced Algorithms and Data Structure",
    "info": "Fundamental paradigms of algorithm and data structure design. Divide-and-conquer, dynamic programming, greedy method, graph algorithms, amortization, priority queues and variants, search structures, disjoint-set structures. Theoretical underpinnings. Examples from various problem domains. prereq: 4041 or instr consent"
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 5611"],
    "name": "Animation & Planning in Games",
    "info": "Theory behind algorithms used to bring virtual worlds to life. Computer animation topics. Real-time, interactive techniques used in modern games. Physically-based animation, motion planning, character animation, simulation in virtual worlds. prereq: 4041 or 4611 or instr consent"
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 5451"],
    "name": "Introduction to Parallel Computing: Architectures, Algorithms, and Programming",
    "info": "Parallel architectures design, embeddings, routing. Examples of parallel computers. Fundamental communication operations. Performance metrics. Parallel algorithms for sorting. Matrix problems, graph problems, dynamic load balancing, types of parallelisms. Parallel programming paradigms. Message passing programming in MPI. Shared-address space programming in openMP or threads. prereq: 4041 or instr consent"
  
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 5481"],
    "name": "Computational Techniques for Genomics",
    "info": "Techniques to analyze biological data generated by genome sequencing, proteomics, cell-wide measurements of gene expression changes. Algorithms for single/multiple sequence alignments/assembly. Search algorithms for sequence databases, phylogenetic tree construction algorithms. Algorithms for gene/promoter and protein structure prediction. Data mining for micro array expression analysis. Reverse engineering of regulatory networks. prereq: 4041 or instr consent"
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 5461"],
    "name": "Functional Genomics, Systems Biology, and Bioinformatics",
    "info": "Computational methods for analyzing, integrating, and deriving predictions from genomic/proteomic data. Analyzing gene expression, proteomic data, and protein-protein interaction networks. Protein/gene function prediction, Integrating diverse data, visualizing genomic datasets. prereq: 3003 or 4041 or instr consent"
  },
  {
    "start": ["CSCI 4041"],
    "end": ["CSCI 4707"],
    "name": "Practice of Database Systems",
    "info": "Concepts, conceptual data models, case studies, common data manipulation languages, logical data models, database design, facilities for database security/integrity, applications. prereq: 4041 or instr consent"
  },
  {
    "start": ["CSCI 4707"],
    "end": ["CSCI 5751"],
    "name": "Big Data Engineering and Architecture",
    "info": ""
  },
  {
    "start": ["CSCI 4707"],
    "end": ["CSCI 5708"],
    "name": "Architecture and Implementation of Database Management Systems",
    "info": "Big data and data-intensive application management, design and processing concepts. Data modeling on different NoSQL databases: key/value, column-family, document, graph-based stores. Stream and real-time processing. Big data architectures. Distributed computing using Spark, Hadoop or other distributed systems. Big data projects. prereq: 4041, 5707, or instructor consent."
  },
  {
    "start": ["CSCI 2041"],
    "end": ["CSCI 4011"],
    "name": "Formal Languages and Automata Theory",
    "info": "Logical/mathematical foundations of computer science. Formal languages, their correspondence to machine models. Lexical analysis, string matching, parsing. Decidability, undecidability, limits of computability. Computational complexity. prereq: 2041 or instr consent"
  },
  {
    "start": ["CSCI 2033","CSCI 3081W"],
    "end": ["CSCI 5123"],
    "name": "Recommender Systems",
    "info": "An overview of recommender systems, including content-based and collaborative algorithms for recommendation, programming of recommender systems, and evaluation and metrics for recommender systems. prereq: Java programming and 2033 and 3081, or instructor consent."
  },
  {
    "start": ["CSCI 3081W"],
    "end": ["CSCI 4271W"],
    "name": "Development of Secure Software Systems",
    "info": "Overview of threat modeling and security assessment in the design and development of software systems. Techniques to identify, exploit, detect, mitigate and prevent software vulnerabilities at the design, coding, application, compiler, operating system, and networking layers. Methods for effectively communicating system designs and vulnerabilities. Prerequisites: 3081W"

  },
  {
    "start": ["CSCI 4011"],
    "end": ["CSCI 5106"],
    "name": "Programming Languages",
    "info": "Design and implementation of high-level languages. Course has two parts: (1) language design principles, concepts, constructs; (2) language paradigms, applications. Note: course does not teach how to program in specific languages. prereq: 4011 or instr consent"
  },
  {
    "start": ["CSCI 5607"],
    "end": ["CSCI 5619"],
    "name": "Virtual Reality and 3D Interaction",
    "info": "Introduction to software, technology/applications in virtual/augmented reality, 3D user interaction. Overview of current research. Hands-on projects. prereq: 4611 or 5607 or 5115 or equiv or instr consent"
  },
  {
    "start": ["CSCI 5607"],
    "end": ["CSCI 5608"],
    "name": "Fundamentals of Computer Graphics",
    "info": "Advanced topics in image synthesis, modeling, rendering. Image processing, image warping, global illumination, non-photorealistic rendering, texture synthesis. Parametric cubic surfaces, subdivision surfaces, acceleration techniques, advanced texture mapping. Programming in C/C++. prereq: 5607 or instr consent"
  },
  {
    "start": ["CSCI 5106","CSCI 2021"],
    "end": ["CSCI 5161"],
    "name": "Introduction to Compilers",
    "info": "Techniques for translating modern programming languages to intermediate forms or machine-executable instructions/their organization into compiler. Lexical analysis, syntax analysis, semantic analysis, data flow analysis, code generation. Compiler project for prototypical language. prereq: [2021, 5106] or instr consent"
  },
  {
    "start": ["CSCI 2021"],
    "end": ["CSCI 4611"],
    "name": "Programming Interactive Computer Graphics and Games",
    "info": "Tools/techniques for programming games/interactive computer graphics. Event loops, rendering/animation, polygonal models, texturing, physical simulation. Modern graphics toolkits. History/future of computer games technology. Social impact of interactive computer graphics. prereq: 2021 or instr consent"
  },
  {
    "start": ["CSCI 4061"],
    "end": ["CSCI 5143"],
    "name": "Real-Time and Embedded Systems",
    "info": "Real-time systems that require timely response by computer to external stimulus. Embedded systems in which computer is part of machine. Increasing importance of these systems in commercial products. How to control robots and video game consoles. Lecture, informal lab. prereq: [4061 or instr consent], experience with C language"
  },
  {
    "start": ["CSCI 2021"],
    "end": ["CSCI 4203"],
    "name": "Computer Architecture",
    "info": "Introduction to computer architecture. Aspects of computer systems, such as pipelining, memory hierarchy, and input/output systems. Performance metrics. Examins each component of a complicated computer system. prereq: 2021 or instr consent"
  },
  {
    "start": ["CSCI 4203"],
    "end": ["CSCI 5204"],
    "name": "Advanced Computer Architecture",
    "info": "Instruction set architecture, processor microarchitecture, memory, I/O systems. Interactions between computer software and hardware. Methodologies of computer design. prereq: 4203 or EE 4363"
  },
  {
    "start": ["CSCI 4131"],
    "end": ["CSCI 5117"],
    "name": "Developing the Interactive Web",
    "info": "Hands-on design experience using modern web development tools. Students work in teams to develop software programs using each of four toolkits. Analyze developments in forum posts and classroom discussions. prereq: 4131 or 5131 or instr consent; upper div or grad in CSci recommended"
  },
  {
    "start": ["CSCI 4211"],
    "end": ["CSCI 5221"],
    "name": "Foundations of Advanced Networking",
    "info": "Design principles, protocol mechanisms. Network algorithmics, implementation techniques. Advanced network architectures, state-of-art/emerging networking technologies/applications, network modeling. Simulation, experiments. prereq: 4211 or 5211 or equiv; intro course in computer networks recommended"
  },
  {
    "start": ["CSCI 4061"],
    "end": ["CSCI 5271"],
    "name": "Introduction to Computer Security",
    "info": "Concepts of computer, network, and information security. Risk analysis, authentication, access control, security evaluation, audit trails, cryptography, network/database/application security, viruses, firewalls. prereq: 4061 or 5103 or equiv or instr consent"
  },
  {
    "start": ["CSCI 4061"],
    "end": ["CSCI 5103"],
    "name": "Operating Systems",
    "info": "Conceptual foundation of operating system designs and implementations. Relationships between operating system structures and machine architectures. UNIX implementation mechanisms as examples. prereq: 4061 or instr consent"
  },
  {
    "start": ["CSCI 5103"],
    "end": ["CSCI 5105"],
    "name": "Introduction to Distributed Systems",
    "info": "Distributed system design and implementation. Distributed communication and synchronization, data replication and consistency, distributed file systems, fault tolerance, and distributed scheduling. prereq: [5103 or equiv] or instr consent"
  }

  ]
}
