[
  {
    "uid": "008990",
    "code": "ANTH1001H",
    "subject": "ANTH",
    "number": "1001",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Human Evolution",
    "fullname": "Honors: Human Evolution",
    "info": "From ancestors of chimpanzees/humans to origins of modern humans. Principles of evolutionary theory, behavioral biology, comparative anatomy used to reconstruct the major events in human evolution, behavior of ourselves/our ancestors.prereq: honors",
    "prereq": []
  },
  {
    "uid": "008991",
    "code": "ANTH1003V",
    "subject": "ANTH",
    "number": "1003",
    "honors": true,
    "writingIntensive": true,
    "name": "Understanding Cultures: Honors",
    "fullname": "Understanding Cultures: Honors",
    "info": "Introduction to social and cultural anthropology. Comparative study of societies and cultures around the world. Topics include adaptive strategies; economic processes; kinship, marriage, and gender; social stratification; politics and conflicts; religion and ritual; personality and culture.prereq: Honors",
    "prereq": []
  },
  {
    "uid": "787787",
    "code": "ANTH1005V",
    "subject": "ANTH",
    "number": "1005",
    "honors": true,
    "writingIntensive": true,
    "name": "H:Cultural Diversity/World Sys",
    "fullname": "Introduction to Cultural Diversity and the World System",
    "info": "Anthropology of cultural diversity in the United States and around the world. Comparative study of relationship between local cultures, global processes. Race/ethnicity, economic/social organization, political/religious systems, gender, social change.",
    "prereq": []
  },
  {
    "uid": "816917",
    "code": "ANTH2001V",
    "subject": "ANTH",
    "number": "2001",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors: Being Human",
    "fullname": "Being Human - A Comprehensive Introduction to the Four Fields of Anthropology",
    "info": "Whenever you take a trip, do you people-watch and wonder about these interesting humans that surround you? Why they look the way they do? How they know how to behave in different situations? Why they eat really weird foods? Anthropology answers these questions using a holistic, bio-cultural framework. In this course we will explore the relationship between human bodies and human culture, using the five fields of anthropological inquiry: biological anthropology, archaeology, cultural anthropology, linguistics and applied anthropology. We will answer questions such as: How and why did our physiques evolve into the form we see today? What cultural and environmental influences affect human variation throughout the world? What effects do religion, law, and society have on the way people think about, discuss, and use their bodies today? How do we learn about our past from examining human remains? How and why do differences in language use define us as persons? How can anthropological insight lead to great careers in law, medicine, business and public service?",
    "prereq": []
  },
  {
    "uid": "816766",
    "code": "ANTH4007H",
    "subject": "ANTH",
    "number": "4007",
    "honors": true,
    "writingIntensive": false,
    "name": "Lab Techniques - Archeology",
    "fullname": "Honors: Laboratory Techniques in Archaeology",
    "info": "Plant remains, materials culture, faunal remains, human osteology. Emphasizes lab experience. Instructor consent required.pre-req: instr consent.",
    "prereq": []
  },
  {
    "uid": "806838",
    "code": "ANTH4013H",
    "subject": "ANTH",
    "number": "4013",
    "honors": true,
    "writingIntensive": false,
    "name": "Capstone Proj Writing Seminar",
    "fullname": "Capstone Project Writing Seminar",
    "info": "The purpose of this seminar is to provide Honors students with instructional support and a structured environment in which to develop their research and writing skills within the practical context of writing the Honors Thesis for the Capstone. The thesis is based on original research for the Senior Capstone Project conducted by students in consultation with their advisors, and it is advised that students finish conducting research before enrolling in this course. In some cases it is possible research may continue from the planning course into this seminar. The seminar meets once a week, during which time students engage in active learning exercises, in-class discussions, and peer review as they write their thesis. The goal of this course is to align the writing abilities of students with the writing criteria developed by departmental faculty as part of the Center for Writing’s Writing Enriched Curriculum. This course compliments student’s advisor-advisee relationship for the Senior Capstone Project, and it is required that students set up regular meetings with their advisors to discuss their progress in the course in addition to consulting about the content of their projects. prereq: Sr major, honors student, instr consent",
    "prereq": []
  }
]