[
  {
    "uid": "811437",
    "code": "BA2005H",
    "subject": "BA",
    "number": "2005",
    "honors": true,
    "writingIntensive": false,
    "name": "Ethics and Sustainability",
    "fullname": "Business Ethics, Corporate Responsibility and Sustainability",
    "info": "This course seeks to give you the vocabulary necessary to describe and explain the ethical issues you will learn to identify through lectures, readings, and case studies. You will be provided with a decision-making framework that you can use to disentangle the most complicated scenarios, which will then allow you to use critical thinking and analysis to arrive at a decision on how you would respond as an individual in an ethically-defensible manner. This course will also anticipate your future career growth into positions of management and leadership, and will help give you the tools to manage people, money, and business affairs both effectively and ethically. BA2005H was previously offered as MGMT1005H prereq: Honors student",
    "prereq": []
  },
  {
    "uid": "797353",
    "code": "BA3200H",
    "subject": "BA",
    "number": "3200",
    "honors": true,
    "writingIntensive": false,
    "name": "Leadership Colloquium",
    "fullname": "Securian Foundation Leadership Colloquium",
    "info": "How to cultivate, evaluate, and apply leadership concepts in all phases of life. Emphasizes real leadership experiences. Ethical leadership, leadership communication, management vs leadership, motivation/empowerment, leading in a diverse environment, leading during change.",
    "prereq": []
  },
  {
    "uid": "791976",
    "code": "BA3701H",
    "subject": "BA",
    "number": "3701",
    "honors": true,
    "writingIntensive": false,
    "name": "Hlthcare Market:  Prcpls/Agts",
    "fullname": "Healthcare Marketplace: Principals and Agents in a Trillion-Dollar Economy",
    "info": "Introduction to healthcare sector markets for goods/services. Physician services, hospital services, insurance, long-term care, pharmaceuticals, medical devices, information technology. Lectures, recitations, presentations from healthcare business leaders.",
    "prereq": []
  },
  {
    "uid": "788177",
    "code": "BA3990H",
    "subject": "BA",
    "number": "3990",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Topics",
    "fullname": "Honors Topics",
    "info": "Topics vary.",
    "prereq": []
  },
  {
    "uid": "792613",
    "code": "BA4000H",
    "subject": "BA",
    "number": "4000",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Capstone course for Carlson honors program. Organizational or cross-functional topics.",
    "prereq": []
  },
  {
    "uid": "802524",
    "code": "BA4991H",
    "subject": "BA",
    "number": "4991",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Thesis Seminar II",
    "fullname": "Honors Thesis Seminar II",
    "info": "Students refine research methodology, develop results, and derive preliminary conclusions. Draft of honors thesis, with preliminary results and clear agenda for final analysis.prereq: 4990H, CSOM honors, sr",
    "prereq": []
  },
  {
    "uid": "802523",
    "code": "BA4992V",
    "subject": "BA",
    "number": "4992",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Thesis Seminar",
    "fullname": "Honors Thesis Seminar",
    "info": "This course provides a foundation for how to conduct individually-pursed research with a focus on writing and methods. While it is designed to support Carlson School students writing their honors thesis, students do not need to continue with a thesis to successfully complete the course. In order to both develop your individual thesis as well as learn research methods and writing techniques over the course of a single semester, there will be parallel sets of assignments: one for your thesis (individual) and one for a practice thesis (group). During the first part of the course, your individual thesis project will be emphasized, focusing on finding a thesis topic related to the research of Carlson School faculty who will be supervisors for this academic year. Starting partway through the course, you will be paired with a group of students to work on a practice thesis in which methods, statistical analysis, and writing results are emphasized using pre-specified datasets. Writing is integrated fully into the course. You will be instructed in writing pertinent to research proposals and scholarship, including problem statements, annotated bibliographies, literature reviews, methodology, and reference lists. prereq: Senior honors student",
    "prereq": []
  },
  {
    "uid": "803714",
    "code": "BA4994H",
    "subject": "BA",
    "number": "4994",
    "honors": true,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Honors directed research.prereq: Honors",
    "prereq": []
  }
]