[
  {
    "uid": "825823",
    "code": "BSE2001H",
    "subject": "BSE",
    "number": "2001",
    "honors": true,
    "writingIntensive": false,
    "name": "Intro to BSE - Honors",
    "fullname": "Introduction to Biology, Society, and Environment - Honors",
    "info": "The BSE major is built on the idea that problems of biology, health, and the environment emerge at the intersection of natural and human systems. Understanding these problems and their solutions, and building skill sets to address them, requires experience in the biological and natural sciences as well as in the social sciences and humanities. In this introduction to the BSE major, you’ll explore the interconnectedness of biology, society, and environment through a series of “case study” modules that include lectures, videos, readings, and discussions. You’ll also complete some very practical exercises to help you consider how you might develop your own unique path through the BSE major, in ways that are relevant to your personal and/or professional interests and goals.Must be completed prior to senior year.",
    "prereq": []
  },
  {
    "uid": "820348",
    "code": "BSE3991H",
    "subject": "BSE",
    "number": "3991",
    "honors": true,
    "writingIntensive": false,
    "name": "BSE Capstone Honors",
    "fullname": "BSE Capstone Honors",
    "info": "This course will help you reflect on your path through the BSE major, assess the knowledge and skills you developed during your Honors degree program, and articulate how your knowledge and skills support your personal and professional interests and goals. BSE 3991H is open to Senior BSE Honors majors.",
    "prereq": []
  },
  {
    "uid": "809024",
    "code": "BSE3996H",
    "subject": "BSE",
    "number": "3996",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Sr Proj Dir Research",
    "fullname": "Honors: Senior Project Directed Research",
    "info": "Individual guided research course taken in fulfillment of BSE senior project requirement.Prereq-instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "809026",
    "code": "BSE3997H",
    "subject": "BSE",
    "number": "3997",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Senior Project",
    "fullname": "Honors: Senior Project",
    "info": "Senior Project add-on credit. Must be taken concurrently with \"BSE Core\" or \"BSE Theme Elective\" course related to area of specialization.Prereq-instr consent, dept consent, college consent.",
    "prereq": []
  }
]