[
  {
    "uid": "003786",
    "code": "CFAN1000H",
    "subject": "CFAN",
    "number": "1000",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Colloquium",
    "fullname": "Honors Colloquium",
    "info": "Topics vary by semester.",
    "prereq": []
  },
  {
    "uid": "797431",
    "code": "CFAN1902H",
    "subject": "CFAN",
    "number": "1902",
    "honors": true,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics will vary. See Class Schedule.",
    "prereq": []
  },
  {
    "uid": "802929",
    "code": "CFAN3000H",
    "subject": "CFAN",
    "number": "3000",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Topics in CFANS",
    "fullname": "Honors Topics in CFANS",
    "info": "Oral presentations, discussion of students' research papers. Literature review of selected topics. Discussions with students/staff about their experiences in international agriculture.prereq: Honors",
    "prereq": []
  },
  {
    "uid": "814046",
    "code": "CFAN3091V",
    "subject": "CFAN",
    "number": "3091",
    "honors": true,
    "writingIntensive": true,
    "name": "From Ideas to Strategic Plans",
    "fullname": "Research Proposals: From Ideas to Strategic Plans",
    "info": "You have a great research idea, now what? How do you turn your idea into a proposal? It has been said, paraphrasing Edison, that innovation is one percent inspiration, 99 percent perspiration. In this course, we will start with an inspiring idea and sweat our way to develop a research proposal. The students will go through a step-by-step process that starts with choosing and defining a research idea, then proceeding to do literature reviews and to the development of a hypothesis, aims, objectives, and a research strategy. The aim of this course is to provide students with tools to understand the structure of scientific reports and proposals, literature searches, and basic data interpretation. The students will learn about different research approaches and how to achieve consistency in their research projects. We will guide students in how to begin and develop a written research proposal that will satisfy the requirements of their advisors, institution, and funding organizations.prereq: Honors student. If you have less than 60 credits and are interested in this course, please contact the instructor.",
    "prereq": []
  },
  {
    "uid": "003788",
    "code": "CFAN3100H",
    "subject": "CFAN",
    "number": "3100",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Experience",
    "fullname": "Honors Experience",
    "info": "Developed by student and CFANS faculty mentor. May include foreign study-travel, research, position or policy paper, or any experience demonstrating advanced study/service/understanding.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "016110",
    "code": "CFAN3101H",
    "subject": "CFAN",
    "number": "3101",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "",
    "prereq": []
  },
  {
    "uid": "806604",
    "code": "CFAN4801H",
    "subject": "CFAN",
    "number": "4801",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Thesis",
    "fullname": "Honors Thesis",
    "info": "Students work closely with a faculty member to develop and complete the honors thesis.  Available to all CFANS majors.Prereq-Candidate for graduation with honors through CFANS in any major, college consent.",
    "prereq": []
  }
]