[
  {
    "uid": "816902",
    "code": "EPSY2201H",
    "subject": "EPSY",
    "number": "2201",
    "honors": true,
    "writingIntensive": false,
    "name": "Research Methods for Honors",
    "fullname": "Basics of Research Methods for Honors Students",
    "info": "As part of a society that is saturated with \"research,\" we have all at some point encountered at least one form of research--whether it is via election polls, market surveys, investigative findings reported on the 10pm news, or academic research for your papers. There is sometimes too much research to make sense of it all. As an undergraduate student, you have likely found many examples of research, and it will only become more important in your own academic career, and if you choose to pursue an academic route, in your own development as a scholar. Therefore, learning the basics of research--how it is conducted, how it can be used to answer everyday questions, and what makes it good quality--will make you not only a better researcher, but also a better consumer of academic and popular research. This course aims to introduce you, as an honors student, to these topics.",
    "prereq": []
  },
  {
    "uid": "819119",
    "code": "EPSY3303H",
    "subject": "EPSY",
    "number": "3303",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors EPSY UG Practicum",
    "fullname": "Honors Educational Psychology Undergraduate Practicum",
    "info": "This culminating course familiarizes students with the principles and practice of applied psychology in educational and community settings. Through supervised fieldwork experiences in either research or practice settings, students will develop an understanding of ethical considerations in educational psychology and explore how psychological research can be used to advance the practice of psychology in applied settings. This course is designed for undergraduate students completing an Educational Psychology undergraduate minor or the Special Education major. The course meets for 120 minutes weekly, and students complete 90 hours of fieldwork (approximately 8-10 hours/week).Honors students will be involved in Directed Faculty Research conducted with an approved Educational Psychology faculty member. The research project will be used to direct the honors thesis. In addition, honors students will present their research at the Undergraduate Research SymposiumNote: students in the special education major must complete fieldwork related to disabilities and/or special education.",
    "prereq": []
  }
]