[
  {
    "uid": "813469",
    "code": "HSCI2333V",
    "subject": "HSCI",
    "number": "2333",
    "honors": true,
    "writingIntensive": true,
    "name": "Century of Science in Mod Am",
    "fullname": "Honors Course: A Century of Science in Modern America",
    "info": "Science and technology influence nearly every aspect of our daily lives as well as the communities in which we live, both locally and globally. How did science and technology become such ubiquitous and powerful aspects of American industry, government policy, public life, and international negotiation? What are the responsibilities of scientists and engineers who play a critical role in creating and maintaining these elements? How can the broader public position itself to provide encouragement, insight and critique of the research and applications of science and technology? This course is intended to examine these questions by exploring historical case studies that highlight ethical, political, and social issues that give meaning to, and in turn, are shaped by science and technology. Beginning with the role of scientists as professional experts in the Progressive era, we consider how ideals of scientific management impacted animal lives and workers = bodies. Ethical choices frame the application of expertise and require attention and specific decision-making. Using eugenics as an example, we will reflect upon the interplay between the often naïve understanding of heredity and public policy and continue discussion into the application of contemporary genetic testing. Ethics are framed in social and political settings, and we will follow sometimes surprisingly comparable developments in Russia and the United States, with particular attention to large-scale engineering projects in the 1920s and 1930s and the space race in the 1950s and 1960s in order to understand how these reflected, or failed to reflect, risk and human life. This course meets the Historical Perspectives, Civic Life and Ethics, and Writing Intensive requirements as defined by the Council on Liberal Education. Along with Student Learning Outcomes, these requirements will help you continue to build critical tools for your work at the university as well as ways to evaluate and create knowledge in and beyond your intended career area.",
    "prereq": []
  },
  {
    "uid": "008627",
    "code": "HSCI3333V",
    "subject": "HSCI",
    "number": "3333",
    "honors": true,
    "writingIntensive": true,
    "name": "Am Sci & Tech in Past Century",
    "fullname": "Honors Course: Issues in American Science and Technology in the Past Century",
    "info": "Historical approach to understanding science and technology. Emphasizes intellectual, political, and social contexts. Decision-making by practitioners on issues of importance to the profession and the community. Topics relating to popular science, science, and warfare.",
    "prereq": []
  }
]