[
  {
    "uid": "795806",
    "code": "HSEM1001H",
    "subject": "HSEM",
    "number": "1001",
    "honors": true,
    "writingIntensive": false,
    "name": "Intro to Arts and Sciences",
    "fullname": "Introduction to Arts and Sciences",
    "info": "Small-class discussion with outstanding faculty members. Meets for 10 weeks.",
    "prereq": []
  },
  {
    "uid": "796395",
    "code": "HSEM1210H",
    "subject": "HSEM",
    "number": "1210",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Book Discussion",
    "fullname": "Honors Book Discussion",
    "info": "Honors Book Discussion",
    "prereq": []
  },
  {
    "uid": "817223",
    "code": "HSEM2001H",
    "subject": "HSEM",
    "number": "2001",
    "honors": true,
    "writingIntensive": false,
    "name": "Childhood in African World Lit",
    "fullname": "Fragile Subjects: Portraits of Childhood in African World Literature",
    "info": "Childhood is a time of intense growth and dramatic change; of rapid physical, mental and emotional development. It is a time of discovering, experiencing, exploring; of exuberant curiosity and creativity. It is a state characterized by play and activity, innocence and wonder, surprise and delight. But childhood can also be a time of great confusion and uncertainty; of doubt, turmoil and anxiety. Through select pieces of short fiction, prose, essays and cinematic works, we will analyze the popularity of the coming-of-age genre (or Bildungsroman) as a primary mode of formative response within the African world literary tradition. We will consider how the autobiographical or semi-autobiographical story, told by a narrator who is growing up and becoming conscious of their body, their familial and wider social surroundings, their emotions, their very identity, dramatizes the cultural, political, and historical contexts in which it is set. Through our exploration of socialization as a thematic component of the Bildungsroman, we will examine how \"coming-of-age\" comes to represent something very different for boys and for girls.",
    "prereq": []
  },
  {
    "uid": "803185",
    "code": "HSEM2005H",
    "subject": "HSEM",
    "number": "2005",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar; emphasis on active learning; frequently interdisciplinary.prereq: Fr or soph honors",
    "prereq": []
  },
  {
    "uid": "810652",
    "code": "HSEM2006H",
    "subject": "HSEM",
    "number": "2006",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "803193",
    "code": "HSEM2007H",
    "subject": "HSEM",
    "number": "2007",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar; emphasis on active learning; frequently interdisciplinary.prereq: freshman or sophomore Honors student",
    "prereq": []
  },
  {
    "uid": "803350",
    "code": "HSEM2008H",
    "subject": "HSEM",
    "number": "2008",
    "honors": true,
    "writingIntensive": false,
    "name": "Roots Music in America",
    "fullname": "Roots Music in America: Music, Movies, and Unsolved Mysteries",
    "info": "This seminar focuses on roots music, the early twentieth century southern vernacular music that has inspired virtually every genre of American popular music over the last seven decades.  Everything from hip-hop to rock to jazz to bluegrass to Americana to folk to the singer-songwriter tradition and beyond has been profoundly shaped by the roots music well study this semester.  The course is divided into three parts.  In the first, well examine the meanings the music had for the people who made it and recorded it in the early decades of the twentieth century: African-American singers, blues musicians, and songsters who labored in the south under oppressive Jim Crow conditions and forged new musical traditions; and white Appalachian peoples who were moving from farm work to work in coal mines and textile mills and combining European musical traditions with those of African-Americans to create new sounds and new sonic landscapes.  In the second part of the course, well examine what the music means to us, to contemporary audiences, by analyzing recent films in which roots music is featured and its story told.  And in the third part of the course, well ask what the music has meant to scholars and analyze the ways in which, from the 1930s to the present, theyve traversed the south with notepads and recording devices to preserve the music and to learn about the musicians.  Here well dip into the vast repositories of primary source material now available online (field notes, recordings, photographs, interviews) and try to find new ways to understand and appreciate roots music for ourselves, and try to solve some of its mysteries through our own research.",
    "prereq": []
  },
  {
    "uid": "806493",
    "code": "HSEM2008V",
    "subject": "HSEM",
    "number": "2008",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning and writing; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "811488",
    "code": "HSEM2009H",
    "subject": "HSEM",
    "number": "2009",
    "honors": true,
    "writingIntensive": false,
    "name": "Contemporary Art and Politics",
    "fullname": "Contemporary Art and Politics: From Marcel Duchamp to Ai Weiwei",
    "info": "This course will discuss the subject matters and practices of major contemporary artists all over the world - including Marcel Duchamp, Joseph Beuys, Christo and Jeanne-Claude, Jeff Koons, Andy Warhol, Yoko Ono, Ilya Kabakov, Jasper Johns, Jean-Michel Basquiat, Ai Weiwei, Shirin Neshat, Marina Abramovic, Kara Walker, etc. ? whose creative work frequently intertwines with commentaries on contemporary politics. As a strategy of being, these contemporary artists seem to use art to engage their audiences in a dynamic dialogue concerning certain aspects of contemporary life. These and other artists want to interpret political reality in order to change it; that is, to bring about social and political transformation through aesthetic means. This course will provide an overview of the ideas, strategies, and work of the artists as a critical lens for viewing the changing cultural and political landscape of an increasingly technological and globalized world.This course will take a comparative studies approach to the development of contemporary art in its historical, its social and political contexts, the increasing influence of the Western art in Asia, Africa, and other parts of the world, and the cross-cultural communication customs and protocols of international art practice and art criticism. Methodologically, this course first aims at integrating four major disciplinary approaches in discussing art history from post-WWII to the present day: historical studies, sociological studies, psychoanalytic studies and cultural studies. Such an integrated approach will provide a framework and a reference point for us to describe and understand contemporary art in certain historical and political contexts.",
    "prereq": []
  },
  {
    "uid": "795408",
    "code": "HSEM2010H",
    "subject": "HSEM",
    "number": "2010",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by art faculty.prereq: [Fr or soph], honors student",
    "prereq": []
  },
  {
    "uid": "813974",
    "code": "HSEM2010V",
    "subject": "HSEM",
    "number": "2010",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Writing-based topics course. Emphasizes active learning. Interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "805301",
    "code": "HSEM2011H",
    "subject": "HSEM",
    "number": "2011",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "805302",
    "code": "HSEM2017H",
    "subject": "HSEM",
    "number": "2017",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "817380",
    "code": "HSEM2018H",
    "subject": "HSEM",
    "number": "2018",
    "honors": true,
    "writingIntensive": false,
    "name": "American Quest for Security",
    "fullname": "The American Quest for Security",
    "info": "For more than half a century, Americans have been concerned about security--national security as well as personal security. What do Americans mean when they talk about security? What are they worried about, and how do they try to keep themselves safe  and secure? The quest for national security has taken shape at the level of foreign policy and military engagement. At the same time, Americans have endeavored to achieve their own safety and security through political and personal efforts. This seminar examines the various ways that citizens have addressed the issue of security in their own lives, whether their fears have been justified, and whether their efforts have kept them safe. The goal is for students to understand the issue of security in a historical context, and to enable them to be effective citizens in a world that often feels dangerous.",
    "prereq": []
  },
  {
    "uid": "795807",
    "code": "HSEM2020H",
    "subject": "HSEM",
    "number": "2020",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by Communications faculty.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "801834",
    "code": "HSEM2025H",
    "subject": "HSEM",
    "number": "2025",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Frequently interdisciplinary. Associated with English department faculty.prereq: [Fr or soph], honors",
    "prereq": []
  },
  {
    "uid": "826067",
    "code": "HSEM2026V",
    "subject": "HSEM",
    "number": "2026",
    "honors": true,
    "writingIntensive": true,
    "name": "The Watershed Workshops",
    "fullname": "The Watershed Workshops",
    "info": "We are made of water. We are connected to each other by water. A watershed is a community of living being held together by the water that flows through them. In this class we explore many ways of knowing water, and we will experiment with ways of writing about ourselves, our relationships, and our communities. In this class you will learn how to write creatively in conversation with scientists, conservationists, cultural critics, and many other types of experts. ",
    "prereq": []
  },
  {
    "uid": "805303",
    "code": "HSEM2028H",
    "subject": "HSEM",
    "number": "2028",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "795808",
    "code": "HSEM2030H",
    "subject": "HSEM",
    "number": "2030",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topic specified in Course Guide.prereq: [Fr or soph with less than 60 cr], honors",
    "prereq": []
  },
  {
    "uid": "806773",
    "code": "HSEM2033H",
    "subject": "HSEM",
    "number": "2033",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics Course; emphasis on active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "809795",
    "code": "HSEM2037H",
    "subject": "HSEM",
    "number": "2037",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion. Active learning. Frequently interdisciplinary.prereq: Fr or soph honors student",
    "prereq": []
  },
  {
    "uid": "810261",
    "code": "HSEM2037V",
    "subject": "HSEM",
    "number": "2037",
    "honors": true,
    "writingIntensive": true,
    "name": "War on the Western Front",
    "fullname": "Under Fire: War on the Western Front: History, Literature, Ethics",
    "info": "The year 2014 was the centenary of the outbreak of the First World War, one of the two most devastating wars in European history. In the ensuing three years, there have been on-going commemorations of the major battles and events that marked the wars trajectory. The importance of the war to the psyche and memory of some of the participants was illustrated when, in 2009 Harry Patch, the last surviving veteran of WWI, broke his ninety-year silence on his wartime experiences to declare that the war had been legalized mass slaughter.  When he died shortly afterwards, he was given a funeral with full military honors, which was watched by millions on television. Why did this war happen when it did and why, nearly one hundred years later, did a veteran, about whom virtually nothing was known beyond his longevity, qualify for the honors that were usually afforded generals and statesmen? Three years earlier, in 2006, the 306 British soldiers shot for cowardice were pardoned.  What does this tell us about the way mentalities about war have changed? This course will look at the history, literature, and ethics of the war that was known in French as the Der de la Der (the last of the last) and which marked over three generations of Europeans creating a legacy that was incorporated into the national identity of those taking part.",
    "prereq": []
  },
  {
    "uid": "801835",
    "code": "HSEM2039H",
    "subject": "HSEM",
    "number": "2039",
    "honors": true,
    "writingIntensive": false,
    "name": "IAS Thursdays: Speaker Series",
    "fullname": "IAS Thursdays: Across the University & Beyond",
    "info": "In this seminar the best of the University's research and creative work is brought to you. Every Thursday afternoon, the Institute for Advanced Study offers a presentation, a lecture, discussion, and performances by leading scholars and artists from around the world and within the University. Seminar participants will attend the Thursdays at Four series and meet on Tuesdays to discuss the presentations, which will draw upon disciplines across the University. Students will do supplemental readings related to the presentations and talk with presenters as their schedules allow. This is the perfect seminar to introduce students to the rich variety of work done at the University.",
    "prereq": []
  },
  {
    "uid": "795809",
    "code": "HSEM2040H",
    "subject": "HSEM",
    "number": "2040",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors",
    "prereq": []
  },
  {
    "uid": "819018",
    "code": "HSEM2041H",
    "subject": "HSEM",
    "number": "2041",
    "honors": true,
    "writingIntensive": false,
    "name": "Greece and the Liberal Arts",
    "fullname": "Greece and the Eternal Questions of the Liberal Arts",
    "info": "Throughout history, communities have grappled with the same questions: how do we govern the community?  What stories do we tell about ourselves that give meaning to our lives?  How do we persuade each other?  How do we express our values and identity?  Are there roles proper to men and women?  Does life have meaning after life ends?  Ancient Greek society was a particularly intense location for considering those questions.  These are questions fundamental to the liberal arts and fundamental to being a contributing citizen of a democracy in a globalized world. This class examines and critiques the ancient Greek answers in order to gain perspective on how to answer those questions for our own lives and our community.",
    "prereq": []
  },
  {
    "uid": "819996",
    "code": "HSEM2042H",
    "subject": "HSEM",
    "number": "2042",
    "honors": true,
    "writingIntensive": false,
    "name": "Jewish Humor",
    "fullname": "Jewish Humor: Seriously Funny from Text to Stage to Screen",
    "info": "In the U.S. the comic world has been so dominated by Jewish writers and performers that the \"People of the Book\" have come to be known as the \"People of the Joke.\" A 2013 Pew Research poll showed that for American Jews, a sense of humor is essential to their Jewish identity, more important than ritual or the observance of traditional religious commandments. While surveying a broad range of humor in print, on stage, and in films along with classical Jewish texts including the Torah and Talmud, students will learn about the historical and cultural contexts that make such humor not only possible, but existentially necessary, a serious business indeed. And we'll accomplish all this while laughing hysterically. No prior knowledge of Jewish history and culture is required or assumed.",
    "prereq": []
  },
  {
    "uid": "817972",
    "code": "HSEM2043H",
    "subject": "HSEM",
    "number": "2043",
    "honors": true,
    "writingIntensive": false,
    "name": "Corporate Advocacy, Engagement",
    "fullname": "Finding the\"Corporate Soul\": Corporate advocacy, social responsibility, and community engagement",
    "info": "As the corporation has replaced government and the church as the dominant social institution in the industrialized world, the use of organizational advocacy as a means of persuasion has predictably increased.  One reason for this increase is that stakeholders expect and demand corporations act in accordance with social and cultural norms. Advocacy messages provide organizations with a tool for promoting change, forming attitudes, and furthering dialogue about substantive issues.  By engaging in advocacy, organizations enter into a public dialogue about issues that it views as significant in the realization of its goals and objectives.\n\nThis seminar seeks to answer questions such as: What contribution does organizational advocacy make to public dialogue? How does corporate advocacy represent the goals and needs of the organization and society? What are the social implications of organizational advocacy? Our goal is to understand organizational advocacy beyond a single issue, campaign, or corporation.  To achieve our goal, we will examine a variety of communication theories and international, national, and Minnesota-based campaigns.",
    "prereq": []
  },
  {
    "uid": "818932",
    "code": "HSEM2044H",
    "subject": "HSEM",
    "number": "2044",
    "honors": true,
    "writingIntensive": false,
    "name": "Journalism and Democracy in US",
    "fullname": "Enemies of the People? Journalism & Democracy in the United States",
    "info": "This seminar explores the evolution of journalism's role in the democratic process – from the nation's founding through today’s contentious relationship between President Trump and the press. Students will examine critical questions confronting journalism and democracy in the digital age: the growth of partisan news and decline in original reporting; the role of social media in facilitating propaganda and “fake news”; and concerns about over-commercialization. At the same time, students will place these issues in historical context and consider a number of normative and critical theories concerning journalism’s proper role in our civic life. At a time when trust in both journalism and government are at an all-time low, this seminar explores how we arrived at this point and where we might be heading. ",
    "prereq": []
  },
  {
    "uid": "801845",
    "code": "HSEM2045H",
    "subject": "HSEM",
    "number": "2045",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "802658",
    "code": "HSEM2046H",
    "subject": "HSEM",
    "number": "2046",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "816814",
    "code": "HSEM2046V",
    "subject": "HSEM",
    "number": "2046",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Linguistics and Biology",
    "fullname": "Linguistics and Biology",
    "info": "Connections between linguistics (the scientific study of human language) and biology (the scientific study of life and living forms) have a long history. Most contemporary linguists view language as part of human cognition, rooted in biologically determined predisposition to acquire language and constraints on the properties of what can be acquired. Before the Chomskyan revolution in the early 1960s, the connection was largely restricted to anatomical properties of the human vocal tract involved in articulation of speech sounds and the role of evolution of the vocal tract in making human language possible. Other connections included metaphorical borrowing of terms from biology, such as genetic relationships among related languages grouped into language families, whose members shared the same ancestor language. More recently, the focus has turned to the biological basis of human language, the existence of language genes and connections between evolution of language and evolution of the human brain. There has also been some influence of linguistic methodology on the field of biology, with researchers proposing similarities between generative models of linguistic codes (grammars) and the genetic code. This course will examine the relationship between linguistics and biology, and how it reflects development of the field of linguistics and cross-disciplinary influences in general.",
    "prereq": []
  },
  {
    "uid": "811476",
    "code": "HSEM2047H",
    "subject": "HSEM",
    "number": "2047",
    "honors": true,
    "writingIntensive": false,
    "name": "All About Music",
    "fullname": "All About Music: Its Meaning, Reality, Communication, and Embodiment",
    "info": "The great philosopher of life Friedrich Nietzsche rightly claims that \"without music, life would be a mistake.\" This does not mean that life is automatically perfect with music. This seminar deals with exactly this problem: What is music doing to us? Why do we listen to it? And how  that? What is its meaning in our lives, why does it matter, which realities does it touch, how can it be communicated? In what way is it distributed between intellect and emotions? And why do we go to concerts, since electronic media and the internet provide such an easy access? The answers will be approached via intensive listening to all kinds of music from different cultures and epochs as well as through critical, very open discussions with the students. The instructor being highly sensitive to non-authoritarian music cultures, he may provide a thoroughly dynamic and flexible access to music.",
    "prereq": []
  },
  {
    "uid": "815936",
    "code": "HSEM2048H",
    "subject": "HSEM",
    "number": "2048",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by School of Music faculty.prereq: [Fr or Soph] honors student",
    "prereq": []
  },
  {
    "uid": "811728",
    "code": "HSEM2049H",
    "subject": "HSEM",
    "number": "2049",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary. Taught by philosophy faculty.prereq: Fr or soph honors student",
    "prereq": []
  },
  {
    "uid": "795810",
    "code": "HSEM2050H",
    "subject": "HSEM",
    "number": "2050",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics Course.",
    "prereq": []
  },
  {
    "uid": "801836",
    "code": "HSEM2051H",
    "subject": "HSEM",
    "number": "2051",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar. Emphasis on active learning; frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "801837",
    "code": "HSEM2053H",
    "subject": "HSEM",
    "number": "2053",
    "honors": true,
    "writingIntensive": false,
    "name": "Psych of Paranormal Phenomena",
    "fullname": "The Psychology of Paranormal Phenomena",
    "info": "Research has shown that most Americans hold one or more supernatural, paranormal, or pseudoscientific beliefs. These include beliefs in mind reading, fortune telling, psychokinesis, remote viewing, therapeutic touch, out-of-body experiences, alien abduction, and cryptozoology (Bigfoot, the Loch Ness Monster, etc.). This course has two goals: The first is to introduce students to critical thinking and behavioral research methods. The second is to critically evaluate the evidence for a variety of supernatural, paranormal and pseudoscientific claims. Students will design and carry out their own experimental tests of these claims. The course will also include a guest lecture and demonstration by a local psychic. Reading per week: 40 Pages. Three written papers (3-5 pages each), one group presentation, and 4 quizzes. ",
    "prereq": []
  },
  {
    "uid": "804716",
    "code": "HSEM2054H",
    "subject": "HSEM",
    "number": "2054",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar. Emphasizes active learning. Frequently interdisciplinary.prereq: [Fr or soph] honors",
    "prereq": []
  },
  {
    "uid": "817959",
    "code": "HSEM2055V",
    "subject": "HSEM",
    "number": "2055",
    "honors": true,
    "writingIntensive": true,
    "name": "Biology and Society: Evolution",
    "fullname": "Biology and Society: How Evolution Shapes Our Lives",
    "info": "Evolution is a contested idea in our society. However, in a very real sense, evolution shapes our lives. In order to understand both the controversy surrounding evolution and its impact on individuals and society, this course explores a variety of themes at the intersection of biology and philosophy and is co-taught by a biologist and philosopher of biology. We will investigate various dimensions of human evolution and applications of different evolutionary ideas to understanding ourselves with a special focus on health and disease. Then we turn to how humans alter or control the evolutionary process through domestication, conservation of species, and climate change. Finally, we look at the intersection of evolution and religion in the public sphere, the evolution of ideas about the human species (including questions about biological race realism), and how both culture and language evolve. We close the course by reflecting on what the future of human evolution might look like.",
    "prereq": []
  },
  {
    "uid": "795811",
    "code": "HSEM2060H",
    "subject": "HSEM",
    "number": "2060",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topic specified in Course Guide.prereq: [Fr or soph with less than 60 cr], honors",
    "prereq": []
  },
  {
    "uid": "817231",
    "code": "HSEM2061H",
    "subject": "HSEM",
    "number": "2061",
    "honors": true,
    "writingIntensive": false,
    "name": "Statistics and Data Science",
    "fullname": "Statistics and Data Science for Everyone",
    "info": "This is not a traditional statistics course. We concentrate on the important problems that can be addressed using data: learning about cause and effect, prediction, converting everyday information to learn about important problems, data visualization, and much more.  Many of these topics and ideas are usually found only in more advanced courses. You will learn how to do statistical computing using the widely used and free R software, using the RStudio interface that encourages reproducible and defensible research and analysis.  Most assignments will be done in groups, and oral and written communication of work is stressed. If you only plan to take one statistics course, this is it, as it covers methods and ideas needed for a literate and numerate person in the 21st century. The only prerequisite for this course is an open mind and comfort with using numerical information. Students with a prior statistics course, such as AP statistics in high school, are invited, as the overlap will be minimal. Most student work in this course will be in groups with oral and written presentations.",
    "prereq": []
  },
  {
    "uid": "815937",
    "code": "HSEM2063H",
    "subject": "HSEM",
    "number": "2063",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by dance faculty.",
    "prereq": []
  },
  {
    "uid": "818280",
    "code": "HSEM2064H",
    "subject": "HSEM",
    "number": "2064",
    "honors": true,
    "writingIntensive": false,
    "name": "Gendering the Digital Body",
    "fullname": "Sex, Gender, and the Digital Body",
    "info": "Our online lives are marked by different kinds of gender performance: social media selfies, texting, gaming, and YouTube vlogging, are among the digital genres in which we embody personas that have a gendered component. This course examines the relationship between digital technology and gender embodiment, to trace how concepts of gender evolve across platforms. Drawing examples from Egypt, Iran, the United States, India, and Europe, we see how digital platforms and networks build provide spaces for performance in different cultural contexts. ",
    "prereq": []
  },
  {
    "uid": "818825",
    "code": "HSEM2065H",
    "subject": "HSEM",
    "number": "2065",
    "honors": true,
    "writingIntensive": false,
    "name": "Making Museums",
    "fullname": "Making Museums",
    "info": "Museums are a significant, international growth industry. Where museums of the past sought simply to educate their visitors, today’s museums also promise to entertain, move, and provoke them, to express identities, unsettle certainties, question histories, and consolidate communities.  How do museums follow through on that promise? What techniques do curators use to shape visitor experience? And when do museums’ ambitions to create culture also court controversy? ",
    "prereq": []
  },
  {
    "uid": "816014",
    "code": "HSEM2067H",
    "subject": "HSEM",
    "number": "2067",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by writing studies faculty.",
    "prereq": []
  },
  {
    "uid": "816622",
    "code": "HSEM2067V",
    "subject": "HSEM",
    "number": "2067",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by Writing Studies faculty.prereq: [Fr or Soph]",
    "prereq": []
  },
  {
    "uid": "818270",
    "code": "HSEM2069H",
    "subject": "HSEM",
    "number": "2069",
    "honors": true,
    "writingIntensive": false,
    "name": "Film as Art: Global Practices",
    "fullname": "Film as Art: Global Practices",
    "info": "“Film as Art” offers a selective overview of the most influential Non-Anglo-American “film authors” in post WWII art film history: Federico Fellini, Luchinothe Visconti, Roberto Rossellini, Michelangelo Antonioni, Vittorio De Sica, Pier Paolo Pasolini, Bernardo Bertolucci, Giuseppe Tornatore (Italy); François Truffaut, Jean-Luc Godard, Alain Resnais, Claude Chabrol, Costa-Gavras (France); Ingmar Bergman (Sweden); Rainer Werner Fassbinder, Werner Herzog, Volker Schlöndorff, Wim Wenders (Germany); Andrei Tarkovsky (Russia); Luis Buñuel, Pedro Almodovar (Spain); Krzysztof Kieslowski (Poland); Theodoros Angelopoulos (Greece); Abbas Kiarostami (Iran); Yasujirō Ozu, Shindō Kaneto, Akira Kurosawa (Japan); and Hou Hsiao-hsien (Taiwan).Throughout the course, we will learn the definitions of “art film” and “film author”, filmmaking as high art practice, major art film movements in the world: Italian New-Realism, French New Wave, New German Cinema, New Taiwanese Cinema, etc. and their influence on the American filmmaking. We will develop a historical appreciation of art film based on cinematic traditions contained within narrative, documentary, and experimental forms, and acquire a critical, technical, and aesthetic vocabulary relating to particular filmmakers. In particular, we will examine and evaluate the importance of genre and the legacy of individual “auteurs” throughout the history of post-war cinema. We will study the individuality of the filmmakers and their contribution to our understandings of politics, society, and human relationship.",
    "prereq": []
  },
  {
    "uid": "795812",
    "code": "HSEM2070H",
    "subject": "HSEM",
    "number": "2070",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topic specified in Course Guide.prereq: [Fr or soph with less than 60 cr], honors",
    "prereq": []
  },
  {
    "uid": "826522",
    "code": "HSEM2073H",
    "subject": "HSEM",
    "number": "2073",
    "honors": true,
    "writingIntensive": false,
    "name": "Radical Environmentalism in US",
    "fullname": "Radical Environmentalism in the United States",
    "info": "Our current climate crisis calls for a rethinking of the way humans interact with the environment, but such efforts are not new.  This course examines how different groups of people understood and responded to environmental degradation in North America, from the l8th century through the 21st.  The focus will be on those who made urgent calls for a change in human behavior toward nature, from Indigenous peoples past and present to ecocentrist groups like Greenpeace and Earth First!  Topics include protests against ecological damage and loss, experiments in minimalism, the call for wilderness preservation and national parks, environmental racism and the environmental justice movement, and various forms of environmental activism.  Students will develop historically informed positions about an array of ecological experiments, activists, organizations, viewpoints that preceded and shaped current forms of environmentalism.",
    "prereq": []
  },
  {
    "uid": "826075",
    "code": "HSEM2074H",
    "subject": "HSEM",
    "number": "2074",
    "honors": true,
    "writingIntensive": false,
    "name": "Tabletop Philosophy",
    "fullname": "Tabletop Philosophy",
    "info": "Role-playing games are strange: Like a play, they ask you to inhabit the mind and spirit of another person. But, like a game, they also set goals and tasks for you. And, they are centered around the co-creation of a world and its story, like, well.. like nothing else. In this class, we’ll study role-playing games, not only as games, but also as ways of learning about ourselves and the world we (in fact!) inhabit. Along the way, we will play these games, with an eye toward answering our many questions.",
    "prereq": []
  },
  {
    "uid": "796161",
    "code": "HSEM2080H",
    "subject": "HSEM",
    "number": "2080",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Interdisciplinary course. Emphasizes active learning.",
    "prereq": []
  },
  {
    "uid": "818141",
    "code": "HSEM2081V",
    "subject": "HSEM",
    "number": "2081",
    "honors": true,
    "writingIntensive": true,
    "name": "Modernism in Mexico",
    "fullname": "Modernism in Mexico",
    "info": "'The Mexican Revolution' transformed the country's politics and society. Developments in art and architecture in Mexico during the first half of the twentieth century were equally dramatic. This course will explore the artists and works of art at the heart of this extraordinary cultural achievement. Among the figures to be studied will be the painters Diego Rivera and Frida Kahlo, the architect Luis Barragan, the filmmakers Emilio Fernandez and Luis Bunuel, and the photographers Manuel Alvarez Bravo and Tina Modotti. On a  trip to Mexico City during Spring Break, we will be able to view in person many of the most important creations of Mexican modernism, including not only those in museums, but murals and works of architecture. We will also visit such special sites as Kahlo's famous Casa Azul (Blue House) and, for historical background, the great Museum of Anthropology and the pre-Columbian city of Teotihuacan.",
    "prereq": []
  },
  {
    "uid": "796163",
    "code": "HSEM2090H",
    "subject": "HSEM",
    "number": "2090",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Interdisciplinary course. Emphsizes active learing.",
    "prereq": []
  },
  {
    "uid": "817382",
    "code": "HSEM2091V",
    "subject": "HSEM",
    "number": "2091",
    "honors": true,
    "writingIntensive": true,
    "name": "Roots Music in America",
    "fullname": "Roots Music in America: Music, Movies, and Mysteries",
    "info": "This seminar focuses on \"roots music,\" the early twentieth century southern vernacular music that has inspired virtually every genre of American popular music over the last seven decades. Everything from hip-hop to rock to jazz to bluegrass to \"Americana\" to folk to the singer-songwriter tradition and beyond has been profoundly shaped by the roots music we'll study this semester.The course is divided into three parts. In the first, we'll examine the meanings the music had for the people who made it and recorded it in the early decades of the twentieth century: African-American singers, blues musicians, and 'songsters' who labored in the south under oppressive Jim Crow conditions and forged new musical traditions; and white Appalachian peoples who were moving from farm work to work in coal mines and textile mills and combining European musical traditions with those of African-Americans to create new sounds and new sonic landscapes. In the second part of the course, we'll examine what the music means to us, to contemporary audiences, by analyzing recent films in which roots music is featured and its story told. And in the third part of the course, we'll ask what the music has meant to scholars and analyze the ways in which, from the 1930s to the present, they've traversed the south with notepads and recording devices to preserve the music and to learn about the musicians. Here we'll dip into the vast repositories of primary source material now available online (field notes, recordings, photographs, interviews) and try to find new ways to understand and appreciate roots music for ourselves, and try to solve some of its mysteries.",
    "prereq": []
  },
  {
    "uid": "803351",
    "code": "HSEM2101H",
    "subject": "HSEM",
    "number": "2101",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "803186",
    "code": "HSEM2103H",
    "subject": "HSEM",
    "number": "2103",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar; emphasis on active learning; frequently interdisciplinary.prereq: Fr or soph honors",
    "prereq": []
  },
  {
    "uid": "811329",
    "code": "HSEM2105H",
    "subject": "HSEM",
    "number": "2105",
    "honors": true,
    "writingIntensive": false,
    "name": "Tropical Forests",
    "fullname": "Tropical Forests: Conservation, Carbon, and Conflict",
    "info": "Dr. Jennifer Powers is an associate professor in the Departments of Ecology, Evolution and Behavior and Plant and Microbial Biology at the University of Minnesota. She received her PhD in Biology from Duke University in 2001, and did postdoctoral work at SUNY-Stony Brook and the University of Minnesota.  She is broadly trained in ecosystems ecology, biogeochemistry, and plant ecology, and has worked in tropical forests in Central and South America for over 22 years. The long-term goal of her research program is to understand how biophysical factors and human activities shape biodiversity and ecosystem functioning of tropical forests.  Her current projects include a long-term study of how changes in land use such as deforestation and forest regeneration affect the balance of carbon on the land and in the atmosphere in Costa Rica, and a study of the effects of climate change on forest dynamics in Costa Rica, Colombia, Mexico, and Puerto Rico.",
    "prereq": []
  },
  {
    "uid": "811740",
    "code": "HSEM2106H",
    "subject": "HSEM",
    "number": "2106",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Fr or soph honors student",
    "prereq": []
  },
  {
    "uid": "797485",
    "code": "HSEM2110V",
    "subject": "HSEM",
    "number": "2110",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics course, often interdisciplinary.prereq: [Fr or soph], honors",
    "prereq": []
  },
  {
    "uid": "797925",
    "code": "HSEM2120V",
    "subject": "HSEM",
    "number": "2120",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar, writing intensive.",
    "prereq": []
  },
  {
    "uid": "797926",
    "code": "HSEM2130V",
    "subject": "HSEM",
    "number": "2130",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar, writing intensive.prereq: Honors, [fr or soph]",
    "prereq": []
  },
  {
    "uid": "801838",
    "code": "HSEM2205H",
    "subject": "HSEM",
    "number": "2205",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary. Taught by Design faculty.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "816623",
    "code": "HSEM2205V",
    "subject": "HSEM",
    "number": "2205",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary. Taught by Design faculty.prereq: [Fr or soph]",
    "prereq": []
  },
  {
    "uid": "805304",
    "code": "HSEM2206H",
    "subject": "HSEM",
    "number": "2206",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "817930",
    "code": "HSEM2207H",
    "subject": "HSEM",
    "number": "2207",
    "honors": true,
    "writingIntensive": false,
    "name": "Visual and Critical Thinking",
    "fullname": "Visual and Critical Thinking",
    "info": "This course will examine two forms of thought processes, Visual Thinking and Critical Thinking, and integrate their use and development. Visual Thinking strategies focus on the use of evidentiary reasoning. Based on structured series of exercises of observation and fine art, it develops the ability to examine art, objects, and environments. Critical thinking will focus on the organization of the mind for critical thinking and examines the structures and assumptions we make in our everyday lives. The class will focus on practice, not on lecture.",
    "prereq": []
  },
  {
    "uid": "808337",
    "code": "HSEM2208H",
    "subject": "HSEM",
    "number": "2208",
    "honors": true,
    "writingIntensive": false,
    "name": "Housing Matters",
    "fullname": "Housing Matters",
    "info": "Housing directly affects our physical and mental health, children's educational attainment, our economic opportunities, our transportation patterns and dependencies, and the environment. However, not all people are able to achieve the same levels of well-being because of disparities due to race, ethnicity, and class as they seek to obtain stable, secure, and affordable housing in supportive neighborhoods and communities. We will explore issues of power and privilege that contribute to those disparities. Public policy at the local and national levels will be examined as it both creates and minimizes social inequities in housing.",
    "prereq": []
  },
  {
    "uid": "826792",
    "code": "HSEM2231H",
    "subject": "HSEM",
    "number": "2231",
    "honors": true,
    "writingIntensive": false,
    "name": "How Green is Green Energy?",
    "fullname": "How ‘Green’ is ‘Green’ Energy: Environmental Protection vs Sustainable Energy Initiatives",
    "info": "Northern Minnesota has long been an area of interest for both its natural beauty and its mineral resources. Prior to colonization, it was home to the Anishinaabeg. Today, northern Minnesota is home to a diverse community and environment that includes Indigenous Nations, a thriving tourist industry, the Boundary Waters Canoe Area, and mining companies. Currently, there is intense debate around the establishment of new mines in northern Minnesota to exploit the metals necessary for the manufacturing of technology, specifically the metals needed to sustain green energy initiatives. This seminar will address the question \"How green is green energy\" by exploring the delicate balance among resource availability, societal energy needs, ethical land management, and ultimately climate change and long-term sustainability. To gain perspective on this complicated balance we will first learn about the Earth System, climate change, and energy resources. We will then review the geologic processes that formed mineral resources in northern Minnesota and how the exploitation of these resources has impacted local cultures and economies. The last part of the semester will focus on the current debate about mining in northern Minnesota and the broader framework of sustainable energy. Through readings and discussions, you will gain an appreciation for the multidisciplinary and multicultural perspectives related to human interactions with our environment, energy needs, and the importance of effective communication.",
    "prereq": []
  },
  {
    "uid": "826767",
    "code": "HSEM2232H",
    "subject": "HSEM",
    "number": "2232",
    "honors": true,
    "writingIntensive": false,
    "name": "Improvisation & Mental Health",
    "fullname": "Improvisation and Mental Health",
    "info": "The ability to tolerate ambiguity is essential to mental health. In this course, students will explore this premise by learning the fundamentals of improvisation and discovering how these skills can enrich their lives and make them more flexible, effective, and empathic, both personally and professionally.  Through dynamic exercises and personal feedback, students will understand how an improvisational mindset can deepen communication skills, reframe negative self-talk, reawaken a sense of play, and strengthen awareness of mind-body connections. At the same time, students will reflect on our experience as a group, one that is guided by improvisational tenets. Our time in class will be primarily experiential, and students will be given the chance to give presentations about various psychological topics—cognitive schemas, positive psychology, mindfulness and its benefits, group development, creativity and cognition, play theory and polyvagal theory, and ethical development—as well as read studies about improvisation and the ways it can guide psychological growth.",
    "prereq": []
  },
  {
    "uid": "826782",
    "code": "HSEM2233H",
    "subject": "HSEM",
    "number": "2233",
    "honors": true,
    "writingIntensive": false,
    "name": "Histories of Student Activism",
    "fullname": "The Histories of Student Activism",
    "info": "College students do a lot of things. They study. They are part of clubs, sports teams, and organizations. They work. They build lives outside the institution. They also protest and look for ways to change the world. This is a course that explores the history of student activism. Students have taken part in some of the most important social movements in the world, most obviously the civil rights movement and protests against wars. Students have also turned their attention inward to demand that the university change or expand in one way or another. In all of these ways, students are engaging in civic life and thinking through the ethics of many public problems. Through a focus on the United States and particular attention paid to the University of Minnesota itself, students will think deeply about questions of activism and reflect on the actions of their direct historical counterparts. We will examine how various student groups debated ethics and made decisions about how to engage with the broader body politic. In this interactive honors seminar we will be learning and discussing how world events shaped college students and how college students shaped the world around them.",
    "prereq": []
  },
  {
    "uid": "818826",
    "code": "HSEM2242H",
    "subject": "HSEM",
    "number": "2242",
    "honors": true,
    "writingIntensive": false,
    "name": "Einstein's Universe",
    "fullname": "Einstein's Universe",
    "info": "In this seminar, we examine the life and work of Albert Einstein (1879–1955). I will have you read the biography of Einstein by Walter Isaacson and watch the season of the TV series Genius based on it. In this course, you will explore several topics covered in the book and the TV series in greater depth. Class time will be divided about equally between discussing various aspects of Einstein’s personal life and learning about Einstein’s fundamental contributions to physics. In the former category, we will look at, for instance, his attitude toward Judaism and Zionism, his view of God, his pacifism, and the relationship with his first wife, fellow student Mileva Maric. In the latter category, the goal is to provide you with a thorough understanding of the basic ideas behind special relativity, general relativity, and quantum mechanics. To achieve this goal we will only need a modest amount of mathematics, which I will develop without presupposing more than the most basic high-school algebra and geometry. Since this material, however, calls into question deeply entrenched ideas about space and time and the nature of physical reality, you should be prepared to challenge yourself, conceptually and mathematically. Your reward will be a much deeper appreciation than you may have thought possible for a non-physics/non-math major of some famous parts of Einstein’s science, including time dilation, the twin paradox, E=mc2, Minkowski space-time, curved space-time, black holes, gravitational waves, the expanding universe, cosmological constant, and quantum entanglement. By the end of the course, you should have a solid understanding of some of Einstein’s most revolutionary ideas, of how he arrived at them, at what personal price, and in what broader socio-political and cultural context.",
    "prereq": []
  },
  {
    "uid": "813643",
    "code": "HSEM2307H",
    "subject": "HSEM",
    "number": "2307",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary. Associated with Child Dev faculty.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "801839",
    "code": "HSEM2313H",
    "subject": "HSEM",
    "number": "2313",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics course, frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "826101",
    "code": "HSEM2318H",
    "subject": "HSEM",
    "number": "2318",
    "honors": true,
    "writingIntensive": false,
    "name": "Lies Deception and Persuasion",
    "fullname": "Lies, Deception, and Persuasion in the Modern World",
    "info": "Deception and persuasion are important facets of human communication. This honors seminar will draw on theories of deceit and persuasion to answer questions such as: Why do we lie? Is it easy to tell when someone is lying? How do we use deception to influence others? Is it always wrong to lie? And how has the internet and rise of social media changed the landscape and political impact of persuasion and lies? This course will challenge students to reflect on the ethical boundaries of lying and social influence. We will examine lies and persuasion in politics, the consumer marketplace, and in online environments. We will also study the impact of mis- and disinformation campaigns on society and learn strategies to resist deceptive persuasion to become more thoughtful consumers and responsible citizens.",
    "prereq": []
  },
  {
    "uid": "826514",
    "code": "HSEM2321H",
    "subject": "HSEM",
    "number": "2321",
    "honors": true,
    "writingIntensive": false,
    "name": "What is College For?",
    "fullname": "What is College For? Exploring the Purpose and Value of American Higher Education",
    "info": "Recent poll data suggests that many Americans are questioning the value of higher education. For example, 2/3 of those surveyed stated that colleges are stuck in the past and not meeting the needs of today’s students. What is the purpose of college? Should a 4-year degree be accessible to all? Does a college education lead to attaining the “good life?” In this interactive honors seminar, we will address these questions and more. Students will have the opportunity to examine their own objectives as it relates to pursuing higher education and explore important issues impacting higher education (e.g., student debt, access, and admissions). Students will engage in regular reading, writing, and discussion around critical issues in higher education. Small group interaction, presentations, media analysis (e.g., podcasts, films), and ongoing reflection will be features of this seminar. The course will be organized around three main units, each guided by a specific question that we will aim to address. Unit 1 will address the question “What is the history of higher education, and what are the reasons for pursuing a degree? Unit II explores: “What are key current topics in higher education that deserve exploration?” As a part of this unit, we will discuss trends and issues that address the mission of higher education, especially post-pandemic. Unit III will examine the question, “How do your own experiences in college align with your own personal and professional objectives?”",
    "prereq": []
  },
  {
    "uid": "813644",
    "code": "HSEM2325H",
    "subject": "HSEM",
    "number": "2325",
    "honors": true,
    "writingIntensive": false,
    "name": "Fantasy: Ghastly, Wicked Intro",
    "fullname": "Fantasy: A Ghastly, Wicked Introduction",
    "info": "This seminar is a ghastly wicked ride through main genres and formats of fantasy literature for adolescents and young adults. Fantasy is explored as a literature of possibilities and empowerment. The focus is on eight principal genres and on the role of fantasy in nurturing moral imagination, creative thinking, and the human potential.",
    "prereq": []
  },
  {
    "uid": "816252",
    "code": "HSEM2326H",
    "subject": "HSEM",
    "number": "2326",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by C&I faculty.prereq: [Fr or Soph] honors student",
    "prereq": []
  },
  {
    "uid": "816632",
    "code": "HSEM2326V",
    "subject": "HSEM",
    "number": "2326",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course, writing focus; taught by C&I faculty.",
    "prereq": []
  },
  {
    "uid": "808203",
    "code": "HSEM2413H",
    "subject": "HSEM",
    "number": "2413",
    "honors": true,
    "writingIntensive": false,
    "name": "Insights, Ideas, Innovation",
    "fullname": "Insights, Ideas, and Innovation",
    "info": "This course is designed to introduce students to techniques for discovering everyday problems and fashioning potential solutions to those problems.  Because the course material deals with ideas and idea generation, it is designed to be helpful to many future careers and callings by unlocking individual creative thinking skills.  During the semester we will explore the genesis of ideas and the relationship between deep insight, empathy, consumer problems, ideas, and innovation.  Specific topics to be covered during the semester include the role of insights, ethnography, and discovery techniques; individual and group creativity; the creative process and where ideas come from; innovation and the value thereof; and effective communication of ideas.This course seeks to provide students with the skills, tools, and mindsets to enable them to discover other people’s problems from which potential solutions might be built.  These solutions include services, products, and potential businesses. ",
    "prereq": []
  },
  {
    "uid": "805305",
    "code": "HSEM2414H",
    "subject": "HSEM",
    "number": "2414",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "809804",
    "code": "HSEM2503H",
    "subject": "HSEM",
    "number": "2503",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning/writing. Frequently interdisciplinary.prereq: Fr or soph honors student",
    "prereq": []
  },
  {
    "uid": "819883",
    "code": "HSEM2512H",
    "subject": "HSEM",
    "number": "2512",
    "honors": true,
    "writingIntensive": false,
    "name": "Mathematics of Elections",
    "fullname": "The Mathematics of Elections and Social Choice",
    "info": "This course will focus on the mathematics behind Voting Theory, apportionment, and fair division.  Whether it is choosing a student association representative or ranking NCAA sports teams, there are a variety of selection methods that could be employed, but which is best?  This course will use mathematics to study the strengths and weaknesses of different ways to tally votes or hold an election. Voting methods to be studied include single ballot vs instant-runoff (also known as a ranked-choice), as well as point-based rankings.This course will also explore the mathematics behind apportionment (and how it can lead to paradoxes), and how mathematics is used to evaluate the fairness of congressional districts in the context of gerrymandering. Finally, we will investigate ways to measure power differences between coalitions, and how to approach problems of fair-division like rent-sharing.",
    "prereq": []
  },
  {
    "uid": "808204",
    "code": "HSEM2513H",
    "subject": "HSEM",
    "number": "2513",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Fr or soph honors",
    "prereq": []
  },
  {
    "uid": "813645",
    "code": "HSEM2514H",
    "subject": "HSEM",
    "number": "2514",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Fr or soph]honors student",
    "prereq": []
  },
  {
    "uid": "811330",
    "code": "HSEM2515H",
    "subject": "HSEM",
    "number": "2515",
    "honors": true,
    "writingIntensive": false,
    "name": "Local Environmental Solutions",
    "fullname": "Experiencing Local Environmental Solutions",
    "info": "This is a topical, field-trip-based course. This seminar will address some of the solutions to the environmental problems that affect our society by examining the science and by experiencing the solutions that are used on campus or in the neighboring community. Each week will focus on a solution to a different environmental issue (see schedule below). We will visit the places designed as environmental solutions, hear from the experts, and discuss the engineering and human aspects of these solutions. We will go to areas of campus that you would normally not visit or be able to visit. The field-trip destinations are accessible by campus bus, city bus, or train. The class will involve weekly reading and writing assignments. There will also be a semester-long, hands-on project to devise a realistic, potential solution to an environmental issue.",
    "prereq": []
  },
  {
    "uid": "813975",
    "code": "HSEM2516H",
    "subject": "HSEM",
    "number": "2516",
    "honors": true,
    "writingIntensive": false,
    "name": "Chemicals in the Environment",
    "fullname": "Slow Death by Rubber Duck: Chemicals We Use and Their Effects on the Environment and Us",
    "info": "We use chemicals every day. We bathe in chemicals. We apply chemicals to our lawn. Chemicals are sprayed to control insects. While chemicals are an important part of modern life, these chemicals wind up in the environment and in our bodies. This seminar will examine how our use of chemicals drives our exposures and ultimately, where these chemicals wind up in the environment and what their impacts are. This seminar is designed for you to look at how you use chemicals in your daily life and how this influences your exposure to chemicals, environmental releases of chemicals, and the impact of chemicals on humans and the environment.",
    "prereq": []
  },
  {
    "uid": "801840",
    "code": "HSEM2519H",
    "subject": "HSEM",
    "number": "2519",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "817221",
    "code": "HSEM2520H",
    "subject": "HSEM",
    "number": "2520",
    "honors": true,
    "writingIntensive": false,
    "name": "Vis and VR for Social Justice",
    "fullname": "Visualization & Virtual Reality for Social Justice",
    "info": "From interactive web-based storytelling at the New York Times to analyzing climate change data in virtual reality, data visualization - computer-based visual depiction and analysis of data - is changing the way that we understand and communicate about the world we live in. This seminar encourages aspiring activists, artists, poets, journalists, engineers, doctors, scientists, and other creative thinkers to come together to study: (1) How information is communicated visually; (2) how to use computers to create effective data visualizations; and (3) how to apply visualization to further social justice and to understand data related to social justice. In this way, the course aims to provide a visually oriented introductory experience with computer science that is applied from day one to real-world problems of critical importance to today's society. Students are expected to bring their own ideas, causes, and (optionally) datasets to the seminar. Students will study and have opportunities to create visualizations addressing gender and racial inequality, health equity, climate change, gun violence, gender identity, and more. Readings will cover a mix of current scholarly perspectives on these topics as well as technical information, such as computer programming techniques for using color, form, and metaphor to depict data using processing.org, a visual programming environment originally designed for artists. Exciting current research on virtual reality will also be discussed, for example, recent studies on virtual embodiment that aim to foster empathy for people of diverse races and genders.",
    "prereq": []
  },
  {
    "uid": "815938",
    "code": "HSEM2521H",
    "subject": "HSEM",
    "number": "2521",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by Electrical and Computer Engineering faculty.[Fr or Soph] honors student",
    "prereq": []
  },
  {
    "uid": "819858",
    "code": "HSEM2528H",
    "subject": "HSEM",
    "number": "2528",
    "honors": true,
    "writingIntensive": false,
    "name": "The Quantum Century",
    "fullname": "The Quantum Century",
    "info": "This seminar has a STEM and a humanities component. The STEM component consists of a rigorous but algebra-based introduction to the basic formalism of quantum mechanics. This formalism is much easier to learn than most of its applications in physics (which typically require a fair amount of calculus). And mastering this basic formalism suffices to understand some of the key ideas behind such exciting recent applications as quantum computing and quantum cryptography (which will also be addressed in this seminar). The humanities component consists of a critical review of the history of the debates over the foundations of quantum mechanics from the late 1920s to the present. The seminar thus has two main objectives. The first is to introduce students with a wide variety of backgrounds to an exciting area at the intersection of physics, mathematics, and computer science challenging our understanding of the physical world but at the same time suggesting new ways of harnessing nature for our purposes. The second is to combat simplistic views of \"The Scientific Method\" by tracing in a concrete and engaging example how science is actually done—warts and all.",
    "prereq": []
  },
  {
    "uid": "805794",
    "code": "HSEM2529H",
    "subject": "HSEM",
    "number": "2529",
    "honors": true,
    "writingIntensive": false,
    "name": "Explanation and Evidence",
    "fullname": "Explanation and Evidence in Crime Fiction and in Science",
    "info": "Sherlock Holmes, in solving his cases, is relying on a pattern of reasoning known as Inference to the Best Explanation (acronym: IBE). Holmes’s explanation of how some crime was committed tends to be so convincing that it counts as evidence that it was actually committed that way. Although our use of it is seldom as clever as Holmes’s, we rely on IBE all the time in everyday life. So do scientists. In science, however, IBE tends to be less reliable. That a theory explains a range of phenomena does not make that theory true. In other words, we cannot simply take a theory’s explanatory power as evidence for it. Yet, scientists tend to put great emphasis on their theories’ explanatory power if they want to convince others of it. Which raises the question: What exactly is the relation between explanation and evidence in science? In this seminar, we will examine this relation, using  examples from everyday life, crime fiction and the history of science (involving such luminaries as Copernicus, Newton, Darwin and Einstein). To improve our understanding of IBE we will contrast it with a probabilistic account of evaluating evidence known as Bayesianism.",
    "prereq": []
  },
  {
    "uid": "804268",
    "code": "HSEM2530H",
    "subject": "HSEM",
    "number": "2530",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "816253",
    "code": "HSEM2534H",
    "subject": "HSEM",
    "number": "2534",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by mathematics faculty.prereq: [Fr or Soph] honors student",
    "prereq": []
  },
  {
    "uid": "803546",
    "code": "HSEM2535H",
    "subject": "HSEM",
    "number": "2535",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussion oriented, emphasizes active learning. Frequently interdisciplinary.prereq: [Fr or soph], honors",
    "prereq": []
  },
  {
    "uid": "808510",
    "code": "HSEM2538H",
    "subject": "HSEM",
    "number": "2538",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion. Emphasizes active learning. Frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "811378",
    "code": "HSEM2539H",
    "subject": "HSEM",
    "number": "2539",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics Course. Emphasizes active learning. Frequently interdisciplinary.prereq: Fr or soph honors student",
    "prereq": []
  },
  {
    "uid": "818281",
    "code": "HSEM2540H",
    "subject": "HSEM",
    "number": "2540",
    "honors": true,
    "writingIntensive": false,
    "name": "Understanding the Russian Land",
    "fullname": "Understanding the Russian Land",
    "info": "Encompassing more than 6.5 million square miles, Russia is an immense and ecologically diverse country. The environment of the frigid and heavily forested heartland of early Russian civilization, as well as that of the \"wild field\" (the Eurasian steppe) on its border, have posed a series of challenges to Russians and have left an indelible mark on modern Russian culture.  In this interdisciplinary seminar, we will study how Russians have conceived of and used nature from the medieval period to the dissolution of the Soviet Union. Articulating a particular approach to nature has been integral to several ideological and cultural projects in Russian history, including the formation of a literary tradition, the establishment of a multi-ethnic empire encompassing several biomes, and the development of a vision of Soviet science conquering and reshaping nature and the world. In the period we will study (the fifteenth century to 1991 Russia) underwent several profound epistemological shifts, and a particular focus of this course will be how the ways Russians created natural knowledge changed over time. Knowledge is power, and we will study how natural knowledge was used to strengthen and expand the state in the medieval, imperial, and Soviet periods. Another major focus of this course is the ravages that nature and humankind have inflicted on one another, and we will study how the environment influenced the development of Russia's form of agricultural slavery, serfdom, as well as the history of environmental degradation, including deforestation, the establishment of heavy industry, and nuclear disaster.",
    "prereq": []
  },
  {
    "uid": "818821",
    "code": "HSEM2541H",
    "subject": "HSEM",
    "number": "2541",
    "honors": true,
    "writingIntensive": false,
    "name": "U of M Cabinet of Curiosity",
    "fullname": "Campus Obscura: A University of Minnesota Cabinet of Curiosity",
    "info": "This course examines the history of science, technology, and medicine through physical objects - maps, rare books, artifacts, instruments, specimens, manuscripts – and considers how they are used to write history, produce public exhibits, and create identities. Short readings will introduce ideas about how experts have used these materials to write history, to produce public exhibits, and to create identities, and the focus of the course will be on objects themselves and having students do research that facilities their understanding of historical context. The University of Minnesota has many significant collections of artifacts and other items that are rich resources for the exploration of historically significant material culture, and continue to shape the University of Minnesota. Students will visit the Wangensteen Historical Library of Biology and Medicine, the Goldstein Museum of Design, the University Archives, the Weisman Art Museum, and the College of Biological Science’s Conservatory, among other sites.",
    "prereq": []
  },
  {
    "uid": "819385",
    "code": "HSEM2541V",
    "subject": "HSEM",
    "number": "2541",
    "honors": true,
    "writingIntensive": true,
    "name": "U of M Cabinet of Curiosity",
    "fullname": "Campus Obscura: A University of Minnesota Cabinet of Curiosity",
    "info": "This course examines the history of science, technology, and medicine through physical objects - maps, rare books, artifacts, instruments, specimens, manuscripts and considers how they are used to write history, produce public exhibits, and create identities. Short readings will introduce ideas about how experts have used these materials to write history, to produce public exhibits, and to create identities, and the focus of the course will be on objects themselves and having students do research that facilities their understanding of historical context. The University of Minnesota has many significant collections of artifacts and other items that are rich resources for the exploration of historically significant material culture, and continue to shape the University of Minnesota. Students will visit the Wangensteen Historical Library of Biology and Medicine, the Goldstein Museum of Design, the University Archives, the Weisman Art Museum, and the College of Biological Science?s Conservatory, among other sites.",
    "prereq": []
  },
  {
    "uid": "826217",
    "code": "HSEM2606H",
    "subject": "HSEM",
    "number": "2606",
    "honors": true,
    "writingIntensive": false,
    "name": "Microbiomes and Society",
    "fullname": "Microbiomes and Society",
    "info": "The microbiome - the communities of microbes living in humans, plants, animals, and the environment, plays indispensable roles in the way they function. This relationship, rooted in the origin of life, has played a role in every aspect of our biology and the way we interact with the specific environment we live in. We live in a globalized, highly- interconnected world; now, more than ever, it is easier to expose ourselves to different cultures, places, and peoples; please join me in a journey beyond our borders to understand how different global perspectives help us learn more about ourselves and our society in the current world order, all thorough a microbiome lens. In this class, we will travel to different places around the world to discuss how a microbiomes provide us with a unique lens to understand diverse societies and cultures. From the moment we evolved as humans, to the origin of the first civilizations, we will learn how microbes have been involved in the most complex global social issues, including public health, global politics, and social justice. ",
    "prereq": []
  },
  {
    "uid": "803187",
    "code": "HSEM2607H",
    "subject": "HSEM",
    "number": "2607",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar; emphasis on active learning; frequently interdisciplinary.prereq: Fr or soph honors",
    "prereq": []
  },
  {
    "uid": "802101",
    "code": "HSEM2609H",
    "subject": "HSEM",
    "number": "2609",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "819884",
    "code": "HSEM2621H",
    "subject": "HSEM",
    "number": "2621",
    "honors": true,
    "writingIntensive": false,
    "name": "Climate Change Futures",
    "fullname": "Environmental Futures: Climate Change Impacts and Strategies for Building Resilience",
    "info": "“Climate change is the most serious challenge that humanity has ever faced,” (Amitav Ghosh). This seminar will focus on the future of climate change, its emerging and far-reaching impacts on social and ecological systems, and the development of innovative strategies to address this challenge. The multidimensional problem of climate change will be examined through a variety of lenses, including the natural sciences, social sciences, and humanities, and the perspectives of indigenous peoples, environmental justice, and future generations. The emphasis is on the human dimensions of climate change. Throughout the course, a variety of techniques and exercises developed by futurists will be used to explore possible, plausible, and preferable environmental futures and develop environmental foresight expertise among attendees.Students will be challenged to build robust, agile and resilient policy options to achieve valued climate change outcomes. The purpose of this course is to prepare students to anticipate and design alternative climate change futures and create effective decisions and policies to achieve them.",
    "prereq": []
  },
  {
    "uid": "818364",
    "code": "HSEM2623H",
    "subject": "HSEM",
    "number": "2623",
    "honors": true,
    "writingIntensive": false,
    "name": "Biopiracy-Genetic Indentity",
    "fullname": "Biopiracy and seed for the post apocalypse: Genebanks, Genetic Diversity, and Identity",
    "info": "Our world food supply faces a variety of threats: changing climates, precipitation, and disease pressures; evolving pathogens; depleted soils; even nuclear war. Our best methods for responding to these threats involve making use of crop biodiversity. To that end, genebanks collect and preserve diverse crop accessions. In order to be effective, genebank curators have to make decisions about what to preserve. Those decisions are both scientific and cultural and like any such decisions have their critics and detractors. We will discuss genetic markers and measures for population diversity and how such tools can be leveraged to gain knowledge about crop diversity, make management decisions, and create improved varieties. However, food is cultural, and for many our relationship to crops is central to identity. Therefore, we will also examine who is privileged and left out of dominant narratives, and explore alternate ways of understanding crop diversity and preservation. Finally, we will explore two case studies. The first is Seed Savers in Decorah Iowa and its ties to Midwest Agrarianism. The second is two related Peruvian organizations: The International Potato Center and Parque de la Papa. Both of these organizations preserve Peruvian native potatoes, one as part of an international NGO using the latest genetic techniques and one using traditional agricultural practices in six associated Quechua communities.",
    "prereq": []
  },
  {
    "uid": "806820",
    "code": "HSEM2624H",
    "subject": "HSEM",
    "number": "2624",
    "honors": true,
    "writingIntensive": false,
    "name": "Survey: Human Predicament",
    "fullname": "\"Reality 101\" - A Survey of the Human Predicament",
    "info": "How is the economy like a hurricane? Where does money come from? Will economic growth last forever?  What is wealth? How many hours would it take you to generate the same amount of energy in a gallon of gasoline?  Why are you so confident in your own beliefs?  Why do you spend so much time on social media? Why do we want 'more' than our neighbors? What do all of these questions have to do with the environment? With your future?  And what if our most popular societal beliefs about these issues turn out to be myths?Reality 101 will delve into these questions and unify them as they apply to the major challenges humanity faces this century, among them: slow economic growth, poverty, inequality, addiction, pollution, ocean acidification, biodiversity loss, and war.  The course will provide students with a broad exposure to the foundational principles central to addressing these interrelated issues. The readings and lectures will cover literature in systems ecology, energy and natural resources, thermodynamics, history, anthropology, human behavior, neuroscience, environmental science, sociology, economics, globalization/trade, and finance/debt with an overarching goal to give students a general understanding of how our human ecosystem functions as a whole. Such a systems overview is necessary to view the opportunities and constraints relevant to our future from a realistic starting point. Though the hard science relating to sustainability will be surveyed, few answers will be presented and it is hoped that creativity and group dialogue will lead to emergent ideas on how these big themes fit together.  While the class material is daunting and intense (reflecting our world situation), the course itself will be enlightening and deeply informative, with an open, engaging, and entertaining class atmosphere.",
    "prereq": []
  },
  {
    "uid": "806699",
    "code": "HSEM2627H",
    "subject": "HSEM",
    "number": "2627",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "813976",
    "code": "HSEM2628H",
    "subject": "HSEM",
    "number": "2628",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics Course. Emphasizes active learning. Interdisciplinary.prereq: [Fr or Soph] honors student.",
    "prereq": []
  },
  {
    "uid": "804437",
    "code": "HSEM2630H",
    "subject": "HSEM",
    "number": "2630",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "813977",
    "code": "HSEM2634H",
    "subject": "HSEM",
    "number": "2634",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics Course. Emphasizes active learning. Interdisciplinary.prereq: [Fr or soph] honors student.",
    "prereq": []
  },
  {
    "uid": "815939",
    "code": "HSEM2635H",
    "subject": "HSEM",
    "number": "2635",
    "honors": true,
    "writingIntensive": false,
    "name": "Germs and Civilization",
    "fullname": "Germs and Civilization",
    "info": "This course explores the interaction of human, animals, and microbes and examines how microbes, pathogenic microbes in particular, have influenced human evolution and civilization. The course expects to expose students to the thinking from a historic and interdisciplinary perspective that microbes, especially those causing pandemics and epidemic for centuries, may have played critical roles in influencing human history and shaping modern civilization, although social, cultural, technical, and other factors have been major players. Emphasis will be placed on a few microbes, such as plague, smallpox, yellow fever, malaria, tuberculosis, retrovirus, and influenza and their impacts on important events in human history. Microbes may also impact human evolution as a fraction of human genome is from retrovirus and some genetic diseases including cystic fibrosis in humans may arise from resistance to epidemics of deadly microbes.Knowledge of general microbiology will be introduced but is not a requirement.",
    "prereq": []
  },
  {
    "uid": "818979",
    "code": "HSEM2637H",
    "subject": "HSEM",
    "number": "2637",
    "honors": true,
    "writingIntensive": false,
    "name": "Insects and the Environment",
    "fullname": "Small but Impactful: Insects and the Environment",
    "info": "Harvard biologist E. O. Wilson referred to insects and other invertebrates as the ‘little things that run the world’. Insects may be small but are numerous, diverse and present almost everywhere – as humans we encounter them not matter where we are and what we do!  In this course, Honors students and the Instructor will jointly explore influences of insects as pollinators, ‘recyclers’, and as invasive species that lead to environmental pollution; adaptations that enable insects to handle diverse environmental conditions including climate change; and impacts on humans of insects on planet earth.  The course will include brief interactive lectures, select readings and videos for providing background and context related to a specific topic. Students will then explore each topic by engaging in open conversations, small/large discussions using active learning approaches such as think-pair-share, jigsaw discussion groups, and debates for sharing their perspectives based on individual backgrounds/major/interests. ",
    "prereq": []
  },
  {
    "uid": "805415",
    "code": "HSEM2701H",
    "subject": "HSEM",
    "number": "2701",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary. Associated with Med school faculty.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "804147",
    "code": "HSEM2702H",
    "subject": "HSEM",
    "number": "2702",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics course related to medicine; interdisciplinary approach.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "807750",
    "code": "HSEM2702V",
    "subject": "HSEM",
    "number": "2702",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning and writing; frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "801841",
    "code": "HSEM2707H",
    "subject": "HSEM",
    "number": "2707",
    "honors": true,
    "writingIntensive": false,
    "name": "Infectious Disease Control",
    "fullname": "Battling the Bugs: Anthrax, Ebola, and Everyday Life - PubH Strategies for Prevention & Control",
    "info": "We share the planet with a myriad of living things. The smallest of those are the ones that may impact our lives the most. These creatures are in the news nearly every day: Ebola virus in Western Africa, measles outbreak among visitors to Disneyland, foodborne outbreaks on cruise ships, Zika virus precautions for pregnant women. This course will focus on the importance of infectious disease prevention, control, and treatment to the health and well-being of the global community. Students will explore the many facets of public health response operations and decision-making which are often behind the scenes and not well understood by the general public.",
    "prereq": []
  },
  {
    "uid": "813978",
    "code": "HSEM2708H",
    "subject": "HSEM",
    "number": "2708",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics Course. Emphasizes active learning. Interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "820009",
    "code": "HSEM2709H",
    "subject": "HSEM",
    "number": "2709",
    "honors": true,
    "writingIntensive": false,
    "name": "Surviving Climate Change",
    "fullname": "Climate Change: Indisputable Science, Unprecedented Consequences, and Transformative Responses",
    "info": "Climate change presents an almost unimaginable crisis to our existence. Its profoundness is coupled with an urgency to find solutions that contribute to collective and transformative actions. There is scientific consensus that the existence of human beings (and many other species) on the planet is in danger because of fossil fuel emissions. Human activity has led to increasing greenhouse gases (especially carbon dioxide) and a warming planet.  A warming planet has negative consequences in terms of environmental degradation, extreme weather events, and social disruption—all of which have health and economic consequences.  While the basic problem is acknowledged by scientists in diverse fields, many of the proposed responses to the current and projected climate-related changes are contrary to powerful political, cultural, industrial, and economic interests. The challenges posed by these interests, as well as the complexity (and sometimes imprecision and uncertainty) of the science, make it difficult for individuals to clearly understand the threats and the opportunities that must be addressed in the next several decades if the earth is to remain habitable for almost 9 million species. Hearts and minds must change quickly.  Public and professional educational efforts must be massive, with clear messages of hope, urgency, and direction.  Local, national, and global adaptation and mitigation responses must thus be palatable and accessible to diverse communities as well as to powerful economic and political entities.  Policies, programs, services, and educational efforts must necessarily be created by multidisciplinary teams using community-focused approaches.  These efforts must reach all affected individuals and entities, especially those who are most vulnerable to the negative sequalae of climate change.  They must also effectively address the many political, social, and cultural barriers to the kind of transformative actions that are necessary to maintain the habitability of the planet.  The course will take a multidisciplinary perspective to encourage students to learn and critically evaluate information about three major content areas: (1) the science of climate change and its public health contextualization; (2) the existing, and projected, consequences of climate change to the environment, to human health, and to institutions and infrastructures that affect public health; and (3) public health mitigation and adaptation responses for industries, governments, communities, and individuals.  ",
    "prereq": []
  },
  {
    "uid": "807574",
    "code": "HSEM2710H",
    "subject": "HSEM",
    "number": "2710",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning; frequently interdisciplinary.prereq: Fr or soph, honors",
    "prereq": []
  },
  {
    "uid": "804390",
    "code": "HSEM2714H",
    "subject": "HSEM",
    "number": "2714",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Discussion oriented. Emphasizes active learning. Frequently interdisciplinary.prereq: [Fr or soph] honors student",
    "prereq": []
  },
  {
    "uid": "816254",
    "code": "HSEM2716H",
    "subject": "HSEM",
    "number": "2716",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by Center for Bioethics faculty.prereq: [Fr or Soph] honors student",
    "prereq": []
  },
  {
    "uid": "816770",
    "code": "HSEM2716V",
    "subject": "HSEM",
    "number": "2716",
    "honors": true,
    "writingIntensive": true,
    "name": "Social Justice and Health",
    "fullname": "Social Justice and Health",
    "info": "This seminar explores matters of social justice related to health. Class sessions predominantly focus on discussion of specific practical issues such as the promotion of race-specific therapies as an approach to ameliorating health disparities, the inclusion of homeless persons in research providing free access to health care, and the allocation of HIV medications in impoverished developing countries. Readings from multiple disciplinary perspectives ground examination these social justice issues. Discussions incorporate consideration of these issues? institutional and broader social contexts.",
    "prereq": []
  },
  {
    "uid": "809796",
    "code": "HSEM2717H",
    "subject": "HSEM",
    "number": "2717",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Fr or soph honors student",
    "prereq": []
  },
  {
    "uid": "826212",
    "code": "HSEM2718H",
    "subject": "HSEM",
    "number": "2718",
    "honors": true,
    "writingIntensive": false,
    "name": "The Diabetes Experience",
    "fullname": "The Diabetes Experience",
    "info": "The number of people living with diabetes is growing in the United States. Diabetes is a complicated condition that impacts patients in different ways. This course is designed to explore the complexities of diabetes treatment, including navigating the US health care system and accessing and interpreting medical information. Students will gain foundational understanding of the endocrine system, the pathophysiology that leads to different types of diabetes, and the pharmaceutical and lifestyle interventions for management. Students will participate in two different week-long simulations. The first simulation will be of a person living with type 1 diabetes where the student will both track their carbohydrate intake and calculate appropriate insulin doses. The second simulation will also be of a person living with diabetes and in this simulation students will need to respond to various challenges related to health system navigation and patient autonomy. In addition to simulation activities, students will debatecontroversial topics surrounding the care for patients with diabetes. This is an online-based course and will be discussion based. These topics will be discussed among students across each week with a strong presence of the instructional team within each small group.",
    "prereq": []
  },
  {
    "uid": "817987",
    "code": "HSEM2719H",
    "subject": "HSEM",
    "number": "2719",
    "honors": true,
    "writingIntensive": false,
    "name": "Incarceration & Public Health",
    "fullname": "Mass Incarceration and Public Health: An American Crisis",
    "info": "Mass incarceration is one of the major public health challenges facing the United States. Each year, millions of people cycle through the criminal justice system. Justice-involved people experience far higher rates of chronic health problems, substance use, and mental illness than the general population. Further, our country's prisons and jails are often ill-equipped to handle these complex health conditions, perpetuating health inequities. Mass incarceration contributes to powerful health disparities in the United States, affecting the health of entire communities and across generations. This course will examine the intersections of mass incarceration and public health. We will explore individual and community-level health impacts of incarceration, with a focus on the relationship between mass incarceration and health disparities, particularly in communities of color. This course will consider specific populations at particularly high risk, including detained youth, pregnant incarcerated women, and the elderly. Students will have an opportunity to tour local correctional facilities and hear directly from experts in the field, including formerly incarcerated people.",
    "prereq": []
  },
  {
    "uid": "818287",
    "code": "HSEM2719V",
    "subject": "HSEM",
    "number": "2719",
    "honors": true,
    "writingIntensive": true,
    "name": "Incarceration and Health",
    "fullname": "Mass Incarceration and Public Health: An American Crisis",
    "info": "Mass incarceration is one of the major public health challenges facing the United States. Each year, millions of people cycle through the criminal justice system. Justice-involved people experience far higher rates of chronic health problems, substance use, and mental illness than the general population. Further, our country's prisons and jails are often ill-equipped to handle these complex health conditions, perpetuating health inequities. Mass incarceration contributes to powerful health disparities in the United States, affecting the health of entire communities and across generations. This course will examine the intersections of mass incarceration and public health. We will explore individual and community-level health impacts of incarceration, with a focus on the relationship between mass incarceration and health disparities, particularly in communities of color. This course will consider specific populations at particularly high risk, including detained youth, pregnant incarcerated women, and the elderly. Students will have an opportunity to tour local correctional facilities and hear directly from experts in  the field, including formerly incarcerated people.",
    "prereq": []
  },
  {
    "uid": "825811",
    "code": "HSEM2721H",
    "subject": "HSEM",
    "number": "2721",
    "honors": true,
    "writingIntensive": false,
    "name": "Intro to Medicine",
    "fullname": "Introduction to Medicine",
    "info": "This is a course designed for undergraduate students who are interested in medicine. Students will get a broad introduction to the field of medicine via core lectures, book reading, movies, and interactive group discussion, group presentation, and writing a review paper on pain medicine. Emphasis will be placed on pros of cons of medicine as a career, medical school admission requirement, research projects, simulation lab visit, hand on ultrasound experience, understanding the life of a physician and medical student, and practice opportunities in various specialties. Students will meet with medical students, physicians, and clinical scientists who will share their experiences. In addition, the student will have opportunities to explore research in a medical research laboratory. NOTE: Course is taught First Half of Term only",
    "prereq": []
  },
  {
    "uid": "816255",
    "code": "HSEM2722H",
    "subject": "HSEM",
    "number": "2722",
    "honors": true,
    "writingIntensive": false,
    "name": "Human Disease & Environment",
    "fullname": "Human Disease Influenced by Environmental Factors",
    "info": "This seminar aims at understanding whole organisms and cellular functions in response to various macro-environmental events, i.e. radiation, food carcinogens, global warming, pollution etc., that promote the disease process. Cells are consistently exposed to changing conditions, and they are programmed to effectively respond to diverse stimuli or insults under normal physiological condition. However, when such conditions exceed cell?s inner capacity, cells can undergo apoptosis, or become senescent or in some cases, they can acquire pathological properties, which lead to the progression of various human diseases. In particular, environmental changes such as climate change caused by human activities can significantly affect human health and ecosystems, and there are growing concerns about emerging new disease that is a threat to human health.",
    "prereq": []
  },
  {
    "uid": "817323",
    "code": "HSEM2724H",
    "subject": "HSEM",
    "number": "2724",
    "honors": true,
    "writingIntensive": false,
    "name": "Controversies in Sexual Health",
    "fullname": "The Sex Talk You Should Have Had: Controversies in Sexual Health",
    "info": "Reproductive and sexual health is an increasingly important topic in community settings. Pharmacists can play a vital role in promoting safe and healthy practices that will improve the health of their communities and are an important source of reproductive and sexual health information and advice. This course is designed to expand and enhance community-based reproductive and sexual health knowledge and skills while preparing students to be informed and active participants in ethics driven debates surrounding reproductive and sexual health.The Sex Talk You Should Have Had covers three important sections in sexual health that interface in the community pharmacy setting. These topics include the HPV vaccine, contraception, and Sexually Transmitted Infection/Disease (STI/STD) testing and treatment options. Each of these sections is addressed in weekly modules that provide thorough introduction to the topic, an overview of how the treatments or medications work, and related contemporary topics of debate. This is a hybrid course with extensive online discussion with limited in-class meetings.",
    "prereq": []
  },
  {
    "uid": "817759",
    "code": "HSEM2724V",
    "subject": "HSEM",
    "number": "2724",
    "honors": true,
    "writingIntensive": true,
    "name": "Controversies in Sexual Health",
    "fullname": "The Sex Talk You Should Have Had: Controversies in Sexual Health",
    "info": "Reproductive and sexual health is an increasingly important topic in community settings. Pharmacists can play a vital role in promoting safe and healthy practices that will improve the health of their communities and are an important source of reproductive and sexual health information and advice. This course is designed to expand and enhance community-based reproductive and sexual health knowledge and skills while preparing students to be informed and active participants in ethics driven debates surrounding reproductive and sexual health.The Sex Talk You Should Have Had covers three important sections in sexual health that interface in the community pharmacy setting. These topics include the HPV vaccine, contraception, and Sexually Transmitted Infection/Disease (STI/STD) testing and treatment options. Each of these sections is addressed in weekly modules that provide thorough introduction to the topic, an overview of how the treatments or medications work, and related contemporary topics of debate. This is a hybrid course with extensive online discussion with limited in-class meetings.",
    "prereq": []
  },
  {
    "uid": "817393",
    "code": "HSEM2725H",
    "subject": "HSEM",
    "number": "2725",
    "honors": true,
    "writingIntensive": false,
    "name": "Zombies: Issues in Bioethics",
    "fullname": "Zombies and their Souls: Philosophy, Bioethics and the Undead",
    "info": "We want money, love and fame. They want brains. Who is to say that our values are superior? This seminar will use zombie movies as a way of exploring fundamental issues in bioethics, the philosophy of mind and the philosophy of psychology. Are zombies conscious? Do they have free will? Should they have rights? If zombies could be safely controlled, would it be unethical to make them slaves or pets? What about experimenting on them, or using their organs for transplantation? If I were to become a zombie, would I still be me, or would I be something else?",
    "prereq": []
  },
  {
    "uid": "806700",
    "code": "HSEM2801H",
    "subject": "HSEM",
    "number": "2801",
    "honors": true,
    "writingIntensive": false,
    "name": "Think Like a Lawyer",
    "fullname": "Think Like a Lawyer: The Art and Adventure of Torts",
    "info": "Law is the foundation of modern society. The ability to understand our legal system is invaluable in any profession, ranging from business and health to science or art. This seminar offers an introduction into legal thinking: Not merely what the laws are, but why we have them and, more importantly, how we come up with them. As a focus, we will be grounding ourselves in torts, a fundamental area of legal education that covers the civil wrongs. Students will have an opportunity to get a feeling for the law school experience as we use the case method, along with some Socratic method and ample discussion. We will focus on the basics of legal analysis, and learn how to apply that to critical thinking. Students successfully completing this seminar will be mentally armed and dangerous.",
    "prereq": []
  },
  {
    "uid": "811876",
    "code": "HSEM2802H",
    "subject": "HSEM",
    "number": "2802",
    "honors": true,
    "writingIntensive": false,
    "name": "Law and Film",
    "fullname": "Cinematic Representations of American Law",
    "info": "Representations of American law in 20th century American films offer unique perspectives that help us understand the larger context in which the legal system operates--and offer a visual supplement to traditional ways--case law and statutory interpretation of reading the law. This course will discuss how cinematic interpretations of American law have been perceived and accepted inside and outside Hollywood, inside and outside the legal community, and inside and outside the United States. The course will begin by teaching and discussing some fundamentals of American law, using legal films to illustrate the doctrinal concepts and processes involved in civil procedure, criminal law and procedure, jury trials, evidence, contracts, torts, constitutional law, the First Amendment, legal ethics, professional responsibility, etc. Using clips from of cinematic masterpieces, we will visualize and discuss sophisticated legal concepts. This interdisciplinary approach-teaching law through film-- will engage students visually, to help them better understand and discuss legal concepts. It will also help students appreciate the broader humanities and arts context in which legal discourse evolves, especially in a today's global era. Course readings will include statutes, legal cases, historical documents, novels, and commentaries. Viewings will include classic legal films.",
    "prereq": []
  },
  {
    "uid": "825812",
    "code": "HSEM2803H",
    "subject": "HSEM",
    "number": "2803",
    "honors": true,
    "writingIntensive": false,
    "name": "Voice on Climate Change",
    "fullname": "Making Your Voice Heard on Climate Change",
    "info": "Climate change will be a part of the rest of your life. No matter where you live, climate change will have an impact. No matter your career, adapting to a new climate will be part of it. How can you make your voice heard to help your community and workplace adapt to, and mitigate, the effects of climate change and associated Grand Challenges? And how can you do so in a fair and equitable manner? Everyone is aware of young activists like Greta Thunberg. Whether you want to be organizing large activism campaigns or become an effective advocate for local issues, this course will go over  some of the basic frameworks for advocacy and change-making. Basics of climate change will be covered. The course will feature guest speakers from various campaigns and organizations. Students develop their own advocacy campaigns as a way to center theoretical learning. The focus of this class is on climate change but these basic tools and frameworks are useful for any issue.",
    "prereq": []
  },
  {
    "uid": "802226",
    "code": "HSEM2901H",
    "subject": "HSEM",
    "number": "2901",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Directed Study",
    "fullname": "Honors Directed Study",
    "info": "Extra credit to be used in conjunction with an existing honors seminar.",
    "prereq": []
  },
  {
    "uid": "802227",
    "code": "HSEM2902H",
    "subject": "HSEM",
    "number": "2902",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Directed Study",
    "fullname": "Honors Directed Study",
    "info": "Extra credits to be used in conjunction with an honors seminar.",
    "prereq": []
  },
  {
    "uid": "802228",
    "code": "HSEM2941H",
    "subject": "HSEM",
    "number": "2941",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Topics",
    "fullname": "Honor Topics",
    "info": "Special topics. Team taught.",
    "prereq": []
  },
  {
    "uid": "802229",
    "code": "HSEM2942H",
    "subject": "HSEM",
    "number": "2942",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Topics",
    "fullname": "Honor Topics",
    "info": "Team taught.",
    "prereq": []
  },
  {
    "uid": "802230",
    "code": "HSEM2991H",
    "subject": "HSEM",
    "number": "2991",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Directed Research",
    "fullname": "Honors Directed Research",
    "info": "Honors Directed Research",
    "prereq": []
  },
  {
    "uid": "802231",
    "code": "HSEM2992H",
    "subject": "HSEM",
    "number": "2992",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Directed Research",
    "fullname": "Honors Directed Research",
    "info": "Directed Research",
    "prereq": []
  },
  {
    "uid": "799869",
    "code": "HSEM2994H",
    "subject": "HSEM",
    "number": "2994",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Research",
    "fullname": "Honors Research",
    "info": "Honors research opportunity with faculty.Prereq Fr or soph honors.",
    "prereq": []
  },
  {
    "uid": "801842",
    "code": "HSEM3001H",
    "subject": "HSEM",
    "number": "3001",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "801843",
    "code": "HSEM3002H",
    "subject": "HSEM",
    "number": "3002",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics course.",
    "prereq": []
  },
  {
    "uid": "802204",
    "code": "HSEM3006H",
    "subject": "HSEM",
    "number": "3006",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "806777",
    "code": "HSEM3007H",
    "subject": "HSEM",
    "number": "3007",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning; frequently interdisciplinary. Taught by anthropology faculty.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "806775",
    "code": "HSEM3008H",
    "subject": "HSEM",
    "number": "3008",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics Course; emphasis on active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "806936",
    "code": "HSEM3008V",
    "subject": "HSEM",
    "number": "3008",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning and writing; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "009426",
    "code": "HSEM3010H",
    "subject": "HSEM",
    "number": "3010",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussions, active learning. Often interdisciplinary.prereq: [Jr or sr],  honors",
    "prereq": []
  },
  {
    "uid": "801844",
    "code": "HSEM3011H",
    "subject": "HSEM",
    "number": "3011",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics course.",
    "prereq": []
  },
  {
    "uid": "803352",
    "code": "HSEM3012H",
    "subject": "HSEM",
    "number": "3012",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussion oriented, emphasizes active learning. Frequently interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "817381",
    "code": "HSEM3013H",
    "subject": "HSEM",
    "number": "3013",
    "honors": true,
    "writingIntensive": false,
    "name": "Caravaggio: His Art and Life",
    "fullname": "Caravaggio: Bad Boy of the Baroque",
    "info": "This seminar examines the life and art of Michelangelo Merisi da Caravaggio (1571-1610), one of the most arresting and controversial painters in the history of art. Our examination will range from issues of self-fashioning and self-portraiture to questions of biography, patronage, and iconography, and will include a viewing of Simon Schama's 2006 film, Caravaggio. Special emphasis will be given to problems of methodology and to various ways of \"reading\" and viewing his complex and provocative works. During Spring Break the seminar will incorporate a Study Abroad component in Rome, where we will be able to see some of his most important paintings, in context, as well as works by many other Baroque masters.",
    "prereq": []
  },
  {
    "uid": "805306",
    "code": "HSEM3014H",
    "subject": "HSEM",
    "number": "3014",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "806701",
    "code": "HSEM3017H",
    "subject": "HSEM",
    "number": "3017",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "810402",
    "code": "HSEM3017V",
    "subject": "HSEM",
    "number": "3017",
    "honors": true,
    "writingIntensive": true,
    "name": "Writ & Read in Ancient World",
    "fullname": "Writing and Reading in the Ancient World",
    "info": "Writing is the fundamental technology of civilization. It sets an imaginary boundary between history and prehistory, between educated and not, even between civilized and primitive, in the common way of thinking. Writing is ubiquitous today – I am doing it right now, and you are reading what I am doing – to the point that we take its nature and value for granted. This seminar scrutinizes our most universal technology and our ideas about it, by inquiring into the origins, development, disappearance, and decipherment of different writing systems.Why and how was writing invented? What difference did it make to society once it was invented? Who learned to read and write in antiquity, and what did they write? When people learned a writing system, did they write in their own language, or did they learn to write in thelanguage of the people who invented the system? And how did modern scholars figure out how to read what people once wrote in long-forgotten, extinct writing systems? These are among the questions to be explored in the seminar. We will focus on writing systems developed in andaround the ancient Near East: cuneiform in Mesopotamia, proto-Elamite and linear Elamite in Iran, hieroglyphics in Egypt, the alphabet in the Levant, Linear A and B in the Aegean, Anatolian hieroglyphics, Old Persian cuneiform, and Meroitic. The class will also examine writing systems developed in other parts of the world in antiquity: the Indus Valley, China, and Mesoamerica. You will learn about the origins and development of the script, how it worked, what language(s) it was used to write, and what kinds of texts people wrote. In the case of extinct scripts, you will also learn the story of its decipherment – or of attempts to decipher it, in the case of scripts such as the Byblian syllabary, Cretan hieroglyphics, and Linear A. Meanwhile, we shall discuss how ancient cultures of western Asia, northeastern Africa, and the Mediterranean influenced each other in developing their various writing systems; how people and states used particular scripts and languages for internal or external communication; and the value of literacy versus orality. Examining these phenomena in diverse cultures of the ancient world will provide a wealth of analogies to the contemporary world, and will raise questions about how writing and literacy function in society and in the mind.",
    "prereq": []
  },
  {
    "uid": "813979",
    "code": "HSEM3018H",
    "subject": "HSEM",
    "number": "3018",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics Course. Emphasizes active learning. Interdisciplinary. Taught by CNES faculty.prereq: [Jr or Sr] honors student.",
    "prereq": []
  },
  {
    "uid": "803188",
    "code": "HSEM3019H",
    "subject": "HSEM",
    "number": "3019",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "009428",
    "code": "HSEM3020H",
    "subject": "HSEM",
    "number": "3020",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussions, active learning. Often interdisciplinary.prereq: [Jr or sr],  honors",
    "prereq": []
  },
  {
    "uid": "803189",
    "code": "HSEM3021H",
    "subject": "HSEM",
    "number": "3021",
    "honors": true,
    "writingIntensive": false,
    "name": "Cinema and Utopia",
    "fullname": "Cinema and Utopia",
    "info": "The question of “utopia” has been an important resource for thought – ever since the appearance in the early sixteenth century of Sir Thomas More’s tract about an imagined, ideal community in the middle of the Atlantic Ocean. Centered on the idea of a perfected world, utopian thinking has motivated a wide variety of political and social movements as well as literary and cultural practices. In this course, we will explore the ways that utopian ideas find expression in cinema.  We will examine the conceptions by means of which utopian longings are given cinematic form – from satires that expose the wrongs of society in order to imagine change, and culinary fantasies about the fulfillment of the senses, to the role of humor in conceptualizing change. To this we should also add the importance of considering how the visual image intimates the future – by not showing as much as by showing.We will look at formal film language as well as narrative concerns in order to grasp various aspects of the ideal of utopia as expressed in cinema.  Through an encounter with a range of American and European films, our goal will be to consolidate an overall understanding of the politics of utopian thinking. Please note that prior familiarity with film or cultural theory is not required, but all students taking a 3xxx-level honors course are expected to demonstrate their ability to think critically, write well, and make good arguments (regardless of disciplinary location).",
    "prereq": []
  },
  {
    "uid": "807050",
    "code": "HSEM3021V",
    "subject": "HSEM",
    "number": "3021",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning and writing; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "803338",
    "code": "HSEM3022H",
    "subject": "HSEM",
    "number": "3022",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honor Seminar",
    "info": "Special topics. Discussion oriented, emphasizes active learning. Frequently interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "808968",
    "code": "HSEM3022V",
    "subject": "HSEM",
    "number": "3022",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Emphasis on active learning/writing.prereq: Jr or Sr honors student",
    "prereq": []
  },
  {
    "uid": "819892",
    "code": "HSEM3023H",
    "subject": "HSEM",
    "number": "3023",
    "honors": true,
    "writingIntensive": false,
    "name": "Race:The History of an Idea",
    "fullname": "Race: The History of an Idea in North America",
    "info": "This Honors seminar explores the roots and rationales presented when constructing and upholding the idea of race. This class examines processes of racial formation in science, law, history, immigration policy, education, leisure, adoption, marriage, and medicine. The course investigates how Americans came to mythologize, understand, identify, and codify the importance of race since the mid-nineteenth century. Racial formations and classifications shift according to political climates, such that immigration debates, changing gender norms and concerns over interracial marriage transform how we imagine racial groups. We will also look at how race has been used to pathologize, eroticize, vilify, fetishize, and medicalize purported ‘problem people,’ like immigrants, the poor, and the sick. For instance, seeing people of color as particular hazards during pandemics, like the 1918 Influenza or 2020 COVID-19 crises, has deep roots in longstanding racial theories. Using memoirs, legal cases, history of medicine, laws, photographs, oral histories, and secondary source readings, this class traces the history of America’s fascination with race and how race came to define so many aspects of American life during the twentieth century.",
    "prereq": []
  },
  {
    "uid": "806834",
    "code": "HSEM3025H",
    "subject": "HSEM",
    "number": "3025",
    "honors": true,
    "writingIntensive": false,
    "name": "Food, Clothing, Shelter",
    "fullname": "Food, Clothing, Shelter: The Culture and Politics of Simple Living",
    "info": "At a time of rising income inequality, in which billionaires grow richer while millions struggle to survive, this  course will examine the social, environmental, economic, and ethical aspects of consumption and poverty through the lens of three basic needs: food, clothing, and shelter. It seeks to help you answer three key questions: what should you eat, what should you wear, and where should you live, so that others might do the same? We will begin by exploring the historical roots of simple living in the monastic traditions of Buddhism, Hinduism, and Christianity, as well as the “voluntary simplicity” of such secular figures as Henry David Thoreau, Helen and Scott Nearing, and E. F. Schumacher. In the central portion of our course, we will consider several contemporary forms of simplicity, such as Slow Food, permaculture, and urban homesteading; visible mending, thrifting, and online reselling; and camping, #vanlife, and tiny houses. We will then compare these practices to the “basic needs” approach to economic and social development, which seeks to alleviate the “involuntary simplicity” of poverty in developing countries, as well as various attempts to address poverty in the U.S. through social welfare programs (such as SNAP, WIC, and HUD programs) and nongovernmental organizations (such as food shelves, soup kitchens, thrift stores, and homeless shelters). In our exploration of simple living and basic needs, we will address major issues in sustainability studies,  including ecosystem services, the gift economy, and theories of value; the positive psychology movement; the Sustainable Development Goals; and antiwork and living wage campaigns. We will also consider a range of literary and historical perspectives on food, fashion, and architecture, such as Bill McKibben’s “Deep Economy,” Marie Kondo’s “The Life-Changing Magic of Tidying Up,” Sarah Susanka’s “The Not So Big House,” and the documentary films “The True Cost” and “The Minimalists.” Requirements will include attendance and participation, leading discussion, a series of short reading responses, several reflective writing assignments, and a final project exploring some aspect of our subject in greater depth.",
    "prereq": []
  },
  {
    "uid": "806937",
    "code": "HSEM3025V",
    "subject": "HSEM",
    "number": "3025",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning and writing; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "801846",
    "code": "HSEM3026H",
    "subject": "HSEM",
    "number": "3026",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics course; emphasis on active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "811331",
    "code": "HSEM3027H",
    "subject": "HSEM",
    "number": "3027",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar. Emphasis on active learning. Frequently interdisciplinary.\n\nprereq: Jr or Sr Honors Student",
    "prereq": []
  },
  {
    "uid": "803339",
    "code": "HSEM3028H",
    "subject": "HSEM",
    "number": "3028",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "815415",
    "code": "HSEM3028V",
    "subject": "HSEM",
    "number": "3028",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Interdisciplinary topics course; emphasizes writing. French & Italian faculty taught.",
    "prereq": []
  },
  {
    "uid": "009429",
    "code": "HSEM3030H",
    "subject": "HSEM",
    "number": "3030",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussions, active learning. Often interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "819027",
    "code": "HSEM3031H",
    "subject": "HSEM",
    "number": "3031",
    "honors": true,
    "writingIntensive": false,
    "name": "Art/Power/Pol - Baroque Rome",
    "fullname": "Art, Power, and Politics: Bernini and His Transformation of Baroque Rome",
    "info": "This seminar explores the transformation of Rome in the seventeenth century.  Our lens for understanding the remaking of the Baroque city will be the works of Gian Lorenzo Bernini (1598-1680), one of the most remarkable, influential, and powerful artists in the history of Western art.  Our examination will focus on Bernini’s sculpture and architecture that he carried out on behalf of popes and cardinals, with special emphasis given to their political, religious, and social meanings.  We will also explore Bernini’s biography and examine the style and iconography of his sculpture, architecture, and painting.  We will view Simon Schama’s 2006 film, Bernini, and, during the Spring break, have the extraordinary opportunity to study Bernini’s works first-hand in Rome.",
    "prereq": []
  },
  {
    "uid": "801847",
    "code": "HSEM3033H",
    "subject": "HSEM",
    "number": "3033",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "801848",
    "code": "HSEM3034H",
    "subject": "HSEM",
    "number": "3034",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussion oriented, emphasizes active learning. Frequently interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "813646",
    "code": "HSEM3035H",
    "subject": "HSEM",
    "number": "3035",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning andwriting; frequently interdisciplinary.prereq: [Jr or Sr]honors student",
    "prereq": []
  },
  {
    "uid": "816272",
    "code": "HSEM3036H",
    "subject": "HSEM",
    "number": "3036",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by Global Studies faculty.prereq: [Jr or Sr] honors student",
    "prereq": []
  },
  {
    "uid": "801849",
    "code": "HSEM3037H",
    "subject": "HSEM",
    "number": "3037",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "813808",
    "code": "HSEM3037V",
    "subject": "HSEM",
    "number": "3037",
    "honors": true,
    "writingIntensive": true,
    "name": "History through Memoir",
    "fullname": "Personal Pasts: Telling History through Memoir",
    "info": "This honors seminar uses memoirs—non-fictional life stories narrated in the first person—as a lens into the past and, just as importantly, as a way to investigate what counts as “history” itself.  The relationship between personal narratives and professionally produced histories is often fraught or confused, even though both can reasonably be understood as forms of creative non-fiction.  Is the memoirist responsible to the historical record in the same way as an historian?  Does the historian know how to assess and appreciate the power of personal memory?  What kinds of memoirs do historians write?  We will examine a range of memoirs that speak variously about historical and emotional truths, about memory and identity and place, about the ability of individual experience to illuminate a broader social and political history.  We will attend to the narrator’s voice and explore how certain kinds of writing enable (even produce) certain kinds of discoveries.  Throughout, we will discuss the gains and the limitations of using personal stories to understand past experience. A note of clarification: while autobiographies tend to be chronological narratives of most of a person’s life (without the ending, of course), memoirs focus more selectively—and often without regard to linear chronology—on crucial moments or themes in the narrator’s experience.  This course prioritizes memoirs over autobiographies, and it takes most of its examples from the boom in memoir writing over the last three decades.  It does not offer a history of memoir as a genre. In particular, it features memoirs that go beyond the experiences of an individual narrator to reveal broader social and political contexts.",
    "prereq": []
  },
  {
    "uid": "801850",
    "code": "HSEM3038H",
    "subject": "HSEM",
    "number": "3038",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics course. Frequently interdisciplinary. Taught by department of history faculty.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "810329",
    "code": "HSEM3038V",
    "subject": "HSEM",
    "number": "3038",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Active learning/writing. Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "805307",
    "code": "HSEM3039H",
    "subject": "HSEM",
    "number": "3039",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "009430",
    "code": "HSEM3040H",
    "subject": "HSEM",
    "number": "3040",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussions, active learning. Often interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "804438",
    "code": "HSEM3046H",
    "subject": "HSEM",
    "number": "3046",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "801851",
    "code": "HSEM3047H",
    "subject": "HSEM",
    "number": "3047",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "806843",
    "code": "HSEM3047V",
    "subject": "HSEM",
    "number": "3047",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; emphasis on active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "805308",
    "code": "HSEM3048H",
    "subject": "HSEM",
    "number": "3048",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; active learning; interdisciplinary. Taught by music faculty.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "806445",
    "code": "HSEM3048V",
    "subject": "HSEM",
    "number": "3048",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course; active learning and writing development; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "805309",
    "code": "HSEM3049H",
    "subject": "HSEM",
    "number": "3049",
    "honors": true,
    "writingIntensive": false,
    "name": "Dice Hist, Math, Phil, Culture",
    "fullname": "Dice: History, Mathematics, Philosophy, and Culture",
    "info": "In this course we will explore the world of dice. After a brief (one-lecture) survey of the history of dice prior to the 17th century, the course will be divided into four sections (although the material from each section will overlap with earlier sections):1. We will explore the mathematical revolution that occurred during the 17th Century that led to the development of the modern mathematical theory of probability, and we will pay special attention to the probabilistic analysis of dice games.2. We will explore the various philosophical puzzles that arise when we try to understand what probability claims “really mean”, and examine a number of different philosophical interpretations of probability.3. We will explore the recent 20th and 21st century enthusiasm for tabletop and roleplaying games, and the role that various kinds of dice play in such games.4. We will return to the mathematics of dice, exploring what have come to be called “crazy dice” – non-standard dice that have various unexpected properties.",
    "prereq": []
  },
  {
    "uid": "009431",
    "code": "HSEM3050H",
    "subject": "HSEM",
    "number": "3050",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussions, active learning. Often interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "801852",
    "code": "HSEM3051H",
    "subject": "HSEM",
    "number": "3051",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary. Taught by political Science faculty.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "801853",
    "code": "HSEM3052H",
    "subject": "HSEM",
    "number": "3052",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course; emphasizes active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "801854",
    "code": "HSEM3053H",
    "subject": "HSEM",
    "number": "3053",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors Seminar",
    "prereq": []
  },
  {
    "uid": "803353",
    "code": "HSEM3054H",
    "subject": "HSEM",
    "number": "3054",
    "honors": true,
    "writingIntensive": false,
    "name": "Minds, Brains, and Innovation",
    "fullname": "Minds, Brains, and Innovation",
    "info": "This seminar course will examine recent research findings from psychology and cognitive neuroscience to arrive at a better understanding of the conditions that foster, or impede, flexible thinking or 'mental agility.'  Two key questions will be examined throughout. First, what are the relative roles of predominantly controlled or deliberate modes of cognitive processing versus more automatic (or spontaneous) processes in enabling and sustaining creatively adaptive thinking?  Second, how do mental representations at differing levels of specificity highly abstract versus highly specific contribute to flexible thinking?",
    "prereq": []
  },
  {
    "uid": "801855",
    "code": "HSEM3055H",
    "subject": "HSEM",
    "number": "3055",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics course.",
    "prereq": []
  },
  {
    "uid": "817967",
    "code": "HSEM3056H",
    "subject": "HSEM",
    "number": "3056",
    "honors": true,
    "writingIntensive": false,
    "name": "Psych of Malice & Trumpism",
    "fullname": "Malignant Political Aggression, Heroic Resistance and Trumpism",
    "info": "This seminar begins with an examination of the role of conformity, denial, and obedience in perpetrating malignant political aggression. We will examine personal and situational forces, social dynamics of small group norms and behaviors, and broader social and institutional arrangements, which interact to induce individuals and groups to participate in various forms of malignant political aggression. We will examine the role of dehumanization, compartmentalized thinking, and perception, personality predispositions, etc. To counterbalance the pessimism inherent in this focus, we will also examine political heroism and altruism, which often arise in response to malignant political aggression. Are these resisters ordinary or extraordinary people, and how do they differ from perpetrators? How many ethical 'kudos’ do they deserve and why? What is their role in instantiating the larger norms of ethical conduct in our political system? In examining these more general forces, we will rely on specific examples such as the holocaust, the massacre at My Lai, the rescuers of Le Chambon, and several others. Finally, through the lens developed in this seminar, we will assess U.S. government actions, and resistance to those actions, of the last four years.",
    "prereq": []
  },
  {
    "uid": "801856",
    "code": "HSEM3059H",
    "subject": "HSEM",
    "number": "3059",
    "honors": true,
    "writingIntensive": false,
    "name": "Neuroscience of Music & Lang.",
    "fullname": "The Neuroscience of Music and Language",
    "info": "Music and language are fascinating products of the human brain and universal human abilities with many similarities in their acoustics, structure, evolutionary history and social expressive functions. This seminar highlights modern brain research studies on the associations and disassociations between music and language and the implications for intervention for various clinical populations. We will examine music and language in all aspects of structure and use in comparison with social bonding in animal communication systems to inform our understanding of the biology and evolution of human music and language. We are especially interested in how infants acquire their linguistic and emotional expressive power and how the early learning experience alters the brain, thereby affecting an individual's future perceptions and actions. Both historical perspectives and current research will be introduced and discussed. ",
    "prereq": []
  },
  {
    "uid": "009432",
    "code": "HSEM3060H",
    "subject": "HSEM",
    "number": "3060",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course designed to add breadth and depth to the education of honors students.  Discussions and active learning. Often interdisciplinary in perspective.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "819893",
    "code": "HSEM3064H",
    "subject": "HSEM",
    "number": "3064",
    "honors": true,
    "writingIntensive": false,
    "name": "Historians Write Autobiography",
    "fullname": "Historians Write Autobiography",
    "info": "Historians who write autobiography face some obstinate challenges.  As professional historians they know their sources are necessarily selective and incomplete, and that every perspective brings its own bias.  Their own flawed memory tells them as much.  Yet they intend to capture something about their own lived experience that, when recounted with as much candor as possible, will illuminate their personal past in ways that speak to others.  When historians bring their skills of critical historical analysis to their own lives, what kinds of autobiographies do they produce?  How is their understanding of the craft of history, its methods and its limitations, reflected in their personal life stories?  We will explore how historians have engaged in what can be called a writing of the self, with a focus on the second half of the 20th century.  We will examine how they place themselves into particular social and political contexts as historical figures with a valuable perspective on their life and times.  Students will research and write their own short autobiographical pieces.",
    "prereq": []
  },
  {
    "uid": "819885",
    "code": "HSEM3065H",
    "subject": "HSEM",
    "number": "3065",
    "honors": true,
    "writingIntensive": false,
    "name": "Trust, Technology & Human Comm",
    "fullname": "Trust, Technology and Human Communication",
    "info": "Trust is a central component of our lives. Without trust, we could not function as individuals, and we would not have functioning social and civic systems. How and why do humans trust? Whether face-to-face or mediated by technology, one-on-one or in groups, the basis for how we build trustworthy, durable relationships is our communication. For millennia, this communication took place with our bodies: via gestures, facial expressions, sounds, movements, and eventually, through spoken language. Later, writing and its technologies supplanted earlier forms, creating new opportunities for trust. In this seminar, we will explore the relationship between trust, technologies, and human communication by a) reviewing research from sociology, rhetoric, psychology, and other fields to understand the nature of trust; b) exploring the history of communication technology, from the oral cultures to the first forms of writing to the printing press to the Internet; c) investigating trust, technology, and communication in specific contexts, with a focus on social media and the Internet and key features such as the confirmation bias and the changing nature of expertise. These contexts will include medical/health communication; social actions; online communities; political and scientific reporting.",
    "prereq": []
  },
  {
    "uid": "818783",
    "code": "HSEM3066H",
    "subject": "HSEM",
    "number": "3066",
    "honors": true,
    "writingIntensive": false,
    "name": "The Tale of Genji",
    "fullname": "The Tale of Genji: A View of Aristocratic Culture in Early Japan",
    "info": "The early eleventh-century novel The Tale of Genji by the Japanese court lady Murasaki Shikibu is thought by many to be the first novel in world history and the first major work by a known woman author. In this class, we will read the entire work in Royall Tyler’s English translation and explore its literary qualities, its ways of representing character, and its methods of plot construction. Can this book be treated as a “modern novel,” or can it only be understood as a product of its times? Does the existence of a large community of writing women at this point allow us to explore a distinctive “female perspective” on this period? How did women and men express themselves and communicate through literature, and how did gender difference express itself in what they wrote?",
    "prereq": []
  },
  {
    "uid": "801857",
    "code": "HSEM3067V",
    "subject": "HSEM",
    "number": "3067",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Active learning. Frequently interdisciplinary.prereq: Jr or Sr honors",
    "prereq": []
  },
  {
    "uid": "803354",
    "code": "HSEM3068H",
    "subject": "HSEM",
    "number": "3068",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussion oriented, emphasizes active learning. Frequently interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "818822",
    "code": "HSEM3069H",
    "subject": "HSEM",
    "number": "3069",
    "honors": true,
    "writingIntensive": false,
    "name": "Literature and Medicine",
    "fullname": "Literature and Medicine",
    "info": "The sign carved above the door to the ancient Library at Thebes read: “Medicine for the Soul.” This course focuses on the intersection of literature and medicine, both from the point of view of the medical field and from a literary standpoint—medicine in literature, but also literature in medicine. For example, both narrative and storytelling are essential components of literature but they can also help doctors understand patients’ stories. Likewise, the recent documentary Still Dreaming tells the story of a production of Shakespeare’s A Midsummer Night’s Dream by residents in a nursing home, revealing the benefits of the literary arts for health and happiness. Throughout the semester, we will examine works that connect the world of science with the long history of recorded human experiences in the literature of illness, the body, and death. Through analysis of novels, short stories, memoirs, poetry, drama, film and television, we will explore the intersection of literary works, narrative studies, and medical narratives to address the healing power of words. This course should interest students who care about how literature makes a difference in the world, and who are curious about how medicine is related to the arts. The course may include guest speakers as well as a visit to the Center for Humanities in Medicine at the Mayo Clinic.",
    "prereq": []
  },
  {
    "uid": "009433",
    "code": "HSEM3070H",
    "subject": "HSEM",
    "number": "3070",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course designed to add breadth and depth to the education of honors students.  Discussions and active learning. Often interdisciplinary in perspective.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "825851",
    "code": "HSEM3071H",
    "subject": "HSEM",
    "number": "3071",
    "honors": true,
    "writingIntensive": false,
    "name": "People, Pines, and Fire",
    "fullname": "People, Pines, and Fire: Shaping the forested landscapes of Minnesota and the Great Lakes",
    "info": "Wildland fire as an agent of renewal, vegetation change, and maintenance has been a critical process in the pine forests of the Upper Great Lakes. The vast pineries, so sought after by settler-colonialists as a commodity evolved over millennia with fire. Fires were both ‘natural’, ignited by lightning strikes, and fire was applied judiciously by Native American groups to manage landscapes and improve resources. It was an act of reciprocity: carefully tending the land to keep it healthy, while utilizing resources in return. However, the advent of effective fire suppression to protect forests first as a commodity and later for recreational enjoyment has led to substantial changes in forest communities while at the same time erasing an important cultural activity from the landscape. This seminar course explores the deep connections between fire and the emergence of Great Lakes forests, as well as the cultural use of fire as a tool. In this course, we will explore the development of effective fire suppression, the emergence of fortress-ecology/conservation, and the impacts of reduced fire activity on forest resilience. We will also discuss the concept of ‘wilderness’ and traditional ecological knowledge and the relationship with fire management today, particularly within the framework of a changing climate. This course is meant to merge interdisciplinary topics in ecology, climatology, and geography to explore the important connections between humans and their physical environment in the Upper Great Lakes pine landscapes. The course will be discussion based with frequent visits from resource professionals and the instructor’s Indigenous research collaborators.",
    "prereq": []
  },
  {
    "uid": "826033",
    "code": "HSEM3072H",
    "subject": "HSEM",
    "number": "3072",
    "honors": true,
    "writingIntensive": false,
    "name": "Leonardo da Vinci",
    "fullname": "Leonardo da Vinci: Between Art and Science, History and Myth",
    "info": "This course is designed to introduce students to Leonardo da Vinci the historical man, and to his rich body of work produced during his lifetime from 1462-1519. It is also designed to consider as well how a mythic understanding of Leonardo da Vinci was also fashioned from this same historical foundation, turning him into an almost supernatural icon of the universal creative genius. Especially noteworthy in the mythic idea of Leonardo is his seeming transcendence of the imagined “Two Cultures” divide between the Arts and the Sciences, and his identity as a virtuoso artist in multiple domains simultaneously (painting, scuplture, architecture, and the visual arts overall) a pioneering figure in science, engineering, and the history of technology in fields ranging from anatomy to hydraulics and engineering to physics. How, this course will ask, did each of these aspects of Leonardo’s work come to be a part of his historical life and accomplishments, and how after his death was his fully historical life and work refashioned into our contemporary mythistorical understanding of Leonardo as a singular universal genius and seemingly supernatural \"Renaissance Man\"? The course will pursue these topics in three parts. Part I (Weeks 1-7) will be devoted to the historical Leonardo, and during spring break (March 3-12) we pursue Part II by traveling to Italy to experience Leonardo’s Italy as it exists today, and to start connecting the historical life with the imagined legacy of it. In Part III (weeks 12-15), we will consider the invention of the mythistory of Leonardo in the centuries after his death, especially the forging in the modern era (after 1870) of his contemporary identity as a seemingly magical and superhuman creative genius who defies interpretation in ordinary historical terms.  ",
    "prereq": []
  },
  {
    "uid": "817224",
    "code": "HSEM3073H",
    "subject": "HSEM",
    "number": "3073",
    "honors": true,
    "writingIntensive": false,
    "name": "The Literature of Bob Dylan",
    "fullname": "Tradition and Defiance: The Literature of Bob Dylan",
    "info": "This course critically analyses and celebrates the poetic achievements of Bob Dylan, America's most important songwriter and musician and recent Nobel Prize winner in Literature. We will study how his artistic evolution, from folk singer to rock icon and poet, comes from his immersion in American literature and lyrics that range from traditional songs to defiant, political protest. The results are timeless uses for poetry as Dylan's music redefines how poetry influences and shapes popular culture. The main goal of the course is to come to an understanding of how his unique vision begins within the poetic traditions of the past and, as his songs redefine what poetry is, takes contemporary expression toward new definitions for literature. By the end of the course, the student of Dylan's work should master a body of knowledge and a mode of inquiry in Dylan studies and understand the role of creativity, innovation, discovery, and expression across such disciplines as American literature, folk and rock music, the history of political protest, and the popular artist in society.",
    "prereq": []
  },
  {
    "uid": "817222",
    "code": "HSEM3074H",
    "subject": "HSEM",
    "number": "3074",
    "honors": true,
    "writingIntensive": false,
    "name": "Development: Power of an Idea",
    "fullname": "Development!: The Power of an Idea",
    "info": "This seminar will take stock of the astonishingly versatile concept of \"development.\" We will critically probe its workingsand of its constellation of affine terms: \"progress,\" 'improvement,\" and \"growth\"across a range of geographic and historical settings. We will ask: What is development and why has it come to saturate common sense as an indispensable given of our modern existence? How should we account for the power of development in the lives of rich and poor nations, and rich and poor people? What role did the idea of development play in how the West has thought about itself in relation to the non-West? Finally, how do emerging economic powers such as China and India, who are now large donors of development aid in Africa and Latin America, imagine development in contrast to their counterparts in the West? In terms of content,  the course will introduce students to, both, the classic literature on development as well latest writings on it.",
    "prereq": []
  },
  {
    "uid": "817232",
    "code": "HSEM3075H",
    "subject": "HSEM",
    "number": "3075",
    "honors": true,
    "writingIntensive": false,
    "name": "Humans & Rights-Historical",
    "fullname": "Humans and Rights in Historical Perspective",
    "info": "In the second half of the twentieth century, in the wake of World War II and decolonization, a language of human rights developed that emphasized rights as individual and universal. Many of us now take this particular notion of human rights as a given. In this seminar, we will explore the complicated and multi-faceted history of how societies in different parts of the world have defined what it is to be human, the treatment owed to humans, and various kinds of rights. Some of these philosophies are grounded in religion and others in secularism. Some identify the nation-state as the adjudicator of rights, while others would empower international organizations or grassroots movements. For some, the individual is sacrosanct, while for others, persons are inextricably embedded in social webs. We will study how these concepts have changed over time as the globe has become increasingly interconnected and consider their relevance and application in our contemporary society.The semester will be divided into five mini units. In the first, we will explore concepts of the human and of rights in major faith traditions. In the second, we will examine the debates that emerged from European colonialism in the Atlantic world. In the third, we will study the emergences of an explicit language of human rights after World War II. In the fourth, we will look at human rights issues in the United States. And in the final unit, you will pursue your own research and collaborate in small groups to make presentations and facilitate discussion around common themes.",
    "prereq": []
  },
  {
    "uid": "817990",
    "code": "HSEM3076H",
    "subject": "HSEM",
    "number": "3076",
    "honors": true,
    "writingIntensive": false,
    "name": "Children and Cinema",
    "fullname": "Children and Cinema: The Child’s Mind, the Child’s Eye, and the Moving Image",
    "info": "We often think that children perceive the world differently from adults. In cinema, this perceived difference has led, on the one hand, to anxiety about film's effects on youth. On the other hand, it has led to a search for cinematic forms that respond to children's visual and cognitive “uniqueness.” Indeed, throughout the world, childhood vision has long served as impetus and metaphor for re-envisioning cinema: for honing what it looks like, how it is produced, and how it is circulated and exhibited. This seminar examines these provocative and fruitful intersections between childhood and cinema. We will ask how the child viewer has been understood cognitively, politically, and socially, and analyze films made for children or inspired by understandings of children's minds and eyes. We will also explore how childhood and youth have sparked institutional developments in cinema, and influenced film and media studies as a discipline. Our subjects include, among others, research on children and the movies (e.g., the interwar Payne Fund Studies); the intersections between developmental psychology and children's films; childhood perception, the avant-garde, and animation; youth and postwar “new waves”; and children's film studios as pedagogical spaces for filmmakers. Films and readings are drawn from the United States, United Kingdom, Eastern and Western Europe, the Middle East, Africa, and Asia.",
    "prereq": []
  },
  {
    "uid": "818175",
    "code": "HSEM3076V",
    "subject": "HSEM",
    "number": "3076",
    "honors": true,
    "writingIntensive": true,
    "name": "Children and Cinema",
    "fullname": "Children and Cinema: The Child's Mind, the Child's Eye, and the Moving Image",
    "info": "We often think that children perceive the world differently from adults. In cinema, this perceived difference has led, on the one hand, to anxiety about film's effects on youth. On the other hand, it has led to a search for cinematic forms that respond to children's visual and cognitive \"uniqueness.\" Indeed, throughout the world, childhood vision has long served as impetus and metaphor for re-envisioning cinema: for honing what it looks like, how it is produced, and how it is circulated and exhibited. This seminar examines these provocative and fruitful intersections between childhood and cinema. We will ask how the child viewer has been understood cognitively, politically, and socially, and analyze films made for children or inspired by understandings of children's minds and eyes. We will also explore how childhood and youth have sparked institutional developments in cinema, and influenced film and media studies as a discipline. Our subjects include, among others, research on children and the movies (e.g., the interwar Payne Fund Studies); the intersections between developmental psychology and children's films; childhood perception, the avant-garde, and animation; youth and postwar \"new waves;\" and children's film studios as pedagogical spaces for filmmakers. Films and readings are drawn from the United States, United Kingdom, Eastern and Western Europe, the Middle East, Africa, and Asia.",
    "prereq": []
  },
  {
    "uid": "825871",
    "code": "HSEM3077H",
    "subject": "HSEM",
    "number": "3077",
    "honors": true,
    "writingIntensive": false,
    "name": "Myths/Legends of Polar North",
    "fullname": "Myths and Legends of the Polar North",
    "info": "This course is a global comparative investigation of the traditional myths, legends, and folktales that have been produced by diverse communities ringing the northern polar regions; we will draw a circle around the top of the world (approximately the 58th or 60th parallel) and see what we find. Thus, we will study many cultures and their literatures and beliefs that are not often combined: the indigenous cultures of North America and beyond; the Russian and Baltic regions; the Scandinavian countries and Finland; Ireland, England, Scotland, and Wales. We will draw attention to similarities and differences in these literatures and cultures; we will examine the phenomenon of cultural contact and the migration of stories and beliefs across cultures; we will explore the world of traditional oral folktales and poetry. We will also survey a broad time span: although some of our tales were only first written down and recorded in the nineteenth and twentieth centuries, much of our material reaches back into the premodern past.",
    "prereq": []
  },
  {
    "uid": "826115",
    "code": "HSEM3078H",
    "subject": "HSEM",
    "number": "3078",
    "honors": true,
    "writingIntensive": false,
    "name": "The Search",
    "fullname": "The Search: Life, Death, and Meaning",
    "info": "Does life have a purpose? What does it mean to say that a life has been lived well or poorly? Those of us who are troubled by such questions see them as critical to the practical decisions we must make about how to live. What counts as meaningful work? How are love and friendship related to a well-lived life? What does it mean to live authentically? Is the existence of God necessary for life to have meaning?  This course will use philosophy, fiction, and film to explore larger questions around the meaning and purpose of life, with special attention to their relationship to digital technology, politics and medicine.",
    "prereq": []
  },
  {
    "uid": "825883",
    "code": "HSEM3079V",
    "subject": "HSEM",
    "number": "3079",
    "honors": true,
    "writingIntensive": true,
    "name": "Art and Revolution",
    "fullname": "Art and Revolution",
    "info": "This class will explore the relationship between political revolution and artistic expression. The primary focus will be on the Soviet Union and Mexico, both famous for the dramatic artistic developments that accompanied their radical political transformation. As secondary points of comparison, the class will also study the art arising from other revolutions in other countries, including the United States, France, Cuba, and Algeria. The main concern with be with the visual arts, especially cinema and painting, although some consideration will be given to sculpture, printmaking, architecture, and design, as well as to literature. To frame the overall topic, we will also do some readings that address the historical and conceptual issues associated with the idea of revolution.",
    "prereq": []
  },
  {
    "uid": "009434",
    "code": "HSEM3080H",
    "subject": "HSEM",
    "number": "3080",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course designed to add breadth and depth to the education of honors students.  Discussions and active learning. Often interdisciplinary in perspective.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "817988",
    "code": "HSEM3081V",
    "subject": "HSEM",
    "number": "3081",
    "honors": true,
    "writingIntensive": true,
    "name": "Anthrplgy, Place, Displacement",
    "fullname": "Anthropology of Place and Displacement in the Contemporary World",
    "info": "This course asks questions about the meaning of place, the relationship of space to place, the relationship of identity to place, and the relationship of place to environmental change in the event of industrial pollution, development projects, natural disasters and climate change. Theories of and ethnographic accounts of space and place in Cultural Anthropology and Geography will be discussed. In addition to foundational texts in the topic, we will also read contemporary accounts of non-western places. ",
    "prereq": []
  },
  {
    "uid": "818933",
    "code": "HSEM3082H",
    "subject": "HSEM",
    "number": "3082",
    "honors": true,
    "writingIntensive": false,
    "name": "Race and Sport",
    "fullname": "Race and Sport",
    "info": "This class examines how race, gender, and sport intersect as sites of resistance and reform in twentieth-century American life. With the intensification of Jim Crow coinciding with the professionalization and commercialization of sports, athletes of color became central to American debates about science, citizenship, class, ethnicity, sexuality, social mobility, belonging, culture, and entitlement. This seminar will be particularly interested in how athletes of color forced a place for themselves in sports like baseball, boxing, football, golf, and basketball by exercising different models of political protest, citing an urgent need for social justice reforms that spread beyond the realm of sport.",
    "prereq": []
  },
  {
    "uid": "819248",
    "code": "HSEM3083H",
    "subject": "HSEM",
    "number": "3083",
    "honors": true,
    "writingIntensive": false,
    "name": "Language and Food",
    "fullname": "Language and Food",
    "info": "What could be more central to our lives than language and food?  We learn language (together with gesture) and the tastes (textures, smells, visual features, and sounds) that we associate with food early in our lives, and both form an important part of our identities.  In this course, we will address the following questions: 1) How do we organize our language and bodies around food, i.e., how do we use them to get to and from the table and to proceed in a meal (e.g., at a sushi restaurant)? 2) How do we use language to taste, identify and assess food, and how do these fine distinctions and discriminations define us as people and relate to our identity? 3) How do we talk about our experience of food and tell stories about food? 4) What metaphors do we have for food? 5) How does language relate to gender in the context of food? 6) How is language used to socialize children around food? We will explore the relation between language and food by analyzing actual conversations among people eating a variety of foods. The conversations will be in a variety of languages (including English, Japanese, Chinese, Lao, Kri, Eegimaa, Wolof, Italian, Persian, German, Danish, French, Russian, Swedish, Dutch and Spanish).  The class will be most rewarding for students who like to cook/eat, talk about food, and educate their palate.",
    "prereq": []
  },
  {
    "uid": "826102",
    "code": "HSEM3084H",
    "subject": "HSEM",
    "number": "3084",
    "honors": true,
    "writingIntensive": false,
    "name": "Communication and Sport",
    "fullname": "Analysis of the Intersection of Communication and Sport",
    "info": "This course is designed to explore in depth the relationship between communication and sport.  We will examine theories of communication and connect them to sport.  This course will not be a discussion of sport for sport’s sake, but instead ask important questions about how we use sports as a means to create community, define gender and race, and promote or refute political ideologies, among other things. Readings will examine the interrelationship of sports and these critical topics. The purpose is to ask questions that help illuminate the symbolic nature of sports in our or any culture. ",
    "prereq": []
  },
  {
    "uid": "826533",
    "code": "HSEM3085H",
    "subject": "HSEM",
    "number": "3085",
    "honors": true,
    "writingIntensive": false,
    "name": "Housing Crisis in US",
    "fullname": "Why They Can't Go Home: The Housing Crisis in the United States",
    "info": "Communities across the country are experiencing symptoms of the housing crisis--neighborhoods segregated by race and class, decrepit inner-city and rural housing, soaring home prices and apartment rents, renters and assisted-living residents evicted, longtime residents displaced by gentrification, overcrowded shelters, and people living in tent cities or on mean streets.        To probe the housing crisis, this course examines three geographic areas as case studies: Minneapolis-St. Paul, Milwaukee, and Bedford-Stuyvesant (in Brooklyn, New York).  The mechanisms we will study include restrictive racial covenants, white violence, redlining and mortgage lending, white flight to suburbs, eviction, and gentrification.  We will differentiate the individual, institutional, and systemic levels of racism and classism that contribute to the patterned inequality of housing in the United States.        In addition to the housing crisis, this course will help you understand the different genres that present information.  You will analyze creative nonfiction, scholarship, law, videos, and photographs.  They use different modes -- such as words or images, stories or statistics, dialogue or description -- to convey meanings that foreground and background different aspects of any given issue. ",
    "prereq": []
  },
  {
    "uid": "820219",
    "code": "HSEM3087H",
    "subject": "HSEM",
    "number": "3087",
    "honors": true,
    "writingIntensive": false,
    "name": "History through Memoir",
    "fullname": "History through Memoir",
    "info": "This honors seminar uses memoirs \"non-fictional life stories narrated in the first person?\" as a lens into the past and, just as importantly, as a way to investigate what counts as \"history\" itself.  The relationship between personal narratives and professionally produced histories is often fraught or confused, even though both can reasonably be understood as forms of creative non-fiction.  Is the memoirist responsible to the historical record in the same way as an historian?  Does the historian know how to assess and appreciate the power of personal memory?  What kinds of memoirs do historians write?  We will examine a range of memoirs that speak variously about historical and emotional truths, about memory and identity and place, about the ability of individual experience to illuminate a broader social and political history.  We will attend to the narrator?s voice and explore how certain kinds of writing enable (even produce) certain kinds of discoveries.  Throughout, we will discuss the gains and the limitations of using personal stories to understand past experience. A note of clarification: while autobiographies tend to be chronological narratives of most of a person's life (without the ending, of course), memoirs focus more selectively--and often without regard to linear chronology--on crucial moments or themes in the narrator's experience.  This course prioritizes memoirs over autobiographies, and it takes most of its examples from the boom in memoir writing over the last three decades.  It does not offer a history of memoir as a genre. In particular, it features memoirs that go beyond the experiences of an individual narrator to reveal broader social and political contexts.",
    "prereq": []
  },
  {
    "uid": "820230",
    "code": "HSEM3087V",
    "subject": "HSEM",
    "number": "3087",
    "honors": true,
    "writingIntensive": true,
    "name": "History through Memoir",
    "fullname": "History through Memoir",
    "info": "Memoirs—non-fictional life stories—offer an intriguing lens into the past.  They vividly portray personal experiences, but they also raise questions about the reliability of the narrator. What kinds of histories are memoirs?  Is the memoirist responsible to the historical record in the same way as a professional historian?  What kinds of memoirs do historians write?  We will examine memoirs written in the last two decades that explore ethnicity, identity, migration, memory, and belonging, and that use individual experience to illuminate a broader social and political history in the United States.  We will attend to the narrator’s voice and writing strategies.  In addition to writing short analytical and reflective pieces, you will research and write your own (8-10 page) personal narrative, placing a personal experience into its historical context and creating a sense of specific time and place.  Seeing history through the lens of memoir shows how lives are shaped by specific historical circumstances, even as people make choices about how to frame and narrate their experiences. ",
    "prereq": []
  },
  {
    "uid": "826534",
    "code": "HSEM3089H",
    "subject": "HSEM",
    "number": "3089",
    "honors": true,
    "writingIntensive": false,
    "name": "Conflict and the Arts",
    "fullname": "Worlds of Conflict and the Arts",
    "info": "War has been part of human history as well as a central subject of ethical inquiries and artistic expression since ancient times. In this course we will explore worlds of conflict through literary and artistic works that respond to acts of war and reflect upon the ethical issues thereby engendered. We will engage ancient epics from India, Greece, Mali, and Japan; first-hand accounts and philosophical debates pertaining to European colonialism, as well as the ever-expanding warring world of the nineteenth and twentieth centuries.  Throughout our journey, we will investigate interrelated notions of ‘just war’, heroic codes, and propaganda, as well as artistic reactions to human suffering or triumph.  We will be looking at art, viewing theatre performances and films, and listening to music as a means of engaging with the moral dimensions and tragic consequences of human conflict. ",
    "prereq": []
  },
  {
    "uid": "794337",
    "code": "HSEM3090H",
    "subject": "HSEM",
    "number": "3090",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "N/Aprereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "818271",
    "code": "HSEM3092H",
    "subject": "HSEM",
    "number": "3092",
    "honors": true,
    "writingIntensive": false,
    "name": "Music, Revolution, War",
    "fullname": "Music, Revolution, War",
    "info": "From Beethoven to Woodstock, from the French Revolution to the protests that brought down Communist regimes at the end of the 1980s, music has played a central role in inspiring political and social change. In an even longer tradition, music has summoned soldiers to risk their lives, even as it likewise, whether in a sacred ceremony or on the political stage, has inspired mass action in peace. This course will proceed historically, examining moments when revolution, ideological conflict, or war suggested vast changes were underway in society and culture, reflected in, but also instigated by music.",
    "prereq": []
  },
  {
    "uid": "818697",
    "code": "HSEM3092V",
    "subject": "HSEM",
    "number": "3092",
    "honors": true,
    "writingIntensive": true,
    "name": "Music, Revolution, War",
    "fullname": "Music, Revolution, War: From Napoleon to Trump",
    "info": "From Beethoven to Woodstock, from the French Revolution to the protests that brought down Communist regimes at the end of the 1980s, music has played a central role in inspiring political and social change. In an even longer tradition, music has summoned soldiers to risk their lives, even as it likewise, whether in sacred ceremony or on the political stage, has inspired mass action in peace. This course will proceed historically, examining moments when revolution, ideological conflict, or war suggested vast changes were underway in society and culture, reflected in, but also instigated by music. No prerequisites and no musical background assumed.",
    "prereq": []
  },
  {
    "uid": "009760",
    "code": "HSEM3093H",
    "subject": "HSEM",
    "number": "3093",
    "honors": true,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Additional research related to seminar topic.Prereq [Jr or sr],  honors, instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "803190",
    "code": "HSEM3103H",
    "subject": "HSEM",
    "number": "3103",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar; emphasis on active learning; frequently interdisciplinary.prereq: Jr or sr honors",
    "prereq": []
  },
  {
    "uid": "811729",
    "code": "HSEM3106H",
    "subject": "HSEM",
    "number": "3106",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Jr or sr honors students",
    "prereq": []
  },
  {
    "uid": "009435",
    "code": "HSEM3110V",
    "subject": "HSEM",
    "number": "3110",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Writing Intensive Honors Seminar",
    "info": "Special topics course. Discussions, active learning. Often interdisciplinary in perspective.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "009436",
    "code": "HSEM3120V",
    "subject": "HSEM",
    "number": "3120",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course designed to add breadth and depth to the education of honors students.  Discussions and active learning. Often interdisciplinary in perspective.prereq: Jr or sr, honors",
    "prereq": []
  },
  {
    "uid": "009437",
    "code": "HSEM3130V",
    "subject": "HSEM",
    "number": "3130",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course designed to add breadth and depth to the education of honors students.  Discussions and active learning. Often interdisciplinary in perspective.prereq: Jr or sr, honors",
    "prereq": []
  },
  {
    "uid": "009438",
    "code": "HSEM3140V",
    "subject": "HSEM",
    "number": "3140",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course designed to add breadth and depth to the education of honors students.  Discussions and active learning. Often interdisciplinary in perspective.prereq: Jr or sr, honors",
    "prereq": []
  },
  {
    "uid": "811332",
    "code": "HSEM3201H",
    "subject": "HSEM",
    "number": "3201",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar. Emphasis on active learning. Frequently interdisciplinary.prereq: Jr or sr honors student",
    "prereq": []
  },
  {
    "uid": "811731",
    "code": "HSEM3201V",
    "subject": "HSEM",
    "number": "3201",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Jr or sr honors student",
    "prereq": []
  },
  {
    "uid": "811883",
    "code": "HSEM3202H",
    "subject": "HSEM",
    "number": "3202",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Honors seminar. Emphasis on active learning. Frequently interdisciplinary.prereq: Jr or sr honors student",
    "prereq": []
  },
  {
    "uid": "818304",
    "code": "HSEM3203H",
    "subject": "HSEM",
    "number": "3203",
    "honors": true,
    "writingIntensive": false,
    "name": "Place-Hist, Cultural, Personal",
    "fullname": "An Understanding of Place: Historic, Cultural, and Personal Investigations",
    "info": "Who we are as designers and planners is a culmination of personal experiences, historical and cultural influences. Many times these influences interact in ways that guide our thoughts and designs without our reflection on the impact they can have on us and without an understanding of the implicit bias they can extend and impart to our work. The goal of this class is to use personal reflection essays, combined with explorations of cultural influences on our understanding of place to help reveal the lenses through which we evaluate the world and that guide our efforts and expectations as place-makers.",
    "prereq": []
  },
  {
    "uid": "805416",
    "code": "HSEM3205H",
    "subject": "HSEM",
    "number": "3205",
    "honors": true,
    "writingIntensive": false,
    "name": "Miss. River: Climate, Justice",
    "fullname": "Environmental Justice and Climate Futures: the Mississippi River Corridor",
    "info": "The urgent pressures for equity and justice, and for a response to the changing climate, are complex, intertwined, \"wicked problems.\" The Mississippi River, a storied part of the American landscape that is literally and figuratively the center of the North American continent, provides a profound space to explore how the river and American society have shaped each other. The seminar uses an Environmental Justice lens to examine the past, present, and potential futures of the river's biological, physical, and socio-cultural systems in a changing climate. The seminar will bring together knowledge from a number of academic disciplines, as well as community and cross-sector professional and agency perspectives.",
    "prereq": []
  },
  {
    "uid": "802659",
    "code": "HSEM3206H",
    "subject": "HSEM",
    "number": "3206",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "801858",
    "code": "HSEM3207H",
    "subject": "HSEM",
    "number": "3207",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "796396",
    "code": "HSEM3210H",
    "subject": "HSEM",
    "number": "3210",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Book Discussion",
    "fullname": "Honors Book Discussion",
    "info": "Students read a text, meet to discuss. Lectures on text by faculty, other experts.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "826781",
    "code": "HSEM3231H",
    "subject": "HSEM",
    "number": "3231",
    "honors": true,
    "writingIntensive": false,
    "name": "Queer and Feminist Hip Hop",
    "fullname": "It's Giving...: Queer and Feminist Approaches to Hip Hop",
    "info": "This course examines our current moment in hip hop wherein there are a number of high-profile women and LGBTQ+ rappers, and it also provides insight into the long history of queer and feminist practitioners in—as well as queer and feminist analyses of—hip hop. We will learn about and analyze hip hop music, music videos, films, novels, dance, art, and other related Black cultural performances in order to examine and highlight what’s politically at stake when we approach hip hop through queer and feminist lenses. The goal is to: 1) Explore the people who, and practices and moments that, made/make our current era of hip hop possible and 2) Speak to how the racialized political foundation and ongoing import of hip hop will always be tied to queer and feminist politics and visions.",
    "prereq": []
  },
  {
    "uid": "827045",
    "code": "HSEM3232H",
    "subject": "HSEM",
    "number": "3232",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Research in London",
    "fullname": "Honors Research in London",
    "info": "This course provides Honors students with the opportunity to undertake a research project in the context of their international education experience. The course is structured as 5 weeks of reading and discussion, followed by 7 weeks primarily devoted to research in London.  Students will be guided towards London research opportunities in consultation with the Learning Abroad Center, instructional faculty at UMN and in London, on-site partners, and shaped by local resources and expertise. Students will be introduced to core research concepts and will develop research skills through designing, executing, writing, and presenting their own research project within frameworks appropriate to their discipline. The topics students explore will be consistent with majors and individual interests and exploit the unique opportunities available in London.",
    "prereq": []
  },
  {
    "uid": "801859",
    "code": "HSEM3307H",
    "subject": "HSEM",
    "number": "3307",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors seminar",
    "info": "TBD",
    "prereq": []
  },
  {
    "uid": "811906",
    "code": "HSEM3308H",
    "subject": "HSEM",
    "number": "3308",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Jr or sr honors student",
    "prereq": []
  },
  {
    "uid": "812862",
    "code": "HSEM3308V",
    "subject": "HSEM",
    "number": "3308",
    "honors": true,
    "writingIntensive": true,
    "name": "Incarceration and the Family",
    "fullname": "Incarceration and the Family",
    "info": "It is now estimated that more than 2.7 million children have a parent currently behind bars, and more than 5 million children have experienced a parents incarceration in their lifetime. When parents are incarcerated, there are collateral consequences for children, families, communities, and society. Children of incarcerated parents are at risk for a number of adverse outcomes, including behavior problems, academic difficulties, substance abuse, and criminal activity. As a liberal education course with an explicit focus on Diversity and Social Justice in the United States, we will use an interdisciplinary perspective to explore the issue of mass incarceration, focusing on the impact of incarceration on children and families. This class will include opportunities to visit local correctional facilities and engage with community-based programs serving families impacted by incarceration. Topics will include parent-child contact during incarceration, intersections between incarceration and child welfare, systemic disparities by race and class, and intergenerational cycles of incarceration.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "803355",
    "code": "HSEM3320H",
    "subject": "HSEM",
    "number": "3320",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, discussions, active learning. Often interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "809797",
    "code": "HSEM3323H",
    "subject": "HSEM",
    "number": "3323",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Jr or Sr honors student",
    "prereq": []
  },
  {
    "uid": "818823",
    "code": "HSEM3327H",
    "subject": "HSEM",
    "number": "3327",
    "honors": true,
    "writingIntensive": false,
    "name": "Resilience in Children",
    "fullname": "Resilience in Children and Youth: Global Perspectives on Overcoming Trauma and Disaster",
    "info": "How do children overcome hazardous experiences to succeed in life? What do we know about the processes that reduce risk and promote resilience in young people confronted with the increasing hazards of war, disaster, migration, homelessness, and other extreme adversities around the world? This course examines the global literature on resilience in children and youth, highlighting the origins, methods, findings, controversies, and implications of resilience science for intervention, policy, and humanitarian action to prepare and protect young people against adversity. ",
    "prereq": []
  },
  {
    "uid": "805310",
    "code": "HSEM3404H",
    "subject": "HSEM",
    "number": "3404",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion; active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "808254",
    "code": "HSEM3410H",
    "subject": "HSEM",
    "number": "3410",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussion based. Frequently interdisciplinary.prereq: [Jr or sr] honors",
    "prereq": []
  },
  {
    "uid": "818827",
    "code": "HSEM3413H",
    "subject": "HSEM",
    "number": "3413",
    "honors": true,
    "writingIntensive": false,
    "name": "The Corporation in Question",
    "fullname": "The Corporation in Question",
    "info": "In the wake of the financial crisis of 2008, anti-corporate rhetoric in the U.S. reached a crescendo. Corporations – especially financial corporations – were blamed for the crisis and the misery it left in its trail. But this anger was just a spike in a long tradition of distrust and suspicion of corporations. Their legitimacy has always been in question. One of the legacies sf this tradition is the rich lode of epithets applied by Americans to corporations and their bosses including robber barons, trusts, economic royalists, malefactors of great wealth, merchants of death. The portrayal of corporations in popular entertainment – take Hollywood, for example -- is uniformly negative. The news media’s relations with corporations are predominantly adversarial. Running against corporations is a well-established way of running for elected public office.One of the events that did the most to crystallize public anger was the U.S. Supreme Court’s decision in Citizens United v. FEC (2010) that overturned limits on corporate spending to influence elections to federal office. In that case, a pro-business Court was widely seen as having used an arcane legal doctrine – about legal personhood -- to hand a victory to corporate interests. Perhaps mistakenly, the issue became defined as whether corporate persons qualified for the same constitutional Free Speech rights as natural persons. A bumper sticker at the time read: “I’ll believe a corporation is a person when the state of Texas executes one.” And presidential candidate Mitt Romney was greeted with derision when he told an audience at the Iowa State Fair that “Corporations are people, my friend.” “Of course they are,” he said. “Everything corporations earn ultimately goes to people. Where do you think it goes?” The case offers an opportunity to examine both the nature of the corporation and the sources of the hostility to it.This Honors seminar will try to solve is “why in America?” Why is it that, in probably the most thoroughly capitalist nation in the world, corporations are the most reviled? Of course, that the critics of corporations might answer that that is be precisely the point. Is it because it is in the United States that corporations have been left most free to plunder? The privileges in question are said to have enabled corporations to accumulate wealth. They include (1) limited liability, (2) legal personhood, (3) perpetual life, and (4) the free transferability of interests. You can see where these arguments are leading. If corporations owe their very existence to government and /or if corporations’ wealth is made possible by special privileges, then in return (it can be argued) society has the right to demand that corporations put the public interest ahead of the private interests of its shareholders. This is just a sampling of the controversies that swirl around the corporation. By studying these controversies, you will gain a far deeper and more multilayered understanding of the nature of the corporation and its place in our economy and society. But the debate(s) over the corporation will also shine a light on ourselves – and our fears and hopes -- by means of our reactions to corporations. ",
    "prereq": []
  },
  {
    "uid": "819894",
    "code": "HSEM3414H",
    "subject": "HSEM",
    "number": "3414",
    "honors": true,
    "writingIntensive": false,
    "name": "Pricing a Life-Saving Drug",
    "fullname": "Setting Prices on the Priceless -- The Moral Arithmetic of Pricing Prescription Drugs",
    "info": "In the 1930s, antiwar activists used the epithet “merchants of death” to denounce armaments manufacturers and their financiers. In a curious twist, today it is the turn of what might be called “merchants of life” – for-profit drug companies which have saved hundreds of millions of lives – to be a pariah industry. The rage against drug companies is bipartisan. In the 2016 Presidential race, Trump said that drug companies were getting away with murder and Clinton charged that they were making a fortune out of people’s misfortune. The main complaint against drug companies is, of course, that they are price gougers. They abuse their government-enforced monopolies to charge extortionate prices that deny some Americans access to treatment for life-threatening illnesses, bankrupt middle-class Americans, and place intolerable strains on state budgets. This seminar will use a cure for hepatitis C (Sovaldi) to evaluate the claim that drug companies charge exorbitant prices and (optimistically?) to try to answer the question of what is a just price for a life-saving drug. Or, in other words, how should we price priceless goods? Note: In fall 2022, this course will be offered as an A-Term 2 credit course.",
    "prereq": []
  },
  {
    "uid": "818063",
    "code": "HSEM3415H",
    "subject": "HSEM",
    "number": "3415",
    "honors": true,
    "writingIntensive": false,
    "name": "Business in the Supreme Court",
    "fullname": "Are corporations persons? Can they pray? Controversial Supreme Court Cases",
    "info": "Alexis de Tocqueville noted in 1835 that \"[s]carcely any political question arises in the United States that is not resolved, sooner or later, into a judicial question.\" Rightly or wrongly, in the US many highly-charged issues ultimately get resolved in the Supreme Court. This seminar uses the courts as a lens through which to examine the relationship between business and society. It employs recent Court opinions in business cases like Citizens United and Masterpiece Cakeshop (ruling expected in summer 2018)--supplemented by transcripts of oral arguments, commentary in law reviews and legal blogs. The seminar should be of interest to pre-law students and all students who wish to gain a better understanding of the place of business in our society.",
    "prereq": []
  },
  {
    "uid": "817989",
    "code": "HSEM3511H",
    "subject": "HSEM",
    "number": "3511",
    "honors": true,
    "writingIntensive": false,
    "name": "Applied Democracy",
    "fullname": "Science Court: Strengthening Democracy through Rational Discourse",
    "info": "Science Court is a mock trial system designed to promote democratic norms by investigating controversial societal issues, based on facts and sound scientific research, in front of a judge and jury of citizens. Students work together in three teams (Science, Legal and Media) to plan, research, execute, and report a SciCourt case.",
    "prereq": []
  },
  {
    "uid": "826535",
    "code": "HSEM3515H",
    "subject": "HSEM",
    "number": "3515",
    "honors": true,
    "writingIntensive": false,
    "name": "Infrastructure and Society",
    "fullname": "Infrastructure and Society",
    "info": "This seminar explores the social, economic, and cultural significance of public infrastructure. Drawing on examples from transportation and communication, the seminar will expose students to questions of design, political economy, and expected/unexpected outcomes of infrastructure. The seminar will allow students to visit local sites (in our local infrastructure project), work collaboratively with other students, and critically examine an important but often-overlooked set of built forms. Types of infrastructure examined will include: bridges, subways, water systems, telecommunications, mobile communications, and ‘informal infrastructure’ (when citizens or collectives engage in shared infrastructure-like projects for the common good). The goals of this seminar are to (a) introduce students to different types of infrastructure, including elements that are invisible to users, and (b) engage students in social-economic questions and debates surrounding infrastructure.",
    "prereq": []
  },
  {
    "uid": "803340",
    "code": "HSEM3522H",
    "subject": "HSEM",
    "number": "3522",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics. Discussion oriented, emphasizes active learning. Frequently interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "806331",
    "code": "HSEM3530H",
    "subject": "HSEM",
    "number": "3530",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course, emphasis on active learning, frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "811741",
    "code": "HSEM3608H",
    "subject": "HSEM",
    "number": "3608",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Jr or sr honors student",
    "prereq": []
  },
  {
    "uid": "801860",
    "code": "HSEM3609H",
    "subject": "HSEM",
    "number": "3609",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors seminar",
    "info": "TBD",
    "prereq": []
  },
  {
    "uid": "810184",
    "code": "HSEM3614H",
    "subject": "HSEM",
    "number": "3614",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course. Active learning, frequentlyinterdisciplinary.prereq: Jr or sr honors student",
    "prereq": []
  },
  {
    "uid": "817207",
    "code": "HSEM3619H",
    "subject": "HSEM",
    "number": "3619",
    "honors": true,
    "writingIntensive": false,
    "name": "Food, Aging, and Health",
    "fullname": "The Intersection of Food, Aging and Health",
    "info": "This course aims to enhance students' ability to critically think and problem-solve using innovative food systems approaches. We will work toward collective solutions relative to aging and health through food, the interdependence of economic and environmental factors, and collaboration with community partners. This course will focus on the interdependence of food environment and community sectors relative to their impacts on health, economy, and environment. Through this course, we will address the following question: How do we create a food environment that enhances public health in the aging population by aligning with non-profits, industry, academia, healthcare providers, communities, government, and advocacy groups?",
    "prereq": []
  },
  {
    "uid": "815950",
    "code": "HSEM3635H",
    "subject": "HSEM",
    "number": "3635",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics, interdisciplinary course; taught by Veterinary medicine facultyprerequisite: [jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "817338",
    "code": "HSEM3636H",
    "subject": "HSEM",
    "number": "3636",
    "honors": true,
    "writingIntensive": false,
    "name": "Vaccines: Needless Needles?",
    "fullname": "On Vaccines and Vaccinations:  Needless Needles?",
    "info": "Human and animal health has been significantly advanced by the creation and application of vaccines to control infectious diseases. Nevertheless, there remain impactful diseases that cannot be controlled by vaccination for a variety of reasons, and global geopolitical factors often complicate public health initiatives.  Further, vaccines have become controversial in some western societies, and debates have raged regarding potential negative aspects of routine vaccinations, scientific misconduct, and individual rights. This course will provide a scientific and historical background on immunity as a prelude to interdisciplinary discussion of vaccines and vaccinations.  Seminars will combine didactic lectures with structured peer-to-peer interactions and debates.  Students will consume both print and electronic media from multiple perspectives in order to reach their own conclusions regarding vaccines and vaccine safety. A final term paper will also inform peers as to various biological, public health, economic, regulatory, or cultural aspect of vaccines.",
    "prereq": []
  },
  {
    "uid": "811333",
    "code": "HSEM3701H",
    "subject": "HSEM",
    "number": "3701",
    "honors": true,
    "writingIntensive": false,
    "name": "Exercise is Medicine",
    "fullname": "Exercise is Medicine",
    "info": "Regular exercise is essential for good health and is important in the prevention and treatment of many diseases. The benefits of exercise and fitness, however, are frequently overlooked and under-emphasized in American health care delivery. Similar to other medical interventions, exercise has indications, contraindications, and potential complications and side effects. This seminar will explore these issues as well as related ones such as musculoskeletal concerns, nutrition, and sedentary physiology. Seminar format will include lectures, assigned readings, discussions, tests, and participant presentations. All seminar participants will research a different pre-approved aspect of exercise as medicine and present their findings at the seminar.",
    "prereq": []
  },
  {
    "uid": "806774",
    "code": "HSEM3702H",
    "subject": "HSEM",
    "number": "3702",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics Course; emphasis on active learning; frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "815951",
    "code": "HSEM3705H",
    "subject": "HSEM",
    "number": "3705",
    "honors": true,
    "writingIntensive": false,
    "name": "Engineered Nanoparticles",
    "fullname": "Nanotechnology: A Blessing or Curse to Society",
    "info": "Despite extensive commercial applications, a clear understanding of the adverse effects of Engineered Nanoparticles (ENPs) is lacking. A survey of the literature indicated the available information to be incomplete, independently unverified, and some may have been over-interpreted. Deep uncertainties currently pervade every step of the risk assessment of ENPs, making the procedure incapable of properly serving its purpose. The current conventional risk assessment strategies are not applicable for ENPs because of their unique properties and toxicity that may not conform to the norms of classic toxicology laws. Therefore, implementing some non-conventional tools in the risk assessment framework may be needed to reduce uncertainties and deliver accurate risk characterization of ENPs. This would enable current regulation to adequately reflect the risks of ENPs and protect the environment and the community. Therefore, the students registered for this seminar will learn some general features of ENPs, how the general public might be exposed to ENPs, and their potential health effects so that they can make an informed decision regarding the safe use of ENPs. With a serious information gap regarding ENPs safety, whether ENPs are a blessing or a curse is debatable. ",
    "prereq": []
  },
  {
    "uid": "802401",
    "code": "HSEM3708H",
    "subject": "HSEM",
    "number": "3708",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Frequently interdisciplinary.",
    "prereq": []
  },
  {
    "uid": "813717",
    "code": "HSEM3715H",
    "subject": "HSEM",
    "number": "3715",
    "honors": true,
    "writingIntensive": false,
    "name": "Medical Ethics in Research",
    "fullname": "Doctors Behaving Badly: The Causes and Consequences of Medical Research Scandals",
    "info": "This course will take students on a tour of the deadliest and most controversial research scandals in recent medical history. Some of these episodes are well-known, such as the exploitation of poor African American men with syphilis in Tuskegee, Alabama, and the injection of the hepatitis A virus into mentally disabled children at the Willowbrook State School in New York.  But such well-known cases represent only a small fraction of ethically contentious medical research.  In the 1960s, for example, at the world-renowned Allen Memorial Institute at McGill University, the CIA paid psychiatric researchers to use mentally ill subjects in \"mind control\" experiments involving LSD, intensive electroconvulsive therapy, and drug-induced comas for up to three months at a time. In 1996, during a meningitis epidemic in Nigeria, researchers for the pharmaceutical company Pfizer conducted a study of an unapproved antibiotic on children without the informed consent of their parents, resulting in eleven deaths. In 2013, two neurosurgeons at the University of California-Davis were forced to resign after authorities discovered that they had intentionally implanted bacteria in the brains of cancer patients. Today, the University of Minnesota itself is under investigation after for the case of Dan Markingson, a mentally ill young man who nearly decapitated himself after allegedly being coerced into an AstraZeneca-funded psychiatric study.In this course, we will explore questions such as: What cultural and institutional forces allowed the scandals to occur?  What were the best ethical arguments in favor of allowing the research to proceed?  How were the scandals exposed?  What was the role of investigative reporters, regulatory authorities, and whistleblowers?  Should we have confidence that research abuse is not occurring today?",
    "prereq": []
  },
  {
    "uid": "804148",
    "code": "HSEM3716H",
    "subject": "HSEM",
    "number": "3716",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "818924",
    "code": "HSEM3718H",
    "subject": "HSEM",
    "number": "3718",
    "honors": true,
    "writingIntensive": false,
    "name": "Women's Reproduction",
    "fullname": "Women's Reproduction: History, Policy, and the Health Care System",
    "info": "Understanding women's reproductive health requires consideration of the intersections of gender, race, class, culture, geography, economic status, and nation within a historical and sociopolitical context. This course will build upon our current understanding of major conditions affecting the reproductive health of women, e.g. pregnancy, parenting, reproductive control, and menopause by raising challenges from a feminist perspective and encouraging expanded models that address the complexity of women's reproductive health in today's society.",
    "prereq": []
  },
  {
    "uid": "809798",
    "code": "HSEM3719H",
    "subject": "HSEM",
    "number": "3719",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics course. Active learning. Frequently interdisciplinary.prereq: Jr or Sr honors student",
    "prereq": []
  },
  {
    "uid": "810185",
    "code": "HSEM3720H",
    "subject": "HSEM",
    "number": "3720",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Special topics discussion course. Active learning, frequently interdisciplinary.prereq: Jr or sr honors student",
    "prereq": []
  },
  {
    "uid": "813980",
    "code": "HSEM3724H",
    "subject": "HSEM",
    "number": "3724",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Topics Course. Emphasizes active learning. Interdisciplinary.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "801861",
    "code": "HSEM3801H",
    "subject": "HSEM",
    "number": "3801",
    "honors": true,
    "writingIntensive": false,
    "name": "Mdrn China Law Hist Culture",
    "fullname": "Modern China: Law, History, and Culture",
    "info": "This course will provide a comprehensive overview of law and politics of 20th and 21st-century China, in their historical and cultural contexts. It will introduce undergraduate students to distinctive paradigms and discursive patterns of law and politics in China, with the intention of fostering comparative analysis and critical thinking. The course will focus on high profile legal cases and major political events in the People's Republic of China today. The course will conclude by examining current issues in Chinese law from both sides, and by looking into China's argument for the \"Beijing Consensus,\" essentially a new type of capitalism, without Western-style rule of law. The classes will progress by way of interactive discussion and critical readings of historical documents and legal texts. This course is designed to break through the traditional Chinese learning/western learning dichotomy and interpret legal cases, political events, and cultural phenomena from a comparative perspective. It will bring to light the hidden rationales underscoring historical and ideological narratives, and will explain how frequent misunderstandings can occur when comparing cultures. Students will be encouraged to use critical thinking to argue, to test whether the incommensurability of paradigms can be reconciled, and to explore how different political systems and cultures can communicate with each other and exchange ideas effectively.",
    "prereq": []
  },
  {
    "uid": "803487",
    "code": "HSEM3802H",
    "subject": "HSEM",
    "number": "3802",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar",
    "info": "Emphasizes active learning. Frequently interdisciplinary.prereq: [Jr or sr], honors",
    "prereq": []
  },
  {
    "uid": "817217",
    "code": "HSEM3803H",
    "subject": "HSEM",
    "number": "3803",
    "honors": true,
    "writingIntensive": false,
    "name": "The Politics of Legal Policy",
    "fullname": "The Politics of Legal Policy",
    "info": "The Politics of Legal Policy seminar will focus on several controversial issues involving courts and/or the types of issues they deal with. Class discussions will focus on five policy issues involving either the use and role of courts or areas in which the courts play a major role in policy administration: access to legal services, medical malpractice, scientific expert testimony, sexual predators, and judicial selection. Beyond these specific topics, students will select a specific policy issue to delve into on their own, and produce two papers: a short background memo on the nature of the issue and what is known about the facts that may make it an area in need of change, and a policy memo suggesting and advocating for possible changes. During the last three weeks, students will present their policy briefs to the seminar.The goal of the course is to understand the factual reality behind some major issues confronting the courts and the challenges of making policy changes to address these issues. Each of the five topics will be dealt with over two sessions of the seminar with the first session examining the issue from a policy perspective and the second session examining the issue from the perspective of differing political interests. Some of the sessions on policy change will involve students in the seminar debating the issue drawing upon the policy discussions from the previous week as well as their own research into the issue; other sessions may involve a guest speaker. ",
    "prereq": []
  },
  {
    "uid": "818288",
    "code": "HSEM3804H",
    "subject": "HSEM",
    "number": "3804",
    "honors": true,
    "writingIntensive": false,
    "name": "Women-Leadership-Nobel Prize",
    "fullname": "Women who Rock (the Boat): Leadership and the Nobel Peace Prize",
    "info": "Lawyers, nuns, social workers, and schoolgirls have won the Nobel Peace Prize. In achieving this distinction, they hone their leadership skills to a fine art. They face personal danger, inner conflicts, social challenges, and pointed criticism. Succeeding despite their flaws, their ability to inspire courageous, innovative action cuts across age-groups, decades, borders, and nationality. Students in this Honors Seminar will touch and experience that inspiration.Students will intensively study several extraordinary women from different cultures who have won the Prize; e.g., Aung San Suu Kyi, Leymah Gbowee, Sharin Ebadi, Mother Teresa, and Malala Yousafzai. What characterizes their leadership? What have they accomplished and at what price? How do they survive their successes, failures, and controversies? How applicable are their approaches to a student's everyday life and future? This highly interactive class will examine these questions through biographies, videos, lectures, writing, student presentations, and group discussions.",
    "prereq": []
  },
  {
    "uid": "818406",
    "code": "HSEM3805H",
    "subject": "HSEM",
    "number": "3805",
    "honors": true,
    "writingIntensive": false,
    "name": "Revolutionary Paris since 1789",
    "fullname": "Revolutionary Paris since 1789",
    "info": "This seminar looks at issues of political and military conflicts in which France has been engaged. What constitutes the culture and society that may be seen in Paris; issues of French identity, including the diversity of the city of Paris, traditions of rebellion and resistance, the architectural monuments in the French capital, and spatial transformations that have come to Paris over the years since the French Revolution.",
    "prereq": []
  },
  {
    "uid": "825779",
    "code": "HSEM3807H",
    "subject": "HSEM",
    "number": "3807",
    "honors": true,
    "writingIntensive": false,
    "name": "Police Use of Force",
    "fullname": "Understanding Police Use of Force",
    "info": "Police use of force incidents are at the forefront of contemporary discussions of law, politics, and culture in the United States and in Minnesota.  In this course we will examine legal and cultural issues related to the use of force by police in the United States both from a historical perspective and by examining present-day cases and events nationally and in Minnesota.  We will learn and discuss law enforcement use of force decision making through the lenses of the United States Constitution and the cases that have interpreted its meaning. Because all uses of force by law enforcement officers against free citizens is governed by 4th Amendment standards, we will begin with an understanding of 4th Amendment applicability and how it relates to policy, training, supervision, the decision to use force, and the evaluation that takes place thereafter by the courts and law enforcement policy makers. We will learn about the use of force investigative process and the litigation process that oftentimes results from a law enforcement use of force incident, particularly those incidents that result in death.Analysis of specific cases will involve the review of public law enforcement data which will include police body worn camera video of graphic and violent incidents as well as relevant events occurring in the aftermath of use of use of force incidents.  ",
    "prereq": []
  },
  {
    "uid": "826536",
    "code": "HSEM3809H",
    "subject": "HSEM",
    "number": "3809",
    "honors": true,
    "writingIntensive": false,
    "name": "Starting Up A Startup",
    "fullname": "Starting Up A Startup",
    "info": "This seminar will help students develop a foundation of practical business knowledge. Participants will review standard corporate documents, engage in classroom discussion, and complete supervised hands-on experiences to learn how companies conduct business activities in the real world. Students in this seminar will be expected to review and analyze academic literature explaining basic economic and legal theory to facilitate discussion and understanding. However, the course will emphasize business in practice. For example, we will:•Detail the steps to form a new company by filing Articles of Formation for an actual Minnesota limited liability company•Conduct a hypothetical contract negotiation with students assuming the role of various counterparties•Host a panel of guest speakers specializing in early-stage business financing•Observe a meeting of a corporation’s Board of DirectorsThe amount of attention given to each of the seminar’s various topics can be tailored to the specific interests and backgrounds of the class participants.",
    "prereq": []
  },
  {
    "uid": "802232",
    "code": "HSEM3901H",
    "subject": "HSEM",
    "number": "3901",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Directed Study",
    "fullname": "Honors Directed Study",
    "info": "Extra credit to be used in conjunction with an honors seminar.",
    "prereq": []
  },
  {
    "uid": "802235",
    "code": "HSEM3902H",
    "subject": "HSEM",
    "number": "3902",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Directed Study",
    "fullname": "Honors Directed Study",
    "info": "Extra credit to be used in conjunction with an honors seminar.",
    "prereq": []
  },
  {
    "uid": "802236",
    "code": "HSEM3941H",
    "subject": "HSEM",
    "number": "3941",
    "honors": true,
    "writingIntensive": false,
    "name": "The Nature of the Cosmos",
    "fullname": "The Nature of the Cosmos",
    "info": "One of the defining features of every human civilization is its collective understanding of how the natural phenomena present to all earth dwellers  stars, planets, the earth and its transformations, plant, animal, and human  life, etc.  are conceptualized into systems of knowing. Cosmology is the term we use to describe these shared understandings, and this interdisciplinary course proposes a comparative study of different cosmologies in different civilizations and historical periods. We will explore the nature of the cosmos by first examining the category itself and what is involved in trying to study cosmology comparatively with sensitivity to cultural difference. We will then look at some different understandings of the nature of the cosmos (i.e. cosmologies) offered by different peoples in the past and around the world. We will start with two ancient, non-Western cosmologies: the Sanskrit Hindu and Buddhist traditions and the traditions of the native peoples of North America. We will then examine the history of Western cosmological thinking by looking at Greco-Roman Antiquity, Medieval Christian and Islamic cosmology, and the birth of modern, scientific cosmology in the Scientific Revolution (Galileo, Newton, etc.). Our overall goal will not be to establish a single, absolute, and universal understanding of the cosmos, but, rather, to develop an understanding of the value and power of each of the different cosmologies we will encounter and the consequences that follow from accepting one or the other of them as our point of view. Ultimately this course should help you to think more deeply, reflectively, and humanistically about the cosmologies present in our own modern globalized society today.",
    "prereq": []
  },
  {
    "uid": "802237",
    "code": "HSEM3942H",
    "subject": "HSEM",
    "number": "3942",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Topics",
    "fullname": "Honors Topics",
    "info": "Team taught.",
    "prereq": []
  },
  {
    "uid": "817968",
    "code": "HSEM3953H",
    "subject": "HSEM",
    "number": "3953",
    "honors": true,
    "writingIntensive": false,
    "name": "History and Science of Eating",
    "fullname": "History and Science of Eating",
    "info": "Eating is both an everyday, mundane activity and a complex act that is linked to internal and external factors. Using the lenses of the humanities and sciences, we will explore topics from the full continuum of human eating. We move from hunger, starvation, and dieting to food choice and obesity, to eatings relationship to contemporary politics, culture, and racial diversity. Overarching these topics are common themes of gender roles and changing cultural norms. We will investigate how and why diets vary as well as how food has emerged as a central political problem. Students will leave this class better able to judge evidence used in diet advice and with more understanding of their own beliefs about what they should eat.",
    "prereq": []
  },
  {
    "uid": "802238",
    "code": "HSEM3991H",
    "subject": "HSEM",
    "number": "3991",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Directed Research",
    "fullname": "Honors Directed Research",
    "info": "TBD",
    "prereq": []
  },
  {
    "uid": "802239",
    "code": "HSEM3992H",
    "subject": "HSEM",
    "number": "3992",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Interdisc Research",
    "fullname": "Honors Interdisciplinary Research",
    "info": "Independent/collaborative research course arranged with a faculty member through which honors students will bring varying academic perspectives to research topics.prereq: [Jr or sr] honors student",
    "prereq": []
  },
  {
    "uid": "802240",
    "code": "HSEM4941H",
    "subject": "HSEM",
    "number": "4941",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Topics",
    "fullname": "Honors Topics",
    "info": "Team taught.",
    "prereq": []
  },
  {
    "uid": "802241",
    "code": "HSEM4942H",
    "subject": "HSEM",
    "number": "4942",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Topics",
    "fullname": "Honors Topics",
    "info": "Team taught.",
    "prereq": []
  }
]