[
  {
    "uid": "803308",
    "code": "JOUR1001H",
    "subject": "JOUR",
    "number": "1001",
    "honors": true,
    "writingIntensive": false,
    "name": "Media in a Changing World",
    "fullname": "Media in a Changing World",
    "info": "In an era when almost everybody's a content creator and just about every company is connected with media, what makes mass communication different from other forms of message exchange? We?ll examine journalism, advertising, public relations, video gaming, music recording, music and more. We'll think about issues like free speech, fake news, censorship, social media, demographics, psychographics and graphic content. Hear from mass media professionals who provide real-world, real-time material for discussion and debate. This class covers ground that is shifting by the day and uses current cases to help you apply what you learn and sharpen your own media literacy skills. ",
    "prereq": []
  },
  {
    "uid": "796798",
    "code": "JOUR3004H",
    "subject": "JOUR",
    "number": "3004",
    "honors": true,
    "writingIntensive": false,
    "name": "Info for Mass Communication",
    "fullname": "Information for Mass Communication",
    "info": " The ability to acquire, evaluate, and use different information sources are essential skills for professional communicators and citizens. This course teaches the process of information gathering, evaluation, and implications through the lens of mass communication. A case study is used to study this process in depth throughout the semester.prereq: Honors, [JOUR 1001 or JOUR100H], [Jour major, Strat Comm major, Media and Information major or Media and Information minor or approved BIS/IDIM/ICP program]",
    "prereq": []
  },
  {
    "uid": "793487",
    "code": "JOUR3101H",
    "subject": "JOUR",
    "number": "3101",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors:News Reptg and Writing",
    "fullname": "Honors: News Reporting and Writing",
    "info": "News gathering, journalistic writing. Developing story ideas. Problems associated with handling of news/features. Professional standards/responsibilities.",
    "prereq": []
  },
  {
    "uid": "799810",
    "code": "JOUR3745H",
    "subject": "JOUR",
    "number": "3745",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Media, Pop Culture",
    "fullname": "Honors: Mass Media and Popular Culture",
    "info": "Mass media's role in formation of popular culture and cultural discourse. Prevalent media metaphors, caricatures, and stereotypes. Social/commercial pressures influencing media representation.",
    "prereq": []
  },
  {
    "uid": "805503",
    "code": "JOUR3776H",
    "subject": "JOUR",
    "number": "3776",
    "honors": true,
    "writingIntensive": false,
    "name": "Media Law",
    "fullname": "Media Law",
    "info": "The First Amendment protects the freedom of speech, and of the press. Does that mean that journalists can write anything they want, broadcast any video images they choose, or go wherever they like in order to gather news? In this course, we will examine significant court decisions that have defined the legal rights and privileges of journalists. We will look at statutes like the Freedom of Information Act and journalist \"shield laws.\" We will consider how new technology raises questions, and challenges, about how to balance First Amendment freedoms with other interests, like privacy and national security. Learn legal rules and principles, and apply them in classroom debate and discussion and in written exercises and examinations. The goal is to understand how the First Amendment and other laws protect the rights of freedom of expression, not just for journalists, but for all of us.prereq: Honors",
    "prereq": []
  },
  {
    "uid": "801715",
    "code": "JOUR4721H",
    "subject": "JOUR",
    "number": "4721",
    "honors": true,
    "writingIntensive": false,
    "name": "Mass Media and U.S. Society",
    "fullname": "Mass Media and U.S. Society",
    "info": "Are the news media doing a good job? How can you tell? Does it matter? Is The Daily Show the best news program on television? Why or why not? Most people seem to have an opinion about all of these questions. Most discussions seem to center on one of four themes: 1) who owns the media and what they care about; 2) whether the news media are becoming more or less credible and/or biased; 3) whether entertainment is replacing or enhancing information in news programming; and 4) how much, if at all, is the Internet changing everything about the way the media work, including who we think of as a journalist. Mass Media and U.S. Society explores the validity and importance of these themes in terms of what roles can the media play in society, what roles does it play, and how have those roles have changed over time. The course draws on ideas from various social sciences to develop tools for discussing a number of specific issues related to these themes. prereq: honors",
    "prereq": []
  },
  {
    "uid": "000267",
    "code": "JOUR4731H",
    "subject": "JOUR",
    "number": "4731",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Senior Seminar",
    "fullname": "Honors: Senior Seminar",
    "info": "Discussion section in conjunction with capstone course in professional track or 4xxx or 5xxx course in mass communication track.",
    "prereq": []
  },
  {
    "uid": "804111",
    "code": "JOUR4733V",
    "subject": "JOUR",
    "number": "4733",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Thesis Seminar",
    "fullname": "Honors Thesis Seminar",
    "info": "The Honors Thesis Seminar is designed to help students write a thesis to earn a degree with Honors. By carrying out an individual’s thesis work with a set of other students doing the same thing, students will receive support, as well as feedback and ideas, from their peers.We will meet as a class and with subgroups who share a particular research need (e.g., how to develop an on-line survey or experiment, developing a content analysis coding system, learning how to carry out a quantitative data analysis). You will receive and give peer feedback. In addition to our seminar, you will have the chance to meet with the instructor to talk about your thesis, discuss ideas, research methods, and data analysis plans, and receive feedback on thesis drafts. The regular class meetings and outside meetings with the instructors are meant to hold you accountable to yourself and to the instructor for making progress towards completing a thesis on time.prereq: Honors, [Jour major, Strat Comm major, or Media and Information major]",
    "prereq": []
  },
  {
    "uid": "797784",
    "code": "JOUR4990H",
    "subject": "JOUR",
    "number": "4990",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Spec Topic in Mass Com",
    "fullname": "Honors: Special Topics in Mass Communication",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "000566",
    "code": "JOUR4993H",
    "subject": "JOUR",
    "number": "4993",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Projects",
    "fullname": "Honors: Projects",
    "info": "Honors projects.Prereq Jour major, honors div regis, college consent, dept consent, instr consent. ",
    "prereq": []
  },
  {
    "uid": "799945",
    "code": "JOUR5195H",
    "subject": "JOUR",
    "number": "5195",
    "honors": true,
    "writingIntensive": false,
    "name": "On-Line Media Creation, Design",
    "fullname": "Online Media Creation and Design",
    "info": "Concepts/development of online media products. Health news and informational opportunities in new media.",
    "prereq": []
  }
]