[
  {
    "uid": "797121",
    "code": "RELS1082H",
    "subject": "RELS",
    "number": "1082",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Jesus in History",
    "fullname": "Honors Course: Jesus in History",
    "info": "Who was Jesus? How can we recover what he said and did? Why was he killed and who did it? Was there agreement about the life and words of Jesus in the earliest stages of Christianity, or were there major disagreements even then? How were the early writers about Jesus influenced by their social, political, and religious contexts? And why was it reported in the news recently that Jesus was married? In this course we examine the earliest attempts to describe Jesus and his significance in the gospel literature of the first and second centuries and beyond. We ask how historians may claim to \"know\" the \"facts\" of Jesus's life and meaning in light of these various portraits. We seek to understand how the different literary presentations of Jesus reflect their authors' social, religious, and political situations. We aim to understand in more detail the diversity of perspectives about Jesus from the earliest stage of the development of Christianity. Intended as a course of interest to all undergraduates on the Twin Cities campus. Students of any, all, or no religious background are welcome.  CNES/RELS 1082/1082H are combined sections.",
    "prereq": []
  },
  {
    "uid": "798451",
    "code": "RELS3071H",
    "subject": "RELS",
    "number": "3071",
    "honors": true,
    "writingIntensive": false,
    "name": "H:Greek & Hellenistic Religion",
    "fullname": "Honors Course: Greek and Hellenistic Religions",
    "info": "Greek religion from Bronze Age to Hellenistic times. Sources include literature, art, archaeology. Homer/Olympian deities, ritual performance, prayer/sacrifice, temple architecture, death/afterlife, mystery cults, philosophical religion, Near Eastern salvation religions. Meets with 3071.",
    "prereq": []
  },
  {
    "uid": "825223",
    "code": "RELS3623H",
    "subject": "RELS",
    "number": "3623",
    "honors": true,
    "writingIntensive": false,
    "name": "Religion and US Culture Wars",
    "fullname": "Religion and the American Culture Wars",
    "info": "Thomas Jefferson, Benjamin Franklin, James Madison, Thomas Paine, George Washington, and John Adams on religion, faith, and religion in politics. Deism. Enlightenment-era discussions about rational religion. Rise of evangelicalism.Separation of church/state, framers' original intent for first amendment. Religious Right.",
    "prereq": []
  },
  {
    "uid": "818457",
    "code": "RELS3626V",
    "subject": "RELS",
    "number": "3626",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors: Witches, Seers, Saints",
    "fullname": "Honors: Witches, Seers, and Saints: Women, Gender, and Religion in the US",
    "info": "This course examines the development and ramifications of gender ideologies within several religious groups in North America from the colonial period to the present and explores women's strategies that have contributed to and resisted these ideologies.",
    "prereq": []
  }
]