[
  {
    "uid": "795620",
    "code": "SLHS1301V",
    "subject": "SLHS",
    "number": "1301",
    "honors": true,
    "writingIntensive": true,
    "name": "Phys/Biol of Voice Honors",
    "fullname": "Physics and Biology of the Voice Honors",
    "info": "The goal of this course is to provide students with a background of the core physical, linguistic, and perceptual concepts related to speech. This course talks about the acoustics of speech as well as the main principles that are used to describe articulation and phonetics. We will examine the aerodynamic and acoustic principles that underlie sound production. The course also covers basics of auditory perception and how computers can be used to analyze and manipulate speech. Through an emphasis on physical analysis grounded in scientific principles, this course satisfies the university's physical sciences with laboratory liberal education requirement.",
    "prereq": []
  },
  {
    "uid": "807931",
    "code": "SLHS3402V",
    "subject": "SLHS",
    "number": "3402",
    "honors": true,
    "writingIntensive": true,
    "name": "Capstone Proj in SLHS Honors",
    "fullname": "Capstone Project in Speech-Language-Hearing Sciences Honors",
    "info": "This final year writing intensive course provides students foundational knowledge on evidence-based practice in the fields of Speech Language Pathology and Audiology. The course has a research and a service learning module. The research module includes lectures and group activities designed to promote critical thinking in evaluating research evidence and will enable students to generate evidence maps to support clinical decision making. The service learning module requires students to complete 20 hours of volunteering with an organization of choice. Reflective writing and research writing activities are designed to enable students to make connections between classroom learning and field work. Students will participate in a final capstone presentation day involving group and individual presentations to showcase their work throughout the semester.",
    "prereq": []
  },
  {
    "uid": "795359",
    "code": "SLHS3555H",
    "subject": "SLHS",
    "number": "3555",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Thesis",
    "fullname": "Honors Thesis",
    "info": "Research/writing under direction of faculty member. Details of work are determined in consultation with faculty thesis adviser selected based on availability/topic.prereq: See dir of undergrad studies for [thesis adviser, forms]",
    "prereq": []
  },
  {
    "uid": "807167",
    "code": "SLHS3994H",
    "subject": "SLHS",
    "number": "3994",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Directed Research",
    "fullname": "Honors Directed Research",
    "info": "Honors section of directed research.prereq: Honors undergrad doing research",
    "prereq": []
  }
]