[
  {
    "uid": "808939",
    "code": "SPAN3015V",
    "subject": "SPAN",
    "number": "3015",
    "honors": true,
    "writingIntensive": true,
    "name": "Hon: Span Comp & Communication",
    "fullname": "Honors: Spanish Composition and Communication",
    "info": "In 3015V, we will be using basically the same Weekly Plan and Canvas site that is used in regular sections (Span 3015W) in our Department. The main difference between a regular and an honors 3015 section will not be the quantity of work expected of the students, but rather the quality expected, not only of them but also of the instructor and the instruction provided.The course integrates reading, writing, listening, and speaking skills. Classes are conducted in Spanish. When working with a truly committed group of students, as it is assumed honors students will be, the instructor can go more in depth when dealing with difficult Spanish texts or unfamiliar cultural and historical issues. Instead of aiming just for reading comprehension, we will analyze cultural issues and identify literary strategies while working at the same time with highly advanced grammatical structures. Exposing students to different approaches on Latin-American History and Cultures, the instructor will promote discussion and will ask challenging but realistic questions to help students make connections between literary works/essays presented in the textbook or short videos used in class. By understanding, analyzing, and connecting, students will develop not only their linguistic abilities but also their critical thinking and a better understanding of the Hispanic world, and, therefore, they will be able to reconsider their own ideas and form new ones. All that work and growth will fully prepare them for the Literature, Culture or Linguistic classes (31xx courses) they will take once they finish Spanish 3015V if they choose to continue with their Spanish Studies.The same criteria apply to the writing component of the course. In an honors class we will not simply try to avoid mistakes when writing a composition. Instead, students will be working on stretching their level farther by incorporating the grammatical structures learned through the readings and grammar lessons taught in class, and they will be required to explain their ideas better and in a more advanced way. Again, the number of compositions required will be the same as in a regular section, but the quality expected will be higher, and they will receive high quality feedback from their Instructor: More advanced, higher quality writing is acquired only when the efforts of committed students are paired with the careful guidance and expertise of an also committed and experienced instructor.When during the last weeks of the semester honors students read and work on the Spanish novel all the 3015 students in our Department are required to read, they will be ready to fully understand it, look for literary strategies, relate to some cultural and moral issues, and discuss difficult topics with confidence: Throughout the semester they will have practiced a solid work ethic and acquired a wider understanding of themselves and the world around them, and, now, with the help of their Instructor, they will be able to fully appreciate the lessons and proposals the novel Mosén Millán by Ramón Sender has to offer. By the end of the course, students will have developed their critical thinking and improved their language abilities, and they will be more compassionate. They will also be fully ready to take more advanced Spanish classes if they decide to do so.prereq: SPAN LPE pass, Honors student",
    "prereq": []
  },
  {
    "uid": "815422",
    "code": "SPAN3104V",
    "subject": "SPAN",
    "number": "3104",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors: Intro Study/Hisp Lit",
    "fullname": "Honors: Introduction to the Study of Hispanic Literatures",
    "info": "Structures, meaning, and social/historical function of diverse literary texts.prereq: 3015, Spanish [major or minor]or Span-Port major",
    "prereq": []
  },
  {
    "uid": "817157",
    "code": "SPAN3105V",
    "subject": "SPAN",
    "number": "3105",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors: Hispanic Cultures",
    "fullname": "Honors: Introduction to the Study of Hispanic Cultures",
    "info": "Span 3105V is a writing-intensive course centered on major issues of culture in the context of the Spanish-speaking world. It is not a history of civilization, nor is it a survey of either Latin American or Peninsular literature. Rather, our objective here is to familiarize ourselves with the different issues central to the development of the Hispanic world as a cultural entity, and to practice analyzing and questioning received notions of culture in this context. We will examine all sorts of texts--literary, visual, musical, and filmic--from all periods of both Latin American (including Brazil) and Peninsular history, reading them through the lens of a series of topics. These topics are as follows: Mapas del mundo hispánico/Maps of the Hispanic world, Política y legado del encuentro cultural/Politics and legacies of cultural encounter, Discursos de identidad social/Discourses of social identity, Coerción y subversión/Coercion and subversion, Las naciones modernas/Modern nations, and Cultura élite-cultura popular-cultura de masas/High culture-popular culture-mass culture. The course includes an individual and collaborative research aspect introducing the students to the methods of cultural studies. ",
    "prereq": []
  },
  {
    "uid": "016173",
    "code": "SPAN3211H",
    "subject": "SPAN",
    "number": "3211",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Lit Discourses",
    "fullname": "Honors: Literary Discourses of Imperial Spain, 1492-1800",
    "info": "Major Spanish literary genres (epic, lyric, narrative prose, drama, novel, essay) from Middle Ages and Golden Age to the Enlightenment. Representative works (ballads, picaresque \"vidas\", tragedies, mystical verse, novellas) within historical/cultural contexts.",
    "prereq": []
  },
  {
    "uid": "016419",
    "code": "SPAN3212H",
    "subject": "SPAN",
    "number": "3212",
    "honors": true,
    "writingIntensive": false,
    "name": "Hon: Lit Dis (1800-present)",
    "fullname": "Honors: Literary Discourses of Modern and Contemporary Spain  (1800-present)",
    "info": "Representative works of fiction, drama, poetry, essay, and film of past two centuries. Intellectual/literary movements from romanticism to postmodernism.",
    "prereq": []
  },
  {
    "uid": "016174",
    "code": "SPAN3221H",
    "subject": "SPAN",
    "number": "3221",
    "honors": true,
    "writingIntensive": false,
    "name": "Hnrs: LAmer Colonial Dis",
    "fullname": "Honors: Latin American Colonial Discourses Since 1492",
    "info": "Honors: Critical account of conquest, colonization, and resistance in Spanish America.",
    "prereq": []
  },
  {
    "uid": "016413",
    "code": "SPAN3222H",
    "subject": "SPAN",
    "number": "3222",
    "honors": true,
    "writingIntensive": false,
    "name": "Hon:DisNationBldgandModLatAmer",
    "fullname": "Honors:Discourses of Nation Building and Modernization in Latin America",
    "info": "Development of modernity in Spanish America, its literary expression since independence from colonial rule. Case studies (e.g., Cuba).",
    "prereq": []
  },
  {
    "uid": "810025",
    "code": "SPAN3300H",
    "subject": "SPAN",
    "number": "3300",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors Seminar",
    "fullname": "Honors Seminar in Spanish and Portuguese Studies",
    "info": "Topics related to cultural studies, literature, linguistics in Iberian/Latin American milieus. Taught in Spanish. May be cross-listed with another department.prereq: honors student, 3015, [3104W or 3105W or TLDO 3104 or TLDO 3105 or VENZ 3104 or VENZ 3512 or instr consent]",
    "prereq": []
  },
  {
    "uid": "016352",
    "code": "SPAN3501H",
    "subject": "SPAN",
    "number": "3501",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Span Civ--Roots",
    "fullname": "Honors: Spanish Civilization, Roots of Modern Spain and Latin America",
    "info": "Customs, lifestyles, art, and culture from coexistence of Christians, Moors, and Arabs during reconquest to national unification. Discoveries/conquests up to \"modern state\" and political crises of early 19th century.",
    "prereq": []
  },
  {
    "uid": "016420",
    "code": "SPAN3502H",
    "subject": "SPAN",
    "number": "3502",
    "honors": true,
    "writingIntensive": false,
    "name": "Hon: Mod Spanish Culture",
    "fullname": "Honors: Spanish Civilization - Modern Spain",
    "info": "Spanish culture from beginning of 19th century to present. Focus on cultural change and its conflicts as represented in Spanish art, literature, and film.",
    "prereq": []
  },
  {
    "uid": "016118",
    "code": "SPAN3510H",
    "subject": "SPAN",
    "number": "3510",
    "honors": true,
    "writingIntensive": false,
    "name": "Hon: Hispanic Issues",
    "fullname": "Honors: Issues in Hispanic Cultures",
    "info": "Practices that have shaped cultural identity of Spanish-/Portuguese-speaking areas. Folklore, religion, armed conflict, drug traffic, language/citizenship, political movements, commodification of national myths/icons. Topics vary.",
    "prereq": []
  },
  {
    "uid": "016353",
    "code": "SPAN3512H",
    "subject": "SPAN",
    "number": "3512",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Modern Latin Amer",
    "fullname": "Honors: Modern Latin American Civilization",
    "info": "Effect of various forms of modernization on symbolic production in Latin American racial, ethnic, class relations, institutional, and ideological structure.",
    "prereq": []
  },
  {
    "uid": "016176",
    "code": "SPAN3701H",
    "subject": "SPAN",
    "number": "3701",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Spanish Phonology",
    "fullname": "Honors: Structure of Spanish--Phonology",
    "info": "Phonetics/phonology of modern Spanish.  Regional/social variants of the language in Spain and Spanish America.",
    "prereq": []
  },
  {
    "uid": "016366",
    "code": "SPAN3702H",
    "subject": "SPAN",
    "number": "3702",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Morphology and Syntax",
    "fullname": "Honors: Structure of Spanish--Morphology and Syntax",
    "info": "Derivational/inflectional morphology. Using morpheme, flexional affix, noun phrase, subject, subordination, and coordination to identify different morphological/syntactic components of Spanish.",
    "prereq": []
  },
  {
    "uid": "016368",
    "code": "SPAN3703H",
    "subject": "SPAN",
    "number": "3703",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: History of Span and Pt",
    "fullname": "Honors: Origins and History of Spanish and Portuguese",
    "info": "Relationships with Latin. Phonetic, morphological, syntactic, and sociolinguistic aspects of diachronic variation.",
    "prereq": []
  },
  {
    "uid": "016369",
    "code": "SPAN3704H",
    "subject": "SPAN",
    "number": "3704",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Span Socioling",
    "fullname": "Honors: Sociolinguistics of Spanish-Speaking World",
    "info": "Social variants of Spanish dialects. Spanish in contact with other languages. Bilingualism. Language attitudes. Pragmatic analysis of Spanish. Effect of recent cultural, political, and socioeconomic transformations on language.",
    "prereq": []
  },
  {
    "uid": "016370",
    "code": "SPAN3705H",
    "subject": "SPAN",
    "number": "3705",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Spanish Semantics",
    "fullname": "Honors: The Semantics and Pragmatics of Spanish",
    "info": "Sense relations. Spanish semantics/grammar. Theme, rhyme, focus. Spanish lexicon. Context, style, culture. communicative competence. Speech acts in Spanish.",
    "prereq": []
  },
  {
    "uid": "016372",
    "code": "SPAN3730H",
    "subject": "SPAN",
    "number": "3730",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Topics in Hisp Ling",
    "fullname": "Honors: Topics in Hispanic Linguistics",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "790898",
    "code": "SPAN3800H",
    "subject": "SPAN",
    "number": "3800",
    "honors": true,
    "writingIntensive": false,
    "name": "Hon: Film Studies in Spanish",
    "fullname": "Honors: Film Studies in Spanish",
    "info": "Films from Spanish-speaking worlds in their historical, (geo)political, and socio-economic contexts. Production/consumption, popular/high cultures, and national/trans-national identities considered within various theoretical backgrounds. Films from various countries analyzed under interdisciplinary framework noting cinematographical rethorics.",
    "prereq": []
  },
  {
    "uid": "016349",
    "code": "SPAN3910H",
    "subject": "SPAN",
    "number": "3910",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Topics Span Pen Lit",
    "fullname": "Honors: Topics in Spanish Peninsular Literature",
    "info": "Focus on theme related to important groups of writers, literary movements, trends, critical approaches, and methods. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "016177",
    "code": "SPAN3920H",
    "subject": "SPAN",
    "number": "3920",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Topics SpAmer Lit",
    "fullname": "Honors: Topics in Spanish-American Literature",
    "info": "Central theme related to important groups of writers, literary movements, trends, critical approaches, and methods. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "016178",
    "code": "SPAN3940H",
    "subject": "SPAN",
    "number": "3940",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Figures in Span Lit",
    "fullname": "Honors: Figures in Spanish Peninsular Literature",
    "info": "Major writer or group of writers whose work has had an effect on Spanish thought, literature, or analysis of social patterns.  Figures specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "016351",
    "code": "SPAN3950H",
    "subject": "SPAN",
    "number": "3950",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Figures in SpAm Lit",
    "fullname": "Honors: Figures in Spanish-American Literature",
    "info": "One major writer or group of writers whose work as affected thought, literature, or social problems. Figures specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "016179",
    "code": "SPAN3972V",
    "subject": "SPAN",
    "number": "3972",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors: Graduation Seminar",
    "fullname": "Honors: Graduation Seminar",
    "info": "SPAN 3972V is for honors students completing their honors thesis in Spanish or Spanish/Portuguese Studies. Completion of a research paper on a cultural, literary, or artistic issue in the Spanish or Portuguese-speaking worlds or on a topic related to Hispanic linguistics. In-depth research/consultation with the instructor. prereq: Spanish Studies major (for those who declare Fall 2018 and after): C- or better in Span 3015w, 2 Span 31xx courses, and 4 electives with a Critical Analysis prerequisite.  SPAN 3994 must be one of these electives for those who declared Fall 2022 and after.  Spanish/Portuguese Studies Majors (for those who declared before Spring 2022): C- or better in SPAN 3015w, PORT 3003, SPAN 3104w, 3107w, 1 PORT 35xx class, 2 upper-level SPAN or PORT electives. Spanish/Portuguese Studies Majors (for those who declared Spring 2022 and after): C- or better in SPAN 3015W, PORT 3003, SPAN 3104W or 3105W & 3107W, 1 PORT elective, 2 additional upper-level Spanish or Portuguese electives. SPAN or PORT 3994 must be one of these electives for those who declared Fall 2022 and after.",
    "prereq": []
  }
]