[
  {
    "uid": "790514",
    "code": "TH1101V",
    "subject": "TH",
    "number": "1101",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors: Intro to Theatre",
    "fullname": "Honors Section: Introduction to the Theater",
    "info": "What is theatre? And what can it be? In this introductory course, we investigate the idea that while theatre is art, it also has consequences. Theatrical performance reflects, resists, and rewrites culture; it can (and does) perform the political by reimagining and transforming society. Through exciting examples of plays and productions from around the world, we investigate the history, politics, and aesthetics of theatre. We explore how the different components of theatre (from directing to acting, costume, and lighting design) come together to create powerful impact on stage. We read and discuss plays in class, see performances on stage, and hear from some of the Twin Cities’s most dynamic and committed artists. And we work on valuable writing skills that help us to deepen our understanding of theatre and communicate our insights to others. At the end of the class, we bring together everything we have been learning to make theatre in small groups. No previous theatre experience is needed. Prereq: Honors student",
    "prereq": []
  },
  {
    "uid": "008614",
    "code": "TH1405H",
    "subject": "TH",
    "number": "1405",
    "honors": true,
    "writingIntensive": false,
    "name": "Theatre: Spaces and Practices",
    "fullname": "Theatre: Spaces and Practices",
    "info": "Various theatre subjects developed by pool of instructors.",
    "prereq": []
  },
  {
    "uid": "008615",
    "code": "TH4905H",
    "subject": "TH",
    "number": "4905",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: Tutorial",
    "fullname": "Honors: Tutorial Seminar in Theatre Arts",
    "info": "Independent reading/research in preparing honors thesis or selected creative project.prereq: Credit will not be granted if credit has been received for: 4905; honors, theatre arts, dept consent; limit [2 cr for [cum laude or magna cum laude], 4 cr for summa cum laude]",
    "prereq": []
  }
]