[
  {
    "uid": "826783",
    "code": "WRIT1301H",
    "subject": "WRIT",
    "number": "1301",
    "honors": true,
    "writingIntensive": false,
    "name": "Honors: University Writing",
    "fullname": "Honors: University Writing",
    "info": "WRIT 1301 introduces students to rhetorical principles that provide a framework for successful written communication in college and beyond. Students study and write in a variety of genres and in multimodal forms. The courses focus on writing as a way of knowing and learning to develop ideas through critical thinking, including analysis and synthesis. Based on the assumption that writing is a social activity, the course is a workshop format and requires active engagement in the writing process, including pre-writing, peer review, revision, and editing. Students develop information literacy and hone the ability to locate, evaluate, and effectively and ethically incorporate information into their own texts. In the honors section of WRIT 1301, students will meet the same course outcomes with a deepened focus on and attention to writing processes and rhetorical strategies that are attuned to students, academic, scholarly, and professional goals. As part of this honors experience, students will produce a research proposal relevant and responsive to their intended field of study. The writing and research processes that students engage in to compose the proposal will be navigated, facilitated, and guided by frequent interactions with and feedback from peers and the instructor, and by regularly embedded metacognitive practice. The course will emphasize student-driven topic selection and inquiry development, peer-to-peer interactions, and metacognition so as to support a deep experience with and development of capacity in collaboration and in the iterative writing and research processes. ",
    "prereq": []
  },
  {
    "uid": "815840",
    "code": "WRIT3562V",
    "subject": "WRIT",
    "number": "3562",
    "honors": true,
    "writingIntensive": true,
    "name": "Honors Tech & Prof Writing",
    "fullname": "Honors: Technical and Professional Writing",
    "info": "Written and oral communication in professional settings, gathering research, analyzing audience, assessing and practicing multiple genres. Draft, test, revise present findings in oral presentation. Honors section includes discussion on scholarly readings in technical and professional writing as well as a final project that must be addressed to a real-world audience.",
    "prereq": []
  },
  {
    "uid": "817527",
    "code": "WRIT4995H",
    "subject": "WRIT",
    "number": "4995",
    "honors": true,
    "writingIntensive": false,
    "name": "Tech Writ & Comm Honors Thesis",
    "fullname": "Technical Writing and Communication Honors Thesis",
    "info": "Technical Writing and Communication Honors Thesis addresses a topic in writing studies related to a WRIT course that the student is taking or has taken. Students will define and investigate a topic in depth, and complete an extended written reflection of their results & understanding. An honors thesis is required of all students graduating with any level of Latin honors. Completing the honors thesis is a year long effort. Students graduating with Latin Honors should enroll in Writ 4995H both fall and spring semesters of their senior year. Students not graduating with Latin Honors should register for Writ 4995.",
    "prereq": []
  },
  {
    "uid": "820062",
    "code": "WRIT4999H",
    "subject": "WRIT",
    "number": "4999",
    "honors": true,
    "writingIntensive": false,
    "name": "TWC Honors Capstone",
    "fullname": "Technical Writing and Communication Honors Capstone",
    "info": "The senior capstone course is a culminating experience for all Technical Writing and Communication majors. This course is designed to facilitate individualized student projects that combine previous knowledge, skills, and experiences developed as a TWC major into a senior project. Specifically, students will design and carry out a project of their own design under the guidance of the instructor. \n\nCompleting the honors thesis is a year long effort. Students graduating with Latin Honors should enroll in Writ 4999H during the first semester of their senior year. Students may register for 1 credit in WRIT 3993 their second semester. Students not graduating with Latin Honors should register for Writ 4999.",
    "prereq": []
  }
]