[
  {
    "uid": "797460",
    "code": "AAS1101",
    "subject": "AAS",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Imagining Asian America",
    "fullname": "Imagining Asian America",
    "info": "What are the histories, cultures, and experiences of Asian Americans, the fastest-growing group in the United States? How do they fit into the U.S.'s history of immigration, race, and citizenship? Is the \"model minority\" myth really true? This course is an introduction to Asian American Studies, an interdisciplinary field that uses ethnography, literature, histories, films, memoirs, and other texts to study how the history of Asian immigration to the United States has visibly shaped existing Asian American communities and identities, and how \"Asian America\" is central to a more general understanding of American popular culture and public life.The course is roughly organized chronologically. We will first begin with an introduction to the field of Asian American Studies by asking the questions: What is Asian America? What is Asian American Studies? We will then examine important concepts, categories, and processes before exploring the rich history of Asian migration to the United States and contemporary issues facing Asian Americans today. One of the core principles of this course is to encourage active and interdisciplinary learning. This means that we will be learning in a variety of ways to explore and understand the material (reading, writing, watching, listening, seeing, discussing, presenting). We will be drawing from a wide range of disciplines (history, law, sociology, education, cultural studies, psychology, etc.). And we will be using a variety of materials (memoir, scholarly articles, historical documents, government records, newspapers, films, photographs, popular culture, etc.) Your active participation in these activities is essential.",
    "prereq": []
  },
  {
    "uid": "803713",
    "code": "AAS1201",
    "subject": "AAS",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Racial Formation/Transform US",
    "fullname": "Racial Formation and Transformation in the United States",
    "info": "How aggrieved racialized groups struggle over identity, culture, place, and meaning. Histories of racialization. Strategies toward rectification of historical injustices from dispossession, slavery, exploitation, and exclusion.",
    "prereq": []
  },
  {
    "uid": "802086",
    "code": "AAS1902",
    "subject": "AAS",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Freshman",
    "prereq": []
  },
  {
    "uid": "805603",
    "code": "AAS1905",
    "subject": "AAS",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "818875",
    "code": "AAS1930",
    "subject": "AAS",
    "number": "1930",
    "honors": false,
    "writingIntensive": false,
    "name": "Democracy under Threat",
    "fullname": "Democracy under Threat in Times of Populism and Racial Nationalism",
    "info": "Is democracy under threat? The upsurge of populist authoritarianism and racial nationalism around the globe in conjunction with recent assaults on traditional political institutions in the United States have raised concerns about the fate and future of democracy. Political scientists largely agree that the United States has become more democratic over the past two centuries, but results from the Authoritarian Warning Survey, a democratic-monitoring project, highlight the erosion of democratic principles and institutions in the past few years. Concerns about the meaning, nature, promise, stability or instability of democracy are, however, not new. In order to better understand contemporary threats to democracy this course explores how the meanings and understandings of democracy changed over the last few centuries by examining the complicated relationship between democracy, populism and racial nationalism. Is democracy a product of populism or imperiled by populism? What is the contemporary and historical relationship between democracy and racial nationalism? This seminar delves deeply into these questions by exploring a series of moments when the meanings and promise of democracy were contested. It begins with fundamental questions about the racial and gendered origins of American democracy. What is the relationship between the democratic state, the slave state and the settler colonial state? How did racial nationalism constitute and imperil American democracy from its origins? Populists, that is members of mass movements that claim to speak for \"the people,\" have struggled to both extend and redefine the limits of democracy. In these efforts, \"citizens\" have frequently been pitted against non-citizens making questions of immigration, naturalization, and detention central to contestations over democracy and its perceived threats. Moreover, in the United States, the relationship between detention and democracy can not be fully explored without paying significant attention to the rise of mass incarceration over the past half century. To what extent is the democratic state today threatened or maintained through the carceral state? Student will engage with these issues through interdisciplinary lectures, course readings and discussions, and conversations with scholars, activists and organizations fostering democratic values and racial justice.This course comes out of the Democracy under Threat Interdisciplinary Collaborative Workshop. Students will be invited to all Democracy under Threat events during the 2019-2020 academic year, including a Spring 2020 Conference, \"Democracy under Threat in Times of Populism and Racial Nationalism\" that will be held at the University of Minnesota in partnership with Howard University, Morehouse College, and Spelman College. ",
    "prereq": []
  },
  {
    "uid": "797787",
    "code": "AAS3001",
    "subject": "AAS",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Contmp Persp on Asian America",
    "fullname": "Contemporary Perspectives on Asian America",
    "info": "Interdisciplinary overview of Asian American identities. Post-1965 migration/community. History, cultural productions, and concerns of Americans of Chinese, Japanese, Korean, South Asian, Filipino, and Southeast Asian ancestry.",
    "prereq": []
  },
  {
    "uid": "816256",
    "code": "AAS3211W",
    "subject": "AAS",
    "number": "3211",
    "honors": false,
    "writingIntensive": true,
    "name": "Race & Racism in the U.S.",
    "fullname": "Race & Racism in the U.S.",
    "info": "We live in a society steeped in racial understandings that are often invisible—some that are hard to see, and others that we work hard not to see.  This course will focus on race relations in today's society with a historical overview of the experiences of various racial and ethnic groups in order to help explain their present-day social status. This course is designed to help students begin to develop their own informed perspectives on American racial “problems” by introducing them to the ways that sociologists deal with race, ethnicity, race relations and racism.  We will expand our understanding of racial and ethnic dynamics by exploring the experiences of specific groups in the U.S. and how race/ethnicity intersects with sources of stratification such as class, nationality, and gender.  The course will conclude by re-considering ideas about assimilation, pluralism, and multiculturalism.  Throughout, our goal will be to consider race both as a source of identity and social differentiation as well as a system of privilege, power and inequality affecting everyone in the society albeit in different ways. ",
    "prereq": []
  },
  {
    "uid": "803710",
    "code": "AAS3251W",
    "subject": "AAS",
    "number": "3251",
    "honors": false,
    "writingIntensive": true,
    "name": "Race, Class, and Gender",
    "fullname": "Sociological Perspectives on Race, Class, and Gender",
    "info": "In the midst of social unrest, it is important for us to understand social inequality. In this course we will analyze the impact of three major forms of inequality in the United States: race, class, and gender. Through taking an intersectional approach at these topics, we will examine the ways these social forces work institutionally, conceptually, and in terms of our everyday realities. We will focus on these inequalities as intertwined and deeply embedded in the history of the country. Along with race, class, and gender we will focus on other axes of inequality including sexuality, citizenship, and dis/ability. We will analyze the meanings and values attached to these social categories, and the ways in which these social constructions help rationalize, justify, and reproduce social inequality.",
    "prereq": []
  },
  {
    "uid": "797522",
    "code": "AAS3271",
    "subject": "AAS",
    "number": "3271",
    "honors": false,
    "writingIntensive": false,
    "name": "Learning Asian American Cmmnty",
    "fullname": "Learning in the Asian American Community",
    "info": "This course is intended to give students a general introduction to participatory learning through engagement with Asian American community organizations and/or leaders. The course is based within Asian American studies, an interdisciplinary field of inquiry that examines how histories of immigration, exclusion, racialization, and citizenship have shaped Asian American communities and identities. In turn, Asian American studies asks how Asian Americans, configured as immigrants, refugees, \"forever foreigners,\" and \"model minorities,\" impact how American nation, empire, rights, and belonging are constructed. Working with community partners, students will have the opportunity to learn several different community-based research skills: newspaper article search, archival research and/or archival organization, interviewing skills, and audio/video production. Students also have the option to complete service learning with an organization throughout the semester; with this option, students will write a short reflection statement on their service learning as their final project.prereq: AAS and CRES minors must register A-F.",
    "prereq": []
  },
  {
    "uid": "797462",
    "code": "AAS3301",
    "subject": "AAS",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian Amer thru Arts Culture",
    "fullname": "Asian America Through Arts and Culture",
    "info": "Americans of Asian descent comprise one of the fastest-growing racial groups in the U.S. today. While large numbers of Asian Americans have been in the U.S. since the middle of the nineteenth century, it is only in the past few decades that they have been widely recognized in art, culture, and media. This course focuses on how writing, art, performance, film, and/or other works of culture registers the experiences of Asian Americans past and present. How do individual artists or writers depict themselves and others as part of families, communities, or nations? How do questions of race, racism, family, identity, immigration, labor, citizenship, inequality, gender, sexuality, media stereotypes, and activism affect the perspectives and the creative choices in these works?",
    "prereq": []
  },
  {
    "uid": "810102",
    "code": "AAS3303W",
    "subject": "AAS",
    "number": "3303",
    "honors": false,
    "writingIntensive": true,
    "name": "Writing Differences",
    "fullname": "Writing Differences: Literature by U.S. Women of Color",
    "info": "Interpret/analyze poetry, fiction, drama of U.S. women minority writers. Relationship of writer's history, ethnicity, race, class, gender to her writings.",
    "prereq": []
  },
  {
    "uid": "817300",
    "code": "AAS3311",
    "subject": "AAS",
    "number": "3311",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian American Theater",
    "fullname": "Asian American Theater",
    "info": "Through submerging students in both theater history and practice, this class brings students closer to the history, experiences, and politics of Asian Americans. Why are Asian American stories needed and how do we tell them? What are the artistic and social agendas driving the making of Asian American theater? How have the styles of performance shifted? While we will be actively working on readings and original theater projects, you don't need to be a theater expert to enjoy this class. Topics will include reading plays by Frank Chin, David Henry Hwang, Wakako Yamauchi, Naomi Iizuka, and others; looking at the history of Asian American theater companies; discussing creative approaches to casting, acting, directing, and design; and building collaborations among companies, audiences, and communities.",
    "prereq": []
  },
  {
    "uid": "817324",
    "code": "AAS3341",
    "subject": "AAS",
    "number": "3341",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian American Images",
    "fullname": "Asian American Images",
    "info": "From 19th-century anti-Chinese political cartoons to Harold and Kumar, visual representations of Asians in the United States have long influenced how Asian Americans are seen and treated. What are some of the ways that photography, graphic arts, and digital culture have pictured Asian Americans as aliens, citizens, immigrants, workers, family and community members, entertainers, and artists? Course topics will relate visual images to particular historical moments, including the early exclusion period and the \"yellow peril\" stereotype; WWII Japanese American incarceration and the drawings of Miné Okubo, and photo-journalism documenting U.S. military involvement in Southeast Asia and its aftermath. How do photographic and other images work to counter historical amnesia, heal traumatic loss, and document social injustice? Other weeks of the class will explore the ways that individuals, families, and communities use photographs, video, and other visual media to preserve a sense of connection and belonging. We will also look at how contemporary Asian American photographers such as Tseng Kwong Chi, Nikki Lee, and Wing Young Huie experiment with visual images to raise questions of racial and national identity, social inequality, gender, sexuality, and political agency. The course also includes a digital storytelling project that encourages students to create video images and sound reflecting Asian American immigration stories from local communities.",
    "prereq": []
  },
  {
    "uid": "817325",
    "code": "AAS3351",
    "subject": "AAS",
    "number": "3351",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian Amer and Popular Culture",
    "fullname": "Asian Americans and Popular Culture",
    "info": "Over the past few decades, Asian Americans have become increasingly visible both as the subjects and producers of popular culture in the United States. This course will explore how this new recognition of Asian Americans in popular literature, cinema, television, and entertainment is related both to longer histories of Asian immigration and racial exclusion and to post-1960s efforts to forward racial awareness, community activism, and social justice. Our first unit will look at how particular stereotypes such as the yellow peril or the wartime enemy encouraged anti-Asian feeling and violence and legal restrictions on immigration and naturalization. We will then examine how throughout history, Asian immigrants and their descendants used song, dance, theater, writing, and other forms of popular culture to express personal desires and foster collective ties. Our final unit concentrates on contemporary popular culture and its relationship to the changing identities of Asian Americans. How do Asian Americans influence the current essays, films, and videos that are consumed by millions today? How are increasingly pan-ethnic, interracial, multiracial, transnational, and global experiences reflected in popular culture?",
    "prereq": []
  },
  {
    "uid": "818159",
    "code": "AAS3361",
    "subject": "AAS",
    "number": "3361",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian Americans and Food",
    "fullname": "Asian Americans and Food",
    "info": "Asian Americans have always been intimately connected to food practices and institutions in the American imagination. Food is the medium through which Asian American cultural difference--including their status as \"perpetual foreigners\" or their \"model minority character\"—are typically expressed and disseminated. Historically, Asian migration to the United States was fueled by labor needs particularly in the agricultural sector. In addition, Asian labor has been stereotypically linked to food service and preparation such as the ubiquitous Chinese take-out place and more recently, the sushi and Korean fusion joints. This course is an introduction to the interdisciplinary study of food to better understand the historical, social, and cultural aspects of Asian American food preparation, distribution and consumption. Students will investigate the politics and poetics of Asian American foodways by examining social habits, and rituals around food in restaurants, homes and other public venues.  The course texts include ethnographic essays, fictional works, memoirs, magazines, and television shows.",
    "prereq": []
  },
  {
    "uid": "797461",
    "code": "AAS3409W",
    "subject": "AAS",
    "number": "3409",
    "honors": false,
    "writingIntensive": true,
    "name": "Asian American Women Culture",
    "fullname": "Asian American Women's Cultural Production",
    "info": "Diversity of cultures designated \\\"Asian American.\\\" Understanding women's lives in historical, cultural, economic, and racial contexts.",
    "prereq": []
  },
  {
    "uid": "805604",
    "code": "AAS3483",
    "subject": "AAS",
    "number": "3483",
    "honors": false,
    "writingIntensive": false,
    "name": "Hmong History Across the Globe",
    "fullname": "Hmong History Across the Globe",
    "info": "Hmong interaction with lowland Southeast Asian states (Laos, Vietnam) and Western colonial powers (French, American) since 19th century. Changes to religious, social, political, and gender institutions. Aspirations for political autonomy.",
    "prereq": []
  },
  {
    "uid": "810632",
    "code": "AAS3486",
    "subject": "AAS",
    "number": "3486",
    "honors": false,
    "writingIntensive": false,
    "name": "Hmong Refugees",
    "fullname": "Hmong Refugees from the Secret War:  Becoming Americans",
    "info": "Socio-economic, political, gender, cultural/religious changes in Hmong American community during last three decades. How Hmong are racialized in American society. Impact to first/second generations.",
    "prereq": []
  },
  {
    "uid": "810666",
    "code": "AAS3503",
    "subject": "AAS",
    "number": "3503",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian Am Id, Families, & Comm",
    "fullname": "Asian American Identities, Families, & Communities",
    "info": "This course provides a sociological overview of Asian American identities, families and communities. To place these experiences within a broader historical, structural, and cultural context the course will begin with a brief introduction to the history of Asians and Asian Americans in the United States and sociological theories about incorporation and racial stratification. We will then examine the diversity of Asian American communities and families, highlighting ethnic, gender, and class variations. Other topics of focus include racialization and discrimination, education, ethnic enclaves, family and intergenerational relationships, identity, media, culture, and politics and social action. Throughout the course we will consider the ways in which society affects individuals, and how in turn, individuals affect society. Students will have an option to do community-engaged learning or another course project.",
    "prereq": []
  },
  {
    "uid": "817961",
    "code": "AAS3601W",
    "subject": "AAS",
    "number": "3601",
    "honors": false,
    "writingIntensive": true,
    "name": "War & Empire: Asian Amer Persp",
    "fullname": "War and Empire: Asian American Perspectives",
    "info": "This course examines the reach of war and empire in Asian America since the turn of the twentieth century. Starting with US wars in the Philippines (1898-1910) and the formation of the colonial state, the course will track the ascendancy of US empire in Asia and paths toward wars against imperialist Japan (1941-1945), in Korea (1950-53), and in Vietnam (1955-1975). The course will address the relevance of the unending Global War on Terrorism (2001-) in contemporary Asian America. Together, the course explores how these wars have shaped and continue to inform the lives and memories of Asian immigrants and refugees, their children, and other Asian Americans.",
    "prereq": []
  },
  {
    "uid": "807822",
    "code": "AAS3862",
    "subject": "AAS",
    "number": "3862",
    "honors": false,
    "writingIntensive": false,
    "name": "American Immigration History",
    "fullname": "American Immigration History",
    "info": "Global migrations to U.S. from Europe, Asia, Latin America, and Africa, from early 19th century to present. Causes/cultures of migration. Migrant communities, work, and families. Xenophobia, assimilation/integration, citizenship, ethnicity, race relations. Debates over immigration. Place of immigration in America's national identity.",
    "prereq": []
  },
  {
    "uid": "817077",
    "code": "AAS3866",
    "subject": "AAS",
    "number": "3866",
    "honors": false,
    "writingIntensive": false,
    "name": "Arab American Experiences",
    "fullname": "Arab American Experiences",
    "info": "Arab diasporic experiences in the West, and in America in particular, have been mediated by popular depictions of \"the Arab\" as violent terrorist, oppressor of/oppressed woman, religious fanatic, and myriad other negative stereotypes, heightened since September 11, 2001. How do Arabs in America, especially youth, navigate the superimposition of these images upon them? How do they relate to the multiple locations of \"home\" between the West and the Arab world? To what extent are they perpetually \"out of place,\" and what strategies have they developed to navigate their liminal and often marginalized social position? Through the examination of memoirs, novels, film, music, and even food, this course will use Arab American cultural production as a lens through which to explore these questions.",
    "prereq": []
  },
  {
    "uid": "804789",
    "code": "AAS3875W",
    "subject": "AAS",
    "number": "3875",
    "honors": false,
    "writingIntensive": true,
    "name": "US Comparative Race/Ethnicity",
    "fullname": "Comparative Race and Ethnicity in U.S. History",
    "info": "This writing-intensive course examines the racial history of modern America. The focus is placed on how American Indians, African Americans, and immigrants from Europe, Asia, and Latin America struggle over identity, place, and meanings of these categories in society where racial hierarchy not only determined every aspect of how they lived, but also functioned as a lever to reconstitute a new nation and empire in the aftermath of the Civil War. We are interested in studying how these diverse groups experienced racialization not in the same way but in various and distinct ways in relation to each other.",
    "prereq": []
  },
  {
    "uid": "797463",
    "code": "AAS3877",
    "subject": "AAS",
    "number": "3877",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian American History",
    "fullname": "Asian American History, 1850 to Present",
    "info": "Asian American history and contemporary issues, from 1850 to present. Immigration, labor, anti-Asian movements, women/families, impact of World War Two, new immigrant/refugee communities, civil rights, Asian American identity/culture.",
    "prereq": []
  },
  {
    "uid": "797452",
    "code": "AAS3920",
    "subject": "AAS",
    "number": "3920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Asian American Studies",
    "fullname": "Topics in Asian American Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "797451",
    "code": "AAS3993",
    "subject": "AAS",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies in Asian American Studies",
    "info": "Guided individual reading or study.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "797490",
    "code": "AAS4231",
    "subject": "AAS",
    "number": "4231",
    "honors": false,
    "writingIntensive": false,
    "name": "Color of Public Policy in US",
    "fullname": "Color of Public Policy: African Americans, American Indians, Asian Americans & Chicanos in the U.S.",
    "info": "Structural or institutional conditions through which people of color have been marginalized in public policy. Critical evaluation of social theory in addressing the problem of contemporary communities of color in the United States.",
    "prereq": []
  },
  {
    "uid": "806339",
    "code": "AAS4232",
    "subject": "AAS",
    "number": "4232",
    "honors": false,
    "writingIntensive": false,
    "name": "Am Drama by Writers of Color",
    "fullname": "American Drama by Writers of Color",
    "info": "Selected works by Asian American, African American, American Indian, Latino, and Chicano playwrights. How racial/ethnic differences are integral to shaping different visions of American drama. History of minority/ethnic theaters, politics of casting, mainstreaming of the minority playwright.",
    "prereq": []
  },
  {
    "uid": "797453",
    "code": "AAS4311",
    "subject": "AAS",
    "number": "4311",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian American Lit and Drama",
    "fullname": "Asian American Literature and Drama",
    "info": "Literary/dramatic works by Asian American writers. Historical past of Asian America through perspective of writers such as Sui Sin Far and Carlos Bulosan. Contemporary artists such as Frank Chin, Maxine Hong Kingston, David Henry Hwang, and Han Ong. Political/historical background of Asian American artists, their aesthetic choices.",
    "prereq": []
  },
  {
    "uid": "799083",
    "code": "AAS4920",
    "subject": "AAS",
    "number": "4920",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian American Studies Topics",
    "fullname": "Topics in Asian American Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "799879",
    "code": "AAS5920",
    "subject": "AAS",
    "number": "5920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics - AAS",
    "fullname": "Topics in Asian American Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "806141",
    "code": "AAS5993",
    "subject": "AAS",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Readings",
    "fullname": "Directed Readings",
    "info": "Directed reading--must be set up with individual instructor.",
    "prereq": []
  },
  {
    "uid": "802889",
    "code": "AAS5996",
    "subject": "AAS",
    "number": "5996",
    "honors": false,
    "writingIntensive": false,
    "name": "Graduate Proseminar",
    "fullname": "Graduate Proseminar",
    "info": "Discussions/presentations from various disciplinary perspectives on research, activism, and performance in Asian American/Diasporic Studies. Students engage in dialogue, observe models of scholarly engagement, and reflect on issues within Asian American/diasporic studies.",
    "prereq": []
  }
]