[
  {
    "uid": "819945",
    "code": "ACCT1911",
    "subject": "ACCT",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "The Language of Business",
    "fullname": "The Language of Business",
    "info": "Have you ever wondered why Tesla?s stock price tripled in a 3-month time period? Why did Toys R Us go bankrupt? Why does Apple hold on to $200 billion of cash? Why is Snapchat still not profitable yet? All of these questions can be answered by looking at a company?s financial statements!Financial accounting is often called the language of business as it is the language that companies use to communicate their financial information to various parties. Regardless of whether you want to work in the field of accounting and finance, become a manager at a company, or just dabble in stock market investing, understanding how a business works, how managers make decisions, and how to analyze financial statements will be hugely beneficial for your future. This seminar will start by exposing you to basic business terminology and concepts, as well as analyzing how businesses make decisions. Next, we will focus on the ABCs of financial statements and financial analysis. Finally, we will apply these principles to real-life case studies and discussions that explore various companies such as Spotify, Tesla, Uber, Netflix, Starbucks, Apple, Snapchat, and more!",
    "prereq": []
  },
  {
    "uid": "013103",
    "code": "ACCT2051",
    "subject": "ACCT",
    "number": "2051",
    "honors": false,
    "writingIntensive": false,
    "name": "Intr Financial Rptg",
    "fullname": "Introduction to Financial Reporting",
    "info": "This course introduces the topics of financial reporting and accounting. The purpose of financial accounting is to provide information to the entity owners and external parties to serve as the basis for making decisions about that entity. A student who successfully completes this class should be able to 1) understand the concepts and principles of accounting, 2) analyze, record and report the accounting treatment of business transactions, and 3) prepare, interpret, and analyze financial statements.",
    "prereq": []
  },
  {
    "uid": "013113",
    "code": "ACCT3001",
    "subject": "ACCT",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Mgmt Acct",
    "fullname": "Strategic Management Accounting",
    "info": "Costing techniques, including activity-based costing. Applying costing methods to determine costs of products, services, and production processes. Use of costs in operating/strategic decisions.\n\nprereq: ACCT 2051 or 2050",
    "prereq": {
      "or": [
        {
          "code": "ACCT 2051",
          "subject": "ACCT",
          "id": "2051"
        },
        {
          "code": "ACCT 2050",
          "subject": "ACCT",
          "id": "2050"
        }
      ]
    }
  },
  {
    "uid": "808378",
    "code": "ACCT3150",
    "subject": "ACCT",
    "number": "3150",
    "honors": false,
    "writingIntensive": false,
    "name": "Accountants Finance Function",
    "fullname": "Role of the Accountant in Today's Finance Function",
    "info": "How to interact with financial, tax, audit, and IT personnel. How to be an accountant. Critical support role accountants play among market leading companies. Students define their vision for their accounting career.prereq: 2050",
    "prereq": {
      "code": "ACCT 2050",
      "subject": "ACCT",
      "id": "2050"
    }
  },
  {
    "uid": "013843",
    "code": "ACCT3199",
    "subject": "ACCT",
    "number": "3199",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship, Public Accounting",
    "fullname": "Internship in Public Accounting",
    "info": "Full-time work for a public accounting firm plus a written report on the work experience.prereq: 5125, instr consent",
    "prereq": {
      "code": "ACCT 5125",
      "subject": "ACCT",
      "id": "5125"
    }
  },
  {
    "uid": "013845",
    "code": "ACCT3299",
    "subject": "ACCT",
    "number": "3299",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship, Mgmt Accounting",
    "fullname": "Internship in Management Accounting",
    "info": "Full-time work in general accounting, cost accounting, or internal auditing in an industrial or governmental organization plus a written report analyzing the work experience.prereq: Acct 3201, instr consent",
    "prereq": {
      "code": "ACCT 3201",
      "subject": "ACCT",
      "id": "3201"
    }
  },
  {
    "uid": "013961",
    "code": "ACCT5100",
    "subject": "ACCT",
    "number": "5100",
    "honors": false,
    "writingIntensive": false,
    "name": "Corp Fin Reporting",
    "fullname": "Corporate Financial Reporting",
    "info": "Overview of asset/liability valuation and income measurement. Focus on how economic events are reported in the financial statements. Examines accounting theory and the accounting standard-setting process.",
    "prereq": []
  },
  {
    "uid": "013815",
    "code": "ACCT5101",
    "subject": "ACCT",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Accounting I",
    "fullname": "Intermediate Accounting I",
    "info": "Valuation, measurement, reporting issues related to selected assets/liabilities of firm. Theory underlying accounting issues. Applying accounting principles.prereq: Grade of B- or better in Acct 2050/Acct 2051 OR passed the Acct pretest (z.umn.edu/Acct5101pretest); CSOM Major, MGMT minor, mgmt grad student",
    "prereq": {
      "or": [
        {
          "code": "ACCT 2050",
          "subject": "ACCT",
          "id": "2050"
        },
        {
          "code": "ACCT 2051",
          "subject": "ACCT",
          "id": "2051"
        }
      ]
    }
  },
  {
    "uid": "013816",
    "code": "ACCT5102",
    "subject": "ACCT",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Accounting II",
    "fullname": "Intermediate Accounting II",
    "info": "Basic valuation problems encountered in financial reporting. Focuses on valuation of liabilities. Accounting for leases, pensions, and deferred taxes. Introduces consolidated financial statements.\n\nprereq: 5101[ mgmt or grad mgmt student]",
    "prereq": {
      "code": "ACCT 5101",
      "subject": "ACCT",
      "id": "5101"
    }
  },
  {
    "uid": "013817",
    "code": "ACCT5125W",
    "subject": "ACCT",
    "number": "5125",
    "honors": false,
    "writingIntensive": true,
    "name": "Auditing",
    "fullname": "Auditing Principles and Procedures",
    "info": "Concepts of auditing internal control/financial statements in accordance with generally accepted auditing/professional standards established by Public Company Oversight Board (PCAOB) and American Institute of Certified Public Accountants (AICPA). Writing Intensive course.prereq: [3101 or 5101 or 5100 or 6100], [acct major or grad mgmt student]",
    "prereq": {
      "or": [
        {
          "code": "ACCT 3101",
          "subject": "ACCT",
          "id": "3101"
        },
        {
          "code": "ACCT 5101",
          "subject": "ACCT",
          "id": "5101"
        },
        {
          "code": "ACCT 5100",
          "subject": "ACCT",
          "id": "5100"
        },
        {
          "code": "ACCT 6100",
          "subject": "ACCT",
          "id": "6100"
        }
      ]
    }
  },
  {
    "uid": "013824",
    "code": "ACCT5126",
    "subject": "ACCT",
    "number": "5126",
    "honors": false,
    "writingIntensive": false,
    "name": "Internal Auditing",
    "fullname": "Internal Auditing",
    "info": "Financial/operational auditing. Standards. Managing the function.\n\nprereq: 2050",
    "prereq": {
      "code": "ACCT 2050",
      "subject": "ACCT",
      "id": "2050"
    }
  },
  {
    "uid": "013818",
    "code": "ACCT5135",
    "subject": "ACCT",
    "number": "5135",
    "honors": false,
    "writingIntensive": false,
    "name": "Federal Income Tax",
    "fullname": "Fundamentals of Federal Income Tax",
    "info": "U.S. federal system of taxation. Concepts of gross income, deductions, credits. Analysis of structure of Internal Revenue Code, its provisions with respect to specific areas of law. Interrelationships between legislative, judicial, and administrative authority. Methods, tools, and techniques to conduct tax research. \n\nprereq: [2050 and or 2051] or MBA 6030], [mgmt or grad mgmt student]",
    "prereq": {
      "or": [
        {
          "and": [
            {
              "code": "ACCT 2050",
              "subject": "ACCT",
              "id": "2050"
            },
            {
              "code": "ACCT 2051",
              "subject": "ACCT",
              "id": "2051"
            }
          ]
        },
        {
          "code": "MBA 6030",
          "subject": "MBA",
          "id": "6030"
        }
      ]
    }
  },
  {
    "uid": "819898",
    "code": "ACCT5141",
    "subject": "ACCT",
    "number": "5141",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial-Data Analytics",
    "fullname": "Financial-Data Analytics",
    "info": "This is a 2-credit introductory course on financial reporting data analytics for Carlson students. The main learning objective is to introduce students specializing in business (accounting, auditing, tax, finance, marketing, operations, etc.) to data analytics, providing them the necessary knowledge and tools needed to effectively use data analytics in their specialized domain. The goal is thus for students to be able to consume and use available data analytics technologies to complement existing technical skills, rather than to train \\\"data analytics specialists\\\" (although this class is a good jumping-off point for students who wish to pursue a career specializing in data analytics!). Prior coding experience is thus not required, although students should have completed business statistics (SCO 2550 or BA 2551 or equivalent statistics course). \n\nAfter a general overview of data analytics and machine learning, we will dive into the ETL (extract, transform, load) process, covering topics and showcasing applications such as data joins, variable types, formulas, and regular expressions. We will then explore data visualization tools (including pivot tables and dashboards) and conclude the term by modeling data to create business insights via predictions. Students will gain hands-on experience using state-of-the-art data analytics tools and will learn how to conduct basic SQL queries. Students will improve their quantitative and problem-solving skills and learn how to apply scientific research methods to answer questions, present solutions, and discuss limitations. An emphasis will be placed on financial reporting datasets/applications, although the methods and concepts covered are applicable to other business settings/functions. Ultimately, students will enhance their analytical skills and achieve a deeper understanding of issues related to financial reporting specifically and business more generally.  \n\nprereq: SCO 2550 or BA 2551 or equivalent statistics course and ACCT 2050 or 2051",
    "prereq": {
      "and": [
        {
          "code": "BA 2551",
          "subject": "BA",
          "id": "2551"
        },
        {
          "code": "ACCT 2050",
          "subject": "ACCT",
          "id": "2050"
        },
        {
          "code": "ACCT 2051",
          "subject": "ACCT",
          "id": "2051"
        }
      ]
    }
  },
  {
    "uid": "013820",
    "code": "ACCT5161",
    "subject": "ACCT",
    "number": "5161",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Statement",
    "fullname": "Financial Statement Analysis",
    "info": "Interpretation/analysis of financial statements. Introduces basic techniques of financial statement analysis and applies them in different settings (e.g., in investment/credit decisions).prereq: [5101]",
    "prereq": {
      "code": "ACCT 5101",
      "subject": "ACCT",
      "id": "5101"
    }
  },
  {
    "uid": "013823",
    "code": "ACCT5181",
    "subject": "ACCT",
    "number": "5181",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Reporting",
    "fullname": "Consolidations and Advanced Reporting",
    "info": "Theory underlying preparation of consolidated financial statements, as well as mechanical computations needed to prepare statements. prereq: 5101, 5102 recommended, or MBA 6031 (equiv. is also MBA 6030 before course number change in Fall 2022). MBA/Mgmt Sci MBA students must register A/F grade base.",
    "prereq": {
      "and": [
        {
          "code": "ACCT 5101",
          "subject": "ACCT",
          "id": "5101"
        },
        {
          "code": "ACCT 5102",
          "subject": "ACCT",
          "id": "5102"
        },
        {
          "code": "MBA 6031",
          "subject": "MBA",
          "id": "6031"
        },
        {
          "code": "MBA 6030",
          "subject": "MBA",
          "id": "6030"
        }
      ]
    }
  },
  {
    "uid": "014800",
    "code": "ACCT5200",
    "subject": "ACCT",
    "number": "5200",
    "honors": false,
    "writingIntensive": false,
    "name": "Tax Acct Methods",
    "fullname": "Tax Accounting Methods and Periods",
    "info": "Rules affecting timing of income and deductions for tax purposes. Examination of cash and accrual accounting methods on an overall basis and with respect to individual items of income and deductions; rules for changing accounting methods and periods; annual accounting and transactional concepts, including the claim of right doctrine, the Arrowsmith doctrine, and the tax benefit rule.",
    "prereq": []
  },
  {
    "uid": "013822",
    "code": "ACCT5201",
    "subject": "ACCT",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermed Mgmt Acct",
    "fullname": "Intermediate Management Accounting",
    "info": "This course is an in-action course. The course explores the topic of management accounting in greater depth. The course expands introductory course material via special emphasis on decision making, problem solving skills and exploration of accounting's role within overall management. The course is an in-action class. We will have a project working on a business case from a firm as the final assessment for the course.\n\nprereq: 3001, acct or finance major",
    "prereq": {
      "code": "ACCT 3001",
      "subject": "ACCT",
      "id": "3001"
    }
  },
  {
    "uid": "014802",
    "code": "ACCT5220",
    "subject": "ACCT",
    "number": "5220",
    "honors": false,
    "writingIntensive": false,
    "name": "Tax Research",
    "fullname": "Tax Research, Communication, and Practice",
    "info": "In-depth treatment of tax research methodology including tax questions, locating potential authority, assessing potential authority, and communicating research results. Substantive material on dealing with the IRS including sources of IRS policy; processing returns, auditing returns; rulings and determination letters; closing agreements; assessments and collections.",
    "prereq": []
  },
  {
    "uid": "013821",
    "code": "ACCT5236",
    "subject": "ACCT",
    "number": "5236",
    "honors": false,
    "writingIntensive": false,
    "name": "Taxation of Business",
    "fullname": "Introduction to Taxation of Business",
    "info": "Introduction to the income tax laws governing the taxation of corporations, partnerships, limited liability companies, limited liability partnerships, and S corporations. Students will also increase their knowledge and skills related to tax research by writing research memorandums.\n\nprereq: 5135, acct major",
    "prereq": {
      "code": "ACCT 5135",
      "subject": "ACCT",
      "id": "5135"
    }
  },
  {
    "uid": "802948",
    "code": "ACCT5237",
    "subject": "ACCT",
    "number": "5237",
    "honors": false,
    "writingIntensive": false,
    "name": "Foreign Natl Tax Consulting",
    "fullname": "Foreign National Tax Consulting",
    "info": "Tax return preparation/consulting experience. Partnership between U, IRS, Minnesota State Department of Revenue to provide free tax help to foreign national students, researchers, and visiting professors. Students preparing tax returns for nonresident aliens use commercial tax preparation software.",
    "prereq": []
  },
  {
    "uid": "015911",
    "code": "ACCT5271",
    "subject": "ACCT",
    "number": "5271",
    "honors": false,
    "writingIntensive": false,
    "name": "Acct Info. Systems",
    "fullname": "Accounting Information Systems",
    "info": "Applications of electronic data processing systems in accounting, including modeling, financial planning, auditing, and data security. Analysis/design of accounting information systems.",
    "prereq": []
  },
  {
    "uid": "014126",
    "code": "ACCT5281",
    "subject": "ACCT",
    "number": "5281",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics,Fin Report",
    "fullname": "Special Topics in Financial Reporting",
    "info": "Covers areas of financial reporting frequently encountered on CPA exam, including partnerships, governmental/nonprofit organizations, bankruptcy, reorganizations.prereq: 5101, 5102W recommended",
    "prereq": {
      "and": [
        {
          "code": "ACCT 5101",
          "subject": "ACCT",
          "id": "5101"
        },
        {
          "code": "ACCT 5102",
          "subject": "ACCT",
          "id": "5102"
        }
      ]
    }
  },
  {
    "uid": "013825",
    "code": "ACCT5311",
    "subject": "ACCT",
    "number": "5311",
    "honors": false,
    "writingIntensive": false,
    "name": "International Acct",
    "fullname": "International Accounting",
    "info": "Causes/history of international differences in design of financial accounting/reporting systems, efforts to harmonize them into worldwide system. Role/impact of currency translation on financial statements. International Accounting Standards, conceptual framework.\n\nprereq: 5101; [5102 or concurrent registration is required (or allowed) in 5102] recommended",
    "prereq": {
      "or": [
        {
          "code": "ACCT 5101",
          "subject": "ACCT",
          "id": "5101"
        },
        {
          "code": "ACCT 5102",
          "subject": "ACCT",
          "id": "5102"
        }
      ]
    }
  },
  {
    "uid": "013826",
    "code": "ACCT5320",
    "subject": "ACCT",
    "number": "5320",
    "honors": false,
    "writingIntensive": false,
    "name": "Fin Rep Data Analytics",
    "fullname": "Financial Reporting Data Analytics",
    "info": "This is a core course for the students in the Master of Accounting program at Carlson School of Management. The main learning objective is to familiarize students with large-scale financial reporting and market information databases and to improve students' quantitative analytical and problem-solving skills in conjunction with these data. We will discuss financial reporting and corporate governance topics related to earnings management, fraud detection, audit quality, board structure, and SEC enforcement. Students will gain hands-on data analysis experience. Students will also learn how to apply scientific research methods to answer questions, present solutions, and discuss limitations. We will provide a brief overview of the concepts of probability distribution and statistical inference. Relying on the above tools, students enhance their analytical skills and ultimately achieve deeper understanding on issues related to financial reporting and capital markets.Topics vary.",
    "prereq": []
  },
  {
    "uid": "014807",
    "code": "ACCT5325",
    "subject": "ACCT",
    "number": "5325",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Tax Principles",
    "fullname": "Advanced Tax Principles",
    "info": "In-depth coverage of issues affecting all tax entities, focusing on topics pertaining to individuals and partnerships: at-risk provisions, passive activity loss rules, Alternative Minimum Tax/AMT credit for individuals, tax benefit rule and claim of right doctrine, like-kind exchanges of personal property, net operating losses, hobby losses, and business/rental use of residences.",
    "prereq": []
  },
  {
    "uid": "014810",
    "code": "ACCT5330",
    "subject": "ACCT",
    "number": "5330",
    "honors": false,
    "writingIntensive": false,
    "name": "Tax of Corp II",
    "fullname": "Taxation of Corporations II",
    "info": "Corporate readjustments related to multiple corporations and consolidated returns.",
    "prereq": []
  },
  {
    "uid": "799460",
    "code": "ACCT5420",
    "subject": "ACCT",
    "number": "5420",
    "honors": false,
    "writingIntensive": false,
    "name": "MAcc directed study",
    "fullname": "MAcc directed study",
    "info": "Internship or directed study in Master of Accountancy degree program.prereq: MAcc student",
    "prereq": []
  },
  {
    "uid": "825963",
    "code": "ACCT5900",
    "subject": "ACCT",
    "number": "5900",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Accounting",
    "fullname": "Topics in Accounting",
    "info": "Topics in Accounting which focus on specialized areas in ACCT that area currently relevant or have importance in the field",
    "prereq": []
  },
  {
    "uid": "803485",
    "code": "ACCT6075",
    "subject": "ACCT",
    "number": "6075",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Global Corp Tax Rate",
    "fullname": "Managing the Global Corporate Tax Rate",
    "info": "Computation, disclosure, and analysis of worldwide provision for income taxes. Impact of new Administration's tax policy. Comparative corporate income tax systems. Impact of International Financial Reporting Standards. Short-term convergence of international/U.S. accounting standards. Case studies.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "808343",
    "code": "ACCT6101",
    "subject": "ACCT",
    "number": "6101",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Accounting II",
    "fullname": "Financial Accounting II",
    "info": "Interpreting financial statements and their financial disclosures. US disclosure rules. Communication methods for managers. Managers incentives. Ability to exert discretion over reported earnings. Interplay between corporate strategy and its financial reporting policies/practices.  ",
    "prereq": []
  },
  {
    "uid": "014129",
    "code": "ACCT6102",
    "subject": "ACCT",
    "number": "6102",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Statement Analysis",
    "fullname": "Financial Statement Analysis",
    "info": "Firms communicate their results to various users through financial statements. By developing an understanding about how companies report their economic transactions, financial statement users can better understand the results of those transactions. Financial statements tell the story of a firm and are the basis upon which business decisions are made, so users need the ability to properly analyze the financial statements in order to make accurate decisions regarding the firm’s future. By the end of this course, students should be able to evaluate how a firm’s business strategy translates to the financial statements, recognize potential earnings management, decipher whether a firm’s profitability is sustainable or unsustainable, understand revenue recognition rules and the potential for manipulation, articulate the general accounting rules regarding operating activities for a firm, evaluate how investing and financing activities affect a firm’s health, and utilize financial forecasting to predict how a company will likely perform in the future.prereq: MBA 6031, MBA/Mgmt Sci MBA student",
    "prereq": {
      "code": "MBA 6031",
      "subject": "MBA",
      "id": "6031"
    }
  },
  {
    "uid": "787674",
    "code": "ACCT6140",
    "subject": "ACCT",
    "number": "6140",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Economics",
    "fullname": "Managerial Economics",
    "info": "N/Aprereq: MBA 6030, MBA 6035",
    "prereq": {
      "and": [
        {
          "code": "MBA 6030",
          "subject": "MBA",
          "id": "6030"
        },
        {
          "code": "MBA 6035",
          "subject": "MBA",
          "id": "6035"
        }
      ]
    }
  },
  {
    "uid": "014130",
    "code": "ACCT6160",
    "subject": "ACCT",
    "number": "6160",
    "honors": false,
    "writingIntensive": false,
    "name": "Mergers, Acquisitions, Derivat",
    "fullname": "Accounting for Mergers and Acquisitions, and Derivatives",
    "info": "Analysis and interpretation of consolidated financial statements. Corporate restructurings, accounting for foreign subsidiaries. Analysis of risk management strategies of firms. Applying accounting standards for derivatives.prereq: MBA 6030",
    "prereq": {
      "code": "MBA 6030",
      "subject": "MBA",
      "id": "6030"
    }
  },
  {
    "uid": "015045",
    "code": "ACCT6201",
    "subject": "ACCT",
    "number": "6201",
    "honors": false,
    "writingIntensive": false,
    "name": "Control and Incentives",
    "fullname": "Control and Incentives",
    "info": "Design of activity-based costing, performance measurement, and incentive systems to support strategy of firm. Use of accounting measurements in balanced scorecard, economic value-added, and decentralized decision making. Information issues in design of incentive systems.prereq: MBA 6235; micro economics recommended",
    "prereq": {
      "code": "MBA 6235",
      "subject": "MBA",
      "id": "6235"
    }
  },
  {
    "uid": "014131",
    "code": "ACCT6320",
    "subject": "ACCT",
    "number": "6320",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Topics",
    "fullname": "Current Topics in Accounting",
    "info": "Topics vary.prereq: MBA 6130, MBA student",
    "prereq": {
      "code": "MBA 6130",
      "subject": "MBA",
      "id": "6130"
    }
  },
  {
    "uid": "798823",
    "code": "ACCT6335",
    "subject": "ACCT",
    "number": "6335",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Managerial Acct",
    "fullname": "Advanced Managerial Accounting",
    "info": "Topics of current interest. Detailed treatment of concepts learned in core. Application of concepts in complex settings. Harvard cases.prereq: MBA 6035 or MBA 6235",
    "prereq": {
      "or": [
        {
          "code": "MBA 6035",
          "subject": "MBA",
          "id": "6035"
        },
        {
          "code": "MBA 6235",
          "subject": "MBA",
          "id": "6235"
        }
      ]
    }
  },
  {
    "uid": "816226",
    "code": "ACCT6601",
    "subject": "ACCT",
    "number": "6601",
    "honors": false,
    "writingIntensive": false,
    "name": "Internal Control",
    "fullname": "Internal Control",
    "info": "Internal control from management's perspective. Application of COSO Internal Control—Integrated Framework and Enterprise Risk Management—Integrated Framework.prereq: MAcc grad major",
    "prereq": []
  },
  {
    "uid": "816284",
    "code": "ACCT6602",
    "subject": "ACCT",
    "number": "6602",
    "honors": false,
    "writingIntensive": false,
    "name": "SEC - Standard Setting",
    "fullname": "Securities and Exchange Commission (SEC) and Standard Setting",
    "info": "Role/organization of Securities and Exchange Commission (SEC) and Public Company Accounting Oversight Board (PCAOB). Compliance with Securities Act of 1933, Securities and Exchange Act of 1934, and Sarbanes-Oxley Act of 2002. Setting/convergence of international/U.S. accounting/auditing standards.",
    "prereq": []
  },
  {
    "uid": "816285",
    "code": "ACCT6603",
    "subject": "ACCT",
    "number": "6603",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Auditing",
    "fullname": "Advanced Auditing",
    "info": "Auditing of derivatives, business combinations, fair value instruments, and other accounting topics. Evaluating the discipline of forensic accounting.",
    "prereq": []
  },
  {
    "uid": "816227",
    "code": "ACCT6604",
    "subject": "ACCT",
    "number": "6604",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Management Accounting",
    "fullname": "Advanced Management Accounting",
    "info": "Advanced Management Accounting will expose students to the application of management accounting from a strategic perspective. Students will deepen their knowledge and understanding of management accounting's role in areas such as sustainability, environmental accounting, time-based accounting, including time-based activity-based costing, activity-based management, value chain analysis, business process re-engineering, benchmarking, target costing, product life cycle management, quantifying qualitative improvements and \"big data\". Via cases and discussion of current articles, students will explore the most current and challenging issues facing management accountants.",
    "prereq": []
  },
  {
    "uid": "816228",
    "code": "ACCT6605",
    "subject": "ACCT",
    "number": "6605",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiations for Exec.",
    "fullname": "Negotiations for Financial Executives",
    "info": "In Negotiations for Financial Executives, students will develop an individual negotiating style and learn to adapt their negotiating style to various situations. Students will learn the methods and frameworks for negotiating effectiveness: preparation, setting high expectations, listening, and a commitment to ethics. During the class, students will have opportunities to apply the preparation model to plan a negotiation and actually apply their knowledge in a live case situation.",
    "prereq": []
  },
  {
    "uid": "819943",
    "code": "ACCT6606",
    "subject": "ACCT",
    "number": "6606",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Data Analytics",
    "fullname": "Financial Data Analytics",
    "info": "The main learning objective of this course is to familiarize students with large-scale financial reporting and capital market information databases and to improve students' quantitative analytical skills in conjunction with these data. We will discuss financial reporting, consumer finance, and corporate governance topics. Students will gain hands-on data analysis experience using Tableau, Excel, and R. Students will learn how to apply scientific research methods to answer questions, present solutions, and discuss limitations. We will provide a brief overview of the concepts of probability and statistical inference. Relying on the above tools and methodology, students enhance their analytical skills and ultimately achieve deeper understanding on issues related to financial reporting, auditing, and capital markets.",
    "prereq": []
  },
  {
    "uid": "799357",
    "code": "ACCT8001",
    "subject": "ACCT",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Internal Control",
    "fullname": "Internal Control",
    "info": "Internal control from management?s perspective. Application of COSO Internal Control - Integrated Framework and Enterprise Risk Management - Integrated Framework.prereq: MAcc grad major",
    "prereq": []
  },
  {
    "uid": "799358",
    "code": "ACCT8002",
    "subject": "ACCT",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "SEC-Standard Setting",
    "fullname": "Securities and Exchange Commission (SEC) and Standard Setting",
    "info": "Role/organization of Securities and Exchange Commission (SEC) and Public Company Accounting Oversight Board (PCAOB). Compliance with Securities Act of 1933, Securities and Exchange Act of 1934, and Sarbanes-Oxley Act of 2002. Setting/convergence of international/U.S. accounting/auditing standards.prereq: MAcc grad major",
    "prereq": []
  },
  {
    "uid": "799550",
    "code": "ACCT8006",
    "subject": "ACCT",
    "number": "8006",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Audit",
    "fullname": "Advanced Audit",
    "info": "Auditing of derivatives, business combinations, fair value instruments, and other accounting topics. Evaluating the discipline of forensic accounting.prereq: MAcc student",
    "prereq": []
  },
  {
    "uid": "799496",
    "code": "ACCT8007",
    "subject": "ACCT",
    "number": "8007",
    "honors": false,
    "writingIntensive": false,
    "name": "International Accounting",
    "fullname": "International Accounting",
    "info": "Rapid changes in environment of international business, how they impact regulation of financial accounting. Causes/history of international differences in design of financial accounting/reporting systems, current efforts to harmonize them into worldwide system. Role/impact of currency translation on financial statements.",
    "prereq": []
  },
  {
    "uid": "803939",
    "code": "ACCT8800",
    "subject": "ACCT",
    "number": "8800",
    "honors": false,
    "writingIntensive": false,
    "name": "Empirical Research Topics I",
    "fullname": "Empirical Research: Topics I",
    "info": "Current research topics that are cutting-edge and in instructor's area of expertise. Topics vary.",
    "prereq": []
  },
  {
    "uid": "004480",
    "code": "ACCT8801",
    "subject": "ACCT",
    "number": "8801",
    "honors": false,
    "writingIntensive": false,
    "name": "Empirical Research I",
    "fullname": "Topics in Empirical Research I",
    "info": "Capital-markets stream of empirical research in accounting. Accounting earnings and stock prices, earnings-based security valuation (theoretical and empirical), estimation of earnings-based risk measures, market anomalies, and related topics from corporate finance. Econometric techniques in market-based empirical research/application to data analysis.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "010376",
    "code": "ACCT8802",
    "subject": "ACCT",
    "number": "8802",
    "honors": false,
    "writingIntensive": false,
    "name": "Empirical Research II",
    "fullname": "Topics in Empirical Research II",
    "info": "Empirical capital markets research topics course. The course is designed to include current research topics in capital markets that are cutting-edge and topics in the instructor's area of expertise. Topics will vary with each offering.",
    "prereq": []
  },
  {
    "uid": "803940",
    "code": "ACCT8803",
    "subject": "ACCT",
    "number": "8803",
    "honors": false,
    "writingIntensive": false,
    "name": "Empirical Research III",
    "fullname": "Topics in Empirical Research III",
    "info": "The course is designed to include current research topics in Empirical Research that are cutting-edge and topics in the instructor's area of expertise. Topics will vary with each offering.",
    "prereq": []
  },
  {
    "uid": "816105",
    "code": "ACCT8804",
    "subject": "ACCT",
    "number": "8804",
    "honors": false,
    "writingIntensive": false,
    "name": "Empirical Research Topics II",
    "fullname": "Empirical Research Topics II",
    "info": "Current research topics that are cutting edge and in instructor's area of expertise. Topics in the area will vary.",
    "prereq": []
  },
  {
    "uid": "004481",
    "code": "ACCT8811",
    "subject": "ACCT",
    "number": "8811",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Info Econ I",
    "fullname": "Topics in Information Economics I",
    "info": "Asymmetric information, incentives, and contracts. Moral hazard, adverse selection, reputation, and signaling phenomena. Applications to accounting such as transfer pricing, budgeting, cost allocations, performance measurement, audit pricing.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "010300",
    "code": "ACCT8812",
    "subject": "ACCT",
    "number": "8812",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Inform Economics II",
    "fullname": "Topics in Information Economics II",
    "info": "Information in capital markets; asset pricing with asymmetric information; economics of disclosure and information acquisition.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "817412",
    "code": "ACCT8813",
    "subject": "ACCT",
    "number": "8813",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Infor Econ III",
    "fullname": "Topics in Information Economics III",
    "info": "Asymmetric information, incentives, and contracts. Moral hazard, adverse selection, reputation, and signaling phenomena. Applications to accounting such as transfer pricing, budgeting, cost allocations, performance measurement, audit pricing.",
    "prereq": []
  },
  {
    "uid": "004482",
    "code": "ACCT8821",
    "subject": "ACCT",
    "number": "8821",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Capital Mrkts I",
    "fullname": "Topics in Capital Markets I",
    "info": "Auction markets; price formation in experimental asset markets; experimental studies of information transfer and capital market efficiency; experimental tests of strategic behavior, trust, and reciprocity. ",
    "prereq": []
  },
  {
    "uid": "010383",
    "code": "ACCT8822",
    "subject": "ACCT",
    "number": "8822",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Capital Markets II",
    "fullname": "Topics in Capital Markets II",
    "info": "Heuristics and biases in information processing, auditor judgment, mental accounting, and decision aids. ",
    "prereq": []
  },
  {
    "uid": "818087",
    "code": "ACCT8823",
    "subject": "ACCT",
    "number": "8823",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Capital Markets III",
    "fullname": "Topics in Capital Markets III",
    "info": "PhD seminar course concentrating on current topics in Capital Markets.",
    "prereq": []
  },
  {
    "uid": "803941",
    "code": "ACCT8831",
    "subject": "ACCT",
    "number": "8831",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Analytical Resrch I",
    "fullname": "Topics in Analytical Research I",
    "info": "The course is designed to include current analytical research topics that are cutting-edge and topics in the instructor's area of expertise. Topics will vary with each offering.",
    "prereq": []
  },
  {
    "uid": "803942",
    "code": "ACCT8832",
    "subject": "ACCT",
    "number": "8832",
    "honors": false,
    "writingIntensive": false,
    "name": "Analytical Research Topics II",
    "fullname": "Analytical Research Topics II",
    "info": "The course is designed to include current analytical research topics that are cutting-edge and topics in the instructor's area of expertise. Topics will vary with each offering.",
    "prereq": []
  },
  {
    "uid": "818089",
    "code": "ACCT8833",
    "subject": "ACCT",
    "number": "8833",
    "honors": false,
    "writingIntensive": false,
    "name": "Topic Analytical Research III",
    "fullname": "Topics in Analytical Research III",
    "info": "PhD seminar course focusing on current topics in Analytical Research",
    "prereq": []
  },
  {
    "uid": "004635",
    "code": "ACCT8892",
    "subject": "ACCT",
    "number": "8892",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Acctg",
    "fullname": "Readings in Accounting",
    "info": "Readings appropriate to an individual student's program or objectives that are not available in regular courses.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004636",
    "code": "ACCT8894",
    "subject": "ACCT",
    "number": "8894",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in Acctg",
    "fullname": "Research in Accounting",
    "info": "Individual research on an approved topic appropriate to student's program and objectives.prereq: Business admin PhD student or instr consent",
    "prereq": []
  }
]