[
  {
    "uid": "003176",
    "code": "ADED5001",
    "subject": "ADED",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey: HRD & AdEd",
    "fullname": "Survey: Human Resource Development and Adult Education",
    "info": "Overview of fields of human resource development and adult education.  Includes societal context, systems theory, processes, definitions, philosophies, goals, sponsoring agencies, professional roles, participants, and resources. Emphasis on the unique characteristics and ways the fields overlap and enhance one another.",
    "prereq": []
  },
  {
    "uid": "003259",
    "code": "ADED5303",
    "subject": "ADED",
    "number": "5303",
    "honors": false,
    "writingIntensive": false,
    "name": "Volunteers",
    "fullname": "Working with Volunteers in Community Settings",
    "info": "Uses collaborative, experiential methods to address fundamental issues and practices in volunteer development. Explore personal philosophies, staffing, and key issues and trends in the administration of volunteer programs.",
    "prereq": []
  },
  {
    "uid": "003316",
    "code": "ADED5401",
    "subject": "ADED",
    "number": "5401",
    "honors": false,
    "writingIntensive": false,
    "name": "Distance Lrng in AdEd & Trng",
    "fullname": "Distance Learning in Adult Education and Training",
    "info": "Distance learning concepts, theory, history, present practice, delivery systems, course design, major issues, and future directions.",
    "prereq": []
  },
  {
    "uid": "003621",
    "code": "ADED5612",
    "subject": "ADED",
    "number": "5612",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgng/Consult/HRD/AE",
    "fullname": "Managing and Consulting in Human Resource Development and Adult Education",
    "info": "Theory of managing/consulting in human resource development and adult education. Assessment of role requirements. Experimentation with practical management/consultation processes/techniques.",
    "prereq": []
  },
  {
    "uid": "003620",
    "code": "ADED8001",
    "subject": "ADED",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Theory HRD/AE",
    "fullname": "Advanced Theory in Human Resource Development and Adult Education",
    "info": "Theoretical understanding of individuals and organizations as adaptive entities; roles of human resource development and adult education in mediating complex demands.",
    "prereq": []
  }
]