[
  {
    "uid": "002797",
    "code": "AECM1001",
    "subject": "AECM",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Ag Ed, Comm, & Mktg",
    "fullname": "Introduction to Agricultural Education, Communication & Marketing",
    "info": "Historical development of the discipline of agricultural education; orientation to career opportunities; areas and expectations of specialization; issues in the field.",
    "prereq": []
  },
  {
    "uid": "002787",
    "code": "AECM2051",
    "subject": "AECM",
    "number": "2051",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Tech Competencies",
    "fullname": "Current Technical Competencies",
    "info": "Prepares agricultural education teachers and other agricultural professionals to use technology in the areas of welding and small gas engines. Develop basic skills and knowledge to plan, implement, operate, and maintain agricultural structural and mechanical systems. Experiential learning principles and applied problem solving.",
    "prereq": []
  },
  {
    "uid": "002771",
    "code": "AECM2096",
    "subject": "AECM",
    "number": "2096",
    "honors": false,
    "writingIntensive": false,
    "name": "Career Exploration, Experience",
    "fullname": "Career Exploration & Early Field Experience in Agricultural Education, Communication, and Marketing",
    "info": "Analyses of occupations, employment potential, expectations for work, and readiness for careers in agricultural education, communication, and marketing. Field placement experiences examine career options and professionals in the field. Observe schools, extension offices, and agricultural businesses to learn about the work/workplaces in agricultural education, communication, and marketing.",
    "prereq": []
  },
  {
    "uid": "796175",
    "code": "AECM2221W",
    "subject": "AECM",
    "number": "2221",
    "honors": false,
    "writingIntensive": true,
    "name": "Foundations of Leadership Prac",
    "fullname": "Foundations of Leadership Practice",
    "info": "How to be an effective leader in profit/non-profit agricultural settings. Roles, responsibilities, knowledge, attitudes, and skills to hire staff, set goals, coach, mentor/manage teams, and improve communication.",
    "prereq": []
  },
  {
    "uid": "796176",
    "code": "AECM2421W",
    "subject": "AECM",
    "number": "2421",
    "honors": false,
    "writingIntensive": true,
    "name": "Written & Oral Comm for Ag",
    "fullname": "Professional Communication for Agriculture, Food, and the Environment",
    "info": "Speaking/writing about scientific/technical issues. Student-centered, relies on interaction/participation. Public communication.  Lectures for this course will be online, while discussion sections will be held in-person.",
    "prereq": []
  },
  {
    "uid": "825636",
    "code": "AECM3000",
    "subject": "AECM",
    "number": "3000",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem on Current Issues in Ag Ed",
    "fullname": "Seminar on Current Issues in Agricultural Education",
    "info": "This seminar is designed to introduce students to current issues and trends in agricultural education. Small group discussion, in-depth/focused intellectual debate. Topics depend on faculty selection or student interest.",
    "prereq": []
  },
  {
    "uid": "005189",
    "code": "AECM3051",
    "subject": "AECM",
    "number": "3051",
    "honors": false,
    "writingIntensive": false,
    "name": "Building Construct Technology",
    "fullname": "Building Construction/Woodworking Technology",
    "info": "Instructional/lab exercises in light frame building construction. Foundations, concrete/masonry, framing, plumbing, electrical, insulating, roofing. Safe work procedures in a wood shop through small wood project construction will be utilized. Emphasizes safety and use of modern tools and materials.",
    "prereq": []
  },
  {
    "uid": "002975",
    "code": "AECM3096",
    "subject": "AECM",
    "number": "3096",
    "honors": false,
    "writingIntensive": false,
    "name": "Exper Learning: Prod/Business",
    "fullname": "Experiential Learning: Production and Business",
    "info": "Experiential learning in agricultural production and business. Planned, organized, monitored, and evaluated based on a per-experience diagnosis of learning prerequisite to higher level courses in technical agriculture and agricultural business.prereq: AgEd major, instr consent",
    "prereq": []
  },
  {
    "uid": "816372",
    "code": "AECM3106",
    "subject": "AECM",
    "number": "3106",
    "honors": false,
    "writingIntensive": false,
    "name": "Agricultural Policy",
    "fullname": "Agricultural Policy and Issues in Minnesota",
    "info": "This course will introduce students to advocacy and policy-making that affects Minnesota's agricultural industry, specifically at the farm level. They will experience the policy-making process from an initial idea to building support, lobbying, legislative work, implementation, and the effect policies have on Minnesota farmers. Students will get a behind-the-scenes look at the policy process in action by meeting lawmakers, lobbyists, and staff while on field trips to the Minnesota State Capitol and the Minnesota Department of Agriculture. Students will also shadow a current legislator, participate in a mock senate, hear from multiple guest speakers, and research the decision-making process by following an agricultural bill through the legislative session.prereq: 30 credits or instructor consent",
    "prereq": []
  },
  {
    "uid": "825600",
    "code": "AECM3125",
    "subject": "AECM",
    "number": "3125",
    "honors": false,
    "writingIntensive": false,
    "name": "Ag, Food, and You",
    "fullname": "Ag, Food, and You: Exploring Minnesota Agriculture, Food and Natural Resource Pathways",
    "info": "This course is designed to introduce students to the breadth and diversity of Minnesota agriculture, food, and natural resource pathways and industries. Students will participate in activities designed to broaden personal perspectives of agriculture and food production and enhance their ability to work across differences. Students will learn about themselves and explore valuable characteristics needed to succeed as professionals in agricultural, food, and natural resources. In addition to the regularly scheduled class time, attendance on two full-day experiential field trips is required. *Course fee required.",
    "prereq": []
  },
  {
    "uid": "809978",
    "code": "AECM3431",
    "subject": "AECM",
    "number": "3431",
    "honors": false,
    "writingIntensive": false,
    "name": "Communicating Ag & Env Science",
    "fullname": "Communicating Food, Agriculture & Environmental Science to the Public",
    "info": "Planning/strategy for communication campaigns related to food/agriculture. Student-centered, relies on interaction/participation.",
    "prereq": []
  },
  {
    "uid": "818877",
    "code": "AECM3434",
    "subject": "AECM",
    "number": "3434",
    "honors": false,
    "writingIntensive": false,
    "name": "SocMedia Food/Ag/NtrlRsrc Sci",
    "fullname": "Utilizing Social Media for Food, Agricultural and Natural Resource Sciences",
    "info": "The convergence of multiple forms of media, newspaper, video, radio, and photojournalism on the internet is impacting how we communicate complicated scientific issues related to topics such as food safety, agricultural production, and good stewardship of natural resources, and social media have been found to play a critical role in shaping science literacy. Because of the increasing presence of social media in our everyday lives, agriculturists are challenged with how to best package these complex scientific topics to increase science literacy through social media networks. This course aims to provide agriculturists who possess a strong background and understanding of food, agriculture and natural resource sciences with the skills needed to communicate these complex topics to audiences across social media platforms. ",
    "prereq": []
  },
  {
    "uid": "818878",
    "code": "AECM3444",
    "subject": "AECM",
    "number": "3444",
    "honors": false,
    "writingIntensive": false,
    "name": "Layout/Dsgn Food/Agro/NtrlRs",
    "fullname": "Layout and Design for Food, Agricultural and Natural Resource Sciences",
    "info": "This course provides students with in-depth, integrated use of leading industry-adopted software (Adobe Illustrator and Adobe InDesign) to develop print communication pieces. The class addresses layout aspects and file preparation critical to printing a project successfully and cost-effectively. Students will learn to create graphic art designs and develop effective print layouts. Serves as a foundational course that covers a range of topics related to layout and design from principles of design, typology, color, and technical software use. Class assignments focus on developing tools for use in food, agricultural and natural resources strategic and data-driven communications programs.",
    "prereq": []
  },
  {
    "uid": "818879",
    "code": "AECM3452",
    "subject": "AECM",
    "number": "3452",
    "honors": false,
    "writingIntensive": false,
    "name": "Dgtl Media Ag/Food/Environment",
    "fullname": "Digital Media Essentials for Agriculture, Food and the Environment",
    "info": "This course introduces basic digital and video communication skills necessary to be successful in today's workplace specific to professions in agriculture, food, and the environment. Students will infuse learning strategies into basic audio/visual productions and basic website construction focused on informing and communicating complex science topics.",
    "prereq": []
  },
  {
    "uid": "818880",
    "code": "AECM3462",
    "subject": "AECM",
    "number": "3462",
    "honors": false,
    "writingIntensive": false,
    "name": "Podcasting for Sci Literacy",
    "fullname": "Podcasting for Science Literacy",
    "info": "This course will introduce students to the art of audio storytelling and develop the professional skills used to communicate complex science topics to an intended audience.  The course explores a variety of concepts used in audio storytelling and educational programming.  Science topics will be researched and scripted in order to maximize acquired production skills with the intention of offering informative content to a target market. ",
    "prereq": []
  },
  {
    "uid": "811225",
    "code": "AECM3480",
    "subject": "AECM",
    "number": "3480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Ag Ed, Comm & Mktg",
    "fullname": "Special Topics in Agricultural Education, Communication & Marketing",
    "info": "Lectures by visiting scholar or regular faculty member. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "816991",
    "code": "AECM3993",
    "subject": "AECM",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study in Agricultural Education, Communication & Marketing",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. No more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "819490",
    "code": "AECM3994",
    "subject": "AECM",
    "number": "3994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research in Agricultural Education, Communication and Marketing",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use the University-wide on-line directed research contract process in order to enroll.Prereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "012866",
    "code": "AECM4011",
    "subject": "AECM",
    "number": "4011",
    "honors": false,
    "writingIntensive": false,
    "name": "Appld Agribus Mktg Strategies",
    "fullname": "Applied Agribusiness Marketing Strategies",
    "info": "Application of marketing knowledge that involves building a complete marketing plan for an agricultural product or device. Team projects are used.",
    "prereq": []
  },
  {
    "uid": "825395",
    "code": "AECM4115",
    "subject": "AECM",
    "number": "4115",
    "honors": false,
    "writingIntensive": false,
    "name": "Culturally Resp Engmt in AFNR",
    "fullname": "Culturally Responsive Engagement in Agriculture, Food & Natural Resources",
    "info": "The course is broken up into five thematic and progressive modules. Module 1 will provide the opportunity for students to investigate contemporary and historical manifestations oppression and inequities within Agricultural, Food and Natural Resource Sciences (AFNR) with a special focus on community and educational spaces. Module 2 will support students to explore oppression, power, privilege, and white supremacy. Students will explore how these show in society at large, as well as how they personally embody and enact these very things. Module 3 will prompt students to consider the nature of knowledge that is legitimized and knowledge that is suppressed. We will then learn about diverse knowledge systems and decolonizing work. Module 4 will support students to explore culture, identity, intersectionality, and positionality – their own and those of other cultural groups. We will consider how some cultures are lifted while others are marginalized in different spaces. Module 5 brings us to learning about methods of bring culturally responsive and anti-racist in AFNR work in educational and community spaces. We will employ the use of equity audits to assess various organizations and to design plans moving forward.",
    "prereq": []
  },
  {
    "uid": "002794",
    "code": "AECM4221",
    "subject": "AECM",
    "number": "4221",
    "honors": false,
    "writingIntensive": false,
    "name": "Rural Leadership Development",
    "fullname": "Rural Leadership Development",
    "info": "Understanding the role, function, and features of leadership in rural communities; importance of personal involvement, personal leadership qualities, and vision for individuals and rural community organizations.",
    "prereq": []
  },
  {
    "uid": "818881",
    "code": "AECM4432",
    "subject": "AECM",
    "number": "4432",
    "honors": false,
    "writingIntensive": false,
    "name": "Advcd Video Agro/Food/Envrnmnt",
    "fullname": "Advanced Video Production for Agriculture, Food and the Environment",
    "info": "This course focuses on advanced digital media production skills necessary to be successful in today's workplace specific to professions in agriculture, food and the environment. Students will infuse learning strategies into advanced documentary-style audio/visual productions. Content will be used to produce educational websites focused on informing and communicating complex science topics. prereq: AECM 3452 or Instructor Consent",
    "prereq": {
      "code": "AECM 3452",
      "subject": "AECM",
      "id": "3452"
    }
  },
  {
    "uid": "818882",
    "code": "AECM4444",
    "subject": "AECM",
    "number": "4444",
    "honors": false,
    "writingIntensive": false,
    "name": "Food/Agro Marketing Campaigns",
    "fullname": "Food and Agricultural Marketing Campaigns",
    "info": "This course discusses the strategy and tactical tools and techniques required to create and execute an integrated marketing communications program in the food and agricultural industries. We will cover the issues and elements of audience analysis and segmentation, advertising, brand management, product development/naming, product placement, package design and labeling, advertising and marketing avenues, and evaluation of advertising effectiveness.",
    "prereq": []
  },
  {
    "uid": "816607",
    "code": "AECM4451W",
    "subject": "AECM",
    "number": "4451",
    "honors": false,
    "writingIntensive": true,
    "name": "Adv Persuasive Writing for Ag",
    "fullname": "Advanced Persuasive Writing for Agricultural and Environmental Sciences",
    "info": "In this course, students research, write, and edit stories for agricultural, food and environmental organizations and media. Students produce a final portfolio that demonstrates their ability to create professional-level work, such as magazine articles, news stories, biographies, marketing materials, blog posts, news releases and scripts.",
    "prereq": []
  },
  {
    "uid": "818883",
    "code": "AECM4452",
    "subject": "AECM",
    "number": "4452",
    "honors": false,
    "writingIntensive": false,
    "name": "Virtual Field Trips for Sci Ed",
    "fullname": "Virtual Field Trip Production for Agriculture, Food & Natural Resource Science Education & Comm",
    "info": "This course explores the process of using digital media production skills to develop educational virtual field trips.  Produced content will focus on reaching students in the K-12 classroom. Topics range from basic to complex agriscience concepts and often times will rely on the virtual setting due to limitations of biosecurity hazards, OSHA guidelines and industry regulations. Students will script and produce curriculum driven video content as well as develop supplemental media assets to be used as classroom activities for field trip participants.prereq: AECM 3452 or Instructor Consent",
    "prereq": {
      "code": "AECM 3452",
      "subject": "AECM",
      "id": "3452"
    }
  },
  {
    "uid": "002801",
    "code": "AECM5111W",
    "subject": "AECM",
    "number": "5111",
    "honors": false,
    "writingIntensive": true,
    "name": "AgEd Methods",
    "fullname": "Agricultural Education: Methods of Teaching",
    "info": "Use of teaching resources; principles of teaching and learning; problem-solving techniques, lesson plan construction for large group, small group and individual investigations; student management; and assessment.",
    "prereq": []
  },
  {
    "uid": "001705",
    "code": "AECM5112",
    "subject": "AECM",
    "number": "5112",
    "honors": false,
    "writingIntensive": false,
    "name": "AGED Prog Org & Cur",
    "fullname": "Agricultural Education Program Organization and Curriculum for Youth",
    "info": "Development of community school program in agriculture, agribusiness, and environmental science. Program to meet graduation outcomes and determine student needs.",
    "prereq": []
  },
  {
    "uid": "002742",
    "code": "AECM5114",
    "subject": "AECM",
    "number": "5114",
    "honors": false,
    "writingIntensive": false,
    "name": "Ag Ed Teach Sem",
    "fullname": "Agricultural Education Teaching Seminar",
    "info": "Reflective learning on teacher preparation experience; identify issues and problems facing the discipline; needs for continual preparation and program adjustment.",
    "prereq": []
  },
  {
    "uid": "816373",
    "code": "AECM5115",
    "subject": "AECM",
    "number": "5115",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Ag Education",
    "fullname": "Foundations of Agricultural Education",
    "info": "This course explores historical and philosophical foundations and current structures of school-based agricultural education programs. Students will understand, value, and apply strategies to implement and manage the integrated program model of agricultural education.",
    "prereq": []
  },
  {
    "uid": "791309",
    "code": "AECM5116",
    "subject": "AECM",
    "number": "5116",
    "honors": false,
    "writingIntensive": false,
    "name": "Coord.SAE Prog:Work-based Lrng",
    "fullname": "Coordination of SAE Programs: Work-based Learning",
    "info": "Principles and techniques for coordinating work-based learning. Supervised agricultural experience in agricultural education. Historical and philosophical roots of experiential learning, integration with classroom instruction, legal aspects, record keeping, coordination techniques, current agreement laws.",
    "prereq": []
  },
  {
    "uid": "791310",
    "code": "AECM5118",
    "subject": "AECM",
    "number": "5118",
    "honors": false,
    "writingIntensive": false,
    "name": "Strat. Managing Adv. FFA Org",
    "fullname": "Strategies for Managing and Advising the FFA Organization",
    "info": "Principles and techniques to advise an FFA chapter. Historical and philosophical basis of FFA, organization and structure. Integration with classroom instruction, public relations, recruitment, and administration of FFA chapters.",
    "prereq": []
  },
  {
    "uid": "819629",
    "code": "AECM5125W",
    "subject": "AECM",
    "number": "5125",
    "honors": false,
    "writingIntensive": true,
    "name": "Curriclm & Instrctn Agrcltr Ed",
    "fullname": "Designing Curriculum & Instruction for Agricultural Education",
    "info": "This course provides students an opportunity to understand, observe, and experience the process of developing curriculum and instruction for school-based agricultural education. Through coursework and a part-time clinical field experience (minimum of 25 hours at an assigned placement) in a school setting (grades 5-12), students will engage in the development of middle and secondary school agricultural education curricula. Special consideration in planning will be given to identifying regional, state, and community needs as well as student interest and prior knowledge. Students will have the opportunity to determine a programmatic framework, outline a scope and sequence of courses within a school-based agricultural education program, develop course outlines and materials, and create units, sub-units, and daily lessons for a variety of content areas. Additionally, using the integrated program model, curricular and instructional opportunities related to experiential learning (Supervised Agricultural Experience - SAE) and leadership development (FFA) will be addressed.prereq: AECM 5115",
    "prereq": {
      "code": "AECM 5115",
      "subject": "AECM",
      "id": "5115"
    }
  },
  {
    "uid": "819157",
    "code": "AECM5135",
    "subject": "AECM",
    "number": "5135",
    "honors": false,
    "writingIntensive": false,
    "name": "Instr Methodology for Ag Ed",
    "fullname": "Instructional Methodology for Agricultural Education",
    "info": "This course focuses on instructional methodology for use in school-based agricultural education. Students will understand and apply psychological principles of teaching and learning, practice a variety of instructional strategies, develop pedagogical content knowledge, and apply the integrated program model of agricultural education to classroom teaching.Prerequisites: Junior or senior Ag Ed student or Ag Ed MS IL student",
    "prereq": []
  },
  {
    "uid": "819158",
    "code": "AECM5145",
    "subject": "AECM",
    "number": "5145",
    "honors": false,
    "writingIntensive": false,
    "name": "Ag Ed Classroom & Prog Ldshp",
    "fullname": "Agricultural Education Classroom & Program Leadership",
    "info": "This course examines models of classroom and program leadership within school-based agricultural education. Through coursework and a part-time clinical field experience (minimum of 25 hours) in a school setting (grades 5-12), students will learn, observe, and experience the ways in which school-based agricultural education teachers create and maintain an effective classroom/lab environment, manage student behavior, communicate and engage with school district leaders, program stakeholders, and community members to ensure student success. (3 credits)Prereqs: Jr or Sr Ag Ed student or Ag Ed MS IL student",
    "prereq": []
  },
  {
    "uid": "819171",
    "code": "AECM5155",
    "subject": "AECM",
    "number": "5155",
    "honors": false,
    "writingIntensive": false,
    "name": "Agricultural Ed Teaching Sem",
    "fullname": "Agricultural Education Teaching Seminar",
    "info": "This course emphasizes professionalism and the code of ethics for school-based agricultural educators. Students are prepared for the job search and teacher licensure application process. Students take this course concurrent with AECM 5698-Teaching Internship and apply professionalism and the integrated program model in their classroom, school, and community.prereq: AECM 5698 co-requisite",
    "prereq": {
      "code": "AECM 5698",
      "subject": "AECM",
      "id": "5698"
    }
  },
  {
    "uid": "002986",
    "code": "AECM5220",
    "subject": "AECM",
    "number": "5220",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topics in Ag Ed and Comm",
    "fullname": "Special Topics in Agricultural Education and Communication",
    "info": "Content varies by offering.",
    "prereq": []
  },
  {
    "uid": "002705",
    "code": "AECM5231",
    "subject": "AECM",
    "number": "5231",
    "honors": false,
    "writingIntensive": false,
    "name": "Education Across Contexts",
    "fullname": "Education Across AFNR (Agriculture, Food & Natural Resource) Contexts",
    "info": "Philosophy, organization, and administration of instruction in agricultural education programs at the elementary, middle, and high school levels.",
    "prereq": []
  },
  {
    "uid": "002722",
    "code": "AECM5233",
    "subject": "AECM",
    "number": "5233",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Learning & Curr for AgEd",
    "fullname": "Advanced Learning & Curriculum for Agricultural Education",
    "info": "New developments in methodology; assessment of innovations and procedures; consideration of various levels of instruction.",
    "prereq": []
  },
  {
    "uid": "003256",
    "code": "AECM5235",
    "subject": "AECM",
    "number": "5235",
    "honors": false,
    "writingIntensive": false,
    "name": "Experiential Learning in Ag Ed",
    "fullname": "Experiential Learning in Agricultural Education",
    "info": "The organization and administration of agricultural experience programs for middle and secondary level students: career exploration, improvement projects, experiments, placement in production/business/community settings, entrepreneurship. Current state and national programs and resource material.",
    "prereq": []
  },
  {
    "uid": "826518",
    "code": "AECM5252",
    "subject": "AECM",
    "number": "5252",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Comm in AELS",
    "fullname": "Principles of Communication, Public Outreach, & Social Change for Ag, Environmental, & Life Sciences",
    "info": "This course provides an overview of the essential communication theories, strategies, and practical tactics necessary for communicating information related to agricultural, environmental, and life sciences to different audiences. Course curriculum is designed to improve your ability to engage in public communication and outreach efforts. We will discuss both the science of science communication, as well as apply high-level concepts to the practice of science communication. Course content will include case studies, current research, and programs to better understand connections between science communication, information acquisition, and behavior change. We will focus on understanding audiences and their information needs, designing effective communication strategies that build dialogue, and strengthening science communication skills.",
    "prereq": []
  },
  {
    "uid": "002740",
    "code": "AECM5280",
    "subject": "AECM",
    "number": "5280",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Agricultural Ed Tchr",
    "fullname": "Current Issues for the Beginning Agricultural Education Teacher",
    "info": "Reflection, analysis on current problems and issues confronting beginning teachers of agricultural education. Issues in teaching methods, classroom and program management, discipline, curriculum, FFA and SAE development, school-to-work relationships.",
    "prereq": []
  },
  {
    "uid": "826519",
    "code": "AECM5454",
    "subject": "AECM",
    "number": "5454",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Eval in AEC",
    "fullname": "Foundations of Evaluation in Comm, Public Outreach & Education in Ag, Environmental & Life Sciences",
    "info": "This course will explore the fundamentals of communication, public outreach, and education evaluation relevant to agricultural, environmental, and life sciences. Students will learn a variety of concepts, methods, and analysis techniques that will provide them with a foundational knowledge to be able to conduct, interpret, evaluate, and present communication and education research within the context of agricultural, environmental, and life sciences.",
    "prereq": []
  },
  {
    "uid": "804433",
    "code": "AECM5696",
    "subject": "AECM",
    "number": "5696",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Internship",
    "fullname": "Teaching Internship",
    "info": "Agricultural Education teaching experience in a school system that provides instruction to grades 5-12. prereq: Exclude fr or soph 5000 level courses",
    "prereq": {
      "code": "AECM 5000",
      "subject": "AECM",
      "id": "5000"
    }
  },
  {
    "uid": "804391",
    "code": "AECM5697",
    "subject": "AECM",
    "number": "5697",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Intern: School/Classr",
    "fullname": "Teaching Internship: School and Classroom Setting",
    "info": "Part-time supervised teaching experience in a school. Seminars on managing student's learning in context of work and human resource education programs in contemporary schools and on becoming a reflective educator.prereq: WHRE 5696 for initial licensure program",
    "prereq": {
      "code": "WHRE 5696",
      "subject": "WHRE",
      "id": "5696"
    }
  },
  {
    "uid": "008844",
    "code": "AECM5993",
    "subject": "AECM",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Study in Ag Ed & Comm",
    "fullname": "Directed Study in Agricultural Education and Communication",
    "info": "Topics may be chosen to permit the study of areas within education or to supplement areas of inquiry not provided in the regular course structure.",
    "prereq": []
  },
  {
    "uid": "001910",
    "code": "AECM5995",
    "subject": "AECM",
    "number": "5995",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrating Paper/Project",
    "fullname": "Integrating Paper/Project in Agricultural Education and Communication",
    "info": "Students prepare paper dealing with issues in agricultural education applied to professional responsibilities. AFEE 5995 can be taken for 1-5 credits, and students can enroll for two semesters for a combined max total of 5 credits.",
    "prereq": []
  },
  {
    "uid": "002134",
    "code": "AECM8090",
    "subject": "AECM",
    "number": "8090",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar:  AGEE",
    "fullname": "Seminar: Agricultural Education and Extension",
    "info": "Topics on various aspects of agricultural education. Prepare, present, and critique a report.prereq: AgEd grad student",
    "prereq": []
  },
  {
    "uid": "002135",
    "code": "AECM8094",
    "subject": "AECM",
    "number": "8094",
    "honors": false,
    "writingIntensive": false,
    "name": "Research",
    "fullname": "Research in Agricultural Education and Extension",
    "info": "Select problems, prepare bibliographies, analyze and interpret data, and prepare manuscripts on studies.prereq: AgEd student doing Plan B research, dept consent",
    "prereq": []
  }
]