[
  {
    "uid": "797550",
    "code": "AFRO1009",
    "subject": "AFRO",
    "number": "1009",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Women in Africa",
    "fullname": "History of Women in Africa: 1500 to the Present",
    "info": "This course examines the histories of women on African frontiers. The course will highlight the role of women in their relation with family, with other African/nonAfrican peoples, as well as the role of women of the border regions of Sahel-Savanna, SavannaForest, within the country of Morocco, and along the Indian Ocean-Swahili Coast and Atlantic Coast frontiers. AFRO 1009 will compare the roles of African women from specific regions to others in different times and places in Africa, as well as with their contemporaries in Asia, Europe, and the Americas. We will consider the ways in which the women under scrutiny played a critical role in the dynamic changes that transformed their worlds and the worlds aroundthem. Indeed, the historical lens that informs and underpins this course is premised on the understanding that people make change and that change does not just happen in and of itself. In recognizing the process of change over time, AFRO 1009 emphasizes the significance of socialand cultural context in shaping the extent and nature of women’s participation in these processes. Therefore, the course will seek to understand the cultural beliefs and the rich ethnic, economic, religious networks, which buttressed the women’s roles and examine their associated factors. Inaddition to stressing the importance of change over time, AFRO 1009 engages students in a reflection of the past in an attempt to understand those reflections within the continuum of past, present, and future. Accordingly, AFRO 1009 impels us to think about the long term effects ofany change, however slight or insignificant it may seem.",
    "prereq": []
  },
  {
    "uid": "002267",
    "code": "AFRO1011",
    "subject": "AFRO",
    "number": "1011",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Afro-Am",
    "fullname": "Introduction to African American Studies",
    "info": "This course is an introduction to the study of people of African descent in the United States with linkages to Africa and connections to the African diaspora. We will explore why people of African descent have occupied an oppressed position in this culture and globally and how they have resisted this oppression creating social change. Our major form of analysis is historical sociology, as well as the arts and humanities. We will examine changes over time and employ sociological, economic, cultural, and political tools for understanding the historical and contemporary positioning of African Americans. We will be centrally concerned with how domination, race, gender, and class shape Black life in the U.S. and how resistance and change have occurred. In our analyses we take seriously the deep intersectionality of systems of oppression as well as historic resistance to oppression. Critical race theory and Black feminist theory are important frames for our work. Moreover, the significance of the cultural creativity of African peoples is foundational to our understanding. We must be concerned with how Black people see themselves today. How social change is imagined in the 21st century informs our work.",
    "prereq": []
  },
  {
    "uid": "799888",
    "code": "AFRO1012",
    "subject": "AFRO",
    "number": "1012",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Worlds in Global Perspec",
    "fullname": "Black Worlds in Global Perspective: Challenges and Changes",
    "info": "Challenges/possibilities emerging out of dispersal of Africans and their descendants throughout New World. How dispersion occurred, why it transformed Black worlds over time. Mechanisms of impoverishment. Consequences of global migrations in lives of Africans and peoples of African descent.",
    "prereq": []
  },
  {
    "uid": "002268",
    "code": "AFRO1021",
    "subject": "AFRO",
    "number": "1021",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Africa",
    "fullname": "Introduction to Africa",
    "info": "A comparative regional examination of contemporary African challenges and varied struggles using case studies, and a range of analytical parameters. Of particular focus will be issues of political destabilization, social fragmentation,economic disruption; internal displacement and international migration within regional and global contexts.",
    "prereq": []
  },
  {
    "uid": "808542",
    "code": "AFRO1023W",
    "subject": "AFRO",
    "number": "1023",
    "honors": false,
    "writingIntensive": true,
    "name": "African World Literature",
    "fullname": "Introduction to African World Literature",
    "info": "Childhood is a time of intense growth and dramatic change; of rapid physical, mental and emotional development. It is a time of discovering, experiencing, exploring; of exuberant curiosity and creativity. It is a state characterized by play and activity, innocence and wonder, surprise and delight. But childhood can also be a time of great confusion and uncertainty; of doubt, turmoil and anxiety. Through select pieces of short fiction, prose, essays and cinematic works, we will analyze the popularity of the coming–of–age genre (or bildungsroman) as a primary mode of formative response within the African world literary tradition. We will consider how the autobiographical or semi-autobiographical story, told by a narrator who is growing up and becoming conscious of their body, their familial and wider social surroundings, their emotions, their very identity, dramatizes the cultural, political, and historical contexts in which it is set. Through our exploration of socialization as a thematic component of the bildungsroman, we will examine how “coming-of-age” comes to represent something very different for boys and for girls.",
    "prereq": []
  },
  {
    "uid": "791910",
    "code": "AFRO1131",
    "subject": "AFRO",
    "number": "1131",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Issues in Africa",
    "fullname": "Contemporary Issues in Africa",
    "info": "While issues in Africa have been discussed widely, little attention is given to what African nations have achieved since their independence. The course critically questions the generally pessimistic international viewpoint on African economic prospects and emphasizes some of the continent’s national successes. This course examines the factors underlying contemporary issues in the continent, discussing Africa’s major challenges, including climate change, problems related to extractive industries, the brain drain, illicit capital flight, and the burden of debt. It outlines how challenges such as the migration of professionals and extractive industries could be turned into opportunities to transform the continent’s educational and health sectors and improve revenue at local levels by looking at case studies in which these problems have been at least partially overcome. The course uses data derived from cultural anthropology, geography, political sciences, and economics. ",
    "prereq": []
  },
  {
    "uid": "803153",
    "code": "AFRO1201",
    "subject": "AFRO",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Racial Formation/Transform US",
    "fullname": "Racial Formation and Transformation in the United States",
    "info": "How aggrieved racialized groups struggle over identity, culture, place, and meaning. Histories of racialization. Strategies toward rectification of historical injustices from dispossession, slavery, exploitation, and exclusion.",
    "prereq": []
  },
  {
    "uid": "791329",
    "code": "AFRO1902",
    "subject": "AFRO",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "795764",
    "code": "AFRO1904",
    "subject": "AFRO",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specific in Class Schedule.prereq: Fr or less than 30 cr",
    "prereq": []
  },
  {
    "uid": "791330",
    "code": "AFRO1909W",
    "subject": "AFRO",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr with no more than 30 cr",
    "prereq": []
  },
  {
    "uid": "817270",
    "code": "AFRO1911",
    "subject": "AFRO",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Blackness and Reality TV",
    "fullname": "Blackness and Reality Television",
    "info": "Many critics date the summer of 2000, when Survivor and Big Brother quickly became ratings juggernauts, as the beginning of the contemporary reality television boom. Within a few short years, shows like College Hill and America’s Next Top Model began pushing the genre to centralize the experiences of black cast members and, today, reality shows that feature solely or predominately black casts are among the most successful of the genre. For some people, the proliferation of reality television and the roles black people have played in it has been welcome, while for others it has been a major cause for concern, particularly given the complex history of black representation in U.S. public culture. In this course, we will consider what is at stake in the cultural battles over reality television and the fraught history of black media representation. The final six weeks of the course will be dedicated to a reality television-style competition in which students will be expected to work in groups.",
    "prereq": []
  },
  {
    "uid": "818052",
    "code": "AFRO1917",
    "subject": "AFRO",
    "number": "1917",
    "honors": false,
    "writingIntensive": false,
    "name": "Inequality & American Dream",
    "fullname": "Inequality and the American Dream",
    "info": "Increasing and intensifying inequality is perhaps the most pressing socio-economic problem of our time. A significant threat to democracy, the American dream, and national values of diversity and inclusion, wealth inequality today has not only surpassed that of the Great Depression but also grafted onto longstanding, intersectional cleavages of race, gender, indigeneity, class, and sexuality. The richest one percent have captured nearly 60 percent of all income gains from 1977 to 2000, and in 2010, the top 20 percent of households owned almost 90 percent of all privately held wealth in the United States, while the net worth of the bottom 40 percent was negative. Simultaneously, much of the current political polarization, cultures of resentment, and rise in scapegoating and racist anti-immigrant actions have also been attributed to the attendant consequences of rising inequality, anxiety, and insecurity. And yet, many social critics argue that instead of addressing the key causes of inequality and the crisis of the American dream, the powerful in society have seized on these conditions to mobilize an avalanche of discontent among sectors of the downwardly mobile in a way that often obscures the key reasons for their predicament and scapegoats those at the social margins. Given this context, it is imperative to better understand and analyze the histories, cultural assumptions, and hierarchies that have produced contemporary inequality. How did we get to this point? What are the consequences, and what might we expect in the future? This set of seminars asks these hard questions and engages in precisely this exploration.  These four freshman seminars (AFRO 1917, ANTH 1917, GWSS 1917, HIST 1917) will occasionally meet together, and will bring together scholars across multiple disciplines (African American Studies, Anthropology, Feminist Studies, History, and beyond) who are substantively engaged with scholarship on class, race, indigeneity, gender, and sexuality. We believe that this cross-fertilization is critical because the fault-lines of inequality have precisely cohered to these structural formations and categories of analysis.",
    "prereq": []
  },
  {
    "uid": "002278",
    "code": "AFRO3001",
    "subject": "AFRO",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "West Africa to 1800",
    "fullname": "West African History: Early Times to 1800",
    "info": "West Africa from early times to establishment/histories of states. Relations with North African, Mediterranean, Asian, and American worlds. Non-centralized political authority.",
    "prereq": []
  },
  {
    "uid": "002279",
    "code": "AFRO3002",
    "subject": "AFRO",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "West Africa from 1800",
    "fullname": "West African History: 1800 to Present",
    "info": "West African history from late 18th century to present. Past/profound changes including new 19th century state formation, European colonialism, post-colonial issues.",
    "prereq": []
  },
  {
    "uid": "793836",
    "code": "AFRO3006",
    "subject": "AFRO",
    "number": "3006",
    "honors": false,
    "writingIntensive": false,
    "name": "African Migrations to Atlantic",
    "fullname": "Impact of African Migrations in the Atlantic World",
    "info": "Between the sixteenth and the nineteenth centuries, the Trans-Atlantic slave trade forced millions of Africans into bondage in the Americas. While the exact number remains unknown, it is estimated that over 10 million Africans arrived in the New World over a period of 400 years. Most of them were bound for Central and South America with less than half a million arriving to the British colonies in North America. At the dawn of the 21st Century, however, U.S. census figures determined that more Africans had arrived in the United States voluntarily since 1990, than the total amount brought in as captives. This course examines the impact of African migrations in the Atlantic World beginning with the explorations of Portuguese mariners down the coast of West Africa in the 15th century, which set the foundation for the trans-Atlantic slave trade.",
    "prereq": []
  },
  {
    "uid": "793838",
    "code": "AFRO3009",
    "subject": "AFRO",
    "number": "3009",
    "honors": false,
    "writingIntensive": false,
    "name": "Women on African Frontiers",
    "fullname": "History of Women on African Frontiers: 1500 to Present",
    "info": "Histories of women on African frontiers, 1500 to present. Women in relations with their families, with other African, and with non-African people. Focuses on women of borders of Sahil-Savanna, Savanna-Forest, Morocco, Swahili coast, and Atlantic coast frontiers.",
    "prereq": []
  },
  {
    "uid": "002326",
    "code": "AFRO3013",
    "subject": "AFRO",
    "number": "3013",
    "honors": false,
    "writingIntensive": false,
    "name": "Cities and States in Africa",
    "fullname": "Cities and States in Ancient Africa",
    "info": "In this course, students will learn about the nexus between society and the environment, the underlining environmental issues that transformed ancient cities, and the implications they have on the contemporary ecological problems Africa is facing. The continent is endowed with a hugely diverse environment, ranging from desert to equatorial rainforest, as well as diverse cultures. Africa's various natural and cultural environments have played a part in shaping human activities, including agriculture, trade, and technology—which in turn have shaped the nature of the cities and states that have emerged across the continent. Technological innovations such as irrigation have allowed complex societies to develop and grow in an otherwise inhospitable desert climate with limited natural resources. Although the prevalence of animal diseases and all-year-round rainfall restricted surplus agricultural production by affecting the use of animals as a source of draft power and cultivation of cereal crops, advances in technology, including ironwork and adoption of the tropical rainforest crops, facilitated the transformation of the physical environment and emergence of cities and states in the rainforest. The course examines how the nature of early agriculture, the environment, and technology shaped the history of African societies to equip learners with a better understanding of the contemporary social and environmental challenges. It assesses the dynamism in the relation between African societies and the environment over time.",
    "prereq": []
  },
  {
    "uid": "825609",
    "code": "AFRO3015",
    "subject": "AFRO",
    "number": "3015",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Sovereignty in Africa",
    "fullname": "Food Sovereignty in Africa",
    "info": "Course Description ‘Food Sovereignty in Africa’ critically evaluates how the physical environment and historical processes  shaped agricultural productivity in Africa, as well as exploring the subsequent relationship the  continent has had with the rest of the world. The course uses multi-disciplinary resources to examine historical factors that have contributed to contemporary food security issues, and discusses  grassroots food movements that embrace the ethics and values of African societies in their efforts to  achieve both food security and environmental sustainability. It also examines the interplay between  food security, indigenous knowledge, and environmental sustainability by comparing various  standpoints on African food production, scrutinizing the challenges the continent is facing and the  unique perspectives it offers in terms of agricultural development in the globalized world. Finally, the  course examines how agricultural systems in Africa are affected by the new global land rush. After  taking the course, students will have better knowledge of emerging research directions on Africa and  will be equipped with sufficient research and practical skills to pursue independent studies beyond the  classroom.  ",
    "prereq": []
  },
  {
    "uid": "825968",
    "code": "AFRO3016",
    "subject": "AFRO",
    "number": "3016",
    "honors": false,
    "writingIntensive": false,
    "name": "African  Archaeology",
    "fullname": "Africa and African Diaspora Archaeology",
    "info": "Africa and African Diaspora Archaeology (AFRO/ ANTH 3016/5016) examines the evolution of human behavior in Africa and looks at subsequent social, cultural, and technological developments as shown in archaeological records including artifacts, ecofacts, rock art, and structures at archaeological sites. It also discusses methods used to identify archaeological records and how these records can be used to reconstruct past ways of life. Students will obtain hand-on-experience in identifying, classifying, and interpreting archaeological objects. The course covers Africa from around 2.6 million years ago to the recent past, focusing primarily on the last 10,000 years. It examines the development and spread of food production, pottery, metallurgy, trade, and African connections with the Atlantic world dating back to the fifteenth century. ",
    "prereq": []
  },
  {
    "uid": "002331",
    "code": "AFRO3061",
    "subject": "AFRO",
    "number": "3061",
    "honors": false,
    "writingIntensive": false,
    "name": "The Black Family",
    "fullname": "The Black Family",
    "info": "A sociological view of African American family life in the United States.",
    "prereq": []
  },
  {
    "uid": "002328",
    "code": "AFRO3072",
    "subject": "AFRO",
    "number": "3072",
    "honors": false,
    "writingIntensive": false,
    "name": "Racism",
    "fullname": "Racism: Social and Psychological Consequences for Black Americans",
    "info": "Racism and its effects on African Americans; definitions, determinants, and dynamics. Examined in an experiential context to reflect individual and institutional racism.",
    "prereq": []
  },
  {
    "uid": "792477",
    "code": "AFRO3075",
    "subject": "AFRO",
    "number": "3075",
    "honors": false,
    "writingIntensive": false,
    "name": "Welfare",
    "fullname": "Welfare",
    "info": "",
    "prereq": []
  },
  {
    "uid": "810074",
    "code": "AFRO3103",
    "subject": "AFRO",
    "number": "3103",
    "honors": false,
    "writingIntensive": false,
    "name": "World History and Africa",
    "fullname": "World History and Africa",
    "info": "This course is an interdisciplinary survey of the history of the African continent. It examines the social, cultural, economic and political transformations that shaped varied African communities from prehistory to the present. Focusing primarily on the intricate intersection of culture, society, economics, and politics, the course examines the concept of “world history” and Africa’s location in the production of this history as theoretical and analytical lenses. It puts particular emphasis on the social, cultural and political developments that informed individual and collective experiences of various African peoples and societies, including the historical narratives and scholarly discourses associated with them.",
    "prereq": []
  },
  {
    "uid": "002329",
    "code": "AFRO3108",
    "subject": "AFRO",
    "number": "3108",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Jazz",
    "fullname": "Black Music: A History of Jazz",
    "info": "The development of jazz in America and in the world, with special emphasis given to the roots or jazz in the African American experience.",
    "prereq": []
  },
  {
    "uid": "005062",
    "code": "AFRO3110",
    "subject": "AFRO",
    "number": "3110",
    "honors": false,
    "writingIntensive": false,
    "name": "African Lang Study",
    "fullname": "Study of an African Language",
    "info": "Introduction to a selected African language. Emphasizes oral communication skills and cultural context.",
    "prereq": []
  },
  {
    "uid": "793839",
    "code": "AFRO3112",
    "subject": "AFRO",
    "number": "3112",
    "honors": false,
    "writingIntensive": false,
    "name": "The Poetry of Rap",
    "fullname": "In the Heart of the Beat: the Poetry of Rap",
    "info": "Contemporary African American poetry as expressed by popular culture contributors. Students analyze/evaluate poems used in rap, in context of African American literature, American culture, and aesthetics.",
    "prereq": []
  },
  {
    "uid": "795342",
    "code": "AFRO3120",
    "subject": "AFRO",
    "number": "3120",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Mvts in African Diaspora",
    "fullname": "Social and Intellectual Movements in the African Diaspora",
    "info": "Political, cultural, historical linkages between Africans, African-Americans, African-Caribbean. Black socio-political movements/radical intellectual trends in late 19th/20th centuries. Colonialism/racism. Protest organizations, radical movements in United States/Europe.",
    "prereq": []
  },
  {
    "uid": "813997",
    "code": "AFRO3125W",
    "subject": "AFRO",
    "number": "3125",
    "honors": false,
    "writingIntensive": true,
    "name": "Black Visions of Liberation",
    "fullname": "Black Visions of Liberation: Ella, Martin, Malcolm, and the Radical Transformation of U.S. Democracy",
    "info": "Course on the critical thought of Black intellectual-activists and others enmeshed in the struggles for the radical transformation of U.S. democracy. Introduces the following three leaders and activists--Ella Baker, Martin Luther King, Jr., and Malcolm X--whose work in the building of the Black freedom movement spanned the period from the 1930s to the late 1960s. Course proposition is that their life and times in the struggle for liberation offer important insights into the transformation of the U.S. political economy from the welfare/warfare state to the neoliberal state. These intellectual-activists, as well as others who translate their radical traditions through Black-Brown and Afro-Asian solidarity projects (e.g. Grace Lee Boggs of Detroit) have responded to racial formation in the U.S. and presented not just visions of liberation but concrete alternatives at the grassroots to usher in a more just, egalitarian, and ethical society.",
    "prereq": []
  },
  {
    "uid": "799024",
    "code": "AFRO3131",
    "subject": "AFRO",
    "number": "3131",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Issues in Africa",
    "fullname": "Contemporary Issues in Africa",
    "info": "Departing from a country-specific focus and a comparative regional perspective, this course examines contemporary African challenges and varied struggles using case studies, and a range of analytical parameters. Of particular interest will be issues relating to peace and (in)security, ethnic/civil clashes, religious conflicts, authoritarianism, democracy and related impacts: political destabilization, social fragmentation, economic disruption; internal displacement and international migration within regional and global contexts, etc. Historical contexts (colonial legacies) and contemporary dynamics (contemporary realities) will be studied from a political and sociological perspective to establish course content and outcomes.",
    "prereq": []
  },
  {
    "uid": "788068",
    "code": "AFRO3141",
    "subject": "AFRO",
    "number": "3141",
    "honors": false,
    "writingIntensive": false,
    "name": "Africa",
    "fullname": "Africa",
    "info": "Regional differentiation of human groups and environments; cultural contact and problems of underdeveloped countries south of the Sahara.",
    "prereq": []
  },
  {
    "uid": "005191",
    "code": "AFRO3204",
    "subject": "AFRO",
    "number": "3204",
    "honors": false,
    "writingIntensive": false,
    "name": "South Africa to 1910",
    "fullname": "History of South Africa to 1910",
    "info": "Introductory survey of the history of South Africa from early humans to the arrival of the first Dutch settlers at the Cape of Good Hope in 1652 to the formation of the Union of South Africa in 1910.",
    "prereq": []
  },
  {
    "uid": "005342",
    "code": "AFRO3205",
    "subject": "AFRO",
    "number": "3205",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of South Africa from 1910",
    "fullname": "History of South Africa from 1910: Anti-Racism, Youth Politics, Pandemics & Gender (Based Violence)",
    "info": "We are all living in extraordinary times. But what does that mean? In South Africa, we have seen the COVID-19 pandemic and the measures implemented to control it causing massive social upheaval and personal distress. It has forced the people in the country to confront issues that life prior to the pandemic had made easy to turn away from. Misogyny, gender based violence, and sexual violence, a long-standing emergency in the south of Africa, have been forced into our vision once again. It was not the pandemic that created this violence. Nor was it the first time people had been outraged by a lack of action to address it. In the years approaching 2020, calls, protests and demonstrations were increasingly demanding the culture of impunity in gender based violence be ended; sometime with violent outcomes against the protestors themselves. Over those same years, nationwide protests have rocked South Africa's university campuses. The student movements known as #RhodesMustFall, #FeesMustFall and #RUReferenceList highlight the contrasts and disappointments of the recent past in South Africa, confront the legacy of racism and misogyny in its institutions and knowledge systems, and resonate with a history of anti-racism and struggle that now, in turn, similarly fuel the on-going Black Lives Matter and #MeToo movements worldwide.",
    "prereq": []
  },
  {
    "uid": "002339",
    "code": "AFRO3251W",
    "subject": "AFRO",
    "number": "3251",
    "honors": false,
    "writingIntensive": true,
    "name": "Race, Class & Gender",
    "fullname": "Sociological Perspectives on Race, Class, and Gender",
    "info": "Analytical overview of three major forms of inequalities in the United Sates today: race, class, gender. Focus on these inequalities as relatively autonomous from one another and as deeply connected/intertwined with one another. Intersectionality key to critical understanding of these social forces. Social change possibilities.",
    "prereq": []
  },
  {
    "uid": "002334",
    "code": "AFRO3301",
    "subject": "AFRO",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Black American Music",
    "fullname": "The Music of Black Americans",
    "info": "This course examines the variety of ways African and African Americans express social history through music. It will consider the union of African elements and European elements that combined to present a new syncretized African-American product. To do this it is imperative that we explore the diversity of musical “voices” found within the African American culture. This diversity can be seen in the struggles to retain African cultural effects and the desire to be eclectic, creative, and contemporary. Such an approach to the study of the place of Black music in American music corresponds with the criteria of Diversity and Social Justice in the United States Liberal Education. The “multi-layered operation of power, prestige, and privilege” can be understood through an examination of the music of African Americans, which represents both a Free African voice and an enslaved African voice; the western-trained Black performer/composer and the self-taught performer/composer. It also represents the habits of well-to-do African Americans and the poor African Americans. Students will examine the complexities of the history of African Americans and how this is played out in the development of musical styles and genres. From this, students will then begin to understand how this unique diversity within a community affects those outside of those communities. Such an approach to the study of the place of Black music in American music corresponds with the criteria of Diversity and Social Justice in the United States Liberal Education.We will follow elements found in West African culture and music such as \"call and response\" and the \"2nd Line\" as they travel to the \"New World\" and expressed through Spirituals, Symphonies, Gospel Music, Jazz, Rock and Roll, Step Bands and more. Through lectures, readings, discussion, audiovisual examples, and homework assignments student can expect to gain a deeper understanding of the ways music both reflects and influences the social history of all Americans.",
    "prereq": []
  },
  {
    "uid": "002335",
    "code": "AFRO3334",
    "subject": "AFRO",
    "number": "3334",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Women",
    "fullname": "Black Women: Interdisciplinary Perspectives",
    "info": "Interdisciplinary study of the experience of African American women, including economic, political, and social factors, psycho-sexual development, and family roles.",
    "prereq": []
  },
  {
    "uid": "820478",
    "code": "AFRO3341",
    "subject": "AFRO",
    "number": "3341",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Geographies",
    "fullname": "Black Geographies",
    "info": "This course will engage the sub-discipline of Black Geographies by looking at Geographical literature on the question of Blackness as well as case studies on the ways in which Afro-descendant populations make place. Course readings and films will attend to Blackness as it manifests across the African Diaspora, with specific focus on the Americas. We will discuss the experiences and struggles of enslaved Africans in the Americas, struggles against slavery, the ways in which we can understand histories of Blackness, and different forms of struggle employed by Afro-descendant populations today. At the end of the semester students will have a solid grounding in the literature around Black Geographies, as well as a nuanced understanding of the different ways in which Black populations analyze and create space.",
    "prereq": []
  },
  {
    "uid": "815503",
    "code": "AFRO3402",
    "subject": "AFRO",
    "number": "3402",
    "honors": false,
    "writingIntensive": false,
    "name": "Pleasure, Intimacy & Violence",
    "fullname": "Pleasure, Intimacy and Violence",
    "info": "Gender/sexual violence to poststructural, anti-racist theories and debates about social construction of sexuality. How intimacy and violence are co-constituted within normative frameworks of U.S. governmentality. Writings by black feminist criminologists who have linked incarceration, welfare reform, and other forms of state regulation to deeply systemic forms of violence against people of color.",
    "prereq": []
  },
  {
    "uid": "790942",
    "code": "AFRO3405",
    "subject": "AFRO",
    "number": "3405",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Child",
    "fullname": "The African American Child",
    "info": "Resesarch carried out by African American psychologists and behavioral/social scientists, and by experts on African American child/youth development.",
    "prereq": []
  },
  {
    "uid": "796768",
    "code": "AFRO3426",
    "subject": "AFRO",
    "number": "3426",
    "honors": false,
    "writingIntensive": false,
    "name": "Black.Soc.Pol.&Welfare State",
    "fullname": "African Americans, Social Policy, and the Welfare State",
    "info": "Period between New Deal (1930s) and present. History/impact of federal policy (presidential, congressional, judicial) and race on African Americans.  Politics of allocation of insurance versus relief in Social Security Act of 1935. Race and expansion of social benefits after World War II. School desegregation. Kennedy's civil rights policy, LBJ's War on Poverty. Affirmative Action. Warren court. Busing. Conservative retreat from welfare state under Ronald Reagan and George Bush.",
    "prereq": []
  },
  {
    "uid": "795345",
    "code": "AFRO3429",
    "subject": "AFRO",
    "number": "3429",
    "honors": false,
    "writingIntensive": false,
    "name": "Slavery in the Americas",
    "fullname": "Slavery in Africa and in the Americas, 1400 to 1880",
    "info": "History of slavery in Africa and the New World. Indigenous institutions of unfree labor in West Africa. Origins of European slave trade in West Africa and South Africa. Development of plantation societies in South America, the Caribbean, and the United States. Comparative approach to understanding New World slavery and slavery on the African subcontinent. Focuses on religion, creolization, and antislavery resistance.",
    "prereq": []
  },
  {
    "uid": "792078",
    "code": "AFRO3431",
    "subject": "AFRO",
    "number": "3431",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Africa & Its Global Conn",
    "fullname": "Early Africa and Its Global Connections",
    "info": "Survey of African history from earliest times to 1800. Focuses on socioeconomic, political, and cultural development in pre-colonial Africa from ancient Egypt through the era of the trans-Atlantic slave trade.",
    "prereq": []
  },
  {
    "uid": "792079",
    "code": "AFRO3432",
    "subject": "AFRO",
    "number": "3432",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Africa",
    "fullname": "Modern Africa in a Changing World",
    "info": "Socioeconomic, political, and cultural development in Africa, from abolition of trans-Atlantic slave trade through postcolonial era.",
    "prereq": []
  },
  {
    "uid": "804826",
    "code": "AFRO3433",
    "subject": "AFRO",
    "number": "3433",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ Dvlpmn in Contemp Africa",
    "fullname": "Economic Development in Contemporary Africa",
    "info": "Major socio-economic challenges that confront post-independence sub-Saharan African countries in quest for sustainable economic development/growth. Causes of persistent poverty/inequality, role of institutions/multinational agencies. Growth in 21st century.prereq: APEC 1101 or ECON 1101",
    "prereq": {
      "or": [
        {
          "code": "APEC 1101",
          "subject": "APEC",
          "id": "1101"
        },
        {
          "code": "ECON 1101",
          "subject": "ECON",
          "id": "1101"
        }
      ]
    }
  },
  {
    "uid": "826887",
    "code": "AFRO3434",
    "subject": "AFRO",
    "number": "3434",
    "honors": false,
    "writingIntensive": false,
    "name": "Images of Africa",
    "fullname": "Images of Africa",
    "info": "Major themes in African history, from early human development to present.  History of western \"knowledge\" about Africa. Assumptions that have influenced production of African history. Extent to which African history is \"packaged\" for public consumption inside/outside Africa. How history is used to support modern political agendas.",
    "prereq": []
  },
  {
    "uid": "817739",
    "code": "AFRO3435",
    "subject": "AFRO",
    "number": "3435",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Dynam Horn of Africa",
    "fullname": "Political Dynamics in the Horn of Africa",
    "info": "Who wields political power? Who challenges those in power? And how do they legitimize their claims and go about enforcing them? These are the core questions that will guide our exploration of the political dynamics in the Horn of Africa. Just like most regions in Africa, the Horn is home to diverse cultures and languages. What distinguishes it, however, is the contested nature of state borders, which have been redrawn in ways not observed anywhere else in Africa since the end of European colonialism. The purpose of this class is to delve deeper into these conflicts, to examine the interactions between incumbent governments, armed rebel groups and international actors in shaping war and peace in the Horn. Throughout this journey, we will pay special attention to ideas of sovereignty, identity and violence and draw on literature outside of the Horn to help us better dissect what is going on within it. ",
    "prereq": []
  },
  {
    "uid": "797788",
    "code": "AFRO3436",
    "subject": "AFRO",
    "number": "3436",
    "honors": false,
    "writingIntensive": false,
    "name": "Fighting for African History",
    "fullname": "Fighting for History:Historical Roots of Contemporary Crises in Africa",
    "info": "Open any newspaper and there is almost certain to be one or more articles about crises or chaos in Africa. Journalistic accounts highlight famines, tribalism, failed states, ethnic cleansing, the plight of refugees, and the AIDS pandemic.  There rarely, if ever, is a serious discussion of the underlying causes of this instability.  Instead, it is implicitly assumed that this is the natural order of events in the Dark Continent.  This course challenges the racially inspired cultural arrogance which underlies assumptions about Africa and explores it with the long-term structural and historical roots of the crises which confront many parts of Africa.  It is a course about Africans and how they responded to the challenges and legacies that date back to the colonial period and before.  Throughout this course we will be concerned with African initiatives in a rapidly changing political, economic, social, and ideological context and the changing ways that the Global North has represented Africa. In doing so we will be fight for a more accurate history of Africa.",
    "prereq": []
  },
  {
    "uid": "795300",
    "code": "AFRO3437",
    "subject": "AFRO",
    "number": "3437",
    "honors": false,
    "writingIntensive": false,
    "name": "History of East Africa",
    "fullname": "History of East Africa",
    "info": "Major themes in history of East Africa, from era of early human cultural development to present. Methods that historians use to reconstruct history. Varying interpretations/constructions of history over time. ",
    "prereq": []
  },
  {
    "uid": "797321",
    "code": "AFRO3439",
    "subject": "AFRO",
    "number": "3439",
    "honors": false,
    "writingIntensive": false,
    "name": "Narratives of African Past",
    "fullname": "Popular Narratives of the African Past",
    "info": "Diverse ways that ordinary Africans have interpreted/portrayed particular events in African history. Popular depictions of African past, their relationships with academic histories.",
    "prereq": []
  },
  {
    "uid": "793848",
    "code": "AFRO3478W",
    "subject": "AFRO",
    "number": "3478",
    "honors": false,
    "writingIntensive": true,
    "name": "Contemporary African Politics",
    "fullname": "Contemporary Politics in Africa and the Colonial Legacy",
    "info": "At the core, this class is about the interaction between the assertion of and challenge to political authority in Africa. Who should have the right to make decisions that structure people's lives? To what extent is \"might\" an important source of political authority? How, in turn, do people respond to these different means of establishing political authority? Using these questions as a springboard, this class will examine some broader themes relating to colonialism, state building, conflict and development in Africa. Politics in Africa, just as in any other place in the world, is complex and for that reason, the objective of the class is not to give you answers, but to have you think critically about the issues we cover. Towards this end, this class will draw on different sources ranging from novels to manifestos so as to illustrate both the mundane and extraordinary events that have helped shape the political landscape of the continent.",
    "prereq": []
  },
  {
    "uid": "007029",
    "code": "AFRO3543",
    "subject": "AFRO",
    "number": "3543",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Psychology",
    "fullname": "Psychology and the Black American Experience",
    "info": "Historical and contemporary perspectives of the relationship between the area of psychology and African Africans in research and practice.",
    "prereq": []
  },
  {
    "uid": "789797",
    "code": "AFRO3578",
    "subject": "AFRO",
    "number": "3578",
    "honors": false,
    "writingIntensive": false,
    "name": "Arts of Africa",
    "fullname": "Contemporary Sub-Saharan African Popular Art Forms",
    "info": "This course explores popular art practices and representations – mediated through the lens of television, radio, popular cinema, sequential art, and the internet – as the everyday expressions of modern African identities. As sites where the tensions, frictions, collisions and notably, the productive creativities of the local and the global are circulated, negotiated and contested, African popular cultures provide insights into a unique and increasingly crucial facet of contemporary African artistic practice as critical intervention. The course is designed on the premise that Africans of all social strata and lifestyles are strategic and deliberate consumers of popular cultural forms, generated within local cultures as signifiers of larger social, political, and economic processes. In light of prevailing studies which sometimes end up naively celebrating agency and resistance, AFRO 3578 underscores the role of popular cultures as public/private sites of power's ideological and material (re-) production, contestation, or transformation. It considers creative practices as sites of both resistance and accommodation; of creative adaptation, innovation, and resilience. Through our discussion of communication technologies and their role in transmitting artistic and political ideas beyond the confines of dominant discourses and established institutions, we will evaluate the interface of technology and sociocultural shifts.",
    "prereq": []
  },
  {
    "uid": "795190",
    "code": "AFRO3585",
    "subject": "AFRO",
    "number": "3585",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Art",
    "fullname": "African American Art",
    "info": "Four hundred year history of African American art. How/why African Americans created artwork at specific times, in specific places. Arts of African Americans within their own communities, National arts movements, and American life during historical junctures.",
    "prereq": []
  },
  {
    "uid": "002336",
    "code": "AFRO3591W",
    "subject": "AFRO",
    "number": "3591",
    "honors": false,
    "writingIntensive": true,
    "name": "African American Lit",
    "fullname": "Introduction to African American Literature",
    "info": "African American autobiography, fiction, essay, poetry, drama, and folklore from late-18th century to present.",
    "prereq": []
  },
  {
    "uid": "005067",
    "code": "AFRO3592W",
    "subject": "AFRO",
    "number": "3592",
    "honors": false,
    "writingIntensive": true,
    "name": "Black Women Writers in the U.S",
    "fullname": "Introduction to Black Women Writers in the United States",
    "info": "The literature of African American women writers explored in novels, short stories, essays, poetry, autobiographies, and drama from the 18th to the late-20th century.",
    "prereq": []
  },
  {
    "uid": "810073",
    "code": "AFRO3593",
    "subject": "AFRO",
    "number": "3593",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Novel",
    "fullname": "The African American Novel",
    "info": "Explore African American novelistic traditions. Plot patterns, character types, settings, symbols, themes, mythologies. Creative perspectives of authors themselves. Analytical frameworks from contemporary literary scholarship.",
    "prereq": []
  },
  {
    "uid": "793844",
    "code": "AFRO3594W",
    "subject": "AFRO",
    "number": "3594",
    "honors": false,
    "writingIntensive": true,
    "name": "Contemporary Black Writers",
    "fullname": "Introduction to Contemporary Black Writers",
    "info": "Major contemporary Black fiction writers such as Gayle Jones, Ernest Gaines, Charles Johnson, Toni Morrison, Gloria Naylor, and John Edgar Wideman, among others, whose works span 1970-90s.",
    "prereq": []
  },
  {
    "uid": "798904",
    "code": "AFRO3597W",
    "subject": "AFRO",
    "number": "3597",
    "honors": false,
    "writingIntensive": true,
    "name": "African American Literature I",
    "fullname": "Introduction to African American Literature and Culture I",
    "info": "African American oral tradition, slave narrative, autobiography, poetry, essay, fiction, oratory, and drama, from colonial era through Harlem Renaissance.",
    "prereq": []
  },
  {
    "uid": "789798",
    "code": "AFRO3598W",
    "subject": "AFRO",
    "number": "3598",
    "honors": false,
    "writingIntensive": true,
    "name": "African American Literature II",
    "fullname": "Introduction to African American Literature and Culture II",
    "info": "African American oral tradition, autobiography, poetry, essay, fiction, oratory, drama. From after Harlem Renaissance to end of 20th century.",
    "prereq": []
  },
  {
    "uid": "002271",
    "code": "AFRO3601W",
    "subject": "AFRO",
    "number": "3601",
    "honors": false,
    "writingIntensive": true,
    "name": "African Literature",
    "fullname": "African Literature",
    "info": "The globalized present has witnessed increased mobility as economic, political, and social unrest intensify, forcing mass migration of populations across scorching deserts, treacherous mountains and perilous seas. In the United States and in Western Europe specifically, the consequence of this mobility—immigration—remains the single most cross-cutting issue and the most vexed political challenge of the day. Defined as threatening and intrusive, frequently criminalized in discourse and in action, immigrants have become scapegoats for a wide range of problems that bedevil every aspect of life in every country. Blamed for everything from taking jobs from locals to rising crime and the spread of communicable diseases, immigrants have become victims of xenophobic violence and repositories for the routine fear-mongering prevalent in post-9/11 global terror and counter-terror climate. This course addresses the keys issues that arise in contemporary immigration and global security debates. Throughout the course of the semester, we will interrogate the literary and audio-visual arts as a mirror of the times, reflecting socio-political conditions. In a bid to place the current “crisis” in a historical perspective, we will examine select works by African writers, filmmakers and artists, which provide examples that enable us to move beyond stereotypes and common assumptions.",
    "prereq": []
  },
  {
    "uid": "013704",
    "code": "AFRO3625W",
    "subject": "AFRO",
    "number": "3625",
    "honors": false,
    "writingIntensive": true,
    "name": "Women Writers Afr/Afr Diaspora",
    "fullname": "Women Writers of Africa and the African Diaspora",
    "info": "Works of black women writers from Europe, Africa, South America, and the Caribbean. Novels, drama, films, and essays.",
    "prereq": []
  },
  {
    "uid": "793840",
    "code": "AFRO3626",
    "subject": "AFRO",
    "number": "3626",
    "honors": false,
    "writingIntensive": false,
    "name": "Literature of Afr American Men",
    "fullname": "Literature of African American Men: Sex, Family, and Relationships",
    "info": "African American male fiction writers' approach to subject of family and relationships. Social, economic, and psychological consequences of racism/oppression, and effect on African American men writing about themselves within context of family/relationships. Manhood/masculinity as interpreted/articulated in fiction.",
    "prereq": []
  },
  {
    "uid": "002353",
    "code": "AFRO3627",
    "subject": "AFRO",
    "number": "3627",
    "honors": false,
    "writingIntensive": false,
    "name": "Harlem Renaissance",
    "fullname": "Seminar: Harlem Renaissance",
    "info": "Review Harlem Renaissance from variety of perspectives. Literary, historical, cultural, political, international. Explore complex patterns of permeation/interdependency between worlds inside/outside of what W.E.B. Du Bois called \"Veil of Color.\"",
    "prereq": []
  },
  {
    "uid": "793846",
    "code": "AFRO3628",
    "subject": "AFRO",
    "number": "3628",
    "honors": false,
    "writingIntensive": false,
    "name": "Literature of Rebellion",
    "fullname": "Literature of Rebellion: the Amistad and other Revolts",
    "info": "Amistad affair and other slave revolts in fictional/non-fictional texts. Nature of race/oppression. Historical representation of these specific incidents as settled in American conciousness. Responsibilities/challenges presented to authors in terms of accuracy, commercial viability, and literary quality. Introduction to issues concerning African American slavery.",
    "prereq": []
  },
  {
    "uid": "791911",
    "code": "AFRO3634",
    "subject": "AFRO",
    "number": "3634",
    "honors": false,
    "writingIntensive": false,
    "name": "Blues & Rhythm and Blues",
    "fullname": "Blues & Rhythm and Blues",
    "info": "Black American culture as expessed by blues and by rhythm and blues. Evolution of blues from work songs and field hollars of slavery/emancipation through postwar blues sounds of Louis Jordan, through expressions of pre-rock-n-roll rhythm and blues, and to more current expressions of performers like Brian McKnight.",
    "prereq": []
  },
  {
    "uid": "002272",
    "code": "AFRO3654",
    "subject": "AFRO",
    "number": "3654",
    "honors": false,
    "writingIntensive": false,
    "name": "African Cinema",
    "fullname": "African Cinema",
    "info": "This course introduces you to films written and directed by African filmmakers beginning the 2nd part of the 20th Century. Through an exploration of the stylistic and thematic issues raised by each film, it is expected that students will gain a broad understanding of how African filmmakers portray African social and cultural life, including the artistic and political contexts within which they work. In this way, students will gain an historical perspective on the origins of African filmmaking, confront the basic social, cultural and aesthetic questions raised by African filmmakers and critics, and consider how questions raised by African filmmakers and their films fit into the larger context of world cinema. We will contrast postcolonial African films with Hollywood jungle epics, settler/adventure romances in safari paradise, and colonial movies about Africa. Moving beyond strict categories and standards we will also examine the role of documentary films in shaping our understanding of African people's lives and the social construction of reality. We will review the place of documentary film in the current media-scape and discuss its functions and limitations. Most films will be screened in original languages with English subtitles.",
    "prereq": []
  },
  {
    "uid": "802956",
    "code": "AFRO3655",
    "subject": "AFRO",
    "number": "3655",
    "honors": false,
    "writingIntensive": false,
    "name": "African-American Cinema",
    "fullname": "African-American Cinema",
    "info": "African American cinematic achievements from silent films of Oscar Micheaux through contemporary Hollywood and independent films. Class screenings, critical readings.",
    "prereq": []
  },
  {
    "uid": "794175",
    "code": "AFRO3741",
    "subject": "AFRO",
    "number": "3741",
    "honors": false,
    "writingIntensive": false,
    "name": "People of Color and the Media",
    "fullname": "People of Color and the Mass Media",
    "info": "Past and present depictions of minority individuals and groups in movies, literature, radio/TV, etc., as seen against anthropological, psychological, and sociological knowledge and experience.  Emphasis on personal and political effects of media depictions.",
    "prereq": []
  },
  {
    "uid": "817740",
    "code": "AFRO3745",
    "subject": "AFRO",
    "number": "3745",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Cultural Studies",
    "fullname": "Black Cultural Studies",
    "info": "What is black life? And what does it mean to talk about black life in the context of the push toward the liberation of black lives? In recent years we have become accustomed to hearing about and debating the efficacy of the term and movement \"Black Lives Matter,\" but what, other than precarity, constitutes these lives that matter? How have black people collectively thrived even under conditions that would assume otherwise? In this course we will consider the myriad ways black people have gone about creating, dreaming, struggling, building, educating, loving, and living, even in the midst of all that works to bring death near. We will explore a range of cultural forms, including stand-up comedy, hip hop and R&B music, reality television, social media, and film, in order to contemplate the urgency and necessity of black social life, or, what it means to be with and for black people.",
    "prereq": []
  },
  {
    "uid": "791912",
    "code": "AFRO3756",
    "subject": "AFRO",
    "number": "3756",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Blacks in Sports",
    "fullname": "Social and Cultural History of Blacks in Sports",
    "info": "Social/cultural contexts surrounding eras of athletes such as Jack Johnson, Jackie Robinson, Joe Louis, Jesse Owens, Althea Gibson, Wilma Rudolph, Muhammad Ali, Michael Jordan, and Tiger Woods. Impact of these athletes on national/international events. Periods when it was not uncommon for black entertainers/athletes to become involved in politics and community activism.",
    "prereq": []
  },
  {
    "uid": "002337",
    "code": "AFRO3864",
    "subject": "AFRO",
    "number": "3864",
    "honors": false,
    "writingIntensive": false,
    "name": "Afro-Am History: 1619 to 1865",
    "fullname": "African American History: 1619 to 1865",
    "info": "Importance of dynamics of class, gender, region, and political ideology. Changing nature of race/racism.",
    "prereq": []
  },
  {
    "uid": "002338",
    "code": "AFRO3865",
    "subject": "AFRO",
    "number": "3865",
    "honors": false,
    "writingIntensive": false,
    "name": "African Am Hist 1865 - Present",
    "fullname": "African American History: 1865 to the Present",
    "info": "History of African American men and women from the beginning of the 20th century to the present. Discussion of internal migrations, industrialization and unionization, The Great Depression, world wars, and large scale movements for social and political change.",
    "prereq": []
  },
  {
    "uid": "793847",
    "code": "AFRO3866",
    "subject": "AFRO",
    "number": "3866",
    "honors": false,
    "writingIntensive": false,
    "name": "Civil Rights & Black Power Mvt",
    "fullname": "The Civil Rights and Black Power Movement, 1954-1984",
    "info": "Modern black civil rights struggle in the U.S., i.e., the second reconstruction. Failure of reconstruction, abdication of black civil rights in 19th century. Assault on white supremacy via courts, state, and grass roots southern movement in 1950s and 1960s. Black struggle in north and west. New emphasis on Black Power, by new organizations. Ascendancy of Ronald Reagan, conservative assault on the movement.",
    "prereq": []
  },
  {
    "uid": "817741",
    "code": "AFRO3867",
    "subject": "AFRO",
    "number": "3867",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Men: Representations",
    "fullname": "Black Men: Representations and Reality",
    "info": "This course will explore the lived reality of black men in the United States. Ranging historically-far and thematically-wide, this course will introduce students to the experience of black male labor force participation and employment outcomes; deconstruct representations of black masculinity in popular culture; explore academic dilemmas associated with primary and secondary educational pursuits; and uncover issues connected with law, incarceration, and criminal justice. In addition, this course will examine relationship complexities involving black men and black women, black men and white women, and black men and black men, looking closely at the African-American role in traditional and non-traditional family structures. The course will also address the most central of questions: What is the black male experience, given the growing diversity of black maleness in Minnesota, the United States, and the Diaspora. At the center of the course is not only what other people have said about the black male historical and contemporary experience, but also how black men have imagined and constructed their own experience over time.",
    "prereq": []
  },
  {
    "uid": "797789",
    "code": "AFRO3868W",
    "subject": "AFRO",
    "number": "3868",
    "honors": false,
    "writingIntensive": true,
    "name": "Race and War in America",
    "fullname": "Race, War, and Race Wars in American History",
    "info": "Role that race has played in American war history. Impact that wars have had on race and race relations in the United States and the world. Literature and film.",
    "prereq": []
  },
  {
    "uid": "818521",
    "code": "AFRO3896",
    "subject": "AFRO",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor. A student may only earn credit for a given internship through one course at a time.",
    "prereq": []
  },
  {
    "uid": "002342",
    "code": "AFRO3910",
    "subject": "AFRO",
    "number": "3910",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Afro Amer & African St",
    "fullname": "Topics in African American and African Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "800679",
    "code": "AFRO3920",
    "subject": "AFRO",
    "number": "3920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in African Studies",
    "fullname": "Topics in African Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "002345",
    "code": "AFRO3991",
    "subject": "AFRO",
    "number": "3991",
    "honors": false,
    "writingIntensive": false,
    "name": "Senior Thesis Prep",
    "fullname": "Senior Thesis Preparation in Afro-American and African Studies",
    "info": "Senior thesis/project. Development of bibliography and thesis statement.",
    "prereq": []
  },
  {
    "uid": "002343",
    "code": "AFRO3993",
    "subject": "AFRO",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual research and study.Prereq-instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "005344",
    "code": "AFRO4001",
    "subject": "AFRO",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Women in S. Africa",
    "fullname": "Seminar: History of Women in South Africa",
    "info": "The changing role and status of women in South Africa from precolonial era to the present, and relationships to political, social, and economic development.",
    "prereq": []
  },
  {
    "uid": "801652",
    "code": "AFRO4105",
    "subject": "AFRO",
    "number": "4105",
    "honors": false,
    "writingIntensive": false,
    "name": "Ways of Knowing: Black Worlds",
    "fullname": "Ways of Knowing in Africa and the African Diaspora",
    "info": "Impact of European knowledge systems on African world. How peoples on African continent and across African diaspora have produced/defined knowledge. Continuity/change in the way African peoples have thought about and left their epistemological imprints upon the world.",
    "prereq": []
  },
  {
    "uid": "800720",
    "code": "AFRO4112",
    "subject": "AFRO",
    "number": "4112",
    "honors": false,
    "writingIntensive": false,
    "name": "The Beat Goes On",
    "fullname": "The Beat Goes on: Advanced Studies in the Poetry of Rap",
    "info": "Continues/deepens work began in 3112. Aesthetics of rap/poetry.  Close readings of rap/poems. Texts/theories employed in development of hip hop aesthetic.prereq: 3112",
    "prereq": {
      "code": "AFRO 3112",
      "subject": "AFRO",
      "id": "3112"
    }
  },
  {
    "uid": "010339",
    "code": "AFRO4231",
    "subject": "AFRO",
    "number": "4231",
    "honors": false,
    "writingIntensive": false,
    "name": "Color of Public Policy in US",
    "fullname": "Color of Public Policy: African Americans, American Indians, Asian Americans & Chicanos in the U.S.",
    "info": "Examination of structural or institutional conditions through which people of color have been marginalized in public policy. Critical evaluation of social theory in addressing the problem of contemporary communities of color in the United States.",
    "prereq": []
  },
  {
    "uid": "002347",
    "code": "AFRO4301",
    "subject": "AFRO",
    "number": "4301",
    "honors": false,
    "writingIntensive": false,
    "name": "African Novel",
    "fullname": "The African Immigrant Story",
    "info": "This course traces the origin of the African novel as a storytelling form to the angst of displacement and the paradox of exilic experience. Beginning with an introduction to the novel as a literary genre, the course will place particular emphasis on digital literature as a literary subgenre that transcends the boundaries of the print, as well as examine the ways in which interactive virtual narratives and digital storytelling challenge the very basic premise on which the novel is built. How have interactive virtual fictions and creative non-fictions changed the process of writing and the definition of \"legitimate\" literature, of which the novel is a characteristic product? How do interactive fictions help to raise fundamental questions about what literature is, as well as shed light on classical literary techniques and strategies such as narrative perspectives, questions of genre, reader-response and intertextuality? How does digital storytelling as a vector of the global imaginary serve as an especially appropriate tool for coping with the pangs of being uprooted from familiar ground? We will examine the ways in which individuals endeavor to articulate their identity and sense of belonging in unhomely and occasionally untimely situations. How do transnational online communities help mitigate experiences of exclusion, as well as shape individuals’ perspectives on citizenship and social membership?",
    "prereq": []
  },
  {
    "uid": "817335",
    "code": "AFRO4335",
    "subject": "AFRO",
    "number": "4335",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Politics",
    "fullname": "African American Politics",
    "info": "This course examines the historical and contemporary efforts by African Americans to gain full inclusion as citizens in the U.S. political system.  Specifically, the course explores advocacy efforts by civil rights organizations and political parties to obtain and enforce civil and political rights for blacks.  An examination of these efforts begins in the Reconstruction Era and concludes with the historic election of the nation’s first African American president.  The course will cover topics such as the politics of the civil rights movement, black presidential bids and racialized voting in federal and state elections.  Finally, the course examines how political parties and organized interests used the Voting Rights Act to increase the number of minorities in Congress.  The course focuses on whether the growing number of minorities in Congress increases citizens’ trust in government and their involvement in voting and participation in political organizations.",
    "prereq": []
  },
  {
    "uid": "002349",
    "code": "AFRO4352",
    "subject": "AFRO",
    "number": "4352",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Families in the Diaspora",
    "fullname": "Black Families in the Diaspora: Comparative Perspectives",
    "info": "Cross-cultural perspectives of family formation, social structure, and gender patterns of families of African descent.",
    "prereq": []
  },
  {
    "uid": "809429",
    "code": "AFRO4406",
    "subject": "AFRO",
    "number": "4406",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Feminist Thought",
    "fullname": "Black Feminist Thought",
    "info": "Critically examine spatiality of African descendant women in Americas/larger black diaspora. Writings from black feminist/queer geographies, history, contemporary cultural criticism. Recent black feminist theorizing.",
    "prereq": []
  },
  {
    "uid": "010338",
    "code": "AFRO4432",
    "subject": "AFRO",
    "number": "4432",
    "honors": false,
    "writingIntensive": false,
    "name": "Before the Field",
    "fullname": "Colloquium: Before the Field: Internships, Community Service, and Study Abroad",
    "info": "Theoretical and practical preparation for internships, community work, and study abroad.",
    "prereq": []
  },
  {
    "uid": "804833",
    "code": "AFRO4557",
    "subject": "AFRO",
    "number": "4557",
    "honors": false,
    "writingIntensive": false,
    "name": "History of the Field",
    "fullname": "History of the Field: Development of African American, African, and African Diasporic Studies",
    "info": "How Black studies evolved to become Africana studies in the 1960s and an academic field at major universities. How Africana Studies became a discipline that encompassed Africa and Africans in the Diaspora (African American Studies). Challenges of an interdisciplinary field.",
    "prereq": []
  },
  {
    "uid": "002354",
    "code": "AFRO4598",
    "subject": "AFRO",
    "number": "4598",
    "honors": false,
    "writingIntensive": false,
    "name": "BlkArts Renaissance",
    "fullname": "Seminar: Black Arts Renaissance, 1960s and 1970s",
    "info": "Multidisciplinary perspectives on the 1960s and 1970s Black Power \"renaissance\" of African American art and politics.",
    "prereq": []
  },
  {
    "uid": "013697",
    "code": "AFRO4622",
    "subject": "AFRO",
    "number": "4622",
    "honors": false,
    "writingIntensive": false,
    "name": "Caribbean Writers",
    "fullname": "Caribbean Writers: Rethinking Caribbean Literature in a World Context",
    "info": "Literary/historical issues explored by Caribbean writers in English, French, and Spanish-speaking Caribbean through autobiographies, short stories, novels, poetry, and films.  ",
    "prereq": []
  },
  {
    "uid": "013703",
    "code": "AFRO4632",
    "subject": "AFRO",
    "number": "4632",
    "honors": false,
    "writingIntensive": false,
    "name": "Francophone Writers",
    "fullname": "Black Francophone Writers in Translation",
    "info": "Exploration of ideas, particularly negritude and issues of creoleness,  central to male and female writers in French from Africa and the Caribbean.  Novels, essays, short stories, and plays.  ",
    "prereq": []
  },
  {
    "uid": "009527",
    "code": "AFRO4655",
    "subject": "AFRO",
    "number": "4655",
    "honors": false,
    "writingIntensive": false,
    "name": "AfricaAm Cinema",
    "fullname": "African American Cinema",
    "info": "Exploration of African American cinematic achievements, from the silent films of Oscar Micheaux through contemporary Hollywood and independent films, using class screenings and critical readings.",
    "prereq": []
  },
  {
    "uid": "005058",
    "code": "AFRO4800",
    "subject": "AFRO",
    "number": "4800",
    "honors": false,
    "writingIntensive": false,
    "name": "African Seminar",
    "fullname": "African Studies Seminar",
    "info": "Topics vary and reflect instructor's research interests. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "802928",
    "code": "AFRO4910",
    "subject": "AFRO",
    "number": "4910",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Afro Amer & African St",
    "fullname": "Topics in African American and African Studies",
    "info": "Topics specified in Class Schedule.  ",
    "prereq": []
  },
  {
    "uid": "005059",
    "code": "AFRO4991W",
    "subject": "AFRO",
    "number": "4991",
    "honors": false,
    "writingIntensive": true,
    "name": "Research Seminar",
    "fullname": "Thesis Research and Writing",
    "info": "Preparing a research paper that satisfies major project requirement. Defining a research problem. Collecting/analyzing data. Writing the research paper.prereq: dept consent",
    "prereq": []
  },
  {
    "uid": "002344",
    "code": "AFRO4992",
    "subject": "AFRO",
    "number": "4992",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis",
    "fullname": "Thesis",
    "info": "Work with thesis adviser to complete final copy of senior project.",
    "prereq": []
  },
  {
    "uid": "792476",
    "code": "AFRO5001",
    "subject": "AFRO",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Min.View Law",
    "fullname": "Min.View Law",
    "info": "",
    "prereq": []
  },
  {
    "uid": "825696",
    "code": "AFRO5015",
    "subject": "AFRO",
    "number": "5015",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Sovereignty in Africa",
    "fullname": "Food Sovereignty in Africa",
    "info": "Food Sovereignty in Africa critically evaluates how the physical environment and historical processes shaped agricultural productivity in Africa, as well as exploring the subsequent relationship the continent has had with the rest of the world. The course uses multi-disciplinary resources to examine historical factors that have contributed to contemporary food security issues, and discusses grassroots food movements that embrace the ethics and values of African societies in their efforts to  achieve both food security and environmental sustainability. It also examines the interplay between food security, indigenous knowledge, and environmental sustainability by comparing various standpoints on African food production, scrutinizing the challenges the continent is facing and the unique perspectives it offers in terms of agricultural development in the globalized world. Finally, the course examines how agricultural systems in Africa are affected by the new global land rush. After taking the course, students will have better knowledge of emerging research directions on Africa and will be equipped with sufficient research and practical skills to pursue independent studies beyond the classroom.  ",
    "prereq": []
  },
  {
    "uid": "826041",
    "code": "AFRO5016",
    "subject": "AFRO",
    "number": "5016",
    "honors": false,
    "writingIntensive": false,
    "name": "African Archaeology",
    "fullname": "Africa and African Diaspora Archaeology",
    "info": "Africa and African Diaspora Archaeology (AFRO/ ANTH 3016/5016) examines the evolution of human behavior in Africa and looks at subsequent social, cultural, and technological developments as shown in archaeological records including artifacts, ecofacts, rock art, and structures at archaeological sites. It also discusses methods used to identify archaeological records and how these records can be used to reconstruct past ways of life. Students will obtain hand-on-experience in identifying, classifying, and interpreting archaeological objects. The course covers Africa from around 2.6 million years ago to the recent past, focusing primarily on the last 10,000 years. It examines the development and spread of food production, pottery, metallurgy, trade, and African connections with the Atlantic world dating back to the fifteenth century. ",
    "prereq": []
  },
  {
    "uid": "013599",
    "code": "AFRO5072",
    "subject": "AFRO",
    "number": "5072",
    "honors": false,
    "writingIntensive": false,
    "name": "Racism",
    "fullname": "Racism: Social and Psychological Consequences for Black Americans",
    "info": "Racism and its effects on African Americans; definitions, determinants, and dynamics. Examined in an experiential context to reflect individual and institutional racism.",
    "prereq": []
  },
  {
    "uid": "005352",
    "code": "AFRO5101",
    "subject": "AFRO",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "African Diaspora",
    "fullname": "Seminar: Introduction to Africa and the African Diaspora",
    "info": "Comparative frameworks, related theories, and pivotal texts in study of Africa and African Diaspora.",
    "prereq": []
  },
  {
    "uid": "795969",
    "code": "AFRO5103",
    "subject": "AFRO",
    "number": "5103",
    "honors": false,
    "writingIntensive": false,
    "name": "World History and Africa",
    "fullname": "World History and Africa",
    "info": "Contributions of African American thinkers to making of African history/strategies to rework theoretical/analytical foundations of world history. Writings/intellectual networks of major thinkers whose historical/ethnographic works on Africa spanning nineteenth to twentieth century.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "795343",
    "code": "AFRO5120",
    "subject": "AFRO",
    "number": "5120",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Mvts in African Diaspora",
    "fullname": "Social and Intellectual Movements in the African Diaspora",
    "info": "Political, cultural, historical linkages between Africans, African-Americans, African-Caribbean. Black socio-political movements/radical intellectual trends in late 19th/20th centuries. Colonialism/racism. Protest organizations, radical movements in United States/Europe.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "797050",
    "code": "AFRO5143",
    "subject": "AFRO",
    "number": "5143",
    "honors": false,
    "writingIntensive": false,
    "name": "West Africa",
    "fullname": "Geography of West Africa",
    "info": "West Africa from Senegal to Cameroon. Social geography of resource use, population, settlement, economic development, and international relations.",
    "prereq": []
  },
  {
    "uid": "798454",
    "code": "AFRO5145",
    "subject": "AFRO",
    "number": "5145",
    "honors": false,
    "writingIntensive": false,
    "name": "Dev in Africa",
    "fullname": "Development in Africa",
    "info": "Economic, political, and social development in Africa from independence to the present, emphasizing the reordering of colonial landscapes, bases for North-South relations, big power interventions, and participation in the world economy.",
    "prereq": []
  },
  {
    "uid": "797081",
    "code": "AFRO5181W",
    "subject": "AFRO",
    "number": "5181",
    "honors": false,
    "writingIntensive": true,
    "name": "Blacks in American Theatre",
    "fullname": "Blacks in American Theatre",
    "info": "Historical survey of significant events in the development of American Black theatrical tradition; essays, plays, playwrights, and theatres from early colonial references to Black Arts Movement.",
    "prereq": []
  },
  {
    "uid": "797191",
    "code": "AFRO5182W",
    "subject": "AFRO",
    "number": "5182",
    "honors": false,
    "writingIntensive": true,
    "name": "Contemp Black Drama",
    "fullname": "Contemporary Black Drama and Dramaturgies",
    "info": "This course is an exploration of the impact and evolution of Black Theatre in America, covering the period rising from the Black Arts Movement to the present. The exploration will entail an understanding of cultural and socio-political issues as they are reflected in key and significant plays written and produced from the late 1950's to the present. The plays and essays will be read against the background of significant cultural, social and literary movements - the Civil Rights Movement, Cold War politics, the Women's Movement, Gay Liberation, the Culture Wars, post-modernism, deconstruction, multiculturalism, afro-futurism, etc. as well as the evolution of identity nomenclature and racial classification from Colored to Negro to Black to African American. In addition to play analysis and criticism, students will garner a knowledge of significant Black cultural institutions and their impact on the ever-changing American theatre landscape.",
    "prereq": []
  },
  {
    "uid": "005345",
    "code": "AFRO5191",
    "subject": "AFRO",
    "number": "5191",
    "honors": false,
    "writingIntensive": false,
    "name": "AfAm and S. Africa",
    "fullname": "Seminar: The African American Experience in South Africa",
    "info": "Ideological, political, religious, and cultural ties that have informed African American and black South African relations from late 18th century to present.",
    "prereq": []
  },
  {
    "uid": "002350",
    "code": "AFRO5401",
    "subject": "AFRO",
    "number": "5401",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Studies",
    "fullname": "Field Studies in African American and African Studies",
    "info": "Supervised field study/internship focused on African American or African culture(s), language(s), and development.",
    "prereq": []
  },
  {
    "uid": "790943",
    "code": "AFRO5405",
    "subject": "AFRO",
    "number": "5405",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Child",
    "fullname": "The African American Child",
    "info": "Research carried out by African American psychologists and behavioral/social scientists, and by experts on African American child/youth development.",
    "prereq": []
  },
  {
    "uid": "809430",
    "code": "AFRO5406",
    "subject": "AFRO",
    "number": "5406",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Feminist Thought",
    "fullname": "Black Feminist Thought",
    "info": "Critically examine spatiality of African descendant women in Americas/larger black diaspora. Writings from black feminist/queer geographies, history, contemporary cultural criticism. Recent black feminist theorizing.",
    "prereq": []
  },
  {
    "uid": "795346",
    "code": "AFRO5429",
    "subject": "AFRO",
    "number": "5429",
    "honors": false,
    "writingIntensive": false,
    "name": "Slavery in the Americas",
    "fullname": "Slavery in Africa and in the Americas, 1400 to 1880",
    "info": "History of slavery in Africa and the New World. Indigenous institutions of unfree labor in West Africa. Origins of European slave trade in West Africa and South Africa. Development of plantation societies in South America, the Caribbean, and the United States. Comparative approach to understanding New World slavery and slavery on the African subcontinent. Focuses on religion, creolization, and antislavery resistance.",
    "prereq": []
  },
  {
    "uid": "795301",
    "code": "AFRO5437",
    "subject": "AFRO",
    "number": "5437",
    "honors": false,
    "writingIntensive": false,
    "name": "History of East Africa",
    "fullname": "History of East Africa",
    "info": "Major themes in history of East Africa, from era of early human cultural development to present. Methods that historians use to reconstruct history. Varying interpretations/constructions of history over time. ",
    "prereq": []
  },
  {
    "uid": "793849",
    "code": "AFRO5478",
    "subject": "AFRO",
    "number": "5478",
    "honors": false,
    "writingIntensive": false,
    "name": "African Politics",
    "fullname": "Contemporary Politics in Africa and the Colonial Legacy",
    "info": "How current politics in mainly, though not exclusively, sub-Saharan Africa have been shaped by pre-colonial/colonial processes. Reality of independence, recurrent political/economic crises. Global context, prospects for effective democracy.",
    "prereq": []
  },
  {
    "uid": "002351",
    "code": "AFRO5551",
    "subject": "AFRO",
    "number": "5551",
    "honors": false,
    "writingIntensive": false,
    "name": "Methods: Oral Traditions",
    "fullname": "Methods: Use of Oral Traditions as Resources for History",
    "info": "Use of spoken information through time as a source for writing history. Use of canons of history to analyze and critique oral traditions and integrate them into written history.",
    "prereq": []
  },
  {
    "uid": "002352",
    "code": "AFRO5593",
    "subject": "AFRO",
    "number": "5593",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Novel",
    "fullname": "The African American Novel",
    "info": "Explore African American novelistic traditions. Plot patterns, character types, settings, symbols, themes, mythologies. Creative perspectives of authors themselves. Analytical frameworks from contemporary literary scholarship.",
    "prereq": []
  },
  {
    "uid": "806437",
    "code": "AFRO5625",
    "subject": "AFRO",
    "number": "5625",
    "honors": false,
    "writingIntensive": false,
    "name": "Women Writers African Diaspora",
    "fullname": "Women Writers of Africa and the African Diaspora",
    "info": "In Coming to America, a 1988 film which blends humor and romance with some fairly pertinent observations, an African prince travels to Queens, NY, in search of a bride who will be both an equal and valued partner in life’s great adventure. In the thirty years since, the African immigrant story has become an intrinsic component of the booming canon of contemporary American immigrant literature, which includes such names as Edwidge Danticat, Jhumpa Lahiri, Junot Diaz, Chang-rae Lee, Gary Shteyngart, and others. This literary phenomenon mirrors trends identified in surveys and other similar data gathering activities. According to a 2009 study of the Migration Policy Institute, for instance, more than 75% of the foreign born African population in the United States has arrived since 1990. For these newcomers, Africa is not an imagined ancestral “motherland” impressed in collective memory. Nor is it a faraway continent of parental origin whose negative media portrayal at times foments a problematic identification. Africa is a lived space, a home left behind, the anchor of childhood memories and—all too frequently—a horizon that perpetually beckons. As for America, it is the idealized land of freedom, prosperity, and opportunity that sometimes gives more than it promised, but oftentimes disenchants. This course situates gender squarely within the interlocking contexts of dynamic, complex and ever-changing African and American landscapes. Over the course of the semester, we will read short stories, novellas, personal narratives and essays, interspersed with visual excerpts from selected films and other representations of immigration, migration and border crossing in contemporary African and American cultural landscapes.",
    "prereq": []
  },
  {
    "uid": "810075",
    "code": "AFRO5627",
    "subject": "AFRO",
    "number": "5627",
    "honors": false,
    "writingIntensive": false,
    "name": "Harlem Renaissance",
    "fullname": "Seminar: Harlem Renaissance",
    "info": "Review Harlem Renaissance from variety of perspectives. Literary, historical, cultural, political, international. Complex patterns of permeation/interdependency between worlds inside/outside of what W.E.B. Du Bois called \"the Veil of Color.\"prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "002355",
    "code": "AFRO5701",
    "subject": "AFRO",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Classics",
    "fullname": "Proseminar: Classic Works in African American Studies",
    "info": "Classic works in African American studies. Conceptual frameworks. Multidisciplinary focus.",
    "prereq": []
  },
  {
    "uid": "002356",
    "code": "AFRO5702",
    "subject": "AFRO",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Major Figures",
    "fullname": "Proseminar: Major Figures in African American Studies",
    "info": "Major figures from various fields in African American studies. Bio-critical focus.",
    "prereq": []
  },
  {
    "uid": "000564",
    "code": "AFRO5741",
    "subject": "AFRO",
    "number": "5741",
    "honors": false,
    "writingIntensive": false,
    "name": "Minorities & Media",
    "fullname": "Minorities and Mass Media",
    "info": "Analysis of relationships between mass media and communities of color in the United States.  Focuses on issues of content and control.",
    "prereq": []
  },
  {
    "uid": "791913",
    "code": "AFRO5756",
    "subject": "AFRO",
    "number": "5756",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Blacks in Sports",
    "fullname": "Social and Cultural History of Blacks in Sports",
    "info": "Social/cultural contexts surrounding eras of athletes such as Jack Johnson, Jackie Robinson, Joe Louis, Jesse Owens, Althea Gibson, Wilma Rudolph, Muhammad Ali, Michael Jordan, and Tiger Woods. Impact of these athletes on national/international events. Periods when it was not uncommon for black entertainers/athletes to become involved in politics and community activism.",
    "prereq": []
  },
  {
    "uid": "007031",
    "code": "AFRO5864",
    "subject": "AFRO",
    "number": "5864",
    "honors": false,
    "writingIntensive": false,
    "name": "African-Am Hist Sem",
    "fullname": "Proseminar: African-American History",
    "info": "Examination of issues including slavery, Reconstruction, the Great Depression, and civil rights movement using cultural and intellectual history and autobiography/biography. Focuses on dynamics of race, gender, class, region, sexuality, and religion.",
    "prereq": []
  },
  {
    "uid": "007032",
    "code": "AFRO5865",
    "subject": "AFRO",
    "number": "5865",
    "honors": false,
    "writingIntensive": false,
    "name": "African-Am Hist Sem",
    "fullname": "Proseminar: African-American History",
    "info": "Construction of a detailed research agenda,  locating appropriate depositories of primary materials and secondary sources, and developing appropriate methodologies and frameworks. ",
    "prereq": []
  },
  {
    "uid": "795348",
    "code": "AFRO5866",
    "subject": "AFRO",
    "number": "5866",
    "honors": false,
    "writingIntensive": false,
    "name": "Civil Rights & Black Power Mvt",
    "fullname": "The Civil Rights and Black Power Movement, 1954-1984",
    "info": "The \"second reconstruction.\" Failure of Reconstruction, abdication of black civil rights in 19th century. Post-1945 assault on white supremacy via courts/state, grass-roots southern movement in 1950s/1960s. Black struggle in north and west, emphasis on Black Power by new organizations/ideologies/leaders. Ascendancy of Reagan, conservative assault on movement.",
    "prereq": []
  },
  {
    "uid": "007040",
    "code": "AFRO5876",
    "subject": "AFRO",
    "number": "5876",
    "honors": false,
    "writingIntensive": false,
    "name": "Development Seminar",
    "fullname": "Proseminar: Approaches to African Development",
    "info": "This course is designed for students who have an interest in research topics and approaches to understanding African Development. Students are required to have a good background in development studies. We will discuss methodologies (theories and models) that have been used to explain and predict the behavior of African economies and analyze responses to policy mechanisms. Students who are currently working on research projects/issues on African Development are encouraged to enroll in the course.",
    "prereq": []
  },
  {
    "uid": "005060",
    "code": "AFRO5910",
    "subject": "AFRO",
    "number": "5910",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Afro Amer & African St",
    "fullname": "Topics in African American and African Studies",
    "info": "Topics vary by instructor.",
    "prereq": []
  },
  {
    "uid": "810006",
    "code": "AFRO5932",
    "subject": "AFRO",
    "number": "5932",
    "honors": false,
    "writingIntensive": false,
    "name": "Africa Production of Knowledge",
    "fullname": "The Production of Knowledge, Negotiating the Past, and the Writing of African Histories",
    "info": "Recent scholarship on social history of Africa. Focuses on new literature on daily lives of ordinary people in their workplaces, communities, households.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "005061",
    "code": "AFRO5993",
    "subject": "AFRO",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading/study for qualified seniors and graduate students.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "005525",
    "code": "AFRO8202",
    "subject": "AFRO",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Race",
    "fullname": "Seminar: Intellectual History of Race",
    "info": "At its heart, the 8202 seminar is about dialogue, interrogating scholarship on race, intellectual history, and knowledge production. We will be in deep conversation with one another as we negotiate meaning around the intellectual history of race. Dialogue, indeed, is at the heart of this graduate seminar experience. Given the multidisciplinary composition of the students and content in 8202, we build together to form a learning whole in a remote format. Central to our work is excavating the 500 year legacy of race thought and making into the contemporary period.",
    "prereq": []
  },
  {
    "uid": "010334",
    "code": "AFRO8554",
    "subject": "AFRO",
    "number": "8554",
    "honors": false,
    "writingIntensive": false,
    "name": "Race,Gender, Policy",
    "fullname": "Seminar: Gender, Race, Nation, and Policy--Perspectives from Within the African Diaspora",
    "info": "Interdisciplinary analysis of U.S. domestic and foreign policies as they affect Africans and peoples of African descent in the diaspora. Intersections of gender, race, nation, and class.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "013710",
    "code": "AFRO8590",
    "subject": "AFRO",
    "number": "8590",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemp Lit & Cultural Studies",
    "fullname": "Contemporary Literary and Cultural Studies",
    "info": "Each term explores a topic of key intellectual and critical significance in African American and/or African literary and cultural studies.",
    "prereq": []
  },
  {
    "uid": "007009",
    "code": "AFRO8802",
    "subject": "AFRO",
    "number": "8802",
    "honors": false,
    "writingIntensive": false,
    "name": "Africa & the Rise of the East",
    "fullname": "Africa & the Rise of the East",
    "info": "This course draws attention to the Indian Ocean as the new theatre of global economy and politics. Indeed, most historians generally consider Christopher Columbus's 1492 landfall in the New World as the epoch-making moment in modern history. The undisputed and central place in history that North America—and the larger Americas—have come to occupy since that chance \"discovery\" and the subsequent centuries of conquest, colonization, and imperial domination have made the Atlantic region the most studied area in the world. Long before European presence turned the Indian Ocean into a volatile space rife with tensions and competing interests, however, the Afrasian region was the locus of trade flows between Africa, the Middle East and Asia. By the time Portuguese navigator Vasco da Gama reached the Swahili coast of East Africa in 1497 enroute to India, expansive trade networks thrived in the area extending across the Sahara into the Atlantic Ocean in the West, and into the far East and beyond. Over the past two decades, Indian Ocean studies have witnessed an explosion driven by the incontestable fact that the region has today become the epicenter of global commerce, and a battleground for resource-based conflicts between waning, emerging superpowers, and their antagonists. AFRO 8802 deploys literary texts as reflective of ongoing critical engagement with the rise of the East as a major world center for technology, business, and increasingly, culture.",
    "prereq": []
  },
  {
    "uid": "010742",
    "code": "AFRO8910",
    "subject": "AFRO",
    "number": "8910",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Africa & African Diasp",
    "fullname": "Topics in Studies of Africa and the African Diaspora",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "825069",
    "code": "AFRO8993",
    "subject": "AFRO",
    "number": "8993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided indvidual reading/study for qualified seniors and graduate students",
    "prereq": []
  }
]