[
  {
    "uid": "791926",
    "code": "AGRO1007",
    "subject": "AGRO",
    "number": "1007",
    "honors": false,
    "writingIntensive": false,
    "name": "Horse in Your Backyard",
    "fullname": "Horse in Your Backyard",
    "info": "Role of horses in society. How to keep a horse well fed and healthy. Fundamentals of horse nutrition, feedstuffs, pasture, and horse health.  How to seek/interpret information to make decisions on vaccination, worming, nutrition, grazing management, hay selection, manure handling, and use of dietary feed additives/enhancers.",
    "prereq": []
  },
  {
    "uid": "007688",
    "code": "AGRO1101",
    "subject": "AGRO",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Bio of Plant System",
    "fullname": "Biology of Plant Food Systems",
    "info": "Designed for students who are not majors in a life science program, but who wish to acquire a better understanding of biological concepts especially as they relate to their lives. We  examine current issues related to food, food production and the environment which provide the context to investigate fundamental concepts of biology including productivity, energy, genetic change in populations, and environmental responses to human activity. We use a problem-based learning approach to explore three contemporary issues of great importance: risks and benefits of GMOs, farming and food, and the dead zone in the Gulf of Mexico. Lab, greenhouse, field, and classroom discussions.",
    "prereq": []
  },
  {
    "uid": "007579",
    "code": "AGRO1103",
    "subject": "AGRO",
    "number": "1103",
    "honors": false,
    "writingIntensive": false,
    "name": "Crops, Environment & Society",
    "fullname": "Crops, Environment, and Society",
    "info": "Plants are used for food, fuel, and fiber to sustain humans across the globe. Where and how these plants are produced is determined by soil, weather, natural biodiversity, and human culture. In turn, agricultural production of plants shapes the natural environment and society. This class will provide students with an overview of crop production including the history of agriculture, food chemistry, and plant growth and physiology as it relates to agriculture. Students will evaluate crop production practices in terms of their economic, social, and environmental outcomes, and highlight tradeoffs and synergies among these outcomes. In the lab, students will receive hands-on experiences with field crops as they collect, analyze, and synthesize data from field experiments to inform decision-making in agriculture.",
    "prereq": []
  },
  {
    "uid": "795195",
    "code": "AGRO1661W",
    "subject": "AGRO",
    "number": "1661",
    "honors": false,
    "writingIntensive": true,
    "name": "Engaging Plant Science",
    "fullname": "Engaging Plant Science",
    "info": "This course engages students in educational experiences to develop skills to navigate the plant sciences. As an orientation course, it will introduce you to some of the important resources available to you as a student at the University of Minnesota in the College of Food Agricultural, and Natural Resources Sciences. A major learning objective is to increase your ability to access and utilize the primary literature in the plant sciences. This course will also introduce you to fundamental skills and best practices in managing and analyzing data that you will use in subsequent plant science courses. As a writing intensive course, you will get instruction and practice in scientific writing. This course is delivered in a hybrid (in person/online) format. This will require careful planning, self-discipline, and good time management to view pre-recorded lectures and successfully complete the various online learning activities, quizzes and assignments. The specific plant science content that you will learn will come from your research to complete a literature review assignment, reading and analyzing papers, and working with data sets from published research. The ultimate goal is to enhance your competency as a self-learner to serve you in your academic pursuit of a degree at the University of Minnesota and beyond.",
    "prereq": []
  },
  {
    "uid": "806770",
    "code": "AGRO1901",
    "subject": "AGRO",
    "number": "1901",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "818593",
    "code": "AGRO1902",
    "subject": "AGRO",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Spotting Bad Science",
    "fullname": "A Field Guide for Spotting Bad Science in Daily Life",
    "info": "Today, the media is saturated with reporting on new scientific findings. However, the replication crisis in science and the rise of bogus scientific journals makes it difficult to know what to believe. This freshman seminar looks at the issues ranging from poorly executed but over-hyped scientific studies to bogus studies and the manipulation of public perceptions. Examples used will come from popular media and scientific literature. Through an examination of these studies, students will gain tools for identifying problematic claims.",
    "prereq": []
  },
  {
    "uid": "826392",
    "code": "AGRO1921",
    "subject": "AGRO",
    "number": "1921",
    "honors": false,
    "writingIntensive": false,
    "name": "Coffee from the Ground Up",
    "fullname": "Coffee from the Ground Up",
    "info": "This freshman seminar is all about coffee: its history, geography, biology, breeding, production, processing, economics, sustainability, and brewing. Through team exercises, students will discover how measurable qualities of a cup of coffee are influenced by factors such as species, type of roast, grind size, brew ratio, temperature, and brewing method. The class will culminate with a team competition judged by a panel. Students will develop skills in oral and written expression, working with others, and solving problems in a manner that combines science and art. Overall, the course will help students discover and appreciate how something that seems so simple is the product of a creative and complex process.",
    "prereq": []
  },
  {
    "uid": "806771",
    "code": "AGRO1942",
    "subject": "AGRO",
    "number": "1942",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics:  Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "817852",
    "code": "AGRO2022",
    "subject": "AGRO",
    "number": "2022",
    "honors": false,
    "writingIntensive": false,
    "name": "Growth & Develop of MN Crops",
    "fullname": "Growth and Development of Minnesota Field Crops",
    "info": "Students learn how field crop species grow and develop, how unique traits of crop species contribute to ecosystem services, and how to identify important growth stages of crops. In addition to traditional agronomic crops (small grains, alfalfa, soybean and corn), students will work with annual and perennial species that represent emerging crops grown for grain, oil seed, novel products, cover crops and biomass. Course work includes lectures, labs (greenhouse and field), and online assignments and quizzes.  prereqs: AGRO 1101 or HORT 1001 or BIOL 1009 or BIOL 1001 and AGRO 1103",
    "prereq": {
      "and": [
        {
          "code": "AGRO 1101",
          "subject": "AGRO",
          "id": "1101"
        },
        {
          "code": "HORT 1001",
          "subject": "HORT",
          "id": "1001"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "AGRO 1103",
          "subject": "AGRO",
          "id": "1103"
        }
      ]
    }
  },
  {
    "uid": "791017",
    "code": "AGRO2101",
    "subject": "AGRO",
    "number": "2101",
    "honors": false,
    "writingIntensive": false,
    "name": "Biol Food, Land, People, Env.",
    "fullname": "Biology of Food, Land, People, and the Environment",
    "info": "Biological basis of food, land, people, and environmental systems. Biology at cellular, organism and ecosystems level in relation to human activity systems. Active learning, project-based approach.",
    "prereq": []
  },
  {
    "uid": "007586",
    "code": "AGRO2104",
    "subject": "AGRO",
    "number": "2104",
    "honors": false,
    "writingIntensive": false,
    "name": "Grain and Seed Technology",
    "fullname": "Grain and Seed Technology",
    "info": "Practice/principles of grain grading using Federal Grain Inspection Service (FGIS) standards with examples of commodity, classes, subclasses, defects, and special grades. Seed analysis identifying common crops and weed seeds. Seed laws, seed handling, conditioning/viability testing. Primarily laboratory discussion, practicum, and problem solving.",
    "prereq": []
  },
  {
    "uid": "007452",
    "code": "AGRO2105",
    "subject": "AGRO",
    "number": "2105",
    "honors": false,
    "writingIntensive": false,
    "name": "Seed Technology",
    "fullname": "Seed Technology",
    "info": "Principles and practices of crop and weed seed identification, seed analysis, seed laws, seed handling, conditioning and viability testing. Appropriate for students interested in careers in the seed production or regulation industries.",
    "prereq": []
  },
  {
    "uid": "819189",
    "code": "AGRO2402",
    "subject": "AGRO",
    "number": "2402",
    "honors": false,
    "writingIntensive": false,
    "name": "The Science of Cannabis",
    "fullname": "The Science of Cannabis",
    "info": "Botany, growth and development of cannabis, industrial and medical uses, cultivation of industrial and medical cannabis, human health and social impacts, federal and state regulations. ",
    "prereq": []
  },
  {
    "uid": "007650",
    "code": "AGRO2501",
    "subject": "AGRO",
    "number": "2501",
    "honors": false,
    "writingIntensive": false,
    "name": "Plant ID:Urban&Rural Landscape",
    "fullname": "Plant Identification for Urban and Rural Landscapes",
    "info": "Identification of weed species and native herbaceous plants that are important in crop production, turf management, horticulture production, and landscapes systems. This course will emphasize the identification of weed species and other plants found in Minnesota and the upper Midwest area of the United States. Plant families, life cycles, habitats and relationships to humans.\n\nprereq: Biol 1009 or equiv",
    "prereq": {
      "code": "BIOL 1009",
      "subject": "BIOL",
      "id": "1009"
    }
  },
  {
    "uid": "818861",
    "code": "AGRO2502",
    "subject": "AGRO",
    "number": "2502",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Integrated Weed Mgmt",
    "fullname": "Introduction to Integrated Weed Management",
    "info": "Weeds reduce crop yield and quality, affect human health, and result in significant economic loss. This course is for undergraduate students interested in learning more about weed management techniques in an applied context. The goal is to develop a basic understanding of how weed biology and ecology are used to select and integrate weed control tools for effective long-term management of weeds in annual and perennial cropping systems. The topics to be covered in this course will include basic understanding of weed biology/ecology, knowledge of different mechanical, cultural, and chemical weed control tools, and process for integration to meet specific goals.  The course involves active, hands-on learning around new technologies as well as guest lecturers from industry. Agro 1103 or Biol 1009 is recommended. Agro 2501 is highly encouraged. ",
    "prereq": []
  },
  {
    "uid": "007649",
    "code": "AGRO3003",
    "subject": "AGRO",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Integrated Weed Mmgt",
    "fullname": "Introduction to Integrated Weed Management",
    "info": "Introduction to the principles of the biological, physical, and agricultural sciences that underlie practice of integrated weed management.",
    "prereq": []
  },
  {
    "uid": "014100",
    "code": "AGRO3093",
    "subject": "AGRO",
    "number": "3093",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed study: A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. Instructor consent required. No more than 6 credits of directed study counts towards CFANS major requirements. ",
    "prereq": []
  },
  {
    "uid": "819491",
    "code": "AGRO3094",
    "subject": "AGRO",
    "number": "3094",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carriesout a directed research project under the direction of a faculty member. Directedresearch may be taken for variable credit and special permission is needed forenrollment.Students enrolling in a directed research will be required to use theUniversity-wide on-line directed research contract process in order to enroll.Prereq: department consent, instructor consent, no more than 6 credits ofdirected research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "801458",
    "code": "AGRO3131",
    "subject": "AGRO",
    "number": "3131",
    "honors": false,
    "writingIntensive": false,
    "name": "Organic Farm, Plan, Grow, Mrkt",
    "fullname": "Student Organic Farm Planning, Growing, and Marketing",
    "info": "Students plan/implement cropping/marketing strategies for organic produce/flowers from Student Organic Farm on St. Paul campus.",
    "prereq": []
  },
  {
    "uid": "007453",
    "code": "AGRO3203W",
    "subject": "AGRO",
    "number": "3203",
    "honors": false,
    "writingIntensive": true,
    "name": "Env, Food Prod & the Citizen",
    "fullname": "Environment, Global Food Production, and the Citizen",
    "info": "Ecological/ethical concerns of food production systems in global agriculture: past, present, and future. Underlying ethical positions about how agroecosystems should be configured. Decision cases, discussions, videos, other media.",
    "prereq": []
  },
  {
    "uid": "810005",
    "code": "AGRO3305",
    "subject": "AGRO",
    "number": "3305",
    "honors": false,
    "writingIntensive": false,
    "name": "Agroecosystems of the world",
    "fullname": "Agroecosystems of the world",
    "info": "Explore four different areas of world (Minnesota, Morocco, Nepal, Costa Rica) by networking with locals on ground in each region through online interactions. Food, agriculture, environment. Biophysical/socio-cultural aspects of agroecosystems through unique multi-disciplinary lens.",
    "prereq": []
  },
  {
    "uid": "803828",
    "code": "AGRO3660",
    "subject": "AGRO",
    "number": "3660",
    "honors": false,
    "writingIntensive": false,
    "name": "Plant Genetic Resources",
    "fullname": "Plant Genetic Resources: Identification, Conservation, and Utilization",
    "info": "Importance of plant genetic diversity. Morphological, molecular, and computational methods of identifying/conserving genetic resources. Biological basis of genetic diversity. Case studies in crop improvement.prereq: BIOL 1009 or equiv",
    "prereq": {
      "code": "BIOL 1009",
      "subject": "BIOL",
      "id": "1009"
    }
  },
  {
    "uid": "007595",
    "code": "AGRO4005",
    "subject": "AGRO",
    "number": "4005",
    "honors": false,
    "writingIntensive": false,
    "name": "App Crop Phys & Dev",
    "fullname": "Applied Crop Physiology and Development",
    "info": "Applications of plant physiology processes of water relations, photosynthesis, mineral uptake/function, transpiration, translocation, and their relationships to plant growth/development from seed germination to maturation and dry down for harvest. Emphasizes inquiry, field problems, and group activity. Lecture, laboratory.prereq: [Chem 1011 or Chem 1021 or equiv], 8 cr in [biol or plant science]",
    "prereq": {
      "or": [
        {
          "code": "CHEM 1011",
          "subject": "CHEM",
          "id": "1011"
        },
        {
          "code": "CHEM 1021",
          "subject": "CHEM",
          "id": "1021"
        }
      ]
    }
  },
  {
    "uid": "816609",
    "code": "AGRO4015",
    "subject": "AGRO",
    "number": "4015",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Agronomy",
    "fullname": "Topics in Agronomy",
    "info": "This course focuses on current topics in crops, cropping systems, and plant improvement.     ",
    "prereq": []
  },
  {
    "uid": "008027",
    "code": "AGRO4093",
    "subject": "AGRO",
    "number": "4093",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Studies for Adv Students",
    "fullname": "Directed Studies for Advanced Students",
    "info": "Allows study of agronomy in greater depth or in areas not currently offered in formal courses. Tutorial instruction under staff guidance.Instructor consent required. No more than 6 credits of directed study counts towards CFANS major requirements. ",
    "prereq": []
  },
  {
    "uid": "804605",
    "code": "AGRO4094W",
    "subject": "AGRO",
    "number": "4094",
    "honors": false,
    "writingIntensive": true,
    "name": "Undergraduate Directed Thesis",
    "fullname": "Undergraduate Directed Thesis Research",
    "info": "Research and thesis writing experience conducted under supervision of a CFANS faculty advisor and course instructor. The student is responsible for identifying the faculty advisor and conducting research prior to registering for this course. A course permission number is given after providing a student-faculty learning contract. The goal of this course is to produce a written thesis in the format of a peer-reviewed scientific article. Students will meet weekly with the course instructor to discuss writing about research. Students will complete a series of staged writing assignments for each section of the thesis (Introduction, Methods, Results, Discussion etc.). After review by the faculty advisor, the student will revise and submit their final draft. Final drafts will be published in the University of Minnesota Library Digital Conservancy (https://conservancy.umn.edu/handle/11299/203510).",
    "prereq": []
  },
  {
    "uid": "007984",
    "code": "AGRO4096W",
    "subject": "AGRO",
    "number": "4096",
    "honors": false,
    "writingIntensive": true,
    "name": "Professional Exp Internship",
    "fullname": "Professional Experience Program: Internships",
    "info": "Supervised professional experience with a private company, public agency, or non-profit organization involved in plant production or food systems. Reflective analysis of professional experience and technical communication on a topic related to the internship. This course meets on campus once in late spring and twice in early fall with several online activities during the summer.",
    "prereq": []
  },
  {
    "uid": "007771",
    "code": "AGRO4101",
    "subject": "AGRO",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Ag Decision Making/Experiment",
    "fullname": "Agricultural Decision Making and Experimentation",
    "info": "Principles of field plot techniques and design applied to field demonstrations/experiments. Inductive/deductive reasoning, analysis of data, tests of significance. Treatment comparisons, decision making.  Computers used for data processing and statistical analysis.",
    "prereq": []
  },
  {
    "uid": "007548",
    "code": "AGRO4103",
    "subject": "AGRO",
    "number": "4103",
    "honors": false,
    "writingIntensive": false,
    "name": "World Food Problems",
    "fullname": "World Food Problems",
    "info": "Multidisciplinary look at problems and possible solutions affecting food production, storage, and utilization in developing countries. Presentations and discussions introduce conflicting views on population, technology, and ethical and cultural values of people in various parts of the world.",
    "prereq": []
  },
  {
    "uid": "817882",
    "code": "AGRO4105",
    "subject": "AGRO",
    "number": "4105",
    "honors": false,
    "writingIntensive": false,
    "name": "Crop Management Field School",
    "fullname": "Crop Management Field School: A Hands-on Immersion",
    "info": "In this course, you will apply and integrate principles and concepts of agronomy, plant pathology, entomology, and soil and weed science in a hands-on field setting with real-life scenarios and problems common in production agriculture.prereqs: BIOL 1001, 1009 or HORT 1001; AGRO 1103, and SOIL 2125  ",
    "prereq": {
      "and": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "AGRO 1009",
          "subject": "AGRO",
          "id": "1009"
        },
        {
          "code": "HORT 1001",
          "subject": "HORT",
          "id": "1001"
        },
        {
          "code": "AGRO 1103",
          "subject": "AGRO",
          "id": "1103"
        },
        {
          "code": "SOIL 2125",
          "subject": "SOIL",
          "id": "2125"
        }
      ]
    }
  },
  {
    "uid": "007593",
    "code": "AGRO4201",
    "subject": "AGRO",
    "number": "4201",
    "honors": false,
    "writingIntensive": false,
    "name": "Agro-ecosystems & Crop Prod",
    "fullname": "Agro-ecosystems and Crop Production",
    "info": "Basic concepts in agrosystems: organization, development, and function of field crop communities in contrast to natural ecosystems.  Means of improving designed and managed systems for the benefit of humankind while minimizing impact on the ecosystem.",
    "prereq": []
  },
  {
    "uid": "007770",
    "code": "AGRO4305",
    "subject": "AGRO",
    "number": "4305",
    "honors": false,
    "writingIntensive": false,
    "name": "Crop Harvest, Stor, Proc & Uti",
    "fullname": "Crop Harvest, Storage, Processing, Utilization",
    "info": "Crop quality traits associated with use and influence on crop harvest, product quality, storage, handling, processing, and utilization.  Principles and technology used in crop storage to minimize damage from fungi and insects, and maximize crop quality. Lecture and lab.",
    "prereq": []
  },
  {
    "uid": "007652",
    "code": "AGRO4401",
    "subject": "AGRO",
    "number": "4401",
    "honors": false,
    "writingIntensive": false,
    "name": "Plant Genetics and Breeding",
    "fullname": "Plant Genetics and Breeding",
    "info": "Principles of plant genetics and environmental variation. Applications of genetics to crop evolution and breeding of self-pollinated, cross-pollinated, and asexually propagated crops. Investigation of hybridization, variation, and selection.prereq: Biol 1009 or equiv or grad, instr consent",
    "prereq": {
      "code": "BIOL 1009",
      "subject": "BIOL",
      "id": "1009"
    }
  },
  {
    "uid": "007651",
    "code": "AGRO4505",
    "subject": "AGRO",
    "number": "4505",
    "honors": false,
    "writingIntensive": false,
    "name": "Bio/Eco/Manage Invasive Plants",
    "fullname": "Biology, Ecology, and Management of Invasive Plants",
    "info": "Ecology/biology of invasive plant species (weeds). Principles of invasive plant management in agricultural/horticultural, urban, wetland, aquatic, and other non-cropland landscape systems, utilizing biological, cultural, and chemical means. Management strategies to design systems that optimize invasive plant management in terms of economic, environmental, and social impacts.",
    "prereq": []
  },
  {
    "uid": "007584",
    "code": "AGRO4603",
    "subject": "AGRO",
    "number": "4603",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Crop Scout & Prob Diag",
    "fullname": "Field Crop Scouting and Problem Diagnosis",
    "info": "Insects, diseases, weeds. Nutrient status. Environmental stresses due to wind, hail, frost, soil conditions, and chemical injury. Calibration of equipment associated with crop protection. Pesticide use, safety procedures. Crop growth staging and growing degree day as components of decision-making and precision agriculture. Intensive summer training sessons at selected Minnesota agricultural research and outreach centers.",
    "prereq": []
  },
  {
    "uid": "007589",
    "code": "AGRO4605",
    "subject": "AGRO",
    "number": "4605",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategies for Ag Prod & Mgmt",
    "fullname": "Strategies for Agricultural Production and Management",
    "info": "ISome of humanity's greatest challenges are related to agriculture. The human population continues to grow and food, fuel, and fiber production are critical to improving human lives around the world. In this course, students will learn the principles of crop production and apply those principles to address real-world agricultural challenges using quantitative tools and skills. Students will learn how to find, access, and use publicly available data to better make decisions in agriculture. Group activities will require students to synthesize information from peer-reviewed research and apply that information to practical problems. This class includes trips to field research plots to collect data, organizing it, and analyzing it to test hypotheses and solve problems. Discussions and labs will be interactive and will require individual and group-level critical thinking.\n\nprereq: 1101 or equivalent, [CHEM1015/17 or equivalent], SOIL1125 or equivalent], [jr or sr or grad student or instr consent]",
    "prereq": {
      "and": [
        {
          "code": "AGRO 1101",
          "subject": "AGRO",
          "id": "1101"
        },
        {
          "code": "CHEM 1015",
          "subject": "CHEM",
          "id": "1015"
        },
        {
          "code": "SOIL 1125",
          "subject": "SOIL",
          "id": "1125"
        }
      ]
    }
  },
  {
    "uid": "007648",
    "code": "AGRO4660",
    "subject": "AGRO",
    "number": "4660",
    "honors": false,
    "writingIntensive": false,
    "name": "Senior Capstone",
    "fullname": "Senior Capstone",
    "info": "Complexities of agricultural issues. Exercises/discussions integrating previous educational situations. Linked to undergrad internships/experiential learning opportunities such as thesis or directed studies or service learning. Written/oral assignments.",
    "prereq": []
  },
  {
    "uid": "012864",
    "code": "AGRO4888",
    "subject": "AGRO",
    "number": "4888",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in Sustainable Ag",
    "fullname": "Issues in Sustainable Agriculture",
    "info": "Agroecology, sustainable practices, production economics, environmental quality, holistic resource management, healthy food/water, rural communities. Meet sustainable-agriculture advocates, including farmers, faculty, and representatives of non-profit sustainable-agriculture organizations.\n\nprereq: 1103, Soil 1125 or 2125 or equiv",
    "prereq": {
      "and": [
        {
          "code": "AGRO 1103",
          "subject": "AGRO",
          "id": "1103"
        },
        {
          "code": "SOIL 1125",
          "subject": "SOIL",
          "id": "1125"
        },
        {
          "code": "AGRO 2125",
          "subject": "AGRO",
          "id": "2125"
        }
      ]
    }
  },
  {
    "uid": "003216",
    "code": "AGRO5021",
    "subject": "AGRO",
    "number": "5021",
    "honors": false,
    "writingIntensive": false,
    "name": "Plant Breeding Principles",
    "fullname": "Plant Breeding Principles",
    "info": "This course is intended for advanced undergraduate students and graduate students that are either: 1) not plant breeding majors who will benefit from a basic understanding of how genetics is applied to plant improvement; or 2) plant breeding majors lacking prior coursework in plant breeding. The objective of this course is to develop an understanding of the underlying principles, ideas, and concepts important to applying genetic principles to plant breeding, evaluating breeding methods, and enhancing genetic progress and efficiency.",
    "prereq": []
  },
  {
    "uid": "792833",
    "code": "AGRO5121",
    "subject": "AGRO",
    "number": "5121",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Experimental Design",
    "fullname": "Applied Experimental Design",
    "info": "Principles of sampling methodologies, experimental design, and statistical analyses. Methods/procedures in generating scientific hypotheses. Organizing, initiating, conducting, and analyzing scientific experiments using experimental designs and statistical procedures.prereq: Stat 5021 or NR 5021 or equiv or instr consent",
    "prereq": {
      "or": [
        {
          "code": "STAT 5021",
          "subject": "STAT",
          "id": "5021"
        },
        {
          "code": "NR 5021",
          "subject": "NR",
          "id": "5021"
        }
      ]
    }
  },
  {
    "uid": "801459",
    "code": "AGRO5131",
    "subject": "AGRO",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "Organic Farm Plan, Grow, Mrkt",
    "fullname": "Student Organic Farm Planning, Growing, and Marketing",
    "info": "Students plan/implement cropping/marketing strategies for organic produce/flowers from Student Organic Farm on St. Paul campus.",
    "prereq": []
  },
  {
    "uid": "003217",
    "code": "AGRO5311",
    "subject": "AGRO",
    "number": "5311",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Methods in Crop Imp & Prod",
    "fullname": "Research Methods in Crop Improvement and Production",
    "info": "Demonstrations and discussions of techniques in crop improvement and/or production research. Presentations integrate biotechnology with traditional breeding methods; production sessions emphasize ecologically sound cropping systems.\n\nprereq: applied plant sciences grad",
    "prereq": []
  },
  {
    "uid": "013406",
    "code": "AGRO5321",
    "subject": "AGRO",
    "number": "5321",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecology: Agricultural Systems",
    "fullname": "Ecology of Agricultural Systems",
    "info": "Ecological approach to problems in agricultural systems. Formal methodologies of systems inquiry are developed/applied.prereq: No freshmen or sophomores ",
    "prereq": []
  },
  {
    "uid": "811724",
    "code": "AGRO5431",
    "subject": "AGRO",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Plant Genomics",
    "fullname": "Applied Plant Genomics and Bioinformatics",
    "info": "Analysis, interpretation, visualization of large plant genomic datasets. Basic computer programming, applying large-scale genomics to answer basic/applied biological questions, understanding limitations of each application, presenting concise visual findings from large-scale datasets.",
    "prereq": []
  },
  {
    "uid": "806291",
    "code": "AGRO5980",
    "subject": "AGRO",
    "number": "5980",
    "honors": false,
    "writingIntensive": false,
    "name": "Publish in Plant Sci Journals",
    "fullname": "Publishing in Plant Science Journals",
    "info": "Organizational/writing skills for reporting research results in a peer-reviewed journal manuscript. Publication process; choosing your journal; characteristics of good scientific writing; ethics, plagiarism, and authorship; stating your objectives; writing the different components of a manuscript; citing literature; use of tables and figures; proofreading. Written manuscript ready for submission to a plant science journal.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "008029",
    "code": "AGRO5999",
    "subject": "AGRO",
    "number": "5999",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Agronomy",
    "fullname": "Special Topics: Workshop in Agronomy",
    "info": "Workshops on various topics in agronomy and plant genetics. Presenters/faculty may include guest lecturers/experts. Topics specified in class schedule.",
    "prereq": []
  },
  {
    "uid": "008451",
    "code": "AGRO8005",
    "subject": "AGRO",
    "number": "8005",
    "honors": false,
    "writingIntensive": false,
    "name": "Supervised Teaching",
    "fullname": "Supervised Classroom or Extension Teaching Experience",
    "info": "Classroom or extension teaching experience in one of the following departments: Agronomy and Plant Genetics; Biosystems and Agricultural Engineering; Horticultural Science; Plant Pathology; or Soil, Water, and Climate. Participation in discussions about effective teaching to strengthen skills and develop personal teaching philosophy.prereq: Grad SENG major, instr consent",
    "prereq": []
  },
  {
    "uid": "806332",
    "code": "AGRO8023",
    "subject": "AGRO",
    "number": "8023",
    "honors": false,
    "writingIntensive": false,
    "name": "Evol of Crop Plants",
    "fullname": "Evolution of Crop Plants",
    "info": "Origin, distribution, and evolution of cultivated plants; implication of the effects of evolutionary processes on crop breeding for needs of people today.prereq: 9 grad cr in ag or bio science",
    "prereq": []
  },
  {
    "uid": "003213",
    "code": "AGRO8201",
    "subject": "AGRO",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Plant Breeding",
    "fullname": "Advanced Plant Breeding",
    "info": "Principles/current methods involved in breeding agronomic and horticultural crops. Use of genotype/environment data to increase genetic gain, population improvement, parent building, alternative selection strategies, breeding for special traits, and new approaches.prereq: STAT 5301 or equiv",
    "prereq": {
      "code": "STAT 5301",
      "subject": "STAT",
      "id": "5301"
    }
  },
  {
    "uid": "003211",
    "code": "AGRO8202",
    "subject": "AGRO",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "Breeding Quantitative Traits",
    "fullname": "Breeding for Quantitative Traits in Plants",
    "info": "Principles and concepts of population and quantitative genetics/application in designing and implementing a plant breeding program/theory, experimental approaches, and evidence that form the basis for these concepts and breeding strategies.prereq: graduate-level course in plant breeding [AGRO 5021 or equivalent] and graduate-level course in statistics [STAT 5021 or NR 5021 or equivalent] or instructor consent",
    "prereq": {
      "and": [
        {
          "code": "AGRO 5021",
          "subject": "AGRO",
          "id": "5021"
        },
        {
          "or": [
            {
              "code": "STAT 5021",
              "subject": "STAT",
              "id": "5021"
            },
            {
              "code": "NR 5021",
              "subject": "NR",
              "id": "5021"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "003215",
    "code": "AGRO8231",
    "subject": "AGRO",
    "number": "8231",
    "honors": false,
    "writingIntensive": false,
    "name": "Chromosome Biology",
    "fullname": "Chromosome Biology",
    "info": "Eukaryotic chromosome. Molecular cytogenetics of chromosome structure, replication, pairing, and crossing over. Deficiencies, duplications, inversions, interchanges. Aneuploidy, autopolyploidy, allopolyploidy. Uses of cytogenetic stocks in genetics and plant breeding.",
    "prereq": []
  },
  {
    "uid": "003549",
    "code": "AGRO8241",
    "subject": "AGRO",
    "number": "8241",
    "honors": false,
    "writingIntensive": false,
    "name": "Chromosomal & Molec Genetics",
    "fullname": "Chromosomal and Molecular Genetics of Plant Improvement",
    "info": "Mixture of classic/current info in molecular plant genetics, biotech, and genomics. Students devise experiments in breeding, genetics, genomics, physiology, cellular/molecular biology, and other areas.\n\nprereq: Introductory Genetics course",
    "prereq": []
  },
  {
    "uid": "003214",
    "code": "AGRO8270",
    "subject": "AGRO",
    "number": "8270",
    "honors": false,
    "writingIntensive": false,
    "name": "Grad Seminar",
    "fullname": "Graduate Seminar",
    "info": "Reports/discussions of problems and investigational work.prereq: Grad major in [applied plnt sci or agro or ent or hort or plnt brdg or plnt path or soil] or instr consent",
    "prereq": []
  },
  {
    "uid": "003218",
    "code": "AGRO8280",
    "subject": "AGRO",
    "number": "8280",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Topics Appl Plant Sci",
    "fullname": "Current Topics in Applied Plant Sciences",
    "info": "Topics presented by faculty or visiting scientists.",
    "prereq": []
  },
  {
    "uid": "008458",
    "code": "AGRO8305",
    "subject": "AGRO",
    "number": "8305",
    "honors": false,
    "writingIntensive": false,
    "name": "Plant Envir Physiol",
    "fullname": "Physiological Ecology of Plants in Natural and Managed Ecosystems",
    "info": "Introduction to plants and their reactions and responses in managed and natural ecosystems, including carbon and nitrogen allocation, root biology, microbial interaction, secondary metabolism, and plant response to biotic and abiotic stress. ",
    "prereq": []
  },
  {
    "uid": "008449",
    "code": "AGRO8505",
    "subject": "AGRO",
    "number": "8505",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Perspc Weed Sci",
    "fullname": "Advanced Perspectives in Weed Science",
    "info": "Topics concerning the biochemistry and sustainability of chemical and biological weed control methods. Lecture and student-directed discussion.prereq: Grad major in agro or applied plant sciences or ent or hort or plant brdg or plant path or soil or instr consent",
    "prereq": []
  },
  {
    "uid": "013394",
    "code": "AGRO8605",
    "subject": "AGRO",
    "number": "8605",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Mgmt of Agroecosystems",
    "fullname": "Advanced Management of Agroecosystems",
    "info": "Problem-based learning approach to developing a holistic approach to agroecosystem-based crop management. Field trips combined with classroom discussion and decision-focused case studies. Students conduct research and develop a decision case.  ",
    "prereq": []
  },
  {
    "uid": "014098",
    "code": "AGRO8900",
    "subject": "AGRO",
    "number": "8900",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Discussions",
    "fullname": "Advanced Discussions",
    "info": "Special workshops or courses in applied plant sciences for graduate students only.",
    "prereq": []
  }
]