[
  {
    "uid": "013833",
    "code": "AIR1000",
    "subject": "AIR",
    "number": "1000",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership Laboratory",
    "fullname": "Leadership Laboratory",
    "info": "LLAB events allow cadets to practice the knowledge and skills learned in AS classes and other Practical Military Training (PMT) events. LLAB-accomplished training occurs at three different levels. First, the General Military Course (GMC) cadets gain knowledge and have an opportunity to carry out activities using practical applications. Second, LLAB gives Professional Officer Course (POC) cadets an opportunity to practice their leadership skills to plan, set up, execute, and provide GMCs feedback while executing LLAB. Finally, cadre provide feedback to the POCs on their leadership skills in relation to their plan, set up, execution, and feedback provided to GMCs. As a POC, LLAB is your chance to practice your leadership skills that will help you learn and grow into a Second Lieutenant in today’s Air or Space Force.",
    "prereq": []
  },
  {
    "uid": "013392",
    "code": "AIR1104",
    "subject": "AIR",
    "number": "1104",
    "honors": false,
    "writingIntensive": false,
    "name": "Air Force Heritage & Values I",
    "fullname": "United States Air Force Heritage and Values I",
    "info": "This course provides an introduction to the Air and Space Forces, encouraging students to pursue an AF career or seek additional information to be better informed about the role of the USAF.  The course allows students to examine general aspects of the Department of the Air Force, communication basics, leadership fundamentals, service benefits, and opportunities for officers.  The course lays the foundation for becoming an Air or Space professional by outlining our heritage and values through the study of topics ranging from dress and appearance to customs and courtesies.  As a foundational course, AIR 1104 focuses on the principles of Airmanship.  This course provides students with a knowledge-level understanding of air and space power, from a practical and institutional perspective.  The students will be introduced to the military way of life and gain knowledge on what it means to be an Air or Space professional.",
    "prereq": []
  },
  {
    "uid": "013391",
    "code": "AIR1105",
    "subject": "AIR",
    "number": "1105",
    "honors": false,
    "writingIntensive": false,
    "name": "Air Force Heritage & Values II",
    "fullname": "Air Force Heritage & Values II",
    "info": "This course builds on Air Force Heritage and Values I and continues the introduction of the Air and Space Forces. AIR 1105 provides a more historical perspective such as lessons on war, the US military, AF operations, principles of war, and tenets of airpower. As a whole, this course provides students with a knowledge-level understanding for the employment of air and space power, from a historical and doctrinal perspective. The students will be introduced to the military way of life and gain knowledge on what it means to be an Air or Space professional.",
    "prereq": []
  },
  {
    "uid": "811653",
    "code": "AIR1201",
    "subject": "AIR",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Def",
    "fullname": "Def",
    "info": "",
    "prereq": []
  },
  {
    "uid": "811655",
    "code": "AIR1202",
    "subject": "AIR",
    "number": "1202",
    "honors": false,
    "writingIntensive": false,
    "name": "Def. Derm.",
    "fullname": "Def. Derm.",
    "info": "",
    "prereq": []
  },
  {
    "uid": "013442",
    "code": "AIR1204",
    "subject": "AIR",
    "number": "1204",
    "honors": false,
    "writingIntensive": false,
    "name": "Team & Leader Fundamentals I",
    "fullname": "Team and Leadership Fundamentals I",
    "info": "This course is designed to provide the foundation for both leadership and team building.  You will build on this course every year of your Air Force ROTC career, so it is crucial that you do the readings and homework.  Likewise, all of these lessons will be directly applicable to your field training experience. We will learn about things that don’t pop into your mind when you think of leadership, but they are essential to understanding how good leaders operate.  These topics include listening, followership, and problem solving efficiently.  All of these concepts will be applied in team-building activities and when discussing topics like conflict management with the class. Though the theme of this course is “Team and Leadership Fundamentals,” you are also expected to demonstrate basic verbal and written communication skills at the end of this course--these are skills that can help you in every aspect of your academic, professional, and personal lives.",
    "prereq": []
  },
  {
    "uid": "013499",
    "code": "AIR1205",
    "subject": "AIR",
    "number": "1205",
    "honors": false,
    "writingIntensive": false,
    "name": "Team and Leader Fund II",
    "fullname": "Team and Leadership Fundamentals II",
    "info": "This course builds on Team and Leadership Fundamentals I and provides a fundamental understanding of both leadership and team building. It is imperative that cadets are taught from the beginning that there are many layers to leadership. In this class we will dive deeply into team building and ethical decision making, as these are critical skills to have in the Air Force and beyond. We will use a blend of instruction, class discussion, and activities to fully understand these topics. Cadets in this class this will attend field training in the summer following instruction. The students will apply these leadership perspectives when completing team building activities and discussing things like conflict management. Students should demonstrate basic verbal and written communication skills. Cadets will apply these lessons at Field Training, in the summer after AS 200 school year.",
    "prereq": []
  },
  {
    "uid": "013525",
    "code": "AIR3301",
    "subject": "AIR",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading People & Commo I",
    "fullname": "Leading People and Effective Communication I",
    "info": "This course is designed to build on the leadership fundamentals taught in AS200.  The theme of this year is “Leading People and Effective Communication.” You will have the opportunity to utilize your skills as they begin more of a leadership role in the detachment. The goal is for each of you to have a more in-depth understanding of how to effectively lead people, and this semester will emphasize building core Air Force communication skills and how to navigate change and diversity as a leader.",
    "prereq": []
  },
  {
    "uid": "013750",
    "code": "AIR3302",
    "subject": "AIR",
    "number": "3302",
    "honors": false,
    "writingIntensive": false,
    "name": "Lead People & Commo II",
    "fullname": "Leading People and Effective Communication II",
    "info": "This course is designed to build on the leadership fundamentals taught in AS200. The theme of this year is “Leading People and Effective Communication.” You will have the opportunity to utilize your skills as you transition to more of a leadership role in the detachment. The goal is for each of you to have a more in-depth understanding of how to effectively lead people, and this semester will emphasize leadership theories, personal leadership skills and ethics, and fostering innovation. prereq: 3301 recommended",
    "prereq": {
      "code": "AIR 3301",
      "subject": "AIR",
      "id": "3301"
    }
  },
  {
    "uid": "013759",
    "code": "AIR3401",
    "subject": "AIR",
    "number": "3401",
    "honors": false,
    "writingIntensive": false,
    "name": "Nat Sec Policy & Ldrship I",
    "fullname": "National Security Policy and Leadership Responsibilities I",
    "info": "The AS400 cadet should comprehend the basic elements of national security policy and process.  The student should know basic Department of the Air and Space Force operations as well as understand selected roles of the military in society and current domestic and international issues affecting the military profession. Cadets should understand the responsibility, authority, and functions of a Department of the Air and Space Force commanders and selected provisions of the military justice system.  ",
    "prereq": []
  },
  {
    "uid": "013832",
    "code": "AIR3402",
    "subject": "AIR",
    "number": "3402",
    "honors": false,
    "writingIntensive": false,
    "name": "Nat Sec Policy & Ldrshp II",
    "fullname": "National Security Policy and Leadership Responsibilities II",
    "info": "The AS400 cadet should comprehend the variety of base agencies and programs that support Air and Space Force members. The student should know basic information on officer/enlisted evaluations, financial benefits, the military justice system, and leadership authorities. Cadets should understand what life as a second lieutenant entails and what their initial months in the Air and or Space Force will look like. prereq: 3401 recommended",
    "prereq": {
      "code": "AIR 3401",
      "subject": "AIR",
      "id": "3401"
    }
  }
]