[
  {
    "uid": "793465",
    "code": "AMES1001",
    "subject": "AMES",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian Film and Animation",
    "fullname": "Asian Film and Animation",
    "info": "Various film styles within Asian film/animation production. Ways of analyzing film. Work of 20th-century directors in Asia.",
    "prereq": []
  },
  {
    "uid": "813778",
    "code": "AMES1201",
    "subject": "AMES",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Hero in Asian Cultures",
    "fullname": "Arrow, Fist, and Sword: Conceptions of the Hero in Asian Cultures",
    "info": "Concepts of the \"hero\" in Persian, Indian Chinese, Korean, and Japanese cultures: How did various societies in these countries define the ethos of the \"hero\" and his relationship to the community? How did versions of the hero change over time, and how was the hero redefined in the context of modern nationalism? What part have traditional gender roles played in defining the hero, and is a \"female\" hero possible within these traditions? And how has popular film allowed modern Asian societies to reinterpret their traditional conceptions of the hero? Specific explorations: the Persian hero Rostam in The Book of Kings; Rama and retellings of the Indian Ramayana; Mulan and the Chinese female warrior; the Korean hero Hong Gildong; and the Japanese story of the forty-seven ronin.",
    "prereq": []
  },
  {
    "uid": "797733",
    "code": "AMES1275",
    "subject": "AMES",
    "number": "1275",
    "honors": false,
    "writingIntensive": false,
    "name": "Buddhism in East Asia",
    "fullname": "Buddhism in East Asia",
    "info": "Introduction to traditions of Buddhism in China, Korea, and Japan. Arrival of Buddhism in East Asia, impact on those cultures. Modes of Buddhist transmission/interaction within East Asia. Forms of Buddhist practice. Development of monastic communities. Evolution of Buddhist doctrinal/devotional schools.",
    "prereq": []
  },
  {
    "uid": "797398",
    "code": "AMES1335W",
    "subject": "AMES",
    "number": "1335",
    "honors": false,
    "writingIntensive": true,
    "name": "Chinese Ways Of Living",
    "fullname": "Chinese Ways of Living: Philosophical and Literary Approaches",
    "info": "Premodern Chinese conceptions of good/ethical life. Primary texts. Personal liberation philosophy of Zhuangzi. Han Feizi political legalism. Buddhist popular piety. Chan (Zen) approaches to enlightenment. Ethical/moral uses of poetry. Neo-Confucian ideals of self-cultivation. Modern Confucianism/Buddhism.",
    "prereq": []
  },
  {
    "uid": "796068",
    "code": "AMES1441",
    "subject": "AMES",
    "number": "1441",
    "honors": false,
    "writingIntensive": false,
    "name": "Popular Music in Japan",
    "fullname": "Popular Music and Media in Modern Japan",
    "info": "Traditional forms of Japanese music in relation to social/historical change. Focuses on transformation in modes of music associated with introduction of phonographs/radio. Rise of Japanese recording industry, popular music it produced. Musicology, music history, cultural history, gender studies, postcolonial studies.",
    "prereq": []
  },
  {
    "uid": "826889",
    "code": "AMES1456",
    "subject": "AMES",
    "number": "1456",
    "honors": false,
    "writingIntensive": false,
    "name": "Japanese Film and Animation",
    "fullname": "Japanese Film and Animation",
    "info": "This course offers an introduction to the history of moving images in Japanese film and animation from 1945 to the present as a method for understanding how one nation's film culture has contributed to global political, social, and ecological movements. Students learn how Japanese cinema has been an essential contributor to the development of global film genres and cultures. This course fulfills the Global Perspective because it illustrates the rich history of Asian cinema in a global mediascape. Students will learn how moving images from Asia provide important perspectives on global social, political, and environmental issues. Upon completion of the course, students will be able to use their new skills in film and animation interpretation to analyze media in their daily lives. They will have tools for critical analysis of dominant Western and Hollywood media forms. Students will analyze films from multiple angles, engaging in a multi-optic analysis.",
    "prereq": []
  },
  {
    "uid": "826284",
    "code": "AMES1600",
    "subject": "AMES",
    "number": "1600",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in S. Asian Languages",
    "fullname": "Topics in South Asian Languages",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "818847",
    "code": "AMES1601",
    "subject": "AMES",
    "number": "1601",
    "honors": false,
    "writingIntensive": false,
    "name": "Dress Practices in India",
    "fullname": "Clothing Matters: Dress Practices in India",
    "info": "This interdisciplinary course demonstrates the importance of dress and adornment practices in the formation of collective identities in India. By exploring past and current trends in literature, art, media and performance, it shows how cultural texts construct norms and practices regarding space, body and gender. It also focuses on ways different social groups and communities, through creative acts of (un)dressing in the public sphere, create a complex relationship between structures of power and aesthetics. In addition to highlighting the significance of gender and material culture in Indian literature, this course traces the history of dress practices to offer new perspectives on class, caste, religion and nationalism. The readings will further highlight historical and political events where clothing and accessories become crucial sites for resisting established social order and registering collective protest. Texts will also be complemented with screenings of films to show the rich and complex intersection of dress practices with discourses of tradition and modernity.",
    "prereq": []
  },
  {
    "uid": "825271",
    "code": "AMES1720",
    "subject": "AMES",
    "number": "1720",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Southeast Asian Culture",
    "fullname": "Topics Southeast in Asian Culture",
    "info": "Selected topics in Southeast Asian culture. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "818600",
    "code": "AMES1806",
    "subject": "AMES",
    "number": "1806",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Middle Eastern Cultures",
    "fullname": "Modern Middle Eastern Cultures and Societies",
    "info": "What we commonly and monolithically refer to as “the Middle East” in fact consists of many different individual nation-states, each with their own particular historical trajectory and a combined population of half a billion people encompassing a plethora of religious faiths, political orientations, social formations, and varied identities. This course provides a starting point for comprehending this frequently misunderstood part of the world, the diverse peoples who inhabit it, and the myriad cultures they practice. We will address the various problems we encounter when approaching such an unwieldy concept as “the Middle East,” key moments that have shaped modern Middle Eastern cultures and societies, and examples of how cultural production functions in the context of modern Middle Eastern history and politics.",
    "prereq": []
  },
  {
    "uid": "825281",
    "code": "AMES1836",
    "subject": "AMES",
    "number": "1836",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Middle Eastern Lit",
    "fullname": "Modern Middle Eastern Literature",
    "info": "This course introduces students to the diversity of contemporary Middle Eastern cultures, identities, and histories through readings in modern literature. Reading novels, stories, poetry, and memoirs translated from Arabic, Hebrew, Persian, and Turkish, we will follow a number of key concerns shaping Middle Eastern cultural production: legacies of colonialism and the manner they shaped the relationship between classical and modern literary forms, the ethical and aesthetic challenges of bearing testimony to violence, and the manner literature reflects and subverts racial hierarchies, ethnic divisions, and gender dynamics. These themes will be debated in a range of spaces and contexts: the desert, the city, and the ocean as quintessential environments in times of great social and ecological upheavals; migration flows and refugee identities; the alternating banality and grotesqueness of war; and the formation of intimate, personal relationships. ",
    "prereq": []
  },
  {
    "uid": "790005",
    "code": "AMES1904",
    "subject": "AMES",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule and Course Guide.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "791147",
    "code": "AMES1909W",
    "subject": "AMES",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule and Course Guide.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "791148",
    "code": "AMES1910W",
    "subject": "AMES",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule and Course Guide.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "817648",
    "code": "AMES1911W",
    "subject": "AMES",
    "number": "1911",
    "honors": false,
    "writingIntensive": true,
    "name": "Philosophy & the Martial Arts",
    "fullname": "Mind and Muscle: Philosophy and the Martial Arts",
    "info": "Japanese cultural history functions as an unusual suspect for our investigation of Japanese philosophy. In Japan studies, the term \"philosophy\" is typically thought to indicate Western-influenced philosophy in modern times (the late 19th century onward). Even when its pre-modern precursor is mentioned, discussion tends to focus on Shinto, Buddhism, and Confucianism as its matrices. Far beyond such realms, however, practitioners of artistic techniques--such as martial and performing arts--already engaged themselves in conceptualizing philosophical problems: \"What is nature?\" \"What is our existence?\" \"What is knowledge and how is it generated and transmitted?\" The list goes on, encompassing such topics as \"body\" and \"gender.\" This course explores this phenomenon. We will read Miyamoto Musashi's \"The Book of Five Rings,\" a famous treatise on swordsmanship written by a 17th-century samurai. Anyone interested in the topic and committed to learn is welcome. Aiming at Inclusive Design, it offers multiple options to enhance learning experiences.",
    "prereq": []
  },
  {
    "uid": "817875",
    "code": "AMES1912",
    "subject": "AMES",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Fashioning Islam",
    "fullname": "Fashioning Islam in Literature and Culture",
    "info": "Over the last few decades, the image of the Muslim veil has been variously idealized and politicized around the globe. This excessive (in)visibility has triggered multiple scholarly and public conversations about the relationship between collective faith and individual choice in Islam. The objective of this course is to investigate and go beyond these debates about veiling and unveiling to uncover complex aesthetic and political acts of self-fashioning undertaken by Muslim writers, filmmakers, and artists as they engage with and re-define processes of Islamic piety and global modernity. Through innovative readings of film, literature, and popular culture from a range of geographical sites and historical periods, this course highlights the importance of clothing and adornment in the formation of gendered identities, religious beliefs, and nationalist politics. From the Turkish Fez to the Indian Sari, we will explore how dress practices stitch together structures of power, displays of masculinity, and questions of women's agency in different times and places. These explorations will be guided by an interest in identifying unconventional cultural sites for the staging and un-staging of \"Muslim dress\" and assessing the importance of fashion in stimulating gendered consumption and aesthetics.",
    "prereq": []
  },
  {
    "uid": "825098",
    "code": "AMES1913",
    "subject": "AMES",
    "number": "1913",
    "honors": false,
    "writingIntensive": false,
    "name": "Extinction & Apocalypse",
    "fullname": "End Times: Narrating Extinction & Apocalypse",
    "info": "Stories of the end of the world are nothing new; in classical times they ranged from the various versions of the judgment day in monotheistic religions to the periodic dissolution and regeneration of the universe conceived in Hinduism. While these narratives are still with us, many new visions of the end times have emerged in the context of the specific dangers and anxieties of modernity: nuclear war, famine from overpopulation, pandemics, take-over by robots or artificial intelligence, or just generalized existential despair caused by the loss of meaning and community grounded in tradition. In the 21st century, such fears and narratives have increasingly focused on various scenarios of how climate chaos already is speeding the world's sixth mass extinction of living species - meaning there are countless mini-apocalypses happening all around us from the perspective of the Earth's biosphere as a whole - while also threatening the possible extinction of our own species.This course will explore narratives of extinction and apocalypse from a global, comparative perspective. Each week we will watch a  film, often a challenging, experimental one - including films from both East and West - and we will accompany them with diverse types of readings from dystopic sci-fi stories to nonfiction bestsellers to academic studies of how the threat of extinction plays out in other primate species besides humans. We will ask how such narratives articulate specific fears and anxieties and discuss whether and how they make a cultural intervention that could actually change human behavior to make extinction less (or more) likely. What exactly does it mean to envision the extinction of our species or the collapse of human society, and why do people seek out such narratives and presumably derive some useful ideas from them?",
    "prereq": []
  },
  {
    "uid": "825099",
    "code": "AMES1914",
    "subject": "AMES",
    "number": "1914",
    "honors": false,
    "writingIntensive": false,
    "name": "Bollywood Blockbusters",
    "fullname": "Bollywood Blockbusters and Beyond",
    "info": "Why do people sing and dance around in Bollywood films? How is Bollywood masala different from Hollywood cinema? What are the distinct features of Indian cinema? This course provides a historical and critical understanding of these questions. By looking at various cinematic cultures in Bollywood and other Indian film industries, we will study how cinema as an art form and a medium of entertainment has evolved during the last one hundred years. We will also specifically study the characteristics of Bollywood genres like social melodrama, musicals, horror and action. Our discussions will be supplemented with screenings of a number of Bollywood blockbusters and a few lesser-known films.",
    "prereq": []
  },
  {
    "uid": "825745",
    "code": "AMES1915",
    "subject": "AMES",
    "number": "1915",
    "honors": false,
    "writingIntensive": false,
    "name": "Females in All-Male Jpns Music",
    "fullname": "Objections to 'Members Only': Female Participants in All-Male Classical Music in Japan",
    "info": "\"Membership\" is a peculiar thing. While the matter is certainly an issue of critical moment here and now, and to an intense degree at that, at no place nor time in human history is it totally irrelevant. For, just as with many animate beings, humans have lived in a way in which the action of \"grouping\" is omnipresent. On the level of both theory and practice, the notions and actions of classification of people into categories have been deeply ingrained in how many civilizations have flourished across time and space. The criteria of such classification are not only myriad but also diverse with no single governing principle (e.g., ancestry, birthplace, race and ethnicity, sex and gender, sexuality, social standing such as class and rank, religion, and so on and so forth). Groups thus formed--be they country, nations, clans, circles, communities, men, women, and the like--are also heavily varied and respective definitions and expectations of \"members,\" and \"non members\" for that matter, are wide-ranging. Using a specific case study from performing arts in Japan (described below), this seminar helps introduce fresh\"man\" students at the U to critical thinking in the humanities, by encouraging them to grapple with such a significant and formidable topic as membership, which will provide them with a methodological tool and contemplation ability that promises to be useful throughout (and hopefully beyond) their education at the U. Two key elements of such training are \"intersection-ness\" and \"self reflectiveness.\" Relying on \"intersectionality\" (i.e., a well-known concept established in the context of black feminism signifying a hub of various interlocking intersections in a system), the former is to remind students of the aforementioned diverse nature of grouping. The latter is a caution that the seminar is not merely for us to gather information about the performing arts in question, but to critically contemplate the phenomenon with the understanding that we are not any pure, perfect, unrelated observer with an imaginary objective perspective. To these purposes, the seminar utilizes two pedagogical methods: scaffolding (small multiple tasks to achieve a semester-long project) and group activities for stimulation and mutual support. The performing arts in Japan that the seminar uses as a case study is gidayû music. The audio component of the four-century-old puppet theater in Japan now known as bunraku, gidayû is usually if not always conducted by two musicians: string-music played by an instrumentalist and the entire lines of all characters on stage narrated solo by a single chanter, who also sings descriptive recitation. Bunraku is an all-male theater, and gidayû all-male theatrical vocal-music. Female performers have long been playing gidayû as stand-alone music, however, almost always under men's names and sometimes in men's clothing. In premodern times (through 1867), when females' were prohibited from participating in performing arts since 1629-proclamations, female gidayû players frequently endured such drastic ordeals as bans, property-confiscation, and incarceration imposed by samurai authorities. In modern times (from 1868 to date), these female performers were no longer subject to such physically violent sentence, but epistemological turmoil they faced was no less radical. The seminar will pay attention to these female musicians. In addition, since the instructor knows some contemporary female gidayû musicians in person, the seminar might have an opportunity to learn their stories from themselves, possibly using such technology as Zoom (contingent).",
    "prereq": []
  },
  {
    "uid": "826328",
    "code": "AMES1916",
    "subject": "AMES",
    "number": "1916",
    "honors": false,
    "writingIntensive": false,
    "name": "Doing Genders on Page & Stage",
    "fullname": "Doing Genders on Page and Stage",
    "info": "An internationally renowned piece, The Tale of Genji was produced in the Classical Era in Japan when high-ranking ladies-in-waiting produced literary arts in volumes. It was during the same time when a male middle-class aristocrat, who wrote a diary literature assuming a female identity, is said to have established the definition of Japanese poetry by associating it with femininity. When it comes to theater, all four classical theaters in Japan--noh, kyogen, kabuki, and bunraku-puppet theaters--have been \"all-male\" theaters. Japanese theater would later see the birth of an all-female revue, Takarazuka. This seminar will utilize these gender-loaded cultural traditions as the venue of our contemplating the mechanisms of gendering: How we do genders. If gender does not merely mirror biology, as the greatly criticized essentialism in gender studies revealed, and if gender is not simply bestowed upon us by society or culture, as the debunked constructionism in the said context conceded, then, how have humans done genders diversely but imperatively, and precariously yet creatively?",
    "prereq": []
  },
  {
    "uid": "793709",
    "code": "AMES3001",
    "subject": "AMES",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Concepts:Asian&MidEast Studies",
    "fullname": "Concepts in Asian and Middle Eastern Studies",
    "info": "Introduction to questions of modernity in Asia and the Middle East and foundational course for the major and the minor in Asian and Middle Eastern Studies. Reflecting the range of geography covered by the department, it will cover topics related to the Middle East, South Asia, and East Asia, and highlight connections among them. Our primary goal is to become versed in a number of key concepts and issues that are essential to being a successful student in upper-division AMES courses. Furthermore, we will engage with theoretical, literary, and filmic texts concerning various regions of the Asian continent and develop the ability to respond to major questions in Asian and Middle Eastern Studies through the close reading of primary and secondary materials and the practical employment of key terms and concepts. There will be a strong focus on proper definitions and historical contextualization, and on analytical application and interpretation.",
    "prereq": []
  },
  {
    "uid": "793863",
    "code": "AMES3014W",
    "subject": "AMES",
    "number": "3014",
    "honors": false,
    "writingIntensive": true,
    "name": "Art of India",
    "fullname": "Art of India",
    "info": "Indian sculpture, architecture, and painting from the prehistoric Indus Valley civilization to the present day.",
    "prereq": []
  },
  {
    "uid": "790060",
    "code": "AMES3220",
    "subject": "AMES",
    "number": "3220",
    "honors": false,
    "writingIntensive": false,
    "name": "Study Abroad Asian Culture Top",
    "fullname": "Study Abroad Topics in Asian Culture",
    "info": "Part of University of Minnesota sponsored study abroad experience.",
    "prereq": []
  },
  {
    "uid": "796918",
    "code": "AMES3232W",
    "subject": "AMES",
    "number": "3232",
    "honors": false,
    "writingIntensive": true,
    "name": "Short Poetry in China & Japan",
    "fullname": "\"Short\" Poetry in China and Japan",
    "info": "Short poetic forms of China and Japan. Chinese quatrains and octets. Japanese tanka and haiku. Translations by modern poets. Texts in original languages (with provided glosses). Art of translation. Translators' conceptions of East Asian 'exoticism.'",
    "prereq": []
  },
  {
    "uid": "817507",
    "code": "AMES3250",
    "subject": "AMES",
    "number": "3250",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Asian Film & Media",
    "fullname": "Topics in Asian Film and Media",
    "info": "Examines theme, problem, region, style or filmmaker in Asian cinema. Focuses on (geo)political and socioeconomic contexts in relation to artistic and interpretive frameworks.",
    "prereq": []
  },
  {
    "uid": "825282",
    "code": "AMES3256",
    "subject": "AMES",
    "number": "3256",
    "honors": false,
    "writingIntensive": false,
    "name": "Graphic Novels",
    "fullname": "Graphic Novels: Conflict, Peace and Protest",
    "info": "This course will examine a particular medium—graphic novel—which is inherently rich in visual, narrative, and linguistic components. The materials chosen for this course are driven by wars and conflicts in the following four regions: East Asia, South Asia, Southeast Asia, and the Middle East. Through these selected works, we will explore histories of political conflicts, state violence, anticipation for peace as well as understandings and praxes of protest in various forms, namely, social movements; mourning; remembrance; art making; and writing. Given the nature of conflict that always goes above and beyond the question of nation-state, this course will also discuss its amplification to the question of migration, refugee crisis, displacement, and multi-generational trauma among diasporic subjects. Located at the intersection of conflict, peace, and protest, this course not only introduces students to historical processes and complexities of these conflicts—both from the national and international points of view—but also challenges students to question the potentials of graphic novels in mediating these histories and discourses around human rights for readers. Finally, this class explores ways in which we can engage with each other via our shared history and vulnerability, and questions whether peace and resolution promised to our generation via the discourse of human rights are, or will ever be, attainable.",
    "prereq": []
  },
  {
    "uid": "804890",
    "code": "AMES3261W",
    "subject": "AMES",
    "number": "3261",
    "honors": false,
    "writingIntensive": true,
    "name": "Writing in East Asian Cultures",
    "fullname": "Writing (in) East Asian Cultures: From Oracle Bones to Tattoos",
    "info": "History, materiality, practice of writing Chinese characters (hanzi/kanji/hanja) in cultural venues in East Asia, including contemporary society. Sites/practices where writing takes on high cultural value. Oracle bone writing, calligraphy, advertisements, tattooing. Identity construction, nationalism.prereq: One year in Chinese or Japanese or Korean language or similar exposure to East Asian writing systems",
    "prereq": []
  },
  {
    "uid": "797399",
    "code": "AMES3265W",
    "subject": "AMES",
    "number": "3265",
    "honors": false,
    "writingIntensive": true,
    "name": "The Fantastic in East Asia",
    "fullname": "The Fantastic in East Asia: Ghosts, Foxes, and the Alien",
    "info": "How the strange/alien is constructed in premodern Chinese/Japanese literature. East Asian theories of the strange and their role in the classical tale, through the works of Pu Songling, Edo-era storytellers, and others. Role of Buddhist cosmology and salvation.prereq: Some coursework in East Asia recommended",
    "prereq": []
  },
  {
    "uid": "796631",
    "code": "AMES3270",
    "subject": "AMES",
    "number": "3270",
    "honors": false,
    "writingIntensive": false,
    "name": "Service in the Asian Community",
    "fullname": "Service Learning in the Asian Community",
    "info": "Students engage in service learning among members of local Asian communities. Readings, mentoring, English language instruction. Other activities as deemed appropriate by instructor and sponsoring agency.",
    "prereq": []
  },
  {
    "uid": "802668",
    "code": "AMES3276",
    "subject": "AMES",
    "number": "3276",
    "honors": false,
    "writingIntensive": false,
    "name": "Hmong History Across the Globe",
    "fullname": "Hmong History Across the Globe",
    "info": "Hmong interaction with lowland Southeast Asian states (Laos, Vietnam) and Western colonial powers (French, American) since 19th century. Changes to religious, social, political, and gender institutions. Aspirations for political autonomy.",
    "prereq": []
  },
  {
    "uid": "790853",
    "code": "AMES3300",
    "subject": "AMES",
    "number": "3300",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Chinese Literature",
    "fullname": "Topics in Chinese Literature",
    "info": "Selected topics in Chinese literature. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "795411",
    "code": "AMES3333",
    "subject": "AMES",
    "number": "3333",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender/Sexuality in Chin Lit",
    "fullname": "Gender and Sexuality in Traditional Chinese Literature",
    "info": "How writers have written about gender in traditional China. Traditional Chinese attitudes toward sexuality. Poetry from early period, \"stories of the strange,\" later fiction/drama. Transformation of these themes in popular cinema.",
    "prereq": []
  },
  {
    "uid": "806665",
    "code": "AMES3334",
    "subject": "AMES",
    "number": "3334",
    "honors": false,
    "writingIntensive": false,
    "name": "Voices from Ancient China",
    "fullname": "Voices from Ancient China: The Book of Songs and The Songs of the South",
    "info": "Beginnings of Chinese culture in the songs, poems, and stories from two important classics, \"The Book of Songs\" and \"Songs of the South.\" \"Voices\" from these early texts, including love songs, prayers to the ancestors, soldier complaints, and a poet's fantasies.",
    "prereq": []
  },
  {
    "uid": "798713",
    "code": "AMES3336",
    "subject": "AMES",
    "number": "3336",
    "honors": false,
    "writingIntensive": false,
    "name": "Revol & Modern Chinese Lit",
    "fullname": "Revolution and Modernity in Chinese Literature and Culture",
    "info": "Introduction to modern Chinese literature, visual culture, and critical thought from beginning of 20th century to end of Mao era. Examples of literature/culture, parallel readings of Chinese critical essays. Readings are in English translation.",
    "prereq": []
  },
  {
    "uid": "797282",
    "code": "AMES3337",
    "subject": "AMES",
    "number": "3337",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Chinese Lit.",
    "fullname": "Contemporary Chinese Literature and Popular Culture",
    "info": "Contemporary Chinese literature, popular culture. End of Mao era to present. Creative results of China's \"opening and reform.\" Commercialization and globalization of culture. Literature, visual culture, and popular music.",
    "prereq": []
  },
  {
    "uid": "817944",
    "code": "AMES3351",
    "subject": "AMES",
    "number": "3351",
    "honors": false,
    "writingIntensive": false,
    "name": "Martial Arts Chinese Lit/Film",
    "fullname": "Martial Arts in Chinese Literature and Film",
    "info": "Investigation of the martial arts motif in Chinese literature and its cinematic descendants. Class materials include ancient stories about sage kings, assassin-retainers, lady knights-errant; recent blockbusters such as \\\"Crouching Tiger, Hidden Dragon,\\\" \\\"Hero,\\\" and \\\"Kung Fu Hustle;\\\" the careers and stardoms of Bruce Lee, Jet Li, and Jackie chan; and American animated films featuring martial arts themes, such as \\\"Mulan\\\" and the \\\"Kung Fu Panda\\\" series. While reflecting cultural transformations across history, these examples manifest a consistent poetics of emptiness, due to the genre's thematic preoccupation with resistance and transcendence, as well as its roots in Confucian-Daoist-Buddhist philosophies. In these regards, the martial arts genre, other than being a pop culture phenomenon, offers a meaningful gateway toward rediscovering the Chinese tradition's cosmopolitan potentials.",
    "prereq": []
  },
  {
    "uid": "789685",
    "code": "AMES3356W",
    "subject": "AMES",
    "number": "3356",
    "honors": false,
    "writingIntensive": true,
    "name": "Chinese Film",
    "fullname": "Chinese Film",
    "info": "Survey of Chinese cinema from China (PRC), Taiwan, and Hong Kong. Emphasizes discussion/comparison of global, social, economic, sexual, gender, psychological, and other themes as represented through film.",
    "prereq": []
  },
  {
    "uid": "816871",
    "code": "AMES3357",
    "subject": "AMES",
    "number": "3357",
    "honors": false,
    "writingIntensive": false,
    "name": "Taiwan Film",
    "fullname": "Taiwan Film",
    "info": "This course examines the history of Taiwan film from the Japanese colonial period to the early 21st century along with the increased (though still quite limited) availability of pre-1980s films on DVD with English subtitles. We will cover topics such as dialect films; Nationalist propaganda; \"healthy realism;\" connections with the Hong Kong, Hollywood, and mainland Chinese film industries; the aesthetics of New Taiwan Cinema; the imagination of Taiwan as a postcolonial Southeast Asian rather than East Asian or Chinese polity; and the battle for commercial viability in the global film market. Throughout the course, we will closely analyze cinematic form and narrative structure in addition to broader issues of nation, society, politics, and ecology.",
    "prereq": []
  },
  {
    "uid": "797734",
    "code": "AMES3361W",
    "subject": "AMES",
    "number": "3361",
    "honors": false,
    "writingIntensive": true,
    "name": "Representations of Taiwan",
    "fullname": "Maps, Pictures, and Writing in the Representation of Taiwan",
    "info": "How visual/written media is used to form identity in representing people, places, history of Taiwan. Historical/contemporary contexts.",
    "prereq": []
  },
  {
    "uid": "817945",
    "code": "AMES3362",
    "subject": "AMES",
    "number": "3362",
    "honors": false,
    "writingIntensive": false,
    "name": "Women Writers Chinese History",
    "fullname": "Women Writers in Chinese History",
    "info": "This class surveys the surprisingly diverse and vibrant tradition of women writers in Chinese cultural history, which during its long imperial period (221 B.C.E.-1911 C.E.) was dominated by a male-centered cultural order. The class situates individual women writers within their specific historical settings and larger cultural backdrops, thus introducing students to literary themes, gender dynamics, and conditions of cultural production in Chinese history. The class also addresses complex shifts in female writing and its social presence across the premodern-modern transition. Taught in English and no prerequisites.",
    "prereq": []
  },
  {
    "uid": "797426",
    "code": "AMES3363",
    "subject": "AMES",
    "number": "3363",
    "honors": false,
    "writingIntensive": false,
    "name": "Imagined Worlds in China",
    "fullname": "Imagined Worlds in Ming Qing China",
    "info": "Imaginative worlds (fictional, religious, erotic) that were available to men and women in China of the Ming and Qing dynasties. Fiction, other texts, visual materials. Ways in which texts were produced/distributed.",
    "prereq": []
  },
  {
    "uid": "797667",
    "code": "AMES3371",
    "subject": "AMES",
    "number": "3371",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Cities and Urban Life",
    "fullname": "History of Chinese Cities and Urban Life",
    "info": "Introduction to traditional Chinese cities, modern transformation. Ideal city plan in Confucian classics compared with physical layout of major cities. Models about Chinese cities, influence of models on our understanding of Chinese history/society.",
    "prereq": []
  },
  {
    "uid": "802669",
    "code": "AMES3372",
    "subject": "AMES",
    "number": "3372",
    "honors": false,
    "writingIntensive": false,
    "name": "Women and Family in China",
    "fullname": "History of Women and Family in China, 1600-2000",
    "info": "Marriage/family life, foot binding, cult of women's chastity. Women in nationalist/communist revolutions. Gender relations in post-socialist China. Effect of ideologies (Confucianism, nationalism, socialism) on women/family life. Differences between ideology and social practice.",
    "prereq": []
  },
  {
    "uid": "797283",
    "code": "AMES3373",
    "subject": "AMES",
    "number": "3373",
    "honors": false,
    "writingIntensive": false,
    "name": "Religion in Imperial China",
    "fullname": "Religion and Society in Imperial China",
    "info": "Varieties of religious experience in imperial China. Religion as lived practices. Textual traditions. Buddhism, Daoism, Confucianism, relations among them. Western missionary enterprise in China.",
    "prereq": []
  },
  {
    "uid": "818848",
    "code": "AMES3374",
    "subject": "AMES",
    "number": "3374",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Cultural History",
    "fullname": "Patterns in Chinese Cultural History",
    "info": "A survey course of Chinese cultural history across its long evolution. It connects historical and cultural knowledge to the Chinese literary and intellectual traditions, and unveils larger trends in the developments of Chinese culture and society during the pre-20th-century period and across the tradition-modern divide. Taught in English and no prerequisites.",
    "prereq": []
  },
  {
    "uid": "801683",
    "code": "AMES3377",
    "subject": "AMES",
    "number": "3377",
    "honors": false,
    "writingIntensive": false,
    "name": "Buddhism in China",
    "fullname": "A Thousand Years of Buddhism in China: Beliefs, Practices, and Culture",
    "info": "Buddhism in China, 4th-15th centuries. Introduction of Buddhism to China. Relevance of Buddhist teaching to indigenous thought (e.g., Taoism, Confucianism). Major \"schools\": Tiantai, Huayan, Chan/Zen, etc.. Cultural activities of monks, nuns, and lay believers.",
    "prereq": []
  },
  {
    "uid": "790855",
    "code": "AMES3400",
    "subject": "AMES",
    "number": "3400",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Japanese Literature",
    "fullname": "Topics in Japanese Literature",
    "info": "Selected topics in Japanese literature. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "790856",
    "code": "AMES3420",
    "subject": "AMES",
    "number": "3420",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Japanese Culture",
    "fullname": "Topics in Japanese Culture",
    "info": "Selected topics in Japanese culture. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "011109",
    "code": "AMES3433",
    "subject": "AMES",
    "number": "3433",
    "honors": false,
    "writingIntensive": false,
    "name": "Trad Japanese Lit in Trans",
    "fullname": "Traditional Japanese Literature in Translation",
    "info": "Survey of texts in different genres, from 8th to early 19th centuries, with attention to issues such as \"national\" identity, gender/sexuality, authorship, popular culture. No knowledge of Japanese necessary.",
    "prereq": []
  },
  {
    "uid": "011199",
    "code": "AMES3436",
    "subject": "AMES",
    "number": "3436",
    "honors": false,
    "writingIntensive": false,
    "name": "Postwar Japanese Lit in Transl",
    "fullname": "Postwar Japanese Literature in Translation",
    "info": "This is an introductory survey of modern Japanese literature and its role in the postwar  debates around Japanese culture, aesthetics, politics, and environment. Beginning with the occupation of Japan by the US military and ending with the 2020 Tokyo Olympics (postponed by a global pandemic), students will analyze the main movements in postwar Japanese literary production and the core issues featured in this literature. We will explore national genres in Japan, their premodern precursors, and postmodern manifestations. The course has no prerequisite and assumes no prior knowledge of Japanese cultures or experience with literary analysis. All materials, lectures, and discussions are in English.",
    "prereq": []
  },
  {
    "uid": "011206",
    "code": "AMES3437",
    "subject": "AMES",
    "number": "3437",
    "honors": false,
    "writingIntensive": false,
    "name": "The Japanese Novel",
    "fullname": "The Japanese Novel",
    "info": "Survey of the principal authors of the period spanning Japan's opening to the West (1860s) to World War II. Writers include Natsume Soseki, Shiga Naoya, Kawabata Yasunari, Edogawa Rampo, Hayashi Fumiko, and Tanizaki Junichiro.",
    "prereq": []
  },
  {
    "uid": "011110",
    "code": "AMES3441W",
    "subject": "AMES",
    "number": "3441",
    "honors": false,
    "writingIntensive": true,
    "name": "Japanese Theater",
    "fullname": "Japanese Theater",
    "info": "Japanese performance traditions. Emphasizes noh, kabuki, and bunraku in their literary/cultural contexts. Relationship between these pre-modern traditions and modern theatrical forms (e.g., Takarazuka Revue).",
    "prereq": []
  },
  {
    "uid": "818203",
    "code": "AMES3442",
    "subject": "AMES",
    "number": "3442",
    "honors": false,
    "writingIntensive": false,
    "name": "Performing Arts in Japan",
    "fullname": "Performing Arts in Japan and Their Cultural Backgrounds",
    "info": "Taught entirely overseas in Japan, this instructor-led Learning Abroad Center course engages a diverse and representational range of Japanese theatrical traditions including but not limited to Noh, Kyogen, Bunraku, Kabuki, Takarazuka, and Butoh. We explore the links among medieval traditions of \"performance of offering\" to Buddhist and Shinto deities, entertainment of elite audiences, and new theatrical work based on anime, manga, and martial arts. We will experience, firsthand and in person, Japanese performing arts in their original cultural locations, such as Tokyo, Nara, and Osaka. This course consists of class discussions and lecture, attending theatrical productions at playhouses and vaudeville theaters, special lectures by prominent guest speakers, and observation of several kinds of \"performance of offering\" at temples and shrines. As a winter-term course, our seminar takes place during an exciting time of year for this topic: we begin with \"new-year count down\" (\"joya no kane\") at a temple where the giant bell rings 108 times. In addition, playhouses will be filled with a special, new-year atmosphere, thus offering a unique opportunity to learn about New Year celebrations in Japan and about the Japanese performing arts highlighting these celebrations.",
    "prereq": []
  },
  {
    "uid": "011207",
    "code": "AMES3456",
    "subject": "AMES",
    "number": "3456",
    "honors": false,
    "writingIntensive": false,
    "name": "Japanese Film and Animation",
    "fullname": "Japanese Film and Animation",
    "info": "This course offers an introduction to the history of moving images in Japanese film and animation from 1945 to the present as a method for understanding how one nation's film culture has contributed to global political, social, and ecological movements. Students learn how Japanese cinema has been an essential contributor to the development of global film genres and cultures. This course fulfills the Global Perspective because it illustrates the rich history of Asian cinema in a global mediascape. Students will learn how moving images from Asia provide important perspectives on global social, political, and environmental issues. Upon completion of the course, students will be able to use their new skills in film and animation interpretation to analyze media in their daily lives. They will have tools for critical analysis of dominant Western and Hollywood media forms.Students will analyze films from multiple angles, engaging in a multi-optic analysis.",
    "prereq": []
  },
  {
    "uid": "796785",
    "code": "AMES3457",
    "subject": "AMES",
    "number": "3457",
    "honors": false,
    "writingIntensive": false,
    "name": "War and Japanese Culture",
    "fullname": "War and Peace in Japan Through Popular Culture",
    "info": "War-related issues in Japan. Animation films, comics from 1940s to 1990s. Mobilization of culture for WWII. Conflict between constitutional pacifism/national security. Japan's role in cold war/post-cold war worlds. ",
    "prereq": []
  },
  {
    "uid": "815464",
    "code": "AMES3458",
    "subject": "AMES",
    "number": "3458",
    "honors": false,
    "writingIntensive": false,
    "name": "Japanese Animation",
    "fullname": "Japanese Animation",
    "info": "This course takes up the technologies, genres, and themes of Japanese animation. By examining the works of important directors alongside media theories and other related writings, the course will cover not only the major genres and recurrent themes of anime, but also the cultural and critical contexts for apprehending anime.",
    "prereq": []
  },
  {
    "uid": "796142",
    "code": "AMES3466",
    "subject": "AMES",
    "number": "3466",
    "honors": false,
    "writingIntensive": false,
    "name": "Japan Culture / Global Context",
    "fullname": "Japanese Popular Culture in a Global Context",
    "info": "What happens when one nation's popular culture begins to permeate others. Japanimation, manga, fashion, and music. Relationship of popular culture to nation(alism), ethnicity, gender, and identity. Effects of popular culture on consumers, socialization. Ways that consumption affects us personally.",
    "prereq": []
  },
  {
    "uid": "816404",
    "code": "AMES3467",
    "subject": "AMES",
    "number": "3467",
    "honors": false,
    "writingIntensive": false,
    "name": "Science Fiction, Empire, Japan",
    "fullname": "Science Fiction, Empire, Japan",
    "info": "Premised on its historical position as a non-Western colonial empire, this course takes up Japan as a focal point for examining the relations between science fiction and imperialism. Discussions center on the colonial underpinnings of Japanese science fiction and how particular motifs (future war, time travel, posthuman bodies) critically interrogate this history.",
    "prereq": []
  },
  {
    "uid": "811421",
    "code": "AMES3468",
    "subject": "AMES",
    "number": "3468",
    "honors": false,
    "writingIntensive": false,
    "name": "Enviromnt Tech & Cult in Japan",
    "fullname": "Environment, Technology and Culture in Modern Japan",
    "info": "Read/view historical, literary, visual texts to discover guiding ideas about nature, environment, technology use in Japan. No prior knowledge of Japan is necessary.",
    "prereq": []
  },
  {
    "uid": "818699",
    "code": "AMES3471",
    "subject": "AMES",
    "number": "3471",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Japanese Religions",
    "fullname": "Introduction to Japanese Religions",
    "info": "An introduction to the development of different forms of religious practice in Japan over the past fourteen hundred years. A survey of Japanese religions and their development will be combined with specific examples (past and present) that demonstrate the way that religious belief has manifested itself in various forms of cultural practice.",
    "prereq": []
  },
  {
    "uid": "808578",
    "code": "AMES3478",
    "subject": "AMES",
    "number": "3478",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Japan, Meiji-Present",
    "fullname": "Modern Japan, Meiji to the Present (1868-2000)",
    "info": "Japan's development as industrial/imperial power after Meiji Restoration of 1868. Political developments in Taisho years. Militarization/mobilization for war in 1930s. Japan's war with China, Pacific War with US. American Occupation. Postwar economic recovery, high growth. Changing political/popular culture of 1980s, '90s.",
    "prereq": []
  },
  {
    "uid": "790857",
    "code": "AMES3500",
    "subject": "AMES",
    "number": "3500",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Korean Literature",
    "fullname": "Topics in Korean Literature",
    "info": "Selected topics in Korean literature. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "790858",
    "code": "AMES3520",
    "subject": "AMES",
    "number": "3520",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Korean Culture",
    "fullname": "Topics in Korean Culture",
    "info": "Selected topics in Korean culture. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "806565",
    "code": "AMES3536",
    "subject": "AMES",
    "number": "3536",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Korean Literature",
    "fullname": "Modern Korean Literature",
    "info": "Modern Korean literature in English translation from the colonial period until the 1990s. Read literary texts critically, using genre categories, theories of narrative voice, different understandings of modern literary subjectivity, and historical contextualization. ",
    "prereq": []
  },
  {
    "uid": "806970",
    "code": "AMES3556",
    "subject": "AMES",
    "number": "3556",
    "honors": false,
    "writingIntensive": false,
    "name": "Korean Film and Media",
    "fullname": "Korean Film and Media",
    "info": "This course is an introduction to Korean film from the Japanese colonial period (1910-1945) to the present day. We discuss the emergence of the Korean film industry under the conditions of colonial modernity and the various political pressures put on film production in South Korea until the 1990s. We will then turn to the last twenty years, during which South Korean film and television have experienced a boom in popularity in East Asia and globally. Throughout, we will focus on the formal and technical aspects of film, representations of history and historical memory, genre borrowing and genre mixing, and the relationships between art-house and culture industry productions.",
    "prereq": []
  },
  {
    "uid": "820493",
    "code": "AMES3558",
    "subject": "AMES",
    "number": "3558",
    "honors": false,
    "writingIntensive": false,
    "name": "Korean Popular Culture",
    "fullname": "Korean Popular Culture",
    "info": "This course is an introduction to contemporary Korean popular culture, with a focus on television, video, and online media. We will learn how to think critically about a variety of popular culture phenomena, including dramas, variety shows, comedy performances, video games, food-related programs and videos, political satire and commentary, and music videos. By engaging with the academic scholarship on popular culture, we will learn how to analyze the stories, images, and sounds of Korean popular culture, while situating these within their various cultural and social contexts. Topics covered will include the Korean Wave (hallyu), the culture industry, digital platforms and economies, celebrity, fandom, and globalization. Attention will be given both to the local conditions of cultural production and the transnational influences of Korean media on East and Southeast Asia, as well as Europe and the Americas.",
    "prereq": []
  },
  {
    "uid": "816294",
    "code": "AMES3576",
    "subject": "AMES",
    "number": "3576",
    "honors": false,
    "writingIntensive": false,
    "name": "Lang & Society of Two Koreas",
    "fullname": "Language & Society of the Two Koreas",
    "info": "This course is designed to offer an introduction and contrastive analysis of the language and society of the two Koreas; the Republic of Korea (better known as South Korea) and the Democratic Peoples Republic of Korea (better known as North Korea). This course will introduce the growing divide of the past 70 years between North and South Korea in the areas of language, society, and culture.",
    "prereq": []
  },
  {
    "uid": "814241",
    "code": "AMES3586",
    "subject": "AMES",
    "number": "3586",
    "honors": false,
    "writingIntensive": false,
    "name": "Cold War Cultures in Korea",
    "fullname": "Cold War Cultures in Korea",
    "info": "In this course we will analyze the Cold War (1945-1989) not only as an era in geopolitics, but also as a historical period marked by specific cultural and artistic forms. We focus on the Korean peninsula, looking closely at the literary and film cultures of both South Korea and North Korea. We discuss how the global conflict between U.S.-centered and Soviet-centered societies affected the politics, culture, and geography of Korea between 1945 and 1989, treating the division of Korea as an exemplary case extending from the origins of the Cold War to the present. We span the Cold War divide to compare the culture and politics of the South and the North through various cultural forms, including anti-communist and socialist realist films, biography and autobiography, fiction, and political discourse. We also discuss the legacy of the Cold War in contemporary culture and in the continued existence of two states on the Korean peninsula. The primary purpose is to be able to analyze post-1945 Korean cultures in both their locality and as significant aspects of the global Cold War era.",
    "prereq": []
  },
  {
    "uid": "825283",
    "code": "AMES3587",
    "subject": "AMES",
    "number": "3587",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Affairs in Two Koreas",
    "fullname": "Current Affairs and Everyday Life in Two Koreas",
    "info": "This course is designed to offer an in-depth look at current affairs and social, cultural, and economic interactions that are influenced by everyday hierarchical structures in both North and South Korea. This course will specifically deal with issues that affect individuals and small groups in the two Koreas rather than focusing on issues at the state and international level. The course will take macro-level issues such as hierarchical structures that are remnant of the feudal era and examine their impact at the micro-level for people in the two Koreas. The two Koreas share centuries upon centuries of common socio-cultural structures and ways of being that, despite the recent separation, continue to exert a powerful influence on individuals' daily life even though they may inhabit drastically different political and economic states.",
    "prereq": []
  },
  {
    "uid": "818609",
    "code": "AMES3620",
    "subject": "AMES",
    "number": "3620",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in South Asian Culture",
    "fullname": "Topics in South Asian Culture",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "798638",
    "code": "AMES3632",
    "subject": "AMES",
    "number": "3632",
    "honors": false,
    "writingIntensive": false,
    "name": "Islamic Epic and Romance",
    "fullname": "Readings in Indian Epic Traditions:  Islamic Epic and Romance",
    "info": "Literary traditions of epic/romance that arose in Islamic societies of Central/Southern Asia. How genres of love/war interacted with political, religious, and cultural authorities over centuries. Virtue, constructions of fantasy/understandings of reality in tales of heroes, beautiful princesses, evil kings, fairies, Jinns, magicians, and tricky secret agents.",
    "prereq": []
  },
  {
    "uid": "818399",
    "code": "AMES3636",
    "subject": "AMES",
    "number": "3636",
    "honors": false,
    "writingIntensive": false,
    "name": "South Asian Women Writers",
    "fullname": "South Asian Women Writers",
    "info": "Survey of South Asian women's writing, from early years of nationalist movement to present. Contemporary writing includes works by immigrant writers. Concerns, arguments, and nuances in works of women writing in South Asia and diaspora.",
    "prereq": []
  },
  {
    "uid": "796139",
    "code": "AMES3637W",
    "subject": "AMES",
    "number": "3637",
    "honors": false,
    "writingIntensive": true,
    "name": "Modern Indian Literature",
    "fullname": "Modern Indian Literature",
    "info": "Survey of 20th century literature from South Asian countries, including India, Pakistan, and Sri Lanka. All readings in English. Focuses on colonialism, post-colonialism, power, and representation.",
    "prereq": []
  },
  {
    "uid": "798899",
    "code": "AMES3638",
    "subject": "AMES",
    "number": "3638",
    "honors": false,
    "writingIntensive": false,
    "name": "Islam/Modernity in South Asia",
    "fullname": "Islam and Modernity in South Asia",
    "info": "This course explores the multiple genealogical trajectories of Islamic thought in South Asia through the varied lens of its literary traditions. For centuries, literature has remained an important site for the expression of Islamic identity and its interaction with the larger history of the subcontinent. Muslim writers have traversed diverse domains of human experience through multiple genres: while poetry has been a widely celebrated genre for the expression of private love, drama has emerged as a crucial site for public politics and activism. In this course, students will read texts that have circulated across South Asia and interpret them in relation to enduring questions about power, justice, identity, community and love (both human and divine) in Islam. Reading a wide array of works from diverse temporal and spatial locations, this course examines how the aesthetic and discursive world of South Asia provides a terrain on which the Islamic \"socius\" of the region has come to define itself in a unique manner. In addition, we also investigate how these literary cultures-at different historical junctures-articulated a secular ethos to define Hindu-Muslim relations in the subcontinent. We further discuss questions of genres-epic, romance, drama, novel and lyric-as a way of thinking about the circulation of literary forms across languages, cultures and national spaces in the past and the present. ",
    "prereq": []
  },
  {
    "uid": "816508",
    "code": "AMES3651",
    "subject": "AMES",
    "number": "3651",
    "honors": false,
    "writingIntensive": false,
    "name": "Ghosts of India",
    "fullname": "Ghosts of India",
    "info": "Writers, filmmakers, and other creative art practitioners from almost every corner of this living world use the figure of the ghost to address questions of ethics, justice, violence, and repression. This course focuses on India's modern ghosts as well as ghosts and spirits from classical Indian literature. In every sphere of our lives, public and private, we are chased by various ghosts that often appear in forms of memory, remembrance, nostalgia, and forgetfulness. Ghosts scare us, enchant us, and capture our imagination. Our intellectual engagement will consist of theorizations around the figure of the ghost and its various conceptual offshoots (hauntology, specter, the uncanny, etc.) as encountered through literary and filmic texts. The course will also connect these ghostly tales with issues of nationalism, gender, communal and ethnic violence, and capitalism.",
    "prereq": []
  },
  {
    "uid": "008557",
    "code": "AMES3671",
    "subject": "AMES",
    "number": "3671",
    "honors": false,
    "writingIntensive": false,
    "name": "Hinduism",
    "fullname": "Hinduism",
    "info": "Development of Hinduism focusing on sectarian trends, modern religious practices, myths/rituals, pilgrimage patterns/ religious festivals. Interrelationship between Indian social structure/Hinduism.",
    "prereq": []
  },
  {
    "uid": "008558",
    "code": "AMES3672",
    "subject": "AMES",
    "number": "3672",
    "honors": false,
    "writingIntensive": false,
    "name": "Buddhism",
    "fullname": "Buddhism",
    "info": "Historical and contemporary account of the Buddhist religion in Asia/world in terms of its rise, development, various schools, practices, philosophical concepts, and ethics. Current trends in the modern faith and the rise of \"socially engaged\" Buddhism.",
    "prereq": []
  },
  {
    "uid": "814491",
    "code": "AMES3673",
    "subject": "AMES",
    "number": "3673",
    "honors": false,
    "writingIntensive": false,
    "name": "Voices of India",
    "fullname": "Voices of India: Languages, Literature, and Film",
    "info": "A course on Indian languages and literatures that studies the languages of India from genealogical, linguistic, typological, historical, and sociological perspectives. Diachronic analysis of the languages of India in relation to some structural features will be also investigated. This course will also provide an overview of literatures of several main South Asian languages with a focus on Hindi - Urdu literatures. We will address the origin of Hindi-Urdu literatures, periodization, and naming of each period. We will also examine the important writers and their representative work, along with the literary trends and influences of each period, including political, social, and cultural situations which helped to shape the writers and their work. Among the representative literary works in Hindi-Urdu, some have been made into films.",
    "prereq": []
  },
  {
    "uid": "797241",
    "code": "AMES3676",
    "subject": "AMES",
    "number": "3676",
    "honors": false,
    "writingIntensive": false,
    "name": "Cul/Soc of India",
    "fullname": "Culture and Society of India",
    "info": "Contemporary society/culture in South Asia from anthropological perspective with reference to nationalism; postcolonial identities; media and public culture; gender, kinship, and politics; religion; ethnicity; and Indian diaspora.",
    "prereq": []
  },
  {
    "uid": "800585",
    "code": "AMES3679",
    "subject": "AMES",
    "number": "3679",
    "honors": false,
    "writingIntensive": false,
    "name": "Religion in South Asia",
    "fullname": "Religion and Society in Modern South Asia",
    "info": "Survey of religious formations in modern South Asia (Hindu, Islamic, Sikh, Buddhist). Transformation of religious practice/thought in modernity. Relation between religion and nationalism. Geopolitical dimensions of religious transformation in South Asia.",
    "prereq": []
  },
  {
    "uid": "825056",
    "code": "AMES3700",
    "subject": "AMES",
    "number": "3700",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Southeast Asian Lit",
    "fullname": "Topics in Southeast Asian Literature",
    "info": "Selected topics in Southeast Asian literature. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "793426",
    "code": "AMES3720",
    "subject": "AMES",
    "number": "3720",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Southeast Asian Culture",
    "fullname": "Topics in Southeast Asian Culture",
    "info": "Selected topics in Southeast Asian culture. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "797842",
    "code": "AMES3736",
    "subject": "AMES",
    "number": "3736",
    "honors": false,
    "writingIntensive": false,
    "name": "Hmong American Literature",
    "fullname": "Hmong American Literature",
    "info": "Emerging literature of Hmong (American) community. How Hmong literature fits into Asian, American, and Asian American literatures. Its definitions/borders. Students read, meet writers/artists, and write reflectively, analytically, and creatively.",
    "prereq": []
  },
  {
    "uid": "825284",
    "code": "AMES3756",
    "subject": "AMES",
    "number": "3756",
    "honors": false,
    "writingIntensive": false,
    "name": "Southeast Asian Cinema",
    "fullname": "Southeast Asian Cinema",
    "info": "This course examines the social life and political functions of cinema in Southeast Asia in relation to various contexts in which cinema emerged and circulate. The course is attentive to the impact of historical processes on cinema as well as to how film and media process historical events—colonialism, militarism, religious conflict, ideological wars, economic turmoil. The course is guided by three different problematics: the arrival of cinema as an imported technology that coincided with and was arguably contingent upon the European colonial presence in the region; the ideological conflicts of the Cold War, anti-Communist sentiments; and the emergence of national film industries vis-à-vis independent cinema in the contemporary time. The latter sees cinema as a recuperative means, on the one hand, from political trauma and, on the other hand, from the ongoing human rights crises and the decline of democracy in the region. ",
    "prereq": []
  },
  {
    "uid": "826628",
    "code": "AMES3766",
    "subject": "AMES",
    "number": "3766",
    "honors": false,
    "writingIntensive": false,
    "name": "Hmong Textiles and Identities",
    "fullname": "Hmong Textiles and Identities",
    "info": "This is a lecture, discussion, and project-based learning course on the multi-faceted Hmong identities throughout regions of different countries, time-periods, and acculturation process of each region. The course analyzes authentic materials, texts, and media about the utilization of Artistic Textiles as well as Functional Textiles (clothing) in everyday Hmong life. Hmong textiles and embroideries are key elements to Hmong identities, and directly reflect the diaspora, culture, location, dialect, and practice of each group and sub-group. Students learn how to interpret each region’s textiles and embroideries and how they represent embroidered language and identities. Although there will be a central focus on Asia, this class also focuses on an international Hmong identity which includes Europe, Australia, USA, and other countries of the Hmong diasporic journey. The class analyzes the role textiles play in today’s international Hmong population, transformation, advancement, and commodification. This course is taught in English, there are no prerequisites, and students are not required to have taken any Hmong language classes.",
    "prereq": []
  },
  {
    "uid": "808379",
    "code": "AMES3771",
    "subject": "AMES",
    "number": "3771",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of SE Asia",
    "fullname": "History of Southeast Asia",
    "info": "Origins of civilization/indigenous states. impact of world religions and Western colonialism on gender, social, political, and economic structures. Nationalism. Establishment of Vietnam, Thailand, Indonesia, and the Philippines.",
    "prereq": []
  },
  {
    "uid": "817757",
    "code": "AMES3772",
    "subject": "AMES",
    "number": "3772",
    "honors": false,
    "writingIntensive": false,
    "name": "Hmong Immersion in China",
    "fullname": "Hmong Language and Culture Immersion in China",
    "info": "This instructor-led study abroad course in Kunming, China, focuses on Hmong language and culture in the trans-historical context of China. Students will gain a deeper understanding of the intricate differences within the Hmong linguistic and cultural diaspora through a comparative approach examining the complexity of Hmong dialects and regional cultural shifts. Instructors will work with all student levels, and instruction is oriented towards helping students learn to use the language effectively. All aspects of linguistic performance - speaking, reading, writing and listening - will be addressed. Open to all students interested in Hmong language and culture, regardless of language level.",
    "prereq": []
  },
  {
    "uid": "818788",
    "code": "AMES3773",
    "subject": "AMES",
    "number": "3773",
    "honors": false,
    "writingIntensive": false,
    "name": "Hmong Immersion in Thailand",
    "fullname": "Hmong Language and Culture Immersion in Thailand",
    "info": "This is an instructor-led study abroad course in Thailand. Hmong in the United States trace their story of diaspora directly to Thailand as the most recent country of immigration. While many traced their refugee stories to Thailand, before immigrating to the United States and other countries, Thailand is also a country where many Hmong settled. Thailand is a country of many Hmong stories, intertwined with settlement, immigration, social economic struggles and successes, language development, and more. This study abroad course will focus on learning, observing, and exploring the Hmong diaspora through language and culture in Thailand. The course will explore the historical, cultural, and linguistic contexts of Hmong settlement and immigration in Thailand as well as compare to contexts of Hmong in the United States. ",
    "prereq": []
  },
  {
    "uid": "817264",
    "code": "AMES3776",
    "subject": "AMES",
    "number": "3776",
    "honors": false,
    "writingIntensive": false,
    "name": "Hmong History Across the Globe",
    "fullname": "Hmong History Across the Globe",
    "info": "Hmong interaction with lowland Southeast Asian states (Laos, Vietnam) and Western colonial powers (French, American) since 19th century. Changes to religious, social, political, and gender institutions. Aspirations for political autonomy.",
    "prereq": []
  },
  {
    "uid": "826991",
    "code": "AMES3786",
    "subject": "AMES",
    "number": "3786",
    "honors": false,
    "writingIntensive": false,
    "name": "Vietnam Wars",
    "fullname": "The Vietnam Wars: French Colonialism and US Intervention in Indochina",
    "info": "French conquest. Colonial bureaucratic/economic transformations. Nationalist responses. First Indochina War. Emergence of nation-state. U.S. intervention. Impact of Vietnam War on current politics of Laos, Cambodia, and Thailand, and on Southeast Asia.",
    "prereq": []
  },
  {
    "uid": "818988",
    "code": "AMES3800",
    "subject": "AMES",
    "number": "3800",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Arab Literature",
    "fullname": "Topics in Arab Literature",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "818084",
    "code": "AMES3820",
    "subject": "AMES",
    "number": "3820",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Middle East Cultures",
    "fullname": "Topics in Middle Eastern Cultures",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "007154",
    "code": "AMES3831",
    "subject": "AMES",
    "number": "3831",
    "honors": false,
    "writingIntensive": false,
    "name": "Persian Poetry",
    "fullname": "Persian Poetry in Translation",
    "info": "Major poetic works of Iran in translation dealing with life at the medieval courts, Sufic poetry, and \"new\" poetry. Rudaki, Khayyam, Rumi, Hafiz, Yushij, and Farrukhzad are among the poets whose works are examined.",
    "prereq": []
  },
  {
    "uid": "814242",
    "code": "AMES3832",
    "subject": "AMES",
    "number": "3832",
    "honors": false,
    "writingIntensive": false,
    "name": "The Politics of Arabic Poetry",
    "fullname": "The Politics of Arabic Poetry",
    "info": "This course engages with Arabic poetry in its socio-political context. How have Arab poets from thepre-Islamic era till the present time used their verse as a tool to affirm the structure of their society, or tostruggle with it? What roles did Arabic poetry play at the Abbasid imperial courts? How does Arabicpoetry participate in the constitution and promulgation or subversion of political ideologies? And whatpresence has it had in Arab peoples' struggles for independence or reform, historically and today as partof the Arab Spring?",
    "prereq": []
  },
  {
    "uid": "820343",
    "code": "AMES3833",
    "subject": "AMES",
    "number": "3833",
    "honors": false,
    "writingIntensive": false,
    "name": "Jinn, Ghosts, Demons Arab Lit",
    "fullname": "Jinn, Ghosts, and Demons in Arabic Literature",
    "info": "Jinn, also known as genies, are supernatural beings intrinsic to Islamic cosmology and culture: neither human nor divine, of our world but (usually) invisible to us. This course traces the trope of the jinni in Arabic literature: from the place of jinn in the Quran and Islamic tradition, through their role in the composition of the greatest poetry, to their reincarnation in modern works of literature. Following a survey of classic texts and contexts, we will ask why modern authors summon demons and resurrect ghosts, and what political and cultural work these unruly beings are called to perform. More specifically, we will explore the manner in which jinn are latched onto modern debates on personal and collective trauma, memory, madness, relations between East and West (or North and South), political and state violence, gender relations and hierarchies, and virtual realities.",
    "prereq": []
  },
  {
    "uid": "007147",
    "code": "AMES3836",
    "subject": "AMES",
    "number": "3836",
    "honors": false,
    "writingIntensive": false,
    "name": "Persian Fiction in Transl",
    "fullname": "Persian Fiction in Translation",
    "info": "Impact of westernization on Iran, from 1920s to present. Materials produced by Iranian writers, film makers, and intellectuals. Internal/external forces that bind contemporary Iranian society to world civilization. Works of Hedayat (especially Blind Owl), Chubak, Al-i Ahmad, Daneshvar, and Behrangi are analyzed/interpreted.",
    "prereq": []
  },
  {
    "uid": "820473",
    "code": "AMES3837",
    "subject": "AMES",
    "number": "3837",
    "honors": false,
    "writingIntensive": false,
    "name": "Orienting Hebrew Literature",
    "fullname": "Orienting Hebrew Literature",
    "info": "An introductory survey of Modern Hebrew Literature and its journey from Eastern Europe through Ottoman/British Palestine to the State of Israel. The class centers on the manner in which Hebrew literature has envisioned the Middle East or “the Orient,” reflecting, manipulating, or challenging orientalist paradigms. The first part of the course focuses on Hebrew literature written by Eastern European writers, their fantasies of the East as well as their engagements with orientalist or anti-Semite prejudices. The second part examines Hebrew literature’s attempts to “nativize” in Palestine. Finally, we will read a series of texts by Ashkenazi, Mizrahi, and Palestinian Israeli writers that complicate any attempt to position Hebrew within an Orient/Occident dichotomy. No prior familiarity with Hebrew literature is necessary. All texts will be read in English.",
    "prereq": []
  },
  {
    "uid": "816872",
    "code": "AMES3856W",
    "subject": "AMES",
    "number": "3856",
    "honors": false,
    "writingIntensive": true,
    "name": "Palestinian Literature & Film",
    "fullname": "Palestinian Literature and Film",
    "info": "This course examines modern literature and film of the Palestinian people both for artistic significance and interactions with the broader historical and political situations confronted by Palestinians. We will ask how cultural production, namely literature and film, interacts with, responds to, and even anticipates historical and political events. At the same time, we will problematize a strictly historicist and political reading of literary and cinematic texts, which reduces such artistic works to mere sociological documents, overlooking their creative and artistic achievements. Ultimately, this leads us to a number of questions: what is the relationship between history/politics and art? Can artistic texts transcend the historical and political contexts in which they are produced?  How has artistic production functioned within the context of Palestinian statelessness, exile, and anti-colonial struggle? All texts covered in the course will be in English translation, however those able to read texts in the original Arabic are encouraged to do so.",
    "prereq": []
  },
  {
    "uid": "826648",
    "code": "AMES3857",
    "subject": "AMES",
    "number": "3857",
    "honors": false,
    "writingIntensive": false,
    "name": "Iranian Society through Cinema",
    "fullname": "Iranian Society through Cinema",
    "info": "In this course, we will understand contemporary Iranian society and culture through the lens of Iran's postrevolutionary cinema. Internationally renowned for its artistic, thematic, and narrative prowess, post-revolutionary Iranian cinema is unique in its ability to capture the aspirations, struggles, and triumphs of ordinary Iranians as they manage life in the Islamic Republic. In moving beyond stereotypical images presented by mass media, modern Iranian cinema provides a medium for us to delve into the complex makeup of issues such as religion, gender, class, and politics in Iran today. How does Iranian cinema reflect Iran's culture, society and politics? What role does Iranian cinema play in shaping Iran's national identity? What new insights does Iranian cinema shed onto the interests, subjectivities, and desires of Iranians themselves? Throughout this course, we will attempt to answer these questions by viewing a number of masterpieces of Iranian cinema and reading related social, historical, and political analyses. By engaging in an exploration of daily life in Iran through film, we will gain a more nuanced understanding of Iran's modern landscape and the diversity of opinions and experiences that it constitutes. This course will also serve as an introduction to Iranian history, especially following the 1979 revolution. By examining how Iranian cinema is intimately linked with this history, students will gain a better understanding of the significant role that cinema has played in shaping Iran today.",
    "prereq": []
  },
  {
    "uid": "816947",
    "code": "AMES3866",
    "subject": "AMES",
    "number": "3866",
    "honors": false,
    "writingIntensive": false,
    "name": "Arab American Experiences",
    "fullname": "Arab American Experiences",
    "info": "Arab diasporic experiences in the West, and in America in particular, have been mediated by popular depictions of \"the Arab\" as violent terrorist, oppressor of/oppressed woman, religious fanatic, and myriad other negative stereotypes, heightened since September 11, 2001. How do Arabs in America, especially youth, navigate the superimposition of these images upon them?  How do they relate to the multiple locations of \"home\" between the West and the Arab world? To what extent are they perpetually \"out of place,\" and what strategies have they developed to navigate their liminal and often marginalized social position? Through the examination of memoirs, novels, film, music, and even food, this course will use Arab American cultural production as a lens through which to explore these questions.",
    "prereq": []
  },
  {
    "uid": "817484",
    "code": "AMES3867",
    "subject": "AMES",
    "number": "3867",
    "honors": false,
    "writingIntensive": false,
    "name": "Orientalism and the Arab World",
    "fullname": "Orientalism and the Arab World",
    "info": "This course explores the various manners in which “the Arab World” is constructed and re/presented in American and European discourses. Reading through scholarly writings, literature, visual arts, and popular media, this course illuminates the manner in which the idea of a monolithic “Arab World” and quintessential “Arab” subject are constructed and re/produced for western consumption. Crucially, this course also examines the manner in which this re/production of the “Arab World/Subject” is integral to the construction of western identity itself – serving as a foil to western self-conceptualization. The concept of orientalism was introduced into western scholarship by Edward Said through his seminal 1978 work, Orientalism, often credited as a foundational text in the field of postcolonial studies. In the first part of the course, we will closely read Orientalism and some of the influential critical engagements with Said’s book. We will also discuss how orientalist discourse has been subsumed under the debates on the “Clash of Civilizations” and “The War on Terror” in the 21st century. The second part of the course will look at orientalist representations in a variety of mediums, from literature and visual art to video games. In the final part of the course, we will try to “inventory the traces” of Orientalism on the Oriental subject, or examine the manner Arab artists and writers have engaged with orientalism’s legacies. ",
    "prereq": []
  },
  {
    "uid": "818917",
    "code": "AMES3868",
    "subject": "AMES",
    "number": "3868",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture/Soc Arabian Peninsula",
    "fullname": "Culture and Society of the Arabian Peninsula",
    "info": "This course revolves around the study of issues and cultural trends in the societies of the Arabian Peninsula, particularly Saudi Arabia, Qatar, the United Arab Emirates, Kuwait, and Bahrain. After an introduction on the historical development of these states, topics we cover include nation-building and heritage construction; the meaning of tribalism and \"Bedouinness\" today; social stratification and sectarianism; issues of gender; labor and migration; and local production of literature, poetry and film. In the last four weeks of the semester, we will read three novels composed by local authors. This course is taught in English.",
    "prereq": []
  },
  {
    "uid": "809993",
    "code": "AMES3871",
    "subject": "AMES",
    "number": "3871",
    "honors": false,
    "writingIntensive": false,
    "name": "Islam: Religion and Culture",
    "fullname": "Islam: Religion and Culture",
    "info": "This course is a brief survey of the religion and civilization of Islam. It introduces students to 1) Islamic history from its inception in the seventh century CE to the present, with emphasis on the life of the Prophet Muhammad and the early Caliphate; 2) The authoritative texts of Islam, i.e. the Quran and Prophetic traditions (Hadith); 3) The institutions and discourses characteristic of Islamic civilization; and 4) The transformation of Muslim life and thought in the modern period. By taking this course, students become familiar with the chief ideas, characters, narratives, rites, localities, and movements associated with Islam.prereq: Soph or jr or sr",
    "prereq": []
  },
  {
    "uid": "810423",
    "code": "AMES3872",
    "subject": "AMES",
    "number": "3872",
    "honors": false,
    "writingIntensive": false,
    "name": "The Cultures of the Silk Road",
    "fullname": "The Cultures of the Silk Road",
    "info": "Past/present state of cultures that flourished in Central Asia (present-day CA republics, Iran, Afghanistan) after Alexander the Great. Decline with opening of sea routes.",
    "prereq": []
  },
  {
    "uid": "826674",
    "code": "AMES3873",
    "subject": "AMES",
    "number": "3873",
    "honors": false,
    "writingIntensive": false,
    "name": "Islamic Mysticism",
    "fullname": "Islamic Mysticism",
    "info": "This course offers an introduction to the tradition of Islamic mysticism, or Sufism. The main goal of the class is to develop an understanding of the mystical perspectives within Islam that have influenced most of the world's Muslim population. Throughout Islamic history, Sufis (Islamic mystics) have developed fascinating philosophical theories and beautiful literature, attempting to answer questions about the meaning of life and the nature of reality. We will read Islamic mystical texts that explore everything from hidden meanings of the Qur'an, to dreams and supernatural powers, to sex, love, and spiritual connection with God. In addition to reading the writings of Muslim holy men (and sometimes women) from Turkey to China and beyond, we will also consider the role of Islamic mysticism in Muslim societies, and how it influenced people at various levels of society. Finally, we will examine what happens to Sufism in the modern period, given challenges from colonialism as well as alternate schools of thought within Islam.Please bring the required texts to class, and print out readings when appropriate for note taking and for use in class discussion. All readings will be in English translation and no prior knowledge of Islam or foreign languages is required for this class.",
    "prereq": []
  },
  {
    "uid": "810007",
    "code": "AMES3876",
    "subject": "AMES",
    "number": "3876",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Middle East",
    "fullname": "Survey of the Modern Middle East",
    "info": "Political history of Middle East in modern era. Socio-economic/intellectual issues. Decline of Ottoman Empire. Imperialism. Nationalism, rise/development of states. Political Islam.",
    "prereq": []
  },
  {
    "uid": "820344",
    "code": "AMES3877",
    "subject": "AMES",
    "number": "3877",
    "honors": false,
    "writingIntensive": false,
    "name": "The Arab Renaissance",
    "fullname": "The Arab Renaissance: Narrating Modernity",
    "info": "The Nahḍa, a word meaning renaissance, awakening, or simply the act of standing up, is the name Arab writers and intellectuals of the 19th c. gave their own historical period. What does it mean to view oneself as living through a revival? How does this view shape the contours of the past, or of the future? This class will address these questions through a survey of the political, intellectual, social, and cultural aspects of Arab modernity. We will examine how Arab thinkers of the late 19th and early 20th century produced new genres, identities, and communal affiliations to narrate their experience of modernity, which they often coded as “the encounter with the West.” Our readings, all in English translation, will cover the first confrontations (and love affairs) with European powers, the self-professed urgency of projects of reforming language, literature, and cultural institutions, the growing schism between religious and secular thought, and the attempts to articulate indigenous alternatives to Western-style modernity. ",
    "prereq": []
  },
  {
    "uid": "810008",
    "code": "AMES3883",
    "subject": "AMES",
    "number": "3883",
    "honors": false,
    "writingIntensive": false,
    "name": "The Ottoman Empire",
    "fullname": "The Ottoman Empire",
    "info": "Survey of Islam's most successful empire, from its founding circa 1300 to its demise in 1923. Lands, institutions, peoples, historical legacy.",
    "prereq": []
  },
  {
    "uid": "825637",
    "code": "AMES3886",
    "subject": "AMES",
    "number": "3886",
    "honors": false,
    "writingIntensive": false,
    "name": "Petrofictions",
    "fullname": "Petrofictions: Oil Wars, Wealth, and Waste in the Middle East",
    "info": "In 1992, the novelist Amitav Ghosh wondered why the \"oil-encounter,\" the most significant, culture-altering development of the twentieth century, has not been narrativized. Twenty years later, in The Great Derangement, he concluded that our prevalent narrative forms are inadequate to narrate the slow catastrophe of climate change, simply because they are so implicated, even complicit, in the extractive logics of petromodernity. This course explores our contemporary modernity of oil dependence through critical engagement with Middle Eastern cultural production. It postulates that to think about oil is not solely to think about derricks or spectacular spills or barrel prices, but about the basic narratives, fictions, and ideologies that underline our daily lives; that reading fictions (conceived broadly) is both a method and resource to map and critique ways in which the world's resources are unevenly produced, extracted, and exploited on a global-local scale; and that humanistic inquiry can challenge the common assumption that existing energy systems are inevitably necessary in modern life. Throughout the semester, the students will engage in critical readings of novels, films, and visual art that emerge from and react to the networked reality of an oil-addicted world. They will critically analyze the narrative forms and visual vocabularies through which the petro-industry has been depicted, as well as learn about the violent history of oil extraction and its environmental effects. Finally, they will consider how creative works allow us to imagine and promote alternative and more sustainable energy futures.",
    "prereq": []
  },
  {
    "uid": "818552",
    "code": "AMES3896",
    "subject": "AMES",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor. A student may only earn credit for a given internship through one course at a time.",
    "prereq": []
  },
  {
    "uid": "789848",
    "code": "AMES3900",
    "subject": "AMES",
    "number": "3900",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Asian Literature",
    "fullname": "Topics in Asian Literature",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "789843",
    "code": "AMES3920",
    "subject": "AMES",
    "number": "3920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Asian Culture",
    "fullname": "Topics in Asian Culture",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "796069",
    "code": "AMES3993",
    "subject": "AMES",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Individual reading/study, with guidance of a faculty member, on topics not covered in regular courses.Prereq-instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "790012",
    "code": "AMES4901W",
    "subject": "AMES",
    "number": "4901",
    "honors": false,
    "writingIntensive": true,
    "name": "Capstone Project",
    "fullname": "Capstone Project in Asian & Middle Eastern Studies",
    "info": "The capstone project in the department of Asian and Middle Eastern Studies is meant to demonstrate the cumulative language, critical thinking, and analysis skills developed by students over the course of their undergraduate studies. It consists of a thesis of at least 6000 words, in which students must synthesize research in primary language sources (i.e. texts, films, or other forms of cultural production in the original language of student's declared subplan) with secondary research.  prereq: AMES major, sr",
    "prereq": []
  },
  {
    "uid": "799128",
    "code": "AMES5220",
    "subject": "AMES",
    "number": "5220",
    "honors": false,
    "writingIntensive": false,
    "name": "Pedagogy in AMES",
    "fullname": "Pedagogy of Asian Languages and Literatures",
    "info": "Second language acquisition theory, methods, testing, and technology applicable to the teaching of less commonly taught languages.",
    "prereq": []
  },
  {
    "uid": "826567",
    "code": "AMES5221",
    "subject": "AMES",
    "number": "5221",
    "honors": false,
    "writingIntensive": false,
    "name": "Pedagogy for LCTLs",
    "fullname": "Pedagogy for Less Commonly Taught Languages",
    "info": "This course is for graduate students and advanced undergraduate students with an interest or experience in the teaching of world languages—specifically less commonly taught languages (“LCTLs”). The course provides theoretical grounding in the trends and issues particular to the teaching of LCTLs in a college setting. It also has an applied orientation in its focus on instructional approaches and strategies, and best practices for the development of speaking, writing, reading, and listening skills and transcultural competence in various modes of communication (interpersonal, interpretive, and presentational). Students will pair background readings with exercises in lesson planning and activity design and with the observation of LCTL classes. The course is open to students specializing in various world languages; readings and assignments have been selected for their relevance to teaching professionals across LCTLs. ",
    "prereq": []
  },
  {
    "uid": "817508",
    "code": "AMES5250",
    "subject": "AMES",
    "number": "5250",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Topics Asian Film & Media",
    "fullname": "Advanced Topics in Asian Film and Media",
    "info": "Examines theme, problem, region, style or filmmaker in Asian cinema. Focuses on (geo)political and socioeconomic contexts in relation to artistic and interpretive frameworks.",
    "prereq": []
  },
  {
    "uid": "803323",
    "code": "AMES5261",
    "subject": "AMES",
    "number": "5261",
    "honors": false,
    "writingIntensive": false,
    "name": "Work of Translation",
    "fullname": "Work of Translation: Theory, Function, and Practice",
    "info": "Issues surrounding translation. Theories of representation. Ideological work. Readings/discussion of both historical/contemporary writing on translation. Actual translation tasks.prereq: [Native or near-native] speaker of English, advanced speaker/reader of at least one other [classical or vernacular] language",
    "prereq": []
  },
  {
    "uid": "797735",
    "code": "AMES5265",
    "subject": "AMES",
    "number": "5265",
    "honors": false,
    "writingIntensive": false,
    "name": "East Asia Poetics & Aesthetics",
    "fullname": "Traditional Poetics and Aesthetics in East Asia",
    "info": "Introduction to traditional theories of poetics/aesthetics in East Asia. Emphasizes China and Japan. Chinese interpretations of classic Poetry, their impact on conception of poetry in general. Correspondences of poetic/painting theory. Impact of Zen Buddhism on aesthetics. Japanese court treatises on poetry.",
    "prereq": []
  },
  {
    "uid": "800586",
    "code": "AMES5276",
    "subject": "AMES",
    "number": "5276",
    "honors": false,
    "writingIntensive": false,
    "name": "Liberalism and Its Critics",
    "fullname": "Liberalism and Its Critics: Global Perspectives",
    "info": "Survey of liberal political thought and various critics of it that arose in extreme left/right political perspectives, including those in colonial contexts and within non-Western religious formations, especially Hindu and Muslim.",
    "prereq": []
  },
  {
    "uid": "817149",
    "code": "AMES5277",
    "subject": "AMES",
    "number": "5277",
    "honors": false,
    "writingIntensive": false,
    "name": "Space and Modernity in Asia",
    "fullname": "Space and Modernity in Asia",
    "info": "Examines methods, vocabularies, and theories necessary to articulate new spatial approaches to modern Asian cultural texts, including literature, films, and urban spaces. Special focus on Soja, Lefebvre, Winichakul, Henry, Ai, Zhang, and Furuhata.",
    "prereq": []
  },
  {
    "uid": "826649",
    "code": "AMES5281",
    "subject": "AMES",
    "number": "5281",
    "honors": false,
    "writingIntensive": false,
    "name": "Lang & Politics across Asia",
    "fullname": "Language and Politics across Asia",
    "info": "With the rise of nationalism, language becomes both a political question unto itself as well as a vehicle for other political issues. Why were people willing to set themselves on fire to protest against having to speak Hindi in southern India, and willing to fight wars to defend it in the north? How was Hebrew, which had been a dead language for almost 2000 years, revived as a modern spoken language? What are the politics of imposing a single language, Mandarin, on an incredibly diverse population of 1.3 billion people in China? This seminar explores the politics of language across Asia through case studies in parts of the Middle East, South Asia, and East Asia. It pairs literary and historical case studies with different theoretical frameworks for the study of language politics, and explores how language has been central to political and historical phenomena from European and Japanese colonialism to state formation to anti-colonial struggles and revolutionary movements. Students will therefore gain specific knowledge about how language politics have played out historically and presently in different parts of Asia, as well as developing theoretical and analytical skills for thinking critically about language in general.Please print out readings for note taking and for use in class discussion. All readings will be in English translation and no prior linguistic or historical knowledge is required for this class.",
    "prereq": []
  },
  {
    "uid": "826806",
    "code": "AMES5300",
    "subject": "AMES",
    "number": "5300",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Chinese Literature",
    "fullname": "Topics in Chinese Literature",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "826738",
    "code": "AMES5320",
    "subject": "AMES",
    "number": "5320",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Chinese Culture",
    "fullname": "Topics in Chinese Culture",
    "info": "Topics specified in Class Schedule. ",
    "prereq": []
  },
  {
    "uid": "798714",
    "code": "AMES5333",
    "subject": "AMES",
    "number": "5333",
    "honors": false,
    "writingIntensive": false,
    "name": "Poetry & Power in Early China",
    "fullname": "Poetry and Power in Early China: Book of Songs and Songs of the South",
    "info": "How to read/analyze poems from early anthologies in terms of their display/invocation of different types of cultural power. Power that poems have held over Chinese literary tradition in subsequent millennia, their literary influence/position in intellectual/political lives of Chinese readers. Studies that relate to the poetry and social/material culture.",
    "prereq": []
  },
  {
    "uid": "800392",
    "code": "AMES5334",
    "subject": "AMES",
    "number": "5334",
    "honors": false,
    "writingIntensive": false,
    "name": "Voices from Early China",
    "fullname": "Voices From Early China: Book of Songs and Songs of the South",
    "info": "Students read/analyze poems from Book of Songs and Songs of the South (ca. 1000-300 B.C.E.). Literary influence, position the poems have held in intellectual, emotional, and political lives of Chinese readers. Historical, cultural, and theoretical studies that relate to the poetry and the voices in it.",
    "prereq": []
  },
  {
    "uid": "796747",
    "code": "AMES5343",
    "subject": "AMES",
    "number": "5343",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Chinese Drama",
    "fullname": "Lovers, Clowns, and Acrobats: An Introduction to Chinese Drama",
    "info": "Traditional Chinese drama/theater. Students read/discuss major masterpieces of Chinese drama in English translation. Major secondary scholarship. Theatrical practices of modern opera (especially Beijing opera) through in-class viewings. Focuses on representation of gender/romance.",
    "prereq": []
  },
  {
    "uid": "816926",
    "code": "AMES5351",
    "subject": "AMES",
    "number": "5351",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese New Media",
    "fullname": "Chinese New Media",
    "info": "This course explores new media and intermediality from specific moments in the history of modern China. The new visuality of the late Qing Dynasty offers examples of how new forms of visual culture became both reflexive and constitutive of modernity. Later, silent cinema of the Republican era both drew upon and defined itself against existing Chinese dramatic forms, particularly opera. In the 1930s, the arrival of sound in cinema provided a space for phonographic modernity to be expressed through film. In the People's Republic, the productive interplay between traditional art forms and cinema entered a new era, culminating in the cinematic adaptations of the \"model plays\" of the Cultural Revolution. Finally, recent years have seen the explosive growth of digital cinema, computer animation, internet culture, and gaming communities.",
    "prereq": []
  },
  {
    "uid": "798639",
    "code": "AMES5356",
    "subject": "AMES",
    "number": "5356",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender/Sexuality Chinese Film",
    "fullname": "Gender and Sexuality in Chinese Film",
    "info": "How gender/sexuality have been depicted, constructed, and subverted in Chinese cinemas (including mainland China, Hong Kong, Taiwan) from 1930s to present. Weekly film screenings, readings on Chinese film, key works of feminist film theory.",
    "prereq": []
  },
  {
    "uid": "796140",
    "code": "AMES5357",
    "subject": "AMES",
    "number": "5357",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Cinematic Realisms",
    "fullname": "Chinese Cinematic Realisms",
    "info": "Various styles of realism in Chinese cinemas (mainland, Taiwan) from silent era to present. Theories of realism, conceptions of \"the Real\" applied in close readings of major films, placed in historical context. China's negotiation of modernity during 20th century.",
    "prereq": []
  },
  {
    "uid": "800587",
    "code": "AMES5358",
    "subject": "AMES",
    "number": "5358",
    "honors": false,
    "writingIntensive": false,
    "name": "Revolutionary Cinema",
    "fullname": "Realism, Revolution, and the Moving Image",
    "info": "Cinema associated with socialist realism as a global, transnational phenomenon at the heart of the aesthetics of the 20th-century's communist movement. The work of revolutionary filmmakers from China, Soviet Union, North Korea, Cuba, Eastern Europe, and Africa informs our exploration of socialist realism. Formalized by Maxim Gorky and other Soviet artists, theorists, and cultural officials in the early 1930s, socialist realism would become the official literary and artistic style of Communist revolutionary movements and resulting states throughout the world. Certain consistencies of style and theme spread to various sites across histories and geographies, yet much variation also was evident and will be explored in this class. Rejecting the dismissal of socialist realism as mere propaganda, we will take seriously its theorization and its aesthetic innovations, as well as its relationships with classical Hollywood narration, melodrama, and the psychoanalytic concept of sublimation. Through an examination of socialist realism's variations and limits, we will grapple with larger questions of modernity, authority, and the function of art in modern societies.",
    "prereq": []
  },
  {
    "uid": "802050",
    "code": "AMES5359",
    "subject": "AMES",
    "number": "5359",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Shanghai Film Culture",
    "fullname": "Early Shanghai Film Culture",
    "info": "Shanghai film culture, from earliest extant films of 1920s to end of Republican Era in 1949. Influences on early Chinese film, from traditional Chinese drama to contemporary Hollywood productions. Effects of leftist politics on commercial cinema. Chinese star system, material film culture.",
    "prereq": []
  },
  {
    "uid": "797736",
    "code": "AMES5366",
    "subject": "AMES",
    "number": "5366",
    "honors": false,
    "writingIntensive": false,
    "name": "Nation in Mod Chin Film & Lit",
    "fullname": "The Nation in Modern Chinese Film and Literature",
    "info": "Chinese nationhood as represented/negotiated in film/literature from early 20th Century to present. How China was re-imagined as a modern nation in culture, from Republican era to Mao era to the reform era. How alternative national visions of nationhood arose in Hong Kong and Taiwan.",
    "prereq": []
  },
  {
    "uid": "797495",
    "code": "AMES5374",
    "subject": "AMES",
    "number": "5374",
    "honors": false,
    "writingIntensive": false,
    "name": "MonkeyKing/Transcultural China",
    "fullname": "The Monkey King and Transcultural China: Chinese Myth, Legend, and Ideology",
    "info": "Early Chinese myths/legends/historical narratives about the Monkey King. Cultural formations from later periods, including contemporary popular culture and Asian American literature. Construction of China/Chinese in 20th Century seen through the Monkey as a figure of otherness and in-betweenness in relation to globalization and cross-cultural identity.",
    "prereq": []
  },
  {
    "uid": "819765",
    "code": "AMES5420",
    "subject": "AMES",
    "number": "5420",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Japanese Culture",
    "fullname": "Topics in Japanese Culture",
    "info": "Topics specified in course schedule.",
    "prereq": []
  },
  {
    "uid": "015360",
    "code": "AMES5433",
    "subject": "AMES",
    "number": "5433",
    "honors": false,
    "writingIntensive": false,
    "name": "Pre-Modern JPN Women's Writing",
    "fullname": "Women's Writing in Premodern Japan in Translation",
    "info": "Genji monogatari (lengthy narrative), Makura no soshi (collection of vignettes), poetry. Gendered writing system/authorship, narrative techniques. Sexuality/figure of author. Strategies of fictionality.",
    "prereq": []
  },
  {
    "uid": "015430",
    "code": "AMES5436",
    "subject": "AMES",
    "number": "5436",
    "honors": false,
    "writingIntensive": false,
    "name": "20th-C. Japan Women's Lit",
    "fullname": "Literature by 20th-Century Japanese Women in Translation",
    "info": "Literary/historical exploration of selected works by Japanese women writers in variety of genres. All literary texts read in English.",
    "prereq": []
  },
  {
    "uid": "816518",
    "code": "AMES5446",
    "subject": "AMES",
    "number": "5446",
    "honors": false,
    "writingIntensive": false,
    "name": "Kabuki: A Pop Theater in Japan",
    "fullname": "Kabuki: A Pop, Queer, and Classical Theater in Japan",
    "info": "Kabuki, an all-male theater of \"song (ka)/dance (bu)/acting (ki)\" that came into being in the 17th century, still boasts popularity in Japan. This course explores kabuki in several contexts: historical, theatrical, literary, and theoretical. It aims to historicize this performing art in its four-hundred-year dynamic trajectory against the static understanding that it is a national, high culture. No less importantly, we inquire into theoretical implications of subject matter, such as citationality, gender construction, and the like. Furthermore, this course attends to what is usually marginalized and overlooked in kabuki historiography: koshibai (unlicensed small troupes of kabuki); onna yakusha (women kabuki actors who mastered the acting techniques established by male kabuki actors--including the technique of female impersonation). Open to anyone with an interest, no previous knowledge of Japanese studies, theater studies, or Japanese is required. All of the readings will be available in English. Audio-visual materials will be used whenever available and appropriate.",
    "prereq": []
  },
  {
    "uid": "796141",
    "code": "AMES5477",
    "subject": "AMES",
    "number": "5477",
    "honors": false,
    "writingIntensive": false,
    "name": "Kurosawa Masculinity Cold War",
    "fullname": "Kurosawa, Masculinity, and Cold War",
    "info": "Akira Kurosawa?s work as a film director. Emphasizes revising dominant interpretations of Japanese film/masculinity in context of pre-WWII Japanese and Cold War Japanese-U.S. situation. Politics of culture, class, social agency, and gender coding.",
    "prereq": []
  },
  {
    "uid": "816519",
    "code": "AMES5486",
    "subject": "AMES",
    "number": "5486",
    "honors": false,
    "writingIntensive": false,
    "name": "Images of \"Japan\"",
    "fullname": "Images of \"Japan\"",
    "info": "This course examines non-Japanese texts that deploy the imagination of \"Japan\" in their narratives. Discussions will take up such focal points as: ethnographic cinema, the politics of travel and translation, the intersections of race and gender, the cultural politics of alternate histories, and the ramifications of techno-orientalist discourse.",
    "prereq": []
  },
  {
    "uid": "826717",
    "code": "AMES5536",
    "subject": "AMES",
    "number": "5536",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Korean Literature",
    "fullname": "Modern Korean Literature",
    "info": "Modern Korean literature in English translation from the colonial period until the 1990s. Read literary texts critically, using genre categories, theories of narrative voice, different understandings of modern literary subjectivity, and historical contextualization. ",
    "prereq": []
  },
  {
    "uid": "825610",
    "code": "AMES5556",
    "subject": "AMES",
    "number": "5556",
    "honors": false,
    "writingIntensive": false,
    "name": "Korean Film and Media",
    "fullname": "Korean Film and Media",
    "info": "This course is an introduction to Korean film from the Japanese colonial period (1910-1945) to the present day. We discuss the emergence of the Korean film industry under the conditions of colonial modernity and the various political pressures put on film production in South Korea until the 1990s. We will then turn to the last twenty years, during which South Korean film and television have experienced a boom in popularity in East Asia and globally. Throughout, we will focus on the formal and technical aspects of film, representations of history and historical memory, genre borrowing and genre mixing, and the relationships between art-house and culture industry productions.",
    "prereq": []
  },
  {
    "uid": "818610",
    "code": "AMES5620",
    "subject": "AMES",
    "number": "5620",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in South Asian Culture",
    "fullname": "Topics in South Asian Culture",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "795412",
    "code": "AMES5636",
    "subject": "AMES",
    "number": "5636",
    "honors": false,
    "writingIntensive": false,
    "name": "South Asian Women Writers",
    "fullname": "South Asian Women Writers",
    "info": "Survey of South Asian women's writing, from early years of nationalist movement to present. Contemporary writing includes works by immigrant writers. Concerns, arguments, and nuances in works of women writing in South Asia and diaspora.",
    "prereq": []
  },
  {
    "uid": "788964",
    "code": "AMES5671",
    "subject": "AMES",
    "number": "5671",
    "honors": false,
    "writingIntensive": false,
    "name": "Hinduism",
    "fullname": "Hinduism",
    "info": "Development of Hinduism focusing on sectarian trends, modern religious practices, myths/rituals, pilgrimage patterns/ religious festivals. Interrelationship between Indian social structure/Hinduism.",
    "prereq": []
  },
  {
    "uid": "788969",
    "code": "AMES5672",
    "subject": "AMES",
    "number": "5672",
    "honors": false,
    "writingIntensive": false,
    "name": "Buddhism",
    "fullname": "Buddhism",
    "info": "Historical account of Buddhist religion in terms of its rise, development, various schools, and common philosophical concept. Indian Buddhism compared with Hinduism; Buddhism's demise and revival on the Indian subcontinent.",
    "prereq": []
  },
  {
    "uid": "798900",
    "code": "AMES5682",
    "subject": "AMES",
    "number": "5682",
    "honors": false,
    "writingIntensive": false,
    "name": "Romanticism and Empire",
    "fullname": "Romanticism and Empire: Britain and India",
    "info": "Investigation of intersection of modern imperialism and aesthetics of Romanticism in different locations of British imperial system. Emphasizes primary works of English, Bengali, Hindi, and Urdu Romanticism. Politics of empire/orientalism. Spatiality of romanticism. Geography of imperialism. Spread and political employment of particular aesthetic ideologies.",
    "prereq": []
  },
  {
    "uid": "825057",
    "code": "AMES5720",
    "subject": "AMES",
    "number": "5720",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Southeast Asian Culture",
    "fullname": "Topics in Southeast Asian Culture",
    "info": "Selected topics in Southeast Asian culture. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "818085",
    "code": "AMES5820",
    "subject": "AMES",
    "number": "5820",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Middle East Cultures",
    "fullname": "Topics in Middle Eastern Cultures",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "007151",
    "code": "AMES5831",
    "subject": "AMES",
    "number": "5831",
    "honors": false,
    "writingIntensive": false,
    "name": "Persian Poetry",
    "fullname": "Persian Poetry in Translation",
    "info": "Major poetic works of Iran dealing with life at the medieval courts, Sufic poetry, and \"new\" poetry are studied. Rudaki, Khayyam, Rumi, Hafiz, Yushij, and Farrukhzad are among the poets whose works are examined.",
    "prereq": []
  },
  {
    "uid": "007150",
    "code": "AMES5836",
    "subject": "AMES",
    "number": "5836",
    "honors": false,
    "writingIntensive": false,
    "name": "Persian Fiction in Transl",
    "fullname": "Persian Fiction in Translation",
    "info": "Impact of westernization on Iran, from 1920s to present. Materials produced by Iranian writers, film makers, and intellectuals. Internal/external forces that bind contemporary Iranian society to world civilization. Works of Hedayat (especially Blind Owl), Chubak, Al-i Ahmad, Daneshvar, and Behrangi are analyzed/interpreted.",
    "prereq": []
  },
  {
    "uid": "825544",
    "code": "AMES5837",
    "subject": "AMES",
    "number": "5837",
    "honors": false,
    "writingIntensive": false,
    "name": "Arab Prison Writing",
    "fullname": "Arab Prison Writing",
    "info": "From colonial-era prisons to post-colonial regimes' widespread use of detention to neo-colonial spaces of confinement such as Guantanamo and Abu Ghraib, incarceration and its threat have been prominent features of modern Arab life spawning a distinct genre: prison writing. This course surveys novels and memoirs of this genre to examine the various forms imprisonment and incarceration take in Arab literature and the often surprising ways in which they are represented.",
    "prereq": []
  },
  {
    "uid": "816501",
    "code": "AMES5866",
    "subject": "AMES",
    "number": "5866",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender & Sexuality in Arab Lit",
    "fullname": "Gender and Sexuality in Modern Arabic Literature",
    "info": "Survey of modern Arabic literature's key role in the articulation, construction, and subversion of gendered subjectivities. Explores the construction of masculine and feminine subjectivities, as well as the blurring of the dichotomy between the two. Also explores how homoerotic desire is presented in modern Arabic novels. Engages the complex interplay between the gender politics of literary texts, and the broader historical and political contexts from which they emerge. All texts covered in this course will be in English translation, however those able to read texts in the original Arabic are encouraged to do so.",
    "prereq": []
  },
  {
    "uid": "818918",
    "code": "AMES5868",
    "subject": "AMES",
    "number": "5868",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture/Soc Arabian Peninsula",
    "fullname": "Culture and Society of the Arabian Peninsula",
    "info": "This course revolves around the study of issues and cultural trends in the societies of the Arabian Peninsula, particularly Saudi Arabia, Qatar, the United Arab Emirates, Kuwait, and Bahrain. After an introduction on the historical development of these states, topics we cover include nation-building and heritage construction; the meaning of tribalism and \"Bedouinness\" today; social stratification and sectarianism; issues of gender; labor and migration; and local production of literature, poetry and film. In the last four weeks of the semester, we will read three novels composed by local authors. This course is taught in English.Meets with ALL 3868.",
    "prereq": []
  },
  {
    "uid": "825177",
    "code": "AMES5877",
    "subject": "AMES",
    "number": "5877",
    "honors": false,
    "writingIntensive": false,
    "name": "The Arab Renaissance",
    "fullname": "The Arab Renaissance: Narrating Modernity",
    "info": "The Nahḍa, a word meaning renaissance, awakening, or simply the act of standing up, is the name Arab writers and intellectuals of the 19th c. gave their own historical period. What does it mean to view oneself as living through a revival? How does this view shape the contours of the past, or of the future? This class will address these questions through a survey of the political, intellectual, social, and cultural aspects of Arab modernity. We will examine how Arab thinkers of the late 19th and early 20th century produced new genres, identities, and communal affiliations to narrate their experience of modernity, which they often coded as “the encounter with the West.” Our readings, all in English translation, will cover the first confrontations (and love affairs) with European powers, the self-professed urgency of projects of reforming language, literature, and cultural institutions, the growing schism between religious and secular thought, and the attempts to articulate indigenous alternatives to Western-style modernity. ",
    "prereq": []
  },
  {
    "uid": "825957",
    "code": "AMES5886",
    "subject": "AMES",
    "number": "5886",
    "honors": false,
    "writingIntensive": false,
    "name": "Petrofictions",
    "fullname": "Petrofictions: Oil Wars, Wealth, and Waste in the Middle East",
    "info": "In 1992, the novelist Amitav Ghosh wondered why the \"oil-encounter,\" the most significant, culture-altering development of the twentieth century, has not been narrativized. Twenty years later, in The Great Derangement, he concluded that our prevalent narrative forms are inadequate to narrate the slow catastrophe of climate change, simply because they are so implicated, even complicit, in the extractive logics of petromodernity. This course explores our contemporary modernity of oil dependence through critical engagement with Middle Eastern cultural production. It postulates that to think about oil is not solely to think about derricks or spectacular spills or barrel prices, but about the basic narratives, fictions, and ideologies that underline our daily lives; that reading fictions (conceived broadly) is both a method and resource to map and critique ways in which the world's resources are unevenly produced, extracted, and exploited on a global-local scale; and that humanistic inquiry can challenge the common assumption that existing energy systems are inevitably necessary in modern life. Throughout the semester, the students will engage in critical readings of novels, films, and visual art that emerge from and react to the networked reality of an oil-addicted world. They will critically analyze the narrative forms and visual vocabularies through which the petro-industry has been depicted, as well as learn about the violent history of oil extraction and its environmental effects. Finally, they will consider how creative works allow us to imagine and promote alternative and more sustainable energy futures.",
    "prereq": []
  },
  {
    "uid": "792881",
    "code": "AMES5900",
    "subject": "AMES",
    "number": "5900",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Asian Literature",
    "fullname": "Topics in Asian Literature",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "792883",
    "code": "AMES5920",
    "subject": "AMES",
    "number": "5920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Asian Culture",
    "fullname": "Topics in Asian Culture",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "796070",
    "code": "AMES5993",
    "subject": "AMES",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Individual reading/study, with guidance of a faculty member, on topics not covered in regular courses.Prereq-instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "797769",
    "code": "AMES8001",
    "subject": "AMES",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Appr. to Asia/MidEast",
    "fullname": "Critical Approaches to Asian and Middle Eastern Studies",
    "info": "This course aims to provide critical and theoretical foundations for incoming graduate students in Asian Literatures, Cultures, and Media program, while also addressing broader questions that would be of interest to students in other departments in the Humanities and Social Sciences. Our project will be to generate discussion about the theoretical and political complexities of studying Asia and the Middle East from a cross-cultural and transnational perspective, taking account of several inter-related questions at the heart of the work of Asian and Middle Eastern Studies. Beginning with Edward Said’s critique of orientalism as our point of departure, we will take up a range of questions revolving around debates over historiography (e.g., capitalism and the formations of race and gender, nationalism and imperialism, etc.) and the relationship between cultural studies and political-economy (e.g., the political unconscious, national allegory, translation and translingual practice, ethnographic gaze, etc.) with a particular attention to the complications posed by taking “Asia” as the object of intellectual inquiry in any such analysis. Our discussions will consider key problematics in cultural theory, the uses of such theory in the Asian context and some of the issues thereby raised, and critical interventions by scholars of Asia.",
    "prereq": []
  },
  {
    "uid": "810139",
    "code": "AMES8002",
    "subject": "AMES",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Seminar",
    "fullname": "Research Seminar",
    "info": "Issues/approaches in academic study of Asian and/or Middle Eastern area studies. Problems in contemporary academic theory in humanities. Application of theory to issues in area studies raised. Interventions of critical theory. Ethics of professional peer review. Crisis in higher education.",
    "prereq": []
  },
  {
    "uid": "800664",
    "code": "AMES8333",
    "subject": "AMES",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "xprereq: Master's student, [adviser, DGS] consent",
    "prereq": []
  },
  {
    "uid": "800665",
    "code": "AMES8444",
    "subject": "AMES",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "xprereq: Doctoral student, [adviser, DGS] consent",
    "prereq": []
  },
  {
    "uid": "800669",
    "code": "AMES8666",
    "subject": "AMES",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "xprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "818301",
    "code": "AMES8777",
    "subject": "AMES",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credits: Master's",
    "fullname": "Thesis Credits: Master's",
    "info": "Thesis Credits: Master'sprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "800663",
    "code": "AMES8888",
    "subject": "AMES",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "x",
    "prereq": []
  },
  {
    "uid": "804266",
    "code": "AMES8920",
    "subject": "AMES",
    "number": "8920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Asian Culture",
    "fullname": "Topics in Asian culture",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "800988",
    "code": "AMES8993",
    "subject": "AMES",
    "number": "8993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed readings in foreign language(s) of specialty, where appropriate.prereq: PhD student",
    "prereq": []
  }
]