[
  {
    "uid": "787609",
    "code": "ANES5587",
    "subject": "ANES",
    "number": "5587",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinical Physiology I",
    "fullname": "Adv Clinical Physiology I for Nurse Anesthetists",
    "info": "Cellular mechanisms underlying systems physiology. Cellular physiology, physiology of excitable tissues, renal physiology, cardiovascular physiology, hemostasis.",
    "prereq": []
  },
  {
    "uid": "787660",
    "code": "ANES5588",
    "subject": "ANES",
    "number": "5588",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinica Physiology II",
    "fullname": "Advanced Clinical Physiology II for Nurse Anesthetists",
    "info": "Respiratory physiology, acid-base physiology, gastrointestinal physiology, metabolism, endocrinology, reproductive physiology, physiology of pregnancy/labor.prereq: Advanced Clinical Physiology I for Nurse Anesthetists",
    "prereq": []
  },
  {
    "uid": "789426",
    "code": "ANES5686",
    "subject": "ANES",
    "number": "5686",
    "honors": false,
    "writingIntensive": false,
    "name": "Chem/Phys for Nurse Anes",
    "fullname": "Chemistry and Physics for Nurse Anesthetists",
    "info": "Chemical equilibrium, organic chemistry, physics of fluids/gases, anesthetic applications.prereq: General chemistry or instr consent",
    "prereq": []
  },
  {
    "uid": "012890",
    "code": "ANES7015",
    "subject": "ANES",
    "number": "7015",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Stud: Anes Topics",
    "fullname": "Directed Study, Anesthesia Topics/Project Course Development",
    "info": "",
    "prereq": []
  },
  {
    "uid": "011547",
    "code": "ANES7181",
    "subject": "ANES",
    "number": "7181",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Anesthesiology",
    "fullname": "Introduction to Anesthesiology",
    "info": "The student will receive supervised training in the operating suite at Fairview-University Medical Center (University Campus), assisting in the management of all types of surgical patients under the direction of the faculty and residents of the Department of Anesthesiology. The rotation is divided into one-week segments; each student may select sub-specialty areas on the basis of interest. The student will spend the majority of his/her time in the operating room because only under such controlled conditions can there be leisurely teaching of essential life-support skills. There is no night or weekend call. ",
    "prereq": []
  },
  {
    "uid": "011548",
    "code": "ANES7182",
    "subject": "ANES",
    "number": "7182",
    "honors": false,
    "writingIntensive": false,
    "name": "Anesthesiology Research",
    "fullname": "Anesthesiology Research",
    "info": "On- or off-campus learning experiences individually arranged between the student and a faculty member for credit in areas not covered by regular courses. May include clinical/basic science research, library research or special projects. ",
    "prereq": []
  },
  {
    "uid": "798131",
    "code": "ANES7183",
    "subject": "ANES",
    "number": "7183",
    "honors": false,
    "writingIntensive": false,
    "name": "Anesthesiology Advanced Electv",
    "fullname": "Anesthesiology Advanced Elective",
    "info": "The experience will build on the basics learned in rotation 7181, and include greater utilization of manual skills such as starting i.v. catheters, endotracheal intubation, and a greater understanding of physiology and interpretation of data from multiple simultaneous monitors.",
    "prereq": []
  },
  {
    "uid": "808369",
    "code": "ANES7184",
    "subject": "ANES",
    "number": "7184",
    "honors": false,
    "writingIntensive": false,
    "name": "Rural Externship in Clin. Anes",
    "fullname": "Rural Externship in Clinical Anesthesiology",
    "info": "Students shadow surgical medical director in all aspects of patient care and administrative duties. Care of patients in OR. Clinic visits. ICU consult. Riding with paramedics. Meeting with CEO of hospital for strategic planning.",
    "prereq": []
  },
  {
    "uid": "818220",
    "code": "ANES7185",
    "subject": "ANES",
    "number": "7185",
    "honors": false,
    "writingIntensive": false,
    "name": "Anesthesiology Advanced Elect",
    "fullname": "Anesthesiology Advanced Elective",
    "info": "This 4-week advanced rotation is focused on the medical student who is interested in pursuing a career in anesthesiology and/or desires additional anesthesia experience in managing medically complex patients undergoing medium to high-risk surgery. Students will have the opportunity to care for the aging veteran population. There will be an emphasis on managing patients with multiple co-morbid conditions undergoing cardiac and vascular surgery. Additionally, medical students will learn more advanced concepts during cases that include ENT, thoracic, and abdominal surgery. The medical student will develop skills including placing peripheral intravenous catheters, endotracheal intubation, arterial lines, and central lines.  The medical student will develop a greater understanding of perioperative cardiovascular physiology/hemodynamics and pulmonary physiology, ventilator management and interpretation of data from multiple simultaneous monitors. They will function at the level of a sub-intern and will be given advanced responsibilities consistent with their level of knowledge and skill.",
    "prereq": []
  },
  {
    "uid": "012891",
    "code": "ANES7186",
    "subject": "ANES",
    "number": "7186",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Practice in Anes",
    "fullname": "Clinical Practice in Anesthesia",
    "info": "",
    "prereq": []
  },
  {
    "uid": "818914",
    "code": "ANES7187",
    "subject": "ANES",
    "number": "7187",
    "honors": false,
    "writingIntensive": false,
    "name": "Peroperative Clinic Rotation",
    "fullname": "Peroperative Clinic Rotation",
    "info": "This is a 4-week advanced elective that takes place in the Preoperative Anesthesia Clinic with the department of Anesthesiology faculty.  The goal of this elective is for medical students to gain experience evaluating medically complex patients and optimizing them prior to their procedures.This elective is geared towards medical students planning to go into the primary care fields, surgery, or anesthesiology.  Primary care physicians routinely perform the preoperative history and physical examinations for patients’ procedures.  They will gain a greater understanding of the anesthetic and procedural considerations that affect their patients. Medical students will work closely with the Preoperative Anesthesia Clinic faculty and anesthesiology residents.  Initially, the medical student will shadow residents/faculty, then they will progress to see patients independently and present to staff pertinent history and physical, assessment, and plan of action.  They will also assist in the coordination of the patient’s care which involves contacting primary care providers, surgical teams, and consultants.The medical student will have the opportunity to follow select medically complex patients from a patient-centered, longitudinal perspective including coordination of care; application of evidence based, best practice protocols and pathways;  observation of the anesthetic care of the patient intraoperatively;  observation of the recovery and rehabilitation of the patient post operatively; and finally return of the patient to his or her primary care physician.  This is a unique, all encompassing view of a complex health care event not typically afforded trainees in traditional rotations.   Over the course of 4 weeks, the medical student will have ten one-on-one didactic sessions in journal club format with faculty to cover topics related to the pre-operative assessment including evaluation of cardiovascular risk and testing, pulmonary testing, diabetes, and frailty.    ",
    "prereq": []
  },
  {
    "uid": "820303",
    "code": "ANES7188",
    "subject": "ANES",
    "number": "7188",
    "honors": false,
    "writingIntensive": false,
    "name": "Pain Medicine Elective",
    "fullname": "Pain Medicine Elective",
    "info": "Pain is a common ailment that physicians across a range of specialties manage. Therefore, accurately diagnosing and effectively managing pain is an important skillset to acquire. Medical students will gain a greater depth of understanding of the complex mechanisms that contribute to pain and appreciate the multidisciplinary approach to pain medicine. Medical students will spend their two weeks in both the outpatient and inpatient settings. In the chronic pain clinic they will evaluate patients with faculty, fellows, and residents, and observe and participate in interventional pain procedures. In the inpatient setting, they will observe and participate in regional anesthesia procedures prior to surgical procedures, evaluate hospitalized patients with chronic pain or complex pain management concerns and round on patients on the inpatient pain management service. Students can fulfill the anesthesiology prerequisite either by completing ANES 7181 or by doing at least 2 weeks of anesthesiology in SURG 7552.",
    "prereq": {
      "or": [
        {
          "code": "ANES 7181",
          "subject": "ANES",
          "id": "7181"
        },
        {
          "code": "SURG 7552",
          "subject": "SURG",
          "id": "7552"
        }
      ]
    }
  },
  {
    "uid": "825102",
    "code": "ANES7189",
    "subject": "ANES",
    "number": "7189",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern: CVICU",
    "fullname": "Acting Internship: Cardiovascular Intensive Care Unit",
    "info": "In the U.S., cardiovascular disease is the leading cause of mortality and many patients require surgical treatment for cardiovascular disease. Understanding the principles of diagnosis and management of complications in cardiac surgical patients is essential for students interested in pursuing a career in critical care regardless of avenue (surgery, emergency medicine, internal medicine, and anesthesiology). The goal of the Cardiovascular ICU (CVICU) clerkship is to give students the opportunity to develop basic skills in evaluation and treatment of patients requiring cardiac surgery including management of patients requiring mechanical circulatory support such as ventricular assist devices (VAD's) and extracorporeal membrane oxygenation (ECMO). Students can fulfill the anesthesiology prerequisite either by completing ANES 7181 or by doing at least 2 weeks of anesthesiology in SURG 7552.",
    "prereq": {
      "or": [
        {
          "code": "ANES 7181",
          "subject": "ANES",
          "id": "7181"
        },
        {
          "code": "SURG 7552",
          "subject": "SURG",
          "id": "7552"
        }
      ]
    }
  },
  {
    "uid": "820133",
    "code": "ANES7195",
    "subject": "ANES",
    "number": "7195",
    "honors": false,
    "writingIntensive": false,
    "name": "Virtual Anes Advanced Elective",
    "fullname": "Virtual Anesthesiology Advanced Elective",
    "info": "Students will learn more advanced concepts by being exposed to cardiothoracic anesthesiology, regional,and/or pediatric anesthesiology.Options:2 weeks of cardiac anesthesiology OR1 week of regional anesthesiology and pain and 1 week of pediatric anesthesiology.The medical student will develop a greater understanding of perioperative cardiovascularphysiology/hemodynamics, pulmonary physiology, and interpretation of data from multiple monitors in adult patients undergoing cardiothoracic surgery.The regional anesthesia rotation will include learning about specific procedures such as transversus abdominisplane and brachial plexus blocks, epidural catheter placement, and the management of acute pain patients.The medical student will develop a greater understanding of perioperative cardiovascularphysiology/hemodynamics, pulmonary physiology, and interpretation of data in pediatric patients undergoingcommon procedures.",
    "prereq": []
  },
  {
    "uid": "820213",
    "code": "ANES7196",
    "subject": "ANES",
    "number": "7196",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Clinical Anes",
    "fullname": "Advanced Clinical Anesthesiology Elective",
    "info": "Medical students will learn advanced anesthesiology concepts by being exposed to the anesthetic management of patients undergoing cardiothoracic procedures in the clinical setting.  Medical students will develop a greater understanding of perioperative cardiovascular physiology/hemodynamics, pulmonary physiology, and interpretation of data from multiple monitors in adult patients undergoing cardiothoracic surgery. prereq: ANES 7195 ",
    "prereq": {
      "code": "ANES 7195",
      "subject": "ANES",
      "id": "7195"
    }
  },
  {
    "uid": "012885",
    "code": "ANES7265",
    "subject": "ANES",
    "number": "7265",
    "honors": false,
    "writingIntensive": false,
    "name": "General Anesthesia",
    "fullname": "General Anesthesia",
    "info": "General anesthesia.",
    "prereq": []
  },
  {
    "uid": "012886",
    "code": "ANES7266",
    "subject": "ANES",
    "number": "7266",
    "honors": false,
    "writingIntensive": false,
    "name": "Regional Anesthesia",
    "fullname": "Regional Anesthesia",
    "info": "Regional anesthesia.",
    "prereq": []
  },
  {
    "uid": "012887",
    "code": "ANES7267",
    "subject": "ANES",
    "number": "7267",
    "honors": false,
    "writingIntensive": false,
    "name": "Pre-Postanes Eval",
    "fullname": "Pre and Postanesthetic Evaluation",
    "info": "Pre and Postanesthetic Evaluation",
    "prereq": []
  },
  {
    "uid": "012888",
    "code": "ANES7268",
    "subject": "ANES",
    "number": "7268",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar",
    "fullname": "Seminar",
    "info": "Seminar.",
    "prereq": []
  },
  {
    "uid": "012892",
    "code": "ANES7286",
    "subject": "ANES",
    "number": "7286",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Stud: Anes Proj Clinical",
    "fullname": "Directed Study Anesthesia Project: Clinical",
    "info": "",
    "prereq": []
  },
  {
    "uid": "826263",
    "code": "ANES7601",
    "subject": "ANES",
    "number": "7601",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Device Innovation",
    "fullname": "Introduction to Medical Device Innovation",
    "info": "Introduction to medical device innovation will provide a 4-week experience for fourth-year medical students to immerse themselves in the world of medical device innovation. Students will have opportunities to visit industry and see firsthand how medical devices are developed. Students will come to the course with their own ideas and gain experience with prototyping in our own Bakken medical devices center, and will work with the Carlson School of Management to participate in the evaluation lab and perform a marketability assessment of their idea.",
    "prereq": []
  },
  {
    "uid": "805686",
    "code": "ANES7910",
    "subject": "ANES",
    "number": "7910",
    "honors": false,
    "writingIntensive": false,
    "name": "Anesthesiology Med Residency",
    "fullname": "Anesthesiology Medical Residency",
    "info": "Anesthesiology medical residency.",
    "prereq": []
  },
  {
    "uid": "805687",
    "code": "ANES7930",
    "subject": "ANES",
    "number": "7930",
    "honors": false,
    "writingIntensive": false,
    "name": "Anesthesiology Med Fellowship",
    "fullname": "Anesthesiology Medical Fellowship",
    "info": "Anesthesiology medical fellowship.",
    "prereq": []
  },
  {
    "uid": "012889",
    "code": "ANES8269",
    "subject": "ANES",
    "number": "8269",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in Anesthesia",
    "fullname": "Research in Anesthesia",
    "info": "",
    "prereq": []
  }
]