[
  {
    "uid": "809385",
    "code": "APS5100",
    "subject": "APS",
    "number": "5100",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in APS",
    "fullname": "Topics in Applied Professional Studies",
    "info": "Topics in Applied Professional Studies.prereq: dept consent",
    "prereq": []
  },
  {
    "uid": "809330",
    "code": "APS5101",
    "subject": "APS",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecological Design Horticulture",
    "fullname": "Ecological Design for Horticulture",
    "info": "Polyculture and Ecological Design is the design science of assembling plants into ecologically balanced systems. Natural polycultures are self-supporting plant communities in forests, wetlands, and prairies. Investigate ecological functions and services that are important components for sustainable horticultural design. Learn to apply the ecological landscape design language and technique while using the permaculture design process to create ecologically functional plant communities. Crucial discussions will assess the solutions in horticultural design for adapting to accelerated climate disruption, and follow natures momentum as a guide to sustainable production systems. Lab sessions will demonstrate, and you will develop, the skills and foresight needed to assess, research, concept, design, and present polycultures in a sequential and professional process.",
    "prereq": []
  },
  {
    "uid": "815248",
    "code": "APS5102",
    "subject": "APS",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "Garden Design",
    "fullname": "Garden Design: Theory and Application",
    "info": "This course provides an overview of the garden design process, the analysis and conceptual design of the landscape, exploration of the design characteristics of plants, sustainable design and a descriptive journey into several historical garden styles.You will be introduced to a variety of topics, including the design process, basic design principles, and the basic concepts of graphic communication in garden design. A working knowledge of design process and principles is critical to quality design. This course is intended to strengthen student awareness and knowledge of design rather than fully develop the skills necessary to draw, develop and implement garden designs.This course is different from fact-based horticulture science courses. Although you will be held responsible for learning a broad range of principles and processes in this course, there are typically no absolute right answers relative to design assessment and critique. What is more important is that you gain the ability to articulate and assess design character and quality and give evidence of your thought process.",
    "prereq": []
  },
  {
    "uid": "807163",
    "code": "APS5103",
    "subject": "APS",
    "number": "5103",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainable Agri Concepts",
    "fullname": "Integration of Sustainable Agriculture Concepts",
    "info": "Biodiversity, ecological balance, nutrient cycling, soil quality. Organic practices of tillage, fertility management, weed control, insect control. Specific practices compared with conventional/integrated pest management. Economic analysis of both organic/conventional practices.prereq: AGRO 1101 or AGRO 1103 or BIOL 1001 or BIOL 1009 or HORT 1001 or HORT 6011 or instr consent, [sr or grad student admitted to MPS in horticulture]Because of the 5xxx level, undergraduates need permission numbers to register. Students can obtain permissions by writing to:  reefx001@umn.edu ",
    "prereq": {
      "and": [
        {
          "code": "AGRO 1101",
          "subject": "AGRO",
          "id": "1101"
        },
        {
          "code": "AGRO 1103",
          "subject": "AGRO",
          "id": "1103"
        },
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "HORT 1001",
          "subject": "HORT",
          "id": "1001"
        },
        {
          "code": "HORT 6011",
          "subject": "HORT",
          "id": "6011"
        }
      ]
    }
  },
  {
    "uid": "820474",
    "code": "APS5104",
    "subject": "APS",
    "number": "5104",
    "honors": false,
    "writingIntensive": false,
    "name": "Conservation at Botanic Garden",
    "fullname": "Conservation at Botanic Gardens",
    "info": "In this class, students will explore conservation strategies of botanic gardens using the Plant Conservation Program at the University of Minnesota Landscape Arboretum as a model. Discussions will center around scientific and non-scientific strategies, as well as limitations and strengths of the botanic garden system in regards to rare plant conservation. There are many different conservation programs around the continent and world, all of them working on different species and attacking conservation issues with different toolsets, goals, and even philosophies. Some of these gardens interact with each other and combine resources, but some do not. Some gardens work at very large scales of conservation and some work at much smaller, local scales. During this course, there will be opportunities to interact with conservation programs at other botanic gardens.",
    "prereq": []
  },
  {
    "uid": "826158",
    "code": "APS5105",
    "subject": "APS",
    "number": "5105",
    "honors": false,
    "writingIntensive": false,
    "name": "Where People & Plants Meet",
    "fullname": "Where People & Plants Meet: Social Science Dimensions of Horticulture",
    "info": "How do we understand the role that horticulture plays in society and its meaning for individuals and communities? This seminar course investigates the multiple intersections that horticultural science has with society through examining three such intersections. The first is the intersection of horticulture and psychology to understand how we can better explain individual pro-environmental behaviors as well as horticulture’s impact on health and well-being. The second intersection is horticulture and sociology, examining how current, and potential future horticultural landscapes impact communities and either reinforce or diverge from powerful social norms around ‘expected and acceptable’ landscapes. The final intersection, horticulture and policy assess how policies and ordinances impact the landscapes around us and how changing them may impact landscape-level sustainability.",
    "prereq": []
  },
  {
    "uid": "806471",
    "code": "APS5201",
    "subject": "APS",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "JobSearchPrep for GradStudents",
    "fullname": "Career and Job Search Preparation for Graduate Students",
    "info": "Job search and career development tools. Goals, networking, job search, resume/CV, interviewing. Assignments include resume/CV, informational interview, career development plan.prereq: dept consent",
    "prereq": []
  },
  {
    "uid": "813630",
    "code": "APS5901",
    "subject": "APS",
    "number": "5901",
    "honors": false,
    "writingIntensive": false,
    "name": "Microeconomics for HS Teaching",
    "fullname": "Microeconomics for High School Teaching",
    "info": "This is an online course intended for in-service and pre-service teachers who want to build or enhance their content knowledge in microeconomics and their pedagogical skills in teaching microeconomics to high school students. The course will include strategies for developing curriculum and instruction for microeconomics that engage students of diverse backgrounds.prereq: The prerequisites for this course are: licensed secondary school teachers in social studies, business, consumer science, or agricultural education; or pre-service secondary school teachers in a teaching licensure program in social studies, business, consumer science,and dept consent",
    "prereq": []
  },
  {
    "uid": "819806",
    "code": "APS5950",
    "subject": "APS",
    "number": "5950",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in APS",
    "fullname": "Topics in APS",
    "info": "Topics in APS",
    "prereq": []
  },
  {
    "uid": "825244",
    "code": "APS5993",
    "subject": "APS",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed Studiesprereq: dept consent",
    "prereq": []
  },
  {
    "uid": "825245",
    "code": "APS5994",
    "subject": "APS",
    "number": "5994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed Researchprereq: dept consent",
    "prereq": []
  },
  {
    "uid": "816764",
    "code": "APS6011",
    "subject": "APS",
    "number": "6011",
    "honors": false,
    "writingIntensive": false,
    "name": "Presentations in Bio Sci",
    "fullname": "Presentations in the Biological Sciences",
    "info": "Course introduces students to the diverse ways in whichbiologists communicate in their professional lives. In this course students will choose an article from the primary literature and practice presenting the information to a range of audiencesthrough a variety of techniques including soundbites, interviews, conference talks, conference posters, TED talks, podcasts, and internet videos.",
    "prereq": []
  },
  {
    "uid": "805916",
    "code": "APS6950",
    "subject": "APS",
    "number": "6950",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Professional Studies",
    "fullname": "Topics in Professional Studies",
    "info": "Topics in professional studies.prereq: dept consent",
    "prereq": []
  }
]