[
  {
    "uid": "009918",
    "code": "ARTH1001",
    "subject": "ARTH",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Western Art",
    "fullname": "Introduction to Western Art",
    "info": "This course serves as a general introduction to key questions about the nature and history of art in the West from the prehistoric to contemporary eras: Who creates art and why? What unique insights does it provide into the past? And, finally, what good does art do? Organized around these three central questions, lectures, readings, and assignments will address several themes, central to understanding the history of Western art in a wider global context: (1) the forms, functions, and symbolism of images, objects, and spaces; (2) materials, techniques, and skills deployed by artists, architects, artisans, and laborers to make aesthetic objects; (3) the historical and cultural construction of visual experiences; and (4) customs, beliefs, and values associated with art production, collection, and exhibition in various cultures, including patronage, fame, trade, cross-cultural influence, authenticity, and reproduction.",
    "prereq": []
  },
  {
    "uid": "795353",
    "code": "ARTH1002W",
    "subject": "ARTH",
    "number": "1002",
    "honors": false,
    "writingIntensive": true,
    "name": "Why Art Matters",
    "fullname": "Why Art Matters",
    "info": "Introduction to history of topics that investigate power/importance of art both globablly and in its diverse forms, from architecture and painting to video and prints.  Sacred space, propaganda, the museum, art/gender, art/authority, tourism.",
    "prereq": []
  },
  {
    "uid": "009041",
    "code": "ARTH1004W",
    "subject": "ARTH",
    "number": "1004",
    "honors": false,
    "writingIntensive": true,
    "name": "Introduction to Asian Art",
    "fullname": "Introduction to Asian Art",
    "info": "This one-semester course is an introduction to painting, sculpture, and architecture from South, Southeast, and East Asia. It will cover works from ancient cultures to those of contemporary Asian diasporas. Resisting the impossible task of covering everything, we will instead home in on specific objects in order to understand them in their broader cultural, religious, and social contexts. We will trace the ways in which common themes and problems appear in different art forms and in different places, and we will discover the ways in which seemingly disparate styles and objects may be productively understood in conversation with each other. We will work together to create an interpretive model that is synthetic, critical, and appreciative of the enormously diverse field that is Asian Art. Lectures will move from explanatory descriptions of objects and histories that are covered in the textbook to critical interpretations of the historiographies that shape the contemporary reception of Asian art.",
    "prereq": []
  },
  {
    "uid": "801951",
    "code": "ARTH1905",
    "subject": "ARTH",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "800718",
    "code": "ARTH1907W",
    "subject": "ARTH",
    "number": "1907",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: F or fewer than 30 cr",
    "prereq": []
  },
  {
    "uid": "795106",
    "code": "ARTH1909W",
    "subject": "ARTH",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified on One Stop Course Guide.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "788056",
    "code": "ARTH1910W",
    "subject": "ARTH",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "816984",
    "code": "ARTH1911",
    "subject": "ARTH",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Witches, Ghosts, & Evil Clowns",
    "fullname": "Witches, Ghosts, and Evil Clowns",
    "info": "From ancient images through popular culture and social media, our art, stories, and beliefs have been filled with figures of fear. The returning dead, people with weird powers, demons, monsters, and mad killers haunt our dreams, but also seem to show up during waking hours. People have committed acts of violence based on fears of such beings. Yet we are also drawn to them, depicting and playing with them, and taking on their guises to scare ourselves for fun. This course will investigate these figures of fear, using approaches from art history, folklore, anthropology, and other fields. We will read a variety of texts, and will also encounter and think about legends, art, movies, literature, games, costumes, haunted houses, and objects used for magic and protection. This course will help you build skills of close observation and visual analysis, learn surprising things about your own surroundings, think critically about culture, and deepen your appreciation for the cultural knowledge and play of communication that make folklife, art, and popular culture so rich and remarkable.",
    "prereq": []
  },
  {
    "uid": "817946",
    "code": "ARTH1912",
    "subject": "ARTH",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Truth and Lies",
    "fullname": "Truth and Lies: Comparing Theories of the Image",
    "info": "What is an image? Is it what you see, or what your mind makes of it? Can an image be felt? Or heard? How is it that images produce emotions in their viewers such as fear, pity, or pleasure? If \"seeing is believing\" and \"the camera never lies,\" why do some images appear truthful, while others are suspect? How do images make meaning, and how do we learn to read them? Is there a relationship between reading text and reading an image? Does reality exist prior to its representation, or is it constituted through representation?This course will examine these questions comparatively in Western and South Asian aesthetic and philosophical traditions, from Plato's \"Republic\" to Bharata's \"Natyasastra.\" We will study diverse media, from painting to photography to narrative fiction, and consider how the medium of representation relates to different forms of copying, imitation, and the production of knowledge. This course will equip students not only to theorize images of the past, but to read and interpret images that we interact with in nearly every moment of our daily lives.",
    "prereq": []
  },
  {
    "uid": "820312",
    "code": "ARTH1913",
    "subject": "ARTH",
    "number": "1913",
    "honors": false,
    "writingIntensive": false,
    "name": "Plague, Death, and Art",
    "fullname": "Plague, Death, and Art in the Middle Ages",
    "info": "The bubonic plague of the Middle Ages—commonly known as the Black Death—took the lives of some two-hundred million people in Eurasia and Africa, making it the deadliest pandemic on record. Focusing on the plague’s peak in the fourteenth century, this seminar will engage art and material culture, as well as primary texts in translation, to study how the plague impacted daily life in the Middle Ages and affected cosmology, religious practices, and conceptions of death for centuries thereafter. The course will also engage methods and theories of environmental history and global history to better understand the scope of the pandemic. Students will learn how to analyze images, how to conduct research with historical sources, and will gain academic reading skills. We will also consider what the Middle Ages has to do with the modern era.",
    "prereq": []
  },
  {
    "uid": "825086",
    "code": "ARTH1914",
    "subject": "ARTH",
    "number": "1914",
    "honors": false,
    "writingIntensive": false,
    "name": "Scratched and Smashed",
    "fullname": "Scratched and Smashed: History of Destroying Images and Iconoclasm",
    "info": "Have you ever seen a defaced statue? Ever heard of an image of a holy figure attacked or destroyed? Sculptures smashed and monuments taken down have filled our news feed and generated much heated public debate recently. What prompts such anger and violence? What makes some objects appear offensive and inappropriate? What kind of a threat do they pose? Objects, images, and buildings have been attacked, mutilated, and destroyed throughout history, for their specific visual contents or their very existence have been seen as going against religious bans, or upsetting common cultural values and political sensitivities. ",
    "prereq": []
  },
  {
    "uid": "825748",
    "code": "ARTH1915",
    "subject": "ARTH",
    "number": "1915",
    "honors": false,
    "writingIntensive": false,
    "name": "Broadcasts: Art and the Media",
    "fullname": "Broadcasts: Art, the Media, and Political Turmoil, the 1960s and Today",
    "info": "Violence, racial reckoning, war, and media manipulation, the 1960s and the 2000s are periods of political turmoil where artists examine, question, and create alternatives to the news media. This course studies artistic responses to such public crises as the Kennedy Assassination and the Capitol Insurrection, the Vietnam War, and Black Lives Matter.",
    "prereq": []
  },
  {
    "uid": "825749",
    "code": "ARTH1916",
    "subject": "ARTH",
    "number": "1916",
    "honors": false,
    "writingIntensive": false,
    "name": "Witches, Ghosts, & Evil Clowns",
    "fullname": "Witches, Ghosts, and Evil Clowns: Figures of Fear in Art, Folklore, and Popular Culture",
    "info": "From ancient images through popular culture and social media, our art, stories, and beliefs have been filled with figures of fear. The returning dead, people with weird powers, demons, monsters, and mad killers haunt our dreams, but also seem to show up during waking hours. People have committed acts of violence based on fears of such beings. Yet we are also drawn to them, depicting and playing with them, and taking on their guises to scare ourselves for fun. This course will investigate these figures of fear, using approaches from art history, folklore, anthropology, and other fields. We will read a variety of texts, and will also encounter and think about legends, art, movies, literature, games, costumes, haunted houses, and objects used for magic and protection. This course will help you build skills of close observation and visual analysis, learn surprising things about your own surroundings, think critically about culture, and deepen your appreciation for the cultural knowledge and play of communication that make folklife, art, and popular culture so rich and remarkable.",
    "prereq": []
  },
  {
    "uid": "008389",
    "code": "ARTH1921W",
    "subject": "ARTH",
    "number": "1921",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Film Study",
    "fullname": "Introduction to Film Study",
    "info": "Fundamentals of film analysis and an introduction to the major theories of the cinema, presented through detailed interpretations of representative films from the international history of the cinema.",
    "prereq": []
  },
  {
    "uid": "796570",
    "code": "ARTH1940",
    "subject": "ARTH",
    "number": "1940",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Art History",
    "fullname": "Topics in Art History",
    "info": "Topics specified in Course Guide.",
    "prereq": []
  },
  {
    "uid": "002533",
    "code": "ARTH3005",
    "subject": "ARTH",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "Identity and American Art",
    "fullname": "Identity and American Art",
    "info": "Where do we see American identity? How was it invented? What difference do different identities make in a nation of over 330 million people? This class explores the history of visual culture and the fine arts in the United States, from the 1600s to the present. Our goal is to understand how images and objects define what being \"American\" means—for individuals and for the public—and to see how art is a place where identity can be challenged, expanded, and transformed. Through interactive, art-based lectures, you will learn the skills of visual analysis, historical research, and art appreciation. Whether looking at a tea set designed by Paul Revere, poppies painted by Georgia O'Keeffe, or a Midwestern landscape fashioned out of wood by George Morrison: we'll use art to ask big questions about American experience. ",
    "prereq": []
  },
  {
    "uid": "797103",
    "code": "ARTH3008",
    "subject": "ARTH",
    "number": "3008",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Art",
    "fullname": "History of Ancient Art",
    "info": "Architecture, sculpture, and painting of selected early cultures; emphasis on influences contributing to the development of Western art.",
    "prereq": []
  },
  {
    "uid": "009939",
    "code": "ARTH3009",
    "subject": "ARTH",
    "number": "3009",
    "honors": false,
    "writingIntensive": false,
    "name": "Intersectional Medieval Art",
    "fullname": "Intersectional Medieval Art",
    "info": "Grounded in critical race theory, intersectionality, and queer theory, this class draws on primary texts and a range of visual and material sources to trace the histories, experiences, and representations of marginalized identities in the medieval world. We will consider gender, sexuality, and race in the context of Jewish, Christian, and Islamic cultures during the Middle Ages. This class will examine topics including transgender saints, miraculous transformations, demonic possession, female artists and patrons, the \"monstrous races\" of travel accounts, and gender-affirming surgeries. In contrast to misconceptions of a homogenous white European past, the reality of medieval Europe was diverse and complex, and its boundaries - geographical, cultural, bodily, and otherwise - were in flux, as reflected in its visual and material culture.",
    "prereq": []
  },
  {
    "uid": "005551",
    "code": "ARTH3011W",
    "subject": "ARTH",
    "number": "3011",
    "honors": false,
    "writingIntensive": true,
    "name": "Ren./Baroque Art",
    "fullname": "History of Renaissance and Baroque Art",
    "info": "Major architects, sculptors, and painters in Western Europe from the 15th through the 18th centuries (e.g. Brunelleschi, Michelangelo, Raphael, Leonardo, Caravaggio, Bernini, Rembrandt, Rubens, Poussin, Watteau).",
    "prereq": []
  },
  {
    "uid": "002529",
    "code": "ARTH3012",
    "subject": "ARTH",
    "number": "3012",
    "honors": false,
    "writingIntensive": false,
    "name": "19th and 20th Century Art",
    "fullname": "19th and 20th Century Art",
    "info": "Major monuments/issues of modern period. Sculpture, architecture, painting, prints. Neo-classicism, romanticism, realism, impressionism, evolution of modernism, symbolism, fauvism, cubism, dadaism, surrealism, abstract expressionism, pop art, conceptualism, postmodernism.",
    "prereq": []
  },
  {
    "uid": "008205",
    "code": "ARTH3013",
    "subject": "ARTH",
    "number": "3013",
    "honors": false,
    "writingIntensive": false,
    "name": "East Asian Art",
    "fullname": "Introduction to East Asian Art",
    "info": "A selective examination of works of art produced in China, Korea and Japan from the neolithic era to modern times. Nearly every major type of object and all major styles are represented.",
    "prereq": []
  },
  {
    "uid": "002767",
    "code": "ARTH3014W",
    "subject": "ARTH",
    "number": "3014",
    "honors": false,
    "writingIntensive": true,
    "name": "Art of India",
    "fullname": "Art of India",
    "info": "Indian sculpture, architecture, and painting from the prehistoric Indus Valley civilization to the present day.",
    "prereq": []
  },
  {
    "uid": "002413",
    "code": "ARTH3015W",
    "subject": "ARTH",
    "number": "3015",
    "honors": false,
    "writingIntensive": true,
    "name": "Art of Islam",
    "fullname": "Art of Islam",
    "info": "Architecture, painting, and other arts from Islam's origins to the 20th century. Cultural and political settings as well as themes that unify the diverse artistic styles of Islamic art will be considered.",
    "prereq": []
  },
  {
    "uid": "002414",
    "code": "ARTH3017",
    "subject": "ARTH",
    "number": "3017",
    "honors": false,
    "writingIntensive": false,
    "name": "Islamic Culture",
    "fullname": "Islamic Culture",
    "info": "Emphasis on visual arts and literature produced by the Muslim world from Spain to the Indian sub-continent. Analysis of original visual and literary sources will formthe basis for understanding diverse cultural developments.",
    "prereq": []
  },
  {
    "uid": "817706",
    "code": "ARTH3018",
    "subject": "ARTH",
    "number": "3018",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of the Ottoman Empire",
    "fullname": "Art of the Ottoman Empire",
    "info": "This course offers a wide-ranging introduction to visual culture under the Ottoman Empire. Initially formed as a small principality at the beginning of the fourteenth century in Anatolia, the Ottoman polity established itself as a major political and military power through the early modern period and beyond. With emphasis placed upon key monuments and objects, we will examine an array of artistic media, ranging from manuscript illumination and calligraphy to ceramics, textiles, metalwork, glasswork and jewelry. Major themes include the urban transformation of the Byzantine capital; the formation of imperial ideology and its visual articulation, the formation of a distinctive imperial style across media; the operation of court ateliers and societies of artists and artisans; contacts and interactions with the European and Islamic contemporaries; and cultural and artistic \"decline.\"  ",
    "prereq": []
  },
  {
    "uid": "820052",
    "code": "ARTH3019",
    "subject": "ARTH",
    "number": "3019",
    "honors": false,
    "writingIntensive": false,
    "name": "Buddhist Art and Architecture",
    "fullname": "Buddhist Art and Architecture",
    "info": "This class provides an introduction to Buddhist art and architecture, from the sixth-century BCE to the present.  Beginning with the life of the historical Buddha (563-483), it will follow the development of Buddhist art in India before tracing it across the Silk Road to China, Korea, and Japan.  The class will consider how art and architecture evolved to serve the needs of Buddhism as its doctrine and practice evolved.  At the same, we will consider how Buddhist cosmology and metaphysics were translated into culturally specific modes that served the multifarious cultural and artistic traditions of Asia.",
    "prereq": []
  },
  {
    "uid": "825337",
    "code": "ARTH3021",
    "subject": "ARTH",
    "number": "3021",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and Revolution, 1789-1889",
    "fullname": "Art and Revolution, 1789-1889",
    "info": "The visual arts both reflected and shaped the large-scale transformations—from imperialism to the rise of the ‘new’ woman—that defined the modern world as we know it. Focusing on European artworks produced between 1789 and 1889, we’ll investigate how paintings, sculptures, prints, and photographs both illustrated and fashioned the revolutionary character of the period and the enduring legacies of the nineteenth century today.",
    "prereq": []
  },
  {
    "uid": "826650",
    "code": "ARTH3022",
    "subject": "ARTH",
    "number": "3022",
    "honors": false,
    "writingIntensive": false,
    "name": "Impressionism: 1874 to Today",
    "fullname": "Impressionism: 1874 to Today",
    "info": "Coinciding with the 150th anniversary of the first Impressionist Exhibition in Paris, this study abroad course concerns the origins, evolution, and legacies of one of the most well-researched and revered movements in modern art history. Beginning with the landmark 1874 exhibition, which gave the ragtag group of avant-garde artists its name, it will follow the development of Impressionist and Post-Impressionist art through the late nineteenth century before exploring twentieth- and twenty-first century counterpoints to the now-canonical artworks of Manet, Degas, Monet, Morisot, Caillebotte, Renoir, Gauguin, Van Gogh, and others. Through a mixture of lectures, readings, class discussion, walking tours, and the close, careful study of original artworks at the Louvre, Musée d’Orsay, Musée Marmottan, and elsewhere, students will learn about the connection between Impressionism and the city where it first emerged; art-market, collecting and curatorial practices; the reception of Impressionism abroad; and, finally, how scholarly interpretations of Impressionist artworks have changed over time.From formal analysis to more recent art historical approaches, informed by gender and sexuality studies and postcolonial theory, the course will bring students to consider the merits and limitations of studying the ‘‘canon’’ and what, if anything, remains to be said about Impressionism today.",
    "prereq": []
  },
  {
    "uid": "797109",
    "code": "ARTH3035",
    "subject": "ARTH",
    "number": "3035",
    "honors": false,
    "writingIntensive": false,
    "name": "Myth in Western Art",
    "fullname": "Classical Myth in Western Art",
    "info": "An exploration of the role of myth in the visual arts through examination of major figures and stories that became popular in the ancient world and have fascinated artists and audiences ever since.",
    "prereq": []
  },
  {
    "uid": "797108",
    "code": "ARTH3142",
    "subject": "ARTH",
    "number": "3142",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of Egypt",
    "fullname": "Art of Egypt",
    "info": "Arts and architecture of Egypt from prehistoric times to the emergence of modern Egypt, with emphasis on elements of continuity and change that have shaped Egyptian culture.",
    "prereq": []
  },
  {
    "uid": "797111",
    "code": "ARTH3152",
    "subject": "ARTH",
    "number": "3152",
    "honors": false,
    "writingIntensive": false,
    "name": "Anc Greek Art & Archaeology",
    "fullname": "Art and Archaeology of Ancient Greece",
    "info": "This course will provide an introduction to the history of Greek art, architecture and archaeology from the formation of the Greek city states in the ninth century BCE, through the expansion of Greek culture across the Mediterranean and Asia in the Hellenistic period, to the coming of Rome in the first century BCE. While this survey concentrates on the main developments of Greek art, an important sub-theme of this course this is the changes Classical visual culture underwent as it served non-Greek peoples, including the role it played for Alexander and his successors in forging multiethnic, globally minded empires in Western, Central and South Asia. No background in the time period or discipline is expected and therefore this class will also serve as an introduction to interdisciplinary study of art history and the classical world. A number of art historical methodologies will be introduced in order to not only give students a useful background in art history but to give them the tools to think as art historians and incorporate related visual and textual evidence meaningfully into their writing. ",
    "prereq": []
  },
  {
    "uid": "797110",
    "code": "ARTH3162",
    "subject": "ARTH",
    "number": "3162",
    "honors": false,
    "writingIntensive": false,
    "name": "Rom Art & Arch",
    "fullname": "Roman Art and Archaeology",
    "info": "Introduction to history of Roman art, from formation of city-state of Rome under Etruscan domination, to transformation of visual culture in late antiquity under peoples influenced by the Romans.",
    "prereq": []
  },
  {
    "uid": "806529",
    "code": "ARTH3172",
    "subject": "ARTH",
    "number": "3172",
    "honors": false,
    "writingIntensive": false,
    "name": "Greek and Roman Art",
    "fullname": "Greek and Roman Art and Archaeology",
    "info": "History of Greek, Hellenistic, Etruscan, and Roman art from the formation of the Greek city states in the Geometric period to the transformation of Roman visual culture in the fourth century AD. Changes Classical visual culture underwent as it served non-Greek peoples, including the role it played for Alexander and his successors in forging multiethnic, globally minded empires and the many peoples influenced by the Romans not to mention their own creative reinventions. ",
    "prereq": []
  },
  {
    "uid": "806520",
    "code": "ARTH3182",
    "subject": "ARTH",
    "number": "3182",
    "honors": false,
    "writingIntensive": false,
    "name": "Art & Arch Egypt, Western Asia",
    "fullname": "Egypt and Western Asia: Art and Archaeology of Ancient Egypt and Western Asia",
    "info": "This course will provide students with foundational knowledge in the art, architecture, and archaeology of Egypt, East Africa, Asia Minor, Mesopotamia, Iran and Central Asia from the Neolithic through Late Antiquity (ca. 7,000 B.C.E. - 650 C.E.). Students will gain an understanding of the relationship between the visual material and the social, intellectual, political, and religious contexts in which it developed and functioned. In this regard, students will also gain an understanding of the evolution of, and exchanges and differences among, the visual cultures of these time periods and regions. It will also expose them to the preconditions for contemporary geopolitics in the region. ",
    "prereq": []
  },
  {
    "uid": "009744",
    "code": "ARTH3201",
    "subject": "ARTH",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Olympic Games",
    "fullname": "The Olympic Games",
    "info": "Surveys the Olympic Games (776 B.C. to A.D. 338) and other ancient athletic festivals, including those for women participants.  Greek art and literature serve as basic sources.  Comparisons are made with modern athletic events.",
    "prereq": []
  },
  {
    "uid": "805377",
    "code": "ARTH3205",
    "subject": "ARTH",
    "number": "3205",
    "honors": false,
    "writingIntensive": false,
    "name": "Pre-Columbian Art",
    "fullname": "Art of Central and South America Before Columbus",
    "info": "Art/architecture of native peoples of Americas from twelfth century B.C. until arrival of Europeans in sixteenth century. Ways that people living in diverse areas of South America/Mesoamerica used art/architecture. Tools to investigate Pre-Columbian art at more advanced levels.",
    "prereq": []
  },
  {
    "uid": "805948",
    "code": "ARTH3208",
    "subject": "ARTH",
    "number": "3208",
    "honors": false,
    "writingIntensive": false,
    "name": "Mexico On My Mind",
    "fullname": "Mexico on My Mind",
    "info": "Images/issues across time and over a vast geographic territory--from art of Pre-Columbian cultures of Mesoamerica to colonial, post-Independence, and modern Mexico to modern Chicano art in the United States. How Mexico and its people have represented themselves and been represented by others. Identify, define, and solve some of the intricate problems that arise when representing and viewing images of oneself and others. Interpret/make more informed choices. Role images play in community, national, and international politics through history. How these images have come to shape modern perceptions and how these perceptions affect people in Mexico and the United States today. ",
    "prereq": []
  },
  {
    "uid": "817128",
    "code": "ARTH3216W",
    "subject": "ARTH",
    "number": "3216",
    "honors": false,
    "writingIntensive": true,
    "name": "Chicana/o/x Art: 1960s-Present",
    "fullname": "The Power of Chicana/o/x Art: 1960s to the present",
    "info": "What is Chicana/o/x art? Does Ruben Salazar’s bluntly stated notion of a “Chicano” suggest an answer? “A Chicano [Chicana or Chicanx] is a Mexican-American with a non-Anglo image of himself [herself or themselves]” (Los Angeles Times, 1970). Chicano, Chicana, and Chicanx identities crystalized during the Chicano Movement (1965-1980), which witnessed the rise of collective mobilizations to improve the labor conditions, education, housing, health, and civil rights for Mexican Americans. From its inception, the Chicano Movement attracted artists who created a new aesthetic and framework for producing art, but they did not merely illustrate the social and civil rights movement by creating posters and flyers. Artists theorized, negotiated, proposed, and initiated new ethics, aesthetics, and ways of thinking that supported self-determination, hope, social critique, solidarity, and justice. Increasingly since the 1980s, Chicanas and Chicanx artists renegotiated this social justice contract. Chicana/o/x art continues to inform Mexican American cultural production and the nation’s cultural heritage. Social intervention, empowerment, and institutional critique remain some of the most important innovations of American artists, Chicana/o/x artists among them.",
    "prereq": []
  },
  {
    "uid": "792474",
    "code": "ARTH3302",
    "subject": "ARTH",
    "number": "3302",
    "honors": false,
    "writingIntensive": false,
    "name": "Print Culture",
    "fullname": "Print Culture in Early Modern Europe",
    "info": "Cultural history of printed images in Europe from their emergence in 15th century through about 1750. Book illustration, reproductive printmaking. History of print connoisseurship. Prints and scientific knowledge. Role of print culture in major social/political events such as Protestant Reformation.",
    "prereq": []
  },
  {
    "uid": "005909",
    "code": "ARTH3303",
    "subject": "ARTH",
    "number": "3303",
    "honors": false,
    "writingIntensive": false,
    "name": "17-18C.Ptng.-France",
    "fullname": "17th- and 18th-Century Painting in France",
    "info": "Survey of French painting from Baroque through the beginnings of Neo-Classicism (e.g. De la Tour, Le Nain, Vouet, Poussin, Watteau, Boucher, Chardin, David).",
    "prereq": []
  },
  {
    "uid": "800622",
    "code": "ARTH3309",
    "subject": "ARTH",
    "number": "3309",
    "honors": false,
    "writingIntensive": false,
    "name": "Renaissance Art",
    "fullname": "Renaissance Art in Europe",
    "info": "Major monuments of painting/sculpture in Western Europe, 1400-1600. Close reading of individual works in historical context. Influence of patrons. Major social/political changes such as Renaissance humanism, Protestant Reformation, market economy.",
    "prereq": []
  },
  {
    "uid": "800242",
    "code": "ARTH3311",
    "subject": "ARTH",
    "number": "3311",
    "honors": false,
    "writingIntensive": false,
    "name": "Baroque Art",
    "fullname": "Baroque Art in Seventeenth Century Europe",
    "info": "Dominant trends/figures of Italian, French, Flemish, and Dutch Baroque period. Works of major masters, including Caravaggio, Bernini, Poussin, Velazquez, Rembrandt, and Rubens. Development of illusionistic ceiling decoration. Theoretical basis of Baroque art. Art's subservience to Church and royal court.",
    "prereq": []
  },
  {
    "uid": "800243",
    "code": "ARTH3312",
    "subject": "ARTH",
    "number": "3312",
    "honors": false,
    "writingIntensive": false,
    "name": "European Art of the 18th Cent",
    "fullname": "European Art of the Eighteenth Century: Rococo to Revolution",
    "info": "Major developments in 18-century painting, sculpture, and interior decoration, from emergence of Rococo to dawn of Neoclassicism. Response of art to new forms of patronage. Erotics of 18-century art. Ways art functioned as social/political commentary.",
    "prereq": []
  },
  {
    "uid": "818968",
    "code": "ARTH3313",
    "subject": "ARTH",
    "number": "3313",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Baroque Masters",
    "fullname": "Spanish Baroque Masters: Tradition and Experimentation in  Golden Age Spain",
    "info": "This seminar focuses on some of the major masters of Spanish Baroque art, including Francisco de Zurbarán, Diego Velázquez, Jusepe de Ribera, Bartolomé Esteban Murillo, and Juan Sánchez Cotán.  We will explore their works from a variety of perspectives in an effort to understand the unique character and contributions of the art of the Spanish Golden Age.",
    "prereq": []
  },
  {
    "uid": "799882",
    "code": "ARTH3315",
    "subject": "ARTH",
    "number": "3315",
    "honors": false,
    "writingIntensive": false,
    "name": "The Age of Curiosity",
    "fullname": "The Age of Curiosity: Art, Science & Technology in Europe, 1400-1800",
    "info": "Diverse ways in which making of art and scientific knowledge intersected in early modern Europe. Connections between scientific curiosity and visual arts in major artists (e.g., da Vinci, Durer, Vermeer, Rembrandt). Artfulness of scientific imagery/diagrams, geographical maps, cabinets of curiosities, and new visual technologies, such as the telescope and microscope.",
    "prereq": []
  },
  {
    "uid": "801774",
    "code": "ARTH3335",
    "subject": "ARTH",
    "number": "3335",
    "honors": false,
    "writingIntensive": false,
    "name": "Baroque Rome: Art and Politics",
    "fullname": "Baroque Rome: Art and Politics in the Papal Capital",
    "info": "This course explores the center of Baroque culture—Rome—as a city of spectacle and pageantry.  The urban development of the city, as well as major works in painting, sculpture, and architecture, are considered within their political and religious context, with special emphasis on the ecclesiastical and private patrons who transformed the Eternal City into one of the world’s great capitals. ",
    "prereq": []
  },
  {
    "uid": "792223",
    "code": "ARTH3340",
    "subject": "ARTH",
    "number": "3340",
    "honors": false,
    "writingIntensive": false,
    "name": "Archaeological Practicum",
    "fullname": "Practicum in Archaeological Field and Computer Techniques",
    "info": "Methods for excavation of Old/New World sites. Meets at archaeometry/computer lab for part of semester and at selected site in Minnesota for day-long sessions for 9 to 10 weeks.",
    "prereq": []
  },
  {
    "uid": "825670",
    "code": "ARTH3345",
    "subject": "ARTH",
    "number": "3345",
    "honors": false,
    "writingIntensive": false,
    "name": "Imagining the North Country",
    "fullname": "Imagining the North Country",
    "info": "All around us, carefully crafted landscapes of the North Country are presented to us in images. We encounter them every day on this campus whether we are at the Bell Museum of Natural History pondering Charles Corwin’s diorama of beavers at Lake Itasca, in the James Ford Bell Library examining Jean Baptiste Nolin’s seventeenth-century map of the Pays d’en Haut (“Upper Country”), or looking from the steps of Northrop Auditorium across the green spaces and architecture of the state’s land-grant university. These images exert a powerful influence on us, making our world cohere and forming the basis of strong communal identities. At the same time, without knowledge of their histories and conventions, they can stand as barriers to a more complex sense of the ground we stand on. This course will examine broadly the landscapes of the “North Country,” the area roughly corresponding to present-day Minnesota that has for thousands of years been home to the Dakota and Ojibwe peoples and their ancestors, and more recently to peoples of European descent who in the seventeenth century began to refashion the landscape of the North Country in their own image. The aim of the class is to explore but also to unsettle our received habits of imagining the landscape, in the process opening up possibilities we may not have considered before.",
    "prereq": []
  },
  {
    "uid": "792892",
    "code": "ARTH3401W",
    "subject": "ARTH",
    "number": "3401",
    "honors": false,
    "writingIntensive": true,
    "name": "Art on Trial",
    "fullname": "Art on Trial",
    "info": "Why does art so often elicit anger, debate, protest, and vandalism? Arts controversies raise many difficult questions that this class examines: should artists be allowed to use taxpayer funds to create works of art critical of the government or that some find offensive? Should public sculptures commemorate Confederates, slave owners, or colonialists? How do we know when something is obscene? Is censorship ethical? Do artists have the right to control the fate of their work after it is sold? Who should decide what artists are chosen for public commissions, what artworks are selected for public buildings, or how works of art should be interpreted? Does public opinion make bad art? This course trains students in the history of arts controversies in the United States from the 19th century to the present and in the changing social conditions through which art has become a flashpoint for public debate. Assignments focus on discipline-specific research and writing techniques that build toward a group project in which students research, take up positions, and debate the merits of important case studies. The class is primarily designed for students to learn about the arts and arts policy today, i.e., the art world of which they are and will be citizens. They are asked to inspect the sources of dominant cultural beliefs and to gain a deeper understanding of and take responsibility for their own cultural, political, and artistic values.",
    "prereq": []
  },
  {
    "uid": "788139",
    "code": "ARTH3411",
    "subject": "ARTH",
    "number": "3411",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender and Sexuality in Art",
    "fullname": "Gender and Sexuality in Art Since 1863",
    "info": "Modern art, its representation of gender identity/sexuality. Modernism/postmodernism as they reflect historical changes in gender roles, feminist politics, construction/deconstruction of masculinity/femininity. Transgender performance as avant-garde practice. Body as image, medium, site of theoretical debate.",
    "prereq": []
  },
  {
    "uid": "002589",
    "code": "ARTH3422",
    "subject": "ARTH",
    "number": "3422",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Graphic Arts",
    "fullname": "Off the Wall: History of Graphic Arts in Europe and America in the Modern Age",
    "info": "History/theory of creation of lithography, social caricature (e.g., Daumier, Gavarni), revival of etching (e.g., Goya/mid-century practitioners, Whistler), and color lithography (e.g., Toulouse-Lautrec, Vuillard, Bonnard).  Media changes of 20th century. Revolutionary nature of new media.",
    "prereq": []
  },
  {
    "uid": "808383",
    "code": "ARTH3434",
    "subject": "ARTH",
    "number": "3434",
    "honors": false,
    "writingIntensive": false,
    "name": "Art & the Environment",
    "fullname": "Art and the Environment",
    "info": "Western art has a long tradition of depicting and directly engaging with the environment—from ancient earthworks such as Stonehenge and Avebury Stone Circle, to 18th and 19th century landscape paintings and 20th century photographs, to land and earth art of the 1960s and ‘70s, and what is now called environmental or eco art. Such art has had a prominent place in art’s history, but do we really need art to save the environment? Studies repeatedly show that the arts are crucial to understanding and forestalling environmental disaster because, it turns out, human attitudes are shaped by the stories we tell, by our ability to imagine the unimaginable, to accept the inanimate as potentially coming to life, to picture things on a vast scale. In this course students learn the historical development of artistic movements from 1968, when the first exhibition of such art, called “Earthworks,” took place at the Dwan Gallery in New York, up to the present day. The course tracks the changing aesthetic, political, and climatic forces that influenced such art, from the anti-institutionalism and participatory approaches of the 1960s to the more activist artistic engagement with environmentalism today. The class takes up two primary concerns: understanding the historical and scientific conditions that have given rise to such art and learning the ways in which artists have sought to intervene in and affect a changing environment. Students put historical knowledge, environmental research, and visual analysis skills to work in a culminating group project creating art that responds to a contemporary environmental problem.",
    "prereq": []
  },
  {
    "uid": "016665",
    "code": "ARTH3464",
    "subject": "ARTH",
    "number": "3464",
    "honors": false,
    "writingIntensive": false,
    "name": "Art Since 1945",
    "fullname": "Art Since 1945",
    "info": "The end of the Second World War is commonly understood as a watershed moment in art history when the center of western art shifted from Paris to New York and the old tradition of art academies and annual salons disappeared once and for all. It is a moment that sees dramatic changes in who artists are, how they are trained, what kind of art they make, and the audiences to whom they appeal. This course surveys U.S. and European art history from 1945 to the present so that students gain a thorough understanding of the social, political, and economic forces that contributed to the development of significant art movements including abstract expressionism, pop art, and minimalism, as well as key modes of artmaking including painting and sculpture, happenings, installations, video, earthworks, and participatory art. The course also trains students in philosophies of art and tracks the dramatic changes in aesthetics over the period. Primarily a lecture course, students’ historical knowledge is assessed through two in-class examinations in which they identify, compare, contrast, and think critically about works of art. In addition, students practice discipline-specific research skills by compiling an annotated bibliography and writing short papers that rigorously examine primary sources. ",
    "prereq": []
  },
  {
    "uid": "825311",
    "code": "ARTH3481",
    "subject": "ARTH",
    "number": "3481",
    "honors": false,
    "writingIntensive": false,
    "name": "Curatorial Practice",
    "fullname": "Curatorial Practice Field Experience",
    "info": "This course looks at current critical questions of curating and exhibition making. We explore the process of developing an exhibition, building working relationships with artists, and understanding how to effectively communicate ideas to turn a concept into a project. The course assumes that curating has also evolved from a practice associated with a museum art expert to something that is increasingly framed as a creative marketable skill related to cultural production. Discussions, readings, and coursework include consideration of gallery and public space and audience experience. Curatorial trends will be explored via site visits to established and alternative exhibit spaces. Students are introduced to a wide variety of artists and how their work is contextualized by the exhibition format. Site visits to exhibition spaces and conversations with professional curators reinforce the course material. Through practice and application, students examine the evolving definitions and responsibilities of a curator, and a variety of issues related to the development of a coherent and relevant exhibition. Students participate in hands-on, curatorial workshops, and curate a professional, public presentation using a nontraditional space, gallery space, digital space, or other local venue.",
    "prereq": []
  },
  {
    "uid": "003046",
    "code": "ARTH3484",
    "subject": "ARTH",
    "number": "3484",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of Picasso",
    "fullname": "The Art of Picasso and the Modern Movement",
    "info": "Works of Picasso in all media. Blue, Rose, Cubist, Classical, and later periods of Picasso's development against innovations in media; collage, utilization of found-objects, printmaking and ceramics. Autobiographical nature of imagery gives methodological basis for exploring frequently personalized themes. ",
    "prereq": []
  },
  {
    "uid": "806812",
    "code": "ARTH3494",
    "subject": "ARTH",
    "number": "3494",
    "honors": false,
    "writingIntensive": false,
    "name": "East/West, West/East",
    "fullname": "East/West, West/East",
    "info": "Beginning in the early 18th century and culminating at the dawn of the First World War. Chinoiserie, Orientalism, Japonisme, and western influence in Japan during the Meiji Era. Historical and critical context of trade competition, the colonial race, and the shrinking geopolitical map as the period progresses. Paintings to prints, decorative arts to architecture, and world fair exhibitions to photography.",
    "prereq": []
  },
  {
    "uid": "002534",
    "code": "ARTH3575",
    "subject": "ARTH",
    "number": "3575",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of Walt Disney",
    "fullname": "The Art of Walt Disney in American Culture",
    "info": "Walt Disney, his companies, and the influence of their products on 20th century American culture. Animation, architecture, city planning, the relationship between the fine arts and popular culture, and the creation of art under industrial conditions of collaboration and profit.",
    "prereq": []
  },
  {
    "uid": "002536",
    "code": "ARTH3576",
    "subject": "ARTH",
    "number": "3576",
    "honors": false,
    "writingIntensive": false,
    "name": "Am. Popular Culture",
    "fullname": "American Popular Culture",
    "info": "American popular culture in the l9th and 20th centuries; fashion, greeting cards, holiday celebration, public spectacle, magazine covers, and commercial design.",
    "prereq": []
  },
  {
    "uid": "803999",
    "code": "ARTH3577",
    "subject": "ARTH",
    "number": "3577",
    "honors": false,
    "writingIntensive": false,
    "name": "Photography in America",
    "fullname": "Photo Nation: Photography in America",
    "info": "Development of photography, from 19th century to present. Photography as legitimate art form. Portraits/photo albums in culture. Birth of criminal justice system. Technological/market aspects. Politics of aesthetics. Women in photography. Ways in which idea of America has been shaped by photographs.",
    "prereq": []
  },
  {
    "uid": "016056",
    "code": "ARTH3578",
    "subject": "ARTH",
    "number": "3578",
    "honors": false,
    "writingIntensive": false,
    "name": "Arts of Africa",
    "fullname": "Contemporary Sub-Saharan African Popular Art forms",
    "info": "According to the US Population Reference Bureau, Africans will represent 21% of the world population in 2050, a higher percentage than Chinese or Indians. Other research and data agencies credit contemporary African societies with among the fastest rates of urban expansion in the world. Such stupendous demographic surge and breakneck acceleration of urban growth have engendered intense dislocation and cultural upheaval in populations caught between two competing narratives of social change: one of celebration; the other of crisis. This course explores contemporary sub-Saharan African popular cinema, popular music, TV/radio series, bus slogans, community theatre, graphic narratives, fashion, sports, and other forms of popular communication as signifiers of larger social, political, and economic processes. It examines popular cultural forms as constantly evolving expressions of social, political, and personal identities in an ever globalized and interconnected world. As sites where the tensions, frictions, collisions and notably, the productive creativities of the local and the global are circulated, negotiated and contested African popular cultures provide insights into a unique and increasingly crucial facet of contemporary African artistic practice as critical intervention. Through our discussion of art and gender, we will examine the gendering of specific popular forms, their role in hegemonic formations, as well as their subversion in resistant practices and discourses.",
    "prereq": []
  },
  {
    "uid": "792480",
    "code": "ARTH3585",
    "subject": "ARTH",
    "number": "3585",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Art",
    "fullname": "African American Art",
    "info": "Four hundred year history of African American art. How/why African Americans created artwork at specific times, in specific places. Arts of African Americans within their own communities, National arts movements, and American life during historical junctures.",
    "prereq": []
  },
  {
    "uid": "016059",
    "code": "ARTH3588",
    "subject": "ARTH",
    "number": "3588",
    "honors": false,
    "writingIntensive": false,
    "name": "Arch of Africa (PreCol to Prs)",
    "fullname": "Architecture of Africa , Pre-Colonial to Present",
    "info": "Introduces the history of architecture in West Africa, from eighth century to present. From the prosperity of early empires of Western Sudan (Ghana, Mali, Songhai), and the impact of Islam on traditional architecture, to colonial/post-colonial architecture.",
    "prereq": []
  },
  {
    "uid": "807805",
    "code": "ARTH3600",
    "subject": "ARTH",
    "number": "3600",
    "honors": false,
    "writingIntensive": false,
    "name": "The Renaissance",
    "fullname": "The Renaissance",
    "info": "Relationships between the visual arts, literature, science, philosophy and politics in Europe from about 1300-1600. Works of artists, writers, and intellectuals (e.g., Michelangelo Buonarotti, Niccolo Machiavelli, Michel de Montaigne), different artistic and literary forms (e.g., portrait, sonnet, essay), and broad thematic issues, including the individual, antiquity, the state, and discovery. Team taught.",
    "prereq": []
  },
  {
    "uid": "810112",
    "code": "ARTH3627",
    "subject": "ARTH",
    "number": "3627",
    "honors": false,
    "writingIntensive": false,
    "name": "Harlem Renaissance",
    "fullname": "Seminar: Harlem Renaissance",
    "info": "Review Harlem Renaissance from variety of perspectives. Literary, historical, cultural, political, international. Explore complex patterns of permeation/interdependency between worlds inside/outside of what W.E.B. Du Bois called \"Veil of Color.\"",
    "prereq": []
  },
  {
    "uid": "801881",
    "code": "ARTH3655",
    "subject": "ARTH",
    "number": "3655",
    "honors": false,
    "writingIntensive": false,
    "name": "African-American Cinema",
    "fullname": "African-American Cinema",
    "info": "African American cinematic achievements from silent films of Oscar Micheaux through contemporary Hollywood and independent films. Class screenings, critical readings.",
    "prereq": []
  },
  {
    "uid": "813206",
    "code": "ARTH3764",
    "subject": "ARTH",
    "number": "3764",
    "honors": false,
    "writingIntensive": false,
    "name": "Art & Archaeology of Korea",
    "fullname": "Art & Archaeology of Korea: An Introductory Survey",
    "info": "This course (an interdisciplinary study of art history, archaeology, and religious studies) introduces the visual and material culture of the Korean peninsula and northeast Asia, from the Neolithic Age to the early twentieth century CE, by examining historical monuments and excavated artifacts. Major topics include: (1) state formation and Sinicization, (2) the influx of Buddhism and its successful development, (3) capitals and provinces, (4) elite culture, including that of the Confucian literati, and (5) the nationalist (and often racialist) construct of the \"Korean\" identity and its pre-modern, colonial, and post-colonial discourses.",
    "prereq": []
  },
  {
    "uid": "820165",
    "code": "ARTH3765",
    "subject": "ARTH",
    "number": "3765",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Art and Architecture",
    "fullname": "Chinese Art and Architecture",
    "info": "This class provides an introduction to Chinese art and architecture, from prehistory to the present.  Proceeding chronologically and thematically, the class will consider a broad range of artistic media including jade, stone, bronze, paintings, calligraphy, ceramics, printing, photography, and architecture.  Through a close connoisseurial engagement and visual analysis these materials, the class will examine how Chinese art developed in relation to broader themes of Chinese political, religious, and cultural history.  At the same time, it will consider how the art of China engaged in cultural and artistic dialogue with other traditions and cultures of East Asia.",
    "prereq": []
  },
  {
    "uid": "819781",
    "code": "ARTH3777",
    "subject": "ARTH",
    "number": "3777",
    "honors": false,
    "writingIntensive": false,
    "name": "Indian Empires after 1200",
    "fullname": "The Diversity of Traditions: Indian Empires after 1200",
    "info": "This class considers the development of Indian and Pakistani art and architecture from the introduction of Islam as a major political power at the end of the 12th century to the colonial empires of the 18th century.  We will study how South Asia’s diverse ethnic and religious communities interacted, observing how visual and material cultures reflect differences, adaptations, and shared aesthetic practices within this diversity of traditions. Students in this class will have mastered a body of knowledge about Indian art and probed multiple modes of inquiry. We will explore how Muslim rulers brought new traditions yet maintained many older ones making, for example, the first mosque in India that combines Muslim and Indic visual idioms. We will study the developments leading to magnificent structures, such as the Taj Mahal, asking why such a structure could be built when Islam discourages monumental mausolea.  In what ways the schools of painting that are the products of both Muslim and Hindu rulers different and similar? The course will also consider artistic production in the important Hindu kingdoms that ruled India concurrently with the great Muslim powers. In the 18th century, colonialist forces enter the subcontinent, resulting in significant innovative artistic trends. Among questions we will ask is how did these kingdoms influence one another? Throughout we will probe which forms and ideas seem to be inherently Indian, asking which ones transcend dynastic, geographic and religious differences and which forms and ideas are consistent throughout these periods of political and ideological change.  To do all this we must constantly consider how South Asia's diverse ethnic and religious communities interact.There are no prerequisites for this course.",
    "prereq": []
  },
  {
    "uid": "819722",
    "code": "ARTH3778",
    "subject": "ARTH",
    "number": "3778",
    "honors": false,
    "writingIntensive": false,
    "name": "South Asian Painting",
    "fullname": "Traditions of South Asian Painting: Past to Present",
    "info": "This course surveys the rich diversity of painted media in India, Pakistan, Sri Lanka, and Nepal, from 5th-century murals to contemporary canvases that travel the world. We will locate the works in their physical, ritual, and intellectual contexts.We will explore how the familiar categories with which we describe painting, such as Landscape, Portraiture, Narrative, and even Modern, might be productively reassessed in light of South Asian aesthetic traditions by locating the works in their physical, ritual, and intellectual contexts. The course culminates in the contested spaces of contemporary art, where questions of politics, identity, and intention come to the fore. Although mainly focusing on the painting traditions of India, the course will include painting from Pakistan, the Himalayas, Sri Lanka, and the South Asian diaspora. The humanities sharpen our ability to develop critical questions and to judge why and how one answer or interpretation may be stronger than another. Humanistic thinking is developed in dialogue; it emerges between individuals in conversation with each other and with their objects of study. This course asks you to boldly bring your curiosity, convictions, and blind-spots to our collective conversation, close reading, and individual writing.The course consists of two weekly meetings, and one or two trips to nearby museums or galleries. ",
    "prereq": []
  },
  {
    "uid": "819895",
    "code": "ARTH3779",
    "subject": "ARTH",
    "number": "3779",
    "honors": false,
    "writingIntensive": false,
    "name": "The Indian Temple",
    "fullname": "Visions of Paradise: The Indian Temple",
    "info": "This course traces the development and diversity of the Indian temple, focusing the ways in which people interact with sacred space and how religious art addresses its viewers. We primarily focus on Hinduism, but also include Buddhism and Jainism. We will discuss the role of sculpture, painting, textiles, dance, and food within the temple.  We will also examine how the legacy of colonial and orientalist scholarship inflects our study of these traditions and monuments.Although the architecture of both structural and rock-cut temples will be our main object of study, we will also discuss the role of sculpture, painting, textiles, and food within the temple. Our consideration of the structures will be attentive to the ways in which people interact with the space and how objects of sacred art address their viewers. In classroom discussions we will work together to create an interpretive model that is synthetic, critical, and appreciative of the enormously diverse field that is South Asian Art. Lectures will move from explanatory descriptions of objects and histories that are covered in the textbook to critical interpretations of the historiographies that shape their contemporary reception. Class discussions and assignments are intended to encourage students to bring their own ways of looking at this art, to read critically in light of what they see, and to consider new approaches to the material. No prior experience in the history of art or religions of South Asia is required for this course. ",
    "prereq": []
  },
  {
    "uid": "009806",
    "code": "ARTH3896",
    "subject": "ARTH",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Experience",
    "fullname": "Directed Professional Experience",
    "info": "Internship or research assistantship in approved program, art institution, business or museum. prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "008394",
    "code": "ARTH3921W",
    "subject": "ARTH",
    "number": "3921",
    "honors": false,
    "writingIntensive": true,
    "name": "Art of the Film",
    "fullname": "Art of the Film",
    "info": "This course provides an introduction to the history and aesthetics of film. We will examine major directors, genres, and styles; the relationship between film and other arts and media; film production, distribution, and exhibition in the U. S. and other countries; film and politics, including sexual politics; theories about film and film history; issues of judgment and critical values.  Films include Metropolis, Citizen Kane, Rashomon, Pulp Fiction, and Get Out. ",
    "prereq": []
  },
  {
    "uid": "811546",
    "code": "ARTH3926",
    "subject": "ARTH",
    "number": "3926",
    "honors": false,
    "writingIntensive": false,
    "name": "Cinema of Alfred Hitchcock",
    "fullname": "The Cinema of Alfred Hitchcock",
    "info": "This course examines the achievement and significance of Alfred Hitchcock. It will consider his entire career, including both the British and American periods, his major films and his television program, Alfred Hitchcock Presents. The course will address his characteristic themes and concerns (the double, the relationship between criminality and legality, the play of suspense and surprise); the traditions that shaped him (the Gothic in literature and theater; Victorian melodrama) and the influence he had on other films and filmmakers (the horror film, the political thriller); his significance in relation to the history of film criticism and scholarship (auteurist, feminist, queer). Students will gain a thorough knowledge of Hitchcock and the biographical, historical, technological, industrial, aesthetic issues surrounding his achievement. They will gain practical experience in analyzing films and addressing the critical issues raised by the media in contemporary society.",
    "prereq": []
  },
  {
    "uid": "016063",
    "code": "ARTH3927",
    "subject": "ARTH",
    "number": "3927",
    "honors": false,
    "writingIntensive": false,
    "name": "Documentary Cinema",
    "fullname": "Documentary Cinema",
    "info": "History of nonfiction filmmaking, from early forms of reportage and birth of documentary to emergence of \"film-verite\" and \"guerrilla television\" and work by independents (e.g., Errol Morris, Michael Moore).",
    "prereq": []
  },
  {
    "uid": "813341",
    "code": "ARTH3929",
    "subject": "ARTH",
    "number": "3929",
    "honors": false,
    "writingIntensive": false,
    "name": "Cinema Now",
    "fullname": "Cinema Now",
    "info": "Course examines contemporary cinema, including fiction films, documentaries, animation, and avant-garde experiments. Focuses on feature-length theatrical films, but will also consider other aspects of the contemporary media world: graphic novels, video games, television series and the Internet (e.g., Youtube). Examines media production, distribution, marketing, exhibition, and reception. Course will also present a survey of developments in contemporary cinema studies, since the choice of films will support a variety of critical approaches including economic, aesthetic (generic, auteurist, formalist), ideological (race, class, gender), and reception studies.",
    "prereq": []
  },
  {
    "uid": "826256",
    "code": "ARTH3933",
    "subject": "ARTH",
    "number": "3933",
    "honors": false,
    "writingIntensive": false,
    "name": "What Art Historians Do",
    "fullname": "What Art Historians Do: Undergraduate Theory and Methods",
    "info": "Why do people study the history of art and what do they do with that knowledge? Designed for undergraduate art history majors but open to any students interested in the field, “What Art Historians Do” serves as an introduction to the history of the discipline as well as to its research, writing, and interpretative methods. The course is designed as a seminar in which students are trained in historical, philosophical, and practical knowledge.  They study the European origins of the academic discipline and its development and global expansion over time. They debate such questions as the purpose of art, the changing definition–across time, geographical regions, and cultures–of the artist, the limitations and implications  of history, and the place of museums in both preserving and destroying cultural heritage. And they learn and practice research techniques in material and digital archives and in primary and secondary sources, as well as different writing methods including museum didactics, scholarly papers, journalism, and social media. This course is a new requirement for any student who declares their art history major in Fall 2023 or later.",
    "prereq": []
  },
  {
    "uid": "016065",
    "code": "ARTH3940",
    "subject": "ARTH",
    "number": "3940",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Art History",
    "fullname": "Topics in Art History",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "009803",
    "code": "ARTH3971W",
    "subject": "ARTH",
    "number": "3971",
    "honors": false,
    "writingIntensive": true,
    "name": "Art History Capstone",
    "fullname": "Art History Capstone",
    "info": "Capstone course for art history majors, which teaches writing skills and strategies, and aids students in the completion of senior paper projects through the study of art historical methods. Students work with both the class instructor and individual faculty advisers on independent research and writing.prereq: ArtH major, instr consent",
    "prereq": []
  },
  {
    "uid": "016061",
    "code": "ARTH3993",
    "subject": "ARTH",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "TBDprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "016058",
    "code": "ARTH3994",
    "subject": "ARTH",
    "number": "3994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "TBDprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "790085",
    "code": "ARTH5101",
    "subject": "ARTH",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Myth in Art",
    "fullname": "Myths in Art: Cross-Cultural Comparison",
    "info": "Relationships of text/image, efficacy of each in conveying meaning. Properties of visual/verbal communication. Ways in which artists convey mythological meanings, how much these ways differ according to place/time. Students prepare/critique visual presentations through Web pages.",
    "prereq": []
  },
  {
    "uid": "797118",
    "code": "ARTH5103",
    "subject": "ARTH",
    "number": "5103",
    "honors": false,
    "writingIntensive": false,
    "name": "Gk & Rom Art & Arc",
    "fullname": "Hellenistic and Early Roman Art and Archaeology",
    "info": "Sculpture, architecture, painting, and topography in developing centers of Hellenistic culture in the eastern Mediterranean, and in Etruscan and Roman towns from 400 B.C. to the beginnings of the Roman Empire.",
    "prereq": []
  },
  {
    "uid": "797119",
    "code": "ARTH5108",
    "subject": "ARTH",
    "number": "5108",
    "honors": false,
    "writingIntensive": false,
    "name": "Greek Architecture",
    "fullname": "Greek Architecture",
    "info": "Geometric through classical examples of religious and secular architecture and their setting at archaeological sites in Greece, Asia Minor, and Italy.",
    "prereq": []
  },
  {
    "uid": "797122",
    "code": "ARTH5111",
    "subject": "ARTH",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Prehist Grk Art&Arc",
    "fullname": "Prehistoric Art and Archaeology of Greece",
    "info": "Artistic and architectural forms of Neolithic period in Aegean area and Cycladic, Minoan, and Mycenaean cultures. Aims and methods of modern field archaeology; the record of human habitation in the Aegean area. Archaeological evidence as a basis for historical reconstruction.",
    "prereq": []
  },
  {
    "uid": "797557",
    "code": "ARTH5112",
    "subject": "ARTH",
    "number": "5112",
    "honors": false,
    "writingIntensive": false,
    "name": "Arc & Clas Grk Art",
    "fullname": "Archaic and Classical Greek Art",
    "info": "Sculpture, painting, architecture and minor arts in Greek lands from the 9th through 5th centuries B.C. Examination of material remains of Greek culture; archaeological problems such as identifying and dating buildings; analysis of methods and techniques. Emphasis on Periklean Athens.",
    "prereq": []
  },
  {
    "uid": "806382",
    "code": "ARTH5113",
    "subject": "ARTH",
    "number": "5113",
    "honors": false,
    "writingIntensive": false,
    "name": "Art Law and Ethics",
    "fullname": "Heritage After Iraq and Afghanistan: Debates in Art History, Museum Studies, and the Art Market",
    "info": "Pre- and postwar Iraq, looting of the Baghdad Museum, systematic looting of archaeological sites; destruction of Afghanistan's cultural heritage under the Taliban, looting/trade in antiquities since the overthrow; art/war in historical/contemporary perspective; nationalistic uses of archaeology, museology.",
    "prereq": []
  },
  {
    "uid": "806383",
    "code": "ARTH5115",
    "subject": "ARTH",
    "number": "5115",
    "honors": false,
    "writingIntensive": false,
    "name": "Hellenistic and Iranian Asia",
    "fullname": "Hellenistic and Iranian Asia: Art and Archaeology of Hellenistic, Scythian, Kushan, and Sogdian Asia",
    "info": "Transformations of Greek architecture, sculpture, painting, mosaic, and decorative arts beginning of the eastern Mediterranean and Hellenistic Asia. Art and archaeology of the post-Hellenistic Iranian world. Religious, political and historical contexts of archaeological sites, monuments, and art objects. ",
    "prereq": []
  },
  {
    "uid": "797124",
    "code": "ARTH5120",
    "subject": "ARTH",
    "number": "5120",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Archaeology",
    "fullname": "Field Research in Archaeology",
    "info": "Field excavation, survey, and research at archaeological sites in the Mediterranean area.  Techniques of excavation and exploration; interpretation of archaeological materials.",
    "prereq": []
  },
  {
    "uid": "797112",
    "code": "ARTH5172",
    "subject": "ARTH",
    "number": "5172",
    "honors": false,
    "writingIntensive": false,
    "name": "House, Villa, Tomb",
    "fullname": "House, Villa, Tomb: Roman Art in the Private Sphere",
    "info": "The architecture, painting, and sculpture of urban houses, country estates, and tombs in the Roman World.  Relationships between public and private spheres, and literary and physical evidence; usefulness of physical evidence in illuminating gender roles.",
    "prereq": []
  },
  {
    "uid": "797113",
    "code": "ARTH5182",
    "subject": "ARTH",
    "number": "5182",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and the State",
    "fullname": "Art and the State: Public Art in the Roman Empire",
    "info": "Origins of Roman public art; use in maintaining community; exploitation by the first Emperor, Augustus; development and diffusion through the later Empire; varying capabilities to adjust to the demands of a Christian Empire.",
    "prereq": []
  },
  {
    "uid": "806406",
    "code": "ARTH5188",
    "subject": "ARTH",
    "number": "5188",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Christian & Late Rome",
    "fullname": "Art and Archaeology of Early Christianity and the Late Roman Empire",
    "info": "Emergence of Christian visual culture in Rome. Age of Tetrarchs and Constantine the Great. Age of Justinian. Development of liturgical environments such as Jewish synagogue and Christian church. Melding of imperial and Christian art, architecture, and ritual. Constantinople, from its founding through sixth century. Church architecture. Early icon/manuscript painting.",
    "prereq": []
  },
  {
    "uid": "806415",
    "code": "ARTH5192",
    "subject": "ARTH",
    "number": "5192",
    "honors": false,
    "writingIntensive": false,
    "name": "Persia and Ancient Iranian Art",
    "fullname": "Persia and the Ancient Iranian World: Art and Archaeology of Achaemenid to Sasanian Persia",
    "info": "Art, archaeology of ancient Persia and the wider ancient Iranian world from the rise of the Achaemenid empire in 650 BCE to the advent of Islam in the seventh century CE.",
    "prereq": []
  },
  {
    "uid": "007207",
    "code": "ARTH5234",
    "subject": "ARTH",
    "number": "5234",
    "honors": false,
    "writingIntensive": false,
    "name": "Gothic Sculpture",
    "fullname": "Gothic Sculpture",
    "info": "The origin, character, and development of Gothic sculpture in France, the German empire, and the Netherlands, 1150-1400. Emphasis on French sculpture of the cathedral age and the emergence of a court style in Paris and elsewhere in Europe (e.g. London, Prague).",
    "prereq": []
  },
  {
    "uid": "797131",
    "code": "ARTH5252",
    "subject": "ARTH",
    "number": "5252",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Christian Art",
    "fullname": "History of Early Christian Art in Context",
    "info": "This course will introduce graduate and advanced undergraduate students to Christian visual art from its evident beginnings (ca. 200) to the dawn of the early Middle Ages, attending to its transformation under imperial patronage. Working with both objects and texts, core themes include the continuity between Christian and pagan art of Late Antiquity, the influence of imperial ceremonies and style, the emergence of sacred icons, the development of Passion iconography, the influence of Islam, and the divergent styles, motifs, and theological perspectives on the validity and role of images from the Byzantine East to the early Medieval West. ",
    "prereq": []
  },
  {
    "uid": "792893",
    "code": "ARTH5301",
    "subject": "ARTH",
    "number": "5301",
    "honors": false,
    "writingIntensive": false,
    "name": "Atlantic World",
    "fullname": "Visual Culture of the Atlantic World",
    "info": "Visual culture of Atlantic world, from Columbus to American Revolution. Visual objects, practices considered in context of Europe's colonization of Americas. Slavery, religious conflict, international commerce, production of scientific knowledge addressed in terms of their impact upon visual imagery.",
    "prereq": []
  },
  {
    "uid": "795732",
    "code": "ARTH5302",
    "subject": "ARTH",
    "number": "5302",
    "honors": false,
    "writingIntensive": false,
    "name": "Prints in Early Modern Europe",
    "fullname": "The Image Multiplied: Prints in Early Modern Europe",
    "info": "The technology of mechanically reproducing complex visual images on paper, a development of fifteenth-century Europe, transformed the early modern world no less than the emergence of digital media has transformed our own. Techniques of woodcut, engraving and etching quickly became important media for innovation within the fine arts. At the same time, they became equally important as sources for devotional imagery, for disseminating copies of other artworks, for the expansion of knowledge through scientific illustration, and for the effective broadcasting of political and religious messages during centuries of extraordinary political and religious upheaval. In this course we will investigate the cultural history of printed images in Europe from the time of their emergence in the fifteenth century through the mid-eighteenth century. Through lectures and class discussion, you will develop a familiarity with the technical aspects of printmaking and apply that understanding to the historical interpretation of specific works. The course will not be an exhaustive survey of printmakers and printmaking styles during the early modern era but will instead approach the early modern print through the changing cultural circumstances of its production and reception. While we will consider the work of many lesser-known (and anonymous) artists, we will concentrate on the work of major printmakers such as Mantegna, Dürer, Goltzius, Rembrandt, Callot, Hogarth, and Piranesi. The course will include visits to local collections.",
    "prereq": []
  },
  {
    "uid": "818969",
    "code": "ARTH5313",
    "subject": "ARTH",
    "number": "5313",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Baroque Masters",
    "fullname": "Spanish Baroque Masters: Tradition and Experimentation in  Golden Age Spain",
    "info": "This seminar focuses on some of the major masters of Spanish Baroque art, including Francisco de Zurbarán, Diego Velázquez, Jusepe de Ribera, Bartolomé Esteban Murillo, and Juan Sánchez Cotán.  We will explore their works from a variety of perspectives in an effort to understand the unique character and contributions of the art of the Spanish Golden Age.",
    "prereq": []
  },
  {
    "uid": "819899",
    "code": "ARTH5315",
    "subject": "ARTH",
    "number": "5315",
    "honors": false,
    "writingIntensive": false,
    "name": "The Age of Curiosity",
    "fullname": "The Age of Curiosity: Art, Science & Technology in Europe, 1400-1800",
    "info": "Diverse ways in which making of art and scientific knowledge intersected in early modern Europe. Connections between scientific curiosity and visual arts in major artists (e.g., da Vinci, Durer, Vermeer, Rembrandt). Artfulness of scientific imagery/diagrams, geographical maps, cabinets of curiosities, and new visual technologies, such as the telescope and microscope.",
    "prereq": []
  },
  {
    "uid": "787782",
    "code": "ARTH5323",
    "subject": "ARTH",
    "number": "5323",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of the Italian Renaissance",
    "fullname": "Art of the Italian Renaissance: 14th-16th Centuries",
    "info": "Chronological/thematic study of painting, sculpture, and architecture. Emphasizes major artists/commissions, but lesser schools/followers also considered.",
    "prereq": []
  },
  {
    "uid": "007314",
    "code": "ARTH5324",
    "subject": "ARTH",
    "number": "5324",
    "honors": false,
    "writingIntensive": false,
    "name": "15th C. Painting",
    "fullname": "15th-Century Painting",
    "info": "The origin, character, and development of painting in Northern and Southern Europe.prereq: Jr or sr or grad or instr consent",
    "prereq": []
  },
  {
    "uid": "803035",
    "code": "ARTH5325",
    "subject": "ARTH",
    "number": "5325",
    "honors": false,
    "writingIntensive": false,
    "name": "The Art of the Aztec Empire",
    "fullname": "Art of the Aztec Empire",
    "info": "Art/architecture of Nahuatl-speaking Aztecs of Central Mexico, from first appearance in archaeological record until Spanish invasion in 1521. Major scholarly problems, theoretical/methodological approaches. Analysis of scholarly writing.",
    "prereq": []
  },
  {
    "uid": "800244",
    "code": "ARTH5335",
    "subject": "ARTH",
    "number": "5335",
    "honors": false,
    "writingIntensive": false,
    "name": "Baroque Rome: Art and Politics",
    "fullname": "Baroque Rome: Art and Politics in the Papal Capital",
    "info": "This course explores the center of Baroque culture --Rome-- as a city of spectacle and pageantry. The urban development of the city, as well as major works in painting, sculpture, and architecture, are considered within their political and religious context, with special emphasis on the ecclesiastical and private patrons who transformed the Eternal City into one of the world's great capitals.",
    "prereq": []
  },
  {
    "uid": "817948",
    "code": "ARTH5336",
    "subject": "ARTH",
    "number": "5336",
    "honors": false,
    "writingIntensive": false,
    "name": "Transformations in 17th-C Art",
    "fullname": "Transformations in 17th Century Art: Caravaggio, Velazquez, and Bernini",
    "info": "This course offers an in-depth examination of three of the most innovative masters of early modern European art, the painters Michelangelo Merisi da Caravaggio and Diego Velázquez, and the sculptor and architect Gianlorenzo Bernini. Through selected readings, slide presentations and discussions, we will explore the lives and works of these artists, paying particular attention to the ways they created an entirely new relationship between the work of art and the viewer and ushered in a radically new way of conceiving visual imagery.",
    "prereq": []
  },
  {
    "uid": "792224",
    "code": "ARTH5340",
    "subject": "ARTH",
    "number": "5340",
    "honors": false,
    "writingIntensive": false,
    "name": "Archaeological Practicum",
    "fullname": "Practicum in Archaeological Field and Computer Techniques",
    "info": "Methods for excavation of Old/New World sites. Meets at archaeometry/computer lab for part of semester and at selected site in Minnesota for day-long sessions for 9 to 10 weeks.",
    "prereq": []
  },
  {
    "uid": "007199",
    "code": "ARTH5346",
    "subject": "ARTH",
    "number": "5346",
    "honors": false,
    "writingIntensive": false,
    "name": "17-18th Century Art",
    "fullname": "17th- and 18th-Century Art of Southern Europe",
    "info": "17th-century painting in Spain (e.g., Ribera, Velazquez, Murillo); 17th- and 18th-century architecture, sculpture, and painting in Italy (e.g., Caravaggio, Carracci, Bernini, Algardi, Borromini, Piranesi).",
    "prereq": []
  },
  {
    "uid": "007205",
    "code": "ARTH5347",
    "subject": "ARTH",
    "number": "5347",
    "honors": false,
    "writingIntensive": false,
    "name": "17th- 18th-Century Art",
    "fullname": "17th- and 18th-Century Art of Northern Europe",
    "info": "Seventeenth-century painting in Holland/Belgium (e.g., Rembrandt, Rubens).  Seventeenth- and eighteenth-century French architecture, sculpture, and painting (e.g., Versailles, Poussin, Watteau).",
    "prereq": []
  },
  {
    "uid": "796325",
    "code": "ARTH5411",
    "subject": "ARTH",
    "number": "5411",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender and Sexuality in Art",
    "fullname": "Gender and Sexuality in Art Since 1863",
    "info": "In 1863, Édouard Manet painted a scandalous nude titled Olympia, which was met with outrage by critics when it was exhibited at the Paris Salon in 1865. The painting has been the subject of extensive discussion ever since among critics, curators, and art historians who examine not only its modernist style and formal qualities, but also the class, racial, and sexual identities of the two figures it depicts. This course surveys the role gender and sexuality have played in the historical development of western art from Manet’s Olympia to the present, and the role that art has played in both reinforcing and challenging dominant theories of gender identity. It considers modernism and postmodernism not only as products of the rise of industrial and post-industrial capitalism, urbanization, colonialism, and globalization, etc., but also as tangled up with the establishment of gender and sexuality as powerful ideas that bring into being the very categories they name. Students gain knowledge not only about the historical development of art throughout this period, but also about diverse strategies for scholarly research that is informed by theories of gender and sexuality, and art historical models for reading bodies, gestures, texts, and works of art. They complete guided or independent research papers, prepare an in-class presentation on a work of art in a local museum, and complete a structured literature review through which they learn to read and critically evaluate art historical scholarship. ",
    "prereq": []
  },
  {
    "uid": "788140",
    "code": "ARTH5413",
    "subject": "ARTH",
    "number": "5413",
    "honors": false,
    "writingIntensive": false,
    "name": "Alternative Media",
    "fullname": "Alternative Media: Video, Performance, Digital Art",
    "info": "One rather old and rigid concept in the history of art and aesthetics is that artistic media, each with its distinct qualities, are most successful when they remain separate. The best painting, according to this view, is one that explores its own properties of flatness, abstraction, and color. What became known in the first half of the 20th century as the philosophy of “medium specific purity” was radically challenged in the 1960s when the differences between painting and sculpture were intentionally blurred and when new media (performance, body art, happenings, video art, installations and digital art) were introduced. This course seeks to understand how alternative media were developed not through the invention of new technologies nor in isolation, but through revolutionary modes of thinking about time and space, human and non-human life, machines, archives, cyborgs, and interactivity (some of which date back to the 18th and 19th centuries). Through assigned readings and discussions as well as structured essay assignments, the class provides students with extensive practice in the critical analysis of theoretical texts and ample experience synthesizing diverse intellectual ideas and arguments in written form. More broadly, through a creative “timeline” assignment, the course seeks to teach students to think inventively about new media and their histories, to learn strategies for looking at, evaluating, and thinking about works of new media art. It also provides instruction in research techniques and resources in contemporary art, as well as on writing in art history.",
    "prereq": []
  },
  {
    "uid": "788141",
    "code": "ARTH5417",
    "subject": "ARTH",
    "number": "5417",
    "honors": false,
    "writingIntensive": false,
    "name": "20th Century Theory/Criticism",
    "fullname": "Twentieth Century Theory and Criticism",
    "info": "Since the 19th century, artists, critics, and historians have deployed philosophical and theoretical ideas to think self-reflexively about the meaning of art. What counts as a work of art and who qualifies as an artist? What is the role of the viewer and how should works of art be interpreted? Are they passive reflections of their historical milieu or do they play an active role in forming cultural values? In the 1920s, the surrealists were reading Karl Marx and Sigmund Freud to answer these questions. Artists of the Harlem Renaissance studied the sociological essays of W.E.B. Dubois and Zora Neale Hurston. Conceptualist artists in the 1960s read books on semiotics; performance artists studied phenomenology reading the work of Maurice Merleau-Ponty. Feminist artists in the 1970s read up on psychoanalysis and feminist philosophy. Following in their footsteps, this is primarily a readings course designed to familiarize students with important theoretical ideas applied to the visual arts of the 20th century. The course focuses on significant trends in that century’s art theory, historical methodology, and criticism. It examines key philosophical ideas of modernism and postmodernism including formalism, semiotics, poststructuralism, feminism, Marxism, psychoanalysis, deconstruction, critical race and queer theory. Because the course is organized chronologically as well as thematically and follows the lives and writings of key figures, it is also intended to help students trace intellectual histories as they develop over the century. In addition, it seeks to foster students’ critical reading skills, discipline-specific writing skills, and to help them consider the historical implications of art theory for the production and reception of works of art today. ",
    "prereq": []
  },
  {
    "uid": "798965",
    "code": "ARTH5422",
    "subject": "ARTH",
    "number": "5422",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Graphic Arts",
    "fullname": "Off the Wall: History of Graphic Arts in Europe and America in the Modern Age",
    "info": "History/theory of creation of lithography, social caricature (e.g., Daumier, Gavarni), revival of etching (e.g., Goya, mid-century practitioners, Whistler), and color lithography (e.g., Toulouse-Lautrec, Vuillard, Bonnard). Media changes of 20th century. Revolutionary nature of new media.",
    "prereq": []
  },
  {
    "uid": "003049",
    "code": "ARTH5431",
    "subject": "ARTH",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "French Painting 1789 to 1870",
    "fullname": "Art and Activism: French Painting 1789 to 1870",
    "info": "This course surveys art major movements, institutions, and debates in France and its expanding overseas empire from the late eighteenth to the late nineteenth centuries, paying particular attention to the intersection of art and politics. Artists and movements we will consider include some of the most well-researched and revered in art history: neo-classicism-David and Ingres; Romanticism-Corot, Gericault, Delacroix; landscape and peasant painting-the Barbizon group; Realism-Courbet; and Impressionism-Manet, Pissarro, Morisot, and Degas. Major themes to be addressed in the course include, but are not limited to, the following: artists’ challenge to established institutions and exhibition practices; their participation in, and responses to, revolutionary political movements; the artist as worker; censorship and exile; visions of empire and abolition; the New Woman; and, finally, contemporary artists’ appropriations of nineteenth-century French art to advance their own artistic/political agendas in the present.",
    "prereq": []
  },
  {
    "uid": "003263",
    "code": "ARTH5454",
    "subject": "ARTH",
    "number": "5454",
    "honors": false,
    "writingIntensive": false,
    "name": "Art Nouveau",
    "fullname": "Design Reform in the Era of Art Nouveau",
    "info": "History of art nouveau in France, Belgium, England, Germany, Austria, Scotland, United States. Innovations in architecture, graphics,  decorative arts; continental variants of the style. Major promoters and pioneers of modern design.  Critical issues of design reform; texts integrated with principal monuments.",
    "prereq": []
  },
  {
    "uid": "003261",
    "code": "ARTH5463",
    "subject": "ARTH",
    "number": "5463",
    "honors": false,
    "writingIntensive": false,
    "name": "Ear.Twent.Cent.Art",
    "fullname": "Early 20th-Century Painting and Sculpture",
    "info": "Primary movements of early 20th century:  fauvism, German expressionism, cubism, futurism, dadaism, surrealism, non-objective painting, constructivism, Orphism, early abstraction. Framed against postimpressionism and internationalism at turn of century. ",
    "prereq": []
  },
  {
    "uid": "002600",
    "code": "ARTH5465",
    "subject": "ARTH",
    "number": "5465",
    "honors": false,
    "writingIntensive": false,
    "name": "American Sculpture",
    "fullname": "American Sculpture: The Public Monument",
    "info": "Case studies in American public sculpture of the l9th and 20th centuries including the l893 Chicago Fair, the Iwo Jima and Vietnam Veterans Memorials, the Washington Monument, the Lincoln Memorial; careers of Daniel Chester French and Augustus St. Gaudens.",
    "prereq": []
  },
  {
    "uid": "787783",
    "code": "ARTH5466",
    "subject": "ARTH",
    "number": "5466",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Art",
    "fullname": "Contemporary Art",
    "info": "The art of today as it is practiced around the globe takes a bewildering variety of forms—from traditional painting and sculpture to AI, interactive digital media, film projections, bio art (involving human, plant, and animal blood, tissue and DNA), participatory and community engaged projects, and environmental interventions. It addresses urgent social and political themes including globalization, institutionalized racism, climate crisis, big data, and mechanized vision. Just as today’s citizens should inform themselves about contemporary politics and current events, so is it crucial that we understand the art of our own time. In this course students gain an understanding of art’s development since the late 20th century and key ideas that are central to interpreting the art of this period. The course begins with a review of important movements, significant artists, and influential theories and issues. It then takes up and studies specific themes through the reading and analysis of theoretical texts. Students are asked to read, participate in class discussions, complete guided or independent research papers, prepare an in-class presentation on one of the course themes, and complete a book review for a textbook on contemporary art history. Each of these assignments is designed to impart specific historical knowledge about the period of the contemporary, to provide students with opportunities to practice critical reading and synthetic writing, and to offer them a chance to inspect their own positions regarding key debates.",
    "prereq": []
  },
  {
    "uid": "805040",
    "code": "ARTH5484",
    "subject": "ARTH",
    "number": "5484",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of Picasso",
    "fullname": "The Art of Picasso and the Modern Movement",
    "info": "Works of Picasso in all media. Blue, Rose, Cubist, Classical, and later periods of Picasso's development against innovations in media; collage, utilization of found-objects, printmaking and ceramics. Autobiographical nature of imagery gives methodological basis for exploring frequently personalized themes.",
    "prereq": []
  },
  {
    "uid": "806813",
    "code": "ARTH5494",
    "subject": "ARTH",
    "number": "5494",
    "honors": false,
    "writingIntensive": false,
    "name": "East/West, West/East",
    "fullname": "East/West, West/East",
    "info": "Beginning in the early 18th century and culminating at the dawn of the First World War. Chinoiserie, Orientalism, Japonisme, and western influence in Japan during the Meiji Era. Historical and critical context of trade competition, the colonial race, and the shrinking geopolitical map as the period progresses. Paintings to prints, decorative arts to architecture, and world fair exhibitions to photography.",
    "prereq": []
  },
  {
    "uid": "003532",
    "code": "ARTH5521",
    "subject": "ARTH",
    "number": "5521",
    "honors": false,
    "writingIntensive": false,
    "name": "Am. Ptg., 1876-1945",
    "fullname": "Modernism and Modernity in American Painting: 1876 to 1945",
    "info": "Relationship between modernity and \"modernism\" in the visual arts between the Centennial Exposition of 1876 and World War II. Artists addressed include the Ash Can School and the Regionalists.",
    "prereq": []
  },
  {
    "uid": "003533",
    "code": "ARTH5535",
    "subject": "ARTH",
    "number": "5535",
    "honors": false,
    "writingIntensive": false,
    "name": "Am.Colonial Ptg.",
    "fullname": "Style, Tradition, and Social Content in American Painting: Colonial Era to 1876",
    "info": "America's colonial, Revolutionary era, and 19th-century painters' responses to the influence of European aesthetics. Key American painting types: portraiture, rural genre, and landscape from Copley and Gilbert Stuart to the Hudson River School and the chroniclers of the Western frontier.",
    "prereq": []
  },
  {
    "uid": "003535",
    "code": "ARTH5536",
    "subject": "ARTH",
    "number": "5536",
    "honors": false,
    "writingIntensive": false,
    "name": "American Art",
    "fullname": "Topical Studies in American Art",
    "info": "Course description varies from year to year, depending on the current research interests of the instructor and the needs and interests ofadvanced undergraduate and graduate students in modern and American art.",
    "prereq": []
  },
  {
    "uid": "014409",
    "code": "ARTH5546",
    "subject": "ARTH",
    "number": "5546",
    "honors": false,
    "writingIntensive": false,
    "name": "Amer Arch 1840-1914",
    "fullname": "American Architecture: 1840 to 1914",
    "info": "American architecture from 1840 to 1914, examined in relation to European precedents and American sociohistorical conditions.  Critical attention to problems of style, the architectural profession, vernacular vs. \"high\"architecture, technology, economics, urbanism, and social reform.",
    "prereq": []
  },
  {
    "uid": "806376",
    "code": "ARTH5565",
    "subject": "ARTH",
    "number": "5565",
    "honors": false,
    "writingIntensive": false,
    "name": "American Art in the Gilded Age",
    "fullname": "American Art in the Gilded Age",
    "info": "In 1873, Mark Twain coined the phrase “Gilded Age” to describe an era in which public displays of national prosperity and optimism barely covered over the deeper realities of racial violence, labor inequities, and strident political divisions in the barely reunited republic, still recovering from a bloody Civil War. This class will examine the social and cultural history of the United States from 1865-1910, by following the visual record of paintings, sculpture, photographs, architecture, and landscape and furniture design. We will look closely at works by artists including Winslow Homer, Abbott Thayer, Cecilia Beaux, Henry Ossawa Tanner, Jacob Riis, Gertrude Käsebier, Thomas Nast, Bernhard Gillam, Frederick Law Olmsted, McKim, Mead & White, and Candace Wheeler. We will consider the role of creatively made images and objects as both a tool of the elite and the weapon of the critic. And we will actively investigate the kinds of questions art historians ask about this era, so as to ask new questions and produce new scholarship that might productively address the concerns of our own. Open to interested students from all majors, this course culminates in an independent research project suitable for development as a senior capstone project.",
    "prereq": []
  },
  {
    "uid": "803732",
    "code": "ARTH5575",
    "subject": "ARTH",
    "number": "5575",
    "honors": false,
    "writingIntensive": false,
    "name": "Boom - Bust in American Art",
    "fullname": "Boom to Bust: American Art from the Roaring Twenties to the Great Depression",
    "info": "American art/culture from 1917 to 1940. Boom of post-WWI affluence, bust of stock market crash, Midwestern Dust Bowl. How tumultuous times influenced painting, sculpture, photography, and industrial design.",
    "prereq": []
  },
  {
    "uid": "825859",
    "code": "ARTH5576",
    "subject": "ARTH",
    "number": "5576",
    "honors": false,
    "writingIntensive": false,
    "name": "Outsiders in American Art",
    "fullname": "Folk, Self-Taught, Visionary, Naïve:  Outsiders in American Art",
    "info": "Get to know the “outsiders” -- people who spent their lives making art without an interest in the mainstream art world. Study visionaries like Henry Darger, Bill Traylor, Vivian Maier, Daniel Johnston, Clementine Hunter, and Martín Ramírez. Dive into environments like Dr. Evermore’s Forevertron in Wisconsin and The Orange Show in Texas. Our goal in this class is to look at non-traditional art made between 1900 and today, in all regions of the U.S., and to ask questions about the various factors that lead to its marginalized status in the art world. In learning about so-called outsider art, we will use methods drawn from art history, cultural geography, religious studies, folklore, ethnomusicology, race and disability studies, and museum studies. Throughout the semester, you will learn the skills of visual analysis, archive- and object-based research, and writing for public audiences. The final project involves conducting original research on an artist or artwork of your choosing, and communicating your findings in a final project that will take the form of your choice (e.g., podcast, online exhibition, visual artwork, traditional academic paper, etc.).",
    "prereq": []
  },
  {
    "uid": "808479",
    "code": "ARTH5577",
    "subject": "ARTH",
    "number": "5577",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of the Harlem Renaissance",
    "fullname": "Art of the Harlem Renaissance",
    "info": "Visual side of Harlem Renaissance, as represented by painters, illustrators, sculptors, and photographers. How African-Americans in 1920s/30s tried to reclaim visual field for purpose of racial redefinition.",
    "prereq": []
  },
  {
    "uid": "792039",
    "code": "ARTH5655",
    "subject": "ARTH",
    "number": "5655",
    "honors": false,
    "writingIntensive": false,
    "name": "African-American Cinema",
    "fullname": "African-American Cinema",
    "info": "African American cinematic achievements, from silent films of Oscar Micheaux through contemporary Hollywood and independent films. Class screenings, critical readings.",
    "prereq": []
  },
  {
    "uid": "008209",
    "code": "ARTH5725",
    "subject": "ARTH",
    "number": "5725",
    "honors": false,
    "writingIntensive": false,
    "name": "Ceramics-Far East",
    "fullname": "Ceramics in the Far East",
    "info": "Selective examination of representative pottery and ceramic wares produced in China, Korea, and Japan from the Neolithic era to modern times. Nearly every major ceramic type is represented.",
    "prereq": []
  },
  {
    "uid": "008212",
    "code": "ARTH5765",
    "subject": "ARTH",
    "number": "5765",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Chinese Art",
    "fullname": "Early Chinese Art",
    "info": "Art/material culture of early China from Neolithic age (ca. 10000-2000 BCE) to early imperial period (221 BCE-906 CE).",
    "prereq": []
  },
  {
    "uid": "008213",
    "code": "ARTH5766",
    "subject": "ARTH",
    "number": "5766",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Painting",
    "fullname": "Chinese Painting",
    "info": "Major works from the late bronze age to the modern era that illustrate the development of Chinese landscape painting and associated literary traditions.",
    "prereq": []
  },
  {
    "uid": "008239",
    "code": "ARTH5767",
    "subject": "ARTH",
    "number": "5767",
    "honors": false,
    "writingIntensive": false,
    "name": "Japanese Painting",
    "fullname": "Japanese Painting",
    "info": "Japanese pictorial arts from the late tomb period to the modern era; special attention to the development of indigenous traditions.",
    "prereq": []
  },
  {
    "uid": "008215",
    "code": "ARTH5769",
    "subject": "ARTH",
    "number": "5769",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Art Connoisseurship",
    "fullname": "Connoisseurship and Curatorial Practice in Early Chinese Art",
    "info": "This course provides students an immersive experience in the study of early Chinese art and material culture from the Neolithic age (ca. 8000?ca. 2000 BCE) to the early imperial period (221 BCE-220 CE). Geographical coverage uses today's China as a point of departure, but its scope also extends to the rest of the world. This course will explore artifacts in a variety of media, including ceramic, jade, metal, lacquer, silk, painting and writing, as well as ephemeral arts. Students are expected to think each artwork as the embodiment of the complex socio-cultural history of the period, in which they were produced. Guided by the instructor, students will have a selective examination of representative works of art from MIA (the Minneapolis Institute of Art), where they are supposed to be engaged in comprehensive object study, consultation and investigation with the curators, and develop essential curatorial skills of working with artworks. Based on two or more selected artworks, students are expected to finish a short research paper that is throughly studied and potentially publishable.",
    "prereq": []
  },
  {
    "uid": "820034",
    "code": "ARTH5773",
    "subject": "ARTH",
    "number": "5773",
    "honors": false,
    "writingIntensive": false,
    "name": "Making Place in S. Asian Art",
    "fullname": "Making Place: Concepts of Space in Indian Art and Architecture",
    "info": "This course introduces students to major monuments, sites, and media of South Asian art and religion by investigating theories and representations of space and place in South Asia. We will examine works of art from the major religious traditions of South Asia (Hinduism, Islam, Jainism, and Buddhism) and across media such as murals, poetry, architecture, and urban form.Critical theory since the 1980s has come to understand space “as a variegated, complex, often bewildering series of different types of locations: physical, mythological, symbolic, imagined, linguistic, cartographic, perceptual, representational, i.e., space as suspended between matter and meaning” (Warf and Arias, 2009). This course will consider the complexity and historical and cultural specificities of notions of space and place in the art and architecture of South Asia. We will survey the diversity of representations and concepts of space, such as painted banners, murals, poetry, architecture, and urban form. We will examine works of art from the major religious traditions of South Asia: Hinduism, Islam, Jainism, and Buddhism. Course readings will interweave theoretical or methodological texts with historical examples. We will closely examine the transformation of sacred sites and networks and their reuse and appropriation by successive patrons and populations; pilgrimage, both physical and notional, as constitutive of differing notions of space; city planning that reflects ideas about sacred topographies, and the built environment of the city as expressive of identity. This course introduces students to major monuments, sites, and media of South Asian art and religion by investigating how those objects have been understood in the physical and notional environments of their production and reception.",
    "prereq": []
  },
  {
    "uid": "820000",
    "code": "ARTH5774",
    "subject": "ARTH",
    "number": "5774",
    "honors": false,
    "writingIntensive": false,
    "name": "The Body in Indian Art",
    "fullname": "The Body in Indian Art",
    "info": "This course explores the concept of embodiment and the nature of representation, from images of gods to human portraits, in Hindu, Jain, Buddhist, Muslim, and courtly contexts. We consider diverse media from ancient to modern periods, including painting, sculpture, photography, architecture, inscriptions, and literature.This course explores the concept of embodiment in the diverse artistic traditions of South Asia. We will consider how ideas of representation of an individual have been understood and expressed differently across the history of South Asian art and religions. The course will consider the embodied representation of deities and semi-divine figures along with those of \"real\" people; we will consider, given the ontologies of such representations in their religious and cultural contexts. Representation of an individual—a portrait—is a foundational subject in the canon of art history. What does the very idea of a portrait mean so far outside the canon of (Western) art history? As we survey the diverse traditions and media of images of the body, we will be attentive to questions such as, Does media make meaning for these types of images? Can a 'portrait' be textual? Is verisimilitude essential to the depiction of a person? In what ways are practices of depiction informed by other modes of image-making, such as images of religious devotion, and traditions of representation encountered through trade or gift? We will consider diverse media from Ancient India to the modern period, including painting, stone and metal sculpture, photography, architecture, inscriptions, and even a Sanskrit play.",
    "prereq": []
  },
  {
    "uid": "002317",
    "code": "ARTH5775",
    "subject": "ARTH",
    "number": "5775",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Indian Art",
    "fullname": "Formation of Indian Art: 2500 BCE to 300 CE",
    "info": "Sculpture/architecture, from Indus Valley civilization through Kushana period.",
    "prereq": []
  },
  {
    "uid": "008895",
    "code": "ARTH5776",
    "subject": "ARTH",
    "number": "5776",
    "honors": false,
    "writingIntensive": false,
    "name": "Indian Art,400-1300",
    "fullname": "Redefining Tradition: Indian Art, 400 to 1300",
    "info": "India's art/architecture, from earliest free-standing temples through 13th century. Focuses on temples, associated sculpture. Mural painting, beginnings of Islamic architecture in India.",
    "prereq": []
  },
  {
    "uid": "002491",
    "code": "ARTH5777",
    "subject": "ARTH",
    "number": "5777",
    "honors": false,
    "writingIntensive": false,
    "name": "Indian Empires after 1200",
    "fullname": "The Diversity of Traditions: Indian Empires after 1200",
    "info": "This class considers the development of Indian and Pakistani art and architecture from the introduction of Islam as a major political power at the end of the 12th century to the colonial empires of the 18th century.  We will study how South Asia’s diverse ethnic and religious communities interacted, observing how visual and material cultures reflect differences, adaptations, and shared aesthetic practices within this diversity of traditions. Students in this class will have mastered a body of knowledge about Indian art and probed multiple modes of inquiry. We will explore how Muslim rulers brought new traditions yet maintained many older ones making, for example, the first mosque in India that combines Muslim and Indic visual idioms. We will study the developments leading to magnificent structures, such as the Taj Mahal, asking why such a structure could be built when Islam discourages monumental mausolea.  In what ways the schools of painting that are the products of both Muslim and Hindu rulers different and similar? The course will also consider artistic production in the important Hindu kingdoms that ruled India concurrently with the great Muslim powers. In the 18th century, colonialist forces enter the subcontinent, resulting in significant innovative artistic trends. Among questions we will ask is how did these kingdoms influence one another? Throughout we will probe which forms and ideas seem to be inherently Indian, asking which ones transcend dynastic, geographic and religious differences and which forms and ideas are consistent throughout these periods of political and ideological change.  To do all this we must constantly consider how South Asia’s diverse ethnic and religious communities interact.",
    "prereq": []
  },
  {
    "uid": "818602",
    "code": "ARTH5778",
    "subject": "ARTH",
    "number": "5778",
    "honors": false,
    "writingIntensive": false,
    "name": "South Asian Painting",
    "fullname": "Traditions of South Asian Painting: Past to Present",
    "info": "This course surveys the rich diversity of painted media in India, Pakistan, Sri Lanka, and Nepal, from 5th-century murals to contemporary canvases that travel the world. We will locate the works in their physical, ritual, and intellectual contexts.We will explore how the familiar categories with which we describe painting, such as Landscape, Portraiture, Narrative, and even Modern, might be productively reassessed in light of South Asian aesthetic traditions by locating the works in their physical, ritual, and intellectual contexts. The course culminates in the contested spaces of contemporary art, where questions of politics, identity, and intention come to the fore. Although mainly focusing on the painting traditions of India, the course will include painting from Pakistan, the Himalayas, Sri Lanka, and the South Asian diaspora. The humanities sharpen our ability to develop critical questions and to judge why and how one answer or interpretation may be stronger than another. Humanistic thinking is developed in dialogue; it emerges between individuals in conversation with each other and with their objects of study. This course asks you to boldly bring your curiosity, convictions, and blind-spots to our collective conversation, close reading, and individual writing.The course consists of two weekly meetings, and one or two trips to nearby museums or galleries. ",
    "prereq": []
  },
  {
    "uid": "002496",
    "code": "ARTH5781",
    "subject": "ARTH",
    "number": "5781",
    "honors": false,
    "writingIntensive": false,
    "name": "Age of Empire",
    "fullname": "Age of Empire: The Mughals, Safavids, and Ottomans",
    "info": "Artistic developments under the three most powerful Islamic empires of the 16th through 19th centuries: Ottomans of Turkey; Safavids of Iran; Mughals of India. Roles of religion and state will be considered to understand their artistic production.",
    "prereq": []
  },
  {
    "uid": "817709",
    "code": "ARTH5783",
    "subject": "ARTH",
    "number": "5783",
    "honors": false,
    "writingIntensive": false,
    "name": "Art, Diplomacy and Empire",
    "fullname": "Art, Diplomacy and Empire",
    "info": "This course examines the mobility and agency of objects and people in diplomatic practice. An emerging body of scholarship within Renaissance and early modern studies explores the exchange and global circulation of objects and their role in cultural encounters. The possibilities offered by this 'material turn' highlight the potential of objects to enable cultural contact, conversion and exchange across traditional political and cultural boundaries. At the same time, recent innovative and interdisciplinary approaches to exchange highlight cultural aspects of the diplomatic encounter. As a result, the roles of diplomats, interpreters, merchants as well as various types of objects and services continue to be interpreted in new ways. This course will introduce students to canonical texts associated with gift-exchange and reciprocity, and will explore their relevance to the disciplines of history and art history particularly with regard to imperial encounters and exchanges.",
    "prereq": []
  },
  {
    "uid": "002522",
    "code": "ARTH5785",
    "subject": "ARTH",
    "number": "5785",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of Islamic Iran",
    "fullname": "Art of Islamic Iran",
    "info": "Architecture, painting, and related arts in Iran from the inception of Islam (7th century) through the 20th century. Understanding the nature of Islam in Persianate cultural settings and how artistic production here compares to the Islamic world.",
    "prereq": []
  },
  {
    "uid": "809858",
    "code": "ARTH5786",
    "subject": "ARTH",
    "number": "5786",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Medieval Metropolises",
    "fullname": "Theorizing City and Space in the Mediterranean and Western Asia",
    "info": "Development of greatest cities of Eastern Mediterranean/Western Asia from age of Alexander to rise of Islam. Methodological/theoretical approaches to study of cities where as much evidence exists in texts as archaeological form.",
    "prereq": []
  },
  {
    "uid": "809859",
    "code": "ARTH5787",
    "subject": "ARTH",
    "number": "5787",
    "honors": false,
    "writingIntensive": false,
    "name": "Visual Cultures in Contact",
    "fullname": "Visual Cultures in Contact: Cross-Cultural Interaction in the Ancient World",
    "info": "What happens when two cultures meet? How do different cultures shape and influence each other? In this course we'll examine how the diverse cultures of the Ancient Eurasian world  became entangled with one another through the material remains they left behind. We'll use a variety of tools and techniques to analyze and interpret material objects, spaces and art—from the Egyptians and Sassanians, to the Romans and Qin and Han dynasties. Uncover a more nuanced and inclusive understanding of how these ancient cultures changed their ideologies, iconographies, and modes of representation through trade networks, political alliances, and colonial enterprise.",
    "prereq": []
  },
  {
    "uid": "807005",
    "code": "ARTH5801",
    "subject": "ARTH",
    "number": "5801",
    "honors": false,
    "writingIntensive": false,
    "name": "Spoken Word and Painted Texts",
    "fullname": "Spoken Word and Painted Texts in the Americas (200-1650 A.D.)",
    "info": "Mexico, Maya region, colonial Peru (ca. A.D. 500-1600). Analyze primary sources, interpretations, major problems confronting scholars. Difference between theoretical/methodological approaches.",
    "prereq": []
  },
  {
    "uid": "806982",
    "code": "ARTH5802",
    "subject": "ARTH",
    "number": "5802",
    "honors": false,
    "writingIntensive": false,
    "name": "The Inka and Their Ancestors",
    "fullname": "Art of the Inka and their Ancestors",
    "info": "Art/architecture of people of Andes, from first appearance in archaeological record until Spanish invasion in 16th century. Problems, theoretical/methodological approaches. Analysis of scholarly writing, focusing on evidence. ",
    "prereq": []
  },
  {
    "uid": "008408",
    "code": "ARTH5925",
    "subject": "ARTH",
    "number": "5925",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Photography as Art",
    "fullname": "History of Photography as Art",
    "info": "Origins and development of photography, with attention to technology and cultural impact.  Major aesthetic achievements in photography from its beginning to present.",
    "prereq": []
  },
  {
    "uid": "811502",
    "code": "ARTH5926",
    "subject": "ARTH",
    "number": "5926",
    "honors": false,
    "writingIntensive": false,
    "name": "Cinema of Alfred Hitchcock",
    "fullname": "The Cinema of Alfred Hitchcock",
    "info": "This course examines the achievement and significance of Alfred Hitchcock. It will consider his entire career, including both the British and American periods, his major films and his television program, Alfred Hitchcock Presents. The course will address his characteristic themes and concerns (the double, the relationship between criminality and legality, the play of suspense and surprise); the traditions that shaped him (the Gothic in literature and theater; Victorian melodrama) and the influence he had on other films and filmmakers (the horror film, the political thriller); his significance in relation to the history of film criticism and scholarship (auteurist, feminist, queer). Students will gain a thorough knowledge of Hitchcock and the biographical, historical, technological, industrial, aesthetic issues surrounding his achievement. They will gain practical experience in analyzing films and addressing the critical issues raised by the media in contemporary society.",
    "prereq": []
  },
  {
    "uid": "016066",
    "code": "ARTH5927",
    "subject": "ARTH",
    "number": "5927",
    "honors": false,
    "writingIntensive": false,
    "name": "Documentary Cinema",
    "fullname": "Documentary Cinema",
    "info": "History of nonfiction filmmaking, from early forms of reportage and birth of documentary to emergence of \"film-verite\" and \"guerrilla television\" and work by independents (e.g., Errol Morris, Michael Moore).",
    "prereq": []
  },
  {
    "uid": "009275",
    "code": "ARTH5930",
    "subject": "ARTH",
    "number": "5930",
    "honors": false,
    "writingIntensive": false,
    "name": "Junior-Senior Seminar",
    "fullname": "Junior-Senior Seminar",
    "info": "Major art-historical theme, artist, period, or genre. Topics specified in Class Schedule.prereq: [Jr or sr] ArtH major, instr consent",
    "prereq": []
  },
  {
    "uid": "008411",
    "code": "ARTH5940",
    "subject": "ARTH",
    "number": "5940",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of the Film",
    "fullname": "Topics: Art of the Film",
    "info": "Topics in film history including individual directors (e.g., Hitchcock, Welles), genres (e.g., westerns, musicals), and other topics (e.g., American independent filmmaking, film noir).",
    "prereq": []
  },
  {
    "uid": "008220",
    "code": "ARTH5950",
    "subject": "ARTH",
    "number": "5950",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Art History",
    "fullname": "Topics: Art History",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "008046",
    "code": "ARTH5960",
    "subject": "ARTH",
    "number": "5960",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Art History",
    "fullname": "Topics: Art History",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "016068",
    "code": "ARTH5993",
    "subject": "ARTH",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "This course provides a mechanism for advanced undergraduate and graduate students to work closely with a faculty member to plan their own course of study around a topic or topics of mutual interest that are not otherwise covered (or are not covered with the same level of depth) in the regular curriculum.  In addition, the very task of designing the course–working with the faculty adviser to research the topic, decide on goals, outcomes, and assessments, and determine a sequence of readings, meetings, and tasks–is an invaluable exercise for the student. In general, the course may be designed as an intensive period of reading in key scholarly literatures in which the instructor has expertise or as an independent research project on a topic and with an outcome (such as an annotated bibliography, capstone paper draft, a qualifying paper, dissertation prospectus, exhibition proposal, or archive) that will serve the student’s future academic career.The course schedule, required readings, assignments, and assessments are worked out in advance and agreed upon by both parties in the “Student/Faculty Contract for Independent/Directed Study,” to which is often appended a bibliography or plan of work.  The contract is signed by the participants and approved by the appropriate departmental authority (e.g., the Director of Graduate Studies or Chair). prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "016073",
    "code": "ARTH5994",
    "subject": "ARTH",
    "number": "5994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "tbdprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "792968",
    "code": "ARTH8001",
    "subject": "ARTH",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Theory and Methods",
    "fullname": "Art Historiography: Theory and Methods",
    "info": "Key texts, from Renaissance to present, from western/non-western fields, relating to history/criticism of both art and visual culture. Focuses on recent critical theory, its re-examination of assumptions underlying the discipline.",
    "prereq": []
  },
  {
    "uid": "801519",
    "code": "ARTH8120",
    "subject": "ARTH",
    "number": "8120",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Applications",
    "fullname": "Computer Applications in Art History and Archaeology",
    "info": "Seminar. Potential of digital technology as applied to art history/archaeology. Computer technologies as affecting methodologies of art history/archaeology. Way in which art history/archaeology can contribute to emerging computer applications.",
    "prereq": []
  },
  {
    "uid": "009371",
    "code": "ARTH8190",
    "subject": "ARTH",
    "number": "8190",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Ancient Art and Arch",
    "fullname": "Seminar: Issues in Ancient Art and Archaeology",
    "info": "Selected topics, with special attention to current scholarly disputes. Topics specified in Class Schedule.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "009311",
    "code": "ARTH8200",
    "subject": "ARTH",
    "number": "8200",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem.: Medieval Art",
    "fullname": "Seminar: Medieval Art",
    "info": "Focus on a major art historical theme, artist, period, or genre.  ",
    "prereq": []
  },
  {
    "uid": "792969",
    "code": "ARTH8320",
    "subject": "ARTH",
    "number": "8320",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar Early Mdrn Visual Cltr",
    "fullname": "Seminar: Issues in Early Modern Visual Culture",
    "info": "Issues in visual culture of Europe and the Americas, 1500-1750. Topics vary, may include representation of body, collectors/collecting, impact of Reformation, image/book, art/discovery, early modern vision/visuality.",
    "prereq": []
  },
  {
    "uid": "788079",
    "code": "ARTH8333",
    "subject": "ARTH",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "007200",
    "code": "ARTH8340",
    "subject": "ARTH",
    "number": "8340",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem.: Baroque Art",
    "fullname": "Seminar: Baroque Art",
    "info": "Topics vary.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "003039",
    "code": "ARTH8400",
    "subject": "ARTH",
    "number": "8400",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: 19th C Art",
    "fullname": "Seminar: Issues in 19th-Century Art",
    "info": "Typical seminars have included symbolism, role of the academy and the avant-garde, surrealism in art and theory, and Franco-American relationships at the turn of the 20th century.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "787784",
    "code": "ARTH8440",
    "subject": "ARTH",
    "number": "8440",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Contemporary Art",
    "fullname": "Seminar: Contemporary Art",
    "info": "Identity politics in contemporary art. Theories of performance/performativity. Nationalism/sexuality in art since 1980s. Discourses of death in postmodernism. Body at turn of 21st century.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "788314",
    "code": "ARTH8444",
    "subject": "ARTH",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "803760",
    "code": "ARTH8500",
    "subject": "ARTH",
    "number": "8500",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in Latin American Art",
    "fullname": "Issues in Latin American Art",
    "info": "Topics vary.",
    "prereq": []
  },
  {
    "uid": "003536",
    "code": "ARTH8520",
    "subject": "ARTH",
    "number": "8520",
    "honors": false,
    "writingIntensive": false,
    "name": "American Art&Material Culture",
    "fullname": "Seminar: American Art and Material Culture",
    "info": "Topics in American art, popular art, and material culture, emphasizing methods and techniques of inquiry: creation and use of archives, oral history, sources for pictorial evidence, and current approaches to interpreting traditional and non-traditional data.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "788440",
    "code": "ARTH8666",
    "subject": "ARTH",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbdprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "008835",
    "code": "ARTH8710",
    "subject": "ARTH",
    "number": "8710",
    "honors": false,
    "writingIntensive": false,
    "name": "Islamic Art",
    "fullname": "Seminar: Islamic Art",
    "info": "Focus depends on current research interests of the professor and needs and interests of graduate students in Islamic and Asian art history.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "009990",
    "code": "ARTH8720",
    "subject": "ARTH",
    "number": "8720",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem.:East Asian Art",
    "fullname": "Seminar:East Asian Art",
    "info": "Research focuses on closely defined topic, such as a short period of Chinese art, a restricted subject, or role of a single artist. A substantive research paper is required and participation in the seminar dialogue is expected.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "003018",
    "code": "ARTH8770",
    "subject": "ARTH",
    "number": "8770",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem.: Art of India",
    "fullname": "Seminar: Art of India",
    "info": "Selected problems and issues in history of South Asian art. Topic varies by offering.prereq: 3 cr art history, instr consent",
    "prereq": []
  },
  {
    "uid": "817633",
    "code": "ARTH8783",
    "subject": "ARTH",
    "number": "8783",
    "honors": false,
    "writingIntensive": false,
    "name": "Art, Diplomacy, and Empire",
    "fullname": "Art, Diplomacy, and Empire",
    "info": "This course examines the mobility and agency of objects and people in diplomatic practice. An emerging body of scholarship within Renaissance and early modern studies explores the exchange and global circulation of objects and their role in cultural encounters. The possibilities offered by this 'material turn' highlight the potential of objects to enable cultural contact, conversion, and exchange across traditional political and cultural boundaries. At the same time, recent innovative and interdisciplinary approaches to exchange highlight cultural aspects of the diplomatic encounter. As a result, the roles of diplomats, interpreters, merchants as well as various types of objects and services continue to be interpreted in new ways. This course will introduce students to canonical texts associated with gift-exchange and reciprocity, and will explore their relevance to the disciplines of history and art history particularly with regard to imperial encounters and exchanges.  ",
    "prereq": []
  },
  {
    "uid": "787827",
    "code": "ARTH8888",
    "subject": "ARTH",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "010257",
    "code": "ARTH8920",
    "subject": "ARTH",
    "number": "8920",
    "honors": false,
    "writingIntensive": false,
    "name": "Film History and Criticism",
    "fullname": "Seminar: Film History and Criticism",
    "info": "Selected topics in film history and theory, including specific directors, genres, movements, periods, and critical issues (e.g., violence).prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "007982",
    "code": "ARTH8950",
    "subject": "ARTH",
    "number": "8950",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Issues in Art History",
    "fullname": "Seminar: Issues in the History of Art",
    "info": "Theoretical or topical issues. Topics vary.\n\nprereq: 3 cr art history, instr consent",
    "prereq": []
  },
  {
    "uid": "010582",
    "code": "ARTH8970",
    "subject": "ARTH",
    "number": "8970",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "tbdprereq: instr consent",
    "prereq": []
  }
]