[
  {
    "uid": "005459",
    "code": "ARTS1001",
    "subject": "ARTS",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Contemporary Art Theory",
    "fullname": "Introduction to Contemporary Art and Theory",
    "info": "This course introduces you to contemporary perspectives on art through the lens of race, power, and justice. How has art allowed marginalized people to protest oppression, express joy and defiance, and serve as a cultural space for healing? In what ways does the symbolic, open-ended language of art allow artists to imagine otherwise, conjure different futures, and connect to ancestral pasts that co-mingle with present lived experiences? Course readings center BIPOC voices and focus on issues of representation, cultural appropriation, and decolonization. We look at the emergence of ‘fine art,’ a cultural category steeped in race, power, and the politics of exclusion; the history of the Black art movement and its commitment to political purpose in art; the challenges that arise from the insistence that the political align with the aesthetic. The course explores Indigenous organizing and resurgence as well as the politics of opacity and refusal. We will study socially engaged art forms, Afro- and indigenous futurisms, creative practices that explode distinctions between “traditional” and “modern,” art and craft, and engage with art as a field of cultural expression deeply involved in imagining and demanding social justice.",
    "prereq": []
  },
  {
    "uid": "811422",
    "code": "ARTS1002",
    "subject": "ARTS",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and Life",
    "fullname": "Art and Life: Thinking About Ethics Through Art",
    "info": "Case examples from visual arts. Ethical theories. Philosophical take on relationship between art, life, ethics. ",
    "prereq": []
  },
  {
    "uid": "809628",
    "code": "ARTS1003",
    "subject": "ARTS",
    "number": "1003",
    "honors": false,
    "writingIntensive": false,
    "name": "MyMovies",
    "fullname": "MyMovies",
    "info": "Examination of new moving image/filmmaking practices. How technology has changed practice, aesthetics, discourse of moving images. Hybrid practice/study course. Create short films using new technologies such as smart-phones/other hand-held devices.",
    "prereq": []
  },
  {
    "uid": "809968",
    "code": "ARTS1004",
    "subject": "ARTS",
    "number": "1004",
    "honors": false,
    "writingIntensive": false,
    "name": "Art From Vintage Cinema",
    "fullname": "Artistic Interpretation from Vintage Cinema",
    "info": "For non-art majors who enjoy classic movies/want to familiarize themselves with basic artistic techniques. View twelve rarely seen vintage films from different time periods/cultures. Discuss films, respond in visual medium. No previous drawing experience/artistic ability necessary.",
    "prereq": []
  },
  {
    "uid": "005159",
    "code": "ARTS1101",
    "subject": "ARTS",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Drawing",
    "fullname": "Introduction to Drawing",
    "info": "This is an introductory studio course in drawing with an emphasis on representation from direct observation. Students are exposed to the ideas, methods, and materials of drawing. Fundamental elements such as line, value, texture, shape, and space are explored in works using media such as graphite, charcoal, and ink on a variety of surfaces. Found and other source materials are utilized in collage and mixed-media works. Students will create original work based on observation and imagination in hands-on exercises and projects. This rigorous course will also introduce techniques and methods to realize and evaluate visual ideas. Students will draw from a live model in order to further develop observational drawing skills. Technical demonstrations, lectures, and exhibition visits will provide starting points for further explorations. Individual and group critiques will help students address technical concerns and contextualize their work within the rich history of drawing. We will develop the verbal and analytical skills necessary to critically examine students' work. Studio work outside of class time is expected.",
    "prereq": []
  },
  {
    "uid": "005553",
    "code": "ARTS1102",
    "subject": "ARTS",
    "number": "1102",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Painting",
    "fullname": "Introduction to Painting",
    "info": "This is an introductory studio course that will focus on the fundamentals of painting (oil and/or acrylic). We will explore a variety of media, techniques, and subject matter. Our assignments will emphasize developing the skills and understanding of basic painting fundamentals, using traditional and experimental approaches to painting, such as: color mixing and relationships, tone, mark-making, texture, abstraction, space, and visual language. There will be demonstrations, practice, field trip(s) and class discussion. We will develop the verbal and analytical skills necessary to critically examine students' work. We will look at historical and contemporary painters. This course provides an introduction the creative process through hands-on investigation, observation of the immediate environment, and the exploring the artist's imagination. Studio work outside of class is expected.",
    "prereq": []
  },
  {
    "uid": "798732",
    "code": "ARTS1103",
    "subject": "ARTS",
    "number": "1103",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Printmaking",
    "fullname": "Introduction to Printmaking: Relief, Screen and Digital Processes",
    "info": "Students will be introduced to techniques of relief printing using oil based inks, screenprinting using water based inks, and digital printmaking. Relief projects (linoleum and woodcut) emphasize the exploration of mark making, printing techniques and color layering. Screen print and digital applications will explore layering, color and image making strategies. Students will learn digital strategies for creating images in screen printing, working from both photo and drawn sources. The course includes the historical context and recent innovations for each process in order to develop contemporary applications for these each method. Students will develop meaningful content in conjunction with the acquisition of technical skills. Individual and group critiques will help students to address technical concerns and contextualize their work within the rich history of printmaking. Studio work outside of scheduled class time is expected.",
    "prereq": []
  },
  {
    "uid": "816853",
    "code": "ARTS1104",
    "subject": "ARTS",
    "number": "1104",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Drawing and Printmaking",
    "fullname": "Introduction to Drawing and Printmaking",
    "info": "This course exposes students to the ideas, methods, and materials of drawing and printmaking. Fundamental elements such as line, value, texture, shape and space are explored in works using media such as graphite, charcoal and ink on a variety of surfaces. Students will be introduced to printmaking methods through monoprinting and other immediate techniques. In hands-on exercises and projects, students will create original work based on observation and imagination. Slide lectures and critiques will help students to address technical concerns and contextualize their work within the rich history of these two graphic media. Studio work outside of scheduled class time is expected.\n",
    "prereq": []
  },
  {
    "uid": "816854",
    "code": "ARTS1107",
    "subject": "ARTS",
    "number": "1107",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Digital Drawing",
    "fullname": "Introduction to Digital Drawing",
    "info": "This course introduces students to digital drawing as a means of expression. Students will experiment with methods of making marks on a surface or virtual surface, and the materiality and process of making those marks. In this introductory drawing course, students will explore the realm of possibilities of digital technology as an essential component in a contemporary drawing practice. Elements such as line, value, texture, shape and space are explored in works using digital technology.Students will learn the basics of drawing using Wacom Bamboo, Cintiq tablets, and Adobe software applications. This class provides students with hands on experience with technological aids in art making such as a laser cutter, digital router, 3d printers, digital embroidery machine, vinyl cutter, and sonic welder. Students will also gain experience using large format Epson printers with a variety of materials.This class will use drawing to explore conceptual development and critical thinking. Individual and collaborative projects are aimed to provide students with  technical ability while building concept and content in the work. Individual and group critiques will help students to address technical concerns and contextualize their work within the rich history of drawing.  Studio work outside of scheduled class time is expected.  ",
    "prereq": []
  },
  {
    "uid": "819990",
    "code": "ARTS1201",
    "subject": "ARTS",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Art + Change",
    "fullname": "Art + Change: The Transformational Power of Art",
    "info": "Art+ Change: The Transformational Power of Art is an introduction to the complex and varied artist-centered approaches to the social, ethical, political, and environmental challenges of our times. As an emerging form of art, contemporary socially engaged art is not a monolithic practice and goals amongst practitioners exhibit a wide range of approaches. Artists may work towards changing dominant systems in order to foster more positive outcomes; other artists strive to acknowledge and call out complexity and contradictions of those same systems. While artists working in this field, commonly called social practice work, investigate a broad set of topics and media approaches, with varying motivations and intentions, what they share is a foregrounding of the subject and content that informs the work.  This course examines the way engaged social art practice can lead to sustained connections and shared visions within communities and institutions; can create a more just and equitable culture; and can address many pressing environmental and social issues of our day. The class investigates the role of the art as a catalyst for social change. We will approach this through questions and dialogue, acknowledging that many of the tensions and contradictions cannot be resolved but are still worth the effort to recognize and address.  This course combines a research-based learning environment with a strong studio- based component. Through readings, presentations, field trips, experiential and sensory opportunities, case studies, video presentations, and class project initiatives, we will explore the spectrum of contemporary strategies to a socially engaged approach to art.  Students will create hands-on and a culminating collaborative creative project and will learn to identify themes, develop ideas individually, and collectively and execute these ideas through multiple ways of knowing and making of art projects. Through a variety of media, students will be encouraged to explore issues and address themes that they are passionate about. Students will be assessed through their participation in discussion, through their writing, and the quality of their creative  projects",
    "prereq": []
  },
  {
    "uid": "818944",
    "code": "ARTS1202",
    "subject": "ARTS",
    "number": "1202",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and Yoga",
    "fullname": "Art and Yoga: Combining Somatic, Contemplative, and Creative Practices",
    "info": "Art and Yoga integrates somatic and creative practices for greater peace, joy, self-acceptance, and vitality. It nurtures your full creative potential and develops your connection to your inner resources through a careful sequencing of yoga and art. Each class opens with yoga, chanting, and meditation, which leads into guided creative exercises with various art materials. This yoga-then-art sequence helps you selectively calm and energize the body/mind prior to experimenting with the expressive arts. Highlighting Kundalini Yoga, during each class we learn a mixture of pranayam (breathing techniques), kriyas (postural asana sequences), and meditations with mudra (hand positions) and mantra (repetition of primal sounds and sacred phrases). Along the way students learn effective self-care practices to manage stress and overwhelm. During the second half of each class, once in a meditative, yogic state, we explore a guided creative prompt, typically using oil pastels, water-based paints and other mixed media for drawing and painting, or pen and paper for creative writing. Occasionally we explore sound and authentic movement. Overall, the course emphasizes the creative process rather than the final outcome; the intention is to cultivate a non-judgmental attitude towards our body/minds and the creative gifts we have to share. You leave the course feeling stronger emotionally, physically, and creatively. Bring a yoga mat and wear comfortable clothing to class. Art materials are supplied for the creative exercises we do during class. The yoga-then-art sequence is also used during your weekly home practice. A list will be provided for you to purchase supplies to use at home, though feel free to use materials you already own. Evaluation based on attendance, participation, quality of engagement, a service component, regular home creative practice, two self-assessment written reports, and one additional home creative project. This class is for all levels of art and yoga backgrounds: although welcome, no previous experience is necessary.",
    "prereq": []
  },
  {
    "uid": "819991",
    "code": "ARTS1203",
    "subject": "ARTS",
    "number": "1203",
    "honors": false,
    "writingIntensive": false,
    "name": "Art + The Mississippi River",
    "fullname": "Art + The Mississippi River",
    "info": "As the Mississippi River flows through campus, it shapes the site of a seventy-two-mile urban national park in the heart of Dakota homeland. Using the river as a basis for artistic inquiry, research, and collaborative practices, students engage in interdisciplinary creative explorations while learning about water ecologies and politics: mapping, book-making, digital photography, sound portraits, aerial photography, underwater photography, and performance.  The Mississippi River, increasingly identified with the University of Minnesota, sparks our collective imagination and connects us through time, water, land, and culture. In this course we will focus on learning about the Mississippi, and ourselves, by cultivating a personal relationship with the river and experimenting with art to convey this. We will examine why place-based learning, systems thinking, and engaged individual and collective creative engagement can lead to out-of-the-box learning, art-making, and innovative solutions to challenging social and ecological problems. Students are not expected to have previous art experience but will be introduced to a number of media approaches. This class provides multiple opportunities to learn about how art intersects with other disciplines, including physics, geology, history, anthropology. Our process will value multiple ways of knowing, generate varied perspectives, emphasize peer-to-peer learning, and introduce a range of creative media, materials, and technologies.  Class activities will include traveling on a river boat, launching aerial balloon cameras, visiting cultural, scientific, and historic places, and engaging in conversations with guest artists, architects, composers, scientists, and culture keepers. Many students at the University of Minnesota are looking for ways to be creative in how they connect to issues that they care about. This course introduces approaches that will assist students in learning how to initiate and create these types of art projects and practices.",
    "prereq": []
  },
  {
    "uid": "809164",
    "code": "ARTS1490",
    "subject": "ARTS",
    "number": "1490",
    "honors": false,
    "writingIntensive": false,
    "name": "Workshop in Art",
    "fullname": "Workshop in Art",
    "info": "Selected topics. Intensive studio activity.",
    "prereq": []
  },
  {
    "uid": "005245",
    "code": "ARTS1501",
    "subject": "ARTS",
    "number": "1501",
    "honors": false,
    "writingIntensive": false,
    "name": "Printmaking: Intaglio, Lithogr",
    "fullname": "Printmaking: Intaglio and Lithography",
    "info": "Introduction to techniques of intaglio etching/lithography. Historical approaches/use through contemporary materials/concepts. Emphasizes interrelationship of process, materials, and ideas/aesthetics.",
    "prereq": []
  },
  {
    "uid": "005116",
    "code": "ARTS1505",
    "subject": "ARTS",
    "number": "1505",
    "honors": false,
    "writingIntensive": false,
    "name": "Papermaking",
    "fullname": "Papermaking",
    "info": "Introduction to approaches, forms, and aesthetic possibilities of paper as an expressive medium. Studio work in both Eastern and Western traditions and sculptural applications.",
    "prereq": []
  },
  {
    "uid": "005135",
    "code": "ARTS1701",
    "subject": "ARTS",
    "number": "1701",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Photography",
    "fullname": "Introduction to Photography",
    "info": "Want to take photography to the next level beyond the phone in your pocket? Photography is a way to understand and explore the world and your own inner life. This class incorporates both digital and analog (black and white darkroom) technologies. It will emphasize a balance of technical skills, exploration of personal vision, and development of critical thinking and vocabulary relating to photography. Your own image making will be considered in the context of photographic history, visual literacy, and the universe of imagery in which we live. Half of the semester will be devoted to B&W film and darkroom, and half to digital cameras and processes. Students will learn the fundamentals of digital and film camera operation and will be introduced to digital imaging software and printing. We will cover refined digital capture, image adjustment/manipulation and inkjet printing methods. Class activities will consist of lectures and demonstrations, individual and group exercises, project assignments, lab time, field trips and student presentations. Students’ work will be constructively discussed in class and small group critique sessions.35mm film cameras will be provided. The class requires students to have their own digital camera (a limited number of cameras are available for students unable to provide their own). Students who have no prior experience with serious photography, as well as those who are already avid photographers, are both welcome. The class serves as a prerequisite for all 3000 level photography classes.",
    "prereq": {
      "code": "ALL 3000",
      "subject": "ALL",
      "id": "3000"
    }
  },
  {
    "uid": "798733",
    "code": "ARTS1703",
    "subject": "ARTS",
    "number": "1703",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Photography",
    "fullname": "Digital Photography",
    "info": "Introduction to conceptual, technical and historical aspects of photography as a creative medium using digital technology. Digital image capture, related software, digital output and studio procedures. Historical issues, contemporary practice.",
    "prereq": []
  },
  {
    "uid": "005457",
    "code": "ARTS1704",
    "subject": "ARTS",
    "number": "1704",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Moving Images",
    "fullname": "Introduction to Moving Images",
    "info": "Do you want to engage with a medium of the everyday? From watching a film to making a video of a friend or family reunion, moving images are all around. This is an introductory, hands-on studio course in digital filmmaking. Through lectures, screenings, demonstrations, hands-on practice, readings, and discussions, this course will cover practical and theoretical elements of digital filmmaking. Students will be introduced to film language, aesthetics, and technical terminology, as well as camera, lighting, sound and editing.Throughout the semester we will view and discuss films and clips from a variety of genres, including narrative, documentary, experimental, and combinations thereof. Students create several short film projects. They also develop skills in critical evaluation through critique sessions that investigate the aesthetic, technical, and cultural interpretation of moving images. As filmmakers you are free to make films in any genre in this class. Students need to provide their own portable drive and  1 - 2 SD cards for each class, and may choose to purchase their own subscription to Adobe Creative Cloud if they wish to use their own computer.This course is the prerequisite for intermediate level Department of Art courses in Moving Images including Narrative Digital Filmmaking, Experimental Film and Video, Animation, Super 8 and 16mm Filmmaking.",
    "prereq": []
  },
  {
    "uid": "005263",
    "code": "ARTS1801",
    "subject": "ARTS",
    "number": "1801",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Ceramics",
    "fullname": "Introduction to Ceramics: Wheel-Throwing and Hand-Building Techniques",
    "info": "Are you interested in working with a material and practice that dates back 20,000 plus years? The creative journey in this course includes learning about diverse global histories, people, and cultures and the dynamic realm of contemporary ceramics. This introductory ceramic course focuses on the various methods and processes of working with clay as an artistic medium. One half of the semester focuses on hand-building methods and techniques. The other half will focus on learning wheel-throwing methods and techniques. This hands-on experience with clay unifies hand, eye, and mind. You will learn foundational three-dimensional concepts, terminology, and vocabulary related to ceramics and explore the range of forms and processes to create functional and sculptural works with clay. In addition, the curriculum places importance on creating space to examine and discuss diverse historical and contemporary global perspectives related to ceramics.You will learn to make clay, load electric and gas kilns, fundamentals of glaze chemistry, and ceramic lab health and safety protocols. Your finished pieces will reflect essential skills, techniques, and knowledge of the complete ceramic production process. This course provides relevant, challenging, and rewarding projects developing creative and critical thinking skills to sustain long-term creative growth. You will be supported with meaningful direction from your instructor and constructive critique, discussion, and self-reflection with peers. At the end of this course, your knowledge and technical skills will prepare you for upper-level ceramic courses.",
    "prereq": []
  },
  {
    "uid": "005251",
    "code": "ARTS1802",
    "subject": "ARTS",
    "number": "1802",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Sculpture",
    "fullname": "Introduction to Sculpture: Understanding the Fundamentals of the Practice of Sculpture",
    "info": "This course is aimed at students who are eager to creatively take risks, experiment, play, and work in an environment of collaboration and team learning experiences. This intro level course is the foundation for sculpture. Through hands-on demonstrations of basic sculptural processes (for example: carving, modeling, assembling, and casting) you will gain experience in developing art projects from idea to realization all the way to the final surprising artwork. Throughout the semester we will be looking at contemporary and historical works of art as examples of how a broad range of diverse artists have explored the concepts and materials they use in their work and how this applies to the work you create. Critiques will be used as a tool for developing critical thinking and project development. You can expect by the end of this course to discover your individual creative processes and feel comfortable and safe working independently in a sculpture studio. You will be prepared for advanced sculpture and foundry and metal casting courses. ",
    "prereq": []
  },
  {
    "uid": "816961",
    "code": "ARTS1803",
    "subject": "ARTS",
    "number": "1803",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Sculpture & Ceramics",
    "fullname": "Introduction to Sculpture and Ceramics",
    "info": "This course introduces the fundamentals of sculpture and ceramics through a studio practice with a variety of materials, methods, and ideas. Through a studio practice, students will explore hands on experience to find a way to engage with creative production process. The finished pieces will be discussed through various points of views. The instruction in this class will be given through: 1. Demonstrations of techniques2. Slide presentations and lectures3. Individual assistance and instruction4. Individual and group critiques / discussion and evaluation",
    "prereq": []
  },
  {
    "uid": "791261",
    "code": "ARTS1902",
    "subject": "ARTS",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "804010",
    "code": "ARTS1903",
    "subject": "ARTS",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "808493",
    "code": "ARTS1904",
    "subject": "ARTS",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "788060",
    "code": "ARTS1905",
    "subject": "ARTS",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788176",
    "code": "ARTS1910W",
    "subject": "ARTS",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in class schedule.",
    "prereq": []
  },
  {
    "uid": "817031",
    "code": "ARTS1911",
    "subject": "ARTS",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "BioArt: Culturing Life",
    "fullname": "BioArt: Culturing Life",
    "info": "What do GFP Bunny (green fluorescent protein) and transgenic bacteria have to do with art? This interdisciplinary seminar explores BioArt as a contemporary art form that engages scientific and artistic processes to create artwork with biological organisms, living systems, and life processes. It questions the relationships among biological bodies, cultural bodies, technology, and bioethics. BioArt examples include Victimless Leather alive at MOMA, the DIY home kitchen Digestive Table, and the One Tree series of genetically identical trees living in San Francisco. Exploring topics from ecology to molecular biology, we will examine the dynamic process between scientist, artist, and the public, the poetic and political implications, and the ethical issues associated with the making of this art. Direct engagement with micro-organisms, reading and discussions that develop critical thinking, as well as laboratory and studio sessions will lead to individual and collaborative works of BioArt.",
    "prereq": []
  },
  {
    "uid": "817091",
    "code": "ARTS1912",
    "subject": "ARTS",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and Yoga",
    "fullname": "Art and Yoga",
    "info": "This experiential course offers a dynamic mix of art and yoga with the goal of tapping into your creativity, cultivating a strong sense of embodiment and intuitive intelligence, and developing self-awareness. Each class opens with kundalini yoga and meditation, which leads into guided creative exercises with various art materials, and ends with structured time to share. Calming the mind/body and centering into self-presence at the beginning of class lets us shift from the outer turmoil and stresses of ordinary life, awakening the natural calm and ease within. It is from this place that we explore creative expression - through drawing, painting, writing, and movement - connecting with ourselves in a deeper, freer way. Together we create a supportive community that encourages each of us to learn, explore, and grow. This class is for all levels: although welcome, no previous art or yoga experience is necessary. Most important is an open mind and a willingness to experiment with creative and somatic practices. A materials list will be sent out to students prior to first day of class.",
    "prereq": []
  },
  {
    "uid": "818887",
    "code": "ARTS1913",
    "subject": "ARTS",
    "number": "1913",
    "honors": false,
    "writingIntensive": false,
    "name": "Seeing the Mississippi",
    "fullname": "Place Matters:  Seeing the Mississippi",
    "info": "As the Mississippi River flows through campus it shapes the site of a seventy-two-mile urban national park in the heart of Dakota homeland. With the river as our catalyst for artistic inquiry, research, and collaborative practices, students will participate in interdisciplinary, creative explorations that connect culture, ecology, design, history, and imagination. We will synthesize perspectives gained from our experiences on a river boat, launching aerial cameras, taking sound walks, recording underwater views, participating in digital storytelling, and engaging in conversations with guest artists, architects, culture keepers, composers, scientists, and historians. You will meet students with a wide range of interests and backgrounds as you work on individual and collaborative projects. Together, we will focus on learning about the Mississippi, and ourselves, by cultivating a personal relationship with the river and experimenting with art to convey this. ",
    "prereq": []
  },
  {
    "uid": "825153",
    "code": "ARTS1914",
    "subject": "ARTS",
    "number": "1914",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and Language",
    "fullname": "Say Something, Make Something: Art and Language",
    "info": "Say Something, Make Something: Art and Language focuses on the ways contemporary artists use, re-use, and re-interpret language in their artworks. By utilizing the written word, artists expand their practice from traditional art materials to engage with the interdisciplinary field of language. Utilizing their interests and abilities in a variety of subjects and media, students in this course create works that are personal, engage audiences, and comment on the world around us. Classes include discussions of readings, writing warm-ups, demonstrations of technical skills, visiting artists, field trips, and more. Students will undertake a number of small writing assignments, complete three main art projects, attend art-related field trips, and participate in group discussion. Students learn and utilize a variety of art techniques in this course, including writing, photography, bookmaking, and printmaking. ",
    "prereq": []
  },
  {
    "uid": "807985",
    "code": "ARTS2101",
    "subject": "ARTS",
    "number": "2101",
    "honors": false,
    "writingIntensive": false,
    "name": "Drawing",
    "fullname": "Drawing",
    "info": "Fundamental principles/processes of drawing; various drawing media.prereq: Intended or declared art major or minor",
    "prereq": []
  },
  {
    "uid": "807986",
    "code": "ARTS2102",
    "subject": "ARTS",
    "number": "2102",
    "honors": false,
    "writingIntensive": false,
    "name": "Painting",
    "fullname": "Painting",
    "info": "Introduction to painting with attention to understanding and applying the fundamental principles of spatial organization and color interaction.prereq: 1101 or 2101, intended or declared art major",
    "prereq": {
      "or": [
        {
          "code": "ARTS 1101",
          "subject": "ARTS",
          "id": "1101"
        },
        {
          "code": "ARTS 2101",
          "subject": "ARTS",
          "id": "2101"
        }
      ]
    }
  },
  {
    "uid": "807987",
    "code": "ARTS2301",
    "subject": "ARTS",
    "number": "2301",
    "honors": false,
    "writingIntensive": false,
    "name": "Sculpture",
    "fullname": "Sculpture",
    "info": "Introduction to sculptural practice. Materials, methods, concepts, history. Emphasizes correlation between concepts and materials. Creative work in clay, plaster, metal, and wood.prereq: Intended or declared art major or minor",
    "prereq": []
  },
  {
    "uid": "807988",
    "code": "ARTS2501",
    "subject": "ARTS",
    "number": "2501",
    "honors": false,
    "writingIntensive": false,
    "name": "Printmaking",
    "fullname": "Printmaking: Intaglio and Lithography",
    "info": "Introduction to techniques of intaglio etching/lithography. Historical approaches/use through contemporary materials/concepts. Emphasizes interrelationship of process, materials, and ideas/aesthetics.prereq: Intended or declared art major or minor",
    "prereq": []
  },
  {
    "uid": "807989",
    "code": "ARTS2502",
    "subject": "ARTS",
    "number": "2502",
    "honors": false,
    "writingIntensive": false,
    "name": "Relief, Screen, Digital Print",
    "fullname": "Printmaking: Relief, Screen, Digital Processes",
    "info": "Techniques of relief (linoleum and woodcut), screenprint, and digital printmaking. Historical approaches/use through contemporary materials, concepts, and practices. Emphasizes interrelationship of process, materials, and ideas.prereq: Intended or declared art major or minor",
    "prereq": []
  },
  {
    "uid": "807990",
    "code": "ARTS2601",
    "subject": "ARTS",
    "number": "2601",
    "honors": false,
    "writingIntensive": false,
    "name": "Experimental / Media Arts",
    "fullname": "Experimental and Media Arts",
    "info": "New technologies as a source for creative art making. Basic processes in digital video, sound, animation, interactive, and networked technologies. Integration of new technologies with more traditional media arts and art disciplines, including filmmaking, sculpture, painting, printmaking, photography, and ceramic arts.prereq: Intended or declared art major or minor",
    "prereq": []
  },
  {
    "uid": "807991",
    "code": "ARTS2701",
    "subject": "ARTS",
    "number": "2701",
    "honors": false,
    "writingIntensive": false,
    "name": "Photography:Darkroom & Digital",
    "fullname": "Photography: Darkroom & Digital",
    "info": "Presents conceptual, technical, historical aspects of photography within fine arts context. Emphasis on creative process through hands-on experience in use of camera, digital, black/white, darkroom processes.prereq: Intended or declared art major or minor",
    "prereq": []
  },
  {
    "uid": "807992",
    "code": "ARTS2703",
    "subject": "ARTS",
    "number": "2703",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Photography",
    "fullname": "Digital Photography",
    "info": "Introduction to conceptual/technical/historical aspects of photography as a creative medium using digital technology. Digital image capture, related software, digital output and studio procedures. Historical issues, contemporary practice.",
    "prereq": []
  },
  {
    "uid": "807993",
    "code": "ARTS2801",
    "subject": "ARTS",
    "number": "2801",
    "honors": false,
    "writingIntensive": false,
    "name": "Ceramics",
    "fullname": "Ceramics",
    "info": "An introduction to ceramic practice. Materials, methods, concepts, and history. Correlation between concepts and materials. Creative work with clay, glaze, kilns, and related procedures.prereq: Intended or declared art major or minor",
    "prereq": []
  },
  {
    "uid": "005134",
    "code": "ARTS3110",
    "subject": "ARTS",
    "number": "3110",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Drawing",
    "fullname": "Intermediate Drawing",
    "info": "An intermediate level course that expands upon skills learned in beginning drawing. Students further develop and refine drawing techniques and concepts, as well as basic skills of drawing the human form. Specialized drawing techniques in dry and wet media will be introduced as well as contemporary, experimental, and conceptual approaches and issues. Experimentation with a variety of materials will be encouraged. Creative problem solving techniques will be discussed and applied. This rigorous course is designed to aid in the development of skills in dealing with formal issues in drawing such as line, tone, space, and composition. Students will also develop their own content, in relation to their context, and begin to develop their own artistic style or vision. Exploration of individual approaches and self-directed concepts are stressed. We will develop the verbal and analytical skills necessary to critically examine students' work. Studio work outside of scheduled class time is expected.prerequisite: ARTS 1101 or 1104",
    "prereq": {
      "or": [
        {
          "code": "ARTS 1101",
          "subject": "ARTS",
          "id": "1101"
        },
        {
          "code": "ARTS 1104",
          "subject": "ARTS",
          "id": "1104"
        }
      ]
    }
  },
  {
    "uid": "005160",
    "code": "ARTS3111",
    "subject": "ARTS",
    "number": "3111",
    "honors": false,
    "writingIntensive": false,
    "name": "Life Drawing I",
    "fullname": "Life Drawing I",
    "info": "Focus on the human form with an introduction to anatomy.  Exploration of various concepts of representation and methods of image construction. Work from life, anatomical casts, memory, and imagination.prereq: 1001, 1101 or 2101",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1101",
          "subject": "ARTS",
          "id": "1101"
        },
        {
          "code": "ARTS 2101",
          "subject": "ARTS",
          "id": "2101"
        }
      ]
    }
  },
  {
    "uid": "005161",
    "code": "ARTS3112",
    "subject": "ARTS",
    "number": "3112",
    "honors": false,
    "writingIntensive": false,
    "name": "Life Drawing II",
    "fullname": "Life Drawing II",
    "info": "The human form in pictorial structure, single, and multiple figure compositions. The creative process, work toward a personal direction. Attention to representation of the human image in cultural, historical, and contemporary context.prereq: 3111 or instr consent",
    "prereq": {
      "code": "ARTS 3111",
      "subject": "ARTS",
      "id": "3111"
    }
  },
  {
    "uid": "005118",
    "code": "ARTS3120",
    "subject": "ARTS",
    "number": "3120",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Painting",
    "fullname": "Intermediate Painting",
    "info": "This course explores traditional and contemporary concepts and techniques of painting and the development of artistic voice. This course aims to provide students with a working knowledge of techniques, materials, processes, and aesthetic sensibilities related to contemporary painting. This rigorous course is designed to aid in the development of skills in dealing with formal issues in painting such as color, space, and composition. Students will also develop their own content, in relation to their context, and begin to develop their own artistic style or vision. Exploration of individual approaches and self-directed concepts are stressed. We will develop the verbal and analytical skills necessary to critically examine students' work. Students can choose to work with acrylics and/or oils. Studio work outside of scheduled class time is expected.prerequisite: ARTS 1102",
    "prereq": {
      "code": "ARTS 1102",
      "subject": "ARTS",
      "id": "1102"
    }
  },
  {
    "uid": "798640",
    "code": "ARTS3130",
    "subject": "ARTS",
    "number": "3130",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Printmaking",
    "fullname": "Intermediate Printmaking: Traditional and Contemporary Approaches",
    "info": "The print as vehicle for conceptual/personal expression. Traditional printmaking techniques, evolving contemporary processes for realizing visual concepts. Historical/cultural development of multiple/matrix as means of communication.\n\nprereq: 1103 or 1104",
    "prereq": {
      "or": [
        {
          "code": "ARTS 1103",
          "subject": "ARTS",
          "id": "1103"
        },
        {
          "code": "ARTS 1104",
          "subject": "ARTS",
          "id": "1104"
        }
      ]
    }
  },
  {
    "uid": "816860",
    "code": "ARTS3140",
    "subject": "ARTS",
    "number": "3140",
    "honors": false,
    "writingIntensive": false,
    "name": "Figure Drawing",
    "fullname": "Figure Drawing",
    "info": "This course is designed to develop skills in drawing through observation and interpretation of the human form. Though the practice of observational drawing from a live model, students will develop visual perception skills and understanding of pictorial space including exercises in gesture, contour, outline, and tonal modeling. Some in-class work and assignments will be structured with strict limitations, including choices of media. Students will explore contemporary viewpoints and modern aspects of the figure through slide lectures, class discussions, and outside assignments.Prerequisite: 1101 or 1104",
    "prereq": {
      "or": [
        {
          "code": "ARTS 1101",
          "subject": "ARTS",
          "id": "1101"
        },
        {
          "code": "ARTS 1104",
          "subject": "ARTS",
          "id": "1104"
        }
      ]
    }
  },
  {
    "uid": "005129",
    "code": "ARTS3150",
    "subject": "ARTS",
    "number": "3150",
    "honors": false,
    "writingIntensive": false,
    "name": "Dimensional Painting",
    "fullname": "Dimensional Painting",
    "info": "This course explores the hybridization of painting, sculpture, and installation. The illusionary space and techniques of two dimensional media is combined and co-exists with three dimensional sculptural approaches. Students will discover their own solutions to painting in space. Formats for projects include wall constructions, wall paintings, object-based paintings, found objects, assemblage, reliefs, shaped paintings, floor works, and installations. The students will also explore a vast number of materials, and the technical problems and solutions that are possible. We will develop the verbal and analytical skills necessary to critically examine students' work. Historical and contemporary artists and concepts that are relevant to dimensional painting will also be introduced. Studio work outside of class is expected.Prerequisite: 1102",
    "prereq": {
      "code": "ARTS 1102",
      "subject": "ARTS",
      "id": "1102"
    }
  },
  {
    "uid": "008342",
    "code": "ARTS3160",
    "subject": "ARTS",
    "number": "3160",
    "honors": false,
    "writingIntensive": false,
    "name": "Drawing: Interpreting the Site",
    "fullname": "Drawing: Interpreting the Site",
    "info": "This art class focuses on the search for personal content as inspired by the site. Field trips will be taken weekly to diverse sites within an hour and a half of the campus. Field trips outside of the twin cities will be taken by using University of Minnesota mini-vans. Sites within the twin cities will meet at those particular environments. Sites can vary from Historical locations to railroad yards. Students will experiment with a variety of approaches of style and idea as influenced by the site and use the medium of their choice. Artwork from the sites will be completed in class and as homework. Each site will expand the scope artistic possibilities as each student attempts to personalized a new experience.prereq: 1101 or 1104",
    "prereq": {
      "or": [
        {
          "code": "ARTS 1101",
          "subject": "ARTS",
          "id": "1101"
        },
        {
          "code": "ARTS 1104",
          "subject": "ARTS",
          "id": "1104"
        }
      ]
    }
  },
  {
    "uid": "803597",
    "code": "ARTS3170",
    "subject": "ARTS",
    "number": "3170",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Digital Drawing",
    "fullname": "Intermediate Digital Drawing",
    "info": "Possibilities of digital technology as tool and component in contemporary, creative drawing practice.prereq: 1107",
    "prereq": {
      "code": "ARTS 1107",
      "subject": "ARTS",
      "id": "1107"
    }
  },
  {
    "uid": "816511",
    "code": "ARTS3180",
    "subject": "ARTS",
    "number": "3180",
    "honors": false,
    "writingIntensive": false,
    "name": "Zines, Comics, and Books",
    "fullname": "Zines, Comics, and Books",
    "info": "This class introduces students to the culture and creation of artist's books, comics, and zines. Students will generate one example of each format, while being exposed to a wide range of works and relevant processes. We will view and read examples across cultures and develop an understanding of the history and contemporary context for making artist's books.\n \nWe will look at zines that embrace punk culture, gay culture, counter culture, and feminist movements. We will read graphic novels and connect with the local comics scene. We will visit archives of artists books in the Twin Cities, starting with the impressive collection at the University of Minnesota.\n \nStudents will use the Risograph process as well as other generative techniques for self-publishing, from the copy machine to internet publishing. Students will also be introduced to binding techniques for the artists' book section of this class. Prerequisite:  Students must have taken one of the following courses:  1101,1103, OR 1107.",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1101",
          "subject": "ARTS",
          "id": "1101"
        },
        {
          "code": "ARTS 1103",
          "subject": "ARTS",
          "id": "1103"
        },
        {
          "code": "ARTS 1107",
          "subject": "ARTS",
          "id": "1107"
        }
      ]
    }
  },
  {
    "uid": "008038",
    "code": "ARTS3190",
    "subject": "ARTS",
    "number": "3190",
    "honors": false,
    "writingIntensive": false,
    "name": "Mixed Media on Paper",
    "fullname": "Mixed Media on Paper",
    "info": "Discover the artistic possibilities of wet and dry mixed media on paper, including water-based painting, wet and dry drawing, and collage. Learn strategies for image-making, techniques for pairing different media, and color theory through both representational and abstract imagery. Explore various subject matter, including images from the imagination, direct observation of the immediate environment, and reference images from a variety of sources. Projects encourage self-directed content and the development of individuals' artistic voice. Students are introduced to contemporary and historical painting, drawing, and mixed media practices as context for art-making. We will develop the verbal and analytical skills necessary to critically examine students’ work. This course provides a focus on the creative process through hands-on investigation. Class time includes student work time, introduction to projects, demonstrations, individual feedback from the instructor, and class critiques. Studio work outside of class is required. ",
    "prereq": []
  },
  {
    "uid": "816811",
    "code": "ARTS3206W",
    "subject": "ARTS",
    "number": "3206",
    "honors": false,
    "writingIntensive": true,
    "name": "Art + Ecology",
    "fullname": "Art + Ecology",
    "info": "Art + Ecology explores the history, theory, and contemporary practice of artists engaged with the ecological issues of our time. This seminar offers an introduction to the dynamic and emerging field of Environmental Art, focusing on the ways in which artists use creativity to work across disciplines to address ecological concerns. This course investigates the role contemporary artists play as catalysts in relation to a range of concerns, including environmental justice, mass extinction, climate change, and treatment of \"waste\" as well as issues of the quality of the air, water, soil, and habitat. This seminar also will introduce the notion of artists as agents of change who build communities of ecologically aware practices around interrelated environmental and social issues. Students will be encouraged to see how their creativity and imagination can contribute to finding solutions to pressing environmental problems.",
    "prereq": []
  },
  {
    "uid": "798641",
    "code": "ARTS3230",
    "subject": "ARTS",
    "number": "3230",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and Sound",
    "fullname": "Sound Art",
    "info": "This Sound Art course is designed to cultivate your curiosity about the sonic as a contemporary art modality. It provides an introduction to diverse practices, techniques, and ways of thinking about sound while encouraging you to develop and expand upon your creative work. Students produce creative projects using sound as primary material. History of experimental sound art from early 20th century to present. Critiques, readings, writing, public presentations will be included weekly.",
    "prereq": []
  },
  {
    "uid": "005458",
    "code": "ARTS3240",
    "subject": "ARTS",
    "number": "3240",
    "honors": false,
    "writingIntensive": false,
    "name": "Making Art Interactive",
    "fullname": "Making Art Interactive",
    "info": "Conceptual/aesthetic development with digital, interactive art. Experimental approaches to interactive technologies. Responsive, tangible media. Critical theory/history of new media.prereq: 1704",
    "prereq": {
      "code": "ARTS 1704",
      "subject": "ARTS",
      "id": "1704"
    }
  },
  {
    "uid": "005453",
    "code": "ARTS3250",
    "subject": "ARTS",
    "number": "3250",
    "honors": false,
    "writingIntensive": false,
    "name": "Art + Performance",
    "fullname": "Art + Performance",
    "info": "Studio practice, investigation of forms of expression involving narrative, performance, installation. Hybrid art forms introduced by Dada movement in 1920's, continued by Fluxus movement in 1950's, to contemporary performance/installation artists.",
    "prereq": []
  },
  {
    "uid": "808228",
    "code": "ARTS3300",
    "subject": "ARTS",
    "number": "3300",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Sculpture",
    "fullname": "Intermediate Sculpture",
    "info": "Studio practice. Historical/contemporary methods/concepts. Personal sculptural thinking in various media platforms. Individual/collaborative modes for contemporary sculptural practice.prereq: [1001, 1301] or [2301, 3390]",
    "prereq": {
      "or": [
        {
          "and": [
            {
              "code": "ARTS 1001",
              "subject": "ARTS",
              "id": "1001"
            },
            {
              "code": "ARTS 1301",
              "subject": "ARTS",
              "id": "1301"
            }
          ]
        },
        {
          "and": [
            {
              "code": "ARTS 2301",
              "subject": "ARTS",
              "id": "2301"
            },
            {
              "code": "ARTS 3390",
              "subject": "ARTS",
              "id": "3390"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "005248",
    "code": "ARTS3301",
    "subject": "ARTS",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Sculpture: Direct Metal",
    "fullname": "Sculpture: Direct Metal",
    "info": "Constructive approach to sculpture through welding in steel, other metals. Studio practice, investigation of historical/contemporary methods/concepts.prereq: 1001, 1301",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1301",
          "subject": "ARTS",
          "id": "1301"
        }
      ]
    }
  },
  {
    "uid": "006606",
    "code": "ARTS3302",
    "subject": "ARTS",
    "number": "3302",
    "honors": false,
    "writingIntensive": false,
    "name": "Sculpture: Spatial Problems",
    "fullname": "Sculpture: Spatial Problems",
    "info": "Focuses on sculptural practice outside traditional media/approaches. Theoretical constructions of space as primary medium of sculpture. Installation, theater, public art, architecture.prereq: 1001, 1301",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1301",
          "subject": "ARTS",
          "id": "1301"
        }
      ]
    }
  },
  {
    "uid": "005452",
    "code": "ARTS3304",
    "subject": "ARTS",
    "number": "3304",
    "honors": false,
    "writingIntensive": false,
    "name": "Sculpt: Carving & Constrution",
    "fullname": "Sculpture: Carving and Construction",
    "info": "Carving/construction using wood, other materials. Studio practice, investigation of historical/contemporary methods/concepts. Development of personal sculptural imagery.prereq: 1001, 1301",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1301",
          "subject": "ARTS",
          "id": "1301"
        }
      ]
    }
  },
  {
    "uid": "005249",
    "code": "ARTS3305",
    "subject": "ARTS",
    "number": "3305",
    "honors": false,
    "writingIntensive": false,
    "name": "Sculpture: Kinetics",
    "fullname": "Sculpture: Kinetics",
    "info": "The exploration of movement in sculpture (wind, water, electric). Studio practice and investigation of historical and contemporary methods and concepts.prereq: 1001, 1301",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1301",
          "subject": "ARTS",
          "id": "1301"
        }
      ]
    }
  },
  {
    "uid": "005542",
    "code": "ARTS3307",
    "subject": "ARTS",
    "number": "3307",
    "honors": false,
    "writingIntensive": false,
    "name": "ContempTradit Figurative Sculp",
    "fullname": "Contemporary and Traditional Approaches to Figurative Sculpture",
    "info": "Clay modeling of human figure, other forms. Mold-making, plaster casting with historical/contemporary systems. Studio practice, investigation of traditional sculptural methods/concepts.prereq: 1001, 1301",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1301",
          "subject": "ARTS",
          "id": "1301"
        }
      ]
    }
  },
  {
    "uid": "808274",
    "code": "ARTS3390",
    "subject": "ARTS",
    "number": "3390",
    "honors": false,
    "writingIntensive": false,
    "name": "Sculpture Methods and Practice",
    "fullname": "Sculpture Methods and Practice",
    "info": "Selected sculptural processes with intensive studio activity. Various methods to foster working knowledge of materials and techniques: wood construction, kinetics, sound art, figure modeling, mold making, metal construction and casting, installation/performance art.prereq: 1001 or 1301 or 2301",
    "prereq": {
      "or": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1301",
          "subject": "ARTS",
          "id": "1301"
        },
        {
          "code": "ARTS 2301",
          "subject": "ARTS",
          "id": "2301"
        }
      ]
    }
  },
  {
    "uid": "006622",
    "code": "ARTS3401W",
    "subject": "ARTS",
    "number": "3401",
    "honors": false,
    "writingIntensive": true,
    "name": "Theories Studio Perspective",
    "fullname": "Critical Theories and Their Construction From a Studio Perspective",
    "info": "How do artists read and write theory? What roles can ideas play in the creative process? This course investigates practices and theories that inform the work of contemporary artists. Through a combination of readings, lectures, asynchronous discussions, writing assignments, and experiments in practice and prose, we will explore some significant questions that lie at the crossroads of ethics and aesthetics. We will also dig into our own practices as artists, writers, and thinkers to understand more fully how ethics and aesthetics intersect in what we do. Readings include texts by visual artists and poets, articles from art journals, as well as essays by art historians and critics of visual culture. This course utilizes writing and critical thinking to deepen each student's connection to contemporary art and to reflect on their own aesthetic experiences. As a writing intensive course, ARTS3401W: Critical Theories emphasizes writing as a multi-purpose tool for making sense of—and with—art. \n\nprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "007547",
    "code": "ARTS3402",
    "subject": "ARTS",
    "number": "3402",
    "honors": false,
    "writingIntensive": false,
    "name": "Artists' Books",
    "fullname": "Artists' Books",
    "info": "Study/creation of unique, handmade books using various structures, media, techniques. Critical, historical, theoretical issues surrounding contemporary book arts.prereq: 1001, one visual art course",
    "prereq": {
      "code": "ARTS 1001",
      "subject": "ARTS",
      "id": "1001"
    }
  },
  {
    "uid": "007731",
    "code": "ARTS3403",
    "subject": "ARTS",
    "number": "3403",
    "honors": false,
    "writingIntensive": false,
    "name": "Women and Images",
    "fullname": "Women's Images and Images of Women",
    "info": "Women's place in Western art from the artist's perspective. Women as artists and the imagery they have created. Women as the object of imagery and the social and political attitudes those images convey. Survey of women artists from late-Renaissance through contemporary feminism; relevant issues.prereq: 1001 or instr consent",
    "prereq": {
      "code": "ARTS 1001",
      "subject": "ARTS",
      "id": "1001"
    }
  },
  {
    "uid": "005545",
    "code": "ARTS3404W",
    "subject": "ARTS",
    "number": "3404",
    "honors": false,
    "writingIntensive": true,
    "name": "Prof Practices in the Arts",
    "fullname": "Professional Practices in the Arts",
    "info": "Professional Practices in the Arts is a course that examines practical applications of presentation, documentation, business skills, and career planning specific to studio art. It provides a foundation of practical information to assist undergraduate and graduate studio majors in building a successful career. The course consists of lectures, discussions, readings, presentations, and demonstrations. The class will spend a significant amount of time discussing different types of art venues and the appropriate contexts for different types of work. Additionally, we will assess and interpret individual students' work as a means to generating appropriate questions and insights for artists statements. prereq: Grad student or [Art BFA student or Art Major, jr or sr]",
    "prereq": []
  },
  {
    "uid": "797352",
    "code": "ARTS3420",
    "subject": "ARTS",
    "number": "3420",
    "honors": false,
    "writingIntensive": false,
    "name": "Visiting Artists Program",
    "fullname": "Visiting Artists Program",
    "info": "Guest speakers, artist presentations. Identification of themes, correlations between ideas presented by guest artists/critics and students' own creative work.",
    "prereq": []
  },
  {
    "uid": "819050",
    "code": "ARTS3481",
    "subject": "ARTS",
    "number": "3481",
    "honors": false,
    "writingIntensive": false,
    "name": "Curatorial Practices",
    "fullname": "Curatorial Practice Field Experience",
    "info": "This course looks at current critical questions of curating and exhibition making. We explore the process of developing an exhibition, building working relationships with artists and understanding how to eﬀectively communicate ideas to turn a concept into a project. The course assumes that curating has also evolved from a practice associated with a museum art expert to something that is increasingly framed as a creative marketable skill related to cultural production.Discussions, readings, and coursework include consideration of gallery and public space and audience experience. Curatorial trends will be explored via site visits to established and alternative exhibit spaces. Students are introduced to a wide variety of artists and how their work is contextualized by the exhibition format. Site visits to exhibition spaces and conversations with professional curators reinforce the course material.Through practice and application, students examine the evolving deﬁnitions and responsibilities of a curator, and a variety of issues related to the development of a coherent and relevant exhibition. Students participate in hands-on, curatorial workshops, and curate a professional, public presentation using a nontraditional space, gallery space, digital space or other local venue.",
    "prereq": []
  },
  {
    "uid": "808000",
    "code": "ARTS3490",
    "subject": "ARTS",
    "number": "3490",
    "honors": false,
    "writingIntensive": false,
    "name": "Workshop in Art",
    "fullname": "Workshop in Art",
    "info": "Selected topics and intensive studio activity; topics vary yearly.",
    "prereq": []
  },
  {
    "uid": "005543",
    "code": "ARTS3499",
    "subject": "ARTS",
    "number": "3499",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship: Nash Gallery",
    "fullname": "Internship at Katherine E. Nash Gallery",
    "info": "Hands-on experience in day-to-day operation/mission of Department of Art's professional gallery.prereq: 1001 or ARTH 1XXX or instr consent",
    "prereq": {
      "code": "ARTS 1001",
      "subject": "ARTS",
      "id": "1001"
    }
  },
  {
    "uid": "005247",
    "code": "ARTS3501",
    "subject": "ARTS",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Printmaking: Intaglio, Screen",
    "fullname": "Printmaking: Intaglio and Screen",
    "info": "In-depth investigation of intaglio/screenprinting. Application of traditional/contemporary techniques. Emphasizes individual artistic expression. Review of historical/cultural development of the media.",
    "prereq": []
  },
  {
    "uid": "005246",
    "code": "ARTS3502",
    "subject": "ARTS",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Print: Relief, Lithography",
    "fullname": "Printmaking: Relief and Lithography",
    "info": "Expressive/formal aesthetics of woodcut relief, hand lithography. Studio practice/investigation of artistic attitudes as exemplified through historical perspectives, traditional/contemporary usages.",
    "prereq": []
  },
  {
    "uid": "005244",
    "code": "ARTS3505",
    "subject": "ARTS",
    "number": "3505",
    "honors": false,
    "writingIntensive": false,
    "name": "Papermaking as Art",
    "fullname": "Papermaking as an Art Form",
    "info": "Further exploration of Eastern, Western, and sculptural applications of papermaking as an art form. Development of visual vocabulary through experimentation and focused inquiry into historical and contemporary methods.prereq: 1001, 1505",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1505",
          "subject": "ARTS",
          "id": "1505"
        }
      ]
    }
  },
  {
    "uid": "798642",
    "code": "ARTS3606",
    "subject": "ARTS",
    "number": "3606",
    "honors": false,
    "writingIntensive": false,
    "name": "The Body Electric",
    "fullname": "The Body Electric: Sensing New Domains for Creative Expression",
    "info": "Cultural conceptions of the most personal of new media's hybrid domains of physical/virtual interplay. Readings of contemporary/historic conceptions of the body and the machine. Boundaries/membranes, response/reaction. The biological, the computational, the bionic. Aesthetic explorations with interactive, sensing, and programmable technologies.",
    "prereq": []
  },
  {
    "uid": "802171",
    "code": "ARTS3608",
    "subject": "ARTS",
    "number": "3608",
    "honors": false,
    "writingIntensive": false,
    "name": "The Documentary",
    "fullname": "The Documentary",
    "info": "Documentary digital video production. Historical/contemporary documentary film/video. Students collaboratively produce short documentary digital videos and participate in a public documentary festival screening of completed projects.",
    "prereq": []
  },
  {
    "uid": "805378",
    "code": "ARTS3609",
    "subject": "ARTS",
    "number": "3609",
    "honors": false,
    "writingIntensive": false,
    "name": "Art for People/Art on Wheels",
    "fullname": "Art for the People/Art on Wheels",
    "info": "Introduction to the Minneapolis Art on Wheels (MAW) project and participation in a student-run public art group.  Engage in creative uses of MAW's hardware and software technologies for mobile projections and current urban projection techniques that rely on bicycles. Opportunities to develop and exhibit large scale works in public spaces.prereq: 1001, 1601 or 2601",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1001",
          "subject": "ARTS",
          "id": "1001"
        },
        {
          "code": "ARTS 1601",
          "subject": "ARTS",
          "id": "1601"
        },
        {
          "code": "ARTS 2601",
          "subject": "ARTS",
          "id": "2601"
        }
      ]
    }
  },
  {
    "uid": "005136",
    "code": "ARTS3710",
    "subject": "ARTS",
    "number": "3710",
    "honors": false,
    "writingIntensive": false,
    "name": "B&W Darkroom Photography",
    "fullname": "Black and White Darkroom Photography",
    "info": "Step away from the computer and move into the darkroom. This course is designed to introduce students to intermediate and advanced techniques in black and white photography. The class covers exposure and development, printing, archival considerations, and film formats. Traditional darkroom skills will be emphasized, the history of the camera and photography, and ways conceptual and contemporary artists approach these traditional techniques today.Through lectures, demonstrations, critiques, and readings you will develop an understanding of the history of darkroom photography in a contemporary art context. Throughout the course you will explore how your own voice can find form through a photographic practice. Students should come to class with a working knowledge of the basics of analog camera operation and photographic principles. There will be a review of darkroom, covered in ARTS 1701: Introduction to Photography, especially at the beginning of the term.  The core of this class is a series of photographic assignments. Some will have a technical basis. Some will emphasize finding your personal voice and direction as a photographic artist. All work should be approached in the service of creative expression, self-reflection, and exploration. Students will leave the class with advanced darkroom skills, deeper knowledge of photographic history, and how these skills can be used and applied to support their creative work and life. Prerequisite: 1701",
    "prereq": {
      "code": "ARTS 1701",
      "subject": "ARTS",
      "id": "1701"
    }
  },
  {
    "uid": "007553",
    "code": "ARTS3720",
    "subject": "ARTS",
    "number": "3720",
    "honors": false,
    "writingIntensive": false,
    "name": "The Extended Image",
    "fullname": "The Extended Image",
    "info": "Photography is coming out of the frame, down off the walls, out into the world and into our lives. This course explores the use of photographs in expanded interdisciplinary work. We will examine its role in both the museum/gallery context as well as in utilitarian, community, and online settings. Projects may incorporate moving image, sound, text, found images, as well as traditional and digital 2D and 3D media. The class explores alternate presentation modes including installation, performance, social engagement, social media  and interactive formats.  Class activities consist of lectures and videos on historic and contemporary practice, tech and software demonstrations, student research and presentations, field trips and visiting artists. The core of the class is a series of interdisciplinary photographic projects, culminating in a final project of your choice. Students are encouraged to embrace your own passions and interests in your project work, incorporating other art media, life experiences and concerns that drive you as an artist and person.Prerequisite: 1701 or 1704",
    "prereq": {
      "or": [
        {
          "code": "ARTS 1701",
          "subject": "ARTS",
          "id": "1701"
        },
        {
          "code": "ARTS 1704",
          "subject": "ARTS",
          "id": "1704"
        }
      ]
    }
  },
  {
    "uid": "007554",
    "code": "ARTS3730",
    "subject": "ARTS",
    "number": "3730",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Digital Photography",
    "fullname": "Intermediate Digital Photography",
    "info": "In a world of images, what are ways you can use digital photography? This class explores those possibilities. You will consider your own image making in the context of contemporary art, current events, photographic history, and the universe of imagery in which we live. This class builds on 1701 Intro to Photography, approaching photography as a means of expression, investigation, critical inquiry, and interaction. The emphasis is on finding your personal voice and direction as a photographic artist. Students come to this class with a working knowledge of basic camera operation and photographic principles, from technical to aesthetic and conceptual. Students will learn and use advanced digital tools and workflow in the service of their own creative exploration. We will examine the changing role of digital image production and distribution in society. This class is organized around a series of project assignments and exercises. These prompts are opportunities to engage with both your own physical surroundings and the larger world. Smartphone cameras, social media and mass dissemination of images have changed people's everyday lives. These tools have been at the forefront during the pandemic and to highlight long-standing systems of violence. This class engages with these topics. Projects will be completed with manually controlled advanced digital cameras, cell phone cameras, found images (print, negatives and / or digital), and more.\n\nPrerequisite: ARTS 1701",
    "prereq": {
      "code": "ARTS 1701",
      "subject": "ARTS",
      "id": "1701"
    }
  },
  {
    "uid": "816922",
    "code": "ARTS3740",
    "subject": "ARTS",
    "number": "3740",
    "honors": false,
    "writingIntensive": false,
    "name": "Lighting & Constructed Image",
    "fullname": "Lighting and the Constructed Image",
    "info": "Take control of your photographs and moving images. This class is about creating photographs vs. simply taking pictures of what you observe. Students will learn to use flash and continuous light sources to shape the content and feeling of your work, to create worlds, characters, and stories. You will have access to the well-equipped lighting studio and a variety of studio and location lighting equipment for check out.\n\nSome projects will be specific to still photography, but you will have the option of working with video in others. You will learn principles of lighting that apply to all media. In addition to lighting, the use of props, sets, costumes and digital manipulation will be explored in a series of student projects.\n\nYou will learn to control and use light creatively in the studio and on location, in table-top setups, portraits and large-scale outdoor productions. The class will look at contemporary and historic artists in all genres who work with the constructed image. There will be a lot of hands-on skills taught in this class, but always in the service of exploring and expressing your personal vision.\n\nPrerequisite: ARTS 1701 Introduction to Photography",
    "prereq": {
      "code": "ARTS 1701",
      "subject": "ARTS",
      "id": "1701"
    }
  },
  {
    "uid": "017018",
    "code": "ARTS3750",
    "subject": "ARTS",
    "number": "3750",
    "honors": false,
    "writingIntensive": false,
    "name": "Narrative Digital Filmmaking",
    "fullname": "Narrative Digital Filmmaking",
    "info": "The class approaches Filmmaking as an art form and is designed to heighten students' awareness of the variety of ways narratives can be constructed and developed through moving images and sound. Students will spend the semester making an original short fictional narrative or documentary film which they shoot and edit. Through development, pre-production, production, and post-production processes, students work with original ideas and material to discover alternative ways of telling their stories. The first section of the class is dedicated to developing their ideas, studying scene design, character development, and various forms of narrative filmmaking that they will use to write a short original screenplay. The second section of the class is dedicated to pre-production and production, including planning for and shooting their screenplay and applying innovative cinematography and audio techniques to tell their stories in image and sound. The last section of the class is devoted to post-production, including editing video and audio and finishing the film. When editing, students will edit various versions of scenes to explore interesting and unplanned changes in tone and flow in their films. Finally, students will finish their films and participate in an end-of-semester public screening.Prerequisite:  1704 or instructor consent",
    "prereq": {
      "code": "ARTS 1704",
      "subject": "ARTS",
      "id": "1704"
    }
  },
  {
    "uid": "790534",
    "code": "ARTS3760",
    "subject": "ARTS",
    "number": "3760",
    "honors": false,
    "writingIntensive": false,
    "name": "Experimental Film and Video",
    "fullname": "Experimental Film and Video",
    "info": "Experimental moving image practice is increasingly prevalent within contemporary art and cinema. This class is designed to heighten your awareness and experience of the variety of ways feeling and perception can be explored through moving images and sound. We will step beyond traditional narrative structures and conventions of camera use to explore the spiritual, conceptual, and emotional potential of the medium. There will be individual and collaborative group work on elements of film production - character design, location and scene design, writing, improvisational and scripted acting and shooting, camera and sound recording tools and techniques, editing, and post-production. \n\nThe class will include screenings, readings and discussion of experimental films from the inception of the avant-garde through the most contemporary experimental work being produced today. You will explore the visual and aural experience of moving image and sound through a variety of alternative shooting, recording, editing and interdisciplinary installation and presentation options. Students begin the semester by developing a film concept and planning production. Working individually and collaboratively, you will then shoot the film and complete a preliminary edit. Through critiques and further editing and shooting, you will work, re-work, and start over with your material to discover unplanned changes in tone, flow, experience, and meaning.\n\nStudents need to provide their own portable drive and 1-2 SD cards for each class, and may choose to purchase their own subscription to Adobe Creative Cloud if they wish to use their own computer.\n\nPrerequisite: ARTS 1704",
    "prereq": {
      "code": "ARTS 1704",
      "subject": "ARTS",
      "id": "1704"
    }
  },
  {
    "uid": "790535",
    "code": "ARTS3770",
    "subject": "ARTS",
    "number": "3770",
    "honors": false,
    "writingIntensive": false,
    "name": "Animation",
    "fullname": "Animation",
    "info": "In this course, students will be introduced to a variety of techniques of digital animation. Through short exercises and longer projects, students gain experience with digital 2D animation in Photoshop and After Effects as well as 3D animation in Maya. Through practice and application, students explore the tools and methods of animation.  The course begins with focused exercises and culminates in an independent project. Classes consist of demonstrations, independent work time, historical and contemporary animation screenings, in-progress and final critiques, and self-assessments. \n\nThis course strives to further the student’s knowledge, skills, and artistic achievement in animation. This is a class for undergraduate (3770) and graduate (5770) students of varied experience and skills, and the outcomes above are evaluated on progress and participation. All students successfully completing the class will have created one, in‐depth, short animation and several short animation exercises. They will leave the class with a working knowledge of Photoshop, Maya, and other animation skills and techniques. \n\nprereq: ARTS 1704 or Instructor Consent",
    "prereq": {
      "code": "ARTS 1704",
      "subject": "ARTS",
      "id": "1704"
    }
  },
  {
    "uid": "817309",
    "code": "ARTS3780",
    "subject": "ARTS",
    "number": "3780",
    "honors": false,
    "writingIntensive": false,
    "name": "Super 8 and 16 MM Filmmaking",
    "fullname": "Super 8 and 16 MM Filmmaking",
    "info": "Feel the film whirring through the camera, get your hands wet in the darkroom, and hear the click-click of the projector. Revisit the origins of moving image and how it evolved into your mobile device and contemporary practice. This course will explore the medium of Super 8 filmmaking in the tradition of the experimental and avant ­garde. We will focus on the physicality of the film stock, the basic mechanics of the camera and projector, and how these elements translate into a visual language and aesthetic. Students will learn how to shoot, process, edit, splice, project, and transfer their own super 8 films. This course will balance the technical, conceptual, and historical aspects of small­ gauge or amateur analog filmmaking, and address what it means to work in this medium at the beginning of the 21st century. The course will include presentations, readings, and discussions on contemporary and historical artists in the medium, as well as film screenings and lectures. Classroom visits by artists and field trips will also provide an informed context for the primary course objective.\n\nprereq: ARTS 1704 or instructor consent",
    "prereq": {
      "code": "ARTS 1704",
      "subject": "ARTS",
      "id": "1704"
    }
  },
  {
    "uid": "825287",
    "code": "ARTS3790",
    "subject": "ARTS",
    "number": "3790",
    "honors": false,
    "writingIntensive": false,
    "name": "Phone It In",
    "fullname": "Phone It In: Mobile Imaging and the Connected World",
    "info": "This course embraces the phone camera as a serious photographic tool. 1.43 trillion photos were taken in 2020, 91% of them on mobile phones.  This is a hybrid art class involving both making and sharing of photographs, as well as readings, presentations, discussions, and research presentations. We will explore how mobile imaging technology and connectivity have transformed photography, as well as every other aspect of our lives- emotional, social, political, economic, and health. The role of mobile devices in social justice movements will be discussed, as well as issues of privacy, surveillance, and mental health implications. We will learn about the history, technology, and infrastructure of mobile devices and the internet. Technical and aesthetic aspects of phone photography will be addressed, including advanced camera controls, and in-phone and post image optimization and enhancement software.This online class will take place in synchronous Zoom meetings, as well as small group and individual meetings with the instructor. Content includes lectures, discussions, class visitors, and critiques of student work. You will be assigned a series of photographic projects, culminating in an extended final project reflecting your interests and passions. This is not your grandparents' photo class (although it is open to all generations).",
    "prereq": []
  },
  {
    "uid": "005552",
    "code": "ARTS3803",
    "subject": "ARTS",
    "number": "3803",
    "honors": false,
    "writingIntensive": false,
    "name": "Ceramics: Mold Making",
    "fullname": "Ceramics: Mold Making",
    "info": "Introduction to plaster mold making for ceramics. Plaster mold fabrication, ceramic production, contemporary methods/concepts. Development of personal visual expression. ",
    "prereq": []
  },
  {
    "uid": "005257",
    "code": "ARTS3804",
    "subject": "ARTS",
    "number": "3804",
    "honors": false,
    "writingIntensive": false,
    "name": "Neon",
    "fullname": "Neon",
    "info": "Introduction to neon sculpture; investigating materials, methods, concepts, history, and studio procedures. Work with glass tubing, electrical components, mixed media, and installation. ",
    "prereq": []
  },
  {
    "uid": "795696",
    "code": "ARTS3810",
    "subject": "ARTS",
    "number": "3810",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Ceramics",
    "fullname": "Intermediate Ceramics",
    "info": "Studio ceramics. Handbuilding, wheelthrowing, kiln firing, glaze formulation, contemporary issues. Development of a slide portfolio. Review for entrance into advanced ceramics.",
    "prereq": []
  },
  {
    "uid": "005264",
    "code": "ARTS3820",
    "subject": "ARTS",
    "number": "3820",
    "honors": false,
    "writingIntensive": false,
    "name": "Ceramic: Wheel Throwing",
    "fullname": "Ceramic: Wheel Throwing",
    "info": "Have you completed Introduction to Ceramics and would like to continue learning intermediate wheel throwing techniques and methods with clay? Are you interested in developing a more refined skill set to create functional ceramics? This course focuses on learning intermediate technical processes on the wheel and incorporating some hand-building strategies. This course will examine diverse historical craft traditions to contemporary conceptual trends in ceramics to inspire artistic modes of working with clay. Your instructor's class demonstrations and expertise will help you learn intermediate wheel throwing skills built on the foundational wheel throwing skills from ARTS 1801 Introduction to Ceramics. \n\nYou will focus on creating a range of functional ceramics that reflect and recognize the value of the strong history of diverse global pottery traditions, makers, and cultures. This course will emphasize the refinement of craftsmanship, creative and conceptual thinking, and the development of individual creative expression with clay. You will have the opportunity to expand your knowledge of clay and glaze chemistry, kiln firing, and surface activation. Also, we will examine a diverse spectrum of historical and contemporary ceramic artists and how their work sustains valuable traditions and aesthetics, expanding the contemporary field of ceramics.  \n\nprereq: ARTS 1801",
    "prereq": {
      "code": "ARTS 1801",
      "subject": "ARTS",
      "id": "1801"
    }
  },
  {
    "uid": "005265",
    "code": "ARTS3830",
    "subject": "ARTS",
    "number": "3830",
    "honors": false,
    "writingIntensive": false,
    "name": "Ceramic Sculpture",
    "fullname": "Ceramic Sculpture",
    "info": "Have you completed Introduction to Ceramics and would like to continue learning more and exploring hand-building techniques and methods with clay? Are you interested in learning more about clay and glaze chemistry and firing kilns? Are you interested in developing a more personal and expressive creative language with clay? This intermediate ceramic sculpture course further explores technical, historical craft traditions, and contemporary conceptual trends in ceramics. Your instructor's class demonstrations and expertise will help you learn advanced hand-building skills. You will focus on creating dynamic clay artwork ranging in forms but not limited to hand-built ceramic vessels and sculptural forms. \n\nThis course will emphasize the refinement of craftsmanship, creative and conceptual thinking, and the development of individual creative expression with clay. You will have the opportunity to expand your knowledge of clay and glaze chemistry, kiln firing, and surface activation with glazing. You will learn how ceramic sculptural artists in the past and present use clay to speak to issues centered on the environment, global issues of equality and social justice, figurative sculpture, and installation art and more.  \n\nprereq: ARTS 1801",
    "prereq": {
      "code": "ARTS 1801",
      "subject": "ARTS",
      "id": "1801"
    }
  },
  {
    "uid": "005253",
    "code": "ARTS3850",
    "subject": "ARTS",
    "number": "3850",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundry and Metal Sculpture",
    "fullname": "Foundry and Metal Sculpture",
    "info": "Are you interested in participating in a human tradition that is at least 8,000 years old? \n\nIn this course, you will collaborate with the elements: earth, water, wind, and fire to create artwork using different mold techniques for casting metal and pouring bronze and aluminum. Using studio practices, we will investigate the historical and contemporary methods and concepts of mold making and casting metal. Metal casting processes are by nature a social act. In this course, please be ready to help each other, whether by helping brainstorm ideas, helping preparing materials, cleaning areas, or giving a hand to lift something– this is all part of the making process and our shared learning experience in the foundry.  \n\nprereq: ARTS 1802",
    "prereq": {
      "code": "ARTS 1802",
      "subject": "ARTS",
      "id": "1802"
    }
  },
  {
    "uid": "816855",
    "code": "ARTS3860",
    "subject": "ARTS",
    "number": "3860",
    "honors": false,
    "writingIntensive": false,
    "name": "Sculpture and Installation",
    "fullname": "Sculpture and Installation",
    "info": "This class will examine the historical and contemporary aspects of sculpture installation art. The structure of this studio course provides space for in-depth research, idea development, individual exploration, experimentation, play and critical feedback. This course is not media specific, you will be working with materials that work with the concepts in your practice. You are encouraged to explore the use of sound, video and performance in your installations. A generous amount of studio time is allowed for studio work and personal exploration augmented by readings, field trips and visiting artist lectures. \n\n\nprereq: 1802\n",
    "prereq": {
      "code": "ARTS 1802",
      "subject": "ARTS",
      "id": "1802"
    }
  },
  {
    "uid": "816858",
    "code": "ARTS3890",
    "subject": "ARTS",
    "number": "3890",
    "honors": false,
    "writingIntensive": false,
    "name": "3D Model & Digital Fabrication",
    "fullname": "3D Modeling and Digital Fabrication",
    "info": "In this class, students will learn the basic skills of computer drafting and 3D modeling as it relates to digital fabrication and the generation of objects using the Department of Art's XYZ Lab. Instruction includes drafting in Adobe Illustrator and Rhino, modeling in Rhino and by means of digital imaging, transfer of files and object fabrication using laser cutters, a 3-axis CNC router, 3D printers, and vinyl cutter. This class is intended for art majors and non-art majors interested in building skills in prototyping, iteration and digital design and fabrication. While there is no prerequisite, basic drafting or Adobe Illustrator skills are highly encouraged.",
    "prereq": []
  },
  {
    "uid": "008881",
    "code": "ARTS3896",
    "subject": "ARTS",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship",
    "fullname": "Internship",
    "info": "Field work at local, regional, national, or international arts organization or with professional artist provides experience in activities/administration of art/art-based organizations.prereq: BFA Art major, instr consent",
    "prereq": []
  },
  {
    "uid": "006526",
    "code": "ARTS5104",
    "subject": "ARTS",
    "number": "5104",
    "honors": false,
    "writingIntensive": false,
    "name": "Nature of Abstract",
    "fullname": "The Nature of Abstraction",
    "info": "Exploration of abstraction as concept. Studio practice with attention to developing individual work. Emphasizes understanding topics relevant to abstraction. Approached from discipline of painting, open to various material sensibilities.",
    "prereq": []
  },
  {
    "uid": "007569",
    "code": "ARTS5105",
    "subject": "ARTS",
    "number": "5105",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Dimensional Painting",
    "fullname": "Advanced Dimensional Painting",
    "info": "Illusionary space applied to sculptural forms. Practical applications of spatial/painterly concepts. Emphasizes critical/visual judgment. Development of cohesive body of work reflecting interaction of two/three dimensions.prereq: 3105 or instr consent",
    "prereq": {
      "code": "ARTS 3105",
      "subject": "ARTS",
      "id": "3105"
    }
  },
  {
    "uid": "009234",
    "code": "ARTS5106",
    "subject": "ARTS",
    "number": "5106",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvDraw: Interpreting the Site",
    "fullname": "Advanced Drawing: Interpreting the Site",
    "info": "Search for personal content as inspired by site. Field trips (2/3 of course) to draw or paint from various metropolitan area locations. Interpretations enhanced by experimentation with new marks/symbols.prereq: 3106 or instr consent",
    "prereq": {
      "code": "ARTS 3106",
      "subject": "ARTS",
      "id": "3106"
    }
  },
  {
    "uid": "803598",
    "code": "ARTS5107",
    "subject": "ARTS",
    "number": "5107",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Digital Drawing",
    "fullname": "Advanced Drawing Using Digital Media",
    "info": "Advanced, individual creative work using digital technology as tool/component in contemporary drawing practice.prereq: 3107 or instr consent",
    "prereq": {
      "code": "ARTS 3107",
      "subject": "ARTS",
      "id": "3107"
    }
  },
  {
    "uid": "007169",
    "code": "ARTS5110",
    "subject": "ARTS",
    "number": "5110",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Drawing",
    "fullname": "Advanced Drawing",
    "info": "This studio course provides students the opportunity to investigate individual ideas and work on self-guided projects within a communal learning environment. Students will be encouraged to develop and execute their ideas with skill and clarity. Through a consideration of diverse materials and practices, students will develop a proficiency in the language of contemporary drawing. This rigorous course is designed to assist students in making connections between their own work and larger global themes and issues. Students will develop their own artistic style and think deeply about their own form, content, process, and context. Group and individual critiques, class discussions, field trips, reviewing the work of other artists and readings will supplement studio work. Students are expected to spend time working on their projects outside of scheduled class time.prereq: Art major and ARTS 3110",
    "prereq": {
      "code": "ARTS 3110",
      "subject": "ARTS",
      "id": "3110"
    }
  },
  {
    "uid": "006634",
    "code": "ARTS5120",
    "subject": "ARTS",
    "number": "5120",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Painting",
    "fullname": "Advanced Painting",
    "info": "This studio course provides students the opportunity to investigate individual ideas and work on self-guided projects within a communal learning environment. Students will be encouraged to develop and execute their ideas with skillfulness and clarity. Through a consideration of diverse materials and practices, students will develop a proficiency in the language of contemporary painting. This rigorous course is designed to assist students make connections between their own work and larger global themes and issues. Students will develop their own artistic style and think deeply about their own form, content, process, and context. Group and individual critiques, field trips, reviewing the work of other artists and readings will supplement studio work. Students are expected to spend time working on their paintings outside of scheduled class time.prereq: ARTS 3120 and ARTS major",
    "prereq": {
      "code": "ARTS 3120",
      "subject": "ARTS",
      "id": "3120"
    }
  },
  {
    "uid": "006568",
    "code": "ARTS5140",
    "subject": "ARTS",
    "number": "5140",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Printmaking",
    "fullname": "Advanced Printmaking",
    "info": "This course engages deeply with print media to understand the processes technically and conceptually. Students hone their skills with in-depth demonstrations that can include intaglio, lithography, monoprinting, relief, and screen printing. Contemporary visiting artists who engage with print as their primary media offer inspiration for students' development, as do visits to local collections to view and discuss prints from the past 600 years. Students develop their own voice and a community with their peers as they build skills in the printmaking studios. They explore their relationships with the media as they learn about concepts of how the multiple has functioned historically, politically and as a tool for activism. Through readings, lectures, discussions, and making, the course explores print’s contemporary iterations to combine digital and hand processes and even work across media to morph into sculptural, printstallation, or public projects.\n\nprereq: ARTS 3130",
    "prereq": {
      "code": "ARTS 3130",
      "subject": "ARTS",
      "id": "3130"
    }
  },
  {
    "uid": "798643",
    "code": "ARTS5230",
    "subject": "ARTS",
    "number": "5230",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Art + Sound",
    "fullname": "Advanced Art + Sound",
    "info": "Sound art practice/theory. Emphasizes individual creative projects using sound as primary material. History of experimental sound art from early 20th century to present. Critiques, readings, writing, public presentations.prereq: ARTS major and 3605 or 3230",
    "prereq": {
      "and": [
        {
          "code": "ARTS 3605",
          "subject": "ARTS",
          "id": "3605"
        },
        {
          "code": "ARTS 3230",
          "subject": "ARTS",
          "id": "3230"
        }
      ]
    }
  },
  {
    "uid": "005455",
    "code": "ARTS5250",
    "subject": "ARTS",
    "number": "5250",
    "honors": false,
    "writingIntensive": false,
    "name": "Art + Performance",
    "fullname": "Art + Performance",
    "info": "Studio practice in performance art and installation; investigation of historical and contemporary methods and concepts of interdisciplinary expression. Development of personal imagery.Prereq: ARTS major",
    "prereq": []
  },
  {
    "uid": "798645",
    "code": "ARTS5260",
    "subject": "ARTS",
    "number": "5260",
    "honors": false,
    "writingIntensive": false,
    "name": "Art + Interdisc. Collaboration",
    "fullname": "Art + Interdisciplinary Collaborations",
    "info": "Interdisciplinary, collaborative artist teams explore modes of creative expression at intersections of the arts. Students collaborate to co-author/produce works of art for pubic presentation. Emphazes integration of media arts with visual art, music, dance, and theater to produce interdisciplinary/collaborative art.prereq: Upper-division undergraduate or graduate student in art, creative writing, dance, music or theater.",
    "prereq": []
  },
  {
    "uid": "005456",
    "code": "ARTS5310",
    "subject": "ARTS",
    "number": "5310",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Direct Metal",
    "fullname": "Advanced Sculpture: Direct Metal",
    "info": "Direct metal sculpture in steel, other metals. Studio practice, investigation of historical/contemporary methods/concepts. Development of personal sculpture imagery.prereq: 3301 or instr consent",
    "prereq": {
      "code": "ARTS 3301",
      "subject": "ARTS",
      "id": "3301"
    }
  },
  {
    "uid": "006628",
    "code": "ARTS5320",
    "subject": "ARTS",
    "number": "5320",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Sculpture:Spatial Problems",
    "fullname": "Advanced Sculpture: Spatial Problems",
    "info": "Sculptural practice outside traditional media/approaches. Installation, theater, public art, architecture as topics for individual investigations into spatial organization.prereq: 3302 or instr consent",
    "prereq": {
      "code": "ARTS 3302",
      "subject": "ARTS",
      "id": "3302"
    }
  },
  {
    "uid": "009157",
    "code": "ARTS5340",
    "subject": "ARTS",
    "number": "5340",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Sculpt: Carving&Construct",
    "fullname": "Advanced Sculpture: Carving and Construction",
    "info": "Carving/construction using wood, other materials. Studio practice, investigation of historical/contemporary methods/concepts. Development of personal sculptural imagery.prereq: 3304",
    "prereq": {
      "code": "ARTS 3304",
      "subject": "ARTS",
      "id": "3304"
    }
  },
  {
    "uid": "005250",
    "code": "ARTS5350",
    "subject": "ARTS",
    "number": "5350",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Sculpture: Kinetics",
    "fullname": "Advanced Sculpture: Kinetics",
    "info": "Studio practice in kinetic sculpture. Historical/contemporary methods/concepts of sculpture produced by motion. Development of personal imagery.prereq: 3305 or instr consent",
    "prereq": {
      "code": "ARTS 3305",
      "subject": "ARTS",
      "id": "3305"
    }
  },
  {
    "uid": "005544",
    "code": "ARTS5370",
    "subject": "ARTS",
    "number": "5370",
    "honors": false,
    "writingIntensive": false,
    "name": "ContempTradit Figurative Sculp",
    "fullname": "Contemporary and Traditional Approaches to Figurative Sculpture",
    "info": "Clay figure modeling. Mold making using historical/contemporary systems. Casting in semi-permanent materials. Studio practice, traditional sculptural methods/concepts. Development of personal imagery.prereq: 3307 or instr consent",
    "prereq": {
      "code": "ARTS 3307",
      "subject": "ARTS",
      "id": "3307"
    }
  },
  {
    "uid": "808275",
    "code": "ARTS5390",
    "subject": "ARTS",
    "number": "5390",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Sculpture Methods and Prac",
    "fullname": "Advanced Sculpture Methods and Practice",
    "info": "Work in selected sculptural processes with intense studio activity. Development of innovative methods/techniques.prereq: 5300",
    "prereq": {
      "code": "ARTS 5300",
      "subject": "ARTS",
      "id": "5300"
    }
  },
  {
    "uid": "008529",
    "code": "ARTS5401W",
    "subject": "ARTS",
    "number": "5401",
    "honors": false,
    "writingIntensive": true,
    "name": "BFA Capstone 1: Concepts",
    "fullname": "BFA Seminar Capstone 1: Concepts and Practices in Art",
    "info": "Various ideologies, cultural strategies that influence practice/interpretation of art. Emphasizes diversity of viewpoints. Application of issues in developing final BFA exhibition.",
    "prereq": []
  },
  {
    "uid": "009227",
    "code": "ARTS5402",
    "subject": "ARTS",
    "number": "5402",
    "honors": false,
    "writingIntensive": false,
    "name": "Artists' Books",
    "fullname": "Artists' Books",
    "info": "Advanced projects in creation of unique, handmade books using various structures, media, techniques. Critical, historical, theoretical issues surrounding contemporary book arts.prereq: 3402 or instr consent",
    "prereq": {
      "code": "ARTS 3402",
      "subject": "ARTS",
      "id": "3402"
    }
  },
  {
    "uid": "008883",
    "code": "ARTS5403",
    "subject": "ARTS",
    "number": "5403",
    "honors": false,
    "writingIntensive": false,
    "name": "Women & Images",
    "fullname": "Women's Images and Images of Women",
    "info": "Women's place in Western art from the artist's perspective. Women as artists and the imagery they have created. Women as the object of imagery and the social and political attitudes those images convey. Survey of women artists from late-Renaissance through contemporary feminism; relevant issues.prereq: 1001 or instr consent",
    "prereq": {
      "code": "ARTS 1001",
      "subject": "ARTS",
      "id": "1001"
    }
  },
  {
    "uid": "013547",
    "code": "ARTS5404",
    "subject": "ARTS",
    "number": "5404",
    "honors": false,
    "writingIntensive": false,
    "name": "BA Capstone and Exhibition",
    "fullname": "BA Capstone and Exhibition",
    "info": "The BA Capstone and Exhibition will focus on building professional skills, developing a strong studio practice, and preparing for an exhibition in Regis Center Public Spaces.",
    "prereq": []
  },
  {
    "uid": "788980",
    "code": "ARTS5405",
    "subject": "ARTS",
    "number": "5405",
    "honors": false,
    "writingIntensive": false,
    "name": "Visual Narrative Structures",
    "fullname": "Visual Narrative Structures",
    "info": "Visual/verbal investigation of structures of visual narratives. Contemporary efforts to integrate cogent images in visual texts. Development of methods for personal visual communication of cultural, spiritual, aesthetic, environmental experiences. Historical/cultural focuses. Studio work.  ",
    "prereq": []
  },
  {
    "uid": "794021",
    "code": "ARTS5407",
    "subject": "ARTS",
    "number": "5407",
    "honors": false,
    "writingIntensive": false,
    "name": "BFA Capstone 2: Critique",
    "fullname": "BFA Capstone 2: Critique and Exhibition",
    "info": "This critique-based seminar will provide a structured critical forum for the discussion of your work, help you to verbally articulate and defend your work, and prepare you in the presentation of your work. This is a self-motivated and self-directed class. It is expected that you will produce a substantial amount of work to show in this course. Your work is self-directed. Artwork created from assignments (in other classes) will not be critiqued. Each artist will have two one-hour critiques of their work over the course of the semester. Critiques may include members from the arts community such as local artists, MIA, Midway Contemporary Art, Walker Art Center, The Soap Factory and Franklin Artworks. Grades are based on critique participation, attendance, and your artist presentation. This class culminates in the BFA Exhibition in the Nash Gallery. Throughout the semester, we will meet with Nash Gallery staff to develop this final show.",
    "prereq": []
  },
  {
    "uid": "008880",
    "code": "ARTS5490",
    "subject": "ARTS",
    "number": "5490",
    "honors": false,
    "writingIntensive": false,
    "name": "Workshop in Art",
    "fullname": "Workshop in Art",
    "info": "Selected topics and intensive studio activity. Topics vary yearly.",
    "prereq": []
  },
  {
    "uid": "006581",
    "code": "ARTS5520",
    "subject": "ARTS",
    "number": "5520",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Print: Relief & Lithograph",
    "fullname": "Advanced Printmaking: Relief and Lithography",
    "info": "Relief printing, lithography for creative expression. Studio practice with stone, metal, wood. Developing personal visual language/aesthetics.  Historical/contemporary awareness, evolving technologies/strategies.",
    "prereq": []
  },
  {
    "uid": "006938",
    "code": "ARTS5550",
    "subject": "ARTS",
    "number": "5550",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Papermaking",
    "fullname": "Advanced Papermaking",
    "info": "Distinct expressive qualities of handmade paper, its versatility as contemporary art form. Independent research pursued in consultation with instructor.prereq: 3505 or instr consent",
    "prereq": {
      "code": "ARTS 3505",
      "subject": "ARTS",
      "id": "3505"
    }
  },
  {
    "uid": "007175",
    "code": "ARTS5610",
    "subject": "ARTS",
    "number": "5610",
    "honors": false,
    "writingIntensive": false,
    "name": "New Media: Making Art Interact",
    "fullname": "New Media: Making Art Interactive",
    "info": "Conceptual/aesthetic development with digital, interactive art. Experimental approaches to interactive technologies. Projects with responsive/tangible media. Theory/history of new media.prereq: 3601 or instr consent",
    "prereq": {
      "code": "ARTS 3601",
      "subject": "ARTS",
      "id": "3601"
    }
  },
  {
    "uid": "798644",
    "code": "ARTS5660",
    "subject": "ARTS",
    "number": "5660",
    "honors": false,
    "writingIntensive": false,
    "name": "The Body Electric",
    "fullname": "The Body Electric: Sensing New Domains for Creative Expression",
    "info": "Cultural conceptions of new media's hybrid domains of physical/virtual interplay. Readings of contemporary/historic conceptions of body/machine. Boundaries/membranes, response/reaction. Biological, computational, bionic. Advanced projects.",
    "prereq": []
  },
  {
    "uid": "806377",
    "code": "ARTS5690",
    "subject": "ARTS",
    "number": "5690",
    "honors": false,
    "writingIntensive": false,
    "name": "Art for People, Advanced Proj",
    "fullname": "Art for the People/Art on Wheels: Advanced Projects",
    "info": "Advanced work in the Minneapolis Art on Wheels (MAW) project/participation in a student-run public art group. Use MAW's hardware/software technologies for mobile projections and current urban projection techniques that rely on bicycles. Opportunities to develop/exhibit large scale works in public spaces.prereq: ArtS 3609",
    "prereq": {
      "code": "ARTS 3609",
      "subject": "ARTS",
      "id": "3609"
    }
  },
  {
    "uid": "800393",
    "code": "ARTS5701",
    "subject": "ARTS",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Performed Photography",
    "fullname": "Performed Photography: Documentation of Artistic Acts and Social Interventions",
    "info": "Studio course. Use of image-based media to document various artistic, site-specific acts that may otherwise go unnoticed. Relationship between original event (performance, social intervention, sculptural prop, ephemeral gesture) and memory trace left in image/record.prereq: Two 3xxx [photography or video] courses",
    "prereq": []
  },
  {
    "uid": "005137",
    "code": "ARTS5710",
    "subject": "ARTS",
    "number": "5710",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Photo/Moving Image",
    "fullname": "Advanced Photography and Moving Image Projects",
    "info": "In this class, students have the opportunity to deepen and expand their creative practice, conceptual and technical skills they have developed so far in Photography and/or Moving Image. The class is structured around two individual, advanced projects of the student's choice over the course of the semester. The first body of work will be presented in an exhibition or installation. Students will learn skills in developing a project all the way through to sharing it with the public. They will develop skills in preparing and mounting an exhibition. They will have the chance to reflect on their exhibited works in order to develop their second, smaller project, which launches from, rethinks, or is an entirely different direction from the first. To this end, all types of digital, analog photographic, film and video media, and installation are welcome and any mix thereof. \n\nThe class includes studio time, image lectures, discussions, critique, selected readings, field trips, demonstrations determined by the class needs, one-to-one meetings and visiting artists. In this advanced class, students use the cameras, tools and methods necessary for their work and their ideas. \n\nprereq: previously completed a 3XXX course in Photography or Moving Images.",
    "prereq": []
  },
  {
    "uid": "817160",
    "code": "ARTS5740",
    "subject": "ARTS",
    "number": "5740",
    "honors": false,
    "writingIntensive": false,
    "name": "Lighting & Constructed Image",
    "fullname": "Lighting and the Constructed Image",
    "info": "Take charge of your photographs and moving images. This class is about making pictures vs. taking pictures. Students will learn to use flash and continuous light sources to shape the content and feeling of your work, to create worlds, characters, and stories.Some projects will be specific to still photography, but you will have the option of working with moving image in others. You will learn principles of lighting that apply to all media. In addition to lighting, the use of props, sets, costumes and digital manipulation will be explored in a series of student projects.We will learn to control and shape light in the studio and on location, in table-top setups and large-scale outdoor productions. We will look at contemporary and historic artists in all genres who are masters of the constructed image. There will be a lot of hands-on skills taught in this class, but always in the service of exploring and expressing your personal vision.prereqs: ARTS Major",
    "prereq": []
  },
  {
    "uid": "790427",
    "code": "ARTS5750",
    "subject": "ARTS",
    "number": "5750",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Narrative Digital Film",
    "fullname": "Advanced Narrative Digital Filmmaking",
    "info": "The class approaches Filmmaking as an art form and is designed to heighten students' awareness of the variety of ways narratives can be constructed and developed through moving images and sound. Students will spend the semester making an original short fictional narrative or documentary film which they shoot and edit. Through development, pre-production, production, and post-production processes, students work with original ideas and material to discover alternative ways of telling their stories. The first section of the class is dedicated to developing their ideas, studying scene design, character development, and various forms of narrative filmmaking that they will use to write a short original screenplay. The second section of the class is dedicated to pre-production and production, including planning for and shooting their screenplay and applying innovative cinematography and audio techniques to tell their stories in image and sound. The last section of the class is devoted to post-production, including editing video and audio and finishing the film. When editing, students will edit various versions of scenes to explore interesting and unplanned changes in tone and flow in their films. Finally, students will finish their films and participate in an end-of-semester public screening.Prerequisite: 3750 or Graduate Student",
    "prereq": {
      "code": "ARTS 3750",
      "subject": "ARTS",
      "id": "3750"
    }
  },
  {
    "uid": "790536",
    "code": "ARTS5760",
    "subject": "ARTS",
    "number": "5760",
    "honors": false,
    "writingIntensive": false,
    "name": "Experimental Film and Video",
    "fullname": "Experimental Film and Video",
    "info": "Experimental moving image practice is increasingly prevalent within contemporary art and cinema. This class is designed to heighten your awareness and experience of the variety of ways feeling and perception can be explored through moving images and sound. We will step beyond traditional narrative structures and conventions of camera use to explore the spiritual, conceptual, and emotional potential of the medium. There will be individual and collaborative group work on elements of film production - character design, location and scene design, writing, improvisational and scripted acting and shooting, camera and sound recording tools and techniques, editing, and post-production. \n\nThe class will include screenings, readings and discussion of experimental films from the inception of the avant-garde through the most contemporary experimental work being produced today. You will explore the visual and aural experience of moving image and sound through a variety of alternative shooting, recording, editing and interdisciplinary installation and presentation options. Students begin the semester by developing a film concept and planning production. Working individually and collaboratively, you will then shoot the film and complete a preliminary edit. Through critiques and further editing and shooting, you will work, re-work, and start over with your material to discover unplanned changes in tone, flow, experience, and meaning.\n\nStudents need to provide their own portable drive and 1-2 SD cards for each class, and may choose to purchase their own subscription to Adobe Creative Cloud if they wish to use their own computer.\n\nPrerequisite: ARTS major, ARTS 1704",
    "prereq": {
      "code": "ARTS 1704",
      "subject": "ARTS",
      "id": "1704"
    }
  },
  {
    "uid": "790542",
    "code": "ARTS5770",
    "subject": "ARTS",
    "number": "5770",
    "honors": false,
    "writingIntensive": false,
    "name": "Animation",
    "fullname": "Animation",
    "info": "In this course, students will be introduced to a variety of techniques of digital animation. Through short exercises and longer projects, students gain experience with digital 2D animation in Photoshop and After Effects as well as 3D animation in Maya. Through practice and application, students explore the tools and methods of animation.  The course begins with focused exercises and culminates in an independent project. Classes consist of demonstrations, independent work time, historical and contemporary animation screenings, in-progress and final critiques, and self-assessments. \n\nThis course strives to further the student’s knowledge, skills, and artistic achievement in animation. This is a class for undergraduate (3770) and graduate (5770) students of varied experience and skills, and the outcomes above are evaluated on progress and participation. All students successfully completing the class will have created one, in‐depth, short animation and several short animation exercises. They will leave the class with a working knowledge of Photoshop, Maya, and other animation skills and techniques. \n\nprereq: ARTS 3770 or Instructor Consent",
    "prereq": {
      "code": "ARTS 3770",
      "subject": "ARTS",
      "id": "3770"
    }
  },
  {
    "uid": "817310",
    "code": "ARTS5780",
    "subject": "ARTS",
    "number": "5780",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Super 8/16 MM Filmmaking",
    "fullname": "Advanced Super 8 and 16 MM Filmmaking",
    "info": "Feel the film whirring through the camera, get your hands wet in the darkroom, and hear the click-click of the projector. Revisit the origins of moving image and how it evolved into your mobile device and contemporary practice. This course will explore the medium of Super 8 filmmaking in the tradition of the experimental and avant ­garde. We will focus on the physicality of the film stock, the basic mechanics of the camera and projector, and how these elements translate into a visual language and aesthetic. Students will learn how to shoot, process, edit, splice, project, and transfer their own super 8 films. This course will balance the technical, conceptual, and historical aspects of small­ gauge or amateur analog filmmaking, and address what it means to work in this medium at the beginning of the 21st century. The course will include presentations, readings, and discussions on contemporary and historical artists in the medium, as well as film screenings and lectures. Classroom visits by artists and field trips will also provide an informed context for the primary course objective.\n\n\nprereq: Art major",
    "prereq": []
  },
  {
    "uid": "006945",
    "code": "ARTS5810",
    "subject": "ARTS",
    "number": "5810",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Ceramics",
    "fullname": "Advanced Ceramics",
    "info": "Are you interested in creating a compelling body of ceramic work that prepares you to embark on a solid professional path into the visual arts with an emphasis on ceramic material? Advanced Ceramics is a course that facilitates self-directed learning and project development. With your experiences in Introduction to Ceramics, and Intermediate Ceramic Sculpture and Wheel Throwing, this course will facilitate the development of independent, disciplined studio practice. Your instructor will encourage you to elevate and expand conceptual and creative ideas, methods, and modes of visual communication in the realm of ceramics. Engaging in robust studio practice, scholarly research, meaningful peer engagement, and mentorship from your instructor will support the development of independent projects. Your independent projects will culminate in a professional body of work revealing quality craftsmanship, visual unity, and compelling aesthetics to support BFA/BA exhibition/capstone goals. Overall, this course will prepare you with professional skills as a visual artist to sustain after graduation for ongoing professional studio practice, creative growth, and self-evaluation in the ceramic discipline.\n\nprereq: ARTS major and ARTS 1801, ARTS 3820 or ARTS 3830",
    "prereq": {
      "and": [
        {
          "code": "ARTS 1801",
          "subject": "ARTS",
          "id": "1801"
        },
        {
          "code": "ARTS 3820",
          "subject": "ARTS",
          "id": "3820"
        },
        {
          "code": "ARTS 3830",
          "subject": "ARTS",
          "id": "3830"
        }
      ]
    }
  },
  {
    "uid": "006946",
    "code": "ARTS5821",
    "subject": "ARTS",
    "number": "5821",
    "honors": false,
    "writingIntensive": false,
    "name": "Ceramic Materials Analysis",
    "fullname": "Ceramic Materials Analysis",
    "info": "Ceramic materials, their interrelationships. Advanced investigation of glazes, slip formulation, clay bodies in high/low temperature ranges. Individual interests related to students' aesthetic needs.prereq: 3801 or 3802 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "ARTS 3801",
          "subject": "ARTS",
          "id": "3801"
        },
        {
          "code": "ARTS 3802",
          "subject": "ARTS",
          "id": "3802"
        }
      ]
    }
  },
  {
    "uid": "009827",
    "code": "ARTS5830",
    "subject": "ARTS",
    "number": "5830",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Ceramics: Mold Makng",
    "fullname": "Advanced Ceramics: Mold Making",
    "info": "Advanced mold making for ceramics. Plaster mold fabrication, ceramic production, contemporary methods/concepts. Development of personal visual expression.",
    "prereq": []
  },
  {
    "uid": "009322",
    "code": "ARTS5840",
    "subject": "ARTS",
    "number": "5840",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Neon",
    "fullname": "Advanced Neon",
    "info": "Emphasis on the development of personal sculptural sensibility. Studio practice with neon glass tubing and electrical components. A mixed media approach is encouraged.  ",
    "prereq": []
  },
  {
    "uid": "005252",
    "code": "ARTS5850",
    "subject": "ARTS",
    "number": "5850",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Foundry & Metal Sculpture",
    "fullname": "Advanced Foundry and Metal Sculpture",
    "info": "Are you interested in participating in a human tradition that is at least 8,000 years old? \nIn this course, you will collaborate with the elements: earth, water, wind and fire to create artwork using different mold techniques for casting metal and pouring bronze and aluminum. Using studio practices, we will investigate the historical and contemporary methods and concepts of mold making and casting metal. Metal casting processes are by nature a social act. In this course, please be ready to help each other, whether by helping brainstorm ideas, helping preparing materials, cleaning areas, or giving a hand to lift something– this is all part of the making process and our shared learning experience in the foundry.  \n\nprereq: Art major",
    "prereq": []
  },
  {
    "uid": "808229",
    "code": "ARTS5860",
    "subject": "ARTS",
    "number": "5860",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Sculpture",
    "fullname": "Advanced Sculpture",
    "info": "This advanced Sculpture course is a self-motivated and self-directed studio class to help you develop and maintain a personal studio practice. The structure of this studio course provides space for in-depth research, idea development, individual exploration, experimentation, play and critical feedback.\n\nPrereq: ARTS major and ARTS 3860",
    "prereq": {
      "code": "ARTS 3860",
      "subject": "ARTS",
      "id": "3860"
    }
  },
  {
    "uid": "816859",
    "code": "ARTS5890",
    "subject": "ARTS",
    "number": "5890",
    "honors": false,
    "writingIntensive": false,
    "name": "3D Model & Digital Fabrication",
    "fullname": "3D Modeling and Digital Fabrication",
    "info": "In this class, students will learn the basic skills of computer drafting and 3D modeling as it relates to digital fabrication and the generation of objects using the Department of Art's XYZ Lab. Instruction includes drafting in Adobe Illustrator and Rhino, modeling in Rhino and by means of digital imaging, transfer of files and object fabrication using laser cutters, a 3-axis CNC router, 3D printers and vinyl cutter. This class is intended for art majors and non-art majors interested in building skills in prototyping, iteration and digital design and fabrication. While there is no prerequisite, basic drafting or Adobe Illustrator skills are highly encouraged. prereq: ARTS major",
    "prereq": []
  },
  {
    "uid": "008882",
    "code": "ARTS5990",
    "subject": "ARTS",
    "number": "5990",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study in Art",
    "info": "Independent study project designed by student in consultation with instructor.prereq: Major, completed regular course with instructor, instr consent",
    "prereq": []
  },
  {
    "uid": "008498",
    "code": "ARTS8100",
    "subject": "ARTS",
    "number": "8100",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice and Critique",
    "fullname": "Practice and Critique: Drawing and Painting",
    "info": "Creative practice/critique. Colloquium emphasizing individual goals/directions. Aesthetics, history, theory, contemporary issues in practices/criticism.prereq: Art MFA student",
    "prereq": []
  },
  {
    "uid": "006632",
    "code": "ARTS8300",
    "subject": "ARTS",
    "number": "8300",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice and Critique",
    "fullname": "Practice and Critique: Sculpture",
    "info": "Creative practice/critique. Colloquium emphasizing individual goals/directions. Aesthetics, history, theory, contemporary issues in practices/criticism.",
    "prereq": []
  },
  {
    "uid": "788080",
    "code": "ARTS8333",
    "subject": "ARTS",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "007734",
    "code": "ARTS8401",
    "subject": "ARTS",
    "number": "8401",
    "honors": false,
    "writingIntensive": false,
    "name": "Studio and Pedagogy",
    "fullname": "Studio and Pedagogy: Philosophy and Practice",
    "info": "Orientation to establishing studio practice, introduction of department and community resources, and preparation for teaching. Studio visits and critiques; development of teaching strategies.  Required of drawing and painting students.",
    "prereq": []
  },
  {
    "uid": "006629",
    "code": "ARTS8402",
    "subject": "ARTS",
    "number": "8402",
    "honors": false,
    "writingIntensive": false,
    "name": "Theory Contemp Art",
    "fullname": "Theoretical Constructions in Contemporary Art",
    "info": "Structure for examining and understanding current critical practice. Evaluation and questions about assumptions of theory in context of current artistic production.",
    "prereq": []
  },
  {
    "uid": "816364",
    "code": "ARTS8403",
    "subject": "ARTS",
    "number": "8403",
    "honors": false,
    "writingIntensive": false,
    "name": "MFA Professional Practices",
    "fullname": "MFA Professional Practices and Teaching Pedagogy",
    "info": "This course is intended to provide a context for developing a career as an artist and explore how to create a sustainable artistic practice. This course will also explore issues in contemporary arts education through multiple approaches and best practices in teaching pedagogy. A primary goal of the course is to provide the Department of Art graduate instructors with an opportunity develop teaching skills before entering the classroom, access to UMN teaching resources and important information regarding expectations of University of Minnesota instructors and courses. Through visiting artist presentations, as well as those by professionals in arts administration, non-profits, established and non-traditional galleries, curators, critics, and recent art graduates, we will also examine the rich ecology of the arts in the Twin Cities community. We will also explore how to navigate the arts terrain successfully as an artist.",
    "prereq": []
  },
  {
    "uid": "816365",
    "code": "ARTS8404",
    "subject": "ARTS",
    "number": "8404",
    "honors": false,
    "writingIntensive": false,
    "name": "MFA Thesis Research + Writing",
    "fullname": "MFA Thesis Research + Writing",
    "info": "This workshop aims to facilitate the writing process of the MFA Thesis Supporting Paper for third-year graduate students. In accordance with the MFA advisory manual, students are challenged to articulate their creative investigations and processes as well as philosophical and critical perspectives developed throughout their course of study. By the time third-year reviews take place in December, students are expected to have a full-length draft of their text (15 pages, double-spaced, 12-point type) that names relevant reference points of the work, historical and contemporary art influences, a bibliography, and completes the requirements laid out in the MFA Advising Manual.",
    "prereq": []
  },
  {
    "uid": "791613",
    "code": "ARTS8410",
    "subject": "ARTS",
    "number": "8410",
    "honors": false,
    "writingIntensive": false,
    "name": "MFA Critique Seminar",
    "fullname": "MFA Critique Seminar",
    "info": "Taken for three semesters during the first and second year of the program, the MFA Critique Seminar provides candidates with an intellectual community and critical forum in which they may test, temper, and enlarge the ideas that underlie their artistic goals. The seminar will meet weekly to critique, in rotation, the work-in-progress of all candidates. The cross-disciplinary nature of the conversation is meant to foster the widest possible dialogue among artists, encourage divergent thinking and discourage the easy acceptance of received notions. The seminar will also include, critiques, and discussions with visiting artists, curators, etc.",
    "prereq": []
  },
  {
    "uid": "797766",
    "code": "ARTS8420",
    "subject": "ARTS",
    "number": "8420",
    "honors": false,
    "writingIntensive": false,
    "name": "MFA Studio",
    "fullname": "MFA Studio",
    "info": "This graduate level directed study offers students the opportunity to work with individual faculty. Students arrange regular meetings and develop a proposal for the semester, which is approved by the instructor. Prior to registration, the student must contact the faculty member with whom they hope to work.",
    "prereq": []
  },
  {
    "uid": "816366",
    "code": "ARTS8450",
    "subject": "ARTS",
    "number": "8450",
    "honors": false,
    "writingIntensive": false,
    "name": "MFA Creative Thesis",
    "fullname": "MFA Creative Thesis",
    "info": "Research/studio work in preparation for thesis exhibition. Third year students are required to complete 18 cr. of this course in their final year. Prior to registration, the student must contact the faculty member with whom they hope to work.",
    "prereq": []
  },
  {
    "uid": "810571",
    "code": "ARTS8490",
    "subject": "ARTS",
    "number": "8490",
    "honors": false,
    "writingIntensive": false,
    "name": "Workshop in Art",
    "fullname": "Workshop in Art",
    "info": "Selected topics/intensive studio activity. Topics vary yearly.",
    "prereq": []
  },
  {
    "uid": "006939",
    "code": "ARTS8500",
    "subject": "ARTS",
    "number": "8500",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice and Critique",
    "fullname": "Practice and Critique: Printmaking",
    "info": "Creative practice/critique. Colloquium emphasizing individual goals/directions. Aesthetics, history, theory, contemporary issues in practices/criticism.",
    "prereq": []
  },
  {
    "uid": "008526",
    "code": "ARTS8600",
    "subject": "ARTS",
    "number": "8600",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice and Critique",
    "fullname": "Practice and Critique: Experimental and Media Arts",
    "info": "Creative practice/critique. Colloquium emphasizing individual goals/directions. Aesthetics, history, theory, contemporary issues in practices/criticism.",
    "prereq": []
  },
  {
    "uid": "008523",
    "code": "ARTS8700",
    "subject": "ARTS",
    "number": "8700",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice and Critique",
    "fullname": "Practice and Critique:Photography",
    "info": "Creative practice/critique. Colloquium emphasizing individual goals/directions. Aesthetics, history, theory, contemporary issues in practices/criticism.",
    "prereq": []
  },
  {
    "uid": "008524",
    "code": "ARTS8800",
    "subject": "ARTS",
    "number": "8800",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice and Critique",
    "fullname": "Practice and Critique: Ceramics",
    "info": "Creative practice/critique. Colloquium emphasizing individual goals/directions. Aesthetics, history, theory, contemporary issues in practices/criticism.",
    "prereq": []
  },
  {
    "uid": "008168",
    "code": "ARTS8990",
    "subject": "ARTS",
    "number": "8990",
    "honors": false,
    "writingIntensive": false,
    "name": "MFA Creative Thesis",
    "fullname": "MFA Creative Thesis",
    "info": "Research/studio work in preparation for thesis exhibition.",
    "prereq": []
  }
]