[
  {
    "uid": "819933",
    "code": "ASCL6001",
    "subject": "ASCL",
    "number": "6001",
    "honors": false,
    "writingIntensive": false,
    "name": "Perspectives Applied Sciences",
    "fullname": "Perspectives in Integrated Applied Sciences",
    "info": "This course serves as an introductory anchor for students in the Master of Professional Studies in Applied Sciences Leadership. This course will introduce the applied sciences leadership framework and how it relates to the disciplinary focus areas in the program. The course will improve science-based communication skills, introduce applied research techniques, and sharpen critical thinking skills through exploration of current scientific inquiry. ",
    "prereq": []
  },
  {
    "uid": "819934",
    "code": "ASCL6002",
    "subject": "ASCL",
    "number": "6002",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Sciences Capstone",
    "fullname": "Applied Sciences Leadership Capstone",
    "info": "This course serves as the capstone course for students in the Master of Professional Studies in Applied Sciences Leadership. This course will synthesize the disciplinary and applied sciences leadership coursework taken by students during their graduate career and will facilitate completion of an individualized, applied capstone project based on their applied science focus area. The course further develops scientific communication skills and sharpens critical thinking through investigating a scientific question. This culminating experience provides students with an opportunity to engage in creative problem-solving that addresses pressing real-world needs.",
    "prereq": []
  },
  {
    "uid": "825474",
    "code": "ASCL6212",
    "subject": "ASCL",
    "number": "6212",
    "honors": false,
    "writingIntensive": false,
    "name": "Food  Product Development",
    "fullname": "Regulatory Affairs for Food  Product Development and Market Entry",
    "info": "This course equips participants with the regulatory affairs knowledge and critical analysis skills necessary to navigate the regulatory environment for food product innovation, formulation, and market entry. Participants will also gain insight into the way regulation and the underlying food laws are affected by scientific developments and changing societal values and concerns.",
    "prereq": []
  },
  {
    "uid": "825475",
    "code": "ASCL6213",
    "subject": "ASCL",
    "number": "6213",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Production and Distribut",
    "fullname": "Regulatory Affairs for  Food Production and Distribution",
    "info": "This course equips participants with the regulatory affairs knowledge and critical analysis skills necessary to navigate and apply the regulatory requirements for safe food production and distribution. Participants will also gain insight into the way regulation and the underlying food laws are affected by scientific developments and changing societal values and concerns.",
    "prereq": []
  },
  {
    "uid": "825476",
    "code": "ASCL6214",
    "subject": "ASCL",
    "number": "6214",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Claims and Labeling",
    "fullname": "Regulatory Affairs for Food Claims and Labeling",
    "info": "This course equips participants with the regulatory affairs knowledge and critical analysis skills necessary to navigate the regulatory affairs for food claims and labeling. Participants will also gain insight into the way regulation and the underlying food laws are affected by scientific developments and changing societal values and concerns.",
    "prereq": []
  },
  {
    "uid": "825479",
    "code": "ASCL6215",
    "subject": "ASCL",
    "number": "6215",
    "honors": false,
    "writingIntensive": false,
    "name": "Landmark Food Cases",
    "fullname": "Landmark Food Cases Shifting Regulatory Policy",
    "info": "This course will explore landmark food events that resulted in changes in food laws, regulations, policies, and approaches. A case study approach will be used to analyze how these learnings may be applied in future food innovation, safety, and marketing programs. Course participants will use the historical cases to identify future conditions indicative of an emerging incident that may rise to the level of a landmark case.",
    "prereq": []
  },
  {
    "uid": "817849",
    "code": "ASCL6312",
    "subject": "ASCL",
    "number": "6312",
    "honors": false,
    "writingIntensive": false,
    "name": "Finance Non-financial Managers",
    "fullname": "Finance for Non-financial Managers",
    "info": "This course explores organizational finance from the lens of a non-financial manager, helping students gain an applied understanding of financial and accounting concepts and the role finance plays in the economic viability of a business. Students will learn to construct financial statements and use these tools to strategically determine the overall business financial health. Students will forecast possibilities for future growth in relation to costs associated with operational expenses and the cost of capital. Students will review basic economic frameworks and complete case studies focusing on the connection of global economic influences to company and industry financial indicators. Specific topics include financial analysis; planning, forecasting, and budgeting; cash flow, and strategic financing.",
    "prereq": []
  },
  {
    "uid": "817850",
    "code": "ASCL6313",
    "subject": "ASCL",
    "number": "6313",
    "honors": false,
    "writingIntensive": false,
    "name": "Data for Decision Making",
    "fullname": "Data for Decision Making",
    "info": "This course aims to provide knowledge and equip students with techniques to transform data into information that decision makers can use in order to make decisions. Students will learn the importance of source and quality of the data, input from and impact on stakeholders, and how social, community, and political or governmental dynamics come into play in the decision-making process. By the end of this course, students will understand and be able to apply decision-making data collection, analysis, synthesis, and presentation skills to incorporate an abundant and wide-variety of data in order to make an informed decision. This course will have didactic and application components where students will be able to apply the skills and knowledge learned.",
    "prereq": []
  },
  {
    "uid": "817851",
    "code": "ASCL6314",
    "subject": "ASCL",
    "number": "6314",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Projects and Teams",
    "fullname": "Leading Projects and Teams",
    "info": "This course provides students the background and skills needed to enhance teamwork, make informed business decisions, or resolve productivity issues effectively. This course will focus on the principles techniques, and tools used to plan, control, monitor, and review projects to meet organizational monetary and time constraints. Through case studies and practical application, students will practice project management skills along with setting team priorities, performance objectives, and the team decision making process.",
    "prereq": []
  },
  {
    "uid": "819935",
    "code": "ASCL6315",
    "subject": "ASCL",
    "number": "6315",
    "honors": false,
    "writingIntensive": false,
    "name": "Legal and Ethical Issues",
    "fullname": "Legal and Ethical Business Issues for Science Professionals",
    "info": "Legal and/or ethical non-compliance can have significant negative impacts for any company and its employees, including (i) negative impact on a company’s stock price and value, (ii) whether the desired/needed talent wants to work for a company, (iii) whether customers want to buy products or services from a company and (iv) whether suppliers want to sell products or services to a company. In this course you will (i) learn how to identify potential legal and/or ethical dilemmas before they become scandals, (ii) confirm your personal values and learn your ethical type and understand how they impact your assessment of ethical and legal dilemmas, (iii) learn how to identify the most appropriate stakeholders and their perspectives to evaluate and resolve legal and ethical dilemma,(iv) learn how to to identify conflicts of interests and other red flags, (v) learn to identify personal and general cognitive biases that impact your/others evaluation of potential legal and ethical dilemmas, (vi) develop a personalized methodology to evaluate, resolve, and accept accountability for resolving legal and/or ethical dilemmas in the real world, and (vii) learn the importance and value of crisis management and crisis communication plans when dealing with legal or ethical noncompliance. ",
    "prereq": []
  },
  {
    "uid": "820239",
    "code": "ASCL6316",
    "subject": "ASCL",
    "number": "6316",
    "honors": false,
    "writingIntensive": false,
    "name": "Transformational Leadership",
    "fullname": "Transformational Leadership in an Intercultural World",
    "info": "This course will explore and transform personal leadership styles to succeed in a dynamic cross-cultural environment. Today’s organizations are being impacted by fast tracking global trends that are shaping the very concept of leadership. Course material will review the fundamental tenets of leadership, provide nuance to self-leadership and organizational leadership, and address major global trends that require different sets of leadership skills. In addition, it will address these leadership concepts and skills within a cross-cultural context including exploration of intercultural competencies and strategies required to practice inclusive and diverse leadership.",
    "prereq": []
  },
  {
    "uid": "826723",
    "code": "ASCL6993",
    "subject": "ASCL",
    "number": "6993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study in ASCL",
    "fullname": "Directed Study in ASCL",
    "info": "Directed Study in ASCL",
    "prereq": []
  },
  {
    "uid": "826722",
    "code": "ASCL6994",
    "subject": "ASCL",
    "number": "6994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research in ASCL",
    "fullname": "Directed Research in ASCL",
    "info": "Directed Research in ASCL",
    "prereq": []
  }
]