[
  {
    "uid": "819504",
    "code": "BCLA1001",
    "subject": "BCLA",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Spanish I",
    "fullname": "Beginning Spanish I",
    "info": "This course is designed to provide students the vocabulary and grammar necessary for basic expression in Spanish using a communicative approach. In this course, students will learn to introduce themselves, talk about daily routine and plans, discuss past events, use vocabulary related to food, family, and everyday life and activities, negate, and use other expressions necessary for basic communication such as greetings, ordering at a restaurant, or asking for directions.",
    "prereq": []
  },
  {
    "uid": "819505",
    "code": "BCLA1002",
    "subject": "BCLA",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Spanish II",
    "fullname": "Beginning Spanish II",
    "info": "After completing this course, the student will understand phrases and expressions of frequent use related to areas of experience that are especially relevant to him (basic information about himself and his family, purchases, places of interest, occupations, etc.). Will be able to communicate when carrying out simple and daily tasks that do not require more than simple and direct exchanges of information on issues that are known or usual. Can describe in simple terms aspects of their past and their environment as well as issues related to their immediate needs.",
    "prereq": []
  },
  {
    "uid": "819506",
    "code": "BCLA1003",
    "subject": "BCLA",
    "number": "1003",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Spanish I",
    "fullname": "Intermediate Spanish I",
    "info": "This course  is designed to improve a student’s ability to communicate in Spanish. Building on knowledge from previous courses, this course will introduce students to grammatical topics such as the subjunctive mood, the imperative mood, the pluperfect of the indicative, and expressions regarding the passage of time. This class is based on the communicative approach and stresses the use of these grammatical structures in real and relevant communication.",
    "prereq": []
  },
  {
    "uid": "819507",
    "code": "BCLA1004",
    "subject": "BCLA",
    "number": "1004",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Spanish II",
    "fullname": "Intermediate Spanish II",
    "info": "After completing this course, the student will understand extended speech and lectures (TV, movies, newspapers,...). Will be able to communicate with a degree of fluency that will let students interact with locals with spontaneity. The information presented will be precise when talking in a field of interest and quite clear when writing or speaking in other range of subjects. ",
    "prereq": []
  },
  {
    "uid": "819384",
    "code": "BCLA1101",
    "subject": "BCLA",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819404",
    "code": "BCLA1102",
    "subject": "BCLA",
    "number": "1102",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819405",
    "code": "BCLA1103",
    "subject": "BCLA",
    "number": "1103",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819406",
    "code": "BCLA1104",
    "subject": "BCLA",
    "number": "1104",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819407",
    "code": "BCLA1105",
    "subject": "BCLA",
    "number": "1105",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "818313",
    "code": "BCLA1501",
    "subject": "BCLA",
    "number": "1501",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Photography",
    "fullname": "Introduction to Photography",
    "info": "This course is designed for beginning students in photography, and specifically presents digital camera techniques as a means of personal expression. Observing/capturing, digital process, printing and screen presentation will be addressed in relation to specific subjects, intentions and aesthetic judgements. The particular study abroad experience of each student will be one of the main focuses throughout the semester. Students are expected to bring a digital camera and a laptop with some means of editing (although computers and basic Photoshop is available in the computer lab.)",
    "prereq": []
  },
  {
    "uid": "818314",
    "code": "BCLA3001",
    "subject": "BCLA",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Nationalism",
    "fullname": "Nationalism in Comparative Perspective",
    "info": "This course studies the relationship between states and nations in both a theoretical and comparative perspective with a particular focus on the Catalan, Basque and Spanish experiences. It analyzes state building processes and the development of nationalism, as well as the social, economic and technological conditions behind its emergence, transformation and contrasting discourse. The course aims at providing a solid theoretical background on the subject of nationalism as well as introducing the students into the social and political reality that permeates in Spains daily life and shapes Spaniards political mind-frames and identities.",
    "prereq": []
  },
  {
    "uid": "818315",
    "code": "BCLA3002",
    "subject": "BCLA",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Marketing",
    "fullname": "Global Marketing",
    "info": "This course provides an exploration of basic knowledge of global marketing, focusing on the impact of environment on the strategies used by firms, and the understanding of consumer behavior management as it relates to the development and implementation of global marketing strategies. Worldwide business represents real opportunities for a firm but also creates difficulties, challenges and new ways of implementing marketing. Global marketing is a specific kind of marketing applied to inter-national firms in order to implement the same strategy within the entire market taking into account cultural, economic, social, political, etc., specificities for each area.This course will provide the basic knowledge of global marketing focusing on the impact of environment on the firm strategy, the development and implementation of a global marketing strategy and the understanding of consumer behavior management in a global strategy. Case studies applied to worldwide business contexts as well as more specific European contexts will provide concrete illustrations for the students.",
    "prereq": []
  },
  {
    "uid": "818316",
    "code": "BCLA3003",
    "subject": "BCLA",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Intercultural Management",
    "fullname": "Intercultural Management",
    "info": "This course is designed to introduce students to concepts and fundamentals of international management. The course will consider aspects of management within an international and culturally complex environment, while considering the business influences within the global workplace. Students with or without prior international management knowledge will benefit from the course. Organizational effectiveness demands that personnel do the right things efficiently. Therefore, the role of management is to strive for and maintain the goals of the organization. Being an effective manager is not just telling others what to do. It is also about effective leadership, training, and communication. Having effective managers can be a cost saving tool for all organizations of all sizes. Corporation executives, supervisors, and managers are aware of the importance of and difficulty in finding and retaining highly skilled employees (a time-consuming role of management).Today's managers need a systems-view of the organization. This course will help you think of the organization as a system rather than as a work unit where tasks are performed. Most of you will, after graduating, become supervisors and managers and be required to provide training and leadership for your personnel. In just about any organization, you will be working with people who will have a different cultural background that your own, you may be working as an expatriate in a different country or you may experience any of a number of multicultural challenges. This course will help you prepare for these eventualities.",
    "prereq": []
  },
  {
    "uid": "819764",
    "code": "BCLA3004",
    "subject": "BCLA",
    "number": "3004",
    "honors": false,
    "writingIntensive": false,
    "name": "Advertising and Society",
    "fullname": "Advertising and Society",
    "info": "This course introduces students to the linkages between advertising and society. It is premised on the belief that advertising helps shape human attitudes and behaviors, just as the latter two in turn help direct and shape advertising. However, the emphasis in this course is firmly on advertising as a shaping agent—how it influences individuals and societies, the dynamic nature of the relationship, and the impacts (both positive and negative) that advertising may have on individuals and societies. It takes a critical and dispassionate view of advertising rather than a managerial or practitioner’s view. Various criticisms of advertising are flagged, and these are used as a basis for further coverage and discussion of the criticisms and issues raised. ",
    "prereq": []
  },
  {
    "uid": "819807",
    "code": "BCLA3005",
    "subject": "BCLA",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "Analyze and Explore the City",
    "fullname": "Analyzing and Exploring the Global City",
    "info": "Cities around the world are striving to be “global,” and Barcelona, the capital of Catalunya, is one of the largest and most cosmopolitan cities in Spain. It is globally renowned for its art and architecture, possessing no fewer than nine UNESCO World Heritage sites, and has become a major destination for global tourism. This interdisciplinary course examines the emergence of this elegant, creative city as Spain’s gateway to the Mediterranean, and analyzes its history and evolution since its foundation by the Romans. Students will explore the role of population dynamics, industrial change, and globalization in shaping the city and the lives of its inhabitants, examining the ways in which the interplay of urbanism, politics, and society has addressed challenges of social, political, and technological change in the past and today. The course also traces the changing nature of Barcelona’s relationship with the rest of Spain, Europe, and the wider world. Topics will include ancient and Medieval Barcelona; nationalism and innovations in art and architecture; the role of the 1992 Olympics as a catalyst for urban regeneration; the impacts of gentrification, tourism, and the recent economic crisis on the city and its inhabitants; and future scenarios of urban change. ",
    "prereq": []
  },
  {
    "uid": "819808",
    "code": "BCLA3006",
    "subject": "BCLA",
    "number": "3006",
    "honors": false,
    "writingIntensive": false,
    "name": "Architectural History of Spain",
    "fullname": "Architectural History of Spain",
    "info": "This course will look at the history of architecture and urban design in Spain. Beginning with a brief introduction to the ancient styles (from the first civilization of the Iberian Peninsula), it will focus upon developments in architecture and urban planning in Spain from the 1st Century AD to the present. Special attention will be paid to the 19th and 20th Centuries in Barcelona, and several relevant field visits will be made.",
    "prereq": []
  },
  {
    "uid": "819562",
    "code": "BCLA3009",
    "subject": "BCLA",
    "number": "3009",
    "honors": false,
    "writingIntensive": false,
    "name": "Media and Conflict",
    "fullname": "Media and Conflict",
    "info": "The course will provide a structured approach to address different media systems. It will explore the dynamics of news, politics, conflicts and freedom of the press. Focusing on ongoing, international crises of global importance, we will examine how various international media report on topics including armed conflicts, human rights abuses. Study the dynamics governing news media environment and structures. We will try to understand why different audiences from different cultural spheres perceive the same news in sometimes a diametrically opposed way. We will examine the rich arsenal of repression tools used by  authoritarian  and  even  democratic  regimes  to  suppress  press  freedom  or  spin  news  to  their  advantage.  We will look at the ways and means by which courageous journalists try to circumvent these obstacles.",
    "prereq": []
  },
  {
    "uid": "819563",
    "code": "BCLA3011",
    "subject": "BCLA",
    "number": "3011",
    "honors": false,
    "writingIntensive": false,
    "name": "The Birth of Modern Art",
    "fullname": "The Birth of Modern Art: Matisse, Picasso, Dalí",
    "info": "The work of these three international artists with distinct cultural roots is explored on an individual basis within the wider framework of European art movements. In each case, we will study the acceptance and/or rejection of tradition, the interaction with French art and artists, and personal experience.  We will also pay attention to the role of both outside stimuli (war, relationships) and inner forces (memory, imagination). The course will include course related excursions to the Picasso Museum, the MNAC (Catalan National Museum of Art) as well as a  trip to the Dalí Theatre Museum in Figueres.",
    "prereq": []
  },
  {
    "uid": "819707",
    "code": "BCLA3013W",
    "subject": "BCLA",
    "number": "3013",
    "honors": false,
    "writingIntensive": true,
    "name": "Writing the City",
    "fullname": "Writing the City",
    "info": "The course explores the craft of creative writing in relation to the city and investigates the particular challenges of writing about place. Students will examine different aspects of the city in relation to Barcelona narratives, including the old city, travel, urban spaces, solitude, politics, ethnicity, particular boroughs, and characters (both fictional and real), as well as making use of practical exercises and fieldwork.",
    "prereq": []
  },
  {
    "uid": "819564",
    "code": "BCLA3014",
    "subject": "BCLA",
    "number": "3014",
    "honors": false,
    "writingIntensive": false,
    "name": "Spain Through Its Movies",
    "fullname": "Spain As Seen Through Its Movies: 1980s to Today",
    "info": "The main goal of this course is to provide students with a general understanding of Spain, taking into consideration its recent past, but focusing mainly on some of the most relevant and controversial issues of the current situation. The use of movies as a vehicular tool allows not only for the introduction of the cultural factor, but also the very Spanish perspective(s) that helps explain how the country sees and understands itself.The course will address the following general questions: a) what it means to speak of a \"national cinema;\" b) how cinema constructs and/or contests of his or her story; c) cinema's impact on shifting notions of what constitutes the human condition; d) how the formal qualities of cinematic narrative shape on-screen stories; e) where and how issues of gender, sexuality, class, and ethnicity surface in cinematic articulations of the relationship between national identity, global trends, and personal history.There are five sections or blocks to this course. The first block will cover the Spanish Civil War and the subsequent dictatorship, indispensable to understand the last 40 years of democracy in Spain. The second block is almost a monography to the figure of Pedro Almodóvar, his time, and the ‘España’ his movies depict. The third focuses on the genre of horror, very rich in the recent Spanish production and quite ‘imitated’ by Hollywood. These last two blocks serve as a good opportunity to reflect about the political/national/identity aspects of the cinema industry.In an attempt to reverse the perspective, the last two blocks approach current Spanish issues with an important impact in the society as a whole and its citizens as individuals. The fourth block discusses Spanish politics and its most recent developments. And the fifth one is a gender approach to the demographics of the country.",
    "prereq": []
  },
  {
    "uid": "819845",
    "code": "BCLA3015",
    "subject": "BCLA",
    "number": "3015",
    "honors": false,
    "writingIntensive": false,
    "name": "Capturing Barcelona in Photog.",
    "fullname": "Capturing Barcelona through Photography",
    "info": "This course will explore digital photography as a tool to view different aspects of Spanish society (and ourselves within that society) through various photographic exercises and assignments. Students will receive the tools to read photography and construct an idea through images. At the end of the course the students will produce a portfolio of the work done. Lectures will cover the History of Photography, with a special attention to photo-reportage, Italian photographers, technical aspects related to photography production. The course introduces technical process of digital photography, from camera operation and the essential techniques of image capture with camera, image management with imaging related software. Classroom discussions and assigned readings will help student develop the critical skills used to understand how photographs function aesthetically and conceptually as how they are used in contemporary society and culture. ",
    "prereq": []
  },
  {
    "uid": "825323",
    "code": "BCLA3016",
    "subject": "BCLA",
    "number": "3016",
    "honors": false,
    "writingIntensive": false,
    "name": "Intercultural Communication",
    "fullname": "Intercultural Communication",
    "info": "This course allows students experiencing the challenges of cross-cultural communication in aninternational setting to explore intercultural communication theory and research within both broad and interpersonal contexts. Topics include similarities and differences in values, norms, interethnic/intergroup communication, and adaptation. Students will bring these theories to bear on their experiences in the field. The study of intercultural communication is often approached from a social psychological perspective. Although that perspective has yielded many important ideas about intercultural communication, other perspectives may also contribute to our understanding of the subject, particularly in acknowledging the influence of context and power in intercultural interactions.",
    "prereq": []
  },
  {
    "uid": "825324",
    "code": "BCLA3017",
    "subject": "BCLA",
    "number": "3017",
    "honors": false,
    "writingIntensive": false,
    "name": "The Business of Social Media",
    "fullname": "The Business of Social Media",
    "info": "Currently the way in which people interact is changing. We live in a new digital and technological era, and an important actor in this change, without a doubt, is social networks. Social networks represent today a real revolution in the way we communicate. According to The Global State of Digital in 2019, prepared by HootSuite and We Are Social, it is estimated that 3,484 million people already use social networks regularly, 45 percent of the world’s population. This data reveals the importance that these platforms already have in our lives. In different recent events, such as the so-called Arab Spring or the 2020 elections to the US presidency, the importance of social networks and how they can shape people’s opinions was verified. If thanks to Facebook we can influence who will be the next president of a country or incite or promote a social revolution, how will it not be decisive to position a brand, sell a product, improve the image of a company, or launch a new service?Companies are increasingly aware of this new reality and invest more and more money in advertising on networks with different objectives: to position their brand, increase the reputation of their company, increase their sales, communicate their innovations or launch a new product. In short, in maintaining close contact with their target audience through networks. In this course, students will learn how companies use social networks as marketing and communication tools. In this course, students will appreciate the strategic importance of social networks within an organization and will also be exposed to different examples from companies adopting social media through the analysis of case studies. Additionally, students will be able to perceive and understand the possible risks that a company may face if it does not know how to manage its use, and the importance of identifying and managing the so-called “fake news” in the communication policy (and trust) of a company.",
    "prereq": []
  },
  {
    "uid": "819565",
    "code": "BCLA3048",
    "subject": "BCLA",
    "number": "3048",
    "honors": false,
    "writingIntensive": false,
    "name": "Transport & Logistics Mgmt",
    "fullname": "Transportation and Logistics Management",
    "info": "In today’s global supply chains, manufactured products often travel across multiple countries and multiple states, using multiple modes of transportation, before reaching final customers. Along the way, these products are processed at a variety of inventory transfer points, and reconfigured and combined with other products with the goal of arriving intact at the right place and right time. Effectively managing these flows requires understanding the underlying economics of weight, volume, distance, and velocity. It requires taking an end-to-end view of the logistics and transportation network to understand how changes in one link impact others. It also requires openness to change, including adopting new network designs and other innovations that promise to improve processes in fundamental ways.  This course uses a combination of lectures, case discussions, interactive classroom activities, and guest speakers. Students are expected to have read any assigned readings and cases before the corresponding class session so they are prepared to actively take part in class discussion. ",
    "prereq": []
  },
  {
    "uid": "819408",
    "code": "BCLA3101",
    "subject": "BCLA",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819409",
    "code": "BCLA3102",
    "subject": "BCLA",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819410",
    "code": "BCLA3103",
    "subject": "BCLA",
    "number": "3103",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819411",
    "code": "BCLA3104",
    "subject": "BCLA",
    "number": "3104",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819412",
    "code": "BCLA3105",
    "subject": "BCLA",
    "number": "3105",
    "honors": false,
    "writingIntensive": false,
    "name": "Pompeu Fabra University Course",
    "fullname": "Pompeu Fabra University Course",
    "info": "This is a course shell that will be used on the Study & Intern in Barcelona study abroad program to represent a course taken at Pompeu Fabra University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819936",
    "code": "BCLA3375",
    "subject": "BCLA",
    "number": "3375",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Internship: Barcelona",
    "fullname": "Global Internship: Barcelona",
    "info": "The Global Internship Course (GIC) provides a unique and innovative opportunity for students to engage in an internship (and living abroad experience) while supported by academic in-class and online educational sessions to further develop their personal and professional skills while earning academic credit. GIC students also partake in out-of-class guided and self-guided activities and excursions that have been devised to enable them to become more comfortable with, and knowledgeable of, their internship locations/neighborhoods. Furthermore, a day-long field trip illustrates how socio-political and economic factors, such as the effects of housing costs in global cities, necessitate commuting and changing work practices, such as flexible working hours and working remotely that embody best practice in well-being. Field excursions vary depending on location and may also include a focus on, for example, corporate social responsibility and sustainability.The GIC fits in with CAPA's philosophy and practice of enabling students to learn about the social and cultural context of their internship placement and the host region and country, as well as other GIC themes, through comparative global analysis. At times, this analysis will be facilitated through a small selection of CAPA Masterclasses given by leading professionals from a diverse range of fields. The in-class active learning approach gives students the opportunity to discuss and analyze theories and models of work, organizational behavior, and management in a cross-cultural context.",
    "prereq": []
  },
  {
    "uid": "819546",
    "code": "BCLA4061",
    "subject": "BCLA",
    "number": "4061",
    "honors": false,
    "writingIntensive": false,
    "name": "Market and Distrib Channels",
    "fullname": "Marketing and Distribution Channels",
    "info": "Marketing channels are sets of interdependent organizations involved in the process of making a product or service available for use or consumption. Marketing and distribution channels management is an essential aspect of commercial activities. In today’s ever-more complex and challenging competitive scenario, it is necessary for organizations to know how to effectively select and manage marketing channels so that they can create partnerships that are capable of generating value and trust and avoiding conflicts.  As Peter Drucker has said, “The greatest change will be in distribution channels, not in new methods of production or consumption.” Choosing the right channels, convincing them to carry your merchandise, and getting them to work as partners is a major challenge. Too many companies see themselves as selling to distributors instead of selling through them.  This course will help students learn how to develop marketing channel plans, which enable an organization to increase sales, margins, and levels of collaboration with channel partners. ",
    "prereq": []
  },
  {
    "uid": "820129",
    "code": "BCLA4622W",
    "subject": "BCLA",
    "number": "4622",
    "honors": false,
    "writingIntensive": true,
    "name": "International Finance",
    "fullname": "International Finance",
    "info": "The International Finance module provides an understanding of finance in the international context. In a globally integrated world, it has become imperative to trade, invest, and conduct business operations internationally. This course exposes students to the opportunities and risks associated with international finance. As the world has become more integrated due to deregulation of financial markets, product innovation, and technology, capital markets have kept pace with this integration. Building upon the understanding of theoretical concepts of finance and their adaptation to the international context, the study of international finance has become essential. The course coverage includes historical perspectives and foundations of international finance, the foreign exchange markets and exchange rate determination, exposure management, and financial management of the multinational firm. The course also helps students examine the current economic landscape through discussions of current economic and political development and their impact on international finance.",
    "prereq": []
  }
]