[
  {
    "uid": "798171",
    "code": "BTHX5000",
    "subject": "BTHX",
    "number": "5000",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Bioethics",
    "fullname": "Topics in Bioethics",
    "info": "Two related movements have emerged in American health care. The first is an emphasis on medical enhancement, or the use of medical technologies to improve the looks, performance, and psychological well-being of people who are healthy. The second is the submission of the American health care system to the machinery of consumer capitalism. This seminar will use an interdisciplinary set of texts to explore the implications of medical consumerism. How is the consumerist model of medicine shaping our concepts of disease and disability? What larger historical developments have led to our current situation? How are the tools of medical enhancement shaping the way we think about our identities and the way we live our lives?  Teaching modality:  In-Person Classes.",
    "prereq": []
  },
  {
    "uid": "799556",
    "code": "BTHX5010",
    "subject": "BTHX",
    "number": "5010",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioethics Proseminar",
    "fullname": "Bioethics Proseminar",
    "info": "Introduction to topics in bioethics.prereq: Bioethics grad student or grad minor",
    "prereq": []
  },
  {
    "uid": "798172",
    "code": "BTHX5100",
    "subject": "BTHX",
    "number": "5100",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Clinical Ethics",
    "fullname": "Introduction to Clinical Ethics",
    "info": "Healthcare is full of gray areas, high stakes situations, and tensions between personal and professional values.  This course explores the moral nature of the healthcare professions and common values-based conflicts in clinical practice.  By examining everyday cases, exploring current issues in healthcare, and developing habits of reflective practice, learners will have the opportunity to recognize and respond to moral uncertainties that arise in the interprofessional clinical environment.  The course presents practical knowledge and skills needed for ethics deliberation and decision making.  This is a blended instruction course where students can expect a majority of sessions held in-person and occasional online sessions.",
    "prereq": []
  },
  {
    "uid": "812993",
    "code": "BTHX5110",
    "subject": "BTHX",
    "number": "5110",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethical Issues in Pediatrics",
    "fullname": "Ethical Issues in Pediatrics",
    "info": "Using real pediatric cases, we will examine some of the most pressing ethical issues faced by clinical teams, patients and families, and ethics consultants. Topics include decision-making for children at the end-of-life, care of extremely premature infants, conceptions of disability, adolescents’ independence from their guardians in decision-making and confidentiality protections, research conducted with children, Child Protective Services in the lives of children & families, and prioritizing children for scarce resources in public health emergencies. Through robust classroom discussions, we will consider these complex issues from a diversity of perspectives. This course is intended for professional and academic disciplines working with children such as medicine, nursing, psychology, social work, law, public health, and education, as well as child development, anthropology, and philosophy.",
    "prereq": []
  },
  {
    "uid": "812994",
    "code": "BTHX5120",
    "subject": "BTHX",
    "number": "5120",
    "honors": false,
    "writingIntensive": false,
    "name": "Dying in Contemp Med Culture",
    "fullname": "Dying in Contemporary Medical Culture",
    "info": "Examines practices of dying and death in contemporary U.S. culture, moral problems associated with these practices, possible solutions, and practical applications. Readings will consist of cultural critiques, bioethics literature, and empirical research. ",
    "prereq": []
  },
  {
    "uid": "798717",
    "code": "BTHX5210",
    "subject": "BTHX",
    "number": "5210",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Subject s Research",
    "fullname": "Ethics of Human Subjects Research",
    "info": "Issues in ethics of human subjects research.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "815962",
    "code": "BTHX5220",
    "subject": "BTHX",
    "number": "5220",
    "honors": false,
    "writingIntensive": false,
    "name": "Stds for Research with Humans",
    "fullname": "Standards for Research with Human Participants: A Lecture Series for Researchers",
    "info": "This series of lectures presents various legal and regulatory standards that apply to research using human participants. Some are of general interest (e.g., Informed Consent); others will interest more specialized researchers (e.g., International Research).",
    "prereq": []
  },
  {
    "uid": "799557",
    "code": "BTHX5300",
    "subject": "BTHX",
    "number": "5300",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Bioethics",
    "fullname": "Foundations of Bioethics",
    "info": "Overview of major contemporary frameworks used to approach ethical issues in bioethics.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "798718",
    "code": "BTHX5325",
    "subject": "BTHX",
    "number": "5325",
    "honors": false,
    "writingIntensive": false,
    "name": "Biomedical Ethics",
    "fullname": "Biomedical Ethics",
    "info": "This online course examines contemporary issues in bioethics, focusing on practical issues that arise in clinical care, public health, and health policy settings. The course also introduces conceptual frameworks and methods to analyze these issues, though the emphasis will be on challenges faced by patients and their loved ones, health professionals, and policy makers, not on ethical theory. To fully understand and evaluate these complex issues, it is critical that we consider them from a diversity of perspectives. Hence, we will spend most of our time in class discussion, openly and respectfully listening to and engaging with each other in interdisciplinary/interprofessional conversation. Class meetings will be fully online via Zoom; no in-person meetings will be required. This course has been approved for Interprofessional Education (IPE) credit for health professions students.prereq: Jr or sr or grad student or instr consent.",
    "prereq": []
  },
  {
    "uid": "799939",
    "code": "BTHX5400",
    "subject": "BTHX",
    "number": "5400",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Ethics  in Hlth Policy",
    "fullname": "Intro Ethics in Hlth Policy",
    "info": "Topics vary to reflect issues of current significance.  Relates to law/politics as appropriate but focuses on moral analyses of policy issues.\n\nprereq: Grad student or professional student or instr consent",
    "prereq": []
  },
  {
    "uid": "804667",
    "code": "BTHX5411",
    "subject": "BTHX",
    "number": "5411",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Law & Policy",
    "fullname": "Health Law and Policy",
    "info": "Organization of health care delivery. Physician-patient relationship. informed consent. Quality control. Responses to harm and error, including through medical malpractice litigation. Access. Proposals for reform.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "800117",
    "code": "BTHX5453",
    "subject": "BTHX",
    "number": "5453",
    "honors": false,
    "writingIntensive": false,
    "name": "Law, Biomedicine & Bioethics",
    "fullname": "Law, Biomedicine, and Bioethics",
    "info": "Law/bioethics as means of controlling important biomedical developments. Relationship of law and bioethics. Role of law/bioethics in governing biomedical research, reproductive decisionmaking, assisted reproduction, genetic testing/screening, genetic manipulation, and cloning. Definition of death. Use of life-sustaining treatment. Organ transplantation.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "816628",
    "code": "BTHX5510",
    "subject": "BTHX",
    "number": "5510",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender and Politics of Health",
    "fullname": "Gender and the Politics of Health",
    "info": "Significance of gender to health and health care. Feminist analysis regarding moral/political importance of gender, possibly including contemporary western medicine?s understanding of the body, childbirth, and reproductive technologies; cosmetic surgery; chronic illness; disability; participation in research; gender and classification of disease. Care work, paid/non-paid. Readings from feminist theory, history, social science, bioethics, and moral philosophy.",
    "prereq": []
  },
  {
    "uid": "815963",
    "code": "BTHX5520",
    "subject": "BTHX",
    "number": "5520",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Justice and Bioethics",
    "fullname": "Social Justice and Bioethics",
    "info": "This course explores matters of social justice related to health. Readings from multiple disciplinary perspectives ground examination of how to understand social justice in this context. Class sessions will predominantly focus on specific practical issues such as health disparities, the politics of inclusion and exclusion in clinical research, resource allocation in resource poor settings, and health professional roles during war. Discussions incorporate consideration of these issues institutional and broader social contexts. This course is appropriate for a wide audience including students from the health professions, philosophy, social science, and law.",
    "prereq": []
  },
  {
    "uid": "815964",
    "code": "BTHX5530",
    "subject": "BTHX",
    "number": "5530",
    "honors": false,
    "writingIntensive": false,
    "name": "Journalism in Bioethics",
    "fullname": "Investigative Journalism and Bioethics",
    "info": "This seminar will explore the links between bioethics and journalism, examining classic and contemporary works of investigative health journalism, works of literary non-fiction related to medicine and health, and investigative work by bioethicists. It will also examine the art of muckraking, non-profit investigative journalism, the public relations industry, the decline of print journalism and the rise of digital media, and how these developments are shaping the relationship between bioethicists and the press.",
    "prereq": []
  },
  {
    "uid": "816509",
    "code": "BTHX5540",
    "subject": "BTHX",
    "number": "5540",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioethics, Psychiatry & Psych",
    "fullname": "Bioethics, Psychiatry & Psychology",
    "info": "Explore philosophical and ethical issues in psychiatry and psychology. Potential topics include the moral responsibility of psychopaths for their actions, false memories of Satanic ritual abuse, insanity pleas, the sociology of institutionalization, clinical trials of psychiatric drugs, cosmetic psychopharmacology, recent work in experimental philosophy, and classic experiments in social psychology.",
    "prereq": []
  },
  {
    "uid": "799558",
    "code": "BTHX5610",
    "subject": "BTHX",
    "number": "5610",
    "honors": false,
    "writingIntensive": false,
    "name": "Research & Publication Seminar",
    "fullname": "Research & Publication Seminar",
    "info": "Publication strategy/venues. Authorship issues/ethics in publication. Manuscript formatting/letters of submission. Peer review.prereq: [Junior or senior or grad student], bioethics grad majors must register A-F",
    "prereq": []
  },
  {
    "uid": "799932",
    "code": "BTHX5620",
    "subject": "BTHX",
    "number": "5620",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Context of Health",
    "fullname": "Social Context of Health and Illness",
    "info": "Social context in which contemporary meanings of health and illness are understood by providers/patients. Ethical implications. Readings from history, social science, literature, and first-person accounts.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "816672",
    "code": "BTHX5630",
    "subject": "BTHX",
    "number": "5630",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioethics Colloquium",
    "fullname": "Bioethics Colloqium",
    "info": "This course features presentations from a variety of departments and programs across campus that deal in some way with ethics as a theoretical and/or applied concept. Students will attend these presentations; engage with scholars thinking about ethics from multiple perspectives; and be able to bring these perspectives to bear upon their own research. The course is thus an opportunity to explore ethics as it might be conceptualized or practiced in the social sciences, law, public policy, global health, and many other arenas, and in turn to think about how these disparate frameworks and practices can be usefully put into conversation with bioethics, and with their own projects.",
    "prereq": []
  },
  {
    "uid": "816487",
    "code": "BTHX5650",
    "subject": "BTHX",
    "number": "5650",
    "honors": false,
    "writingIntensive": false,
    "name": "Disability Ethics",
    "fullname": "Disability Ethics",
    "info": "This course is an examination of ethical issues pertaining to disability, with an emphasis on discussion and consideration of widely contrasting perspectives. Issues discussed include physician-assisted suicide, euthanasia, selective abortion, cochlear implant technology, sterilization, special versus inclusive education, Universal Design/Universal Instructional Design, disability accommodations, and built and social environments, examined within social, legal, policy, and cultural environments. Assignments include, readings, viewings, journaling, field projects, and research papers.",
    "prereq": []
  },
  {
    "uid": "815965",
    "code": "BTHX5710",
    "subject": "BTHX",
    "number": "5710",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethical Issues in Global Hlth",
    "fullname": "Ethical Issues in Global Health",
    "info": "This course examines ethical issues related to global health. Topics may include religion, morality, public policy, and the connection between health and human rights. Open to juniors, seniors, graduate and professional students. ",
    "prereq": []
  },
  {
    "uid": "817572",
    "code": "BTHX5800",
    "subject": "BTHX",
    "number": "5800",
    "honors": false,
    "writingIntensive": false,
    "name": "Animal Ethics",
    "fullname": "Animal Ethics",
    "info": "Human relationships with animals are changing and this course offers a venue for exploring some of the ethical issues in these evolving relationships. The course will discuss the differences between animal ethics and animal welfare and examine the morality and ethics of human-animal interactions in various contexts. These include cultural and historical views of animals; animals as companions; the use of animals in scientific research, entertainment, and service work; euthanasia; animal production and sustainability; and conservation issues.",
    "prereq": []
  },
  {
    "uid": "798157",
    "code": "BTHX5900",
    "subject": "BTHX",
    "number": "5900",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study in Bioethics",
    "info": "Students propose area for study with faculty guidance, write proposal which includes outcome objectives and work plan. Faculty member directs student's work and evaluates project.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "798173",
    "code": "BTHX8000",
    "subject": "BTHX",
    "number": "8000",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Topics in Bioethics",
    "fullname": "Advanced Topics in Bioethics",
    "info": "Advanced study of bioethics topics of contemporary interest.prereq: Grad or professional student",
    "prereq": []
  },
  {
    "uid": "813023",
    "code": "BTHX8100",
    "subject": "BTHX",
    "number": "8100",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Theor & Prac of Clin Eth",
    "fullname": "Advanced Theory & Practice of Clinical Ethics",
    "info": "This graduate seminar examines the principles and practices of health care ethics consultation. Focuses on the Core Competencies for Health Care Ethics Consultation promulgated by the American Society for Bioethics and Humanities. Topics include the nature and goals of health care ethics consultation, methods and processes of health care ethics consultation, evolving standards of clinical practice, core skills and core knowledge for ethics consultation, consultation evaluation, accountability, and institutional relationships, and special obligations of ethics consultants and institutions. The course serves graduate students in bioethics, ethics committee members (including community/lay members) and ethics consultants, clinical staff and faculty, law students, student clinicians, and students of the social and behavioral sciences and other disciplines.prereq: BTHX 5100 or instr consent",
    "prereq": {
      "code": "BTHX 5100",
      "subject": "BTHX",
      "id": "5100"
    }
  },
  {
    "uid": "812995",
    "code": "BTHX8110",
    "subject": "BTHX",
    "number": "8110",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethical Issues in Pediatrics",
    "fullname": "Ethical Issues in Pediatrics",
    "info": "Using real pediatric cases, we will examine some of the most pressing ethical issues faced by clinical teams, patients and families, and ethics consultants. Topics include decision-making for children at the end-of-life, care of extremely premature infants, conceptions of disability, adolescents’ independence from their guardians in decision-making and confidentiality protections, research conducted with children, Child Protective Services in the lives of children & families, and prioritizing children for scarce resources in public health emergencies. Through robust classroom discussions, we will consider these complex issues from a diversity of perspectives. This course is intended for professional and academic disciplines working with children such as medicine, nursing, psychology, social work, law, public health, and education, as well as child development, anthropology, and philosophy.",
    "prereq": []
  },
  {
    "uid": "798719",
    "code": "BTHX8114",
    "subject": "BTHX",
    "number": "8114",
    "honors": false,
    "writingIntensive": false,
    "name": "Genet Couns Issues",
    "fullname": "Ethical and legal Issues in Genetic Counseling",
    "info": "Professional ethics. Ethical/legal concerns with new genetic technologies.prereq: [MCDG MS, genetic counseling specialization] or instr consent",
    "prereq": []
  },
  {
    "uid": "812996",
    "code": "BTHX8120",
    "subject": "BTHX",
    "number": "8120",
    "honors": false,
    "writingIntensive": false,
    "name": "Dying in Contemp Med Culture",
    "fullname": "Dying in Contemporary Medical Culture",
    "info": "Examines practices of dying and death in contemporary U.S. culture, moral problems associated with these practices, possible solutions, and practical applications. Readings will consist of cultural critiques, bioethics literature, and empirical research. ",
    "prereq": []
  },
  {
    "uid": "813237",
    "code": "BTHX8331",
    "subject": "BTHX",
    "number": "8331",
    "honors": false,
    "writingIntensive": false,
    "name": "The Psychology of Morality",
    "fullname": "The Psychology of Morality",
    "info": "Current research topics in socio-political moral judgment and moral developmentprereq: Grad",
    "prereq": []
  },
  {
    "uid": "803085",
    "code": "BTHX8333",
    "subject": "BTHX",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "tbdprereq: Master's student, adviser consent, DGS consent",
    "prereq": []
  },
  {
    "uid": "803943",
    "code": "BTHX8500",
    "subject": "BTHX",
    "number": "8500",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in Bioethics",
    "fullname": "Practicum in Bioethics",
    "info": "Supervised placement to apply knowledge/skills from core courses. Individualized plan is developed between student, bioethics adviser or DGS, and mentor at practicum site.prereq: Bioethics grad [major or minor] or instr consent",
    "prereq": []
  },
  {
    "uid": "800069",
    "code": "BTHX8510",
    "subject": "BTHX",
    "number": "8510",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender and Health",
    "fullname": "Gender and the Politics of Health",
    "info": "Significance of gender to health and health care. Feminist analysis regarding moral/political importance of gender, possibly including contemporary western medicine?s understanding of the body, childbirth, and reproductive technologies; cosmetic surgery; chronic illness; disability; participation in research; gender and classification of disease. Care work, paid/non-paid. Readings from feminist theory, history, social science, bioethics, and moral philosophy.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "815966",
    "code": "BTHX8520",
    "subject": "BTHX",
    "number": "8520",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Justice and Bioethics",
    "fullname": "Social Justice and Bioethics",
    "info": "This course explores matters of social justice related to health. Readings from multiple disciplinary perspectives ground examination of how to understand social justice in this context. Class sessions will predominantly focus on specific practical issues such as health disparities, the politics of inclusion and exclusion in clinical research, resource allocation in resource poor settings, and health professional roles during war. Discussions incorporate consideration of these issues institutional and broader social contexts. This course is appropriate for a wide audience including students from the health professions, philosophy, social science, and law.",
    "prereq": []
  },
  {
    "uid": "816531",
    "code": "BTHX8540",
    "subject": "BTHX",
    "number": "8540",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioethics, Psychiatry & Psych",
    "fullname": "Bioethics, Psychiatry & Psychology",
    "info": "Explore philosophical and ethical issues in psychiatry and psychology. Potential topics include the moral responsibility of psychopaths for their actions, false memories of Satanic ritual abuse, insanity pleas, the sociology of institutionalization, clinical trials of psychiatric drugs, cosmetic psychopharmacology, recent work in experimental philosophy, and classic experiments in social psychology.",
    "prereq": []
  },
  {
    "uid": "799559",
    "code": "BTHX8610",
    "subject": "BTHX",
    "number": "8610",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Consumerism",
    "fullname": "Medical Consumerism",
    "info": "Two related movements have emerged in American health care. The first is an emphasis on medical enhancement, or the use of medical technologies to improve the looks, performance and psychological well-being of people who are healthy. The second is the submission of the American health care system to the machinery of consumer capitalism. This seminar will use an interdisciplinary set of texts to explore the implications of medical consumerism. How is the consumerist model of medicine shaping our concepts of disease and disability? What larger historical developments have led to our current situation? How are the tools of medical enhancement shaping the way we think about our identities and the way we live our lives?  Teaching modality:  In-Person Classes.",
    "prereq": []
  },
  {
    "uid": "816507",
    "code": "BTHX8650",
    "subject": "BTHX",
    "number": "8650",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioethics, Psychiatry & Psych",
    "fullname": "Bioethics, Psychiatry & Psychology",
    "info": "Explore philosophical and ethical issues in psychiatry and psychology. Potential topics include the moral responsibility of psychopaths for their actions, false memories of Satanic ritual abuse, insanity pleas, the sociology of institutionalization, clinical trials of psychiatric drugs, cosmetic psychopharmacology, recent work in experimental philosophy, and classic experiments in social psychology.",
    "prereq": []
  },
  {
    "uid": "817573",
    "code": "BTHX8710",
    "subject": "BTHX",
    "number": "8710",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethical Issues in Glob Health",
    "fullname": "Ethical Issues in Global health",
    "info": "This course examines ethical issues in global health which encompasses issues of religion, morality, public policy, disability rights, and health system structure. During this course, we draw from the literature on policies, traditions in the ethics of health, public health, health care and transnational cases.",
    "prereq": []
  },
  {
    "uid": "817844",
    "code": "BTHX8755",
    "subject": "BTHX",
    "number": "8755",
    "honors": false,
    "writingIntensive": false,
    "name": "Plan B Capstone",
    "fullname": "Plan B Capstone",
    "info": "Research project. Topic arranged between student/instructor. Written report required. Prereq: Advanced Plan B MA student.",
    "prereq": []
  },
  {
    "uid": "803077",
    "code": "BTHX8777",
    "subject": "BTHX",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credits:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "tbd ",
    "prereq": []
  },
  {
    "uid": "817574",
    "code": "BTHX8800",
    "subject": "BTHX",
    "number": "8800",
    "honors": false,
    "writingIntensive": false,
    "name": "Animal Ethics",
    "fullname": "Animal Ethics",
    "info": "Human relationships with animals are changing and this course offers a venue for exploring some of the ethical issues in these evolving relationships. The course will discuss the differences between animal ethics and animal welfare and examine the morality and ethics of human-animal interactions in various contexts. These include cultural and historical views of animals; animals as companions; the use of animals in scientific research, entertainment, and service work; euthanasia; animal production and sustainability; and conservation issues.",
    "prereq": []
  },
  {
    "uid": "798158",
    "code": "BTHX8900",
    "subject": "BTHX",
    "number": "8900",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Independent Study",
    "fullname": "Advanced Independent Study in Bioethics",
    "info": "Students propose area for individual study with faculty guidance. Students write proposal, which includes outcome objectives and work plan. Faculty member directs student's work and evaluates project.prereq: instr consent",
    "prereq": []
  }
]