[
  {
    "uid": "014588",
    "code": "CAPS7500",
    "subject": "CAPS",
    "number": "7500",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Pub Hlth",
    "fullname": "Advanced Public Health",
    "info": "How and why public health and regulatory agencies function; veterinarian's role in operation of the U.S. food industry; problem solving in veterinary public health, occupational health, and environmental topics.",
    "prereq": []
  },
  {
    "uid": "014598",
    "code": "CAPS7505",
    "subject": "CAPS",
    "number": "7505",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies LAM",
    "fullname": "Directed Studies in Large Animal Medicine",
    "info": "Students, under the guidance of a faculty member, conduct a special project addressing an issue in veterinary medicine.  Project proposals must be approved by CVM's curriculum committee.",
    "prereq": []
  },
  {
    "uid": "787611",
    "code": "CAPS7618",
    "subject": "CAPS",
    "number": "7618",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Applied Dairy Nutrition",
    "fullname": "Advanced Applied Dairy Nutrition",
    "info": "Providing counseling or assessment to a dairy farm on its nutrition program. Discussions of techniques and scientific principles. Problem solving experiences derived from field cases. Students practice using ration formulation programs.\"Live\" case studies and herd visits will be made by each student including a written and oral report to the client and the class.The ruminant rotation or its equivalent (AnSci 5-403) is required to taking this rotation.",
    "prereq": []
  },
  {
    "uid": "014623",
    "code": "CAPS7708",
    "subject": "CAPS",
    "number": "7708",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Anal. Techs.",
    "fullname": "Advanced Analytic Techniques",
    "info": "Principles and practices of developing and using computer systems for processing, analyzing, and interpreting various categories of animal health data. Aquiring resources necessary to undertake a research program.  Developing a critical approach to reading veterinary medical literature.",
    "prereq": []
  },
  {
    "uid": "789830",
    "code": "CAPS7711",
    "subject": "CAPS",
    "number": "7711",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Lg An Med",
    "fullname": "Advanced Large Animal Medicine",
    "info": "Provides exposure to medical diseases of horses, cattle, and small ruminants.  History taking, clinical diagnosis, and patient management.  Assessment of treatment responses in hospitalized patients.  Clinic case material is supplemented by computer-based problem-knowledge couplers and case simulations.  Small group discussions focus on clinical diagnosis, treatment, and prevention of common medical disorders.",
    "prereq": []
  },
  {
    "uid": "014628",
    "code": "CAPS7712",
    "subject": "CAPS",
    "number": "7712",
    "honors": false,
    "writingIntensive": false,
    "name": "Lg An Med",
    "fullname": "Large Animal Medicine",
    "info": "Provides exposure to medical diseases of horses, cattle and small ruminants.  History taking, clinical diagnosis and patient management.  For hospitalized patients, experience will be gained in assessment of treatment responses.  Clinic case material will be supplemented by computer-based problem-knowledge couplers and case simulations.  Small group discussions will focus on clinical diagnosis, treatment and prevention of common medical disorders.",
    "prereq": []
  },
  {
    "uid": "014631",
    "code": "CAPS7713",
    "subject": "CAPS",
    "number": "7713",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Medicine",
    "fullname": "Large Animal Medicine",
    "info": "",
    "prereq": []
  },
  {
    "uid": "790522",
    "code": "CAPS7738",
    "subject": "CAPS",
    "number": "7738",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Equine Podiatry",
    "fullname": "Advanced Equine Podiatry",
    "info": "Two-week didactic and laboratory course.  Concepts of equine podiatry.  Anatomy and physiology of the foot and hoof.  Seminars on diseases of the hoof and foot, including discussion of actual cases.  Labs introduce basic techniques and methods of treatment for hoof and foot injuries.",
    "prereq": []
  },
  {
    "uid": "790151",
    "code": "CAPS7792",
    "subject": "CAPS",
    "number": "7792",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Ruminant Hlth & Prod",
    "fullname": "Small Ruminant Health and Production Rotation",
    "info": "Sheep, goat, llama, farmed-deer production, medicine, and health. Nutrition/health management, new stock, facility maintenance, husbandry, diagnosis, record keeping, zoonosis, necropsy. Reproductive managment. Breeding soundness, body condition, vasectomy, ultrasound, castration, tail docking, disbudding, dehorning, vaccination, parasites, restraint/handling, venipuncture, foot trimming, tuberculin testing. Farm visits.",
    "prereq": []
  },
  {
    "uid": "014178",
    "code": "CAPS7801",
    "subject": "CAPS",
    "number": "7801",
    "honors": false,
    "writingIntensive": false,
    "name": "Lg An Int Med I",
    "fullname": "Large Animal Internal Medicine I",
    "info": "Pathophysiology, clinical manifestations, and therapeutic regimes for major organ systems of main large animal species.",
    "prereq": []
  },
  {
    "uid": "014184",
    "code": "CAPS7802",
    "subject": "CAPS",
    "number": "7802",
    "honors": false,
    "writingIntensive": false,
    "name": "Lg An Int Med II",
    "fullname": "Large Animal Internal Medicine II",
    "info": "Pathophysiology, clinical manifestations, and therapeutic regimes used for major organ systems of main large animal species.",
    "prereq": []
  },
  {
    "uid": "790523",
    "code": "CAPS7815",
    "subject": "CAPS",
    "number": "7815",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Ruminant Nutrition",
    "fullname": "Advanced Ruminant Nutrition",
    "info": "Nutrient requirements of ruminants, nutrient content of feed stuffs (primarily forages), energy utilization, protein and non-protein nitrogen utilization, nutrition disorders, formulation of adequate rations, techniques for analyzing rations, and grazing.",
    "prereq": []
  },
  {
    "uid": "790524",
    "code": "CAPS7816",
    "subject": "CAPS",
    "number": "7816",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Applied Dairy Nutrition",
    "fullname": "Advanced Applied Dairy Nutrition",
    "info": "Providing counseling or assessment to a dairy farm on its nutrition program. Discussions of techniques and scientific principles. Problem solving experiences derived from field cases. Students practice using ration formulation programs. \"Live\" case studies and herd visits will be made by each student including a written and oral report to the client and the class. The ruminant rotation or its equivalent (AnSci 5-403) is required to taking this rotation.",
    "prereq": []
  },
  {
    "uid": "790153",
    "code": "CAPS7818",
    "subject": "CAPS",
    "number": "7818",
    "honors": false,
    "writingIntensive": false,
    "name": "Biosecurity",
    "fullname": "Infectious Disease Control (Biosecurity) and Development of Treatment Protocols for Dairy Farms",
    "info": "How to assist a dairy producer with implementing management practices necessary to control/treat dairy diseases.",
    "prereq": []
  },
  {
    "uid": "790528",
    "code": "CAPS7820",
    "subject": "CAPS",
    "number": "7820",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Dairy Records",
    "fullname": "Advanced Dairy Records",
    "info": "Evaluation of a dairy herd, using biological and economic records. Prepares students for consulting, identifying causes of problems and proposing solutions. Records analysis (computer and hand records). Economic-basis dairying and financial techniques for evaluating producer decisions and veterinary recommendations. Course includes computer labs and field trips.",
    "prereq": []
  },
  {
    "uid": "015390",
    "code": "CAPS7852",
    "subject": "CAPS",
    "number": "7852",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Virology",
    "fullname": "Swine Virology",
    "info": "Lab techniques for diagnostic virology, serology, and immunology. Research techniques for use of fluorescent antibodies, determination of classes of immunoglobulins, and immunostimulation of lymphocytes.",
    "prereq": []
  }
]