[
  {
    "uid": "016265",
    "code": "CEBS1",
    "subject": "CEBS",
    "number": "1",
    "honors": false,
    "writingIntensive": false,
    "name": "Employee Benefits Concepts",
    "fullname": "Employee Benefits Concepts and Medical Care Benefits",
    "info": "Overview of the environment of employee benefit plans. Hospital plans, surgical/medical expense plans, major medical plans, dental/vision care, health care cost containment, managed care, long-term care, HMOs, preferred provider organizations. Certificate credit course (3 credits).",
    "prereq": []
  },
  {
    "uid": "016493",
    "code": "CEBS10",
    "subject": "CEBS",
    "number": "10",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Benefit Issues",
    "fullname": "Contemporary Benefit Issues & Administration",
    "info": "Employer administrative issues such as fiduciary liability, acccounting for postretirement benefits, international benefits, outsourcing, and new technologies. New types of benefits such as long-term care insurance. Work/family issues in plan design. This is a certificate credit course  (3 credits).",
    "prereq": []
  },
  {
    "uid": "790891",
    "code": "CEBS11",
    "subject": "CEBS",
    "number": "11",
    "honors": false,
    "writingIntensive": false,
    "name": "Personal Financial Planning 1",
    "fullname": "Personal Financial Planning 1: Concepts and Principles",
    "info": "Cash flow. Financial statements and debt analysis. Time value of money.  Management of liability, disability, life, medical, and property risks.  Investment/portfolio management. Tax reduction, employee benefits, retirement/estate plannings, ethical/family values, regulation of financial planners.",
    "prereq": []
  },
  {
    "uid": "016264",
    "code": "CEBS2",
    "subject": "CEBS",
    "number": "2",
    "honors": false,
    "writingIntensive": false,
    "name": "Employee Benefits:  Design",
    "fullname": "Employee Benefits:  Design, Administration, and Other Welfare Benefits",
    "info": "Group insurance mechanism, life insurance benefits, short-/long-term disability income, employee-assistance programs, dependent care arrangements, death benefits, flexible benefits, family leave, unemployment benefits, employee discounts, educational benefits, credit unions, management topics. Certificate credit course.",
    "prereq": []
  },
  {
    "uid": "016270",
    "code": "CEBS3",
    "subject": "CEBS",
    "number": "3",
    "honors": false,
    "writingIntensive": false,
    "name": "Retirement Plans: Basic Featur",
    "fullname": "Retirement Plans: Basic Features and Defined Contribution Approaches",
    "info": "Historical introduction to private-pension-plan development. Objectives of benefit plan design. Analysis of defined benefit/defined contribution plans. Approaches to retirement plan design. Certificate credit course.",
    "prereq": []
  },
  {
    "uid": "017005",
    "code": "CEBS4",
    "subject": "CEBS",
    "number": "4",
    "honors": false,
    "writingIntensive": false,
    "name": "Retirement Plans: Def Benefit",
    "fullname": "Retirement Plans: Defined Benefit Approaches and Plan Administration",
    "info": "Overview of retirement aspects of Social Security. Defined benefit features. Hybrid approaches (cash balance/target benefit plans). Actuarial/accounting aspects of defined benefit plan sponsorship, basic concepts of investing pension assets, taxation of retirement benefits, nonqualified approaches to retirement income. Certificate credit course.",
    "prereq": []
  },
  {
    "uid": "016490",
    "code": "CEBS5",
    "subject": "CEBS",
    "number": "5",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Legal Env",
    "fullname": "Contemporary Legal Environment of Employee Benefit Plans",
    "info": "Legal system, basic legal rights/responsibilities, legal environment. Focuses on concepts/principles of significance in employee benefit planning/administration.",
    "prereq": []
  },
  {
    "uid": "016491",
    "code": "CEBS6",
    "subject": "CEBS",
    "number": "6",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Concepts and Practic",
    "fullname": "Financial Concepts and Practices",
    "info": "Financial/accounting concepts essential in administration of employee benefit plans. Role of accounting as system of communicating information to users inside/outside an organization. Concepts, principles, and techniques of financial management.",
    "prereq": []
  },
  {
    "uid": "016271",
    "code": "CEBS7",
    "subject": "CEBS",
    "number": "7",
    "honors": false,
    "writingIntensive": false,
    "name": "Asset Management",
    "fullname": "Asset Management",
    "info": "Asset management in investing pension plan assets. Securities markets, stock/bond valuation/analysis, portfolio theory, investment policy, federal securities regulation. Certificate credit course.",
    "prereq": []
  },
  {
    "uid": "016273",
    "code": "CEBS8",
    "subject": "CEBS",
    "number": "8",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Resources & Compensation",
    "fullname": "Human Resources & Compensation Management",
    "info": "Survey of human resources management and of compensation administration. Total compensation concepts, human resources planning, employee benefits, noneconomic rewards, seniority, management rights, union security. Certificate credit course.",
    "prereq": []
  },
  {
    "uid": "016492",
    "code": "CEBS9",
    "subject": "CEBS",
    "number": "9",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Economics",
    "fullname": "Health Economics",
    "info": "Economic principles underlying inflation, national income, business cycles, employment levels, money/banking, monetary/fiscal policy, and their effect on employee benefits. Determining national income/employment in relation to inflation, unemployment, and various measures of national income. Effect of government activities on equilibrium level of national income.",
    "prereq": []
  }
]