[
  {
    "uid": "806722",
    "code": "CFAN1101",
    "subject": "CFAN",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Dean's Engaged Leaders Seminar",
    "fullname": "Dean's Engaged Leaders Seminar",
    "info": "Students explore their role in building inclusive community spaces. Development of leadership skills in academic, social, and public service contexts. Hands-on learning/real-world applications in culturally diverse communities. Field trips, guest speakers, and discussions.\n\nprereq: Incoming 1st-yr CFANS students only",
    "prereq": []
  },
  {
    "uid": "817351",
    "code": "CFAN1102",
    "subject": "CFAN",
    "number": "1102",
    "honors": false,
    "writingIntensive": false,
    "name": "PES Seminar",
    "fullname": "President's Emerging Scholars Seminar",
    "info": "President's Emerging Scholars (PES) is an educational opportunity program that supports high-achieving, historically underserved students in their pursuit of a bachelor's degree at the University of Minnesota Twin Cities. Participants are selected based on holistic review conducted by the Office of Admissions, and PES students demonstrate achievement in a number of ways, including strong academics, extracurricular excellence, and significant community engagement.This seminar is designed to help CFANS PES students in the transition from high school to college. Many PES students are the first in their family to attend college, be Pell Grant recipients, indigenous students, and students of color. In this course, students will explore University resources, its people, and connect students with each other. Students will learn about resources, challenges, opportunities, and their own identity development through self-reflection and engagement assignments, culminating in the creation of a Digital Story they can share with their peers.prereq: CFANS newly admitted PES students",
    "prereq": []
  },
  {
    "uid": "803827",
    "code": "CFAN1201",
    "subject": "CFAN",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Discovering Majors and Careers",
    "fullname": "Discovering Majors and Careers",
    "info": "Five stages in the career discovery process: self-assessment, exploration, decision making, experiencing, and implementing. Determining next steps in academic/career process.",
    "prereq": []
  },
  {
    "uid": "010336",
    "code": "CFAN1501",
    "subject": "CFAN",
    "number": "1501",
    "honors": false,
    "writingIntensive": false,
    "name": "Biotechnology, People & Envir",
    "fullname": "Biotechnology, People, and the Environment",
    "info": "Basic concepts in genetic engineering as a foundation for studying the impact of biotechnology on agriculture, medicine, industry, and the environment. Controversial aspects of biotechnology related to public policy issues are discussed. ",
    "prereq": []
  },
  {
    "uid": "016679",
    "code": "CFAN1901",
    "subject": "CFAN",
    "number": "1901",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "795765",
    "code": "CFAN1903",
    "subject": "CFAN",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "793748",
    "code": "CFAN1904",
    "subject": "CFAN",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "792694",
    "code": "CFAN1905",
    "subject": "CFAN",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics:  Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics vary.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "826629",
    "code": "CFAN1906",
    "subject": "CFAN",
    "number": "1906",
    "honors": false,
    "writingIntensive": false,
    "name": "Food and Culture in Iceland",
    "fullname": "Food and Culture in Iceland: Hkarl, Hot Dogs, and Hot Springs",
    "info": "This embedded study abroad course will explore aspects of agriculture, food, and culture in Iceland in comparison to each student?s experience in the United States. This course will first meet on-campus, with a ten day travel experience during spring break, and then meet again on-campus following the travel portion of the course.For the travel portion of this course, we will embark on an experience through hands-on learning in Iceland. Students will learn about, and reflect on, available food resources in Iceland, including how Icelandic cuisine is intertwined with Icelandic culture. Activities and learning will take place at numerous locations throughout Iceland. Students will attend lectures and presentations taught by faculty who are experts in the field, and will have the opportunity to learn about the culture and cuisine in Iceland. In their exploration of Iceland, students will be exposed to a breadth of diverse cultural experiences in which they will be challenged to reflect on their emotional responses and active participation within Icelandic culture and integrate these into their personal and professional worldview. Students will also visit important archaeological, sacred, and natural sites throughout Iceland to better understand the history of the region and the culture of its people. Students will be encouraged early on to identify a particular interest they want to learn more about in Iceland (e.g. greenhouse agriculture, dairy production, sustainability, agro-tourism, etc.) and find opportunities to integrate this interest into the questions they ask in their blog posts, their final project, and at site visits.",
    "prereq": []
  },
  {
    "uid": "795897",
    "code": "CFAN1908W",
    "subject": "CFAN",
    "number": "1908",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "016680",
    "code": "CFAN1910W",
    "subject": "CFAN",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar: Topics",
    "fullname": "Freshman Seminar: Topics",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "817630",
    "code": "CFAN1911",
    "subject": "CFAN",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Native American Env Knowledge",
    "fullname": "Native American Ways of Knowing the Environment",
    "info": "American Indian peoples have occupied \"Turtle Island\" or North America for more than 20 thousand years. Today, more than 400 American Indian nations have been recognized by the federal government using more than 250 distinct languages. This seminar will focus on American Indian ways of knowing the environment through discussion, guest speakers, site visits near the U of M campus, lectures, and community service learning experiences.",
    "prereq": []
  },
  {
    "uid": "805660",
    "code": "CFAN1942",
    "subject": "CFAN",
    "number": "1942",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule. ",
    "prereq": []
  },
  {
    "uid": "809285",
    "code": "CFAN2201",
    "subject": "CFAN",
    "number": "2201",
    "honors": false,
    "writingIntensive": false,
    "name": "Secure & Succeed in Intrnships",
    "fullname": "Secure & Succeed in Internships",
    "info": "This is an intensive internship course, which includes planning, preparing, applying and completing an internship. Students will receive coaching to help them seek an internship through resume & cover letter writing, job searching, networking, and interviewing. At the end of the spring, students are required to have an internship lined up and complete online reflections about the experience over the summer to finish the course.Not recommended for students who have previously taken CFAN 3201 as course content may be repetitive. Email if you have questions.",
    "prereq": []
  },
  {
    "uid": "826779",
    "code": "CFAN2222",
    "subject": "CFAN",
    "number": "2222",
    "honors": false,
    "writingIntensive": false,
    "name": "Innovating the Future",
    "fullname": "Innovating the Future: Applied Human and AI-Generated Creativity in Entrepreneurial Problem Solving",
    "info": "This course is a hands-on immersion experience in innovation techniques that emphasizes new ways of thinking and framing for everyday problems and grand challenges in both personal and professional lives. The course focuses on the application of creative thinking techniques that entrepreneurs use to view the world from different perspectives, identify unique opportunities, and generate and evaluate original ideas. Students will be introduced to a number of human and AI-generated tools, concepts, and approaches that explore idea discovery, the importance of embracing ambiguity, and systems thinking. Trends and innovations in all the disciplines within CFANS will be explored as catalysts for student-generated creative collisions.",
    "prereq": []
  },
  {
    "uid": "810033",
    "code": "CFAN2333",
    "subject": "CFAN",
    "number": "2333",
    "honors": false,
    "writingIntensive": false,
    "name": "Insects, Microbes, and Plants",
    "fullname": "Insects, Microbes, and Plants: Ecology of Pest Management",
    "info": "This course uses fundamental concepts of ecology and evolution to illuminate and solve the challenges in managing insects and microbes in today’s global context of food and fiber production.  Students will learn relevant aspects of insect and microbial biology to be able to situate concrete management problems in an appropriate ecological and evolutionary conceptual framework. Students will apply these concepts and discuss ecological and management controversies, such as what can we learn from natural areas to better manage food and fiber production systems. Case studies, readings, and discussion topics will emphasize factors influencing responsible management decisions.",
    "prereq": []
  },
  {
    "uid": "789986",
    "code": "CFAN3001",
    "subject": "CFAN",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Pests and Crop Protection",
    "fullname": "Pests and Crop Protection",
    "info": "Introduction to biology/identification of insects, weeds, and diseases that affect agricultural crops. Management of these organisms based on principles of integrated pest management.prereq: Biol 1009 or equiv or instr consent",
    "prereq": {
      "code": "BIOL 1009",
      "subject": "BIOL",
      "id": "1009"
    }
  },
  {
    "uid": "815584",
    "code": "CFAN3002",
    "subject": "CFAN",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Transfer Student Seminar",
    "fullname": "Transfer Student Seminar",
    "info": "This course introduces new transfer students to the College of Food, Agricultural and Natural Resource Sciences (CFANS) and to the UMN. This course will introduce students to opportunities provided to them by both CFANS and UMN. It will help connect students to faculty and staff, as well as to other transfer students. By introducing transfer student theories, diversity, & equity topics and career information, transfer students will become immersed in the CFANS environment and will be provided with a foundation of knowledge that will help students continue to be successful during their remaining time at the University of Minnesota. The course will be held once a week. ",
    "prereq": []
  },
  {
    "uid": "014520",
    "code": "CFAN3093",
    "subject": "CFAN",
    "number": "3093",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Studies:  International Ag",
    "fullname": "Directed Studies in International Agriculture",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.prereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "809553",
    "code": "CFAN3096",
    "subject": "CFAN",
    "number": "3096",
    "honors": false,
    "writingIntensive": false,
    "name": "Mkg the Most of your Prof Exp",
    "fullname": "Making the Most of your Professional Experience",
    "info": "This course is designed to meet the CFANS Experiential Learning requirement which defines the importance and processes of learning through experience. This course also is a Diversity Enriched course. Students will undertake an experience in an authentic work-place setting related to agriculture, food, or natural resource settings as a prerequisite to the course. The professional/internship experience will serve as a foundation for learning professional competencies including reflection, problem solving, managing interpersonal relationships, professional communication, and goal setting. Current theories of career development and career readiness will be introduced to help students construct meaning from their experiences to inform future goals and strategies. prereq: Secured internship, instr consent, CFANS or CCAPS students",
    "prereq": []
  },
  {
    "uid": "796771",
    "code": "CFAN3201",
    "subject": "CFAN",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Career and Internship Prep",
    "fullname": "Career and Internship Preparation",
    "info": "The aim of this course is to equip you with long-term skills and knowledge that will help you manage your career within a dynamic and exciting work world of agriculture, food and the environment. The focus will be on career opportunities and resources related to CFANS majors highlighting alumni, employers and events from those majors. You will learn to tailor communication about your unique skills and interests to the needs of employers, graduate schools, and others via resumes, cover letters, online media, interviews, and individual interactions. We will explore how to attend to your authentic identity and values as you consider career alternatives and to enter a workplace culture with grace and curiosity. Finally we will introduce career competencies needed for successful career management in the workplace including strategies to function as an effective employee and team member. prereq: Soph or jr or sr or grad student",
    "prereq": []
  },
  {
    "uid": "805766",
    "code": "CFAN3293",
    "subject": "CFAN",
    "number": "3293",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "This course provides a service learning component for the Native American Environmental Knowledge minor.  Through directed study students are expected to become familiar with community interests and needs under the direction of a faculty member through journaling, discussion, writing assignments, community presentations, and storytelling. Students enrolling in this directed study will be required to use the University-wide on-line directed study contract process in order to enroll.Prereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "812156",
    "code": "CFAN3301",
    "subject": "CFAN",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Grad&Prof School:Success Strat",
    "fullname": "Grad & Prof School:Success Strategies for Prep,Adm",
    "info": "Intended for junior/seniors of all majors with interests in career exploration/pursuit of either graduate or professional school education. Addresses needs of multicultural students, those from diverse backgrounds, those who may be first generation college students.",
    "prereq": []
  },
  {
    "uid": "818981",
    "code": "CFAN3334",
    "subject": "CFAN",
    "number": "3334",
    "honors": false,
    "writingIntensive": false,
    "name": "Parasites and Pestilence",
    "fullname": "Parasites and Pestilence",
    "info": "This course is designed to provide students with a basic understanding of protozoan and metazoan parasites, focusing on the biology and epidemiology of parasitic diseases and on the parasite-host association. Parasites are explored in the context of transmission, associated disease, diagnosis and treatment options; and environmental, cultural, and socioeconomic drivers of disease epidemiology. The intent of this course is for students to see science as a tool for understanding the world and solving problems. Importantly, the course is not designed to promote skills to become a practicing parasitologist but rather aims to facilitate broad exposure to infectious disease dynamics to foster more informed global citizens—using parasitic diseases as examples. A key tenet of liberal education is that it does not ignore the sciences, as such topics are explored in a way that intertwines science, history, and politics. Liberal education also teaches students how to speak their mind, how to write, and how to learn. As a result, this course will teach students how to use fundamental biological principles to think critically about challenges facing their society and the world.",
    "prereq": []
  },
  {
    "uid": "819998",
    "code": "CFAN3422",
    "subject": "CFAN",
    "number": "3422",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Sustainable Akumal",
    "fullname": "Introduction to Sustainable Akumal",
    "info": "This is the on-campus background prerequisite for CFAN 3522 Sustainable Akumal. We introduce Akumal and the history of coastal development in the Mexican Caribe along with coastal ecology and important biota from the area. We consider the cultural context, from ancient Maya to the recent development of a tourism economy and its effects on local communities.  We cover required gear and have a pool snorkel session.prereq: Instructor approval, LAC admission to Sustainable Akumal study abroad course. ",
    "prereq": []
  },
  {
    "uid": "802930",
    "code": "CFAN3480",
    "subject": "CFAN",
    "number": "3480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in CFANS",
    "fullname": "Topics in CFANS",
    "info": "Lectures by visiting scholar or regular staff member. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788976",
    "code": "CFAN3500",
    "subject": "CFAN",
    "number": "3500",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Field Studies Seminar",
    "fullname": "International Field Studies Seminar",
    "info": "Interface of agriculture with various natural resource, environmental, economic, food safety, public policy, ethical issues transcending national borders. Seminars take place in other countries or regions of world, providing global perspective. Active learning, lectures, discussion tutorials, field trips, reports, exams.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "806587",
    "code": "CFAN3501",
    "subject": "CFAN",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Costa Rica-Sustainable Dvlpmt",
    "fullname": "Costa Rica--Sustainable Development",
    "info": "Costa Rica's development strategy.  Agriculture, tourism, energy, and urbanization show synergies and tension between economic, social, and environmental impacts. Sustainability and how organizations maximize benefits associated with sustainable development.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "806588",
    "code": "CFAN3502",
    "subject": "CFAN",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Bahamas-Marine Biol/Shark Ecol",
    "fullname": "Bahamas--Tropical Marine Biology and Shark Ecology",
    "info": "Ecology of sharks and natural history of South Bimini Island. Marine ecosystems. Local flora and fauna. Local culture and development policy on the ecosystems.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "806589",
    "code": "CFAN3503",
    "subject": "CFAN",
    "number": "3503",
    "honors": false,
    "writingIntensive": false,
    "name": "Switzerland - Mountain Agri",
    "fullname": "Switzerland--Mountain Agriculture",
    "info": "Spring-time agriculture in a mountain ecosystem; management of farm enterprises to be productive in the context of Europe; how Switzerland has developed agro-tourism; interact with farmers, researchers, professionals and government officials who share expertise and interest in agricultural issues.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "806590",
    "code": "CFAN3504",
    "subject": "CFAN",
    "number": "3504",
    "honors": false,
    "writingIntensive": false,
    "name": "Vertebrate Res Design & Survey",
    "fullname": "Vertebrate Research Design and Field Survey Techniques",
    "info": "Thai culture and conservation challenges. Two-day barge trip learning culture before traveling to Thailand's premier conservation research site. Camera-trapping techniques, prey assessment methods, and radio telemetry approaches to the study of large mammals.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "806769",
    "code": "CFAN3505",
    "subject": "CFAN",
    "number": "3505",
    "honors": false,
    "writingIntensive": false,
    "name": "French Language and Culture",
    "fullname": "French Language and Culture",
    "info": "French language/way of life. Heritage of French culture.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "813576",
    "code": "CFAN3506",
    "subject": "CFAN",
    "number": "3506",
    "honors": false,
    "writingIntensive": false,
    "name": "ESPM and Iceland",
    "fullname": "Iceland: Landscapes, Natural Resources, and Environmental Management",
    "info": "Landscapes and natural resources shape ways countries view and manage environmental resources. We will study landscapes and natural resources of Iceland, including Thingvellir (= Ã¿ingvellir) National Park, the historical seat of Icelandic Parliament (or AlÃ¾ingi). We will learn how the national park and other natural resources are sustainably managed, and their significance as environmental and cultural shrines. Students will compile a journal with daily entries, including photographs or digital images, and participate in field exercise and cultural/social activities providing insight into Icelandic landscapes and society.prereq: But must be at least end-of-year freshmen in good academic standing with a minimum GPA of 2.5 or instr consent",
    "prereq": []
  },
  {
    "uid": "812952",
    "code": "CFAN3507",
    "subject": "CFAN",
    "number": "3507",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecuador: People, Land, & Water",
    "fullname": "Exploring Ecuador:  People, Land, and Water from the Amazon to the Galapagos",
    "info": "In this course we will explore the abundant flora and fauna and water resources of the majestic mountains, rich valley farmlands, and lush tropical forests.  We will also explore sustainability and restoration projects and visit urban Quito, rural villages, Amazon basin, and island hop through the Galapagos.  This interdisciplinary course offers students of all disciplines an opportunity to explore water resource management and Indigenous (Quichua) culture  A great opportunity for scientifically and culturally oriented students to interact with each other and the people of Ecuador.",
    "prereq": []
  },
  {
    "uid": "806718",
    "code": "CFAN3508",
    "subject": "CFAN",
    "number": "3508",
    "honors": false,
    "writingIntensive": false,
    "name": "Europe-Global Environ Ldrshp",
    "fullname": "Europe--Global Environmental Leadership",
    "info": "Decision-making on critical issues within the European Union common policy frameworks. Lectures and field settings provide background, principles, and managerial approaches embedded in EU environmental law and policy. Constructed wetlands and lake restoration.",
    "prereq": []
  },
  {
    "uid": "806789",
    "code": "CFAN3509",
    "subject": "CFAN",
    "number": "3509",
    "honors": false,
    "writingIntensive": false,
    "name": "So.Afrca One Ctry,Two Fd Systs",
    "fullname": "South Africa: One Country, Two Food Systems",
    "info": "Food systems in the central provinces of South Africa/how food is delivered to different groups. Transforming the agricultural sector to address food security. Approaches implemented since 1994: local production systems, education/land ownership for black farmers, new markets.",
    "prereq": []
  },
  {
    "uid": "807877",
    "code": "CFAN3511",
    "subject": "CFAN",
    "number": "3511",
    "honors": false,
    "writingIntensive": false,
    "name": "Mexico-Climate Change Conf",
    "fullname": "Mexico-Climate Change Conference",
    "info": "Students participate as University of Minnesota delegation members to the annual Conference of Parties for the Framework Convention on Climate Change. The annual COP reviews implementation of the convention. Students blog on their negotiation experience through web connections back to campus.",
    "prereq": []
  },
  {
    "uid": "807118",
    "code": "CFAN3512",
    "subject": "CFAN",
    "number": "3512",
    "honors": false,
    "writingIntensive": false,
    "name": "Terroir, Food Sys, Value Chain",
    "fullname": "From Farm to Fork: Terroir, Food Systems, & Value Chains of France",
    "info": "One would have thought that the ecological, climate, health, and social catastrophes of the last decade would have led to a green revolution and more sustainable societies, but that has not been the case. As a result, governments, corporations, consumers, and citizens will have to make deep meaningful changes to mitigating negative impacts to ecological biodiversity and natural resources.Of all sectors of the global economy, the agricultural and food sector is perhaps the most at risk. Producers within this industry are faced with the complicated equation being one of the principle causes of the problems listed above, while also retaining the responsibility to provide food for an ever-growing consumer base. Eating and good nutrition are vital human needs and food is a human right deeply rooted in culture and emotion. Food is a source of pleasure, a means of social integration, a reflection of cultural values, and of cultural identity. As a result, agrobusiness and food industry stakeholders are expected to meet the higher demand for food while also reassessing value chains, far beyond the classic economic and marketing approach, by introducing ecological, social, and cultural indicators when assessing operational standard and economic growth. is context, the idea of a terroir-driven food system represents strong sustainable alternative to standard commercial agricultural practices. While the term of terroir originates in western European countries such as Italy and France, the terroir approach is practiced worldwide. Terroir-centered food products, local food products, traditional food products, no matter what it is called, it is about the producing within a limited geographical area and producing products with unique characteristics recognizable to the people who live there. Content for this 4-week course, conducted in English, will be delivered via in-class lectures/presentations; educational field trips and cultural visits to Paris, the Loire Valley, Brittany, Normandy; group projects; and case studies.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "807466",
    "code": "CFAN3513",
    "subject": "CFAN",
    "number": "3513",
    "honors": false,
    "writingIntensive": false,
    "name": "The Natural History of Norway",
    "fullname": "The Natural History of Norway",
    "info": "The program will be based in the Nord Tröndelag region of central Norway where students will learn about Norway's physical geography, ecology, and management of natural resources, including its flora, fauna, and agricultural systems. Students will also gain an understanding of the region's rich culture, history, and close ties to Minnesota.prereq: instructor consent",
    "prereq": []
  },
  {
    "uid": "809506",
    "code": "CFAN3514",
    "subject": "CFAN",
    "number": "3514",
    "honors": false,
    "writingIntensive": false,
    "name": "Biodiversity & Climate in Peru",
    "fullname": "Machu Picchu: Biodiversity & Climate Change in Peru",
    "info": "Southeastern Peruvian Andes. Inca civilizations. Biodiversity assessment in headwaters of Amazon. What it means to be World Heritage Site.Experience the magic of the Andes. Watch the sunrise over the mountains surrounding Machu Picchu. Climb steep trails deep in the forest to check cameras capturing Peccaries, Jaguars and Jagarundis. Eat dinner with Macaws. Ask a question about the ecology of the forest ? and answer it. Have a unique experience in South America, and share a story about that experience back at home.Posing your own question about biodiversity, landscapes, specific plants or animals, or culture is an intensely rewarding experience. Learning about the ecology of a subset of the Amazon, framing questions and collecting information to address those questions helps us refine our creative and analytical abilities.",
    "prereq": []
  },
  {
    "uid": "810478",
    "code": "CFAN3515",
    "subject": "CFAN",
    "number": "3515",
    "honors": false,
    "writingIntensive": false,
    "name": "S Africa: Global Entre & Lead",
    "fullname": "South Africa: Global Entrepreneurship and Leadership, Books, and Wine",
    "info": "South Africa's economic growth/diversity in agricultural products/ecosystem. Educational systems, tourism, viticulture, wine making industry. Agricultural production operations/businesses that represent global entrepreneurship initiatives propelled by effective leaders.",
    "prereq": []
  },
  {
    "uid": "813809",
    "code": "CFAN3516",
    "subject": "CFAN",
    "number": "3516",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainbl Food Systms of Italy",
    "fullname": "Sustainable Food Systems of Italy",
    "info": "This course examines the concepts of sustainability in relation to food production and culture in a country and place where food is a fundamental component of the regional and national culture. The course incorporates intercultural development concepts to introduce students to past and present Italian culture through the cultural importance of food systems, the ethics of food consumption and production and the concepts of sustainability.",
    "prereq": []
  },
  {
    "uid": "817634",
    "code": "CFAN3517",
    "subject": "CFAN",
    "number": "3517",
    "honors": false,
    "writingIntensive": false,
    "name": "Livestock Systems in England",
    "fullname": "Shires, Shorthorns and Sheep:  Exploring Livestock Systems in England",
    "info": "This embedded study abroad course will directly examine the similarities and differences of livestock production practices, regulatory policies, consumer (and export) demands and the ethics of animal agriculture in England and Minnesota while allowing students to explore the rich history and culture of England.  ",
    "prereq": []
  },
  {
    "uid": "817835",
    "code": "CFAN3518",
    "subject": "CFAN",
    "number": "3518",
    "honors": false,
    "writingIntensive": false,
    "name": "Env'l Issues in New Zealand",
    "fullname": "Environmental Issues in New Zealand",
    "info": "This Global Seminar, Environmental Issues in New Zealand, is open to any undergraduate or graduate students regardless of major. Priority for enrollment is given to University of Minnesota students, but students from other institutions may attend if space is available. There are no course prerequisites and all instruction is in English.  New Zealand is a modern country with friendly people and awesome scenery. Our daily news is filled with reports on climate change, water scarcity and pollution, soaring energy costs, and food shortages. Solutions must consider environmental, economic, and social implications of our management strategies. Frequently there are trade-offs between benefits and costs. University students as future leaders of business, government, and social programs should understand how to analyze environmental issues. What are the issues? Who is affected? What alternatives exist to solve them? What are the environmental, economic, and social trade-offs between these alternatives? What are reliable sources of information? How can each of us contribute to solutions?New Zealand has undergone significant changes in its plant and animal composition following the invasion of humans and the exotic species they introduced. Alarmed by these changes, New Zealanders recently have made significant strides in recognizing environmental issues and seeking sustainable solutions. They offer valuable lessons for U.S. students to bring home and apply to our own environmental issues.",
    "prereq": []
  },
  {
    "uid": "817635",
    "code": "CFAN3519",
    "subject": "CFAN",
    "number": "3519",
    "honors": false,
    "writingIntensive": false,
    "name": "Bali: Water and Culture",
    "fullname": "Bali: Water and Culture from Rainforests to Reefs",
    "info": "Travel to Bali, Indonesia as part of a Global Seminar to explore how culture and beliefs influence our relationship with water and the environment. Through field and cultural excursions and site visits, lectures, and personal observation and study, students will cultivate an awareness of their relationship to the natural world as influenced by their own culture and belief system.",
    "prereq": []
  },
  {
    "uid": "818088",
    "code": "CFAN3521",
    "subject": "CFAN",
    "number": "3521",
    "honors": false,
    "writingIntensive": false,
    "name": "Borneo: Tropical Conservation",
    "fullname": "Borneo Global Seminar: Tropical Wildlife Conservation & Climate Change",
    "info": "This seminar explores tropical conservation by focusing on three main themes in Borneo: climate change, rehabilitation and release of charismatic rare and endangered species, and remote camera surveys for environmental education. Each theme is supported with in-country lectures, exploration activities, and a student product. We explore and learn about marine, montane, and tropical forest ecosystems. Threats to ecosystem health in Borneo are multi-faceted. Habitat loss and fragmentation, due to logging a few decades ago and primarily now oil-palm agriculture, mean that wildlife populations are smaller and increasingly isolated. This class engages students in global issues of climate change and habitat loss, helping them explore and analyze their observations critically. It also brings students face-to-face with rehabilitation and reintroduction of the species that suffer most as forests are felled for logging followed by oil palm agriculture. Species we investigate most closely are orangutans and sun bears. We explore riparian habitat, discuss issues of fragmentation, and pressures on protected areas at the Danau Girang Field Centre (DGFC). DGFC is located in high-quality riparian habitat in the Kinabatangan Reserve, in patches of forest nestled in a matrix of oil-palm agriculture. This area is host to a truly incredible suite of wild species. The Kinabatangan River is home to clouded leopards, sun bears, orangutans, otters, proboscis monkeys, and crocodiles. At the field station, wild orangutans forage in the canopy overhead. If you follow the noise of rustling leaves, you will likely observe troops of long-tailed macaques moving in the canopy and hornbills feeding on forest fruits. Students learn wildlife monitoring techniques and design their own environmental education lesson. Students also connect issues of climate change and conservation in a range of ecosystems in Sabah, Borneo, and design enrichment projects for captive sun bears and orangutans.",
    "prereq": []
  },
  {
    "uid": "818411",
    "code": "CFAN3522",
    "subject": "CFAN",
    "number": "3522",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainable Akumal",
    "fullname": "Sustainable Akumal: Turtles, tourists, cenotes and coral reefs",
    "info": "This Global Campus Partner seminar addresses coastal and marine ecology as affected by tourism and development and how these affect local communities. We will explore these issues in Akumal (Mayan: place of the turtle), Mexico on the Riviera Maya. Tourism and associated development have expanded exponentially in the past decade with subsequent effects on waste management and water quality in the local cenotes, groundwater, lagoons and reefs.  In addition to the water quality effects, increased use by tourist is also directly affecting sea grass, turtles and coral reefs.  We will explore the ecology of these systems, methods to assess their status and impacts, and strategies to reduce or mitigate the effects in a sustainable manner that involves local populations.Prereq: CFAN 3422",
    "prereq": {
      "code": "CFAN 3422",
      "subject": "CFAN",
      "id": "3422"
    }
  },
  {
    "uid": "819015",
    "code": "CFAN3523",
    "subject": "CFAN",
    "number": "3523",
    "honors": false,
    "writingIntensive": false,
    "name": "Greek Agriculture & Gastronomy",
    "fullname": "Greek Agriculture and Gastronomy: A Taste of the Mediterranean",
    "info": "This embedded course will be based in Thessaloniki, Greece and will examine Greek agriculture, food, and culture. Students will have hands-on experiences learning about the impact that Greek cuisine has on the rural development of the country and how Greeks work to conserve many of their cultural traditions.",
    "prereq": []
  },
  {
    "uid": "820355",
    "code": "CFAN3526",
    "subject": "CFAN",
    "number": "3526",
    "honors": false,
    "writingIntensive": false,
    "name": "Ag Marketing in Argentina",
    "fullname": "Two to Tango: Agricultural Marketing & Communication in Argentina",
    "info": "Agricultural marketing and farming are global industries and communicators and marketers need to be able to understand how events on other continents can impact decisions made at the firm-level; even in a different hemisphere. This course will study the farming and ranching industries in Argentina that provide the technology, production, expertise, processing, and transformation of farm products into foods that are in global demand. Additionally, this course will explore how Argentinian culture shapes marketing and communication efforts in Argentina. This course will spend two weeks in Argentina to meet with international agricultural firms and farmers to learn how Argentina continues to be a global competitor in agricultural commodities. Students will also learn about the challenges limiting South American agricultural production and how this relates to U.S. agriculture. ",
    "prereq": []
  },
  {
    "uid": "825591",
    "code": "CFAN3527",
    "subject": "CFAN",
    "number": "3527",
    "honors": false,
    "writingIntensive": false,
    "name": "Chilean Patagonia",
    "fullname": "Chile: Natural History of Patagonia",
    "info": "Co-production of sustainable knowledge: An exploration of human-wildlife conflict and a community artistic expression in southern ChileConservation biology addresses the tradeoffs inherent in balancing human needs for extractable ecosystem goods and services with our need for biodiversity and natural conditions. Our discussions always include the biophysical science of ecosystems and the human resource science of decisions. This class engages you directly in understanding and communicating about sustainable resource management in Patagonia, the fabulously beautiful, highly diverse, end-of-the-word in South America. You will explore mountainous and marine landscapes, places where you will (at least hope to see) Elephant seals, Mountain Lions, Emperor Penguins, Guanacos, and Patagonian Foxes. You also will encounter invasive rabbits and beavers, gigantic salmon aquaculture opens and an open pit mine. You will work with local community members to develop a permanent mural depicting all that. And you wll work with peers to develop a video documenting your experience.Humans have inhabited Patagonia for at last 14,000 years. For thousands of years, the nomadic Aónikenk people were the principal humans in the landscape. The technologically superior Mapuche people were predominant during the 1500s; Europeans (primarily Spanish and English) colonized the area from the mid-1500s; Chile has been an independent country since 1826. The economy of the area has been dominated by mining and agriculture. Mining extracts minerals and low quality coal. Agriculture includes sheep ranching as well as large scale marine salmon aquaculture. Sheep ranching resulted in thousands of miles of barbed wire fence, and millions of hectares of degraded grasslands, with associated negative impacts on wildlife. Wool prices were strong from the late 1800s through the mid 1950s, then dropped precipitously. As a result, many sheep estnacias were abandoned or turned into tourist lodges. Patagonia today is a land of expansive landscapes of mountains, grasslands, glaciers and high altitude lakes. The wildlife characteristic of the area include all Guanacos (a South American camel), the Huemel deer, Patagonian fox, hog nosed skunk and Andean Condor. Native marine life include penguins, elephant seals, leopard seals, and the Patagonian skate.",
    "prereq": []
  },
  {
    "uid": "825592",
    "code": "CFAN3528",
    "subject": "CFAN",
    "number": "3528",
    "honors": false,
    "writingIntensive": false,
    "name": "Exploring The New Nordic",
    "fullname": "Exploring The New Nordic: Food Seasonality and Sustainability in Denmark and Sweden",
    "info": "This embedded study abroad course will explore aspects of agriculture, food, and culture in Scandinavia in comparison to each student’s experience in the United States. This course will first meet on-campus, before our departure for a two-week experience in May.  In English usage, Scandinavia can refer to Denmark, Norway, and Sweden, and sometimes used more broadly to include the Aland Islands, the Faroe Islands, Finland, and Iceland.  The use of the term Nordic can also include the aforementioned countries along with Finland and Greenland.Throughout this course, we will embark on an experience through hands-on learning in Denmark and Sweden. Students will learn about, and reflect on, available food resources in Scandinavia, including how Scandinavian cuisine is intertwined with Scandinavian culture.CFANS has partnered with DIS for this course.  DIS is a non-profit study abroad foundation established in Denmark in 1959, with locations in Copenhagen and Stockholm. DIS provides semester, academic year, and summer programs taught in English, and offers high-impact learning experiences for upper-division undergraduate students from distinguished North American colleges and universities. The intellectually challenging curriculum is broad, cutting edge, and enriched by experiential learning components, including faculty-led study tours across Europe. It provides students with opportunities for meaningful cultural engagement and personal growth, which is further enriched through housing and extracurricular offerings.Activities and learning will take place at numerous locations throughout Scandinavia. Students will attend lectures and presentations taught by faculty who are experts in the field, and will have the opportunity to learn about the culture and cuisine in Scandinavia. In their exploration of Scandinavia, students will be exposed to a breadth of diverse cultural experiences in which they will be challenged to reflect on their emotional responses and active participation within Scandinavian culture and integrate these into their personal and professional worldview. Students will also visit important archaeological, sacred, and natural sites throughout Scandinavia to better understand the history of the region and the culture of its people.Students will be encouraged early on to identify a particular interest they want to learn more about in Scandinavia (e.g. precision agriculture, dairy production, sustainability, agro-tourism, etc.) and find opportunities to integrate this interest into the questions they ask in their blog posts, their final project, and at site visits.",
    "prereq": []
  },
  {
    "uid": "812821",
    "code": "CFAN3529",
    "subject": "CFAN",
    "number": "3529",
    "honors": false,
    "writingIntensive": false,
    "name": "Wildlife Med & Cons in Belize",
    "fullname": "From Rainforest to Reef: Wildlife Medicine and Conservation in Belize",
    "info": "Introduction to key topics in wildlife medicine. Students will learn medical issues and approaches, the role of the veterinarian in wildlife conservation, zoo medicine, and wildlife rescue & rehabilitation. This program is held at the Belize Wildlife & Referral Clinicâ¿¿s (BWRC) teaching facility with BWRCâ¿¿s founder and wildlife veterinarian, Dr. Isabelle Paquet-Durand. Labs include distance immobilization, suture, spay & neuter, necropsy, comparative anatomy, radiography, parasitology and blood analysis. Field visits are conducted with Dr. Isabelle to the Belize Zoo and to avian, reptile, primate, and manatee centers. Students are introduced to preventative medicine and common diseases for many of these species. A spay & neuter lab reviews theory and suture practice, this is followed by a spay & neuter clinic organized in the field or at BWRC. Students also have the opportunity to observe, and when possible, assist the BWRC veterinary staff during their daily operations. ",
    "prereq": []
  },
  {
    "uid": "826098",
    "code": "CFAN3531",
    "subject": "CFAN",
    "number": "3531",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Avail England/Scotland",
    "fullname": "Shifting Sustenance: Contemporary Food Availability and Selection in England and Scotland",
    "info": "This embedded study abroad course will explore aspects of agriculture, food, and culture in England andScotland in comparison to each student’s experience in the United States. This course will first meeton-campus, before our departure for a two-week experience in May.England and Scotland have long been associated with unique culinary traditions. In England, dishes suchas “toad in the hole”, “bangers and mash”, and “spotted dick” have been thought of as unique to thelocal areas, and what is a traditional dish in Scotland if not “haggis”? However, a survey from MortarResearch (commissioned by Aldi) in 2000 found that many in the United Kingdom have not only nevertried some of these dishes, some have not even heard of them. Although some of the aforementionedrecipes have been available for hundreds of years, a shifting demographic of UK residents, access to newfood, and a decline in regional eating in the past 30 - 50 years has resulted in a paradigm shift as to whatis considered British and Scottish cuisine.",
    "prereq": []
  },
  {
    "uid": "817667",
    "code": "CFAN3532",
    "subject": "CFAN",
    "number": "3532",
    "honors": false,
    "writingIntensive": false,
    "name": "Germany: Renewable Energy",
    "fullname": "Germany: Leading the Renewables Revolution",
    "info": "CFAN 3532/CFAN 5532 is part of an ongoing high-level energy and sustainability exchange with Germany. Participants in the student delegation are citizen ambassadors for the USA and Minnesota and represent the next generation of Midwest leaders. They will understand the systems approach underlying Germany's energy transition and experience the energy transition as a project that ties together social, technical, and political issues and requires collaborative leadership across those divisions. To register for this course, students must have been accepted and confirmed into this study abroad program.",
    "prereq": []
  },
  {
    "uid": "826861",
    "code": "CFAN3533",
    "subject": "CFAN",
    "number": "3533",
    "honors": false,
    "writingIntensive": false,
    "name": "Indigenous Knowledge - Belize",
    "fullname": "Indigenous Knowledge: Exploring its value in agriculture, education, and community - Belize",
    "info": "This course provides students an opportunity to gain insight into the intellectual and cultural traditions of Indigenous peoples. Students will be given the opportunity to learn more about the indigenous/traditional practices in communities to better adapt global knowledge to local conditions and to develop knowledge and dispositions to build understanding and respect for Indigenous ways of knowing and tribal sovereignty in classrooms and schools locally and globally. This course will include an introductory immersion experience to Belize to explore formal and non-formal education about agriculture through indigenous populations with multilingual cultures.",
    "prereq": []
  },
  {
    "uid": "826939",
    "code": "CFAN3534",
    "subject": "CFAN",
    "number": "3534",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Resilience in Ag",
    "fullname": "Climate Resilience in Agriculture: Exploring Diverse Regions and Empowering Youth in Morocco",
    "info": "This course explores agricultural systems in geographically diverse regions of Morocco, the impacts of water scarcity on food production and society and approaches to mitigating and adapting to climate change. Morocco lies in the northwest corner of the African continent. It occupies a land area roughly equal to that of the state of Texas. Despite its relatively small size, Morocco stands out for its notable role in the fight against climate change. Due to declining rainfall and an increase in the severity and frequency of drought in recent decades, the Moroccan government has taken a comprehensive approach to reducing negative impacts on its citizens and promoting climate resilience. Agriculture, which comprises nearly 15% of the GDP of the country and employs nearly 40% of the population, is an important target for these efforts. Food security and economic stability are tightly linked to water availability. We will explore how agricultural systems in different regions are adapting to increasing water scarcity using diverse approaches including modification of production practices and technology. We will also consider the critical involvement of youth in agriculture. Despite improvements in agricultural productivity in recent years, the future of Moroccan agriculture is uncertain. While climate change is a clear threat, diminishing interest in agriculture among Moroccan youth is a growing concern. Youth ages 15-26 years old comprise about 26% of the country's population. Migration of youth from rural areas, especially in the mountain and dry-land regions, has accelerated in recent years largely due to increasing water scarcity and economic hardship. This represents the loss of human capacity in rural areas, increasing stress on resources in urban areas and the potential for growing social unrest. We will speak with community groups, organizations that work with young Moroccans and with young people themselves to understand the challenges they face and to learn about education and training efforts to promote youth participation in the agricultural economy. In addition to learning about the unique agricultural systems of Morocco, students in this course will gain appreciation for the history, culture, and traditions of the country. For more than five thousand years, Morocco has been the stage for cultural and economic exchange between Northern and sub-Saharan Africa, Asia, and Western Europe. Its modern culture is a beautiful and fascinating blend of Berber, Arab, Jewish, and Western European influences. This program involves pre-departure, in-country, and post-return activities and assignments. Pre-departure work will acquaint you with the country and culture of Morocco and introduce concepts that we will use throughout the program. In Morocco, you will experience the people, culture, and agriculture first hand. You will attend lectures, visit farms, converse with producers, meet with leaders of agricultural cooperatives and business owners and interact with Moroccan youth and leaders of organizations who work with youth. You will work independently and with a group to collect and interpret information and prepare presentations. We will visit historical and cultural sites of interest, interact with the people, and enjoy Moroccan cuisine. These experiences will provide rich opportunities for reflection and journal writing. Upon return to the U.S., you will finish the final reflection and complete the course survey.  ",
    "prereq": []
  },
  {
    "uid": "810848",
    "code": "CFAN3840",
    "subject": "CFAN",
    "number": "3840",
    "honors": false,
    "writingIntensive": false,
    "name": "Nepal: Language & Culture",
    "fullname": "Nepal: Language, Rural Society and Natural History",
    "info": "First course in 5 course (16 credit) semester series. Introduction to Nepali language/rural culture under guidance of Dr. Narayan Kaji Shrestha. Survey of biodiversity in lowlands of Nepal conducted by Dr. J.L. David Smith.",
    "prereq": []
  },
  {
    "uid": "794972",
    "code": "CFAN3900",
    "subject": "CFAN",
    "number": "3900",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Int'l Agriculture",
    "fullname": "Topics in International Agriculture",
    "info": "International, on-site, classroom, and field-study of agricultural systems. Sites vary. Can include language study.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "819902",
    "code": "CFAN4096",
    "subject": "CFAN",
    "number": "4096",
    "honors": false,
    "writingIntensive": false,
    "name": "Reflecting on Your Prof Exp",
    "fullname": "Reflecting on Your Professional Experience",
    "info": "This course is designed to meet the CFANS Experiential Learning requirement which defines the importance and processes of learning through experience. Students will undertake an experience in an authentic work-place setting related to agriculture, food or natural resource settings as a prerequisite to the course. The prerequisite experience will serve as a foundation for learning professional competencies including reflection, problem solving, managing interpersonal relationships, professional communication, and goal setting. Current theories of career development will be introduced to help students construct meaning from their experiences to inform future goals and strategies. prereq: Secured internship, completion of summer module, instr consent",
    "prereq": []
  },
  {
    "uid": "796314",
    "code": "CFAN5000",
    "subject": "CFAN",
    "number": "5000",
    "honors": false,
    "writingIntensive": false,
    "name": "Special topics K-12 Educators",
    "fullname": "Special topics for K-12 Educators: Agricultural, Food, and Environmental Sciences and Technologies",
    "info": "Students engage in instruction and applications that lead to new understandings, techniques, and materials for teaching about the science, technology and utilization of plants, animals, foods, natural resources, and the environment for the benefit of society and our ecosystems.",
    "prereq": []
  },
  {
    "uid": "806460",
    "code": "CFAN5201",
    "subject": "CFAN",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "JobSearchPrep for GradStdnts",
    "fullname": "Career and Job Search Preparation for Graduate Students",
    "info": "Job search and career development tools. Goals, networking, job search, resume/CV, interviewing. Assignments include resume/CV, informational interview, career development plan.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "810998",
    "code": "CFAN5480",
    "subject": "CFAN",
    "number": "5480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in CFANS",
    "fullname": "Topics in CFANS",
    "info": "Lectures by visiting scholar(s) or regular faculty member. Topics specified in Class Schedule.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "800639",
    "code": "CFAN5500",
    "subject": "CFAN",
    "number": "5500",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Field Studies Seminar",
    "fullname": "International Field Studies Seminar",
    "info": "Interface of agriculture with natural resource, environmental, economic, food safety, public policy, ethical issues transcending national borders. Seminars take place in various countries/regions. Active learning, lectures, discussion tutorials, field trips, reports, exams.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "809286",
    "code": "CFAN5501",
    "subject": "CFAN",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Costa Rica-Sustainable Dvlpmt",
    "fullname": "Costa Rica--Sustainable Development",
    "info": "Costa Rica's development strategy.  Agriculture, tourism, energy, urbanization. Synergies/tension between economic, social, environmental impacts. How organizations maximize benefits associated with sustainable development.prereq: grad student, instr consent",
    "prereq": []
  },
  {
    "uid": "817857",
    "code": "CFAN5518",
    "subject": "CFAN",
    "number": "5518",
    "honors": false,
    "writingIntensive": false,
    "name": "Env'l Issues in New Zealand",
    "fullname": "Environmental Issues in New Zealand",
    "info": "This Global Seminar, Environmental Issues in New Zealand, is open to any undergraduate or graduate students regardless of major. Priority for enrollment is given to University of Minnesota students, but students from other institutions may attend if space is available. There are no course prerequisites and all instruction is in English. New Zealand is a modern country with friendly people and awesome scenery.Our daily news is filled with reports on climate change, water scarcity and pollution, soaring energy costs, and food shortages.   Solutions must consider environmental, economic, and social implications of our management strategies. Frequently there are tradeoffs between benefits and costs. University students as future leaders of business, government, and social programs should understand how to analyze environmental issues. What are the issues? Who is affected? What alternatives exist to solve them? What are the environmental, economic, and social tradeoffs between these alternatives? What are reliable sources of information? How can each of us contribute to solutions?New Zealand has undergone significant changes in its plant and animal composition following the invasion of humans and the exotic species they introduced. Alarmed by these changes, New Zealanders recently have made significant strides in recognizing environmental issues and seeking sustainable solutions. They offer valuable lessons for U.S. students to bring home and apply to our own environmental issues.",
    "prereq": []
  },
  {
    "uid": "818456",
    "code": "CFAN5519",
    "subject": "CFAN",
    "number": "5519",
    "honors": false,
    "writingIntensive": false,
    "name": "Bali: Water and Culture",
    "fullname": "Bali: Water and Culture from Rainforests to Reefs",
    "info": "Travel to Bali, Indonesia as part of a Global Seminarto explore how culture and beliefs influence our relationship with water and the environment. Through field and cultural excursions and site visits, lectures, and personal observation and study, students will cultivate an awareness of their relationship to the natural world as influenced by their own culture and belief system.",
    "prereq": []
  },
  {
    "uid": "818679",
    "code": "CFAN5532",
    "subject": "CFAN",
    "number": "5532",
    "honors": false,
    "writingIntensive": false,
    "name": "Germany: Renewable Energy",
    "fullname": "Germany: Leading the Renewables Revolution",
    "info": "CFAN 3532/CFAN 5532 is part of an ongoing high-level energy and sustainability exchange with Germany. Participants in the student delegation are citizen ambassadors for the USA and Minnesota and represent the next generation of Midwest leaders. They will understand the systems approach underlying Germany's energy transition and experience the energy transition as a project that ties together social, technical, and political issues and requires collaborative leadership across those divisions. To register for this course, students must have been accepted and confirmed into this study abroad program.",
    "prereq": []
  },
  {
    "uid": "818151",
    "code": "CFAN8101",
    "subject": "CFAN",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Skills",
    "fullname": "Professional Skills for Scientists",
    "info": "Presentations, discussions, and exercises in leading people and in managing money, time, operations, and projects within the context of research and development in the food, agricultural, and natural resource sciences.",
    "prereq": []
  }
]