[
  {
    "uid": "790975",
    "code": "CHMB5800",
    "subject": "CHMB",
    "number": "5800",
    "honors": false,
    "writingIntensive": false,
    "name": "Organizational Behavior",
    "fullname": "Organizational Behavior",
    "info": "Theories/frameworks for analyzing behavior of individuals, groups, and the organization itself. Emphasizes making decisions and developing action plans that enable managers to provide effective leadership. Personnel selection, reward/compensation systems, collective bargaining.",
    "prereq": []
  },
  {
    "uid": "790976",
    "code": "CHMB5801",
    "subject": "CHMB",
    "number": "5801",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Accounting",
    "fullname": "Financial Accounting",
    "info": "External accounting system used by firms to measure their economic performance and financial position. Students analyze corporate financial reports to discover impact of significant economic events. Rise of financial reporting standards and financial intermediaries in efficient allocation of capital in a modern economy. Discussions, cases.",
    "prereq": []
  },
  {
    "uid": "790977",
    "code": "CHMB5802",
    "subject": "CHMB",
    "number": "5802",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Analysis &Decision Making",
    "fullname": "Data Analysis and Decision Making",
    "info": "Exploratory data analysis, basic inferential procedures, statistical process control, regression analysis.",
    "prereq": []
  },
  {
    "uid": "790978",
    "code": "CHMB5803",
    "subject": "CHMB",
    "number": "5803",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain & Operations",
    "fullname": "Supply Chain & Operations",
    "info": "How to manage operations function in manufacturing/service organizations. Emphasizes strategic impact of operations decisions. Operations strategy, process design, productivity improvement, quality management, business process re-engineering, service quality, forecasting, demand management, inventory management, production planning, project management, scheduling, supply chain management, international operations management.",
    "prereq": []
  },
  {
    "uid": "790979",
    "code": "CHMB5804",
    "subject": "CHMB",
    "number": "5804",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Accounting",
    "fullname": "Managerial Accounting",
    "info": "How to analyze accounting for use in management decisions. Planning and control. Transfer pricing, performance measurements, cost behavior, cost allocation, activity based costing, standard costs.",
    "prereq": []
  },
  {
    "uid": "790981",
    "code": "CHMB5805",
    "subject": "CHMB",
    "number": "5805",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Management",
    "fullname": "Financial Management",
    "info": "Theory/practice of finance from analytical approach. Students apply basic financial concepts of risk, return, and valuation to decisions that a corporate financial officer or person engaged in small business must make about sources/uses of funds during changing financial markets.",
    "prereq": []
  },
  {
    "uid": "790989",
    "code": "CHMB5806",
    "subject": "CHMB",
    "number": "5806",
    "honors": false,
    "writingIntensive": false,
    "name": "Marketing Management",
    "fullname": "Marketing Management",
    "info": "Developing/implementing most appropriate combination of variables to carry out a firm's strategy in its target markets. Applying analytic perspectives, concepts, and decision tools of marketing to decisions in product offering, distribution, pricing, and communication.",
    "prereq": []
  },
  {
    "uid": "790990",
    "code": "CHMB5807",
    "subject": "CHMB",
    "number": "5807",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Management",
    "fullname": "Strategic Management",
    "info": "Formulating strategy for an enterprise. Shaping mission, product-market choice, and organizational character. Shaping allocation of resources to meet organiational circumstances and conflicting stockholder interests. Situational analysis, strategy development. Written/oral presentation of strategic analyses/recommendations.",
    "prereq": []
  },
  {
    "uid": "790991",
    "code": "CHMB5808",
    "subject": "CHMB",
    "number": "5808",
    "honors": false,
    "writingIntensive": false,
    "name": "Pricing in a Digital Economy",
    "fullname": "Pricing in a Digital Economy",
    "info": "The purpose of this course is to present a framework that can help you handle these pricing challenges, or \"moments of truth,\" more effectively throughout your business career. The framework is structured around marketing's 5C's: Customer, Company, Competition, Context and Collaborators. For each of these C's we discuss issues unique to pricing. From a customer perspective, we study such issues as economic value, price sensitivity, price perceptions, and fairness. From a company perspective, we study such issues as costs, profitability, and capabilities. From a competitive perspective, we study such issues as price wars and price leadership. We also discuss the role of collaborators, including channels of distribution, government, and the media all while considering the context in which the firm operates. Along the way, we'll study pricing in a variety of settings, including digital domains, business-to-business markets, consumer packaged goods, medical industry, new products, etc.",
    "prereq": []
  },
  {
    "uid": "790992",
    "code": "CHMB5809",
    "subject": "CHMB",
    "number": "5809",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Financial Mgmt & FinTech",
    "fullname": "Advanced Financial Management and FinTech",
    "info": "Executive level corporate financial policy. Students are challenged to apply basic principles of finance on their own initiative. Rigorous case-oriented approach.",
    "prereq": []
  },
  {
    "uid": "790993",
    "code": "CHMB5810",
    "subject": "CHMB",
    "number": "5810",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Environment",
    "fullname": "International Environment",
    "info": "How to develop an integrative framework for dealing with international activities of a newly exporting company or a full-fledged multinational. How international environment constrains decision-making, how currency prices are determined, and how to manage exchange risk in coordination with strategic choices of the firm.prereq: China Executive MBA student",
    "prereq": []
  },
  {
    "uid": "790994",
    "code": "CHMB5811",
    "subject": "CHMB",
    "number": "5811",
    "honors": false,
    "writingIntensive": false,
    "name": "IT Management",
    "fullname": "IT Management and Digital Transformation",
    "info": "Managing information resources/technology. Students gain exposure to various information technologies, examine their applications, explore competitive advantages associated with information technology, and address organizational/managerial implications.",
    "prereq": []
  },
  {
    "uid": "790995",
    "code": "CHMB5812",
    "subject": "CHMB",
    "number": "5812",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Issues",
    "fullname": "Critical Issues Residency",
    "info": "Examples of issues are managing conflict, negotiation, business law, and corporate communications. Two-day intensive and experientially based course.",
    "prereq": []
  },
  {
    "uid": "790996",
    "code": "CHMB5813",
    "subject": "CHMB",
    "number": "5813",
    "honors": false,
    "writingIntensive": false,
    "name": "Corp Responsibility & Ethics",
    "fullname": "Corporate Responsibility & Ethics",
    "info": "Role that ethics can play in corporate strategy. Key concepts include stakeholder management, individual/collective responsibility, and international business ethics. Theoretical considerations applied to issues such as a business's responsibility to the environment, truthful/tasteful advertising, obligations to local community, and managing a diverse workforce.",
    "prereq": []
  },
  {
    "uid": "790997",
    "code": "CHMB5814",
    "subject": "CHMB",
    "number": "5814",
    "honors": false,
    "writingIntensive": false,
    "name": "Bus, Govt & Macroecon",
    "fullname": "Business, Government, and Macroeconomics",
    "info": "Analyzing major economic events, predicting their ramifications. Changes in monetary/fiscal policies, unemployment, international financial markets, country risk, financial crises. Implications of macroeconomic policies and global trends for economic growth. Topics are presented within an integrated conceptual framework and are supported by experiences of the U.S., Europe, Japan, and evelopeing countries.",
    "prereq": []
  },
  {
    "uid": "790998",
    "code": "CHMB5815",
    "subject": "CHMB",
    "number": "5815",
    "honors": false,
    "writingIntensive": false,
    "name": "Talent, Leadership & Culture",
    "fullname": "Talent, Leadership & Culture",
    "info": "Topics reflect the strengths, talents, and interests of the class. Integrates different aspects of the curriculum while not being limited by a specific area or paradigm.",
    "prereq": []
  },
  {
    "uid": "790999",
    "code": "CHMB5816",
    "subject": "CHMB",
    "number": "5816",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Residency",
    "fullname": "International Residency",
    "info": "Students travel to an international location for 11 days and engage in discussions with international colleagues, apply program concepts, and develop a broader sensitivity to cultural/social differences. Pre-trip preparation, on-site discussion, and trip assignment are required.",
    "prereq": []
  },
  {
    "uid": "807400",
    "code": "CHMB5817",
    "subject": "CHMB",
    "number": "5817",
    "honors": false,
    "writingIntensive": false,
    "name": "China: Intg into the World",
    "fullname": "China: Integrating into the World",
    "info": "Focusing on China's economy, this course is designed as a required course for all China Executive MBA students.",
    "prereq": []
  },
  {
    "uid": "808177",
    "code": "CHMB5818",
    "subject": "CHMB",
    "number": "5818",
    "honors": false,
    "writingIntensive": false,
    "name": "Law for Business",
    "fullname": "Law for Business",
    "info": "Legal/regulatory environment of business operations in China.",
    "prereq": []
  }
]