[
  {
    "uid": "005438",
    "code": "CI1001",
    "subject": "CI",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Elementary School",
    "fullname": "Introduction to the Elementary School",
    "info": "CI 1001 is intended to be a beginning course for undergraduate students considering a career in the field of education or a Foundations of Elementary Education major.  The class examines various aspects of elementary schools and elementary teaching (past and present), including school organization, students and families, standards, assessment, policy, culture and diversity, and the role of the teacher. ",
    "prereq": []
  },
  {
    "uid": "815980",
    "code": "CI1032",
    "subject": "CI",
    "number": "1032",
    "honors": false,
    "writingIntensive": false,
    "name": "Learning In & Through the Arts",
    "fullname": "Creating Identities: Learning In and Through the Arts",
    "info": "“Creating Identities: Learning In and Through the Arts” gives you opportunities to create art in different mediums including storytelling, photomontage, movement, as well as a creative medium of your choice in order to reflect your understanding of a social justice issue. In CI 1032 you join a learning community for discussing, analyzing, and making meaning of this artistic production. No prior experience is needed; come with an open mind and imagination as well as a willingness to experiment. An important emphasis in the class will be on finding your own ways to transform ordinary materials. We will introduce you to specific artistic techniques and in turn you will learn to take creative risks, think metaphorically, explore the unknown, improvise, brainstorm, and invent your own methods of working. Each of you bring to the class different kinds of knowledge and abilities. To be successful in this course you need to be willing to work hard, to explore territory that may not be familiar to you, to be reflective about what you are doing, and to learn from your diverse classmates and in turn help them achieve the same goals. The instructors of “Creating Identities: Learning In and Through the Arts” shape the course with the assumption that identity is at the heart of educational experiences and that the habits of mind associated with the artistic production are primary vehicles for multimodal learning. We will experience how arts-based learning engenders higher order thinking, the creative process, reflection and perseverance. This course gives you the opportunity to both produce as well as analyze art in order to experience how creative expressions reveal aspects of our personal and social identities that have an impact on how we learn. Through mediums including photography, film, performance, music, painting and sculpture, we will explore how artists are influenced by cultural elements such as the built and natural environments, gender, religion, nationality, and socioeconomic status, and how artists, in turn, shape our perceptions of culture and identity. Through writing and discussion, we will consider how the arts can both reflect and impact our perceptions of identity and our reflections of ourselves as learners. As you move further into your academic studies and your career, you will intersect with people from differing cultures and places. The work in this class will help you become more comfortable with and welcome the benefits that come with intercultural learning. Interactions with classmates and cultural production of indigenous, immigrant, international and Western artists, allows you to have a greater understanding of, appreciation for and acceptance of the ways of knowing a variety of cultures can provide, and the confidence that you can reciprocate in kind.",
    "prereq": []
  },
  {
    "uid": "815571",
    "code": "CI1121",
    "subject": "CI",
    "number": "1121",
    "honors": false,
    "writingIntensive": false,
    "name": "Education: Past and Present",
    "fullname": "Educational Movements Past and Present: Multicultural Perspectives",
    "info": "Students will explore diverse historical perspectives regarding educational movements in the U.S. since the Civil War. Through challenging questions and problems in educational history, students will develop critical frameworks necessary for interpreting Americas educational past and how it is tied to culture, politics, privilege, and power.",
    "prereq": []
  },
  {
    "uid": "816043",
    "code": "CI1124",
    "subject": "CI",
    "number": "1124",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Stories of Education",
    "fullname": "Global Stories of Education: Literature for Young Adults",
    "info": "Using young adult novels, short stories, nonfiction, and poems by immigrant, indigenous, minority, and refugee authors, students explore learning experiences of youth. Through immersion in the global lives and identities of characters who cross geographic and cultural borders, students consider what stories teach and how young people learn.",
    "prereq": []
  },
  {
    "uid": "815875",
    "code": "CI1150",
    "subject": "CI",
    "number": "1150",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics History",
    "fullname": "Special Topics History",
    "info": "History topics in education.",
    "prereq": []
  },
  {
    "uid": "007872",
    "code": "CI1512",
    "subject": "CI",
    "number": "1512",
    "honors": false,
    "writingIntensive": false,
    "name": "Nature in the City",
    "fullname": "Nature in the City",
    "info": "Science and conservation of biodiversity in the Twin Cities. Ecology and evolution of species and communities adapted to urban environments. Socially responsible and culturally sensitive interventions to environmental problems.",
    "prereq": []
  },
  {
    "uid": "007963",
    "code": "CI1563",
    "subject": "CI",
    "number": "1563",
    "honors": false,
    "writingIntensive": false,
    "name": "Physics by Inquiry",
    "fullname": "Physics by Inquiry",
    "info": "Laboratory-based introductory class where students learn by experimenting and model building and testing. Topics include electric circuits, light and color, and observational astronomy. Emphases include the nature of science and science learning, effective strategies for team-based learning, and logical reasoning skills.",
    "prereq": []
  },
  {
    "uid": "802055",
    "code": "CI1806",
    "subject": "CI",
    "number": "1806",
    "honors": false,
    "writingIntensive": false,
    "name": "College Algebra through Models",
    "fullname": "College Algebra through Modeling",
    "info": "Math modeling, including linear, polynomial, rational, exponential, logarithmic functions, counting/probability. Excel or calculators used to develop equations/graphs from theoretical/real interdisciplinary data. Projects enable students to use models to examine trends, make predictions.For a student to be successful, we strongly recommend a background of: Three yrs high school math or grade of at least C+ in PsTL 0731 or PsTL 0732 or placement test score or instr consent.",
    "prereq": []
  },
  {
    "uid": "817385",
    "code": "CI1826",
    "subject": "CI",
    "number": "1826",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Change, Social Justice",
    "fullname": "Social Change, Social Justice: An Introduction to Applied Calculus",
    "info": "This class is an introduction to differential calculus: instantaneous rates of change, derivative graphs and formulas, multivariate scenarios, partial derivatives, and integration. Applications focus on analyzing change in social science scenarios such as gentrification and racial disparities in housing using authentic Minnesota data.For students to be successful, we strongly recommend a background of: four years high school math OR grade of at least B+ in PSTL 0732 OR placement test score OR instructor consent. ",
    "prereq": []
  },
  {
    "uid": "003702",
    "code": "CI1871",
    "subject": "CI",
    "number": "1871",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Literacy",
    "fullname": "Computer Literacy and Problem Solving",
    "info": "Competencies in computer applications used in the social sciences and business to solve problems. Using advanced word processing techniques to create complex documents, electronic spreadsheets to analyze data and present it graphically, database management programs to store, organize, and query data, and presentation software to communicate ideas.",
    "prereq": []
  },
  {
    "uid": "808044",
    "code": "CI1902",
    "subject": "CI",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar: Diversity",
    "fullname": "Freshman Seminar: Diversity and Social Justice in the United States",
    "info": "Reading, discussion, critical analysis, and writing about diversity and social justice in the United States.",
    "prereq": []
  },
  {
    "uid": "801731",
    "code": "CI1903",
    "subject": "CI",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "FreshmanSeminar,CivcLife&Ethic",
    "fullname": "Freshman Seminar: Citizenship and Public Ethics",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "814264",
    "code": "CI1904",
    "subject": "CI",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Picturebooks & Graphic Novels",
    "fullname": "Picturebooks and Graphic Novels",
    "info": "This course will explore two formats of contemporary children's literature, picturebooks and graphic novels, as especially conducive to the development of young people's visual literacy. In a multimedia world, where the image has become a major tool of communication, visual literacy has become more relevant than ever before. This awareness is reflected in the meteoric rise of picturebooks and graphic novels - two key formats of sequential art, which we'll examine for their similarities and differences, their uses, and contemporary significance. Our focus will be on the image/word interaction, the complexity of pictorial reading/storytelling, the thematic scope and artistic techniques, and the historical overview of different approaches to visual narratives around the world. You'll be expected to read a variety of global and multicultural picturebooks and graphic novels accompanied by critical and theoretical readings. To facilitate your practical understanding of visual narratives you?ll complete several written assignments, including producing, analyzing, and revising a picture project and sequential art project. Working in groups, you'll present the results of research into picturebooks and graphic novels within your own area of interest. The structure of class discussions and projects will help you become an active thinker about complexity, diversity, and change in the global world as well as within the field of children's and young adult literature.",
    "prereq": []
  },
  {
    "uid": "808386",
    "code": "CI1905",
    "subject": "CI",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Reading, discussion, writing, critical analysis. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "800690",
    "code": "CI1908W",
    "subject": "CI",
    "number": "1908",
    "honors": false,
    "writingIntensive": true,
    "name": "Animal Tales: Children's Lit",
    "fullname": "Children and Other Talking Animals: Animal Tales in (Mostly) Children's Literature",
    "info": "Humans and animals coexisted for millennia until humanity exiled itself from nature in order to rule it. In this course we look at the tradition of animal tales as the never-entirely-suppressed memory of this kinship and a hope for our future. We explore how animal tales have been used through the ages to reflect diverse ethical conceptualizations of the human relationship with animals and the natural world. We study the connections between children and/as talking animals. We read a range of animal tales and consider their meanings for the environmentally threatened global world. ",
    "prereq": []
  },
  {
    "uid": "806827",
    "code": "CI1910W",
    "subject": "CI",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Fresh Sem, Writing Intensive",
    "fullname": "Freshman Seminar, Writing Intensive",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "790635",
    "code": "CI1911",
    "subject": "CI",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics, Wealth, Educ in Democ",
    "fullname": "Ethics, Wealth, and Education in a Democracy",
    "info": "Relationship between democratic citizenship and education. Role of economics/ethics in defining character of education. Relationship between school/university programs and citizenship. Relevance of education in contemporary society.",
    "prereq": []
  },
  {
    "uid": "808128",
    "code": "CI1942",
    "subject": "CI",
    "number": "1942",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Media: Changing Interac",
    "fullname": "Social Media & the Changing Nature of Interaction",
    "info": "This seminar is designed to educate learners about the current impact of social media, particularly those most often used today, and those which could potentially arise with future developments and innovations. A humanitarian perspective will provide the lens by which we will examine universal utility and explore strategies and measures we can take as individuals and community members to leverage their potential for forming connections and interacting as global citizens. ",
    "prereq": []
  },
  {
    "uid": "817303",
    "code": "CI1943W",
    "subject": "CI",
    "number": "1943",
    "honors": false,
    "writingIntensive": true,
    "name": "Science, Technology, Society",
    "fullname": "Science, Technology, and Society",
    "info": "Why and how do science and engineering and technologies generate inequities, control over resources, and impact on economy and culture? Is any development that's good for business also good for science? How do national politics influence what kind of science gets done and what technology gets developed? How do humans experience the value of science and technology or not? This course focuses on engaging students in these and similar other questions to understand the integral relationships between science, technology, and society. This course will introduce students to foundational concepts, themes, and questions developed within the interdisciplinary field of STS (science, technology, and society). For example, we will attempt to understand the relationships between two areas of science content (genes and genetics and nuclear energy), engineering and technology (CRISPR-Cas9 technology and atomic bomb), and society by exploring the experienced and potential benefits and harm of these developments. The readings allow learners to engage with science content as well as sociological and anthropological understandings of science practices; sociological and political perspectives on technological and scientific (techno-scientific) controversies; cultural, social, and philosophical relationships between technology, science, and humans; and politics of negotiations between scientific experts and the public and public policies.",
    "prereq": []
  },
  {
    "uid": "813936",
    "code": "CI2110",
    "subject": "CI",
    "number": "2110",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Education",
    "fullname": "Topics in Education",
    "info": "Topics related specifically to Education. Topics, location, credits, and duration may be highly flexible.",
    "prereq": []
  },
  {
    "uid": "002445",
    "code": "CI2311W",
    "subject": "CI",
    "number": "2311",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro:Technol&Ethics inSociety",
    "fullname": "Introduction to Technology and Ethics in Society",
    "info": "Values and ethical issues related to technology use in education, workplace, and family/community life.",
    "prereq": []
  },
  {
    "uid": "804860",
    "code": "CI2312",
    "subject": "CI",
    "number": "2312",
    "honors": false,
    "writingIntensive": false,
    "name": "Sex, Drugs, and the Internet",
    "fullname": "Sex, Drugs, and the Internet: Educational Perspectives",
    "info": "Immersive exploration/critique of advantages/risks associated with society's pervasive use of the Internet. Dangers and strategies to combat them. The Internet's potential for teaching/learning.",
    "prereq": []
  },
  {
    "uid": "005078",
    "code": "CI3001",
    "subject": "CI",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Engaged Arts Learning",
    "fullname": "Engaged Arts Learning in Elementary Classrooms",
    "info": "Introduction to pictorial expression, design, and the function of art in the social environment.",
    "prereq": []
  },
  {
    "uid": "797761",
    "code": "CI3002",
    "subject": "CI",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Secondary Schools",
    "fullname": "Introduction to Secondary Schools",
    "info": "Culture of teaching, student learning, community contexts for learning, and societal influences on teaching/schools.  Students visit different types of schools and volunteer in area schools or educational organizations.",
    "prereq": []
  },
  {
    "uid": "816510",
    "code": "CI3101",
    "subject": "CI",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in Urban Education",
    "fullname": "Issues in Urban Education",
    "info": "Issues in urban education examines and critiques contemporary commentary on urban education through texts, social media, case studies, and service-learning in schools. Through examination of socio-cultural and socio-political contexts of urban education, this course considers the role of teachers, curriculum, and community in urban schooling.",
    "prereq": []
  },
  {
    "uid": "804776",
    "code": "CI3150",
    "subject": "CI",
    "number": "3150",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics: Educ & Society",
    "fullname": "Special Topics: Education and Society",
    "info": "Special topics, current trends regarding education and society.",
    "prereq": []
  },
  {
    "uid": "808438",
    "code": "CI3151W",
    "subject": "CI",
    "number": "3151",
    "honors": false,
    "writingIntensive": true,
    "name": "Culture, Power and Ed",
    "fullname": "Culture, Power, and Education",
    "info": "Ways in which culture plays a critical role in education and student achievement. How and educator's culture and their students' cultures impact student learning. Focuses on social justice.",
    "prereq": []
  },
  {
    "uid": "804041",
    "code": "CI3211",
    "subject": "CI",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Elementary Teaching",
    "fullname": "Introduction to Elementary Teaching",
    "info": "Classroom management, instructional planning, working with families in elementary classroom. Assigned readings, lectures, classroom activities, assignments.prereq: [Elementary ed or early childhood ed foundations major], concurrent practicum experience",
    "prereq": []
  },
  {
    "uid": "803405",
    "code": "CI3212",
    "subject": "CI",
    "number": "3212",
    "honors": false,
    "writingIntensive": false,
    "name": "Elementary Teaching",
    "fullname": "Field Experience: Elementary Teaching",
    "info": "Field-based experience. Students apply learning from their University courses to elementary school setting, connecting theory, research, and practice.prereq: concurrent registration is required in CI 3211, [elementary education foundations or early childhood foundations] major",
    "prereq": {
      "code": "CI 3211",
      "subject": "CI",
      "id": "3211"
    }
  },
  {
    "uid": "803429",
    "code": "CI3283",
    "subject": "CI",
    "number": "3283",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Experience in Special Ed",
    "fullname": "Field Experience in Special Education",
    "info": "Field-based experience. Students apply learning from their university course in elementary school setting, linking theory, research, and practice.prereq: concurrent registration is required in EDPSY 5613 or EDPSY 5616, elementary education: foundations major",
    "prereq": {
      "or": [
        {
          "code": "CI 5613",
          "subject": "CI",
          "id": "5613"
        },
        {
          "code": "CI 5616",
          "subject": "CI",
          "id": "5616"
        }
      ]
    }
  },
  {
    "uid": "818251",
    "code": "CI3342",
    "subject": "CI",
    "number": "3342",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Media Learning",
    "fullname": "Social Media & Connected Learning",
    "info": "This course investigates current and potential future impacts of social media using connected learning (Ito) and participatory culture (Jenkins) as a theoretical lens to understand the ways in which it can be used for education. Connected learning focuses on learning \"pathways\" that move across formal and informal settings to transform the very nature of learning - what it means, how it occurs, and where it takes place. In addition to gaining a philosophical understanding of participatory practices in spaces of connected learning, students will develop conceptual and practical expertise in using social media applications and social networking platforms for learning, creative expression, forming connections, and interacting as global citizens. The overarching aim of this course is to help students become critical consumers and ethical producers of new media in various forms for learning purposes. A balanced analysis and critique of both the affordances and the challenges associated with social media use as a tool for learning will be an essential component of the course and will frame each social media application and network that is explored and authentically integrated into the course. An examination of social media practices and influences will include their use in both formal education as well as informal learning contexts.",
    "prereq": []
  },
  {
    "uid": "005147",
    "code": "CI3401W",
    "subject": "CI",
    "number": "3401",
    "honors": false,
    "writingIntensive": true,
    "name": "Diversity in Children's Lit",
    "fullname": "Diversity in Children's Literature",
    "info": "Classic/contemporary books for children in all genres, created by authors/illustrators. Research in transactional theory. Cultural authenticity. Reading, discussion, group activities, interactive lectures, projects.",
    "prereq": []
  },
  {
    "uid": "817976",
    "code": "CI3421W",
    "subject": "CI",
    "number": "3421",
    "honors": false,
    "writingIntensive": true,
    "name": "Writing on Education",
    "fullname": "Writing on Education: Pivotal Experiences of Teaching and Learning",
    "info": "Reflection and narrative play important roles in developing deep understanding of teaching and learning. In this course students will read and write texts about critical moments of education, and through this work develop reflective, analytic, and writing skills that will enable them to become more thoughtful and effective citizens in the world of education. Whether students hope to become teachers, youth workers, community organizers, curriculum designers or administrators in educational settings, this course invites students to consider how writers represent experiences of teaching and learning and how these reflective narratives can inform our own work and worlds. Students will explore the ways that writers of creative nonfiction use language to examine pivotal experiences of teaching and learning in diverse contexts, and add their own voices to this rich body of work by producing their own texts. Through study of writing, students will develop familiarity with writing choices and practice employing these techniques and processes in their own writing. Students will read personal essays written by writers in the US who reflect on their own experiences and interrogate how aspects of their identities (including race, ethnicity, gender, family history and language) inform pivotal experiences of teaching and learning. Students will compose texts that explore their own experiences within a constellation of formal and informal educational settings and the questions raised and arguments made through these representations. We will use a workshop-based format that supports transformational learning, helping writers see themselves and their worlds in new ways. Course reading will introduce a range of issues raised by experiences in and outside of the classroom.",
    "prereq": []
  },
  {
    "uid": "806952",
    "code": "CI3610",
    "subject": "CI",
    "number": "3610",
    "honors": false,
    "writingIntensive": false,
    "name": "Linguistics for Teachers",
    "fullname": "Linguistics for Teachers",
    "info": "For pre K-6 pre-service teachers. Introduction to linguistics. Linguistic terminology and how to apply methods of linguistic analysis to English, focusing on educational settings and classroom instruction.",
    "prereq": []
  },
  {
    "uid": "810019",
    "code": "CI3611W",
    "subject": "CI",
    "number": "3611",
    "honors": false,
    "writingIntensive": true,
    "name": "Teaching ESL",
    "fullname": "Basics in Teaching English as a Second Language",
    "info": "Writing intensive course that combines service learning internship with classroom lectures, discussions, group work, and experiential activities. In this course, service learning requires students to act as teachers and professional leaders with students for 30 hours a semester. Prepares students for teaching ESL to adults in community programs.To be successful in this course, it is recommended for students to have studied another language.",
    "prereq": []
  },
  {
    "uid": "810022",
    "code": "CI3612",
    "subject": "CI",
    "number": "3612",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Grammar for ESL Teachers",
    "fullname": "Introduction to Pronunciation and Grammar for ESL Teachers",
    "info": "Introduces English language analysis with key concepts/theories in English pronunciation system/grammar.  Issues within each/explore way ESL textbooks/instructors can advance ESL learners' language proficiency in these areas.It is strongly recommended that students take an Introduction to Linguistics course, e.g., CI 3610 or LING 3001 prior to taking CI 3612",
    "prereq": []
  },
  {
    "uid": "810023",
    "code": "CI3613",
    "subject": "CI",
    "number": "3613",
    "honors": false,
    "writingIntensive": false,
    "name": "Intercultural Comm: Teaching",
    "fullname": "Intercultural Communication and English Language Teaching",
    "info": "Foundations of international/cross-cultural communication. Increased understanding of personal preferences/experiences in learning languages/using them in international communication. How these skills vary across individuals/contexts.",
    "prereq": []
  },
  {
    "uid": "807381",
    "code": "CI3660",
    "subject": "CI",
    "number": "3660",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics:  SLC",
    "fullname": "Special Topics in Second Languages and Cultures",
    "info": "Topic specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "001178",
    "code": "CI3901",
    "subject": "CI",
    "number": "3901",
    "honors": false,
    "writingIntensive": false,
    "name": "Exploring Teaching I",
    "fullname": "Exploring the Teaching Profession I",
    "info": "This course provides an avenue for participation in the College of Education and Human Development for undergraduate students who have identified teaching as a possible career choice and are accepted into the College’s DirecTrack to Teaching program. This course enables students to explore the history and culture of teaching, student learning, community contexts for learning, and sociocultural, historical, and political influences on teaching, learning, and schools. Students will participate in service learning experiences in area schools. They will attend class, make presentations, engage in online and in person analytical and reflective discussions, collaborate with peers and begin their journey towards becoming teachers.prereq: DirecTrack to Teaching program or department consent",
    "prereq": []
  },
  {
    "uid": "802415",
    "code": "CI3902",
    "subject": "CI",
    "number": "3902",
    "honors": false,
    "writingIntensive": false,
    "name": "Exploring Teaching II",
    "fullname": "Exploring the Teaching Profession II",
    "info": "Diversity in schools, strategies for increasing cultural competence. Parents, communities, professional development. Students reflect on themselves as future teachers and complete 50 hours in educational settings.prereq: CI 3901, admission to DirecTrack to Teaching or department consent",
    "prereq": {
      "code": "CI 3901",
      "subject": "CI",
      "id": "3901"
    }
  },
  {
    "uid": "818511",
    "code": "CI3993",
    "subject": "CI",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study: C&I",
    "fullname": "Directed Study: Curriculum and Instruction",
    "info": "Opportunity for students to pursue study not available through regular coursework. This is a student-initiated project created in consultation with a faculty monitor. In consultation with instructor, the student determines topic, sets goals, and develops a proposed project or plan for completing the course.Prereq instr consent.",
    "prereq": []
  },
  {
    "uid": "812109",
    "code": "CI4121",
    "subject": "CI",
    "number": "4121",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture Power and Education",
    "fullname": "Culture Power and Education",
    "info": "Manifestations of culture/power in education. How culture is mediating factor in educational achievement of students of color. Relationship between home/community, school cultures.  Theories/research that show importance of integrating students' interests, knowledge, experience for increasing student engagement/achievement.",
    "prereq": []
  },
  {
    "uid": "811699",
    "code": "CI4122",
    "subject": "CI",
    "number": "4122",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Class Ed  Pedagogy",
    "fullname": "Social Class Education and Pedagogy",
    "info": "Social, psychological, economic, political aspects of social class/poverty. Implications for education as social institution/classroom pedagogy. Social class in U.S., working-class literature for adults/children, labor histories, economic systems.",
    "prereq": []
  },
  {
    "uid": "003360",
    "code": "CI4311W",
    "subject": "CI",
    "number": "4311",
    "honors": false,
    "writingIntensive": true,
    "name": "Technology & Ethics in Society",
    "fullname": "Technology and Ethics in Society",
    "info": "Critique of values and ethical issues related to technology use in education, the workplace, and family and community life.",
    "prereq": []
  },
  {
    "uid": "804861",
    "code": "CI4312",
    "subject": "CI",
    "number": "4312",
    "honors": false,
    "writingIntensive": false,
    "name": "Sex, Drugs, and the Internet",
    "fullname": "Sex, Drugs, and the Internet: Educational Perspectives",
    "info": "Immersive exploration/critique of advantages/risks associated with society's pervasive use of the Internet. Dangers and strategies to combat them. The Internet's potential for teaching/learning.",
    "prereq": []
  },
  {
    "uid": "812869",
    "code": "CI4602",
    "subject": "CI",
    "number": "4602",
    "honors": false,
    "writingIntensive": false,
    "name": "English Learners",
    "fullname": "English Learners and Academic Language",
    "info": "The course prepares teacher candidates to work effectively with English Learners (ELs) and other linguistically diverse students in their subject areas of music and agricultural education and to develop their students' academic language proficiency as needed for school success. ",
    "prereq": []
  },
  {
    "uid": "005080",
    "code": "CI5008",
    "subject": "CI",
    "number": "5008",
    "honors": false,
    "writingIntensive": false,
    "name": "Theory/Prac of Arts Teaching",
    "fullname": "Theory and Practice of Arts Teaching",
    "info": "Designed for students pursuing visual or performing arts education licensure, the course explores: 1) Arts concepts, skills, and processes appropriate forelementary school; 2) methods of teaching arts for social justice; and 3) an overview of childrens production of and responses to visual and performing art.",
    "prereq": []
  },
  {
    "uid": "819131",
    "code": "CI5018",
    "subject": "CI",
    "number": "5018",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Dance",
    "fullname": "Teaching Dance",
    "info": "Teaching Dance considers the theoretical and curricular applications of dance pedagogy and assessment in PK‐12 dance learning contexts. Students will connect theory to practice by developing curriculum and instructional material from the field of dance education and professional teaching standards in dance education.prereq: Education graduate student or instructor consent",
    "prereq": []
  },
  {
    "uid": "005081",
    "code": "CI5045",
    "subject": "CI",
    "number": "5045",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Contemporary Crafts",
    "fullname": "Advanced Contemporary Crafts",
    "info": "In-depth experiences in craft techniques, including ceramics, fibers, jewelry, and metal design, with emphasis on design analysis, understanding of materials, and mastery of processes.",
    "prereq": []
  },
  {
    "uid": "005083",
    "code": "CI5049",
    "subject": "CI",
    "number": "5049",
    "honors": false,
    "writingIntensive": false,
    "name": "Arts Media Tech: Theory & Prac",
    "fullname": "Digital Media & Technology Integration: Arts Education Theory & Practice",
    "info": "This course explores issues in the visual and performing arts regarding the current and potential use of technology and digital media in P-12 arts classrooms. Through readings, discussions, artistic production, academic writing, and collaboration, you will understand the use and integration of technology in P-12 arts classrooms as pedagogical tools; the function of scaffolding students use of digital media as part of 21st century arts teaching and learning; various technological supports for student learning and artistic production; specific digital media theories, pedagogies, and content knowledge; the use of technology in designing, sharing, and conducting lessons; issues concerning the assessment and exhibition of student works; and practical issues of using technology for teaching in and through the arts.",
    "prereq": []
  },
  {
    "uid": "005091",
    "code": "CI5050",
    "subject": "CI",
    "number": "5050",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in Art Education",
    "fullname": "Issues in Art Education",
    "info": "Issues/trends, current practices, recent research.",
    "prereq": []
  },
  {
    "uid": "005085",
    "code": "CI5052",
    "subject": "CI",
    "number": "5052",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Art Therapy",
    "fullname": "Introduction to Art Therapy",
    "info": "History, current conceptions, and practices of art therapy.",
    "prereq": []
  },
  {
    "uid": "004398",
    "code": "CI5055",
    "subject": "CI",
    "number": "5055",
    "honors": false,
    "writingIntensive": false,
    "name": "Postmod Vis Culture/Global Ed",
    "fullname": "Postmodern Visual Culture and Global Education",
    "info": "Representations of knowledge.  Postmodern conditions of education and relationships to the influences of visual culture. Introduction to issues concerning the value and importance of visual imagery; influence of computer networking, mass communication, and other image sources.",
    "prereq": []
  },
  {
    "uid": "004400",
    "code": "CI5065",
    "subject": "CI",
    "number": "5065",
    "honors": false,
    "writingIntensive": false,
    "name": "Improving Arts in the Schools",
    "fullname": "Improving Arts Programs in the Schools",
    "info": "This course provides students with an exploration of issues in visual and performing art instruction, including teaching methods and evaluation, philosophical frameworks of pedagogy, and institutional issues concerning arts programs in middle and high schools; social and cultural structures of schooling, practical issues, and teaching arts.",
    "prereq": []
  },
  {
    "uid": "005092",
    "code": "CI5069",
    "subject": "CI",
    "number": "5069",
    "honors": false,
    "writingIntensive": false,
    "name": "Curriculum Innov in Arts Educ",
    "fullname": "Curriculum Innovations in Arts Education",
    "info": "This course provides students with an examination of traditions in American schooling related to visual and performing arts education curricula.",
    "prereq": []
  },
  {
    "uid": "004875",
    "code": "CI5075",
    "subject": "CI",
    "number": "5075",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc/Hist/Cultr Fndtns Art Educ",
    "fullname": "The Social, Historical and Cultural Foundations of Arts Education",
    "info": "The Social, Historical and Cultural Foundations of Arts Education will examine the arts in public education since the 1800s.",
    "prereq": []
  },
  {
    "uid": "005094",
    "code": "CI5078",
    "subject": "CI",
    "number": "5078",
    "honors": false,
    "writingIntensive": false,
    "name": "Application of Aesthetic Theor",
    "fullname": "Application of Aesthetic Theory in Education",
    "info": "The course explores:contemporary theories of artspsychological and philosophical foundationsan overview of children's production of and responses to visual and performing arts",
    "prereq": []
  },
  {
    "uid": "005155",
    "code": "CI5096",
    "subject": "CI",
    "number": "5096",
    "honors": false,
    "writingIntensive": false,
    "name": "Arts Education Experience",
    "fullname": "Arts Education Experience",
    "info": "In this course, students complete field experience observations in designated K-12 visual art or performing art, special education, and kindergarten classrooms.",
    "prereq": []
  },
  {
    "uid": "005095",
    "code": "CI5097",
    "subject": "CI",
    "number": "5097",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching in Arts Ed",
    "fullname": "Student Teaching in Arts Education",
    "info": "Teacher candidates spend 16 weeks student teaching in visual art, dance, or theatre. Eight weeks occur in an elementary setting and eight weeks occur in a secondary setting including, but not limited to, middle school.",
    "prereq": []
  },
  {
    "uid": "819748",
    "code": "CI5102",
    "subject": "CI",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture, Schools, Community I",
    "fullname": "Culture, Schools, & Communities: Human Relations I",
    "info": "This course provides teacher candidates with the knowledge and skills to address social and culturaldimensions of education. Students explore a wide range of challenges and dilemmas facingcontemporary educators in the U.S. and in other global locations. They examine original research andtheory from the social sciences, and learn how research and theories have informed various educationalpolicies and actual approaches to teaching. The course begins with a focused study of how U.S.educational history has been shaped by competing norms and purposes. It then moves into the role ofphilosophy in defining those purposes, and shaping actual approaches to teaching. The course thenshifts to examine multiple dimensions of humanity including race, culture, gender, gender orientation,class, worldview, perception, and language in and out of school. These concepts lay the foundation forstudy of cultural transmission and acquisition, the learning preferences of diverse students, andultimately, culturally relevant pedagogy, cultural competence, and cultural intelligence. Throughout thecourse, teacher candidates will consider their own positionality and what that means for their practice. Learning experiences are made up of class meetings involving speakers, simulations, and multi-media presentations; readings; small group discussions, activities, exercises and projects.",
    "prereq": []
  },
  {
    "uid": "819749",
    "code": "CI5103",
    "subject": "CI",
    "number": "5103",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture, Schools, Community II",
    "fullname": "Culture, Schools, & Communities: Human Relations II",
    "info": "This course provides teacher candidates with the knowledge and skills to address social and culturaldimensions of education. The course then explores community partnerships that support studentlearning, and how teachers may navigate the social and political environment of schools and schooldistricts to be effective advocates for their students. The course examines three themes that areinterwoven throughout: professionalism, teacher leadership, and adaptive expertise. In sum, the courseencourages teacher candidates to imagine both the realities and possibilities of schooling in thecontemporary world.Learning experiences are made up of class meetings involving speakers, simulations, and multi‐mediapresentations; readings; small group discussions, activities, exercises and projects.Prerequisites: Enrolled in initial teacher licensure program and successful completion of CI 5102.",
    "prereq": {
      "code": "CI 5102",
      "subject": "CI",
      "id": "5102"
    }
  },
  {
    "uid": "803111",
    "code": "CI5105",
    "subject": "CI",
    "number": "5105",
    "honors": false,
    "writingIntensive": false,
    "name": "Increasing Access and Success",
    "fullname": "Increasing Access and Success in Undergraduate Classrooms",
    "info": "Fundamentals and best practices for promoting student access, persistence, and retention within classroom. Focuses on traditionally under-represented/-served populations.",
    "prereq": []
  },
  {
    "uid": "803114",
    "code": "CI5106",
    "subject": "CI",
    "number": "5106",
    "honors": false,
    "writingIntensive": false,
    "name": "Multicultural Postsec Teaching",
    "fullname": "Multicultural Teaching and Learning in Diverse College Contexts",
    "info": "Theory/pedagogy for culturally responsive teaching from perspectives of teachers/learners in postsecondary settings. Critical multicultural education, universal instructional design, integrated multicultural instructional design.",
    "prereq": []
  },
  {
    "uid": "005153",
    "code": "CI5111",
    "subject": "CI",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Elem School Teaching",
    "fullname": "Introduction to Elementary School Teaching",
    "info": "Curriculum organization, instruction, management, assessment, professional decision making.prereq: Foundations of ed major or elem ed initial lic",
    "prereq": []
  },
  {
    "uid": "005325",
    "code": "CI5113",
    "subject": "CI",
    "number": "5113",
    "honors": false,
    "writingIntensive": false,
    "name": "Classroom Mgmt in Elem Schl",
    "fullname": "Classroom Management in the Elementary School",
    "info": "For teachers, administrators, and support staff working in elementary school programs. Focus on management of student behavior, instruction as it relates to student behavior, and teacher organizational tasks in the classroom.",
    "prereq": []
  },
  {
    "uid": "803115",
    "code": "CI5116",
    "subject": "CI",
    "number": "5116",
    "honors": false,
    "writingIntensive": false,
    "name": "Action Research in Education",
    "fullname": "Action Research in Educational Settings",
    "info": "Action research as method of improving teaching/learning in educational settings. Experience doing research in classrooms. Relative strengths/challenges of different approaches to classroom research. Ethical issues.",
    "prereq": []
  },
  {
    "uid": "817138",
    "code": "CI5121",
    "subject": "CI",
    "number": "5121",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture Power and Education",
    "fullname": "Culture Power and Education",
    "info": "In this course we will explore the manifestations of culture and power in education. We will examine the ways in which culture is a mediating factor in the educational achievement of underrepresented students. We will explicate the relationship between home/community and school cultures; and illuminate the detrimental impact of subtractive schooling practices. We then explore the theories and research that have shown the importance of integrating students' interests, knowledges, and experiences-cultures-for increasing student engagement and achievement. Our examination of culturally relevant pedagogy we will move beyond an understanding of \"culture\" within education as the \"celebration\" of ethnic food, songs and customs. Instead, we shift toward a more complex understanding of \"culture\" that takes into account the influences of ethnic culture, youth culture, and popular culture. ",
    "prereq": []
  },
  {
    "uid": "817139",
    "code": "CI5122",
    "subject": "CI",
    "number": "5122",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Class, Ed, Pedagogy",
    "fullname": "Social Class, Education and Pedagogy",
    "info": "This course will immerse students in social, psychological, economic, and political aspects of social class and poverty, and the implications for education as a social institution and classroom pedagogy. Students will engage in inquiries around social class in the U.S.; working-class literature for adults and children; labor histories; and economic systems' and will learn to design social class-sensitive teaching practices guided by five principles for social class-sensitive change.",
    "prereq": []
  },
  {
    "uid": "005029",
    "code": "CI5131",
    "subject": "CI",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Curriculum Studies",
    "fullname": "Introduction to Curriculum Studies",
    "info": "Curriculum theory and practice. Definitions of curriculum, historical and current issues in curriculum, principles and theories of curriculum, and alternative models and methods of design and evaluation.",
    "prereq": []
  },
  {
    "uid": "004874",
    "code": "CI5133",
    "subject": "CI",
    "number": "5133",
    "honors": false,
    "writingIntensive": false,
    "name": "Curriculum Planning/Design",
    "fullname": "Curriculum Planning and Design",
    "info": "Application of the theoretical and practical bases of disciplinary and interdisciplinary curriculum design to the problem of designing, implementing and evaluating the quality of a course or program of study.",
    "prereq": []
  },
  {
    "uid": "004002",
    "code": "CI5136",
    "subject": "CI",
    "number": "5136",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of American Curriculum",
    "fullname": "History of the American Curriculum",
    "info": "Survey of formation of public school subjects and curriculum theory in United States. Social, political, and economic implications of curriculum theory.",
    "prereq": []
  },
  {
    "uid": "004081",
    "code": "CI5137",
    "subject": "CI",
    "number": "5137",
    "honors": false,
    "writingIntensive": false,
    "name": "Multicult Gender-Fair Curricul",
    "fullname": "Multicultural Gender-Fair Curriculum",
    "info": "Critical examination of diversity/culture in K-12 contexts. Rationale for multicultural/gender-fair curriculum. Impact of curricular change/conflicts between culture/curriculum. Gender/expression, sexual identities, social class, language, race, ethnicity.",
    "prereq": []
  },
  {
    "uid": "004872",
    "code": "CI5138",
    "subject": "CI",
    "number": "5138",
    "honors": false,
    "writingIntensive": false,
    "name": "Multicult/Moral Per on Instruc",
    "fullname": "Multicultural and Moral Perspectives on Classroom Instruction",
    "info": "Factors leading to effective communication in ethnically diverse classroom, preschool to adult. Communication techniques and classroom structures that have cultural and moral implications.prereq: MEd or PhD student",
    "prereq": []
  },
  {
    "uid": "004861",
    "code": "CI5139",
    "subject": "CI",
    "number": "5139",
    "honors": false,
    "writingIntensive": false,
    "name": "Moral Education Programs",
    "fullname": "Moral Education Programs",
    "info": "Review of history, traditions, and efficacy of moral education programs in the schools; current school and district programs. Includes site visits to schools that are implementing social skills programs.",
    "prereq": []
  },
  {
    "uid": "004862",
    "code": "CI5141",
    "subject": "CI",
    "number": "5141",
    "honors": false,
    "writingIntensive": false,
    "name": "Reflect Teaching/Prof Ethics",
    "fullname": "Reflective Teaching and Professional Ethics",
    "info": "Students develop their professional identities as educators by considering their world views and values in relation to their professional role and responsibilities in the context of a diverse society. Encourages reflective practice and critical review of research.prereq: Teaching license and one yr teaching exper",
    "prereq": []
  },
  {
    "uid": "014925",
    "code": "CI5145",
    "subject": "CI",
    "number": "5145",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Pedagogy",
    "fullname": "Critical Pedagogy",
    "info": "Examination of critical pedagogy; critique of power relations regarding race, culture, class, gender, and age in various educational settings; consideration of improved practice in education for children, youth, and adults.",
    "prereq": []
  },
  {
    "uid": "003880",
    "code": "CI5149",
    "subject": "CI",
    "number": "5149",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues of Diversity in Schools",
    "fullname": "Issues of Diversity in Schools and Classrooms",
    "info": "Examination of issues in schools and classrooms that affect people from diverse groups, using historical, communication, value, and intercultural frameworks.",
    "prereq": []
  },
  {
    "uid": "003766",
    "code": "CI5150",
    "subject": "CI",
    "number": "5150",
    "honors": false,
    "writingIntensive": false,
    "name": "Curriculum Topics",
    "fullname": "Curriculum Topics",
    "info": "Special topics, current trends in curriculum. Subject integration, curriculum contexts, development, implementation, evaluation.",
    "prereq": []
  },
  {
    "uid": "004700",
    "code": "CI5155",
    "subject": "CI",
    "number": "5155",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemp Curr, Instruc, Assess",
    "fullname": "Contemporary Approaches to Curriculum: Instruction and Assessment",
    "info": "Current research/issues that cross disciplinary boundaries in curriculum development, instructional practices, and assessment methods.  Interrelations among curriculum, instruction, and assessment within framework of constructivist learning theory. Individual classroom practices/theories.prereq: Grad students only",
    "prereq": []
  },
  {
    "uid": "805769",
    "code": "CI5156",
    "subject": "CI",
    "number": "5156",
    "honors": false,
    "writingIntensive": false,
    "name": "PopularCulture,Tchg, Learning",
    "fullname": "Popular Culture, Teaching, and Learning",
    "info": "Approaches to the study of popular culture and education. Intersection between everyday life and broader historical contexts. Sporting events, toys, clothing, shopping malls, vampire mania, music festivals, video, and comics are the kinds of popular forms of culture we will engage as we develop teaching/learning strategies.prereq: Grad student or sr in a program that values teaching as a component of the discipline",
    "prereq": []
  },
  {
    "uid": "005231",
    "code": "CI5162",
    "subject": "CI",
    "number": "5162",
    "honors": false,
    "writingIntensive": false,
    "name": "Peer Coaching for Teachers",
    "fullname": "Peer Coaching for Teachers",
    "info": "Teachers coaching teachers; acquiring concepts, skills, and dispositions necessary for observing classroom instruction and providing constructive feedback.prereq: Teaching experience or instr consent",
    "prereq": []
  },
  {
    "uid": "808130",
    "code": "CI5163",
    "subject": "CI",
    "number": "5163",
    "honors": false,
    "writingIntensive": false,
    "name": "CHILD & ADOLESCENT DEVELOP I",
    "fullname": "Child and Adolescent Development for Teaching and Learning I",
    "info": "Attending to constant transitions/development in which children and adolescents negotiate their road to adulthood. How to foster learning/positive development.prereq: Enrolled in teacher initial licensure program",
    "prereq": []
  },
  {
    "uid": "808131",
    "code": "CI5164",
    "subject": "CI",
    "number": "5164",
    "honors": false,
    "writingIntensive": false,
    "name": "Child & Adolescent Develop II",
    "fullname": "Child and Adolescent Development for Teaching and Learning II",
    "info": "Transitions/development in which children/adolescents negotiate road to adulthood. How to foster learning/positive development.prereq: Enrolled in teacher initial licensure program",
    "prereq": []
  },
  {
    "uid": "005232",
    "code": "CI5172",
    "subject": "CI",
    "number": "5172",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Stud w/Learn Dis",
    "fullname": "Teaching Students with Learning Difficulties",
    "info": "Theory and practice in teaching students with learning difficulties across the curriculum.",
    "prereq": []
  },
  {
    "uid": "005028",
    "code": "CI5177",
    "subject": "CI",
    "number": "5177",
    "honors": false,
    "writingIntensive": false,
    "name": "Practical Research",
    "fullname": "Practical Research",
    "info": "Preparation for identifying a research and development topic, reviewing the existing knowledge on the topic, planning and carrying out a project, further investigating the topic, and writing a report on the project.prereq: CI MEd student, or CI or EdPA Teacher Leadership MEd student",
    "prereq": []
  },
  {
    "uid": "791174",
    "code": "CI5178",
    "subject": "CI",
    "number": "5178",
    "honors": false,
    "writingIntensive": false,
    "name": "Project: Teacher Leadership",
    "fullname": "Project in Teacher Leadership",
    "info": "Create, implement, evaluate, and present a leadership project designed to initiate positive change in educational environments. Review related literature, proposal development, project development, implementation/evaluation, critical reflection. Share learning outcomes.      ",
    "prereq": []
  },
  {
    "uid": "005154",
    "code": "CI5183",
    "subject": "CI",
    "number": "5183",
    "honors": false,
    "writingIntensive": false,
    "name": "Apply Inst Methods in Elem",
    "fullname": "Applying Instructional Methods in the Elementary Classroom",
    "info": "Supervised experience in elementary classrooms.",
    "prereq": []
  },
  {
    "uid": "005158",
    "code": "CI5186",
    "subject": "CI",
    "number": "5186",
    "honors": false,
    "writingIntensive": false,
    "name": "School-related projects",
    "fullname": "School-Related Projects",
    "info": "Research or evaluation project related to teaching, curriculum, or other aspect of schooling. Approved and supervised by faculty advisor.prereq: MEd student",
    "prereq": []
  },
  {
    "uid": "005235",
    "code": "CI5187",
    "subject": "CI",
    "number": "5187",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum: Impr Teaching Elem",
    "fullname": "Practicum: Improvement of Teaching in Elementary or PreKindergarten Schools",
    "info": "Elementary school classroom teaching project designed to improve specific teaching skills. Approved and directed by adviser.prereq: Students in early childhood educ M Ed, or elem educ M Ed, or teaching M Ed",
    "prereq": []
  },
  {
    "uid": "003779",
    "code": "CI5190",
    "subject": "CI",
    "number": "5190",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Ind Stud: Curric/Inst",
    "fullname": "Directed Individual Study in Curriculum and Instruction",
    "info": "Producing/evaluating curriculum materials. Literature review of issues/problems. Assessing curriculum processes.prereq: Grad student, instr consent",
    "prereq": []
  },
  {
    "uid": "811538",
    "code": "CI5211",
    "subject": "CI",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "El Ed Content and Pedagogy I",
    "fullname": "Elementary Education Content and Pedagogy I",
    "info": "Teacher Candidates will complete eight modules on elementary content/pedagogy instruction across disciplines. Introduce various concepts/practices that will be spiraled in each subject area.",
    "prereq": []
  },
  {
    "uid": "811539",
    "code": "CI5212",
    "subject": "CI",
    "number": "5212",
    "honors": false,
    "writingIntensive": false,
    "name": "El Ed Content and Pedagogy II",
    "fullname": "Elementary Education Content and Pedagogy II",
    "info": "Teacher Candidates will complete five modules on elementary content/pedagogy instruction across disciplines. Builds on variousconcepts/practices from introductory course. Introduces content that will be spiraled in each subject area.",
    "prereq": []
  },
  {
    "uid": "811540",
    "code": "CI5213",
    "subject": "CI",
    "number": "5213",
    "honors": false,
    "writingIntensive": false,
    "name": "El Ed Content and Pedagogy III",
    "fullname": "Elementary Education Content and Pedagogy III",
    "info": "Teacher Candidates will complete six modules on elementarycontent/pedagogy instruction across disciplines. Builds on variousconcepts/practices from two previous introductory courses. Introduces content that will be spiraled in each subject area.",
    "prereq": []
  },
  {
    "uid": "811541",
    "code": "CI5214",
    "subject": "CI",
    "number": "5214",
    "honors": false,
    "writingIntensive": false,
    "name": "El Ed Content and Pedagogy IV",
    "fullname": "Elementary Education Content and Pedagogy IV",
    "info": "Teacher Candidates will complete five modules on elementarycontent/pedagogy instruction across disciplines. Builds on variousconcepts/practices from previous three courses. Introduces content that will be spiraled in each subject area.",
    "prereq": []
  },
  {
    "uid": "811542",
    "code": "CI5215",
    "subject": "CI",
    "number": "5215",
    "honors": false,
    "writingIntensive": false,
    "name": "El Ed Content and Pedagogy V",
    "fullname": "Elementary Education Content and Pedagogy V",
    "info": "Teacher Candidates will complete five modules on elementary content/pedagogy instruction across disciplines. Builds on various concepts/practices from introductory courses. Introduces content in each subject area. Serves as conclusion to elementary ed content/pedagogy courses.",
    "prereq": []
  },
  {
    "uid": "004864",
    "code": "CI5250",
    "subject": "CI",
    "number": "5250",
    "honors": false,
    "writingIntensive": false,
    "name": "Social/Phil Found Early Ch Ed",
    "fullname": "Social and Philosophical Foundations of Early Childhood Education",
    "info": "Surveys imagery, history, philosophy, and psychology of early childhood education. Analyzing/interpreting trends in early education, including diversity, special needs, legislation, public policy, and educationally appropriate practice.",
    "prereq": []
  },
  {
    "uid": "791941",
    "code": "CI5254",
    "subject": "CI",
    "number": "5254",
    "honors": false,
    "writingIntensive": false,
    "name": "Kindergarten Methods",
    "fullname": "Kindergarten Methods",
    "info": "Purpose of kindergarten, its place in elementary program. Curriculum appropriate for needs of age group, including children with special needs. Assessment procedures, role of classroom teacher.prereq: Foundations of Education/Elementary Education or M.Ed./ILP Elementary Education",
    "prereq": []
  },
  {
    "uid": "804981",
    "code": "CI5283",
    "subject": "CI",
    "number": "5283",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Experience: Elementary",
    "fullname": "Field Experience: Applying Instructional Methods in the Elementary Classroom",
    "info": "Field-based experiences in elementary school settings. In-class discussions about application of classroom learning to school setting.Previously CI 5183.prereq: M.Ed./Elementary education initial licensure student, enrolled in elementary education methods course",
    "prereq": []
  },
  {
    "uid": "804982",
    "code": "CI5285",
    "subject": "CI",
    "number": "5285",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Exp. in Elem Teaching",
    "fullname": "Clinical Experience in Elementary School Teaching",
    "info": "Students spend full days in elementary classroom, gradually assuming responsibility for teaching, and prepare portfolio based on criteria given. One seminar per week.prereq: M.Ed./Elementary education initial licensure students",
    "prereq": []
  },
  {
    "uid": "805125",
    "code": "CI5286",
    "subject": "CI",
    "number": "5286",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching Seminar",
    "fullname": "Student Teaching Seminar: Elementary Education",
    "info": "Weekly seminar supplementing student teaching experience. Class discussions, sharing of artifacts from the classroom, reflections, and readings.prereq: M.Ed./Elementary education initial licensure only",
    "prereq": []
  },
  {
    "uid": "804984",
    "code": "CI5287",
    "subject": "CI",
    "number": "5287",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Project: Elem Educ",
    "fullname": "Capstone Project: Improvement of Teaching in Elementary and Pre-Kindergarten Schools",
    "info": "Elementary school classroom teaching project to improve specific teaching skills. Approved/directed by adviser.prereq: M.Ed./elementary education initial licensure student",
    "prereq": []
  },
  {
    "uid": "002523",
    "code": "CI5300",
    "subject": "CI",
    "number": "5300",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach Computer Concepts/Skills",
    "fullname": "Teaching Introductory Computer Concepts and Skills",
    "info": "Pedagogical strategies for teaching keyboarding and word processing.",
    "prereq": []
  },
  {
    "uid": "002479",
    "code": "CI5301",
    "subject": "CI",
    "number": "5301",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations-ComputerAps Bus&Ed",
    "fullname": "Foundations of Computer Applications for Business and Education",
    "info": "Instructional uses of computers/representative business, education, marketing applications. Word processing, databases, spreadsheets, graphic design. Expectations are for demonstrations of skills on apps/understanding of concepts that go beyond basic.",
    "prereq": []
  },
  {
    "uid": "002486",
    "code": "CI5303",
    "subject": "CI",
    "number": "5303",
    "honors": false,
    "writingIntensive": false,
    "name": "DataAnalysis&InfoDesign-Bus&Ed",
    "fullname": "Data Analysis and Information Design for Business and Education",
    "info": "Using spreadsheets, information visualization, and data management to create analytical models in business, education, and research settings.",
    "prereq": []
  },
  {
    "uid": "002494",
    "code": "CI5304",
    "subject": "CI",
    "number": "5304",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Mgmt, Online Integration",
    "fullname": "Data Management for Online Integration",
    "info": "Using database software to organize, manage, and display online data, to create content management systems, and to integrate into existing websites.",
    "prereq": []
  },
  {
    "uid": "002498",
    "code": "CI5305",
    "subject": "CI",
    "number": "5305",
    "honors": false,
    "writingIntensive": false,
    "name": "Integ Computer Apps in BME",
    "fullname": "Integrated Computer Applications in Business and Marketing Education",
    "info": "Case-based authentic business computing problems requiring integration of two or more application packages. Pedagogical issues of learning/teaching advanced computer applications.",
    "prereq": []
  },
  {
    "uid": "002241",
    "code": "CI5307",
    "subject": "CI",
    "number": "5307",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology for Teaching & Lrng",
    "fullname": "Technology for Teaching and Learning",
    "info": "Diverse educational technology in K-12 classrooms. Effective use of technology. Computer technologies used to stimulate personal productivity/communication and to enhance teaching/learning processes.prereq: [MEd/initial licensure or CLA music ed major or preteaching major or instr consent], basic computer skills",
    "prereq": []
  },
  {
    "uid": "799401",
    "code": "CI5321",
    "subject": "CI",
    "number": "5321",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Distance Ed",
    "fullname": "Foundations of Distance Education",
    "info": "History, philosophies, technologies, and best practices related to distance learning environments. Distance education theories. Issues in distance education.",
    "prereq": []
  },
  {
    "uid": "799402",
    "code": "CI5323",
    "subject": "CI",
    "number": "5323",
    "honors": false,
    "writingIntensive": false,
    "name": "Online Learning Communities",
    "fullname": "Online Learning Communities",
    "info": "Students design/research an online learning environment that promotes community. What community is, how it fosters learning in educational learning environments. Theories of distance learning instruction. Community models. technological tools to develop online communities.",
    "prereq": []
  },
  {
    "uid": "799428",
    "code": "CI5325",
    "subject": "CI",
    "number": "5325",
    "honors": false,
    "writingIntensive": false,
    "name": "Design Online DistanceLearning",
    "fullname": "Designing and Developing Online Distance Learning",
    "info": "Students research, use, and evaluate technologies for distance learning and design their own learning environments.prereq: 5351 or 5362 recommended",
    "prereq": {
      "or": [
        {
          "code": "CI 5351",
          "subject": "CI",
          "id": "5351"
        },
        {
          "code": "CI 5362",
          "subject": "CI",
          "id": "5362"
        }
      ]
    }
  },
  {
    "uid": "799429",
    "code": "CI5327",
    "subject": "CI",
    "number": "5327",
    "honors": false,
    "writingIntensive": false,
    "name": "Online Adventure Learning",
    "fullname": "Designing Online Adventure Learning",
    "info": "Bring adventure to your online learning environments: learn to design, develop, and deliver an online program that provides opportunities to explore real-world issues through authentic learning experiences in a collaborative online space. You'll engage learners virtually and in real-time. For more info go to http://www.chasingseals.com then sign up and start exploring.",
    "prereq": []
  },
  {
    "uid": "003892",
    "code": "CI5330",
    "subject": "CI",
    "number": "5330",
    "honors": false,
    "writingIntensive": false,
    "name": "SpecTop:  Lrng Techologies",
    "fullname": "Special Topics in Learning Technologies",
    "info": "Topics related to the field of learning technologies.",
    "prereq": []
  },
  {
    "uid": "003882",
    "code": "CI5331",
    "subject": "CI",
    "number": "5331",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Learning Technologies",
    "fullname": "Introduction to Learning Technologies",
    "info": "An exciting look at the field of learning technologies (LT), examining the numerous opportunities this area of study brings to individuals who decide to pursue a LT degree. Students engage in numerous real-world projects as they come to understand both the past and future of technology in education, business, and society as a whole.",
    "prereq": []
  },
  {
    "uid": "003878",
    "code": "CI5336",
    "subject": "CI",
    "number": "5336",
    "honors": false,
    "writingIntensive": false,
    "name": "Plan for Multimedia Design/Dev",
    "fullname": "Planning for Multimedia Design and Development",
    "info": "Theory, research, practice in instructional design. Generic components of instructional design process. Applying principles to design/development of computer-based instructional materials.",
    "prereq": []
  },
  {
    "uid": "788801",
    "code": "CI5337",
    "subject": "CI",
    "number": "5337",
    "honors": false,
    "writingIntensive": false,
    "name": "Planning K-12 Tech Integration",
    "fullname": "Planning for K-12 Technology Design and Integration",
    "info": "Developing technology-enhanced learning (TEL) lessons/units for K-12 instructional contexts (e.g., content areas across PK-12 grades). Contemporary perspectives on instruction/learning, TEL lesson categorization techniques.",
    "prereq": []
  },
  {
    "uid": "793528",
    "code": "CI5342",
    "subject": "CI",
    "number": "5342",
    "honors": false,
    "writingIntensive": false,
    "name": "School Technology Planning",
    "fullname": "School Technology Planning",
    "info": "How to establish plans for use of technology that support K-12 instruction and student learning. Facilitating ongoing comprehensive planning for technology integration. Identifying priorities for technology planning.",
    "prereq": []
  },
  {
    "uid": "793616",
    "code": "CI5343",
    "subject": "CI",
    "number": "5343",
    "honors": false,
    "writingIntensive": false,
    "name": "School Technology Funding",
    "fullname": "School Technology Funding",
    "info": "Developing a multi-year funding strategy for establishing K-12 technology integration in accordance with a technology vision/plan.",
    "prereq": []
  },
  {
    "uid": "793536",
    "code": "CI5344",
    "subject": "CI",
    "number": "5344",
    "honors": false,
    "writingIntensive": false,
    "name": "K-12 Technology Integration I",
    "fullname": "Facilitating Technology Integration in Classrooms I",
    "info": "Intersection of student learning theories and research base on effective technology practices. Video cases of technology-supported teaching, peer teaching exercise.",
    "prereq": []
  },
  {
    "uid": "793617",
    "code": "CI5345",
    "subject": "CI",
    "number": "5345",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology Integration II",
    "fullname": "Facilitating Technology Integration in Classrooms II",
    "info": "Technology-supported teaching/learning at one's educational site. Preparing a vision statement for technology.s role in student learning. How to assume an advocacy role in establishing technology use for instruction/learning. ",
    "prereq": []
  },
  {
    "uid": "793618",
    "code": "CI5346",
    "subject": "CI",
    "number": "5346",
    "honors": false,
    "writingIntensive": false,
    "name": "Staff Tech Devt Support",
    "fullname": "Staff Technology Development and Support",
    "info": "How to lead organization in designing, implementing, evaluating, improving, and sharing approaches to staff development. Technology-related staff development. Facilitating development through use of technology.",
    "prereq": []
  },
  {
    "uid": "801653",
    "code": "CI5347",
    "subject": "CI",
    "number": "5347",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Digital Writing",
    "fullname": "Teaching Digital Writing: Blogs, Wikis, Online Talk, Podcasting, and E-Portfolios to Teach Writing",
    "info": "Uses of blogs, wikis, online discussion. Database search strategies. Multimodal integration of images, audio, video, text. Digital note-taking, mapping, storytelling. Audio-production. Formatting/design techniques. Online evaluation. -portfolios.",
    "prereq": []
  },
  {
    "uid": "003879",
    "code": "CI5351",
    "subject": "CI",
    "number": "5351",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology Tools for Educators",
    "fullname": "Technology Tools for Educators",
    "info": "Develop skills in using technology applications to support teaching and learning. Internet applications, presentation software, Web 2.0 technologies, and Web site development.",
    "prereq": []
  },
  {
    "uid": "003868",
    "code": "CI5361",
    "subject": "CI",
    "number": "5361",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching & Learning w/Internet",
    "fullname": "Teaching and Learning with the Internet",
    "info": "Implications/challenges in using Internet-based technologies in classroom. Pedagogical models.",
    "prereq": []
  },
  {
    "uid": "788842",
    "code": "CI5362",
    "subject": "CI",
    "number": "5362",
    "honors": false,
    "writingIntensive": false,
    "name": "InteractiveDesignWeb-basedLrng",
    "fullname": "Foundations of Interactive Design for Web-based Learning",
    "info": "Processes of designing/developing interactive learning media and online applications from ground up. Focuses on usability/aesthetics in online learning.",
    "prereq": []
  },
  {
    "uid": "003864",
    "code": "CI5363",
    "subject": "CI",
    "number": "5363",
    "honors": false,
    "writingIntensive": false,
    "name": "Design for Online/Mobile Lrng",
    "fullname": "New Media and Interaction Design for Online and Mobile Learning",
    "info": "New media design from perspective of instructional designer. Designing with Adobe Flash environment. Context of authentic design problems. Consideration of raster/vector imaging, web video optimization, usability analysis.",
    "prereq": []
  },
  {
    "uid": "003863",
    "code": "CI5364",
    "subject": "CI",
    "number": "5364",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp-Base Inst: Games/Sim",
    "fullname": "Computer-Based Instruction: Games and Simulation",
    "info": "Principles and procedures of computer simulation and game design. Types of computer simulation, the components common to simulation design, and the theory underlying educational simulation design.  ",
    "prereq": []
  },
  {
    "uid": "796222",
    "code": "CI5365",
    "subject": "CI",
    "number": "5365",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Development Tools",
    "fullname": "Contemporary Software Development Issues and Tools",
    "info": "Software used in multimedia design/development. Uses of the software, intricacies of interface, relevant programming principles. Introduction to developing multimedia applications.prereq: Familiar with standard computer/Internet operations",
    "prereq": []
  },
  {
    "uid": "003798",
    "code": "CI5367",
    "subject": "CI",
    "number": "5367",
    "honors": false,
    "writingIntensive": false,
    "name": "Interactive Multimedia Inst",
    "fullname": "Interactive Multimedia Instruction",
    "info": "Principles of effective computer-based design; tools in multimedia development; contemporary issues and skills used in the design, development, and implementation of interactive multimedia instruction. Use multimedia development tools, create a multimedia portfolio, and investigate the issues surrounding their effective use.prereq: Knowledge of principles and procedures of CBI design and one multimedia authoring system",
    "prereq": []
  },
  {
    "uid": "818037",
    "code": "CI5371",
    "subject": "CI",
    "number": "5371",
    "honors": false,
    "writingIntensive": false,
    "name": "Learning Analytics",
    "fullname": "Learning Analytics: Theory and Practice",
    "info": "Learning analytics as a nascent field is broadly defined as the \"measurement, collection, analysis and reporting of data about learners and their contexts, for purposes of understanding and optimizing learning and the environments in which it occurs.\" This course aims to provide a general, non-technical survey of learning analytics, as well as its application in various educational contexts. In particular, we will discuss foundations of learning analytics, survey pertinent education theories, discuss new forms of assessment, explore popular data mining techniques, review learning analytical tools and case studies, and de- sign analytics for our own interested contexts. Given the breadth of this field, additional support is provided for deep dives in special interest areas. Overall, this course provides a comprehensive, theory-driven overview of learning analytics to orient students to this nascent field and prepare them for advanced research/practice in learning analytics.",
    "prereq": []
  },
  {
    "uid": "805768",
    "code": "CI5390",
    "subject": "CI",
    "number": "5390",
    "honors": false,
    "writingIntensive": false,
    "name": "Learning Tech Field Experience",
    "fullname": "Learning Technologies Field Experiences",
    "info": "Field-based experience for students enrolled in computers, keyboarding, and related technology applications methods classes. Apply learning from University courses to the K-12 school setting. In-class discussions about the application of classroom learning to the school setting.prereq: Students in teachers of computers/keyboarding/related technology applications additional licensure program",
    "prereq": []
  },
  {
    "uid": "006294",
    "code": "CI5391",
    "subject": "CI",
    "number": "5391",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech in Postsec Devel Curric",
    "fullname": "Technology in the Postsecondary Development Curriculum",
    "info": "Examines ways in which use of technology is transforming learning environments, teaching practices, and the curriculum in developmental education for postsecondary students. Course taught on-line.",
    "prereq": []
  },
  {
    "uid": "818561",
    "code": "CI5392",
    "subject": "CI",
    "number": "5392",
    "honors": false,
    "writingIntensive": false,
    "name": "LT M.Ed. Capstone Project",
    "fullname": "Learning Technologies M.Ed. Capstone Project",
    "info": "In this course Learning Technologies M.Ed. students develop their final capstone project that signals the completion of their degree program. Students will identify a need or gap related to Learning Technologies in an area of interest to them and conduct preliminary research on that topic. Based on their research, students develop a proposal and turn the proposal into reality by building the project. Students will participate in a variety of discussions and scholarly readings, both instructor selected and those selected by students in support of their identified topics of research. A mini-cohort model of 2-4 students is used throughout the course for peer review and feedback. Peers become mini-experts in their partners' projects as they follow along in the design and development process and ask questions and offer feedback along with the instructor. Students will develop a completed project or prototype (e.g. course curriculum, training materials, website, software, mobile app, etc.) and a paper defending their project by discussing the research that informed their decisions, how those decisions were implemented, and how they expect the project to impact their work and/or field. The course culminates in a public presentation of their project via live or video conferencing with a Q&A session following.prereq: Learning Technologies M.Ed. students",
    "prereq": []
  },
  {
    "uid": "006282",
    "code": "CI5401",
    "subject": "CI",
    "number": "5401",
    "honors": false,
    "writingIntensive": false,
    "name": "Lit for Elementary School",
    "fullname": "Literature for the Elementary School",
    "info": "Evaluative survey of books for children. Research related to children's reading interests. Response to literature, instructional strategies.prereq: Children's lit course or instr consent",
    "prereq": []
  },
  {
    "uid": "005141",
    "code": "CI5402",
    "subject": "CI",
    "number": "5402",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Special Collections",
    "fullname": "Introduction to Special Collections",
    "info": "Uses Children's Literature Research Collection as research material. Study of manuscripts, original art, and letters.prereq: Children's lit course",
    "prereq": []
  },
  {
    "uid": "005255",
    "code": "CI5403",
    "subject": "CI",
    "number": "5403",
    "honors": false,
    "writingIntensive": false,
    "name": "Writing For and By Children",
    "fullname": "Writing For and By Children",
    "info": "Aspects of writing/illustrating children's literature or children's own writing. May feature authors/illustrators of children's books.",
    "prereq": []
  },
  {
    "uid": "802280",
    "code": "CI5404",
    "subject": "CI",
    "number": "5404",
    "honors": false,
    "writingIntensive": false,
    "name": "Multicultural Childrens Lit",
    "fullname": "Multicultural Literature for Children and Adolescents",
    "info": "Course explores multicultural literature for children and adolescents as a site where difference can be emphasized and appreciated rather than downplayed and muted. We study award-winning works of fiction and arrive at a definition of multicultural literature for the modern classroom.",
    "prereq": []
  },
  {
    "uid": "797439",
    "code": "CI5405",
    "subject": "CI",
    "number": "5405",
    "honors": false,
    "writingIntensive": false,
    "name": "Middle Sch Language Arts Mthds",
    "fullname": "Middle School Language Arts Methods",
    "info": "Introduction to the unique needs of middle school students in the language arts classroom. Language arts content and pedagogical skills. Adolescent development/psychology. Field placement in a middle school language arts classroom.prereq: Elem ed licensure student",
    "prereq": []
  },
  {
    "uid": "005439",
    "code": "CI5410",
    "subject": "CI",
    "number": "5410",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topics: Teaching Literacy",
    "fullname": "Special Topics in the Teaching of Literacy",
    "info": "Topics related specifically to the needs of in-service teachers. Topics, location, credits, and duration will be highly flexible.",
    "prereq": []
  },
  {
    "uid": "006277",
    "code": "CI5411",
    "subject": "CI",
    "number": "5411",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach Reading/Elem School",
    "fullname": "Teaching Reading in the Elementary School",
    "info": "Aids the inservice elementary classroom teacher in the development of knowledge of theory and practice in the teaching of reading.",
    "prereq": []
  },
  {
    "uid": "004283",
    "code": "CI5412",
    "subject": "CI",
    "number": "5412",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading Dif: Instruc/Assess",
    "fullname": "Reading Difficulties: Instruction and Assessment",
    "info": "Causes, diagnosis and assessment, prevention and correction; intervention practices useful to the classroom teacher and special teacher of reading.prereq: 5411 or 5451",
    "prereq": {
      "or": [
        {
          "code": "CI 5411",
          "subject": "CI",
          "id": "5411"
        },
        {
          "code": "CI 5451",
          "subject": "CI",
          "id": "5451"
        }
      ]
    }
  },
  {
    "uid": "003889",
    "code": "CI5413",
    "subject": "CI",
    "number": "5413",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Reading",
    "fullname": "Foundations of Reading",
    "info": "Reading processes, development of readers. Assessment and tutoring of individual children in reading and other literacy practices.prereq: CI 3610 and concurrent registration with CI 5414",
    "prereq": {
      "and": [
        {
          "code": "CI 3610",
          "subject": "CI",
          "id": "3610"
        },
        {
          "code": "CI 5414",
          "subject": "CI",
          "id": "5414"
        }
      ]
    }
  },
  {
    "uid": "803431",
    "code": "CI5414",
    "subject": "CI",
    "number": "5414",
    "honors": false,
    "writingIntensive": false,
    "name": "Developing Readers",
    "fullname": "Field Experience: Working with Developing Readers",
    "info": "Field-based experiences. Students apply learning from their University course to working with developing readers. Instructor provides specific assignments.",
    "prereq": []
  },
  {
    "uid": "005156",
    "code": "CI5415",
    "subject": "CI",
    "number": "5415",
    "honors": false,
    "writingIntensive": false,
    "name": "Literacy Dev-Primary Grades",
    "fullname": "Literacy Development in the Primary Grades",
    "info": "Theory/practice of integrated teaching of reading, literature, writing, and language in primary classroom settings. Uses national/state language arts standards and assessment protocols to examine primary literacy curricula.prereq: Elem teaching exper or instr consent",
    "prereq": []
  },
  {
    "uid": "005157",
    "code": "CI5416",
    "subject": "CI",
    "number": "5416",
    "honors": false,
    "writingIntensive": false,
    "name": "Literacy Dev/Intermediate Gra",
    "fullname": "Literacy Development in the Intermediate Grades",
    "info": "Theory/practice of integrated teaching of reading, literature, writing, and language in intermediate classroom settings. Uses national/state language arts standards and assessment protocols to examine intermediate literacy curricula.",
    "prereq": []
  },
  {
    "uid": "802868",
    "code": "CI5417",
    "subject": "CI",
    "number": "5417",
    "honors": false,
    "writingIntensive": false,
    "name": "Literacy instruction for ESL",
    "fullname": "Elementary literacy Instruction for ESL Students",
    "info": "Teaching reading/writing in elementary grades to students from diverse languages. Second-language literacy development. Phonemic awareness, phonics, fluency, vocabulary, comprehension. Ways to connect students? background knowledge to literacy curriculum.prereq: Bachelor's degree completed",
    "prereq": []
  },
  {
    "uid": "005282",
    "code": "CI5418",
    "subject": "CI",
    "number": "5418",
    "honors": false,
    "writingIntensive": false,
    "name": "Whole Lang Teach/Elem Sch",
    "fullname": "Whole Language Teaching and Learning in the Elementary School",
    "info": "Theory, research, and politics of whole language teaching. Applications for developing an elementary school whole language curriculum.prereq: MEd or grad student, minimum one yr of teaching exper",
    "prereq": []
  },
  {
    "uid": "000961",
    "code": "CI5419",
    "subject": "CI",
    "number": "5419",
    "honors": false,
    "writingIntensive": false,
    "name": "The American Middle School",
    "fullname": "The American Middle School",
    "info": "Focus on the uniqueness of the early adolescent and appropriate learning situations. For educators working with middle-level students.",
    "prereq": []
  },
  {
    "uid": "818824",
    "code": "CI5421",
    "subject": "CI",
    "number": "5421",
    "honors": false,
    "writingIntensive": false,
    "name": "Writing on Education",
    "fullname": "Writing on Education:  Pivotal Experiences of Teaching and Learning",
    "info": "Reflection and narrative play important roles in developing deep understanding of teaching and learning. In this course students will read and write texts about critical moments of education, and through this work develop reflective, analytic, and writing skills that will enable them to become more thoughtful and effective citizens in the world of education. Whether students hope to become teachers, youth workers, community organizers, curriculum designers or administrators in educational settings, this course invites students to consider how writers represent experiences of teaching and learning and how these reflective narratives can inform our own work and worlds. Students will explore the ways that writers of creative nonfiction use language to examine pivotal experiences of teaching and learning in diverse contexts, and add their own voices to this rich body of work by producing their own texts. Through study of writing, students will develop familiarity with writing choices and practice employing these techniques and processes in their own writing. Students will read personal essays written by writers in the US who reflect on their own experiences and interrogate how aspects of their identities (including race, ethnicity, gender, family history and language) inform pivotal experiences of teaching and learning. Students will compose texts that explore their own experiences within a constellation of formal and informal educational settings and the questions raised and arguments made through these representations. We will use a workshop-based format that supports transformational learning, helping writers see themselves and their worlds in new ways. Course reading will introduce a range of issues raised by experiences in and outside of the classroom. ",
    "prereq": []
  },
  {
    "uid": "004281",
    "code": "CI5422",
    "subject": "CI",
    "number": "5422",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Writing in Schools",
    "fullname": "Teaching Writing in Schools",
    "info": "Theory/practice of teaching writing in schools. How race, gender, and social class impact teaching/learning.",
    "prereq": []
  },
  {
    "uid": "007393",
    "code": "CI5424",
    "subject": "CI",
    "number": "5424",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading, Lang Arts/Lit: Primar",
    "fullname": "Reading, Language Arts, and Literature: Primary",
    "info": "Curricular/methodological issues of reading, language arts, and children's literature. Evaluating children's literature, emergent literacy, response to literature, reading/writing processes, strategy instruction for word recognition/comprehension, authentic assessment strategies, teaching diverse students.prereq: Elem ed init lic",
    "prereq": []
  },
  {
    "uid": "803634",
    "code": "CI5425",
    "subject": "CI",
    "number": "5425",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading Instruction K-6",
    "fullname": "Reading Instruction in the Elementary Grades",
    "info": "Curricular/methodological issues in teaching of reading. Reading/orthographic processes, strategy instruction for word recognition/comprehension, authentic assessment strategies, and teaching diverse students.prereq: [Elementary or early childhood] licensure student",
    "prereq": []
  },
  {
    "uid": "803635",
    "code": "CI5426",
    "subject": "CI",
    "number": "5426",
    "honors": false,
    "writingIntensive": false,
    "name": "Language Arts K-6",
    "fullname": "Language Arts Instruction in the Elementary Grades",
    "info": "Curricular/methodological issues of language arts. Oral language development, response to literature, writing processes, authentic assessment strategies. Teaching diverse students.prereq: Elementary or early childhood licensure student",
    "prereq": []
  },
  {
    "uid": "793537",
    "code": "CI5431",
    "subject": "CI",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership in K-12 Reading",
    "fullname": "Introduction to Instructional Leadership in K-12 Reading",
    "info": "K-12 curriculum in reading, major theories/research that motivate curriculum. Major instructional principles, alignments needed, resources available.prereq: Minnesota license valid for classroom teaching in pre-kindergarten, [adult basic education or grades kindergarten through 6 or 1 through 6 or 5 through 8 or 9 through 12 or kindergarten through 12]",
    "prereq": []
  },
  {
    "uid": "793538",
    "code": "CI5432",
    "subject": "CI",
    "number": "5432",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading in Grades K-6",
    "fullname": "Instructional Leadership in Reading in Kindergarten and the Elementary Grades",
    "info": "Research-based reading instruction for elementary grades. How to help other teachers improve practice. Characteristics of effective schools within context of improving students. reading achievement.prereq: 5431",
    "prereq": {
      "code": "CI 5431",
      "subject": "CI",
      "id": "5431"
    }
  },
  {
    "uid": "793539",
    "code": "CI5433",
    "subject": "CI",
    "number": "5433",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading in Mid/Sec Grades",
    "fullname": "Instructional Leadership in Reading for the Middle and Secondary Grades",
    "info": "Curriculum/instruction for middle/secondary school students.prereq: 5432",
    "prereq": {
      "code": "CI 5432",
      "subject": "CI",
      "id": "5432"
    }
  },
  {
    "uid": "793555",
    "code": "CI5434",
    "subject": "CI",
    "number": "5434",
    "honors": false,
    "writingIntensive": false,
    "name": "Prof Dev Evolv Pract K-12 Read",
    "fullname": "Professional Development and Evolving Practice in K-12 Reading",
    "info": "Developing e-portfolio to assess competence in standards for teaching K-12 reading. Evolving teaching practices. Applications of current technologies.prereq: 5433",
    "prereq": {
      "code": "CI 5433",
      "subject": "CI",
      "id": "5433"
    }
  },
  {
    "uid": "793556",
    "code": "CI5435",
    "subject": "CI",
    "number": "5435",
    "honors": false,
    "writingIntensive": false,
    "name": "Prevent Reading Difficulties",
    "fullname": "Instructional Leadership in Preventing Reading Difficulties",
    "info": "Research-based reading interventions for struggling readers. How to help other teachers improve their practice. Theory/research behind preventing reading difficulties. Principles/techniques for assessing reading difficulties and students? progress.prereq: 5434",
    "prereq": {
      "code": "CI 5434",
      "subject": "CI",
      "id": "5434"
    }
  },
  {
    "uid": "004350",
    "code": "CI5441",
    "subject": "CI",
    "number": "5441",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Lit/Second School",
    "fullname": "Teaching Literature in the Secondary School",
    "info": "Current theories. Analyzing literature. Response to literature. Adolescent literature/reading interests. Devising response activities/units. Multicultural literature. Relating media and literature. Linking writing to understanding literature. Designing curriculum. Evaluating/assessing students. Growth in literary response.",
    "prereq": []
  },
  {
    "uid": "004339",
    "code": "CI5442",
    "subject": "CI",
    "number": "5442",
    "honors": false,
    "writingIntensive": false,
    "name": "Adolescent Lit & Activism",
    "fullname": "Adolescent Literature, Youth Activism and Climate Change Literacy",
    "info": "This course explores how contemporary adolescent literature engages with the developmental and identity challenges faced by a generation whose lives are framed by anthropogenic climate change, biodiversity loss, mass migrations, and other forms of slow violence inherent in the unsustainable carbon-intensive civilization. Given that climate change is primarily a challenge to our story systems and that adolescents constitute the most invested audience for sustainability education, adolescent literature has become a site of rebellion against the unjust and ecocidal status quo; a site where adolescents can articulate, debate, and creatively respond to visions of sustainable futures. In this course we will study award-winning works of fiction and nonfiction across genres to understand how adolescent literature inspires activist positions vis a vis petronormative ideologies of power that are devastating the planet. Our focus on the intersection of storytelling, activism, and climate change literacy will help us grasp the key role adolescent literature plays in empowering today’s youths to become agents of change. We will discuss how adolescent literature can stoke young people’s transformative anger, inspire them to address the climate crisis, and stand up for their right to have a future. We will consider how educators can support this fight through activism and engaged discussions of adolescent literature. We will read award-winning picturebooks, novels, and graphic novels that challenge us to reinvent ourselves as a biocentric global civilization. The goal is to transform you into an informed advocate of adolescent literature as a tool for developing climate change literacy and empowering your students to imagine post-carbon futures.",
    "prereq": []
  },
  {
    "uid": "004887",
    "code": "CI5451",
    "subject": "CI",
    "number": "5451",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach Reading Mid/Sec Grades",
    "fullname": "Teaching Reading in Middle and Secondary Grades",
    "info": "Methods of accommodating to students' abilities and facilitating reading in regular content classes.",
    "prereq": []
  },
  {
    "uid": "798926",
    "code": "CI5452",
    "subject": "CI",
    "number": "5452",
    "honors": false,
    "writingIntensive": false,
    "name": "Read Content Area ILP Cand",
    "fullname": "Reading in the Content Areas for Initial Licensure Candidates",
    "info": "Web-based course. Fostering students' reading related to learning from text.prereq: Concurrent enrollment in licensure area methods course(s), enrolled in Initial Licensure Program, Internet access, basic understanding of [computer use, Web browsers, email, word processing software]",
    "prereq": []
  },
  {
    "uid": "004342",
    "code": "CI5461",
    "subject": "CI",
    "number": "5461",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach Comp in Secondary School",
    "fullname": "Teaching Composition in the Secondary School",
    "info": "Theories of composition instruction. Teaching composing within social contexts. Informal writing. Linking reading/writing. Describing/evaluating student writing. Using/modeling conference strategies. Computer-mediated software. Grammar and writing. Editing instruction. Writing assessment. Uses of portfolios.",
    "prereq": []
  },
  {
    "uid": "004341",
    "code": "CI5462",
    "subject": "CI",
    "number": "5462",
    "honors": false,
    "writingIntensive": false,
    "name": "Eval/Assessing Writing",
    "fullname": "Evaluating and Assessing Writing",
    "info": "Identifying rhetorical/linguistic features, explaining difficulties in writing. Giving descriptive feedback. Training for peer conferences. Portfolio writing evaluation. Conducting large-scale writing assessments. Issues of validity/reliability with writing assessments.",
    "prereq": []
  },
  {
    "uid": "801480",
    "code": "CI5463",
    "subject": "CI",
    "number": "5463",
    "honors": false,
    "writingIntensive": false,
    "name": "MWP Writing Institute",
    "fullname": "Minnesota Writing Project Annual Invitational Summer Institute",
    "info": "Workshop. Participants reflect on their own literacy processes, participate in a writing group, discuss current reading texts, and demonstrate best practices in classroom.prereq: Licensed teacher or administrator or [space available, faculty letter of recommendation]",
    "prereq": []
  },
  {
    "uid": "816426",
    "code": "CI5464",
    "subject": "CI",
    "number": "5464",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics of Literacy and Race",
    "fullname": "The Politics of Literacy and Race in Schools",
    "info": "Literacy and race in schools examined, especially how power plays out, and what are the possibilities for creating radical democratic forms of life. Conceptions of language, literacy, whiteness, and racial identities are explored. Topics include educators talk and silence about race, Ebonics, and youths racial identities in global times.",
    "prereq": []
  },
  {
    "uid": "816491",
    "code": "CI5465",
    "subject": "CI",
    "number": "5465",
    "honors": false,
    "writingIntensive": false,
    "name": "Writing for Social Justice",
    "fullname": "Writing and Social Justice: A Minnesota Writing Project Open Institute",
    "info": "This course focuses on practices within literacy instruction as related to the current educational landscape and a theme of social justice. In this course, participants will focus on three areas: writing, teaching, and learning. Participants will reflect on their own writing processes as they write, share, and participate in a community of writers. Writing groups will meet several times during the course. Participants will also consider the theory and practice of writing instruction that helps students achieve their potential as writers and change agents. In addition, participants will investigate a literacy issue relevant to the course theme, social justice, and will present it as a research project or lesson. This course is offered for practicing teachers at all levels and across disciplines.",
    "prereq": []
  },
  {
    "uid": "805526",
    "code": "CI5469",
    "subject": "CI",
    "number": "5469",
    "honors": false,
    "writingIntensive": false,
    "name": "MWP Directed Studies",
    "fullname": "Minnesota Writing Project Directed Studies",
    "info": "Directed study for teachers involved in MWP. Capstone course for those enrolled in the Certificate in Teaching Writing and Critical Literacy. Teachers investigate current theory and practice of literacy instruction. Ongoing cohort for those enrolled in the Certificate.prereq: Teaching license, [CI 5463 or enrolled in the Certificate for Teaching Writing and Critical Literacy]",
    "prereq": {
      "code": "CI 5463",
      "subject": "CI",
      "id": "5463"
    }
  },
  {
    "uid": "814044",
    "code": "CI5471",
    "subject": "CI",
    "number": "5471",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in English Education",
    "fullname": "Clinical Experience in Teaching Secondary English",
    "info": "Initial licensure candidates in English Education will observe the teaching and learning experience in a school and classroom context; implement approaches, assessments, and philosophies learned about in corresponding methods courses; reflect upon the complexities of classroom life in a seminar format; and co-plan and co-teach a five-day unit.prereq: Must register same semester as CI 5441 and CI 5451.",
    "prereq": {
      "and": [
        {
          "code": "CI 5441",
          "subject": "CI",
          "id": "5441"
        },
        {
          "code": "CI 5451",
          "subject": "CI",
          "id": "5451"
        }
      ]
    }
  },
  {
    "uid": "004337",
    "code": "CI5472",
    "subject": "CI",
    "number": "5472",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Media Analysis",
    "fullname": "Teaching Critical Media Analysis inSchools",
    "info": "\"Critical\" media literacy means that we focus on, among other things, analyzing the intersection between media and issues of identity -- like gender, race, class and sexuality. We also focus on how to teach critical media analysis to students and others.",
    "prereq": []
  },
  {
    "uid": "811130",
    "code": "CI5474",
    "subject": "CI",
    "number": "5474",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Texts and Digital Read",
    "fullname": "New Literacies Frameworks and Instruction:  Digital Texts and Digital Reading",
    "info": "Read digital texts against backdrop of traditional print-based notions of reading, literacy, school curricula/instruction. Assists education professionals in making school/district-wide decisions based on sound research on digital reading/new literacies.  ",
    "prereq": []
  },
  {
    "uid": "801654",
    "code": "CI5475",
    "subject": "CI",
    "number": "5475",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Digital Writing",
    "fullname": "Teaching Digital Writing",
    "info": "Blogs, wikis, online discussion. Database searches. Integration of images, audio, video, text. Digital note-taking, mapping, storytelling. Online discussions, collaborative writing. Audio production. Formatting/design techniques. Online evaluation. E-portfolios.",
    "prereq": []
  },
  {
    "uid": "004349",
    "code": "CI5481",
    "subject": "CI",
    "number": "5481",
    "honors": false,
    "writingIntensive": false,
    "name": "Dev Tchng Eng & Speech",
    "fullname": "Developments in Teaching English and Speech",
    "info": "Current theories of English/speech curriculum. Teaching oral language. Organizing curriculum. Linking components of English/speech curriculum. Reflecting on pre-student-teaching experience.",
    "prereq": []
  },
  {
    "uid": "005450",
    "code": "CI5482",
    "subject": "CI",
    "number": "5482",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading, Lang, Lit/Intermediat",
    "fullname": "Reading, Language Arts, and Literature: Intermediate",
    "info": "Curricular and methodological issues of reading, language arts, and children.s literature. Evaluating children's literature, response to literature, reading/writing processes, strategy instruction for word recognition/comprehension, authentic assessment strategies, teaching diverse students in upper elementary grades.prereq: Elem ed initial licensure only",
    "prereq": []
  },
  {
    "uid": "817059",
    "code": "CI5483",
    "subject": "CI",
    "number": "5483",
    "honors": false,
    "writingIntensive": false,
    "name": "Crit Lit, Storytelling, Drama",
    "fullname": "Critical Literacy, Storytelling, and Creative Drama",
    "info": "This course examines and embodies how storytelling and creative drama can be used as tools to help develop students’ critical literacy and to assist them in becoming more fluent readers and writers. Critical literacy is the focus; theater and storytelling are the vehicles. Key topics to be covered include: 1) A historical background on fairy and folk tales, legends, fables, myths, and the different oral traditions; 2) Tools for developing a critical view of diverse tales; 3) Practical instruction on how to use storytelling and story genres in the classroom to develop critical literacy; 4) Assessing storytelling work in the classroom. Students will meet in the first week at the University to learn tools of the Neighborhood Bridges program and in the second week will practice and observe each other’s teaching with local school classrooms. In the past we have worked with 4th graders and 6th graders, though we will also discuss how course content applies to high school students. The class meets for two intensive weeks in person, however, we additionally assign pre-readings and post-class reflections and papers.",
    "prereq": []
  },
  {
    "uid": "817186",
    "code": "CI5484",
    "subject": "CI",
    "number": "5484",
    "honors": false,
    "writingIntensive": false,
    "name": "Improving ELA Instruction Pt 1",
    "fullname": "Improving Secondary English Language Arts Instruction: Part I",
    "info": "This online course is designed for secondary literacy teachers, including those in communication arts and literature. The purpose of this course is for secondary English Language Arts (ELA) teachers to examine their practice in a collaborative community and to improve teacher effectiveness through ongoing feedback from the instructor and other participants. The course will provide support through small group discussions and peer and instructor response. Key topics to be covered include: 1) frameworks for understanding teacher growth in ELA contexts; 2) developing an ELA classroom ecology; and 3) supporting and assessing student learning in the ELA Common Core Standards. This 1.5-credit course was designed in a sequence with CI 5485: Improving Secondary English Language Arts Instruction: Part II.",
    "prereq": []
  },
  {
    "uid": "817187",
    "code": "CI5485",
    "subject": "CI",
    "number": "5485",
    "honors": false,
    "writingIntensive": false,
    "name": "Improving ELA Instruction Pt 2",
    "fullname": "Improving Secondary English Language Arts Instruction: Part II",
    "info": "This online course is designed for secondary literacy teachers, including those in communication arts and literature. The purpose of this course is for secondary English Language Arts (ELA) teachers to examine their practice in a collaborative community and to improve teacher effectiveness through ongoing feedback from the instructor and other participants. The course will provide support through small group discussions and peer and instructor response. This 1.5-credit course was designed in a sequence with CI 5484: Improving Secondary English Language Arts Instruction: Part I. This second course in the sequence will focus on teacher-driven professional inquiry that participants began developing in CI 5484. prereq: Successful completion of CI 5484.",
    "prereq": {
      "code": "CI 5484",
      "subject": "CI",
      "id": "5484"
    }
  },
  {
    "uid": "817664",
    "code": "CI5493",
    "subject": "CI",
    "number": "5493",
    "honors": false,
    "writingIntensive": false,
    "name": "MN Writing Proj Dir Studies",
    "fullname": "Minnesota Writing Project Directed Studies",
    "info": "Directed study for teachers involved in MWP. Capstone course for those enrolled in the Certificate in Teaching Writing and Critical Literacy. Teachers investigate current theory and practice of literacy instruction. Ongoing cohort for those enrolled in the Certificate. prereq: Teaching license, [CI 5463 or enrolled in the Certificate for Teaching Writing and Critical Literacy] or instructor permission.",
    "prereq": {
      "code": "CI 5463",
      "subject": "CI",
      "id": "5463"
    }
  },
  {
    "uid": "004345",
    "code": "CI5496",
    "subject": "CI",
    "number": "5496",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Exp: Teaching English",
    "fullname": "Directed Experiences in Teaching English",
    "info": "Student teaching/clinical experience for English Education (Comm Arts & Lit) initial licensure and middle level endorsement students. Credits vary depending on length of field experience and should be determined with your academic adviser.prereq: MEd/initial licensure students in English ed only",
    "prereq": []
  },
  {
    "uid": "005200",
    "code": "CI5500",
    "subject": "CI",
    "number": "5500",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topics: Outdoor Sci Ed",
    "fullname": "Special Topics: Outdoor Science Education",
    "info": "Classroom and fieldwork activities aimed at increasing the knowledge and interest of students in teaching outdoor in all seasons. Topics include snow and ice ecology, the timber wolf and white-tailed deer, pond ecology, Twin Cities' geology, trees and plants of Minnesota, and stargazing.",
    "prereq": []
  },
  {
    "uid": "005198",
    "code": "CI5501",
    "subject": "CI",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach Sci/Health Elem Sch",
    "fullname": "Teaching Science and Health in the Elementary School",
    "info": "Methods and materials for teaching science and health at the elementary school level.",
    "prereq": []
  },
  {
    "uid": "807030",
    "code": "CI5502",
    "subject": "CI",
    "number": "5502",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci Instruction  Elem Grades",
    "fullname": "Science Instruction in the Elementary Grades",
    "info": "Methods/materials for teaching science/health at elementary school level.prereq: Early Childhood or Elementary Education ILP",
    "prereq": []
  },
  {
    "uid": "005201",
    "code": "CI5504",
    "subject": "CI",
    "number": "5504",
    "honors": false,
    "writingIntensive": false,
    "name": "Elem Sch Sci: Mat/ Resources",
    "fullname": "Elementary School Science: Materials and Resources",
    "info": "Examination of the teacher's role in inquiry teaching; the current science curriculum; and resources for teaching science in the elementary school.prereq: Elem tchg exper or instr consent",
    "prereq": []
  },
  {
    "uid": "797440",
    "code": "CI5505",
    "subject": "CI",
    "number": "5505",
    "honors": false,
    "writingIntensive": false,
    "name": "Middle School Science Methods",
    "fullname": "Middle School Science Methods",
    "info": "Methods of planning/teaching inquiry-based science. Students observe, analyze, and teach inquiry-based lessons.prereq: Elem ed licensure student",
    "prereq": []
  },
  {
    "uid": "811543",
    "code": "CI5511",
    "subject": "CI",
    "number": "5511",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab-based Science Instruction",
    "fullname": "Introduction to Secondary Science: Laboratory-based Instruction",
    "info": "Inquiry about teaching/learning, observing/analyzing instruction, reflecting on own/each other's science teaching. How to use various instructional techniques/methods.     ",
    "prereq": []
  },
  {
    "uid": "811544",
    "code": "CI5512",
    "subject": "CI",
    "number": "5512",
    "honors": false,
    "writingIntensive": false,
    "name": "Nature of Science Methods",
    "fullname": "Secondary Science Methods: Understanding the Nature of Science",
    "info": "Inquiry about teaching/learning, observing/analyzing instruction, reflecting on own/each other's science teaching. How to use various instructional techniques/reflect upon teaching. Develops understanding of research-based instructional methods in secondary science classrooms.",
    "prereq": []
  },
  {
    "uid": "811545",
    "code": "CI5513",
    "subject": "CI",
    "number": "5513",
    "honors": false,
    "writingIntensive": false,
    "name": "Equity in Science: Methods",
    "fullname": "Secondary Science Methods: Equity in Science Teaching",
    "info": "Inquiry about teaching/learning, observing/analyzing instruction, reflecting on own/each other's science teaching. How to use various instructional techniques/reflect upon teaching. Develops understanding of equitable science teaching practices/safe student-centered classroom culture.",
    "prereq": []
  },
  {
    "uid": "811549",
    "code": "CI5514",
    "subject": "CI",
    "number": "5514",
    "honors": false,
    "writingIntensive": false,
    "name": "Science Learning Environment",
    "fullname": "Secondary Science Methods: The Science Learning Environment",
    "info": "Inquiry about teaching/learning, observing/analyzing instruction, reflecting on science teaching. How to use various instructional techniques, reflect upon professional growth using evidence from  teaching. Identify goals/instruction plans for professional practice.",
    "prereq": []
  },
  {
    "uid": "811550",
    "code": "CI5515",
    "subject": "CI",
    "number": "5515",
    "honors": false,
    "writingIntensive": false,
    "name": "Science Adaptive Expertise",
    "fullname": "Secondary Science Methods: Developing Adaptive Expertise",
    "info": "Inquiry about teaching/learning, observing/analyzing instruction, reflecting on science teaching. How to use various instructional techniques, reflect upon professional growth using evidence from teaching. Identify goals/instruction plans for professional practice.",
    "prereq": []
  },
  {
    "uid": "803928",
    "code": "CI5530",
    "subject": "CI",
    "number": "5530",
    "honors": false,
    "writingIntensive": false,
    "name": "Secondary Science Methods I",
    "fullname": "Secondary Science Methods I",
    "info": "Lab-based science teaching in secondary school setting. Research-based teaching strategies are modeled that address national-/state-level standards. How to use various inquiry-based instructional techniques/methods.",
    "prereq": []
  },
  {
    "uid": "005202",
    "code": "CI5531",
    "subject": "CI",
    "number": "5531",
    "honors": false,
    "writingIntensive": false,
    "name": "Secondary Science Methods II",
    "fullname": "Secondary Science Methods II",
    "info": "Methods of planning/teaching science to middle school students.prereq: Initial licensure student in science ed and CI 5530 Secondary Science Methods 1",
    "prereq": {
      "code": "CI 5530",
      "subject": "CI",
      "id": "5530"
    }
  },
  {
    "uid": "006285",
    "code": "CI5532",
    "subject": "CI",
    "number": "5532",
    "honors": false,
    "writingIntensive": false,
    "name": "Secondary Science Methods III",
    "fullname": "Secondary Science Methods III",
    "info": "Methods of planning/teaching science for secondary school students.prereq: Admission to initial licensure program in science and CI 5531 Secondary Science Methods II",
    "prereq": {
      "code": "CI 5531",
      "subject": "CI",
      "id": "5531"
    }
  },
  {
    "uid": "006283",
    "code": "CI5533",
    "subject": "CI",
    "number": "5533",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Dev in Sci Teaching",
    "fullname": "Current Developments in Science Teaching",
    "info": "Using curriculum standards to design science courses.prereq: MEd, initial licensure, grad student, or instr consent",
    "prereq": []
  },
  {
    "uid": "008349",
    "code": "CI5534",
    "subject": "CI",
    "number": "5534",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies in Science Education",
    "fullname": "Studies in Science Education",
    "info": "Improvement of science teaching through the application of research findings.prereq: M.Ed., init lic, or instr consent",
    "prereq": []
  },
  {
    "uid": "006284",
    "code": "CI5535",
    "subject": "CI",
    "number": "5535",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Sci Ed",
    "fullname": "Foundations of Science Education",
    "info": "Analysis of present science teaching practices in light of historical and philosophical foundations of science education.prereq: M.Ed., grad student, or instr consent",
    "prereq": []
  },
  {
    "uid": "008345",
    "code": "CI5536",
    "subject": "CI",
    "number": "5536",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci Ed Equity/Policy/Assessmnt",
    "fullname": "Equity, Policy, and Assessment in Science Education",
    "info": "Nature of equity, diversity, and policy matters that influence schools/teachers involved in science teaching and scientific literacy. Classroom presentations, discussions, readings in current research.prereq: Med, or grad student, or instr consent",
    "prereq": []
  },
  {
    "uid": "796317",
    "code": "CI5537",
    "subject": "CI",
    "number": "5537",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Education",
    "fullname": "Principles of Environmental Education",
    "info": "Critical review of Environmental Education, its history, theories, curricula, teaching methods, and assessment practices. Development of an exemplary unit plan for teaching environmental studies.prereq: Undergrad in NRES or M.Ed. or grad student in education or instr consent",
    "prereq": []
  },
  {
    "uid": "797762",
    "code": "CI5538",
    "subject": "CI",
    "number": "5538",
    "honors": false,
    "writingIntensive": false,
    "name": "Action Research in Sci Ed",
    "fullname": "Action Research in Science Education",
    "info": "This course is designed to accomplish several main goals for those enrolled: (1) articulate their own understanding of what it means for there to be equity in science education and how their personal interpretation aligns with existing frameworks for viewing equity; (2) become familiar with interactions between equity and educational policies, including standardized testing, school organization, and teacher preparation in Minnesota; (3) design and conduct an investigation around a classroom dilemma pertaining to an issue of equity.",
    "prereq": []
  },
  {
    "uid": "797763",
    "code": "CI5539",
    "subject": "CI",
    "number": "5539",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci Instruction First years",
    "fullname": "Improving Secondary Science Instruction: Surviving the First Two Years",
    "info": "Students reflect on their instruction and student learning during first years of teaching. Monthly meetings, observations, online discussion. Classroom management, planning, inquiry-based teaching, assessment, equity in the classroom.prereq: MEd science education student, in first three years of teaching",
    "prereq": []
  },
  {
    "uid": "005207",
    "code": "CI5540",
    "subject": "CI",
    "number": "5540",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topics: Science Ed",
    "fullname": "Special Topics: Science Education",
    "info": "Detailed examination and practice of the teaching of one area of science (e.g. geology, health, physical science) or one method of instruction (e.g. laboratories, demonstrations, Internet, simulations).",
    "prereq": []
  },
  {
    "uid": "808746",
    "code": "CI5541",
    "subject": "CI",
    "number": "5541",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Hist & Nature of Sci",
    "fullname": "Teaching History and Nature of Science",
    "info": "Understanding nature of science(NOS). Integrate/reflect on  NOS in secondary science classroom. Historical cases/integrating NOS with science content/scientific inquiry.prereq: MEd ILP or professional studies student in science education or instr consent",
    "prereq": []
  },
  {
    "uid": "814231",
    "code": "CI5551",
    "subject": "CI",
    "number": "5551",
    "honors": false,
    "writingIntensive": false,
    "name": "Science Classroom Practices I",
    "fullname": "Reflecting on Science Classroom Practices I",
    "info": "Students reflect on their instruction and student learning during first years of teaching. Monthly meetings, observations, online discussion. Classroom management, planning, inquiry-based teaching, assessment, equity in the classroom.",
    "prereq": []
  },
  {
    "uid": "814237",
    "code": "CI5552",
    "subject": "CI",
    "number": "5552",
    "honors": false,
    "writingIntensive": false,
    "name": "Science Classroom Practices II",
    "fullname": "Reflecting on Science Classroom Practices II",
    "info": "Students reflect on their instruction and student learning during first years of teaching. Monthly meetings, observations, online discussion. Classroom management, planning, inquiry-based teaching, assessment, equity in the classroom.",
    "prereq": []
  },
  {
    "uid": "005209",
    "code": "CI5596",
    "subject": "CI",
    "number": "5596",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Exp: Mid School Sci",
    "fullname": "Clinical Experience in Middle School Science",
    "info": "Supervised clinical experience in middle school science teaching.",
    "prereq": []
  },
  {
    "uid": "008348",
    "code": "CI5597",
    "subject": "CI",
    "number": "5597",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Exp: Scndry Sci Teach",
    "fullname": "Clinical Experience in Secondary School Science Teaching",
    "info": "Supervised clinical experience in secondary school science teaching.prereq: initial licensure or instr consent",
    "prereq": []
  },
  {
    "uid": "817137",
    "code": "CI5608",
    "subject": "CI",
    "number": "5608",
    "honors": false,
    "writingIntensive": false,
    "name": "CARLA Institute Seminar",
    "fullname": "CARLA Summer Institute Seminar",
    "info": "The Center for Advanced Research on Language Acquisition (CARLA) offers a series of intensive summer institutes to provide timely professional development for foreign language and ESL educators throughout the country. The special topics offered under CI 5608 are designed to provide language teachers with the latest research-based information and best practices skill development as the field of language instruction evolves.  Each institute is highly interactive and includes discussion, theory-building, hands-on activities, and plenty of networking opportunities with colleagues from around the world. ",
    "prereq": []
  },
  {
    "uid": "826337",
    "code": "CI5609",
    "subject": "CI",
    "number": "5609",
    "honors": false,
    "writingIntensive": false,
    "name": "Transnational Multilingual Lit",
    "fullname": "Transnational and Multilingual Literacies",
    "info": "This course is designed for students in curriculum and instruction, multilingual education, teacher education, and related fields. Through the class, students investigate the literate practices multilingual students use such as translanguaging (code-meshing, translating, language crossing). Participants learn to build on students’ out-of-school (transnational/community) literacy practices to improve instructional practices. Prerequisites include graduate student status.",
    "prereq": []
  },
  {
    "uid": "811551",
    "code": "CI5611",
    "subject": "CI",
    "number": "5611",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Linguistics",
    "fullname": "Principles of Linguistics",
    "info": "Introduction to linguistics for ESL teachers. Linguistic terminology/analysis. Theories/research about first/other language learning. Analyze educational implications of language use, learning, policy.",
    "prereq": []
  },
  {
    "uid": "811552",
    "code": "CI5612",
    "subject": "CI",
    "number": "5612",
    "honors": false,
    "writingIntensive": false,
    "name": "ESL Multilingual Development",
    "fullname": "ESL Methods for Multilingual Development",
    "info": "Introduction to methods of developing reading, writing, speaking, listening skills among English learners in K-12. Reflect on beliefs/ideas, cultivate orientation towards reflective teaching/life-long learning.",
    "prereq": []
  },
  {
    "uid": "811555",
    "code": "CI5613",
    "subject": "CI",
    "number": "5613",
    "honors": false,
    "writingIntensive": false,
    "name": "Testing for English Learners",
    "fullname": "Testing and Assessment for English Learners",
    "info": "Develop awareness of/familiarity with policies, procedures, practices in use in attempting to determine academic readiness of students learning English as secondary language in American public schools.",
    "prereq": []
  },
  {
    "uid": "811556",
    "code": "CI5614",
    "subject": "CI",
    "number": "5614",
    "honors": false,
    "writingIntensive": false,
    "name": "ESL Curriculum and Materials",
    "fullname": "Curriculum and Materials Development for English Learners",
    "info": "Explore role ESL teachers play in curriculum/materials development. Historical overview of curriculum development in second language education, factors that influence curriculum development, range of models for curriculum development tailored to English learners.",
    "prereq": []
  },
  {
    "uid": "811557",
    "code": "CI5615",
    "subject": "CI",
    "number": "5615",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic English for ESL",
    "fullname": "Academic English for English Learners: Planning, Assessment, Instruction",
    "info": "Prepares ESL teacher candidates to develop academic English skills of English learners of various proficiencies through bilingual teaching strategies. Prepares students to offer leadership with colleagues from content areas to integrate language/content. Includes focused study of advanced-level syntactic structures/completion of edTPA.",
    "prereq": []
  },
  {
    "uid": "808134",
    "code": "CI5617",
    "subject": "CI",
    "number": "5617",
    "honors": false,
    "writingIntensive": false,
    "name": "Acad. Lang. & Eng. Learner I",
    "fullname": "Academic Language and English Learners I",
    "info": "Working with English learners and other linguistically diverse students across content areas to develop academic language proficiency.prereq: Enrolled in teacher initial licensure program",
    "prereq": []
  },
  {
    "uid": "808136",
    "code": "CI5618",
    "subject": "CI",
    "number": "5618",
    "honors": false,
    "writingIntensive": false,
    "name": "Acad.Lang. & Eng. Learners II",
    "fullname": "Academic Language and English Learners II",
    "info": "Working with English learners and linguistically diverse students across all content areas to develop academic language proficiency.prereq: Enrolled in teacher initial licensure program",
    "prereq": []
  },
  {
    "uid": "004274",
    "code": "CI5619",
    "subject": "CI",
    "number": "5619",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach World Lang Culture Elem",
    "fullname": "Teaching World Languages and Cultures in Elementary Settings",
    "info": "Methods/materials for elementary world language instruction; development of oral communication/literacy in world languages; world language program design; global awareness/cross-cultural experience; children's language; children's literature, games, and songs; planning/development of units and lessons.",
    "prereq": []
  },
  {
    "uid": "805116",
    "code": "CI5620",
    "subject": "CI",
    "number": "5620",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro SLA for Language Tchr",
    "fullname": "Introduction to Second Language Acquisition for Language Teachers",
    "info": "Current research and theory in the area of second language acquisition (SLA). Topics include the similarities and differences across first and second language acquisition; the role of individual differences in language learning (including age, first language, aptitude among others). Implications for sociolinguistic diversity in the United States. ",
    "prereq": []
  },
  {
    "uid": "804033",
    "code": "CI5621",
    "subject": "CI",
    "number": "5621",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture as Core:SecLangClassrm",
    "fullname": "Culture as the Core in the Second Language Classroom",
    "info": "How language teachers foster development of intercultural communicative competence through a pedagogical approach that addresses the nature of culture and culture learning, and the interrelatedness of language and culture learning.",
    "prereq": []
  },
  {
    "uid": "804034",
    "code": "CI5622",
    "subject": "CI",
    "number": "5622",
    "honors": false,
    "writingIntensive": false,
    "name": "Exploring Learner Language",
    "fullname": "Exploring Learner Language: Puzzles and Tools for the Classroom",
    "info": "The focus of this institute is on the growth and development of learners’ language, and how that growth may be enhanced by ongoing pedagogical innovation. The institute uses Exploratory Practice to promote a culture of instructor initiative in identifying and seeking to solve puzzles related to learner language development in the classroom.Participants begin with an introduction to Exploratory Practice as a framework for instructors to use in identifying and wrestling with their own puzzles about learners’ language and its development in their classrooms. Participants then work together to reflect on videos of learner language as it is produced by different kinds of learners.  They review theories of second language acquisition, and apply their insights to their own classrooms by learning how to set up engaging puzzle-solving activities that stimulate growth in learner language.  Finally, participants learn how to design pre- and post-course measures that demonstrate the impact of their innovations in instruction on the growth of specific features and dimensions of learner language in their own classrooms.",
    "prereq": []
  },
  {
    "uid": "804035",
    "code": "CI5623",
    "subject": "CI",
    "number": "5623",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategies-based Instruction",
    "fullname": "Improving Language Learning: A Practical Course in Styles- and Strategies-based Instruction",
    "info": "Learner-focused approach to teaching that helps students understand and make the most of their own learning styles/strategies. Participants create materials/lessons and explore ways to incorporate strategies into their own language curricula.",
    "prereq": []
  },
  {
    "uid": "804036",
    "code": "CI5624",
    "subject": "CI",
    "number": "5624",
    "honors": false,
    "writingIntensive": false,
    "name": "Content-based curriculum",
    "fullname": "Content-based Language Instruction and Curriculum Development",
    "info": "Intensive professional development to help foreign language teachers learn to implement the CBI curricular approach in the language classroom. Introduces all phases of CBI curricular development and provides resources necessary to ensure successful implementation.",
    "prereq": []
  },
  {
    "uid": "804037",
    "code": "CI5625",
    "subject": "CI",
    "number": "5625",
    "honors": false,
    "writingIntensive": false,
    "name": "Second Language Assessment",
    "fullname": "Assessing Language Learners’ Communication Skills via Authentic Communicative Performance Tasks",
    "info": "This institute opens with a discussion of the phrase “performance towards proficiency” to highlight how classroom performance influences proficiency in real world contexts. Working together, participants will create a list of characteristics of classroom activities and tasks that build learners’ proficiency in the target language and will use the list to identify the purpose, effectiveness, and practicality of a variety of model activities and tasks. With this background, participants will design receptive and productive communicative tasks for beginning, intermediate, and advanced levels of proficiency. The institute will then focus on the evaluation of the learners’ performance on these tasks. Using the performance descriptors identified by the American Council on the Teaching of Foreign Languages (ACTFL), the Common European Framework of Reference (CEFR), and the World-Class Instructional Design and Assessment (WIDA), participants will identify the domains (vocabulary, language control, text type, etc.) to evaluate learner performance on various tasks. With model rubric scales, they will evaluate examples of learner performances on various tasks, comparing their individual ratings to underline the importance of establishing inter-rater reliability. Participants will then create rubrics for the tasks they designed earlier in the institute. The role and choice of formative assessments used in daily lessons to monitor learner progress towards achievement of the communication goals of an instructional unit will also be considered. As a capstone to the week, participants will apply their learning about task design and evaluation in the development of a standards-based Integrated Performance Assessment (IPA) to share with colleagues within this institute and also with a broader audience via the CARLA Assessment website.",
    "prereq": []
  },
  {
    "uid": "804039",
    "code": "CI5626",
    "subject": "CI",
    "number": "5626",
    "honors": false,
    "writingIntensive": false,
    "name": "Develop Sociocult Competence",
    "fullname": "Developing Learners' Sociocultural Competence",
    "info": "Overview of how to incorporate a pragmatics component into second/foreign language curriculum to enhance learners' sociocultural competence. Includes approaches to teaching/evaluating pragmatics.",
    "prereq": []
  },
  {
    "uid": "817982",
    "code": "CI5627",
    "subject": "CI",
    "number": "5627",
    "honors": false,
    "writingIntensive": false,
    "name": "Creativity in the Classroom",
    "fullname": "Creativity in the Second Language Classroom",
    "info": "This institute will examine the connection between multilingualism and creativity, and explore strategies to increase engagement in the classroom. This institute is designed for foreign language, ESL, and immersion teachers who want to promote creativity in their classroom while simultaneously improving learners target language proficiency.",
    "prereq": []
  },
  {
    "uid": "810065",
    "code": "CI5628",
    "subject": "CI",
    "number": "5628",
    "honors": false,
    "writingIntensive": false,
    "name": "Learner Lang. in SLA",
    "fullname": "Analyzing Learner Language in Second Language Acquisition",
    "info": "Review broad findings in second language acquisition (SLA) research. Cognitive/social process of becoming multilingual. How to carry out classroom-based research projects focused on learner language development.prereq: 5646, 5649 [or other course on the grammar of a language]",
    "prereq": {
      "and": [
        {
          "code": "CI 5646",
          "subject": "CI",
          "id": "5646"
        },
        {
          "code": "CI 5649",
          "subject": "CI",
          "id": "5649"
        }
      ]
    }
  },
  {
    "uid": "825285",
    "code": "CI5629",
    "subject": "CI",
    "number": "5629",
    "honors": false,
    "writingIntensive": false,
    "name": "Language and Social Justice Ed",
    "fullname": "Teaching Language through the Lens of Social Justice",
    "info": "Teaching for and about social justice positively influences all students, yet social justice education can be challenging to integrate into the language classroom. In the first part of this institute, participants will examine the principles of social justice education and identify ways that these principles can support standards, objectives, and targeted skills in contemporary world language education. This discussion and reflection will help teachers to identify their own interests and strengths in becoming language educators for social justice.In the second part of the institute, the participants will build on this foundation to adapt, develop, and create learning opportunities for their foreign language students. A collaborative, creative set  of experiences will help participants go from big ideas to activities and assessments for their classroom, all while teaching for and about social justice.",
    "prereq": []
  },
  {
    "uid": "004273",
    "code": "CI5631",
    "subject": "CI",
    "number": "5631",
    "honors": false,
    "writingIntensive": false,
    "name": "Second Lang Curr Dev/Assess",
    "fullname": "Second Language Curriculum Development and Assessment",
    "info": "Instruction/assessment of ESL and World Languages in the modalities of speaking, listening, reading, and writing. Backwards design, proficiency-oriented approach, use of content-based instruction. Planning for the integration of instruction and assessment.\n\nprereq: SLE initial licensure only",
    "prereq": []
  },
  {
    "uid": "004333",
    "code": "CI5632",
    "subject": "CI",
    "number": "5632",
    "honors": false,
    "writingIntensive": false,
    "name": "Literacy & Language Dev in SLC",
    "fullname": "Literacy and Language Development in Second Language Classrooms",
    "info": "Processes/instructional approaches in developing second language proficiency in the modalities of reading, writing, speaking, and listening and communicative modes (interpretive, presentational, interpersonal); development of literacy in a second language; planning L2 literacy instruction based on research on L1 and L2 literacy development; integration of instruction/assessment in language teaching.\n\nprereq: SLE initial licensure only",
    "prereq": []
  },
  {
    "uid": "004335",
    "code": "CI5634",
    "subject": "CI",
    "number": "5634",
    "honors": false,
    "writingIntensive": false,
    "name": "Content-Base Inst Second Lang",
    "fullname": "Content-Based Instruction in Second Language Settings",
    "info": "Building on foundation from other courses in the sequence. Instruction/assessment of ESL and World Languages at the secondary level. Prepares students to connect language teaching with other content areas, analyze/address the academic language needs of English learners, and advocate for second language programs and students.\n\nprereq: SLE initial licensure only",
    "prereq": []
  },
  {
    "uid": "004279",
    "code": "CI5635",
    "subject": "CI",
    "number": "5635",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture/Diversity Second Lang",
    "fullname": "Culture and Diversity in Second Language Classrooms",
    "info": "Teaching culture as content and including students' home cultures in the curriculum and diverse student needs. Needs of students of various educational, social, and cultural backgrounds/ways to develop academic success through instruction in learning strategies and other approaches to differentiation.\n\nprereq: Initial licensure program only",
    "prereq": []
  },
  {
    "uid": "817326",
    "code": "CI5636",
    "subject": "CI",
    "number": "5636",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Career Teachers Part 1",
    "fullname": "Problems of Practice in Second Language Education: Seminar for Early Career Language Teachers Part 1",
    "info": "This course provides recently licensed practicing teachers an opportunity to continue to develop their skills as reflective practitioners within the context of World Languages and ESL with a focus on their own teaching practices and student learning. Participants engage in online discussions, read, reflect, and create professional growth plans.",
    "prereq": []
  },
  {
    "uid": "817340",
    "code": "CI5637",
    "subject": "CI",
    "number": "5637",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Career Teachers Part 2",
    "fullname": "Problems of Practice in Second Language Education: Seminar for Early Career Language Teachers Part 2",
    "info": "In this course, recently licensed practicing teachers continue to develop their skills as reflective practitioners within the context of World Languages and ESL with a focus on their own teaching practices and student learning. Participants engage in online discussions, read, reflect, and implement and report on professional growth plans.Prerequisite: Completion of CI 5636 or instructor consent.",
    "prereq": {
      "code": "CI 5636",
      "subject": "CI",
      "id": "5636"
    }
  },
  {
    "uid": "818789",
    "code": "CI5638",
    "subject": "CI",
    "number": "5638",
    "honors": false,
    "writingIntensive": false,
    "name": "Heritage Language Education",
    "fullname": "Critical Approaches to Heritage Language Education",
    "info": "Teaching heritage learners is not the same as teaching learners of a foreign language. Heritage languages are languages other than English that are spoken in homes, communities, and extended families. Although many of our students come from vibrant multilingual contexts, unless bilingual options are available, youth seldom have access to expanding their home/community languages (and literacy in them) in schools, which are predominantly English environments. When students are given the opportunity to use, learn, and expand on their heritage languages, they are able to tap into an abundance of resources and knowledge.Participants in this workshop will examine social justice topics, community-based learning for growing heritage language (literacy), and authentic assessments for heritage language development. Participants will collaborate; connect experiences of heritage teachers and learners to research on multilingual development; and learn how to bring communities, classrooms, and digital storytelling together to create powerful heritage language learning environments. ",
    "prereq": []
  },
  {
    "uid": "015659",
    "code": "CI5641",
    "subject": "CI",
    "number": "5641",
    "honors": false,
    "writingIntensive": false,
    "name": "Language, Culture, & Education",
    "fullname": "Language, Culture, and Education",
    "info": "Applies current sociolinguistic and discourse theory/research to study of relationships between language and culture in educational settings: language curriculum and instruction; classroom language use; borders between school and home/community language use; and educational policies on literacy/second-language instruction.",
    "prereq": []
  },
  {
    "uid": "004278",
    "code": "CI5642",
    "subject": "CI",
    "number": "5642",
    "honors": false,
    "writingIntensive": false,
    "name": "Assessing English Learners",
    "fullname": "Assessing English Learners",
    "info": "Current practices concerning language and academic content assessment of English learners (ELs) at the school site, state, and national level; factors affecting academic learning needs of ELs/where assessment fits into that picture.",
    "prereq": []
  },
  {
    "uid": "004332",
    "code": "CI5644",
    "subject": "CI",
    "number": "5644",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach ELs Content Area Class",
    "fullname": "Teaching English Learners in Content-Area Classrooms",
    "info": "Benefits and challenges of working with English learners (ELs) and linguistically and culturally diverse students in mainstream content classrooms. Instructional practices and strategies for teaching ELs in secondary content area classrooms; language learning and bilingualism; cultural differences.",
    "prereq": []
  },
  {
    "uid": "807121",
    "code": "CI5645",
    "subject": "CI",
    "number": "5645",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching English Learners",
    "fullname": "Teaching English Learners in English-medium classrooms",
    "info": "The course is designed to give teaching licensure candidates grounding in theory and practice for teaching linguistically and culturally diverse students. This course provides an overview of the benefits and challenges of working with English learners (ELs) and linguistically and culturally diverse students in a variety of settings. Central topics include instructional practices and strategies for teaching English learners; second language literacy and biliteracy development; language learning and bilingualism; and culturally responsive pedagogy. The course is designed to help teacher candidates to develop an understanding of the language-specific challenges that accompany subject matter learning and to demonstrate the ability to apply a range of instructional strategies to help English learners succeed academically.  \n\nprereq: Early Childhood or Elementary Education ILP or Special Education Major or Special Education M.Ed./M.A candidates",
    "prereq": []
  },
  {
    "uid": "788802",
    "code": "CI5646",
    "subject": "CI",
    "number": "5646",
    "honors": false,
    "writingIntensive": false,
    "name": "Grammar for Language Teachers",
    "fullname": "Grammar for Language Teachers",
    "info": "Syntax from a pedagogical perspective. Grammatical structures that challenge language learners.  Issues/activities related to teaching grammar in English and other languages.prereq: LING 5001 or instr consent",
    "prereq": {
      "code": "LING 5001",
      "subject": "LING",
      "id": "5001"
    }
  },
  {
    "uid": "797956",
    "code": "CI5647",
    "subject": "CI",
    "number": "5647",
    "honors": false,
    "writingIntensive": false,
    "name": "Immigrants with ltd. schooling",
    "fullname": "Teaching Middle and Secondary Immigrant and Refugee Students With Limited Formal Schooling",
    "info": "Academic/social/political factors that affect students? success in school. Strategies for teaching. Programmatic choices.",
    "prereq": []
  },
  {
    "uid": "809115",
    "code": "CI5648",
    "subject": "CI",
    "number": "5648",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Academic Language",
    "fullname": "Advanced Practices in Teaching Academic Language",
    "info": "Prepares K-12 teachers for student development of academic language proficiency. Read/discuss current research. Implement innovative teaching practices.prereq: Grad student, instr consent",
    "prereq": []
  },
  {
    "uid": "810068",
    "code": "CI5649",
    "subject": "CI",
    "number": "5649",
    "honors": false,
    "writingIntensive": false,
    "name": "ESL Teaching Lang. Analysis",
    "fullname": "Language Analysis for ESL Teaching in Higher Ed",
    "info": "Overview of complex aspects of English grammar not covered in 5646. Academic uses of passives, indirect objects, conditionals, relative clauses, complementation, reported speech, deixis/reference, articles, prepositions, phrasal verbs, pragmatics.prereq: 5646",
    "prereq": {
      "code": "CI 5646",
      "subject": "CI",
      "id": "5646"
    }
  },
  {
    "uid": "005316",
    "code": "CI5651",
    "subject": "CI",
    "number": "5651",
    "honors": false,
    "writingIntensive": false,
    "name": "Found of Second Lang Ed",
    "fullname": "Foundations of Second Languages and Cultures Education",
    "info": "Historical overview of second language teaching/learning in U.S. introduction to second language acquisition. Second language instructional concepts across elementary, secondary/university options for foreign language, bilingual education, immersion language programs, and English as a second language programs. Theoretical frameworks for language instruction are tied to practice.",
    "prereq": []
  },
  {
    "uid": "006290",
    "code": "CI5652",
    "subject": "CI",
    "number": "5652",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Cult in Second Lang Class",
    "fullname": "Integrating Culture in the Second Language Classroom",
    "info": "Exploration of culture in second language contexts. Rationale for and process of implementing cultural awareness, culture learning, and the integration of language and culture instruction as integral to effective second language development.   ",
    "prereq": []
  },
  {
    "uid": "810066",
    "code": "CI5653",
    "subject": "CI",
    "number": "5653",
    "honors": false,
    "writingIntensive": false,
    "name": "ESL Methods in Higher Ed",
    "fullname": "Methods in Teaching English as a Second Language (ESL) in Higher Education",
    "info": "Theory/practice teaching academic English as second or foreign language in contexts of higher education. History of field/varied methods in language teaching. Current best practices in teaching academic English pronunciation, listening, speaking, reading, writing skills.prereq: An intro to linguistics course",
    "prereq": []
  },
  {
    "uid": "810069",
    "code": "CI5654",
    "subject": "CI",
    "number": "5654",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in Language Teaching",
    "fullname": "Practicum in Language Teaching: ESL and World Languages",
    "info": "Practical, hands-on training in teaching of English as Second Language. Applying theoretical/descriptive material studied in prior course work. Discuss readings/research articles on SLA, applying theoretical/practical principles to specific critical classroom incidents.",
    "prereq": []
  },
  {
    "uid": "826548",
    "code": "CI5655",
    "subject": "CI",
    "number": "5655",
    "honors": false,
    "writingIntensive": false,
    "name": "Multilingual Learners in SPED",
    "fullname": "Teaching Multilingual Learners in Special Education Contexts",
    "info": "The course gives Special Education teaching licensure candidates grounding in theory and practice for teaching linguistically and culturally diverse students. This course provides an overview of the benefits and challenges of working with Multilingual Learners (MLs) in a variety of settings. The term Multilingual Learner describes a range of linguistically and culturally diverse students, including students who are identified as needing English language services (AKA English learners). Central topics include instructional practices and strategies for teaching English learners; second language literacy and biliteracy development; language learning and bilingualism; Individualized Education Program (IEP) modification; and culturally responsive pedagogy. The course is designed to help teacher candidates to develop an understanding of the language-specific challenges that accompany subject matter learning as well as assessment and evaluation for Individualized Education Programs, and to demonstrate the ability to apply a range of instructional strategies to help dual-identified learners succeed academically.",
    "prereq": []
  },
  {
    "uid": "004083",
    "code": "CI5656",
    "subject": "CI",
    "number": "5656",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach Literacy Sec Lang Class",
    "fullname": "Teaching Literacy in Second Language Classrooms",
    "info": "Reading comprehension/composing processes in a second language; relationship between first and second literacy development; relationship between reading and writing; relationship of culture to reading comprehension and writing; politics of literacy; assessment of second language literacy; using technology to enhance literacy instruction.",
    "prereq": []
  },
  {
    "uid": "005214",
    "code": "CI5657",
    "subject": "CI",
    "number": "5657",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach Speak/Listen in SL Class",
    "fullname": "Teaching Speaking and Listening in Second Language Classrooms",
    "info": "Theories/methods in teaching language as communication in oral/aural modes; planning student interaction; classroom organization for oral language learning/acquisition; using technology to enhance interaction; assessment of listening comprehension and oral communication. ",
    "prereq": []
  },
  {
    "uid": "005218",
    "code": "CI5658",
    "subject": "CI",
    "number": "5658",
    "honors": false,
    "writingIntensive": false,
    "name": "Language Testing / Assessment",
    "fullname": "Language Testing and Assessment",
    "info": "For language teachers. Aligning language classroom instruction/assessment; language testing/assessment; classroom-based and large-scale proficiency testing/assessment; assessing proficiency in speaking, listening, reading, writing and communicative modes (interpretive, presentational, interpersonal); creation of formative/summative assessments; critique of contemporary assessment instruments.",
    "prereq": []
  },
  {
    "uid": "004065",
    "code": "CI5660",
    "subject": "CI",
    "number": "5660",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Top: Teach Second Lang",
    "fullname": "Special Topics in the Teaching of Second Languages and Cultures",
    "info": "Topics related specifically to the needs of the in-service teacher. Topics, location, credits, and duration are flexible.",
    "prereq": []
  },
  {
    "uid": "005220",
    "code": "CI5662",
    "subject": "CI",
    "number": "5662",
    "honors": false,
    "writingIntensive": false,
    "name": "Second Lang Curriculum Design",
    "fullname": "Second Language Curriculum Design",
    "info": "Historical overview of curriculum development in second language education; contexts that influence curriculum development; models for curriculum development in second language settings; politics of curricular reform; national/state standards and implications for curriculum development; effects of technology on second language curriculum.",
    "prereq": []
  },
  {
    "uid": "819840",
    "code": "CI5667",
    "subject": "CI",
    "number": "5667",
    "honors": false,
    "writingIntensive": false,
    "name": "TL Texts for Literacies Dev",
    "fullname": "Using Target Language Texts to Support Students' Literacies Development",
    "info": "Preparing students to participate in multilingual and multicultural communities entails shifting the way we approach language instruction. How do we move beyond teaching students to order coffee or talk about weekend activities, and instead encourage them to think critically and reflectively about language, culture, and communication? To answer this question, this institute focuses on how to develop students’ foreign language literacies—or the ability to interpret and create different kinds of discourse—through engagement with target language texts such as movies, infographics, poetry, music videos, magazine articles, podcasts, and the like. Using conceptual and pedagogical understandings gained during the institute, participants will examine and assess target language texts for use in their classrooms and create text-based instructional materials that develop students’ communicative abilities, critical thinking, intercultural competence, and language awareness.",
    "prereq": []
  },
  {
    "uid": "819878",
    "code": "CI5668",
    "subject": "CI",
    "number": "5668",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Language Online",
    "fullname": "Transforming the Teaching of Language Online (TTLO)",
    "info": "Transforming the Teaching of Language Online (TTLO) is for experienced classroom language teachers who want to transition to teaching their language class online. Offered completely online, TTLO will give teachers the first-hand experience of being an online learner while focusing on the important elements of a successful online language class such as online course design guidelines, best practices for online teaching, comparing online to traditional language teaching, and incorporating appropriate technology tools for communicative-based online activities. In addition to delving into these aspects of online teaching, participants will see them in action by taking part in model online language activities as language learners. By the end of the program, participants will have a portfolio of activities ready to be incorporated in an online language course.",
    "prereq": []
  },
  {
    "uid": "807161",
    "code": "CI5670",
    "subject": "CI",
    "number": "5670",
    "honors": false,
    "writingIntensive": false,
    "name": "Found of Dual Lang/Immersion",
    "fullname": "Foundations of Dual Language and Immersion Education",
    "info": "Research foundations and program principles for dual language/immersion. Second language acquisition; critical features of program design/implementation; benefits/challenges of dual language/immersion; program assessment; advocacy. Theory/research for dual language/immersion tied to practical application.prereq: Enrollment in certificate program in dual language/immersion educ or instr consent",
    "prereq": []
  },
  {
    "uid": "790598",
    "code": "CI5671",
    "subject": "CI",
    "number": "5671",
    "honors": false,
    "writingIntensive": false,
    "name": "DL/Immersion Curric&Assessment",
    "fullname": "Curriculum Development and Assessment in Dual Language/Immersion Classrooms",
    "info": "Content-based language instruction and curriculum development for dual language, bilingual, and immersion contexts; balancing content/language goals/objectives in curriculum and instruction; integration of language, literacy content, and culture in curriculum; standards-based instruction; backwards design; assessment that aligns with content-based curriculum and instruction.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "790599",
    "code": "CI5672",
    "subject": "CI",
    "number": "5672",
    "honors": false,
    "writingIntensive": false,
    "name": "DL/Immersion Instruc Practices",
    "fullname": "Language-Focused Instructional Practices and Strategies for Dual Language/Immersion Classrooms",
    "info": "Counterbalancing content with integrated focus on language and literacy development for dual language, bilingual, and immersion classrooms. Materials development; proactive/reactive instructional techniques; noticing and awareness-raising strategies; structuring student language production; differentiating for content, ability, and language.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "804040",
    "code": "CI5673",
    "subject": "CI",
    "number": "5673",
    "honors": false,
    "writingIntensive": false,
    "name": "Immersion 101",
    "fullname": "Immersion 101: An Introduction to Immersion Teaching",
    "info": "Research-based introduction to issues for teachers, administrators, and district personnel in K-12 immersion education. One-way (foreign language), two-way (bilingual), and indigenous programs. Principles/practices that inform language-attentive curriculum development/instruction.",
    "prereq": []
  },
  {
    "uid": "804045",
    "code": "CI5674",
    "subject": "CI",
    "number": "5674",
    "honors": false,
    "writingIntensive": false,
    "name": "Character-Based Immersion 101",
    "fullname": "Immersion 101: An Introduction to Immersion Teaching in Character-based Languages",
    "info": "Research-based introduction to issues for teachers, administrators, and district personnel in K-12 immersion education. One-way (foreign language) and two-way (bilingual) programs. Principles/practices that inform language-attentive curriculum development/instruction.",
    "prereq": []
  },
  {
    "uid": "816090",
    "code": "CI5676",
    "subject": "CI",
    "number": "5676",
    "honors": false,
    "writingIntensive": false,
    "name": "Biliteracy Development",
    "fullname": "Biliteracy Development in Dual Language/ImmersionClassrooms",
    "info": "This course aims to provide dual language, bilingual and language immersion educators with an understanding of the complex phenomena of literacy and biliteracy and with a range of instructional strategies for fostering literacy and biliteracy development in dual language/immersion classrooms.",
    "prereq": []
  },
  {
    "uid": "004077",
    "code": "CI5693",
    "subject": "CI",
    "number": "5693",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Study: Second Lang/Ed",
    "fullname": "Directed Study in Second Language Education",
    "info": "Individual or group work on curricular, instructional, or assessment problems.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "004068",
    "code": "CI5696",
    "subject": "CI",
    "number": "5696",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching ESL and World Lang.",
    "fullname": "Initial Licensure Field experience: Teaching ESL and World Languages",
    "info": "Teaching and learning experiences in Second Language Education across the scope of the license (Elementary, Middle & High School). Requires students to work in a public school setting. \n\nprereq: adviser approval; credits cannot be counted on a graduate degree program.",
    "prereq": []
  },
  {
    "uid": "006298",
    "code": "CI5697",
    "subject": "CI",
    "number": "5697",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching ESL & World Languages",
    "fullname": "Additional Licensure Field experience: Teaching ESL and World Languages",
    "info": "Teaching and learning experiences in Second Language Education as needed to complete the scope of the license (Elementary, Middle or High School). Requires students to work in a public school setting. \n\nprereq: Adviser approval; credits cannot be counted on a graduate degree program.",
    "prereq": []
  },
  {
    "uid": "005221",
    "code": "CI5698",
    "subject": "CI",
    "number": "5698",
    "honors": false,
    "writingIntensive": false,
    "name": "Studnt Teach: Second Languages",
    "fullname": "Student Teaching in Second Languages and Cultures",
    "info": "Student teaching/Practicum for initial and additional licensure in Second Language Education. Requires students to work in a public school setting. \n\nprereq: Adviser approval; credits cannot be counted on a graduate degree program.",
    "prereq": []
  },
  {
    "uid": "005223",
    "code": "CI5699",
    "subject": "CI",
    "number": "5699",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Exp: Second Lang",
    "fullname": "Clinical Experiences in Second Languages",
    "info": "Teaching and learning experiences in elementary and secondary second language instructional settings. Includes a seminar held concurrently to support the student teaching experience.\n\nprereq: SLC initial licensure program only",
    "prereq": []
  },
  {
    "uid": "005224",
    "code": "CI5701",
    "subject": "CI",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach: Social Studies Elem",
    "fullname": "Teaching Social Studies in the Elementary School",
    "info": "Content/organization of elementary social studies programs. Programs of understanding. Improving the learning situation. Use of materials.",
    "prereq": []
  },
  {
    "uid": "807031",
    "code": "CI5702",
    "subject": "CI",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "SocStu Instruction Elem Grades",
    "fullname": "Social Studies Instruction in the Elementary Grades",
    "info": "Content/organization of elementary social studies programs. Programs of understanding. Improving learning situation.prereq: Early Childhood or Elementary Education ILP",
    "prereq": []
  },
  {
    "uid": "797441",
    "code": "CI5705",
    "subject": "CI",
    "number": "5705",
    "honors": false,
    "writingIntensive": false,
    "name": "Mid Sch Soc Studies Methods",
    "fullname": "Middle School Social Studies Methods",
    "info": "Introduction to the unique needs of middle school students in the social studies classroom. Social studies content and pedagogical skills. Adolescent development/psychology. Field placement in a middle school social studies classroom.",
    "prereq": []
  },
  {
    "uid": "005227",
    "code": "CI5731",
    "subject": "CI",
    "number": "5731",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Studies/Inservice Teacher",
    "fullname": "Social Studies for the In-Service Elementary and Middle School Teacher",
    "info": "Content/organization of social studies programs. Improving teaching-learning situation through analysis of trends/issues. Integration with other subject areas.",
    "prereq": []
  },
  {
    "uid": "005230",
    "code": "CI5741",
    "subject": "CI",
    "number": "5741",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Soc Studies Education",
    "fullname": "Introduction to Social Studies Education",
    "info": "Broad issues and themes related to social studies education, including societal context, rationale, and scope and sequence. Analysis and evaluation of selected teaching strategies, methods, and resources.",
    "prereq": []
  },
  {
    "uid": "004867",
    "code": "CI5742",
    "subject": "CI",
    "number": "5742",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Methods: Teach Soc Studies",
    "fullname": "Advanced Methods of Teaching the Social Studies",
    "info": "Focus on developing a repertoire of instructional methods that support authentic pedagogy and assessment. Enhancing reading comprehension and writing skills in the social studies.prereq: Secondary social studies initial licensure student",
    "prereq": []
  },
  {
    "uid": "004866",
    "code": "CI5743",
    "subject": "CI",
    "number": "5743",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Sciences/Social Studies",
    "fullname": "The Social Sciences and the Social Studies",
    "info": "Development of instructional strategies and contexts for exploring the social sciences as disciplines at the secondary level; central concepts and generalizations; tools of inquiry; competing structures and theories; and the relative impact of multicultural and gender-fair perspectives on the nature of history and the social sciences.prereq: Secondary social studies initial licensure student",
    "prereq": []
  },
  {
    "uid": "004868",
    "code": "CI5744",
    "subject": "CI",
    "number": "5744",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Prof Dev Soc Studies Ed",
    "fullname": "Seminar: Reflecting on Professional Development in Social Studies Education",
    "info": "Reflecting on teaching experience, examining social/cultural context of teaching/learning, developing a professional identity. Refining teaching and teacher research skills.prereq: Secondary social studies initial licensure student",
    "prereq": []
  },
  {
    "uid": "803631",
    "code": "CI5745",
    "subject": "CI",
    "number": "5745",
    "honors": false,
    "writingIntensive": false,
    "name": "Engage Youth with Soc Stu Text",
    "fullname": "Engaging Youth With Social Studies Texts",
    "info": "Ways to engage students (grades 5-12) in social studies (textbooks, literature, speeches, editorials, political cartoons, tables, graphs, maps, film.). Developing middle/high school students' disciplinary literacy.",
    "prereq": []
  },
  {
    "uid": "803632",
    "code": "CI5746",
    "subject": "CI",
    "number": "5746",
    "honors": false,
    "writingIntensive": false,
    "name": "Global/MCEd in Secondary Clsrm",
    "fullname": "Global and Multicultural Education in the Secondary Classroom",
    "info": "Issues, classroom practices, and controversies surrounding global/multicultural perspective-taking in social studies education. Strategies for helping secondary social studies students develop global/multicultural worldviews.",
    "prereq": []
  },
  {
    "uid": "004393",
    "code": "CI5747",
    "subject": "CI",
    "number": "5747",
    "honors": false,
    "writingIntensive": false,
    "name": "Global/Env Ed: Content/Prac",
    "fullname": "Global and Environmental Education: Content and Practice",
    "info": "Prepares educators for leadership responsibilities in the area of global environmental education. Focus on the knowledge and process skills necessary to carry out a leadership role in the curriculum.",
    "prereq": []
  },
  {
    "uid": "004390",
    "code": "CI5761",
    "subject": "CI",
    "number": "5761",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Studies Ed:Inservice Teach",
    "fullname": "Social Studies Education for the Inservice Middle/Secondary Teacher",
    "info": "Trends and issues in social studies education. Current developments and controversies in social studies pedagogy, curriculum, and assessment.",
    "prereq": []
  },
  {
    "uid": "004869",
    "code": "CI5762",
    "subject": "CI",
    "number": "5762",
    "honors": false,
    "writingIntensive": false,
    "name": "Dev Civic Discourse: Soc Stud",
    "fullname": "Developing Civic Discourse in the Social Studies",
    "info": "Philosophies, strategies, and research on developing civic discourse in secondary social studies classroom. Selecting issues. Democratic classroom climate. Relating to social/cultural contexts.",
    "prereq": []
  },
  {
    "uid": "015661",
    "code": "CI5765",
    "subject": "CI",
    "number": "5765",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Newspapers in Classrm",
    "fullname": "Teaching About Newspapers In the Classroom",
    "info": "Use of daily newspaper in the classroom. Instructional strategies, curriculum development techniques, and teaching materials useful in teaching about newpaper in elementary/secondary classrooms",
    "prereq": []
  },
  {
    "uid": "015620",
    "code": "CI5782",
    "subject": "CI",
    "number": "5782",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Exp Tchng Soc Studies",
    "fullname": "Clinical Experiences in Teaching Social Studies",
    "info": "Student teaching experiences for students preparing to become secondary social studies teachers. Teacher candidates work closely with social studies teachers in grades 5-12 to plan and implement engaging and meaningful learning experiences for middle and high school students. prereq: MEd/initial licensure student",
    "prereq": []
  },
  {
    "uid": "811558",
    "code": "CI5811",
    "subject": "CI",
    "number": "5811",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Secondary Mathematics",
    "fullname": "Introduction to Teaching Secondary Mathematics",
    "info": "Introduction to teaching mathematics. Fundamental mathematical ideas/different ways children think about these ideas.",
    "prereq": []
  },
  {
    "uid": "811559",
    "code": "CI5812",
    "subject": "CI",
    "number": "5812",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Algebra",
    "fullname": "Teaching Algebra",
    "info": "Uses algebra as vehicle to discuss student learning trajectories, ways to measure students understanding, make instructional decisions to help students grow.",
    "prereq": []
  },
  {
    "uid": "811560",
    "code": "CI5813",
    "subject": "CI",
    "number": "5813",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Geometry",
    "fullname": "Teaching Geometry",
    "info": "Geometry/measurement ideas as vehicle to model ways to engage/manage students in more effective ways.",
    "prereq": []
  },
  {
    "uid": "811561",
    "code": "CI5814",
    "subject": "CI",
    "number": "5814",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching and Learning Math",
    "fullname": "Teaching and Learning Mathematics",
    "info": "Topics require more sophisticated understanding of teaching based on first year experience/reflect deeper on teaching.",
    "prereq": []
  },
  {
    "uid": "811562",
    "code": "CI5815",
    "subject": "CI",
    "number": "5815",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership in Math Education",
    "fullname": "Leadership in Mathematics Education",
    "info": "Preparing to give back to profession as you grow in role as teacher leader.",
    "prereq": []
  },
  {
    "uid": "007392",
    "code": "CI5821",
    "subject": "CI",
    "number": "5821",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Math Elem School",
    "fullname": "Teaching Mathematics in the Elementary School",
    "info": "Principles of learning pertinent to modern program of mathematics in elementary grades. Objectives, content, philosophy, instructional materials, methods of instruction/evaluation.",
    "prereq": []
  },
  {
    "uid": "807032",
    "code": "CI5822",
    "subject": "CI",
    "number": "5822",
    "honors": false,
    "writingIntensive": false,
    "name": "Math Instruction Elem Grades",
    "fullname": "Mathematics Instruction in the Elementary Grades",
    "info": "Principles of learning mathematics in elementary grades. Objectives, content, philosophy, instructional materials, methods of instruction/evaluation.prereq: Early Childhood or Elementary Education ILP",
    "prereq": []
  },
  {
    "uid": "002555",
    "code": "CI5922",
    "subject": "CI",
    "number": "5922",
    "honors": false,
    "writingIntensive": false,
    "name": "FACS Curriculum in Grades 5-12",
    "fullname": "Family and Consumer Sciences Curriculum in Grades 5-12",
    "info": "Examination, development, and implementation of family and consumer sciences curriculum in grades 5-12.",
    "prereq": []
  },
  {
    "uid": "002565",
    "code": "CI5923",
    "subject": "CI",
    "number": "5923",
    "honors": false,
    "writingIntensive": false,
    "name": "Educational Strategies in FE",
    "fullname": "Educational Strategies in Family Education",
    "info": "Examination, development, and implementation of a variety of educational strategies.",
    "prereq": []
  },
  {
    "uid": "797560",
    "code": "CI5924",
    "subject": "CI",
    "number": "5924",
    "honors": false,
    "writingIntensive": false,
    "name": "FACS Student Teaching I",
    "fullname": "Family and Consumer Sciences Student Teaching I",
    "info": "Initial experiences in family/consumer sciences teaching profession. Observations of school organization/administration, seminars, relationship building with cooperating teachers, reflections on personal involvement as beginning student teachers.prereq: ILP student",
    "prereq": []
  },
  {
    "uid": "797565",
    "code": "CI5925",
    "subject": "CI",
    "number": "5925",
    "honors": false,
    "writingIntensive": false,
    "name": "FACS Student Teaching II",
    "fullname": "Family and Consumer Sciences Student Teaching II",
    "info": "Part-time supervised teaching experience in family/consumer sciences programs. On-campus seminars emphasize reflective teaching practice and student learning in context of middle/high schools.",
    "prereq": []
  },
  {
    "uid": "797566",
    "code": "CI5926",
    "subject": "CI",
    "number": "5926",
    "honors": false,
    "writingIntensive": false,
    "name": "FACS Student Teaching III",
    "fullname": "Family and Consumer Sciences Student Teaching III",
    "info": "Full-time supervised teaching experience in family/consumer sciences programs. On-campus seminars.prereq: 5925",
    "prereq": {
      "code": "CI 5925",
      "subject": "CI",
      "id": "5925"
    }
  },
  {
    "uid": "797567",
    "code": "CI5927",
    "subject": "CI",
    "number": "5927",
    "honors": false,
    "writingIntensive": false,
    "name": "FACS Student Teaching IV",
    "fullname": "Family and Consumer Sciences Student Teaching IV",
    "info": "Full-time supervised student teaching experience in family/consumer sciences programs.prereq: 5926",
    "prereq": {
      "code": "CI 5926",
      "subject": "CI",
      "id": "5926"
    }
  },
  {
    "uid": "002617",
    "code": "CI5934",
    "subject": "CI",
    "number": "5934",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice of Parent Education I",
    "fullname": "Practice of Parent Education I",
    "info": "Reflection on and critique of practice of parent education. Culturally/linguistically diverse parent experiences. Observation of community-based programs. Professional skills/responsibilities.",
    "prereq": []
  },
  {
    "uid": "002570",
    "code": "CI5935",
    "subject": "CI",
    "number": "5935",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice of Parent Educ II",
    "fullname": "Practice of Parent Education II",
    "info": "Development of curriculum, teaching strategies, group facilitation skills, and assessment techniques. Observation of parent education classes/programs.",
    "prereq": []
  },
  {
    "uid": "002995",
    "code": "CI5939",
    "subject": "CI",
    "number": "5939",
    "honors": false,
    "writingIntensive": false,
    "name": "Parent Education Practicum",
    "fullname": "Parent Education Practicum",
    "info": "Supervised parent education field assignments designed according to licensure requirements and individual student needs, interests, and prior competencies.",
    "prereq": []
  },
  {
    "uid": "811565",
    "code": "CI5980",
    "subject": "CI",
    "number": "5980",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Experiences for K-12",
    "fullname": "Clinical Experiences for K-12 Teaching",
    "info": "Practical teaching/learning experiences in school setting. Includes co-teaching during student teaching and coaching/assessment by a university supervisor.",
    "prereq": []
  },
  {
    "uid": "811566",
    "code": "CI5981",
    "subject": "CI",
    "number": "5981",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Equity-Based Pedagogy",
    "fullname": "Introduction to Equity-Based Pedagogy",
    "info": "Introduces aspects of inequities in U.S. society/school. Examines how social class/poverty permeated education as  social institution/classroom pedagogy. Covers five principles for social class-sensitive change/intersections between social class/other markers of difference.",
    "prereq": []
  },
  {
    "uid": "811567",
    "code": "CI5982",
    "subject": "CI",
    "number": "5982",
    "honors": false,
    "writingIntensive": false,
    "name": "Enacting Equity-Based Pedagogy",
    "fullname": "Enacting Equity-Based Pedagogy",
    "info": "Extended study of inequities. Examines working-class literature for adults/children. Labor histories, economic systems, hierarchies of class, race, gender, sexuality, language in schools/communities.",
    "prereq": []
  },
  {
    "uid": "811568",
    "code": "CI5983",
    "subject": "CI",
    "number": "5983",
    "honors": false,
    "writingIntensive": false,
    "name": "Equity-Based Pedagogy/Advocacy",
    "fullname": "Equity-Based Pedagogy/Advocacy",
    "info": "Extends study of inequities in society. Five principles for social class-sensitive change. Intersections between social class/other markers of difference such as race, gender, sexuality, language.",
    "prereq": []
  },
  {
    "uid": "811569",
    "code": "CI5984",
    "subject": "CI",
    "number": "5984",
    "honors": false,
    "writingIntensive": false,
    "name": "Planning Design and Management",
    "fullname": "Planning Design and Management",
    "info": "Foundational understanding of being teacher, developing culturally responsive classroom, designing learning experiences. Conceptualization of teacher nationally/locally, language in classroom. Foundational concepts/tools used when facilitating learning.",
    "prereq": []
  },
  {
    "uid": "811570",
    "code": "CI5985",
    "subject": "CI",
    "number": "5985",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Language",
    "fullname": "Academic Language and English Learners in the Content Areas",
    "info": "Prepares teacher candidates to work effectively with English learners/other linguistically diverse students across all content areas. Develop students' academic language proficiency as needed for school success.",
    "prereq": []
  },
  {
    "uid": "811571",
    "code": "CI5986",
    "subject": "CI",
    "number": "5986",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Special Ed",
    "fullname": "Foundations of Special Education",
    "info": "Skills to promote learning/success for all students, including those at risk for school failure/with special needs. Introduces research/issues emphasizing collaborative problem solving approach that facilitates effective family-professional partnerships/educational programming for individuals with disabilities.",
    "prereq": []
  },
  {
    "uid": "811572",
    "code": "CI5987",
    "subject": "CI",
    "number": "5987",
    "honors": false,
    "writingIntensive": false,
    "name": "Child / Adolescent Development",
    "fullname": "Child and Adolescent Development for Teaching, Learning, and Assessment",
    "info": "Cognitive, social, emotional development of childhood/adolescence. Ecological influences in development. Theories of learning/cognition, cognitive/social development, motivation, individual/group differences, testing/assessment, teaching methodologies, pragmatic issues.",
    "prereq": []
  },
  {
    "uid": "811573",
    "code": "CI5988",
    "subject": "CI",
    "number": "5988",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Improvement Clinical",
    "fullname": "Clinical Experience: Improvement of Teaching",
    "info": "Capstone project. Link theory/practice, integrate coursework with experiences in classroom.",
    "prereq": []
  },
  {
    "uid": "003003",
    "code": "CI5993",
    "subject": "CI",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Study in Fam, Youth, Comm",
    "fullname": "Directed Study in Family, Youth, and Community",
    "info": "Self-directed study in areas not covered by regular courses. Specific program of study is jointly determined by student and advising faculty member.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "002999",
    "code": "CI5996",
    "subject": "CI",
    "number": "5996",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship:Family, Youth, Comm",
    "fullname": "Internship in Family, Youth, and Community",
    "info": "Involvement in work experience focused on educational competencies in family, youth, and community settings. Nature/extent of responsibilities are defined by position the student assumes.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "005096",
    "code": "CI8075",
    "subject": "CI",
    "number": "8075",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Art Ed",
    "fullname": "Seminar: Art Education",
    "info": "Reports, evaluation of problems, and review of recent literature.prereq: Educ grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "005097",
    "code": "CI8079",
    "subject": "CI",
    "number": "8079",
    "honors": false,
    "writingIntensive": false,
    "name": "Arts Based Research: Education",
    "fullname": "Arts Based Research in Education",
    "info": "Conceptualizing an aesthetic-based research agenda, in such a way as to help students identify research questions and choose appropriate arts based methodologies for conducting qualitative research.prereq: Educ grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "817327",
    "code": "CI8085",
    "subject": "CI",
    "number": "8085",
    "honors": false,
    "writingIntensive": false,
    "name": "Narrative Inquiry in Education",
    "fullname": "Narrative Inquiry in Education",
    "info": "Through readings and activities focused on published studies and articles, students explore theory/application of two narrative research forms, narrative analysis--in which stories of informants are collected and analyzed, and narrative construction--in which researchers compose qualitative data collected in research settings into the form of stories.",
    "prereq": []
  },
  {
    "uid": "012973",
    "code": "CI8095",
    "subject": "CI",
    "number": "8095",
    "honors": false,
    "writingIntensive": false,
    "name": "Problems in Art Ed",
    "fullname": "Problems: Art Education",
    "info": "Independent research under faculty guidance; may include advanced studio practice and educational issues requiring a research methodology.prereq: Grad art educ major or instr consent",
    "prereq": []
  },
  {
    "uid": "004876",
    "code": "CI8111",
    "subject": "CI",
    "number": "8111",
    "honors": false,
    "writingIntensive": false,
    "name": "Knowl in Curr & Cul",
    "fullname": "Representations of Knowledge in Curriculum and Culture",
    "info": "Overview of research and theory on sociology of knowledge and education.  Conceptions of knowledge in curriculum; connections between cultural conditions and curriculum design and implementation; influence of national political agendas, population, the mass media, and textbooks on curriculum in diverse educational settings.prereq: CI grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007255",
    "code": "CI8115",
    "subject": "CI",
    "number": "8115",
    "honors": false,
    "writingIntensive": false,
    "name": "Curr & Outcomes",
    "fullname": "Curriculum and Achievement Outcomes in a Diverse Society",
    "info": "Analysis of American public school experiences for students of African-American, Hispanic, Asian, and American Indian background; social, political, regional, and educational variables that influence student outcomes; perspectives concerning ethnic student achievement; factors influencing school achievement, and prospects for change.prereq: Doctoral student",
    "prereq": []
  },
  {
    "uid": "003999",
    "code": "CI8121",
    "subject": "CI",
    "number": "8121",
    "honors": false,
    "writingIntensive": false,
    "name": "CurrCg:Pers,Pro,Par",
    "fullname": "Curriculum Change: Perspectives, Processes, and Participants",
    "info": "Examination of curriculum within educational organizations; educational organization as mediator and transmitter of societal/cultural perspectives; implications of organizational context for curriculum change, change processes, and change participants.prereq: CI grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "004001",
    "code": "CI8127",
    "subject": "CI",
    "number": "8127",
    "honors": false,
    "writingIntensive": false,
    "name": "Curr Theor&Research",
    "fullname": "Curriculum Theory and Research: Alternative Paradigms and Research Methods",
    "info": "Traditions of inquiry, exemplary studies, and associated research methods;  survey and assessment of topics and methods as applied to curriculum questions;  and relationships between theory and research.prereq: CI grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "005030",
    "code": "CI8131",
    "subject": "CI",
    "number": "8131",
    "honors": false,
    "writingIntensive": false,
    "name": "C&I Core: Curr",
    "fullname": "Curriculum and Instruction Core: Critical Examination of Curriculum in Context",
    "info": "Central concepts, ideas, and debates in professional field of curriculum. Curriculum in general education.prereq: CI PhD or MA student or instr consent",
    "prereq": []
  },
  {
    "uid": "004683",
    "code": "CI8132",
    "subject": "CI",
    "number": "8132",
    "honors": false,
    "writingIntensive": false,
    "name": "C&I Core: Teaching",
    "fullname": "Curriculum and Instruction Core: Teaching Theory and Research",
    "info": "Overview of research on teaching: historical perspective, modern research/findings, implications for practice/research.prereq: CI PhD or MA student or instr consent",
    "prereq": []
  },
  {
    "uid": "005312",
    "code": "CI8133",
    "subject": "CI",
    "number": "8133",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Meth in C&I",
    "fullname": "Research Methods in Curriculum and Instruction",
    "info": "Survey of educational research methods, comparison of underlying assumptions/procedures.prereq: CI PhD or MA student or instr consent",
    "prereq": []
  },
  {
    "uid": "815539",
    "code": "CI8134",
    "subject": "CI",
    "number": "8134",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Research I",
    "fullname": "Foundations of Research in Curriculum and Instruction I",
    "info": "This Foundations of Research course is the first of a two-course sequence required for PhD students in Curriculum and Instruction. The course is designed to ground students in qualitative and quantitative paradigms and epistemology and prepare students for specialized methodology courses that focus on specific research approaches in education.",
    "prereq": []
  },
  {
    "uid": "815545",
    "code": "CI8135",
    "subject": "CI",
    "number": "8135",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Research II",
    "fullname": "Foundations of Research in Curriculum and Instruction II",
    "info": "This Foundations of Research course is the second of a two-course sequence required for PhD students in Curriculum and Instruction. The course is designed to ground students in qualitative and quantitative paradigms and epistemology and prepare students for specialized methodology courses that focus on specific research approaches in education.",
    "prereq": []
  },
  {
    "uid": "808051",
    "code": "CI8145",
    "subject": "CI",
    "number": "8145",
    "honors": false,
    "writingIntensive": false,
    "name": "Use Mixed Methods Ed Research",
    "fullname": "Using Mixed Methods in Educational Research",
    "info": "Conceptual issues surrounding design/use of mixed methods in addressing problems/research questions in education. Critique of select mixed design exemplars published in respected research publications/practical application of analyses of data using mixed inquiry methods.prereq: [8133, 8148, OLPD 8812] or equiv, [CI PhD student or instr consent], additional quantitative/qualitative methodology courses recommended",
    "prereq": {
      "and": [
        {
          "code": "CI 8133",
          "subject": "CI",
          "id": "8133"
        },
        {
          "code": "CI 8148",
          "subject": "CI",
          "id": "8148"
        },
        {
          "code": "OLPD 8812",
          "subject": "OLPD",
          "id": "8812"
        }
      ]
    }
  },
  {
    "uid": "803098",
    "code": "CI8146",
    "subject": "CI",
    "number": "8146",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Ethnography",
    "fullname": "Critical Ethnography in Education",
    "info": "Theoretical/methodological foundations. Possibilities and problematics for understanding inequality/disparities in education. Research design, data collection, analysis, writing.prereq: MA or PhD student or Inst consent",
    "prereq": []
  },
  {
    "uid": "801063",
    "code": "CI8147",
    "subject": "CI",
    "number": "8147",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Discourse Analysis",
    "fullname": "Critical Discourse Analysis in Educational Research",
    "info": "Students apply CDA methods to analysis of written, visual, and spoken texts in social settings such as schools, families, and communities.prereq: [MA or PhD] student",
    "prereq": []
  },
  {
    "uid": "014784",
    "code": "CI8148",
    "subject": "CI",
    "number": "8148",
    "honors": false,
    "writingIntensive": false,
    "name": "Qual. Studies Educ Contexts",
    "fullname": "Conducting Qualitative Studies in Educational Contexts",
    "info": "Qualitative research methods. Ethnography, sociolinguistics, symbolic interactionism. Observation.prereq: CI or OLPD PhD student",
    "prereq": []
  },
  {
    "uid": "792022",
    "code": "CI8149",
    "subject": "CI",
    "number": "8149",
    "honors": false,
    "writingIntensive": false,
    "name": "Coding, Analysis, Interp",
    "fullname": "Qualitative Research: Coding, Analysis, Interpretation, and Writing",
    "info": "How to code/analyze field notes. Individual/group interviews, multimedia using NUDIST NVivo software. Students interpret analyzed material and complete an article length document that includes a review of related research/methodology.prereq: [8133, 8148, grad student, completion of a qualitative research study] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CI 8133",
          "subject": "CI",
          "id": "8133"
        },
        {
          "code": "CI 8148",
          "subject": "CI",
          "id": "8148"
        }
      ]
    }
  },
  {
    "uid": "791040",
    "code": "CI8150",
    "subject": "CI",
    "number": "8150",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Topics Curr & Instruc",
    "fullname": "Research Topics in Curriculum & Instruction",
    "info": "Special topics, current research trends in curriculum and instruction. Research review, subject integration, curriculum contexts, development, implementation, data collection, analysis, evaluation.",
    "prereq": []
  },
  {
    "uid": "799563",
    "code": "CI8151",
    "subject": "CI",
    "number": "8151",
    "honors": false,
    "writingIntensive": false,
    "name": "Teacher Preparation",
    "fullname": "Paradigms and Practices in Teacher Preparation",
    "info": "Theory-practice gap in professional education. Conceptions of teacher learning. Pedagogies for teaching \"practice\" and program design. Research methodologies.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "799621",
    "code": "CI8152",
    "subject": "CI",
    "number": "8152",
    "honors": false,
    "writingIntensive": false,
    "name": "Teacher Development",
    "fullname": "Teacher Learning and Professional Development",
    "info": "Theoretical/empirical work on teacher learning, professional communities, teacher inquiry, perspectives on outcomes of professional development, and policy recommendations for supporting teacher learning.  Research methodologies.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "817543",
    "code": "CI8153",
    "subject": "CI",
    "number": "8153",
    "honors": false,
    "writingIntensive": false,
    "name": "Research: Classroom Discourse",
    "fullname": "Research Approaches to Classroom Discourse",
    "info": "This course introduces students to major traditions in analysis of classroom discourse, anthropological linguistics, conversational analysis, sociocultural, critical discourse and multimodal discourse analysis and their use in conjunction with other qualitative approaches to classroom research. Analysis of genre, gesture, and verbal performance are also addressed. ",
    "prereq": []
  },
  {
    "uid": "799622",
    "code": "CI8154",
    "subject": "CI",
    "number": "8154",
    "honors": false,
    "writingIntensive": false,
    "name": "Culturally Relevant Pedagogy",
    "fullname": "Culturally Relevant Pedagogy",
    "info": "Research on relationship between home and school cultures. Education of students of color. Culture, including experiences/practices of students? homes. Cultural approaches for improving teaching, transforming society.",
    "prereq": []
  },
  {
    "uid": "799564",
    "code": "CI8155",
    "subject": "CI",
    "number": "8155",
    "honors": false,
    "writingIntensive": false,
    "name": "Immigrant Education",
    "fullname": "Immigrant Families and U.S. Schools",
    "info": "Educational experiences of post-1965 immigrants in U.S. schools. Research/debates surrounding immigration, assimilation, and acculturation. Issues confronted by immigrant families/youth. Immigrant experiences that change and respond to external forces in U.S. society.",
    "prereq": []
  },
  {
    "uid": "799565",
    "code": "CI8156",
    "subject": "CI",
    "number": "8156",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian American Education",
    "fullname": "Asian American Education",
    "info": "Issues/concerns facing Asian American students in U.S. schools. Focuses on Twin Cities context of Hmong American children/families.",
    "prereq": []
  },
  {
    "uid": "801565",
    "code": "CI8159",
    "subject": "CI",
    "number": "8159",
    "honors": false,
    "writingIntensive": false,
    "name": "CAT Colloquium",
    "fullname": "Culture and Teaching Colloquium",
    "info": "Doctoral seminar. Interdisciplinary perspectives on theme central to cultural study of teaching. Theme varies year to year.",
    "prereq": []
  },
  {
    "uid": "005323",
    "code": "CI8161",
    "subject": "CI",
    "number": "8161",
    "honors": false,
    "writingIntensive": false,
    "name": "Research I: Design & Planning",
    "fullname": "Research Experience I: Study Design and Planning",
    "info": "Students identify research topic, conduct literature review, refine research questions, design study, obtain IRB approval as needed, and begin data collection. Readings, seminar discussions, peer critique of work.\n\nprereq: [8134, 8135, 6-12 cr. of research methodology, CI PhD student] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CI 8134",
          "subject": "CI",
          "id": "8134"
        },
        {
          "code": "CI 8135",
          "subject": "CI",
          "id": "8135"
        }
      ]
    }
  },
  {
    "uid": "005324",
    "code": "CI8162",
    "subject": "CI",
    "number": "8162",
    "honors": false,
    "writingIntensive": false,
    "name": "Research II: Analysis& MS Prep",
    "fullname": "Research Experience II: Data Analysis and Manuscript Preparation",
    "info": "Students complete data collection/analysis, prepare research manuscript. Seminar discussions, critical examination of their own and peers’ work.prereq: 8161",
    "prereq": {
      "code": "CI 8161",
      "subject": "CI",
      "id": "8161"
    }
  },
  {
    "uid": "814441",
    "code": "CI8165",
    "subject": "CI",
    "number": "8165",
    "honors": false,
    "writingIntensive": false,
    "name": "Queer and Feminist Theories",
    "fullname": "Queer and Feminist Theories: Collective Memory Research Methods",
    "info": "Seminar for advanced graduate students to work with queer and feminist theories in what is broadly constructed as educational research. We consider post-modern theoretical work that recognizes the \"rational\" being and the mind/body dichotomy as constructions which re-produce existing structures. Collective memory writing is explored as a research method.",
    "prereq": []
  },
  {
    "uid": "005076",
    "code": "CI8181",
    "subject": "CI",
    "number": "8181",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach in Col Educ",
    "fullname": "Seminar in Teaching in Colleges of Education",
    "info": "Goals, instructional strategies, evaluation procedures, and professional considerations.prereq: CI PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "008831",
    "code": "CI8195",
    "subject": "CI",
    "number": "8195",
    "honors": false,
    "writingIntensive": false,
    "name": "Prob:Improve Instruct",
    "fullname": "Problems: Improvement of Instruction",
    "info": "Independent research in curriculum and instruction.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "005322",
    "code": "CI8196",
    "subject": "CI",
    "number": "8196",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac: Teaching Colleges of Ed",
    "fullname": "Practicum in Teaching in Colleges of Education",
    "info": "Practicum experience for graduate students to learn how to teach a college level course through a supervised, mentored experience. Supervised teaching occurs in an education course at the University or other institution.",
    "prereq": []
  },
  {
    "uid": "003787",
    "code": "CI8197",
    "subject": "CI",
    "number": "8197",
    "honors": false,
    "writingIntensive": false,
    "name": "Prob: Curr Studies",
    "fullname": "Problems: Curriculum Studies",
    "info": "Directs students to completing Plan B paper for M.A. degree.prereq: MA student",
    "prereq": []
  },
  {
    "uid": "008828",
    "code": "CI8198",
    "subject": "CI",
    "number": "8198",
    "honors": false,
    "writingIntensive": false,
    "name": "Prob: Teacher Educ",
    "fullname": "Problems: Teacher Education",
    "info": "Independent research.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "817328",
    "code": "CI8201",
    "subject": "CI",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Theories in El.Ed.",
    "fullname": "Critical Theories of Growth and Change in Elementary Education",
    "info": "This course provides students with the opportunity to 1) trace, historically, how growth and change has been theorized in elementary schooling with particular focus on how the role of the teacher and the curriculum have been constructed; 2) analyze a \"contingent, recursive\" conception of growth and change called for by socio-cultural theorist, Nancy Lesko, and further developed by scholars of elementary education; and 3) re-imagine conceptions of growth and change in elementary schooling using other theoretical perspectives (e.g., feminist, culturally relevant, queer, social class-sensitive).",
    "prereq": []
  },
  {
    "uid": "816427",
    "code": "CI8202",
    "subject": "CI",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "Elementary Ed. Colloquium",
    "fullname": "Elementary Education Colloquium",
    "info": "In this course, students will consider how elementary education has been and continues to be imagined as a scholarly field of study, with particular focus on how the field is seen as a fluid intellectual space in which scholars study broad philosophical, political, and social ideas, issues, and concerns as they take concrete (lived) shape in the schooling, cultures, and pedagogies of elementary schooling.",
    "prereq": []
  },
  {
    "uid": "788785",
    "code": "CI822",
    "subject": "CI",
    "number": "822",
    "honors": false,
    "writingIntensive": false,
    "name": "Introductory Algebra (Cmptr.)",
    "fullname": "Introductory Algebra (Computer)",
    "info": "Students learn via multimedia software. Instructor helps students individually during class. Real numbers, expressions, equations, inequalities, rectangular graphs, systems, word problems, exponents, polynomials, factoring.prereq: [4 cr equiv], General Math Placement Test",
    "prereq": []
  },
  {
    "uid": "788786",
    "code": "CI832",
    "subject": "CI",
    "number": "832",
    "honors": false,
    "writingIntensive": false,
    "name": "Algebra Review",
    "fullname": "Algebra Review",
    "info": "Students learn via multimedia software. Instructor helps students individually during class. Topics include rational expressions, absolute value, roots, radicals, quadratic, exponential, and logarithmic functions, complex numbers.prereq: 4 cr equiv or grade of at least C in [0713 or 0717 or 0721 or 0722 or 0822] or General Math Placement Test",
    "prereq": []
  },
  {
    "uid": "792000",
    "code": "CI8333",
    "subject": "CI",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "TBDprereq: Master's student, adviser approval, DGS approval",
    "prereq": []
  },
  {
    "uid": "807426",
    "code": "CI8350",
    "subject": "CI",
    "number": "8350",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics",
    "fullname": "Special Topics in Learning Technologies",
    "info": "Topics in learning technologies. Topics and credits are flexible.",
    "prereq": []
  },
  {
    "uid": "003813",
    "code": "CI8361",
    "subject": "CI",
    "number": "8361",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Courseware/Design: Issues",
    "fullname": "Advanced Courseware and Design: Issues",
    "info": "Examination and critique of existing research. Students identify a research topic, write a literature review, plan a study, and present a research proposal.",
    "prereq": []
  },
  {
    "uid": "818038",
    "code": "CI8371",
    "subject": "CI",
    "number": "8371",
    "honors": false,
    "writingIntensive": false,
    "name": "Appld Social Ntwrk Anlysis Edu",
    "fullname": "Applied Social Network Analysis in Education",
    "info": "This course examines the application of Social Network Analysis in various educational settings. As a methodology, Social Network Analysis (SNA) is concerned with social affiliations and interactions in social structures of all kinds. SNA has garnered significant interests in educational research and has been applied to investigating a myriad of educational phenomena such as student friendship, school choice, and classroom discourse. This course is organized into four major components including: (1) foundations of social network perspectives in education; (2) techniques for collecting social network data in educational settings; (3) techniques for analyzing and visualizing social networks; and (4) practical guidelines on conducting SNA research in educational contexts, with considerations to education theories, ethics, and real-world implications. ",
    "prereq": []
  },
  {
    "uid": "003891",
    "code": "CI8391",
    "subject": "CI",
    "number": "8391",
    "honors": false,
    "writingIntensive": false,
    "name": "Learning Technologies Seminar",
    "fullname": "Learning Technologies Seminar",
    "info": "This seminar course offers an advanced exploration and critique of contemporary research in the field of learning technologies; topics, location, credits, and duration are highly flexible.",
    "prereq": []
  },
  {
    "uid": "003887",
    "code": "CI8395",
    "subject": "CI",
    "number": "8395",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study: Learning Tech",
    "fullname": "Directed Study: Learning Technologies",
    "info": "Students work with faculty member on a directed project or study focused on exploring literature, organizing and engaging in research, designing and developing projects, etc.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "004353",
    "code": "CI8400",
    "subject": "CI",
    "number": "8400",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Children's & YA Lit",
    "fullname": "Special Topics in Children's and Young Adult Literature",
    "info": "Overview of research and issues. Study of original manuscripts and artwork for children's books; research in child and young adult response to literature. Topics vary by offering.prereq: grad course in children's or young adult lit",
    "prereq": []
  },
  {
    "uid": "005211",
    "code": "CI8410",
    "subject": "CI",
    "number": "8410",
    "honors": false,
    "writingIntensive": false,
    "name": "SpecTopic Read Res",
    "fullname": "Special Topics in Reading Research and Instruction",
    "info": "Research at all levels. Topics vary. May include research designs, trends, and specific studies.prereq: [MA or PhD] student",
    "prereq": []
  },
  {
    "uid": "004886",
    "code": "CI8412",
    "subject": "CI",
    "number": "8412",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in Reading",
    "fullname": "Research in Reading",
    "info": "Theory of and research on writing process. Applications to developing writing curriculum/instruction.prereq: [MA or PhD] student",
    "prereq": []
  },
  {
    "uid": "818039",
    "code": "CI8416",
    "subject": "CI",
    "number": "8416",
    "honors": false,
    "writingIntensive": false,
    "name": "Speculative Fiction",
    "fullname": "Speculative Fiction, Radical Imagination, and Social Change",
    "info": "Speculative fiction is a blanket term for fantasy, science fiction, horror, and other nonmimetic genres predicated on challenging consensus reality and its societal norms. The most dynamic and diverse field of modern storytelling, speculative fiction serves as a catalyst, in and beyond the classroom, for radical imagination: one that contests the oppressive socio-economic system by reimagining race, gender, class, and other real-world issues. This seminar examines the cultural work performed by speculative fiction addressed to children and young adults. Engaging with stories that suggest alternatives to how we live now, students develop mental habits of global citizens who value diversity and strive for social transformation. Works of speculative fiction for the young reader are discussed as particle accelerators for ideas of change and as sites of resistance against exclusion and systemic inequalities. The focus is on speculative fiction by indigenous, minority, and postcolonial authors. Exploring the ways in which these works interrogate dominant notions of reality and structures of meaning helps students appreciate speculative fiction as a tool for imagining radical social change. ",
    "prereq": []
  },
  {
    "uid": "004351",
    "code": "CI8421",
    "subject": "CI",
    "number": "8421",
    "honors": false,
    "writingIntensive": false,
    "name": "Res in Composition",
    "fullname": "Research in Composition",
    "info": "Research designs: experimental, case study, descriptive, qualitative, ethnographic. Writing in social contexts. Teaching/evaluating writing. Rhetorical, linguistic, and discourse analysis of texts. Validity/reliability in coding/rating. Portfolio/large-scale writing assessments.prereq: [MA or PhD] student",
    "prereq": []
  },
  {
    "uid": "819742",
    "code": "CI8431",
    "subject": "CI",
    "number": "8431",
    "honors": false,
    "writingIntensive": false,
    "name": "Literacy Seminar",
    "fullname": "Literacy Seminar: Literacy in a Post-Truth Era",
    "info": "This doctoral seminar explores the Post-Truth Era in education and society. Using literacy frameworks to understand, critique, and reframe ideologies, the course examines issues related to constructions and distortions of \"truth.\" Students are introduced to critical literacy, sociocultural theory, racial literacy, digital and critical media literacy, and climate change literacy to analyze languge, texts, and power. ",
    "prereq": []
  },
  {
    "uid": "792001",
    "code": "CI8444",
    "subject": "CI",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "TBDprereq: Doctoral student, adviser approval, DGS approval",
    "prereq": []
  },
  {
    "uid": "801579",
    "code": "CI8461",
    "subject": "CI",
    "number": "8461",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociocultural Theory, Educ&Lit",
    "fullname": "Sociocultural Theory, Education, and Literacy",
    "info": "Sociocultural theories, from 1960s to present. Vygotskian/neo-Vygotskian. Genre/activity dialogic. New literacy studies. Critical sociocultural. Multimodality. Empirical studies informed by theoretical perspectives.  ",
    "prereq": []
  },
  {
    "uid": "004355",
    "code": "CI8470",
    "subject": "CI",
    "number": "8470",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics on Literacy",
    "fullname": "Special Topics on Literacy",
    "info": "Current theories/research on literacy and literacy development. Alternative methods of conducting literacy research. Implications for literacy instruction.prereq: [MA or PhD] student",
    "prereq": []
  },
  {
    "uid": "005318",
    "code": "CI8492",
    "subject": "CI",
    "number": "8492",
    "honors": false,
    "writingIntensive": false,
    "name": "Read:EngEd&Reading",
    "fullname": "Readings in English Education and Reading",
    "info": "Independent study course.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "005194",
    "code": "CI8495",
    "subject": "CI",
    "number": "8495",
    "honors": false,
    "writingIntensive": false,
    "name": "ProbTeach Eng&Read",
    "fullname": "Problems: Teaching English and Reading",
    "info": "Individual research.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "008837",
    "code": "CI8511",
    "subject": "CI",
    "number": "8511",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem Research SciEd",
    "fullname": "Seminar: Research in Science Education",
    "info": "Students and faculty present research projects for comment and critique. Special topics may also be considered.prereq: CI grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "808745",
    "code": "CI8541",
    "subject": "CI",
    "number": "8541",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist and Phil Eng and Eng Ed",
    "fullname": "History and Philosophy of Engineering and Engineering Education",
    "info": "History and philosophy of engineering/engineering education. Critical reflection/analysis of philosophical, epistemological, historical arguments.prereq: PhD or MA student or instr consent",
    "prereq": []
  },
  {
    "uid": "808754",
    "code": "CI8542",
    "subject": "CI",
    "number": "8542",
    "honors": false,
    "writingIntensive": false,
    "name": "Modeling in STEM Education",
    "fullname": "Modeling and Model-Based Reasoning in STEM Education",
    "info": "Models/modeling perspectives for engineering, mathematics, and science education. Theorists/researchers that shaped STEM model-based reasoning. Discussions, individual/group presentations, small-group activities.prereq: STEM Education PhD or MA student or instr consent",
    "prereq": []
  },
  {
    "uid": "006288",
    "code": "CI8570",
    "subject": "CI",
    "number": "8570",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Topics in Science Ed",
    "fullname": "Advanced Topics in Science Education",
    "info": "Examination/critique of current research topics, methods, and issues.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "799119",
    "code": "CI8571",
    "subject": "CI",
    "number": "8571",
    "honors": false,
    "writingIntensive": false,
    "name": "Equity and Social Justice",
    "fullname": "Equity, Policy, and Social Justice in STEM Education",
    "info": "Interactions of issues of diversity, equity, policy, and social justice as related to STEM education. Diverse perspectives on purposes/scope of STEM education. Consequences for diversity, equity, access, social justice, empowerment, and educational policy.prereq: Science ed or STEM grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "006295",
    "code": "CI8572",
    "subject": "CI",
    "number": "8572",
    "honors": false,
    "writingIntensive": false,
    "name": "Theor/Res in STEM Ed",
    "fullname": "Learning Theory and Classical Research in STEM Education",
    "info": "STEM education research. Theorists/classical research. Mathematics, science, engineering education.prereq: Grad math educ major",
    "prereq": []
  },
  {
    "uid": "808747",
    "code": "CI8573",
    "subject": "CI",
    "number": "8573",
    "honors": false,
    "writingIntensive": false,
    "name": "Inquiry in STEM Ed",
    "fullname": "Nature of Inquiry in STEM Education",
    "info": "STEM Education. Mathematics, science, engineering. Teaching/ learning/teacher education through evaluation of national teaching standards, current research, current cognitive theories of learning.prereq: MA or PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "818040",
    "code": "CI8574",
    "subject": "CI",
    "number": "8574",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist & Philosphy of Sci in Edu",
    "fullname": "History and Philosophy of Science in Education",
    "info": "This course introduces students in STEM education the historical and philosophical theories, ideas, principles, and events in science and how they inform science education at the K-12 level. Students learn contributions of philosophers in understanding what is science and how history of science and scientific events have influenced the growth of science. Nature of Science, historical contributions of women in science, and sociological nature of science inform larger discussions that take place in this class. ",
    "prereq": []
  },
  {
    "uid": "819012",
    "code": "CI8575",
    "subject": "CI",
    "number": "8575",
    "honors": false,
    "writingIntensive": false,
    "name": "STEM/Sci/Mat Teacher Educators",
    "fullname": "Becoming a Science/Math/STEM Teacher Educator for K‐12 Teachers",
    "info": "The purpose of this course is to examine science, math, and STEM teacher preparation of K‐12 teachers in elementary and secondary schools.We will explore what influences science, math, and/or STEM teacher preparation, from local, state, and national policies, standards andreforms. We will explore some of the ways that beginning teachers are evaluated and therefore deemed “ready to teach”. We will compare andcontrast different pathways of becoming a teacher. And we will analyze closely the lived experience of pre‐service and beginning teachers andhow this might influence our own teaching philosophies.",
    "prereq": []
  },
  {
    "uid": "005326",
    "code": "CI8594",
    "subject": "CI",
    "number": "8594",
    "honors": false,
    "writingIntensive": false,
    "name": "Conduct Res Sci Ed",
    "fullname": "Conducting Research in Science Education",
    "info": "Application of research methodology to a specific science education issue.prereq: sci educ research course",
    "prereq": []
  },
  {
    "uid": "008827",
    "code": "CI8595",
    "subject": "CI",
    "number": "8595",
    "honors": false,
    "writingIntensive": false,
    "name": "Prob in Science Ed",
    "fullname": "Problems: Science Education",
    "info": "Independent research.prereq: CI grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "826338",
    "code": "CI8609",
    "subject": "CI",
    "number": "8609",
    "honors": false,
    "writingIntensive": false,
    "name": "Transnational Multilingual Lit",
    "fullname": "Transnational and Multilingual Literacies",
    "info": "This course is designed for students in curriculum and instruction, multilingual education, teacher education, and related fields. Through the class, students investigate the literate practices multilingual students use such as translanguaging (code-meshing, translating, language crossing). Participants learn to build on students' out-of-school (transnational/community) literacy practices to improve instructional practices. Prerequisites include graduate student status.",
    "prereq": []
  },
  {
    "uid": "004277",
    "code": "CI8631",
    "subject": "CI",
    "number": "8631",
    "honors": false,
    "writingIntensive": false,
    "name": "ResearchSem I SLC",
    "fullname": "Research Seminar I: Second Languages and Cultures Education",
    "info": "Students explore a research topic through readings, seminar discussions, conducting an actual study, and peer critique of work.",
    "prereq": []
  },
  {
    "uid": "004276",
    "code": "CI8632",
    "subject": "CI",
    "number": "8632",
    "honors": false,
    "writingIntensive": false,
    "name": "ResearchSem II SLC",
    "fullname": "Research Seminar II: Second Languages and Cultures Education",
    "info": "Students complete data analyses and prepare written report on an original study as well as offer peer critique of work.  ",
    "prereq": []
  },
  {
    "uid": "814442",
    "code": "CI8645",
    "subject": "CI",
    "number": "8645",
    "honors": false,
    "writingIntensive": false,
    "name": "Indigenous Lang Revitalization",
    "fullname": "Indigenous Language Revitalization and Activist Research Methods",
    "info": "This course is a hands-on look at activist research methods situated in the context of Indigenous Language Revitalization. That is, what happens when a community problem is the organizing force in research? Students will be expected to both engage in language learning, research, designing a research project, and connecting this to critical thinking as applied to culture, language and indigenous language revitalization.",
    "prereq": []
  },
  {
    "uid": "004275",
    "code": "CI8650",
    "subject": "CI",
    "number": "8650",
    "honors": false,
    "writingIntensive": false,
    "name": "SpTopics in SLC Res",
    "fullname": "Seminar: Special Topics in Second Languages and Cultures Research",
    "info": "Research topics vary.prereq: CI grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "792002",
    "code": "CI8666",
    "subject": "CI",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "814235",
    "code": "CI8671",
    "subject": "CI",
    "number": "8671",
    "honors": false,
    "writingIntensive": false,
    "name": "Socioling. Research Approaches",
    "fullname": "Sociolinguistic Research Approaches to Education",
    "info": "This course provides students with an overview of current research approaches, theories, and methods in linguistic anthropology and interactional sociolinguistics with a focus on educational contexts and linguistic diversity. Course activities include reviewing and critiquing current research and theory in the field and working on small projects.",
    "prereq": []
  },
  {
    "uid": "814423",
    "code": "CI8689",
    "subject": "CI",
    "number": "8689",
    "honors": false,
    "writingIntensive": false,
    "name": "Language and Education Policy",
    "fullname": "Language and Education Policy",
    "info": "Students will gain a solid understanding of language policy theory, language policy research methods, and key empirical findings. They will acquire skills to critically analyze and evaluate language policy, and gain experience and academic practice in doing so.",
    "prereq": []
  },
  {
    "uid": "004080",
    "code": "CI8691",
    "subject": "CI",
    "number": "8691",
    "honors": false,
    "writingIntensive": false,
    "name": "Read:SlC Education",
    "fullname": "Readings in Second Languages and Cultures Education",
    "info": "Independent reading.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "004079",
    "code": "CI8695",
    "subject": "CI",
    "number": "8695",
    "honors": false,
    "writingIntensive": false,
    "name": "Prob in SLC Ed",
    "fullname": "Problems: Second Languages and Cultures Education",
    "info": "Independent research.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "809332",
    "code": "CI8741",
    "subject": "CI",
    "number": "8741",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist Theory Social Studies Ed",
    "fullname": "History and Theory of Social Studies Education",
    "info": "History/theory of social studies education in United States. Organization, subject matter, methods of instruction.",
    "prereq": []
  },
  {
    "uid": "004865",
    "code": "CI8742",
    "subject": "CI",
    "number": "8742",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem in SocSt Ed",
    "fullname": "Seminar: Research in Social Studies Education",
    "info": "Critical review and analysis of seminal research studies; criteria for appraising research findings; educational implications.prereq: CI grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "796571",
    "code": "CI8777",
    "subject": "CI",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "TBD ",
    "prereq": []
  },
  {
    "uid": "008829",
    "code": "CI8795",
    "subject": "CI",
    "number": "8795",
    "honors": false,
    "writingIntensive": false,
    "name": "Prob in SocSt Ed",
    "fullname": "Problems: Social Studies Education",
    "info": "Independent research.prereq: CI grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007256",
    "code": "CI8796",
    "subject": "CI",
    "number": "8796",
    "honors": false,
    "writingIntensive": false,
    "name": "ResIntern SocSt Ed",
    "fullname": "Research Internship in Social Studies Education",
    "info": "Internship with social studies education faculty member; experience in collecting and analyzing data; drafting and presenting reports; writing for publication.prereq: CI grad student",
    "prereq": []
  },
  {
    "uid": "792003",
    "code": "CI8888",
    "subject": "CI",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credits: Doctoral",
    "info": "Thesis credits: Doctoralprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "804923",
    "code": "CI8888W",
    "subject": "CI",
    "number": "8888",
    "honors": false,
    "writingIntensive": true,
    "name": "Thesis Credit: Doct Sem",
    "fullname": "Thesis Credit Dissertation Seminar",
    "info": "Work on dissertation in structured setting. Brings together students writing on related topics. Contact instructor for description.",
    "prereq": []
  },
  {
    "uid": "003004",
    "code": "CI8900",
    "subject": "CI",
    "number": "8900",
    "honors": false,
    "writingIntensive": false,
    "name": "Fam, Youth, Comm Colloquium",
    "fullname": "Family, Youth, and Community Colloquium",
    "info": "Theories, philosophies, practices, pedagogies, epistemologies, and public policies not dealt with in regular courses. Content varies by offering.prereq: [MA or PhD] student",
    "prereq": []
  },
  {
    "uid": "798077",
    "code": "CI8902",
    "subject": "CI",
    "number": "8902",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Youth Commun in Context",
    "fullname": "Family, Youth, and Community in Social, Political, and Economic Context",
    "info": "Meanings of and relationships among family, youth, and community in social, political, and economic contexts across cultures/time. Realities/philosophies influencing these meanings/relationships. Implications/consequences for professional practice.",
    "prereq": []
  },
  {
    "uid": "799118",
    "code": "CI8904",
    "subject": "CI",
    "number": "8904",
    "honors": false,
    "writingIntensive": false,
    "name": "Families, Youth, Comm, & Educ",
    "fullname": "Families, Youth, Communities, and Education: Historical and Contemporary Perspectives",
    "info": "Teaching/learning in family/community settings and in formal education settings. Interrelationships, implications.",
    "prereq": []
  },
  {
    "uid": "797786",
    "code": "CI8913",
    "subject": "CI",
    "number": "8913",
    "honors": false,
    "writingIntensive": false,
    "name": "Interpretive Research",
    "fullname": "Interpretive Research",
    "info": "Hermeneutic, ethnomethodological, and phenomenological research methodologies. Ethics, evaluation, and usefulness of interpretive research. Practice in conducting interpretive research.",
    "prereq": []
  },
  {
    "uid": "797782",
    "code": "CI8914",
    "subject": "CI",
    "number": "8914",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Science Research",
    "fullname": "Critical Science Research",
    "info": "Origins, influences, characteristics, and central concepts. Distinction between critical science and other action research. Requisite skills/knowledge for conducting critical science research, using that knowledge in a project.",
    "prereq": []
  },
  {
    "uid": "003005",
    "code": "CI8994",
    "subject": "CI",
    "number": "8994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Res:Family,Youth,Comm",
    "fullname": "Directed Research in Family, Youth, and Community",
    "info": "tbdprereq: Family, Youth, and Community student doing Plan B research",
    "prereq": []
  }
]