[
  {
    "uid": "818217",
    "code": "CIVE6001",
    "subject": "CIVE",
    "number": "6001",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Approaches to CivE",
    "fullname": "Critical Approaches to Civic Engagement",
    "info": "This course serves as the foundational course for students in the Master of Professional Studies in Civic Engagement. It is also open to other students interested in the history, theory, and practical applications of public participation in civic processes in arenas including electoral and neighborhood-level government, health care, social work, education, urban planning, environment, and others. Students will be introduced to graduate level inquiry and augment their critical thinking skills exploring forces and systems related to culture, power, race, democracy, and organizational structures along with theories of change, change methodologies, and impediments to change. Students will grapple with real-world challenges and topical content, engaging with relevant scholarship, readings, and interdisciplinary practices. Through the course, they will interact, lead, and build relationships in class and in their communities and/or workplaces. In doing so, students gain proficiency in critical thinking, community processes, and cultural competency. Students develop skills to be facilitators and leaders of change. This course offers students unique opportunities to engage in cross-disciplinary partnerships and creative problem-solving.  ",
    "prereq": []
  },
  {
    "uid": "818221",
    "code": "CIVE6002",
    "subject": "CIVE",
    "number": "6002",
    "honors": false,
    "writingIntensive": false,
    "name": "Civic Engagement Capstone",
    "fullname": "Civic Engagement Capstone",
    "info": "This course serves as the capstone course for students in the master of professional studies in civic engagement. This course will synthesize the disciplinary and applied business coursework taken by students during their graduate career and will facilitate completion of an individualized, applied capstone project based on their community engagement career focus. This culminating experience, taken in the final year of the program, will provide students with an opportunity to engage in creative problem solving to address pressing real-world needs.",
    "prereq": []
  },
  {
    "uid": "817848",
    "code": "CIVE6311",
    "subject": "CIVE",
    "number": "6311",
    "honors": false,
    "writingIntensive": false,
    "name": "Community Driven Leadership",
    "fullname": "Facilitating Community Driven Leadership",
    "info": "In Facilitating Community Driven Leadership, students will expand their critical skills for working with diverse audiences, communities, and community leaders and will develop an understanding of how communities define leadership. Students will also clarify their positionality, define the stakes of their work, and take ownership of their individual power and organizational possibilities. The course combines contemporary theory in community engagement and leadership with applied projects that develop the student's critical and analytical skills as community leaders.",
    "prereq": []
  },
  {
    "uid": "825491",
    "code": "CIVE6312",
    "subject": "CIVE",
    "number": "6312",
    "honors": false,
    "writingIntensive": false,
    "name": "Finance Non-financial Managers",
    "fullname": "Finance Non-financial Managers",
    "info": "This course explores organizational finance from the lens of a non-financial manager, helping students gain an applied understanding of financial and accounting concepts and the role finance plays in the economic viability of a business. Students will learn to construct financial statements and use these tools to strategically determine the overall business financial health. Students will forecast possibilities for future growth in relation to costs associated with operational expenses and the cost of capital. Students will review basic economic frameworks and complete case studies focusing on the connection of global economic influences to company and industry financial indicators. Specific topics include financial analysis; planning, forecasting, and budgeting; cash flow, and strategic financing.",
    "prereq": []
  },
  {
    "uid": "825492",
    "code": "CIVE6313",
    "subject": "CIVE",
    "number": "6313",
    "honors": false,
    "writingIntensive": false,
    "name": "Data for Decision Making",
    "fullname": "Data for Decision Making",
    "info": "This course aims to provide knowledge and equip students with techniques to transform data into information that decision makers can use in order to make decisions. Students will learn the importance of source and quality of the data, input from and impact on stakeholders, and how social, community, and political or governmental dynamics come into play in the decision-making process. By the end of this course, students will understand and be able to apply decision-making data collection, analysis, synthesis, and presentation skills to incorporate an abundant and wide-variety of data in order to make an informed decision. This course will have didactic and application components where students will be able to apply the skills and knowledge learned.",
    "prereq": []
  },
  {
    "uid": "825493",
    "code": "CIVE6314",
    "subject": "CIVE",
    "number": "6314",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Projects and Teams",
    "fullname": "Leading Projects and Teams",
    "info": "This course provides students the background and skills needed to enhance teamwork, make informed business decisions, or resolve productivity issues effectively. This course will focus on the principles techniques, and tools used to plan, control, monitor, and review projects to meet organizational monetary and time constraints. Through case studies and practical application, students will practice project management skills along with setting team priorities, performance objectives, and the team decision making process.",
    "prereq": []
  },
  {
    "uid": "826725",
    "code": "CIVE6993",
    "subject": "CIVE",
    "number": "6993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies in CIVE",
    "fullname": "Directed Studies in CIVE",
    "info": "Directed Studies in CIVE",
    "prereq": []
  },
  {
    "uid": "826726",
    "code": "CIVE6994",
    "subject": "CIVE",
    "number": "6994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research in CIVE",
    "fullname": "Directed Research in CIVE",
    "info": "Directed Research in CIVE",
    "prereq": []
  }
]