[
  {
    "uid": "796957",
    "code": "CMB5180",
    "subject": "CMB",
    "number": "5180",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecology of Infectious Diseases",
    "fullname": "Ecology of Infectious Diseases",
    "info": "Ways in which host, agent, and environmental interactions influence transmission of infectious agents. Environmental dissemination, eradication/control, evolution of virulence, analytical/molecular tools.",
    "prereq": []
  },
  {
    "uid": "807940",
    "code": "CMB5181",
    "subject": "CMB",
    "number": "5181",
    "honors": false,
    "writingIntensive": false,
    "name": "Spatial Analysis Infec Dis Epi",
    "fullname": "Spatial Analysis in Infectious Disease Epidemiology",
    "info": "Spatial distribution of disease events. Exposures/outcomes. Factors that determine where diseases occur. Analyzing spatial disease data in public health, geography, epidemiology. Human/animal health related examples.",
    "prereq": []
  },
  {
    "uid": "016425",
    "code": "CMB5200",
    "subject": "CMB",
    "number": "5200",
    "honors": false,
    "writingIntensive": false,
    "name": "Stat Genetics & Genomics",
    "fullname": "Statistical Genetics and Genomics",
    "info": "Statistical issues in genomics. Gene detection, including statistical analysis/designs for linkage study and for mapping quantitative trait loci. Linkage analysis using pedigree data for codominant/dominant markers. Using radiation hybrid mapping and single cell typing. Design issues in linkage analysis, parentage testing, and marker polymorphism.",
    "prereq": []
  },
  {
    "uid": "825376",
    "code": "CMB5201",
    "subject": "CMB",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Vaccine development",
    "fullname": "Vaccine development for viral infectious diseases",
    "info": "Vaccine is the most cost-effective tool to combat viral infectious diseases, as illustrated by the successful eradication or significant reduction of once-devastating viral diseases such as smallpox, polio, rabies, and measles. The rapid development of vaccines for SARS-CoV-2, the causative agent for the COVID-19 pandemic, has helped to bring the pandemic under control. However, the misinformation about vaccines circulating in social media causes the anti-vaccine movement that threatens our public health and erodes the trust in biomedical sciences. In this course, we will:- Review basic knowledge of viruses and our immune system- Present the history and basic principles of vaccines - Introduce the representative vaccines developed for major viral diseases such as smallpox, polio, influenza, hepatitis B, human papillomavirus (HPV), Ebola, and COVID-19- Present the methods for vaccine development- Highlight the challenges and the innovative research in vaccine development - Discuss the benefits and risks of vaccinesThe overall goal of the course is to provide students with scientific knowledge of vaccines, foster students' interests in vaccine development, help students understand the basic concepts of virology and immunology, and prepare interested students for biomedical careers.Targeted students: graduate students, professional students, and senior undergraduate students who are interested in medical virology, immunology, and vaccines.",
    "prereq": []
  },
  {
    "uid": "826860",
    "code": "CMB5300",
    "subject": "CMB",
    "number": "5300",
    "honors": false,
    "writingIntensive": false,
    "name": "Prion Biology and Ecology",
    "fullname": "Prion Biology and Ecology",
    "info": "Prions are among the most mysterious pathogens known to science. Few other disease agents have confounded physicians, biologists, and chemists to the extent that prions have. In this course, we will learn about the fundamental characteristics of infectious prions, including how they become infectious and the particular diseases they are associated with. The entire field of prion biology is young and, because of this, scientists are making exciting and important discoveries that add to our understanding of infectious proteins. To appreciate how the scientific community arrived at the current state of knowledge about prions, we will revisit and challenge some of the basic assumptions and orthodoxies of biology.",
    "prereq": []
  },
  {
    "uid": "805782",
    "code": "CMB5303",
    "subject": "CMB",
    "number": "5303",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Models of Disease",
    "fullname": "Comparative Models of Disease",
    "info": "Disease processes in organ systems. Examples of animal models. Comparative medicine. Clinical relevance of problem/disease. Animal models used to study disease process/problem. Lectures.",
    "prereq": []
  },
  {
    "uid": "799302",
    "code": "CMB5335",
    "subject": "CMB",
    "number": "5335",
    "honors": false,
    "writingIntensive": false,
    "name": "Molecular Biotech Lab Novice",
    "fullname": "Molecular Biotechnology Laboratory for the Novice",
    "info": "Five day course. Understanding/applying basic concepts of biotechnology. Lectures, hands-on lab experiments.",
    "prereq": []
  },
  {
    "uid": "818508",
    "code": "CMB5340",
    "subject": "CMB",
    "number": "5340",
    "honors": false,
    "writingIntensive": false,
    "name": "Structural Biology Biomed Rsch",
    "fullname": "Structural Biology in Biomedical Research",
    "info": "Structural biology plays a central role in biomedical research, but it is a challenging field to learn. This course teaches basic structural biology and its applications to biomedical research in an accessible and practical fashion. We will cover the principles and procedures of structural biology as well as structural biology databases and software. Students will also learn how structural biology is used to solve scientific problems (e.g., elucidating molecular mechanisms and designing drugs and vaccines) and acquire skills that may facilitate their own research (e.g., reading structural biology literature and designing mutations). Student learning is achieved through classroom lectures, computer labs, written critique and oral presentation of research literature, and participation in discussion. The overall goal of this course is to help students understand structural biology and use it in their own research.",
    "prereq": []
  },
  {
    "uid": "798297",
    "code": "CMB5381",
    "subject": "CMB",
    "number": "5381",
    "honors": false,
    "writingIntensive": false,
    "name": "Patho Infectious Zoonotic Dis",
    "fullname": "Pathogenesis of Infectious Zoonotic Diseases",
    "info": "Introduction to mechanisms of transmission/pathogenesis for zoonotic infectious diseases. Lectures, review of current literature, student presentations, written reports.prereq: [Microbiology, biochemistry] courses or instr consent",
    "prereq": []
  },
  {
    "uid": "817675",
    "code": "CMB5571",
    "subject": "CMB",
    "number": "5571",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathogenomics & Molecular Epi",
    "fullname": "Pathogenomics and Molecular Epidemiology - Learning to Fly",
    "info": "This course is designed provide an introduction to the use of molecular methods in our understanding of the pathogenesis, etiology, and transmission of infectious diseases that are important to both animals and public health. This is intended as a hands-on course for the student to learn techniques related to genome sequencing, pangenome analysis, phylogenetic analysis, and metagenomic analysis, and then apply these techniques towards their own research. ",
    "prereq": []
  },
  {
    "uid": "787653",
    "code": "CMB5594",
    "subject": "CMB",
    "number": "5594",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research in CMB",
    "fullname": "Directed Research in Comparative and Molecular Biosciences",
    "info": "Independent study as determined by instructor. Usual activity includes conducting research in instructor's lab.prereq: Jr, instr consent",
    "prereq": []
  },
  {
    "uid": "801245",
    "code": "CMB5910",
    "subject": "CMB",
    "number": "5910",
    "honors": false,
    "writingIntensive": false,
    "name": "Grantwriting",
    "fullname": "Grantwriting: What Makes a Winning Proposal?",
    "info": "Components of a strong proposal. Grant submission process. What reviewers look for. How to locate grant announcements that match research interests.",
    "prereq": []
  },
  {
    "uid": "817344",
    "code": "CMB5912",
    "subject": "CMB",
    "number": "5912",
    "honors": false,
    "writingIntensive": false,
    "name": "Creativity",
    "fullname": "Creativity",
    "info": "Creativity will be explored and used to provide new perspectives on a variety of professional goals, activities and challenges. Lectures will be followed by a mixture of individual and group activities to provide a guided exploration of how these creative approaches can be applied to many situations. Students will learn skills to expand their vision, become more adept at problem solving, design more innovative research, inspire themselves and others and become more fascinating communicators.",
    "prereq": []
  },
  {
    "uid": "818317",
    "code": "CMB5915",
    "subject": "CMB",
    "number": "5915",
    "honors": false,
    "writingIntensive": false,
    "name": "Essential Stats for Life Sci",
    "fullname": "Essential Statistics for Life Sciences",
    "info": "This course is a broad overview of the principles and methods of statistical analysis used in life sciences research, including biological, veterinary, and translational research, and provides the background a new researcher needs to understand and apply commonly used statistical methods and the preparation needed for more advanced coursework.Classes will include general instruction and background information, detailed examples of how to perform the analyses, with actual data sets, and discussion on how the topic has been applied in biological research, including reading and assessing papers in the field. Computing will be performed using the R software environment, though students may use alternate software with permission.Topics will include:Descriptive statistics and exploratory graphicsUnderstanding statistical inference and interpreting P-values and confidence intervals.One and two sample inference, including t-tests, proportion tests, and non-parametric alternativesLinear regression, including the effects of confoundersANOVA methods, including pairwise comparisons and multiple comparisons",
    "prereq": []
  },
  {
    "uid": "805508",
    "code": "CMB8012",
    "subject": "CMB",
    "number": "8012",
    "honors": false,
    "writingIntensive": false,
    "name": "Skeletal Biology",
    "fullname": "Basic Concepts in Skeletal Biology",
    "info": "Cells (osteoblasts, osteoclasts, chrondrocytes) that make up skeleton. Transcription/signaling networks regulating cell growth/differentiation. Mechanisms of bone remodeling. Regulation of bone by agents such as hormones.prereq: CMB grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "012539",
    "code": "CMB8100",
    "subject": "CMB",
    "number": "8100",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Comp Molecular BioSci",
    "fullname": "Research Rotation in Comparative and Molecular Biosciences",
    "info": "Current developments in faculty research. Topics specific to research adviser's area of interest. Eight weeks.",
    "prereq": []
  },
  {
    "uid": "791846",
    "code": "CMB8134",
    "subject": "CMB",
    "number": "8134",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethical Conduct Animal Resrch",
    "fullname": "Ethical Conduct of Animal Research",
    "info": "Ethical considerations in the use of animal subjects in agricultural, veterinary, and biomedical research. Federal, state, and University guidelines relating to proper conduct for acquisition and use of animals for laboratory, observational, epidemiological, and clinical research. Regulatory requirements. Bases for proper conduct. Societal impact on scientific investigations utilizing animal subjects.",
    "prereq": []
  },
  {
    "uid": "012537",
    "code": "CMB8201",
    "subject": "CMB",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Mech Anim Hlth Dis",
    "fullname": "Mechanisms of Animal Health and Disease I",
    "info": "Basic mechanisms of animal health. Innate/acquired immunity. Immune avoidance. Cellular basis for pathogenesis of animal diseases. Molecular/genetic mechanisms of host resistance. Host/pathogen interactions.prereq: 1st yr CMB grad student or approval of crse coordinator",
    "prereq": []
  },
  {
    "uid": "013715",
    "code": "CMB8202",
    "subject": "CMB",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "Mech Anim Hlth Dis",
    "fullname": "Mechanisms of Animal Health and Disease II",
    "info": "Multi-perspective approach to critically evaluating journal articles, as done for peer-reviewed journals. Aspects of host/pathogen interactions, including molecular/genetic mechanisms of host resistance/pathogenesis.",
    "prereq": []
  },
  {
    "uid": "808731",
    "code": "CMB8208",
    "subject": "CMB",
    "number": "8208",
    "honors": false,
    "writingIntensive": false,
    "name": "Neuropsychopharmacology",
    "fullname": "Neuropsychopharmacology",
    "info": "Relationships between drugs. Biochemical, behavioral, neurophysiological consequences. Functional biogenic amine, peptidergic, other pathways. Neuronal function/behavior. Feedback mechanisms, induction, inhibition. Stimulants, hallucinogens, depressants, opiates. Student presentations.prereq: graduate student and instr consent",
    "prereq": []
  },
  {
    "uid": "801525",
    "code": "CMB8303",
    "subject": "CMB",
    "number": "8303",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Models of Disease",
    "fullname": "Comparative Models of Disease",
    "info": "Disease processes in organ systems. Examples of animal models. Comparative medicine. Clinical relevance of problem/disease. Animal models used to study disease process/problem. Lectures.prereq: Enrollment in a biological sciences grad program or instr consent",
    "prereq": []
  },
  {
    "uid": "788249",
    "code": "CMB8333",
    "subject": "CMB",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "012541",
    "code": "CMB8335",
    "subject": "CMB",
    "number": "8335",
    "honors": false,
    "writingIntensive": false,
    "name": "Mol Biol Tech",
    "fullname": "Molecular Biology Techniques",
    "info": "Basic theory and current methodologies of molecular biology and recombinant DNA technology. Lab work includes DNA and RNA hybridization, gene transfer, and polymerase chain reaction techniques. Primarily for students with limited exposure to molecular biology.",
    "prereq": []
  },
  {
    "uid": "799120",
    "code": "CMB8344",
    "subject": "CMB",
    "number": "8344",
    "honors": false,
    "writingIntensive": false,
    "name": "Mechanisms of Hormone Action",
    "fullname": "Mechanisms of Hormone Action",
    "info": "Mechanisms of hormone/cytokine action. Focuses on major signal transduction/apoptosis. Topics incorporate pharmacology, biochemistry, and cell biology of hormone action in relevant physiological systems. Lectures on basic principles. Specialized lectures. Discussion of primary literature.prereq: Course in biochemistry or cell biology or instr consent",
    "prereq": []
  },
  {
    "uid": "012538",
    "code": "CMB8351",
    "subject": "CMB",
    "number": "8351",
    "honors": false,
    "writingIntensive": false,
    "name": "Drug Recept Inter",
    "fullname": "Drug-Receptor Interactions",
    "info": "Dynamics of interaction between drugs and their receptors. Historical development of drug-receptor theory, factors affecting drug concentration in receptor compartment, determination of agonist and antagonist activity, pharmacodynamics of recombinant receptors, and functional receptor classification.",
    "prereq": []
  },
  {
    "uid": "791325",
    "code": "CMB8361",
    "subject": "CMB",
    "number": "8361",
    "honors": false,
    "writingIntensive": false,
    "name": "Neuro-Immune Inter",
    "fullname": "Neuro-Immune Interactions",
    "info": "Regulatory systems (neuroendocrine, cytokine, and autonomic nervous systems) linking brain and immune systems in brain-immune axis. Functional effects of bidirectional brain-immune regulation. Offered fall of odd-numbered years.prereq: [MICB 5218 or equiv], [NSC 5561 or equiv]",
    "prereq": {
      "and": [
        {
          "code": "MICB 5218",
          "subject": "MICB",
          "id": "5218"
        },
        {
          "code": "NSC 5561",
          "subject": "NSC",
          "id": "5561"
        }
      ]
    }
  },
  {
    "uid": "794114",
    "code": "CMB8371",
    "subject": "CMB",
    "number": "8371",
    "honors": false,
    "writingIntensive": false,
    "name": "Mucosal Immunobiology",
    "fullname": "Mucosal Immunobiology",
    "info": "Host immune processes at body surfaces. Innate/adaptive immunity at mucosal surfaces. Interactions/responses of various mucosal tissues to pathogens. Approaches to target protective vaccination to mucosal tissues. Lectures, journal.prereq: MICa 8001 or equiv or instr consent",
    "prereq": {
      "code": "MICA 8001",
      "subject": "MICA",
      "id": "8001"
    }
  },
  {
    "uid": "012545",
    "code": "CMB8394",
    "subject": "CMB",
    "number": "8394",
    "honors": false,
    "writingIntensive": false,
    "name": "Rsrch Comparative Biomed Sci",
    "fullname": "Research in Comparative Biomedical Sciences",
    "info": "Directed research determined by student's interests, in consultation with faculty mentor.prereq: Grad CMB major",
    "prereq": []
  },
  {
    "uid": "788380",
    "code": "CMB8444",
    "subject": "CMB",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "795246",
    "code": "CMB8481",
    "subject": "CMB",
    "number": "8481",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Neuorpharm",
    "fullname": "Advanced Neuropharmaceutics",
    "info": "Delivery of compounds to central nervous system (CNS) to activate proteins in specific brain regions for therapeutic benefit. Pharmaceutical/pharmacological issues specific to direct drug delivery to CNS.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "012559",
    "code": "CMB8494",
    "subject": "CMB",
    "number": "8494",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Mol Mech Dis",
    "fullname": "Research in Molecular Mechanisms of Disease",
    "info": "Directed research determined by student's interests, in consultation with faculty mentor.",
    "prereq": []
  },
  {
    "uid": "012536",
    "code": "CMB8550",
    "subject": "CMB",
    "number": "8550",
    "honors": false,
    "writingIntensive": false,
    "name": "CMB Seminar",
    "fullname": "Comparative and Molecular Biosciences Seminar",
    "info": "Student/faculty presentations of their own research or a directed topic.prereq: Biol sciences grad student",
    "prereq": []
  },
  {
    "uid": "013745",
    "code": "CMB8560",
    "subject": "CMB",
    "number": "8560",
    "honors": false,
    "writingIntensive": false,
    "name": "Research & Literature Reports",
    "fullname": "Research and Literature Reports",
    "info": "Current developments in cellular and molecular mechanisms of animal health and disease.",
    "prereq": []
  },
  {
    "uid": "013751",
    "code": "CMB8570",
    "subject": "CMB",
    "number": "8570",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Biomed Sci Seminar",
    "fullname": "Comparative Biomedical Sciences Seminar",
    "info": "Weekly seminar by primarily outside speakers discussing current issues.",
    "prereq": []
  },
  {
    "uid": "817676",
    "code": "CMB8571",
    "subject": "CMB",
    "number": "8571",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathogenomics & Molecular Epi",
    "fullname": "Pathogenomics and Molecular Epidemiology - Learning to Fly",
    "info": "This course is designed provide an introduction to the use of molecular methods in our understanding of the pathogenesis, etiology, and transmission of infectious diseases that are important to both animals and public health. This is intended as a hands-on course for the student to learn techniques related to genome sequencing, pangenome analysis, phylogenetic analysis, and metagenomic analysis, and then apply these techniques towards their own research. ",
    "prereq": []
  },
  {
    "uid": "788502",
    "code": "CMB8666",
    "subject": "CMB",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "788631",
    "code": "CMB8777",
    "subject": "CMB",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "787897",
    "code": "CMB8888",
    "subject": "CMB",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "817681",
    "code": "CMB8910",
    "subject": "CMB",
    "number": "8910",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistical Principles Rsrch",
    "fullname": "Statistical Principles of Research Design",
    "info": "This course is a broad overview of the principles and techniques of research design and methods used in veterinary and translational research, and provides the background a new researcher needs to understand the literature and make good decisions about what is appropriate for their research.prereq: intro grad level stats course or it's equivalent",
    "prereq": []
  }
]