[
  {
    "uid": "015826",
    "code": "CMBA5511",
    "subject": "CMBA",
    "number": "5511",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Acct",
    "fullname": "Financial Accounting",
    "info": "External accounting system used by firms to measure their economic performance and financial position. Students analyze corporate financial reports to discover effect of economic events. Role of financial reporting standards and financial intermediaries in allocation of capital in a modern economy. Discussions, cases.",
    "prereq": []
  },
  {
    "uid": "015827",
    "code": "CMBA5512",
    "subject": "CMBA",
    "number": "5512",
    "honors": false,
    "writingIntensive": false,
    "name": "Stat & Decis Making",
    "fullname": "Statistics and Decision Making",
    "info": "Exploratory data analysis, basic inferential procedures, statistical process control, regression analysis.",
    "prereq": []
  },
  {
    "uid": "015828",
    "code": "CMBA5513",
    "subject": "CMBA",
    "number": "5513",
    "honors": false,
    "writingIntensive": false,
    "name": "Org Behavior",
    "fullname": "Organizational Behavior",
    "info": "Theories/frameworks for analyzing behavior of individuals, groups, and  organizations. Emphasizes decision making and developing action plans.  Concepts/principles associated with human resource management (e.g., personnel selection, reward/compensation systems, collective bargaining).",
    "prereq": []
  },
  {
    "uid": "015829",
    "code": "CMBA5521",
    "subject": "CMBA",
    "number": "5521",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Acct",
    "fullname": "Managerial Accounting",
    "info": "Analyzing accounting for use in management decisions. Planning and control. Transfer pricing, performance measurements, cost behavior, cost allocation, activity based costing, standard costs.",
    "prereq": []
  },
  {
    "uid": "015830",
    "code": "CMBA5522",
    "subject": "CMBA",
    "number": "5522",
    "honors": false,
    "writingIntensive": false,
    "name": "Info Tech Mgmt",
    "fullname": "Information Technology Management",
    "info": "Managing information resources/technology. Information technologies and their applications. Competitive advantages associated with information technology. Organizational/managerial implications.",
    "prereq": []
  },
  {
    "uid": "015831",
    "code": "CMBA5523",
    "subject": "CMBA",
    "number": "5523",
    "honors": false,
    "writingIntensive": false,
    "name": "Operations Mgmt",
    "fullname": "Operations Management",
    "info": "Operations management function in different types of organizations. Emphasizes productivity and competitive operations. Concepts/principles related to management of quality/improvement within service/manufacturing organizations.",
    "prereq": []
  },
  {
    "uid": "015832",
    "code": "CMBA5531",
    "subject": "CMBA",
    "number": "5531",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Mgmt",
    "fullname": "Financial Management",
    "info": "Theory/practice of finance from an analytical approach. Applying basic finance concepts of risk, return, and valuation to decisions that a corporate financial officer or person engaged in a small business must make about sources/uses of funds during changing financial markets.",
    "prereq": []
  },
  {
    "uid": "015833",
    "code": "CMBA5532",
    "subject": "CMBA",
    "number": "5532",
    "honors": false,
    "writingIntensive": false,
    "name": "Marketing Mgmt",
    "fullname": "Marketing Management",
    "info": "Developing/implementing combination of variables to carry out a firm's strategy in its target markets. Applying analytic perspectives, concepts, and decision tools of marketing to decisions about product offerings, distribution channels, pricing, and communication programs.",
    "prereq": []
  },
  {
    "uid": "015834",
    "code": "CMBA5533",
    "subject": "CMBA",
    "number": "5533",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Strategy",
    "fullname": "Business Strategy",
    "info": "Formulating strategy for an enterprise. Shaping mission objective, product-market choice, organizational character, and allocation of resources in light of organizational circumstances and conflicting stockholder interests. Situation analysis, strategy development, written/oral presentation of strategic analyses/recommendations.",
    "prereq": []
  },
  {
    "uid": "015835",
    "code": "CMBA5541",
    "subject": "CMBA",
    "number": "5541",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiation/Residency",
    "fullname": "Negotiation/Fall Residency",
    "info": "Developing a contemporary/critical management skill through hands-on experience. In 1999-2000, the topic is negotiaion. Held in September, before fall session classes.",
    "prereq": []
  },
  {
    "uid": "015836",
    "code": "CMBA5542",
    "subject": "CMBA",
    "number": "5542",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics & Leadership",
    "fullname": "Ethics and Leadership",
    "info": "Role that ethics can play in corporate strategy. Stakeholder management, individual/collective responsibility, international business ethics.  Theoretical considerations applied to specifi issues such as business's responsibility to the environment, truthful/tasteful advertising, obligations to the local community, and managing a diverse workforce.",
    "prereq": []
  },
  {
    "uid": "015837",
    "code": "CMBA5543",
    "subject": "CMBA",
    "number": "5543",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Law",
    "fullname": "Business Law",
    "info": "Roles of government/business in society. Alternative systems of economic/political values. Social, political, economic, and cultural conflicts affecting business sector.",
    "prereq": []
  },
  {
    "uid": "015838",
    "code": "CMBA5544",
    "subject": "CMBA",
    "number": "5544",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Environment",
    "fullname": "International Business",
    "info": "Developing an integrative framework for the international activities of a firm, whether it be a newly exporting company or a full-fledged multinational. Emphasizes how international environment constrains decision-making given that exchange rates are the critical random variables in business. Determining currency prices. Managing exchange risk in close coordination with strategic choices of the firm.",
    "prereq": []
  },
  {
    "uid": "015839",
    "code": "CMBA5551",
    "subject": "CMBA",
    "number": "5551",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Mktg",
    "fullname": "Strategic Marketing",
    "info": "Product markets in which an organization should compete, sustainable competitive advantage that should be developed. Matching marketing strategy with the environment, coordination between marketing and other business functions, organization of marketing function, management of marketing process. Cases.",
    "prereq": []
  },
  {
    "uid": "015840",
    "code": "CMBA5552",
    "subject": "CMBA",
    "number": "5552",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Financial Mgmt",
    "fullname": "Advanced Financial Management",
    "info": "Executive-level corporate financial policy. Rigorous case-oriented approach. Students apply basic principles of finance on their own initiative.",
    "prereq": []
  },
  {
    "uid": "015841",
    "code": "CMBA5553",
    "subject": "CMBA",
    "number": "5553",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Mgmt Topics",
    "fullname": "Advanced Management Topics",
    "info": "Use of technology as a strategic weapon. Technology strategy: management of innovation, management in high-tech industries, issues related to industry standard-setting. Strategy in service industries. Nature of competitive interaction in changing environments.",
    "prereq": []
  },
  {
    "uid": "015842",
    "code": "CMBA5554",
    "subject": "CMBA",
    "number": "5554",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Residency",
    "fullname": "International Residency",
    "info": "Students travel to an international location for nine days, engage in discussions with international colleagues, to apply program concepts and develop broader sensitivity to cultural/social differences. Pre-trip preparation, on-site disucssion, and trip assignment are also required.  Held in late March.",
    "prereq": []
  },
  {
    "uid": "810418",
    "code": "CMBA5625",
    "subject": "CMBA",
    "number": "5625",
    "honors": false,
    "writingIntensive": false,
    "name": "Entrepreneurship & Innovation",
    "fullname": "Entrepreneurship and Innovation",
    "info": "Entrepreneurial role of employee/management in increasing organizational value through creation/formation of new businesses, products, or markets within entities ranging from early stage companies to social ventures to F500 corporations.",
    "prereq": []
  },
  {
    "uid": "811423",
    "code": "CMBA5710",
    "subject": "CMBA",
    "number": "5710",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership",
    "fullname": "Leadership",
    "info": "Self-awareness/insight concerning personal leadership/core values. Increase capabilities to understand potential personal derailment patterns/create effective strategies to address challenges. Develop lifelong executive leadership practices/habits for high performance in demanding circumstances.",
    "prereq": []
  },
  {
    "uid": "801814",
    "code": "CMBA5711",
    "subject": "CMBA",
    "number": "5711",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiation",
    "fullname": "Negotiation",
    "info": "Securing agreements between two or more parties who are interdependent and are seeking to maximize their own outcomes. Negotiation in various settings. Simulations, role-playing, cases.",
    "prereq": []
  },
  {
    "uid": "801815",
    "code": "CMBA5712",
    "subject": "CMBA",
    "number": "5712",
    "honors": false,
    "writingIntensive": false,
    "name": "Information Technology",
    "fullname": "Information Technology",
    "info": "Course prepares you with an inside-out and an outside-in perspective of how information technology is disrupting a variety of industries, how to compete in such an environment and how to strategically manage the IT function within companies to have an efficiency-innovation duality. Key principles covered in the class are developing a state-of-the-art IT strategy, getting first-hand exposure to ERP systems and learning the organizational changes involved in implementing such systems, applying disruptive and big-bang theories of IT enables disruption and learning the nuances of platform competition and multi-sided markets to fight such disruption.",
    "prereq": []
  },
  {
    "uid": "801816",
    "code": "CMBA5713",
    "subject": "CMBA",
    "number": "5713",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Accounting",
    "fullname": "Managerial Accounting",
    "info": "How to analyze accounting for management decisions. Planning/control. Transfer pricing, performance measurements, cost behavior, cost allocation, activity-based costing, standard costs.",
    "prereq": []
  },
  {
    "uid": "801817",
    "code": "CMBA5714",
    "subject": "CMBA",
    "number": "5714",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Marketing",
    "fullname": "Advanced Marketing",
    "info": "Product markets in which organization should compete. Sustainable competitive advantage. Matching marketing strategy with environment. Coordinating marketing/business functions. Organizing/managng marketing process. Cases.",
    "prereq": []
  },
  {
    "uid": "801818",
    "code": "CMBA5715",
    "subject": "CMBA",
    "number": "5715",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Financial Mgmt",
    "fullname": "Advanced Financial Management",
    "info": "Executive-level corporate financial policy. Rigorous case-oriented approach. Students apply principles of finance on their own initiative.",
    "prereq": []
  },
  {
    "uid": "801819",
    "code": "CMBA5721",
    "subject": "CMBA",
    "number": "5721",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Mgmt Topics",
    "fullname": "Advanced Management Topics",
    "info": "Topics reflects strengths, talents, and interests of class. Topics integrate different aspects of curriculum while not being limited by specific area/paradigm.",
    "prereq": []
  },
  {
    "uid": "801821",
    "code": "CMBA5722",
    "subject": "CMBA",
    "number": "5722",
    "honors": false,
    "writingIntensive": false,
    "name": "International Business",
    "fullname": "International Business",
    "info": "Developing an integrative framework for international activities of firm. How international environment constrains decision-making. How currancy prices are determined. Managing exchange risk.",
    "prereq": []
  },
  {
    "uid": "801822",
    "code": "CMBA5723",
    "subject": "CMBA",
    "number": "5723",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics",
    "fullname": "Ethics",
    "info": "Role of ethics in corporate strategy. Stakeholder management, individual/collective responsbility, international business ethics. Business's responsibility to the environment. Truthful/tasteful advertising. Obligations to local community. Managing diverse workforce.",
    "prereq": []
  },
  {
    "uid": "801823",
    "code": "CMBA5724",
    "subject": "CMBA",
    "number": "5724",
    "honors": false,
    "writingIntensive": false,
    "name": "International Residency",
    "fullname": "International Residency",
    "info": "Students travel to international location for 11 days. Discussions with international colleagues. Applying program concepts. Sensitivity to cultural/social differences. Pre-trip preparation, on-site disucssion, trip assignment.",
    "prereq": []
  },
  {
    "uid": "801806",
    "code": "CMBA5810",
    "subject": "CMBA",
    "number": "5810",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Stats & Bus Analytics",
    "fullname": "Introduction to Statistics and Business Analytics",
    "info": "This course focuses on the use of data to solve business problems and the development of skills necessary to (1) formulate a management problem as a statistical problem; (2) collect appropriate data and perform fundamental procedures of statistical analysis; and (3) to interpret, critically evaluate, and implement the results of the statistical analysis. In particular, the student should be able to: generate and use basic graphical and numerical descriptive methods; apply basic estimation and testing procedures; estimate and interpret the parameters of simple and multiple regression model; to test the utility of the model and to use it for estimation and prediction; think statistically about issues facing her/his organization; recognize when statistical methods are effective, and when they are not; and to translate, communicate, and critically evaluate the results of statistical analyses.",
    "prereq": []
  },
  {
    "uid": "801807",
    "code": "CMBA5811",
    "subject": "CMBA",
    "number": "5811",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Accounting",
    "fullname": "Financial Accounting",
    "info": "Students learn about the accounting system used by firms to measure and report their economic performance and financial position to external parties. Students analyze corporate financial reports to discover the impact of significant economic events. Discussions and cases focus on the role of financial reporting standards in informing financial intermediaries and contributing to the efficient allocation of capital in a modern economy.",
    "prereq": []
  },
  {
    "uid": "801808",
    "code": "CMBA5812",
    "subject": "CMBA",
    "number": "5812",
    "honors": false,
    "writingIntensive": false,
    "name": "Organizational Behavior",
    "fullname": "Organizational Behavior",
    "info": "Course's main purpose is to prepare you to successfully engage and lead people to achieve organizational goals. Effective managers must not only develop winning strategies, but they must also implement them. Doing so requires a thorough understanding of organizational behavior. Broadly speaking, organizational behavior is the systematic study of how people behave in organizational settings. This course is designed to develop your understanding of the complexity&#32;of orgs and how they affect behavior, build your self-knowledge and people-leadership skills, and help you learn and apply appropriate tactics and tools to improve organizational functioning and facilitate personal career success.  Course topics include: organizational (e.g. structure and culture), interpersonal (e.g. power and influence, social networks, conflict), and individual (e.g. decision making, motivation) aspects of organizational behavior.  ",
    "prereq": []
  },
  {
    "uid": "814826",
    "code": "CMBA5813",
    "subject": "CMBA",
    "number": "5813",
    "honors": false,
    "writingIntensive": false,
    "name": "Competing In The Digital Age",
    "fullname": "Competing In The Digital Age",
    "info": "This course covers the crucial and current topics of how information technology disrupts a variety of industries, how to compete in such an environment, and how to strategically manage the IT function in the companies to stay relevant in the digital age. Key principles covered in the class are developing a state-of-the-art IT disruption strategy, learning the nuances of platform competition and multi-sided markets to fight such disruption, understanding the organizational changes involved in implementing enterprise wide systems, and utilizing social and data-driven techniques to enhance marketing outcomes.",
    "prereq": []
  },
  {
    "uid": "801811",
    "code": "CMBA5814",
    "subject": "CMBA",
    "number": "5814",
    "honors": false,
    "writingIntensive": false,
    "name": "Economics",
    "fullname": "Economics",
    "info": "The goal is to improve corporate decision-making by developing better understanding of the economic environment. Emphasis is strategic, not theoretic (this is not a standard macro course.) We shall consider two primary kinds of economic phenomena (and models): i. long-run economic growth; ii. business cycles. Also and importantly, we will learn about what a central bank does and spend some time on the current world financial/macroeconomic mess. How could we do otherwise? Students will learn appropriate tools to analyze these phenomena and apply them to their own decision-making environs, both organizational and personal.",
    "prereq": []
  },
  {
    "uid": "801812",
    "code": "CMBA5815",
    "subject": "CMBA",
    "number": "5815",
    "honors": false,
    "writingIntensive": false,
    "name": "Marketing Management",
    "fullname": "Marketing Management",
    "info": "This is a study of management of the marketing function. We strive for an understanding of foundational marketing concepts and of the skills needed for strategy development. We also consider the importance of integrating financial data, operational factors, and human resource issues along with marketing research pertaining to product offering decisions, distribution channels, pricing and communication.",
    "prereq": []
  },
  {
    "uid": "801813",
    "code": "CMBA5816",
    "subject": "CMBA",
    "number": "5816",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Management",
    "fullname": "Strategic Management",
    "info": "Course provides an integrated, top management viewpoint for business students. It frames the functional courses in the CEMBA curriculum by providing a 'total' business perspective. The course objective is to develop analytic skills and deep understandings in identifying key issues and formulating and implementing appropriate strategies for creating and sustaining a competitive edge in complex business situations. The course will familiarize students with the most current theories, concepts, and techniques of strategic management using a combination of readings, case discussions, presentations and videos. Student progress will be assessed through class participation, an in-class exam, and a group project comparing the strategies of two competing firms.",
    "prereq": []
  },
  {
    "uid": "801810",
    "code": "CMBA5817",
    "subject": "CMBA",
    "number": "5817",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Management",
    "fullname": "Financial Management",
    "info": "Students apply concepts of risk, return, and valuation to decisions that a corporate financial officer or person in small business must make about sources/uses of funds during changing financial markets.",
    "prereq": []
  },
  {
    "uid": "801809",
    "code": "CMBA5818",
    "subject": "CMBA",
    "number": "5818",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain & Operations",
    "fullname": "Supply Chain and Operations",
    "info": "A majority of the people and physical assets of a company are involved in operations. The operations function represents the physical core of every company: The systems and processes that generate the goods and services to be sold to customers. World-class operations can lead to a significant and enduring competitive advantage. Failing operations mean low productivity and bad press at best, and company failure at worst. Understanding operations means understanding processes and supply chains. This course is designed to develop a basic framework to comprehend key design decisions and trade-offs within that context. As such, the course encompasses both manufacturing and service operations. Course also highlights why successful supply chain and operations management has to be strategic in nature, and how the operations function relates to other business functions such as marketing or product development.   ",
    "prereq": []
  },
  {
    "uid": "815465",
    "code": "CMBA5820",
    "subject": "CMBA",
    "number": "5820",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiation Strategies",
    "fullname": "Negotiation Strategies: Creative Solutions for Difficult Problems",
    "info": "Negotiation is the art and science of securing agreements between two or more parties who are interdependent and who are seeking to maximize their own outcomes. As such, this course deals with understanding the behavior of individuals, groups, and organizations in the context of competitive situations. We focus on understanding both the theory and process of negotiation in a variety of settings. This course is designed to be relevant to the broad spectrum of negotiation problems that are faced by managers and professionals. It is designed to complement the technical and diagnostic skills learned in other courses in the program. A basic premise of the course is that while a manager needs analytical skills to discover optimal solutions to problems, a broad array of negotiation skills are needed to get these solutions accepted and implemented. This course will allow participants the opportunity to develop these skills experientially and to understand negotiation in useful analytic frameworks. As such, considerable emphasis will be placed on simulations, role-playing, and cases.",
    "prereq": []
  },
  {
    "uid": "815466",
    "code": "CMBA5821",
    "subject": "CMBA",
    "number": "5821",
    "honors": false,
    "writingIntensive": false,
    "name": "Mangerial Accounting",
    "fullname": "Managerial Accounting",
    "info": "This course presents the topic of management accounting in depth. The purpose of management accounting is to provide information to management for costing products and decision making as well as for planning, controlling, and evaluating business activities. The student who successfully completes this class will be able to identify a managerial issue and create a solution to the problem.",
    "prereq": []
  },
  {
    "uid": "815467",
    "code": "CMBA5822",
    "subject": "CMBA",
    "number": "5822",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Leadership",
    "fullname": "Applied Leadership",
    "info": "The course objectives are to build stronger self-awareness and insight concerning personal leadership and core values, increase capabilities to understand potential personal derailment patterns and create effective strategies to address these challenges, better nurture and leverage strengths for executive leadership performance, effectively coach and motivate others as a key executive leadership attribute, and develop deeper lifelong executive leadership practices and habits for high performance in demanding circumstances.prereq: CMBA student",
    "prereq": []
  },
  {
    "uid": "815468",
    "code": "CMBA5823",
    "subject": "CMBA",
    "number": "5823",
    "honors": false,
    "writingIntensive": false,
    "name": "Competing Globally",
    "fullname": "Competing Globally",
    "info": "In this course we explore the many faces of global competition. We challenge the assumptions that global strategy is a precursor to success by exploring a set of complex forces that drive firms to internationalize. The course places special emphasis on emerging markets, given that they are home to most of the global growth and population, as well as institutional voids. We focus on factors that determine strategic choices firms make as they build their international presence, by exploring how firms: build international presence by selecting countries, and modes of entry; benefit from national competitive advantage in developed and emerging markets; diagnose and address cultural challenges of working across borders, organize to share knowledge across borders; build and sustain their multifaceted global legitimacy; collaborate across borders; prepare their managers to address cultural, personal, and career challenges in expatriate roles and on global teams.",
    "prereq": []
  },
  {
    "uid": "815469",
    "code": "CMBA5824",
    "subject": "CMBA",
    "number": "5824",
    "honors": false,
    "writingIntensive": false,
    "name": "Corp Responsibility & Ethics",
    "fullname": "Corporate Responsibility & Ethics",
    "info": "In this course we will explore both ethical challenges in the contemporary business environment as well as the strategic opportunities offered by corporate social responsibility. Students will conduct stakeholder analysis, apply ethical principles, consider alternatives, and recommend and defend an \"ethical\" final decision. We will seek to answer the question \"can business do good, and also do well?\"",
    "prereq": []
  },
  {
    "uid": "815645",
    "code": "CMBA5825",
    "subject": "CMBA",
    "number": "5825",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Marketing",
    "fullname": "Strategic Marketing",
    "info": "Marketing begins and ends with the buyer. Hence, marketing strategy is the study of delivering value to buyers in a manner that exceeds the value proposition of marketplace rivals, using both internal and external resources. From determining consumer needs to assuring customer satisfaction, a clear understanding of buyer behavior is critical to the successful formulation and implementation of marketing strategy. To that end, this course is designed to provide prospective general managers the intellectual tools necessary to design actionable marketing strategies. There will be a strong emphasis on managerial action and multiple theoretical perspectives will be discussed.",
    "prereq": []
  },
  {
    "uid": "815646",
    "code": "CMBA5826",
    "subject": "CMBA",
    "number": "5826",
    "honors": false,
    "writingIntensive": false,
    "name": "Corporate Strategy",
    "fullname": "Corporate Strategy",
    "info": "This course focuses on the strategic management of firm scope (i.e., choosing what your firm does and does not do). It provides understanding about strategic choices such as outsourcing or insourcing activates and entering or leaving lines of business. We develop and employ a set of tools that provide a disciplined way to investigate these issues. Why companies exist, notion of added value, how companies add value through resources and incentives to develop resources, why a company would participate in more than one line of business, and what considerations should guide corporate renewal.",
    "prereq": []
  },
  {
    "uid": "815647",
    "code": "CMBA5827",
    "subject": "CMBA",
    "number": "5827",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Financial Management",
    "fullname": "Advanced Financial Management",
    "info": "Financial Management introduced the theory of corporate finance and the application of value creation principles to, mainly, business operating decisions at the level of the project or initiative. This course moves on to consider decisions at the firm level.  Among the questions addressed in this course are how best to measure overall firm performance, how to best finance the company, including debt versus equity questions, when to include options in the firms financing arrangements, when to lease resources rather than buy them, when to pay a dividend and/or repurchase shares and whether mergers and acquisitions generate value added.",
    "prereq": []
  },
  {
    "uid": "815648",
    "code": "CMBA5828",
    "subject": "CMBA",
    "number": "5828",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Residency - Study Abroad",
    "fullname": "International Residency - Study Abroad",
    "info": "Students travel to an international location for 9-10 days. This provides the opportunity to engage in discussions with international colleagues, apply program concepts, and develop a broader sensitivity to cultural and social differences. Pre-trip preparation, assignments, on-site discussions and activities, and post-trip assignments are required.",
    "prereq": []
  },
  {
    "uid": "815649",
    "code": "CMBA5829",
    "subject": "CMBA",
    "number": "5829",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Res: Global Team Project",
    "fullname": "International Residency – Global Team Project",
    "info": "The Global Team Project (GTP) provides Carlson School Executive MBA students with the unique opportunity to work in a collaborative team environment across cultures, industries, and markets alongside students from our Vienna Executive MBA program and our China Executive MBA program. As participants in the GTP, students develop advanced skills in teamwork, cross-cultural collaboration, and business plan development within a dynamic environment shaped by academic rigor and the demands of real-world international business.",
    "prereq": []
  },
  {
    "uid": "813823",
    "code": "CMBA5830",
    "subject": "CMBA",
    "number": "5830",
    "honors": false,
    "writingIntensive": false,
    "name": "Power & Influence",
    "fullname": "Advanced Management Topic Elective: Power & Influence",
    "info": "Elective courses are offered across cohorts on preference basis. Course topics may change from year to year and can cover a variety of areas including entrepreneurship/innovation, strategy, IT, and others.",
    "prereq": []
  },
  {
    "uid": "813891",
    "code": "CMBA5831",
    "subject": "CMBA",
    "number": "5831",
    "honors": false,
    "writingIntensive": false,
    "name": "Entrepreneurship & Innovation",
    "fullname": "Advanced Management Topic Elective: Entrepreneurship & Innovation",
    "info": "Elective courses are offered across cohorts on preference basis. Course topics may change from year to year and can cover a variety of areas from entrepreneurship/innovation, strategy, IT, and others.",
    "prereq": []
  },
  {
    "uid": "813892",
    "code": "CMBA5832",
    "subject": "CMBA",
    "number": "5832",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Analytics",
    "fullname": "Advanced Management Topic Elective: Business Analytics for Competitive Advantage",
    "info": "Elective courses are offered across cohorts on preference basis. Course topics may change from year to year and can cover a variety of areas from entrepreneurship/innovation, strategy, IT, and others.",
    "prereq": []
  },
  {
    "uid": "813893",
    "code": "CMBA5833",
    "subject": "CMBA",
    "number": "5833",
    "honors": false,
    "writingIntensive": false,
    "name": "Healthcare Innovations",
    "fullname": "Advanced Management Topics Elective - Healthcare Innovations",
    "info": "Elective courses are offered across cohorts on preference basis. Course topics may change from year to year and can cover a variety of areas from entrepreneurship/innovation, strategy, IT, and others.",
    "prereq": []
  },
  {
    "uid": "825833",
    "code": "CMBA5838",
    "subject": "CMBA",
    "number": "5838",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Accounting",
    "fullname": "Financial Accounting",
    "info": "Financial Accounting ",
    "prereq": []
  },
  {
    "uid": "825800",
    "code": "CMBA5839",
    "subject": "CMBA",
    "number": "5839",
    "honors": false,
    "writingIntensive": false,
    "name": "Management of Teams",
    "fullname": "Management of Teams",
    "info": "Management of Teams",
    "prereq": []
  },
  {
    "uid": "825819",
    "code": "CMBA5842",
    "subject": "CMBA",
    "number": "5842",
    "honors": false,
    "writingIntensive": false,
    "name": "Marketing Management",
    "fullname": "Marketing Management",
    "info": "Marketing Management ",
    "prereq": []
  },
  {
    "uid": "825820",
    "code": "CMBA5843",
    "subject": "CMBA",
    "number": "5843",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Driven Decision Making",
    "fullname": "Data Driven Decision Making",
    "info": "Data Driven Decision Making",
    "prereq": []
  },
  {
    "uid": "825801",
    "code": "CMBA5844",
    "subject": "CMBA",
    "number": "5844",
    "honors": false,
    "writingIntensive": false,
    "name": "Organizational Behavior",
    "fullname": "Organizational Behavior",
    "info": "Course's main purpose is to prepare you to successfully engage and lead people to achieve organizational goals. Effective managers must not only develop winning strategies, but they must also implement them. Doing so requires a thorough understanding of organizational behavior. Broadly speaking, organizational behavior is the systematic study of how people behave in organizational settings. This course is designed to develop your understanding of the complexity of orgs and how they affect behavior, build your self-knowledge and people-leadership skills, and help you learn and apply appropriate tactics and tools to improve organizational functioning and facilitate personal career success.  Course topics include: organizational (e.g. structure and culture), interpersonal (e.g. power and influence, social networks, conflict), and individual (e.g. decision making, motivation) aspects of organizational behavior.  ",
    "prereq": []
  },
  {
    "uid": "825849",
    "code": "CMBA5845",
    "subject": "CMBA",
    "number": "5845",
    "honors": false,
    "writingIntensive": false,
    "name": "Executive Perspectives",
    "fullname": "Executive Perspectives",
    "info": "Top Management Perspectives",
    "prereq": []
  },
  {
    "uid": "825850",
    "code": "CMBA5846",
    "subject": "CMBA",
    "number": "5846",
    "honors": false,
    "writingIntensive": false,
    "name": "Exec Leadership Insights",
    "fullname": "Executive Leadership Insights",
    "info": "Executive Leadership Insights",
    "prereq": []
  },
  {
    "uid": "825802",
    "code": "CMBA5847",
    "subject": "CMBA",
    "number": "5847",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Management",
    "fullname": "Strategic Management",
    "info": "Course provides an integrated, top management viewpoint for business students. It frames the functional courses in the CEMBA curriculum by providing a 'total' business perspective. The course objective is to develop analytic skills and deep understandings in identifying key issues and formulating and implementing appropriate strategies for creating and sustaining a competitive edge in complex business situations. The course will familiarize students with the most current theories, concepts, and techniques of strategic management using a combination of readings, case discussions, presentations, and videos. Student progress will be assessed through class participation, an in-class exam, and a group project comparing the strategies of two competing firms.",
    "prereq": []
  },
  {
    "uid": "825803",
    "code": "CMBA5848",
    "subject": "CMBA",
    "number": "5848",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Management",
    "fullname": "Financial Management",
    "info": "Students apply concepts of risk, return, and valuation to decisions that a corporate financial officer or person in small business must make about sources/uses of funds during changing financial markets.",
    "prereq": []
  },
  {
    "uid": "825804",
    "code": "CMBA5849",
    "subject": "CMBA",
    "number": "5849",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain & Operations",
    "fullname": "Supply Chain & Operations",
    "info": "A majority of the people and physical assets of a company are involved in operations. The operations function represents the physical core of every company: The systems and processes that generate the goods and services to be sold to customers. World-class operations can lead to a significant and enduring competitive advantage. Failing operations mean low productivity and bad press at best, and company failure at worst. Understanding operations means understanding processes and supply chains. This course is designed to develop a basic framework to comprehend key design decisions and trade-offs within that context. As such, the course encompasses both manufacturing and service operations. Course also highlights why successful supply chain and operations management has to be strategic in nature, and how the operations function relates to other business functions such as marketing or product development.   ",
    "prereq": []
  },
  {
    "uid": "825821",
    "code": "CMBA5850",
    "subject": "CMBA",
    "number": "5850",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Capital Management",
    "fullname": "Human Capital Management",
    "info": "Human Capital Management ",
    "prereq": []
  },
  {
    "uid": "825805",
    "code": "CMBA5851",
    "subject": "CMBA",
    "number": "5851",
    "honors": false,
    "writingIntensive": false,
    "name": "Economics",
    "fullname": "Economics",
    "info": "The goal is to improve corporate decision-making by developing better understanding of the economic environment. Emphasis is strategic, not theoretic (this is not a standard macro course.) We shall consider two primary kinds of economic phenomena (and models): i. long-run economic growth; ii. business cycles. Also and importantly, we will learn about what a central bank does and spend some time on the current world financial/macroeconomic mess. How could we do otherwise? Students will learn appropriate tools to analyze these phenomena and apply them to their own decision-making environs, both organizational and personal.",
    "prereq": []
  },
  {
    "uid": "825834",
    "code": "CMBA5852",
    "subject": "CMBA",
    "number": "5852",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Capital Mgmt.",
    "fullname": "Human Capital Management",
    "info": "Human Capital Management ",
    "prereq": []
  },
  {
    "uid": "825835",
    "code": "CMBA5853",
    "subject": "CMBA",
    "number": "5853",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiation Strategies",
    "fullname": "Negotiation Strategies: Creative Solutions for Difficult Problems",
    "info": "At its core, negotiation is the art and science of getting what you want in a world of innumerable interests, possibilities, and standards of fairness---a world in which we must often compete or cooperate with others to do anything from picking a restaurant to transforming markets. The objective of this course is to equip students with a simple, ready-to-use framework from which we can prepare for and engage in negotiations. Topics include interest-based bargaining, psychological biases, multiparty negotiations, and hard tactics. Regular cases and exercises reinforce our negotiation framework and provide students a safe forum to thoughtfully reflect on their experiences and improve.",
    "prereq": []
  },
  {
    "uid": "825836",
    "code": "CMBA5854",
    "subject": "CMBA",
    "number": "5854",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Accounting",
    "fullname": "Managerial Accounting",
    "info": "Cost systems introduced as potential sources of sustainable competitive advantage. Focuses on designing cost systems to provide manager with accurate, relevant, and timely information.",
    "prereq": []
  },
  {
    "uid": "825837",
    "code": "CMBA5855",
    "subject": "CMBA",
    "number": "5855",
    "honors": false,
    "writingIntensive": false,
    "name": "Competing Globally",
    "fullname": "Competing Globally",
    "info": "In this course, we explore the many faces of global competition. We challenge the assumptions that global strategy is a precursor to success by exploring a set of complex forces that drive firms to internationalize. The course places special emphasis on emerging markets, given that they are home to most of the global growth and population, as well as institutional voids. We focus on factors that determine strategic choices firms make as they build their international presence, by exploring how firms: build international presence by selecting countries, and modes of entry; benefit from national competitive advantage in developed and emerging markets; diagnose and address cultural challenges of working across borders, organize to share knowledge across borders; build and sustain their multifaceted global legitimacy; collaborate across borders; prepare their managers to address cultural, personal, and career challenges in expatriate roles and on global teams.",
    "prereq": []
  },
  {
    "uid": "825838",
    "code": "CMBA5856",
    "subject": "CMBA",
    "number": "5856",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics",
    "fullname": "Ethics & Corporate Responsibility",
    "info": "In this course, we will explore both ethical challenges in the contemporary business environment as well as the strategic opportunities offered by corporate social responsibility. Students will conduct stakeholder analysis, apply ethical principles, consider alternatives, and recommend and defend an \"ethical\" final decision. We will seek to answer the question \"can business do good, and also do well?\"",
    "prereq": []
  },
  {
    "uid": "825839",
    "code": "CMBA5857",
    "subject": "CMBA",
    "number": "5857",
    "honors": false,
    "writingIntensive": false,
    "name": "Corporate Strategy",
    "fullname": "Corporate Strategy",
    "info": "This course focuses on the strategic management of firm scope (i.e., choosing what your firm does and does not do). It provides understanding about strategic choices such as outsourcing or ‘insourcing’ activates and entering or leaving lines of business. We develop and employ a set of tools that provide a disciplined way to investigate these issues. Why companies exist, notion of added value, how companies add value through resources and incentives to develop resources, why a company would participate in more than one line of business, and what considerations should guide corporate renewal.",
    "prereq": []
  },
  {
    "uid": "825840",
    "code": "CMBA5861",
    "subject": "CMBA",
    "number": "5861",
    "honors": false,
    "writingIntensive": false,
    "name": "Customer Centric Marketing",
    "fullname": "Customer Centric Marketing",
    "info": "Customer Centric Marketing",
    "prereq": []
  },
  {
    "uid": "825841",
    "code": "CMBA5862",
    "subject": "CMBA",
    "number": "5862",
    "honors": false,
    "writingIntensive": false,
    "name": "Competing in the Digital Age",
    "fullname": "Competing in the Digital Age",
    "info": "This course covers the crucial and current topics of how information technology disrupts a variety of industries, how to compete in such an environment, and how to strategically manage the IT function in the companies to stay relevant in the digital age. Key principles covered in the class are developing a state-of-the-art IT disruption strategy, learning the nuances of platform competition and multi-sided markets to fight such disruption, understanding the organizational changes involved in implementing enterprise wide systems, and utilizing social and data-driven techniques to enhance marketing outcomes.",
    "prereq": []
  },
  {
    "uid": "825842",
    "code": "CMBA5863",
    "subject": "CMBA",
    "number": "5863",
    "honors": false,
    "writingIntensive": false,
    "name": "Entrepreneurship & Innovation",
    "fullname": "Entrepreneurship & Innovation",
    "info": "Entrepreneurship & Innovation",
    "prereq": []
  },
  {
    "uid": "825843",
    "code": "CMBA5864",
    "subject": "CMBA",
    "number": "5864",
    "honors": false,
    "writingIntensive": false,
    "name": "Power & Influence",
    "fullname": "Power & Influence",
    "info": "Power & Influence ",
    "prereq": []
  },
  {
    "uid": "825844",
    "code": "CMBA5865",
    "subject": "CMBA",
    "number": "5865",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Law",
    "fullname": "Business Law",
    "info": "Business Law",
    "prereq": []
  },
  {
    "uid": "825845",
    "code": "CMBA5866",
    "subject": "CMBA",
    "number": "5866",
    "honors": false,
    "writingIntensive": false,
    "name": "International Residency",
    "fullname": "International Residency",
    "info": "Students travel to an international location for 9-10 days. This provides the opportunity to engage in discussions with international colleagues, apply program concepts, and develop a broader sensitivity to cultural and social differences. Pre-trip preparation, assignments, on-site discussions and activities, and post-trip assignments are required.",
    "prereq": []
  },
  {
    "uid": "825846",
    "code": "CMBA5867",
    "subject": "CMBA",
    "number": "5867",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Team Project",
    "fullname": "International Residency: Global Team Project",
    "info": "The Global Team Project (GTP) provides Carlson School Executive MBA students with the unique opportunity to work in a collaborative team environment across cultures, industries, and markets alongside students from our Vienna Executive MBA program and our China Executive MBA program. As participants in the GTP, students develop advanced skills in teamwork, cross-cultural collaboration, and business plan development within a dynamic environment shaped by academic rigor and the demands of real-world international business.",
    "prereq": []
  }
]