[
  {
    "uid": "791689",
    "code": "CNES1001",
    "subject": "CNES",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "World of the Bible",
    "fullname": "World of the Bible: Religions, Empires, and Discourses of Power",
    "info": "Hebrew Bible (Old Testament), its cultural background in Ancient Near East. Comparative study of Ancient Near Eastern and biblical literature, religion, lifestyles, and law. Nature of myth, concepts of divine. Origins, authorship, and transmission of texts that constitute Hebrew Bible.",
    "prereq": []
  },
  {
    "uid": "009365",
    "code": "CNES1043",
    "subject": "CNES",
    "number": "1043",
    "honors": false,
    "writingIntensive": false,
    "name": "Greek and Roman Archaeology",
    "fullname": "Introduction to Greek and Roman Archaeology",
    "info": "Role that material culture, including art/architecture, plays in forming our picture of Classical past. Relationship between archaeology and other disciplines dealing with past. Selected sites, motives/methods of research. How results are used by archaeologists and general public.",
    "prereq": []
  },
  {
    "uid": "796318",
    "code": "CNES1044",
    "subject": "CNES",
    "number": "1044",
    "honors": false,
    "writingIntensive": false,
    "name": "Near Eastern Archaeology",
    "fullname": "Introduction to Near Eastern Archaeology",
    "info": "Near Eastern peoples before Greco-Roman times, how archaeology discovered them. Cultural history going back 10,000+ years, including rise of farming, domestic life, states, and empires. Art, ideas, and architecture of Egypt, Babylonia, Persia, and other civilizations.",
    "prereq": []
  },
  {
    "uid": "009305",
    "code": "CNES1046",
    "subject": "CNES",
    "number": "1046",
    "honors": false,
    "writingIntensive": false,
    "name": "Greek/Latin Health Terminology",
    "fullname": "Technical Terminology for the Health Professions",
    "info": "Greek/Latin prefixes, suffixes, roots basic to vocabulary of health professions. Taught through computer-assisted instruction.",
    "prereq": []
  },
  {
    "uid": "795796",
    "code": "CNES1202",
    "subject": "CNES",
    "number": "1202",
    "honors": false,
    "writingIntensive": false,
    "name": "Bible: Prophecy",
    "fullname": "Prophecy in Ancient Israel",
    "info": "Survey of Israelite prophets. Emphasizes Amos, Hosea, Isaiah, Jeremiah, Ezekiel, and Second Isaiah. Prophetic contributions to Israelite religion. Personality of prophets. Politics and prophetic reaction. Textual analysis and biblical scholarship. Prophecy viewed cross-culturally.",
    "prereq": []
  },
  {
    "uid": "805661",
    "code": "CNES1903",
    "subject": "CNES",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "793790",
    "code": "CNES1905",
    "subject": "CNES",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in class schedule.",
    "prereq": []
  },
  {
    "uid": "797586",
    "code": "CNES1909W",
    "subject": "CNES",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "797691",
    "code": "CNES1910W",
    "subject": "CNES",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr or up to 30 cr",
    "prereq": []
  },
  {
    "uid": "817032",
    "code": "CNES1912",
    "subject": "CNES",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading Bible as Literature",
    "fullname": "The Never Ending Story: Reading the Bible as Literature",
    "info": "\"There have been great societies that did not use the wheel, but there have been no societies that did not tell stories.\" (Ursula K. Le Guin) The Hebrew Bible (Old Testament) is full of stories, a story of the first humans in a garden accompanied by a snake; of a boat filled with animals and a devastating flood; and of a father who almost sacrifices his son. There are stories of wanderings in wilderness, of prophets, kings and queens, of villains and heroes; some stories of love and friendship, and endless stories of war, violence and death. These stories do not end with the Hebrew Bible. They have been told and retold through millennia and are still part of our own cultures. In this course we will read stories from the Hebrew Bible with the help of narrative analysis (through analyzing the stories' plots, characters, and other literary strategies). We will also look at examples of how these stories have been used and reused through history until today.",
    "prereq": []
  },
  {
    "uid": "818888",
    "code": "CNES1914",
    "subject": "CNES",
    "number": "1914",
    "honors": false,
    "writingIntensive": false,
    "name": "Never Ending Story: Genesis",
    "fullname": "The Never Ending Story: The Book of Genesis and its History",
    "info": "“There have been great societies that did not use the wheel, but there have been no societies that did not tell stories.” (Ursula K. Le Guin.). The Hebrew Bible (Old Testament) is full of stories, a story of the first humans in a garden accompanied by a snake; of a boat filled with animals and a devastating flood; of a tower that was supposed to reach the heavens, of women who strive to have children, and of a father who almost sacrifices his son. Does it sound familiar? All these stories are to be found in the first book of the Bible, the book of Genesis. Some of the stories are about villains, some about heroes; some stories of love and friendship, and there are endless stories of war, violence and death. The stories from Genesis do not end with the Hebrew Bible. They have been told and retold through millennia and are still part of our own cultures. In this course we will read stories from Genesis with the help of narrative analysis (through analyzing the stories’ plot, characters, and other literary strategies), we will learn some basics about how scholars today think the book of Genesis came into being, and we study examples of how stories from Genesis  have been used and reused through history all the way up to The  Handmaid's Tale and modern  disaster movies.  ",
    "prereq": []
  },
  {
    "uid": "009103",
    "code": "CNES3008",
    "subject": "CNES",
    "number": "3008",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Art",
    "fullname": "History of Ancient Art",
    "info": "Architecture, sculpture, and painting of selected early cultures; emphasis on influences on the development of Western art.",
    "prereq": []
  },
  {
    "uid": "009363",
    "code": "CNES3035",
    "subject": "CNES",
    "number": "3035",
    "honors": false,
    "writingIntensive": false,
    "name": "Myth in Western Art",
    "fullname": "Classical Myth in Western Art",
    "info": "Role of myth in visual arts. Major figures/stories that became popular in ancient world and have fascinated artists/audiences ever since.",
    "prereq": []
  },
  {
    "uid": "010242",
    "code": "CNES3070",
    "subject": "CNES",
    "number": "3070",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Ancient Religion",
    "fullname": "Topics in Ancient Religion",
    "info": "Study of a specific aspect of religion in Classical and Near Eastern antiquity such as healing cults, magic and divination, Gnosticism, or prophecy and authority. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "009232",
    "code": "CNES3073",
    "subject": "CNES",
    "number": "3073",
    "honors": false,
    "writingIntensive": false,
    "name": "Roman Rel & Early Christianity",
    "fullname": "Roman Religion and Early Christianity",
    "info": "Etruscan, Republican religion. Appeal of non-Roman cults. Ruler worship. Christians in Asia Minor, Egypt, and the West. Popular piety, Christian and non-Christian. Rabbinic Judaism.  Varieties of Christianity in 2nd and 3rd centuries. Influence of Greco-Roman culture on emerging church. Constantine and Julian.",
    "prereq": []
  },
  {
    "uid": "801376",
    "code": "CNES3077",
    "subject": "CNES",
    "number": "3077",
    "honors": false,
    "writingIntensive": false,
    "name": "Religious Violence",
    "fullname": "Religious Violence in the Early Roman Empire: Jews, Christians, and Pagans",
    "info": "Methods for understanding discourses of violence. Ways religious traditions shaped ethnic identity/practices and views of sacrifice, martyrdom, spectacles of violence, apocalyptic ideologies of violence, state persecution, texts and terror, and holy war.",
    "prereq": []
  },
  {
    "uid": "009676",
    "code": "CNES3083W",
    "subject": "CNES",
    "number": "3083",
    "honors": false,
    "writingIntensive": true,
    "name": "Ancient Comedy",
    "fullname": "Ancient Comedy",
    "info": "Greek/Roman comic drama (e.g., Aristophanes, Menander, Plautus, Terence).",
    "prereq": []
  },
  {
    "uid": "801588",
    "code": "CNES3101",
    "subject": "CNES",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Greece: Age of Homer",
    "fullname": "Ancient Greece: Poet and Hero in the Age of Homer",
    "info": "Homer and his epic poetry. Trojan war. Greek lyric poets (Sappho, Pindar). Early Greek philosophy.",
    "prereq": []
  },
  {
    "uid": "801589",
    "code": "CNES3102",
    "subject": "CNES",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Greece: Age of Athens",
    "fullname": "Ancient Greece: The Golden Age of Athens",
    "info": "Emergence of democracy in shadows of two brutal wars: one foreign, one civil. Democracy, war, empire through lens of tragedy, comedy, art from fifth-century Athens.",
    "prereq": []
  },
  {
    "uid": "009685",
    "code": "CNES3104",
    "subject": "CNES",
    "number": "3104",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Rome: Kings & Consuls",
    "fullname": "Ancient Rome: Kings and Consuls",
    "info": "Roman Republic from origins to Caesar's death.",
    "prereq": []
  },
  {
    "uid": "791393",
    "code": "CNES3107",
    "subject": "CNES",
    "number": "3107",
    "honors": false,
    "writingIntensive": false,
    "name": "Age of Constantine the Great",
    "fullname": "Age of Constantine the Great",
    "info": "Change/continuity in Roman Empire from its 2nd-century zenith through 3rd-century crisis, first Christian emperor (306 to 337 A.D.), and beyond. Replacement of classical paganism by Christianity. Beginnings of monasticism. Superpower relations between Roman, Persian empires. Meets with 1023.",
    "prereq": []
  },
  {
    "uid": "791394",
    "code": "CNES3108",
    "subject": "CNES",
    "number": "3108",
    "honors": false,
    "writingIntensive": false,
    "name": "Age of St. Augustine of Hippo",
    "fullname": "Age of St. Augustine of Hippo",
    "info": "Cultural diversity A.D. 363 to circa 500 A.D. Replacement of Roman Empire in Western Europe by barbarian kingdoms, consolidation of Constantinople as capital in East. Literature, art, thought resulting from new dominance of Christianity, particularly Augustine of Hippo. ",
    "prereq": []
  },
  {
    "uid": "799481",
    "code": "CNES3109",
    "subject": "CNES",
    "number": "3109",
    "honors": false,
    "writingIntensive": false,
    "name": "Age of Justinian and Muhammad",
    "fullname": "The Age of Justinian and Muhammad (c.500-c.700 A.D.)",
    "info": "Uses sources written between 500 and 700 A.D. to consider history, art, religion, and architecture of Golden Age of Byzantium, its superpower relations with Persian Empire. Way that Arab invasions from mid-7th century altered configuration of Mediterranean world and Near East.",
    "prereq": []
  },
  {
    "uid": "009356",
    "code": "CNES3142",
    "subject": "CNES",
    "number": "3142",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of Egypt",
    "fullname": "Art of Egypt",
    "info": "Arts and architecture of Egypt, from prehistoric times to emergence of modern Egypt. Emphasizes elements of continuity and of change that have shaped Egyptian culture.",
    "prereq": []
  },
  {
    "uid": "806716",
    "code": "CNES3156",
    "subject": "CNES",
    "number": "3156",
    "honors": false,
    "writingIntensive": false,
    "name": "Greek and Roman Art",
    "fullname": "Greek and Roman Art and Archaeology",
    "info": "History of Greek, Hellenistic, Etruscan, and Roman art, from formation of Greek city states to transformation of Roman visual culture. Roles visual culture played, including for Alexander and his successors in forging multiethnic, globally minded empires. Creative inventions ofpeoples influenced by the Romans.",
    "prereq": []
  },
  {
    "uid": "014304",
    "code": "CNES3172",
    "subject": "CNES",
    "number": "3172",
    "honors": false,
    "writingIntensive": false,
    "name": "Arch Israel",
    "fullname": "Archaeology of Israel",
    "info": "Archaeological data relevant to the Old Testament. Major sites in the Holy Land and other areas of the Mediterranean and Near East. Evidence of pottery, inscriptions, manuscripts, and coins. Excavation methods. Archaeology as a tool for study of ancient religions.",
    "prereq": []
  },
  {
    "uid": "797142",
    "code": "CNES3203",
    "subject": "CNES",
    "number": "3203",
    "honors": false,
    "writingIntensive": false,
    "name": "The Bible: Wisdom, Poetry",
    "fullname": "The Bible: Wisdom, Poetry, and Apocalyptic",
    "info": "Survey of books of Psalms, Proverbs, Job, Song of Songs, Lamentations, Ecclesiastes (Qoheleth). Characteristics of biblical poetry. Conceptions of Israelite wisdom writing. Traits of early Jewish apocalyptic writing. ",
    "prereq": []
  },
  {
    "uid": "807978",
    "code": "CNES3204",
    "subject": "CNES",
    "number": "3204",
    "honors": false,
    "writingIntensive": false,
    "name": "The Dead Sea Scrolls",
    "fullname": "The Dead Sea Scrolls",
    "info": "Introduction to Dead Sea Scrolls and Qumran. Contents of Dead Sea Scrolls, significance for understanding development of the Bible. Background of Judaism and Christianity. Archaeological site of Qumran.",
    "prereq": []
  },
  {
    "uid": "796066",
    "code": "CNES3321",
    "subject": "CNES",
    "number": "3321",
    "honors": false,
    "writingIntensive": false,
    "name": "Nautical Archaeology",
    "fullname": "Ships and Seafaring: An Introduction to Nautical Archaeology",
    "info": "Archaeology of ships, from Mediterranean to Great Lakes. Method/theory of underwater archaeology. Examples from antiquity to modern times: Egyptian solar barges, ancient warships, oceanic freighters. Aspects of nautical culture, including routes/trade, using evidence of ship construction, materials, cargoes.",
    "prereq": []
  },
  {
    "uid": "010337",
    "code": "CNES3340",
    "subject": "CNES",
    "number": "3340",
    "honors": false,
    "writingIntensive": false,
    "name": "Arch Practicum",
    "fullname": "Practicum in Archaeological Field and Computer Techniques",
    "info": "Methods used for excavation of Old and New World sites. Meets at archaeometry/computer lab for part of the semester and at a selectedsite in Minnesota for day-long sessions for 9 to 10 weeks.",
    "prereq": []
  },
  {
    "uid": "797456",
    "code": "CNES3503",
    "subject": "CNES",
    "number": "3503",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist/Israelite Rel",
    "fullname": "History and Development of Israelite Religion I",
    "info": "Survey of the evolution of Israelite religion. Cultic practices. Law and religion. Prophecy. Religion and historiography. Relationship to surrounding religious systems.",
    "prereq": []
  },
  {
    "uid": "797424",
    "code": "CNES3505",
    "subject": "CNES",
    "number": "3505",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist/Israelite Religion",
    "fullname": "History and Development of Israelite Religion I",
    "info": "Survey of the evolution of Israelite religion. Cultic practices, law/religion. Prophecy, religion, and historiography. Relationship to surrounding religious systems.",
    "prereq": []
  },
  {
    "uid": "790141",
    "code": "CNES4051",
    "subject": "CNES",
    "number": "4051",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Near East and Egypt",
    "fullname": "Ancient Near East and Egypt: Neolithic to 1500 BCE",
    "info": "Lands of Western Asia and Northeast Africa from Neolithic through Middle Bronze Age. Interdependent technological/political developments such as agriculture, state formation, and writing. Use of literature/art as vehicles for articulating concepts. Changing relationships among cultures/polities of ancient Near East and regions beyond.prereq: Previous coursework in ancient history recommended",
    "prereq": []
  },
  {
    "uid": "790714",
    "code": "CNES4052",
    "subject": "CNES",
    "number": "4052",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Near East and Egypt",
    "fullname": "Ancient Near East and Egypt: 1500 to 323 BCE",
    "info": "Lands of Western Asia and Northeast Africa from Late Bronze Age to death of Alexander in 323 BCE. Growth/decline of empires. Diplomatic relations and sociopolitic transformations among Late Bronze and Iron Age states. New military technologies. Developments in religion/theology.prereq: 4051 or prev coursework in ancient history recommended",
    "prereq": {
      "code": "CNES 4051",
      "subject": "CNES",
      "id": "4051"
    }
  },
  {
    "uid": "009512",
    "code": "CNES5013",
    "subject": "CNES",
    "number": "5013",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Roman Law",
    "fullname": "Introduction to Roman Law",
    "info": "Survey of Roman law from social and historical perspectives. Basic concepts of Roman private law and legal procedure.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "801407",
    "code": "CNES5014",
    "subject": "CNES",
    "number": "5014",
    "honors": false,
    "writingIntensive": false,
    "name": "Who Owns the Past?",
    "fullname": "Who Owns the Past?: Archaeology, History, Ethics, and Laws",
    "info": "Competition among collectors, museums, countries, native cultures, religious groups, archaeologists, and historians for right to control cultural resources. Legal/ethical codes to assess/adjudicate claims.",
    "prereq": []
  },
  {
    "uid": "009831",
    "code": "CNES5070",
    "subject": "CNES",
    "number": "5070",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Ancient Religion",
    "fullname": "Topics in Ancient Religion",
    "info": "Specific aspect of religion in Classical and Near Eastern antiquity, such as healing cults, magic/divination, Gnosticism, or prophecy/authority. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "797188",
    "code": "CNES5073",
    "subject": "CNES",
    "number": "5073",
    "honors": false,
    "writingIntensive": false,
    "name": "Roman Rel & Early Christianity",
    "fullname": "Roman Religion and Early Christianity",
    "info": "Etruscan, Republican religion. Appeal of non-Roman cults. Ruler worship. Christians in Asia Minor, Egypt, and the West. Popular piety, Christian and non-Christian. Rabbinic Judaism.  Varieties of Christianity in 2nd and 3rd centuries. Influence of Greco-Roman culture on emerging church. Constantine and Julian. Meets with 3073.",
    "prereq": []
  },
  {
    "uid": "800228",
    "code": "CNES5076",
    "subject": "CNES",
    "number": "5076",
    "honors": false,
    "writingIntensive": false,
    "name": "The Apostle Paul",
    "fullname": "Apostle Paul: Life, Letters, and Legacy",
    "info": "How/what can we know about Paul. What his message was. What he was fighting. How he was later understood by friends/foes.",
    "prereq": []
  },
  {
    "uid": "801377",
    "code": "CNES5077",
    "subject": "CNES",
    "number": "5077",
    "honors": false,
    "writingIntensive": false,
    "name": "Religious Violence",
    "fullname": "Religious Violence in the Early Roman Empire: Jews, Christians, and Pagans",
    "info": "Methods for understanding discourses of violence. Ways religious traditions shaped ethnic identity/practices and views of sacrifice, martyrdom, spectacles of violence, apocalyptic ideologies of violence, state persecution, texts and terror, and holy war.",
    "prereq": []
  },
  {
    "uid": "010287",
    "code": "CNES5080",
    "subject": "CNES",
    "number": "5080",
    "honors": false,
    "writingIntensive": false,
    "name": "New Test Proseminar",
    "fullname": "New Testament Proseminar",
    "info": "Study of some specific aspect of the New Testament and related literature. The class is organized as a discussion seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788962",
    "code": "CNES5081W",
    "subject": "CNES",
    "number": "5081",
    "honors": false,
    "writingIntensive": true,
    "name": "Classical Epic",
    "fullname": "Classical Epic in Translation",
    "info": "Homer's Iliad/Odyssey. Virgil's Aeneid. Cultural context of epic. Development of hero. Epic style. Poetics of epic.",
    "prereq": []
  },
  {
    "uid": "799073",
    "code": "CNES5082W",
    "subject": "CNES",
    "number": "5082",
    "honors": false,
    "writingIntensive": true,
    "name": "Tragedy",
    "fullname": "Greek Tragedy in Translation",
    "info": "Origins of tragedy. Selected plays of Aeschylus, Sophocles, and Euripides.",
    "prereq": []
  },
  {
    "uid": "788963",
    "code": "CNES5083",
    "subject": "CNES",
    "number": "5083",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Comedy",
    "fullname": "Ancient Comedy",
    "info": "Greek/Roman comic drama (e.g., Aristophanes, Menander, Plautus, Terence).",
    "prereq": []
  },
  {
    "uid": "009771",
    "code": "CNES5103",
    "subject": "CNES",
    "number": "5103",
    "honors": false,
    "writingIntensive": false,
    "name": "Gk & Rom Art & Arc",
    "fullname": "Hellenistic and Early Roman Art and Archaeology",
    "info": "Sculpture, architecture, painting, and topography in developing centers of Hellenistic culture in eastern Mediterranean and in Etruscan and Roman towns, from 400 B.C. to the beginnings of the Roman Empire.",
    "prereq": []
  },
  {
    "uid": "009793",
    "code": "CNES5108",
    "subject": "CNES",
    "number": "5108",
    "honors": false,
    "writingIntensive": false,
    "name": "Greek Architecture",
    "fullname": "Greek Architecture",
    "info": "Geometric through classical examples of religious and secular architecture and their setting at archaeological sites in Greece, Asia Minor and Italy.",
    "prereq": []
  },
  {
    "uid": "009921",
    "code": "CNES5111",
    "subject": "CNES",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Prehist Grk Art&Arc",
    "fullname": "Prehistoric Art and Archaeology of Greece",
    "info": "Artistic and architectural forms of Neolithic period in Aegean area and Cycladic, Minoan, and Mycenaean cultures. Aims and methods of modern field archaeology; the record of human habitation in the Aegean area. Archaeological evidence as a basis for historical reconstruction.",
    "prereq": []
  },
  {
    "uid": "009796",
    "code": "CNES5112",
    "subject": "CNES",
    "number": "5112",
    "honors": false,
    "writingIntensive": false,
    "name": "Arc & Clas Grk Art",
    "fullname": "Archaic and Classical Greek Art",
    "info": "Sculpture, painting, architecture and minor arts in Greek lands from the 9th through 5th centuries B.C. Examination of material remains of Greek culture; archaeological problems such as identifying and dating buildings; analysis of methods and techniques. Emphasis on Periklean Athens.",
    "prereq": []
  },
  {
    "uid": "009924",
    "code": "CNES5120",
    "subject": "CNES",
    "number": "5120",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Archaeology",
    "fullname": "Field Research in Archaeology",
    "info": "Field excavation, survey, and research at archaeological sites in the Mediterranean area.  Techniques of excavation and exploration; interpretation of archaeological materials.",
    "prereq": []
  },
  {
    "uid": "009367",
    "code": "CNES5172",
    "subject": "CNES",
    "number": "5172",
    "honors": false,
    "writingIntensive": false,
    "name": "House, Villa, Tomb",
    "fullname": "House, Villa, Tomb: Roman Art in the Private Sphere",
    "info": "Architecture, painting, and sculpture of urban houses, country estates, and tombs in Roman world. Relationships between public/private spheres and literary/physical evidence. Usefulness of physical evidence in illuminating gender roles.",
    "prereq": []
  },
  {
    "uid": "009369",
    "code": "CNES5182",
    "subject": "CNES",
    "number": "5182",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and the State",
    "fullname": "Art and the State: Public Art in the Roman Empire",
    "info": "eOrigins of Roman public art. Use in maintaining community. Exploitation by first emperor, Augustus. Development/diffusion through later empire. Varying capabilities to adjust to demands of a Christian Empire.",
    "prereq": []
  },
  {
    "uid": "809892",
    "code": "CNES5185",
    "subject": "CNES",
    "number": "5185",
    "honors": false,
    "writingIntensive": false,
    "name": "Hellenistic and Iranian Asia",
    "fullname": "Hellenistic and Iranian Asia: Art and Archaeology of Hellenistic, Scythian, Kushan, and Sogdian Asia",
    "info": "Transformations of Greek architecture, sculpture, painting, mosaic, decorative arts beginning of eastern Mediterranean/ Hellenistic Asia. Art/archaeology of post-Hellenistic Iranian world. Religious, political, historical contexts of archaeological sites, monuments, art objects.",
    "prereq": []
  },
  {
    "uid": "806472",
    "code": "CNES5188",
    "subject": "CNES",
    "number": "5188",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Christian & Late Rome",
    "fullname": "Art and Archaeology of Early Christianity and the Late Roman Empire",
    "info": "Emergence of Christian visual culture in Rome. Age of Tetrarchs and Constantine the Great. Age of Justinian. Development of liturgical environments such as Jewish synagogue and Christian church. Melding of imperial and Christian art, architecture, and ritual. Constantinople, from its founding through sixth century. Church architecture. Early icon/manuscript painting.",
    "prereq": []
  },
  {
    "uid": "806703",
    "code": "CNES5192",
    "subject": "CNES",
    "number": "5192",
    "honors": false,
    "writingIntensive": false,
    "name": "Persia and Ancient Iranian Art",
    "fullname": "Persia and the Ancient Iranian World: Art and Archaeology of Achaemenid to Sasanian Persia",
    "info": "Art and archaeology of ancient Persia and the wider ancient Iranian world, from the rise of the Achaemenid empire in 650 BCE, to the advent of Islam in the seventh century CE.",
    "prereq": []
  },
  {
    "uid": "791295",
    "code": "CNES5251",
    "subject": "CNES",
    "number": "5251",
    "honors": false,
    "writingIntensive": false,
    "name": "Archaeology of Herodian Israel",
    "fullname": "Archaeology of Herodian Israel",
    "info": "Archaeological sites in Israel dating to era of Herod the Great (37-4 BC). Palaces and religious edifices. Remains from Jewish/gentile settlements throughout the kingdom. Course readings consist of contemporary literary sources and excavation reports.",
    "prereq": []
  },
  {
    "uid": "010335",
    "code": "CNES5252",
    "subject": "CNES",
    "number": "5252",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Christian Art",
    "fullname": "History of Early Christian Art in Context",
    "info": "Role played by art in formation of early Christian/Byzantine communities and in establishing their relationships with Pagan world and early Islam.",
    "prereq": []
  },
  {
    "uid": "797133",
    "code": "CNES5340",
    "subject": "CNES",
    "number": "5340",
    "honors": false,
    "writingIntensive": false,
    "name": "Arch Practicum",
    "fullname": "Practicum in Archaeological Field and Computer Techniques",
    "info": "Methods used for excavation of Old and New World sites. Meets at archaeometry/computer lab for part of the semester and at a selectedsite in Minnesota for day-long sessions for 9 to 10 weeks. Meets with 3340.",
    "prereq": []
  },
  {
    "uid": "797457",
    "code": "CNES5503",
    "subject": "CNES",
    "number": "5503",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist/Israelite Rel",
    "fullname": "History and Development of Israelite Religion I",
    "info": "Survey of the evolution of Israelite religion. Cultic practices. Law and religion. Prophecy. Religion and historiography. Relationship to surrounding religious systems.",
    "prereq": []
  },
  {
    "uid": "810136",
    "code": "CNES5513W",
    "subject": "CNES",
    "number": "5513",
    "honors": false,
    "writingIntensive": true,
    "name": "Scripture and Interpretation",
    "fullname": "Scripture and Interpretation in Israelite Religion and Judaism",
    "info": "Idea of divine revelation. Impact upon religion/literature. How history of Bible's creation, transmission, interpretation helps us think critically about role of revelation in history of religious traditions.prereq: At least one upper level course (3xxx or higher) in academic biblical or religious studies",
    "prereq": []
  },
  {
    "uid": "798789",
    "code": "CNES5535",
    "subject": "CNES",
    "number": "5535",
    "honors": false,
    "writingIntensive": false,
    "name": "Death and Afterlife",
    "fullname": "Death and the Afterlife in the Ancient World",
    "info": "Beliefs, attitudes, and behaviors related to death and afterlife found in cultures of ancient Mediterranean and Near East. Literature, funerary art/epitaphs. Archaeological evidence for burial practices and care of dead.",
    "prereq": []
  },
  {
    "uid": "803199",
    "code": "CNES5601",
    "subject": "CNES",
    "number": "5601",
    "honors": false,
    "writingIntensive": false,
    "name": "Sex/Gender in Greece and Rome",
    "fullname": "Sexuality and Gender in Ancient Greece and Rome",
    "info": "SWhat we know (or think we know) about ancient Greek/Roman ideas about sexuality and gender roles. Nature of evidence/methodologies by which it is analyzed.",
    "prereq": []
  },
  {
    "uid": "009830",
    "code": "CNES5701",
    "subject": "CNES",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Alphabetic Epigraphy of ANE",
    "fullname": "Alphabetic Epigraphy of the Ancient Near East",
    "info": "Survey of comparative Semitic linguistics. Emphasizes Northwest Semitic. Reading of Phonecian, Moabite, and Judean inscriptions.",
    "prereq": []
  },
  {
    "uid": "810035",
    "code": "CNES5786",
    "subject": "CNES",
    "number": "5786",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Medieval Metropolises",
    "fullname": "Theorizing City and Space in the Mediterranean and Western Asia",
    "info": "Development of greatest cities of Eastern Mediterranean/Western Asia from age of Alexander to rise of Islam. Methodological/theoretical approaches to study of cities where as much evidence exists in texts as archaeological form.",
    "prereq": []
  },
  {
    "uid": "803001",
    "code": "CNES5796",
    "subject": "CNES",
    "number": "5796",
    "honors": false,
    "writingIntensive": false,
    "name": "Class Txts: Approach & Methods",
    "fullname": "Classical Texts: Approaches and Methods",
    "info": "Methods/approaches, from antiquity to present, for reading/interpreting Greek/Latin literary texts.prereq: CNES grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "009373",
    "code": "CNES5940",
    "subject": "CNES",
    "number": "5940",
    "honors": false,
    "writingIntensive": false,
    "name": "Class. Lit: Topics",
    "fullname": "Topics in Classical Literature",
    "info": "Additional work for graduate credit. Topics specified in Class Schedule. Meets with 3940. ",
    "prereq": []
  },
  {
    "uid": "009855",
    "code": "CNES5950",
    "subject": "CNES",
    "number": "5950",
    "honors": false,
    "writingIntensive": false,
    "name": "Classical Culture Topics",
    "fullname": "Aspects of Classical Culture",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  }
]