[
  {
    "uid": "811902",
    "code": "CSPH1000",
    "subject": "CSPH",
    "number": "1000",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Whole Life Wellbeing",
    "fullname": "Topics in Whole Life Wellbeing",
    "info": "Special topics offerings in Integrative Health/Wellbeing. Contact department for semester offerings.",
    "prereq": []
  },
  {
    "uid": "796997",
    "code": "CSPH1001",
    "subject": "CSPH",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Health and Wellbeing",
    "fullname": "Principles of Health and Wellbeing",
    "info": "This course explores models of health and wellbeing, investigating the interconnection of our body, mind, and spirit, as well as our connections with other people and the environment. Students will read popular and scholarly articles and watch videos on aspects of health and wellbeing.  Students will also practice short weekly wellbeing activities and apply learnings to their own and societal health and wellbeing.   ",
    "prereq": []
  },
  {
    "uid": "801794",
    "code": "CSPH1101",
    "subject": "CSPH",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Self, Society, and Environment",
    "fullname": "Self, Society, and Environment: An Integral Systems Approach to Personal Wellbeing and Engagement",
    "info": "Complexity theory approach to internal/external systems that influence lives/health. Interrelated workings of mind, psyche, and body. Means of bringing these into dynamic balance. Environmental/social systems.",
    "prereq": []
  },
  {
    "uid": "825927",
    "code": "CSPH1202",
    "subject": "CSPH",
    "number": "1202",
    "honors": false,
    "writingIntensive": false,
    "name": "Music for Wellbeing",
    "fullname": "Music for Wellbeing in Times of Stress and Anxiety",
    "info": "In this course, we will explore music’s tremendous potential to influence our moods and overall wellbeing. Specifically, we will examine (a) the ways in which music profoundly affects the brain and body, (b) how people around the world have used music to support emotional healing, throughout history, (c) current research on music for the reduction of anxiety and distress, and (d) specific ways for using music to promote your own calmness and equilibrium, even in times of high stress.  ",
    "prereq": []
  },
  {
    "uid": "826630",
    "code": "CSPH1203",
    "subject": "CSPH",
    "number": "1203",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Media/Mental Health",
    "fullname": "Implications of Social Media on Mental Health",
    "info": "Explore how your relationship with social media affects your overall mental health and wellbeing. You will assess your social media presence and develop skills to have a more meaningful, mindful relationship with social media.",
    "prereq": []
  },
  {
    "uid": "809569",
    "code": "CSPH3000",
    "subject": "CSPH",
    "number": "3000",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Integrative Health",
    "fullname": "Topics in Integrative Health",
    "info": "Special offerings in Integrative Health. Contact department for semester offerings.",
    "prereq": []
  },
  {
    "uid": "810131",
    "code": "CSPH3001",
    "subject": "CSPH",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Integrative Healing",
    "fullname": "Introduction to Integrative Healing",
    "info": "This course provides an overview of the current US healthcare system and US cultural views of health and wellness. Within this context it also provides students with an introduction to various complementary and alternative medical systems (also known as complementary and integrative approaches) that might be integrated into the current way of thinking about health and wellness and treatment of illness/disease. Examples include: whole systems of thinking about health such as traditional Chinese medicine or Native American healing; manual therapies like spinal manipulation and massage therapy; energy therapies like reiki and qigong; mind body therapies like yoga and meditation; and biologically based therapies like botanicals and aromatherapy. prereq: Junior or senior undergraduates (60+ credits), or instructor consent.",
    "prereq": []
  },
  {
    "uid": "807577",
    "code": "CSPH3101",
    "subject": "CSPH",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecosystems of Well-Being",
    "fullname": "Creating Ecosystems of Well-Being",
    "info": "This course focuses on information, practices, and tools that enable individuals and communities to build capacity for wellbeing. Students will examine factors and ecosystems that contribute to health, happiness, and wellbeing and will develop a personal plan for health and wellbeing, a critique of an existing ecosystem and ideas for a community yet to be developed. prereq: sophomore, junior or senior undergraduates (30+ credits) or instructor consent",
    "prereq": []
  },
  {
    "uid": "799943",
    "code": "CSPH3201",
    "subject": "CSPH",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Mindfulness/Stress Reduction",
    "fullname": "Introduction to Mindfulness-Based Stress Reduction",
    "info": "The class will introduce students to a variety of techniques by which the stress endemic in a fast-paced competitive culture can be both reduced and worked with constructively. Students will practice and apply experiential techniques of stress-reduction through “mindfulness” – the steady, intentional gathering of a non-judgmental awareness into the present moment in various activities – and examine medical / scientific literature on physiological and psychological elements in the stress response.",
    "prereq": []
  },
  {
    "uid": "811481",
    "code": "CSPH3211",
    "subject": "CSPH",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Living on Purpose",
    "fullname": "Living on Purpose: An Exploration of Self, Purpose, and Community",
    "info": "Exploring our purpose in life means asking and answering the essential question, “What makes me want to get out of bed in the morning?” Purpose is that deepest belief within us where we have a strong sense of who we are, where we came from, and where we’re going. It is the ability to know yourself, know what you know, to reflect on it, and base your judgments, choices and actions on it. Living on Purpose is a course designed to help students explore questions of meaning and purpose in college and in their lives. In this class, students will examine the context and meaning of their own lives, explore other people’s ways of living on purpose, and consider the big questions that shape their present and future. Through three retreats, readings, reflections, experiential exercises, and assignments, the course will offer students time to define their own purpose at this time in their lives and to help build a framework to lead a purposeful life now and into the future. prereq sophomore, junior or senior undergraduates (30+ credits) or instructor consent",
    "prereq": []
  },
  {
    "uid": "805919",
    "code": "CSPH3301",
    "subject": "CSPH",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Choices",
    "fullname": "Food Choices: Healing the Earth, Healing Ourselves",
    "info": "Food production in our current industrial system feeds the world, but at a cost to the environment. In nutrition, we often talk about a healthy diet, but only occasionally do we link our food and diet choices to agricultural practices and the health of the planet. This class will link the concepts of human health and planetary health in terms of food. Starting with the framework of complexity theory and gentle action, we will cover human food/nutrition needs and food security, how food is produced from farm to fork, labor, equity and race issues within agriculture and the food system, food choices and the earth’s bio-diversity, land and water use, climate change, organic and sustainable agriculture, marketing, processing and distribution, fair trade, and economic policies. prereq: junior or senior undergraduates (60+ credits) or instructor consent",
    "prereq": []
  },
  {
    "uid": "811482",
    "code": "CSPH4311",
    "subject": "CSPH",
    "number": "4311",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Hatha Yoga",
    "fullname": "Foundations of Hatha Yoga: Alignment & Movement Principles",
    "info": "This course is the first course in a sequence of three (3) courses in the University of Minnesota Yoga Teachers’ Education & Training Sequence. Students who complete the three courses A-F or S/N may be qualified to register with Yoga Alliance (YA) as a 200 hour Registered Yoga Teacher (RYT). Students who audit the course cannot use the course to be registered with Yoga Alliance. This course will introduce students to the anatomical considerations and understanding critical to executing safe and effective Hatha Yoga instruction. This course includes, as essential to Hatha Yoga, an overview of human gross anatomy and bodily systems (specifically neuro-musculoskeletal and respiratory systems). Students will learn and practice foundational concepts of Hatha Yoga and movement, as related to Yoga Asana. Additionally, students will be introduced to methods of effectively communicating these principles as a Hatha Yoga instructor. prereq: KIN 3027 Human Anatomy for Kinesiology Students (or equivalent, with instructor permission). Recommended: DNCE 1331 for students with no prior yoga experience. These courses can be taken concurrently.",
    "prereq": [
      {
        "code": "KIN 3027",
        "subject": "KIN",
        "id": "3027"
      },
      {
        "code": "DNCE 1331",
        "subject": "DNCE",
        "id": "1331"
      }
    ]
  },
  {
    "uid": "812140",
    "code": "CSPH4312",
    "subject": "CSPH",
    "number": "4312",
    "honors": false,
    "writingIntensive": false,
    "name": "Hatha Yoga Philosophy",
    "fullname": "Hatha Yoga Philosophy, Lifestyle, & Ethics",
    "info": "This course is the second course in a sequence of three (3) courses in the University of Minnesota Yoga Teachers’ Education & Training Sequence. Students who complete the three courses A-F or S/N may be qualified to register with Yoga Alliance (YA) as a 200 hour Registered Yoga Teacher (RYT). Students who audit the course may not use the course to be registered with Yoga Alliance. This course will introduce students to the history, tradition, and philosophy of Hatha Yoga with an emphasis on the ethical practice of Hatha Yoga. Through study of classical and modern text alike, students will learn foundational concepts of how to use this knowledge to facilitate a strong Yoga Asana, Pranayama, and meditation practice as well as how to apply these principles in everyday life. Additionally, students learn and practice methods of effectively introducing these principles as a Hatha Yoga teacher. prereq: CSPH 4311 Foundations of Hatha Yoga: Alignment & Movement Principles. These courses can be taken concurrently.",
    "prereq": {
      "code": "CSPH 4311",
      "subject": "CSPH",
      "id": "4311"
    }
  },
  {
    "uid": "812141",
    "code": "CSPH4313",
    "subject": "CSPH",
    "number": "4313",
    "honors": false,
    "writingIntensive": false,
    "name": "Hatha Yoga Teaching Principles",
    "fullname": "Hatha Yoga Teaching Principles & Methodology",
    "info": "This course is the third course in a sequence of three (3) courses in the University of Minnesota Yoga Teachers’ Education & Training Sequence. Students who complete the three courses A-F or S/N may be qualified to register with Yoga Alliance (YA) as a 200 hour Registered Yoga Teacher (RYT). Students who audit the course cannot use the course to be registered with Yoga Alliance. This course will provide students the opportunity to study communication and sequencing principles necessary for teaching effective, safe Hatha Yoga classes. Using knowledge and skills gained during the first two Hatha Yoga courses, students will develop skills to design and facilitate Hatha Yoga Asana, Pranayama, and meditation techniques. Students will have the opportunity to practice their learned skills through participation in Service Learning. prereq: CSPH 4311 Foundations of Hatha Yoga: Alignment & Movement Principles and CSPH 4312 Hatha Yoga Philosophy, Lifestyle, & Ethics",
    "prereq": {
      "and": [
        {
          "code": "CSPH 4311",
          "subject": "CSPH",
          "id": "4311"
        },
        {
          "code": "CSPH 4312",
          "subject": "CSPH",
          "id": "4312"
        }
      ]
    }
  },
  {
    "uid": "789339",
    "code": "CSPH5000",
    "subject": "CSPH",
    "number": "5000",
    "honors": false,
    "writingIntensive": false,
    "name": "Explore Int Ther/Heal Prac",
    "fullname": "Explorations in Integrative Therapies and Healing Practices",
    "info": "Research and practice on therapies, delivery of complementary therapies, and regulatory issues.\n\nprereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "016923",
    "code": "CSPH5101",
    "subject": "CSPH",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Int Healing Prac",
    "fullname": "Introduction to Integrative Healing Practices",
    "info": "By the end of the course, students will demonstrate an understanding of the overall field of integrative healing practices, which includes both integrative and alternative (CAM) therapies. The course will cover theoretical framework, safety, efficacy, and evidence for various therapies and practices. The online version of this course is an approved 1Health Interprofessional Education (IPE) activity. prereq: Jr or sr or grad student; or instructor consent",
    "prereq": []
  },
  {
    "uid": "787864",
    "code": "CSPH5102",
    "subject": "CSPH",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "Personal Wellbeing",
    "fullname": "Personal Wellbeing: The Journey of Self-Care",
    "info": "The initiation of a healer in ancient cultures was a rigorous process that included a personal journey of inner development and transformation that paralleled the learning of the cognitive and physical healing techniques. This course will introduce the student to the concept of the individual transformational journey. The science of mind-body-spirit approaches will be explored through a variety of methods including lecture, scientific literature review, meditation, imagery, journal writing, and social support through group interaction. The students will have an opportunity to explore various aspects of self-knowledge, self-awareness, transpersonal (non-local) experiences, and the paradoxical mysteries that will prepare them for their student and personal lives.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "016980",
    "code": "CSPH5111",
    "subject": "CSPH",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Ways of Thinking about Health",
    "fullname": "Ways of Thinking about Health",
    "info": "This course is your opportunity to examine, challenge and critically reflect upon your thinking about health. The class meets in a hybrid model that includes in-person, field-trip “micro-immersion experience” to explore different understandings of health through visits to cultural communities.  We include with field trips virtual experiential glimpses into fundamentally different systems of knowledge often conflicting with the scientific/professional models emphasized in many professional fields on campus.  \n\nFrameworks for critical thinking, critical self-reflection, cultural self-study, intellectual virtues and supplemental readings are offered to support your effort to step into culturally different knowledge systems and mental models of health and well-being. These frames and approaches offer you a mirror through which your own perspective, thinking and background assumptions of health become more visible and explicit.  I ask you to challenge your own thinking and better recognize the culture you carry in your thinking as you attempt to inhabit different cognitive worlds.  You will also apply this examination to the professional fields of your interest, sharing your insights with learners in other professions.  In this way, we bring together interdisciplinary and intercultural learning.  On the dates that we meet virtually, our goal is to create a space that encourages us to share with sincerity our thoughts and emerging insights with one another in Zoom conversations.  The synchronous Zoom sessions allow you to benefit from each other’s personal and professional take on the immersion experiences as you develop your philosophy, narrative and understanding of health. \n\nprereq: jr, sr, grad, or instr consent",
    "prereq": []
  },
  {
    "uid": "797425",
    "code": "CSPH5115",
    "subject": "CSPH",
    "number": "5115",
    "honors": false,
    "writingIntensive": false,
    "name": "Cultural Awareness, Knowledge",
    "fullname": "Cultural Awareness, Knowledge and Health",
    "info": "How knowledge can become resource for individual, family, community health. Interactive glimpse of wisdom of cultural communities. Develop capacity to see culture within professional education/practice. Cultural constructs underpinning medical system, role of culture in  interaction between practitioner/patient, role of  reconnection to cultural heritage in healing.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "816775",
    "code": "CSPH5118",
    "subject": "CSPH",
    "number": "5118",
    "honors": false,
    "writingIntensive": false,
    "name": "Whole Person, Whole Community",
    "fullname": "Whole Person, Whole Community: The Reciprocity of Wellbeing",
    "info": "This course explores the symbiotic and reciprocal relationship between individual and community health and wellbeing, as well as the many factors/forces which influence that relationship. Drawing upon recent studies in the area of reciprocal/symbiotic effects between individual wellbeing and community wellbeing, this course will include the following core topics: definitions of community and related dimensions of wellbeing, importance of Individual/Community reciprocity (Social Justice, Equity, Safety, and Trust), historical trauma and healing, and individual action and personal empowerment in community transformation. Utilizing elements of the Center for Spirituality & Healing's Wellbeing model and modes of contemplative practice, this course will ultimately assist learners through phases of individual reflection and mindfulness for the purpose of creating more open and reciprocal relationships with entities they describe as their communities.An extension of recent studies in the area of the reciprocal (or rippling) effect between individual wellbeing and community wellbeing this course will guide individuals in identifying the various communities in which they live or participate, the roles they \"play\" within those communities and why/ how this knowledge can help prepare them for action and leadership.Main themes of the course will include:- Mindfulness, Reflection and Healing: Historical Trauma and Marginalization.- Roles and Reciprocity: Justice, Equity, Security and Trust between individuals and their communities.- Transformation: Individual Action/Leadership as Bridge between Personal and Community Wellbeing.",
    "prereq": []
  },
  {
    "uid": "805936",
    "code": "CSPH5120",
    "subject": "CSPH",
    "number": "5120",
    "honors": false,
    "writingIntensive": false,
    "name": "Self, Society and Environment",
    "fullname": "Self, Society, and Environment: An Integral Systems Approach to Personal Well-being and Engagement",
    "info": "Current environmental science principles compared with indigenous ways of knowing and Asian ways of knowing; interactions of humans and the environment and how they influence human health and planetary health; optimal functioning of environmental, political, and social systems which exist to deal with environmental issues; personal well-being and how the health of the planet influences human health and vice versa; social entrepreneurships and how to bring health and balance to the social and environmental systems; implications of Albert Schweitzer's ethic of Reverence for Life.",
    "prereq": []
  },
  {
    "uid": "805882",
    "code": "CSPH5121",
    "subject": "CSPH",
    "number": "5121",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate & Planetary Health",
    "fullname": "Planetary Health & Global Climate Change: A Whole Systems Healing Approach",
    "info": "Our personal health, along with the health of the human social systems we inhabit, are inextricably entwined with the wellbeing of local and global environmental systems. Living systems (including social, biological, and environmental) are complex adaptive systems that are self-organizing and give rise to emergent properties within a wider “ecosystemic” context. To effect beneficial and sustainable changes within such systems, leaders must apply (and embody) ecosystemic principles. This course will help students learn how to understand—and to effect sustainable change in—the complex systems in their lives: personal, social, and environmental. Students will explore and develop leadership strategies and skills, using complexity theory as a theoretical framework. We are facing a multifaceted global/planetary crisis. The evidence is clear that Global Climate Change is primarily driven by human behaviors. Drawing upon the new science of Complex Systems, it is also evident that human social systems (economic, political, and cultural) are impelling us towards a planetary “bifurcation point.” Our only hope to avoid multiple systems collapse is to make deep changes in these systems. Rigid, top-down approaches based on linear and mechanistic paradigms are ill-suited to transformative leadership, which facilitates an open-ended process of organic change. This course helps students develop transformative leadership capacities that are applicable within all types of organizations, within a wide variety of roles and positions.prereq: Jr or sr or grad student, or instructor consent",
    "prereq": []
  },
  {
    "uid": "789904",
    "code": "CSPH5201",
    "subject": "CSPH",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Spirituality and Resilience",
    "fullname": "Spirituality and Resilience",
    "info": "In-depth exploration of resilience, spirituality, and the link between them. Specific applications of resilience and health realization principles applied to students’ personal and professional lives. Relevant literature, theory and research will be explored. This class examines natural resilience and our inner landscape. Discussions are reflective, instructive, and thought provoking. We explore life experiences, examine relevant resilience and spiritual literature, and discover how we operate from the inside out in ordinary life. We learn, live, and share basic principles behind resilience. The study is applicable in a wide variety of disciplines from helping professions, scientific endeavors, education, to business and more. These lessons are applicable in both personal and professional life. prereq: Jr or Sr or Grad, or instructor consent",
    "prereq": []
  },
  {
    "uid": "787865",
    "code": "CSPH5211",
    "subject": "CSPH",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "Peace/Spirit: Journey",
    "fullname": "Peacemaking and Spirituality: A Journey Toward Healing and Strength",
    "info": "Influence of spirituality upon process of resolving conflict and making peace in intense interpersonal/intrapersonal conflicts in multiple health care and social work settings, including in families, between patients/clients and nurses/social workers, within communities, among friends, between co-workers, or within ourselves.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "805826",
    "code": "CSPH5212",
    "subject": "CSPH",
    "number": "5212",
    "honors": false,
    "writingIntensive": false,
    "name": "Peacebuilding/Mindfulness",
    "fullname": "Peacebuilding Through Mindfulness: Transformative Dialogue in the Global Community",
    "info": "This course is designed to provide a basic understanding of the core principles and practices of peacebuilding through restorative dialogue, using a mindfulness-based approach, in the context of multiple interpersonal, community, national, and international settings. prereq: Jr or Sr or Grad, or instructor consent.",
    "prereq": []
  },
  {
    "uid": "791709",
    "code": "CSPH5215",
    "subject": "CSPH",
    "number": "5215",
    "honors": false,
    "writingIntensive": false,
    "name": "Forgiveness and Healing",
    "fullname": "Forgiveness and Healing: A Journey Toward Wholeness",
    "info": "This course will examine the impact of forgiveness on the process of interpersonal and intrapersonal healing, as well as healing of conflict and trauma at the intergroup level. Forgiveness and healing will be examined in the context of intense interpersonal and intrapersonal conflicts in multiple health care and social work settings, including in families, between physicians and nurses, between patients/clients and nurses/social workers, within communities, among friends, between co-workers, or within ourselves. Forgiveness will also be examined in the larger global context and how principles and practices of forgiveness are being applied in some of the most entrenched political and violent conflicts, such as in Northern Ireland, South Africa, Liberia, Rwanda, and Israel/Palestine. This course is designed to provide a basic understanding of the central elements of forgiveness and healing in the context of multiple micro and macro life settings.The concepts of forgiveness and healing will be examined from multiple spiritual and secular traditions. The underlying philosophical elements of forgiveness and healing will be critically assessed and beliefs and rituals from numerous indigenous and European traditions will be presented and examined. The focus will be upon gaining a more grounded understanding of the process of forgiveness and its potential impact upon emotional and relational healing. The concepts of forgiveness and healing will be addressed in a very broad and inclusive manner, with no assumptions made related to their specific cultural context or meaning. Empirical studies that have examined the impact of forgiveness upon emotional and physical healing will be reviewed.Concepts such as forgiveness and healing are inseparable from the concept of spirituality. For the purposes of the course, spirituality is not synonymous with the dogma and creeds of the major religious traditions in the world, even though religion for many may serve as a pathway to spirituality. Practices within the major religions of the world that foster forgiveness and healing, however, will be explored, along with practices within Native American, Canadian Aboriginal, Native Hawaiian, African, New Zealand Maori, and Eastern cultural traditions.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "791074",
    "code": "CSPH5221",
    "subject": "CSPH",
    "number": "5221",
    "honors": false,
    "writingIntensive": false,
    "name": "Spiritual Texts 20th Century",
    "fullname": "Significant Spiritual Texts of the 20th Century",
    "info": "Diverse \"spiritual classics\" (i.e., elements of western canon that have proven over time to be resources of values). Resources of meaning for inner-life healers. How to establish a personal library for life-long journey of spiritual development.",
    "prereq": []
  },
  {
    "uid": "791710",
    "code": "CSPH5225",
    "subject": "CSPH",
    "number": "5225",
    "honors": false,
    "writingIntensive": false,
    "name": "Meditation",
    "fullname": "Meditation: Integrating Body and Mind",
    "info": "The class approaches meditation as a physical, emotional, intellectual, and spiritual inquiry.  Students read selections in a variety of relevant texts and develop the ability to enter a state of calm, meditative awareness.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "794270",
    "code": "CSPH5226",
    "subject": "CSPH",
    "number": "5226",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Meditation",
    "fullname": "Advanced Meditation: Body, Brain, Mind, and Universe",
    "info": "Students will work to integrate meditation practice into daily life, cultivating awareness of the fundamental oneness of body, brain, mind, and universe. Attention will be given to mind-body synergy in health, the “hard problem” of consciousness in neuroscience, and the emergence of compassion, wisdom, and healing in non-discursive awareness. prereq: CSPH 5225, jr or sr or grad student, or instr consent",
    "prereq": {
      "code": "CSPH 5225",
      "subject": "CSPH",
      "id": "5225"
    }
  },
  {
    "uid": "787866",
    "code": "CSPH5301",
    "subject": "CSPH",
    "number": "5301",
    "honors": false,
    "writingIntensive": false,
    "name": "Cultures,Faith Trad & HlthCare",
    "fullname": "Cultures, Faith Traditions, and Health Care",
    "info": "Culturally/spiritually based health care practices of selected native/immigrant populations in Minnesota. Clinical implications. Personal/professional conflicts for delivery of competent care to culturally diverse groups by those trained in Western health care.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "818496",
    "code": "CSPH5303",
    "subject": "CSPH",
    "number": "5303",
    "honors": false,
    "writingIntensive": false,
    "name": "Pain Mgmt/Complementary Health",
    "fullname": "Pain Management and Evidence Based Complementary Health Approaches",
    "info": "This course will cover the evidence regarding effectiveness and safety of CIH practices, and the relationship of CIH to contemporary views of pain, health, and healing. There is a growing evidence base to support some complementary and integrative healing (CIH) approaches for pain management including yoga, mindfulness meditation, chiropractic, and others. In the US, chronic pain impacts over one third of the population and affects more individuals than heart disease, diabetes, and cancer combined. While there is a wide range of conventional medical treatments available to manage pain, many are only marginally effective and are associated with troublesome side effects. Of growing concerns is the endemic problem of opioids associated with misuse, addiction, and fatal overdose. Pain sufferers and health providers need effective and safe options for pain management. Some complementary and integrative healing (CIH) approaches have a growing evidence base to support their use, particularly for pain management. This course will introduce students to the theories, mechanisms, use, effectiveness, and safety of commonly used complementary and integrative healing practices. The relationship of CIH approaches to contemporary views and research regarding pain, health and healing, and placebo effects will also be explored. Through reading, reflection, discussion, and critical appraisal, students will develop the necessary skills to synthesize different forms of information, including research, to reach evidence-informed and balanced conclusions regarding CIH for managing pain, restoring function, and enhancing overall health and wellbeing. CIH approaches covered will include: whole systems (Traditional Chinese Medicine, osteopathy, chiropractic, Ayurvedic Medicine, etc.); mind-body practices (contemplative and meditative practices; yoga, tai chi, Qigong, etc.); manipulative and body-based approaches (massage therapy, acupuncture, manipulation); and energy-based approaches (energy medicine, Reiki, therapeutic touch, healing touch). Upon completion of the course, students will have a foundational knowledge of CIH for pain management and the skills to critically appraise and determine the trustworthiness of different information sources. Prerequisite: Graduate or Professional program student. ",
    "prereq": []
  },
  {
    "uid": "818608",
    "code": "CSPH5305",
    "subject": "CSPH",
    "number": "5305",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Mental Health",
    "fullname": "Introduction to Integrative Mental Health",
    "info": "Prerequisite: Graduate or Professional student. This course focuses on introducing students to the concept of integrative mental health (IMH). Definitions of IMH, the history and background of the concept, and how it relates to psychiatric care and health care in general will be explored. Students will explore and practice risk-benefit profiles of different modalities in the context of evidence-based mental health care. An emphasis will be placed on the connection between physical and mental health and how that can be approached from an integrative perspective. Topics such as mindfulness and mental health, nutrition and mental health, herbs and supplements in psychiatric care, and the role of functional medicine in IMH will be covered, as well as how psychotherapy and psychotropic medications fit in the IMH framework. Students will review the current diagnostic system for mental health disorders and that can both help and hinder an integrative approach to mental health care. Integrative approaches for assessing mental health concerns will be reviewed, and how to use these approaches alongside a traditional medical approach for maximum benefit will be explored. Students will further review specific modalities for mental health and wellbeing that are less focused on specific systems and more focused on holism and the interplay of systems.  Students will also identity and explore different ways of viewing mental health and wellbeing based on cultural and geographical issues, and how these may impact the approaches. ",
    "prereq": []
  },
  {
    "uid": "819009",
    "code": "CSPH5307",
    "subject": "CSPH",
    "number": "5307",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Nursing",
    "fullname": "Integrative Nursing: Application across Settings and Populations",
    "info": "Prerequisites: registered nurse, graduate level registration only. Principles and application of integrative nursing will provide learners with skills that can be immediately applied to nursing practice, advanced nursing practice, and nurse leadership. Clinical case studies and interactive discussion will be used for students to learn how to practice integratively in their current healthcare role or to develop into a new role or paradigm. Case studies will be individualized to fit the needs of all learners for applicable skill building. ",
    "prereq": []
  },
  {
    "uid": "787655",
    "code": "CSPH5311",
    "subject": "CSPH",
    "number": "5311",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Trad Chinese Medicine",
    "fullname": "Introduction to Traditional Chinese Medicine",
    "info": "Philosophical roots of Shamanism, Confucianism, Taoism, and Buddhism. Influence of these philosophies on Chinese medicine. Evolution of concepts of the tao, Yin-Yang, microcosm, macrocosm. Development of herbal medicine, Tui Na, Qi Gong, acupuncture, moxibustion. Traditional Chinese medicine etiology of disease, physiology, diagnosis, therapy, disease prevention, ethics, psychology, cosmology.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "808432",
    "code": "CSPH5313",
    "subject": "CSPH",
    "number": "5313",
    "honors": false,
    "writingIntensive": false,
    "name": "Acupressure",
    "fullname": "Acupressure",
    "info": "Open to health professional graduate students or practicing healthcare professionals. Undergraduate students with specific prior coursework may be admitted with instructor approval. By the end of the course students will be able to demonstrate an understanding of the basic principles and applications of Acupressure as a component within the theory of East Asian Medicine. Students will learn the location, indications for use and techniques of stimulation of acupressure points in sequences specific to common physical, mental, and emotional symptoms. Methods for both self-care and the care of others will be the primary focus of learning. Special focus will be given to the treatment of pain conditions, chronic health conditions, palliative care, oncology, women’s health care, and mental-emotional wellbeing. Current literature and research findings will also be discussed.",
    "prereq": []
  },
  {
    "uid": "793079",
    "code": "CSPH5315",
    "subject": "CSPH",
    "number": "5315",
    "honors": false,
    "writingIntensive": false,
    "name": "Traditional Tibetan Medicine",
    "fullname": "Traditional Tibetan Medicine: Ethics, Spirituality, and Healing",
    "info": "This course will introduce students to ethics, spirituality, and healing from the perspective of traditional Tibetan medicine. Traditional Tibetan doctors believe that illness results from imbalance and that treating illness requires correcting the underlying imbalance. Students will learn how to apply these principles personally, integrate them into clinical practice, and consult with a traditional Tibetan doctor. prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "795576",
    "code": "CSPH5317",
    "subject": "CSPH",
    "number": "5317",
    "honors": false,
    "writingIntensive": false,
    "name": "Yoga: Ethics, Spirit, Healing",
    "fullname": "Yoga: Ethics, Spirituality, and Healing",
    "info": "This course will introduce students to ethics, spirituality, and healing from the perspective of Yoga, an ancient Indian discipline. Students will examine the claim that systematic Yoga practice leads to optimal health. Using critical thinking, students will evaluate philosophical knowledge, scientific evidence, and practical application, and propose research-based programs for integrating Yoga into personal and professional life.Prereq jr or sr or grad; or instructor consent",
    "prereq": []
  },
  {
    "uid": "800825",
    "code": "CSPH5318",
    "subject": "CSPH",
    "number": "5318",
    "honors": false,
    "writingIntensive": false,
    "name": "Tibetan Medicine in India",
    "fullname": "Tibetan Medicine in India",
    "info": "Tibetan Medicine has one of the longest histories among scholastic medical traditions, developed alongside of and in dialogue with the ancient Indo-Tibetan Buddhist philosophy, psychology, and contemplative practices. Hence, Tibetan medicine is well-positioned to provide insights into mind-body relationships in health and wellbeing. Because of Tibetan medicine's emphasis on preventive, whole-person, and integrative health approaches, as well as the importance of ethics and spirituality, Tibetan medicine provides a fertile ground for students to view health at the intersection of ethics, spirituality, and healing. While studying with native Tibetan doctors and local experts in India, students will examine the claim that systematic practice of Tibetan medicine promotes optimal health and well-being. Using critical thinking, students will evaluate Tibetan medicinal theories and practices in its cultural milieu, and scientific evidence, and propose research-based programs for integrating Tibetan medicine approaches into personal and professional life. prereq: CSPH 5315 Tibetan Medicine or CSPH 5000 Death, Resilience and Happiness topic; jr or sr or grad; or instr consent. .",
    "prereq": {
      "or": [
        {
          "code": "CSPH 5315",
          "subject": "CSPH",
          "id": "5315"
        },
        {
          "code": "CSPH 5000",
          "subject": "CSPH",
          "id": "5000"
        }
      ]
    }
  },
  {
    "uid": "815933",
    "code": "CSPH5319",
    "subject": "CSPH",
    "number": "5319",
    "honors": false,
    "writingIntensive": false,
    "name": "Yoga and Ayurveda in India",
    "fullname": "Yoga and Ayurveda in India",
    "info": "Yoga and Ayurveda are interrelated, ancient, holistic Indian traditions that integrate ethics, spirituality, and healing. While studying with expert practitioners at the University of Minnesota and in India, students will examine the claim that the systematic practice of these traditions promotes healing and optimal health.prereq: CSPH 4311 (and instructor approval), CSPH 5317 or CSPH 5318 or instructor consent.",
    "prereq": {
      "and": [
        {
          "code": "CSPH 4311",
          "subject": "CSPH",
          "id": "4311"
        },
        {
          "code": "CSPH 5317",
          "subject": "CSPH",
          "id": "5317"
        },
        {
          "code": "CSPH 5318",
          "subject": "CSPH",
          "id": "5318"
        }
      ]
    }
  },
  {
    "uid": "789905",
    "code": "CSPH5321",
    "subject": "CSPH",
    "number": "5321",
    "honors": false,
    "writingIntensive": false,
    "name": "Health in Developing World",
    "fullname": "Public Health Priorities in the Developing World",
    "info": "Primary public health problems, priorities, and interventions in developing countries. Issues related to culture/indigenous health systems and of concern to health care providers who work abroad or with refugee communities in countries of resettlement.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "793103",
    "code": "CSPH5325",
    "subject": "CSPH",
    "number": "5325",
    "honors": false,
    "writingIntensive": false,
    "name": "Latinos: Culture and Health",
    "fullname": "Latinos: Culture and Health",
    "info": "How Latino world view (cosmovision) affects health and compares with U.S. perspective. Differences in perception of time, family involvement, community \"belonging,\" gender roles, and communication styles. Folkloric beliefs. Specific issues such as AIDS, pregnancy, women's issues, pharmacy, and nutrition. Health issues of workers. Cultural competency.prereq: jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "795733",
    "code": "CSPH5331",
    "subject": "CSPH",
    "number": "5331",
    "honors": false,
    "writingIntensive": false,
    "name": "Shamanism & Shamanic Healing",
    "fullname": "Foundations of Shamanism and Shamanic Healing",
    "info": "In this fundamentals course, students will learn essential elements of the non-biomedical shamanic “life-way” at the foundation of all shamanism. Participants will study shamanic beliefs about the individual’s role in life, community, and the universe, and how these ideas are at the core of all shamanic healing practices.  They will study cross-cultural healing beliefs and practices, the unique psychology necessary to understand them, and how these approaches may be used with contemporary healing practices and for personal growth.  This course provides a core understanding of shamanic philosophies and ritual etiquette, properly preparing students to continue in deeper personal study and/or to more optimally participate in an experiential cultural immersion (e.g. via a Global Healing Traditions course.)prereq: Jr or sr or grad student, or instr consent",
    "prereq": []
  },
  {
    "uid": "795191",
    "code": "CSPH5332",
    "subject": "CSPH",
    "number": "5332",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Healing: Amazonia",
    "fullname": "Global Healing Traditions: Amazonia Plant Spirit Medicine",
    "info": "Non-biomedical traditional healing paradigms as practiced in other parts of the world. Focuses on indigenous healing practices in Peru as directed by a local shaman.prereq: [5331, [grad student or jr or sr in health science or practicing health professional]] or instr consent",
    "prereq": {
      "code": "CSPH 5331",
      "subject": "CSPH",
      "id": "5331"
    }
  },
  {
    "uid": "808480",
    "code": "CSPH5341",
    "subject": "CSPH",
    "number": "5341",
    "honors": false,
    "writingIntensive": false,
    "name": "Indigenous Hawaiian Healing",
    "fullname": "Overview of Indigenous Hawaiian Healing",
    "info": "This course focuses on an introduction to traditional Hawaiian healing including ho‘olomilomi (massage), la‘au lapa‘au (herbal medicine), and ho‘opoonopono (conflict resolution). Cultural traditions such as oral history and the hula are examined in the context of their contribution to overall wellbeing and sustainability. Hawaiian cultural values are compared and contrasted with western values. Students will have the opportunity to meet with Hawaiian healers, visit culturally relevant sites and reflect on ways that indigenous and conventional practices contribute to health, healing and wellbeing.Prereq: Graduate students in health sciences programs, or instructor consent.",
    "prereq": []
  },
  {
    "uid": "808481",
    "code": "CSPH5343",
    "subject": "CSPH",
    "number": "5343",
    "honors": false,
    "writingIntensive": false,
    "name": "Ayurveda Medicine",
    "fullname": "Ayurveda Medicine: The Science of Self-healing",
    "info": "This course will introduce students to the basic principles of Ayurveda, the Science of self-healing. It will also cover evidence-based information available on Ayurvedic Medicine. Ayurveda emphasizes the balance of body, mind, and spirit to achieve the optimum health through natural means. Course content will include Ayurvedic constitutional types and practices including food, herbal medicine, detoxification, and massage. Students will examine how Ayurvedic principles and practices can be integrated into personal plans for health and well-being and how Ayurveda is being integrated into healthcare settings.",
    "prereq": []
  },
  {
    "uid": "789906",
    "code": "CSPH5401",
    "subject": "CSPH",
    "number": "5401",
    "honors": false,
    "writingIntensive": false,
    "name": "People, Plants & Drugs",
    "fullname": "People, Plants, and Drugs: Introduction to Ethnopharmacology",
    "info": "Ethnopharmacology is the interdisciplinary science of medicinal plants or natural products utilized by humans. These people-plant (typically) relationships have historically and imminently have produced important medicines integral to modern medicine. Ethnopharmacology integrates aspects of botany, natural products chemistry, pharmacology, pharmacognosy, anthropology, medicine, psychology, and comparative religious study. The discipline researches human interactions with biologically active plants (and other living things) as medicines, poisons, and intoxicants with a primary focus on indigenous and non-­Western cultures. Ethnopharmacology seeks to document plants and animals used by various cultures, and describe their use and preparation. These plants and their preparations are then studied to identify, isolate, and characterize the active compounds responsible for the plants actions on people. This introductory ethnopharmacology course will cover both the ethnographic and scientific aspects critical to the process of drug discovery and the evolution of modern medicine. Students will compare cross-cultural perspectives on human interactions with drugs and examine the variety of human interaction with biologically active organisms in their environment. prereq: Jr or Sr or Grad, or instructor consent. Courses in Botany, Chemistry and Pharmacology are useful but not required.",
    "prereq": []
  },
  {
    "uid": "794665",
    "code": "CSPH5405",
    "subject": "CSPH",
    "number": "5405",
    "honors": false,
    "writingIntensive": false,
    "name": "Plants in Human Affairs",
    "fullname": "Plants in Human Affairs",
    "info": "Twelve-day, intensive course. Introduction to ethnobotany/ethnopharmacology. Lectures, field trips, presentations by local experts.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "787597",
    "code": "CSPH5411",
    "subject": "CSPH",
    "number": "5411",
    "honors": false,
    "writingIntensive": false,
    "name": "Dietary Supplements",
    "fullname": "Dietary Supplements: Regulatory, Scientific, and Cultural Perspectives",
    "info": "Concepts/principles of dietary supplements, RDA, dose-response, risk assessment. Laws/regulations concerning dietary supplements. Vitamin/mineral supplements. Philosophy/use of botanicals/nutraceuticals and common herbal supplements in western medicine. Use of supplements and evidence-based recommendations as influenced by culture.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "791711",
    "code": "CSPH5421",
    "subject": "CSPH",
    "number": "5421",
    "honors": false,
    "writingIntensive": false,
    "name": "Botanical Medicines",
    "fullname": "Botanical Medicines in Integrative Healthcare",
    "info": "Botanical medicines have been used since ancient times in many cultures yet it is still not a significant part of what is considered “traditional” medicine in our current healthcare model in the United States. Yet there is a growing interest among people in the U.S. looking for alternative treatments for a variety of common illnesses due to concerns of safety, efficacy, and a desire for more “natural” products than more conventional pharmaceuticals. However, despite this growing interest, healthcare providers may have little to no knowledge regarding botanical medicines in regards to their therapeutic properties, efficacy (or lack thereof), and/or adverse effects. This is further compounded by a wealth of information on botanical medicines in the media and internet, much of which may be misleading and can lead to confusion regarding botanical medicines. The goal of this course is to learn basic properties and preparations of the most common botanical medicines in addition to their therapeutic effects for common disease states. Students will also learn about regulations, quality control, and safety concerns regarding use of botanical medicines. Included in this course is a discussion on the frequently overlooked botanical medicine we use everyday: our food! Relevant plant-based foods will be discussed periodically throughout the course to provide a practical application of the material learned in this course. prereq: Jr or sr or grad student, or instructor consent",
    "prereq": []
  },
  {
    "uid": "808485",
    "code": "CSPH5423",
    "subject": "CSPH",
    "number": "5423",
    "honors": false,
    "writingIntensive": false,
    "name": "Botanicals: Practical Apps",
    "fullname": "Botanical Medicines: Foundations and Practical Applications",
    "info": "There is an accumulating body of scientific evidence supporting the use of some botanicals for preventive or therapeutic purposes. This experiential course offers health professional students and others an integrative and practical approach to medicinal plants that includes theoretical underpinnings and obtaining the skills to gather, process, and apply selected local plants and herbs. Methods are multi-sensory, following an eclectic tradition practiced by many modern herbalists. Review of empirical scientific evidence is included for key plants.  Prereq: Jr or sr or grad in the health professions or instructor permission.",
    "prereq": []
  },
  {
    "uid": "796170",
    "code": "CSPH5431",
    "subject": "CSPH",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "Functional Nutrition",
    "fullname": "Functional Nutrition: An Expanded View of Nutrition, Chronic Disease, and Optimal Health",
    "info": "This course will present a novel approach to the principles of nutrition as they relate to optimal health and the prevention, control or intervention in a disease process. This is a model of nutrition application that complements and expands beyond normal growth and development, an approach that attempts to reduce chronic disease by looking for underlying factors or triggers of disease. This model of nutrition considers system dysfunction a pre-disease state and looks for ways to apply nutrition and restore function. The purpose of the course is to provide an overview of this novel application of nutrition. The course will emphasize the importance of nutrition as a component of self-care.prereq: [Jr or sr or grad student] in Health Sciences or instr consent",
    "prereq": []
  },
  {
    "uid": "789596",
    "code": "CSPH5501",
    "subject": "CSPH",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Aromatherapy",
    "fullname": "Clinical Aromatherapy: Therapeutic Use of Plant Essential Oils",
    "info": "Fundamentals of essential oil therapy for licensed health professionals. History, scientific basis, practice issues, use of 30 essential oils in clinical practice. Controlled use of essential plant oils for specific, measurable physiological/psychological therapeutic outcomes. Topical application, inhalation.prereq: Jr or sr or grad student or instr consent; intended for students in health sciences or practicing health professionals; [basic science, health science knowledge, computer skills, internet skills] recommended",
    "prereq": []
  },
  {
    "uid": "789597",
    "code": "CSPH5502",
    "subject": "CSPH",
    "number": "5502",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Aromatherapy II",
    "fullname": "Clinical Aromatherapy II",
    "info": "Additional applications of clinical aromatherapy, including chemical basis for therapeutic effects, clinical use of 14 essential oils.",
    "prereq": []
  },
  {
    "uid": "805573",
    "code": "CSPH5503",
    "subject": "CSPH",
    "number": "5503",
    "honors": false,
    "writingIntensive": false,
    "name": "Aromatherapy Fundamentals",
    "fullname": "Aromatherapy Fundamentals",
    "info": "This course will provide an overview of essential oil therapy and current aromatherapy practices in clinical settings. Students will examine key safety and toxicity issues with the use of essential oils, and they will critique the scientific and historical evidence about the therapeutic qualities of six essential oils in common use by the public and in clinical settings. prereq: Jr or Sr or Grad, or Inst consent",
    "prereq": []
  },
  {
    "uid": "800008",
    "code": "CSPH5505",
    "subject": "CSPH",
    "number": "5505",
    "honors": false,
    "writingIntensive": false,
    "name": "Homeopathic Practice",
    "fullname": "Foundations of Homeopathic Practice",
    "info": "Homeopathic philosophy, core principles, homeopathic materia medica. Review of research on utilization/efficacy of homeopathy. How to use common homeopathic remedies in acute situations. When/how to refer patients for homeopathic treatment. Issues of co-management with allopathic health care providers.",
    "prereq": []
  },
  {
    "uid": "790825",
    "code": "CSPH5511",
    "subject": "CSPH",
    "number": "5511",
    "honors": false,
    "writingIntensive": false,
    "name": "Palliative Care",
    "fullname": "Interdisciplinary Palliative Care: An Experiential Course in a Community Setting",
    "info": "Multidisciplinary student teams partner with interdisciplinary community hospice teams in delivery of care to patients in a variety of settings. Series of seminars employs self-analysis/case studies.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "813213",
    "code": "CSPH5512",
    "subject": "CSPH",
    "number": "5512",
    "honors": false,
    "writingIntensive": false,
    "name": "Spirituality/Palliative Care",
    "fullname": "Spiritual Aspects of Palliative Care",
    "info": "This course examines spiritual care as an essential component of providing palliative care across the life span. Students will explore spiritual assessment tools, spiritual care models, and formulate a spiritual care plan within an interdisciplinary team perspective.prereq: Instructor consent",
    "prereq": []
  },
  {
    "uid": "817225",
    "code": "CSPH5513",
    "subject": "CSPH",
    "number": "5513",
    "honors": false,
    "writingIntensive": false,
    "name": "Living Well, Dying Well",
    "fullname": "Living Well, Dying Well: Empowering Patient Communication at the End of Life",
    "info": "Students will learn how to provide compassionate and effective care at the end of life, including appropriate communication with patients, families, and healthcare providers at crucial points of care. Students will also explore their own perspectives about end of life and learn the importance of self-care. The course will help students reframe end-of-life care from a focus on medical death to an emphasis on humane dying through reflection on values, hopes, and plans. Students will learn to support individuals through personal connection and the sharing of narratives and wisdom.",
    "prereq": []
  },
  {
    "uid": "791075",
    "code": "CSPH5521",
    "subject": "CSPH",
    "number": "5521",
    "honors": false,
    "writingIntensive": false,
    "name": "Therapeutic Landscapes",
    "fullname": "Therapeutic Landscapes",
    "info": "This course will introduce students to the theoretical foundations of healing environments and their application based on the six dimensions of wellbeing. It is a unique course offered only through the Bakken Center for Spirituality & Healing– but carries a wide interdisciplinary application – such as with the department of horticulture, landscape architecture, therapeutic recreation, botany, public health and other health science. During the past six decades, the field of therapeutic landscapes has grown extensively in multiple settings throughout North American, Europe, Asia, and Africa. The theory and practice focus upon the application of environments and landscapes to benefit the individual or group. Therapeutic Landscapes are a plant-dominated environment (indoor or outdoor) designed to provide numerous and varied therapeutic interactions and purposeful outcomes. It fosters wellbeing through designed and prescribed encounters with plants that stimulate the senses and engage the understanding of the people who visit it. This course is designed to provide a basic understanding of the central elements of therapeutic landscapes in the context of the latest scientific evidence using the Bakken Center for Spirituality & Healing model of wellbeing as a guide. \n\nPrereq jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "796172",
    "code": "CSPH5522",
    "subject": "CSPH",
    "number": "5522",
    "honors": false,
    "writingIntensive": false,
    "name": "Therapeutic Horticulture",
    "fullname": "Therapeutic Horticulture",
    "info": "An introduction into the purposeful delivery of plants and plant related activities for therapeutic benefits. This course is designed to provide a basic understanding of the central elements of therapeutic horticulture in the context of multiple health care settings.  Students will learn the evidence-based history, principles, precepts, and practical application of therapeutic horticulture.  A variety of plant and plant related modalities from current research findings will be discussed related to various populations using therapeutic horticulture as a treatment intervention.Prereq junior, senior, or graduate student or instructor consent",
    "prereq": []
  },
  {
    "uid": "797265",
    "code": "CSPH5523",
    "subject": "CSPH",
    "number": "5523",
    "honors": false,
    "writingIntensive": false,
    "name": "Appl Therapeutic Horticulture",
    "fullname": "Applications in Therapeutic Horticulture",
    "info": "This course introduces students to a variety of therapeutic horticulture applications found in community-based healthcare settings. Students will gain foundational knowledge in comprehensive therapeutic horticulture program plans for people with varying abilities. Students will learn evidence-based principles and facilitation techniques in therapeutic horticulture. They will also demonstrate application of therapeutic horticulture processes in weekly assignments.Prereq jr or sr or grad or inst consent",
    "prereq": []
  },
  {
    "uid": "791712",
    "code": "CSPH5533",
    "subject": "CSPH",
    "number": "5533",
    "honors": false,
    "writingIntensive": false,
    "name": "Energy Healing",
    "fullname": "Introduction to Energy Healing",
    "info": "Healing techniques that use energetic systems in body to enhance body’s ability to heal. Therapeutic touch, healing touch, Reiki, acupuncture, reflexology, magnets, homeopathy,  other modalities. Scientific theories on mechanisms of energetic medicine and ways to measure energy. Students interact with practitioners of energy healing.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "794663",
    "code": "CSPH5535",
    "subject": "CSPH",
    "number": "5535",
    "honors": false,
    "writingIntensive": false,
    "name": "Reiki Healing",
    "fullname": "Reiki Healing",
    "info": "Students will learn the history, principles, education, and practical application of Reiki energy healing. Alternative energy healing modalities and current research findings will be discussed. Following activation of the Reiki energy, participants will learn the hand positions used to perform a self, seated, and full session. A portion of each class meeting will be used to perform Reiki sessions and to discuss experiences. prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "797264",
    "code": "CSPH5536",
    "subject": "CSPH",
    "number": "5536",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Reiki Healing",
    "fullname": "Advanced Reiki Healing: Level II",
    "info": "Students will learn advanced principles and application of Reiki energy healing. The four levels of healing will be further explored, with emphasis on healing at the spiritual level. Following activation of the Reiki energy, participants will learn the energy symbols that allow for energy transfer through space and time. Students will learn to use second level Reiki energy for both distance healing and the standard Reiki session. A portion of each class meeting will be used to provide Reiki sessions and to discuss findings. Current literature and research findings will also be discussed.prereq: CSPH 5535 or instr consent. Students must wait 4-6 months after taking CSPH 5535 before taking CSPH 5536. ",
    "prereq": {
      "code": "CSPH 5535",
      "subject": "CSPH",
      "id": "5535"
    }
  },
  {
    "uid": "791713",
    "code": "CSPH5541",
    "subject": "CSPH",
    "number": "5541",
    "honors": false,
    "writingIntensive": false,
    "name": "Emotional Healing/Happiness",
    "fullname": "Emotional Healing and Happiness: Eastern and Western Approaches to Transforming the Mind",
    "info": "This course will provide in-depth, experiential training in the cultivation of happiness, emotional health and healing for multi-disciplinary professions.  Students will learn highly effective, ancient, and contemporary methods for the transformation of afflictive emotions, unhealthy patterns, and behaviors. Students will learn how to increase positive emotions and mind states including: compassion, joy, and equanimity. They will explore meditation and other integrative approaches that bring balance and wellbeing to the mind. Students will practice and explore the applications of these modalities. Students will learn how to creatively apply and integrate them into their lives, relationships, and work with a wide range of patient /client populations and settings. The class content draws on eastern and western approaches to emotional health and healing in a mindfulness-based, integrative model including: Buddhist and Transpersonal Psychology, meditation practices, spirituality, expressive, creative, & ritual arts. Case examples and neuroscience research on emotions will also be included in the course.Prereq: Jr, Sr or grad student, or instructor consent",
    "prereq": []
  },
  {
    "uid": "795192",
    "code": "CSPH5545",
    "subject": "CSPH",
    "number": "5545",
    "honors": false,
    "writingIntensive": false,
    "name": "Mind-Body Healing Therapies",
    "fullname": "Mind-Body Healing Therapies",
    "info": "Philosophies/paradigms. Four modalities commonly used in allopathic nursing, medicine and other health professions (biofeedback, hypnosis, imagery/visualization, meditation). Experiential and group discussion format.prereq: Grad student or jr or sr or instr consent",
    "prereq": []
  },
  {
    "uid": "793104",
    "code": "CSPH5555",
    "subject": "CSPH",
    "number": "5555",
    "honors": false,
    "writingIntensive": false,
    "name": "Body and Movement Therapies",
    "fullname": "Introduction to Body and Movement-based Therapies",
    "info": "This course will cover basic theories and approaches of selected Somatic Therapies and Somatic Psychotherapy (Dance/Movement and body-based therapies).  It will include 1) western historic and theoretical perspectives on the use of movement, dance and somatic re-patterning for well-being, 2) introductions and demonstrations of specific somatic approaches, and 3) brief introduction of the application of these techniques to specific populations and settings. The experiential part of the course will include individual, partner and group exercises intended to embody and deepen the topics covered in the class.Prereq: jr or sr or grad student; or instructor consent",
    "prereq": []
  },
  {
    "uid": "804666",
    "code": "CSPH5561",
    "subject": "CSPH",
    "number": "5561",
    "honors": false,
    "writingIntensive": false,
    "name": "Arts in Health and Healing",
    "fullname": "Overview of the Creative Arts in Health and Healing",
    "info": "In this course we will explore how professionals in music therapy, art therapy, dance and movement therapy, and poetry/spoken word therapy work in healthcare and community settings to promote healing and well-being. Artist-therapists representing each of these fields, and/or related fields in creative arts in healing, will present their work in synchronous sessions, and guide you in experiential exercises to give you firsthand experience of each modality. You will also read in depth about each of the healing arts modalities in our textbook and research articles, participate in online discussions, and document your experiences with the modalities through journaling and a final paper. prereq: Jr or sr or grad student",
    "prereq": []
  },
  {
    "uid": "790387",
    "code": "CSPH5601",
    "subject": "CSPH",
    "number": "5601",
    "honors": false,
    "writingIntensive": false,
    "name": "Music, Health and Healing",
    "fullname": "Music, Health and Healing",
    "info": "For centuries, people in virtually every known culture in the world have recognized the tremendous potential of music to promote health and healing. In this course, we will explore music's power to heal body, mind, and spirit through examining the main music healing disciplines used today: music therapy, music medicine, clinical musicianship, medical musicianship, music-thanatology, vibroacoustic harp therapy, sound healing, and community music. You will also learn some easy music healing techniques you can use for yourself.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "826810",
    "code": "CSPH5602",
    "subject": "CSPH",
    "number": "5602",
    "honors": false,
    "writingIntensive": false,
    "name": "Narrative and Wellbeing",
    "fullname": "Healing Stories: Narrative and Wellbeing",
    "info": "This course seeks to answer the question: “How can the stories that we tell ourselves and others contribute to our wellbeing?” To answer this question, students will consider how narrative helps us understand our emotions, create a sense of belonging, motivate us to address injustice, and re-author our stories. Students will learn about the role of narrative in modern health practices, including narrative therapy and the clinical contributions of narrative medicine. Students will also survey perspectives on narrative and wellbeing less directly or explicitly related to healthcare in the US, including perspectives that de-center common Western European beliefs about narrative, describe the influence of colonialism on a person’s self story, or provide counter-narratives as a form of healing. Students will engage with a variety of content, including research and scholarship, therapeutic writing (e.g. diaries and personal health journals, such as CaringBridge), and popular literature (e.g. graphic novels and memoir). Students will not only read these stories, they will examine their wellbeing and apply what they learn by composing their own stories.This course will invite practitioners, researchers, and campus organizers to speak with students broadly about the importance of narrative in their work.Students will engage with a variety of content, including research and scholarship, therapeutic writing (e.g. diaries and personal health journals, such as CaringBridge), and popular literature (e.g. graphic novels and memoir). Students will not only read these stories, they will examine their wellbeing and apply what they learn by composing their own stories.This course will invite practitioners, researchers, and campus organizers to speak with students broadly about the importance of narrative in their work.",
    "prereq": []
  },
  {
    "uid": "808482",
    "code": "CSPH5605",
    "subject": "CSPH",
    "number": "5605",
    "honors": false,
    "writingIntensive": false,
    "name": "Movement and Music",
    "fullname": "Movement and Music for Well-being and Healing",
    "info": "Music therapy/medicine. Dance/movement therapy. Laban movement analysis. Somatic studies. Health care settings, patient populations, illnesses/diagnoses. Research surrounding approaches. Readings, lectures, discussion.",
    "prereq": []
  },
  {
    "uid": "791714",
    "code": "CSPH5611",
    "subject": "CSPH",
    "number": "5611",
    "honors": false,
    "writingIntensive": false,
    "name": "Healthy Humor",
    "fullname": "Healthy Humor",
    "info": "Use of humor to enhance communication, treatment, and relationships with patients. How to create a positive work environment and outlook. Physiologic effects/benefits of humor/laughter. Humor and spirituality. Connection between positive outlook and health.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "800273",
    "code": "CSPH5621",
    "subject": "CSPH",
    "number": "5621",
    "honors": false,
    "writingIntensive": false,
    "name": "Found of Integrative Imagery I",
    "fullname": "Foundations of Integrative Imagery, Phase I",
    "info": "Fundamental principles, core concepts of imagery. Current scientific research in the health sciences. Applications for pain/symptom relief, preparation for surgery, promotion of healing, and cancer care. Scope of clinical practice, precautions and safeguards.prereq: Grad student in health sciences or licensed health care professional",
    "prereq": []
  },
  {
    "uid": "805575",
    "code": "CSPH5631",
    "subject": "CSPH",
    "number": "5631",
    "honors": false,
    "writingIntensive": false,
    "name": "Healing Imagery I",
    "fullname": "Healing Imagery I",
    "info": "In this course you will learn how imagery and imagery interventions are implemented for healing and to promote optimal health and wellbeing. You will experience a wide variety of imagery interventions in class and work on creating your own imagery intervention. The primary instructional strategies that will be utilized for this course include: experiential, online discussions, readings, lectures, and individual learning interventions.prereq: Jr or Sr or Grad, or instructor consent",
    "prereq": []
  },
  {
    "uid": "804577",
    "code": "CSPH5641",
    "subject": "CSPH",
    "number": "5641",
    "honors": false,
    "writingIntensive": false,
    "name": "Animals in Healthcare",
    "fullname": "Animals in Health Care: The Healing Dimensions of Human/Animal Relationships",
    "info": "This online course is designed to introduce students to the core principles of Animal-Assisted Interventions (AAI) in the context of multiple healthcare and social service related settings. Students will learn the history, identify safety guidelines, apply best practices to a variety of species, and evaluate peer-reviewed literature. prereq: jr or sr or grad student, or instructor consent",
    "prereq": []
  },
  {
    "uid": "813207",
    "code": "CSPH5642",
    "subject": "CSPH",
    "number": "5642",
    "honors": false,
    "writingIntensive": false,
    "name": "Nature Heals",
    "fullname": "Nature Heals: An Introduction to Nature-Based Therapeutics",
    "info": "This graduate level course will cover the basic theories and approaches of Nature-Based Therapeutics including restorative environments, therapeutic horticulture, animal assisted interactions, therapeutic landscapes, forest bathing, green care farming, facilitated green exercise, wilderness therapy, and ecopsychology. The course includes:\n1.\thistoric and theoretical perspectives \n2.\tresearch into specific techniques\n3.\tapplication of techniques to specific population and setting\n\nprereq: Jr, Sr or Grad, or instructor consent",
    "prereq": []
  },
  {
    "uid": "813969",
    "code": "CSPH5643",
    "subject": "CSPH",
    "number": "5643",
    "honors": false,
    "writingIntensive": false,
    "name": "Horse as Teacher",
    "fullname": "Horse as Teacher: Introduction to Equine-Assisted Services (EAS)",
    "info": "This course is designed to introduce students to the field of Equine-Assisted Services (EAS) and to the range of therapeutic and learning opportunities found within equine interactions. The course presents historical and theoretical concepts which helped develop various types of EAS, and how the growth of EAS nationally and internationally has continued to mold the profession. Students will learn to describe safety guidelines, best practices as they are currently known, and precautions and contraindications in EAS sessions. During a one-day face-to-face class, students will observe demonstrations with horses and apply course concepts and topics during this intensive. Students will evaluate peer-reviewed literature in EAS research to identify the strengths and weaknesses of such published material. Students will synthesize reading, lecture and experiential learning to develop an EAS plan for an assigned target group population. \n\nprereq: jr or sr or grad or instr consent",
    "prereq": []
  },
  {
    "uid": "799080",
    "code": "CSPH5701",
    "subject": "CSPH",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Coaching I",
    "fullname": "Health Coaching Fundamentals I",
    "info": "This course provides a foundation of Health Coaching through skill development in Motivational Interviewing and coaching structure. We will explore basic tenets of health coaching including deep listening, effective and empathic communication, mindfulness, unconditional positive regard, and nonjudgement.  In addition, this course will include tools for self-development which is key in a health coaches’ professional journey and development of emotional intelligence.  We will learn how each person is intrinsically healthy, whole, and wise and how they are the expert in their journey not the health coach.  There are onsite requirements for this course.Prereq admitted to Master of Arts in Integrative Health and Wellbeing Coaching; or, Integrative Therapies and Healing Practices Certificate-Health Coaching track; or, Doctor of Nursing Practice; or, non-degree seeking graduate students or students from other graduate degree programs may enroll with permission of the course instructor.",
    "prereq": []
  },
  {
    "uid": "800042",
    "code": "CSPH5702",
    "subject": "CSPH",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Coaching II",
    "fullname": "Health Coaching Fundamentals II",
    "info": "This course expands upon students’ skills in motivational interviewing to include health coaching theories, coaching psychology, goal setting, and theories in behavior change and motivation. In the course students will have the opportunity to remove their “expert hat” and deepen their understanding of coaching skills and style, empathy, deep listening, effective and empathic communication, and tools for self-development. It is the role of the Health Coach to provide a safe, non judgmental environment to allow for exploration and the practice of skill building to increase the client’s self-efficacy.  In this course you will learn how to facilitate the change process by incorporating the client’s strengths and values. There are onsite and synchronous requirements for this course.  This course must be taken concurrently with CSPH 5716 Health Coaching Practicum 2.Prereq CSPH 5701 and CSPH 5703. This course is required for students who have been admitted to the Integrative Therapies and Healing Practice Certificate - Health Coaching track; and Integrative Health and Wellbeing Coaching Master of Arts programs. Students from other graduate degree programs may enroll with permission of the course instructor.",
    "prereq": {
      "and": [
        {
          "code": "CSPH 5701",
          "subject": "CSPH",
          "id": "5701"
        },
        {
          "code": "CSPH 5703",
          "subject": "CSPH",
          "id": "5703"
        }
      ]
    }
  },
  {
    "uid": "800826",
    "code": "CSPH5703",
    "subject": "CSPH",
    "number": "5703",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Health Coaching Practicum",
    "fullname": "Advanced Health Coaching Practicum I",
    "info": "In this course, students participate in a peer-coaching model with their fellow students in dyads or triads, to create opportunities for applying the tools and skills they are learning.  The key to this course is practice not perfection in a safe, supportive environment where mistakes are welcomed and learning and growth is at the center.  This course must be taken concurrently with CSPH 5701 Health Coaching Fundamentals I for Health Coaching Master of Arts and Certificate students, and is a required prerequisite for CSPH 5702 Health Coaching Fundamentals II.Prereq: This course is required for students who have been admitted to the Integrative Therapies and Healing Practice certificate - Health Coaching track; and Integrative Health and Wellbeing Coaching Master of Arts program.  This course is a required prerequisite for Fundamentals of Health Coaching II (CSH 5702) and must be taken concurrently with CSPH 5701 Fundamentals of Health Coaching I for Health Coaching M.A. and certificate students.  Students from other graduate degree programs may enroll with permission of the course instructor.",
    "prereq": {
      "and": [
        {
          "code": "CSPH 5702",
          "subject": "CSPH",
          "id": "5702"
        },
        {
          "code": "CSPH 5701",
          "subject": "CSPH",
          "id": "5701"
        }
      ]
    }
  },
  {
    "uid": "800987",
    "code": "CSPH5704",
    "subject": "CSPH",
    "number": "5704",
    "honors": false,
    "writingIntensive": false,
    "name": "DEI in Health & Wellbeing",
    "fullname": "Diversity, Equity, & Inclusion in Health & Wellbeing",
    "info": "This course encourages students to reflect on their responsibility to provide culturally competent care as an expression of their professional values and doing the difficult internal work required to increase health equity.  In the framework of social determinants of health, this course explores the intersection of health care and marginalized individuals and groups of all cultures, races, ethnicities, disabilities, sexual orientation, size, and gender identities. Students will explore how societal factors, power dynamics, attitudes, biases, historical and institutionalized bias, colonialism, and discrimination have produced health disparities and how these can change with just policies, decision-making, and health equity initiatives.  This course has an onsite requirement. This course is a prerequiste for CSPH 8701 Internship for those in the Master of Arts program. There are no prerequisite courses. This course is required for students who have been admitted to the Integrative Therapies and Healing Practice certificate - Health Coaching track; and Integrative Health and Wellbeing Coaching Master of Arts program.  Doctorate of Nursing Practice students, non-degree seeking students, or students from other degree programs, may enroll with special permission from the course instructor. ",
    "prereq": {
      "code": "CSPH 8701",
      "subject": "CSPH",
      "id": "8701"
    }
  },
  {
    "uid": "802313",
    "code": "CSPH5705",
    "subject": "CSPH",
    "number": "5705",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Coaching Internship",
    "fullname": "Health Coaching Professional Internship",
    "info": "This course will be for those students actively enrolled in the Health Coaching Track of the post-baccalaureate Certificate in Integrative Therapies and Healing Practices or in the MA program in Integrative Health and WellBeing Coaching through the Bakken Center for Spirituality and Healing.  This internship will be 108 hours of health coaching practice in the field, with 12 hours of supervision. The internship experience offers students the creative opportunity to apply and integrate coaching skills and knowledge gained in the preceding semesters of the program.  All encounters will require students to integrate previous experience and knowledge to recruit, schedule, coach and educate individual clients. All students will do 2 group educational sessions to promote health coaching in the organization.Prereq: CSPH 5101, 5701, 5702, 5703, 5706, 5707 (MA only); admitted to Integrative Health and Wellbeing Coaching MA; or, Integrative Therapies and Healing Practices Certificate-Health Coaching track.",
    "prereq": {
      "and": [
        {
          "code": "CSPH 5101",
          "subject": "CSPH",
          "id": "5101"
        },
        {
          "code": "CSPH 5701",
          "subject": "CSPH",
          "id": "5701"
        },
        {
          "code": "CSPH 5702",
          "subject": "CSPH",
          "id": "5702"
        },
        {
          "code": "CSPH 5703",
          "subject": "CSPH",
          "id": "5703"
        },
        {
          "code": "CSPH 5706",
          "subject": "CSPH",
          "id": "5706"
        },
        {
          "code": "CSPH 5707",
          "subject": "CSPH",
          "id": "5707"
        }
      ]
    }
  },
  {
    "uid": "812682",
    "code": "CSPH5706",
    "subject": "CSPH",
    "number": "5706",
    "honors": false,
    "writingIntensive": false,
    "name": "Lifestyle Medicine",
    "fullname": "Lifestyle Medicine",
    "info": "This course provides a foundation in the theory and clinical application of lifestyle medicine. Lifestyle medicine aims to address the behavioral and lifestyle bases of common illnesses through health promoting activities and reducing harmful behaviors. In this course, we will explore optimal nutrition, lifestyle, physical activity, and attitude. We will examine the emerging evidence base of lifestyle medicine and how it relates to health promotion and disease prevention. Participants will be introduced to common laboratory and imaging findings, and how they relate to optimal health. prereq: jr or sr or grad, or inst consent",
    "prereq": []
  },
  {
    "uid": "812683",
    "code": "CSPH5707",
    "subject": "CSPH",
    "number": "5707",
    "honors": false,
    "writingIntensive": false,
    "name": "Coaching/Clinical Conditions",
    "fullname": "Coaching People with Clinical Conditions",
    "info": "This course provides students with a basic awareness and expanded perception of prevalent clinical conditions, and supports the development of empathy related to these conditions. It continues to build coaching skills specific to coaching clients with clinical conditions. Also supports the development of professional oral and written communication skills.Prereq CSPH 5701, 5702, 5716. This course is required for students who have been admitted to the Integrative Health and Wellbeing Coaching Master of Arts program.  Doctor of Nursing Practice students, non-degree students, or students from other degree programs, may only enroll with special permission of the course director.  ",
    "prereq": {
      "and": [
        {
          "code": "CSPH 5701",
          "subject": "CSPH",
          "id": "5701"
        },
        {
          "code": "CSPH 5702",
          "subject": "CSPH",
          "id": "5702"
        },
        {
          "code": "CSPH 5716",
          "subject": "CSPH",
          "id": "5716"
        }
      ]
    }
  },
  {
    "uid": "812684",
    "code": "CSPH5708",
    "subject": "CSPH",
    "number": "5708",
    "honors": false,
    "writingIntensive": false,
    "name": "Mind-Body Sci/Trauma-Informed",
    "fullname": "Mind-Body Science and Trauma-Informed Mental Health",
    "info": "Health coaches, mental health providers, and other health care providers all work to facilitate change for their clients, and in that process mental health concerns and the effects of trauma may show up. In this course, students will gain a clear understanding of the scope of practice of non-mental health providers as it relates to mental health, trauma, and the processes of referring clients to other health professionals when appropriate. Students will be able to recognize the signs and symptoms of common mental health concerns and of trauma and will learn tools and techniques to navigate these concerns within their profession’s scope of practice. Students will also learn the foundations of mind-body science and trauma-informed practices to support their client's journey toward health and wellness. There are no prerequisite courses. This course is required for students who have been admitted to the Integrative Health and Wellbeing Coaching Master of Arts program.  Doctor of Nursing Practice students, non-degree students, or students from other degree programs, may only enroll with special permission of the course director.  ",
    "prereq": []
  },
  {
    "uid": "814448",
    "code": "CSPH5709",
    "subject": "CSPH",
    "number": "5709",
    "honors": false,
    "writingIntensive": false,
    "name": "Hlth/Wellbeing Group Coaching",
    "fullname": "Health and Wellbeing Group Coaching",
    "info": "The Health and Wellbeing Group Coaching Practicum enables the student to learn and apply the theory and practice of group health and wellbeing coaching in a community site-based practicum setting, and to communicate their learning in a professional manner.Upon successful completion of this course, students will be able to:•Explore and demonstrate how to apply the four pillars into the structure of group coaching.•Identify and practice skills and tools of group facilitation and coaching.•Demonstrate the art of managing group dynamics successfully.Prereq: CSPH 5701, 5702, 5703, 5716. This course is required for students who have been admitted to the Integrative Health and Wellbeing Coaching Master of Arts program.  Doctor of Nursing Practice students, non-degree students, or students from other degree programs, may only enroll with special permission of the course director.  Basic computer skills, the ability to be on camera, and internet access are required. ",
    "prereq": {
      "and": [
        {
          "code": "CSPH 5701",
          "subject": "CSPH",
          "id": "5701"
        },
        {
          "code": "CSPH 5702",
          "subject": "CSPH",
          "id": "5702"
        },
        {
          "code": "CSPH 5703",
          "subject": "CSPH",
          "id": "5703"
        },
        {
          "code": "CSPH 5716",
          "subject": "CSPH",
          "id": "5716"
        }
      ]
    }
  },
  {
    "uid": "800180",
    "code": "CSPH5711",
    "subject": "CSPH",
    "number": "5711",
    "honors": false,
    "writingIntensive": false,
    "name": "Optimal Healing Environments",
    "fullname": "Optimal Healing Environments",
    "info": "This course focuses on the development and implementation of optimal healing environments (OHE) as a healthcare innovation. You will examine the evidence base supporting design, human and care processes and begin to explore how OHE are created. An emphasis will be placed on identifying models of optimal healing environments and leadership strategies that support the diffusion of innovation.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "817226",
    "code": "CSPH5712",
    "subject": "CSPH",
    "number": "5712",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Coaching Skills Adv",
    "fullname": "Supervised Health Coaching Skills Advancement",
    "info": "This course will provide a health-coaching student the opportunity to advance coaching skills/strategies through individual client practice with the supervision of an experienced health-coaching instructor.  The student health coach will engage in recorded in-person and/or telephonic coaching sessions, and receive live feedback from the instructor.  The student will assess their own integration of coaching skills through completion of self-skills assessment (level appropriate) that includes self-reflection.  A final skills assessment (level appropriate) will be completed utilizing the standardized tool developed for the UMN Health Coaching program (developed in alignment with guidelines the International Consortium for Health and Wellness Coaching).Prereq CSPH 5701, CSPH 5702; Admitted to Integrative Health and Wellbeing Coaching Master of Arts, Integrative Therapies and Healing Practices Certificate-Health Coaching Track;  or instructor consent.",
    "prereq": {
      "and": [
        {
          "code": "CSPH 5701",
          "subject": "CSPH",
          "id": "5701"
        },
        {
          "code": "CSPH 5702",
          "subject": "CSPH",
          "id": "5702"
        }
      ]
    }
  },
  {
    "uid": "817227",
    "code": "CSPH5713",
    "subject": "CSPH",
    "number": "5713",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Coaching for Hlth Prof",
    "fullname": "Health Coaching for Health Professionals",
    "info": "This course will explore the basic tenets of 4 Pillars of Health Coaching model--self-awareness, mindful presence, authentic communication, and safe/sacred space.  Students will learn to identify/benchmark stages/patterns of change, respectfully collaborate with interdisciplinary health care providers and facilitate clients’ ability to achieve sustainable lifestyle changes.  Consistent, nonjudgmental application of a holistic perspective of optimal health and wellbeing in patient encounters will be discussed and demonstrated.  Students will have the opportunity to see demonstrated and to practice applying tools and practices from motivational interviewing, appreciative inquiry, non-violent communication, and other authentic communication tools.  Interprofessional dialogues and exercises will be guaranteed through targeted participation of second year Health Coaching students, who are not taking this course for credit but are volunteering to increase the interprofessional understanding of coaching and team work.This course is not considered preparatory for becoming a professional health coach and does not meet educational hour requirements toward eligibility for the National Board of Health and Wellness Coaching exam, or for Continuing Education hours for NBHWC recertification. Prereq: Admitted to the Doctor of Nursing Practice-Integrative Health and Healing specialty; Admitted to other Doctor of Nursing Practice specialties; Graduate or professional students in health sciences programs; Practicing health professionals; or instructor consent.",
    "prereq": []
  },
  {
    "uid": "826257",
    "code": "CSPH5714",
    "subject": "CSPH",
    "number": "5714",
    "honors": false,
    "writingIntensive": false,
    "name": "Hlth Behavior Change/Lifestyle",
    "fullname": "Health Behavior Change Theory and Lifestyle Medicine",
    "info": "The purpose of this course is to provide the student with the opportunity to explore the theoretical issues and current methodologies related to understanding and influencing health behavior change. In this course, students will examine health-related motivation and behavior change through the study of relevant psychological, sociological, behavioral economics, and educational theory and research. Emphasis is on critique and application of behavioral and behavior-change theories and constructs not only in one-on-one coaching but understanding the systems and environments that impact health behaviors, especially within lifestyle medicine.  Health coaches need to understand that health behavior change is not a sole responsibility of the individual but a collective effort.  While coaching, understanding the systems at play in regard to health behavior change is key for empathy, perspective, and rapport building especially under the domain of lifestyle medicine. This course is a required prerequisite for Health Coaching Fundamentals II (CSH 5702).  There are no course prerequisites. This course is required for students who have been admitted to the Integrative Health and Wellbeing Coaching Master of Arts program.  Doctorate of Nursing Practice students, non-degree students, or students from other degree programs, may only enroll with special permission of the course director.  ",
    "prereq": {
      "code": "CSPH 5702",
      "subject": "CSPH",
      "id": "5702"
    }
  },
  {
    "uid": "826258",
    "code": "CSPH5715",
    "subject": "CSPH",
    "number": "5715",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership/Decision-making",
    "fullname": "Leadership and Evidence-based Decision-making",
    "info": "This course will examine how evidence-based decision making provides a framework for addressing health coaching quality assessment, best practices, and improvement in patient/client care. Students will learn to assess and evaluate the quality of differing information and evidence and assess how leaders’ decisions are, or are not, supported by reliable evidence. Students will be able to articulate and apply decision making frameworks to the discipline of health coaching to inform their personal practice and organizations. There are no prerequisite courses. This course is required for students who have been admitted to the Integrative Health and Wellbeing Coaching Master of Arts program.  Doctor of Nursing Practice students, non-degree students, or students from other degree programs, may only enroll with special permission of the course director.  ",
    "prereq": []
  },
  {
    "uid": "826245",
    "code": "CSPH5716",
    "subject": "CSPH",
    "number": "5716",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Coaching Practicum II",
    "fullname": "Health Coaching Practicum II",
    "info": "This course is designed to provide students an opportunity to put theory into practice health coaching real clients. Increasing confidence in coaching skills, coaching presence, and different types of client notes (healthcare/EMR notes vs. Other types) is emphasized.  Students are given the opportunity to integrate and apply all previous areas of learning and to explore their resistance, learning edges, and competencies in a supportive supervisory environment. Students will be encouraged to discover their own style of Health Coaching as well as their own growth processes and use of strengths. Ethical issues, professional boundaries, referral processes, and client selection will be introduced. This course must be taken concurrently with CSPH 5702.Prereq: CSPH 5701 and 5703. This course is required for students who have been admitted to the Integrative Therapies and Healing Practice certificate - Health Coaching track; and Integrative Health and Wellbeing Coaching Master of Arts program. Students not enrolled in those programs must have special permission from the instructor to enroll in this course.",
    "prereq": {
      "and": [
        {
          "code": "CSPH 5701",
          "subject": "CSPH",
          "id": "5701"
        },
        {
          "code": "CSPH 5703",
          "subject": "CSPH",
          "id": "5703"
        }
      ]
    }
  },
  {
    "uid": "814185",
    "code": "CSPH5805",
    "subject": "CSPH",
    "number": "5805",
    "honors": false,
    "writingIntensive": false,
    "name": "Wellbeing in the Workplace",
    "fullname": "Wellbeing in the Workplace",
    "info": "Work and experiences in the workplace have a profound impact on many dimensions of individual and collective wellbeing, including a sense of purpose and meaning, financial and emotional security, quality of relationships and community, physical and emotional health, and the local and global environments. In this course, students will learn multi-disciplinary perspectives on key challenges in creating workplaces that contribute to greater wellbeing. Students will also reflect on their own personal experiences with wellbeing in their current and past work environments and examine strategies for enhancing wellbeing based on interdisciplinary theory and research. Specific topics include the importance of purpose and meaning at work, challenges in achieving work-life integration, the impact of technology on work expectations, and organizational change. This course is based on a whole-life, integrative model of wellbeing and draws from research and theory across the social, behavior, and health sciences. prereq: jr or sr or grad, or instructor consent",
    "prereq": []
  },
  {
    "uid": "814186",
    "code": "CSPH5806",
    "subject": "CSPH",
    "number": "5806",
    "honors": false,
    "writingIntensive": false,
    "name": "Wellbeing/Resiliency Hlth Prof",
    "fullname": "Wellbeing and Resiliency for Health Professionals",
    "info": "This course will teach health professional students and health professionals self-care strategies that will improve their individual wellbeing and reduce the stress and burnout often experienced in these professions. Improving individual wellbeing will also contribute to greater wellbeing in the teams and systems in which these professionals work prereq: jr or sr or grad, or instructor consent",
    "prereq": []
  },
  {
    "uid": "816309",
    "code": "CSPH5807",
    "subject": "CSPH",
    "number": "5807",
    "honors": false,
    "writingIntensive": false,
    "name": "Mindfulness in the Workplace",
    "fullname": "Mindfulness in the Workplace: Pause, Practice, Perform",
    "info": "Mindfulness in the Workplace is an experiential course designed to teach core mindfulness skills while also exploring specific applications to the workplace setting. The course explores key mindfulness traits and how they relate to essential workplace skills, such as resilience, task execution, critical analysis, intra/interpersonal growth, leadership, and other related topics. In addition, the course explores how corporate culture can be a barrier or a catalyst for adoption of mindfulness principles. By exploring the above topics from the perspective of the workplace and academic literature, students will gain an understanding of how to apply evidence-informed techniques to help them on the job. prereq jr or sr or grad, or instructor consent",
    "prereq": []
  },
  {
    "uid": "816363",
    "code": "CSPH5905",
    "subject": "CSPH",
    "number": "5905",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Matters",
    "fullname": "Food Matters: Cook Like Your Life Depends On It",
    "info": "Food Matters is an experiential-learning, applied nutrition & culinary skills course for health professional students. The course addresses the role of food in specific health conditions and its function in health promotion and disease prevention. The course guides future health professionals in the procurement, preparation, and consumption of sustainably raised whole foods for self care and how this translates to patient care. prereq: Graduate student in a health professions field, or instructor consent",
    "prereq": []
  },
  {
    "uid": "811443",
    "code": "CSPH6000",
    "subject": "CSPH",
    "number": "6000",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Therapies/Healing",
    "fullname": "Integrative Therapies and Healing Practices Topics",
    "info": "Topics-based exploration/research on integrative therapies/healing practices.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "801888",
    "code": "CSPH7001",
    "subject": "CSPH",
    "number": "7001",
    "honors": false,
    "writingIntensive": false,
    "name": "The Healer's Art",
    "fullname": "The Healer's Art",
    "info": "Hidden crisis in medicine. Growing loss of meaning/commitment experienced by physicians nationwide under stresses of today’s health care system. How to stress-proof students to meet challenges of practices.prereq: Medical student",
    "prereq": []
  },
  {
    "uid": "787867",
    "code": "CSPH8100",
    "subject": "CSPH",
    "number": "8100",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Comp/Heal Practices",
    "fullname": "Special Topics in Complementary Therapy and Healing Practices",
    "info": "Critiquing research on complementary therapies (e.g., design, outcome measures). Synthesizing research findings for a therapy. Hypothesizing future directions for research on complementary therapies.",
    "prereq": []
  },
  {
    "uid": "790826",
    "code": "CSPH8101",
    "subject": "CSPH",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "Critiquing CAHP Research",
    "fullname": "Critiquing and Synthesizing Complementary and Alternative Healing Practices (CAHP) Research",
    "info": "Seminar. Students evaluate peer-reviewed literature in complementary/alternative healing practices (CAHP) research. Identifying strengths/weaknesses of published research, synthesizing findings from multiple studies.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "790394",
    "code": "CSPH8191",
    "subject": "CSPH",
    "number": "8191",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Therapies/Healing",
    "fullname": "Independent Study in Integrative Therapies and Healing Practices",
    "info": "Individual independent study with faculty guidance. Students write proposal, including outcome objectives/work plan. Faculty member directs work, evaluates project. prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "815249",
    "code": "CSPH8701",
    "subject": "CSPH",
    "number": "8701",
    "honors": false,
    "writingIntensive": false,
    "name": "Integ Health Coach MA Capstone",
    "fullname": "Integrative Health and Wellbeing Coaching MA Capstone Project",
    "info": "This is the culminating course of the Integrative Health and Wellbeing Coaching Master’s Program. The student uses coaching data collected during either CSPH 5703 Advanced Health Coaching Practicum, CSPH 5705 Health Coaching Professional Internship, or CSPH 5709 Group Health Coaching Course to write a publication-ready manuscript for a selected journal, and to orally present a research-informed retrospective Coaching Case Report. The purpose of this course is to enable students to develop and demonstrate master’s level skills in research, critical thinking, writing, and presentation. Students will deepen their understanding of the outcomes and impacts of health and well-being coaching for a client/group, the coach, and the profession. This Course is conducted primarily online with three synchronous meetings, three asynchronous Discussion Forums, and one on-site meeting at the end of the semester for oral presentation of the Coaching Case Report.\n \nIn special circumstances, with advance instructor permission, a client from a private coaching practice may be used in lieu of a course client or group data.\n\nprereq: Admission to Master of Arts in Integrative Health and Wellbeing Coaching program, CSPH 5701, 5702, 5703, 5705, 5706, 5707, 5709.",
    "prereq": {
      "and": [
        {
          "code": "CSPH 5701",
          "subject": "CSPH",
          "id": "5701"
        },
        {
          "code": "CSPH 5702",
          "subject": "CSPH",
          "id": "5702"
        },
        {
          "code": "CSPH 5703",
          "subject": "CSPH",
          "id": "5703"
        },
        {
          "code": "CSPH 5705",
          "subject": "CSPH",
          "id": "5705"
        },
        {
          "code": "CSPH 5706",
          "subject": "CSPH",
          "id": "5706"
        },
        {
          "code": "CSPH 5707",
          "subject": "CSPH",
          "id": "5707"
        },
        {
          "code": "CSPH 5709",
          "subject": "CSPH",
          "id": "5709"
        }
      ]
    }
  }
]