[
  {
    "uid": "014670",
    "code": "CVM1000",
    "subject": "CVM",
    "number": "1000",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro. Vet Med",
    "fullname": "Introduction to Veterinary Medicine",
    "info": "History of veterinary profession, careers within the profession, employment trends.  Information about admission to DVM.  Veterinary technology programs. ",
    "prereq": []
  },
  {
    "uid": "810097",
    "code": "CVM4001",
    "subject": "CVM",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in VetLead",
    "fullname": "Topics in VetLead",
    "info": "Independent study course for students in VetLead program.",
    "prereq": []
  },
  {
    "uid": "012968",
    "code": "CVM6000",
    "subject": "CVM",
    "number": "6000",
    "honors": false,
    "writingIntensive": false,
    "name": "GOALE",
    "fullname": "Gopher Orientation and Leadership Experience",
    "info": "Introduces first-year students to the veterinary college, program, and profession. Two-day and one-night off-site orientation program and monthly meetings are experiential in design and focus on leadership development, emotional intelligence, communication, and conflict management. Third orientation day on campus and subsequent noon meetings introduce students to the college facilities and resources and  address logistics necessary for participation in the program. Students work in mentor groups of 9-11 students and 2-3 faculty mentors throughout the course.prereq: Admission to veterinary program",
    "prereq": []
  },
  {
    "uid": "802185",
    "code": "CVM6001",
    "subject": "CVM",
    "number": "6001",
    "honors": false,
    "writingIntensive": false,
    "name": "Global & Intercultural Ops",
    "fullname": "Global and Intercultural Opportunities",
    "info": "Finding and applying for opportunities. Securing funding. Travel safety. Topics in cultural competence. Presentations from students who have participated in international projects.",
    "prereq": []
  },
  {
    "uid": "809293",
    "code": "CVM6002",
    "subject": "CVM",
    "number": "6002",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Pharmacotherapy",
    "fullname": "Veterinary Pharmacotherapy",
    "info": "Interprofessional course between veterinary medicine/ pharmacy students. Hybrid of online/experiential learning.   Class lectures posted/delivered via Moodle. Small groups meet for self-directed experiential learning.",
    "prereq": []
  },
  {
    "uid": "809190",
    "code": "CVM6003",
    "subject": "CVM",
    "number": "6003",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Correlations",
    "fullname": "Clinical Correlations",
    "info": "This course design follows principles of research in learning; prepares students for clinical work as well and what will be expected of them in senior year and, for most, in their career; and prepares students for life-long learning by requiring them to find resources.",
    "prereq": []
  },
  {
    "uid": "802907",
    "code": "CVM6005",
    "subject": "CVM",
    "number": "6005",
    "honors": false,
    "writingIntensive": false,
    "name": "Better Together",
    "fullname": "Better Together: Preparing for Collaborative Practice",
    "info": "This is a two-part learning experience that introduces health professional students to foundational concepts of interprofessional education and collaboration. This experience consists of one online module and a 3-hour in-person session that offers students an opportunity to engage with health professionals and experts to learn how interprofessional collaboration can impact real world health outcomes.",
    "prereq": []
  },
  {
    "uid": "810849",
    "code": "CVM6006",
    "subject": "CVM",
    "number": "6006",
    "honors": false,
    "writingIntensive": false,
    "name": "Global One Health: Thailand",
    "fullname": "Global One Health: Thailand",
    "info": "Self-guided study. Monthly in person seminars prior to three week study abroad in Thailand. Journal on recommended topics. Assessment via evidence of reading provided references through active participation in discussions, presentation of learning topics, active participation.",
    "prereq": []
  },
  {
    "uid": "817509",
    "code": "CVM6007",
    "subject": "CVM",
    "number": "6007",
    "honors": false,
    "writingIntensive": false,
    "name": "Glbal Perpctve & Intercult Dev",
    "fullname": "Global Perspectives and Intercultural Development",
    "info": "This course provides information on international and cultural immersion opportunities including finding and applying for opportunities, securing funding, and traveling safely. Additionally, students will explore cultural humility through the Intercultural Development inventory, case studies, and class activities.  Students will also have the opportunity to view posters and ask questions from current students who have participated in international projects ",
    "prereq": []
  },
  {
    "uid": "819091",
    "code": "CVM6008",
    "subject": "CVM",
    "number": "6008",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrated Physiology",
    "fullname": "Integrated Physiology",
    "info": "Fundamental principles of animal metabolism and physiology including the function of cells, skeletal muscle, heart and vascular system, gastrointestinal tract and nervous system. ",
    "prereq": []
  },
  {
    "uid": "818803",
    "code": "CVM6009",
    "subject": "CVM",
    "number": "6009",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Teaching Skills",
    "fullname": "Introduction to Teaching Skills",
    "info": "This is a hybrid series of modules and face-to-face course sessions, and experiential learningguiding veterinary students through best practices to enhance efficacy as an instructor in aveterinary curriculum. Specific topics include learning theory, building a course session,teaching presentations, and individual student assessment.",
    "prereq": []
  },
  {
    "uid": "820287",
    "code": "CVM6010",
    "subject": "CVM",
    "number": "6010",
    "honors": false,
    "writingIntensive": false,
    "name": "Urgent Care",
    "fullname": "Urgent Care",
    "info": "This rotation is designed to expose the senior student to acute pet illness and injury cases that are typical for any small animal general practice. Emphases of the rotation include honing client communication skillstaking coherent patient histories, developing concise problem lists with differential diagnoses, prioritizing diagnostic and therapeutic treatment steps, and writing readable discharge summaries for the client. Senior students will also be expected to practice skills such as physical exam, sample collection, radiograph interpretation, lab work analysis, and may perform minor surgeries.",
    "prereq": []
  },
  {
    "uid": "012969",
    "code": "CVM6011",
    "subject": "CVM",
    "number": "6011",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development I",
    "fullname": "Professional Development I",
    "info": "Animal use in DVM curriculum. Economic future of veterinary profession. Personal financial planning. Options available to graduate veterinarians. Preparation/training needed to pursue specific options. Professional behavior/ethics. Examine effects of addiction on veterinary professionals.",
    "prereq": []
  },
  {
    "uid": "013000",
    "code": "CVM6012",
    "subject": "CVM",
    "number": "6012",
    "honors": false,
    "writingIntensive": false,
    "name": "Prof Dev II: Communication",
    "fullname": "Professional Development II: Clinical Communication",
    "info": "Develop knowledge and proficiency needed to be a successful veterinarian in areas such as communication, ethics, clinical decision-making, and medical record keeping. Lecture, hands-on experiences, small group and mentor group discussions.",
    "prereq": []
  },
  {
    "uid": "013001",
    "code": "CVM6013",
    "subject": "CVM",
    "number": "6013",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development III",
    "fullname": "Professional Development III: Applied Communication",
    "info": "Growth of veterinary professional with in the larger community. Developing communication skills. Working with the elderly and children. Participation/observation at veterinary practice.",
    "prereq": []
  },
  {
    "uid": "013002",
    "code": "CVM6014",
    "subject": "CVM",
    "number": "6014",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development IV",
    "fullname": "Professional Development IV: Thinking Like a Doctor",
    "info": "Integrates subjects in veterinary professional curriculum. Introduction to/practice of professional skills. Communication, ethics, teamwork, leadership.",
    "prereq": []
  },
  {
    "uid": "820288",
    "code": "CVM6015",
    "subject": "CVM",
    "number": "6015",
    "honors": false,
    "writingIntensive": false,
    "name": "MVPH Primary Care",
    "fullname": "Mission Veterinary Practices Primary Care",
    "info": "MVP hospitals offer a busy general practice caseload where students will participate in patient care, scrub into surgery, monitor anesthesia, assist in the management of medical cases, provide wellness care, manage exam room interactions with the patient and client, and be responsible for client communication.",
    "prereq": []
  },
  {
    "uid": "826771",
    "code": "CVM6016",
    "subject": "CVM",
    "number": "6016",
    "honors": false,
    "writingIntensive": false,
    "name": "Urgent Care Elective",
    "fullname": "Urgent Care Elective",
    "info": "The Urgent Care Elective course is designed to prepare students to become ready to recognize and be confident in managing small animal (dog and cat) Urgent Care clinical cases. Using both online-based PowerPoint lectures and clinical cases and quizzes, students will gain confidence in learning how to work up Urgent Care cases from intake to discharge. Emphasis will be placed on combining learning from other classes to \"put it all together\" in the diagnosis and treatment of Urgent Care cases.",
    "prereq": []
  },
  {
    "uid": "012988",
    "code": "CVM6021",
    "subject": "CVM",
    "number": "6021",
    "honors": false,
    "writingIntensive": false,
    "name": "Overview of Animal Populations",
    "fullname": "Overview of Animal Populations",
    "info": "U.S. production animal agriculture at individual producer level. Roles veterinarians play.",
    "prereq": []
  },
  {
    "uid": "013009",
    "code": "CVM6022",
    "subject": "CVM",
    "number": "6022",
    "honors": false,
    "writingIntensive": false,
    "name": "Animal Pop II",
    "fullname": "Overview of Animal Populations II",
    "info": "Introduction to U.S. production animal agriculture at individual producer level and to roles veterinarians play.",
    "prereq": []
  },
  {
    "uid": "826074",
    "code": "CVM6023",
    "subject": "CVM",
    "number": "6023",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Leadership",
    "fullname": "Veterinary Leadership",
    "info": "The course will build on learning objectives of the GOALE program with an emphasis on growth mindset and leadership development. Students and mentors will choose one aspect of leadership development to explore. Structured after the Sanger Leadership framework, all topic sections will begin with an assessment to identify each learners’ starting point, and use this to determine personal learning goals. The next two sessions of the semester will be utilizing resources and exercises to practice and apply skills, reflect with the unit team, gather additional resources, and repeat the process. This course uses a 5-step framework for leadership development through self and mentoredcoaching.",
    "prereq": []
  },
  {
    "uid": "016802",
    "code": "CVM6025",
    "subject": "CVM",
    "number": "6025",
    "honors": false,
    "writingIntensive": false,
    "name": "LAH Practicum: Year 2",
    "fullname": "Large Animal Hospital Practicum: Year 2",
    "info": "Animal handling, evaluation, treatment protocols. Presentation/considerations related to veterinary diseases. Case care. Team skills. Hospital procedures for clinical rotations. Students provide primary case care and service support.Prereq-2nd yr DVM or instr consent.",
    "prereq": []
  },
  {
    "uid": "016803",
    "code": "CVM6026",
    "subject": "CVM",
    "number": "6026",
    "honors": false,
    "writingIntensive": false,
    "name": "SA ICU Practicum: Year 4",
    "fullname": "Small Animal ICU Practicum: Year 4",
    "info": "Management of dogs/cats requiring urgent medical care, intensive medical management. Providing primary case support through patient evaluation, problem solving, health care delivery, equipment operation. Practicum in Small Animal Intensive Care Unit.",
    "prereq": []
  },
  {
    "uid": "016804",
    "code": "CVM6027",
    "subject": "CVM",
    "number": "6027",
    "honors": false,
    "writingIntensive": false,
    "name": "LA Practicum: Year 3",
    "fullname": "Large Animal Practicum: Year 3",
    "info": "Experience in procedures/policies involved in after-hours care of hospitalized/emergency cases in the large-animal hospital.Prereq-3rd DVM or [instr consent, college consent]",
    "prereq": []
  },
  {
    "uid": "016805",
    "code": "CVM6028",
    "subject": "CVM",
    "number": "6028",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Clerk Duty",
    "fullname": "Large Animal Clerk Duty",
    "info": "Team leadership in procedures/policies involved in after hours care of hospitalized/emergency cases in large-animal hospital.prereq: All 4th year students and affiliate students.",
    "prereq": []
  },
  {
    "uid": "789479",
    "code": "CVM6029",
    "subject": "CVM",
    "number": "6029",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Hospital Practicum Year 3",
    "fullname": "Small Animal Hospital Practicum: Year 3",
    "info": "Management of dogs/cats requiring urgent medical care, intensive medical management. Providing primary case care and service support through patient evaluation, problem solving, health care delivery, equipment operation. Practicum is served in Small Animal Intensive Care Unit.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "014481",
    "code": "CVM6030",
    "subject": "CVM",
    "number": "6030",
    "honors": false,
    "writingIntensive": false,
    "name": "Vet & Community Public Health",
    "fullname": "Veterinary and Community Public Health",
    "info": "Epidemiological approach to veterinary public health. Major zoonoses, animal sentinels, meat/milk inspection, preharvest food safety, environment, occupational health/safety, euthanasia, carcass disposal methods, cruelty investigations, welfare issues. Problem-solving examples.prereq: 6201, 6202, 6220",
    "prereq": {
      "and": [
        {
          "code": "CVM 6201",
          "subject": "CVM",
          "id": "6201"
        },
        {
          "code": "CVM 6202",
          "subject": "CVM",
          "id": "6202"
        },
        {
          "code": "CVM 6220",
          "subject": "CVM",
          "id": "6220"
        }
      ]
    }
  },
  {
    "uid": "015355",
    "code": "CVM6031",
    "subject": "CVM",
    "number": "6031",
    "honors": false,
    "writingIntensive": false,
    "name": "International Animal Diseases",
    "fullname": "International Animal Diseases",
    "info": "Epidemiology, clinical signs, differential diagnoses, pathology, economic effect of diseases not currently or intermittently present in the United States. International role of veterinarians in controlling disease, increasing food production, facilitating trade.prereq: DVM, [CVM grad student or instr consent]",
    "prereq": []
  },
  {
    "uid": "798665",
    "code": "CVM6032",
    "subject": "CVM",
    "number": "6032",
    "honors": false,
    "writingIntensive": false,
    "name": "Pub Hlth & Foreign Animal Dis",
    "fullname": "International Animal Diseases: The Public Health Perspective",
    "info": "Epidemiology, clinical signs, differential diagnoses, pathology, economic effect of diseases not currently, or only intermittently present, in the United States. International role of veterinarians in controlling disease, increasing food production, facilitating trade.",
    "prereq": []
  },
  {
    "uid": "014483",
    "code": "CVM6040",
    "subject": "CVM",
    "number": "6040",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice Economics",
    "fullname": "Economics of Practice",
    "info": "Techniques in economic analysis.  Examples of calculations needed to support economic decisions in professional life and veterinary practice management.  Decision making under uncertainty, using examples for assessing and communicating potential financial, economic, and welfare benefits and risk to owners of companion and food animals.",
    "prereq": []
  },
  {
    "uid": "014536",
    "code": "CVM6042",
    "subject": "CVM",
    "number": "6042",
    "honors": false,
    "writingIntensive": false,
    "name": "Law & Ethics/Practice Mgmt",
    "fullname": "Practice Management/Law and Ethics",
    "info": "Economic, marketing, personnel management, accounting issues in veterinary practice management. Legal/ethical parameters for veterinary practice. Attendance required.prereq: DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "014537",
    "code": "CVM6044",
    "subject": "CVM",
    "number": "6044",
    "honors": false,
    "writingIntensive": false,
    "name": "Law and Ethics",
    "fullname": "Professional Law and Ethics",
    "info": "Major legal and ethical considerations for the practice of veterinary medicine",
    "prereq": []
  },
  {
    "uid": "794846",
    "code": "CVM6045",
    "subject": "CVM",
    "number": "6045",
    "honors": false,
    "writingIntensive": false,
    "name": "Private Prac Prepareedness-PPP",
    "fullname": "Private Practice Preparedness",
    "info": "Pet wellness, human resources, supervision, finance, customer service, conflict management, marketing.",
    "prereq": []
  },
  {
    "uid": "788206",
    "code": "CVM6046",
    "subject": "CVM",
    "number": "6046",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac Read I",
    "fullname": "Practice Readiness I",
    "info": "Well pet care, practice options, teamwork, economic impact. Preventive care for all life stages, including pet selection, dental prophylaxis/immunizations. Wellness concept, framework for euthanasia appointment, customer service, veterinary/team roles. Lengthening well lives of pets. Legislative process: how veterinary/professional organizations can be involved. Selecting a practice. Resume, interview skills. Professional dress code.",
    "prereq": []
  },
  {
    "uid": "013012",
    "code": "CVM6050",
    "subject": "CVM",
    "number": "6050",
    "honors": false,
    "writingIntensive": false,
    "name": "Animals and Society",
    "fullname": "Animals and Society: Interrelationships of People and Animals in Society Today",
    "info": "Roles that animals have in society. Problem-based learning. Students research their assigned topics, followed by presentation (e.g., point-counter point debate, power point presentation, skits, educational handout, videos) at the beginning of class in the following class period. ",
    "prereq": []
  },
  {
    "uid": "016837",
    "code": "CVM6051",
    "subject": "CVM",
    "number": "6051",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Animal Bond",
    "fullname": "Human-Companion Animal Bond: Attachments and Losses, Communications, Ethics, and Service",
    "info": "Human-Companion animal bond activities/services.  Emphasizes helping clients, particularly at time of actual or anticipated death of companion animals. Communication/counseling skills.",
    "prereq": []
  },
  {
    "uid": "788142",
    "code": "CVM6052",
    "subject": "CVM",
    "number": "6052",
    "honors": false,
    "writingIntensive": false,
    "name": "Grief, Human Bond Elective",
    "fullname": "Grief, Human Animal Bond, Communication Elective",
    "info": "Veterinarians' role in recognizing/managing aspects of human-animal bond. Grief management, client present euthanasia, closure, staff relations, work-life balance, communicating in special situations. Communicating with co-workers/staff in practice setting.",
    "prereq": []
  },
  {
    "uid": "016253",
    "code": "CVM6060",
    "subject": "CVM",
    "number": "6060",
    "honors": false,
    "writingIntensive": false,
    "name": "World Food Problems",
    "fullname": "World Food Problems",
    "info": "Multidisciplinary approach to social, economic, and technical problems of feeding world's growing population. Principles from social, economic, plant, animal, and nutrition sciences applied to food problems.",
    "prereq": []
  },
  {
    "uid": "012984",
    "code": "CVM6100",
    "subject": "CVM",
    "number": "6100",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Gross Anatomy",
    "fullname": "Veterinary Gross Anatomy",
    "info": "Gross anatomy of domesticated mammals, including development anatomy. Carnivore portion features dog as a model animal and comparatively the cat.  Ungulate portion focuses on basic equine anatomy and includes clinically important ruminant/swine anatomy.",
    "prereq": []
  },
  {
    "uid": "792184",
    "code": "CVM6101",
    "subject": "CVM",
    "number": "6101",
    "honors": false,
    "writingIntensive": false,
    "name": "Normal Radiographic Anatomy",
    "fullname": "Normal Radiographic Anatomy",
    "info": "Introduction to radiological principles. Radiation safety, radiographic technique, patient positioning. Emphasizes mastery of normal radiographic anatomy. Identifying anatomic structures on normal plain films and on special-contrast procedure radiographs. Lectures, guided laboratory exercises.",
    "prereq": []
  },
  {
    "uid": "794408",
    "code": "CVM6102",
    "subject": "CVM",
    "number": "6102",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Imaging I",
    "fullname": "Veterinary Imaging I",
    "info": "Physics of radiology. Radiographic principles/techniques. Cardiopulmonary/urogenital systems. Interpretation of radiographs (film or digital) germane to common animal diseases. Clinical applications. Lectures, lab exercises using body systems approach to imaging (primarily radiographic) of large/small animals.",
    "prereq": []
  },
  {
    "uid": "794409",
    "code": "CVM6103",
    "subject": "CVM",
    "number": "6103",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Imaging II",
    "fullname": "Veterinary Imaging II",
    "info": "Musculoskeletal, general abdomen, and alimentary tract systems. Interpretation of radiographs (film or digital) germane to common animal diseases. Clinical applications. Lectures, lab exercises using body systems approach to imaging (primarily radiographic) of large/small animals.prereq: [6100, 6101, 6102, DVM 3rd yr] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CVM 6100",
          "subject": "CVM",
          "id": "6100"
        },
        {
          "code": "CVM 6101",
          "subject": "CVM",
          "id": "6101"
        },
        {
          "code": "CVM 6102",
          "subject": "CVM",
          "id": "6102"
        }
      ]
    }
  },
  {
    "uid": "788207",
    "code": "CVM6104",
    "subject": "CVM",
    "number": "6104",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Special Proc. Radiology",
    "fullname": "Small Animal Special Procedures in Radiology: Advanced Block",
    "info": "Common contrast studies used in small animal practice.",
    "prereq": []
  },
  {
    "uid": "797918",
    "code": "CVM6105",
    "subject": "CVM",
    "number": "6105",
    "honors": false,
    "writingIntensive": false,
    "name": "Vet SA Ultrasound",
    "fullname": "Small Animal Ultrasonography",
    "info": "Body systems approach to imaging (primarily abdominal) of small animals. Ultrasonographic physics/technique, normal anatomy. Portal vein-associated organs, general abdomen (masses, effusions, tissue echogenicity, bowel). Upper/lower urinary tracts, genital tract, echocardiography. Head/neck ultrasound (eye, thyroid, etc.). Background of image generation/interpretation of sonograms germaine to common animal diseases.prereq: [6100, 6101, 6102, 6103, 3rd yr DVM student] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CVM 6100",
          "subject": "CVM",
          "id": "6100"
        },
        {
          "code": "CVM 6101",
          "subject": "CVM",
          "id": "6101"
        },
        {
          "code": "CVM 6102",
          "subject": "CVM",
          "id": "6102"
        },
        {
          "code": "CVM 6103",
          "subject": "CVM",
          "id": "6103"
        }
      ]
    }
  },
  {
    "uid": "791984",
    "code": "CVM6110",
    "subject": "CVM",
    "number": "6110",
    "honors": false,
    "writingIntensive": false,
    "name": "Vet  Physiological Chemistry",
    "fullname": "Veterinary Physiological Chemistry",
    "info": "Mechanisms by which animals digest, absorb, and metabolize carbohydrate, protein, lipid, and nucleic acids. Use of metabolic energy to maintain physiological processes. How metabolic end products are created/eliminated. Hormones and intracellular signaling. Genome, protein synthesis, regulation of gene expression. Comparative biochemistry.",
    "prereq": []
  },
  {
    "uid": "014135",
    "code": "CVM6111",
    "subject": "CVM",
    "number": "6111",
    "honors": false,
    "writingIntensive": false,
    "name": "Histology",
    "fullname": "Histology",
    "info": "Introduction to light/electron microscopic structure of cells, tissues, and certain organs. How cells associate to perform specialized functions. How organized groups of cells (i.e., tissues) are arranged to form organ systems of the body.",
    "prereq": []
  },
  {
    "uid": "013008",
    "code": "CVM6112",
    "subject": "CVM",
    "number": "6112",
    "honors": false,
    "writingIntensive": false,
    "name": "Organology",
    "fullname": "Organology",
    "info": "Microscopic/ultrastructural morphology of organ systems (cardiovascular, gastrointestinal, respiratory, urinary, endocrine) in mammalian domestic species.",
    "prereq": []
  },
  {
    "uid": "013006",
    "code": "CVM6120",
    "subject": "CVM",
    "number": "6120",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Neurobiology",
    "fullname": "Veterinary Neurobiology",
    "info": "Anatomy and physiology of central nervous system (brain, spinal cord) and special senses (eye, ear, olfaction, taste).",
    "prereq": []
  },
  {
    "uid": "013004",
    "code": "CVM6130",
    "subject": "CVM",
    "number": "6130",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Physiology",
    "fullname": "Veterinary Physiology",
    "info": "Major organ systems (neural, muscle, cardiac, vascular, respiratory, gastrointestinal, renal, endocrine) physiology. Neural, endocrine, and paracrine regulatory systems. Relationships between organ systems illustrate integrative mechanisms for homeostasis.",
    "prereq": []
  },
  {
    "uid": "820450",
    "code": "CVM6131",
    "subject": "CVM",
    "number": "6131",
    "honors": false,
    "writingIntensive": false,
    "name": "Mixed & Food Animal Problems",
    "fullname": "Mixed & Food Animal Problems",
    "info": "This course combines cases commonly encountered in mixed or food animal practice and allows students to select assignments based on their track and species interest. All students will complete the same core cases emphasizing common learning objectives across species, and in addition, students will complete core and elective cases for their species of interest. ",
    "prereq": []
  },
  {
    "uid": "013017",
    "code": "CVM6132",
    "subject": "CVM",
    "number": "6132",
    "honors": false,
    "writingIntensive": false,
    "name": "Reproductive Biology",
    "fullname": "Reproductive Biology",
    "info": "Physiology of reproduction, including lactation.",
    "prereq": []
  },
  {
    "uid": "013010",
    "code": "CVM6134",
    "subject": "CVM",
    "number": "6134",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Vet Nutrition",
    "fullname": "Principles of Veterinary Nutrition",
    "info": "Major classes of nutrients. Role of specific deficiencies and excesses in disease. How domestic species are fed, differences in nutrition/feeding. Role of nutrition in a systemic physiologic/pathologic process. Interface between veterinary profession and feed/food production systems.",
    "prereq": []
  },
  {
    "uid": "788208",
    "code": "CVM6136",
    "subject": "CVM",
    "number": "6136",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Nutrition Adv Block",
    "fullname": "Small Animal Nutrition: Advanced Block",
    "info": "Clinical application in nutrition competencies expected of a practicing small or mixed animal veterinarian. Feeding of healthy pets. Nutritional assessment. Formulating a nutritional management plan for patients.prereq: 3rd yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "794845",
    "code": "CVM6137",
    "subject": "CVM",
    "number": "6137",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Clinical Nutrition",
    "fullname": "Small Animal Clinical Nutrition",
    "info": "Students participate in clinical nutrition service of VMC, manage nutritional needs of patients, perform nutritional assessments of ICU patients, perform internal/referring nutritional consults, and see outpatient appointments.prereq: 3rd or 4th yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "013005",
    "code": "CVM6141",
    "subject": "CVM",
    "number": "6141",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Pharmacology",
    "fullname": "Veterinary Pharmacology",
    "info": "Medical considerations for use of drugs in animals. Pharmacology of anti-allergy/inflammatory drugs. Mechanisms and therapeutic uses of drugs affecting autonomic nervous system, cardiovascular system, respiratory/digestive tracts, and kidneys.",
    "prereq": []
  },
  {
    "uid": "013018",
    "code": "CVM6142",
    "subject": "CVM",
    "number": "6142",
    "honors": false,
    "writingIntensive": false,
    "name": "Vet Neuropharmacology",
    "fullname": "Veterinary Neuropharmacology",
    "info": "Pharmacology of drugs that have a major effect on the central nervous system: absorption, distribution, metabolism, and excretion; major mechanisms of action; clinical usefulness; side effects; drug interactions.",
    "prereq": []
  },
  {
    "uid": "016827",
    "code": "CVM6195",
    "subject": "CVM",
    "number": "6195",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Toxicology",
    "fullname": "Veterinary Toxicology",
    "info": "Toxicology of minerals, pesticides, venoms, and various toxins. Identification of poisonous plants. Recognition, diagnosis, and treatment of animal poisons.",
    "prereq": []
  },
  {
    "uid": "013007",
    "code": "CVM6201",
    "subject": "CVM",
    "number": "6201",
    "honors": false,
    "writingIntensive": false,
    "name": "Host Defenses",
    "fullname": "Host Defenses",
    "info": "Mechanisms of host defense against microbial pathogens and neoplasia. Immune-mediated pathologies such as allergies and autoimmunity. Different immune cells/molecules, their roles in innate or adaptive immunity. Interaction between the immune system and microbes, parasites, and viruses. ",
    "prereq": []
  },
  {
    "uid": "013013",
    "code": "CVM6202",
    "subject": "CVM",
    "number": "6202",
    "honors": false,
    "writingIntensive": false,
    "name": "Inf Agents-Parasitology",
    "fullname": "Infectious Agents: Parasitology",
    "info": "Systematic and biologic study of protozoan, arthropod, and helminth parasites of animals. Emphasizes relationships to diseases and principles of parasite control.",
    "prereq": []
  },
  {
    "uid": "791996",
    "code": "CVM6203",
    "subject": "CVM",
    "number": "6203",
    "honors": false,
    "writingIntensive": false,
    "name": "Inf Agents - Bacteriology",
    "fullname": "Infectious Agents: Bacteriology",
    "info": "Veterinary medical microbiology/mycology. Mechanisms of pathogenesis, clinical presentations, diagnostic approaches, host responses to infectious challenge. Prevention, treatments. Laboratory exercises are used to test students' ability to isolate/define potential bacterial pathogens.",
    "prereq": []
  },
  {
    "uid": "792004",
    "code": "CVM6204",
    "subject": "CVM",
    "number": "6204",
    "honors": false,
    "writingIntensive": false,
    "name": "Virology",
    "fullname": "Infectious Agents: Virology",
    "info": "Concept of viruses that affect animal species of veterinary significance. How virus/host factors interact. How these interactions lead to disease or recovery. Applications to prevention/management of disease. Mechanics of virus-host interactions in important viral diseases. Using literature to solve virological problems and evaluate strategies for controlling viral diseases.",
    "prereq": []
  },
  {
    "uid": "791985",
    "code": "CVM6205",
    "subject": "CVM",
    "number": "6205",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Pharmacology",
    "fullname": "Pharmacology of Antimicrobials, Antifungals, Anthelmintics and Cancer chemotherapeutic agents",
    "info": "Clinical pharmacology of anti-microbial, antifungals, and anthelmintics used in veterinary medicine. Mechanisms of action, development of resistance, and comparative anti-microbial spectrum of agents in their drug classes. Toxicities associated with use, and ways to minimize them.",
    "prereq": []
  },
  {
    "uid": "815416",
    "code": "CVM6206",
    "subject": "CVM",
    "number": "6206",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Integrative Medicine",
    "fullname": "Introduction to Integrative Medicine",
    "info": "This 1 week elective rotation is primarily provided for 4th year veterinary students. The integrative medicine rotation will cover traditional eastern veterinary medicine, animal chiropractic, nutritional therapy, neutraceuticals, physical therapy, and massage therapy.",
    "prereq": []
  },
  {
    "uid": "013014",
    "code": "CVM6210",
    "subject": "CVM",
    "number": "6210",
    "honors": false,
    "writingIntensive": false,
    "name": "Host Defenses",
    "fullname": "Host Defense Mechanisms",
    "info": "How the hemolymphatic system, immune system, and inflammatory processes defend an animal against invading organisms.",
    "prereq": []
  },
  {
    "uid": "016838",
    "code": "CVM6211",
    "subject": "CVM",
    "number": "6211",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Veterinary Genetics",
    "fullname": "Applied Veterinary Genetics",
    "info": "Overview of general, molecular, and cytogenetics relevant to animal health, disease, breeding, and production. How genetic information is acquired/used in veterinary medicine and animal agriculture.",
    "prereq": []
  },
  {
    "uid": "013016",
    "code": "CVM6220",
    "subject": "CVM",
    "number": "6220",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Epidemiology",
    "fullname": "Clinical Epidemiology",
    "info": "Statistical and epidemiological concepts applied to veterinary medicine.",
    "prereq": []
  },
  {
    "uid": "014538",
    "code": "CVM6221",
    "subject": "CVM",
    "number": "6221",
    "honors": false,
    "writingIntensive": false,
    "name": "Risk Factors",
    "fullname": "Risk Factors for Disease",
    "info": "Non-microbial factors that contribute to the initiation, spread, and persistence of disease in populations of animals.  Approaches to investigating outbreaks of diseases in populations.",
    "prereq": []
  },
  {
    "uid": "796491",
    "code": "CVM6222",
    "subject": "CVM",
    "number": "6222",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Epidemiology",
    "fullname": "Applied Epidemiology",
    "info": "Apply epidemiologic principles to control of infectious diseases in animal populations. Scientific literature. Global impacts of infectious diseases. Diagnostic tests, disease outbreak investigation, economics of disease control/surveillance.",
    "prereq": []
  },
  {
    "uid": "801119",
    "code": "CVM6298",
    "subject": "CVM",
    "number": "6298",
    "honors": false,
    "writingIntensive": false,
    "name": "Basic Pathology",
    "fullname": "Basic Pathology",
    "info": "Mechanisms in reactions of cells/tissues to injury. Retrogressive changes in cells, cell death, pigments, circulatory disturbances, inflammation, alterations of cell growth (including neoplasia). Appllications to evaluation of gross and microscopic tissue alterations.",
    "prereq": []
  },
  {
    "uid": "801120",
    "code": "CVM6299",
    "subject": "CVM",
    "number": "6299",
    "honors": false,
    "writingIntensive": false,
    "name": "Systemic Pathology",
    "fullname": "Systemic Veterinary Pathology",
    "info": "Reactions of specific organ systems to injury. Mechanisms of disease for more or less well defined stimuli. Applications to diagnosis of specific diseases at gross/microscopic level.",
    "prereq": []
  },
  {
    "uid": "013015",
    "code": "CVM6300",
    "subject": "CVM",
    "number": "6300",
    "honors": false,
    "writingIntensive": false,
    "name": "Vet Pathology",
    "fullname": "Veterinary Pathology",
    "info": "Reactions of cells and tissues to injury and disease, including reversible and irreversible cell injury, disturbances of circulation, blood coagulation, and alterations of cell growth and multiplication.  Pathology of body systems, emphasizing reactions of specific organs.",
    "prereq": []
  },
  {
    "uid": "012970",
    "code": "CVM6301",
    "subject": "CVM",
    "number": "6301",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills I",
    "fullname": "Clinical Skills I",
    "info": "Domestic animal behavior. Basic large animal handling/management skills. Clerk duty in large-animal hospital is required. First of five-part series.",
    "prereq": []
  },
  {
    "uid": "012997",
    "code": "CVM6302",
    "subject": "CVM",
    "number": "6302",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills II",
    "fullname": "Clinical Skills II",
    "info": "Domestic animal behavior. Basic small animal handling/management skills. Introduction to hospital. Small-animal clerk duty is required.",
    "prereq": []
  },
  {
    "uid": "012998",
    "code": "CVM6303",
    "subject": "CVM",
    "number": "6303",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills III",
    "fullname": "Clinical Skills III",
    "info": "Domestic animal behavior. Basic animal handling and management skills.",
    "prereq": []
  },
  {
    "uid": "012999",
    "code": "CVM6304",
    "subject": "CVM",
    "number": "6304",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills IV",
    "fullname": "Clinical Skills IV",
    "info": "Domestic animal behavior. Basic animal handling and management skills.",
    "prereq": []
  },
  {
    "uid": "014134",
    "code": "CVM6305",
    "subject": "CVM",
    "number": "6305",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills IV",
    "fullname": "Clinical Skills IV",
    "info": "Domestic animal behavior. Basic animal handling/management skills. Small-animal clerk duty. Using an IV/syringe pump, setting up ICU order sheets, using glucometer/centrifuge to perform \"big 4\" daily ICUC tests.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "788209",
    "code": "CVM6306",
    "subject": "CVM",
    "number": "6306",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Clinical Skills Adv Block",
    "fullname": "Small Animal Clinical Skills: Advanced Block",
    "info": "Advanced clinical skills used by small animal practitioners in private practice.prereq: [3rd or 4th] yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "792198",
    "code": "CVM6307",
    "subject": "CVM",
    "number": "6307",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills Elective",
    "fullname": "Clinical Skills Elective",
    "info": "Hands-on clinical skills. History taking, physical exam, basic/intermediate technical procedures on small animals. Skills are practiced at several approved locations.",
    "prereq": []
  },
  {
    "uid": "814263",
    "code": "CVM6308",
    "subject": "CVM",
    "number": "6308",
    "honors": false,
    "writingIntensive": false,
    "name": "LabAnM",
    "fullname": "Lab Animal Medicine",
    "info": "This course is designed to introduce students to the field of laboratory animal medicine and provide a strong foundation in the discipline. Using a mix of didactic and hands-on training methods, students will gain proficiency in the veterinary care of lab animals, and apply their skills and knowledge gained in all previous courses in their veterinary curriculum. Discussions will be challenging and require independent thought and application of concepts to real-world situations. Students will be well-prepared for additional training in laboratory animal medicine as would occur though residency.",
    "prereq": []
  },
  {
    "uid": "013019",
    "code": "CVM6310",
    "subject": "CVM",
    "number": "6310",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Diagnostics",
    "fullname": "Applied Diagnostics",
    "info": "Rationale for and principles of diagnostic and clinical chemistry labs, including test interpretation, demonstration of controls with positive and negative tests, statistical analysis, and sample submission.",
    "prereq": []
  },
  {
    "uid": "791918",
    "code": "CVM6312",
    "subject": "CVM",
    "number": "6312",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Dental Rotation",
    "fullname": "Veterinary Dental Rotation (SDen)",
    "info": "Routine/complex dental problems. Students diagnose and formulate treatment plans. Hands-on training. Basic periodontal procedures, single/multi-rooted extractions, dental radiographic techniques, instrument/equipment care, dental charting.prereq: DVM 3rd or 4th yr student or instr consent",
    "prereq": []
  },
  {
    "uid": "013021",
    "code": "CVM6321",
    "subject": "CVM",
    "number": "6321",
    "honors": false,
    "writingIntensive": false,
    "name": "Surgery  and Anesthesiology",
    "fullname": "Surgery and Anesthesiology",
    "info": "Introduction to principles/techniques for conducting surgical procedures, managing uncomplicated anesthesia, and providing critical care for common situations in large/small animal species.",
    "prereq": []
  },
  {
    "uid": "014539",
    "code": "CVM6322",
    "subject": "CVM",
    "number": "6322",
    "honors": false,
    "writingIntensive": false,
    "name": "Surg Anes Crit II",
    "fullname": "Surgery, Anesthesiology, Critical Care II",
    "info": "Common surgical, anesthetic and critical care issues in small and large domestic species.",
    "prereq": []
  },
  {
    "uid": "013020",
    "code": "CVM6400",
    "subject": "CVM",
    "number": "6400",
    "honors": false,
    "writingIntensive": false,
    "name": "Skin and Adnexa",
    "fullname": "Skin and Adnexa",
    "info": "Structure/function of skin/adnexa. Clinical signs, diagnosis, histopathologic reaction patterns, and treatment of various dermatologic conditions that affect small and large animals.",
    "prereq": []
  },
  {
    "uid": "788210",
    "code": "CVM6404",
    "subject": "CVM",
    "number": "6404",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Dermatology Adv Block",
    "fullname": "Small Animal Dermatology: Advanced Block",
    "info": "Case-base discussion of common dermatologic conditions that affect dogs/cats. Students work on clinical cases outside classroom. Cases are discussed in classroom.",
    "prereq": []
  },
  {
    "uid": "014540",
    "code": "CVM6410",
    "subject": "CVM",
    "number": "6410",
    "honors": false,
    "writingIntensive": false,
    "name": "LA Digestive Disorders",
    "fullname": "Large Animal Digestive Disorders",
    "info": "Digestive disorders of domestic large animal species, beginning with oral cavity. Pathogenesis, clinical signs, diagnosis, treatment, prevention. Case examples, lab exercises.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "797868",
    "code": "CVM6411",
    "subject": "CVM",
    "number": "6411",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Gastroenterology",
    "fullname": "Small Animal Gastroenterology",
    "info": "Important gastrointestinal (GI) diseases of dogs/cats. Oral cavity (dentistry), esophagus, intestines, liver, biliary tract, pancreas. Obtaining an appropriate history for dogs/cats with GI disorders. Common GI disorders. Therapy/prognosis. How to formulate an appropriate set of differential diagnoses and diagnostic plan.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "788211",
    "code": "CVM6414",
    "subject": "CVM",
    "number": "6414",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Liver & Pancreas  Adv Block",
    "fullname": "Small Animal Liver/Pancreas Disorders: Advanced Block",
    "info": "Complicated diabetes mellitus, feline pancreatitis, and hepatic encephalopathy in dogs/cats. Lectures, small-group exercises.",
    "prereq": []
  },
  {
    "uid": "788212",
    "code": "CVM6416",
    "subject": "CVM",
    "number": "6416",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Gastrointestinal Endoscopy",
    "fullname": "Small Animal Gastrointestinal Endoscopy",
    "info": "Endoscopic diagnosis/treatment of small animal diseases.",
    "prereq": []
  },
  {
    "uid": "014541",
    "code": "CVM6420",
    "subject": "CVM",
    "number": "6420",
    "honors": false,
    "writingIntensive": false,
    "name": "Musculoskeletal Sys Diseases",
    "fullname": "Musculoskeletal System Diseases",
    "info": "Presentation, pathophysiology, diagnostic, and therapeutic/management approaches for common disorders of locomotion.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "788213",
    "code": "CVM6424",
    "subject": "CVM",
    "number": "6424",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Orthopedic Adv Block",
    "fullname": "Small Animal Orthopedic: Advanced Block",
    "info": "Dog/cat pediatric, adult orthopedic problems frequently seen in clinical practice. For comparative information, selected human orthopedic problems are presented by guest lecturers. Attendance/participation required for grade.prereq: [3rd or 4th] yr DVM or instr consent; non-track students may audit lectures, but labs must be taken for grade",
    "prereq": []
  },
  {
    "uid": "014542",
    "code": "CVM6430",
    "subject": "CVM",
    "number": "6430",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardiopulmonary System Dis",
    "fullname": "Cardiopulmonary System Disorders",
    "info": "Pathophysiology, presentation, diagnostic presentation, therapeutic approaches, and management protocols for common disorders of the cardiovascular and pulmonary systems.",
    "prereq": []
  },
  {
    "uid": "790149",
    "code": "CVM6433",
    "subject": "CVM",
    "number": "6433",
    "honors": false,
    "writingIntensive": false,
    "name": "Hematology",
    "fullname": "Hematology Elective",
    "info": "Case based experience in interpreting/using hematology/chemistry results for small animals.",
    "prereq": []
  },
  {
    "uid": "788214",
    "code": "CVM6434",
    "subject": "CVM",
    "number": "6434",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Care Adv Block",
    "fullname": "Critical Care: Advanced Block",
    "info": "Case-based discussions of common emergencies: trauma, toxins, acute abdomen, hematologic, respiratory. Emergency procedures, intensive care monitoring, blood gas interpretation. Sepsis, related inflammatory response. Cardiopulmonary resuscitation.prereq: [3rd or 4th] yr DVM or",
    "prereq": []
  },
  {
    "uid": "788215",
    "code": "CVM6436",
    "subject": "CVM",
    "number": "6436",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Cardiology - Adv Block",
    "fullname": "Small Animal Cardiology: Advanced Block",
    "info": "Diagnostic/therapeutic considerations related to small animal cardiovascular disorders beyond core in preparation for clinical rotations.prereq: [3rd or 4th] yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "014543",
    "code": "CVM6440",
    "subject": "CVM",
    "number": "6440",
    "honors": false,
    "writingIntensive": false,
    "name": "Nervous System Disorders",
    "fullname": "Nervous System Disorders",
    "info": "Pathophysiology, presentation, diagnostic approach, therapeutic approach, management protocol for common neurologic disorders in domestic species.",
    "prereq": []
  },
  {
    "uid": "788143",
    "code": "CVM6441",
    "subject": "CVM",
    "number": "6441",
    "honors": false,
    "writingIntensive": false,
    "name": "Behavior Core",
    "fullname": "Behavior Core",
    "info": "Ethology, small/large animal behavior, human-animal bond, behavior medicine, psychopharmacology, behavior genetics, learning theory, behavior modification.",
    "prereq": []
  },
  {
    "uid": "788216",
    "code": "CVM6442",
    "subject": "CVM",
    "number": "6442",
    "honors": false,
    "writingIntensive": false,
    "name": "Animal Behavior Elec - Adv Blk",
    "fullname": "Animal Behavior Elective: Advanced Block",
    "info": "Introduction to abnormal/undesired animal behavior, diagnostic procedures, and behavioral/pharmacological modifications.prereq: [3rd or 4th] yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "791125",
    "code": "CVM6443",
    "subject": "CVM",
    "number": "6443",
    "honors": false,
    "writingIntensive": false,
    "name": "Puppy Classes",
    "fullname": "Preparing and Teaching Puppy Classes",
    "info": "Prepares students to teach in CVM puppy classes offered to public. Puppy socialization, reward-based training, pitfalls of using punishment, canine learning principles. Management of common puppy problems during ages 7 to 20 weeks. Students observe puppy classes and practice presentations. Lecture, lab.",
    "prereq": []
  },
  {
    "uid": "788144",
    "code": "CVM6444",
    "subject": "CVM",
    "number": "6444",
    "honors": false,
    "writingIntensive": false,
    "name": "Ophthalmology",
    "fullname": "Ophthalmology",
    "info": "Common procedures for evaluation, diagnosis, treatment of eye disorders in domestic species.",
    "prereq": []
  },
  {
    "uid": "803797",
    "code": "CVM6448",
    "subject": "CVM",
    "number": "6448",
    "honors": false,
    "writingIntensive": false,
    "name": "Oncology",
    "fullname": "Veterinary Oncology",
    "info": "Cancer biology/metastasis. Surgical oncology, chemotherapy, and radiation therapy. Pathophysiology, clinical presentation, diagnostic testing and therapeutic options (curative, palliative-intent) for neoplastic/paraneoplastic diseases in domestic animal species.",
    "prereq": []
  },
  {
    "uid": "014544",
    "code": "CVM6451",
    "subject": "CVM",
    "number": "6451",
    "honors": false,
    "writingIntensive": false,
    "name": "Metabolic Disorders",
    "fullname": "Metabolic Disorders",
    "info": "Metabolic diseases of both companion and large animal species. Endocrinology, unique metabolic disorders of large animals. Introductions to pediatrics and geriatric medicine.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "014545",
    "code": "CVM6452",
    "subject": "CVM",
    "number": "6452",
    "honors": false,
    "writingIntensive": false,
    "name": "Metabolic Disord II",
    "fullname": "Metabolic Disorders II",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options, and management protocols for metabolic and endocrine based disorders of domestic species.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "820566",
    "code": "CVM6457",
    "subject": "CVM",
    "number": "6457",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice Ready Skills Rotation",
    "fullname": "Practice Ready Skills Senior Rotation",
    "info": "Hands on, active learning rotation, focusing on the practice of various clinical skills and surgical techniques",
    "prereq": []
  },
  {
    "uid": "014546",
    "code": "CVM6460",
    "subject": "CVM",
    "number": "6460",
    "honors": false,
    "writingIntensive": false,
    "name": "Urinary System Disorders",
    "fullname": "Urinary System Disorders",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options, and management protocol for common disorders of the urinary system in domestic species.",
    "prereq": []
  },
  {
    "uid": "788145",
    "code": "CVM6461",
    "subject": "CVM",
    "number": "6461",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinician Analysis/Urinalysis",
    "fullname": "A Clinician's Analysis of Urinalysis",
    "info": "Informal, case-based, interactive, in-depth approach to evaluation of urinalyses of clinical cases recently admitted to Veterinary Teaching Hospitals. Improving observational/interpretation skills. Recognizing invitro factors that may alter results of urinalyses.prereq: 3rd yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "788217",
    "code": "CVM6464",
    "subject": "CVM",
    "number": "6464",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Urinary System Disorders",
    "fullname": "Small Animal Urinary System Disorders: Case Based Discussion",
    "info": "Expands on disorders of small animal urinary system. Core/additional disorders.prereq: [DVM 3rd or 4th yr] or instr consent",
    "prereq": []
  },
  {
    "uid": "014547",
    "code": "CVM6470",
    "subject": "CVM",
    "number": "6470",
    "honors": false,
    "writingIntensive": false,
    "name": "Multisystemic Dis",
    "fullname": "Multisystemic Diseases",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options, and management protocol of disorders of the immunologic and hematologic systems and of multisystemic infectious diseases.",
    "prereq": []
  },
  {
    "uid": "796919",
    "code": "CVM6471",
    "subject": "CVM",
    "number": "6471",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Problems",
    "fullname": "Problems in Small Animal Medicine",
    "info": "Problem-based approach to clinical problems in dogs/cats.  Logical, structured approach to problems. Interpretation of laboratory results. Discussion, weekly self-assessment quiz, in-class work on next case.",
    "prereq": []
  },
  {
    "uid": "803315",
    "code": "CVM6472",
    "subject": "CVM",
    "number": "6472",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Infectious Diseases",
    "fullname": "Small Animal Infectious Diseases",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options, and management protocol of disorders of multisystemic infectious diseases of dogs and cats.",
    "prereq": []
  },
  {
    "uid": "803316",
    "code": "CVM6473",
    "subject": "CVM",
    "number": "6473",
    "honors": false,
    "writingIntensive": false,
    "name": "LA Infectious Diseases",
    "fullname": "Large Animal Infectious Diseases",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options, and management protocol of disorders of multisystemic infectious diseases of ruminants and horses.",
    "prereq": []
  },
  {
    "uid": "803317",
    "code": "CVM6474",
    "subject": "CVM",
    "number": "6474",
    "honors": false,
    "writingIntensive": false,
    "name": "Hemato & Immunologic Disorders",
    "fullname": "Hematologic and Immunologic Disorders",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options, and management protocol of disorders of immunologic/hematologic systems.",
    "prereq": []
  },
  {
    "uid": "014548",
    "code": "CVM6480",
    "subject": "CVM",
    "number": "6480",
    "honors": false,
    "writingIntensive": false,
    "name": "Obstetrics",
    "fullname": "Obstetrics",
    "info": "Diagnosis/management of reproductive diseases.",
    "prereq": []
  },
  {
    "uid": "788871",
    "code": "CVM6481",
    "subject": "CVM",
    "number": "6481",
    "honors": false,
    "writingIntensive": false,
    "name": "Obstetrics Lab",
    "fullname": "Obstetrics Lab",
    "info": "Techniques for pregnancy diagnosis, obstetric manipulation in large animal species.",
    "prereq": []
  },
  {
    "uid": "013022",
    "code": "CVM6482",
    "subject": "CVM",
    "number": "6482",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Therio",
    "fullname": "Small Animal Theriogenology",
    "info": "Normal/abnormal reproduction in dogs/cats. Dystocia management. Diagnosis/treatment of reproductive tract disease. Exotics.prereq: 3rd yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "792721",
    "code": "CVM6483",
    "subject": "CVM",
    "number": "6483",
    "honors": false,
    "writingIntensive": false,
    "name": "Repro Diagnostic Techniques",
    "fullname": "Theriogenology Diagnostic Techniques",
    "info": "Obstetric manipulation in domestic species.prereq: 3rd yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "812288",
    "code": "CVM6491",
    "subject": "CVM",
    "number": "6491",
    "honors": false,
    "writingIntensive": false,
    "name": "Avian Core",
    "fullname": "Avian Core",
    "info": "Avian nutrition, physiology, anatomy, and disease.Prereq-DVM or instr consent.",
    "prereq": []
  },
  {
    "uid": "825332",
    "code": "CVM6493",
    "subject": "CVM",
    "number": "6493",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Terminology",
    "fullname": "Medical Terminology",
    "info": "This course is intended for first year DVM students.  We will use a system approach to the study of Medical Terminology. Essential word parts and terms will be presented in the context of basic anatomy, physiology, and disease conditions giving students tools to immediately apply new terminology to practical clinical situations. Most of the course requirements will be completed independently, and assessment will be through online quizzes and case studies. Self-motivation will be necessary to be successful in the course.  The instructors will do their best to make the material interesting, to connect the content you will learn in other courses (especially Anatomy and Physiology) and to focus on generalized patterns and ways of learning and using medical terminology.",
    "prereq": []
  },
  {
    "uid": "788218",
    "code": "CVM6494",
    "subject": "CVM",
    "number": "6494",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Anesthesia Adv Block",
    "fullname": "Small Animal Anesthesia Advanced Block Core",
    "info": "Sedative techniques, combination injectable anesthesia, pediatric/geriatric small animal anesthesia, pain control, regional techniques, anesthesia in trauma cases, complications in anesthesia, ventilator use.prereq: 3rd yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "788146",
    "code": "CVM6495",
    "subject": "CVM",
    "number": "6495",
    "honors": false,
    "writingIntensive": false,
    "name": "Non-Traditional Pet Core",
    "fullname": "Non-Traditional Pet Core",
    "info": "General/reproductive biology, behavior, husbandry, nutrition, handling, restraint, anesthesia. Common diseases, their treatments. Research animal issues. Special considerations of species commonly encountered in small/mixed animal practices (mice, rats, hamsters, gerbils, guinea pigs, chinchillas, rabbits, ferrets, basic aquarium species).prereq: 3rd yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "788147",
    "code": "CVM6496",
    "subject": "CVM",
    "number": "6496",
    "honors": false,
    "writingIntensive": false,
    "name": "Non-Domestic/Zoo Elective",
    "fullname": "Non-Domestic/Zoo Elective",
    "info": "Basic biology, behavior, husbandry, nutrition, handling, restraint, immobilization, anesthesia. Common diseases, treatments. Special considerations of monkeys, reptiles, zoo hoofstock/carnivores, aquarium fish, Minnesota wildlife, misc (e.g., hedgehogs, sugar gliders).",
    "prereq": []
  },
  {
    "uid": "788148",
    "code": "CVM6497",
    "subject": "CVM",
    "number": "6497",
    "honors": false,
    "writingIntensive": false,
    "name": "Avian/Exotic Medicine/Surgery",
    "fullname": "Avian and Exotic Medicine and Surgery",
    "info": "Bacterial, viral, fungal, parasitic diseases of companion birds. Caged birds, psittacines, raptors, racing pigeons, waterfowl. Behavioral components of common management problems (screaming, biting, feather picking, pathological bonding). Clinical methods of capture and restraint, anesthesia, radiology. Collecting samples for lab analysis. Overview of problems managed surgically.",
    "prereq": []
  },
  {
    "uid": "788149",
    "code": "CVM6498",
    "subject": "CVM",
    "number": "6498",
    "honors": false,
    "writingIntensive": false,
    "name": "FA & Exotic LA Anesthesia",
    "fullname": "Food Animal and Exotic Large Animal Anesthesia",
    "info": "Restraint, sedation, immobilization of ruminants/pigs. Regional techniques, special considerations for anesthesia. Injectable food animal anesthesia, anesthesia of llamas, ostriches, elk, other exotic large animal species.",
    "prereq": []
  },
  {
    "uid": "790429",
    "code": "CVM6500",
    "subject": "CVM",
    "number": "6500",
    "honors": false,
    "writingIntensive": false,
    "name": "Animal, Public & Ecosys Health",
    "fullname": "Animal, Public, and Ecosystem Health",
    "info": "Emphasize interactions with public health, policy, and regulatory partners to provide a basic understanding of the essential roles veterinarians play in public health, disease control, food safety, and ecosystem health.prereq: DVM 3rd or 4th yr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "794686",
    "code": "CVM6501",
    "subject": "CVM",
    "number": "6501",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary PubH: Current Topic",
    "fullname": "Advanced Veterinary Public Health: Current Topics",
    "info": "Systems used to raise livestock/poultry, deliver through markets to slaughter or processing facilities, and deliver to consumers. Methods to assess/mitigate risks. Emphasizes public health/food safety issues. Field trips, problem solving, assignments.prereq: DVM or MPH or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "013130",
    "code": "CVM6502",
    "subject": "CVM",
    "number": "6502",
    "honors": false,
    "writingIntensive": false,
    "name": "Necropsy",
    "fullname": "Necropsy",
    "info": "Students perform necropsies, collect tissues for lab analysis, interpret clinicopathologic findings, prepare reports on animals submitted to Veterinary Diagnostic Lab, apply basic/clinical science to diseases for animals and populations of animals. Students may participate in history taking. Case findings discussed daily. Student groups present case reports at weekly departmental seminar.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "806003",
    "code": "CVM6503",
    "subject": "CVM",
    "number": "6503",
    "honors": false,
    "writingIntensive": false,
    "name": "Exotic Animal  Necropsy",
    "fullname": "Exotic Animal Necoropsy Rotation",
    "info": "Zoo/wildlife pathology service similar to required necropsy rotation (CVM 6502). Perform necropsies of incoming cases of \"nontraditional\" animals. Write report and after discussion with faculty member chose appropriate additional tests. Perform histologic evaluation of selected organs. Small projects pertaining to exotic animal pathology (and medicine). Present during lab's Thursday seminar series.",
    "prereq": []
  },
  {
    "uid": "804957",
    "code": "CVM6504",
    "subject": "CVM",
    "number": "6504",
    "honors": false,
    "writingIntensive": false,
    "name": "CVM Remediation",
    "fullname": "Remediation course.",
    "info": "Remediation course.",
    "prereq": []
  },
  {
    "uid": "014549",
    "code": "CVM6505",
    "subject": "CVM",
    "number": "6505",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics course",
    "fullname": "Topics course",
    "info": "Topics Course",
    "prereq": []
  },
  {
    "uid": "790658",
    "code": "CVM6506",
    "subject": "CVM",
    "number": "6506",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Studies: Large Animal Med",
    "fullname": "Directed Studies in Large Animal Medicine (DistL)",
    "info": "Students, under guidance of a faculty member, conduct a special project addressing an issue in large animal medicine. Project proposals include hypothesis, objectives, plan of study, and product for evaluation by adviser and approval by the College of Veterinary Medicine's curriculum committee.prereq: DVM 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "790659",
    "code": "CVM6507",
    "subject": "CVM",
    "number": "6507",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies - SA",
    "fullname": "Directed Studies in Small Animal Medicine (DistS)",
    "info": "Students, under guidance of a faculty member, conduct special project addressing an issue in small animal medicine. Project proposals include hypothesis, objectives, plan of study, and product for evaluation by adviser and approval by CVM's curriculum committee.prereq: DVM 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "790660",
    "code": "CVM6508",
    "subject": "CVM",
    "number": "6508",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies -Pathobiology",
    "fullname": "Directed Studies: Pathobiology (DiStB)",
    "info": "Students, under guidance of a faculty member, conduct special project addressing an issue in veterinary pathobiology. Project proposals include hypothesis, objectives, plan of study, and product for evaluation by adviser and approval by CVM's curriculum committee.prereq: DVM 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "790661",
    "code": "CVM6509",
    "subject": "CVM",
    "number": "6509",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies - DiSt",
    "fullname": "Directed Studies: (DiSt)",
    "info": "Students, under guidance of a faculty member, conduct special project addressing an issue in diagnostic medicine. Project proposals include hypothesis, objectives, plan of study, and product for evaluation by faculty adviser and approval by CVM's curriculum committee.prereq: DVM 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "793920",
    "code": "CVM6510",
    "subject": "CVM",
    "number": "6510",
    "honors": false,
    "writingIntensive": false,
    "name": "PHP",
    "fullname": "MPH Project: PHP",
    "info": "Directed field research. Original or secondary analysis of data sets related to public health practice.prereq: DVM student or instr consent",
    "prereq": []
  },
  {
    "uid": "806001",
    "code": "CVM6511",
    "subject": "CVM",
    "number": "6511",
    "honors": false,
    "writingIntensive": false,
    "name": "Exotic Animal Medicine",
    "fullname": "Exotic Animal Medicine Rotation",
    "info": "Develop knowledge/technical skills to manage common exotic pets through case-based examples, lectures, and labs. Two days a week in a field setting of choice from the following (DNR, Raptor Center, Wildlife Rehabilitation Center, Como Zoo, MN Zoo, private practices with an exotic case load).",
    "prereq": []
  },
  {
    "uid": "806002",
    "code": "CVM6512",
    "subject": "CVM",
    "number": "6512",
    "honors": false,
    "writingIntensive": false,
    "name": "Zoo and Wildlife Rounds",
    "fullname": "Zoo and Wildlife Rounds",
    "info": "Zoo, wildlife, and exotic pet conservation. Seminars involving topics of exotic animal conservation, medicine, and pathology encountered at Minnesota, Como, and Lake Superior zoos; Raptor Center; and Minnesota Veterinary Diagnostic Laboratory. Basic biology of the affected animals, clinical aspects, and pathology of encountered diseases. Apply principles of basic/clinical science to address the cause of disease for individual animals as well as populations of&#32;animals.",
    "prereq": []
  },
  {
    "uid": "806578",
    "code": "CVM6513",
    "subject": "CVM",
    "number": "6513",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change & Agriculture",
    "fullname": "Topics on Climate Change and Agriculture",
    "info": "Science of climate change, role of agriculture and steps that are being taken to mitigate effects. Readings/discussions on a series of topics including, evidence for climate change, policy actions, carbon credits, soil sequestration, role of livestock, anaerobic digesters, and carbon footprint.",
    "prereq": []
  },
  {
    "uid": "810434",
    "code": "CVM6514",
    "subject": "CVM",
    "number": "6514",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies - FA",
    "fullname": "Directed Studies in Food Animal Medicine (DistFA)",
    "info": "Conduct special project addressing issue in food animal medicine under guidance of faculty member. Project proposals include hypothesis, objectives, plan of study, product for evaluation by adviser/approval by CVM's curriculum committee.",
    "prereq": []
  },
  {
    "uid": "014551",
    "code": "CVM6515",
    "subject": "CVM",
    "number": "6515",
    "honors": false,
    "writingIntensive": false,
    "name": "Externship",
    "fullname": "Externship (Extern)",
    "info": "Students spend two weeks/rotation in a practice or other professional setting.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "793921",
    "code": "CVM6516",
    "subject": "CVM",
    "number": "6516",
    "honors": false,
    "writingIntensive": false,
    "name": "Field-PHP",
    "fullname": "Field Experience in Public Health Practice",
    "info": "Directed field experience or clinical rotation/practicum in selected community or public health agencies/institutions. Integration of knowledge/skills in population science for public health.prereq: DVM student or instr consent",
    "prereq": []
  },
  {
    "uid": "794844",
    "code": "CVM6517",
    "subject": "CVM",
    "number": "6517",
    "honors": false,
    "writingIntensive": false,
    "name": "Ext Rotation-Pub Vet Practice",
    "fullname": "External Rotation in Public Veterinary Practice",
    "info": "Directed field experience or clinical rotation/practicum in selected public veterinary agencies/institutions. Integration of knowledge/skills in population science for public veterinary practice.",
    "prereq": []
  },
  {
    "uid": "794850",
    "code": "CVM6518",
    "subject": "CVM",
    "number": "6518",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Policy",
    "fullname": "Public Policy",
    "info": "Directed experiential learning in public policy making at state, national, or international level. Integration of knowledge/skills in animal health, public health, and food safety policy development. Travel may be required. Occurs 1st or 2nd week of January or over summer. Faculty oversee students.",
    "prereq": []
  },
  {
    "uid": "797554",
    "code": "CVM6519",
    "subject": "CVM",
    "number": "6519",
    "honors": false,
    "writingIntensive": false,
    "name": "Wildlife Rehab Center Intern",
    "fullname": "Wildlife Rehabilitation Center Summer Internship",
    "info": "Six-week summer internship (15 hr/wk) at Wildlife Rehabilitation Center. Hands-on learning in clinical medicine; avian, waterfowl, and mammal nurseries; wildlife handling and management; and wildlife rehabilitation. Final project.prereq: DVM student",
    "prereq": []
  },
  {
    "uid": "812612",
    "code": "CVM6520",
    "subject": "CVM",
    "number": "6520",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv SA Therio & Pediatrics",
    "fullname": "Advanced Small Animal Theriogenology and Pediatrics",
    "info": "On-line course consisting of individualized study and directed review of advanced topics in small animal theriogenology.",
    "prereq": []
  },
  {
    "uid": "816540",
    "code": "CVM6521",
    "subject": "CVM",
    "number": "6521",
    "honors": false,
    "writingIntensive": false,
    "name": "Avian & Exotic Medicine",
    "fullname": "Avian & Exotic Medicine",
    "info": "Develop the knowledge and technical skills needed to manage common medical and surgical issues of popular avian and exotic species.",
    "prereq": []
  },
  {
    "uid": "817110",
    "code": "CVM6522",
    "subject": "CVM",
    "number": "6522",
    "honors": false,
    "writingIntensive": false,
    "name": "RaOI Large Animal Medicine",
    "fullname": "RaOI Large Animal Medicine",
    "info": "Large Animal Medicine Rotation at another accredited veterinary college and used to met a core medicine requirement.",
    "prereq": []
  },
  {
    "uid": "815101",
    "code": "CVM6523",
    "subject": "CVM",
    "number": "6523",
    "honors": false,
    "writingIntensive": false,
    "name": "RaOI Shelter Medicine",
    "fullname": "External Shelter Medicine Rotation",
    "info": "Shelter Medicine (spay and neuter) at a external site and used to meet a core requirement.",
    "prereq": []
  },
  {
    "uid": "815121",
    "code": "CVM6524",
    "subject": "CVM",
    "number": "6524",
    "honors": false,
    "writingIntensive": false,
    "name": "RaOI Ambulatory Medicine",
    "fullname": "Ambulatory Medicine Rotation at Other Institution",
    "info": "Ambulatory Medicine at another accredited veterinary college and used to meet a core requirement.",
    "prereq": []
  },
  {
    "uid": "014552",
    "code": "CVM6525",
    "subject": "CVM",
    "number": "6525",
    "honors": false,
    "writingIntensive": false,
    "name": "Rotation at Other Institution",
    "fullname": "Rotation at Other Institution (RAOI)",
    "info": "Students to spend one-six weeks in an organized program at another degree-granting institution, in an area either not offered at the University or in one that complements experience in a clinical rotation at the University.prereq: DVM 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "798261",
    "code": "CVM6526",
    "subject": "CVM",
    "number": "6526",
    "honors": false,
    "writingIntensive": false,
    "name": "RaOI Dermatology",
    "fullname": "Dermatology Rotation at Other Institution",
    "info": "Rotation through which students may take a required dermatology course at another accredited veterinary college.prereq: DVM 3rd or 4th year or instr consent",
    "prereq": []
  },
  {
    "uid": "798262",
    "code": "CVM6527",
    "subject": "CVM",
    "number": "6527",
    "honors": false,
    "writingIntensive": false,
    "name": "RaOI Anesthesiology",
    "fullname": "Anesthesiology Rotation at Other Institution",
    "info": "Rotation offered allowing students to fulfill their anesthesiology rotation requirement at another accredited veterinary college.prereq: DVM 3rd or 4th year or instr consent",
    "prereq": []
  },
  {
    "uid": "798263",
    "code": "CVM6528",
    "subject": "CVM",
    "number": "6528",
    "honors": false,
    "writingIntensive": false,
    "name": "Radiology RAOI",
    "fullname": "Radiology Rotation at Other Institution",
    "info": "Radiology core rotation taken at another acredited veterinary college and used to meet core requirements.prereq: DVM 3rd or 4th year or instr consent",
    "prereq": []
  },
  {
    "uid": "798264",
    "code": "CVM6529",
    "subject": "CVM",
    "number": "6529",
    "honors": false,
    "writingIntensive": false,
    "name": "RaOI Large Animal Surgery",
    "fullname": "Large Animal Surgery Rotation at Other Institution",
    "info": "Equine Medicine Rotation at another accredited veterinary college and used to meet a core medicine requirement.prereq: DVM 3rd or 4th year or instr consent",
    "prereq": []
  },
  {
    "uid": "796823",
    "code": "CVM6530",
    "subject": "CVM",
    "number": "6530",
    "honors": false,
    "writingIntensive": false,
    "name": "Orientation to Clinics",
    "fullname": "Orientation to Clinical Rotations",
    "info": "Topics, issues, and procedures encountered during clinical rotations. Transition into clinics. Flow during rotations. Didactic lectures, group exercises, discussions. CVM/VMC policies/procedures, patient flow, SOAPs, discharges, admissions, ICU/wards, patient care, UVIS, client communications, infection control, safety, pharmacy, licensure,rotation expectations.prereq: 3rd yr DVM",
    "prereq": []
  },
  {
    "uid": "807558",
    "code": "CVM6531",
    "subject": "CVM",
    "number": "6531",
    "honors": false,
    "writingIntensive": false,
    "name": "Biosecurity/contaiment  for FA",
    "fullname": "Biosecurity and Biocontainment for Food Animals",
    "info": "Rotation. Biocontainment and biosecurity measures and strategies that are being used in the food animal industry (swine, poultry and dairy) to prevent the spread of disease. Hands on experience for students interested in developing biosecurity plans for farms. Pathogen transmission within and between populations, the routes of pathogen dissemination and measures and strategies used to prevent disease dissemination. Hands on biosecurity audits/develop recommendations for system improvement.",
    "prereq": []
  },
  {
    "uid": "013114",
    "code": "CVM6532",
    "subject": "CVM",
    "number": "6532",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Pathology Rotation",
    "fullname": "Clinical Pathology Rotation",
    "info": "Two week intensive rotation in veterinary clinical lab medicine. Hematology, cytology, clinical chemistry, endocrinology, microbiology. Sample submission. Lab test methodology. Didactic teaching, small group discussion, case-based/guided self-instruction, microscopy.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "790554",
    "code": "CVM6533",
    "subject": "CVM",
    "number": "6533",
    "honors": false,
    "writingIntensive": false,
    "name": "Hematology and Cytology-HemCyt",
    "fullname": "Hematology and Cytology (HemCyt)",
    "info": "Microscopic aspects of hematology/cytology in the dog, cat, cow, horse, sheep, goat, pig, and llama. Case oriented approach is used to develop pertinent pathophysiologic aspects of disease. One-week rotation.",
    "prereq": []
  },
  {
    "uid": "795734",
    "code": "CVM6534",
    "subject": "CVM",
    "number": "6534",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Clinical Pathology",
    "fullname": "Veterinary Clinical Pathology",
    "info": "Clinical pathology data generation, statistical concepts. Hematopoietic system, its evaluation using laboratory tests. Emphasizes interpretation of individual tests on biochemistry profile and how results guide diagnostic plan. Integration of clinical pathology data for a patient. How to distinguish between diseases with similar clinical or clinico-pathologic findings. Lecture, lab, small group discussion, homework.",
    "prereq": []
  },
  {
    "uid": "816790",
    "code": "CVM6535",
    "subject": "CVM",
    "number": "6535",
    "honors": false,
    "writingIntensive": false,
    "name": "RaOI LA Surgery and Lameness",
    "fullname": "RaOI Large Animal Surgery and Lameness",
    "info": "Large Animal Surgery Rotation at another accredited veterinary college and used to meet a core medicine requirement.",
    "prereq": []
  },
  {
    "uid": "818299",
    "code": "CVM6538",
    "subject": "CVM",
    "number": "6538",
    "honors": false,
    "writingIntensive": false,
    "name": "Lakefield Clinical Rotation",
    "fullname": "Lakefield Clinical Rotation",
    "info": "Managing general/clinical caseload in non-referral setting. Working with patients at Banfield, The Pet Hospital, under supervision of mentor. Managing acute/chronic cases. Client communication. Clinical skills.",
    "prereq": []
  },
  {
    "uid": "818153",
    "code": "CVM6539",
    "subject": "CVM",
    "number": "6539",
    "honors": false,
    "writingIntensive": false,
    "name": "Wellhaven",
    "fullname": "Wellhaven",
    "info": "The intent of this rotation is to provide the student with experience, instruction and supervision managing a general,clinical caseload in a non-referral, non-academic setting. The student will use knowledge gained in didactic coursework to refine their medical knowledge base. The student will be provided the opportunity to improve their clinical skills working with patients seen at a Wellhaven hospital under the supervision of an assigned Wellhaven mentor and staff.",
    "prereq": []
  },
  {
    "uid": "013246",
    "code": "CVM6540",
    "subject": "CVM",
    "number": "6540",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Toxicology",
    "fullname": "Advanced Veterinary Toxicology",
    "info": "In-depth examination of toxins.  Clinical, diagnostic, mechanistic, and therapeutic aspects of biotoxins, organic, and inorganic toxins that affect livestock, poultry, wildlife, and companion animals or that threaten public health.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "789628",
    "code": "CVM6545",
    "subject": "CVM",
    "number": "6545",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Regulatory Medicine",
    "fullname": "Introduction to Regulatory Medicine",
    "info": "Explanation of products requiring pre-market approval and those that may be marketed without approval. Post-market surveillance. Adverse reactions, removal of product from market.",
    "prereq": []
  },
  {
    "uid": "796920",
    "code": "CVM6560",
    "subject": "CVM",
    "number": "6560",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues & Opportunities in PubH",
    "fullname": "Public Health Issues and Veterinary Medicine Opportunities",
    "info": "Public health practice and veterinary medicine. Day-to-day work of public health professionals. Public health principles in context. Veterinary medicine related to public health research/practice. Students interact with advocacy groups, media, lobbyists, legislators, regulatory officials, industry leaders, and public health professionals.",
    "prereq": []
  },
  {
    "uid": "825847",
    "code": "CVM6561",
    "subject": "CVM",
    "number": "6561",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Puppy Class",
    "fullname": "Teaching Puppy Class",
    "info": "Teaching Puppy Class teaches key concepts in puppy socialization, management, and training as well as teaching key concepts about teaching and interacting with puppy owners in the setting of the UMN Puppy Classes. Students have the opportunity to practice and improve teaching skills, practice puppy-handling skills, and participate in teaching puppy classes at the CVM.",
    "prereq": []
  },
  {
    "uid": "825832",
    "code": "CVM6562",
    "subject": "CVM",
    "number": "6562",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Anesthesiology & Pain Med",
    "fullname": "Advanced Anesthesiology and Pain Medicine",
    "info": "This course will provide additional experience in veterinary anesthesiology allowing safe and confident sedation and anesthesia of clinical cases (ASA 1-3) beyond spays and neuters. The primary emphasis will be small companion animal anesthesia/analgesia; other species will be included when possible (schedule and case-load dependent). ",
    "prereq": []
  },
  {
    "uid": "014553",
    "code": "CVM6600",
    "subject": "CVM",
    "number": "6600",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Sm. Animal Practice",
    "fullname": "Advanced Small Animal Practice",
    "info": "Training beyond core in small animal and pocket pet medicine, surgery, and theriogenology, in preparation for clinical rotations.",
    "prereq": []
  },
  {
    "uid": "790555",
    "code": "CVM6601",
    "subject": "CVM",
    "number": "6601",
    "honors": false,
    "writingIntensive": false,
    "name": "Sm Animal Medicine - SAM-A",
    "fullname": "Small Animal Internal Medicine: (SAM A)",
    "info": "Primary case responsibility for wide range of clinical diseases. History taking, physical examination, problem definition, diagnostic/therapeutic plans on assigned cases. Cases typically relate to gastroenterology, urology/nephrology, oncology, neurology, immunology, and cardiology. Daily rounds. Students present case discussion topics and interpret lab data, radiographic evaluations, and biopsy information. Emphasizes effective communications with clients/referring veterinarians.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "013345",
    "code": "CVM6602",
    "subject": "CVM",
    "number": "6602",
    "honors": false,
    "writingIntensive": false,
    "name": "Sm Animal Medicine - SAM-B",
    "fullname": "Small Animal Internal Medicine: (SAM B)",
    "info": "Problem-solving skills, clinical skills, communication skills, record keeping, ethical issues in referral cases. Methods of knowledge acquisition, including computerized searches and diagnostic programs. Small group rounds discussions.  Students assist clinicians in management of referral/emergency cases. Cases typically related to gastroenterology, nephrology, urology, oncology, nutrition, neurology, and cardiology.prereq: [6601, [DVM 3rd or 4th yr]] or instr consent",
    "prereq": {
      "code": "CVM 6601",
      "subject": "CVM",
      "id": "6601"
    }
  },
  {
    "uid": "790556",
    "code": "CVM6603",
    "subject": "CVM",
    "number": "6603",
    "honors": false,
    "writingIntensive": false,
    "name": "Sm Animal Medicine - SAM-C",
    "fullname": "Small Animal Internal Medicine: C",
    "info": "Students work with internal medicine clinical specialists in VMC, assisting with receiving, patient care, work-ups, and client communication. Students provide patient care on evenings/weekends for hospitalized patients, similar to cases assigned in SAM. High volume rotation.",
    "prereq": []
  },
  {
    "uid": "790717",
    "code": "CVM6604",
    "subject": "CVM",
    "number": "6604",
    "honors": false,
    "writingIntensive": false,
    "name": "Sm Animal Medicine - SAM-D",
    "fullname": "Small Animal Internal Medicine: (SAM D)",
    "info": "Problem solving, history taking, physical examination, record keeping. Ethical issues in managing referral cases. Computerized searches, diagnostic programs. Students help clinicians manage referral/emergency cases related to gastroenterology, nephrology, urology, oncology, nutrition, neurology, and cardiology. Small group discussions.",
    "prereq": []
  },
  {
    "uid": "801503",
    "code": "CVM6605",
    "subject": "CVM",
    "number": "6605",
    "honors": false,
    "writingIntensive": false,
    "name": "Banfield Clinical Rotation",
    "fullname": "Banfield Clinical Rotation",
    "info": "Managing general/clinical caseload in non-referral setting. Working with patients at Banfield, The Pet Hospital, under supervision of mentor. Managing acute/chronic cases. Client communication. Clinical skills.",
    "prereq": []
  },
  {
    "uid": "013340",
    "code": "CVM6606",
    "subject": "CVM",
    "number": "6606",
    "honors": false,
    "writingIntensive": false,
    "name": "Emergency Rotation (Emer)",
    "fullname": "Emergency Rotation",
    "info": "Evening/weekend ER service, day ER service. Medical/surgical emergency/traumatic cases.  Students assist staff clinicians/interns in diagnosis and case management. Triage, history taking, physical exams, clinical problem solving, patient management. Students give presentation on a case they were involved in within rotation.",
    "prereq": []
  },
  {
    "uid": "825585",
    "code": "CVM6607",
    "subject": "CVM",
    "number": "6607",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Imaging Methods",
    "fullname": "Introduction to MRI, CT, and PET Imaging Methods",
    "info": "Two week didactic rotation where students will be introduced to magnetic resonance imaging  (MRI), computed tomography (CT), and positron emission tomography (PET) imaging methods.",
    "prereq": []
  },
  {
    "uid": "013338",
    "code": "CVM6608",
    "subject": "CVM",
    "number": "6608",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Care (CritC)",
    "fullname": "Critical Care",
    "info": "Primary case care for ICU patients. Some emergency receiving. Daily rounds, including case discussion and critical care topics. Limited case care responsibility, including SOAPs and treatment orders on existing patients. Students present a short rounds discussion on critical care topic of their choice.",
    "prereq": []
  },
  {
    "uid": "803543",
    "code": "CVM6609",
    "subject": "CVM",
    "number": "6609",
    "honors": false,
    "writingIntensive": false,
    "name": "Emergency/Critical Care",
    "fullname": "Emergency/Critical Care (ECC)",
    "info": "Emergency/critical-care cases in small animal practice or emergency practice. History taking, physical exams. Creating problem lists, proposing diagnostic/therapeutic plans.prereq: Sr",
    "prereq": []
  },
  {
    "uid": "807559",
    "code": "CVM6610",
    "subject": "CVM",
    "number": "6610",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Dentistry & Oral Sx",
    "fullname": "Small Animal Dentistry and Oral Surgery Elective",
    "info": "Small animal dentistry and oral surgery (primarily canine and feline, but includes exotic animal dentistry) Clinical recognition, diagnosis, assessment, and treatment of dental, oral, and maxillofacial pathology common to small animal clinical practice. Didactic lectures, laboratory teaching, small group learning exercises, and critical overview of published literature (that will be utilized in the group case presentations). Feline oral surgery; noninvasive maxillofacial fracture repair techniques. Critical grading on surgical procedures.",
    "prereq": []
  },
  {
    "uid": "807710",
    "code": "CVM6611",
    "subject": "CVM",
    "number": "6611",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Dentistry Elective",
    "fullname": "Equine Dentistry Elective",
    "info": "Equine dental disorders for the equine or mixed animal practitioner. Oral health maintenance in horses and diagnosis of dental disorders. ",
    "prereq": []
  },
  {
    "uid": "825602",
    "code": "CVM6612",
    "subject": "CVM",
    "number": "6612",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Puppy class",
    "fullname": "Teaching Puppy class",
    "info": "Class is offered to 2nd year students in the spring who receive a \"K\" grade and finish the class in summer. Class is also offered in the fall for 3rd year students who receive a \"K\" grade and finish the class the following spring",
    "prereq": []
  },
  {
    "uid": "014518",
    "code": "CVM6626",
    "subject": "CVM",
    "number": "6626",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Orthopedics",
    "fullname": "Small Animal Orthopedics (ORTHO)",
    "info": "Small animal orthopedic problems and surgical procedures to correct them.",
    "prereq": []
  },
  {
    "uid": "789427",
    "code": "CVM6630",
    "subject": "CVM",
    "number": "6630",
    "honors": false,
    "writingIntensive": false,
    "name": "Behavior",
    "fullname": "Behavior",
    "info": "Students participate in behavior consultations: history taking, diagnosis, outline of treatment protocols, sample collection, demonstration of training techniques, writing of treatment plans, case follow-up. Students present one case, prepare one topic of their choice for presentation during rounds. Daily rounds include discussion of cases, review of behavior-related articles, discussion of problem complexes.prereq: DVM [3rd or 4th yr] or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "013339",
    "code": "CVM6632",
    "subject": "CVM",
    "number": "6632",
    "honors": false,
    "writingIntensive": false,
    "name": "Dermatology",
    "fullname": "Dermatology (Derm)",
    "info": "Routine dermatologic problems in companion animal practice. History taking, clinical diagnosis, patient management, client education. Students participate in all phases of diagnosis/management of cases. Small-group discussions.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "013344",
    "code": "CVM6634",
    "subject": "CVM",
    "number": "6634",
    "honors": false,
    "writingIntensive": false,
    "name": "Ophthalmology",
    "fullname": "Ophthalmology",
    "info": "Entry-level ophthalmology. Diagnosis, treatment. Outside readings, review papers, final essay exam.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "013094",
    "code": "CVM6636",
    "subject": "CVM",
    "number": "6636",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardiology",
    "fullname": "Cardiology",
    "info": "Clinical problem solving. Cases of cardiopulmonary disease, including canine/feline congenital heart disease, acquired valvular/myocardial disease, dirofilariasis, arrhythmias, pulmonary disorders. Hands-on experience in conducting physical exams, recording electrocardiograms/echocardiograms, and reading thoracic radiographs. Group discussions, rounds.prereq: DVM 4th yr or CVM grad or instr consent",
    "prereq": []
  },
  {
    "uid": "013346",
    "code": "CVM6640",
    "subject": "CVM",
    "number": "6640",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Anml Nutrition",
    "fullname": "Clinical Companion Animal Nutrition",
    "info": "Companion-animal clinical nutrition. Pet food industry. Using label information to evaluate different brands of food. Nutritional requirements of normal dogs and cats. Guidelines for answering client questions about nutrition.  Nutritional management of selected diseases and therapeutic diet options.  Enteral and parenteral methods of nutritional support. Nutritional plans for companion animals with various diseases.",
    "prereq": []
  },
  {
    "uid": "014554",
    "code": "CVM6644",
    "subject": "CVM",
    "number": "6644",
    "honors": false,
    "writingIntensive": false,
    "name": "Primary Care A",
    "fullname": "Primary Care A",
    "info": "Students manage their own cases including developing diagnostic, treatment, and preventive health maintenance plans for each patient, performing routine medical and surgical procedures, and conducting client communication and education. Wide variety of cases.",
    "prereq": []
  },
  {
    "uid": "792583",
    "code": "CVM6645",
    "subject": "CVM",
    "number": "6645",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Aspects of Vet Prac",
    "fullname": "Business Aspects of Veterinary Practice",
    "info": "Human resources issues, supervision, use of Myers-Briggs, finance, customer service, conflict management, marketing. Real-world studies. Case studies, primarily from Veterinary Medical Center. Lectures, small group work.",
    "prereq": []
  },
  {
    "uid": "792584",
    "code": "CVM6646",
    "subject": "CVM",
    "number": "6646",
    "honors": false,
    "writingIntensive": false,
    "name": "Practice Readiness II",
    "fullname": "Practice Readiness II: External Rotation",
    "info": "Builds on concepts/principles from Practice Readiness I. Principles of \"best practices\" for wellness care for small animals. Communication skills, leadership/business practices in progressive small animal hospitals. External rotation at small-animal practices in metro area.",
    "prereq": []
  },
  {
    "uid": "013343",
    "code": "CVM6647",
    "subject": "CVM",
    "number": "6647",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Oncology",
    "fullname": "Clinical Oncology",
    "info": "Receive oncology referrals from local veterinarians. Assist in treatment decisions and therapeutic options for new cases; manage ongoing chemotherapy/radiation therapy patients. Basic principles of oncology and patient care.",
    "prereq": []
  },
  {
    "uid": "013342",
    "code": "CVM6648",
    "subject": "CVM",
    "number": "6648",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv  Clinical Oncology",
    "fullname": "Advanced Clinical Oncology Rotation",
    "info": "Case management, self-directed research. Students receive oncology referrals, work with emergency cases and special procedures, assist in treatment decisions and therapeutic options for new cases, and manage ongoing chemotherapy/radiation therapy patients. Emphasizes principles of oncology and patient care.prereq: DVM 3rd or 4th yr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "816541",
    "code": "CVM6649",
    "subject": "CVM",
    "number": "6649",
    "honors": false,
    "writingIntensive": false,
    "name": "Primary Care B",
    "fullname": "Primary Care B",
    "info": "Students manage their own cases including developing diagnostic, treatment, and preventive health maintenance plans for each patient, performing routine medical and surgical procedures, and conducting client communication and education. Wide variety of cases.",
    "prereq": []
  },
  {
    "uid": "016831",
    "code": "CVM6651",
    "subject": "CVM",
    "number": "6651",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Ultrasound",
    "fullname": "Small Animal Ultrasound",
    "info": "Students practice routine abdominal ultrasound. Principles for interpretation of exam. Learning through use of clinical caseload. Daily practice of particular ultrasound skills. Students scan clinical patients and interpret radiographic procedures as needed.prereq: [3rd or 4th] yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "016832",
    "code": "CVM6661",
    "subject": "CVM",
    "number": "6661",
    "honors": false,
    "writingIntensive": false,
    "name": "Neurology",
    "fullname": "Neurology",
    "info": "Medical/surgical neurology. Providing complete neurological service for clients, patients, and hospital. Integration into all aspects of service, including receiving, work up, surgery, care, communications, and discharges.prereq: 3rd or 4th yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "013025",
    "code": "CVM6662",
    "subject": "CVM",
    "number": "6662",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Anesthesiology",
    "fullname": "Comparative Anesthesiology (Anes)",
    "info": "Practical experience in sedating/anesthetizing routine clinical cases.  Previously taught lab protocols/techniques are used in healthy normal clinical cases and adapted for high risk cases. Emphasizes problem solving in formulation of anesthetic plans, management of patients under anesthesia, team work, and pain management.prereq: DVM 3rd or 4th yr",
    "prereq": []
  },
  {
    "uid": "013347",
    "code": "CVM6663",
    "subject": "CVM",
    "number": "6663",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Surgery",
    "fullname": "SA Surgery",
    "info": "Diagnostic/therapeutic management of surgical patients. History taking, physical examination, communication, problem solving, and surgical techniques. Economic issues. Students work as part of a surgical service team with faculty member, resident, and intern.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "013341",
    "code": "CVM6664",
    "subject": "CVM",
    "number": "6664",
    "honors": false,
    "writingIntensive": false,
    "name": "UMN Spay and Neuter",
    "fullname": "University of Minnesota: Spay and Neuter (UMSN)",
    "info": "Elective surgeries such as ovariohysterectomies, neuters, and declaws for small animals. Two-student teams are responsible for pre-surgical evaluation, anesthesia induction/maintenance, surgical procedure, and post-operative care of animals supplied by Humane Society for Companion Animals.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "799721",
    "code": "CVM6665",
    "subject": "CVM",
    "number": "6665",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Rehab",
    "fullname": "Small Animal Physical Rehabilitation",
    "info": "Students work closely with veterinary technician and physical therapist who are certified canine rehabilitation practitioners. Evaluating a patient to determine a rehabilitation problem list. Establishing treatment goals. Application of basic physical modalities, proper passive range of motion, beginning therapeutic exercises. Students develop treatment goals and plan for one orthapedic and one neurologic case.",
    "prereq": []
  },
  {
    "uid": "014497",
    "code": "CVM6666",
    "subject": "CVM",
    "number": "6666",
    "honors": false,
    "writingIntensive": false,
    "name": "Sp. Proc. Vet. Rad.",
    "fullname": "Special Procedures in Veterinary Radiology",
    "info": "Contrast agents and procedures used to examine various body systems or anatomical areas.prereq: DVM 3rd or 4th yr or grad or instr consent",
    "prereq": []
  },
  {
    "uid": "013189",
    "code": "CVM6668",
    "subject": "CVM",
    "number": "6668",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Radiology",
    "fullname": "Small Animal Radiology (RAD)",
    "info": "Making high quality radiographs. Students practice routine and special procedures. Principles for interpretation. Exposure to CT and MRI. Daily radiographic interpretation in small animal species. Issues related to radiation protection.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "798266",
    "code": "CVM6669",
    "subject": "CVM",
    "number": "6669",
    "honors": false,
    "writingIntensive": false,
    "name": "Radiology: MIxed Animal",
    "fullname": "Radiology: Mixed Animal",
    "info": "Making high-quality radiographs. Students practice routine and special procedures. Principles for interpretation. Exposure to CT and MRI. Daily radiographic interpretation in small animal species. Issues related to radiation protection.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "804187",
    "code": "CVM6681",
    "subject": "CVM",
    "number": "6681",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Small Animal Therio",
    "fullname": "Advanced Small Animal Theriogenology",
    "info": "Non-core small animal theriogenology topics. Online course.",
    "prereq": []
  },
  {
    "uid": "013356",
    "code": "CVM6682",
    "subject": "CVM",
    "number": "6682",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Therio",
    "fullname": "Small Animal Theriogenology (SATh)",
    "info": "Breeding management, artificial insemination, semen collection/evaluation, dystocia management. Testing for canine brucellosis, pyometra, vaginitis, and prostate disease. Interactive review sessions, case studies, client cases.  Students present review of a \"theriogenology question of the month\" from JAVMA and present study on reproduction topic of choice.",
    "prereq": []
  },
  {
    "uid": "789647",
    "code": "CVM6685",
    "subject": "CVM",
    "number": "6685",
    "honors": false,
    "writingIntensive": false,
    "name": "SA Repro Diagnostic Lab",
    "fullname": "Small Animal Reproductive Diagnostic Laboratory",
    "info": "Hands-on clinical experience in the evaluation of small animal reproduction. Two three-hour labs, several projects.",
    "prereq": []
  },
  {
    "uid": "016839",
    "code": "CVM6690",
    "subject": "CVM",
    "number": "6690",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Medicine",
    "fullname": "Integrative Medicine",
    "info": "History/principles of acupuncture, chiropractic, and other commonly used complementary approaches to care of domestic animals. Training requirements for certification. Lectures, case examples, demonstrations.prereq: 2nd yr DVM student or instr consent",
    "prereq": []
  },
  {
    "uid": "794035",
    "code": "CVM6691",
    "subject": "CVM",
    "number": "6691",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Acupuncture",
    "fullname": "Veterinary Acupuncture (AcPunct)",
    "info": "Basic veterinary acupuncture theory, point combination, treatment, diagnosis of diseases, hands-on veterinary acupuncture technique.prereq: [6690, [yr 3 or 4 DVM]] or instr consent",
    "prereq": {
      "code": "CVM 6690",
      "subject": "CVM",
      "id": "6690"
    }
  },
  {
    "uid": "788066",
    "code": "CVM6700",
    "subject": "CVM",
    "number": "6700",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Track Block",
    "fullname": "Advanced Track Block",
    "info": "Preparation for senior rotations.",
    "prereq": []
  },
  {
    "uid": "789648",
    "code": "CVM6702",
    "subject": "CVM",
    "number": "6702",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Palpation Labs",
    "fullname": "Large Animal Palpation Labs",
    "info": "Hands-on clinical experiences in equine, bovine, or large animal reproductive status/disorders. Students select species.prereq: DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "014555",
    "code": "CVM6704",
    "subject": "CVM",
    "number": "6704",
    "honors": false,
    "writingIntensive": false,
    "name": "Repro Diseases of Cattle",
    "fullname": "Reproductive Diseases of Cattle",
    "info": "Common diseases affecting reproductive function in cattle, swine, and small ruminants.prereq: 3rd yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "797179",
    "code": "CVM6706",
    "subject": "CVM",
    "number": "6706",
    "honors": false,
    "writingIntensive": false,
    "name": "Epidemiology & Biostatistics",
    "fullname": "Epidemiology and Biostatistics (E&B)",
    "info": "How to formulate questions, analyze problems, and develop solutions relating to food animal production systems. Excel, Access, and basic statistical programs. Design/evaluation of field trials. Epidemiology. Statistical process control. Field trips to apply data/results and consult with people in field.",
    "prereq": []
  },
  {
    "uid": "797181",
    "code": "CVM6709",
    "subject": "CVM",
    "number": "6709",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Bldg. Design",
    "fullname": "Advanced Building Design",
    "info": "Design of animal housing systems. Evaluation of operating production units. Natural/mechanical ventilation systems. Ventilation and building placement. Classroom presentations, on-farm evaluations.",
    "prereq": []
  },
  {
    "uid": "014627",
    "code": "CVM6711",
    "subject": "CVM",
    "number": "6711",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Medicine",
    "fullname": "Large Animal Medicine (LAM)",
    "info": "Medical diseases of horses, cattle, small ruminants, South American camelids, and pot bellied pigs. History taking, clinical diagnosis, patient management. Assessment of treatment responses. Clinic case material, opportunities to practice common procedures. Small group discussions on clinical diagnosis, treatment, and prevention of common medical disorders.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "800354",
    "code": "CVM6712",
    "subject": "CVM",
    "number": "6712",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine  Ambulatory Rotation",
    "fullname": "Equine Ambulatory Rotation",
    "info": "Equine ambulatory rotation meeting for two weeks performing farm calls, call backs, x-ray development, and restocking the van. Student and practitioner discuss cases as calls are being made.",
    "prereq": []
  },
  {
    "uid": "014632",
    "code": "CVM6714",
    "subject": "CVM",
    "number": "6714",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Lg An Surg",
    "fullname": "Large Animal Surgery (LAS)",
    "info": "General surgery, lameness cases. Emphasizes horses. Some cattle, small ruminants/camelids. Diagnostic/therapeutic management in hospital setting.  Cases, rounds, exercises. Students work as part of surgical team in cases ranging from routine to those requiring intensive management or advanced diagnostic/therapeutic techniques available in a referral setting.",
    "prereq": []
  },
  {
    "uid": "797919",
    "code": "CVM6715",
    "subject": "CVM",
    "number": "6715",
    "honors": false,
    "writingIntensive": false,
    "name": "LA Surgery & Lameness",
    "fullname": "Large Animal Surgery and Lameness",
    "info": "General surgery, lameness cases. Emphasizes horses. Some cattle, small ruminants/camelids. Diagnostic/therapeutic management in hospital setting. Cases, rounds, exercises. Students work as part of surgical management or advanced diagnostic/therapeutic techniques available in a referral setting.prereq: 3rd or 4th yr DVM student or instr consent",
    "prereq": []
  },
  {
    "uid": "013087",
    "code": "CVM6716",
    "subject": "CVM",
    "number": "6716",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Anesthesia",
    "fullname": "Large Animal Anesthesia (LAAN)",
    "info": "Anesthesiologists and students work as a team to determine proper anesthetic management and monitoring of events during general anesthesia.Local-anesthetic techniques. Problem solving in formulation of anesthetic plans. Management of patients under anesthesia. Emphasizes team work and pain management.",
    "prereq": []
  },
  {
    "uid": "016984",
    "code": "CVM6717",
    "subject": "CVM",
    "number": "6717",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Ultrasound",
    "fullname": "Large Animal Diagnostic Ultrasonography (LAUS)",
    "info": "Fundamentals of diagnostic ultrasound in large animal patient. Ultrasonography of equine limbs, joints, abdomen, and thorax. Ultrasound of cases within hospital as available. Dissection of equine limbs required. Students present topic of choice in large animal ultrasound and participate in general emergency duty for large animal hospital.",
    "prereq": []
  },
  {
    "uid": "016840",
    "code": "CVM6718",
    "subject": "CVM",
    "number": "6718",
    "honors": false,
    "writingIntensive": false,
    "name": "Lg Animal Practice Mentoring",
    "fullname": "Large Animal Community-based Practice Mentoring",
    "info": "Large animal veterinary practice, clinical skills. Students pair with a veterinarian and visit veterinary practice for a total of 16 hours during term.",
    "prereq": []
  },
  {
    "uid": "792585",
    "code": "CVM6720",
    "subject": "CVM",
    "number": "6720",
    "honors": false,
    "writingIntensive": false,
    "name": "Problem Solving in EQ Medicine",
    "fullname": "Problem Solving in Equine Medicine",
    "info": "Evidence-based medicine and clinical epidemiology concepts are integrated into discussion of cases. Assignments include reading of journal articles, working through case scenarios on Web CT, and answering case-based questions.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "014254",
    "code": "CVM6721",
    "subject": "CVM",
    "number": "6721",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Neonatology",
    "fullname": "Large Animal Neonatology",
    "info": "Instruction, emergency duty, practical application of principles in evaluating/treating sick equine neonates.  Seasonal participation in clinically managing hospitalized foals/periodically reviewing past cases.",
    "prereq": []
  },
  {
    "uid": "787709",
    "code": "CVM6722",
    "subject": "CVM",
    "number": "6722",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Anatomy - Equine Limb",
    "fullname": "Clinical Anatomy of the Equine Limb",
    "info": "Practical limb anatomy. Clinical cases, common surgical procedures. Special diagnostic techniques such as radiology, nerve blocks, joint injections, and ultrasound.",
    "prereq": []
  },
  {
    "uid": "014405",
    "code": "CVM6723",
    "subject": "CVM",
    "number": "6723",
    "honors": false,
    "writingIntensive": false,
    "name": "Colic Management",
    "fullname": "Colic Management",
    "info": "Principles and techniques for evaluating and treating equine colic cases.",
    "prereq": []
  },
  {
    "uid": "014448",
    "code": "CVM6724",
    "subject": "CVM",
    "number": "6724",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Colic Team",
    "fullname": "Equine Colic Team",
    "info": "Clinically managing equine colic cases and periodically reviewing past cases, success rates, and topics in related fields.",
    "prereq": []
  },
  {
    "uid": "014515",
    "code": "CVM6725",
    "subject": "CVM",
    "number": "6725",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Colic Team",
    "fullname": "Advanced Colic Team",
    "info": "Clinically managing cases and periodically reviewing past cases, success rates, and topics in related fields.  Students act as team leaders during clinical management and assist in lab exercises for 6723.",
    "prereq": []
  },
  {
    "uid": "807799",
    "code": "CVM6726",
    "subject": "CVM",
    "number": "6726",
    "honors": false,
    "writingIntensive": false,
    "name": "Develp Profound Conversations",
    "fullname": "Developing Profound Conversations",
    "info": "Enhance skills essential for effective clinician-client and interdisciplinary health care delivery, including non-verbal communication, empathy, emotional intelligence, deep listening, and mindfulness. Horses are used as a non-judgmental indicator of behavior.",
    "prereq": []
  },
  {
    "uid": "014557",
    "code": "CVM6727",
    "subject": "CVM",
    "number": "6727",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Palpation",
    "fullname": "Equine Palpation",
    "info": "Hands-on clinical experience in evaluation of equine reproductive status and reproductive disorders.prereq: DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "014558",
    "code": "CVM6728",
    "subject": "CVM",
    "number": "6728",
    "honors": false,
    "writingIntensive": false,
    "name": "Repro Diseases of the Horse",
    "fullname": "Reproductive Diseases of the Horse",
    "info": "Reproduction patterns, breeding practices, management, artificial insemination, economics of reproductive performance, and infertility in horses.prereq: DVM 3rd yr or instr consent",
    "prereq": []
  },
  {
    "uid": "820174",
    "code": "CVM6729",
    "subject": "CVM",
    "number": "6729",
    "honors": false,
    "writingIntensive": false,
    "name": "Mission Animal Hospital",
    "fullname": "Community-based External Elective Rotation- Mission Animal Hospital",
    "info": "The major emphasis of this rotation is to provide the veterinary student with experience, instruction and supervision managing a general, clinical caseload and engaging in client education in a unique non-profit, community-based setting with a focus on client communication and spectrum of care case management.",
    "prereq": []
  },
  {
    "uid": "015923",
    "code": "CVM6730",
    "subject": "CVM",
    "number": "6730",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Equine Practice Elect",
    "fullname": "Advanced Equine Practice Elective",
    "info": "Intensive course on equine medicine. Theriogenology content/skills beyond core.",
    "prereq": []
  },
  {
    "uid": "788219",
    "code": "CVM6731",
    "subject": "CVM",
    "number": "6731",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Eq Elec: Surg Supplement",
    "fullname": "Advanced Equine Practice Elective: Surgical Supplement",
    "info": "Equine medicine, surgery, theriogenology content/skills beyond core, necessary for entering predominately equine practice. Intensive lab.",
    "prereq": []
  },
  {
    "uid": "016833",
    "code": "CVM6732",
    "subject": "CVM",
    "number": "6732",
    "honors": false,
    "writingIntensive": false,
    "name": "Eq Den & Preventative Med",
    "fullname": "Equine Dentistry and Preventative Medicine",
    "info": "Two-week rotation on dental health care and general preventative health care for horses. Field trips, presentations, labs, case studies, clinical cases.prereq: 3rd or 4th yr DVM or instr consent; intended for equine track or mixed track students",
    "prereq": []
  },
  {
    "uid": "805929",
    "code": "CVM6733",
    "subject": "CVM",
    "number": "6733",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Dentistry and Nutrition",
    "fullname": "Equine Dentistry and Nutrition",
    "info": "Equine dentistry and practical abilities for diagnosis/treatment of dental disorders. Equine nutrition and the practical application of common nutrition related health problems. Lectures, hands on activities, group work, and case correlates. ",
    "prereq": []
  },
  {
    "uid": "013261",
    "code": "CVM6734",
    "subject": "CVM",
    "number": "6734",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Surgery",
    "fullname": "Equine Surgery",
    "info": "Basic surgical principles relating to horses. History taking, diagnostics. Development of therapeutic plan from surgical standpoint.",
    "prereq": []
  },
  {
    "uid": "014633",
    "code": "CVM6736",
    "subject": "CVM",
    "number": "6736",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Lameness and Podiatry",
    "fullname": "Equine Lameness and Podiatry",
    "info": "Rotation introduces diagnosis/treatment of equine lameness/hoof disorders. Clinical cases, presentations, case studies, labs.prereq: Intended for equine track or mixed track students",
    "prereq": []
  },
  {
    "uid": "804263",
    "code": "CVM6737",
    "subject": "CVM",
    "number": "6737",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Sports Medicine",
    "fullname": "Equine Sports Medicine",
    "info": "Equine lameness and podiatry. Develop lameness and evaluation skills. Diagnostic principles for identifying lameness. Medical, surgical and rehabilitation therapies available to treat lameness. Didactic material, labs, and clinical cases.prereq: 6736",
    "prereq": {
      "code": "CVM 6736",
      "subject": "CVM",
      "id": "6736"
    }
  },
  {
    "uid": "014634",
    "code": "CVM6738",
    "subject": "CVM",
    "number": "6738",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Podiatry",
    "fullname": "Equine Podiatry (EPod)",
    "info": "Concepts of equine podiatry. Anatomy and physiology of foot and hoof. Labs to provide experience supporting lessons learned in lectures. Disease seminars and discussion of actual cases. Labs introducing basic techniques and methods of treatment for injuries.",
    "prereq": []
  },
  {
    "uid": "820505",
    "code": "CVM6739",
    "subject": "CVM",
    "number": "6739",
    "honors": false,
    "writingIntensive": false,
    "name": "Prof Dev in Clinical Training",
    "fullname": "Professional Development in Clinical Training",
    "info": "Students will complete valuable work including writing manuscripts for publication, completing research work toward an advanced degree, achieving certifications (Fear Free handling, Beef Quality assurance), taking courses not available in our curriculum (aquaculture, Spanish for veterinarians), and preparing for NAVLE. ",
    "prereq": []
  },
  {
    "uid": "801143",
    "code": "CVM6741",
    "subject": "CVM",
    "number": "6741",
    "honors": false,
    "writingIntensive": false,
    "name": "Eq Lameness & Podiatry",
    "fullname": "Equine Lameness and Podiatry",
    "info": "Rotation introduces diagnosis/treatment of equine lameness/hoof disorders. Clinical cases, didactic presentations, case studies, labs.",
    "prereq": []
  },
  {
    "uid": "801145",
    "code": "CVM6742",
    "subject": "CVM",
    "number": "6742",
    "honors": false,
    "writingIntensive": false,
    "name": "Eq Sports & Rehab Medicine",
    "fullname": "Equine Sports and Rehabilitation Medicine",
    "info": "Rotation on equine sports medicine, exercise physiology, and rehabilitation therapy. Common injuries, prevention/management protocols. Principles/practices of athletic conditioning, performance testing, and rehabilitation therapy. Field trips, presentations, labs, case studies, clinical cases.",
    "prereq": []
  },
  {
    "uid": "826455",
    "code": "CVM6743",
    "subject": "CVM",
    "number": "6743",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development VI",
    "fullname": "Professional Development VI",
    "info": "The content for this series of courses (6 total that span 3 years) will assist veterinary students in learning basic knowledge and concepts important for veterinary professional development (PD).  Each PD course includes module topics that directly connect with CBVE Domains of Competence - 5. Communication, 6. Collaboration, 7. Professionalism and Professional Identity, and 8. Financial and Practice Management - and explore such topics as decision-making, time management, community medicine, ethics, animal welfare, communication, collaboration, personal wellness, financial planning, and scholarship.  This series is not designed to teach hard science or clinical skills and will instead focus on professional skills (e.g., interpersonal, leadership, empathy), empowering a growth mindset, and facilitating veterinary success.",
    "prereq": []
  },
  {
    "uid": "013262",
    "code": "CVM6747",
    "subject": "CVM",
    "number": "6747",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Theriogenology",
    "fullname": "Equine Theriogenology",
    "info": "Techniques in equine reproduction. Handling of stallions and mares. Testing for estrus detection. Rectal palpation, ultrasound exam of reproductive tract. Breeding management, hormone treatments, vaginal examination, uterine culture, cytology and biopsy, semen collection and evaluation, intrauterine therapy, artificial insemination.",
    "prereq": []
  },
  {
    "uid": "014559",
    "code": "CVM6748",
    "subject": "CVM",
    "number": "6748",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Theriogenology Advanced",
    "fullname": "Equine Theriogenology Advanced (EThA)",
    "info": "Students are in charge of breeding management decisions: select mares from teaching herd, use palpation and ultrasound/pharmacologic aids to ensure timely breeding to frozen semen, which was frozen/assessed by students. Students participate in equine theriogenology cases admitted to Veterinary Medical Center.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "790583",
    "code": "CVM6749",
    "subject": "CVM",
    "number": "6749",
    "honors": false,
    "writingIntensive": false,
    "name": "Stud Farm Practice (SFP)",
    "fullname": "Stud Farm Practice (SFP)",
    "info": "Rotation gives students experience in stud farm management and veterinary practice. Aspects of stud farm practice from both veterinary and management points of view prepare students for specialized practice. Rotation given in central Kentucky in collaboration with a large veterinary practice and different stud farms.",
    "prereq": []
  },
  {
    "uid": "014635",
    "code": "CVM6750",
    "subject": "CVM",
    "number": "6750",
    "honors": false,
    "writingIntensive": false,
    "name": "Eq Sports and Rehab Medicine",
    "fullname": "Equine Sports and Rehabilitation Medicine",
    "info": "Rotation on equine sports medicine, exercise physiology, and rehabilitation therapy. Common injuries, prevention/management protocols. Principles/practices of athletic conditioning, performance testing, and rehabilitation therapy. Field trips, presentations, labs, case studies, clinical cases.prereq: DVM 3rd or 4th yr or instr consent; intended for equine track or mixed track students",
    "prereq": []
  },
  {
    "uid": "803104",
    "code": "CVM6752",
    "subject": "CVM",
    "number": "6752",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Equine Elective I",
    "fullname": "Advanced Equine Elective I",
    "info": "More depth on equine health topics than offered in core curriculum. Includes cadaver lab and two live horse exercises.prereq: Veterinary core curriculum for Advanced Equine Elective 1",
    "prereq": []
  },
  {
    "uid": "803105",
    "code": "CVM6753",
    "subject": "CVM",
    "number": "6753",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Equine Elective II",
    "fullname": "Advanced Equine Elective II",
    "info": "Lecture format. Topics in equine medicine. More depth than core veterinary courses.prereq: 6752",
    "prereq": {
      "code": "CVM 6752",
      "subject": "CVM",
      "id": "6752"
    }
  },
  {
    "uid": "803121",
    "code": "CVM6754",
    "subject": "CVM",
    "number": "6754",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Equine Elective III",
    "fullname": "Advanced Equine Elective III",
    "info": "Equine sports disciplines, adaptations to training, common causes of poor performance. Assigned project.",
    "prereq": []
  },
  {
    "uid": "801504",
    "code": "CVM6789",
    "subject": "CVM",
    "number": "6789",
    "honors": false,
    "writingIntensive": false,
    "name": "Fresh Doe & Goat Kid Mgmt",
    "fullname": "Fresh Dairy Doe and Newborn Goat Kid Management",
    "info": "Rotation at Poplar Hill Goat Dairy during fresh doe/goat kid season. How to recognize, diagnose, and treat kid illnesses. Health strategies to control Johne's, caprine arthritis encephalitis virus, coccidiosis, neonatal diarrheas, mastitis, parasitism, and nutritional deficiencies.",
    "prereq": []
  },
  {
    "uid": "014560",
    "code": "CVM6790",
    "subject": "CVM",
    "number": "6790",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Small Ruminant Practice",
    "fullname": "Advanced Small Ruminant Practice",
    "info": "Training beyond core in practice of small ruminants. Common diagnostic/therapeutic procedures.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "789686",
    "code": "CVM6791",
    "subject": "CVM",
    "number": "6791",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Sm Rum Practice - Lab",
    "fullname": "Advanced Small Ruminant Practice: Laboratory Block",
    "info": "Common diagnostic/therapeutic procedures used in treating small ruminants.",
    "prereq": []
  },
  {
    "uid": "014636",
    "code": "CVM6792",
    "subject": "CVM",
    "number": "6792",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Small Ruminant Medicine",
    "fullname": "Small Ruminant Health and Production Rotation (SmRu)",
    "info": "Sheep, goat, llama, farmed-deer production, medicine, and health. Nutrition/health management, new stock, facility maintenance, husbandry, diagnosis, record keeping, zoonosis, necropsy. Reproductive management. Breeding soundness, body condition, vasectomy, ultrasound, castration, tail docking, disbudding, dehorning, vaccination, parasites, restraint/handling, venipuncture, foot trimming, tuberculin testing. Farm visits.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "790881",
    "code": "CVM6793",
    "subject": "CVM",
    "number": "6793",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Ruminant Reproduction",
    "fullname": "Small Ruminant Reproduction",
    "info": "Breeding soundness of males, embryo transfer, artificial insemination semen, cryopreservation. Reproductive management of goat/sheep herds. Sire/dam selection, genetic potential, nutritional affects. Reproductive tracts. Estrus detection, breeding patterns, reproductive pharmacology. Vaginal examination, biopsy/cytology, reproductive microbiology. Camelid progesterone case studies. Captive breeding programs for wild hoof stock.prereq: 3rd yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "798167",
    "code": "CVM6794",
    "subject": "CVM",
    "number": "6794",
    "honors": false,
    "writingIntensive": false,
    "name": "Camelid",
    "fullname": "Camelid Medicine, Surgery, Reproduction, and Health Management",
    "info": "Two-week rotation. Approximately 15 farm visits are made to alpaca/llama farms. Approximately 10 alpacas/llamas are evaluated at VMC. Hands-on learning environment. Physical exam, venipuncture, ultrasound. Field surgeries such as castration, dental work, foot trimming, venipuncture, body condition score, preventive herd health management, pharmaceuticals. Common medical/reproductive problems. Interstate health certificates. Tuberculosis testing and nectropsy.prereq: 3rd or 4th yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "016842",
    "code": "CVM6795",
    "subject": "CVM",
    "number": "6795",
    "honors": false,
    "writingIntensive": false,
    "name": "Herd Health",
    "fullname": "Herd Health",
    "info": "Herd health programs for dairy/beef cattle, sheep, and dairy goats. Components that constitute a herd health program, their costs/timing. Farm tours demonstrate need/method of applying herd health programs in commercial production settings. Five day, Intersession course.",
    "prereq": []
  },
  {
    "uid": "790557",
    "code": "CVM6796",
    "subject": "CVM",
    "number": "6796",
    "honors": false,
    "writingIntensive": false,
    "name": "BPSM Feedlot",
    "fullname": "Beef Production Systems Medicine: Feedlot",
    "info": "Beef cattle feedlot production, medicine, health management. Production systems. Receiving protocols, economics. Livestock selection/evaluation, health management, facility evaluation. Pre-conditioning, pre-immunization, environmental pollution monitoring, transportation/vaccine protocols, nutrition, respiratory diseases, epidemics/disease. Evaluation of small/large feedlot operations. Body condition scoring, castration, dehorning/parasite control. Necropsy, field pathology sampling.prereq: DVM 3rd or 4th yr student or instr consent",
    "prereq": []
  },
  {
    "uid": "790558",
    "code": "CVM6797",
    "subject": "CVM",
    "number": "6797",
    "honors": false,
    "writingIntensive": false,
    "name": "BPSM Cow Calf",
    "fullname": "Beef Production Systems Medicine: Cow-Calf (BPSCC)",
    "info": "Beef production medicine and health management. How cow-calf medicine fits within the larger North American beef production system. Cow-calf beef production system and related preventative/therapeutic health management programs, purchasing/introducing new stock, marketing systems, facility requirements/design, husbandry, field diagnostics, reproductive management, breeding soundness evaluations, vaccine protocols, record keeping and economics, calving management, body condition scoring, and calf scour management and treatment. Farm visits to evaluate production systems with field trips to high/low health cow-calf operations with focus on problem solving and discussions of on farm disease cases and important industry topics.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "812399",
    "code": "CVM6798",
    "subject": "CVM",
    "number": "6798",
    "honors": false,
    "writingIntensive": false,
    "name": "BPSM Feedlot A",
    "fullname": "Beef Production Systems Medicine: Feedlot A",
    "info": "Beef cattle feedlot production, medicine, health management. Production systems. Receiving protocols, economics. Livestock selection/evaluation, health management, facility evaluation. Pre-conditioning, pre-immunization, environmental pollution monitoring, transportation/vaccine protocols, nutrition, respiratory diseases, epidemics/disease. Evaluation of small/large feedlot operations. Body condition scoring, castration, dehorning/parasite control. Necropsy, Field pathology sampling. Feedlot A rotation is located in Canada. Students are required to fund travel expense.prereq: DVM 3rd or 4th yr student or instr consent",
    "prereq": []
  },
  {
    "uid": "812400",
    "code": "CVM6799",
    "subject": "CVM",
    "number": "6799",
    "honors": false,
    "writingIntensive": false,
    "name": "BPSM Feedlot B",
    "fullname": "Beef Productions Medicine: Feedlot B",
    "info": "Beef cattle feedlot production, medicine, health management. Production systems. Receiving protocols, economics. Livestock selection/evaluation, health management, facility evaluation. Pre-conditioning, pre-immunization environmental pollution monitoring, transportation/vaccine protocols, nutrition, respiratory diseases, epidemics/disease. Evaluation of small/large feedlot operations. Body condition scoring, castration, dehorning/parasite control. Necropsy, field pathology sampling. Feedlot B rotation is located in Nebraska. Students are required to fund travel expense.prereq: DVM 3rd or 4th yr student or instr consent",
    "prereq": []
  },
  {
    "uid": "014561",
    "code": "CVM6800",
    "subject": "CVM",
    "number": "6800",
    "honors": false,
    "writingIntensive": false,
    "name": "Bovine Palpation Lab",
    "fullname": "Bovine Palpation",
    "info": "Practice in diagnostic evaluation of bovine reproductive tract.prereq: DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "792326",
    "code": "CVM6801",
    "subject": "CVM",
    "number": "6801",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Dairy Production Medicine",
    "fullname": "Advanced Dairy Production Medicine",
    "info": "Designed to give veterinary students more in-depth coverage of topics in dairy production medicine at the management, preventive, and herd level.",
    "prereq": []
  },
  {
    "uid": "014562",
    "code": "CVM6802",
    "subject": "CVM",
    "number": "6802",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Lge Ruminant Clinical Elec",
    "fullname": "Advanced Large Ruminant Clinical Elective",
    "info": "Topics in cattle health/production medicine not included in core. More extensive discussion of conditions introduced in core.",
    "prereq": []
  },
  {
    "uid": "788220",
    "code": "CVM6803",
    "subject": "CVM",
    "number": "6803",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Bovine Practice - Lab",
    "fullname": "Advanced Bovine Practice: Laboratory Block",
    "info": "Cattle health, production medicine. Topics not included in core, more extensive discussion of conditions introduced in core.prereq: [6802, [DVM 3rd or 4th yr]] or instr consent",
    "prereq": {
      "code": "CVM 6802",
      "subject": "CVM",
      "id": "6802"
    }
  },
  {
    "uid": "013264",
    "code": "CVM6804",
    "subject": "CVM",
    "number": "6804",
    "honors": false,
    "writingIntensive": false,
    "name": "Bovine Surgery",
    "fullname": "Bovine Surgery",
    "info": "Technical/theoretical skills in management of individual cow surgical diseases. Emphasizes abdominal/urogenital surgery of dairy cow. Discussion, labs. Students research topics and prepare for surgery.",
    "prereq": []
  },
  {
    "uid": "790051",
    "code": "CVM6805",
    "subject": "CVM",
    "number": "6805",
    "honors": false,
    "writingIntensive": false,
    "name": "FA & Exotic Anesthesia",
    "fullname": "Food Animal and Exotic Animal Anesthesia",
    "info": "Techniques/complications of sedation, local anesthesia, and general anesthesia in ruminants, pigs, and some large exotic species. Cases demonstrate anesthetic management of clinical problems common in veterinary practice.prereq: 5321 or equiv",
    "prereq": {
      "code": "CVM 5321",
      "subject": "CVM",
      "id": "5321"
    }
  },
  {
    "uid": "798349",
    "code": "CVM6806",
    "subject": "CVM",
    "number": "6806",
    "honors": false,
    "writingIntensive": false,
    "name": "FA Disease & Diagnostics",
    "fullname": "Food Animal Disease and Diagnostics",
    "info": "Two-week rotation. Food animal necropsies, diagnostic assays.prereq: 3rd or 4th yr DVM student or instr consent",
    "prereq": []
  },
  {
    "uid": "816547",
    "code": "CVM6807",
    "subject": "CVM",
    "number": "6807",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Animal Surgery Anesthesia",
    "fullname": "Food Animal Surgery & Anesthesia",
    "info": "This course is designed to provide intensive training in ruminant surgery to senior students. The course is unusual in format from most veterinary curriculum offerings and provides an in-depth evaluation of food animal surgery principles as well as hands-on laboratory components to solidify understanding of the material.",
    "prereq": []
  },
  {
    "uid": "826159",
    "code": "CVM6809",
    "subject": "CVM",
    "number": "6809",
    "honors": false,
    "writingIntensive": false,
    "name": "SNAP B",
    "fullname": "Spay Neuter Anesthesia Practicum B",
    "info": "This is rotation is designed to give you experience in elective procedures such as ovariohysterectomies, castrations, and umbilical hernia repairs on cats and dogs and the anesthesia required for them.  Animals are supplied by local animal shelters and rescue groups. The surgeries you provide will make them more adoptable. This elective was designed to help you transition into a practitioner capable of anesthesia and surgery for gonadectomies.",
    "prereq": []
  },
  {
    "uid": "807790",
    "code": "CVM6810",
    "subject": "CVM",
    "number": "6810",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Animal Basics",
    "fullname": "Food Animal Basics",
    "info": "Therapeutic principles and vaccinology; animal housing and welfare, diagnostic approaches for populations; genetic improvement and biosecurity. Holistic appreciation of major issues in animal health and production. Preparation for food animal rotations in senior year.prereq: Successful completion of first 2 years of DVM curriculum",
    "prereq": []
  },
  {
    "uid": "013270",
    "code": "CVM6811",
    "subject": "CVM",
    "number": "6811",
    "honors": false,
    "writingIntensive": false,
    "name": "Overview Bovine Therio & Lame",
    "fullname": "Overview of Bovine Theriogenology and Lameness  (OBTL)",
    "info": "This is a senior rotation that will focus on improving students' clinical skills in the examination of the bovine female. Students will participate during this rotation in routine veterinary (reproductive and lameness related) procedures provided by the instructors' dairies. Students will be taught topics related to diagnostics, treatment and management of reproductive and foot diseases of dairy cows, topics related to reproductive and lameness management of dairy herds, and on-farm data analysis related to reproductive and health performance.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "013269",
    "code": "CVM6812",
    "subject": "CVM",
    "number": "6812",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy Therio Management",
    "fullname": "Dairy Theriogenology Management (DThM)",
    "info": "Two-week rotation of lecture/laboratory. Embryo transfer. Breeding soundness evaluation of bulls. Health management of bulls. Obstetrics and fetotomy. Reproductive management of dairy herd. Decision cases on herds with infertility problems. Approaches to sire selection, evaluating genetic and nutrition factors on reproduction.",
    "prereq": []
  },
  {
    "uid": "790584",
    "code": "CVM6813",
    "subject": "CVM",
    "number": "6813",
    "honors": false,
    "writingIntensive": false,
    "name": "Miracle of Birth",
    "fullname": "Miracle of Birth",
    "info": "Delivery of calves, lambs, and piglets at the Minnesota State Fair. Assist in public education about large animal veterinary medicine processes. Birthing and veterinary assistance of the birthing process. Media relations and interviews. Students work with large animal veterinarians, FFA students, and instructors in this rotation.",
    "prereq": []
  },
  {
    "uid": "013267",
    "code": "CVM6814",
    "subject": "CVM",
    "number": "6814",
    "honors": false,
    "writingIntensive": false,
    "name": "Mastitis",
    "fullname": "Mastitis, Milking Machines, and Milk Quality (DMMM)",
    "info": "Provide tools to evaluate herd mastitis problems, recommendations for solutions, develop mastitis controls programs, evaluate adequacy of milking system function, field surgery of mammary gland and teats, provide therapy for clinical mastitis. Milking equipment, microbiology, mastitis, pharmacology, residue avoidance, records analysis, stray voltage testing, surgery, mastitis control techniques. Decision case studies, labs, and farm visits.",
    "prereq": []
  },
  {
    "uid": "014641",
    "code": "CVM6815",
    "subject": "CVM",
    "number": "6815",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy Ruminant Nutrition",
    "fullname": "Dairy Ruminant Nutrition (RuNt)",
    "info": "Basic principles of nutritional management of ruminant, including digestive physiology, nutrient requirements, common feed stuffs, forage management, processing and storage systems, laboratory analysis of nutrient composition of feed stuffs, feeding management systems, and nutrition-related health disorders. Develop skills using different techniques (e.g. spreadsheet analysis, Spartan ration balancing software program, DairyComp 305 production and health records) to evaluate nutritional management programs. On-farm investigations include assessment of forage quality, feeding management, environment, facilities, cow comfort, dry matter intakes, ration effective fiber, ration moisture content, urine pHs, body condition scoring, and production records review. Discussion of unique aspects of nutritional management of beef cattle and small ruminants. Highly recommended for students interested in dairy or beef practice. Prerequisite for students considering later enrolling in Applied Dairy Nutrition.",
    "prereq": []
  },
  {
    "uid": "014642",
    "code": "CVM6816",
    "subject": "CVM",
    "number": "6816",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Applied Dairy Nutrition",
    "fullname": "Advanced Applied Dairy Nutrition",
    "info": "Practical experience in analysis, formulation, and troubleshooting of rations for dairy cows. Determining quantity/quality of feeds. How cows move through dairy at different stages of production and in dry period. Students work with computerized ration programs. Feeding-management issues, monitoring cattle production, cow comfort, and housing issues. Forage preservation/management.",
    "prereq": []
  },
  {
    "uid": "816542",
    "code": "CVM6817",
    "subject": "CVM",
    "number": "6817",
    "honors": false,
    "writingIntensive": false,
    "name": "Bovine Therio & Lameness Adv",
    "fullname": "Bovine Theriogenology & Lameness Advanced",
    "info": "Rotation will build on bovine theriogenology and lameness overview and offer more advanced techniques for bovine-interested students.",
    "prereq": []
  },
  {
    "uid": "014643",
    "code": "CVM6818",
    "subject": "CVM",
    "number": "6818",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy HH",
    "fullname": "General Dairy Herd Health and Disease",
    "info": "Concepts/practices used by veterinarians serving their clients at herd level. Strategies for controlling commonly encountered dairy diseases. Proper/legal use of therapies. Management of dairy to promote animal health/productivity. Vaccination programs, residue avoidance, animal welfare concerns.",
    "prereq": []
  },
  {
    "uid": "825638",
    "code": "CVM6819",
    "subject": "CVM",
    "number": "6819",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced dentistry",
    "fullname": "Advanced dentistry",
    "info": "The goal of this rotation is to allow fourth year students to run their own cases as if they are out in practice while still having back-up from the dentistry clinicians. This is the final step in dentistry education. ",
    "prereq": []
  },
  {
    "uid": "014644",
    "code": "CVM6820",
    "subject": "CVM",
    "number": "6820",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy Records",
    "fullname": "Dairy Record Analysis, Epidemiology, and Economics (DRec)",
    "info": "Evaluation of a dairy herd using biological and economic records. Records analysis. Economic basis of dairying. Financial techniques for evaluating producer decisions and veterinary recommendations. Field trips, decision-case evaluation, laboratories.",
    "prereq": []
  },
  {
    "uid": "791192",
    "code": "CVM6821",
    "subject": "CVM",
    "number": "6821",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy On Farm Clinical",
    "fullname": "Dairy on Farm Clinical",
    "info": "Typical transition cow management, clinical veterinary care. Students assist in all aspects of day-to-day management of TMF. Fresh cow screening/therapies, calvings, routine animal management. Students live at TMF during rotation.prereq: 3rd or 4th yr DVM student or instr consent",
    "prereq": []
  },
  {
    "uid": "791193",
    "code": "CVM6822",
    "subject": "CVM",
    "number": "6822",
    "honors": false,
    "writingIntensive": false,
    "name": "TMF 2",
    "fullname": "Applied Dairy Veterinary Clinical Techniques (TMF2)",
    "info": "Second in series of rotations in transition cow management tasks. Time divided between veterinary tasks, classroom/rounds discussion, and routine TMF tasks. Students are required to live at facility during rotation. One to two days are spent at associated milking dairies, assisting with reproductive program and milking parlor.",
    "prereq": []
  },
  {
    "uid": "791194",
    "code": "CVM6823",
    "subject": "CVM",
    "number": "6823",
    "honors": false,
    "writingIntensive": false,
    "name": "TMF 3",
    "fullname": "Special Project in Dairy Cattle Management (TMF 3)",
    "info": "Advanced dairy production and health management. Students develop proposal to study a specific area of dairy management. Project in Transition Management Facility or associated milking dairies, or, short-term applied clinical trial/testing of a hypothesis using dairies' records.",
    "prereq": []
  },
  {
    "uid": "796824",
    "code": "CVM6824",
    "subject": "CVM",
    "number": "6824",
    "honors": false,
    "writingIntensive": false,
    "name": "DPMDS",
    "fullname": "Directed Studies in Dairy Production Medicine",
    "info": "Student explores dairy production medicine topic in greater detail. Review/report of rotation is submitted to faculty sponsor.",
    "prereq": []
  },
  {
    "uid": "796825",
    "code": "CVM6825",
    "subject": "CVM",
    "number": "6825",
    "honors": false,
    "writingIntensive": false,
    "name": "DPM Adv",
    "fullname": "Advanced Topics in Dairy Production Medicine",
    "info": "Advanced discussion of topics covered previous dairy production medicine rotations.",
    "prereq": []
  },
  {
    "uid": "796826",
    "code": "CVM6826",
    "subject": "CVM",
    "number": "6826",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy Production Medicine 1",
    "fullname": "Dairy Production Medicine 1",
    "info": "First in series of rotations. Mastitis control. Milking equipment function. Reproductive physiology, management implementation. Standardized disease diagnostic approaches, treatment/vaccination protocols. Record analysis. Dietary evaluation/formulation. Feeding management. Housing, cow comfort, animal welfare. Economic concepts. Spreadsheet, computer skills. Youngstock management, genetic improvement. Taught at TMF.prereq: 3rd or 4th yr DVM",
    "prereq": []
  },
  {
    "uid": "796827",
    "code": "CVM6827",
    "subject": "CVM",
    "number": "6827",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy Production Medicine 2",
    "fullname": "Dairy Production Medicine 2",
    "info": "Rotation expand on topics listed under Dairy Production Medicine 1.prereq: 6818, 6826, [3rd or 4th yr DVM or instr consent]",
    "prereq": {
      "and": [
        {
          "code": "CVM 6818",
          "subject": "CVM",
          "id": "6818"
        },
        {
          "code": "CVM 6826",
          "subject": "CVM",
          "id": "6826"
        }
      ]
    }
  },
  {
    "uid": "796828",
    "code": "CVM6828",
    "subject": "CVM",
    "number": "6828",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy Production Medicine 3",
    "fullname": "Dairy Production Medicine 3",
    "info": "Rotation provides additional training following Dairy Production Medicine 2.prereq: 6818, 6826, 6827, [3rd or 4th yr DVM or instr consent]",
    "prereq": {
      "and": [
        {
          "code": "CVM 6818",
          "subject": "CVM",
          "id": "6818"
        },
        {
          "code": "CVM 6826",
          "subject": "CVM",
          "id": "6826"
        },
        {
          "code": "CVM 6827",
          "subject": "CVM",
          "id": "6827"
        }
      ]
    }
  },
  {
    "uid": "796829",
    "code": "CVM6829",
    "subject": "CVM",
    "number": "6829",
    "honors": false,
    "writingIntensive": false,
    "name": "Dairy Production Medicine 4",
    "fullname": "Dairy Production Medicine 4",
    "info": "Rotation completes four rotation series in 6826, 6827, and 6828.prereq: [6818, 6826, 6827, 6728, [3rd or 4th yr DVM]] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CVM 6818",
          "subject": "CVM",
          "id": "6818"
        },
        {
          "code": "CVM 6826",
          "subject": "CVM",
          "id": "6826"
        },
        {
          "code": "CVM 6827",
          "subject": "CVM",
          "id": "6827"
        },
        {
          "code": "CVM 6728",
          "subject": "CVM",
          "id": "6728"
        }
      ]
    }
  },
  {
    "uid": "790585",
    "code": "CVM6830",
    "subject": "CVM",
    "number": "6830",
    "honors": false,
    "writingIntensive": false,
    "name": "Youngstk  & Dairy Prod Med",
    "fullname": "Youngstock and Dairy Production Medicine (Y&DPrMed)",
    "info": "Heifer management program. Mastitis prevention, reproductive management, housing, nutrition, infectious disease control, biosecurity, parasite control, genetics, economics, business structure. Students evaluate heifer management on client dairies, help develop a heifer-rearing program.  Reproductive, udder health, production, and disease records. Record management software.",
    "prereq": []
  },
  {
    "uid": "808978",
    "code": "CVM6831",
    "subject": "CVM",
    "number": "6831",
    "honors": false,
    "writingIntensive": false,
    "name": "Over of Ruminant Prod Med",
    "fullname": "Overview of Ruminant Production Medicine",
    "info": "Gives students the background necessary to promote animal welfare, prevent disease, and assist clients in making decisions that enhance their farms productivity and financial well-being.",
    "prereq": []
  },
  {
    "uid": "820177",
    "code": "CVM6832",
    "subject": "CVM",
    "number": "6832",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Imaging Rotation",
    "fullname": "Comparative Imaging Clinical Rotation",
    "info": "Clinical instruction for making diagnostic quality radiographic and sonographic images, applying radiation safety principles, practicing abdominal sonography, and interpreting radiographic and sonographic studies.",
    "prereq": []
  },
  {
    "uid": "801606",
    "code": "CVM6835",
    "subject": "CVM",
    "number": "6835",
    "honors": false,
    "writingIntensive": false,
    "name": "FA Medicine Directed Studies",
    "fullname": "Food Animal Medicine Directed Studies",
    "info": "Students work with faculty member on special topic project in food animal area.prereq: Submission of proposal, faculty member approval",
    "prereq": []
  },
  {
    "uid": "014563",
    "code": "CVM6840",
    "subject": "CVM",
    "number": "6840",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Core",
    "fullname": "Swine Core",
    "info": "Swine medicine, production, and health management.",
    "prereq": []
  },
  {
    "uid": "015924",
    "code": "CVM6841",
    "subject": "CVM",
    "number": "6841",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Behavior",
    "fullname": "Swine Behavior",
    "info": "Common considerations in swine behavior.prereq: [3rd or 4th yr] DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "013277",
    "code": "CVM6842",
    "subject": "CVM",
    "number": "6842",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Disease",
    "fullname": "Swine Disease Diagnostics, Therapeutics, and Prevention",
    "info": "Major diseases and high-health technologies. Field trips of high-/low-health farms, abattoir for slaughter check. Problem solving, discussion of on-farm disease cases. In-clinic diagnostic techniques.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "789698",
    "code": "CVM6843",
    "subject": "CVM",
    "number": "6843",
    "honors": false,
    "writingIntensive": false,
    "name": "Understanding PRRS",
    "fullname": "Understanding PRRS: A Problem-Based Approach",
    "info": "Students experience real-time cases of Porcine Reproduction and Respiratory Syndrome (PRRS) and devise diagnostic plans/intervention strategies, receiving actual diagnostic/production data to monitor progress. Course is all on-line.",
    "prereq": []
  },
  {
    "uid": "013287",
    "code": "CVM6844",
    "subject": "CVM",
    "number": "6844",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Production Systems",
    "fullname": "Swine Production Systems (SPdn)",
    "info": "Alternative systems of swine production. Didactic lectures, labs, special projects. Information management systems, building and equipment designs, health, genetics nutritional systems, marketing alternatives. Influence of production systems on biological and financial endpoints. Upon completion, present project completed on design of various components of integrated swine production system.",
    "prereq": []
  },
  {
    "uid": "016834",
    "code": "CVM6845",
    "subject": "CVM",
    "number": "6845",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Production Training",
    "fullname": "Swine Production Training (SPTr)",
    "info": "Day-to-day management of modern swine farm. Students assist with all techniques, protocols, and practices encountered daily in swine unit, conduct any necessary necropsies or surgical techniques, investigate production/health problems. On final day of rotation, students lead herd visit, summarize findings with producer and course coordinator, and write a herd report.prereq: 3rd or 4th yr DVM or instr consent",
    "prereq": []
  },
  {
    "uid": "013286",
    "code": "CVM6846",
    "subject": "CVM",
    "number": "6846",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Nutrition",
    "fullname": "Swine Nutrition",
    "info": "Nutrition and feeding management of pigs.  Nutrient requirements. Feeds, feed delivery, and feeding management. Computer laboratories. Farm visits.",
    "prereq": []
  },
  {
    "uid": "013281",
    "code": "CVM6848",
    "subject": "CVM",
    "number": "6848",
    "honors": false,
    "writingIntensive": false,
    "name": "Finances",
    "fullname": "Finance for the Small Business and You (FPSB)",
    "info": "Basic accounting and financial skills to understand small-business problems and communicate findings. Financial statements, budgeting, partial/capital budgets, time value of money, assessing return on investment. Examples from veterinary practice and food producction companies. How to become personally financially independent. Managing personal finances, investments, future needs, debt repayment.",
    "prereq": []
  },
  {
    "uid": "013288",
    "code": "CVM6850",
    "subject": "CVM",
    "number": "6850",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Records",
    "fullname": "Swine Records (SRec)",
    "info": "How to interpret performance measures, monitor productivity, capture data, and generate reports in managing production in swine industry. Using records to troubleshoot problems and manage production.",
    "prereq": []
  },
  {
    "uid": "790883",
    "code": "CVM6852",
    "subject": "CVM",
    "number": "6852",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine Virology",
    "fullname": "Swine Virology",
    "info": "Lab techniques for diagnostic virology, serology, and immunology.  Research techniques for use of fluorescent antibodies, determination of classes of immunoglobulins, and immunostimulation of lymphocytes.",
    "prereq": []
  },
  {
    "uid": "798168",
    "code": "CVM6854",
    "subject": "CVM",
    "number": "6854",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Swine Hlth and Prod",
    "fullname": "Introduction to Swine Health and Production",
    "info": "Clinical problem solving based on case examples, first-hand field experiences. Students visit/assess enterprises representing all components of pork chain, from feed milling, to animal production, to slaughter/processing. Roles/responsibilities veterinarians have in food animal production. Problem definition/investigation. Formal follow up, report writing, oral presentation of recommendations.",
    "prereq": []
  },
  {
    "uid": "798169",
    "code": "CVM6855",
    "subject": "CVM",
    "number": "6855",
    "honors": false,
    "writingIntensive": false,
    "name": "Population Diag and Therap",
    "fullname": "Principles of Population Based Diagnostics and Therapeutics",
    "info": "Principles of population (herd) based diagnostic/theraapeutic decision making. Theoretical/practical aspects of diagnostic test performance/interpretation. Case-based examples of major swine diseases in North America. Therapeutic decision making in swine populations, including pharmacologic, legal, economic, and logistic considerations. Diagnostic/therapeutic procedures.",
    "prereq": []
  },
  {
    "uid": "798170",
    "code": "CVM6856",
    "subject": "CVM",
    "number": "6856",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Swine Hlth and Production",
    "fullname": "Advanced Swine Health and Production",
    "info": "Capstone course. Complex field problems. Student teams take a field case, work it up, and propose steps for farm to resolve problem. Lectures, in-class exercises, field trips.",
    "prereq": []
  },
  {
    "uid": "798493",
    "code": "CVM6860",
    "subject": "CVM",
    "number": "6860",
    "honors": false,
    "writingIntensive": false,
    "name": "Investig & Diag of Swine Dz",
    "fullname": "Integrating Laboratory Diagnostics With Field Investigations of Swine Disease",
    "info": "Students follow selected swine disease investigations, from farm through diagnostic lab and back, determine impact of specific swine diseases on productivity and cost of production, design a control program, and collect/submit quality samples to diagnostic lab.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "798597",
    "code": "CVM6865",
    "subject": "CVM",
    "number": "6865",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Swine Production Med",
    "fullname": "Introduction to Swine Production Medicine",
    "info": "Contemporary approaches to swine practice. Swine production, disease diagnosis. Control, treatment, eradication.prereq: DVM student or instr consent",
    "prereq": []
  },
  {
    "uid": "014565",
    "code": "CVM6880",
    "subject": "CVM",
    "number": "6880",
    "honors": false,
    "writingIntensive": false,
    "name": "Avian Core",
    "fullname": "Avian Core",
    "info": "Avian nutrition, physiology, anatomy, and disease.Prereq-DVM or instr consent.",
    "prereq": []
  },
  {
    "uid": "014903",
    "code": "CVM6882",
    "subject": "CVM",
    "number": "6882",
    "honors": false,
    "writingIntensive": false,
    "name": "Companion Birds",
    "fullname": "Companion Birds (ComB)",
    "info": "Avian medicine/surgery relating to companion birds. Hands-on experience in local aviaries and breeding facilities. Acquisition of basic avian clinical skills in the Raptor Center.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "790586",
    "code": "CVM6883",
    "subject": "CVM",
    "number": "6883",
    "honors": false,
    "writingIntensive": false,
    "name": "Raptor",
    "fullname": "Raptor",
    "info": "Students participate in all aspects of raptor medicine, surgery, and rehabilitation and gain avian experience. Conservation medicine.prereq: 6497, DVM 3rd or 4th yr, instr consent",
    "prereq": {
      "code": "CVM 6497",
      "subject": "CVM",
      "id": "6497"
    }
  },
  {
    "uid": "014964",
    "code": "CVM6884",
    "subject": "CVM",
    "number": "6884",
    "honors": false,
    "writingIntensive": false,
    "name": "Poultry Medicine Clerkship",
    "fullname": "Poultry Medicine Clerkship (PMC)",
    "info": "Broiler, layer, and turkey industries, performance analysis, disease diagnosis, management techniques for prevention/control of disease, food safety problems and diagnostic pathology in a laboratory setting. Classroom presentations, discussions, on-farm evaluations. ",
    "prereq": []
  },
  {
    "uid": "826039",
    "code": "CVM6889",
    "subject": "CVM",
    "number": "6889",
    "honors": false,
    "writingIntensive": false,
    "name": "Spay/Neuter Anes Practicum",
    "fullname": "Spay/Neuter Anesthesia Practicum",
    "info": "This rotation is designed to give you experience in elective procedures such as ovariohysterectomies, castrations, and umbilical hernia repairs on cats and dogs and the anesthesia required for them. Animals are supplied by local animal shelters and rescue groups. The surgeries you provide will make them more adoptable. This elective was designed to help you transition into a practitioner capable of anesthesia and surgery for gonadectomies. We will NOT teach high-volume surgery techniques in this course as this is NOT a high-volume spay/neuter rotation.  However, you will be assigned a day to travel to a high quality high volume spay neuter operation on 2 of the 4 Fridays of the rotation. ",
    "prereq": []
  },
  {
    "uid": "810140",
    "code": "CVM6900",
    "subject": "CVM",
    "number": "6900",
    "honors": false,
    "writingIntensive": false,
    "name": "Microscopic Anatomy I",
    "fullname": "Microscopic Anatomy I",
    "info": "Identification, description, and understanding of basic structure and elements of cells and basic tissues. Identify and describe structure and organization of organ systems presented.",
    "prereq": []
  },
  {
    "uid": "810144",
    "code": "CVM6901",
    "subject": "CVM",
    "number": "6901",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology I",
    "fullname": "Physiology I",
    "info": "Principles of cell physiology, muscle physiology, neurophysiology, cardiovascular physiology. Relationships between forces/flows in biological systems. Overview of nervous system control of viscera, muscle, glands. Anatomy/physiology of central nervous system. Special senses of domestic mammals.",
    "prereq": []
  },
  {
    "uid": "810141",
    "code": "CVM6902",
    "subject": "CVM",
    "number": "6902",
    "honors": false,
    "writingIntensive": false,
    "name": "Vet Biochem,Nutr & Genetics",
    "fullname": "Veterinary Biochemistry, Nutrition & Genetics",
    "info": "Principles of biochemistry, genetics, nutrition. Background information/how it is used to understand animal health/disease. Examples reinforced with in-class/out-of-class problems.",
    "prereq": []
  },
  {
    "uid": "810142",
    "code": "CVM6903",
    "subject": "CVM",
    "number": "6903",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomy I",
    "fullname": "Anatomy I",
    "info": "Sequential integration of normal gross/radiographic anatomy of carnivore. Knowledge gained provides solid foundation for current/subsequent courses within veterinary professional curriculum.",
    "prereq": []
  },
  {
    "uid": "810236",
    "code": "CVM6904",
    "subject": "CVM",
    "number": "6904",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills I",
    "fullname": "Clinical Skills I",
    "info": "Introduction to small/large animal species. Fundamental clinical skills for small/large animal species. Proper physical exam, safe handling/restraint, behavior/animal safety, frequently used clinical skill procedures. Large animal practicum.prereq: 1st year clinical skills course",
    "prereq": []
  },
  {
    "uid": "810237",
    "code": "CVM6905",
    "subject": "CVM",
    "number": "6905",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development I",
    "fullname": "Professional Development I",
    "info": "This course is the first in the PD course series. Students will be introduced to the CBVE framework and the four streams that are at the heart of the course series. The overall goal of this course is to help students transition to veterinary school, and later, to the veterinary profession.",
    "prereq": []
  },
  {
    "uid": "806080",
    "code": "CVM6906",
    "subject": "CVM",
    "number": "6906",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Scientific Reading",
    "fullname": "Critical Scientific Reading",
    "info": "Skill development in reading of scientific literature. Papers critiqued for experimental design, statistical analysis, validity of results, contributions to literature, merit of study conclusions. Major aim of the course is to prepare veterinary students to think scientifically, for multiple career pathways, and an increasingly important role for veterinarians in comparative medicine.",
    "prereq": []
  },
  {
    "uid": "810274",
    "code": "CVM6907",
    "subject": "CVM",
    "number": "6907",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development II",
    "fullname": "Professional Development II",
    "info": "This course is the second in the PD course series.  Students will continue to work within the CBVE framework and the four streams that are at the heart of the course series.  In this and subsequent courses, students will build on skills they learned previously, and will be expected to apply those skills in practical exercises.",
    "prereq": []
  },
  {
    "uid": "810275",
    "code": "CVM6908",
    "subject": "CVM",
    "number": "6908",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomy II",
    "fullname": "Anatomy II",
    "info": "Sequential integration of normal gross/radiographic anatomy of ungulates. Knowledge gained will provide solid foundation for current/subsequent courses within veterinary professional curriculum.",
    "prereq": []
  },
  {
    "uid": "810276",
    "code": "CVM6909",
    "subject": "CVM",
    "number": "6909",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills II",
    "fullname": "Clinical Skills II",
    "info": "Domestic animal behavior. Basic small animal handling/management skills. Introduction to hospital. Small-animal clerk duty is required.",
    "prereq": []
  },
  {
    "uid": "810277",
    "code": "CVM6910",
    "subject": "CVM",
    "number": "6910",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology II",
    "fullname": "Physiology II",
    "info": "Anatomic strategies adopted by different animal species to achieve same/similar function. Important physiologic processes used by animals to maintain homeostasis. Neural, endocrine, paracrine regulation of organ systems. Intermediary metabolism.",
    "prereq": []
  },
  {
    "uid": "810278",
    "code": "CVM6911",
    "subject": "CVM",
    "number": "6911",
    "honors": false,
    "writingIntensive": false,
    "name": "Immunology",
    "fullname": "Immunology",
    "info": "This course is structured as an introductory and multidisciplinary unit consisting of a series of lectures to provide a basic understanding of the cells, molecules, and mechanisms of immunology against microbial pathogens and neoplasia, as well as immune-mediated pathologies such as allergies and autoimmunity.",
    "prereq": []
  },
  {
    "uid": "810279",
    "code": "CVM6912",
    "subject": "CVM",
    "number": "6912",
    "honors": false,
    "writingIntensive": false,
    "name": "Basic Pathology",
    "fullname": "Basic Pathology",
    "info": "Mechanisms in reactions of cells/tissues to injury. Retrogressive changes in cells, cell death, pigments, circulatory disturbances, inflammation, alterations of cell growth (including neoplasia). Applications to evaluation of gross/microscopic tissue alterations.",
    "prereq": []
  },
  {
    "uid": "810280",
    "code": "CVM6913",
    "subject": "CVM",
    "number": "6913",
    "honors": false,
    "writingIntensive": false,
    "name": "Agents of Disease",
    "fullname": "Agents of Disease",
    "info": "Mechanics of agent-host interactions in important animal diseases. Become familiar using literature to understand/solve infectious disease problems, evaluate strategies for controlling diseases. Basic structure of viruses, bacteria, parasites.",
    "prereq": []
  },
  {
    "uid": "810281",
    "code": "CVM6914",
    "subject": "CVM",
    "number": "6914",
    "honors": false,
    "writingIntensive": false,
    "name": "Preventive Medicine",
    "fullname": "Preventive Medicine",
    "info": "Concepts of preventive medicine. Information reinforced in other coursework. Short video lectures/notes on website for access throughout training.",
    "prereq": []
  },
  {
    "uid": "810324",
    "code": "CVM6915",
    "subject": "CVM",
    "number": "6915",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Pathology I",
    "fullname": "Clinical Pathology I",
    "info": "Normal/abnormal function of hematopoietic system. Pathophysiologic changes underlying serum biochemical abnormalities. Principles/clinical application of cytology as diagnostic tool. How clinical laboratory data is generated/interpreted.",
    "prereq": []
  },
  {
    "uid": "810325",
    "code": "CVM6916",
    "subject": "CVM",
    "number": "6916",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Pathology II",
    "fullname": "Clinical Pathology II",
    "info": "Normal/abnormal function of hematopoietic system. Pathophysiologic changes underlying serum biochemical abnormalities. Principles/clinical application of cytology as diagnostic tool. How clinical laboratory data is generated/interpreted.",
    "prereq": []
  },
  {
    "uid": "811483",
    "code": "CVM6917",
    "subject": "CVM",
    "number": "6917",
    "honors": false,
    "writingIntensive": false,
    "name": "Agents of Disease II",
    "fullname": "Agents of Disease II",
    "info": "This course is the second part of the Agents of Disease series dealing with diseases caused by infectious agents. This course extends the foundational information obtained on viruses, bacteria and parasites in Agents of Disease I, into understanding diseases caused by these agents in species of veterinary importance. In this course we will continue to integrate concepts on pathogenesis, life cycle, host response, diagnostic tests, and transmission of agents of diseases into developing solutions for diagnosis, prevention and control of infectious diseases in animals. ",
    "prereq": []
  },
  {
    "uid": "811484",
    "code": "CVM6918",
    "subject": "CVM",
    "number": "6918",
    "honors": false,
    "writingIntensive": false,
    "name": "Pharmacology I",
    "fullname": "Pharmacology I",
    "info": "Principles of drug action, disposition, and clinical applications in animal patients. Provide a solid base of general knowledge of pharmacology that will be important for later coursework in veterinary medicine and future successful veterinary practice. Students completing this course should have developed an understanding of how drugs from several medicinal classes are processed by animals and how these drugs exert their beneficial and adverse effects in animals.",
    "prereq": []
  },
  {
    "uid": "811326",
    "code": "CVM6919",
    "subject": "CVM",
    "number": "6919",
    "honors": false,
    "writingIntensive": false,
    "name": "Systemic Pathology",
    "fullname": "Systemic Pathology",
    "info": "Basic mechanisms of disease in various organ systems. Organ response to injury. Describe or interpret lesions in order to formulate morphological diagnoses/differential diagnoses (etiology). Correlate clinical/laboratory findings with clinical signs or lesions that might occur.",
    "prereq": []
  },
  {
    "uid": "811485",
    "code": "CVM6920",
    "subject": "CVM",
    "number": "6920",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Pathology I",
    "fullname": "Clinical Pathology I",
    "info": "Understand/explain normal/abnormal function of hematopoietic system. Principles/clinical application of cytology as diagnostic tool. How clinical laboratory data is generated/interpreted.",
    "prereq": []
  },
  {
    "uid": "811507",
    "code": "CVM6921",
    "subject": "CVM",
    "number": "6921",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills III",
    "fullname": "Clinical Skills III",
    "info": "Builds on clinical application of first year clinical skills. Include 2-3 clinical skills labs throughout year. Hands on practical experience with live animals. Other options include VMC mini rotations, Humane Society visits, SIRVS, RAVS, Gelding Project, VIDA, VetTouch other student specific proposals. ",
    "prereq": []
  },
  {
    "uid": "811508",
    "code": "CVM6922",
    "subject": "CVM",
    "number": "6922",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Epidemiology",
    "fullname": "Clinical Epidemiology",
    "info": "This course introduces the concepts, principles, and applications of veterinary epidemiology. Veterinary epidemiology is the foundation of health management of animal populations, be they companion animals, livestock or wild populations. Clinical epidemiology provides the basis for medical decision-making in clinical practice. ",
    "prereq": []
  },
  {
    "uid": "811486",
    "code": "CVM6923",
    "subject": "CVM",
    "number": "6923",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Health & Com Practice",
    "fullname": "Public Health and Community Practice",
    "info": "Mixture of didactic classroom lectures/in-class discussions/exercises to provide overview of common zoonotic agents/other veterinary public health issues. Emphasis on case-based public health situations.",
    "prereq": []
  },
  {
    "uid": "811487",
    "code": "CVM6924",
    "subject": "CVM",
    "number": "6924",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Medicine I",
    "fullname": "Small Animal Medicine I",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options, management protocol of common/important hematologic, immunologic, infectious diseases of dogs/cats.",
    "prereq": []
  },
  {
    "uid": "811509",
    "code": "CVM6925",
    "subject": "CVM",
    "number": "6925",
    "honors": false,
    "writingIntensive": false,
    "name": "Diagnostic Laboratory",
    "fullname": "Diagnostic Laboratory",
    "info": "Laboratory experiences designed to help veterinary students practice common clinical tests, understand principles of various types of tests, gain better appreciation of test selection/interpretation. Urinalysis, hematology, serology, detection of parasitic/microbial agents of disease. This course represents an effort to collect the relevant clinical laboratory information needed by the practicing veterinarian. ",
    "prereq": []
  },
  {
    "uid": "812351",
    "code": "CVM6926",
    "subject": "CVM",
    "number": "6926",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Medicine II",
    "fullname": "Small Animal Medicine II",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options and management protocols, and prognosis of urinary tract, gastrointestinal, dental and endocrine diseases of dogs and cats.",
    "prereq": []
  },
  {
    "uid": "812352",
    "code": "CVM6927",
    "subject": "CVM",
    "number": "6927",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Surgery I",
    "fullname": "Small Animal Surgery I",
    "info": "Provide students with the basic knowledge and skills needed to evaluate and treat common small animal surgical diseases. Provide students with background knowledge, problem-solving, and technical skills that will be the basis for clinical rotations and initial years in practice. ",
    "prereq": []
  },
  {
    "uid": "812441",
    "code": "CVM6928",
    "subject": "CVM",
    "number": "6928",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Medicine I",
    "fullname": "Large Animal Medicine I",
    "info": "This course will address the core medical problems of swine; multisystemic infectious diseases of horses and ruminants; and common medical disorders affecting the hematologic, immunologic, urinary, and gastrointestinal systems of horses, ruminants, and camelids. It will provide part of the large animal clinical content needed to pass the National Board Examination, as well as foundation knowledge for subsequent large animal elective courses.",
    "prereq": []
  },
  {
    "uid": "812401",
    "code": "CVM6929",
    "subject": "CVM",
    "number": "6929",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Surgery I",
    "fullname": "Large Animal Surgery I",
    "info": "This class addresses common surgical conditions in large animal species (equine, bovine, camelid and small ruminants) related to wounds,gastrointestinal disorders and musculoskeletal disorders.",
    "prereq": []
  },
  {
    "uid": "016843",
    "code": "CVM6930",
    "subject": "CVM",
    "number": "6930",
    "honors": false,
    "writingIntensive": false,
    "name": "Med Zoo Animals",
    "fullname": "Medical Management of Zoo Animals",
    "info": "Zoo animal handling techniques, including physical/chemical restraint, commonly seen diseases, preventative medicine programs. Adaptation to standard medical practice/management techniques for zoos. Lectures.",
    "prereq": []
  },
  {
    "uid": "014401",
    "code": "CVM6931",
    "subject": "CVM",
    "number": "6931",
    "honors": false,
    "writingIntensive": false,
    "name": "Diseases Zoo & Exotic Animals",
    "fullname": "Diseases of Zoo Animals and Exotic Pets",
    "info": "Diseases of and management procedures for zoo animals and exotic pets. Restraint procedures, medication, diagnosis.prereq: DVM or grad or instr consent",
    "prereq": []
  },
  {
    "uid": "014386",
    "code": "CVM6932",
    "subject": "CVM",
    "number": "6932",
    "honors": false,
    "writingIntensive": false,
    "name": "Gov/Industry/Wildlife Careers",
    "fullname": "Intro to Government, Industry and Wildlife Veterinary Careers",
    "info": "Introductory course for first year veterinary students. Overview of veterinary career opportunities and activities related to non-domestic species including zoo, rehabilitation, wildlife, and conservation medicine, as well as careers in government and private industry.",
    "prereq": []
  },
  {
    "uid": "788061",
    "code": "CVM6933",
    "subject": "CVM",
    "number": "6933",
    "honors": false,
    "writingIntensive": false,
    "name": "Zoo Medicine",
    "fullname": "Zoological Medicine (MNZM)",
    "info": "Introduction to all aspects of health care of zoo animals. Housing, nutrition, preventative health programs. Students assist zoo veterinarians with immobilizations, examinations, necropsies, laboratory work, records keeping.prereq: DVM 3rd or 4th yr or instr consent",
    "prereq": []
  },
  {
    "uid": "013247",
    "code": "CVM6934",
    "subject": "CVM",
    "number": "6934",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Zoo Medicine",
    "fullname": "Selected Topics in Zoo Animal Medicine",
    "info": "Year-long course. Expertise needed by a zoo veterinarian, applications to specific captive species. Manage an animal problem or animal group problem, develop diagnostic/management/therapeutic recommendations, research three topics on an assigned species, build reference materials for case care, present findings to keepers at a selected zoo, develop an item for public education.prereq: [DVM 1st or 2nd yr] or instr consent",
    "prereq": []
  },
  {
    "uid": "812402",
    "code": "CVM6935",
    "subject": "CVM",
    "number": "6935",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Imaging",
    "fullname": "Veterinary Imaging",
    "info": "Introduction to radiographic imaging, foundational principles, imaging modalities, and musculoskeletal, general abdomen and alimentary tract systems. Interpretation of radiographic studies and clinical applications germane to common animal diseases. Lectures and exercises using a body systems approach to imaging of large/small animals. ",
    "prereq": []
  },
  {
    "uid": "816441",
    "code": "CVM6936",
    "subject": "CVM",
    "number": "6936",
    "honors": false,
    "writingIntensive": false,
    "name": "Microscopic Anatomy II",
    "fullname": "Microscopic Anatomy II",
    "info": "Identification, description, and understanding of basic structure and elements of cells and basic tissues. Identify and describe structure and organization of organ systems presented.",
    "prereq": []
  },
  {
    "uid": "812353",
    "code": "CVM6937",
    "subject": "CVM",
    "number": "6937",
    "honors": false,
    "writingIntensive": false,
    "name": "Pharmacology II",
    "fullname": "Pharmacology II",
    "info": "This course covers principles and clinical practices of veterinary toxicology. Mechanisms of action, pharmacokinetics and therapeutic uses of drugs affecting various systems and organs. Basic pharmacodynamics and pharmacokinetic aspects of anti-bacterial, anti-fungal, anthelmintic and anti-neoplastic drugs, including drug mechanism and spectrum of action, side effects and toxicity, and modes of drug resistance that diminish clinical efficacy.",
    "prereq": []
  },
  {
    "uid": "812354",
    "code": "CVM6938",
    "subject": "CVM",
    "number": "6938",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development III",
    "fullname": "Professional Development III",
    "info": "This course is the third of six in the PD course series. Students will continue to work within the CBVE framework and the four domains that are at the heart of the course series. ",
    "prereq": []
  },
  {
    "uid": "812289",
    "code": "CVM6939",
    "subject": "CVM",
    "number": "6939",
    "honors": false,
    "writingIntensive": false,
    "name": "Non-Traditional Pets",
    "fullname": "Non-Traditional Pets",
    "info": "Introduction to the care and handling of a variety of small animals including reptiles, amphibians, rodents, rabbits and ferrets, seen by veterinarians in primary care practice. This course provides an overview of gross and radiographic anatomy, major infectious diseases and their management, and normal behavior in domestic environments.  ",
    "prereq": []
  },
  {
    "uid": "014567",
    "code": "CVM6940",
    "subject": "CVM",
    "number": "6940",
    "honors": false,
    "writingIntensive": false,
    "name": "Cytogenetic Evaluation",
    "fullname": "Cytogenetic Evaluation of Animal Diseases",
    "info": "Five lectures dealing with using cytogenetics in animal disease diagnosis and methods of lab preparation and analysis of chromosomes.  Five lab periods devoted to preparing prophase spreads of chromosomes, staining and photographing, and preparing karyograms for analysis.",
    "prereq": []
  },
  {
    "uid": "812157",
    "code": "CVM6941",
    "subject": "CVM",
    "number": "6941",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills IV",
    "fullname": "Clinical Skills IV",
    "info": "Builds on clinical application of first/2nd year fall clinical skills. Includes clinical skills labs throughout year. Hands on practical experience with live animals. Other options include VMC mini rotations, Humane Society visits, SIRVS, RAVS, Gelding Project, VIDA, VetTouch other student specific proposals.",
    "prereq": []
  },
  {
    "uid": "812158",
    "code": "CVM6942",
    "subject": "CVM",
    "number": "6942",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Pathology II",
    "fullname": "Veterinary Clinical Pathology II",
    "info": "Required readings, didactic classroom lectures, on-line tutorials, group discussions, homework to cover veterinary clinical pathology. Integration of all clinical pathology data available for patient with opportunity for students to distinguish diseases with similar clinical or clinic-pathologic findings.",
    "prereq": []
  },
  {
    "uid": "812355",
    "code": "CVM6943",
    "subject": "CVM",
    "number": "6943",
    "honors": false,
    "writingIntensive": false,
    "name": "Avian Core",
    "fullname": "Avian Core",
    "info": "This course will present information on birds. Successful completion will provide a firm foundation for more advanced avian studies such as companion bird medicine, poultry health, raptor rehabilitation and avian surgery.  Through a blend of didactic lectures, hands-on laboratories, and student-driven inquiry, topics of ornithology, behavior, anatomy, physiology, production management, diseases and basic clinical procedures will be presented. Fundamentals of flock management and nutrition will be covered along with principles of biosecurity and recognition of diseases will be addressed.",
    "prereq": []
  },
  {
    "uid": "814340",
    "code": "CVM6944",
    "subject": "CVM",
    "number": "6944",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Surgery II & Anes",
    "fullname": "Small Animal Surgery II & Anesthesia",
    "info": "This course will introduce the principles of small animal anesthesia, critical care, and will continue the principles of surgery from Surgery I (CVM 6927). The course will consist of lectures laboratories, and a case discussion session.",
    "prereq": []
  },
  {
    "uid": "814314",
    "code": "CVM6945",
    "subject": "CVM",
    "number": "6945",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Medicine II",
    "fullname": "Large Animal Medicine II",
    "info": "Course addresses common medical disorders of the large animal neurological, muscular, cardiovascular, and respiratory systems, as well as core medical problems of swine. It will provide part of the large animal clinical content needed to pass the National Board Examination, as well as foundation knowledge for subsequent large animal elective courses.",
    "prereq": []
  },
  {
    "uid": "814429",
    "code": "CVM6946",
    "subject": "CVM",
    "number": "6946",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Surgery II",
    "fullname": "Large Animal Surgery II",
    "info": "Course concentrates on the principles of anesthesia, identifying surgical conditions of the cardiopulmonary and urogenital systems, common urogenital surgeries and miscellaneous conditions of the head and tail. Species discussed include horses, cattle, small ruminants, and pot-bellied pigs.",
    "prereq": []
  },
  {
    "uid": "814341",
    "code": "CVM6947",
    "subject": "CVM",
    "number": "6947",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Imaging II",
    "fullname": "Veterinary Imaging II",
    "info": "Imaging of the thorax, urogenital tract, and spine. Emphasis on interpretation of radiographic studies and clinical applications germane to common animal diseases. Lectures and active learning exercises using a body system's approach to imaging (primarily radiographic) of small and large animals.",
    "prereq": []
  },
  {
    "uid": "814430",
    "code": "CVM6948",
    "subject": "CVM",
    "number": "6948",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Specialties",
    "fullname": "Comparative Specialties",
    "info": "This course will cover three specialties: dermatology, ophthalmology and behavior. To make it easier for you better recognize the differences in course description, objectives, material and schedule the information pertaining to each specialty will be presented separately.",
    "prereq": []
  },
  {
    "uid": "814443",
    "code": "CVM6949",
    "subject": "CVM",
    "number": "6949",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Theriogenology",
    "fullname": "Comparative Theriogenology",
    "info": "This course develops a broad clinical knowledge of common reproductive management strategies and clinical conditions associated with reproduction in the major domestic species. It provides information and strategies for the conduct of breeding soundness examination and infertility work-ups in the male; estrous cycle characteristics, diagnostics and control in females; breeding management strategies, pregnancy diagnosis and management of gestation; investigation and control strategies for pregnancy loss; management of parturition and treatment of dystocia; normal post-partum changes and diseases of the peri-partum period and the pathophysiology and treatment of uterine infections. Material is presented in both a comparative and species specific manner.",
    "prereq": []
  },
  {
    "uid": "791119",
    "code": "CVM6950",
    "subject": "CVM",
    "number": "6950",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Aquaculture Medicine",
    "fullname": "Introduction to Aquaculture Medicine",
    "info": "General introduction to aquatic medicine. Epidemiology of bacterial, viral, fungal, and parasitic diseases in farmed fish. Emphasizes farmed fish husbandry practices.",
    "prereq": []
  },
  {
    "uid": "791919",
    "code": "CVM6951",
    "subject": "CVM",
    "number": "6951",
    "honors": false,
    "writingIntensive": false,
    "name": "Aquaculture Medicine",
    "fullname": "Aquaculture Medicine (AquaMed)",
    "info": "Basic science of aquatic health/disease. Principles of preventive health management in farmed fish/shellfish, pet fish, and aquarium species.",
    "prereq": []
  },
  {
    "uid": "814342",
    "code": "CVM6952",
    "subject": "CVM",
    "number": "6952",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Skills V",
    "fullname": "Clinical Skills V",
    "info": "This course aims to build on the clinical application of the first two years clinical skills course including further development of physical examination competence and frequently used clinical skill procedures. The course will incorporate a variety of opportunities to practice clinical skills including 1-2 clinical skills labs in the fall, small and large animal hospital practicum and  outside veterinary hospital visits. Other experiences that can be chosen include Humane Society visits, SIRVS, RAVS, Gelding Project, VIDA, VetTouch and other student specific proposals.",
    "prereq": []
  },
  {
    "uid": "814343",
    "code": "CVM6953",
    "subject": "CVM",
    "number": "6953",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development IV",
    "fullname": "Professional Development IV",
    "info": "This course is the fourth in the PD course series. Students will be (re-)introduced to the CBVE framework and the four streams that are at the heart of the course series. Entering veterinary school and the veterinary workforce bring new sets of opportunities and challenges. The overall goal of this program is to help students transition to veterinary school, and later, to the veterinary profession.",
    "prereq": []
  },
  {
    "uid": "814431",
    "code": "CVM6954",
    "subject": "CVM",
    "number": "6954",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Medicine III",
    "fullname": "Small Animal Medicine III",
    "info": "Pathophysiology, clinical presentation, diagnostic approach, therapeutic options and management protocols, and prognosis of cardiopulmonary, neurologic and neoplastic diseases of dogs and cats.",
    "prereq": []
  },
  {
    "uid": "820494",
    "code": "CVM6955",
    "subject": "CVM",
    "number": "6955",
    "honors": false,
    "writingIntensive": false,
    "name": "Community Based Medicine",
    "fullname": "Community Based Medicine at Animal Humane Society-University Ave",
    "info": "Students manage their own small animal cases using a community medicine approach. History taking, physical examination, development of creative diagnostic, and treatment plans using evidence-based incremental care approaches with the specific household in mind, case management, culturally humble client communications, culturally relevant client education, +/- primary care surgery.",
    "prereq": []
  },
  {
    "uid": "815305",
    "code": "CVM6956",
    "subject": "CVM",
    "number": "6956",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Selective I",
    "fullname": "Small Animal Selective I",
    "info": "This course is intended to integrate clinical core knowledge for small animal primary care. Included in this course are the entry level competencies for small animal care in the areas of  preventive care, anesthesia, emergency medicine, cardiology, surgery, nutrition, dermatology and dentistry.  Students will develop the skills and knowledge to maintain health, identify and treat or manage common small animal conditions.",
    "prereq": []
  },
  {
    "uid": "815250",
    "code": "CVM6957",
    "subject": "CVM",
    "number": "6957",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Selective II",
    "fullname": "Small Animal Selective II",
    "info": "Explore advanced content related to small animal practice. Specialties covered in this course include nutrition, dentistry, cardiology, anesthesia, surgery, oncology, ultrasound, and emergency and critical care. Develop the skills and knowledge to treat a variety of small animal diseases and conditions. Practice advanced dental and surgical skills in a laboratory setting",
    "prereq": []
  },
  {
    "uid": "815203",
    "code": "CVM6958",
    "subject": "CVM",
    "number": "6958",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Problems",
    "fullname": "Small Animal Problems",
    "info": "This course uses a mixture of didactic classroom mini-lecture and group discussion and case-based homework to cover a variety of problems encountered in small animal medicine. Problems may be ones listed as presenting complaints by owners of dogs and cats, problems found on physical examination, or laboratory abnormalities encountered in case evaluation. Emphasis will be placed on selection of laboratory tests, interpretation of results, and using results to guide development of a diagnostic and treatment plan for patients. The course will emphasize integration of information introduced in core companion animal systems courses with clinical pathology.",
    "prereq": []
  },
  {
    "uid": "815251",
    "code": "CVM6959",
    "subject": "CVM",
    "number": "6959",
    "honors": false,
    "writingIntensive": false,
    "name": "Orientation Clinical Rotations",
    "fullname": "Orientation to Clinical Rotations",
    "info": "Provides students with an overview and exposure to various topics, issues, and procedures that will be encountered during their senior rotations. The goal of the Orientation to Clinical Rotations course is to facilitate student transition into clinics. The course will include didactic lectures, group exercises, and open discussions. Topics that will be covered include: CVM and VMC policies and procedures, patient flow, SOAPs, discharges, admissions, ICU/wards, patient care, UVIS, client communications, infection control, safety, pharmacy, licensure, and rotation",
    "prereq": []
  },
  {
    "uid": "812448",
    "code": "CVM6960",
    "subject": "CVM",
    "number": "6960",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Selective I",
    "fullname": "Equine Selective I",
    "info": "The primary objective of this elective is to provide the opportunity for third year students interested in equine practice to expand their knowledge and clinical skills beyond core levels achieved in the preceding curriculum. This course includes content and skills that are considered entry level requirements for students who plan to provide clinical care for horses at any level in their practice after graduation. It is the minimum required for students with an interest in care of horses in a mixed animal practice setting and serves as a foundation for further learning and skill development provided in the Equine Selective II, as well as for the equine rotations for senior students.",
    "prereq": []
  },
  {
    "uid": "815302",
    "code": "CVM6961",
    "subject": "CVM",
    "number": "6961",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Selective II",
    "fullname": "Equine Selective II",
    "info": "This elective is designed to provide further opportunity for third-year students focused on equine practice to expand their knowledge and skills beyond core levels achieved in the preceding curriculum and Equine Selective I. Content has been chosen to prepare the student for equine work on the large animal rotations and equine or mixed animal practice. Students will study equine disorders, diagnostic testing, anesthesia, and surgical techniques in greater detail through a combination of lectures and labs, and will practice working through clinical cases in a problem-based format. By the end of the course, students will have improved their general knowledge of equine medicine and practice; recognize common medical disorders; select initial diagnostic tests; be able to perform neurologic and urinary tract examiminations; be able to perform upper airway endoscopy; be able to perform transtracheal wash and bronchoalveolar lavage procedures; and explain therapeutic options for common disorders.",
    "prereq": []
  },
  {
    "uid": "815298",
    "code": "CVM6962",
    "subject": "CVM",
    "number": "6962",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Problems",
    "fullname": "Equine Problems",
    "info": "This course is intended for third year students in the veterinary medicine curriculum. Each two-hour class period will include a review of evidence-based medicine concepts integrated into the discussion or one or more cases during the class period. This course is designed to: 1) Enhance student knowledge of diagnosis, pathophysiology and treatment equine diseases; 2) allow students to develop critical clinical thinking and problem solving skills; 3) to demonstrate the use evidence based medicine in solving clinical problems; 4) to give students the tools necessary to become life-long learners and stay current with advances in veterinary medicine after completion of veterinary school. Students will have the opportunity to create differential diagnosis lists for several common equine presenting complaints, review pertinent literature, and work through several real life cases throughout the semester. By the end of the semester students will be comfortable with the process of case work-up and will be prepared to implement this process during their clinical year.",
    "prereq": []
  },
  {
    "uid": "815328",
    "code": "CVM6963",
    "subject": "CVM",
    "number": "6963",
    "honors": false,
    "writingIntensive": false,
    "name": "Food & Fiber Prac Selective I",
    "fullname": "Food and Fiber Selective I: Food and Fiber Practice",
    "info": "Introduction to food animal practice at any level from mixed practice with backyard producers to dedicated species practitioners. Course will cover principles common to all food animal species. Students will gain exposure to common house and production systems, approaches to treatment and management of common diseases as well as field anesthesia and surgery.",
    "prereq": []
  },
  {
    "uid": "815290",
    "code": "CVM6964",
    "subject": "CVM",
    "number": "6964",
    "honors": false,
    "writingIntensive": false,
    "name": "Food & Fiber Select II",
    "fullname": "Food & Fiber Selective II: Production Medicine",
    "info": "The course will provide a detailed understanding of general principles of swine and ruminant health and production, analytical skills applied to production records and economics, and therapeutic and preventative decision-making for prevalent clinical diseases and syndromes in US swine and ruminant herds.",
    "prereq": []
  },
  {
    "uid": "815329",
    "code": "CVM6965",
    "subject": "CVM",
    "number": "6965",
    "honors": false,
    "writingIntensive": false,
    "name": "Food & Fiber Selective II: SxM",
    "fullname": "Food & Fiber Selective II: Surgery and Medicine",
    "info": "This is a two part course which will build upon previously taught core material to ready the student for competency in: 1) performing routine ruminant surgeries and addressing bovine lameness problems and 2) diagnosing, treating and preventing common problems seen in routine veterinary practice with sheep and goats.",
    "prereq": []
  },
  {
    "uid": "815301",
    "code": "CVM6966",
    "subject": "CVM",
    "number": "6966",
    "honors": false,
    "writingIntensive": false,
    "name": "Apld SmRu & Camelid Practice",
    "fullname": "Applied Small Ruminant and Camelid Practice",
    "info": "This course will build upon previously taught core material focusing on diagnosing, treating, and preventing common problems seen in routine veterinary practice with sheep, goats, and camelids. This course will be a prerequisite for 4th year Small Ruminant and Doe/Kid rotations (unless instructor permission is given). ",
    "prereq": []
  },
  {
    "uid": "815300",
    "code": "CVM6967",
    "subject": "CVM",
    "number": "6967",
    "honors": false,
    "writingIntensive": false,
    "name": "Food and Fiber Animal Problems",
    "fullname": "Food and Fiber Animal Problems",
    "info": "This course uses a mixture of classroom group discussion and case-based assignments to cover a variety of problems encountered in food animal production medicine.  Problems may be ones listed as presenting complaints by owners/producers of food animals (e.g. cattle, swine, small ruminants) problems found on physical examination/herd visits, or abnormalities encountered in case/records evaluation. Emphasis will be placed on applying an epidemiological approach for herd investigations, including records analysis, selection of laboratory tests and interpretation of results. Following diagnosis, students will formulate a plan for treating individual affected animals and develop a preventative health management plan for the herd, as applicable. The course will emphasize integration of information introduced in core food animal systems courses with clinical pathology",
    "prereq": []
  },
  {
    "uid": "815299",
    "code": "CVM6968",
    "subject": "CVM",
    "number": "6968",
    "honors": false,
    "writingIntensive": false,
    "name": "Obstetrics Lab",
    "fullname": "Obstetrics Lab",
    "info": "This is a practical laboratory in which students will have the opportunity to practice obstetric procedures, including a full fetotomy, that were described in lecture during the fall semester Comparative Theriogenology course. Students will be grouped and each group will have two labs occurring on consecutive days; one for correction of dystocia and the second concentrating on fetotomy technique. Within each group, students will work in pairs. The lab uses late term fetuses, obtained from the slaughterhouse, that are placed in dummy cows. While late term fetuses removed from the uterus have less disease risk than dead calves, students are required to wear protective clothing at all times; including gloves (OB sleeves and latex), boots, and coveralls. Face shield will be provided if needed. Students MUST be careful with hygiene during and after the labs (e.g., avoid touching the mouth with dirty hands during the lab and WASH HANDS AFTER THE LAB).",
    "prereq": []
  },
  {
    "uid": "816429",
    "code": "CVM6969",
    "subject": "CVM",
    "number": "6969",
    "honors": false,
    "writingIntensive": false,
    "name": "Large Animal Medicine III",
    "fullname": "Large Animal Medicine III",
    "info": "Course addresses common medical disorders of the large animal neurological, muscular, cardiovascular, and respiratory systems, as well as core medical problems of swine. It will provide part of the large animal clinical content needed to pass the National Board Examination, as well as foundation knowledge for subsequent large animal elective courses.",
    "prereq": []
  },
  {
    "uid": "816430",
    "code": "CVM6970",
    "subject": "CVM",
    "number": "6970",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development V",
    "fullname": "Professional Development V",
    "info": "This course is the fifth in the PD course series. Students will be (re-)introduced to the CBVE framework and the four streams that are at the heart of the course series. Entering veterinary school and the veterinary workforce bring new sets of opportunities and challenges. The overall goal of this program is to help students transition to veterinary school, and later, to the veterinary profession.",
    "prereq": []
  },
  {
    "uid": "816431",
    "code": "CVM6971",
    "subject": "CVM",
    "number": "6971",
    "honors": false,
    "writingIntensive": false,
    "name": "Dermatology",
    "fullname": "Dermatology",
    "info": "Case-base discussion of common dermatological conditions that affect dogs and cats. Students work on clinical cases outside classroom. Cases are discussed in classroom.",
    "prereq": []
  },
  {
    "uid": "816442",
    "code": "CVM6972",
    "subject": "CVM",
    "number": "6972",
    "honors": false,
    "writingIntensive": false,
    "name": "Ophthalmology",
    "fullname": "Ophthalmology",
    "info": "Common procedures for evaluation, diagnosis, and treatment of eye disorders in domestic species.",
    "prereq": []
  },
  {
    "uid": "816432",
    "code": "CVM6973",
    "subject": "CVM",
    "number": "6973",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Behavior",
    "fullname": "Small Animal Behavior",
    "info": "Introduction to abnormal and undesired animal behavior, diagnostic procedures, and behavioral and pharmacological modifications.",
    "prereq": []
  },
  {
    "uid": "817012",
    "code": "CVM6974",
    "subject": "CVM",
    "number": "6974",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Toxicology",
    "fullname": "Veterinary Toxicology",
    "info": "Mechanisms by which common toxicants encountered in residential, natural, and agricultural or industrial settings exert their deleterious effects in animals. Approaches to treating common toxicoses arising from toxicant exposure",
    "prereq": []
  },
  {
    "uid": "817358",
    "code": "CVM6975",
    "subject": "CVM",
    "number": "6975",
    "honors": false,
    "writingIntensive": false,
    "name": "Mixed Animal Problems",
    "fullname": "Mixed Animal Problems",
    "info": "This course uses a mixture of didactic classroom mini-lecture and group discussion and case-based homework to cover a variety of problems encountered in small and large animal medicine and laboratory animal medicine. ",
    "prereq": []
  },
  {
    "uid": "817488",
    "code": "CVM6976",
    "subject": "CVM",
    "number": "6976",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Ruminant Practice Elec",
    "fullname": "Small Ruminant Practice Elective",
    "info": "This course will build upon previously taught core FA material focusing on diagnosing, treating, and preventing common problems seen in routine veterinary practice with sheep and goats. This course will be a prerequisite for 4th year Small Ruminant and Doe/Kid rotations (unless instructor permission is given).",
    "prereq": []
  },
  {
    "uid": "817497",
    "code": "CVM6977",
    "subject": "CVM",
    "number": "6977",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Dairy Production Med I",
    "fullname": "Advanced Dairy Production Medicine I",
    "info": "This rotation will give students the background necessary to provide production medicine related services. The concepts introduced in ODPM will used as a basis to explore topics further. This will allow participants to assist clients in making decisions that enhance their farms productivity, promote animal and financial well-being. ",
    "prereq": []
  },
  {
    "uid": "817498",
    "code": "CVM6978",
    "subject": "CVM",
    "number": "6978",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Dairy Production Med II",
    "fullname": "Advanced Dairy Production Medicine II",
    "info": "This rotation will give students the background necessary to provide production medicine related services. The concepts introduced in ODPM will used as a basis to explore topics further. This will allow participants to assist clients in making decisions that enhance their farms productivity, promote animal and financial well-being. ",
    "prereq": []
  },
  {
    "uid": "819159",
    "code": "CVM6979",
    "subject": "CVM",
    "number": "6979",
    "honors": false,
    "writingIntensive": false,
    "name": "LA ECC",
    "fullname": "Large Animal Emergency and Critical Care Rotation",
    "info": "This rotation is designed to expose senior students to the spectrum of emergency and critical care casesthat may be encountered in general equine and large animal food and fiber practice, and improve theirability to manage such cases swiftly and efficiently. The student experience will involve participation indaytime and after-hours emergency patient receiving and management in the Piper Equine Hospital andLarge Animal Hospital, daily patient rounds, 2 hours daily of classwork and discussion exercisesaddressing key topics in large animal emergency medicine and surgery; and (iv) independent completion ofa written case-based assignment designed to further advance student knowledge and skills related toemergency management. The clinical learning experience will focus on history taking, triage and physicalexamination, identification of problems, and development and execution of diagnostic and therapeutic plansfor both newly-admitted emergency patients and hospitalized critical care patients. In addition, seniorstudents will further their experience with entry-level clinical skills and procedures needed for generalequine and large animal practice.",
    "prereq": []
  },
  {
    "uid": "800355",
    "code": "CVM6980",
    "subject": "CVM",
    "number": "6980",
    "honors": false,
    "writingIntensive": false,
    "name": "Bio, Eco & Con of Lge Mammals",
    "fullname": "Biology, Ecology, and Conservation of Large Mammals",
    "info": "Conceptual/practical framework for large-mammal biology/ecology. How conservation of these species has been and is being addressed.",
    "prereq": []
  },
  {
    "uid": "814908",
    "code": "CVM6981",
    "subject": "CVM",
    "number": "6981",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Correlations I",
    "fullname": "Clinical Correlations I",
    "info": "This course design follows principles of research in learning; prepares students for clinical work as well and what will be expected of them in senior year and, for most, in their career; and prepares students for life-long learning by requiring them to find resources.",
    "prereq": []
  },
  {
    "uid": "814909",
    "code": "CVM6982",
    "subject": "CVM",
    "number": "6982",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Correlations II",
    "fullname": "Clinical Correlations II",
    "info": "This course design follows principles of research in learning; prepares students for clinical work as well and what will be expected of them in senior year and, for most, in their career; and prepares students for life-long learning by requiring them to find resources.",
    "prereq": []
  },
  {
    "uid": "816225",
    "code": "CVM6983",
    "subject": "CVM",
    "number": "6983",
    "honors": false,
    "writingIntensive": false,
    "name": "Study Strategies for Success",
    "fullname": "Study Strategies for Success",
    "info": "This elective course will provide students with information about how learning works and with training in the skills of metacognition to best permit them to develop successful study strategies. Specific skills addressed will include those for study preparation (time management, creating a study space, the role of external factors such as distractions, exercise, and sleep), reading to ensure understanding, review of writing skills, taking notes from readings and in lecture, active review to enhance retention, and test-taking strategies. The course will conclude with information about problem-solving and specific strategies for learning in a clinical environment.",
    "prereq": []
  },
  {
    "uid": "816543",
    "code": "CVM6984",
    "subject": "CVM",
    "number": "6984",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Lab Animal Medicine",
    "fullname": "Introduction to Laboratory Animal Medicine",
    "info": "Understand varying ethical perspectives on the use of animals as research subjects and identify the role and mechanism of regulatory oversight of animal research. Learn basic concepts related to care and husbandry of laboratory animal species and understand the unique anatomic, behavioral, and physiological aspects of common laboratory animal species and identify common clinical diseases of laboratory animals, including pathogenesis, diagnosis, and treatment.",
    "prereq": []
  },
  {
    "uid": "817345",
    "code": "CVM6985",
    "subject": "CVM",
    "number": "6985",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD project",
    "fullname": "PhD Project",
    "info": "Preparation and research for PhD dissertation",
    "prereq": []
  },
  {
    "uid": "817346",
    "code": "CVM6986",
    "subject": "CVM",
    "number": "6986",
    "honors": false,
    "writingIntensive": false,
    "name": "MS Project",
    "fullname": "MS Project",
    "info": "Preparation and research for MS thesis",
    "prereq": []
  },
  {
    "uid": "818366",
    "code": "CVM6987",
    "subject": "CVM",
    "number": "6987",
    "honors": false,
    "writingIntensive": false,
    "name": "Swine and Dairy Welfare",
    "fullname": "Swine and Dairy Welfare",
    "info": "Veterinarians have unique professional responsibilities for advising clients on animal welfare issues, for the development and assessment of compliance programs with animal welfare certification programs, for assisting law enforcement in animal cruelty response, and for providing expertise for animal welfare decision-making by domestic and international policy makers, retailers, businesses and non-governmental organizations. Focusing on the role of welfare in swine and dairy production, this two-week elective will provide senior veterinary students with the skills to collect and interpret animal welfare data, aid clients with identifying and achieving welfare goals, and incorporate welfare into practice.",
    "prereq": []
  },
  {
    "uid": "818369",
    "code": "CVM6988",
    "subject": "CVM",
    "number": "6988",
    "honors": false,
    "writingIntensive": false,
    "name": "ASPCA Spay/Neuter Alliance",
    "fullname": "ASPCA Spay/Neuter Alliance",
    "info": "Practice in elective procedures such as ovariohysterectomies, castrations, hernia repairs, or dewclaw removal for small animals. Animals are supplied by local animal shelters and rescue groups. The surgeries you provide will make them more adoptable. This elective was designed to provide “hands-on” surgery skills and offer a service to the community.",
    "prereq": []
  },
  {
    "uid": "818370",
    "code": "CVM6989",
    "subject": "CVM",
    "number": "6989",
    "honors": false,
    "writingIntensive": false,
    "name": "SNAP A",
    "fullname": "Spay Neuter Anesthesia Practicum  A",
    "info": "This rotation is designed to give you experience in elective procedures such as ovariohysterectomies, castrations, and umbilical hernia repairs on cats and dogs and the anesthesia required for them. Animals are supplied by local animal shelters and rescue groups and the surgeries you provide will make them more adoptable. This course was designed to help you transition into a practitioner capable of anesthesia and surgery for gonadectomies.",
    "prereq": []
  },
  {
    "uid": "818371",
    "code": "CVM6990",
    "subject": "CVM",
    "number": "6990",
    "honors": false,
    "writingIntensive": false,
    "name": "Twin Ports Spay/Neuter",
    "fullname": "Twin Ports Spay/Neuter",
    "info": "Practice in elective procedures such as ovariohysterectomies, castrations, hernia repairs, or dewclaw removal for small animals. Animals are supplied by local animal shelters and rescue groups. The surgeries you provide will make them more adoptable. This elective was designed to provide \"hands-on\" surgery skills and offer a service to the community.",
    "prereq": []
  },
  {
    "uid": "819390",
    "code": "CVM6991",
    "subject": "CVM",
    "number": "6991",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Clinic Rotation",
    "fullname": "Small Animal Clinic Rotation",
    "info": "This rotation is designed to support the students in the Longitudinal Integrated Clinics program by providing a progressive, tailored program that allows individuals to gain competency in small animal clinics through mentoring, feedback and progressive entrustment.",
    "prereq": []
  },
  {
    "uid": "819466",
    "code": "CVM6992",
    "subject": "CVM",
    "number": "6992",
    "honors": false,
    "writingIntensive": false,
    "name": "Vet Genetics and Genomics",
    "fullname": "Veterinary Genetics and Genomics",
    "info": "This course integrates principles of genetics and genomics, with the goals of illustrating how an understanding of these molecular biosciences enables a better understanding of the many mechanisms at play in animal health and disease. ",
    "prereq": []
  },
  {
    "uid": "819498",
    "code": "CVM6993",
    "subject": "CVM",
    "number": "6993",
    "honors": false,
    "writingIntensive": false,
    "name": "Thrive through life",
    "fullname": "Thrive through life",
    "info": "This is a small animal course is a mixture of didactic classroom lectures, laboratory exercises and small group discussions. It will integrate key concepts of nutrition, behavior and dentistry for optimal care of small animals from birth to geriatric care.",
    "prereq": []
  },
  {
    "uid": "819631",
    "code": "CVM6994",
    "subject": "CVM",
    "number": "6994",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Dermatology",
    "fullname": "Small Animal Dermatology",
    "info": "Examine the processes and procedures used to identify and treat disorders within the specialty ofdermatology. Develop the skills necessary to formulate a logical list of differential diagnoses based onhistory and clinical presentation. Acquire the skills to diagnose and manage the most commondermatological conditions that affect large and small animals.",
    "prereq": []
  },
  {
    "uid": "820059",
    "code": "CVM6995",
    "subject": "CVM",
    "number": "6995",
    "honors": false,
    "writingIntensive": false,
    "name": "Communications in SA practice",
    "fullname": "Communications in small animal practice",
    "info": "Educational research on the Primary Care service and surveys of new and recent graduates identified the following common communications problems: difficulty chunking and checking information provided to clients, difficulty providing recommendations confidently, and concern about managing difficult client conversations. This is a 2-week rotation during which students will review basic and advanced communication skills and practice client communications by giving common spiels, role-playing talking to clients in difficult situations, role-playing preparing and talking to clients through common case presentations, and preparing clienteducation materials.",
    "prereq": []
  },
  {
    "uid": "819547",
    "code": "CVM6996",
    "subject": "CVM",
    "number": "6996",
    "honors": false,
    "writingIntensive": false,
    "name": "Journey to the DVM",
    "fullname": "Journey to the DVM",
    "info": "This is an elective review course, available to all students to help them continually re-test themselves as a way to help increase retention and prepare them for boards. It is set up as a game. Students start as “Backpackers” and work their way up through the ranks by completing ethics case write ups, completing on-line clinical decision-making cases, answering NAVLE-type questions, and writing illness scripts for common disorders in all species.",
    "prereq": []
  },
  {
    "uid": "819962",
    "code": "CVM6997",
    "subject": "CVM",
    "number": "6997",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Clinical Experience",
    "fullname": "Clinical Experience",
    "info": "This is  1-week clinical experience with virtual and or hands-on training under the supervision of a veterinarian or trained professional in a related profession that fosters clinical decision-making and growth in the areas of veterinary knowledge, technical skills, and/or professionalism. ",
    "prereq": []
  },
  {
    "uid": "820175",
    "code": "CVM6998",
    "subject": "CVM",
    "number": "6998",
    "honors": false,
    "writingIntensive": false,
    "name": "Evidence Based Decision Making",
    "fullname": "Evidence Based Clinical Decision Making",
    "info": "This course allows students to use evidence based medicine principles to answer clinical questions. This includes incorporating patient values, clinical experience, and the best evidence. We will start with assigned reading of specific journal articles and discussion of those articles and their evidentiary value. We will then move to clinical cases that naturally elicit a clinical question. The students will search relevant data bases to find possible sources for the answer, read the sources to determine the best evidence, write a clienteducation handout justifying the recommendation. ",
    "prereq": []
  },
  {
    "uid": "806068",
    "code": "CVM6999",
    "subject": "CVM",
    "number": "6999",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study OOSS",
    "fullname": "Directed Study for Out of Sync Student",
    "info": "Directed study.",
    "prereq": []
  }
]