[
  {
    "uid": "819210",
    "code": "DBLN1101",
    "subject": "DBLN",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819211",
    "code": "DBLN1102",
    "subject": "DBLN",
    "number": "1102",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their UMN transcript.",
    "prereq": []
  },
  {
    "uid": "819212",
    "code": "DBLN1103",
    "subject": "DBLN",
    "number": "1103",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819213",
    "code": "DBLN1104",
    "subject": "DBLN",
    "number": "1104",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819214",
    "code": "DBLN1105",
    "subject": "DBLN",
    "number": "1105",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819265",
    "code": "DBLN1201",
    "subject": "DBLN",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819266",
    "code": "DBLN1202",
    "subject": "DBLN",
    "number": "1202",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819267",
    "code": "DBLN1203",
    "subject": "DBLN",
    "number": "1203",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819268",
    "code": "DBLN1204",
    "subject": "DBLN",
    "number": "1204",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819269",
    "code": "DBLN1205",
    "subject": "DBLN",
    "number": "1205",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "818652",
    "code": "DBLN2051",
    "subject": "DBLN",
    "number": "2051",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Accounting",
    "fullname": "Financial Accounting",
    "info": "This course is concerned with providing students with an understanding of and ability to apply the fundamentals of accounting. It presumes no prior knowledge of accounting from previous levels, however there is material that students who have studied the subject before will find challenging. The student is introduced to the key concepts underlying accounting and recording business transactions. It also encompasses the preparation of financial statements for different business entities. It sets the foundation for further study in the area and assist with the student underlying understanding of accounting. There is also a strong emphasis on financial statement analysis and understanding annual reports.",
    "prereq": []
  },
  {
    "uid": "818653",
    "code": "DBLN2551",
    "subject": "DBLN",
    "number": "2551",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Statistics",
    "fullname": "Business Statistics, Data Sources, Presentation and Analysis",
    "info": "This course is concerned with providing students with an understanding of and ability to apply (1) exploratory data analysis, (2) basic inferential procedures, (3) regression analysis, and (4) experimental design. The methods to be covered have been selected for their relevance to managerial decision making, and problem solving, and to other courses in the undergraduate curriculum. Beyond simply teaching the application of these methods, a primary objective of the course is to improve students' \"statistical thinking abilities.\"",
    "prereq": []
  },
  {
    "uid": "797827",
    "code": "DBLN3001",
    "subject": "DBLN",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Literature",
    "fullname": "Literature",
    "info": "Modern Irish writing, 1890?2003, celebrating range/diversity of Irish literature from Yeats to Joyce to present. Intensive reading on founding figures of modern literature, their influence on succeeding generations. Selected novels, short stories, and poetry.",
    "prereq": []
  },
  {
    "uid": "797828",
    "code": "DBLN3002",
    "subject": "DBLN",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Drama",
    "fullname": "Drama",
    "info": "Literary/cultural framework for studying tradition of Irish drama from 19th century to present. World of Irish plays/playwrights through text/performance. Yeats and the founding of a national theatre. Works of Synge, O'Casey, and Beckett. Contemporary playwrights such as Brian Friel, Tom Murphy, Frank McGuinness, and Marina Carr.",
    "prereq": []
  },
  {
    "uid": "797829",
    "code": "DBLN3003",
    "subject": "DBLN",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "History",
    "fullname": "History",
    "info": "Eventful period in Irish history, from post famine era to present day. Home Rule Crisis, role of Parnell, Origins of Easter Rising of 1916. War of Independence. Effects of Civil War. Foundation of state. Partition, constitutional developments. Development of both states, evolution of politics North/South.",
    "prereq": []
  },
  {
    "uid": "797830",
    "code": "DBLN3004",
    "subject": "DBLN",
    "number": "3004",
    "honors": false,
    "writingIntensive": false,
    "name": "Gaelic Culture",
    "fullname": "Gaelic Culture",
    "info": "Celtic mythology and folk tradition. Linguistic/cultural heritage of Gaelic civilization. Oral/written traditions of Irish language. Current state of Irish speaking world. Epic figures, heroic events in Celtic mythology. Oral tradition of folklore of Norse, Norman, Scot, and English.",
    "prereq": []
  },
  {
    "uid": "797831",
    "code": "DBLN3005",
    "subject": "DBLN",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "Visual Culture",
    "fullname": "Visual Culture",
    "info": "Interdisciplinary look at visual culture in Ireland.   Archaeology, art, architecture, film, television, and video with reference to relevant literary, social, and cultural contexts.",
    "prereq": []
  },
  {
    "uid": "797832",
    "code": "DBLN3006",
    "subject": "DBLN",
    "number": "3006",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Issues",
    "fullname": "Critical Issues",
    "info": "Critical issues facing Ireland, North and South. Relationships with Britain, Europe, the U.S., and developing world. Economics, sociology, politics, religion, culture.",
    "prereq": []
  },
  {
    "uid": "816820",
    "code": "DBLN3010W",
    "subject": "DBLN",
    "number": "3010",
    "honors": false,
    "writingIntensive": true,
    "name": "Playwrght Prac 21-Cent Ireland",
    "fullname": "The Playwright in Practice: Writing for the Stage in 21st Century Ireland",
    "info": "Irish playwrights have contributed disproportionately to the output of English-language drama over the course of the 20th century, creating some of the most memorable dramatic literature of the last hundred years. With that in mind, this intensive practical playwriting course will interrogate the tradition of theatrical writing in the Irish capital of Dublin by engaging comprehensively with a variety of modes and disciplines specific to the act of writing for the Irish stage. Contemporary Dublin has undergone an unprecedented process of modernization rarely seen in the developed world, with the city becoming in just twenty years a multicultural, cosmopolitan space that is embracing provocative ways of seeing and creating work meant for theatrical performance. Questions about the relevancy of the practice of writing in creating performance, how authorship of a play is determined, and the slipperiness of language are now at the heart of Irish theatre?s drive to redefine itself. Challenged by a wide range of disciplinary approaches to writing and rewriting, students will be exposed to a host of methodologies for creating dramatic literature for the stage specific to this unique moment in Irish theatrical history and, in the process, gain an appreciation for the important role writers still play in making theatrical performance. ",
    "prereq": []
  },
  {
    "uid": "816821",
    "code": "DBLN3011",
    "subject": "DBLN",
    "number": "3011",
    "honors": false,
    "writingIntensive": false,
    "name": "Storytelling: Irish Narratives",
    "fullname": "Storytelling: Writing Irish Cultural Narratives",
    "info": "Study abroad course. What does it mean to tell a story? Does it matter why or how someone tells a story? Storytelling is an Irish oral tradition that dates back to Celtic mythology, but is also important to modern day Ireland. This course will examine how storytelling brings Ireland to life, and how Dublin and Ireland are represented in stories. How can you use a building, a street, a painting, or a performance to construct a story that can be shared with others, and that creates a narrative that resonates with the specific time and history of that place? The course will look at the tradition of the short story in Irish writing, and also the development of the Irish novel. Students will also think about their own stories, and how they can be told.",
    "prereq": []
  },
  {
    "uid": "816822",
    "code": "DBLN3012",
    "subject": "DBLN",
    "number": "3012",
    "honors": false,
    "writingIntensive": false,
    "name": "Engaging Ireland",
    "fullname": "Engaging Ireland: Past, Present and Future",
    "info": "Study abroad course. All students studying in Dublin will take this course, regardless of their track choice. This course has three main components: gain knowledge of Ireland past and present through modules focused on areas such as economics, religion, language, sports, and education; engage with the host-country with activities such as internship, research, performance, volunteer, sports team, or teaching practicum; and explore Ireland through a range of study tours to Western Ireland and Northern Ireland.",
    "prereq": []
  },
  {
    "uid": "816823",
    "code": "DBLN3013",
    "subject": "DBLN",
    "number": "3013",
    "honors": false,
    "writingIntensive": false,
    "name": "Performance in Irish Context",
    "fullname": "Performance in Irish Context",
    "info": "Study abroad course. Students will study and actively participate in the art of performance, focusing on Irish writers like Samuel Beckett, Brian Friel, Conor McPherson, Martin McDonough and more. Actor training, and so this course, is physical, emotional and intellectual. The work will include vocal training and expression, dynamic conditioning of the instrument of the body, and textual analysis. In addition the course will help actors unlock the specific voices of Irish playwrights. Students will work on scenes and monologues as well as their own improvisations.This will be an acting class, and will require one previous fundamentals of acting or performance class at your home institution, or permission by the instructor.",
    "prereq": []
  },
  {
    "uid": "816824",
    "code": "DBLN3014",
    "subject": "DBLN",
    "number": "3014",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin Internship",
    "fullname": "Dublin Internship: Learning through Experience",
    "info": "Study abroad course. This course explores the world of work in Ireland and how students respond to the challenges that they can expect to encounter while interning in Dublin.",
    "prereq": []
  },
  {
    "uid": "817122",
    "code": "DBLN3015",
    "subject": "DBLN",
    "number": "3015",
    "honors": false,
    "writingIntensive": false,
    "name": "Irish Literature and Film",
    "fullname": "Irish Literature and Film",
    "info": "This course will examine dominant images of Ireland in film and literature from Romantic Ireland and the images of the Celtic Revival, to the harsher realities of Irish life and the transformations of Irish society under modernity and globalization. Issues discussed will include emigration and immigration; nostalgia and loss; gender, family and community; Church and State; politics and violence; language and communication, and the country and city.",
    "prereq": []
  },
  {
    "uid": "825272",
    "code": "DBLN3016",
    "subject": "DBLN",
    "number": "3016",
    "honors": false,
    "writingIntensive": false,
    "name": "International Marketing",
    "fullname": "International Marketing",
    "info": "This International Marketing course will help you develop an understanding of the scope and challenges of marketing in the international context. The course examines how the global dimensions technology, research, capital investment, and production impact marketing, distribution, and communication networks. The breadth of this course will provide insights into the increasingly interdependent global economic and physical environment and its impact on international marketing. Globalisation has led to increasing interdependence. “Connecting the dots” has thus become essential to the survival and success of businesses, even those not operating in the international arena. By examining these linkages, students will gain an understanding of how companies develop strategic plans that are competitive to survive and succeed in these global markets. The unique localised content provided by the CAPA centres will present further regional insights into the key issues surrounding marketing from an international perspective.With its global presence, CAPA offers students the opportunity to enrich their academic experience by exposing and exploring the localised context of the CAPA Dublin Centre.Ireland is a small open economy, and its financial well-being depends largely on international trade and influenced by global markets. As one of the 27 member states of the European Union (EU), Ireland has a modern economy based on free trade and foreign direct investment (FDI) as the pathways to growth. Ireland’s high competitiveness ranking is attributed to three key areas, including access to talent, openness to foreign ideas, and agility to respond to new challenges.Dublin is an entrepreneurial city and home to many of the world’s top players in technology, finance, professional services, and science and health. The vibrant culture, creative economy, and business-friendly environment make it the ideal location for students to immerse themselves while exploring a city that consistently ranks as a one the top European cities of culture and competitiveness.",
    "prereq": []
  },
  {
    "uid": "825273",
    "code": "DBLN3017",
    "subject": "DBLN",
    "number": "3017",
    "honors": false,
    "writingIntensive": false,
    "name": "International Economics",
    "fullname": "International Economics",
    "info": "The International Economics module provides an understanding of the key economic issues in the global business environment. The course provides an understanding of how global businesses are impacted by real world developments in economics, politics, and finance. The business environment is dynamic in nature. The course coverage is therefore updated periodically to include current real-world evidence as well as recent academic and empirical findings. The five broad topics covered in the course are: Globalisation, Country Differences, Cross-Border Trade and Investment, the Global Monetary System, and Competing in a Global Market Place.",
    "prereq": []
  },
  {
    "uid": "825275",
    "code": "DBLN3018",
    "subject": "DBLN",
    "number": "3018",
    "honors": false,
    "writingIntensive": false,
    "name": "Analyze and Explore the City",
    "fullname": "Analyzing and Exploring the Global City",
    "info": "Cities around the world are striving to be “global.” This interdisciplinary course focuses on the physical, socio-economic, political, and cultural development of Dublin through space and time. Before students explore the city, chronologically they will examine ancient Ireland’s globality in terms of its educational and religious influences, particularly on mainland Europe. Then, starting from the 10th Century, students will retrace the Viking city through to the city’s current form that is characterised by urban sprawl, multiculturalism, and its connection to Europe and the global economy. Much of the first half of the course will explore the creation of the colonial city (Georgian Dublin) and, following independence from Britain, the creation of the postcolonial city. Each of these phases in the city’s morphology can be witnessed/read through an examination of the city’s architecture, nomenclature, museums, art, and in relation to the post-colonial city, oral histories, which requires an interdisciplinary toolkit for city exploration and analysis. The second section of the course will explore the policies that fostered the rapid speed at which Dublin grew from being a sparsely populated, non-industrial and disconnected urban space in the 1970s to a post-industrial/post-modern relatively highly populated dense plural space in the 1990s. Students will investigate the relationship between these policies and the devastating recession of the 2000s. Students will also explore the result of these rapid physical and socio-economic and cultural changes in terms of gentrification, immigration, and the complicated and contested nature of inner city residents’ notions of place, space, and identity. Students will also explore the creation of new multiethnic spaces and the city’s rebranding as a literary-cultural space (tourist Dublin). Finally, students will investigate the processes that occur in most global cities, which contribute to the creation of invisible spaces and subcultures that are found on the physical and cultural margins.",
    "prereq": []
  },
  {
    "uid": "825412",
    "code": "DBLN3019",
    "subject": "DBLN",
    "number": "3019",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics in the Media",
    "fullname": "Ethics in the Media",
    "info": "This course will address the principal ethical issues facing journalism, advertising, entertainment media, and online content. It will examine the moral obligations of the producers as well as the responsibilities borne by consumers. The course will provide an overview of the applicable ethical principles and philosophies, then apply these to present-day cases in the media through case studies. Finally, students will learn to critically engage with the content to analyse for themselves the ethical issues that are present in the production and consumption of the media on an individual and societal level.",
    "prereq": []
  },
  {
    "uid": "826223",
    "code": "DBLN3021",
    "subject": "DBLN",
    "number": "3021",
    "honors": false,
    "writingIntensive": false,
    "name": "International Business",
    "fullname": "International Business",
    "info": "This course aims to develop American students’ understanding of business environments in an international context, with a specific focus on Ireland and the European Union. Students will study the political, economic, and ethical contexts for policy and business operations as well as the cultural context of doing business within international/global contexts. Students will compare and contrast this new understanding with their existing knowledge of business policy and practice within America. In this case, as a result of taking this course, which includes site visits to international companies in Dublin and or guest speakers, students will be better placed to have the broad perspectives required of successful managers working in an increasingly globalized world and workforce. This includes an understanding of the challenges and adaptations required to succeed in host countries and regions with differing cultural, political, legal, and economic systems.",
    "prereq": []
  },
  {
    "uid": "819224",
    "code": "DBLN3101",
    "subject": "DBLN",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819225",
    "code": "DBLN3102",
    "subject": "DBLN",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819226",
    "code": "DBLN3103",
    "subject": "DBLN",
    "number": "3103",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819227",
    "code": "DBLN3104",
    "subject": "DBLN",
    "number": "3104",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819228",
    "code": "DBLN3105",
    "subject": "DBLN",
    "number": "3105",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ. College Dublin Course",
    "fullname": "University College Dublin Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin and Business in Dublin study abroad programs to represent a course taken at University College Dublin. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819270",
    "code": "DBLN3201",
    "subject": "DBLN",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819271",
    "code": "DBLN3202",
    "subject": "DBLN",
    "number": "3202",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819272",
    "code": "DBLN3203",
    "subject": "DBLN",
    "number": "3203",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819273",
    "code": "DBLN3204",
    "subject": "DBLN",
    "number": "3204",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "819274",
    "code": "DBLN3205",
    "subject": "DBLN",
    "number": "3205",
    "honors": false,
    "writingIntensive": false,
    "name": "Dublin City University Course",
    "fullname": "Dublin City University Course",
    "info": "This is a course shell that will be used on the Study Abroad in Dublin study abroad program to represent a course taken at Dublin City University. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "uid": "825379",
    "code": "DBLN3375",
    "subject": "DBLN",
    "number": "3375",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Internship: Dublin",
    "fullname": "Global Internship: Dublin",
    "info": "The Global Internship Course (GIC) provides a unique and innovative opportunity for students to engage in an internship (and living abroad experience) while supported by academic in class and online educational sessions to further develop their personal and professional skills while earning academic credit. GIC students also partake in out-of-class guided and self-guided activities and excursions that have been devised to enable students to become more comfortable with, and knowledgeable of, their internship locations/neighbourhoods. Furthermore, a day-long field trip illustrates how socio-political and economic factors, such as the effects of housing costs in global cities, necessitate commuting and changing work practices such as flexible working hours and working remotely that embody best practice in well-being. Field excursions vary and may also include a focus on, for example, corporate social responsibility and sustainability. The GIC fits in with CAPA's philosophy and practice of enabling students to learn about the social and cultural context of their internship placement and the host region and country, as well as other GIC themes, through comparative global analysis. At times, this analysis will be facilitated through a small selection of CAPA Masterclasses and our “In Conversation with:_______” series given by leading professionals from a diverse range of fields. The in-class active learning approach gives students the opportunity to discuss and analyze theories and models of work, organizational behavior and management in a cross-cultural context. COVID-19 has, by necessity, and in time, by choice, increased the extent to which employees work remotely. The GIC will help students to work effectively in a partial and/or, if required, full-time remote capacity should the need arise and to demonstrate to students the competencies and skills that they will gain and demonstrate through remote engagement. A variety of teaching and learning activities will be used; for example: lecture, workshop, discussion, informal and formal presentations, self-guided and guided research, and mock (recorded) interviews. The assessment mechanisms are all designed to support learning, using the internship and living abroad experience as a vehicle. Above all, the in-class CAPA sessions give students the opportunity to listen to individual experiences, compare and contrast activities with others, and consider the experience in terms of their personal and professional development. At the beginning we focus on self-reflection, and at the end of this process we challenge each student to focus on self-projection. At its core, GIC provides an opportunity for students to unpack, synthesise, and articulate (the value of) their learning. It is, therefore, our intention that students will treat these on-site sessions with the same dedication and professionalism that we expect the students to display at their internships. Students will undertake an intensive orientation session to help them prepare for and integrate into their placements. Additional resources and readings to aid students' personal and professional development will be provided. Central to the pedagogy of GIC is self-reflection and collaboration; we value the diverse socio-cultural and academic backgrounds our students bring to the course and see the multi- and interdisciplinary nature of GIC as a plus for discussion and collaboration. Students with prior knowledge of certain topics covered in class are encouraged to share their knowledge in a mentoring capacity with their peers and to build upon their knowledge by considering such topics from other academic disciplines and global and practical perspectives. The content of this course is arranged around three key themes: Personal and Professional Development, Intercultural Competence, and Comparative Analysis. ",
    "prereq": []
  }
]