[
  {
    "uid": "808387",
    "code": "DES1000",
    "subject": "DES",
    "number": "1000",
    "honors": false,
    "writingIntensive": false,
    "name": "D@MN: Design@Minnesota",
    "fullname": "D@MN: Design@Minnesota",
    "info": "In DES 1000, students learn to use an iterative design process to define real-world challenges, and propose innovative solutions for social impact. Building soft-skills such as collaboration, visual and verbal communication, and empathy is a critical outcome of the course.",
    "prereq": []
  },
  {
    "uid": "817375",
    "code": "DES1001",
    "subject": "DES",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Introducing College of Design",
    "fullname": "Introducing the College of Design",
    "info": "DES 1001 Is a 1 cr. topics course. This course provides a set of experiences that help to explain the concepts of design through the lenses of different fields of design, both traditional and emerging, within the College of Design. Students from various design disciplines will engage in design experiences that teach them how designers from different fields identify, define and solve problems. They will be introduced to the resources offered to designers in the College of Design through hands-on experiences. Students will reflect upon their experiences byparticipating in a series of experiences, by submitting a series of reflection pieces, and completing a culminating project that will be shared with class members and invited stakeholders. Through this engagement, students will learn about each other and their motivations for being in the College of Design, as well as gain an understanding of the breadth of the college and its resources as they begin their design education.",
    "prereq": []
  },
  {
    "uid": "818243",
    "code": "DES1002",
    "subject": "DES",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Improvisation for Design",
    "fullname": "Improvisation for Design",
    "info": "This course explores how the art of improvisation can build collaboration, communication, and creativity skills. In this class we will focus on how improvisation is applied to fields of design, however these skills may be applicable to other disciplines. Through both readings and an interactive curriculum of improv exercises, students will learn specific tools to facilitate idea generation, collaborative team processes, idea selection, sketching and critique. ",
    "prereq": []
  },
  {
    "uid": "012925",
    "code": "DES1101W",
    "subject": "DES",
    "number": "1101",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Design Thinking",
    "fullname": "Introduction to Design Thinking",
    "info": "Theories/processes that underpin design thinking. Interactions between humans and their natural, social, and designed environments where purposeful design helps determine quality of interaction. Design professions.",
    "prereq": []
  },
  {
    "uid": "801487",
    "code": "DES1111",
    "subject": "DES",
    "number": "1111",
    "honors": false,
    "writingIntensive": false,
    "name": "Creative Problem Solving",
    "fullname": "Creative Problem Solving",
    "info": "Development of creative capability applicable to all fields of study. Problem solving techniques. Theory of creativity/innovation.",
    "prereq": []
  },
  {
    "uid": "801484",
    "code": "DES1160",
    "subject": "DES",
    "number": "1160",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "Topics in design.",
    "prereq": []
  },
  {
    "uid": "788928",
    "code": "DES1170",
    "subject": "DES",
    "number": "1170",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "In-depth investigation of specific topic, announced in advance.",
    "prereq": []
  },
  {
    "uid": "800748",
    "code": "DES1201",
    "subject": "DES",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "SEAM Seminar",
    "fullname": "SEAM Seminar",
    "info": "Topics in design.",
    "prereq": []
  },
  {
    "uid": "805763",
    "code": "DES1202",
    "subject": "DES",
    "number": "1202",
    "honors": false,
    "writingIntensive": false,
    "name": "Discovering Majors and Careers",
    "fullname": "Discovering Majors and Careers",
    "info": "Five stages in the career discovery process: self-assessment, exploration, decision making, experiencing, and implementing. Determining next steps in academic/career process.",
    "prereq": []
  },
  {
    "uid": "817347",
    "code": "DES1401",
    "subject": "DES",
    "number": "1401",
    "honors": false,
    "writingIntensive": false,
    "name": "Beyond the Suburbs",
    "fullname": "Beyond the Suburbs: Living and Working in Rural America",
    "info": "Beyond the suburbs lies rural America. Whether you grew up in the country or in the city, you probably have some ideas about rural places. Maybe you think of small rural towns as ideal places to grow up and grow old, quiet places that are safe from crime, without traffic and pollution, or maybe you think of rural places asbackward, boring, and bleak. In this class, we'll explore various myths and realities of life beyond the suburbs. We'll discover what is unique about rural places. We willexamine who lives in rural America and how they make a living. We'll explore the concept of rural design and learn more about housing issues facing ruralcommunities. We will discuss how \"rural\" varies across the country. From cowboys to downhill skiers, from tourists to farmers and foresters, life in rural America is wildlyvaried and fascinating. Join us and discover more about life and livelihoods beyond the suburbs.",
    "prereq": []
  },
  {
    "uid": "818197",
    "code": "DES1402",
    "subject": "DES",
    "number": "1402",
    "honors": false,
    "writingIntensive": false,
    "name": "Homelessness",
    "fullname": "Homelessness: Understanding the Issues and Proposal Solutions",
    "info": "Housing directly affects physical, mental, and spiritual well-being, and access to education, employment, human service, and social networks. We will explore issues of homelessness including how it is defined and perceived, causes of homelessness, the long- and short-term effects on individuals and families, and the consequences of homelessness at the community level. We will explore philosophies and programs designed privilege that contribute to those disparities. Public policy at the local and national levels will be examined as it both creates and minimizes experiences of homelessness.Students will be challenged to think critically and ethically about homelessness through reading, writing, discussion, and visits to local homeless shelters. Over the semester, we will discuss and evaluate research-based information and information presented in the media. The goal is for students to develop skills in locating and evaluating research-based information, and in listening and forming cogent arguments. We will engage in the peer review process, to help them function as a collaborative work group and improve presentation. Furthermore, interactions with families and individuals experiencing homelessness and housing providers combined with reflective writing will encourage students to explore biases about poverty and a sense of responsibility to address poverty as a social issue. Finally, based on their interests, discussion, and engagement experiences, students will develop a cogent explanation of homelessness and propose a solution. It is my responsibility to provide a safe and supportive learning environment where students can challenge their assumptions and biases, develop empathy for individuals experiencing homelessness, and learn to develop their own proposal for change that is grounded in solid information and experiences.",
    "prereq": []
  },
  {
    "uid": "817078",
    "code": "DES1403",
    "subject": "DES",
    "number": "1403",
    "honors": false,
    "writingIntensive": false,
    "name": "Impressionism Paris & S France",
    "fullname": "Impressionism in Paris and Southern France",
    "info": "This FRESHMAN SEMINAR explores the revolution of French Impressionism. Students will examine art and climate, as well as how developments in science and technology transformed the art world with fresh depictions of daily life and promoted a new appreciation of light and color. Students will consider historical images of urban and suburban settings (cafe, theater, garden, seaside, salon, etc.) and how the \"new\" handling of paint captured the immediacy of experience. The body of knowledge in this course is focused on a specific revolution in French Art (Impressionism), how that was influenced by science and the culture of the times and how that influenced the world in ripple effect. In this Liberal Education course, students will build and maintain community with exercises designed to purposefully build trust in team and teamwork. Tasks are designed to create an environment where students build ways of staying centered, a critical part of making the adjustment to the college experience, as well as to life as an adult They will connect knowledge and practice, using right-and-left brain strengths. Students will expand their ability to see from different perspectives (within the group and experiencing a different culture). They will purposefully build trust in a team and teamwork, improving trust in their ability to share and communicate. Students will gain Global Perspective by learning about and experiencing diverse approaches to creative practices. This will be explored in relation to the history of French Impressionism. Participants will visit museums in the Twin Cities and France, discussing how and why Impressionism developed (influences, the impact of the movement over time.) They will learn how science and technology were instrumental in the development of an art movement in 1860 and consider how science and technology might influence creative visuals today. This experience is designed to build and expand connections to vision, creativity, and a moment in history. The course content is designed to enable students a voice in creating a personal historical context. They will reflect upon and research influences in a Cultural Comparison Paper. Students will investigate culture via various exercises in drawing and watercolor, investigating daily life with parallel methods of interpretation, in the Twin Cities and in France. Over spring break, students will visit and draw sites where the Impressionists worked. They will discuss and reflect on the implications of the course material relative to their own lives. They will learn about and experience diverse approaches to creative practices. This will be further explored in relation to the history of French Impressionism. This Liberal Education experience is designed to build and expand connections to vision, creativity, and a moment in time through the lens of French culture. REQUIRED: Willingness to draw, regardless of skills, open mind, willingness to instigate and participate in the exploration and debate of ideas. NOT REQUIRED: Developed drawing or sketching skills.",
    "prereq": []
  },
  {
    "uid": "817062",
    "code": "DES1404",
    "subject": "DES",
    "number": "1404",
    "honors": false,
    "writingIntensive": false,
    "name": "Housing Matters",
    "fullname": "Housing Matters",
    "info": "Housing directly affects our physical and mental health, children's educational attainment, our economic opportunities, our transportation patterns and dependencies, and the environment. However, not all people are able to achieve the same levels of well-being because of disparities due to race, ethnicity, and class as they seek to obtain stable, secure, and affordable housing in supportive neighborhoods and communities. We will explore issues of power and privilege that contribute to those disparities. Public policy at the local and national levels will be examined as it both creates and minimizes social inequities in housing.",
    "prereq": []
  },
  {
    "uid": "817107",
    "code": "DES1405W",
    "subject": "DES",
    "number": "1405",
    "honors": false,
    "writingIntensive": true,
    "name": "Building Vision",
    "fullname": "Building Vision",
    "info": "The desire to succeed and do well can sometimes circumvent one's willingness to embrace challenge in order to safely achieve an outcome (not fail). This freshman seminar aims to break down barriers and fears while developing processes toward new ways of seeing. It builds and expands connections to a larger world of ideas and disciplines. Through weekly exercises in visual story-telling, participants will sharpen their ability to see (the real world as well as the imagined). Projects are constructed to challenge perceived personal limitations in ideation and process and to build a way of communicating in a visual manner. This seminar is for individuals interested in expanding personal ways of seeing, thinking, and doing, individuals interested in developing a personal process in the evolution of ideas. It includes lectures, student-led discussions, demonstrations, classroom activities, field trips, and homework. Various media will be used to build a visual journal and to build skills in articulation. While drawing will be a component, students need not be skilled, just willing. A writing component will help students gain skills in understanding connections between right brain and left brain functions. They will find relationships between self-expression via the written word and self-expression through visual work. Many who do visual work, become tongue-tied at explaining the deeper concepts behind their work. This course will build a long lasting confidence by building skills in visual and verbal expression.",
    "prereq": []
  },
  {
    "uid": "817469",
    "code": "DES1406W",
    "subject": "DES",
    "number": "1406",
    "honors": false,
    "writingIntensive": true,
    "name": "Blending Design & Culture - UK",
    "fullname": "Blending Design & Culture in the United Kingdom",
    "info": "The aim of this course is to emphasize design (graphic design, interior design, architecture, apparel design, urban design, etc.) as an important aspect of culture, by exploring how expressions of design can be a lens through which one can learn about culture and society. As a Freshman Seminar Abroad, part of the course (Spring Break 2022) will consist of site visits in the capital cities of London and in Edinburgh, investigating contemporary and historic design expressions there. The other part of the course consists of ten class meetings on campus throughout the semester where we will investigate design culture in Minnesota, learn about design culture in the UK, and develop tools for becoming culturally aware learners.",
    "prereq": []
  },
  {
    "uid": "818061",
    "code": "DES1407",
    "subject": "DES",
    "number": "1407",
    "honors": false,
    "writingIntensive": false,
    "name": "Fashion and Feminism",
    "fullname": "Fashion and Feminism: Dressing for Change",
    "info": "This class explores the sometimes problematic relationship between fashion and feminism. Literature from first wave feminism reveals visceral tensions between fashion and the perceived value of women in society. Fashionable dress was considered constrictive, submissive, and indicative of women?s diminished role in both private and public realms. Second wave feminism, which took place between approximately 1963 and 1975, did not often address fashion directly. However, there were dramatic changes in beauty ideals during this time. Second wave feminism reached mainstream culture through authors such as Simone de Beauvoir, Frances Beal, Betty Friedan, and Gloria Steinem.To arrive at a stronger understanding of women's movements in the United States, readings will be selected that offer some context for major political and social movements during the late 19th and 20th centuries. Occasional short lectures will be given throughout the semester to highlight fashion history, providing context for readings. Additionally, the class will look at ways that women from different racial, social, and cultural backgrounds experienced feminism during the late 19th and 20th centuries, as well as today. Readings, videos, and in-class activities will be used to prompt students to reflect on their own practices and self-presentation. Small group discussion will be used frequently to get at deeper meanings behind readings. Clothing objects from the Goldstein Museum of Design?s permanent collection will be used intermittently to study social mores and norms associated with women?s changing roles in society. ",
    "prereq": []
  },
  {
    "uid": "825163",
    "code": "DES1408",
    "subject": "DES",
    "number": "1408",
    "honors": false,
    "writingIntensive": false,
    "name": "Dare to Repair!",
    "fullname": "Dare to Repair! - Keep designed objects in use and out of the landfill",
    "info": "“ Repair is a radical act” says Rose Marcario, former CEO of Patagonia. “The simple act of extending the life of our things through proper care and repair reduces the need to buy more over time—thereby avoiding the CO2 emissions, waste output and water usage required to build it.”  In this seminar, students will learn methods to repair common household items and how repair and reuse can challenge a culture of consumerism and reduce the environmental impacts of objects created by College of Design disciplines; apparel, products, furniture, buildings, etc.  This course will focus on two main questions. 1. How do we as individuals take responsibility for the care and repair of our things to decrease our individual footprints? 2. How do we, as future design professionals design for use and ownership to decrease consumption on a larger scale?  The class will be a combination of hands-on repair practice, reading & discussion, field trips, and a series of small assignments to learn about repair across scales and disciplines. The class will create a repair focused zine together at the end of the semester and distribute it on campus to share their learning. ",
    "prereq": []
  },
  {
    "uid": "825815",
    "code": "DES1411",
    "subject": "DES",
    "number": "1411",
    "honors": false,
    "writingIntensive": false,
    "name": "Dsgn Inquiries in Geog & Ecol",
    "fullname": "Design Inquiries in Geography and Ecology",
    "info": "Take an interdisciplinary approach to exploring spatial and critical connections between design and ecosystems. This course introduces key concepts and critical readings on using maps as representation. Students will learn the basics of mapping geospatial data, as well as the wider context of cartography, scale, and representation. Assigned readings will acquaint students with interdisciplinary approaches to design and research. In this course, students will develop the skills to write effectively, and to visually and verbally present arguments. Students in this course will work individually and in teams to understand texts and create maps.",
    "prereq": []
  },
  {
    "uid": "825816",
    "code": "DES1412",
    "subject": "DES",
    "number": "1412",
    "honors": false,
    "writingIntensive": false,
    "name": "i House : i Home",
    "fullname": "i House : i Home",
    "info": "Leonard E Reads 1958 essay entitled “I, Pencil; My Family Tree as Told to Leonard E. Read” sketches a remarkable tale of how the unique interests, talents, and motivations of countless individuals from around the world converge to produce pencils. This seminar follows a similar contour to discover the acts of countless individuals from around the world and then outline a story, a kind of family tree, of the individual efforts to create the materials and products that converge to make a house. Matthew Barzun in his book The Power of Giving Power Way describes the coming together of diverse interests, talents, and motivations as constellations of stars. Each star bright and unique and its own system. When we gaze into the sky, we can see each individual star. We also see stars together and patterns emerge creating constellations. Each constellation having its own story and stories reflecting a meaning beyond their pattern.  In a similar way using Barzun’s constellation analogy we will also explore and express how the disparate physical objects each with their own story come together in a pattern we call house but also creates an idea of home that has the possibility of becoming meaningful for the people who inhabit it.This seminar will be a combination of readings, research, and critical discussions punctuated with field trips and conversations with fabricators, showroom personnel, and contractors to guide us through the journey. A series of short individual assignments in various digital visual and physical media will converge in the collaborative design of a house and an idea about home created by all the students of the class. A design that tells one story of the one hundred thousand and one million hands that build a house and create the possibility of a home.",
    "prereq": []
  },
  {
    "uid": "826631",
    "code": "DES1414",
    "subject": "DES",
    "number": "1414",
    "honors": false,
    "writingIntensive": false,
    "name": "Fashion & Aesthetics",
    "fullname": "Fashion & Aesthetics",
    "info": "The focus of this course is fashion and aesthetics with an emphasis on the analysis of our visual response to different styles of fashion. Students will learn about the Apparel Body Construct framework developed by DeLong (1998) and how to use the framework as a foundation to build an understanding of fashion sold to and worn by various market segments. Using creative thinking and problem-solving techniques, relationships will be explored between markets, products and the direction of fashion. By the end of the semester, each student?s eye and mind will be well trained to look more deeply and visually analyze fashion?from textiles to finished looks.",
    "prereq": []
  },
  {
    "uid": "809720",
    "code": "DES1902",
    "subject": "DES",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Chinese Fashion",
    "fullname": "Modern Chinese Fashion",
    "info": "This seminar provides a comprehensive account of modern Chinese fashion from the beginning of the twentieth century to the present day with an emphasis on the post-Mao era. It offers a concentrated study of the development of the Chinese fashion industry, fashion systems, the roles of Chinese designers and models, and luxury brands in China, as well as an analysis of the relationship between dress, gender, identity, consumption, and pop culture in modern China.  Students will critically evaluate how fashion has mirrored the social and cultural changes that have taken place in modern China, and to what extent fashion has contributed to those changes.  Students will reflect on the Chinese ways of fashion thinking and practices for the international community, the US, and for their own professions.",
    "prereq": []
  },
  {
    "uid": "805339",
    "code": "DES1904",
    "subject": "DES",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Fashion & Music",
    "fullname": "Fashion and Music",
    "info": "This course will explore the relationship between music, dance, and fashion, looking specifically at the 20th century. It will begin with an introduction to the impact of music and dance on fashion and dress and then delve into the changes in popular music and dance throughout the 20th century which result in changes in fashionable dress. The subcultural groups known as flappers, zoot-suiters, Bobby soxers, beats, punks, and goths will be studied to understand the importance of music on each group?s dress and identity. Class sessions will include short lectures, video clips, class discussions, student presentations, and the examination of garments and objects from the Goldstein Museum of Design collections. After taking this course, students will have an understanding of the significance of dress as marker of the identities of individual wearers within their historic context. Special features of the course will include field trips to local museums and guided tours by museum experts. Guest speakers discussing the influence of music on fashion. Historic artifacts will be available for examination from the Goldstein Museum of Design. Quizzes will be given online using the Canvas class website.",
    "prereq": []
  },
  {
    "uid": "802281",
    "code": "DES1905",
    "subject": "DES",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Visual Literacy",
    "fullname": "Visual Literacy",
    "info": "In the 21st Century, Visual Literacy is as vital for success as verbal literacy. The course will involve making, writing, and viewing in the pursuit of visual literacy, with expeditions to museums as well as discussion of the concepts of visual literacy. Through a combination of collaborative, hands on, and design activities, we will critically view, use, and produce visual content. The course will examine and apply the definitions and concepts of visual literacy, the impact of visual images on our culture, the creation and use of communication visuals, and developing critical viewing skills.",
    "prereq": []
  },
  {
    "uid": "808252",
    "code": "DES1906W",
    "subject": "DES",
    "number": "1906",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Freshman Seminar",
    "prereq": []
  },
  {
    "uid": "800356",
    "code": "DES1907W",
    "subject": "DES",
    "number": "1907",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics in design.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "807980",
    "code": "DES1909W",
    "subject": "DES",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics in design.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "800357",
    "code": "DES1910W",
    "subject": "DES",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics in design: building vision.",
    "prereq": []
  },
  {
    "uid": "826632",
    "code": "DES1911",
    "subject": "DES",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Park Architecture",
    "fullname": "Park Architecture",
    "info": "Explore spatial and political questions in National Park architecture. This course introduces key concepts and critical discussions on parks and park architecture. Readings will acquaint students with interdisciplinary approaches to design and research. In this course, students will develop the skills to write effectively, and to visually and verbally present arguments. Students in this course will work individually and in teams to understand the contexts, histories, and design of National Parks.",
    "prereq": []
  },
  {
    "uid": "801505",
    "code": "DES2101",
    "subject": "DES",
    "number": "2101",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Design",
    "fullname": "Principles of Design",
    "info": "This course introduces visual presentation skills for designers and will include documentation of the design process. Students are taught fundamental 2D visual presentation skills as applied to a series of design projects. In the process of learning these visual design skills, students will rely on and develop a working knowledge of specific Adobe software applications: Illustrator, Photoshop, and InDesign as well as presentation software (Google Slides). The course is taught in two components. There will be lectures that address specific design presentation topics (visual hierarchy, typography, color theory). There are also labs/demonstrations/exercises for students to practice specific tools and work on their design projects. As the assignments will involve a series of small design challenges, students will have experience generating ideas, developing these ideas using specific software, and using these concepts to practice both presentation and critique skills. ",
    "prereq": []
  },
  {
    "uid": "806996",
    "code": "DES2701",
    "subject": "DES",
    "number": "2701",
    "honors": false,
    "writingIntensive": false,
    "name": "Creative Design Methods",
    "fullname": "Creative Design Methods",
    "info": "This class is an introduction to a variety of tools and methods used in developing new products, services, and experiences. The focus of the class is on the early stages of design which includes user research, market research, idea generation methods, concept evaluation, concept selection, intellectual property, and idea presentation. Students will learn the divergent and convergent design thinking process to frame problems, and generate, refine, and communicate ideas. Students work individually and in groups applying the content taught in lecture to multiple assignments and a semester-long design project.previously offered as DES 2701",
    "prereq": []
  },
  {
    "uid": "808388",
    "code": "DES3131",
    "subject": "DES",
    "number": "3131",
    "honors": false,
    "writingIntensive": false,
    "name": "User Experience in Design",
    "fullname": "User Experience in Design",
    "info": "Introduction to theories/principles of human interaction with designed objects. Focuses on affect/emotional quality of designs. Objects, interfaces, environments. Digitally mediated experiences.",
    "prereq": []
  },
  {
    "uid": "815570",
    "code": "DES3132",
    "subject": "DES",
    "number": "3132",
    "honors": false,
    "writingIntensive": false,
    "name": "Service Design Studio",
    "fullname": "Service Design Studio",
    "info": "Systems-based approach towards service design. Course emphasis placed on the articulation of a service through concept mapping, blueprints, and user touch points.",
    "prereq": []
  },
  {
    "uid": "818680",
    "code": "DES3133",
    "subject": "DES",
    "number": "3133",
    "honors": false,
    "writingIntensive": false,
    "name": "Capturing Greece",
    "fullname": "Capturing Greece: Color, Light, and Form",
    "info": "Greece provides a unique cultural environment in which to explore color, light, and form. Students will immerse themselves in a climate of light and form by observing and experiencing water, stone, and structure in a fresh way. Students will explore ancient architectural forms, uniquely evolved historic villages, and references to mythological and symbolic imagery.This course will provide students with an opportunity to develop creative thinking and practice as well as build visual acuity. Students will examine color theory and the history of BLUE while studying creative thought processes. Drawing and Watercolor are the vehicles through which the majority of this learning occurs.",
    "prereq": []
  },
  {
    "uid": "809612",
    "code": "DES3141",
    "subject": "DES",
    "number": "3141",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology, Dsgn, Society",
    "fullname": "Technology, Design, and Society",
    "info": "Explore/evaluate impact of technology/design on humans, societies. How design innovation shapes cultures. How people use technology to shape design, adoption, use of designed products/environments through consumerism/ethical values.",
    "prereq": []
  },
  {
    "uid": "817391",
    "code": "DES3151",
    "subject": "DES",
    "number": "3151",
    "honors": false,
    "writingIntensive": false,
    "name": "Italian Design Studio",
    "fullname": "Italian Design Studio: Blending Tradition and Innovation",
    "info": "DES 3151 Italian Design Studio: Blending Tradition and Innovation exposes students to the productive intersection of ideas using the city of Rome and its makers as inspiration and context for interdisciplinary design work. The study abroad studio course is submitted to the Council on Liberal Education for approval for a Global Perspectives Theme.Italian Design Studio meets general Core course requirements in the following ways:ENHANCING A LIBERAL EDUCATIONStudents in this course exercise design as a mode of thinking and practice in an interdisciplinary context. Design thinking is, at its essence, critical thinking for the material world. Design is a process of analyzing, interpreting and evaluating information from multiple viewpoints, and iteratively developing a response that synthesizes this information into a cohesive solution. Design projects never have a \"right answer.\" Instead, students come to learn that \"good design\" emerges from a rigorous, creative and critical process of seeing design problems as design opportunities.In this way, design studio and design thinking have an intriguing synergy with the values of a liberal education. A liberal education prepares students to engage a complex, diverse and changing world by seeing problems from multiple viewpoints. Design problems are complex by nature and require expansive thinking. Students who think like designers actively seek a variety of perspectives and intentionally zoom in and out to see a problem at a range of scales and in a shifting context. Students who think like designers are naturally curious about almost everything, and see inspiration and opportunity everywhere. Immersion in another culture naturally piques curiosity and presents an immediate challenge to practice seeing (things and processes big and small) from other perspectives.  A liberal education prepares students to critically evaluate information and integrate knowledge. From a liberal investigation, students who think like designers begin to discern what is important, relevant and interesting from what is less important, less relevant and less interesting. Designers understand where conditions are fixed and where they have agency to make design decisions. Because the design process is both generative and iterative, integrating new knowledge and reevaluating what is valuable in the investigation is ongoing. While the design process is not a linear one, students in this course do learn that it is nonetheless rigorous, involving the art of opening up a problem, synthesizing a multitude of forces, and working within constraints.A liberal education prepares students to engage the world as informed, ethical citizens. Design and making are deeply human endeavors that addresses who we are as physical, psychological, social, political and spiritual beings in relationship with the constant, changing and limited resources of our planet. Students in this course learn how the particular circumstances of time and place can have dramatic implications for our designed environment, from the scale of objects to the scale of cities.A liberal education prepares students to value diverse ways of knowing and modes of inquiry. Designing the material world?whether apparel, graphic, landscape architecture, architecture or interior design?invites a fusion of art and science.  As a mode of inquiry, students in this course pursue design thinking as a rigorous and analytical process with a role for intuition and creativity. Designed objects and places express cultural aspirations and makes our experiences with the physical world poetic. In this way, de is allied with other arts and humanities disciplines. Yet, all designed things are beholden to a host of constraints or forces that lie beyond the control of the designer. Architecture, for example, must accommodate human behavior and needs, must shelter in a particular climate, and must respond to the laws of materials and gravit",
    "prereq": []
  },
  {
    "uid": "801485",
    "code": "DES3160",
    "subject": "DES",
    "number": "3160",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "Topics in Design.",
    "prereq": []
  },
  {
    "uid": "797499",
    "code": "DES3170",
    "subject": "DES",
    "number": "3170",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "In-depth investigation of specific topic.",
    "prereq": []
  },
  {
    "uid": "804749",
    "code": "DES3196",
    "subject": "DES",
    "number": "3196",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Study",
    "fullname": "Field Study: National or International",
    "info": "Faculty-directed field study in national or international setting.",
    "prereq": []
  },
  {
    "uid": "803709",
    "code": "DES3201",
    "subject": "DES",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Career/Intern Prep for Design",
    "fullname": "Career and Internship Preparation for Design",
    "info": "Research career opportunities and organizations related to industry. Set career goals based on skills and interests. Identify job search skills to secure internships, implement transition from college to employment. prereq: Pre-graphic design or graphic design or pre-interior design or interior design or pre-apparel design or apparel design or environmental design or architecture or product design",
    "prereq": []
  },
  {
    "uid": "817060",
    "code": "DES3250",
    "subject": "DES",
    "number": "3250",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "Topics in Design",
    "prereq": []
  },
  {
    "uid": "808154",
    "code": "DES3309",
    "subject": "DES",
    "number": "3309",
    "honors": false,
    "writingIntensive": false,
    "name": "Storytelling and Design",
    "fullname": "Storytelling and Design",
    "info": "Students will uncover elements of storytelling within the design process and investigate different modes of shaping narrative. We will be experimenting with various media, including 2D design and mapping, audio, video, social platforms, augmented reality, and online environments.",
    "prereq": []
  },
  {
    "uid": "803200",
    "code": "DES3311",
    "subject": "DES",
    "number": "3311",
    "honors": false,
    "writingIntensive": false,
    "name": "Travels in Typography",
    "fullname": "Travels in Typography",
    "info": "Using collection in James Ford Bell Library, students study rare book/map collections and undertake hands-on exercises on history of type, including developments in typesetting, calligraphy, and letterpress printing.",
    "prereq": []
  },
  {
    "uid": "803201",
    "code": "DES3321",
    "subject": "DES",
    "number": "3321",
    "honors": false,
    "writingIntensive": false,
    "name": "Furniture Design: Exploration",
    "fullname": "Furniture Design: Exploration",
    "info": "Explore the inclusive, egalitarian nature of furniture design! Gain a foundational understanding for buying, selling, designing or studying furniture.  We collectively explore the topic via lectures, reading, writing, discussion, field trips, visits from working professionals, and a classic design exercise.",
    "prereq": []
  },
  {
    "uid": "803202",
    "code": "DES3331",
    "subject": "DES",
    "number": "3331",
    "honors": false,
    "writingIntensive": false,
    "name": "Street Life",
    "fullname": "Street Life Urban Design Seminar",
    "info": "The street as part of network of urban systems/fragments: sidewalks, private interiors, curbs, terraces, boulevards, parking lots, bus stops, public institutions, urban architectures, utility lines, storm/sewer systems, groundwater, satellite communication systems, gardens, and lighting. Readings in urban studies, geography, design, economics and art history. Students review case studies, envision possible transformations of streets/street life.",
    "prereq": []
  },
  {
    "uid": "803203",
    "code": "DES3341",
    "subject": "DES",
    "number": "3341",
    "honors": false,
    "writingIntensive": false,
    "name": "(un)Wrapping It Up",
    "fullname": "(un)Wrapping It Up: New Materials for Design, Design for New Materials",
    "info": "New high-tech fabrics, foils, electrotextiles, \"intelligent textiles\" that respond to environmental stimuli. Hands-on materials research, testing of prototypes. Cross-disciplinary teams explore appropriate modeling/applications. Integrated project.",
    "prereq": []
  },
  {
    "uid": "803194",
    "code": "DES3351",
    "subject": "DES",
    "number": "3351",
    "honors": false,
    "writingIntensive": false,
    "name": "Phenomenon of Everyday Design",
    "fullname": "Phenomenon of Everyday Design",
    "info": "Examines the growing fascination with design in everyday life. From Target to IKEA, from TIME magazine to the New York Times Sunday supplement, interest in the designer and designed object are permeating popular culture. Implications of this phenomenon in the present and historical precedents for the \"design in everyday life\" concept.",
    "prereq": []
  },
  {
    "uid": "803195",
    "code": "DES3361",
    "subject": "DES",
    "number": "3361",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Modern Design",
    "fullname": "History of Modern Design",
    "info": "Interplay between the products of design and mass consumption in an innovative manner. Major focus on the late 19th and the 20th centuries. Lectures, exams, and projects integrate material from product, interior, industrial, merchandising, graphic, textile, and clothing design.  ",
    "prereq": []
  },
  {
    "uid": "825536",
    "code": "DES3406",
    "subject": "DES",
    "number": "3406",
    "honors": false,
    "writingIntensive": false,
    "name": "Iceland: Nat, Cul, Arts & Dsgn",
    "fullname": "Iceland: Nature, Culture, Arts & Design",
    "info": "This course aims to offer a structured experience to learn about the Icelandic culture from afar through presentations, readings and digital media sources followed by direct experience through travel and a short immersion in the culture. Through interactions with people from the Icelandic culture while in Minnesota & then in Iceland the course will involve rapid learning, reflection and creative making, culminating in completion of academic work and a final presentation of the work to a cross-cultural audience. ",
    "prereq": []
  },
  {
    "uid": "802098",
    "code": "DES4160",
    "subject": "DES",
    "number": "4160",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "In-depth investigation of single specific topic announced in advance.",
    "prereq": []
  },
  {
    "uid": "798670",
    "code": "DES4165",
    "subject": "DES",
    "number": "4165",
    "honors": false,
    "writingIntensive": false,
    "name": "Design and Globalization",
    "fullname": "Design and Globalization",
    "info": "The course explores how culture, identity, and difference are defined and produced and the role that design plays in the production of difference, inequality, and marginalization.prereq: Jr or sr",
    "prereq": []
  },
  {
    "uid": "802186",
    "code": "DES4193",
    "subject": "DES",
    "number": "4193",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study in Design",
    "fullname": "Directed Study in Design",
    "info": "Directed Study in Designprereq: dept consent",
    "prereq": []
  },
  {
    "uid": "803204",
    "code": "DES4301",
    "subject": "DES",
    "number": "4301",
    "honors": false,
    "writingIntensive": false,
    "name": "Metaphor and Design",
    "fullname": "Metaphor and Design",
    "info": "Analyze role of metaphors/related tropes when conceptualizing meanings within designed environment. How fundamental/newly emerging metaphoric conceptualizations shape designed spaces, products, images. Create summary statement of significant learning insight.",
    "prereq": []
  },
  {
    "uid": "816868",
    "code": "DES4322",
    "subject": "DES",
    "number": "4322",
    "honors": false,
    "writingIntensive": false,
    "name": "Furniture Design, Practice",
    "fullname": "Furniture Design, Practice",
    "info": "The hardest things about the creative act is learning how to start something before you know what it is. The simplest objects are always more formally complex than the mind can accurately imagine.This course teaches design thinking through furniture constructed using a fast, loose & ad-hoc \"children-club-fort-building\" method of discovering & visualizing while making. Direct-construction design is tangibly satisfying and will provide powerful context for all other scales of creative, design and planning methods. Your results will not be conventionally good-looking, but you will make real & functioning cultural things. All exercises will be dependent on connecting to ideas beyond commonly recognized boundaries of the furniture. Think \"Chair-ness, not Chair.\" You will be taught basic welding and wood joinery to provide fast & viable structural frames, \"surfacing\" methods in wood, foam and fabric composites, and an introduction to mold making and material casting. You do not need to be good at making, but you must be game to try. Craft is important so-far as basic structural usability is attained. Ideas will always trump material \"correctness.\"",
    "prereq": []
  },
  {
    "uid": "825774",
    "code": "DES4401W",
    "subject": "DES",
    "number": "4401",
    "honors": false,
    "writingIntensive": true,
    "name": "Racism Untaught",
    "fullname": "Racism Untaught",
    "info": "Revealing and unlearning racialized design through the use of the Racism Untaught framework.",
    "prereq": []
  },
  {
    "uid": "827240",
    "code": "DES4403",
    "subject": "DES",
    "number": "4403",
    "honors": false,
    "writingIntensive": false,
    "name": "Wakanda/Blk Liberatory Futures",
    "fullname": "Wakanda & Black Liberatory Futures",
    "info": "Wakanda & Black Liberatory Futures centers West African cultural practices to explore an international afro-futurist understanding of values, policies, and practices that might support the design, creation, and reimagining of Black futures that promote abolitionist principles and collective liberation. Through historical and modern-day research methods, Afro-Futurist and Pan-Africanist movements, community engagement, and cross-disciplinary approaches, students will engage in the design research process to tackle emerging community issues that directly oppress Black communities throughout the United States. The four major themes present in this course are Senegalese/West-African Culture, Community Activation, Public Policy, and Environmental Justice. This course will directly support the exploration of Black ancestral narratives as a means to learn from the counter-stories of people throughout the African diaspora.",
    "prereq": []
  },
  {
    "uid": "820112",
    "code": "DES5130",
    "subject": "DES",
    "number": "5130",
    "honors": false,
    "writingIntensive": false,
    "name": "Visual Literacy",
    "fullname": "Visual Literacy",
    "info": "Understanding concept of visual literacy; analysis of visual communication and design elements; review of visual learning research; application of visual literacy into practice.University credit earned through completion of the UX Design MasterTrack™ Certificate. For more information, visit: https://design.umn.edu/academics/explore-all-certificates/ux-design-mastertracktm-certificate",
    "prereq": []
  },
  {
    "uid": "819932",
    "code": "DES5131",
    "subject": "DES",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "User Research in UX Design",
    "fullname": "User Research for User Experience Design",
    "info": "Qualitative research skills specific to the field of user experience; understanding of qualitative research methods; development and critique of a product proposal with data reasoning.University credit earned through completion of the UX Design MasterTrack™ Certificate. For more information, visit: https://design.umn.edu/academics/explore-all-certificates/ux-design-mastertracktm-certificate",
    "prereq": []
  },
  {
    "uid": "820147",
    "code": "DES5132",
    "subject": "DES",
    "number": "5132",
    "honors": false,
    "writingIntensive": false,
    "name": "User Testing for UX Design",
    "fullname": "User Testing for User Experience Design",
    "info": "Further developed qualitative research skills using empathy mapping, user journeys, and usability tests; understanding of UX toolkit; ability to evaluate service BluePrints/ Wireframes/Task flows; prototypes design; understanding of UI design analysis and critical evaluation.University credit earned through completion of the UX Design MasterTrack™ Certificate. For more information, visit: https://design.umn.edu/academics/explore-all-certificates/ux-design-mastertracktm-certificate",
    "prereq": []
  },
  {
    "uid": "801486",
    "code": "DES5160",
    "subject": "DES",
    "number": "5160",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "Topics in design",
    "prereq": []
  },
  {
    "uid": "798671",
    "code": "DES5165",
    "subject": "DES",
    "number": "5165",
    "honors": false,
    "writingIntensive": false,
    "name": "Design and Globalization",
    "fullname": "Design and Globalization",
    "info": "Design and Globalization is designed as a course for students of diverse disciplines as well as both graduate and undergraduate students. The course is also part of the Interior Environments Minor as well as meets the Lib Ed theme of \"Diversity and Social Justice in the US.\" Offering it on-line, benefits and increases access to students beyond the St. Paul campus, enabling us to increase enrollment as well as reach a broader range of students and disciplines. Interior Design is already switching the two history classes on-line as a way to increase enrollment and add flexibility in the curriculum.",
    "prereq": []
  },
  {
    "uid": "806419",
    "code": "DES5168",
    "subject": "DES",
    "number": "5168",
    "honors": false,
    "writingIntensive": false,
    "name": "Evidence-Based Design",
    "fullname": "Evidence-Based Design",
    "info": "Origins of evidence-based design/possible benefits and detractors. Students learn various components as a process/ explore methods of integrating process via application to a design project in their area of expertise. Process, impact, influences, and anticipated outcomes are documented/ analyzed as compared to a typical design process approach.prereq: CDes grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "013279",
    "code": "DES5170",
    "subject": "DES",
    "number": "5170",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "In-depth investigation of single specific topic, announced in advance.",
    "prereq": []
  },
  {
    "uid": "807344",
    "code": "DES5180",
    "subject": "DES",
    "number": "5180",
    "honors": false,
    "writingIntensive": false,
    "name": "Split Rock Arts Topics",
    "fullname": "Split Rock Arts Topics",
    "info": "In-depth investigation of a specific topic, announced in advance.",
    "prereq": []
  },
  {
    "uid": "797746",
    "code": "DES5185",
    "subject": "DES",
    "number": "5185",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Factors in Design",
    "fullname": "Human Factors in Design",
    "info": "Exploration of the theories and methods that influence the assessment of physical, cognitive, social, and psychological human factors, and the analysis of user needs with application to designed products and systems that interact with a human user or the human body.This course is an introductory overview to the theories and concepts of Human Factors and their application through the methods of User-Centered Design. Typically, the class is comprised of students from a wide variety of disciplines and backgrounds. Course material is explored through readings, lectures, discussions, case studies, and course projects.",
    "prereq": []
  },
  {
    "uid": "817482",
    "code": "DES5188",
    "subject": "DES",
    "number": "5188",
    "honors": false,
    "writingIntensive": false,
    "name": "Anthropometrics, Sizing & Fit",
    "fullname": "Anthropometrics, Sizing & Fit",
    "info": "Comprehensive attention to ergonomics and anthropometric variance across populations is crucial to the advancement of wearable products and apparel. This course will examine the relationship between body size, body shape, product design, sizing systems, and fit. Students will examine existing sizing systems and develop new sizing systems using anthropometric data, body scan technology, and OptiTex 3D patternmaking software. A special focus will be given to examining innovative tools that encourage the merging of anthropometrics and design throughout the design process. This class is suitable for students across a variety of disciplines.",
    "prereq": []
  },
  {
    "uid": "802187",
    "code": "DES5193",
    "subject": "DES",
    "number": "5193",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study in Design",
    "fullname": "Directed Study in Design",
    "info": "Directed Study in Designprereq: dept consent",
    "prereq": []
  },
  {
    "uid": "013282",
    "code": "DES5196",
    "subject": "DES",
    "number": "5196",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Study",
    "fullname": "Field Study: National/International",
    "info": "Faculty-directed field study in a national or international setting.",
    "prereq": []
  },
  {
    "uid": "809536",
    "code": "DES5201",
    "subject": "DES",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Job Search Prep for Grad Stu",
    "fullname": "Career and Job Search Preparation for Graduate Students",
    "info": "Job search/career development tools. Goals, networking, job search, resume/CV, interviewing. Assignments include resume/CV, informational interview, career development plan.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "826853",
    "code": "DES5502",
    "subject": "DES",
    "number": "5502",
    "honors": false,
    "writingIntensive": false,
    "name": "Intersection in Design Justice",
    "fullname": "Intersections in Design Justice",
    "info": "The Intersections of Design Justice course centers on the impact of design justice on the many forms of oppression within the design field, design approaches which create anti-oppressive culture shifts, decolonized pedagogical approaches, and curriculum that supports the liberation of historically underinvested communities. Through historical and modern-day research methods and creative projects, students will engage in building their design justice lens to assist them in an understanding of their agency and positionality in the modern design context and in emerging community issues. The course will introduce a variety of national and international lecturers.",
    "prereq": []
  },
  {
    "uid": "826784",
    "code": "DES5503",
    "subject": "DES",
    "number": "5503",
    "honors": false,
    "writingIntensive": false,
    "name": "Wakanda/Blk Liberatory Futures",
    "fullname": "Wakanda & Black Liberatory Futures",
    "info": "Wakanda & Black Liberatory Futures centers West African cultural practices to explore an international afro-futurist understanding of values, policies, and practices that might support the design, creation, and reimagining of Black futures that promote abolitionist principles and collective liberation. Through historical and modern-day research methods, Afro-Futurist and Pan-Africanist movements, community engagement, and cross-disciplinary approaches, students will engage in the design research process to tackle emerging community issues that directly oppress Black communities throughout the United States. The four major themes present in this course are Senegalese/West-African Culture, Community Activation, Public Policy, and Environmental Justice. This course will directly support the exploration of Black ancestral narratives as a means to learn from the counter-stories of people throughout the African diaspora. ",
    "prereq": []
  },
  {
    "uid": "818889",
    "code": "DES5901",
    "subject": "DES",
    "number": "5901",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles Wearable Technology",
    "fullname": "Principles of Wearable Technology",
    "info": "Exploration of technologies, theories, and best practices for designing and developing systems incorporating wearable technology. This lecture-based class will introduce students to the physical principles that underlie many wearable technology subsystems, will discuss design approaches that conscientiously consider user experience and wearability in systems design.This course is an introductory course that focuses on wearable technology concepts blending User-Centered Design with Engineering Systems development. It is intended to be approachable for students with a wide variety of interests and backgrounds. Course material is explored through readings, lectures, discussions, and course projects. Optional laboratory course (DES.5902) provides hands-on opportunities to put these principles into practice.",
    "prereq": []
  },
  {
    "uid": "818903",
    "code": "DES5902",
    "subject": "DES",
    "number": "5902",
    "honors": false,
    "writingIntensive": false,
    "name": "Wearable Tech Lab Practicum",
    "fullname": "Wearable Technology Laboratory Practicum",
    "info": "Laboratory session to develop skills in building and testing wearable technology systems. The student must be enrolled concurrently with DES 5901 (Principles of Wearable Technology). Students will be provided opportunities for hands-on prototyping to gain a practical appreciation for the challenges related to wearable systems development.Course material is explored through laboratory sessions and course projects.",
    "prereq": []
  },
  {
    "uid": "007567",
    "code": "DES8101",
    "subject": "DES",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophical Foundations",
    "fullname": "Philosophical Foundations",
    "info": "The nature of thought underlying/within professional areas of field.",
    "prereq": []
  },
  {
    "uid": "802188",
    "code": "DES8102",
    "subject": "DES",
    "number": "8102",
    "honors": false,
    "writingIntensive": false,
    "name": "Quant Res Methods & Data Viz",
    "fullname": "Quantitative research methods and data visualization",
    "info": "Quantitative research methods and data visualization offers an overview of the quantitative research design approaches and discusses a series of quantitative data collection and analysis methods including exploratory data analysis, dependence analysis, and inter-dependence analysis techniques. This course reviews how these methods are used in research projects and how to communicate effectively by developing advanced data visualization skills.",
    "prereq": []
  },
  {
    "uid": "007570",
    "code": "DES8103",
    "subject": "DES",
    "number": "8103",
    "honors": false,
    "writingIntensive": false,
    "name": "Qual. Res. Methods in Design",
    "fullname": "Qualitative Research Methods in Design",
    "info": "Qualitative Research Methods in Design provides an overview of qualitative research methods in design research. This course reviews a series of qualitative research inquiries (grounded theory, ethnographic research, case studies), data collection (interview, observation, focus groups), and analysis methods (coding). This course discusses how these methodologies and methods are applied to graduate-level research in different design contexts. ",
    "prereq": []
  },
  {
    "uid": "007716",
    "code": "DES8112",
    "subject": "DES",
    "number": "8112",
    "honors": false,
    "writingIntensive": false,
    "name": "Design Res, Theory, & Method",
    "fullname": "Introduction to Design Research, Theory, and Methodology",
    "info": "Introduction to Design Research, Theory, and Methodology provides an overview of design research types and approaches for generating valid knowledge about design.  The course will explore the philosophical and methodological underpinnings of three significant areas of design research: research into design (theory-based; foundational or exploratory research), research for design (practice-based), and research through design (practice-led). This course reviews creative, analytical, and reflective design research methodology and design theory to focus graduate-level design research and creative production. ",
    "prereq": []
  },
  {
    "uid": "007689",
    "code": "DES8113",
    "subject": "DES",
    "number": "8113",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching and Assessment",
    "fullname": "Teaching and Assessment",
    "info": "Educational processes/methods in design studio/lecture courses. Learning styles, best practices for grading. Methods of critique. Interacting with students. Active learning. Teaching with technology. Lecture, practicum.",
    "prereq": []
  },
  {
    "uid": "007728",
    "code": "DES8114",
    "subject": "DES",
    "number": "8114",
    "honors": false,
    "writingIntensive": false,
    "name": "Design Studio",
    "fullname": "Design Studio",
    "info": "Advanced problem analysis, design solution.prereq: Design grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "808178",
    "code": "DES8115",
    "subject": "DES",
    "number": "8115",
    "honors": false,
    "writingIntensive": false,
    "name": "Grant Writing",
    "fullname": "Grant Writing",
    "info": "Interdisciplinary course.",
    "prereq": []
  },
  {
    "uid": "804267",
    "code": "DES8151",
    "subject": "DES",
    "number": "8151",
    "honors": false,
    "writingIntensive": false,
    "name": "Product Devp't Thry & Practice",
    "fullname": "Product Development: Theory and Practice",
    "info": "Product development theories/methods as applied in many design fields. Emphasizes retail setting. Seminar format discussion, case studies, observation/critique of hands-on industry product development project.",
    "prereq": []
  },
  {
    "uid": "007694",
    "code": "DES8164",
    "subject": "DES",
    "number": "8164",
    "honors": false,
    "writingIntensive": false,
    "name": "Innovation Theory",
    "fullname": "Innovation Theory and Analysis",
    "info": "Theories and factors that influence adoption and diffusion of designed products.  Methodologies used in analysis of diffusion process.",
    "prereq": []
  },
  {
    "uid": "797768",
    "code": "DES8166",
    "subject": "DES",
    "number": "8166",
    "honors": false,
    "writingIntensive": false,
    "name": "Material Culture and Design",
    "fullname": "Material Culture and Design",
    "info": "Research approaches to material culture study using artifacts from Goldstein Museum of Design.prereq: [DHA or DES] grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007706",
    "code": "DES8167",
    "subject": "DES",
    "number": "8167",
    "honors": false,
    "writingIntensive": false,
    "name": "Aesthetics of Design",
    "fullname": "Aesthetics of Design",
    "info": "How we perceive, analyze, value, and evaluate design outcomes/results.",
    "prereq": []
  },
  {
    "uid": "804700",
    "code": "DES8170",
    "subject": "DES",
    "number": "8170",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Design",
    "fullname": "Topics in Design",
    "info": "In-depth investigation of topic announced in advance.",
    "prereq": []
  },
  {
    "uid": "789687",
    "code": "DES8181",
    "subject": "DES",
    "number": "8181",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Ethics",
    "fullname": "Research Ethics",
    "info": "Overview of ethical concerns/questions in conducting/disseminating research. Mentoring relationships, use of human subjects, data handling, plagiarism, authorship, publishing, research funding, social responsibility of researchers, code of conduct.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "788100",
    "code": "DES8333",
    "subject": "DES",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788337",
    "code": "DES8444",
    "subject": "DES",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788462",
    "code": "DES8666",
    "subject": "DES",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral pre-thesis credits.prereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "788590",
    "code": "DES8777",
    "subject": "DES",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "787848",
    "code": "DES8888",
    "subject": "DES",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit: Doctoral",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  }
]