[
  {
    "uid": "803381",
    "code": "DT2121",
    "subject": "DT",
    "number": "2121",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Application I",
    "fullname": "Process of Care in Allied Dental Health: Clinical Application I",
    "info": "Dental hygiene/Dental Therapy care process, assessment principles related to medical and oral health status, dental hygiene clinical procedures, and development of instrumentation skills.",
    "prereq": []
  },
  {
    "uid": "825996",
    "code": "DT2132",
    "subject": "DT",
    "number": "2132",
    "honors": false,
    "writingIntensive": false,
    "name": "Head and Neck Anatomy",
    "fullname": "Head and Neck Anatomy",
    "info": "The anatomical structures of head and neck as they relate to the practice of dental hygiene and dental therapy.",
    "prereq": []
  },
  {
    "uid": "804532",
    "code": "DT2212",
    "subject": "DT",
    "number": "2212",
    "honors": false,
    "writingIntensive": false,
    "name": "Communication for Oral Health",
    "fullname": "Communications for Oral Health Providers",
    "info": "This course introduces the study of effective communication strategies within the health care team and during patient-provider relationships. There is an emphasis on public speaking basic principles, effective strategies, and ethical approaches. The application of health literacy concepts and behavior change theory as components of evidence-based decision making in a variety of practice settings will be taught.",
    "prereq": []
  },
  {
    "uid": "803791",
    "code": "DT2221W",
    "subject": "DT",
    "number": "2221",
    "honors": false,
    "writingIntensive": true,
    "name": "Periodontology",
    "fullname": "Periodontology",
    "info": "This course introduces periodontal diseases; etiology, assessment, and treatment options. It includes clinical experience in debridement, root planning with ultrasonic and hand instruments. (3 credits)",
    "prereq": []
  },
  {
    "uid": "825557",
    "code": "DT2222",
    "subject": "DT",
    "number": "2222",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Application II",
    "fullname": "Process of Care in Allied Dental Health: Clinical Application II",
    "info": "In this class, you will begin to apply your knowledge of the various preventive products, patient education, assessment data ,and medical histories to clinical practice.  You will develop application skills in fluoride treatments and pit and fissure sealants as well as the evaluation of products used in the treatment of dental caries and periodontal diseases. This class will also give you an introduction to the School of Dentistry's clinical systems, various medical and emergency conditions affecting patient care, and preventive strategies for oral diseases.",
    "prereq": []
  },
  {
    "uid": "825558",
    "code": "DT2225",
    "subject": "DT",
    "number": "2225",
    "honors": false,
    "writingIntensive": false,
    "name": "MicB, Immunology and Oral Hlth",
    "fullname": "Microbiology, Immunology, and Oral Health",
    "info": "Encounters with microorganisms are part of everyday life for humans, both as pathogenic and non-pathogenic entities. During this microbiology course students will learn characteristics of microbial life for bacteria, viruses, parasites, and fungi. An emphasis will be places on microorganisms that are commonly found in the oral cavity. An introduction to the human immune system and its function in regulating infections will be presented. Students will gain an understanding of both commensal microbiota and pathogenic microorganisms, and their impact on human health. Additionally, students will begin to convey scientific data and research results to non-scientists as a basis for discussing disease prevention, infection management, and treatment plans in a clinical setting.",
    "prereq": []
  },
  {
    "uid": "804533",
    "code": "DT2231",
    "subject": "DT",
    "number": "2231",
    "honors": false,
    "writingIntensive": false,
    "name": "Cariology & Applied Nutrition",
    "fullname": "Cariology and Applied Nutrition in Allied Dental Health",
    "info": "The study of dental caries etiology, pathology and prevention, and the applied principles of diet and nutrition to dental hygiene/dental therapy patient care with skills in dental dietary counseling. Course content also includes a comprehensive review of CAMBRA. Cariology and Applied Nutrition in Allied Dental Health is designed to provide the beginner level dental hygiene student with a knowledge base in cariology and nutrition as it applies to the oral cavity. The implementation of this knowledge is Dental Dietary Counseling with a dental hygiene patient. DH 2231/DT 2231 relies on the communication skills developed in DH 2212/DT 2212.",
    "prereq": []
  },
  {
    "uid": "803372",
    "code": "DT3110",
    "subject": "DT",
    "number": "3110",
    "honors": false,
    "writingIntensive": false,
    "name": "Perio I",
    "fullname": "Periodontology I",
    "info": "Classification/epidemiology of periodontal diseases. Macro/microanatomy of normal periodontium. Etiology of periodontal diseases. Dental plaque and calculus. Host defense, immunopathological mechanisms. Clinical, histopathological and pathogenesis of gingivitis and periodontitis. Risk assessment, tobacco use, systemic diseases.",
    "prereq": []
  },
  {
    "uid": "804063",
    "code": "DT3121",
    "subject": "DT",
    "number": "3121",
    "honors": false,
    "writingIntensive": false,
    "name": "Local Anesthesia & Pain Mgmt",
    "fullname": "Local Anesthesia and Pain Management",
    "info": "Concepts in the administration of local anesthesia, nitrous oxide-oxygen sedation, and other methods of pain management. Anatomy, physiology, pharmacology, patient assessment, indications and contraindications, selection of agents, injection techniques, complications, emergency management, and legal/ethical considerations. Lecture, lab, clinic. Clinical sessions include actual experience in administering local anesthesia and other methods of pain management. The administration of local anesthesia will be taught to clinical competency. The didactic component of nitrous oxide-oxygen sedation will be completed in this course with clinical experiences occurring in the Faculty Practice Clinic and in subsequent clinical rotations leading to clinical competency in this method of pain management.",
    "prereq": []
  },
  {
    "uid": "825559",
    "code": "DT3123",
    "subject": "DT",
    "number": "3123",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Application III",
    "fullname": "Process of Care in Allied Dental Health: Clinical Application III",
    "info": "Dental hygiene/Dental Therapy planning for caries prevention and control, non-surgical periodontal therapy and tobacco cessation. Case presentation, ergonomic, and clinical experience in dental hygiene/dental therapy patient care.",
    "prereq": []
  },
  {
    "uid": "806603",
    "code": "DT3125",
    "subject": "DT",
    "number": "3125",
    "honors": false,
    "writingIntensive": false,
    "name": "General and Oral Pathology",
    "fullname": "General and Oral Pathology",
    "info": "This course covers topics in pathology related to dentistry and the oral cavity. Oral benign/malignant tumors, infectious, inflammatory, and immunologically mediated lesions/diseases are covered.",
    "prereq": []
  },
  {
    "uid": "803398",
    "code": "DT3130",
    "subject": "DT",
    "number": "3130",
    "honors": false,
    "writingIntensive": false,
    "name": "PreClin Pediatric Dentistry",
    "fullname": "Preclinical Pediatric Dentistry",
    "info": "Childhood development and care of children. Restorative dentistry for children/adolescents. Behavior management techniques. Issues that arise in dental health care setting. Lab. ",
    "prereq": []
  },
  {
    "uid": "805430",
    "code": "DT3133",
    "subject": "DT",
    "number": "3133",
    "honors": false,
    "writingIntensive": false,
    "name": "Pharmacology",
    "fullname": "Pharmacology",
    "info": "Principles of pharmacology, physical/chemical properties of drugs, modes of administration, therapeutic/adverse effects, drug actions/interactions.",
    "prereq": []
  },
  {
    "uid": "805595",
    "code": "DT3151",
    "subject": "DT",
    "number": "3151",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral & Maxillofacial Radiology",
    "fullname": "Oral and Maxillofacial Radiology",
    "info": "General principles of radiology, radiation physics, dosimetry, biology, radiation protection, regulations, recent concepts of imaging, and radiographic anatomy.",
    "prereq": []
  },
  {
    "uid": "804059",
    "code": "DT3210",
    "subject": "DT",
    "number": "3210",
    "honors": false,
    "writingIntensive": false,
    "name": "Head and Neck Anat",
    "fullname": "Head and Neck Anatomy",
    "info": "Anatomical nomenclature in head/neck anatomy as they relate to dental therapy treatment.Prereq-Accepted into undergrad dental therapy program.",
    "prereq": []
  },
  {
    "uid": "803374",
    "code": "DT3211",
    "subject": "DT",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Pharm for the DT",
    "fullname": "Applied Pharmacology for the Dental Therapist",
    "info": "Principles of pharmacological drugs used in dentistry, modes of drug administration, therapeutic/adverse effects of drugs. Preparation for pharmacology of local anesthetics. Nitrous oxide sedation, prescription writing.",
    "prereq": []
  },
  {
    "uid": "803375",
    "code": "DT3212",
    "subject": "DT",
    "number": "3212",
    "honors": false,
    "writingIntensive": false,
    "name": "Local Anesth & Pain Management",
    "fullname": "Local Anesthesia and Pain Management",
    "info": "Administration of local anesthesia, nitrous oxide-oxygen sedation, other methods of pain management. Anatomy, physiology, pharmacology, client assessment, indications/contra-indications. Selection/administration of anesthetic agents. Complications, emergency management, legal/ethical considerations.",
    "prereq": []
  },
  {
    "uid": "826014",
    "code": "DT3224W",
    "subject": "DT",
    "number": "3224",
    "honors": false,
    "writingIntensive": true,
    "name": "Clinical Application IV",
    "fullname": "Process of Care in Allied Dental Health: Clinical Application IV",
    "info": "Knowledge, skills, and attitudes required for providing dental hygiene care for the medically compromised patient, gerodontic patient, and patient with a disability.",
    "prereq": []
  },
  {
    "uid": "805906",
    "code": "DT3228",
    "subject": "DT",
    "number": "3228",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics and Jurisprudence",
    "fullname": "Ethics and Jurisprudence in Allied Dental Health",
    "info": "Studying dental hygiene/dental ethics is intended to provide the tools and skills required for ethical analysis and reflection – critical thinking. The healthcare professional-patient relationship provides a complex array of problems and dental hygiene is, as are practicing dental hygienists, faced with making important decisions about right and wrong and balancing harm and benefits in the clinical setting. Therefore, the primary goal of this course is to help the student dental hygienist understand how to make critical decisions and how to take appropriate actions when dealing with patients, peers, the institution, and society.",
    "prereq": []
  },
  {
    "uid": "803376",
    "code": "DT3230",
    "subject": "DT",
    "number": "3230",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral & Max Radiology",
    "fullname": "Oral and Maxillofacial Radiology",
    "info": "Production/utilization of radiographs in accordance with good professional judgement, as well as state/federal radiation regulations. Processing radiographs in darkroom. Processing a digital image.",
    "prereq": []
  },
  {
    "uid": "803377",
    "code": "DT3231",
    "subject": "DT",
    "number": "3231",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral & Max Radiology II",
    "fullname": "Oral and Maxillofacial Radiology II",
    "info": "Utilization of X-rays in accordance with state/federal radiation regulations. Radiographic assessment of developmental and acquired anomalies of teeth, osseous structures, and maxillary sinus.",
    "prereq": []
  },
  {
    "uid": "803378",
    "code": "DT3232",
    "subject": "DT",
    "number": "3232",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral & Max Radiology Lab",
    "fullname": "Oral and Maxillofacial Radiology Preclinical Laboratory",
    "info": "Preclinical demonstration-participation phases using mounted human skulls.",
    "prereq": []
  },
  {
    "uid": "805903",
    "code": "DT3234",
    "subject": "DT",
    "number": "3234",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Radiology: Theory",
    "fullname": "Oral and Maxillofacial Radiology: Theory, Principles, and Radiographic Analysis",
    "info": "Intraoral and extraoral radiographic anatomy. Principles of radiographic interpretation, evaluation of radiographs to identify variation of normal, and dental and maxillofacial diseases.",
    "prereq": []
  },
  {
    "uid": "805904",
    "code": "DT3238",
    "subject": "DT",
    "number": "3238",
    "honors": false,
    "writingIntensive": false,
    "name": "DPH & Acad Serv Learning I",
    "fullname": "Dental Public Health and Academic Service Learning I",
    "info": "This course provides an overview of the discipline of public health including epidemiological methods of investigation with an emphasis on patterns of oral diseases. Course content emphasizes designing, implementing, and evaluating oral health promotion and health education programs. Students prepare for community service learning programs.",
    "prereq": []
  },
  {
    "uid": "803379",
    "code": "DT3250",
    "subject": "DT",
    "number": "3250",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Hist & Embryology",
    "fullname": "Oral Histology and Embryology",
    "info": "Human embryology. Development of oro-facial region. Development of face, palate, and teeth. Structural microscopic anatomy of hard/soft tissues. Examples of clinical/histopathologic variations.",
    "prereq": []
  },
  {
    "uid": "803380",
    "code": "DT3251",
    "subject": "DT",
    "number": "3251",
    "honors": false,
    "writingIntensive": false,
    "name": "Gen and Oral Path",
    "fullname": "General and Oral Pathology",
    "info": "Etiology, progression, recognition, and treatment of selected general/oral pathological conditions. Relationship general pathology to oral cavity. Head/neck lesions, importance of early detection. Diagnostic process, normal clinical findings.",
    "prereq": []
  },
  {
    "uid": "804060",
    "code": "DT3330",
    "subject": "DT",
    "number": "3330",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Appl I",
    "fullname": "Clinical Application I",
    "info": "Assessment principles related to medical/oral health status. Dental therapy clinical procedures, instrumentation skills. Health assessment, parts of periodontium, dental deposits, toothwear, dental disease/prevention, plaque control.Prereq-Undergrad dental therapy program.",
    "prereq": []
  },
  {
    "uid": "803388",
    "code": "DT3331",
    "subject": "DT",
    "number": "3331",
    "honors": false,
    "writingIntensive": false,
    "name": "Provider Patient Relationships",
    "fullname": "Provider Patient Relationships",
    "info": "Clinical research and evidence-based clinical decision making when communicating therapy/treatment modalities. Promoting active participation by patient in oral self-care. Integrating cultural care.",
    "prereq": []
  },
  {
    "uid": "803389",
    "code": "DT3332",
    "subject": "DT",
    "number": "3332",
    "honors": false,
    "writingIntensive": false,
    "name": "Cariology and Nutrition in DT",
    "fullname": "Cariology and Applied Nutrition in Dental Therapy Care",
    "info": "Dental caries etiology, pathology/prevention. Applying principles of diet/nutrition to dental therapy patient care/counseling.",
    "prereq": []
  },
  {
    "uid": "803390",
    "code": "DT3333",
    "subject": "DT",
    "number": "3333",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Public Health I",
    "fullname": "Dental Public Health and Academic Service Learning I",
    "info": "Dental therapist as engaged with diverse communities and as professionally responsible and ethical. Public health approach to disease. Ways in which U.S. oral health care is delivered. Factors impacting supply/demand. Outreach experiences, service learning.",
    "prereq": []
  },
  {
    "uid": "803420",
    "code": "DT3334W",
    "subject": "DT",
    "number": "3334",
    "honors": false,
    "writingIntensive": true,
    "name": "DT Care Process: Cl Appl II",
    "fullname": "Dental Therapy Care Process: Clinical Application II",
    "info": "Providing dental care for gerodontic patients and patients with disabilities.",
    "prereq": []
  },
  {
    "uid": "803391",
    "code": "DT3336",
    "subject": "DT",
    "number": "3336",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics and Jurisprudence",
    "fullname": "Ethics and Jurisprudence for the Dental Therapist",
    "info": "General ethics, bio-ethics, dental therapy-specific ethics literature. Dental therapy health professional problems. Theory/application in practice of dental therapy.",
    "prereq": []
  },
  {
    "uid": "803392",
    "code": "DT3410",
    "subject": "DT",
    "number": "3410",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Dental Biomaterials",
    "fullname": "Applied Dental Biomaterials",
    "info": "Application of  scientific principles to selection/utilization of dental biomaterials.",
    "prereq": []
  },
  {
    "uid": "804298",
    "code": "DT3429",
    "subject": "DT",
    "number": "3429",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Psychomotor Skill Dev",
    "fullname": "Introduction to Psychomotor Skill Development",
    "info": "Reality based training for psychomotor skills required in prsothodontic/operative courses. Eye-hand/mirror skills, ergonomics used while preparing teeth for restoration.Prereq-Dental therapy student.",
    "prereq": []
  },
  {
    "uid": "803393",
    "code": "DT3430",
    "subject": "DT",
    "number": "3430",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Anat",
    "fullname": "Oral Anatomy",
    "info": "Morphologoical characteristics of human dentition and associated contiguous structures. Foundational knowledge applying to most situations encountered in general dental clinical practice.",
    "prereq": []
  },
  {
    "uid": "803394",
    "code": "DT3431",
    "subject": "DT",
    "number": "3431",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Anat Lab",
    "fullname": "Oral Anatomy Laboratory",
    "info": "Manual dexterity skills, anatomy of human dentition.",
    "prereq": []
  },
  {
    "uid": "803395",
    "code": "DT3432",
    "subject": "DT",
    "number": "3432",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dentistry I",
    "fullname": "Operative Dentistry I",
    "info": "How to treat dental caries. Therapeutic treatment of underlying pathology. Surgical treatment of early caries lesion.prereq: 2d yr dental therapy student",
    "prereq": []
  },
  {
    "uid": "803396",
    "code": "DT3433",
    "subject": "DT",
    "number": "3433",
    "honors": false,
    "writingIntensive": false,
    "name": "Oper Dent I Lab",
    "fullname": "Operative Dentistry I Pre-Clinic Laboratory",
    "info": "How to treat dental caries. Therapeutic treatment of the underlying pathology. Surgical treatment of early caries lesion. Hands-on projects working with models simulating teeth and surrounding structures.prereq: 2d yr dental therapy student",
    "prereq": []
  },
  {
    "uid": "803407",
    "code": "DT3434",
    "subject": "DT",
    "number": "3434",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dent II Lec",
    "fullname": "Operative Dentistry II for the Dental Therapist, Lecture",
    "info": "How to surgically manage more advanced caries lesions. Transition from pre-clinic lab to clinic setting.",
    "prereq": []
  },
  {
    "uid": "805951",
    "code": "DT3435",
    "subject": "DT",
    "number": "3435",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dent II Lab",
    "fullname": "Operative Dentistry II for the Dental Therapist, Lab",
    "info": "More advanced caries lesions: diagnosis, structural preparation, decay removal, and restoration. ",
    "prereq": []
  },
  {
    "uid": "805345",
    "code": "DT3436",
    "subject": "DT",
    "number": "3436",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dentistry  III",
    "fullname": "Operative Dentistry III",
    "info": "Facilitates transition of students from the pre-clinic laboratory to the clinic setting. Students are expected to demonstrate competency in the surgical treatment of dental caries prior to being certified ready for patient care. ",
    "prereq": []
  },
  {
    "uid": "806648",
    "code": "DT3471",
    "subject": "DT",
    "number": "3471",
    "honors": false,
    "writingIntensive": false,
    "name": "Pros for Dental Therapy",
    "fullname": "Prosthodontic Topics for Dental Therapy",
    "info": "Lectures, lab projects of selected prosthodontic techniques to enable the dental therapist to provide/cement quality pre-fabricated metal or resin provisional crowns and other procedures in the scope of DT practice.    ",
    "prereq": []
  },
  {
    "uid": "805348",
    "code": "DT3521",
    "subject": "DT",
    "number": "3521",
    "honors": false,
    "writingIntensive": false,
    "name": "FIPCC",
    "fullname": "Foundations of Interprofessional Professionalism, Communication and Collaboration",
    "info": "Professionalism, communication/collaboration across health professions. Online independent/group work followed by facilitated interprofessional small group discussions of case narratives. ",
    "prereq": []
  },
  {
    "uid": "811190",
    "code": "DT3641",
    "subject": "DT",
    "number": "3641",
    "honors": false,
    "writingIntensive": false,
    "name": "Exodontia & Minor Oral Surg",
    "fullname": "Principles of Exodontia and Minor Oral Surgery",
    "info": "Develop knowledge/skill in exodontia/minor oral surgery.",
    "prereq": []
  },
  {
    "uid": "813261",
    "code": "DT4105",
    "subject": "DT",
    "number": "4105",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Professional Dev",
    "fullname": "Dental Professional Development",
    "info": "This course will introduce dental hygiene and dental therapy students to the various systems impacting a successful dental practice and equip them with the business skills necessary for successful practice management with an emphasis on the roles of a collaborative dental team. Students will also prepare for their professional career by learning employment search strategies and skills",
    "prereq": []
  },
  {
    "uid": "825946",
    "code": "DT4125W",
    "subject": "DT",
    "number": "4125",
    "honors": false,
    "writingIntensive": true,
    "name": "Clinical Application V",
    "fullname": "Process of Care in Allied Dental Health: Clinical Application V",
    "info": "Social justice of health/oral health care in U.S. How race/class/gender impact resources.  Dental hygiene/dental therapy treatment in diverse patient population.",
    "prereq": []
  },
  {
    "uid": "806619",
    "code": "DT4135W",
    "subject": "DT",
    "number": "4135",
    "honors": false,
    "writingIntensive": true,
    "name": "Research Methods",
    "fullname": "Research Methods in Allied Dental Health",
    "info": "Develop skills in the scientific method and critiquing scientific literature. Emphasis is place on evidence-based decision-making, types of research and research design, problem identification and hypothesis development, analyzing individual components of journal articles in relation to research principles, and writing the literature review. Fulfills writing intensive requirement.",
    "prereq": []
  },
  {
    "uid": "806513",
    "code": "DT4139",
    "subject": "DT",
    "number": "4139",
    "honors": false,
    "writingIntensive": false,
    "name": "DPH & Acad Serv Lng II",
    "fullname": "Dental Public Health and Academic Service Learning II",
    "info": "Academic service learning in various community healthcare settings. The student will apply information from Dental Public Health & Service Learning I and II to assess, plan, implement, and evaluate a dental public health program designed to meet the oral health needs of a priority population.",
    "prereq": []
  },
  {
    "uid": "803408",
    "code": "DT4140",
    "subject": "DT",
    "number": "4140",
    "honors": false,
    "writingIntensive": false,
    "name": "Preventive Pediatric Dent Cl",
    "fullname": "Preventive Pediatric Dentistry Clinic",
    "info": "Students participate in oral health promotion of pediatric patients. Brushing techniques, fluoride application, dietary analysis/counseling. Students talk with parents of pediatric patients. At least 10 clinic sessions.",
    "prereq": []
  },
  {
    "uid": "803397",
    "code": "DT4141",
    "subject": "DT",
    "number": "4141",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Pediatric Dent III",
    "fullname": "Clinical Pediatric Dentistry III",
    "info": "Clinical encounters in pediatric dental care. Early childhood development. Care for children that requires foundation knowledge/competence in clinical dentistry.",
    "prereq": []
  },
  {
    "uid": "803409",
    "code": "DT4142",
    "subject": "DT",
    "number": "4142",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinic Pediatric Dent II",
    "fullname": "Clinical Pediatric Dentistry II",
    "info": "Early childhood development, care for children.prereq: Foundation competence in clinical dentistry",
    "prereq": []
  },
  {
    "uid": "803410",
    "code": "DT4143",
    "subject": "DT",
    "number": "4143",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Pediatric Dent III",
    "fullname": "Clinical Pediatric Dentistry III",
    "info": "Early childhood development, dental care for children. ",
    "prereq": []
  },
  {
    "uid": "825560",
    "code": "DT4226",
    "subject": "DT",
    "number": "4226",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Application VI",
    "fullname": "Process of Care in Allied Dental Health: Clinical Application VI",
    "info": "Advanced dental hygiene/dental therapy care process in Comprehensive Care Clinics and Service Learning Outreach sites. Development and presentation of the Senior Capstone experiences. The Capstone is a comprehensive oral case presentation and written case report based on a unique patient experience and treatment.",
    "prereq": []
  },
  {
    "uid": "825561",
    "code": "DT4234",
    "subject": "DT",
    "number": "4234",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership: Prof Development",
    "fullname": "Leadership and Professional Development",
    "info": "Explore the dental hygienist/dental therapist as leader and manager in healthcare delivery organizations or public health organizations and programs. A study of current issues that influence the practice of dental hygiene/therapy including healthcare delivery systems, workforce needs, practice models, regulation, professional associations, state practice acts, and the legislation process. Emphasis on leadership and professional development.",
    "prereq": []
  },
  {
    "uid": "803422",
    "code": "DT4240",
    "subject": "DT",
    "number": "4240",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Radiology Clinic",
    "fullname": "Oral Radiology Clinic",
    "info": "Clinical instruction in oral radiography. Intraoral/extraoral radiographic procedures, quality evaluations.",
    "prereq": []
  },
  {
    "uid": "803411",
    "code": "DT4241",
    "subject": "DT",
    "number": "4241",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Rad Clinic II",
    "fullname": "Oral Radiology Clinic II",
    "info": "Clinical instruction in oral radiography. Intraoral/extraoral radiographic procedures, evaluations.",
    "prereq": []
  },
  {
    "uid": "803412",
    "code": "DT4242",
    "subject": "DT",
    "number": "4242",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Rad Clinic III",
    "fullname": "Oral Radiology Clinic III",
    "info": "Clinical instruction in oral radiography. Intraoral/extraoral radiographic procedures, evaluations.",
    "prereq": []
  },
  {
    "uid": "803423",
    "code": "DT4320",
    "subject": "DT",
    "number": "4320",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Care Clinic",
    "fullname": "Comprehensive Care Clinic",
    "info": "Assessment, treatment, and management of patients. Concepts/principles of evidence-based dentistry as applied to clinical practice. ",
    "prereq": []
  },
  {
    "uid": "803424",
    "code": "DT4321",
    "subject": "DT",
    "number": "4321",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Auxiliary Utilization",
    "fullname": "Dental Auxiliary Utilization",
    "info": "Clinic rotation. Advanced diagnostic/treatment technologies. Techniques of four-handed dentistry.prereq: 2d yr dental therapy student",
    "prereq": []
  },
  {
    "uid": "803413",
    "code": "DT4322",
    "subject": "DT",
    "number": "4322",
    "honors": false,
    "writingIntensive": false,
    "name": "DAU Clinic II",
    "fullname": "Dental Auxillary Utilization Clinic II",
    "info": "Advanced diagnostic/treatment technologies. Techniques of four-handed dentistry.",
    "prereq": []
  },
  {
    "uid": "803414",
    "code": "DT4323",
    "subject": "DT",
    "number": "4323",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Care Clinic II",
    "fullname": "Comprehensive Care Clinic II",
    "info": "Mission of School of Dentistry. Application of principles to the comprehensive assessment, treatment, and management of patients. Evidence-based dentistry.",
    "prereq": []
  },
  {
    "uid": "803415",
    "code": "DT4324",
    "subject": "DT",
    "number": "4324",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Care Clinic III",
    "fullname": "Comprehensive Care Clinic III",
    "info": "Application of principles to comprehensive assessment, treatment, and management of patients. Evidence-based Dentistry.",
    "prereq": []
  },
  {
    "uid": "803421",
    "code": "DT4335",
    "subject": "DT",
    "number": "4335",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Practice Management",
    "fullname": "Dental Practice Management",
    "info": "Interprofessional course. Organizational, managerial, and financial systems that affect successful dental practice.Prereq-2nd yr dental therapy student.",
    "prereq": []
  },
  {
    "uid": "803399",
    "code": "DT4337",
    "subject": "DT",
    "number": "4337",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Health & Academic Serv",
    "fullname": "Dental Public Health and Service Learning II",
    "info": "How to assess, plan, implement, obtain funding for, and evaluate a public health program.",
    "prereq": []
  },
  {
    "uid": "803419",
    "code": "DT4338W",
    "subject": "DT",
    "number": "4338",
    "honors": false,
    "writingIntensive": true,
    "name": "Research Methods in DT",
    "fullname": "Research Methods in Dental Therapy",
    "info": "Types of research. Problem selection, hypothesis writing, research planning/design. Data collection, measuring techniques. Analysis/interpretation of data. Ethics in research. Writing the research proposal.",
    "prereq": []
  },
  {
    "uid": "803400",
    "code": "DT4339",
    "subject": "DT",
    "number": "4339",
    "honors": false,
    "writingIntensive": false,
    "name": "Team Building",
    "fullname": "Team Building Within the Oral Health Care Setting",
    "info": "Elements of oral health care team. Role that provider/others play. How to address issues/suggestions/conflicts in a way that supports the best interest of the patient.",
    "prereq": []
  },
  {
    "uid": "825806",
    "code": "DT4345",
    "subject": "DT",
    "number": "4345",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Service-Learning",
    "fullname": "Dental Service-Learning",
    "info": "This course is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.",
    "prereq": []
  },
  {
    "uid": "825807",
    "code": "DT4346",
    "subject": "DT",
    "number": "4346",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Service-Learning",
    "fullname": "Dental Service-Learning",
    "info": "This course is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.",
    "prereq": []
  },
  {
    "uid": "825808",
    "code": "DT4347",
    "subject": "DT",
    "number": "4347",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Service-Learning",
    "fullname": "Dental Service-Learning",
    "info": "This course is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.",
    "prereq": []
  },
  {
    "uid": "808914",
    "code": "DT4359",
    "subject": "DT",
    "number": "4359",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Outreach Experiences",
    "fullname": "Introduction to Outreach Experiences",
    "info": "Provide patients with dental care in various clinical settings throughout Minnesota. ",
    "prereq": []
  },
  {
    "uid": "803401",
    "code": "DT4360",
    "subject": "DT",
    "number": "4360",
    "honors": false,
    "writingIntensive": false,
    "name": "Outreach Experiences I",
    "fullname": "Outreach Experiences in Dental Therapy",
    "info": "Students complete six-eight weeks of outreach service at combination of following: Hibbing Community College Dental Clinic; Mobile Dental Unit; NorthPoint Health/Wellness Center; Prairie Winds Dental Clinic; Rice Regional Dental Clinic, or Walker Dental Clinic.",
    "prereq": []
  },
  {
    "uid": "803416",
    "code": "DT4361",
    "subject": "DT",
    "number": "4361",
    "honors": false,
    "writingIntensive": false,
    "name": "Outreach Experiences II",
    "fullname": "Outreach Experiences II",
    "info": "Experiences that reinforce principles of delivering dental health care/services to patients, including underserved patient populations, in off-site clinical settings.",
    "prereq": []
  },
  {
    "uid": "820035",
    "code": "DT4415",
    "subject": "DT",
    "number": "4415",
    "honors": false,
    "writingIntensive": false,
    "name": "Essentials of Clinical Care I",
    "fullname": "Essentials of Clinical Care I: Introduction",
    "info": "This course will introduce DT4 dental therapy students to the dental therapy clinically related scope of patient care under the direction and supervision of experienced clinical faculty. This course will monitor and grade progression in clinics each semester. Evaluation will be based on feedback from dental therapy faculty, group leaders and the Competency Review Board.",
    "prereq": []
  },
  {
    "uid": "803402",
    "code": "DT4440",
    "subject": "DT",
    "number": "4440",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dentistry Clinic",
    "fullname": "Operative Dentistry Clinic",
    "info": "Placing restorations. Student clinicians place single tooth restorations on patients, with direction/oversight of instructor.",
    "prereq": []
  },
  {
    "uid": "803417",
    "code": "DT4441",
    "subject": "DT",
    "number": "4441",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Clinic II",
    "fullname": "Operative Clinic II",
    "info": "How to place restorations. Students place single-tooth restorations on patients.",
    "prereq": []
  },
  {
    "uid": "803418",
    "code": "DT4443",
    "subject": "DT",
    "number": "4443",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Clinic III",
    "fullname": "Operative Clinic III",
    "info": "How to place restorations. Student place single-tooth restorations on patients. ",
    "prereq": []
  },
  {
    "uid": "807624",
    "code": "DT4465",
    "subject": "DT",
    "number": "4465",
    "honors": false,
    "writingIntensive": false,
    "name": "Essentials of Clinical Care II",
    "fullname": "Essentials of Clinical Care for the Dental Therapist II",
    "info": "This course will begin to prepare DT4 dental therapy students in the dental therapy clinically related scope of patient care under the direction and supervision of experienced clinical faculty. This course will monitor and grade progression in clinics each semester. Evaluation will be based on feedback from dental therapy faculty, group leaders, and the Competency Review Board.",
    "prereq": []
  },
  {
    "uid": "806524",
    "code": "DT4965",
    "subject": "DT",
    "number": "4965",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Care Dental Therapist",
    "fullname": "Essentials of Clinical Care for the Dental Therapist III",
    "info": "This course will continue to prepare DT4 dental therapy students in the dental therapy clinically related scope of patient care under the direction and supervision of experienced clinical faculty. This course will monitor and grade progression in clinics each semester. Evaluation will be based on feedback from dental therapy faculty, group leaders, and the Competency Review Board.",
    "prereq": []
  },
  {
    "uid": "818391",
    "code": "DT4994",
    "subject": "DT",
    "number": "4994",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Therapy Research",
    "fullname": "Dental Therapy Directed Research",
    "info": "Field investigation of selected areas of research.",
    "prereq": []
  },
  {
    "uid": "827137",
    "code": "DT5001",
    "subject": "DT",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "DT Introduction to Capstone",
    "fullname": "DT Introduction to Capstone",
    "info": "Introduction to capstone research and training for the DT4 dental therapy student. Upon completion of this course students will be able to demonstrate familiarity with the tools of research and scholarship in the field of oral health, identify proper research methods and types of scientific research studies, plan a systematic investigation related to an oral health issue, and review guidelines for conducting research.",
    "prereq": []
  },
  {
    "uid": "811575",
    "code": "DT5005",
    "subject": "DT",
    "number": "5005",
    "honors": false,
    "writingIntensive": false,
    "name": "DT Capstone Project",
    "fullname": "Dental Therapy Capstone Project I",
    "info": "The main purpose of the Capstone courses is to provide a culminating, integrative scholarly experience for students enrolled in the Dual Degree BSDH/MDT program.  As such, in addition to utilizing knowledge gained throughout the 8-semester program, the course draws specifically on students’ prior training in Research and Dental Public Health.  The course allows students to pursue an independent, project-based topic from one of their interests in the field of oral health.  The course is intended to be an intensive, active-learning project, requiring significant effort in the planning and implementation, as well as preparation of a substantial final written product and oral presentation. A Capstone is a systematic investigation of a subject including library and/or original research. Projects are intended to assimilate knowledge gained in courses in order to create a comprehensive, original project. While Capstone projects provide invaluable preparation for professional careers, students report that the primary rewards are intrinsic: the opportunity to follow one’s curiosity, to take ownership of a project and see it through to a successful conclusion, the intellectual and creative pleasure of independent learning, and the mentorship by one’s advisor. Because the written portion of the project is generally quite long, it is essential to devote substantial time to the research and writing of the paper. However, learning to be concise is a valuable skill to master. ",
    "prereq": []
  },
  {
    "uid": "819992",
    "code": "DT5105",
    "subject": "DT",
    "number": "5105",
    "honors": false,
    "writingIntensive": false,
    "name": "DT Capstone Project",
    "fullname": "Dental Therapy Capstone Project II",
    "info": "The main purpose of the Capstone courses is to provide a culminating, integrative scholarly experience for students enrolled in the Dual Degree BSDH/MDT program.  As such, in addition to utilizing knowledge gained throughout the 8-semester program, the course draws specifically on students’ prior training in Research and Dental Public Health.  The course allows students to pursue an independent, project-based topic from one of their in the field of oral health.  The course is intended to be an intensive, active-learning project, requiring significant effort in the planning and implementation, as well as preparation of a substantial final written product and oral presentation. A Capstone is a systematic investigation of a subject including library and/or original research. Projects are intended to assimilate knowledge gained in courses in order to create a comprehensive, original project. While Capstone projects provide invaluable preparation for professional careers, students report that the primary rewards are intrinsic: the opportunity to follow one’s curiosity, to take ownership of a project and see it through to a successful conclusion, the intellectual and creative pleasure of independent learning, and the mentorship by one’s advisor. Because the written portion of the project is generally quite long, it is essential to devote substantial time to the research and writing of the paper. However, learning to be concise is a valuable skill to master. ",
    "prereq": []
  },
  {
    "uid": "804062",
    "code": "DT5135",
    "subject": "DT",
    "number": "5135",
    "honors": false,
    "writingIntensive": false,
    "name": "PreClin Pediatric Dentistry",
    "fullname": "Preclinical Pediatric Dentistry",
    "info": "Childhood development and care of children. Restorative dentistry for children/adolescents. Behavior management techniques. Issues that arise in dental health care setting. Lab.Prereq-DT grad program.",
    "prereq": []
  },
  {
    "uid": "806050",
    "code": "DT5140",
    "subject": "DT",
    "number": "5140",
    "honors": false,
    "writingIntensive": false,
    "name": "Preventive Pediatric Dent Cl",
    "fullname": "Preventive Pediatric Dental Clinic",
    "info": "Oral health promotion of pediatric patients. Brushing techniques, fluoride application, dietary analysis/counseling. Students interact with parents of pediatric patients. ",
    "prereq": []
  },
  {
    "uid": "807407",
    "code": "DT5141",
    "subject": "DT",
    "number": "5141",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Pediatric Dent III",
    "fullname": "Clinical Pediatric Dentistry III",
    "info": "Early childhood development, dental care for children.prereq: Must be in the dental therapy program, passed basic foundation competencies",
    "prereq": []
  },
  {
    "uid": "811492",
    "code": "DT5162",
    "subject": "DT",
    "number": "5162",
    "honors": false,
    "writingIntensive": false,
    "name": "Exodontia & Minor Oral Surg",
    "fullname": "Principles of Exodontia and Minor Oral Surgery",
    "info": "Develop knowledge/skill for exodontia/minor oral surgery.  ",
    "prereq": []
  },
  {
    "uid": "820039",
    "code": "DT5205",
    "subject": "DT",
    "number": "5205",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Correlations/COVID-19",
    "fullname": "MDT Clinical Correlations",
    "info": "Provide MDT students with clinically-based educational opportunities during the mandated clinic closure due to the COVID-19 pandemic.",
    "prereq": []
  },
  {
    "uid": "803373",
    "code": "DT5210",
    "subject": "DT",
    "number": "5210",
    "honors": false,
    "writingIntensive": false,
    "name": "Head and Neck Anat",
    "fullname": "Head and Neck Anatomy",
    "info": "Anatomical nomenclature in head/neck anatomy as they relate to dental therapy treatment.prereq: Accepted into master's dental therapy program",
    "prereq": []
  },
  {
    "uid": "804065",
    "code": "DT5230",
    "subject": "DT",
    "number": "5230",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral & Max Radiology",
    "fullname": "Oral and Maxillofacial Radiology",
    "info": "Production/utilization of radiographs in accordance with good professional judgement, as well as state/federal radiation regulations. Processing radiographs in darkroom. Processing a digital image.Prereq-DT grad program.",
    "prereq": []
  },
  {
    "uid": "807408",
    "code": "DT5241",
    "subject": "DT",
    "number": "5241",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Rad Clinic II",
    "fullname": "Oral Radiology Clinic II",
    "info": "Clinical instruction in oral radiography. Intraoral/extraoral radiographic procedures, evaluations.prereq: Must be in dental therapy masters program",
    "prereq": []
  },
  {
    "uid": "804531",
    "code": "DT5250",
    "subject": "DT",
    "number": "5250",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Hist & Embryology",
    "fullname": "Oral Histology and Embryology",
    "info": "Human embryology. Development of oro-facial region. Development of face, palate, and teeth. Structural microscopic anatomy of hard/soft tissues. Examples of clinical/histopathologic variations.Prereq-Enrolled in master's dental therapy program.",
    "prereq": []
  },
  {
    "uid": "807411",
    "code": "DT5320",
    "subject": "DT",
    "number": "5320",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Care Clinic",
    "fullname": "Comprehensive Care Clinic",
    "info": "Assessment, treatment, and management of patients. Concepts/principles of evidence-based dentistry as applied to clinical practice. ",
    "prereq": []
  },
  {
    "uid": "810460",
    "code": "DT5321",
    "subject": "DT",
    "number": "5321",
    "honors": false,
    "writingIntensive": false,
    "name": "Treatment Planning",
    "fullname": "Treatment Planning for the Dental Therapist",
    "info": "Formal lecture presentations regarding fundamentals of assessment/treatment planning of dental cases. Prepare student to understand University of Minnesota School of Dentistry protocol in development of optimal, alternative, emergency treatment plans.",
    "prereq": []
  },
  {
    "uid": "805905",
    "code": "DT5334W",
    "subject": "DT",
    "number": "5334",
    "honors": false,
    "writingIntensive": true,
    "name": "DT Care Process:  Cl Appl II",
    "fullname": "Dental Therapy Care Process: Clinical Application II",
    "info": "Providing dental care for gerodontic patients and patients with disabilities. ",
    "prereq": []
  },
  {
    "uid": "806510",
    "code": "DT5335",
    "subject": "DT",
    "number": "5335",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Practice Management",
    "fullname": "Dental Practice Management",
    "info": "Interprofessional course. Organizational, managerial, and financial systems that affect successful dental practice.prereq: 2nd yr dental therapy student",
    "prereq": []
  },
  {
    "uid": "825809",
    "code": "DT5348",
    "subject": "DT",
    "number": "5348",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Service-Learning",
    "fullname": "Dental Service-Learning",
    "info": "This course is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.",
    "prereq": []
  },
  {
    "uid": "825810",
    "code": "DT5349",
    "subject": "DT",
    "number": "5349",
    "honors": false,
    "writingIntensive": false,
    "name": "Dental Service-Learning",
    "fullname": "Dental Service-Learning",
    "info": "This course is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.",
    "prereq": []
  },
  {
    "uid": "808915",
    "code": "DT5359",
    "subject": "DT",
    "number": "5359",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Outreach Experiences",
    "fullname": "Introduction to Outreach Experiences",
    "info": "Provide dental care to underserved populations in various clinical settings throughout Minnesota.",
    "prereq": []
  },
  {
    "uid": "808612",
    "code": "DT5360",
    "subject": "DT",
    "number": "5360",
    "honors": false,
    "writingIntensive": false,
    "name": "Outreach Experiences DT Fall",
    "fullname": "Outreach Experiences DT Fall",
    "info": "Students work in clinics outside of U of M with underserved patients.  ",
    "prereq": []
  },
  {
    "uid": "807500",
    "code": "DT5361",
    "subject": "DT",
    "number": "5361",
    "honors": false,
    "writingIntensive": false,
    "name": "Outreach Experiences DT Spring",
    "fullname": "Outreach Experiences DT Spring",
    "info": "Experiences that reinforce principles of delivering dental health care/services to patients, including underserved patient populations, in contemporary off-site clinical settings. ",
    "prereq": []
  },
  {
    "uid": "806015",
    "code": "DT5410",
    "subject": "DT",
    "number": "5410",
    "honors": false,
    "writingIntensive": false,
    "name": "Biomaterials Science",
    "fullname": "Biomaterials Science",
    "info": "Application of scientific principles to selection/utilization of dental materials. Prereq-2nd yr DT student.",
    "prereq": []
  },
  {
    "uid": "804299",
    "code": "DT5429",
    "subject": "DT",
    "number": "5429",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Psychomotor Skill Dev",
    "fullname": "Introduction to Psychomotor Skill Development",
    "info": "Virtual reality based training for psychomotor skills required in prosthodontic/operative courses. Eye-hand/mirror skills, ergonomics used while preparing teeth for restoration.Prereq-In dental therapy program.",
    "prereq": []
  },
  {
    "uid": "803735",
    "code": "DT5430",
    "subject": "DT",
    "number": "5430",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Anat",
    "fullname": "Oral Anatomy",
    "info": "Morphological characteristics of human dentition, associated contiguous structures. Foundational knowledge applied to situations encountered in general dental clinical practice.prereq: Accepted into dental therapy masters program",
    "prereq": []
  },
  {
    "uid": "803733",
    "code": "DT5431",
    "subject": "DT",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "Oral Anat Lab",
    "fullname": "Oral Anatomy Laboratory",
    "info": "Manual dexterity skills, anatomy of human dentition.prereq: Accepted into masters in dental therapy program",
    "prereq": []
  },
  {
    "uid": "803738",
    "code": "DT5432",
    "subject": "DT",
    "number": "5432",
    "honors": false,
    "writingIntensive": false,
    "name": "Oper Dent I",
    "fullname": "Operative Dentistry I",
    "info": "How to treat dental caries. Therapeutic treatment of underlying pathology. Surgical treatment of early caries lesion.",
    "prereq": []
  },
  {
    "uid": "803739",
    "code": "DT5433",
    "subject": "DT",
    "number": "5433",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dentistry I Lab",
    "fullname": "Operative Dentistry I Pre-Clinic Laboratory",
    "info": "How to treat dental caries. Therapeutic treatment of underlying pathology. Surgical treatment of early caries lesion. Hands-on projects working with models simulating teeth and surrounding structures.prereq: 2nd yr masters in dental therapy student",
    "prereq": []
  },
  {
    "uid": "803740",
    "code": "DT5434",
    "subject": "DT",
    "number": "5434",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dentistry II Lecture",
    "fullname": "Operative Dentistry II Lecture",
    "info": "How to surgically manage more advanced caries lesions. Transition from pre-clinic lab to clinic setting.prereq: Enrolled in master's in dental therapy program",
    "prereq": []
  },
  {
    "uid": "805953",
    "code": "DT5435",
    "subject": "DT",
    "number": "5435",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dent II Lab",
    "fullname": "Operative Dentistry II for the Dental Therapist, Lab",
    "info": "More advanced caries lesions: diagnosis, structural preparation, decay removal and restoration. ",
    "prereq": []
  },
  {
    "uid": "805952",
    "code": "DT5436",
    "subject": "DT",
    "number": "5436",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Dentistry III",
    "fullname": "Operative Dentistry III",
    "info": "Transition of students from the pre-clinic laboratory to the clinic setting. Demonstrate competency in the surgical treatment of dental caries prior to being certified ready for patient care. ",
    "prereq": []
  },
  {
    "uid": "807503",
    "code": "DT5443",
    "subject": "DT",
    "number": "5443",
    "honors": false,
    "writingIntensive": false,
    "name": "Operative Clinic III",
    "fullname": "Operative Clinic III",
    "info": "How to place restorations. Students place single-tooth restorations on patients. ",
    "prereq": []
  },
  {
    "uid": "807603",
    "code": "DT5465",
    "subject": "DT",
    "number": "5465",
    "honors": false,
    "writingIntensive": false,
    "name": "Essentials of Clinical Care",
    "fullname": "Essentials of Clinical Care for the Dental Therapist IV",
    "info": "This course will continue to prepare MDT dental therapy students in the dental therapy clinically related scope of patient care under the direction and supervision of experienced clinical faculty. This course will monitor and grade progression in clinics each semester. Evaluation will be based on feedback from dental therapy faculty, group leaders, and the Competency Review Board.",
    "prereq": []
  },
  {
    "uid": "806652",
    "code": "DT5471",
    "subject": "DT",
    "number": "5471",
    "honors": false,
    "writingIntensive": false,
    "name": "Pros for Dental Therapy",
    "fullname": "Prosthodontic Topics for Dental Therapy",
    "info": "Lectures, lab projects of selected prosthodontic techniques to enable the dental therapist to provide/cement quality pre-fabricated metal or resin provisional crowns and other prosthodontic procedures in the scope of DT practice.  ",
    "prereq": []
  },
  {
    "uid": "805349",
    "code": "DT5521",
    "subject": "DT",
    "number": "5521",
    "honors": false,
    "writingIntensive": false,
    "name": "FIPCC",
    "fullname": "Foundations of Interprofessional Professionalism, Communication, and Collaboration",
    "info": "Professionalism, communication/collaboration across health professions. Online independent/group work followed by facilitated interprofessional small group discussions of case narratives. ",
    "prereq": []
  },
  {
    "uid": "826178",
    "code": "DT5565",
    "subject": "DT",
    "number": "5565",
    "honors": false,
    "writingIntensive": false,
    "name": "Essentials of Clinical Care V",
    "fullname": "Essentials of Clinical Care for the Dental Therapist V",
    "info": "This course will continue to prepare MDT students in the dental therapy clinically related scope of patient care under the direction and supervision of experienced clinical faculty. This course will monitor and grade progression in clinics each semester. Evaluation will be based on feedback from dental therapy faculty, group leaders, and the Competency Review Board.",
    "prereq": []
  },
  {
    "uid": "813311",
    "code": "DT5600",
    "subject": "DT",
    "number": "5600",
    "honors": false,
    "writingIntensive": false,
    "name": "DT Elective Regional Volunteer",
    "fullname": "Dental Therapy Elective Regional Volunteer Experience",
    "info": "Elective course that offers various volunteer experiences to the dental therapy students. The course is designed to expose the students to different clinical settings outside of the School of Dentistry (e.g., school-Â­based care, Mission of Mercy). Participants will be allowed to complete dental services under the supervision of a Minnesota licensed dental practitioner with a faculty appointment. Experienced gained will broaden students' perspective of public health needs, delivery care models and or/the impact of health policies. Students reflect on their experience and what they learned by writing a reflective paper. ",
    "prereq": []
  },
  {
    "uid": "811067",
    "code": "DT5641",
    "subject": "DT",
    "number": "5641",
    "honors": false,
    "writingIntensive": false,
    "name": "Exodontia & Minor Oral Surg",
    "fullname": "Principles of Exodontia and Minor Oral Surgery",
    "info": "Knowledge/skill for dental therapy student in exodontia/minor oral surgery. ",
    "prereq": []
  },
  {
    "uid": "805371",
    "code": "DT5960",
    "subject": "DT",
    "number": "5960",
    "honors": false,
    "writingIntensive": false,
    "name": "Essentials of Clinical Care II",
    "fullname": "Essentials of Clinical Care II for the Dental Therapist",
    "info": "Students provide comprehensive care under direction of clinical faculty. May include periodontics, operative, pediatric care, and health promotion. Limited care may be given on rotations to oral surgery clinics.",
    "prereq": []
  },
  {
    "uid": "813864",
    "code": "DT6164",
    "subject": "DT",
    "number": "6164",
    "honors": false,
    "writingIntensive": false,
    "name": "ADT Exodontia & Minor OralSurg",
    "fullname": "Principles of Exodontia and Minor Oral Surgery for the ADT student",
    "info": "This course develops knowledge and skill in the advanced dental therapy (ADT) student in exodontia and minor oral surgery.",
    "prereq": []
  },
  {
    "uid": "818499",
    "code": "DT6212",
    "subject": "DT",
    "number": "6212",
    "honors": false,
    "writingIntensive": false,
    "name": "Grant Writing Oral Health Prog",
    "fullname": "Grant Writing for Community-based Oral Health Programs",
    "info": "The purpose of this course is to provide an introduction to grant writing for oral health care professionals. Topics will include grant sourcing, matching goals and objectives to funding sources, creating evidence-based programs, developing an evaluation plan, writing a compelling proposal, and planning for funding sustainability. The effect of the economic environment and social responsibility of non-profit corporations will be discussed.",
    "prereq": []
  },
  {
    "uid": "818502",
    "code": "DT6213",
    "subject": "DT",
    "number": "6213",
    "honors": false,
    "writingIntensive": false,
    "name": "Comm-based Dent Practice Elect",
    "fullname": "Community-based Dental Practice Elective",
    "info": "The purpose of this elective course is to equip dual licensed dental hygienist/dental therapists to create a non-profit organization in which to provide community-based dental services to a diverse patient base. ",
    "prereq": []
  },
  {
    "uid": "811493",
    "code": "DT6321",
    "subject": "DT",
    "number": "6321",
    "honors": false,
    "writingIntensive": false,
    "name": "Treatment Planning",
    "fullname": "Treatment Planning",
    "info": "Fundamentals of assessment/dental treatment planning using University of Minnesota School of Dentistry protocol in developing optimal, alternative, emergency treatment plans.  Case-based treatment planning/small group seminars utilizied.  ",
    "prereq": []
  },
  {
    "uid": "813275",
    "code": "DT6338",
    "subject": "DT",
    "number": "6338",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Methods",
    "fullname": "Research Methods",
    "info": "This course will prepare the dental therapist to identify research methods and find supporting evidence-based dentistry.",
    "prereq": []
  },
  {
    "uid": "811596",
    "code": "DT6340",
    "subject": "DT",
    "number": "6340",
    "honors": false,
    "writingIntensive": false,
    "name": "ADT Prep Clinic",
    "fullname": "Advanced Dental Therapy Prep Clinic",
    "info": "Preparation for licensed dental therapists to be eligible for advanced dental therapy certification. Course has four requirements: completion of designated clinic hours, self-assessment records, faculty assessment records, final interview that can be completed with patients from student's place of employment.",
    "prereq": []
  },
  {
    "uid": "811597",
    "code": "DT6341",
    "subject": "DT",
    "number": "6341",
    "honors": false,
    "writingIntensive": false,
    "name": "ADT Prep Lecture",
    "fullname": "Advanced Dental Therapy Prep Lecture",
    "info": "Preparation for licensed dental therapists to become eligible for advanced dental therapy certification. Topics range from essential basic sciences to specific clinical procedures.prereq: Must be a licensed dental therapist who was originally trained at the University of Minnesota, School of Dentistry.",
    "prereq": []
  }
]