[
  {
    "uid": "798204",
    "code": "EMMD7400",
    "subject": "EMMD",
    "number": "7400",
    "honors": false,
    "writingIntensive": false,
    "name": "Emergency Medicine, Duluth",
    "fullname": "Emergency Medicine, Duluth Elective",
    "info": "TBD ",
    "prereq": []
  },
  {
    "uid": "014605",
    "code": "EMMD7500",
    "subject": "EMMD",
    "number": "7500",
    "honors": false,
    "writingIntensive": false,
    "name": "Emergency Medicine",
    "fullname": "Emergency Medicine",
    "info": "Rotation provides first-hand experience in dealing with emergency problems in a Level I trauma center. Students work with emergency medicine residents under supervision by board certified attending staff. Students act as primary physician, including initial assessment, minor procedures, interpretation of lab/x-ray, and preparation for admission to inpatient services. Opportunities to observe critical resuscitation.",
    "prereq": []
  },
  {
    "uid": "820010",
    "code": "EMMD7502",
    "subject": "EMMD",
    "number": "7502",
    "honors": false,
    "writingIntensive": false,
    "name": "Emergency Medicine A",
    "fullname": "Emergency Medicine Part A",
    "info": "Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. Catalog Description: The student will have the opportunity to work with Emergency Medicine faculty and residents who for direction. Under their supervision, the student is expected to act as the primary physician for Emergency Department (ED) patients, including initial assessment, performance of minor procedures, interpretation of lab and x-ray, and preparation for admission to inpatient services. The student will also have the opportunity to observe critical resuscitations.",
    "prereq": []
  },
  {
    "uid": "820011",
    "code": "EMMD7503",
    "subject": "EMMD",
    "number": "7503",
    "honors": false,
    "writingIntensive": false,
    "name": "Emergency Medicine B",
    "fullname": "Emergency Medicine Part B",
    "info": "Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. Catalog Description: The student will have the opportunity to work with Emergency Medicine faculty and residents who for direction. Under their supervision, the student is expected to act as the primary physician for Emergency Department (ED) patients, including initial assessment, performance of minor procedures, interpretation of lab and x-ray, and preparation for admission to inpatient services. The student will also have the opportunity to observe critical resuscitations.",
    "prereq": []
  },
  {
    "uid": "825236",
    "code": "EMMD7504",
    "subject": "EMMD",
    "number": "7504",
    "honors": false,
    "writingIntensive": false,
    "name": "Emergency Medicine",
    "fullname": "Emergency Medicine",
    "info": "This is the P/N version of the required Emergency Medicine course.The student will have the opportunity to work with Emergency Medicine faculty and residents who for direction. Under their supervision, the student is expected to act as the primary physician for Emergency Department (ED) patients, including initial assessment, performance of minor procedures, interpretation of lab and x-ray, and preparation for admission to inpatient services. The student will also have the opportunity to observe critical resuscitations.",
    "prereq": []
  },
  {
    "uid": "014625",
    "code": "EMMD7511",
    "subject": "EMMD",
    "number": "7511",
    "honors": false,
    "writingIntensive": false,
    "name": "Emerg Med Elec",
    "fullname": "Emergency Medicine - Regions Hospital",
    "info": "St. Paul Ramsey Medical Center is a Level I Trauma Center designated Burn Center with an annual Emergency Department census of 57,000 patient visits.  It is the goal of the department to offer the student a broad range of challenging patient care situations in acute medical and traumatic illnesses.  These will include pediatrics, obstetric, gynecologic, critical care, urgent and emergency traumatic injuries, and crisis intervention.  Workshops in wound management techniques, splinting techniques, evaluation of cervical spine radiographs, slip lamp and ophthalmologic examination in an interactive modular will be offered during the rotation.  Didactic materials will be distributed prior to the rotation.  Conferences will include trauma and ED critical case conference.",
    "prereq": []
  },
  {
    "uid": "804475",
    "code": "EMMD7512",
    "subject": "EMMD",
    "number": "7512",
    "honors": false,
    "writingIntensive": false,
    "name": "Bedside Ultrasound",
    "fullname": "Bedside Ultrasound",
    "info": "This four week elective will introduce students to bedside ultrasound. Students will learn basics of ultrasound and will perform clinical ultrasounds.",
    "prereq": []
  },
  {
    "uid": "799737",
    "code": "EMMD7515",
    "subject": "EMMD",
    "number": "7515",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP-Emergency Medicine",
    "fullname": "RPAP-Emergency Medicine",
    "info": "",
    "prereq": []
  },
  {
    "uid": "014626",
    "code": "EMMD7521",
    "subject": "EMMD",
    "number": "7521",
    "honors": false,
    "writingIntensive": false,
    "name": "Emergency Medicine Research",
    "fullname": "Emergency Medicine Research",
    "info": "An introduction to Emergency Medicine Research. The student initiates or participates in a research project under the direct supervision of emergency medicine clinician-researchers. Didactic research conferences also are available. ",
    "prereq": []
  },
  {
    "uid": "817544",
    "code": "EMMD7530",
    "subject": "EMMD",
    "number": "7530",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Elective in EMS",
    "fullname": "Special Elective in EMS",
    "info": "This four-week rotation within the Allina Emergency Medical Services is designed to give students first-hand experience in the complex EMS system. Students will observe and in some cases participate in medical direction, audit and review process, emergency preparedness and daily operations of this major urban medical system.",
    "prereq": []
  },
  {
    "uid": "011385",
    "code": "EMMD7571",
    "subject": "EMMD",
    "number": "7571",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Toxicology & EM",
    "fullname": "Clinical Toxicology and Emergency Medicine",
    "info": "Students are involved in initial stages of providing critical care to patients with serious, sometimes life-threatening medical problems. Fundamentals of clinical toxicology: drug overdoses, acute alcohol intoxication and withdrawal syndromes, antidotes, toxic inhalations, environmental toxins, indications for hemoperfusion/dialysis, street drug problems, pediatric poisonings.",
    "prereq": []
  },
  {
    "uid": "820507",
    "code": "EMMD7572",
    "subject": "EMMD",
    "number": "7572",
    "honors": false,
    "writingIntensive": false,
    "name": "Virtual Clinical Toxicology/EM",
    "fullname": "Virtual Clinical Toxicology and Emergency Medicine",
    "info": "This course offers the student the opportunity to be involved in the initial stages of providing critical care to the patient with serious, sometimes life-threatening medical problems. The student will develop understanding of the application of certain procedural principles of critical care and the fundamentals of Clinical Toxicology. These include drug overdoses, acute alcohol intoxication and withdrawal syndromes, antidotes, toxic inhalations, some environmental toxins, indications for hemoperfusion/dialysis, street drug problems, and principles of pediatric poisonings.",
    "prereq": []
  },
  {
    "uid": "789703",
    "code": "EMMD7600",
    "subject": "EMMD",
    "number": "7600",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Adv Emerg Med",
    "fullname": "Acting Internship Advanced Emergency Medicine: Career Track",
    "info": "This course is designed for medical students interested in pursuing a career in Emergency Medicine. Students will rotate at a Level I Trauma Center.",
    "prereq": []
  }
]