[
  {
    "uid": "003506",
    "code": "ENGC1001",
    "subject": "ENGC",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Prep Univ Writing",
    "fullname": "Preparation for University Writing",
    "info": "Guided writing practice in prewriting, drafting, and revising as well as grammar, sentence structure, and paragraphing. For students who are not fully prepared for academic writing. Weekly meetings with a tutor in the Student Writing Center required.",
    "prereq": []
  },
  {
    "uid": "003513",
    "code": "ENGC1012",
    "subject": "ENGC",
    "number": "1012",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ Writ, MultiCulturalism",
    "fullname": "University Writing and Critical Reading: Perspectives on Multiculturalism",
    "info": "Extended practice in writing on topics concerning cultural diversity. Projects involving critical reading/interpretation of selected texts, research in various types of resources, and writing that moves through several drafting steps. Finished writing is revised/edited to meet university-level standards of persuasiveness, precision, and correctness.",
    "prereq": []
  },
  {
    "uid": "003514",
    "code": "ENGC1013",
    "subject": "ENGC",
    "number": "1013",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ Writing: Nature & Envir",
    "fullname": "University Writing and Critical Reading: Nature and the Environment",
    "info": "Writing on topics concerning the environment. Critical reading/interpretation of selected texts. Research in various types of resources. Writing through several drafting steps. Finished writing is revised/edited to meet university-level standards.",
    "prereq": []
  },
  {
    "uid": "003178",
    "code": "ENGC1014",
    "subject": "ENGC",
    "number": "1014",
    "honors": false,
    "writingIntensive": false,
    "name": "Univ Writ: Contemp. Pub Issues",
    "fullname": "University Writing and Critical Reading: Contemporary Public Issues",
    "info": "Writing on topics concerning citizenship and public ethics. Projects involve critical reading/interpretation of selected texts, research in various types of resources, and writing through several drafting steps. Finished writing is revised/edited to meet university-level standards.",
    "prereq": []
  },
  {
    "uid": "790404",
    "code": "ENGC1015",
    "subject": "ENGC",
    "number": "1015",
    "honors": false,
    "writingIntensive": false,
    "name": "Unv Wrtg: Persp/Globalization",
    "fullname": "University Writing and Critical Reading: Perspectives on Globalization",
    "info": "Critical reading/interpretation of selected texts. Research in various types of resources, including Internet. Writing through several drafting steps. Finished writing is revised/edited to meet university-level standards of persuasiveness, precision, and correctness.",
    "prereq": []
  },
  {
    "uid": "795740",
    "code": "ENGC1016",
    "subject": "ENGC",
    "number": "1016",
    "honors": false,
    "writingIntensive": false,
    "name": "UWCR: Community Learning",
    "fullname": "University Writing and Critical Reading: Community Learning and Civic Engagement",
    "info": "Extended practice in writing academic prose in response to community engagement. Students serve at least two hrs per week at a local school, agency, or community organization. Critical reading/interpretation of selected texts. Research in various types of resources, including Internet media resources. Writing that moves through several drafting steps. Finished writing is revised/edited to meet university-level standards of persuasiveness, precision, and correctness.",
    "prereq": []
  },
  {
    "uid": "003515",
    "code": "ENGC1021W",
    "subject": "ENGC",
    "number": "1021",
    "honors": false,
    "writingIntensive": true,
    "name": "Interm Expos Wrtg",
    "fullname": "Intermediate Expository Writing",
    "info": "Focuses on the range of choices writers make based on audience, purpose, and context.  Relies on critical reading and a variety of writing assignments to improve control over writing and the effect it will have on intended audiences.",
    "prereq": []
  },
  {
    "uid": "006971",
    "code": "ENGC3027W",
    "subject": "ENGC",
    "number": "3027",
    "honors": false,
    "writingIntensive": true,
    "name": "AdvExposWrtg",
    "fullname": "Advanced Expository Writing",
    "info": "Incorporating narrative, descriptive, analytical, persuasive techniques into writing on general topics. Effective argumentation through critical reading, use of library resources, awareness of context/audience.",
    "prereq": []
  },
  {
    "uid": "793960",
    "code": "ENGC3029W",
    "subject": "ENGC",
    "number": "3029",
    "honors": false,
    "writingIntensive": true,
    "name": "Professional Writing",
    "fullname": "Professional Writing",
    "info": "How to write for various professional purposes/audiences, using differing styles, tones, and organizational elements. Potential genres include grant proposals, feasibility studies, job search portfolios, progress reports, annotated bibliographies. Broader issues of professional literacy.",
    "prereq": []
  },
  {
    "uid": "007459",
    "code": "ENGC3650",
    "subject": "ENGC",
    "number": "3650",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Composition",
    "fullname": "Topics in Composition",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "789637",
    "code": "ENGC6543",
    "subject": "ENGC",
    "number": "6543",
    "honors": false,
    "writingIntensive": false,
    "name": "test",
    "fullname": "test",
    "info": "",
    "prereq": []
  }
]