[
  {
    "uid": "816604",
    "code": "ENGL1",
    "subject": "ENGL",
    "number": "1",
    "honors": false,
    "writingIntensive": false,
    "name": "Pre Comp",
    "fullname": "Pre Comp",
    "info": "",
    "prereq": []
  },
  {
    "uid": "002423",
    "code": "ENGL1001W",
    "subject": "ENGL",
    "number": "1001",
    "honors": false,
    "writingIntensive": true,
    "name": "Introduction to Literature",
    "fullname": "Introduction to Literature: Poetry, Drama, Narrative",
    "info": "This is a writing-intensive course that also meets the Literature Core requirement. From epic battles against monsters in legendary kingdoms to stories about characters in worlds similar to our own, literature engages us with the diverse perspectives and experiences that make up our communities and world. ENGL 1001W introduces students to ways of understanding and appreciating literature in English across cultures and historical periods. Throughout this course, we will develop skills to help us understand literature, especially the ability to read language closely (a skill valuable in many disciplines beyond literature). We will explore how writers use language and literary aspects, such as genre, voice, tone, symbol, motif, theme, imagery, narrative, and form. We also will learn how to write about literature, sharing our interpretations of how and why literary works have meaning for ourselves and others, while viewing them through critical cultural lenses, including ways to understand how gender, race, ethnicity, religion, and class can function in literary texts.",
    "prereq": []
  },
  {
    "uid": "814570",
    "code": "ENGL1003W",
    "subject": "ENGL",
    "number": "1003",
    "honors": false,
    "writingIntensive": true,
    "name": "Women Write the World",
    "fullname": "Women Write the World",
    "info": "Concepts in literary studies. Poems, plays, short stories, novels, essays, letters by women from different parts of world. Focuses on lives, experiences, and literary expression of women, including basic concepts of women's studies.",
    "prereq": []
  },
  {
    "uid": "826510",
    "code": "ENGL1004",
    "subject": "ENGL",
    "number": "1004",
    "honors": false,
    "writingIntensive": false,
    "name": "Banned Books",
    "fullname": "Banned Books",
    "info": "Is reading dangerous? What do books \"do\" to readers that is insidious and must be stopped? In this course, we will begin with the three books currently banned most frequently in the US. While the class will touch on the long international history of book banning, in this course you will learn primarily about the recent history of book banning in the US. You will also learn concepts and terminology regarding literary studies. \"Why was this banned?\" is the question that will reverberate through every week of this course.",
    "prereq": []
  },
  {
    "uid": "826675",
    "code": "ENGL1005",
    "subject": "ENGL",
    "number": "1005",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading Poetry",
    "fullname": "Reading Poetry",
    "info": "Poems say interesting things in small spaces. How do they do it? The famous American poet Emily Dickinson wrote, “If I feel physically as if the top of my head were taken off, I know that is poetry.” While Dickinson isn’t describing poems that literally saw through her skull, she is describing the odd and wondrous ways in which poems affect us. While poems are literary texts, they are musical, visual, and, most often, short. White, brown, and black folks from all walks of life read and write them. Expect to read poems from a variety of perspectives and time periods that all say interesting things in their own, individual ways.",
    "prereq": []
  },
  {
    "uid": "818440",
    "code": "ENGL1011",
    "subject": "ENGL",
    "number": "1011",
    "honors": false,
    "writingIntensive": false,
    "name": "Laughter and Literature",
    "fullname": "Laughter and Literature Through the Ages",
    "info": "Explaining how comedy differs from tragedy, Aristotle observed that \"Man is the only animal who laughs and cries.\" Like our other emotions, laughter and grief are not rational (a purely reasonable animal would not be swayed by feelings), and that's why any attempt to rationalize either of these paradoxical emotions is likely to fail. Traditionally, grief is separated from laughter by using the twin categories of comic and tragic. But even in drama or literature, grief is not utterly desperate and laughter is not always funny. This last paradox -that laughter need not be comic- serves as a basic axiom for our course, which will study not just the laughter presented in literature but historical (e.g., classical and medieval) examples. Instead of focusing on contradictory generic theories, this course examines laughter in specific dramatic, narrative and historical works from ancient Greece and Rome down through the medieval and modern eras. This course will show students how to bring a historical perspective to bear on the philosophical question, \"What is laughter?\" As modern readers, they will learn that the best way for us to study a past culture is to start with critical thinking about our own.",
    "prereq": []
  },
  {
    "uid": "817856",
    "code": "ENGL1031",
    "subject": "ENGL",
    "number": "1031",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to the Short Story",
    "fullname": "Introduction to the Short Story",
    "info": "English literature boasts some of the most powerful, beautifully crafted short stories in world literature. In this class, we will use the short story as a path for understanding the craft of writing: how writers use language to present a vividly imagined world in a short number of pages. We will also examine the importance of genre: how, for example, a detective short story differs from a slice of life story. This is a lecture course, but will involve substantial student discussion. ",
    "prereq": []
  },
  {
    "uid": "817392",
    "code": "ENGL1041",
    "subject": "ENGL",
    "number": "1041",
    "honors": false,
    "writingIntensive": false,
    "name": "Adaptation: Literature to Film",
    "fullname": "Adaptation: Literature into Film",
    "info": "Do you refuse to see a film until you've first read the book on which it is based, so it doesn't affect how you imagine the characters? Or does a film inspire you to go back and read the original book, to see what the filmmakers changed or left out? Either way, if you love book covers that say \"Now a major motion picture,\" this is the class for you. \"Adaptation: Literature to Film\" explores the historical, cultural, and aesthetic contexts in which both literary and cinematic texts are produced and received. We will ask such questions as: When we read a book or a play and then watch an adaptation of it, are we in any sense encountering the \"same\" text? Does the intention of the author necessarily define the meaning of a text, as readers see it? What other elements enter into the formulation of meaning(s)? How are elements of an inter-textual system always, in some sense, \"in dialogue\" with each other, and how do different media affect us differently -- whether emotionally, aesthetically, or intellectually? In this class you will learn skills related to interpreting and writing about both literature and moving image media (i.e., film, television, animation, etc.), including concepts and vocabulary specific to each, and your written assignments will include close readings of both books and films.",
    "prereq": []
  },
  {
    "uid": "826677",
    "code": "ENGL1042",
    "subject": "ENGL",
    "number": "1042",
    "honors": false,
    "writingIntensive": false,
    "name": "Engaging with Queer Cinema",
    "fullname": "Engaging with Queer Cinema",
    "info": "What codes are at work that make a film Queer? In Queer Cinema, you will be an interpretive artist and active spectator as we analyze and consider subversive cinema from across nations and historical periods. Sometimes these films will be obviously queer or trans. However, queer and trans film is often coded or distorted, especially in response to legal or societal censorship or disapproval. As a result, Queer directors and writers sometimes speak in a liberatory way to particular oppressed/silenced groups on the level of coded content, but if the content is consumed out of context of the code, the experience of a film may be contradictory, even offensive. Consequently we'll be looking for the queer subversions within the distortions.",
    "prereq": []
  },
  {
    "uid": "818130",
    "code": "ENGL1051",
    "subject": "ENGL",
    "number": "1051",
    "honors": false,
    "writingIntensive": false,
    "name": "Lit, Science & Technology",
    "fullname": "Progress & Madness: Literature, Science & Technology",
    "info": "This introductory, Liberal Education course explores the conflicts and conversations that occur at the frontiers of scientific thinking and technological innovation by examining select literary and cinematic texts from a variety of historical moments and points of view. We will consider the ambivalence and anxiety that attend progress via topics such as electricity, telegraphy, photography, the railroad, the cinema, Fordism, the atomic bomb, genetic engineering, and the Internet. We will also track the archetype of the mad scientist, whose dangerous knowledge and often-fatal hubris typically turn a tale \"cautionary.\" Students engage in detailed analysis of and reflection on works of literature and film that address both historical and contemporary developments in science and technology. The course introduces students to a range of technologies that have had a measurable impact on contemporary society. Class discussion uses the representation of these innovations as case studies in how technologies develop through the application of individual and collective effort, as well as how society adopts or rejects these technologies. By considering a variety of points of view on these developments, students are exposed to multiple perspectives through which a technology can be understood, and they develop skills in evaluating conflicting views that provide a framework with which to evaluate new technology in the future.",
    "prereq": []
  },
  {
    "uid": "793747",
    "code": "ENGL1171W",
    "subject": "ENGL",
    "number": "1171",
    "honors": false,
    "writingIntensive": true,
    "name": "The Story of King Arthur",
    "fullname": "The Story of King Arthur",
    "info": "Arthurian literature, from earliest times to present. How the same story can accommodate many different systems of belief. Form and changing historical backgrounds.",
    "prereq": []
  },
  {
    "uid": "803425",
    "code": "ENGL1172",
    "subject": "ENGL",
    "number": "1172",
    "honors": false,
    "writingIntensive": false,
    "name": "The Story of King Arthur",
    "fullname": "The Story of King Arthur",
    "info": "Of all the stories familiar to the western world, few have exerted a greater influence on literary, pictorial, and musical productions than the legend of King Arthur and his Round Table. Although thousands of years have passed since the earliest versions of the story appeared, creative artists and their audiences continue to be fascinated by stories about Arthur, Merlin, Lancelot, Guinevere, Gawain, and Tristan. In this course, we will study adaptations of the legend in order to understand how literary writers and their readers remade the story to fit specific, historical circumstances. The course will pay particular attention to two related aspects of the legend. The first is the way that stories about Arthur emphasize the importance of personal integrity as a shaping force of history. The second is the relationship between personal responsibility and communal or civic order. We will see how these ideas are reshaped by writers in various times and places (ranging from early medieval Wales and England to twenty-first-century America). We will think comparatively about these times and places by paying close attention to the literary traditions and forms that are employed by writers who remake the story of Arthur.",
    "prereq": []
  },
  {
    "uid": "002429",
    "code": "ENGL1181W",
    "subject": "ENGL",
    "number": "1181",
    "honors": false,
    "writingIntensive": true,
    "name": "Introduction to Shakespeare",
    "fullname": "Introduction to Shakespeare",
    "info": "This course explores the richness and variety of the playwright William Shakespeare through intensive study of representative plays and poems. Although Shakespeare died over 400 years ago, he is now more popular than ever. In his own day, Shakespeare was able to entertain, shock, amuse, and inform his audiences. Today, his work continues to have a global influence in nearly every corner of the world. Through class lectures, discussions and written work, students will be challenged and inspired by the many complexities and connections that we still have with the world's greatest playwright.",
    "prereq": []
  },
  {
    "uid": "003874",
    "code": "ENGL1201W",
    "subject": "ENGL",
    "number": "1201",
    "honors": false,
    "writingIntensive": true,
    "name": "Contemporary American Lit",
    "fullname": "Contemporary American Literature",
    "info": "In this course, we will focus on the analysis of literature, specifically novels and short stories published since 1960 by American authors. We will emphasize close reading, consistently and specifically addressing issues of language and meaning. Our books will also fuel an ongoing discussion of the formal aspects of literature, including style, characterization, plot, theme, tone, and symbolism, and their capacity to evoke a powerful response from readers. This four-credit writing intensive class requires attendance at a twice-weekly lecture and once-weekly discussion section.",
    "prereq": []
  },
  {
    "uid": "003877",
    "code": "ENGL1301W",
    "subject": "ENGL",
    "number": "1301",
    "honors": false,
    "writingIntensive": true,
    "name": "Multicultural Lit of US",
    "fullname": "Introduction to Multicultural Literatures of the United States",
    "info": "This course will include representative works by American Indian, African American, Asian American, Chicano/Chicana writers, and/or Jewish American writers, ranging from Nobel and Pulitzer prize-winning masters to upcoming genre authors and debut authors. In reading these works, we will discuss social and cultural factors informing America's literary past and present. As these authors honor identity, celebrate community, and deal with the complexities of the modern age, they also explore America's shared and problematic past. Because this course is Writing Intensive, we will spend considerable time drafting, discussing, and revising papers. Techniques for writing a paper, close reading strategies, and relevant critical approaches will be discussed. As we tease out the meanings and methods of our texts, we'll also identify and analyze key literary devices.",
    "prereq": []
  },
  {
    "uid": "003876",
    "code": "ENGL1401W",
    "subject": "ENGL",
    "number": "1401",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to World Lit in English",
    "fullname": "Introduction to World Literatures in English",
    "info": "This writing-intensive course will introduce you to texts from geographical locations such as Africa, Asia, and the Caribbean with the aim of examining the impact that colonialism has had on previously colonized nations, as well as the world as a whole. Through close readings of these texts, we will examine questions related to concepts such as \"third world,\" nationalism, difference, representation, and displacement. ",
    "prereq": []
  },
  {
    "uid": "788974",
    "code": "ENGL1501W",
    "subject": "ENGL",
    "number": "1501",
    "honors": false,
    "writingIntensive": true,
    "name": "Literature and Public Life",
    "fullname": "Literature and Public Life",
    "info": "This course explores how literary language builds the collective knowledge, shared reality, and civic relationships that make up public life. Literature's power in the public sphere goes far beyond the quiet, solitary experience of reading. We will investigate how telling stories, documenting events, imagining possibilities, communicating ideals, representing conflict, and even creating fictional characters contribute to public life. Through a wide variety of texts, we will reflect on the nature of public life and on how reading and writing build civic relationships and democratic potential. This course will also offer you two tracks for actively engaging in public life. A service-­learning option will give you the experience of building literacy, developing skills in communication and public media, and strengthening roles in work and family. This recommended learning framework can engage your role as a citizen, broaden the impact of your education, and help you explore potential professional interests. Alternatively, an individually designed public project will prompt you to consider the links between literary/media culture, personal action, and public life, and to make your own intervention in these fields. To succeed in all areas of this class you must display active engagement, independent thinking and motivation, and organization.",
    "prereq": []
  },
  {
    "uid": "004317",
    "code": "ENGL1601W",
    "subject": "ENGL",
    "number": "1601",
    "honors": false,
    "writingIntensive": true,
    "name": "English Language and Society",
    "fullname": "English Language and Society",
    "info": "Nontechnical understanding of systematic, dynamic, creative nature of human language. Emphasizes English language.",
    "prereq": []
  },
  {
    "uid": "790018",
    "code": "ENGL1701",
    "subject": "ENGL",
    "number": "1701",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Fiction",
    "fullname": "Modern Fiction",
    "info": "In Modern Fiction, we will study a selection of novels and short stories by some of the most compelling and original writers of our time. We will read work by contemporary authors and classic modernists whose stylistic innovations influenced a generation. Because literature is a continuum in which the present responds to the past, we'll note evolutions and developments in the genre over time. We will identify and analyze such elements of fiction as theme, genre, structure, form, language, and context.",
    "prereq": []
  },
  {
    "uid": "805832",
    "code": "ENGL1902",
    "subject": "ENGL",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "811739",
    "code": "ENGL1904",
    "subject": "ENGL",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "790428",
    "code": "ENGL1905",
    "subject": "ENGL",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "803863",
    "code": "ENGL1907W",
    "subject": "ENGL",
    "number": "1907",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788178",
    "code": "ENGL1910W",
    "subject": "ENGL",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "817206",
    "code": "ENGL1911",
    "subject": "ENGL",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian Americans--First Person",
    "fullname": "Asian Americans in the First Person",
    "info": "Americans of Asian descent comprise one of the fastest-growing racial groups in the US today. While large numbers of Asian Americans have been in the US since the middle of the 19th century, it is only in the past few decades that they have been widely recognized in literature and film. What do artistic works such as memoirs, documentary films, graphic novels, oral histories, and poetry say about the experiences of Asian Americans? How do individual artists depict themselves and others as part of families, communities, or nations? How do questions of race, racism, family, identity, immigration, labor, citizenship, inequality, gender, sexuality, media stereotypes, and activism affect the perspectives and the aesthetic choices of these works?Our readings and screenings will reference historical events such as early Chinese immigration and WWII Japanese American incarceration, as well as contemporary Asian American experiences. We will also be working with oral histories and digital stories to capture the voices and images of Asian Americans in our own communities.",
    "prereq": []
  },
  {
    "uid": "817140",
    "code": "ENGL1912",
    "subject": "ENGL",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "America in Crisis",
    "fullname": "America in Crisis",
    "info": "America has a long history of injustice that lives on today in diverse forms. This course focuses on current crises in our economy, society, and (presumably democratic) government. We will analyze and try to solve some of the pressing questions. How did we end up with the largest wage and wealth disparities in the developed world? Why are low-income and even middle-income families struggling to make ends meet? Why did our K-12 education system, once in first place, drop behind education in all developed nations?  Why does our healthcare system cost more yet provide less access and quality than systems elsewhere? In short, what forces created the gulf between the lived experiences of ordinary Americans and the high ideals articulated in the US Constitution? ",
    "prereq": []
  },
  {
    "uid": "817087",
    "code": "ENGL1913W",
    "subject": "ENGL",
    "number": "1913",
    "honors": false,
    "writingIntensive": true,
    "name": "Coming of Age in Fiction",
    "fullname": "I Don't Want to Grow Up: Coming of Age in Fiction",
    "info": "In this literature and discussion seminar, we will read novels and short stories that portray the often uneasy shift from the teen years to adulthood in a wide range of books, from Jane Austen to the American western to narratives of soldiering and war to graphic/comic novels to dystopian fiction. Students will debate, analyze, and occasionally *dramatize* the coming-of-age experiences about which we will read. What does adulthood consist of? In what ways have the definitions of youth and maturity changed over time, depending on historical and cultural context? This is a \\\"Writing Intensive\\\" course: Students will produce imaginative, coherent, thought-provoking and grammatically correct essays; revision will be an integral part of the class.\n",
    "prereq": []
  },
  {
    "uid": "819846",
    "code": "ENGL1914",
    "subject": "ENGL",
    "number": "1914",
    "honors": false,
    "writingIntensive": false,
    "name": "The Immigrant and the Refugee",
    "fullname": "The Immigrant and the Refugee",
    "info": "This course will examine several case studies in the literature of immigration in the United States: the Declaration of Independence, our founding text, which stages the country as a ?nation of immigrants?; Ocean Vuong?s On Earth We?re Briefly Gorgeous, a queer Asian-American novel by a second generation immigrant; and the story of Ilhan Omar, Minneapolis?s congressional representative, who is a Muslim woman, Somali-American, and both immigrant and refugee. Omar?s story also serves as transition to the problem of the refugee, which we will address in two instances: the Jew in mid-twentieth century Europe, as staged in Hannah Arendt?s ?We Refugees,? and today?s Palestinian, in Edward Said?s After the Last Sky. As we read, we will consider how the figures of the immigrant and the refugee can signal both dispossession (the loss of home, nation, and community) and disruption (the troubling of these same notions of home, nation, and community that we so often take for granted).  ",
    "prereq": []
  },
  {
    "uid": "817879",
    "code": "ENGL1915",
    "subject": "ENGL",
    "number": "1915",
    "honors": false,
    "writingIntensive": false,
    "name": "Poetry and Poetic Form",
    "fullname": "Poetry and Poetic Form",
    "info": "\"Poetry,\" William Wordsworth tells us, \"is the spontaneous overflow of powerful feelings,\" but he goes on to insist that these emotions must be \"recollected in tranquillity,\" that is, they are put into some kind of form by the work of the poet. In this seminar, we will pay close attention to the powerful images, flights of intelligence, and depths of feeling that good poetry often provides, and we will also focus on technical matters such as rhyme and meter, the characteristics of various \"fixed forms\" (the sonnet, the villanelle, the pantoum) and \"open forms\" (the elegy, the ode), and on the special features of free verse. As part of their work as readers, students will be encouraged to experiment with writing in certain verse forms.",
    "prereq": []
  },
  {
    "uid": "817919",
    "code": "ENGL1916",
    "subject": "ENGL",
    "number": "1916",
    "honors": false,
    "writingIntensive": false,
    "name": "Wilde Nineties!",
    "fullname": "Wilde Nineties!",
    "info": "The Fin de Siècle, the decade from 1890 to 1900, remains one of the most dynamic and transformative of modern times, opening with Oscar Wilde's celebrity and closing with the scandal of his disgrace, imprisonment, and death. In taking into account the great anxiety over decadence and degeneration, not to mention the \"sex question\" evident in Wilde's trials, this course aims at a \"slice of life,\" horizontally and vertically, over a period that also witnessed technological wonders (cinema, x-rays, airplanes), revolutions in music and fashion, and the publication of such sensational fictions as The Time Machine and Dracula. All of these, along with Wilde's The Picture of Dorian Gray and Salomé, will occupy our discussions in class, in short reflection papers, and in a more formal interpretive analysis. The aim of the course is to provide a challenging and useful introduction to the enormous cultural shifts of the decade that resonate in the present moment and that make Wilde a continuing figure of great cultural debate and significance.",
    "prereq": []
  },
  {
    "uid": "819847",
    "code": "ENGL1917",
    "subject": "ENGL",
    "number": "1917",
    "honors": false,
    "writingIntensive": false,
    "name": "Libraries",
    "fullname": "Libraries: Exploring the Spaces of Knowledge",
    "info": "Today many of us do our research online -- sitting at our home or office, and examining digital information in a virtual universe. Nonetheless, there is something to be said for browsing stacks, handling physical books, and exploring the actual spaces of libraries. Physical libraries and books allow for a different way of experiencing knowledge and enable surprising discoveries – discoveries about our topics of interest, as well as about what libraries might be good for and what knowing might mean. In this seminar we will visit local libraries – UMN libraries, Hennepin County Libraries, museum libraries – and read about the world history of libraries – from Ancient Alexandria through modern national collections, such as the British Library and the Library of Congress. Students will write three short reports from their visits to local libraries, and a short research paper on a historical library of their choice. ",
    "prereq": []
  },
  {
    "uid": "819956",
    "code": "ENGL1918",
    "subject": "ENGL",
    "number": "1918",
    "honors": false,
    "writingIntensive": false,
    "name": "After the Apocalypse",
    "fullname": "The Worlds We Have Made: Some of Us Are Already Living in a Dystopia/ After the Apocalypse",
    "info": "Over the last 20 years, film, video, television and other media have increasingly depicted the end of the world/ this world. Whether in totalitarian states in which liberal freedoms no longer exist or after the decimation of the natural environment, society and its infrastructures, the idea that we are headed to ruin is an entertaining prospect (in that it is suffused into so much of our entertainment-oriented media). This course analyzes these dystopian and post-apocalyptic representations in relationship to the “catastrophes” impacting various marginalized groups in the present, problematizing the futuristic settings of the world’s end. This course considers the modes of thought that have led and are leading to our destruction(s) and that drive our consumption of these pessimistic imaginings of the future. Together we will connect the apocalypses/dystopias that we turn away from and disavow in the present, those we pave the way for in the future, and those that we pay good money to watch. Finally, we will consider how marginalized subjects have imagined and theorized other modes of political and social organization within their apocalyptic presents and what, if anything, we can do about these present and potentially future catastrophes. Readings may include include comics and films from Marvel and D.C., and novels and short stories by N.K. Jemisin, P.D. James Alexis, Pauline Gumbs, and Octavia Butler. ",
    "prereq": []
  },
  {
    "uid": "818804",
    "code": "ENGL1919",
    "subject": "ENGL",
    "number": "1919",
    "honors": false,
    "writingIntensive": false,
    "name": "Jane Austen's Afterlives",
    "fullname": "Jane Austen's Afterlives",
    "info": "More than two hundred years after her death, Jane Austen continues to attract new readers and fans across the globe. In this seminar, we will examine Austen’s novels alongside the far more voluminous body of scholarship, sequels, films, and fan clubs they have inspired. Besides considering Austen's distinctive style, the centrality of her work in the history of the novel, and the literary and cultural context in which she wrote, we will explore the variety of ways in which the author and her novels have continued to be appropriated, adapted, and admired across the globe.",
    "prereq": []
  },
  {
    "uid": "825155",
    "code": "ENGL1921",
    "subject": "ENGL",
    "number": "1921",
    "honors": false,
    "writingIntensive": false,
    "name": "War: Cultural & Lit History",
    "fullname": "World Wars I, II, and III: A Cultural and Literary History",
    "info": "This course addresses the problem of war in human society with particular reference to the actual and anticipated wars of the past century.  Why do wars happen?  Do they derive from something inherent in human nature, the actions and ideologies of particular nations, or the competitive nature of the international political system?  What logics govern the proliferation of ever deadlier weaponry?  Can wars be managed?  Will the world ever really know peace?  How did major writers, artists, composers, political thinkers, and opinion shapers address these questions over the violent course of the twentieth century? In terms of methodology, this course falls somewhere on the disciplinary boundaries between history, international relations theory, and literary studies. Our readings will include Kenneth Waltz’s seminal work of IR theory, Man, the State, and War; the World War I poets Rupert Brooke, Siegfried Sassoon, Wilfred Owen, and Margaret Postgate Cole; Robert Grave’s unforgettable war memoir, Goodbye to All That; Patrick Hamilton's Slaves of Solitude; Evelyn Waugh’s Put Out More Flags; Elizabeth Bowen’s The Demon Lover and Other Stories; Svetlana’s Alexievitch’s The Unwomanly Face of War; John Hersey’s Hiroshima; and Walter J. Miller’s A Canticle for Liebowitz. We will also study paintings by Pablo Picasso, Paul Nash, Thomas Hennell, and Frank Auerbach; screen Sergei Eisenstein’s Alexander Nevsky, Fred Zinnemann’s From Here to Eternity, and Mick Jackson’s Threads; and listen to music by Dmitri Shostakovich, Benjamin Britten, and Arvo Pärt. Grades will be based on a combination of exams, papers, and class discussion. ",
    "prereq": []
  },
  {
    "uid": "825965",
    "code": "ENGL1922W",
    "subject": "ENGL",
    "number": "1922",
    "honors": false,
    "writingIntensive": true,
    "name": "Shakespeare in London",
    "fullname": "Shakespeare in London and Stratford",
    "info": "\"Shakespeare in London and Stratford\" is a Freshman Seminar with a study abroad component, for students from across the University, from science majors to business majors, from premed students to studio art majors.  We will begin our course in cold, snowy Minnesota in January and February, covering an introduction to Shakespeare?s life and his world, and then studying several of his plays, probably A Midsummer Night?s Dream, Macbeth, Much Ado About Nothing, and Henry V (though those may change depending on what?s on in UK theatres).  Then, we will travel to London over spring break for a hands-on, in-depth whirlwind experience, taking in as much of Shakespeare?s world, both from the early modern period, from what Shakespeare means today, in London and Stratford.  ",
    "prereq": []
  },
  {
    "uid": "825754",
    "code": "ENGL1923",
    "subject": "ENGL",
    "number": "1923",
    "honors": false,
    "writingIntensive": false,
    "name": "Very Short Poems",
    "fullname": "Very Short Poems",
    "info": "Poetry has such a fiercely loyal subculture of readers that in 2017, Amanda Gorman was named the first National Youth Poet Laureate. Very Short Poems will introduce you to an adaptive art form that is ideal for our online world; every poem in the syllabus is found online. Featuring work ranging from Amanda Gorman (1998-) to Thomas Wyatt (1503-1542),  but with a focus on the contemporary as well as the timeless, this seminar will be a literary “lab” class for reading short poems: identifying their effects, understanding how poets achieve those effects, and engaging the ways poets use non-narrative language and space to set a scene, convey an emotion, make an argument, and get us to inhabit a point of view. Class discussions will focus on the poems that most fascinate class members. What bothered or thrilled you? How did the poet make you feel this way with that phrase? Expect to learn why you love some poems and dislike others—a debate all fans of this art form enjoy.",
    "prereq": []
  },
  {
    "uid": "825755",
    "code": "ENGL1924",
    "subject": "ENGL",
    "number": "1924",
    "honors": false,
    "writingIntensive": false,
    "name": "Alternate Histories",
    "fullname": "Reimagining the Past in Literature: Alternate Histories and the Politics of Historical Imagination",
    "info": "Alternate histories have long been a popular subgenre of science fiction. Alternate historical novels are set in the \"real\" world, but imagine the real world to be shaped by different historical outcomes and events. Typically, they are set in a fictional historical timeline prompted by \"what if\" questions: what if Nazi Germany and Japan had won World War II? What if John Brown's raid at Harper's Ferry had succeeded? Authors use alternate historical settings to cast new perspectives on factual history, as well as to make claims about the nature of history, historical memory, historical records, and historical consciousness themselves. While such works tend to be seen as genre fiction, major literary writers like Philip Roth and Michael Chabon have also penned their own alternate histories. In addition, political figures as diverse as Winston Chamberlain and Newt Gingrich have speculated about alternate historical timelines. Not surprisingly, alternate histories tend to bring up questions about historical knowledge itself. Thinkers have long debated this subject, asking questions like: how do we know what we \"know\" about the past? How does the act of constructing non-fictional narratives of the past shape or influence our perception of past events? And what or who makes historical change happen; Great individuals? Ideological conflicts and influential ideas? Economic changes? In this course, we'll read a selection of alternate historical fiction, as well as examine some influential theories of history as an object of study and analysis. We'll ask what kinds of cultural, social, and political values motivate writers to construct hypothetical historical realities. Finally, you will experiment with writing your own alternate historical short fiction or essay, crafting a fictional or non-fictional narrative set in/about an alternate historical timeline, and justifying your own decisions in reimagining the past.",
    "prereq": []
  },
  {
    "uid": "826346",
    "code": "ENGL1925",
    "subject": "ENGL",
    "number": "1925",
    "honors": false,
    "writingIntensive": false,
    "name": "The Stand",
    "fullname": "Stephen King's The Stand",
    "info": "In this seminar we will read Stephen King's long novel The Stand, in which an epidemic wipes out most of the US population and a battle between good and evil follows. As we read, we will pay attention to the novel's themes and techniques, breaking down plotting and characterization, noticing symbol and metaphor, and examining the construction of individual paragraphs and sentences. We'll wrestle with the book's range of references, from myth and religion to mid-twentieth-century American popular culture. We'll choose our favorite characters! Some warnings: The Stand is a horror novel, and its depictions of violence and suffering are graphic. In addition, while we will often admire the author's ability to evoke strong feelings, we may question decisions he makes about what to depict, what lines of thought to pursue, and what kinds of language to use. We will follow King where he takes us, but we'll also imagine alternatives to the nightmare world he so absorbingly and carefully describes.",
    "prereq": []
  },
  {
    "uid": "826347",
    "code": "ENGL1926",
    "subject": "ENGL",
    "number": "1926",
    "honors": false,
    "writingIntensive": false,
    "name": "Dangerous Books",
    "fullname": "Dangerous Books",
    "info": "It's impossible to make it to college without hearing about books you're supposed to read. But what about the books that people want to keep from you? Last year there were reports of 2,532 individual books being banned or challenged in schools and public libraries in this country, even though an estimated 82 to 97% of challenges went unreported. Scores of groups, some with hundreds of local chapters, are devoted to removing books from libraries, classrooms, and bookstores. Police reports have been filed against dozens of local librarians. Politicians have asked school districts to report on long lists of titles and discussed exposing teachers and staff to felony charges if they provide \"inappropriate\" books to students. In this seminar, we'll ask what makes some books so dangerous that people would try this hard to keep them from us. We'll read the most frequently banned and challenged books in the U.S. today, as well as books that were considered unsuitable for adults in the past. We'll look at books that are likely to make you uncomfortable. And we'll examine the very old idea, shared by those most interested in taking books away from us and those most interested in making them more available, that books hold great power. ",
    "prereq": []
  },
  {
    "uid": "794365",
    "code": "ENGL1930",
    "subject": "ENGL",
    "number": "1930",
    "honors": false,
    "writingIntensive": false,
    "name": "General Topics in Literature",
    "fullname": "General Topics in Literature",
    "info": "Topics determined by instructor.",
    "prereq": []
  },
  {
    "uid": "002446",
    "code": "ENGL3001W",
    "subject": "ENGL",
    "number": "3001",
    "honors": false,
    "writingIntensive": true,
    "name": "Textual Analysis: Methods",
    "fullname": "Textual Analysis: Methods",
    "info": "This course is designed for English majors and minors, as well any students interested in and attracted to literature and reading. Our concern will be to develop the intellectual foundations to move past our base, instinctive reactions to literature to deeper modes of reading, interpretation, and written analysis/argument. Our goal will be to develop the skills of slow-motion, skeptical reading: to savor the crafting of literary form and to explore how literary rhetoric engages our intellect and emotions; to read not simply for superficial content, but to engage and question the multi-faceted operation of literary texts. In terms of foundational writing skills for the English major, we will work on the development of compelling written literary arguments by breaking the writing process down into various phases. We will work with the basics of argumentation: developing a strong, coherent thesis, drafting, the logic of argument, revision, proper citation and effective use of primary and secondary sources, and more. prereq: [English major or minor or approved BIS or IDIM program with English area]",
    "prereq": []
  },
  {
    "uid": "003476",
    "code": "ENGL3002",
    "subject": "ENGL",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Lit Criticism & Theory",
    "fullname": "Modern Literary Criticism and Theory",
    "info": "This course is an introduction to contemporary literary criticism and theory. The goal is to provide you with a foundation in theory's terminologies, the different methodologies used in literary and cultural analysis, and a sense of the various schools of criticism that have developed in the postwar period. We will look at the ways that various texts perform as texts; they are not transparent or one dimensional, but rather open themselves to many different readings and styles of engagement. ",
    "prereq": []
  },
  {
    "uid": "002448",
    "code": "ENGL3003W",
    "subject": "ENGL",
    "number": "3003",
    "honors": false,
    "writingIntensive": true,
    "name": "Survey British Literature I",
    "fullname": "Historical Survey of British Literatures I",
    "info": "This course will provide a historical survey of British literature from the Middle Ages to the end of the eighteenth century. Our focus will be on tracing the interactions between literature and wider British culture as well as on tracing the development of literary form during this period. You should leave this course being able to identify major literary trends and authors and link them to corresponding formal techniques and innovations. You should also have a sense of the major historical and political events, rulers, and social conditions in Britain at this time. Additionally, because this is a writing intensive course, you will leave this class familiar with the process of writing a research paper with a literary focus, which includes finding and successfully incorporating contemporary scholarly research about your topic into your paper, crafting an original argument, utilizing textual evidence, and evaluating existing scholarship.",
    "prereq": []
  },
  {
    "uid": "002944",
    "code": "ENGL3004W",
    "subject": "ENGL",
    "number": "3004",
    "honors": false,
    "writingIntensive": true,
    "name": "Survey British Literature II",
    "fullname": "Historical Survey of British Literatures II",
    "info": "In this wide-ranging survey of British and post-colonial literature from the late eighteenth century to the present, we will explore representative literary texts and genres from British Romanticism, the Victorian period, Modernism, and the postwar era. Besides analyzing the language, aesthetic features, and technical construction of these literary artifacts, we will examine our readings as reflections of and reactions to social upheavals like the Industrial Revolution, challenges to the traditional role of women, scientific discoveries that sparked religious doubt, and the First World War. Additionally, because this is a writing intensive course, you will familiarize yourself with the process of writing a research paper with a literary focus, which includes finding and successfully incorporating contemporary scholarly research about your topic into your paper, crafting an original argument, utilizing textual evidence, and evaluating existing scholarship.",
    "prereq": []
  },
  {
    "uid": "004180",
    "code": "ENGL3005W",
    "subject": "ENGL",
    "number": "3005",
    "honors": false,
    "writingIntensive": true,
    "name": "Survey American Literature I",
    "fullname": "Survey of American Literatures and Cultures I",
    "info": "This writing-intensive course will survey the Anglophone literature of what would become the United States from the arrival of English settlers to the Civil War. We will define \"literature\" broadly to not only include fiction and poetry but also the sermon, the letter, the essay, the autobiography, and other non-fictional forms. Course topics will include the Puritan theology that cast such a long shadow over the American cultural imagination; the fraught literary construction in the Revolutionary era of a national identity under the influence of such Enlightenment ideals as reason, civility, cosmopolitanism, and sympathy; the Gothic doubts about democracy that attended the literature of the early republic; the rise in the mid-nineteenth century of a radical intellectual and social movement in Transcendentalism; the antebellum ideological struggles over such political issues as slavery, industrialism, women's rights, and Native American rights; and the self-conscious cultivation of a national literary aesthetic in the Romantic prose and poetry of the period later critics would come (controversially) to call \"the American Renaissance.\"",
    "prereq": []
  },
  {
    "uid": "004190",
    "code": "ENGL3006W",
    "subject": "ENGL",
    "number": "3006",
    "honors": false,
    "writingIntensive": true,
    "name": "Survey American Literature II",
    "fullname": "Survey of American Literatures and Cultures II",
    "info": "This course will survey some of the major literary figures, aesthetic movements, and thematic concerns of US literature from the Civil War to the present. Our investigation will identify common traits in the literature that causes it to fit within three very broad literary historical categories: realism, modernism, and postmodernism. We will explore what makes literature created by the people of the United States distinctly \"American\" during a period that extends from the Civil War and the outlawing of slavery to women's suffrage, workers' movements, the Great Depression, the First and Second World Wars, and the civil rights movement. In addition to reading and analyzing the literature itself in terms of style, form, genre, and language, we will study it in historical context: the complex interplay between the political, the social, the cultural, and the literary in the United States. This approach rests upon the notion that literature is not created in a vacuum; it is influenced by and influences the world in which it is created.",
    "prereq": []
  },
  {
    "uid": "002922",
    "code": "ENGL3007",
    "subject": "ENGL",
    "number": "3007",
    "honors": false,
    "writingIntensive": false,
    "name": "Shakespeare",
    "fullname": "Shakespeare",
    "info": "For over four hundred years, William Shakespeare has remained the most quoted poet and the most regularly produced playwright in the world. From Nelson Mandela to Toni Morrison, from South African playwright Welcome Msomi to Kuwaiti playwright Sulayman Al-Bassam, Shakespeare's works have continued to influence and inspire authors and audiences everywhere. This course examines representative works of Shakespeare from a variety of critical perspectives, as cultural artifacts of their day, but also as texts that have had a long and enduring vitality. This is a required course for English majors and minors, but it should also interest any student who wants to understand why and how Shakespeare continues to be one of the most important literary figures in the English language.\n\nEnglish majors/minors must take this course A-F only grading basis.",
    "prereq": []
  },
  {
    "uid": "804908",
    "code": "ENGL3008",
    "subject": "ENGL",
    "number": "3008",
    "honors": false,
    "writingIntensive": false,
    "name": "In and Out of the Archives",
    "fullname": "Research in English: In and Out of the Archives",
    "info": "Social/textual relationships. How to craft revealing questions and assess information. Modes of inquiry. Collections/communities. Written assignments, discussion. Archival materials in print, oral, digital, and visual forms.",
    "prereq": []
  },
  {
    "uid": "003711",
    "code": "ENGL3010",
    "subject": "ENGL",
    "number": "3010",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies in Poetry",
    "fullname": "Studies In Poetry",
    "info": "Special topics related to reading poetry in various interpretive contexts.",
    "prereq": []
  },
  {
    "uid": "803599",
    "code": "ENGL3011",
    "subject": "ENGL",
    "number": "3011",
    "honors": false,
    "writingIntensive": false,
    "name": "Jewish American Literature",
    "fullname": "Jewish American Literature: Religion, Culture, and the Immigrant Experience",
    "info": "Immigrant? Jewish? American?  What do these labels mean, why are they applied, and do they ever cease to be applicable? Can we distinguish religion from culture, and what are the implications when we try? Why is it frequently asked whether Saul Bellow was \"really\" a Jewish writer, but it is impossible to read Philip Roth as anything other than that? How does Grace Paley's \"Jewishness\" come through even when she is writing about non-Jewish characters? We will address these issues and others as we explore the literature growing out of the Jewish immigrant experience in America, as well as the literature by Jewish writers more firmly, though still sometimes anxiously, rooted in American soil. In this course we will engage in a highly contextualized and historicized study of Jewish American literature from the 19th century to today.  We will discover in these texts how inherited Jewish culture and literary imaginings, developed over centuries of interaction between Jewish communities and the \"outside world,\" get reexamined, questioned, rejected, reimagined, reintegrated, and transformed within the crucible of American experience. The discussions that ensue will also provide a framework for engaging with the creative energies and cultural productivity of more recent immigrant communities in the United States and beyond. Immigration and the experience of immigrant communities continues to be at the forefront of American consciousness, as immigrants work to create new meanings and new narratives for their lives, and as those who immigrated before them provide contested meanings for the impact of immigration on their own narratives. This course, though grounded in Jewish narratives, will therefore provide students with an expanded vocabulary and perspective for engaging in this central and very current debate within the American experience. ",
    "prereq": []
  },
  {
    "uid": "807743",
    "code": "ENGL3012",
    "subject": "ENGL",
    "number": "3012",
    "honors": false,
    "writingIntensive": false,
    "name": "Poetry as Cultural Critique",
    "fullname": "Poetry as Cultural Critique",
    "info": "Examines the status of \"poetry\" in several cultures of the Americas bringing together techniques of close reading and broad cultural inquiry.",
    "prereq": []
  },
  {
    "uid": "809727",
    "code": "ENGL3013",
    "subject": "ENGL",
    "number": "3013",
    "honors": false,
    "writingIntensive": false,
    "name": "The City in Literature",
    "fullname": "The City in Literature",
    "info": "City life has always inspired great writing, and The City in Literature provides students with an opportunity to read and respond to a selection of works that are, in one way or another, about cities. The primary emphasis of the course is on texts written in English during the 19th, 20th, and 21st centuries, but some writing in translation and from other periods may also be assigned. Possible authors include but are not limited to the following: Guillaume Apollinaire, Charles Baudelaire, Kamau Brathwaite, Gwendolyn Brooks, Sterling Brown, Anna Burns, Charles Dickens, T.S. Eliot, Elena Ferrante, Allen Ginsberg, James Joyce, Juvenal, Federico Garcia Lorca, Amy Levy, Mina Loy, Claude McKay, Frank O’Hara, Derek Walcott, Walt Whitman, Patricia Williams, Virginia Woolf, William Wordsworth, William Butler Yeats. ",
    "prereq": []
  },
  {
    "uid": "003712",
    "code": "ENGL3020",
    "subject": "ENGL",
    "number": "3020",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies in Narrative",
    "fullname": "Studies in Narrative",
    "info": "Examine issues related to reading and understanding narrative in a variety of interpretive contexts. Topics may include \"The 19th-century English (American, Anglophone) Novel,\" \"Introduction to Narrative,\" or \"Techniques of the Novel.\" Topics specified in the Class Schedule",
    "prereq": []
  },
  {
    "uid": "802148",
    "code": "ENGL3021",
    "subject": "ENGL",
    "number": "3021",
    "honors": false,
    "writingIntensive": false,
    "name": "Captivity in Lit and Film",
    "fullname": "Captivity in Literature and Film: From the Barbary Coast to Guantanamo Bay",
    "info": "Whether there is a captivity genre in English/Global literature, from early modern period to 21st century. Texts/films from numerous civilizations/histories.",
    "prereq": []
  },
  {
    "uid": "807953",
    "code": "ENGL3022",
    "subject": "ENGL",
    "number": "3022",
    "honors": false,
    "writingIntensive": false,
    "name": "Science Fiction and Fantasy",
    "fullname": "Science Fiction and Fantasy",
    "info": "Science Fiction and Fantasy will introduce students to the study of classic and contemporary science fiction and fantasy literature. Using literary techniques, students will explore the alternate realities, characters, cultures, genders, races, ecologies, politics, settings, and technologies of science fiction and fantasy primarily through reading novels and stories. Questions may include: What does speculation about the future tell us about our present and past? What does the unreal reveal about our real lives? To what extent does science fiction function as both escapist fantasy and prophetic reality?",
    "prereq": []
  },
  {
    "uid": "807954",
    "code": "ENGL3023",
    "subject": "ENGL",
    "number": "3023",
    "honors": false,
    "writingIntensive": false,
    "name": "Children's Literature",
    "fullname": "Children's Literature",
    "info": "This course provides an overview of the traditions of children's and young adult literature. The course will address the following questions among others: What is \\\"children's literature\\\"? What are some of its persistent themes and stylistic traits? In what ways may we say it has changed over time? What distinguishes children's literature, from, say, \\\"grown-up\\\" literature? Our readings will include classic and contemporary works with a focus on diversity regarding the authors, themes, and readership. In addition to becoming familiar with this body of knowledge, we will be developing critical reading skills within a \\\"literary\\\" context. We will also look into how, when, and where literature (specifically children's and young adult literature) and our everyday lives intersect, impact, and interact with each other. ",
    "prereq": []
  },
  {
    "uid": "807955",
    "code": "ENGL3024",
    "subject": "ENGL",
    "number": "3024",
    "honors": false,
    "writingIntensive": false,
    "name": "The Graphic Novel",
    "fullname": "The Graphic Novel",
    "info": "This course aims to read and study a specific kind of narrative we call \"graphic novel.\"  The term itself is often a point of contention, but the purpose of this course is not to defend the validity of the term or the medium.  \"Comic books\" and \"graphic novels\" are not endangered animals. Rather, we will use this example of \"sequential art\" to think through the ways this genre intersects, uses, and informs various other narrative and artistic forms as well as the way the genre may be unique with its own way of producing meaning. Comics involve a hybrid strategy of image and text, so we will attempt to keep both aspects in mind throughout the semester, never forgetting that comics are neither purely \"visual\" nor purely \"textual.\" Since comics are often wedded-in mainstream culture-with certain kinds of content (e.g. superheroes), we will also investigate the characteristics of different \"genres\" within comics, as well as various questions about literariness.",
    "prereq": []
  },
  {
    "uid": "811162",
    "code": "ENGL3025",
    "subject": "ENGL",
    "number": "3025",
    "honors": false,
    "writingIntensive": false,
    "name": "The End of the World",
    "fullname": "The End of the World in Literature and History",
    "info": "For at least two and a half millennia, prophets, politicians, and poets have crafted terrifying accounts about the end of the world. This comparatist seminar examines the way different cultures have imagined a final apocalypse with particular attention to the political and social consequences of their visions. Students will read texts that focus on pandemic, extraterrestrial attack, nuclear holocaust, prophecy, cybernetic revolt, divine judgment, resource depletion, meteoric impact, or one of the many other ways in which humans write of their demise. They will use literary analysis to explore the many historical and contemporary wastelands they will encounter. They will write short papers and give in-class presentations on different kinds of apocalypse.",
    "prereq": []
  },
  {
    "uid": "813637",
    "code": "ENGL3026",
    "subject": "ENGL",
    "number": "3026",
    "honors": false,
    "writingIntensive": false,
    "name": "Mediterranean Wanderings",
    "fullname": "Mediterranean Wanderings: Literature and History on the Borders of Three Continents",
    "info": "Situated between three continents and at the intersection of numerous ethnic and national cultures, the Mediterranean is like no other place on earth. A place of diverse languages, religions, economies, governments, and ways of daily life, it serves as a microcosm for the world itself imagined as an integrated global system. This course explores the history of the Mediterranean with particular emphasis on the literatures it has produced over the last three millennia. As the protagonists of these epic poems, religious texts, and novels travel from one shore to another, they experience the Mediterranean as a place of violence, cultural accommodation, hope, ethnic and linguistic bewilderment, and endless moral challenge. This course will place as much emphasis on the region's history as its cultural productions. With that in mind, reading may include David Abulafia's The Great Sea in addition to The Odyssey, The Aeneid, the biblical books of Joshua and Acts, Tasso's Gerusalemme Liberata (an epic set during the first crusade), Shakespeare's The Merchant of Venice and Antony and Cleopatra, Flaubert's Salammbo, Akli Tadjer's Les ANI du Tassali, A.b. Yehoshua's Mr. Mani, and Pamuk's The White Castle.",
    "prereq": []
  },
  {
    "uid": "800454",
    "code": "ENGL3027W",
    "subject": "ENGL",
    "number": "3027",
    "honors": false,
    "writingIntensive": true,
    "name": "The Essay",
    "fullname": "The Essay",
    "info": "This is a course for students ready to face more challenging assignments and deepen their comfort and skill with writing. The instructor helps the student develop more sophisticated research strategies and experiment with more creative stylistic choices. Assignments might include autobiographies, critical comparisons, reviews of articles or books, cultural analyses, persuasive essays, and annotated bibliographies. Students in this course learn to 1) generate topics and develop essays with greater independence than they exercised in freshman composition, 2) write for multiple audiences—academic and non-academic—making appropriate decisions about content, rhetoric, structure, vocabulary, style, and format, 3) write creative non-fiction and other genres incorporating complex description and analysis, 4) analyze the conventions and styles of writing in their major field, and 5) experiment with new and more sophisticated writing strategies and styles.",
    "prereq": []
  },
  {
    "uid": "817154",
    "code": "ENGL3028",
    "subject": "ENGL",
    "number": "3028",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Amer Spy Novels",
    "fullname": "Paranoia and Pleasure: Contemporary American Spy Novels",
    "info": "Spy fiction emerged in Britain and the United States during the early 20th century.  Since then, it proliferated thematic sub-genres such as Tom Clancy’s techno-thrillers, Vince Flynn’s CIA-trained assassin, James Rollins’ science disaster group, David Baldacci’s eccentric Camel Club, and Daniel Silva’s globe-trotting Israeli spy Gabriel Allon.  Spy Fi is concerned with threats to the state--Nazis, Russians, rogue states, terrorist masterminds, and moles here at home.  In contrast to British Spy Fi, famously represented by James Bond, the MI6 agent who plied his trade in sophisticated or exotic settings, American novels tend to feature cowboy protagonists with military or sports backgrounds and a penchant for spectacular violence.  In this course, we will read novels and analyze the development of sub-genres, protagonists, plots, settings, and language; the shifting roles of female characters; the paranoiac ideologies that hover beneath the narratives or pop to the surface; and the target audiences and sales.",
    "prereq": []
  },
  {
    "uid": "800460",
    "code": "ENGL3029W",
    "subject": "ENGL",
    "number": "3029",
    "honors": false,
    "writingIntensive": true,
    "name": "Professional Writing",
    "fullname": "Professional Writing",
    "info": "How to write for various professional purposes/audiences, using differing styles, tones, and organizational elements. Potential genres include grant proposals, feasibility studies, job search portfolios, progress reports, annotated bibliographies. Broader issues of professional literacy.",
    "prereq": []
  },
  {
    "uid": "004207",
    "code": "ENGL3030",
    "subject": "ENGL",
    "number": "3030",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies in Drama",
    "fullname": "Studies in Drama",
    "info": "Topics may include English Renaissance tragedy, EnglishRestoration and 18th century, or American drama by writers of color. Single-author courses focus on writers such as Tennessee Williams and Eugene O'Neill, or issues/themes such as gender/performance.",
    "prereq": []
  },
  {
    "uid": "808898",
    "code": "ENGL3031",
    "subject": "ENGL",
    "number": "3031",
    "honors": false,
    "writingIntensive": false,
    "name": "Shakespeare and After",
    "fullname": "Shakespeare and After",
    "info": "Shakespeare plays from Shakespearian origins through later manifestations. How/why Shakespeare's characters/plots/plays have been transformed by later generations. Novels, films, skits, burlesques. Reworkings of Shakespeare's life/his role in contemporary culture.",
    "prereq": []
  },
  {
    "uid": "803620",
    "code": "ENGL3032",
    "subject": "ENGL",
    "number": "3032",
    "honors": false,
    "writingIntensive": false,
    "name": "Shakespeare in London",
    "fullname": "Shakespeare in London",
    "info": "How are different interpretations of Shakespeare’s works embodied in the theater? How are they transformed by location/context? Students attend/discuss theatrical productions.",
    "prereq": []
  },
  {
    "uid": "004253",
    "code": "ENGL3040",
    "subject": "ENGL",
    "number": "3040",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies in Film",
    "fullname": "Studies in Film",
    "info": "Topics regarding film in variety of interpretive contexts, from range/historic development of American, English, Anglophone film.",
    "prereq": []
  },
  {
    "uid": "808924",
    "code": "ENGL3041",
    "subject": "ENGL",
    "number": "3041",
    "honors": false,
    "writingIntensive": false,
    "name": "Killer Women: Film Noir",
    "fullname": "Killer Women: Film Noir, Its Origins and Legacies",
    "info": "1940s/1950s violence. Domestic, erotic, pervasive.  Literary/cinematic antecedents/successors of femme fatale.",
    "prereq": []
  },
  {
    "uid": "808925",
    "code": "ENGL3042",
    "subject": "ENGL",
    "number": "3042",
    "honors": false,
    "writingIntensive": false,
    "name": "The Western: Looking Awry",
    "fullname": "The Western: Looking Awry",
    "info": "Western as iconic American art form. Gender, desire, race, nation as problematic constructions. Western as evolving genre that produces/undercuts its own fictions, icons, aesthetics, politics.",
    "prereq": []
  },
  {
    "uid": "808926",
    "code": "ENGL3043",
    "subject": "ENGL",
    "number": "3043",
    "honors": false,
    "writingIntensive": false,
    "name": "Hollywood",
    "fullname": "Hollywood",
    "info": "Hollywood as material/discursive site. Spectacle, fantasy, oppression, failure. Literary/cinematic/theoretical interpretations of Hollywood from 1909-1960. Relevant writings of period/current theorists. Novelists/philosophers. Popular/avant-garde films.",
    "prereq": []
  },
  {
    "uid": "808899",
    "code": "ENGL3045",
    "subject": "ENGL",
    "number": "3045",
    "honors": false,
    "writingIntensive": false,
    "name": "Cinematic Seductions",
    "fullname": "Cinematic Seductions: Sex, Gender, Desire",
    "info": "Gender/sexuality in cinema. Sexuality/identity. Historical contexts of films. Theoretical debates regarding gender/sexuality.",
    "prereq": []
  },
  {
    "uid": "803864",
    "code": "ENGL3046",
    "subject": "ENGL",
    "number": "3046",
    "honors": false,
    "writingIntensive": false,
    "name": "Black and White",
    "fullname": "Black and White",
    "info": "Photography, cinema, print. Documentary, fantasy, film noir: how they have infected our aesthetic imagination. Social themes. Racial divisions marking American/global systems.",
    "prereq": []
  },
  {
    "uid": "004256",
    "code": "ENGL3060",
    "subject": "ENGL",
    "number": "3060",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies in Lit & Other Arts",
    "fullname": "Studies in Literature and the Other Arts",
    "info": "Examine literature's role in conjunction with other arts, including music, visual arts, dance, etc. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "811444",
    "code": "ENGL3061",
    "subject": "ENGL",
    "number": "3061",
    "honors": false,
    "writingIntensive": false,
    "name": "Literature and Music",
    "fullname": "Literature and Music",
    "info": "In this course, we will explore the connections and parallels between music and literature, assessing both form and content and drawing upon various genres from both arts. We will examine some of the ways that musical and literary texts can change, subvert, or augment each other by applying critical and literary theories to intertextual readings. Among the subjects we may discuss are how authors use music in their work, both structurally and topically; how musicians use literature, both as lyric and as subject matter; and how members of each group engage the artistic assumptions of the other.  Students will gain a greater appreciation of the varied forms of creative expression and an increased understanding of how they influence each other through close reading and listening, discussions, reflective writing, and presentations. ",
    "prereq": []
  },
  {
    "uid": "004257",
    "code": "ENGL3070",
    "subject": "ENGL",
    "number": "3070",
    "honors": false,
    "writingIntensive": false,
    "name": "Literary and Cultural Modes",
    "fullname": "Studies in Literary and Cultural Modes",
    "info": "Modes of literary expression/representation that transcend conventional demarcations of genre and historical periods. Topics may include horror, romance, mystery, comedy, and satire.",
    "prereq": []
  },
  {
    "uid": "808544",
    "code": "ENGL3071",
    "subject": "ENGL",
    "number": "3071",
    "honors": false,
    "writingIntensive": false,
    "name": "American Food Revolution",
    "fullname": "The American Food Revolution in Literature and Television",
    "info": "America's relationship with food and eating has changed profoundly over the last fifty years. At the heart of this revolution was a group of charismatic personalities who through writing and television brought first European and then global sensibilities to the American table. They persuaded Americans that food and cooking were not just about nutrition but also forms of pleasure, entertainment, and art; ways of exploring other cultures; and means of declaring, discovering, or creating identity. Their work would eventually transform the American landscape, helping give rise to the organic movement, farmers markets, locavorism, and American cuisine, as well as celebrity chefs, the Food Network, and restaurant reality television. In the meantime, the environmental movement was sending its own shockwaves through American consciousness of food production and consumption. The joining together of these movements--culinary and environmental--has brought a new ethical dimension to the subject that is now at the forefront of current concerns about American food. Insofar as we eat, we necessarily make choices that have profound implications for our health, our communities, the environment, and those who work in the food industry, broadly defined. This class will trace the American food revolution with the intent of understanding how our current system came to be and thinking through the ethical implications of our daily actions. We will read classic literature from the rise of the movement, in varying degrees instructional, personal and documentary, while viewing some seminal television moments for the food culture we now know. We will give particular attention to recent work that focuses on the personal and environmental ethics of food.",
    "prereq": []
  },
  {
    "uid": "820342",
    "code": "ENGL3072",
    "subject": "ENGL",
    "number": "3072",
    "honors": false,
    "writingIntensive": false,
    "name": "Witchcraft, Possession, Magic",
    "fullname": "Witchcraft, Possession, Magic: Concepts in the Atlantic Supernatural, 1500-1800",
    "info": "Salem is what typically comes to mind when we think of witchcraft, and our class will indeed focus on the 1692 trials and their aftermath. But we will also range more broadly, exploring witchcraft in the early Atlantic world by paying special attention to the roles played by magic and possession. A fundamental aspect of this course, moreover, is its distinction as a literary one. This is not a class about how witchcraft, possession, and magic “change over time” but a class about their representations. From the beginning, we will be deeply attentive to the fact that each and every “evidence” of witchcraft, possession, or magic is an act of representation in the first place. As literary historians, we will movefrom Europe to the Americas, looking at how invocations and accusations of witchcraft traveled between the 16th and late-18th centuries. More importantly, as literary critics we will trace and examine depictions of witchcraft and the idea of the witch across four interrelated socio-historical contexts: the Protestant Reformation in 16th-century Europe; slave medicine and obeah in the Caribbean; possession and the “invisible world” in Puritan Massachusetts; and revivalism in 18th-century New England. By the end of this course, you will be able to: interpret literary texts and understand the literary aspects of historical documents; place literature in relation to its historical and cultural contexts; locate and evaluate relevant scholarship and cultural commentary; and formulate and communicate a focused and stylistically appropriate that supports its claims with textual evidence, especially through close and critical reading.",
    "prereq": []
  },
  {
    "uid": "793899",
    "code": "ENGL3090",
    "subject": "ENGL",
    "number": "3090",
    "honors": false,
    "writingIntensive": false,
    "name": "General Topics",
    "fullname": "General Topics",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "814462",
    "code": "ENGL3091",
    "subject": "ENGL",
    "number": "3091",
    "honors": false,
    "writingIntensive": false,
    "name": "Literature & Film of Baseball",
    "fullname": "The Literature and Film of Baseball",
    "info": "Baseball is the national pastime, often evoked with Mom and apple pie in a trinity of American-ness. How do Americans represent something they see as so quintessentially themselves? In this class, we will look at the variety and complexity of answers given to that question, from sunny nostalgia, to valorization of the individual, valorization of the team, depictions of the dark side of the American dream, critiques of racial relations, and an approach that strives to eliminate both the poetry and the hand-wringing with a long hard look at numbers and facts. In this journey, we will study and participate in a number of ways that literature teaches us to understand society and ourselves. We will examine the idea of American pastoral and anti-pastoral. We will use the great variety of ways to write about baseball as a platform to consider how we come to know and believe. Throughout the course, we will examine the way baseball writing treats race and gender. We will also look at excerpts of films made from some of the texts. Comparing the films to the literature allows us to discuss what representations of America seem more palatable to producers aiming for a larger audience than literature usually reaches and to highlight ways writing makes arguments that films cannot.",
    "prereq": []
  },
  {
    "uid": "817019",
    "code": "ENGL3092",
    "subject": "ENGL",
    "number": "3092",
    "honors": false,
    "writingIntensive": false,
    "name": "Misbehaving Dead Bodies - 19C",
    "fullname": "The Original Walking Dead: Misbehaving Dead Bodies in the 19th Century",
    "info": "Examination and analysis of 19th-century British literature about dead bodies, the science of death, burial practices and anxieties, and theories of the supernatural. This course includes fiction and poetry but also non-fiction, historical documents, and sensationalist media.",
    "prereq": []
  },
  {
    "uid": "819093",
    "code": "ENGL3093",
    "subject": "ENGL",
    "number": "3093",
    "honors": false,
    "writingIntensive": false,
    "name": "Law and Literature",
    "fullname": "Law and Literature",
    "info": "ENGL 3093 Law & Literature examines how law and literature render diversity and social justice.  The law is generally defined as a country’s (or community’s) system of rules that regulate people’s actions and administer justice to them.  Literature is generally defined as an assortment of oral and written texts regarded as having intellectual, aesthetic, and moral value.  This course puts legal and literary texts into conversation to answer questions about how they render the equality of and the justice for diverse peoples.  ",
    "prereq": []
  },
  {
    "uid": "793819",
    "code": "ENGL3101",
    "subject": "ENGL",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Knights and Pilgrims",
    "fullname": "Knights and Pilgrims in Medieval Literature",
    "info": "Medieval writers and readers were fascinated by stories about knights and about pilgrims.  In this course, we study some of the best-known and most compelling narratives and poems from the Middle Ages.  Although written hundreds of years ago, these literary works speak to us of the human desire to strive for meaning and excellence, to work toward shared ideas of community, and to explore worlds beyond the sometimes narrow confines of home.Knights and pilgrims appear as central figures in a wide range of literary works.  Some of the texts are humorous, like Chaucer's Canterbury Tales in which pilgrims, from social classes ranging from knights to tradespeople, travel together and tell stories.  Some are exciting and emotional, like Malory's retelling of stories about King Arthur and his knights.  Others provide us with explorations of longing for change:  in these works people search for new kinds of social and spiritual life such as Margery Kempe's autobiographical account of her experiences as a pilgrim to Rome and the Holy Land.  Still others, such as Langland's Piers Plowman, which incorporates pilgrimage and chivalric quest, critique and explode static ideas about social problems such as poverty and hunger.  Some draw our attention to the dangers and turmoil involved in love and relationships, such as Marie de France's courtly, aristocratic lays:  Marie's knights and ladies take up the search for love and meaning.  Some, finally, invite us to imagine ourselves in mysterious otherworlds, such as Mandeville's Travels and Sir Orfeo, both of which focus on travel and self knowledge.  These exciting and challenging works continue to speak to us about the quest to pursue ideals and to change the world and ourselves.",
    "prereq": []
  },
  {
    "uid": "794366",
    "code": "ENGL3102",
    "subject": "ENGL",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Chaucer",
    "fullname": "Chaucer",
    "info": "Major/representative works written by Chaucer, including The Canterbury Tales, Troilus and Criseyde, and the dream visions. Historical, intellectual, and cultural background of the poems. Language, poetic theory, form.",
    "prereq": []
  },
  {
    "uid": "003678",
    "code": "ENGL3110",
    "subject": "ENGL",
    "number": "3110",
    "honors": false,
    "writingIntensive": false,
    "name": "Med Lit & Cltr",
    "fullname": "Medieval Literatures and Cultures: Intro to Medieval Studies",
    "info": "Major and representative works of the Middle Ages. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "016144",
    "code": "ENGL3111",
    "subject": "ENGL",
    "number": "3111",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey Engl Lit I Trans",
    "fullname": "Survey of English Literature I, Transition",
    "info": "Historical survey of major figures, movements, and trends in English literature. Chaucer to Marvell, including Spenser, Shakespeare, and Donne.",
    "prereq": []
  },
  {
    "uid": "016139",
    "code": "ENGL3112",
    "subject": "ENGL",
    "number": "3112",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey Engl Lit II Trans",
    "fullname": "Survey of English Literature II, Transition",
    "info": "Historical survey of major figures, movements, and trends in English literature. Milton to Johnson, including Dryden, Swift, andPope.",
    "prereq": []
  },
  {
    "uid": "016141",
    "code": "ENGL3113",
    "subject": "ENGL",
    "number": "3113",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey Engl Lit III Trans",
    "fullname": "Survey of English Literature III, Transition",
    "info": "Historical survey of major figures, movements, and trends in English literature. Blake to Yeats, including Wordsworth, Coleridge, Keats,Tennyson, and the Brownings. ",
    "prereq": []
  },
  {
    "uid": "816059",
    "code": "ENGL3114",
    "subject": "ENGL",
    "number": "3114",
    "honors": false,
    "writingIntensive": false,
    "name": "Dreams and Dream Visions",
    "fullname": "Dreams and Dream Visions",
    "info": "Introduction to the literary genre known as the medieval English \"dream vision\" and to the historical and theoretical discussion of dreams. We concentrate on four late medieval dream visions: Langland's Piers Plowman; Chaucer's Book of Duchess and House of Fame; and the Gawain-Poet's Pearl.",
    "prereq": []
  },
  {
    "uid": "793820",
    "code": "ENGL3115",
    "subject": "ENGL",
    "number": "3115",
    "honors": false,
    "writingIntensive": false,
    "name": "Medieval and Renaissance Drama",
    "fullname": "Medieval and Renaissance Drama",
    "info": "Medieval/Renaissance drama in terms of performance. Performance history, enactments of scenes from cycle/morality plays, informal production of a morality play.",
    "prereq": []
  },
  {
    "uid": "813523",
    "code": "ENGL3116",
    "subject": "ENGL",
    "number": "3116",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Modern Drama",
    "fullname": "Early Modern Drama",
    "info": "Reading of selected British plays ranging from the Reformation to the French Revolution. Plays show the evolution of English society and reflect changing social mores from the era of Shakespeare and Jonson to the rise of the bourgeoisie. ",
    "prereq": []
  },
  {
    "uid": "005086",
    "code": "ENGL3122",
    "subject": "ENGL",
    "number": "3122",
    "honors": false,
    "writingIntensive": false,
    "name": "Shakespeare II: Major Themes",
    "fullname": "Shakespeare II: The Major Themes",
    "info": "Shakespeare's intellectual community, its language/values.  In-class readings from at least six plays. Quizzes on dramatic speeches. Written assignments.prereq: 3007 or instr consent",
    "prereq": {
      "code": "ENGL 3007",
      "subject": "ENGL",
      "id": "3007"
    }
  },
  {
    "uid": "003679",
    "code": "ENGL3132",
    "subject": "ENGL",
    "number": "3132",
    "honors": false,
    "writingIntensive": false,
    "name": "Between Heaven and Hell",
    "fullname": "Between Heaven and Hell: The King James Bible as Literature",
    "info": "This course examines the lives and stories of heroic figures in the Bible. We approach the Bible as a literary work and explore themes, characters, symbolism, and narrative techniques.  Our text, the King James version of the Bible, is the most important translation in terms of American and English literary traditions.  Our emphasis in the course is on the Biblical heroes who are represented as living their lives in this world (the world between heaven and hell).  ",
    "prereq": []
  },
  {
    "uid": "003680",
    "code": "ENGL3133",
    "subject": "ENGL",
    "number": "3133",
    "honors": false,
    "writingIntensive": false,
    "name": "Stuart England",
    "fullname": "Stuart England: 17th-Century Literature and Culture",
    "info": "Major/representative works of the Restoration and 18th century (1660-1798). Typical authors: Dryden, Pope, Swift, Johnson, Boswell, Fielding.",
    "prereq": []
  },
  {
    "uid": "794367",
    "code": "ENGL3134",
    "subject": "ENGL",
    "number": "3134",
    "honors": false,
    "writingIntensive": false,
    "name": "Milton and Rebellion",
    "fullname": "Milton and Rebellion",
    "info": "Milton’s three great Restoration poems—Paradise Lost, Paradise Regained, and Samson Agonistes—are the focus of this course. We’ll approach them by tracing Milton’s growth as poet: first, by familiarizing ourselves with the religious and social ideas found in his writings down to the Poems of 1645; and second, by studying the political ideas Milton initially set forth in The Tenure of Kings and Magistrates (1649). Concurrently with our study of these earlier works, you’ll be reading Paradise Lost, which you should complete by the end of the spring break. At that point, you’ll be in a position to interpret Milton’s three Restoration masterpieces in the light of his grand—and rebellious—aim of reforming England’s civil and religious community, an aim Milton boldly reaffirms in 1660 in defiance of the Restoration of monarchy.",
    "prereq": []
  },
  {
    "uid": "793821",
    "code": "ENGL3141",
    "subject": "ENGL",
    "number": "3141",
    "honors": false,
    "writingIntensive": false,
    "name": "Restoration & 18th Century",
    "fullname": "The Restoration and the Eighteenth Century: Sex, Satire, and Sentiment",
    "info": "This course will introduce you to some of the best literature of the Restoration and eighteenth century in England. Think of this course as a challenge: how can you, as someone who will spend most of your life in the 21st century, learn to appreciate and learn from literature written in far different times and places? A lot depends on your willingness to empathize with ways of thinking and being that are quite different from your own and your comfort with believing that other ages were just as complicated and as interesting as the one you live in. Typical authors include Dryden, Behn, Swift, Pope, Fielding, and Burney.",
    "prereq": []
  },
  {
    "uid": "003681",
    "code": "ENGL3151",
    "subject": "ENGL",
    "number": "3151",
    "honors": false,
    "writingIntensive": false,
    "name": "Romantic Literature",
    "fullname": "British Romantic Literature and Culture",
    "info": "In British Romantic Literature and Culture, students read poetry and prose written during the Romantic Period (1780-1832). Romantic authors permanently changed the way literature treats numerous subjects: nature, the imagination, revolution, war and politics, the role of the poet, the depiction of common life and language, and the representation of personal experience, to name a few. This was a period of great stylistic innovation, as authors experimented with the use of symbolism and the adaptation of classical mythology and explored medieval/gothic images and themes. Possible authors to be studied in this course include Jane Austen, Anna Letitia Barbauld, William Blake, Lord Byron, Samuel Taylor Coleridge, Felicia Hemans, John Keats, Mary Shelley, Percy Shelley, Charlotte Smith, Mary Wollstonecraft, William Wordsworth.",
    "prereq": []
  },
  {
    "uid": "003683",
    "code": "ENGL3161",
    "subject": "ENGL",
    "number": "3161",
    "honors": false,
    "writingIntensive": false,
    "name": "Victorian Lit & Culture",
    "fullname": "Victorian Literatures and Cultures",
    "info": "Why is the twenty-first century so obsessed with the nineteenth?  From steampunk to political rhetoric, from movies to sex, writers and artists look back to the Victorian era for inspiration and challenge.  One reason might be that Britain was the first country to experience the full effects of industrialized capitalism, with the opportunities and misery that it created.  It also developed one of the largest empires in history, an empire whose legacy continues to shape global politics in good and bad ways.  For all these reasons, understanding the Victorians is key to understanding ourselves.Women writers like Charlotte Bronte and George Eliot have always been at the center of Victorian studies, so the history and politics of gender are vital to Victorian literature.  Class likewise remains inescapable in Victorian fiction with its sharp sense of a world divided into haves and have nots; depictions of the catastrophic effects of the factory system on the urban poor pervade Victorian literature and challenge readers to ponder how, and if, reading might lead to political action.  Race has increasingly reshaped understandings of the literature of the period; although Britain abolished slavery in 1833-34, the period saw both a heightening of racist rhetoric and representation and the growth of a market for works by writers of color from the colonies, including Mary Seacole, J. J. Thomas, and Toru Dutt.  Digital tools have made the present moment an exciting one in which to study this literature because so much information is now available:  Victorian writing has become hyperaccessible for those with access to computers.  For this class, this accessibility means that students have the opportunity not just to learn exiting knowledge about the period but to discover new truths about it for themselves.  This course aims to empower students to find their own paths to understanding and representing the Victorians as a way of revising how they see their present.",
    "prereq": []
  },
  {
    "uid": "003687",
    "code": "ENGL3171",
    "subject": "ENGL",
    "number": "3171",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern British Lit & Cultures",
    "fullname": "Modern British Literatures and Cultures",
    "info": "Survey of principal writers, intellectual currents, conventions, genres, and themes in Britain from 1950 to the present. Typically included are Beckett, Golding, Kingsley and Martin Amis, Murdoch, Larkin, Hughes, Heaney, Lessing, Shaffer, Stoppard, Fowles, and Drabble.",
    "prereq": []
  },
  {
    "uid": "797284",
    "code": "ENGL3175",
    "subject": "ENGL",
    "number": "3175",
    "honors": false,
    "writingIntensive": false,
    "name": "20th-Cen British Lit & Cult I",
    "fullname": "20th-Century British Literatures and Cultures I",
    "info": "Survey of principal writers, intellectual currents, conventions, and genres/themes in Britain/Ireland, from 1900 to 1945. Fiction/nonfiction by Conrad, Richardson, Forster, Joyce, Mansfield, Rhys, West, Woolf, Lawrence, and Huxley. Poetry by Hardy, Hopkins, Loy, H.D., Yeats, Pound and Eliot. Drama by Synge and Shaw.",
    "prereq": []
  },
  {
    "uid": "797285",
    "code": "ENGL3176",
    "subject": "ENGL",
    "number": "3176",
    "honors": false,
    "writingIntensive": false,
    "name": "20th-Cen British Lit & Cult II",
    "fullname": "20th-Century British Literatures and Cultures II",
    "info": "Survey of principal writers, intellectual currents, conventions, genres, and themes in Britain/Ireland, 1945-1999. Fiction/nonfiction by Greene, Bowen, Amis, Fowles, Lessing, Drabble, Murdoch, Naipaul, Carter, Rushdie, and Winterson. Poetry by Smith, Auden, Thomas, Larkin, Hughes, Heaney, Smith, Boland, and Walcott. Drama by Beckett, Pinter, Shaffer, Stoppard, Devlin, Friel, and Carr.",
    "prereq": []
  },
  {
    "uid": "004394",
    "code": "ENGL3180",
    "subject": "ENGL",
    "number": "3180",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Lit & Cultures",
    "fullname": "Contemporary Literatures and Cultures",
    "info": "Examine issues related to the reading and understanding of British, American, and Anglophone fiction and poetry in a variety of interpretive contexts.",
    "prereq": []
  },
  {
    "uid": "816310",
    "code": "ENGL3181",
    "subject": "ENGL",
    "number": "3181",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemp Literary Nonfiction",
    "fullname": "Contemporary Literary Nonfiction",
    "info": "Contemporary literary nonfiction from the 1960s to the present, covering developments in narrative nonfiction, memoir, and personal essay.",
    "prereq": []
  },
  {
    "uid": "816875",
    "code": "ENGL3182",
    "subject": "ENGL",
    "number": "3182",
    "honors": false,
    "writingIntensive": false,
    "name": "Irish Literature",
    "fullname": "Irish Literature",
    "info": "Against competing historical and political narratives, this study of 20th century Irish writers will show how their writing challenges assumptions about identity and nation, producing literature that pointedly does not carry a flag but instead explores the oppression, injustice, and violence that the individual being suffers as a consequence of it, and INSISTS on the right to resist, create, and misbehave. Authors will include Yeats, Joyce, Beckett, as well as others. ",
    "prereq": []
  },
  {
    "uid": "816552",
    "code": "ENGL3201W",
    "subject": "ENGL",
    "number": "3201",
    "honors": false,
    "writingIntensive": true,
    "name": "American Indian Literature",
    "fullname": "American Indian Literature",
    "info": "Comparative studies of oral traditions and modern literature from various tribal cultures.",
    "prereq": []
  },
  {
    "uid": "004191",
    "code": "ENGL3211",
    "subject": "ENGL",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Am Poetry to 1900",
    "fullname": "American Poetry to 1900",
    "info": "Poets from the Puritans to the end of the 19th century. The course attends to the intellectual and cultural background of the poets, poetic theory, and form.",
    "prereq": []
  },
  {
    "uid": "004193",
    "code": "ENGL3212",
    "subject": "ENGL",
    "number": "3212",
    "honors": false,
    "writingIntensive": false,
    "name": "Am Poetry from 1900",
    "fullname": "American Poetry from 1900",
    "info": "Famous and lesser-known poems from the Modernist era, the time of Frost, HD, Pound, Eliot and the Harlem Renaissance. The course attends to the intellectual and cultural background of the poets, poetic theory and form. ",
    "prereq": []
  },
  {
    "uid": "004289",
    "code": "ENGL3221",
    "subject": "ENGL",
    "number": "3221",
    "honors": false,
    "writingIntensive": false,
    "name": "Am Novel to 1900",
    "fullname": "American Novel to 1900",
    "info": "Novels, from early Republic, through Hawthorne, Melville, and Stowe, to writers at end of 19th century (e.g., Howells, Twain, James, Chopin, Crane). Development of a national literature. Tension between realism and romance. Changing role of women as writers and as fictional characters.",
    "prereq": []
  },
  {
    "uid": "004290",
    "code": "ENGL3222",
    "subject": "ENGL",
    "number": "3222",
    "honors": false,
    "writingIntensive": false,
    "name": "American Novel from 1900",
    "fullname": "American Novel from 1900",
    "info": "In this course, we will read and study novels of twentieth and twenty-first century American writers, from early 1900's realism through Modernists (e.g., Faulkner, Hemingway, Fitzgerald) to more contemporary writers (e.g., Baldwin, Ellison, Erdrich, Roth, Pynchon).  We will explore each text in relation to literary, cultural, and historical developments and question the narrative and stylistic strategies specific to each work. ",
    "prereq": []
  },
  {
    "uid": "004291",
    "code": "ENGL3231",
    "subject": "ENGL",
    "number": "3231",
    "honors": false,
    "writingIntensive": false,
    "name": "American Drama",
    "fullname": "American Drama",
    "info": "Representative dramas from 18th through 20th centuries. Topics include staging of national identities, aesthetics of modern/contemporary drama. Production concerns of mainstream, regional, community theaters.",
    "prereq": []
  },
  {
    "uid": "003714",
    "code": "ENGL3300",
    "subject": "ENGL",
    "number": "3300",
    "honors": false,
    "writingIntensive": false,
    "name": "Multi Am Lits",
    "fullname": "Multicultural American Literatures and Cultures",
    "info": "Writings of specific ethnic groups. Emphasizes historical or cultural context. Topics may include American minority drama, Harlem Renaissance, Asian-American literature/film, African-American women writers. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "807431",
    "code": "ENGL3301",
    "subject": "ENGL",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian Amer thru Arts Culture",
    "fullname": "Asian America through Arts and Culture",
    "info": "Americans of Asian descent comprise one of the fastest-growing racial groups in the U.S. today. While large numbers of Asian Americans have been in the U.S. since the middle of the nineteenth century, it is only in the past few decades that they have been widely recognized in art, culture, and media. This course focuses on how writing, art, performance, film, and/or other works of culture registers the experiences of Asian Americans past and present. How do individual artists or writers depict themselves and others as part of families, communities, or nations? How do questions of race, racism, family, identity, immigration, labor, citizenship, inequality, gender, sexuality, media stereotypes, and activism affect the perspectives and the creative choices in these works?",
    "prereq": []
  },
  {
    "uid": "814652",
    "code": "ENGL3303W",
    "subject": "ENGL",
    "number": "3303",
    "honors": false,
    "writingIntensive": true,
    "name": "Writing Differences",
    "fullname": "Writing Differences: Literature by U.S. Women of Color",
    "info": "Interpret/analyze poetry, fiction, and drama of U.S. women minority writers. Relationship of writer's history, ethnicity, race, class, and gender to her writings.",
    "prereq": []
  },
  {
    "uid": "002974",
    "code": "ENGL3330",
    "subject": "ENGL",
    "number": "3330",
    "honors": false,
    "writingIntensive": false,
    "name": "G/L/B/T Lit",
    "fullname": "Gay, Lesbian, Bisexual, and Transgender Literature",
    "info": "Literature/culture produced by/about gay, lesbian, bisexual, and transgender people. Emphasizes importance of materials falsified/ignored in earlier literary/cultural studies. How traditional accounts need to be revised in light of significant contributions of GLBT people.",
    "prereq": []
  },
  {
    "uid": "817969",
    "code": "ENGL3331",
    "subject": "ENGL",
    "number": "3331",
    "honors": false,
    "writingIntensive": false,
    "name": "LGBTQ Literature: Then and Now",
    "fullname": "LGBTQ Literature: Then and Now",
    "info": "LGBTQIA life in the US has changed significantly over the past few decades. By examining a selection of poetry, prose, and film, our class will try to answer the questions: \"How did we get to where we are today?\" and \"Where do we go next?\" We will look at classic works in their historical contexts to see what was revolutionary about their publication; we will trace how they paved the way for all that followed. We will look at very new works to understand the concerns of twenty-first century LGBTQIA writers and readers. From the \"lavender scare\" to the Stonewall Riots to the AIDS pandemic to marriage equality to genderqueer and trans movements, we will explore how LGBTQIA authors and filmmakers have both responded to and shaped the ethos of our times. ",
    "prereq": []
  },
  {
    "uid": "825593",
    "code": "ENGL3332",
    "subject": "ENGL",
    "number": "3332",
    "honors": false,
    "writingIntensive": false,
    "name": "Afrofuturism/Afropessimism",
    "fullname": "Black Times: Afrofuturism, Afropessimism and the Future (Ends) of the World",
    "info": "In 1993, Mark Dery coined the term Afrofuturism to describe “[s]peculative fiction that treats African-American themes and addresses African-American concerns in the context of twentieth- century technoculture — and, more generally, African-American signification that appropriates images of technology and a prosthetically enhanced future.\" At the same time, Dery places this fictional treatment of Black futures in the context of a history systematically denied. Afropessimism, on the other hand, emerges at the turn of the 21st century in an interview between Saidiya Hartman and Frank B. Wilderson III as a meta theory that evinces a skepticism about the utility of the term Human to understand the positionality of blackness in an antiblack world. Blackness, for Afropessemists, becomes a technology by which the Human constitutes its Humanity as difference. This body of work generally understands the end of antiblackness as only possible with the destruction of “the world,” understood to be definitionally antiblack.Starting with W.E.B. Du Bois’s “The Comet,” this course traces the relationships between African American literature, politics and sociality through the representation of blackness in relationship to technology. This course interrogates Dery’s description of Afro Futurism as both descriptive and ideological. Put another way, this class is attentive to the way that the future is signified in the contemporary world as well as the fact that, following Afropessimism’s analysis, that world, and thus this mode of signifying blackness, may itself be antiblack. As a result, this course juxtaposes traditionally, technologically, Afrofuturist works, with those such as Parable of the Sower, The Broken Earth Trilogy, and An Unkindness of Ghosts that depict Black futures at or after the apocalypse.Students should expect to think and rethink the relationship between technology as a signifier of the future and those structures that continue antiblackness and colonialism. Additionally, students should also expect to gain a broad conceptualization of African American speculative fiction. Finally, students can expect to read texts of Black fiction that imagine futures in ways beyond the disasters of not only antiblackness, but of misogyny, heterosexism, ableism, and transphobia.",
    "prereq": []
  },
  {
    "uid": "003721",
    "code": "ENGL3350",
    "subject": "ENGL",
    "number": "3350",
    "honors": false,
    "writingIntensive": false,
    "name": "Women Writers",
    "fullname": "Women Writers",
    "info": "Women writers in the 19th and/or 20th centuries. Will focus either on writers from a single country or be comparative in nature. The course will be organized thematically or according to topics of contemporary and theoretical interest.",
    "prereq": []
  },
  {
    "uid": "797845",
    "code": "ENGL3351W",
    "subject": "ENGL",
    "number": "3351",
    "honors": false,
    "writingIntensive": true,
    "name": "VG/Voices from the Gaps",
    "fullname": "Voices from the Gaps: Writing and Art by Women of Color",
    "info": "Collaborative/individual student research, writing, and Web site production for VG (Voices from the Gaps). Focuses on visual arts, film, music, and literature by North American women writers of colour. Texts/discussions in English.",
    "prereq": []
  },
  {
    "uid": "803930",
    "code": "ENGL3352",
    "subject": "ENGL",
    "number": "3352",
    "honors": false,
    "writingIntensive": false,
    "name": "Weird Books by Women",
    "fullname": "Weird Books by Women",
    "info": "Weirdness as non-normativity that creates discomfort. Weirdness as incestuous creepiness, dissociation, hysteria, paranoia. Weirdness as identifying, but not wanting to, with a twisted \\\"reality.\\\" Weirdness created through experimental text, form, and narrative.",
    "prereq": []
  },
  {
    "uid": "825616",
    "code": "ENGL3353",
    "subject": "ENGL",
    "number": "3353",
    "honors": false,
    "writingIntensive": false,
    "name": "Jane Austen’s Afterlives",
    "fullname": "Jane Austen’s Afterlives",
    "info": "Why do the novels of Jane Austen, which were first published over two hundred years ago, still captivate readers all over the world? In this discussion-based course, which fulfills the Literature Core LE, we will closely examine five of Austen’s major novels alongside the far morevoluminous body of scholarship, sequels, screen adaptations, and fan responses that these works have inspired. Besides considering Austen's distinctive style, her contribution to the development of the novel form, and the cultural and historical context in which she wrote, we will explore avariety of ways in which the author and her work have been represented and reimagined across the globe. By focusing on a single author in depth, members of this course will not only investigate the array of cultural functions that “Jane Austen” has come to serve, but also hone their ability to analyze fundamental aspects of literary technique.",
    "prereq": []
  },
  {
    "uid": "004396",
    "code": "ENGL3400",
    "subject": "ENGL",
    "number": "3400",
    "honors": false,
    "writingIntensive": false,
    "name": "Post-Colonial Lit",
    "fullname": "Post-Colonial Literatures",
    "info": "Varied topics in post-Colonial literatures. Typical novelists include Chinua Achebe, Tsitsi Dangaremba, Fadia Faqir, Salman Rushdie; filmmaker Kidlat Tahimik; and \"dub\" poets Mutabaruka and Jean Binta Breeze.",
    "prereq": []
  },
  {
    "uid": "819253",
    "code": "ENGL3401W",
    "subject": "ENGL",
    "number": "3401",
    "honors": false,
    "writingIntensive": true,
    "name": "Decolonial Lit of the Americas",
    "fullname": "Decolonial Literatures of the Americas",
    "info": "This course begins with the assumption that \"coloniality\" as an idea and a practice does not end when the period of colonization ends. Instead, it continues on, through material violences that maintain and reproduce the legacies of colonization--legacies such as racial and gendered violence, exploitative labor, social death, forced migration, and uneven urbanization, among other pressing issues. This course will examine and compare what have been called the \"decolonial\" literatures of the Americas--literatures written in English or appearing in English translation that concern communities that have been oppressed and made invisible by colonialism. We will study a network of resistance, tactics, strategies, social movements, and ongoing creative practices, and we will critique the potential and limitations of literature as a tool for activism and social change. The course will focus on understanding the relationships between literature, art, politics, and memory, and it will foster learning by doing as well as community outreach and relationship with local Indigenous communities.Students will visit local art galleries and other locales, create and maintain a class blog to be featured on the course website, and engage in their own creative forms of decolonial critique through weekly blog posts. Students' final projects will also explore decolonial perspectives and activism that specifically involves local practices of water activism and re-linking to Indigenous ways of knowing. This course does not have prerequisites beyond the University's entrance requirements.",
    "prereq": []
  },
  {
    "uid": "789894",
    "code": "ENGL3501",
    "subject": "ENGL",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Discourse",
    "fullname": "Public Discourse: Coming to Terms with the Environment",
    "info": "This course explores significant environmental issues (such as environmental justice, toxic chemicals, climate change) through the analysis of texts from diverse literary genres. It focuses as much on issues of language and meaning as it does on the subjects these texts concern. Students examine the formal dimensions of these texts, as well as their social and historical contexts. In addition, students are introduced to the underlying scientific principles, the limitations of technologies, and the public policy aspects of each of these issues, in order to judge what constitutes an appropriate response to them. Students also learn how to identify and evaluate credible information concerning the environment.",
    "prereq": []
  },
  {
    "uid": "813638",
    "code": "ENGL3502",
    "subject": "ENGL",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Nature Stories",
    "fullname": "Nature Stories: Environmental Discourse in Action",
    "info": "Explore contemporary texts from multiple disciplines to analyze the role of stories in interpreting nature. Emphasis on lived experience, civic motivation, and observational research that enrich effective nature writing. Optional service-learning component.",
    "prereq": []
  },
  {
    "uid": "795400",
    "code": "ENGL3505",
    "subject": "ENGL",
    "number": "3505",
    "honors": false,
    "writingIntensive": false,
    "name": "Protest Lit & Community Action",
    "fullname": "Protest Literature and Community Action",
    "info": "This course combines academic analysis and experiential learning to understand, in both theory and practice, different perspectives on the power of \"protest\" in civic life.  We will read a selection from the vast genre of progressive protest literature (pamphlets, poems, polemics, lists of demands, teaching philosophies, organizing principles, cultural histories, newsletter articles, movement chronicles, and excerpts from novels and biographies) from four key social-justice movements: the American Indian Movement, the Black Power movement, the post-Great Recession struggle for economic power, and the battle for immigrant rights. We'll also learn about this experientially as we roll up our sleeves and get involved in local community-based education initiatives and local social-justice organizations through our service-learning.  Students receive initial training from CLA Career Services, The Center for Community-Engaged Learning, the Minnesota Literacy Council, as well as orientations at community sites.",
    "prereq": []
  },
  {
    "uid": "795401",
    "code": "ENGL3506",
    "subject": "ENGL",
    "number": "3506",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Movements & Commnty Ed",
    "fullname": "Social Movements & Community Education",
    "info": "In this course, we'll examine four progressive social movements. After beginning with a foundational civil rights movement example, we will learn about the anti-racist feminism branch of the women's movement, often referred to as \"third-wave feminism.\" We'll also study the Occupy movement that arose in response to the Great Recession (the financial crisis beginning in 2008). Then we'll take a look at two social movements that, while by no means underground, tend to fly below the radar: the prison abolition movement and the fight for public schools. While all of these social movements have different emphases, they also overlap quite a bit in their systemic analysis of society and their strategies for action. As activist, organizer, and trainer Rinku Sen observes, \"the history of community organizing and social movements is replete with tactics learned in one movement being applied to another.\"As we study these social movements, community organizing will be of particular interest to us. How do the groups, collectives, nonprofits, and communities propelling these different social movements organize themselves, their leadership, their strategies, and their activities? How do they make decisions? What do meetings and planning processes look like? What do they do when they disagree? How do they recruit and mobilize? How do they communicate with and confront the general public, elected officials, and the more powerful elements of the ruling class? How do they talk about the work they're doing?  How do they develop a vision of the world they'd like to live in while still inhabiting the present one, with all its flaws and injustices? We'll also examine the role of education in organizations working for social change. Whether through trainings, \"political education,\" reading groups, or small group activities associated with popular education, many of the social-movement groups we'll study have developed educational strategies and curricula.  Hands-On Learning through Community Education: As we study these social movements and their approaches to organizing and educating in the comfortable confines of our university classroom, we'll also learn about them experientially through our service-learning. That is, we'll work 2 hours per week at local education initiatives in K-12 schools, adult programs, and social-justice organizations in the non-profit and grassroots sectors, comprising a total of 24 hours by the end of the semester. This hands-on learning will strengthen our academic grasp of social movements, organizational dynamics, and teaching and community organizing by providing us with grounded perspectives. More broadly, we'll get a feel for what it's like to get involved as citizens, activists, teachers, and learners attempting to build cross-organizational coalitions. And we'll share what we learn with each other.Representatives from the Center for Community-Engaged Learning (the U's service-learning office) and various community organizations will attend our second class session to tell you about their respective sites and how you can get involved. For our third class session, you will rank the top three community sites you'd like to work at. You will then be \"matched\" with a community organization, and your community education work will begin as soon as this matching process is complete. (We try to honor students' first and second choices, while also making sure that you also have some fellow classmates at your site.) To help prepare you, at a time convenient for you, you will also attend a training session facilitated by the Minnesota Literacy Council (MLC) or the Center for Community-Engaged Learning-- details will be provided in class.  ",
    "prereq": []
  },
  {
    "uid": "806459",
    "code": "ENGL3507W",
    "subject": "ENGL",
    "number": "3507",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Chicana/o Literature",
    "fullname": "Introduction to Chicana/o Literature",
    "info": "Cultural, intellectual, and sociopolitical traditions of Mexican Americans as they are represented in creative literature. Genres/forms of creative cultural expression and their significance as representations of social, cultural, and political life in the United States. Novels, short stories, creative nonfiction, drama, essay, poetry, and hybrid forms of literature.",
    "prereq": []
  },
  {
    "uid": "004397",
    "code": "ENGL3581",
    "subject": "ENGL",
    "number": "3581",
    "honors": false,
    "writingIntensive": false,
    "name": "Folklore",
    "fullname": "Folklore",
    "info": "Folklore genres such as proverbs, prose narratives (tales and legends), foodways, and games. Outline of the history of folklore.",
    "prereq": []
  },
  {
    "uid": "790932",
    "code": "ENGL3591W",
    "subject": "ENGL",
    "number": "3591",
    "honors": false,
    "writingIntensive": true,
    "name": "African American Lit",
    "fullname": "Introduction to African American Literature",
    "info": "African American autobiography, fiction, essay, poetry, drama, folklore from late-18th century to present.",
    "prereq": []
  },
  {
    "uid": "789608",
    "code": "ENGL3592W",
    "subject": "ENGL",
    "number": "3592",
    "honors": false,
    "writingIntensive": true,
    "name": "Black Women Writers in the US",
    "fullname": "Introduction to Black Women Writers in the United States",
    "info": "The literature of African American women writers explored in novels, short stories, essays, poetry, autobiographies, and drama from the 18th to the late-20th century.",
    "prereq": []
  },
  {
    "uid": "816296",
    "code": "ENGL3593",
    "subject": "ENGL",
    "number": "3593",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Novel",
    "fullname": "The African American Novel",
    "info": "Explore African American novelistic traditions. Plot patterns, character types, settings, symbols, themes, mythologies. Creative perspectives of authors themselves. Analytical frameworks from contemporary literary scholarship.",
    "prereq": []
  },
  {
    "uid": "798901",
    "code": "ENGL3597W",
    "subject": "ENGL",
    "number": "3597",
    "honors": false,
    "writingIntensive": true,
    "name": "African American Literature I",
    "fullname": "Introduction to African American Literature and Culture I",
    "info": "African American oral tradition, slave narrative, autobiography, poetry, essay, fiction, oratory, and drama, from colonial era through Harlem Renaissance.",
    "prereq": []
  },
  {
    "uid": "799911",
    "code": "ENGL3598W",
    "subject": "ENGL",
    "number": "3598",
    "honors": false,
    "writingIntensive": true,
    "name": "African American Literature II",
    "fullname": "Introduction to African American Literature and Culture II",
    "info": "African American oral tradition, autobiography, poetry, essay, fiction, oratory, drama. From after Harlem Renaissance to end of 20th century.",
    "prereq": []
  },
  {
    "uid": "004318",
    "code": "ENGL3601",
    "subject": "ENGL",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Analysis of the English Lang",
    "fullname": "Analysis of the English Language",
    "info": "Introduction to structure of English. Phonetics, phonology, morphology, syntax, semantics. pragmatics. Language variation/usage.",
    "prereq": []
  },
  {
    "uid": "004255",
    "code": "ENGL3604",
    "subject": "ENGL",
    "number": "3604",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Discourse",
    "fullname": "Public Discourse",
    "info": "Popular culture and media as important modes of cultural discourse: their histories/rhetorics, their systems of production/circulation, their work in constructing us and our work in construing them.",
    "prereq": []
  },
  {
    "uid": "007455",
    "code": "ENGL3611",
    "subject": "ENGL",
    "number": "3611",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist English Lang",
    "fullname": "History of the English Language",
    "info": "Development of English language from Old English (mid 5th century) to Middle English (around 1100) to Early Modern English (about 1500).",
    "prereq": []
  },
  {
    "uid": "007457",
    "code": "ENGL3612",
    "subject": "ENGL",
    "number": "3612",
    "honors": false,
    "writingIntensive": false,
    "name": "Old English I",
    "fullname": "Old English I",
    "info": "Introduction to the language through 1150 A.D. Culture of Anglo-Saxons. Selected readings in prose/poetry.",
    "prereq": []
  },
  {
    "uid": "004965",
    "code": "ENGL3704",
    "subject": "ENGL",
    "number": "3704",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Editing & Publishing",
    "fullname": "Introduction to Editing and Publishing",
    "info": "What are the myriad activities that constitute a day in the life of a professional editor? According to Susan L. Greenberg’s A Poetics of Editing, “In the popular imagination, the editor is a passive creature, busy telling people ‘No.’” Are editors glorified gatekeepers, benevolent literary midwives, or cultural evangelists? This class focuses on the art and craft of editing and revision. We’ll begin the semester by analyzing the relationship between author and editor, writer and reader. Students will learn the creative, professional, and relational aspects of editing in addition to learning how to sharpen their inner critic. We’ll experiment in the classroom with giving and receiving critical feedback in an attempt to make better, more discerning and curious readers of us all. We’ll also explore the surrounding professional landscape that is the Twin Cities’ local literary and publishing cultures, and on occasion, meet seasoned professionals working with print and digital media across literature and the arts. Students will adventure behind-the-scenes in order to discover how a book comes into print as it is shepherded through the various stages of production from editorial through publication. We’ll also spend time researching and discussing editorial fellowships, freelance, and entry level job opportunities as we explore post-graduate career options in publishing. Recommended for students studying Creative Writing, English, Journalism, and Communications. Credit will not be granted if credit has been received for ENGW 5401, ENGL 5711, ENGL 5401, or ENGL 4711",
    "prereq": []
  },
  {
    "uid": "793689",
    "code": "ENGL3711",
    "subject": "ENGL",
    "number": "3711",
    "honors": false,
    "writingIntensive": false,
    "name": "Literary Mag Production Lab I",
    "fullname": "Literary Magazine Production Lab I",
    "info": "First of two courses. Students produce undergraduate art/literary magazine The Tower. Students decide upon identity, tone, and direction of the issue. They take on magazine staff responsibilities, call for submissions, make selections, edit/design, set budget, and begin fund-raising.prereq: [instructor consent required, instr consent]",
    "prereq": []
  },
  {
    "uid": "802533",
    "code": "ENGL3712",
    "subject": "ENGL",
    "number": "3712",
    "honors": false,
    "writingIntensive": false,
    "name": "Literary Mag Production Lab II",
    "fullname": "Literary Magazine Production Lab II",
    "info": "ENGL 3712 is the second of a two-semester course. In this hands-on, experiential lab, we solicit, acquire, edit, copyedit, design, typeset, proofread, print, publicize and distribute the upcoming edition of The Tower, the magazine of undergraduate art and creative writing by University of Minnesota students. This is the semester in which we bring out the finished, printed magazine, and in which we host a launch party on campus. We'll continue to apply and expand the lessons from our exploration in ENGL 3711 of the theory and history of literary magazine production in any number of ways: we'll revise our mission and theme as we draft and revise ancillary copy for the issue itself and as we refresh the marketing copy for our social media, blog, and website; we'll hone our design and typesetting skills as we lay out the issue; we'll refine our aesthetic sensibilities as we collaborate on final selections, strengthening our willingness to revise our opinions as compromise for the greater good; we'll add to our firsthand valuable on-the-job skills of budgeting, scheduling, and vendor relations; and we will deepen our understanding of the publishing profession as it exists today, locally, and nationally.prereq: [3711, instr consent]",
    "prereq": {
      "code": "ENGL 3711",
      "subject": "ENGL",
      "id": "3711"
    }
  },
  {
    "uid": "006936",
    "code": "ENGL3713",
    "subject": "ENGL",
    "number": "3713",
    "honors": false,
    "writingIntensive": false,
    "name": "Editing for Pub",
    "fullname": "Editing for Publication",
    "info": "Practice professional editing of various kinds of texts (e.g., scientific/technical writing). Introduction to editing levels, from substantive revision to copyediting. Computer-mediated editorial practices.",
    "prereq": []
  },
  {
    "uid": "817699",
    "code": "ENGL3714",
    "subject": "ENGL",
    "number": "3714",
    "honors": false,
    "writingIntensive": false,
    "name": "The Business of Publishing",
    "fullname": "The Business of Publishing",
    "info": "The Business of Publishing course, by focusing primarily on book publishing, will give a wide variety of students--from budding writers to business majors--exposure to a major industry (valued at $125 billion worldwide) that curates, promotes and monetizes the written word. There are approximately 12,000 publishers in the U.S., and of those an estimated 3,000 are literary presses. An estimated 600,000 books are published in the U.S. annually; Nielsen Book Scan reports 674 million unit sales in 2016. Book, magazine, and newspaper publishing are still the most stable types of publishing in our society and form the nexus between commerce and culture. Broadly understood, \"publishing\" means \"to make words and images public.\" It encompasses many activities and forms--for instance, business newsletters and websites; social media (Facebook, Twitter, and Snapchat); and organizational and personal blogs. More specifically, it is a profession with specialized components--marketing, design, sales, subsidiary rights, bookselling--each with its own standards and best practices. It is also a field rife with innovation, producing multiple \"start-ups\" constantly. To \"publish well\" means not only to deliver content to a page or screen but also to deliver it to an audience. Publishing crosses disciplines, and innovates new channels and modes of production. As such, publishing well has implications for all of us in our daily personal and professional lives. At the University of Minnesota, we have the advantage of living in a metro area that is regularly ranked near or at the top of lists for most literate cities in the U.S. We have one of the largest concentrations of literary presses in the country outside of the East Coast. This course will take advantage of guest lecturers from Minnesota's nationally recognized publishing community. It encourages students to discuss the work of publishing with these professionals, and provides them with networking opportunities.As well as exploring in-depth the specific components of the publishing process, this class also broadens our sense of what \"publishing\" is. It is a process as much as it is a product. Why publishing? Why is a whole profession devoted to it? Why might we want to dedicate our own lives to it, or value the portion it already plays in them? Through this course we will understand first-hand how a book makes its way out into the world, and why that process is so important to culture and community.",
    "prereq": []
  },
  {
    "uid": "004323",
    "code": "ENGL3741",
    "subject": "ENGL",
    "number": "3741",
    "honors": false,
    "writingIntensive": false,
    "name": "Literacy & Diversity",
    "fullname": "Literacy and American Cultural Diversity",
    "info": "Literacy and American Cultural Diversity combines academic study with experiential learning in order to collectively build more engaged, more complex understandings of literacy, educational institutions, counter-institutional literacy programs, the grassroots and nonprofit sectors, and the struggles of a multicultural civil society in a putative democracy.  We will ground our inquiry in government studies, as well as sociological, historical, and educational writings. Standard literature, such as a memoir, a selection of poems, some short fiction, and a novel will further open up our twin themes of literacy and multiculturalism – as will less “official” literature, such as manifestos and the transcribed stories of immigrants, refugees, and other marginalized communities.We begin with the basic understanding of literacy as reading and writing, noting that, according to the National Survey of Adult Literacy, 46% of Americans scored in the lowest two levels of a five-tiered literacy test. What does this mean? Are such tests accurate or otherwise helpful?   What about your basic literacy? As you read this syllabus, you’re making use of basic abilities that you’ve likely been practicing most of your life through formal schooling, daily routines, recreational pursuits, and work-related duties. But there’s more. On another level, you bring knowledge to your reading (some conscious, some unconscious), and the ideological field supplies you with assumptions about the role of literacy in your development, the role of a university course in your plans for your personal and professional life, and your position in a society that constantly raises the standards of literacy, basing success on your ability to keep up. Thus the very word “literacy” calls into play many beliefs we have about our class system, our cultural life, economic and political structures, and educational institutions. Accordingly, our analysis will move beyond basic “reading and writing” to wider concepts of literacy in our society, investigating issues that have much to do with our role as public citizens involved in shaping our individual and collective future.  In tandem with our “classroom” work, our service-learning work in the community (see Your Practicum as Literacy Workers, below) will enable us to develop more “tangible” understandings of the ways that literacy, educational theories, practices, and the construction of knowledge and skills through educational policies provide a “map” of the shifting socioeconomic, cultural, and political terrains of the U.S., the institutional inequities that result from these arrangements, as well as the justice work needed to transform those inequities.",
    "prereq": []
  },
  {
    "uid": "004327",
    "code": "ENGL3753W",
    "subject": "ENGL",
    "number": "3753",
    "honors": false,
    "writingIntensive": true,
    "name": "Writ Beyond Academy",
    "fullname": "Writing Beyond the Academy",
    "info": "Internship. Analyses of writing styles, genres, and rhetorical contexts outside the academy.",
    "prereq": []
  },
  {
    "uid": "004410",
    "code": "ENGL3870",
    "subject": "ENGL",
    "number": "3870",
    "honors": false,
    "writingIntensive": false,
    "name": "Figures in Lit",
    "fullname": "Figures in English and North American Literature",
    "info": "Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004412",
    "code": "ENGL3880",
    "subject": "ENGL",
    "number": "3880",
    "honors": false,
    "writingIntensive": false,
    "name": "General Topics",
    "fullname": "General Topics",
    "info": "Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "003869",
    "code": "ENGL3881",
    "subject": "ENGL",
    "number": "3881",
    "honors": false,
    "writingIntensive": false,
    "name": "London Seminar",
    "fullname": "London Seminar",
    "info": "Broad topic of literary investigation crossing/integrating several areas of study. Sometimes team-taught. \"Literature in London\" program course.prereq: Completion of 3xxx composition requirement, dept consent",
    "prereq": []
  },
  {
    "uid": "003871",
    "code": "ENGL3882W",
    "subject": "ENGL",
    "number": "3882",
    "honors": false,
    "writingIntensive": true,
    "name": "Senior Paper",
    "fullname": "Senior Paper",
    "info": "Senior paper.",
    "prereq": []
  },
  {
    "uid": "825333",
    "code": "ENGL3885W",
    "subject": "ENGL",
    "number": "3885",
    "honors": false,
    "writingIntensive": true,
    "name": "Capstone Seminar in English",
    "fullname": "Capstone Seminar in English",
    "info": "This course is devoted to the writing of the senior paper in English. To graduate with a BA in English, students must write a 13-17 page (4,000-5,500 word) senior paper that contains substantive and original analytical insights. In this rigorous and intensive seminar, students receive instruction on writing this paper from tenured and tenure-track faculty in English. Students learn how to choose a topic and formulate a research question, conduct primary and secondary research, and produce a written document that incorporates research and analysis. Faculty teach students to produce an extended, scholarly essay though discussions of method, research, and development; instruction in specific writing techniques; workshopping and revising drafts; solving problems; and creating a coherent and elegant final product. While the subjects about which students write vary depending on student interest and faculty expertise, at least 50% of the course grade is determined by students’ writing performance. Most students fulfill the senior paper requirement with a traditional seminar paper, but students sometimes complete alternative projects, such as blogs, analytic projects that incorporate creative or personal elements, collaborative projects, or projects that involve the creation of a podcast, video, web site, or some other means of documenting student learning and writing skills. The senior seminar also functions as a capstone experience that fulfills many of the Student Learning Outcomes for the English major. Prerequisites for Admission: Admission to ENGL 3885W requires English major status and completion of a Critical Theories and Methods course (ENGL 3001W, ENGL 3002, ENGL 4003) or approved transfer course with a minimum grade of C-minus. Priority will be given to students with senior status who have completed the majority of the major requirements, as well as to students who plan to graduate in the term they are requesting to take the senior seminar.",
    "prereq": {
      "and": [
        {
          "code": "ENGL 3001W",
          "subject": "ENGL",
          "id": "3001W"
        },
        {
          "code": "ENGL 3002",
          "subject": "ENGL",
          "id": "3002"
        },
        {
          "code": "ENGL 4003",
          "subject": "ENGL",
          "id": "4003"
        }
      ]
    }
  },
  {
    "uid": "818540",
    "code": "ENGL3896",
    "subject": "ENGL",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "Internships at local arts organizations, businesses, or publishing firms provide experiences in communications, arts administration, marketing, and editing-as well as an understanding of what students need to do to prepare for the job market. The Department of English offers course credit in connection with internships dedicated to UMN English majors as well as internships at other sites that meet our criteria.This course will enrich student learning by providing concrete experiences to apply knowledge of oral and written communication outside the academic context. Putting English skills to work in your internship tasks will allow you to see how communication changes with contexts and audiences. You will be able to practice new voices and styles. Depending on the internship activities, you may practice communication germane to marketing, development, editing, social media, and the professional office. You will receive feedback from your site supervisors and instructors as to your understanding of these new ways of communicating. In this course, you will keep a weekly journal detailing the work you do in the internship; analyzing the significance of the work within the greater activity of the internship site; and making connections between the work and the academic learning you have done in English. You will also write a final paper on a topic agreed upon with the instructor, which should build upon the writing you've done in the journals.We'll start by having you work with your internship supervisor to create a learning agreement that outlines what you plan to learn and accomplish during your internship and how you plan to contribute and add value to the organization. You will complete various additional assignments including discussion, readings, and writing.prereq: must be a formally declared English major registered in the College of Liberal Arts and have consent of instructor.",
    "prereq": []
  },
  {
    "uid": "003870",
    "code": "ENGL3960W",
    "subject": "ENGL",
    "number": "3960",
    "honors": false,
    "writingIntensive": true,
    "name": "Capstone Seminar in English",
    "fullname": "Capstone Seminar in English",
    "info": "This course is devoted to the writing of the senior paper in English. To graduate with a BA in English, students must write a 13-17 page (4,000-5,500 word) senior paper that contains substantive and original analytical insights. In this rigorous and intensive seminar, students receive instruction on writing this paper from tenured and tenure-track faculty in English. Students learn how to choose a topic and formulate a research question, conduct primary and secondary research, and produce a written document that incorporates research and analysis. Faculty teach students to produce an extended, scholarly essay though discussions of method, research, and development; instruction in specific writing techniques; workshopping and revising drafts; solving problems; and creating a coherent and elegant final product. While the subjects about which students write vary depending on student interest and faculty expertise, at least 50% of the course grade is determined by students writing performance. Most students fulfill the senior paper requirement with a traditional seminar paper, but students sometimes complete alternative projects, such as blogs, analytic projects that incorporate creative or personal elements, collaborative projects, or projects that involve the creation of a podcast, video, web site, or some other means of documenting student learning and writing skills. The senior seminar also functions as a capstone experience that fulfills many of the Student Learning Outcomes for the English major. Prerequisites for Admission: Admission to ENGL 3960W requires English major status and completion of ENGL 3001W with a minimum grade of C-minus. Priority will be given to students with senior status who have completed the majority of the major requirements, as well as to students who plan to graduate in the term they are requesting to take the senior seminar.",
    "prereq": {
      "code": "ENGL 3001",
      "subject": "ENGL",
      "id": "3001"
    }
  },
  {
    "uid": "003873",
    "code": "ENGL3980",
    "subject": "ENGL",
    "number": "3980",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir. Instruction",
    "fullname": "Directed Instruction",
    "info": "Directed study arranged between student and advising faculty member. Prereq-instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "016899",
    "code": "ENGL3992",
    "subject": "ENGL",
    "number": "3992",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Reading",
    "fullname": "Directed Reading",
    "info": "Guided individual reading.",
    "prereq": []
  },
  {
    "uid": "003872",
    "code": "ENGL3993",
    "subject": "ENGL",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study. Prereq-One 3xxx, [English major or minor or [BIS or IDIM or ICP] with English concentration], [jr or sr], instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "825549",
    "code": "ENGL3993W",
    "subject": "ENGL",
    "number": "3993",
    "honors": false,
    "writingIntensive": true,
    "name": "Directed Study- Honors Thesis",
    "fullname": "Directed Study- Honors Thesis in English",
    "info": "ENGL 3993W is a writing intensive directed study that supports summa cum laude degree students completing their honors theses in the Department of English. Students will complete EngL 3993, the non-WI version, in the first semester for 2 credits followed consecutively by ENGL 3993W for 2 additional credits in the second semester, when the polished product is evaluated.Summa candidates also must register for HCOL 3101H or HCOL 3102H, which counts as the classroom experience required for the completion of the Honors thesis. The thesis must be approximately 30 pages in length and may be scholarly, critical, or creative in nature.  If the candidate elects to submit a topic, such as poetry, that poses a problem with this length, they must obtain permission from the English honors adviser and from all of his or her readers to adjust the length of the completed thesis.Summa candidates must apply for permission to register for ENGL 3993W one year before their expected graduation term. You will work with your faculty advisor to complete the University's directed study contract to clarify expectations and form a written agreement about expected workload, credits, and basis for grading.Prereq: Honors candidacy in English, consent of English honors advisor",
    "prereq": []
  },
  {
    "uid": "016900",
    "code": "ENGL3994",
    "subject": "ENGL",
    "number": "3994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed individual research. Qualified students work on a tutorial basis.",
    "prereq": []
  },
  {
    "uid": "793822",
    "code": "ENGL4003",
    "subject": "ENGL",
    "number": "4003",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Literary Theory",
    "fullname": "History of Literary Theory",
    "info": "How thinkers from classical to modern times posed/answered questions about language (how words mean), audience (to whom they mean), and the literary (how literary writing differs from other forms of writing). Works by Plato, Aristotle, Augustine, Christine de Pizan, Dante, Sidney, Behn, Wordsworth, Shelley, and Woolf.",
    "prereq": []
  },
  {
    "uid": "794369",
    "code": "ENGL4041",
    "subject": "ENGL",
    "number": "4041",
    "honors": false,
    "writingIntensive": false,
    "name": "Old Age in Film and Literature",
    "fullname": "Old Age in Film and Literature",
    "info": "How/why subject of old age is focus of a selection of primarily modern verbal/visual texts (fiction, non-fiction). Philosophical, sociological, and psychological perspectives. Ways in which varied experiences of old age have as much to do with culture as with biology.",
    "prereq": []
  },
  {
    "uid": "800427",
    "code": "ENGL4090",
    "subject": "ENGL",
    "number": "4090",
    "honors": false,
    "writingIntensive": false,
    "name": "General Topics",
    "fullname": "General Topics",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "794370",
    "code": "ENGL4152",
    "subject": "ENGL",
    "number": "4152",
    "honors": false,
    "writingIntensive": false,
    "name": "Nineteenth Century Brit Novel",
    "fullname": "Nineteenth Century British Novel",
    "info": "British novel during the century in which it became widely recognized as a major vehicle for cultural expression. Possible topics include the relation of novel to contemporary historical concerns: rise of British empire, developments in science, and changing roles for women; formal challenges of the novel; definition of realism.",
    "prereq": []
  },
  {
    "uid": "793823",
    "code": "ENGL4153",
    "subject": "ENGL",
    "number": "4153",
    "honors": false,
    "writingIntensive": false,
    "name": "Nineteenth-Century Brit Poetry",
    "fullname": "Nineteenth-Century British Poetry",
    "info": "Poetry written in Britain during 19th century. Possible authors include Wordsworth, Byron, Hemans, Tennyson, Robert and Elizabeth Browning, D. G. and Christina Rossetti, Swinburne, and Hopkins.",
    "prereq": []
  },
  {
    "uid": "793695",
    "code": "ENGL4232",
    "subject": "ENGL",
    "number": "4232",
    "honors": false,
    "writingIntensive": false,
    "name": "Amer Drama by Writers of Color",
    "fullname": "American Drama by Writers of Color",
    "info": "Selected works by African American, Latinx, Native American, and Asian American playwrights. How racial/ethnic differences are integral to shaping different visions of American drama. History of minority/ethnic theaters, politics of casting, mainstreaming of the minority playwright. Students in this class will have the opportunity to participate in service-learning.",
    "prereq": []
  },
  {
    "uid": "793824",
    "code": "ENGL4233",
    "subject": "ENGL",
    "number": "4233",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern and Contemporary Drama",
    "fullname": "Modern and Contemporary Drama",
    "info": "Why did the polite Danish homes of 1879 bar discussions of Henrik Ibsen’s A Doll’s House? How did Oscar Wilde surreptitiously signal his sexuality through a satire of Victorian seriousness in The Importance of Being Earnest? How do contemporary playwrights such as August Wilson or Lynn Nottage bring forgotten moments of African American history to light? This course shows how modern and contemporary theater presents original perspectives on human identities and relationships as well as encourages audiences to see the world in new ways. This course focuses on the close analysis and interpretation of plays written by dramatists from around the world from the late-nineteenth to the twenty-first century. The plays we will study are set in Europe, Great Britain, North America, Africa, and Asia, and we will examine each carefully in light of the unique historical and social contexts in which they were produced, their creation and uses of aesthetic form, and their impact on individuals and communities.Through the course, you will become familiar with such dramatic forms as the well-made play, modern satire, realism, expressionism, symbolism, epic theater, and absurdism. Each of these is interesting not only as a distinctive mode of artistic  presentation, but also as it offers different perspectives on historical moments and present-day concerns about people and their communities. Theatrical works illustrate how the meanings ascribed to physical bodies are at the heart of social differences such as gender, sexuality, class, race, disability, and national identity. We will look at each play in its original cultural context as well as through the creative lens of more recent productions and assess how both historical and more recent reimagining changes the meaning of the work. We will also make use of the rich theatrical resources and cultural organizations available in communities such as the Twin Cities.",
    "prereq": []
  },
  {
    "uid": "793825",
    "code": "ENGL4311",
    "subject": "ENGL",
    "number": "4311",
    "honors": false,
    "writingIntensive": false,
    "name": "Asian American Lit and Drama",
    "fullname": "Asian American Literature and Drama",
    "info": "Literary/dramatic works by Asian American writers. Historical past of Asian America through perspective of writers such as Sui Sin Far and Carlos Bulosan. Contemporary artists such as Frank Chin, Maxine Hong Kingston, David Henry Hwang, and Han Ong. Political/historical background of Asian American artists, their aesthetic choices.",
    "prereq": []
  },
  {
    "uid": "004319",
    "code": "ENGL4602W",
    "subject": "ENGL",
    "number": "4602",
    "honors": false,
    "writingIntensive": true,
    "name": "Gender and English",
    "fullname": "Gender and the English Language",
    "info": "Connections between gender and other social factors that influence history/future of English language. Race, ethnicity, class, regional/national variation, religion, technology. Gender theories as they relate to social issues, texts, and discourse practices.",
    "prereq": []
  },
  {
    "uid": "004320",
    "code": "ENGL4603W",
    "subject": "ENGL",
    "number": "4603",
    "honors": false,
    "writingIntensive": true,
    "name": "World Englishes",
    "fullname": "World Englishes",
    "info": "Historical background, psychosocial significance, and linguistic characteristics of diverging varieties of English spoken around world, especially in postcolonial contexts (Caribbean, Africa, Asia). Development of local standards/vernaculars. Sociolinguistic methods of analysis.",
    "prereq": []
  },
  {
    "uid": "004322",
    "code": "ENGL4605",
    "subject": "ENGL",
    "number": "4605",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Var Am Engl",
    "fullname": "Social Variation in American English",
    "info": "Description/analysis of English language variation from sociohistorical perspective in the United States and the Caribbean. Social history of migrations (voluntary, enforced) leading to development of regional/rural dialects, pidgins, creoles, and urban varieties.",
    "prereq": []
  },
  {
    "uid": "793696",
    "code": "ENGL4612",
    "subject": "ENGL",
    "number": "4612",
    "honors": false,
    "writingIntensive": false,
    "name": "Old English I",
    "fullname": "Old English I",
    "info": "\"I am learning Anglo-Saxon and it is a vastly superior thing to what we have now\" (Gerard Manley Hopkins, letter to fellow poet Robert Bridges, 1882).  This course is an introduction to the rich language and literature of Anglo-Saxon England (ca. 500-1100).  \"Old English,\" or as it is sometimes known, \"Anglo-Saxon,\" is the earliest form of the English language; therefore, the primary course goal will be to acquire the ability to read Old English texts in the original.  No previous experience with Old English or any other language is necessary or expected; undergraduates and graduate students from all departments are welcome.  For graduate students in English, Old English I may count for the rhetoric/language/literacy distribution area. This course also fulfills the literary theory/linguistic requirement for the undergraduate English major. A knowledge of Old English will allow you to touch the most ancient literary sensibilities in the English tradition; these sensibilities are familiar and strange at the same time, as we sense our deep cultural connection to these texts across the centuries, yet also find that the past is a strange place indeed.  The power of Old English literature has profoundly influenced authors such as Tennyson, Pound, Graves, Wilbur, Hopkins, Gunn, Auden, Seamus Heaney, C.S. Lewis, and of course, J.R.R. Tolkien.",
    "prereq": []
  },
  {
    "uid": "007458",
    "code": "ENGL4613",
    "subject": "ENGL",
    "number": "4613",
    "honors": false,
    "writingIntensive": false,
    "name": "Old English II",
    "fullname": "Old English II",
    "info": "The second semester of Old English is devoted to a full translation and study of the great Anglo-Saxon epic \"Beowulf.\" J.R.R. Tolkien wrote of the poem that \"its maker was telling of things already old and weighted with regret, and he expended his art in making keen that touch upon the heart which sorrows have that are both poignant and remote.\" \"Beowulf\" is an exciting tale of strife and heroism; but it is also a subtle meditation upon the character of humanity as it struggles to understand the hazards of a harsh world, the inscrutability of fate, and the nature of history itself. \"Beowulf\" is not only important for a detailed understanding of Anglo-Saxon culture, but it is also a significant and moving poetic achievement in the context of world literature. We will read and translate the poem in the original Old English; thus ENGL 4612 (or a similar course resulting in a basic reading knowledge of Old English) is a prerequisite. \"Beowulf\" has been the object of intensive scholarly study; we will delve into the debates over the poem's date, genesis, manuscript and historical context and critical interpretation. Spending an entire semester studying one complex work can be an invaluable experience. Please contact the instructor for any questions concerning the prerequisite.",
    "prereq": []
  },
  {
    "uid": "004325",
    "code": "ENGL4721",
    "subject": "ENGL",
    "number": "4721",
    "honors": false,
    "writingIntensive": false,
    "name": "Electronic Text",
    "fullname": "Electronic Text",
    "info": "Status/function of text, related questions as framed by electronic text.",
    "prereq": []
  },
  {
    "uid": "006934",
    "code": "ENGL4722",
    "subject": "ENGL",
    "number": "4722",
    "honors": false,
    "writingIntensive": false,
    "name": "Alpha to Internet:Technologies",
    "fullname": "Alphabet to Internet: History of Writing Technologies",
    "info": "Equivocal relation of memory and writing. Literacy, power, control. Secrecy and publicity. Alphabetization and other ways of ordering world. Material bases of writing. Typographical design/expression. Theories of technological determinism.",
    "prereq": []
  },
  {
    "uid": "794371",
    "code": "ENGL4752",
    "subject": "ENGL",
    "number": "4752",
    "honors": false,
    "writingIntensive": false,
    "name": "Tutoring Writing",
    "fullname": "Seminar: Theory and Practice of Tutoring Writing",
    "info": "Teaching writing through one-on-one tutorials. How writers learn to write. How writing is taught in the academy. How rhetorical conventions and views of literacy vary across disciplines. Students practice tutoring strategies in class activities and in a writing center.",
    "prereq": []
  },
  {
    "uid": "004413",
    "code": "ENGL5001",
    "subject": "ENGL",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD Colloquium",
    "fullname": "Ph.D. Colloquium: Introduction to Literary Theory and Literary Studies in the Modern University",
    "info": "Where and what is literary study vis-a-vis the history of the discipline, of the humanities, and of the university--all in the context of a graduate education. Literary theory focusing on key theoretical works that address the discipline, the humanities, and the university. Prerequisite: English grad student ",
    "prereq": []
  },
  {
    "uid": "004415",
    "code": "ENGL5002",
    "subject": "ENGL",
    "number": "5002",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Theory",
    "fullname": "Introduction to Literary and Cultural Theory",
    "info": "Approaches to practical/theoretical problems of literary history/genre.",
    "prereq": []
  },
  {
    "uid": "802529",
    "code": "ENGL5020",
    "subject": "ENGL",
    "number": "5020",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies in Narrative",
    "fullname": "Studies in Narrative",
    "info": "Examine issues related to reading and understanding narrative in a variety of interpretive contexts. Topics may include \"The 19th-century English (American, Anglophone) Novel,\" \"Introduction to Narrative,\" or \"Techniques of the Novel.\" Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "802449",
    "code": "ENGL5021",
    "subject": "ENGL",
    "number": "5021",
    "honors": false,
    "writingIntensive": false,
    "name": "Captivity in Lit and Film",
    "fullname": "Captivity in Literature and Film: From the Barbary Coast to Guantanamo Bay",
    "info": "Whether there is a captivity genre in English/Global literature, from early modern period to 21st century. Texts/films from numerous civilizations/histories.",
    "prereq": []
  },
  {
    "uid": "004560",
    "code": "ENGL5030",
    "subject": "ENGL",
    "number": "5030",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Drama",
    "fullname": "Readings in Drama",
    "info": "Wide reading in literature of a given period or subject. Prepares students for work in other courses/seminars. Relevant scholarship/criticism. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "803191",
    "code": "ENGL5040",
    "subject": "ENGL",
    "number": "5040",
    "honors": false,
    "writingIntensive": false,
    "name": "Theories of Film",
    "fullname": "Theories of Film",
    "info": "Advanced topics regarding film in a variety of interpretive contexts, from the range and historic development of American, English, and Anglophone film (e.g., \"Fascism and Film,\" \"Queer Cinemas\"). Topics and viewing times announced in Class Schedule.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "793900",
    "code": "ENGL5090",
    "subject": "ENGL",
    "number": "5090",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Special Subjects",
    "fullname": "Readings in Special Subjects",
    "info": "General background preparation for advanced study. Diverse selection of literatures written in English, usually bridging national cultures and time periods. Readings specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "790019",
    "code": "ENGL5100",
    "subject": "ENGL",
    "number": "5100",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Special Subjects",
    "fullname": "Readings in Special Subjects",
    "info": "General background preparation for advanced study. Diverse selection of literatures written in English, usually bridging national cultures and time periods. Readings specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004552",
    "code": "ENGL5110",
    "subject": "ENGL",
    "number": "5110",
    "honors": false,
    "writingIntensive": false,
    "name": "Medieval Lit & Cultures",
    "fullname": "Medieval Literatures and Cultures: Intro to Medieval Studies",
    "info": "Major and representative works of the Middle Ages. Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004244",
    "code": "ENGL5121",
    "subject": "ENGL",
    "number": "5121",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Early Mod Lit",
    "fullname": "Readings in Early Modern Literature and Culture",
    "info": "Topical readings in early modern poetry, prose, fiction, and drama. Attention to relevant scholarship or criticism. Preparation for work in other courses or seminars.\n\nprereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "795816",
    "code": "ENGL5140",
    "subject": "ENGL",
    "number": "5140",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Eighteenth-Century",
    "fullname": "Readings in 18th Century Literature and Culture",
    "info": "Literature written in English, 1660-1798. Topics may include British literature of Reformation and 18th century, 18-century American literature, a genre (e.g., 18th-century novel).prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "004248",
    "code": "ENGL5150",
    "subject": "ENGL",
    "number": "5150",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in 19th Cent Lit Cltr",
    "fullname": "Readings in 19th-Century Literature and Culture",
    "info": "Topics may include British Romantic or Victorian literatures, American literature, important writers from a particular literary school, a genre (e.g., the novel). Readings.",
    "prereq": []
  },
  {
    "uid": "004259",
    "code": "ENGL5170",
    "subject": "ENGL",
    "number": "5170",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in 20th Cent Lit/Cltr",
    "fullname": "Readings in 20th-Century Literature and Culture",
    "info": "British, Irish, or American literatures, or topics involving literatures of two nations. Focuses either on a few important writers from a particular literary school or on a genre (e.g., drama). Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "797286",
    "code": "ENGL5175",
    "subject": "ENGL",
    "number": "5175",
    "honors": false,
    "writingIntensive": false,
    "name": "20th-Cen British Lit & Cult I",
    "fullname": "20th-Century British Literatures and Cultures I",
    "info": "Principal writers, intellectual currents, conventions, genres, and themes in Britain/Ireland, 1900-45. Fiction/nonfiction by Conrad, Richardson, Forster, Joyce, Mansfield, Rhys, West, Woolf, Lawrence and Huxley. Poetry by Hardy, Hopkins, Loy, H.D., Yeats, Pound and Eliot. Drama by Synge and Shaw.",
    "prereq": []
  },
  {
    "uid": "797287",
    "code": "ENGL5176",
    "subject": "ENGL",
    "number": "5176",
    "honors": false,
    "writingIntensive": false,
    "name": "20th-Cen British Lit & Cult II",
    "fullname": "20th-Century British Literatures and Cultures II",
    "info": "Principal writers, intellectual currents, conventions, genres, and themes in Britain/Ireland, 1945-99. Fiction/nonfiction by Greene, Bowen, Amis, Fowles, Lessing, Drabble, Murdoch, Naipaul, Carter, Rushdie, and Winterson. Poetry by Smith, Auden, Thomas, Larkin, Hughes, Heaney, Smith, Boland, and Walcott. Drama by Beckett, Pinter, Shaffer, Stoppard, Devlin, Friel, and Carr.",
    "prereq": []
  },
  {
    "uid": "005126",
    "code": "ENGL5180",
    "subject": "ENGL",
    "number": "5180",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Contemp Lit Cltr",
    "fullname": "Readings in Contemporary Literature and Culture",
    "info": "Multi-genre reading in contemporary American, British, Anglophone literature. Relevant scholarship/criticism. Topics vary. See Class Schedule.",
    "prereq": []
  },
  {
    "uid": "009112",
    "code": "ENGL5200",
    "subject": "ENGL",
    "number": "5200",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in American",
    "fullname": "Readings in American Literature",
    "info": "General background/preparation for advanced graduate study. Readings cover either a wide historical range (e.g., 19th century), a genre (e.g., the novel), or a major literary movement (e.g., modernism).",
    "prereq": []
  },
  {
    "uid": "004243",
    "code": "ENGL5300",
    "subject": "ENGL",
    "number": "5300",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings American Minority Lit",
    "fullname": "Readings in American Minority Literature",
    "info": "Contextual readings of 19th-/20th-century American minority writers. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004555",
    "code": "ENGL5400",
    "subject": "ENGL",
    "number": "5400",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Post-Colonial",
    "fullname": "Readings in Post-Colonial Literature",
    "info": "Selected readings in post-colonial literature. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "815476",
    "code": "ENGL5501",
    "subject": "ENGL",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Origins of Cultural Studies",
    "fullname": "Origins of Cultural Studies",
    "info": "Intellectual map of the creation of cultural studies as a unique approach to studying social meanings. Key figures and concepts, including nineteenth- and early twentieth century precursors.",
    "prereq": []
  },
  {
    "uid": "004556",
    "code": "ENGL5510",
    "subject": "ENGL",
    "number": "5510",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Criticism & Theory",
    "fullname": "Readings in Criticism and Theory",
    "info": "Major works of classical criticism in the English critical tradition from Renaissance to 1920. Leading theories of criticism from 1920 to present. Theories of fiction, narratology. Feminist criticisms. Marxist criticisms. Psychoanalytic criticisms. Theories of postmodernism.",
    "prereq": []
  },
  {
    "uid": "004656",
    "code": "ENGL5581",
    "subject": "ENGL",
    "number": "5581",
    "honors": false,
    "writingIntensive": false,
    "name": "Folklore I",
    "fullname": "Folklore I",
    "info": "Folklore genres such as proverbs, oral prose narratives (tales and legends), foodways and games. Manner in which folklore is transmitted and changed with concentration on how folklore functions in literature, the mass media, and everyday life.",
    "prereq": []
  },
  {
    "uid": "004658",
    "code": "ENGL5582",
    "subject": "ENGL",
    "number": "5582",
    "honors": false,
    "writingIntensive": false,
    "name": "Folklore II",
    "fullname": "Folklore II",
    "info": "Training in collection of folklore materials.",
    "prereq": []
  },
  {
    "uid": "791278",
    "code": "ENGL5593",
    "subject": "ENGL",
    "number": "5593",
    "honors": false,
    "writingIntensive": false,
    "name": "The African-American Novel",
    "fullname": "The African-American Novel",
    "info": "Explore African American novelistic traditions. Plot patterns, character types, settings, symbols, themes, mythologies. Creative perspectives of authors themselves. Analytical frameworks from contemporary literary scholarship.",
    "prereq": []
  },
  {
    "uid": "793697",
    "code": "ENGL5597",
    "subject": "ENGL",
    "number": "5597",
    "honors": false,
    "writingIntensive": false,
    "name": "Harlem Renaissance",
    "fullname": "Seminar: Harlem Renaissance",
    "info": "Multidisciplinary review of Jazz Age's Harlem Renaissance: literature, popular culture, visual arts, political journalism, major black/white figures.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007463",
    "code": "ENGL5602",
    "subject": "ENGL",
    "number": "5602",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender and English",
    "fullname": "Gender and the English Language",
    "info": "Introduction to features of English that are gender-marked or gender-biased. Connections between language theory and social structures, including class and ethnicity. Patterns of women's/men's speech in specific social contexts. Gender and writing. Sociolinguistics and sexual orientation.",
    "prereq": []
  },
  {
    "uid": "004373",
    "code": "ENGL5603",
    "subject": "ENGL",
    "number": "5603",
    "honors": false,
    "writingIntensive": false,
    "name": "World Englishes",
    "fullname": "World Englishes",
    "info": "Historical background, psychosocial significance, and linguistic characteristics of diverging varieties of English spoken around world, especially in postcolonial contexts (Caribbean, Africa, Asia). Development of local standards/vernaculars. Sociolinguistic methods of analysis.",
    "prereq": []
  },
  {
    "uid": "008163",
    "code": "ENGL5605",
    "subject": "ENGL",
    "number": "5605",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Var Am Engl",
    "fullname": "Social Variation in American English",
    "info": "Description/analysis of English language variation from sociohistorical perspective in the United States and the Caribbean. Social history of voluntary/enforced migrations leading to development of regional/rural dialects, pidgins, creoles, and urban varieties.",
    "prereq": []
  },
  {
    "uid": "004328",
    "code": "ENGL5611",
    "subject": "ENGL",
    "number": "5611",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist Engl Lang",
    "fullname": "History of the English Language",
    "info": "Development of English language from Old English (mid-5th century) to Middle English (around 1100) to Early Modern English (about 1500).",
    "prereq": []
  },
  {
    "uid": "003170",
    "code": "ENGL5612",
    "subject": "ENGL",
    "number": "5612",
    "honors": false,
    "writingIntensive": false,
    "name": "Old English I",
    "fullname": "Old English I",
    "info": "Introduction to the language through A.D. 1150. Anglo-Saxon culture. Selected readings in prose/poetry.",
    "prereq": []
  },
  {
    "uid": "003171",
    "code": "ENGL5613",
    "subject": "ENGL",
    "number": "5613",
    "honors": false,
    "writingIntensive": false,
    "name": "Old English II",
    "fullname": "Old English II",
    "info": "Critical reading of texts, introduction to versification. Reading of Beowulf.",
    "prereq": []
  },
  {
    "uid": "004662",
    "code": "ENGL5621",
    "subject": "ENGL",
    "number": "5621",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Irish Language I",
    "fullname": "Modern Irish Language I",
    "info": "Grammatical structures of modern Irish dialect of Connemara, Co. Galway. Development of oral/written language skills: vocabulary, manipulation of grammatical structures, speaking, listening, reading, writing. Modern Gaelic culture.",
    "prereq": []
  },
  {
    "uid": "004661",
    "code": "ENGL5622",
    "subject": "ENGL",
    "number": "5622",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Irish Lang II",
    "fullname": "Modern Irish Language II",
    "info": "Grammatical structures of modern Irish dialect. Development of oral/written language skills: vocabulary, manipulation of grammatical structures, speaking, listening, reading, writing. Modern Gaelic culture.",
    "prereq": []
  },
  {
    "uid": "004376",
    "code": "ENGL5630",
    "subject": "ENGL",
    "number": "5630",
    "honors": false,
    "writingIntensive": false,
    "name": "Theories Writ Inst",
    "fullname": "Theories of Writing and Writing Instruction",
    "info": "Introduction to major theories that inform teaching of writing in college and upper-level high school curriculums. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "006940",
    "code": "ENGL5632",
    "subject": "ENGL",
    "number": "5632",
    "honors": false,
    "writingIntensive": false,
    "name": "Electronic Text",
    "fullname": "Electronic Text",
    "info": "Status/function of text in electronic networking. Related questions as reframed by electronic text.",
    "prereq": []
  },
  {
    "uid": "006937",
    "code": "ENGL5640",
    "subject": "ENGL",
    "number": "5640",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in R/C/L",
    "fullname": "Research Methods in Rhetoric, Composition, and Language",
    "info": "Research paradigms, methodologies, and procedures (e.g., ethnographic, case-study, historical, critical, quantitative, text-analytical, survey-based). Emphasizes reading/analyzing existing research studies and preparing original research. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004380",
    "code": "ENGL5690",
    "subject": "ENGL",
    "number": "5690",
    "honors": false,
    "writingIntensive": false,
    "name": "MN Writing Project",
    "fullname": "Minnesota Writing Project: Directed Studies",
    "info": "Workshops. Theories of writing and writing pedagogy. Writing for publication. Research topics in applied literacy.",
    "prereq": []
  },
  {
    "uid": "816001",
    "code": "ENGL5701",
    "subject": "ENGL",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Great River Review",
    "fullname": "Great River Review",
    "info": "Students will be assigned roles, both editorial and managerial, to assist in production of The Great River Review journal. They will explore and present on the history of the small magazine in American literature and meet with Twin Cities publishing professionals.",
    "prereq": []
  },
  {
    "uid": "004966",
    "code": "ENGL5712",
    "subject": "ENGL",
    "number": "5712",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Editing",
    "fullname": "Advanced Editing",
    "info": "Editing long text. Fiction, children's literature, translations, indexes. Workshop/seminar.",
    "prereq": []
  },
  {
    "uid": "006941",
    "code": "ENGL5743",
    "subject": "ENGL",
    "number": "5743",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist Rhet & Writing",
    "fullname": "History of Rhetoric and Writing",
    "info": "Assumptions of classical/contemporary rhetorical theory, especially as they influence interdisciplinary field of composition studies.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "792771",
    "code": "ENGL5757",
    "subject": "ENGL",
    "number": "5757",
    "honors": false,
    "writingIntensive": false,
    "name": "Amer Poet",
    "fullname": "Amer Poet",
    "info": "",
    "prereq": []
  },
  {
    "uid": "004379",
    "code": "ENGL5790",
    "subject": "ENGL",
    "number": "5790",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in R/C/L",
    "fullname": "Topics in Rhetoric, Composition, and Language",
    "info": "Topics specified in Class Schedule.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "005128",
    "code": "ENGL5800",
    "subject": "ENGL",
    "number": "5800",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac Tchg Engl",
    "fullname": "Practicum in the Teaching of English",
    "info": "Discussion of and practice in recitation, lecture, small-groups, tutoring, individual conferences, and evaluation of writing/reading. Emphasizes theory informing effective course design/teaching for different disciplinary goals. Topics vary. See Class Schedule.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "004389",
    "code": "ENGL5805",
    "subject": "ENGL",
    "number": "5805",
    "honors": false,
    "writingIntensive": false,
    "name": "Wrtg for Publication",
    "fullname": "Writing for Publication",
    "info": "Conference presentations, book reviews, revision of seminar papers for journal publication, and preparation of a scholarly monograph. Style, goals, and politics of journal and university press editors/readers. Electronic publication. Professional concerns.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "795037",
    "code": "ENGL5880",
    "subject": "ENGL",
    "number": "5880",
    "honors": false,
    "writingIntensive": false,
    "name": "General Topics",
    "fullname": "General Topics",
    "info": "Topics specified in the Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788428",
    "code": "ENGL5992",
    "subject": "ENGL",
    "number": "5992",
    "honors": false,
    "writingIntensive": false,
    "name": "Direct Reading/Study/Research",
    "fullname": "Directed Readings, Study, or Research",
    "info": "TBDPrereq-Grad student or instr consent.",
    "prereq": []
  },
  {
    "uid": "004831",
    "code": "ENGL8090",
    "subject": "ENGL",
    "number": "8090",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Special Subjects",
    "fullname": "Seminar in Special Subjects",
    "info": "Sample topics: literature of World War II, writings of the Holocaust, literature of English Civil War, advanced versification.",
    "prereq": []
  },
  {
    "uid": "003735",
    "code": "ENGL8110",
    "subject": "ENGL",
    "number": "8110",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Mdvl Lit/Culture",
    "fullname": "Seminar: Medieval Literature and Culture",
    "info": "Sample topics: Chaucer; \"Piers Plowman\"; Middle English literature, 1300-1475; medieval literary theory; literature/class in 14th-century; texts/heresies in late Middle Ages.",
    "prereq": []
  },
  {
    "uid": "003736",
    "code": "ENGL8120",
    "subject": "ENGL",
    "number": "8120",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Early Mod Lit Cltre",
    "fullname": "Seminar in Early Modern Literature and Culture",
    "info": "British writers/topics, from Reformation to French Revolution. In first half of period (which divides at 1640), a typical topic is Spenser and epic tradition; in second half, women historians before Wollstonecraft.",
    "prereq": []
  },
  {
    "uid": "816995",
    "code": "ENGL8140",
    "subject": "ENGL",
    "number": "8140",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in 18-Cent Lit Culture",
    "fullname": "Seminar in 18th Century Literature and Culture",
    "info": "Advanced study of literature written in English, 1660-1798. Topics may include British literature of Reformation and 18th century, 18th-century American literature, a genre (e.g., 18th-century novel).prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "003737",
    "code": "ENGL8150",
    "subject": "ENGL",
    "number": "8150",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Shakespeare",
    "fullname": "Seminar in Shakespeare",
    "info": "Perspectives/works vary with offering and instructor. Recent topics include Global Shakespeare, Shakespearian Comedy, Shakespeare and Performance.",
    "prereq": []
  },
  {
    "uid": "003738",
    "code": "ENGL8170",
    "subject": "ENGL",
    "number": "8170",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in 19th C Brit Lit Clt",
    "fullname": "Seminar in 19th-Century British Literature and Culture",
    "info": "Advanced study in 19th-century British literature/culture. Sample topics: Romantic poetry, Victorian poetry, Englishness in Victorian novel, Victorian cultural criticism, text/image in 19th-century British culture. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "789989",
    "code": "ENGL8180",
    "subject": "ENGL",
    "number": "8180",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in 20th-Cty Brit Lit",
    "fullname": "Seminar in 20th-Century British Literature and Culture",
    "info": "Sample topics: modernism, Bloomsbury Group, working-class/immigrant literature. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "003740",
    "code": "ENGL8190",
    "subject": "ENGL",
    "number": "8190",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in 20ct Anglophone Lit",
    "fullname": "Seminar in 20th-Century Anglophone Literatures and Cultures",
    "info": "Topics in Anglophone literatures of Canada, Africa, the Caribbean, India and Pakistan, and the Pacific. Sample topics: Stuart Hall and Black Britain; Salman Rushdie and cosmopolitan literatures; national literatures and partitioned states. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004261",
    "code": "ENGL8200",
    "subject": "ENGL",
    "number": "8200",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem American Lit",
    "fullname": "Seminar in American Literature",
    "info": "American literary history. Sample topics: first American novels, film, contemporary short stories and poetry, American Renaissance, Cold War fiction, history of the book. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004262",
    "code": "ENGL8290",
    "subject": "ENGL",
    "number": "8290",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Amer Lit",
    "fullname": "Topics, Figures, and Themes in American Literature",
    "info": "Sample topics: Dickinson, 19th-century imperialism, Faulkner, San Francisco poets, humor, Chaplin, Hitchcock, and  popular culture. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004264",
    "code": "ENGL8300",
    "subject": "ENGL",
    "number": "8300",
    "honors": false,
    "writingIntensive": false,
    "name": "American Minority Literature",
    "fullname": "Seminar in American Minority Literature",
    "info": "Sample topics: Harlem Renaissance, ethnic autobiographies, Black Arts movement. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788107",
    "code": "ENGL8333",
    "subject": "ENGL",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "004667",
    "code": "ENGL8400",
    "subject": "ENGL",
    "number": "8400",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Post-Colonial Lit",
    "fullname": "Seminar in Post-Colonial Literature, Culture, and Theory",
    "info": "Sample topics: Marxism and nationalism; modern India; feminism and decolonization; \"the Empire Writes Back\"; Islam and the West. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788344",
    "code": "ENGL8444",
    "subject": "ENGL",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "FTE Doctoral credits",
    "prereq": []
  },
  {
    "uid": "003741",
    "code": "ENGL8510",
    "subject": "ENGL",
    "number": "8510",
    "honors": false,
    "writingIntensive": false,
    "name": "Criticism & Theory",
    "fullname": "Studies in Criticism and Theory",
    "info": "Developments within critical theory that have affected literary criticism, by altering conceptions of its object (\"literature\") or by challenging conceptions of critical practice. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004671",
    "code": "ENGL8520",
    "subject": "ENGL",
    "number": "8520",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Adv Cltl Thry Prctc",
    "fullname": "Seminar: Cultural Theory and Practice",
    "info": "Sample topics: semiotics applied to perspective paintings, numbers, and money; analysis of a particular set of cultural practices by applying various theories to them. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "003742",
    "code": "ENGL8530",
    "subject": "ENGL",
    "number": "8530",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Feminist Crit",
    "fullname": "Seminar in Feminist Criticism",
    "info": "Brief history of feminist criticism, in-depth treatment of contemporary perspectives/issues. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "004382",
    "code": "ENGL8600",
    "subject": "ENGL",
    "number": "8600",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem in Lang, Rhet, Literacy",
    "fullname": "Seminar in Language, Rhetoric, Literacy, and Composition",
    "info": "Students read/conduct research on theories/literature relevant to cross-disciplinary fields committed to writing and to teaching writing.",
    "prereq": []
  },
  {
    "uid": "006948",
    "code": "ENGL8610",
    "subject": "ENGL",
    "number": "8610",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem Lng Dsc Std",
    "fullname": "Seminar in Language and Discourse Studies",
    "info": "Current theoretical/methodological issues in discourse analysis. Social/psychological determinants of language choice (class, ethnicity, gender) in various English-speaking societies. Application to case studies, review of scholarship.",
    "prereq": []
  },
  {
    "uid": "792334",
    "code": "ENGL8625",
    "subject": "ENGL",
    "number": "8625",
    "honors": false,
    "writingIntensive": false,
    "name": "Diss: Book List & Prospectus",
    "fullname": "Dissertation Seminar: Preparing the Book List and Prospectus",
    "info": "Assembling book list, defining field of study, and articulating a rationale for list. How to conceptualize/develop dissertation prospectus. Students work with faculty instructor, advising committee, and peer writing group.prereq: Engl PhD student in [3rd or 4th yr], at least 12 cr completed",
    "prereq": []
  },
  {
    "uid": "801508",
    "code": "ENGL8626",
    "subject": "ENGL",
    "number": "8626",
    "honors": false,
    "writingIntensive": false,
    "name": "Writing the Dissertation",
    "fullname": "Dissertation Seminar: Writing the Dissertation",
    "info": "Conceptualizing dissertation (using model of Graduate School doctoral Dissertation Fellowship application). Producing dissertation draft chapter/proposal. Students work with instructor, advising committees, and peer writing groups.prereq: English PhD student, passed prelim exam",
    "prereq": []
  },
  {
    "uid": "788469",
    "code": "ENGL8666",
    "subject": "ENGL",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral Pre-Thesis Creditsprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "003739",
    "code": "ENGL8780",
    "subject": "ENGL",
    "number": "8780",
    "honors": false,
    "writingIntensive": false,
    "name": "Folklore",
    "fullname": "Folklore",
    "info": "Folklore methodology. Application to topics such as fieldwork in folklore, horror in oral tradition, writing, and film; liminality/tradition; folklore or literatures; folklore of the uncanny; tradition, alterity, and liminality.",
    "prereq": []
  },
  {
    "uid": "787856",
    "code": "ENGL8888",
    "subject": "ENGL",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "004673",
    "code": "ENGL8992",
    "subject": "ENGL",
    "number": "8992",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Readings",
    "fullname": "Directed Reading in Language, Literature, Culture, Rhetoric, Composition, or Creative Writing",
    "info": "Directed Reading in Language, Literature, Culture, Rhetoric, Composition, or Creative Writingprereq: instr consent, dept consent",
    "prereq": []
  }
]