[
  {
    "uid": "815591",
    "code": "ENT1001",
    "subject": "ENT",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "How Insects Shape Society",
    "fullname": "How Insects Shape Society: Pollinators, Pests, and Policy",
    "info": "Do you eat genetically modified foods, or do you avoid them? Vaccinate, or do not vaccinate? Did you know these are in part insect related questions? Insects make up more than half of the living organisms on this planet, and they have had a profound impact in shaping human society and culture. Even so, insects are swatted, stomped, squished, and otherwise misunderstood. In this course students will explore the complex, and often uncomfortable, relationships between insects and humans and explore the ethical dilemmas posed by our close relationships with the insect world. Ultimately this course examines the interactions between insects and humans, focusing on contemporary topics that explore how insects dictate human actions, policies, and behaviors. Topics include: human perception of insects; basic concepts in insect biology and behavior; environmental and cultural importance of insects; the role of insect pests in determining human food choice; insect vectors and disease transmission; perception and awareness about humanity’s role in nature.",
    "prereq": []
  },
  {
    "uid": "817971",
    "code": "ENT1004",
    "subject": "ENT",
    "number": "1004",
    "honors": false,
    "writingIntensive": false,
    "name": "The Insects",
    "fullname": "The Insects",
    "info": "Insects represent one of the most abundant and diverse life forms on Earth, and their environmental importance is displayed across both terrestrial and aquatic ecosystems. Beyond environmental importance, insects shape human society through their impact on our health, the pollination of our food crops, and damage to our commodities and homes. Insect Biology is an introductory entomology course on the biology and ecology of insects, their classification, and their interactions with the environment and human society. This course will provide background on insect diversity and physiology, while providing insight into how scientists examine the roles of insects in medicine, agriculture, advances in genetics, and ecology. These topics will provide fundamental biological knowledge needed to make informed decisions about insect-related topics in a global society.",
    "prereq": []
  },
  {
    "uid": "806252",
    "code": "ENT1005",
    "subject": "ENT",
    "number": "1005",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Biology",
    "fullname": "Insect Biology with Lab",
    "info": "Insects represent one of the most abundant and diverse life forms on Earth, and their environmental importance is displayed across both terrestrial and aquatic ecosystems. Beyond environmental importance, insects shape human society through their impact on our health, the pollination of our food crops, and damage to our commodities and homes. Insect Biology is an introductory entomology course on the biology and ecology of insects, their classification, and their interactions with the environment and human society. This course will provide background on insect diversity and physiology while providing insight into how scientists examine the roles of insects in medicine, agriculture, advances in genetics, and ecology. These topics will provide fundamental biological knowledge needed to make informed decisions about insect-related topics in a global society.",
    "prereq": []
  },
  {
    "uid": "818128",
    "code": "ENT1021",
    "subject": "ENT",
    "number": "1021",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Forensic Entomology",
    "fullname": "An Introduction to Forensic Entomology",
    "info": "What can maggots and beetles collected at a crime scene tell investigators about the body? Often, insect evidence collected at the scene of a crime can help experts make a variety of conclusions, such as time of death and whether or not the body has been moved from the original crime scene. In this seminar, students will explore how insect evidence can be used in various ways in the field of forensic science. This class will discuss the scientific approaches and techniques involved in forensic entomological analysis. Topics will include, but are not limited to, the different insects found in decomposing bodies, how insect development time can be affected by factors like the weather or body placement, and how insect evidence can be useful to both crime scene investigators and medical examiners.",
    "prereq": []
  },
  {
    "uid": "812953",
    "code": "ENT1480",
    "subject": "ENT",
    "number": "1480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Entomology",
    "fullname": "Topics in Entomology",
    "info": "Lectures by a visiting scholar or regular staff member. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "817075",
    "code": "ENT1902",
    "subject": "ENT",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Forensic Entomology",
    "fullname": "Bugs in Bodies: Forensic Entomology",
    "info": "What can maggots and beetles collected at a crime scene tell investigators about the body? Often, insect evidence collected at the scene of a crime can help experts make a variety of conclusions, such as time of death and whether or not the body has been moved from the original crime scene. In this seminar, students will explore how insect evidence can be used in various ways in the field of forensic science. This class will discuss the scientific approaches and techniques involved in forensic entomological analysis. Topics will include, but are not limited to, the different insects found in decomposing bodies, how insect development time can be affected by factors like the weather or body placement, and how insect evidence can be useful to both crime scene investigators and medical examiners.",
    "prereq": []
  },
  {
    "uid": "825087",
    "code": "ENT1903",
    "subject": "ENT",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "Toxin, venom & drugs from bugs",
    "fullname": "Toxins, venoms and drugs from bugs",
    "info": "Insects and other invertebrates represent a rich and relatively unexplored source of bioactive agents that can be developed using modern molecular technologies for potential therapeutic applications. Insect products have been used in medical applications since prehistoric times.  Honey and spider silk have antibiotic properties that facilitate wound healing. Maggot therapy is increasingly used for treatment of intractable wounds. Cordycepin comes from a fungus that infects a caterpillar. Margatoxin, produced by a scorpion, has been patented for its potential to block occlusion of bypass grafts in heart surgery. This course will explore the biological effects and molecular biology of arthropod toxins and venoms with a focus on recent and emerging applications to human therapies.   ",
    "prereq": []
  },
  {
    "uid": "798745",
    "code": "ENT1905",
    "subject": "ENT",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics vary.",
    "prereq": []
  },
  {
    "uid": "818806",
    "code": "ENT1906",
    "subject": "ENT",
    "number": "1906",
    "honors": false,
    "writingIntensive": false,
    "name": "Magnificent, Miniature Minds",
    "fullname": "Magnificent, Miniature Minds: From Dancing Honeybees to Cyborgs",
    "info": "Did you know that honeybees can be trained to recognize human faces or that desert ants can count their steps while walking? Have you ever thought about how an octopus ?knows? how to match its body coloration to its marine environment and a monarch butterfly can find its over-wintering site located thousands of miles away?  These are just a few examples of the extraordinary abilities that invertebrate animals display, reflecting the mighty power of their miniature brains and nervous systems.In this course, we will discuss the fascinating behaviors of animals with miniature brains and how their numerally-limited nervous systems enable them to do what they do.  We will also explore how a deeper understanding of small-brain networks can inform us about how our own brains work, and how such knowledge can be used to engineer adaptive robots, cyborgs and smart machines. This course is designed to be integrative?including disciplines intersecting with animal behavior, entomology, evolution, ecology, neuroscience, psychology and bioengineering.  A major goal of this course is to widen one?s view of the importance of invertebrate animals in the field of neuroscience and gain an appreciation of the translational impact that this knowledge can have and will continue to have on our society and daily lives. Students will also be introduced to basic concepts in neurobiology and learn how small neural networks operate. ",
    "prereq": []
  },
  {
    "uid": "818807",
    "code": "ENT1907",
    "subject": "ENT",
    "number": "1907",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Warriors",
    "fullname": "Insect Warriors",
    "info": "Who are the most dangerous warriors on the planet? Who are the strongest and fastest athletes in the world? Who fought in a battle that involved billions of participants and left millions dead each month? And who is responsible for the most damaging biological warfare attack in history? The answer is around us every day, and beneath our very feet - INSECTS! Insects and their relatives have been on planet earth for millions of years, and have evolved an amazing range of weapons and strategies for combating their enemies, defending territories, fighting for mates, and guarding their offspring. Using incredible endurance, strength, and cooperation, insects provide an ideal template for warriors. From stag beetles dueling for mates to supercolonies of Argentine ants warring across California, insects truly are impressive combatants and athletes.But more than just fighting each other, insects have also been made into weapons. Throughout history, insects have been used in human warfare to frighten, incapacitate, and sometimes outright destroy armies or populations. During the crusades, beehives thrown over the walls of a city helped lead to a crucial victory, and in the midst of World War II, the Empire of Japan covertly bred millions of insects to spread epidemics amongst their enemies. And in a secret project code named “Operation Big Itch”, the United States prepared to do the same during the Cold War. In this course you will learn how and why insects have evolved to be such formidable warriors, and the ways in which they have been used and will continue to be used as weapons of war. From robotic bee spies to termites with a glue gun for a head, insects truly are the most formidable warriors in the world, whether they fight each other, or fight us. ",
    "prereq": []
  },
  {
    "uid": "819924",
    "code": "ENT1908",
    "subject": "ENT",
    "number": "1908",
    "honors": false,
    "writingIntensive": false,
    "name": "Designer Insects",
    "fullname": "Designer Insects: glowing eyes to self-destructing flies",
    "info": "Scientific advances have allowed researchers to “design” organisms through genetic engineering. But what does it mean if an organism has been engineered? While genetic engineering has been fundamental to biological research for decades, it is now making headlines as genetic approaches appear more and more in our everyday lives. Insect pests are one of the major threats to humans as they eat our food, eat our homes, eat us, transmit diseases, and wreak havoc on crops. Increasingly so, cleverly designed genetic engineering approaches are used to stop these insect pests and the diseases they transmit, including Zika and Dengue. In this course, we will explore how insects affect so many aspects of our life, how researchers are using genetic engineering to solve insect issues, and the pros and cons of designing genetically engineered insects. The course will include interactive lectures, short readings and videos, and a variety of discussions with other students and faculty.",
    "prereq": []
  },
  {
    "uid": "820207",
    "code": "ENT1909",
    "subject": "ENT",
    "number": "1909",
    "honors": false,
    "writingIntensive": false,
    "name": "Got Bees?",
    "fullname": "Got Bees? Declines and Conservation of Honey bees and Native bees",
    "info": "Humans are largely aware that bees are declining globally, due in large part to human land use, agricultural practices, and the changing climate. The loss of insect pollinators, including native and honeybees, presents a grand challenge that will have cascading effects throughout ecological systems and human food crop systems. Preservation of pollination services is not only an environmental issue, it is also an important challenge facing our society and world. How we, as a society, choose to address this problem will reflect on how we value the environment and the services it provides. This course is designed to reflect on the shared sense of responsibility for building a community that will address this issue.Intended audience:  Undergraduates who may or may not be majoring within the sciences. Students interested in how humans interact with the environment, and how the choices we make as a society impact environmental processes. No prerequisite courses required.",
    "prereq": []
  },
  {
    "uid": "826313",
    "code": "ENT2575",
    "subject": "ENT",
    "number": "2575",
    "honors": false,
    "writingIntensive": false,
    "name": "Miniature livestock:  Insects",
    "fullname": "Miniature livestock:  Insects in commerce, trade, and biotechnology",
    "info": "A surprising number of insects and their relatives contribute to human happiness and well-being; some, like the commercial silkmoth, have been domesticated by humans for thousands of years. Managed insects and their products, such as silks and dyes, have taken their place in world trade; some insects continue to provide high quality products, and are finding new applications through developments in biotechnology and medicine.  Still others are emerging sources of new molecules with therapeutic value. Insect products are used in cosmetics and confectionaries; without a small poorly-known fly, we would not have chocolate. Use of honeybees for pollination on a commercial scale is well-known.  On a smaller scale, insects are produced commercially as biological control agents, and genetically manipulated insects contribute to control of human diseases.  Some species provide food for humans; many more provide food for the pet industry.  Others delight us in butterfly gardens, where easily reared species, some exotic, are released in enclosures.  This course will explore the biology of domesticated insects maintained in managed environments, with emphasis on species that have been cultured by humans for commercial products, pest control, and potential genetic engineering to reduce vector-borne disease.  These are the miniature livestock of this course.",
    "prereq": []
  },
  {
    "uid": "818995",
    "code": "ENT2884",
    "subject": "ENT",
    "number": "2884",
    "honors": false,
    "writingIntensive": false,
    "name": "Six-legged Conquerors",
    "fullname": "The Six-legged Conquerors: How insects have shaped human history",
    "info": "Insects have had an immense yet underappreciated impact on the course of human history and civilization.  Through their effects as carriers of disease, insects have decided the outcomes of numerous battles and wars, often causing many more deaths than weapons did.  On the other hand, beneficial insects have made important contributions to the development of many industries, in particular related to textiles and agriculture, and they also serve as important sources of food in many cultures.  Because of their varied and important roles in human life and well-being, insects feature prominently in sacred texts and have thus influenced spiritual and religious thought through the ages.  And from Greek times until the present, insects have contributed greatly to the development of scientific thought.  Many of the great naturalists throughout history – from Aristotle to Darwin to EO Wilson – have had an inordinate fascination with insects.  In the second half of the 20th century and beyond, insects sparked the environmental movement, serve as models for innovating technologies such as robots, and continue to shape our lives in fascinating, challenging and novel ways.  In this class we will discuss the major ways in which the fates of humans and insects have been intertwined over the course of human history.  Throughout the class we focus on ways that historical inquiry can be used to elucidate entomological questions and, conversely, how entomological knowledge can be brought to bear to solve historical mysteries.",
    "prereq": []
  },
  {
    "uid": "818094",
    "code": "ENT2920",
    "subject": "ENT",
    "number": "2920",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Lectures in Entomology",
    "fullname": "Introductory Lectures in Entomology",
    "info": "Introductory lectures or labs in special fields of entomological research. Given by visiting scholar or regular staff member.",
    "prereq": []
  },
  {
    "uid": "009395",
    "code": "ENT3001",
    "subject": "ENT",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Insects/Insect Management",
    "fullname": "Insects and Insect Management",
    "info": "Principal orders of insects/arachnids. Introduction to structure, physiology, population dynamics, and management. Lecture/lab. Meets in weeks 1-4.",
    "prereq": []
  },
  {
    "uid": "005500",
    "code": "ENT3005",
    "subject": "ENT",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Biology",
    "fullname": "Insect Biology",
    "info": "Diverse biology of insects and their arthropod relatives. Insect behavior (including social insects), pollination, herbivory, insects as disease vectors, beneficial insects, insect population dynamics/ecology. Insects' role in natural, agricultural, and urban, systems. Lecture/lab.",
    "prereq": []
  },
  {
    "uid": "820082",
    "code": "ENT3021",
    "subject": "ENT",
    "number": "3021",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Biodiversity&Evolution",
    "fullname": "Insect Biodiversity and Evolution",
    "info": "Insects are the most diverse group of organisms on Earth with almost 1 million described species. Millions more remain to be described, especially in tropical regions of the world. Insects come in a remarkable array of sizes, colors, and shapes. Taxonomists use this morphological complexity as the primary means of identifying insects but also for inferring evolutionary relationships. In this course, we will learn how to identify insects, explore methods of collection and curation of insects, discuss their evolutionary relationships, see how insects fit in the natural world, and discuss exciting new efforts to inventory, describe, and conserve the remarkable diversity of insects.",
    "prereq": []
  },
  {
    "uid": "826388",
    "code": "ENT3025",
    "subject": "ENT",
    "number": "3025",
    "honors": false,
    "writingIntensive": false,
    "name": "Pesticides:Miracle or Nightmar",
    "fullname": "Pesticides: Miracle Products or Technological Nightmares?",
    "info": "The world has been in conflict long before human society evolved, as some organisms develop chemical defensive measures to create growing space or avoid becoming prey. As tool users, humans begin to use variety of chemicals for their own benefit, resulting in pesticides to protect to crops, human health, and items of value. However, with the development of pesticides, problems begin to “crop-up”, be it environmental or human health. Over the years, problems encountered with pesticide use and the continued development of pesticides has resulted in a complex mixture of environmental activism, legislation, pesticide science and product development, and societal worry. There are hundreds of reasons for using pesticides and there are hundreds of reasons for not using pesticides. Following historical development of pesticides and the drivers of such development, not to mention the problems created, students can begin to understand pesticides as a complex technological and environmental issue that has implications for future societal sustainability as the human population exceeds 8 billion people. No required prerequisites.",
    "prereq": []
  },
  {
    "uid": "818948",
    "code": "ENT3211",
    "subject": "ENT",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Pest Management",
    "fullname": "Insect Pest Management",
    "info": "Management of Insect Pests is designed for upper division undergraduates in any major or minor. The course will emphasize principles of insect pest management and draw from examples related to agricultural, horticultural and landscape and urban systems. Conventional (nonorganic) and organic approaches, the use of social media and modern technology, and economic, environmental and social consequences of diverse tactics (chemical, cultural, biological, genetic, etc.) will be covered by the Instructor and, on occasion, by guest lecturers. Student debates on pesticide-pollinator and genetic engineering issues will provide real-world context and insights on complexities of insect pest prevention and management.",
    "prereq": []
  },
  {
    "uid": "818965",
    "code": "ENT3275",
    "subject": "ENT",
    "number": "3275",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect-transmitted diseases",
    "fullname": "Insect-transmitted diseases of humans",
    "info": "What’s so attractive about human blood? How have human interactions with insects evolved? Insects and ticks transmit viral, bacterial, protozoan, and filarial diseases to humans, particularly in tropical countries.  Zika, most recently, and also dengue and other mosquito-borne viruses pose an emerging challenge in the southern US as climate change increases the range of important vector species. Lyme disease and other tick-borne diseases are increasing in the US and pose challenges in diagnosis and treatment. This course covers contemporary topics in \"Medical Entomology\" that will provide an overview of arthropod-borne disease and its impacts on global health from the perspective of insect vectors and microbial pathogens. Students will explore historical, contemporary, and epidemiologic stories demonstrating exposure and control strategies via lecture, student discussions, laboratory demonstrations, and critical review of current best practices in medical entomology. This course is designed for upper division undergraduate and graduate students in any major or minor.",
    "prereq": []
  },
  {
    "uid": "005505",
    "code": "ENT3281",
    "subject": "ENT",
    "number": "3281",
    "honors": false,
    "writingIntensive": false,
    "name": "Veterinary Entomology",
    "fullname": "Veterinary Entomology",
    "info": "Biology/management of insects, mites, ticks that affect livestock, poultry, companion animals. Emphasizes problem identification/solving. Lecture, lab.",
    "prereq": []
  },
  {
    "uid": "818397",
    "code": "ENT3294",
    "subject": "ENT",
    "number": "3294",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research Entomology",
    "fullname": "Directed Research in Entomology",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research course will be required to use the University-wide online directed research contract process in order to enroll. prereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "820305",
    "code": "ENT3341",
    "subject": "ENT",
    "number": "3341",
    "honors": false,
    "writingIntensive": false,
    "name": "Biological Control",
    "fullname": "Biological control of insect pests and weeds",
    "info": "Biological control is the suppression of pests and weeds using living organisms.  It involves fascinating interactions between organisms such as plants and herbivores, and insects and the predators and parasitoids that attack them.  These interactions can provide spectacular protection from invasive species but risks to the environment are possible as well so biological control interventions must be undertaken with great care.  We will explore these interactions and interventions in depth in this class. ",
    "prereq": []
  },
  {
    "uid": "818095",
    "code": "ENT3910",
    "subject": "ENT",
    "number": "3910",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Research in Ento",
    "fullname": "Introduction to Research in Entomology",
    "info": "This course will provide the framework for offering field, lab, or library-based entomological research under the supervision of faculty or graduate-faculty staff in the Department of Entomology. It is anticipated that this course will provide hands-on experiences, and that the research focus will generally be aligned with the research specialization of the instructor.",
    "prereq": []
  },
  {
    "uid": "796224",
    "code": "ENT3925",
    "subject": "ENT",
    "number": "3925",
    "honors": false,
    "writingIntensive": false,
    "name": "Insects, Aquat Hab & Pollution",
    "fullname": "Insects, Aquatic Habitats, and Pollution",
    "info": "Effects differing classes of pollutants have on insects that are aquatic. Insect life-cycle dynamics, trophic guilds, community structure. Hypotheses to explain community structure in streams, rivers, wetlands, ponds, lakes, reservoirs. Organic pollution, eutrophication, heavy metal pollution, runoff/siltation, acidification, thermal pollution. Changes in aquatic insect community structure. Designing/maintaining biological monitoring networks.prereq: [[3005 or Biol 3407 or FW 2001], [jr or sr]] or instr consent",
    "prereq": {
      "or": [
        {
          "code": "ENT 3005",
          "subject": "ENT",
          "id": "3005"
        },
        {
          "code": "BIOL 3407",
          "subject": "BIOL",
          "id": "3407"
        },
        {
          "code": "FW 2001",
          "subject": "FW",
          "id": "2001"
        }
      ]
    }
  },
  {
    "uid": "825344",
    "code": "ENT3927",
    "subject": "ENT",
    "number": "3927",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Management for Biologists",
    "fullname": "Data Management for Biologists",
    "info": "This course is focused on providing hands-on experience in organizing, managing, curating, and accessing data. Students will encounter the data life cycle from generation to preservation. Students will be expected to complete assignments using their own data or other available datasets. It is a topic-driven weekly seminar (12 sessions at ~2h each), combining small amounts of lecture with problem solving and hands-on exercises. The course is taught for the requisite number of hours for a 2-credit, semester long course. For each week we will have short lectures followed by hands-on activities. The longer course sessions (~120 minutes per week in class vs. 100 minutes) also allow the course to end two weeks early so students can begin or prepare for their field seasons if necessary. ",
    "prereq": []
  },
  {
    "uid": "814045",
    "code": "ENT4001",
    "subject": "ENT",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Agroecology and Insect Pests",
    "fullname": "Agroecology and Insect Pests",
    "info": "This is a fully online 3 credit course. Through lectures, readings, and discussion, students will gain understanding of the ecological basis of various pest management tactics and learn to evaluate the biological and economic sustainability of pest management systems. prerec: General Biology (BIOL 1009) or equivalent. A course or experience in insect biology will be useful but is not required.",
    "prereq": []
  },
  {
    "uid": "005501",
    "code": "ENT4005",
    "subject": "ENT",
    "number": "4005",
    "honors": false,
    "writingIntensive": false,
    "name": "Economic Entomology",
    "fullname": "Economic Entomology",
    "info": "Management of insect populations. Life histories. Habits/recognition of insect pests of field/vegetable crops. Lecture/lab.",
    "prereq": []
  },
  {
    "uid": "015560",
    "code": "ENT4015",
    "subject": "ENT",
    "number": "4015",
    "honors": false,
    "writingIntensive": false,
    "name": "Ornamentals & Turf Entomolgy",
    "fullname": "Ornamentals and Turf Entomolgy",
    "info": "Diagnosis and management of insect pests in landscape plants. Emphasis on the principles of biological control, biorational pesticides, and integrated pest management.prereq: 1xxx course in biol or hort or forest resources",
    "prereq": []
  },
  {
    "uid": "005499",
    "code": "ENT4021",
    "subject": "ENT",
    "number": "4021",
    "honors": false,
    "writingIntensive": false,
    "name": "Honey Bees & Insect Societies",
    "fullname": "Honey Bees and Insect Societies",
    "info": "Natural history, identification, and behavior of honey bees and other social insects. Evolution of social behavior, pheromones and communication, organization and division of labor, social parasitism. Lab with honey bee management and maintenance of other social bees for pollination.prereq: Biol 1009 or instr consent",
    "prereq": {
      "code": "BIOL 1009",
      "subject": "BIOL",
      "id": "1009"
    }
  },
  {
    "uid": "009506",
    "code": "ENT4022",
    "subject": "ENT",
    "number": "4022",
    "honors": false,
    "writingIntensive": false,
    "name": "Honey Bee Management",
    "fullname": "Honey Bee Management",
    "info": "Field course for students interested in honey bee management and the conservation and maintenance of other bee pollinators. Work with live bee colonies and participate in field research problems related to honey bee behavior and management.prereq: Biol 1009 or instr consent; concurrent registration is required (or allowed) in  4021 recommended",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "ENT 4021",
          "subject": "ENT",
          "id": "4021"
        }
      ]
    }
  },
  {
    "uid": "007014",
    "code": "ENT4096",
    "subject": "ENT",
    "number": "4096",
    "honors": false,
    "writingIntensive": false,
    "name": "PEP: Internship",
    "fullname": "Professional Experience Program: Internship",
    "info": "Professional experience in entomology firms or government agencies through supervised practical experience; evaluative reports and consultations with faculty advisers and employers.prereq: COAFES jr or sr, complete internship contract available in COAFES Career Services before enrolling, UC only, instr consent",
    "prereq": []
  },
  {
    "uid": "791018",
    "code": "ENT4231",
    "subject": "ENT",
    "number": "4231",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Behavior",
    "fullname": "Insect Behavior",
    "info": "Diversity of behavior in insects. Modes of perception, ways in which stimuli are translated into behavior. Genetic basis of behavior. Behavioral traits with Mendelian and more complex modes of inheritance. Natural history of insect behavior. Emphasizes how evolution has shaped diversity of behaviors. Movement/dispersal, feeding, defense/escape, mating/reproduction, sociality.  Case studies.prereq: Biol 1009 or equiv or instr consent; [3005 or EEB 3111] recommended",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "or": [
            {
              "code": "ENT 3005",
              "subject": "ENT",
              "id": "3005"
            },
            {
              "code": "EEB 3111",
              "subject": "EEB",
              "id": "3111"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "005495",
    "code": "ENT4251",
    "subject": "ENT",
    "number": "4251",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest/Shade Tree Entomology",
    "fullname": "Forest and Shade Tree Entomology",
    "info": "Biology, ecology, population management of forest/shade tree insects. Emphasizes predisposing factors/integrated management. Lecture/lab.",
    "prereq": []
  },
  {
    "uid": "005490",
    "code": "ENT4361",
    "subject": "ENT",
    "number": "4361",
    "honors": false,
    "writingIntensive": false,
    "name": "Aquatic Insects",
    "fullname": "Aquatic Insects",
    "info": "Introduction to the classification, ecology, and identification of insects that are dependent on aquatic habitats during portions of their life cycle. The goal of the course is to provide the student with essential technical skills to perform research, using field and laboratory methods, on insect communities in aquatic ecosystems. Students will develop skills to identify insects to family without reference to taxonomic keys as a way to successfully pass the Family-Level Proficiency Certification administered by the Society for Freshwater Sciences. prereq: ENT 1005 or BIOL 1009 or Instructor consent",
    "prereq": {
      "or": [
        {
          "code": "ENT 1005",
          "subject": "ENT",
          "id": "1005"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        }
      ]
    }
  },
  {
    "uid": "802079",
    "code": "ENT4861",
    "subject": "ENT",
    "number": "4861",
    "honors": false,
    "writingIntensive": false,
    "name": "Aquatic Insects",
    "fullname": "Aquatic Insects",
    "info": "Taxonomy/natural history of aquatic insects. Their importance in aquatic ecology, water resource management, recreation, and conservation. Family-level identification of immatures/adults. Field trips to local aquatic habitats. A collection is required.",
    "prereq": []
  },
  {
    "uid": "825274",
    "code": "ENT5001",
    "subject": "ENT",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Entomology Orientation",
    "fullname": "Entomology Orientation",
    "info": "Class will comprise short lectures and visits to laboratories for first-hand exposure to entomological research at the University of Minnesota. Lectures will represent different research areas related to basic and applied entomology. Students will acquire an understanding of the diversity and significance of different areas of entomological research at the University of Minnesota. Students will also learn about techniques used by entomologists for answering questions related to insects and their associations with humans and the environment.",
    "prereq": []
  },
  {
    "uid": "804541",
    "code": "ENT5009",
    "subject": "ENT",
    "number": "5009",
    "honors": false,
    "writingIntensive": false,
    "name": "Pest in Hort: Use and Abuse",
    "fullname": "Pesticides in Horticulture: Their Use and Abuse",
    "info": "History of pesticide use. Case studies on specific pesticide issues, such as DDT, atrazine, Temik, and imidacloprid. Pesticides use, application methods, environmental concerns. Training for pesticide certification license for Minnesota. Test given near campus during course.prereq: [[4015 or 4251], PlPA 2001] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "ENT 4015",
              "subject": "ENT",
              "id": "4015"
            },
            {
              "code": "ENT 4251",
              "subject": "ENT",
              "id": "4251"
            }
          ]
        },
        {
          "code": "PLPA 2001",
          "subject": "PLPA",
          "id": "2001"
        }
      ]
    }
  },
  {
    "uid": "005503",
    "code": "ENT5011",
    "subject": "ENT",
    "number": "5011",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Structure & Function",
    "fullname": "Insect Structure and Function",
    "info": "Comparative study of insect structures/functions from evolutionary perspective. Introduction to physiology of digestion, respiration, and other organ systems.This course presumes previous courses in basic cell biology,  evolution, and genetics.",
    "prereq": []
  },
  {
    "uid": "005222",
    "code": "ENT5021",
    "subject": "ENT",
    "number": "5021",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Biodiversity & Evol.",
    "fullname": "Insect Biodiversity and Evolution",
    "info": "Insects are the most diverse group of organisms on Earth with almost 1 million described species. Millions more remain to be described, especially in tropical regions of the world. Insects come in a remarkable array of sizes, colors, and shapes. Taxonomists use this morphological complexity as the primary means of identifying insects but also for inferring evolutionary relationships. In this course, we will learn how to identify insects, explore methods of collection and curation of insects, discuss their evolutionary relationships, see how insects fit in the natural world, and discuss exciting new efforts to inventory, describe, and conserve the remarkable diversity of insects.",
    "prereq": []
  },
  {
    "uid": "809887",
    "code": "ENT5025",
    "subject": "ENT",
    "number": "5025",
    "honors": false,
    "writingIntensive": false,
    "name": "Museum & Field Methods in Ent",
    "fullname": "Museum & Field Methods in Entomology",
    "info": "This course is designed to teach students museum and field methods in insect biodiversity studies and associated preservation, mounting, and curatorial techniques. Methods will include use of entomological nets and traps for terrestrial and aquatic species, dry and fluid preservation techniques, slide mounting, geo-reference and field data records, labeling, morphological preparation for identification, and curation of material for permanent preservation, including databasing and digital imaging of specimens. Museum policies, the role of the curator, acquisition of specimens, pest management, legal and ethical issues, collection and import/export permits, loan policies and shipping, and budgets and grants, among other topics, will also be discussed. The course is intended for students in entomology, museum studies, or any biodiversity related discipline. A previous undergraduate course in biology or entomology would be helpful, but the background information necessary to succeed in this course will be provided throughout the semester",
    "prereq": []
  },
  {
    "uid": "005498",
    "code": "ENT5031",
    "subject": "ENT",
    "number": "5031",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Physiology",
    "fullname": "Insect Physiology",
    "info": "Essential processes of insects.  Nerve and muscle mechanisms, energy metabolism, respiration, nutrition and digestion, excretion, regulation and interactions of processes, sensory mechanisms, and behavior.  Reproductive behavior, embryology, and postembryonic development of insects.",
    "prereq": []
  },
  {
    "uid": "005497",
    "code": "ENT5041",
    "subject": "ENT",
    "number": "5041",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Ecology",
    "fullname": "Insect Ecology",
    "info": "Synthetic analysis of the causes of insect diversity and of fluctuations in insect abundance. Focus on abiotic, biotic, and evolutionary mechanisms influencing insect populations and communities.",
    "prereq": []
  },
  {
    "uid": "794135",
    "code": "ENT5045",
    "subject": "ENT",
    "number": "5045",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Population Dynamics",
    "fullname": "Insect Population Dynamics",
    "info": "Analytical/experimental approaches to study of insect abundance. Path/loop diagrams, time series analyses. Life tables and demography. Single-/multiple-species models for population growth/interactions with competitors. Predators/pathogens in time/space.prereq: 3005 or instr consent",
    "prereq": {
      "code": "ENT 3005",
      "subject": "ENT",
      "id": "3005"
    }
  },
  {
    "uid": "792183",
    "code": "ENT5051",
    "subject": "ENT",
    "number": "5051",
    "honors": false,
    "writingIntensive": false,
    "name": "Scientific Illus of Insects",
    "fullname": "Scientific Illustration of Insects",
    "info": "Techniques for preparing and observing insects for subsequent illustration. Traditional illustration techniques using the drawing tube and ocular grid on the microscope, including pencil sketching and pen and ink line drawing. Other “traditional” rendering methods will include line and ink, stippling, cross-hatching, color illustration. Major emphasis will be in computer-assisted techniques of scientific illustration using Adobe Illustrator and Adobe Photoshop, including instruction on preparing full body, true-to-life, color illustrations of insects on the computer.",
    "prereq": []
  },
  {
    "uid": "007518",
    "code": "ENT5061",
    "subject": "ENT",
    "number": "5061",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Molecular Science",
    "fullname": "Insect Molecular Science",
    "info": "Molecular genetic techniques and their applications. Emphasizes insect species other than Drosophila. Application of genetic techniques to physiological processes.\n\nprereq: [5011, basic genetics course] or instr consent",
    "prereq": {
      "code": "ENT 5011",
      "subject": "ENT",
      "id": "5011"
    }
  },
  {
    "uid": "794179",
    "code": "ENT5081",
    "subject": "ENT",
    "number": "5081",
    "honors": false,
    "writingIntensive": false,
    "name": "Insects, Aquat Hab & Pollution",
    "fullname": "Insects, Aquatic Habitats, and Pollution",
    "info": "Effects of pollutants on biology. Ecology and community structure of aquatic insects. Life-cycle, trophic guilds, community structure in lotic/lentic habitats. Organic pollution/eutrophication, heavy metal pollution, runoff/siltation, acidification, thermal pollution. Changes in aquatic insect community structure according to original literature sources for each class of pollutant. Biological monitoring networks.prereq: [3005, Biol 3407, FW 2001, EEB 4601] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "ENT 3005",
          "subject": "ENT",
          "id": "3005"
        },
        {
          "code": "BIOL 3407",
          "subject": "BIOL",
          "id": "3407"
        },
        {
          "code": "FW 2001",
          "subject": "FW",
          "id": "2001"
        },
        {
          "code": "EEB 4601",
          "subject": "EEB",
          "id": "4601"
        }
      ]
    }
  },
  {
    "uid": "795001",
    "code": "ENT5121",
    "subject": "ENT",
    "number": "5121",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Experimental Design",
    "fullname": "Applied Experimental Design",
    "info": "Principles of sampling methodologies, experimental design, and statistical analyses. Methods/procedures in generating scientific hypotheses. Organizing, initiating, conducting, and analyzing scientific experiments using experimental designs and statistical procedures.  Offered with AGRO 5121.prereq: Stat 5021 or equiv or instr consent",
    "prereq": {
      "code": "STAT 5021",
      "subject": "STAT",
      "id": "5021"
    }
  },
  {
    "uid": "815120",
    "code": "ENT5126",
    "subject": "ENT",
    "number": "5126",
    "honors": false,
    "writingIntensive": false,
    "name": "Spatial and Temporal Analyses",
    "fullname": "Spatial and Temporal Analysis of Ecological Data",
    "info": "This course covers linear models (regression and ANOVA) and extensions to temporal data and spatial point processes, lattice/areal data, and geostatistics. The course bridges sufficient theory to understand why contending with spatiotemporal dependence is important with enough application to make students confident in their own data analyses.",
    "prereq": []
  },
  {
    "uid": "005496",
    "code": "ENT5211",
    "subject": "ENT",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Pest Management",
    "fullname": "Insect Pest Management",
    "info": "Insect Pest Management is designed for graduate students in any major or minor. The course will emphasize principles of insect pest management and draw from examples related to agricultural, horticultural and landscape, and urban systems. Conventional (nonorganic) and organic approaches, the use of social media and modern technology, and economic, environmental, and social consequences of diverse tactics (chemical, cultural, biological, genetic, etc.) will be covered by the instructor and, on occasion, by guest lecturers. Student debates on pesticide-pollinator and genetic engineering issues will provide real-world context and insights on complexities of insect pest prevention and management.",
    "prereq": []
  },
  {
    "uid": "787858",
    "code": "ENT5241",
    "subject": "ENT",
    "number": "5241",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecological Risk Assessment",
    "fullname": "Ecological Risk Assessment",
    "info": "Evaluating current/potential impact of physical, chemical, biological agents on ecosystems. Identifying ecological stressors, assessing level of exposure, measuring ecological responses, communicating/managing risks. Class participation, two reaction papers, final exam, small-group project.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "005494",
    "code": "ENT5275",
    "subject": "ENT",
    "number": "5275",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect-transmitted diseases",
    "fullname": "Insect-transmitted diseases of humans",
    "info": "What’s so attractive about human blood? How have human interactions with insects evolved? Insects and ticks transmit viral, bacterial, protozoan, and filarial diseases to humans, particularly in tropical countries.  Zika, most recently, and also dengue and other mosquito-borne viruses pose an emerging challenge in the southern US as climate change increases the range of important vector species. Lyme disease and other tick-borne diseases are increasing in the US and pose challenges in diagnosis and treatment. This course covers contemporary topics in \"Medical Entomology\" that will provide an overview of arthropod-borne disease and its impacts on global health from the perspective of insect vectors and microbial pathogens. Students will explore historical, contemporary, and epidemiologic stories demonstrating exposure and control strategies via lecture, student discussions, laboratory demonstrations, and critical review of current best practices in medical entomology. This course is designed for upper division undergraduate and graduate students in any major or minor.",
    "prereq": []
  },
  {
    "uid": "010151",
    "code": "ENT5311",
    "subject": "ENT",
    "number": "5311",
    "honors": false,
    "writingIntensive": false,
    "name": "Sampling Biol Populations",
    "fullname": "Sampling Biological Populations",
    "info": "Sampling plans for study of field/lab populations. Statistical distributions/techniques for detecting/coping with aggregation. Randomization, required sample size, optimal allocation for common probability design. Sequential plans for making decisions.  ",
    "prereq": []
  },
  {
    "uid": "005492",
    "code": "ENT5321",
    "subject": "ENT",
    "number": "5321",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecology: Agricultural Systems",
    "fullname": "Ecology of Agricultural Systems",
    "info": "Ecological approach to problems in agricultural systems. Formal methodologies of systems inquiry are developed/applied.",
    "prereq": []
  },
  {
    "uid": "007016",
    "code": "ENT5341",
    "subject": "ENT",
    "number": "5341",
    "honors": false,
    "writingIntensive": false,
    "name": "Biol Control:Insects & Weeds",
    "fullname": "Biological Control of Insects and Weeds",
    "info": "Biological control is the suppression of pests and weeds using living organisms. It involves fascinating interactions between organisms such as plants and herbivores, and insects and the predators and parasitoids that attack them. These interactions can provide spectacular protection from invasive species but risks to the environment are possible as well so biological control interventions must be undertaken with great care. We will explore these interactions and interventions in depth in this class. The class is online.",
    "prereq": []
  },
  {
    "uid": "005491",
    "code": "ENT5351",
    "subject": "ENT",
    "number": "5351",
    "honors": false,
    "writingIntensive": false,
    "name": "Insect Pathology",
    "fullname": "Insect Pathology",
    "info": "Major pathogenic microorganisms that cause diseases in insects. Routes of infection of insects. Lab propagation of disease agents. Factors in application of disease to pest insect control. Safety considerations.prereq: 5011",
    "prereq": {
      "code": "ENT 5011",
      "subject": "ENT",
      "id": "5011"
    }
  },
  {
    "uid": "005489",
    "code": "ENT5371",
    "subject": "ENT",
    "number": "5371",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Systematics",
    "fullname": "Principles of Systematics",
    "info": "Theoretical/practical procedures of biological systematics. Phylogeny reconstruction, including computer assisted analyses, morphological/molecular approaches, species concepts, speciation, comparative methods, classification, historical biogeography, nomenclature. Use/value of museums.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "005510",
    "code": "ENT5381",
    "subject": "ENT",
    "number": "5381",
    "honors": false,
    "writingIntensive": false,
    "name": "Lepidopterology",
    "fullname": "Lepidopterology",
    "info": "Overview of Lepidoptera with emphasis on processes and phenomena such as polymorphism, mimicry, and individual quality that are well demonstrated by this insect order.",
    "prereq": []
  },
  {
    "uid": "005488",
    "code": "ENT5481",
    "subject": "ENT",
    "number": "5481",
    "honors": false,
    "writingIntensive": false,
    "name": "Invertebrate Neurobiology",
    "fullname": "Invertebrate Neurobiology",
    "info": "The study of invertebrate animals, such as honey bees, sea slugs, and fruit flies, have been instrumental in informing us humans about how our own brains operate. In addition, the ability of some invertebrate animals to sense certain stimuli beyond what humans can detect, has enabled scientists to build smart machines and robots with extraordinary capabilities. Since 80% of the world’s species are insects, understanding the basics of how their nervous systems function will enable societies to better manage their health (e.g., helping insect pollinators) or combat their destruction (e.g., preventing locust plagues). Invertebrate Neurobiology is a course that will explore the underlying neural mechanisms that enable animals to solve or respond to particular problems encountered in their natural environments. Many of the invertebrate animals presented will not only exhibit interesting behaviors, but will reveal important and often conserved principles of neuroscience applicable to a host of animals, including us humans. This course is designed to be integrative — including disciplines intersecting with animal behavior, entomology, evolution, ecology, neuroscience, psychology, and bioengineering. A major goal of this course is to widen one’s view of the importance of invertebrate animals in the field of neuroscience and gain an appreciation of the translational impact that this knowledge can have and will continue to have on our society and daily lives. Students will also be introduced to important concepts in neurobiology and learn how small neural networks operate. ",
    "prereq": []
  },
  {
    "uid": "007018",
    "code": "ENT5900",
    "subject": "ENT",
    "number": "5900",
    "honors": false,
    "writingIntensive": false,
    "name": "Basic Entomology",
    "fullname": "Basic Entomology",
    "info": "For graduate students who need to make up certain deficiencies in their biological science background.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "007019",
    "code": "ENT5910",
    "subject": "ENT",
    "number": "5910",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Problems in Entomology",
    "fullname": "Special Problems in Entomology",
    "info": "Individual field, lab, or library studies in various aspects of entomology.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "007020",
    "code": "ENT5920",
    "subject": "ENT",
    "number": "5920",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Lectures in Entomology",
    "fullname": "Special Lectures in Entomology",
    "info": "Lectures or labs in special fields of entomological research. Given by visiting scholar or regular staff member.",
    "prereq": []
  },
  {
    "uid": "825277",
    "code": "ENT5927",
    "subject": "ENT",
    "number": "5927",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Management for Biologists",
    "fullname": "Data Management for Biologists",
    "info": "This course is focused on providing hands-on experience in organizing, managing, curating, and accessing data. It is conceived as a topic-driven weekly seminar (12 sessions at ~2h each), combining small amounts of lecture with problem solving and hands-on exercises. The course is taught for the requisite number of hours (1400) for a 2-credit course. The longer course sessions allow for short lectures followed by hands-on activities. Students will encounter the data life cycle from generation to preservation. Students will be expected to complete assignments using their own data or other available datasets.",
    "prereq": []
  },
  {
    "uid": "794611",
    "code": "ENT8006",
    "subject": "ENT",
    "number": "8006",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab/Extension Teach Experience",
    "fullname": "Supervised Laboratory or Extension Teaching Experience",
    "info": "Training/experience conducting lab or extension based educational activities in Entomology. Students select a faculty member to serve as their sponsor, and develop lecture outlines or instructional aids such as web sites, web-based training sites, print materials, demonstration aids, and demonstration projects. Students prepare/conduct lab or extension presentations. Overviews of web-based instructional aids.prereq:  instr consent",
    "prereq": []
  },
  {
    "uid": "007519",
    "code": "ENT8051",
    "subject": "ENT",
    "number": "8051",
    "honors": false,
    "writingIntensive": false,
    "name": "Toxicology",
    "fullname": "Toxicology",
    "info": "Chemistry, mode of action of conventional insecticides. Insect growth regulators, microbial pesticides. Transgenic viruses, genetically modified plants. Offered alternate years.\n\nprereq: [5011, [organic, inorganic] chem courses, biochem course] or instr consent",
    "prereq": {
      "code": "ENT 5011",
      "subject": "ENT",
      "id": "5011"
    }
  },
  {
    "uid": "794086",
    "code": "ENT8061",
    "subject": "ENT",
    "number": "8061",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci Comm and Ethics",
    "fullname": "Scientific Communication and Ethics",
    "info": "Students develop/use critical elements of scientific communication, within an ethical framework. Elements in writing scientific manuscripts and research proposals. Oral communication for scientific, outreach, and classroom presentations.",
    "prereq": []
  },
  {
    "uid": "007520",
    "code": "ENT8200",
    "subject": "ENT",
    "number": "8200",
    "honors": false,
    "writingIntensive": false,
    "name": "Colloq Soc. Insects",
    "fullname": "Colloquium in Social Insects",
    "info": "Current research on bees, wasps, ants, and termites.  Student critiques and research reports.\n\nprereq: 3020 or 3200",
    "prereq": {
      "or": [
        {
          "code": "ENT 3020",
          "subject": "ENT",
          "id": "3020"
        },
        {
          "code": "ENT 3200",
          "subject": "ENT",
          "id": "3200"
        }
      ]
    }
  },
  {
    "uid": "007522",
    "code": "ENT8210",
    "subject": "ENT",
    "number": "8210",
    "honors": false,
    "writingIntensive": false,
    "name": "Colloq. Insect Evol",
    "fullname": "Colloquium in Insect Evolution",
    "info": "Research issues in systematics and evolution. Comparative biology, biogeography, and molecular evolution. Students may re-enroll as topics alternate. Students critique papers from primary literature.\n\nprereq: 5371 or instr consent",
    "prereq": {
      "code": "ENT 5371",
      "subject": "ENT",
      "id": "5371"
    }
  },
  {
    "uid": "007523",
    "code": "ENT8240",
    "subject": "ENT",
    "number": "8240",
    "honors": false,
    "writingIntensive": false,
    "name": "Coll. Insect Ecol.",
    "fullname": "Colloquium in Insect Ecology",
    "info": "Advanced topics.\n\nprereq: 5041 or 5045 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "ENT 5041",
          "subject": "ENT",
          "id": "5041"
        },
        {
          "code": "ENT 5045",
          "subject": "ENT",
          "id": "5045"
        }
      ]
    }
  },
  {
    "uid": "007524",
    "code": "ENT8300",
    "subject": "ENT",
    "number": "8300",
    "honors": false,
    "writingIntensive": false,
    "name": "Graduate Seminar",
    "fullname": "Graduate Seminar",
    "info": "Oral and written reports on and discussion by students of selected topics from current literature.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "788109",
    "code": "ENT8333",
    "subject": "ENT",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788345",
    "code": "ENT8444",
    "subject": "ENT",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "010344",
    "code": "ENT8594",
    "subject": "ENT",
    "number": "8594",
    "honors": false,
    "writingIntensive": false,
    "name": "Grad Res. in Entomology",
    "fullname": "Graduate Research in Entomology",
    "info": "An opportunity in which a student designs and carriesout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use theUniversity-wide on-line directed research contract process in order to enroll. Prereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "788470",
    "code": "ENT8666",
    "subject": "ENT",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "788597",
    "code": "ENT8777",
    "subject": "ENT",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credits: Master's",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; minimum of 10 cr required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "787857",
    "code": "ENT8888",
    "subject": "ENT",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  }
]