[
  {
    "uid": "816403",
    "code": "EPSY1261",
    "subject": "EPSY",
    "number": "1261",
    "honors": false,
    "writingIntensive": false,
    "name": "Understanding Data Stories",
    "fullname": "Understanding Data Stories through Visualization & Computing",
    "info": "Academics and researchers have long used data & visualization to support and illuminate particular narratives in their scholarship. Today, data visualizations are found not only in the pages of academic journals; many non-academics, including journalists and activists, use increasingly complex data visualizations and statistical summaries to convey salient information and storylines. This course will help students build on their statistical thinking and understanding learned in high school to think critically about the use of summaries and visualization and their role in the data narrative. It will also cover the use of computational tools and methods for creating data summaries and visualization that facilitate seeing patterns and relationships in data, and producing better narrative through communicating with data. Students will learn course material through in-class activities and projects conducted in cooperative learning groups and through assignments requiring the application of concepts and technology presented in class to additional real-world examples of data visualization.",
    "prereq": []
  },
  {
    "uid": "816282",
    "code": "EPSY1281",
    "subject": "EPSY",
    "number": "1281",
    "honors": false,
    "writingIntensive": false,
    "name": "Psychological Science Applied",
    "fullname": "Psychological Science Applied",
    "info": "The course introduces students to applied psychology as a discipline and reviews fundamental principles of psychology through the lenses of applied and professional areas that are the foci of CEHD majors. Specifically, through the lenses of education, we review principles of learning, memory, development, intelligence, and interventions; through the lenses of health and wellness, we review personality, biological, social, and cognitive bases of normal and abnormal behavior, as well as treatments; and, through the lenses of business and organizations, we review principles of motivation, sensation perception, and social behavior. Thus, these psychological principles are considered theoretically, empirically, and through examples for application, with lab discussions and projects emphasizing education, business, health and wellness. The course serves as a foundation for future coursework in education, health sciences, and psychology, and is consistent with the APAs public education effort to demonstrate how the science and application of psychology benefits society and improves lives.",
    "prereq": []
  },
  {
    "uid": "004260",
    "code": "EPSY1600",
    "subject": "EPSY",
    "number": "1600",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics:SpEd/HumServ",
    "fullname": "Special Topics: Developing Special Educational and Human Service Programs",
    "info": "Explores the concepts, issues, and practices in developing special education and human services for persons with disabilities. Appropriate for persons in paraprofessional positions.",
    "prereq": []
  },
  {
    "uid": "798997",
    "code": "EPSY1905",
    "subject": "EPSY",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg. Chess & 21st Cntry Skills",
    "fullname": "Beginners' Chess and 21st Century Skills",
    "info": "Examination of the basic components of chess, computer-based chess, how chess players think, including visual-spatial thinking and critical thinking, the psychology of critical thinking and other 21st Century reasoning skills, research on chess cognition, and the international chess community.",
    "prereq": []
  },
  {
    "uid": "816165",
    "code": "EPSY1942",
    "subject": "EPSY",
    "number": "1942",
    "honors": false,
    "writingIntensive": false,
    "name": "Fr Sem: Technology & Society",
    "fullname": "Freshman Seminar: Technology and Society",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "825257",
    "code": "EPSY2201",
    "subject": "EPSY",
    "number": "2201",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Methods",
    "fullname": "Basics of Research Methods",
    "info": "As part of a society that is saturated with \"research,\" we have all at some point encountered at least one form of research--whether it is via election polls, market surveys, investigative findings reported on the 10pm news, or academic research for your papers. There is sometimes too much research to make sense of it all. As an undergraduate student, you have likely found many examples of research, and it will only become more important in your own academic career, and if you choose to pursue an academic route, in your own development as a scholar. Therefore, learning the basics of research--how it is conducted, how it can be used to answer everyday questions, and what makes it good quality--will make you not only a better researcher, but also a better consumer of academic and popular research.",
    "prereq": []
  },
  {
    "uid": "811328",
    "code": "EPSY2601",
    "subject": "EPSY",
    "number": "2601",
    "honors": false,
    "writingIntensive": false,
    "name": "Differences and Disabilities",
    "fullname": "Understanding Differences, Disabilities, and the Career of Special Education",
    "info": "Impact of disabilities on individual/family. Support systems for persons with disabilities, approaches for advocacy. Employ reflective practices when considering concept of disability. This course has an imbedded school-based practicum.",
    "prereq": []
  },
  {
    "uid": "825627",
    "code": "EPSY3002",
    "subject": "EPSY",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Engaging the Research Process",
    "fullname": "Demystifying and Engaging the Research Process",
    "info": "Have you ever considered participating in academic research but felt intimidated or uncertain about what the process includes? If so, this course is for you. The University of Minnesota is one of the largest research universities in the world and provides ample opportunity to get involved with world-class faculty and cutting-edge research. The primary goal of the class is to simultaneously introduce and engage students in demystifying the research process. The course includes guest lecturers and draws upon the expertise of nationally recognized faculty and professional staff from across campus representing a broad range of disciplines.Previously offered as EDHD 3302.",
    "prereq": []
  },
  {
    "uid": "798003",
    "code": "EPSY3101",
    "subject": "EPSY",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Creativity and Intelligence",
    "fullname": "Creativity and Intelligence: an Introduction",
    "info": "Classic/contemporary theories of creativity/intelligence, their development, implications for behavioral/social sciences and psychological/educational practices.",
    "prereq": []
  },
  {
    "uid": "818500",
    "code": "EPSY3105",
    "subject": "EPSY",
    "number": "3105",
    "honors": false,
    "writingIntensive": false,
    "name": "Community Engaged Research",
    "fullname": "Community Engaged Research Experiences in K-12 Contexts",
    "info": "This course is designed as an introduction to community-engaged, educational research. Students will learn about educational research methodology that includes descriptive, experimental, and applied methods. We will highlight the ways that data is collected and analyzed to answer various types of research questions.  By participating in the course activities, students will learn skills to develop a research question and design and conduct their own study. The course activities will build on existing research partnerships in Minneapolis and St. Paul Public Schools. Students enrolled in the course will be able to work with teachers, students, and families as a part of their experience. The course instructor(s) have large-scale, existing research projects that explore various mechanisms (technology, parent involvement, culturally responsive pedagogy) to support middle school students' science learning. We will create a community of undergraduate scholars that is simultaneously social and intellectual. The course lectures, activities, and research experiences are designed to create an environment that respects and values the students' diverse cultural backgrounds.",
    "prereq": []
  },
  {
    "uid": "793435",
    "code": "EPSY3111W",
    "subject": "EPSY",
    "number": "3111",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Critical Thinking",
    "fullname": "Introduction to Critical Thinking",
    "info": "Prominent issues and research findings related to critical thinking. How to critically evaluate controversies/arguments in editorials and published essays. Applications of critical thinking to various fields.",
    "prereq": []
  },
  {
    "uid": "001911",
    "code": "EPSY3119",
    "subject": "EPSY",
    "number": "3119",
    "honors": false,
    "writingIntensive": false,
    "name": "Lrng/Cogn/Assess",
    "fullname": "Learning, Cognition, and Assessment",
    "info": "Principles of learning, cognition, cognitive development, classroom management, motivation, instruction, and assessment. Topics: behaviorism, cognitive and social constructivism, human information processing theory, intelligence, knowledge acquisition, reasoning skills, scholastic achievement, standardized testing, reliability, validity, student evaluation, performance assessment, and portfolios.",
    "prereq": []
  },
  {
    "uid": "002181",
    "code": "EPSY3132",
    "subject": "EPSY",
    "number": "3132",
    "honors": false,
    "writingIntensive": false,
    "name": "Psy Multicult in Ed",
    "fullname": "Psychology of Multiculturalism in Education",
    "info": "Course critically examines social and cultural diversity in the United States, confronting social issues of poverty, handicappism, homophobia, racism, sexism, victim-blaming, violence, and so on, and presenting models for change. Students examine how and why prejudices develop.",
    "prereq": []
  },
  {
    "uid": "015646",
    "code": "EPSY3133",
    "subject": "EPSY",
    "number": "3133",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum SrvLrn Psy Multicult",
    "fullname": "Practicum: Service Learning, Psychology of Multiculturalism in Education",
    "info": "Thirty hours of service learning in multicultural communities. Students work with children, youth, or adults in ESL tutoring or after-school youth programs. Sensitivities/competencies related to multicultural issues in U.S. society.prereq: [3132 or concurrent registration is required (or allowed) in 3132], instr consent, enrollment in APECS minor",
    "prereq": {
      "code": "EPSY 3132",
      "subject": "EPSY",
      "id": "3132"
    }
  },
  {
    "uid": "793105",
    "code": "EPSY3134W",
    "subject": "EPSY",
    "number": "3134",
    "honors": false,
    "writingIntensive": true,
    "name": "Soc Diversity/Decultur in Educ",
    "fullname": "Social Diversity and Deculturalization in Education",
    "info": "How educational practices affect cultures of minority-status peoples in the United States. Emphasizes historical/contemporary educational issues of deculturalization related to assimilation, segregation, integration, and educational labeling, achievement, and interaction of students.",
    "prereq": []
  },
  {
    "uid": "002199",
    "code": "EPSY3264",
    "subject": "EPSY",
    "number": "3264",
    "honors": false,
    "writingIntensive": false,
    "name": "Basic/Applied Stats",
    "fullname": "Basic and Applied Statistics",
    "info": "Introductory statistics. Emphasizes understanding/applying statistical concepts/procedures. Visual/quantitative methods for presenting/analyzing data, common descriptive indices for univariate/bivariate data. Inferential techniques.",
    "prereq": []
  },
  {
    "uid": "790732",
    "code": "EPSY3300",
    "subject": "EPSY",
    "number": "3300",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Educ Psych",
    "fullname": "Special Topics in Educational Psychology",
    "info": "Current issues in educational psychology or related coursework in areas not normally available through regular curriculum offerings.",
    "prereq": []
  },
  {
    "uid": "801656",
    "code": "EPSY3301",
    "subject": "EPSY",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Ed Psych",
    "fullname": "Introduction to Educational Psychology",
    "info": "History, current work. Future promise of educational psychology. Major topics in educational psychology. Focuses on interplay between theory, empirical research, and practical applications.",
    "prereq": []
  },
  {
    "uid": "801657",
    "code": "EPSY3302",
    "subject": "EPSY",
    "number": "3302",
    "honors": false,
    "writingIntensive": false,
    "name": "Communication Skills",
    "fullname": "Introduction to Communication Skills for Educational and Community Settings",
    "info": "Working with diverse individuals/groups in educational/community settings. Communication skills/concepts. Self-reflection on communication style.",
    "prereq": []
  },
  {
    "uid": "801659",
    "code": "EPSY3303",
    "subject": "EPSY",
    "number": "3303",
    "honors": false,
    "writingIntensive": false,
    "name": "Ed Psych Undergrad Practicum",
    "fullname": "Educational Psychology Undergraduate Practicum",
    "info": "This culminating course familiarizes students with the principles and practice of applied psychology in educational and community settings. Through supervised fieldwork experiences in either research or practice settings, students will develop an understanding of ethical considerations in educational psychology and explore how psychological research can be used to advance the practice of psychology in applied settings. This course is designed for undergraduate students completing an Educational Psychology undergraduate minor or the Special Education major. The course meets for 120 minutes weekly, and students complete 90 hours of fieldwork (approximately 8-10 hours/week). This is a community-engaged learning course.  Fieldwork experiences can include:*A research experience conducted with an approved Educational Psychology faculty member.*A practical experience in an approved community engaged service-learning setting.  Note: students in the special education major must complete fieldwork related to disabilities and/or special education.",
    "prereq": []
  },
  {
    "uid": "825888",
    "code": "EPSY3613",
    "subject": "EPSY",
    "number": "3613",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndns of SpEd--I",
    "fullname": "Foundations of Special Education I",
    "info": "To review the foundations of special education, culminating in an understanding of the application of the IDEAL Problem Solving Model. The course will address concepts related to exceptionality; historical and legal foundations; problem solving and tools of inquiry; collaborative relationships with families, educational, and community professionals; support of students with disabilities in general education; characteristics of students with high and low incidence disabilities, and ethics. Teacher candidates will learn methods of formative assessment using curriculum-based measures (CBM) and practice analyzing data to make instructional decisions and inform early intervention for struggling students.",
    "prereq": []
  },
  {
    "uid": "826505",
    "code": "EPSY3616W",
    "subject": "EPSY",
    "number": "3616",
    "honors": false,
    "writingIntensive": true,
    "name": "Mgmt & Behavior Analy Prob Sol",
    "fullname": "Classroom Management and Behavior Analytic Problem Solving",
    "info": "Focuses on principles of behavior analysis and procedures used in the assessment and management of classroom behavior.  Although the application of behavioral principles in educational settings is the central purpose of this course, complementary issues related to general classroom management will also be addressed.  Consistent with the mission of the College of Education and Human Development, this course aims to strengthen effective educational practice, promote inquiry, and build leadership skills for regular and special educators and professionals in allied fields.Community Engaged Learning (CEL): This course integrates community engaged learning in an educational setting, which may include day-care centers, pre-kindergarten programs, K-12 schools, and post-secondary transition programs. Students are required to engage in a community placement for a minimum of 2 hours per week (20 hours total). Licensure students should use their pre-student teaching field experience placements as their CEL site and must complete the minimum number of hours required of their field experience course.Note: Teacher licensure candidates should register for the appropriate pre-student teaching field experience in accordance with their program plans. Non-licensure students have two options for securing a CEL placement: (1) register for 1 credit of EPSY 3701/5701 Practicum: Field Experience in General Education – Inclusive Classrooms or (2) secure a placement through the UMN Center for Community Engaged Learning (information provided in class).",
    "prereq": []
  },
  {
    "uid": "826497",
    "code": "EPSY3625",
    "subject": "EPSY",
    "number": "3625",
    "honors": false,
    "writingIntensive": false,
    "name": "EducChldrnDisabIntr",
    "fullname": "Education of Infants, Toddlers, and Preschool Children with Disabilities: Introduction",
    "info": "Examination of key issues and practices related to early intervention and early childhood special education, with an emphasis on family-focused and inclusive services for children birth to age six.  Students enrolled in this course will be provided with a background in historical and philosophical issues relating to special education, components of due process and data privacy, the IEP/IFSP process, an overview of various disabilities and disorders, and information regarding how disabilities may affect individuals and families. ",
    "prereq": []
  },
  {
    "uid": "826498",
    "code": "EPSY3631",
    "subject": "EPSY",
    "number": "3631",
    "honors": false,
    "writingIntensive": false,
    "name": "AAC Module 1: Introduction",
    "fullname": "Module 1: Introduction to Augmentative and Alternative Communication",
    "info": "Terms/concepts related to augmentative/alternative communication. Myths/facts regarding AA",
    "prereq": []
  },
  {
    "uid": "811264",
    "code": "EPSY3701",
    "subject": "EPSY",
    "number": "3701",
    "honors": false,
    "writingIntensive": false,
    "name": "GenEd Practicum: Inclusive",
    "fullname": "Practicum: Field Experience in General Education - Inclusive Classrooms",
    "info": "Field-Based Practicum. Observe and actively participate in an inclusive (with and without disabilities) general education classroom. An emphasis is placed on communication skills and reflective practice.",
    "prereq": []
  },
  {
    "uid": "826273",
    "code": "EPSY3705",
    "subject": "EPSY",
    "number": "3705",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Experience in Denmark",
    "fullname": "Field Experience in Denmark: Exploring Community, Culture, and Education",
    "info": "The Department of Educational Psychology is on a mission to provide its students with opportunities to develop the multicultural competencies necessary to work effectively with children and families of all races, cultures, languages, and ethnicities. Through this seminar, students will experience cross-cultural teaching and learning through intense immersion in Danish schools and communities. In addition, as a minority culture in Copenhagen, students will learn from diverse perspectives expanding their respect for individual differences. Consistent with the mission of the College of Education and Human Development and the Special Education Programs, this field experience strengthens effective educational practices, promotes inquiry and problem-solving skills, and builds leadership skills for future professionals who aspire to work in Educational Psychology and related fields.",
    "prereq": []
  },
  {
    "uid": "817707",
    "code": "EPSY3801",
    "subject": "EPSY",
    "number": "3801",
    "honors": false,
    "writingIntensive": false,
    "name": "Science of Human Resilience",
    "fullname": "The Science of Human Resilience and Wellbeing: Foundational Knowledge for Career and Life Success",
    "info": "This course is for any undergraduate student interested in learning about and applying the theory and practice as it relates to resilience and wellbeing. This course integrates key cross-cutting, scientific findings from a range of psychological disciplines, including positive psychology, clinical psychology, developmental psychology, neuropsychology, and social psychology. Stated simply, resilience refers to the human capacity and ability to both survive and thrive in the face of life circumstances. Students will develop a deep understanding of the theoretical concepts of stress, resilience, and wellbeing, as well as specific resilience practices scientific research has shown enable people to better manage and bounce back from stressful situations and enhance their social, emotional, and behavioral functioning in career and personal aspects of life.",
    "prereq": []
  },
  {
    "uid": "820072",
    "code": "EPSY3802",
    "subject": "EPSY",
    "number": "3802",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in School Psychology",
    "fullname": "Contemporary Issues in School Psychology",
    "info": "This survey-level course is designed to facilitate understanding of the intersections of psychological processes with current issues facing the U.S. schools and is targeted toward students interested in working with children and adolescents in school settings. Students will develop basic understanding of scholarship and professional opportunities in school psychology and related fields. The course is designed to overview how psychological processes impact students, teachers, educational staff, families, and school communities through use of data and research to inform school practices that promote safe and healthy school environments, support students’ mental health, and meet the needs of unique learners. Lectures, discussions, and interactive activities will be used to facilitate learning. ",
    "prereq": []
  },
  {
    "uid": "810174",
    "code": "EPSY4001",
    "subject": "EPSY",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Tching Studts w/special needs",
    "fullname": "Teaching Students with Special Needs in Inclusive Settings",
    "info": "Historical perspectives, definitions/professional language, characteristics, needs, service delivery systems for each area of exceptionality.prereq: Must be enrolled in either the initial teaching licensure program for music education or agricultural education students. All other initial teaching licensure candidates  should enroll in 5015 and 5016.",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5015",
          "subject": "EPSY",
          "id": "5015"
        },
        {
          "code": "EPSY 5016",
          "subject": "EPSY",
          "id": "5016"
        }
      ]
    }
  },
  {
    "uid": "790908",
    "code": "EPSY4300",
    "subject": "EPSY",
    "number": "4300",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Educ Psych",
    "fullname": "Special Topics in Educational Psychology",
    "info": "Current issues in educational psychology or related coursework in areas not normally available through regular curriculum offerings.",
    "prereq": []
  },
  {
    "uid": "826265",
    "code": "EPSY4604",
    "subject": "EPSY",
    "number": "4604",
    "honors": false,
    "writingIntensive": false,
    "name": "Transition From School to Work",
    "fullname": "Transition From School to Work and Community Living for Persons With Special Needs",
    "info": "Use of strategies/models for improving transition of youth from school to work and community living. Course content that specifically addresses all phases of student assessment, individualized transition planning. Parent, family, and student involvement in designing post school options. Community-based services (employment, residential living, social and recreational services, etc). Comprehensive interagency approaches.",
    "prereq": []
  },
  {
    "uid": "826499",
    "code": "EPSY4605W",
    "subject": "EPSY",
    "number": "4605",
    "honors": false,
    "writingIntensive": true,
    "name": "Collaborative Practices Sp Ed",
    "fullname": "Collaborative Practices for the Special Educator",
    "info": "Skills/knowledge required to consult/collaborate with school personnel, families, other professionals to maintain effective educational support.",
    "prereq": []
  },
  {
    "uid": "826500",
    "code": "EPSY4609",
    "subject": "EPSY",
    "number": "4609",
    "honors": false,
    "writingIntensive": false,
    "name": "Family-Ctrd Early Intervention",
    "fullname": "Infants and Toddlers with Delays/Disabilities: Family-Centered Approaches to Early Intervention",
    "info": "This course was designed to provide pre-service and current teachers, as well as related service providers, with the knowledge and skills needed to understand the dynamic ecosystems of families with a child with disabilities. Students will be introduced to the major methods, philosophies, and current research that emphasize effective family-professional collaboration in planning and service delivery for infants and young children with disabilities. The focus is on a family-centered approach to assess and design educational plans and interventions, with a specific emphasis on relationship building and understanding the diverse perspectives on family life and developmental expectations.",
    "prereq": []
  },
  {
    "uid": "826189",
    "code": "EPSY4614W",
    "subject": "EPSY",
    "number": "4614",
    "honors": false,
    "writingIntensive": true,
    "name": "Assessment & Due Process Sp Ed",
    "fullname": "Assessment and Due Process in Special Education",
    "info": "Participants will learn basic standardized assessment and how it directly relates to special education. In addition, students will use the assessment as part of an ongoing process for making instructional programming decisions. Students will apply skills in designing and evaluating assessment plans and in making eligibility decisions.",
    "prereq": []
  },
  {
    "uid": "826501",
    "code": "EPSY4617",
    "subject": "EPSY",
    "number": "4617",
    "honors": false,
    "writingIntensive": false,
    "name": "Acad & Social Interventions",
    "fullname": "Academic and Social Interventions for Students with Mild to Moderate Disabilitie",
    "info": "Use problem solving model to make data-based decisions regarding implementation and evaluation of instruction for students with academic and behavioral difficulties.",
    "prereq": []
  },
  {
    "uid": "826502",
    "code": "EPSY4618",
    "subject": "EPSY",
    "number": "4618",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Int Students Wrt Lang",
    "fullname": "Specialized Interventions for Students With Mild/Moderate Disabilities in Reading & Written Language",
    "info": "The purpose of this course is to prepare teachers of students at risk and with academic disabilities to address their specific learning needs in the area of reading and written language, using a data-based decision-making approach. Through course readings, lectures, discussions, cooperative group work, microteaching, and field experiences, students will gain knowledge and skills to address the needs of children with difficulties or disabilities that affect reading and writing, including children with dyslexia and dysgraphia.",
    "prereq": []
  },
  {
    "uid": "826506",
    "code": "EPSY4657",
    "subject": "EPSY",
    "number": "4657",
    "honors": false,
    "writingIntensive": false,
    "name": "Intervention Behavior Problem",
    "fullname": "Interventions for Behavioral Problems in School Settings",
    "info": "Comprehensive behavioral programs for students with social and or emotional disabilities. Instructing students with social and or emotional disabilities.",
    "prereq": []
  },
  {
    "uid": "826503",
    "code": "EPSY4681",
    "subject": "EPSY",
    "number": "4681",
    "honors": false,
    "writingIntensive": false,
    "name": "Educ. Preschooler Disabilities",
    "fullname": "Educating Preschoolers with Disabilities: Specialized Approaches and Interventions",
    "info": "This course provides an opportunity to engage in in-depth learning related to a variety of specialized approaches and interventions designed to maximize developmental and educational outcomes for young children, birth to age 6, with disabilities and their families in home, community, and school-based settings.  Early educators and early childhood special educators play a major role in the development, implementation, and evaluation of individualized programming and are called upon to provide services that are interdisciplinary, multicultural, family-centered, inclusive, developmentally appropriate, and effective.  Thus, early childhood professionals must be knowledgeable of and proficient in their application of curricular adaptations and instructional strategies that address the needs of young children with a broad range of disabilities in a broad range of preschool settings.prereq: [3616W, 3625] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "EPSY 3616W",
          "subject": "EPSY",
          "id": "3616W"
        },
        {
          "code": "EPSY 3625",
          "subject": "EPSY",
          "id": "3625"
        }
      ]
    }
  },
  {
    "uid": "811265",
    "code": "EPSY4704",
    "subject": "EPSY",
    "number": "4704",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac: Middle/Secondary",
    "fullname": "Practicum in Middle/Secondary Settings",
    "info": "Preparation for practicing principles required for successful inclusion. Address model for best practices/requirements specified by Minnesota Board of Teaching.",
    "prereq": []
  },
  {
    "uid": "811266",
    "code": "EPSY4705",
    "subject": "EPSY",
    "number": "4705",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac: ECSE/Elementary",
    "fullname": "Practicum in Elementary Settings",
    "info": "Principles for successful inclusion of students with moderate disabilities. Address model for best practices.",
    "prereq": []
  },
  {
    "uid": "811267",
    "code": "EPSY4741",
    "subject": "EPSY",
    "number": "4741",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching: ABS",
    "fullname": "Student Teaching for ABS",
    "info": "Transfer of theoretical knowledge to practical application. Responsibilities of special education teacher in variety of settings.",
    "prereq": []
  },
  {
    "uid": "820439",
    "code": "EPSY4994",
    "subject": "EPSY",
    "number": "4994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research in Ed Psych",
    "fullname": "Faculty Directed Research in Educational Psychology",
    "info": "Arranged independently with individual faculty members.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "016260",
    "code": "EPSY5001",
    "subject": "EPSY",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Learning,Cognition,Assessment",
    "fullname": "Learning, Cognition, and Assessment",
    "info": "In this course, you will learn about: Theories of child development and how they relate to approaches to instruction; Behaviorist, cognitive, and social cognitive learning theories; Approaches to instruction and assessment (teacher-centered vs. student-centered vs. assessment-centered); and Issues related to assessment and measuring student learning (validity, reliability, interpretation, etc.) by participating in assessment design (traditional, performance, formative) and interpretation.",
    "prereq": []
  },
  {
    "uid": "808132",
    "code": "EPSY5015",
    "subject": "EPSY",
    "number": "5015",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Needs/Inclus. Settings",
    "fullname": "Teaching Students with Special Needs in Inclusive Settings",
    "info": "Areas of exceptionality defined in federal/state regulations. Historical perspectives, definitions, etiology, characteristics, needs, and service delivery systems. Collaborating with special education personnel.prereq: Enrolled in a teacher initial licensure program",
    "prereq": []
  },
  {
    "uid": "808133",
    "code": "EPSY5016",
    "subject": "EPSY",
    "number": "5016",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Needs/Inclus. Settings",
    "fullname": "Teaching Students with Special Needs in Inclusive Settings",
    "info": "Attending to constant transitions/development in which children/adolescents negotiate their road to adulthood. How to foster learning/positive development.prereq: Enrolled in teacher initial licensure program",
    "prereq": []
  },
  {
    "uid": "816640",
    "code": "EPSY5017",
    "subject": "EPSY",
    "number": "5017",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Exceptional Students",
    "fullname": "Teaching Exceptional Students in General Education Classrooms",
    "info": "This course will provide an overview of the areas of exceptionality defined in federal and state regulations.  The focus of this course will be on historical perspectives, definitions, etiology, characteristics, needs, and service delivery systems for each area of exceptionality as well as the general educator?s role in collaborating with special education personnel in order to meet the needs of students with special needs.",
    "prereq": []
  },
  {
    "uid": "789700",
    "code": "EPSY5100",
    "subject": "EPSY",
    "number": "5100",
    "honors": false,
    "writingIntensive": false,
    "name": "Colloquium Series - PsyFndns",
    "fullname": "Colloquium Series: Research and Issues in Psychological Foundations of Education",
    "info": "Presentation/critique of faculty/student research.",
    "prereq": []
  },
  {
    "uid": "002203",
    "code": "EPSY5101",
    "subject": "EPSY",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intellig & Creativ",
    "fullname": "Intelligence and Creativity",
    "info": "Contemporary theories of intelligence and intellectual development and contemporary theories of creativity and their implications for educational practices and psychological research.",
    "prereq": []
  },
  {
    "uid": "002204",
    "code": "EPSY5112",
    "subject": "EPSY",
    "number": "5112",
    "honors": false,
    "writingIntensive": false,
    "name": "Know, Lrng, Think",
    "fullname": "Knowing, Learning, and Thinking",
    "info": "Principles of human information processing, memory, and thought; mental operations in comprehension and problem solving; developing expertise and automaticity; emphasis on applied settings.",
    "prereq": []
  },
  {
    "uid": "002206",
    "code": "EPSY5113",
    "subject": "EPSY",
    "number": "5113",
    "honors": false,
    "writingIntensive": false,
    "name": "Psy Instruc & Tech",
    "fullname": "Psychology of Instruction and Technology",
    "info": "Introduction to adult learning and instructional design. Application of core foundational knowledge to development of effective learning environments for adults. Topics include philosophy, learning theories, instructional models, development and experience, individual differences, evaluation, assessment, and technology.",
    "prereq": []
  },
  {
    "uid": "002207",
    "code": "EPSY5114",
    "subject": "EPSY",
    "number": "5114",
    "honors": false,
    "writingIntensive": false,
    "name": "Psychology of Student Learning",
    "fullname": "Psychology of Student Learning",
    "info": "This course is an introduction to the theories, data, and methods of Educational Psychology most relevant to understanding student thinking and learning. The first third of the course reviews those aspects of cognitive development that are foundational for education. The second third considers how cognitive psychology informs questions of learning, memory, knowledge, and transfer. With this background in place, the final third of the course will focus on the classroom: on instruction, motivation, individual differences, and group differences. The course concludes by considering the neural correlates of classroom learning.",
    "prereq": []
  },
  {
    "uid": "002208",
    "code": "EPSY5115",
    "subject": "EPSY",
    "number": "5115",
    "honors": false,
    "writingIntensive": false,
    "name": "Psychology of Adult Learning",
    "fullname": "Psychology of Adult Learning and Instruction",
    "info": "Survey of adult learning/instruction. Emphasizes instructional design, learning theories, experience, individual differences, evaluation, tests/measurement, technology. Implications for curricular/instructional design in higher education, continuing education, professional/business related training.",
    "prereq": []
  },
  {
    "uid": "002237",
    "code": "EPSY5116",
    "subject": "EPSY",
    "number": "5116",
    "honors": false,
    "writingIntensive": false,
    "name": "Educ Gifted/Talent",
    "fullname": "Education of the Gifted and Talented",
    "info": "Theories of giftedness, talent development, instructional strategies, diversity and technological issues, implications for educational practices and psychological inquiry, and international considerations.",
    "prereq": []
  },
  {
    "uid": "002209",
    "code": "EPSY5117",
    "subject": "EPSY",
    "number": "5117",
    "honors": false,
    "writingIntensive": false,
    "name": "Prob Solv & Dec Mak",
    "fullname": "Problem Solving and Decision Making",
    "info": "Strategies, rules, methods, and other cognitive components involved in problem solving and decision making, implications for educational practices, and applied domains.",
    "prereq": []
  },
  {
    "uid": "796073",
    "code": "EPSY5118",
    "subject": "EPSY",
    "number": "5118",
    "honors": false,
    "writingIntensive": false,
    "name": "Educational Psycholinguistics",
    "fullname": "Language: Psycholinguistic Research and Educational Application",
    "info": "Psychological study of language. Psychological processes involved in language use, mechanisms that guide these processes. Failures of these mechanisms. How language operates.",
    "prereq": []
  },
  {
    "uid": "809099",
    "code": "EPSY5119",
    "subject": "EPSY",
    "number": "5119",
    "honors": false,
    "writingIntensive": false,
    "name": "Mind, Brain, and Education",
    "fullname": "Mind, Brain, and Education",
    "info": "How educationally relevant skills/concepts develop in both typical/atypical children.prereq: 3301 or equiv",
    "prereq": {
      "code": "EPSY 3301",
      "subject": "EPSY",
      "id": "3301"
    }
  },
  {
    "uid": "825089",
    "code": "EPSY5121",
    "subject": "EPSY",
    "number": "5121",
    "honors": false,
    "writingIntensive": false,
    "name": "Debugging Failure",
    "fullname": "Debugging Failure in Learning",
    "info": "This course investigates the double-edge potential of failure to catalyze and thwart learning. The goal is to develop a multi-dimensional framework drawing on psychological, cognitive, interpersonal, and systemic perspectives that can be used in research to document, understand, problematize, and ultimately support students experiences with failure during learning. Central topics include causal attributions, play-based failures, counter storytelling, inequities, framing, and motivation. Course activities include reviews of experimental and observational research; reflections on video of students and instructors navigating moments of failure; and opportunities to develop research designs and/or analyze new data attending to failure.",
    "prereq": []
  },
  {
    "uid": "825288",
    "code": "EPSY5122",
    "subject": "EPSY",
    "number": "5122",
    "honors": false,
    "writingIntensive": false,
    "name": "Programming Fundamentals",
    "fullname": "Programming Fundamentals for Social Science Research",
    "info": "What is computer programming, and how can it be used to improve your research? This course teaches the fundamental concepts and techniques of programming using the open-source Python 3 language, while emphasizing a variety of applications to social science research, including data analysis, visualization, task automation, and retrieving data from the internet through APIs and scraping.  The course covers fundamental programming concepts, as well as software engineering topics such as writing robust code, testing, debugging, collaboration, version control, and working with file systems. The course is taught with an active, hands-on approach to programming, including class discussions and group work. It is designed to be accessible to students without any prior programming experience.",
    "prereq": []
  },
  {
    "uid": "825289",
    "code": "EPSY5123",
    "subject": "EPSY",
    "number": "5123",
    "honors": false,
    "writingIntensive": false,
    "name": "Programming Workflows",
    "fullname": "Programming Workflows for Psychological Research",
    "info": "How can researchers use open-source programming to create a reproducible and flexible workflow? This course teaches programming and computer-based skills that are increasingly important methods in psychological research, like fundamental programming concepts, data wrangling in R, online experiments and surveys with JavaScript, version control with git, using the Open Science Framework, and writing reproducible reports with R Markdown. It emphasizes open science practices and readily implementable skills for a more streamlined and automated research workflow. The course is taught with an active, hands-on approach to programming, including class discussions and group work. It is designed to be accessible to students without any prior programming experience.prereq: Students should have taken an undergraduate- or graduate-level statistics course.",
    "prereq": []
  },
  {
    "uid": "002211",
    "code": "EPSY5125",
    "subject": "EPSY",
    "number": "5125",
    "honors": false,
    "writingIntensive": false,
    "name": "Charac/Values/Behav",
    "fullname": "Psychology of Building Character, Values, and Behavior",
    "info": "New approaches to motivation, building prosocial values and behavior; how to alter values and behavior of anti-social individuals; strengths and weaknesses of traditional approaches to character education; instilling prosocial values as a way to alter negative behaviors.",
    "prereq": []
  },
  {
    "uid": "002212",
    "code": "EPSY5135",
    "subject": "EPSY",
    "number": "5135",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Relations Wks",
    "fullname": "Human Relations Workshop",
    "info": "Experiential course addressing issues of prejudice and discrimination in terms of history, power, and social perception. Includes knowledge and skills acquisition in cooperative learning, multicultural education, group dynamics, social influence, effective leadership, judgment and decision-making, prejudice reduction, conflict resolution. ",
    "prereq": []
  },
  {
    "uid": "797822",
    "code": "EPSY5141",
    "subject": "EPSY",
    "number": "5141",
    "honors": false,
    "writingIntensive": false,
    "name": "Aggression in Schools",
    "fullname": "Aggression in Schools",
    "info": "Development of aggression in schools. Aggression defined, compared to cooperative/prosocial behavior. Theories, methods, gender/individual differences.",
    "prereq": []
  },
  {
    "uid": "800752",
    "code": "EPSY5142",
    "subject": "EPSY",
    "number": "5142",
    "honors": false,
    "writingIntensive": false,
    "name": "Play in Development",
    "fullname": "Play in Development and Education",
    "info": "Development/functions of play in humans with comparisons made to other species, especially non-human primates. Play as it relates to developmentally appropriate practice.",
    "prereq": []
  },
  {
    "uid": "002221",
    "code": "EPSY5151",
    "subject": "EPSY",
    "number": "5151",
    "honors": false,
    "writingIntensive": false,
    "name": "Cooperative Lrng",
    "fullname": "Cooperative Learning",
    "info": "Participants learn how to use cooperative learning in their setting.  Topics include theory and research, teacher's role, essential components that make cooperation work, teaching social skills, assessment procedures, and collegial teaching teams.",
    "prereq": []
  },
  {
    "uid": "002223",
    "code": "EPSY5152",
    "subject": "EPSY",
    "number": "5152",
    "honors": false,
    "writingIntensive": false,
    "name": "Psy of Conflict Res",
    "fullname": "Psychology of Conflict Resolution",
    "info": "Overview of the field of conflict resolution. Major theories, research, major figures in the field, factors influencing quality of conflict resolution are covered. The nature of conflict, the history of field, and intrapersonal, interpersonal, intergroup conflict, negotiation, mediation are discussed.",
    "prereq": []
  },
  {
    "uid": "802420",
    "code": "EPSY5153",
    "subject": "EPSY",
    "number": "5153",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Dev PreK-Secondary Schools",
    "fullname": "Social Development in PreK to Secondary Schools",
    "info": "Social development in educational settings, from preschool through high school.",
    "prereq": []
  },
  {
    "uid": "002227",
    "code": "EPSY5154",
    "subject": "EPSY",
    "number": "5154",
    "honors": false,
    "writingIntensive": false,
    "name": "Organiz Dev&Change",
    "fullname": "Organization Development and Change",
    "info": "Overview of organizational development and change. Normative models of effective organizations, entry and contracting skills, diagnosis procedures  and intervention procedures (data feedback, skills training, continuous improvement, mediation).",
    "prereq": []
  },
  {
    "uid": "002228",
    "code": "EPSY5155",
    "subject": "EPSY",
    "number": "5155",
    "honors": false,
    "writingIntensive": false,
    "name": "GrpDynam&SocInfluen",
    "fullname": "Group Dynamics and Social Influence",
    "info": "Overview of the field of group dynamics with emphasis on social influence.  Major theories, research, and figures in the field are covered. Group goals, communication, leadership, decision making, problem solving, conflicts, power, uniqueness theory, deindividuation, and minority influence will be covered.",
    "prereq": []
  },
  {
    "uid": "002232",
    "code": "EPSY5156",
    "subject": "EPSY",
    "number": "5156",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc/PersInfluen-Ed",
    "fullname": "Social and Personality Influences on Education",
    "info": "Survey of social psychology and personality applied to education.  Application of major theories and research to classroom and school practices and educational issues are emphasized. Class sessions include lectures, discussions, simulations, experiential exercises. Intrapersonal, interpersonal, and group dynamics are discussed.",
    "prereq": []
  },
  {
    "uid": "002220",
    "code": "EPSY5157",
    "subject": "EPSY",
    "number": "5157",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Dev Psy of Educ",
    "fullname": "Social & Developmental Psychology of Education",
    "info": "Social and developmental psychology provides the underpinnings for a range of methods for conducting research in real-world settings. They also lay conceptual foundations for understanding a range of social and developmental processes. The course will cover a full range of topics within social and developmental psychology, plus selected topics in personality psychology, and examine their implications for understanding and structuring educational and other professional settings. Discussions will include a strong focus on educator and practitioner applications of research. The course is a survey course of issues related to both social psychology and human development and, their application to applied settings. It is designed for graduate students from all fields with interests in social processes. Typically, each class period of the course will include a combination of lecture, class discussion, small group cooperative learning work, and videos.",
    "prereq": []
  },
  {
    "uid": "793595",
    "code": "EPSY5158",
    "subject": "EPSY",
    "number": "5158",
    "honors": false,
    "writingIntensive": false,
    "name": "Power/Influence to Effect Chng",
    "fullname": "Using Power and Influence to Effect Change",
    "info": "How people can influence others and avoid manipulation. Factors that shape extent to which influence is successful. Indirect/direct influence processes, minority influence, motivation, behavior management, conformity, followership, group dynamics.",
    "prereq": []
  },
  {
    "uid": "003132",
    "code": "EPSY5200",
    "subject": "EPSY",
    "number": "5200",
    "honors": false,
    "writingIntensive": false,
    "name": "SpecTopics:PsyFndns",
    "fullname": "Special Topics: Psychological Foundations",
    "info": "Focus on special topics in psychological and methodological concepts relevant to advanced educational theory, research, and practice not covered in other courses.",
    "prereq": []
  },
  {
    "uid": "003551",
    "code": "EPSY5216",
    "subject": "EPSY",
    "number": "5216",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Res: EPsy & Human Dev",
    "fullname": "Introduction to Research in Educational Psychology and Human Development",
    "info": "Designing/conducting a research study. Reviewing literature, formulating research problem, using different approaches to gather data, managing/analyzing data, reporting results.prereq: 5261 or intro statistics course",
    "prereq": {
      "code": "EPSY 5261",
      "subject": "EPSY",
      "id": "5261"
    }
  },
  {
    "uid": "002246",
    "code": "EPSY5217",
    "subject": "EPSY",
    "number": "5217",
    "honors": false,
    "writingIntensive": false,
    "name": "Prosem: Educ Psych",
    "fullname": "Proseminar in Educational Psychology",
    "info": "Survey and examination of the types of research done in educational psychology. Special attention given to the types of research proposed or done by faculty and students in educational psychology.",
    "prereq": []
  },
  {
    "uid": "806662",
    "code": "EPSY5220",
    "subject": "EPSY",
    "number": "5220",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics: QME",
    "fullname": "Special Topics: Quantitative Methods",
    "info": "Focus on special topics in methodological concepts involving theory, research, and practice in statistics, measurement, evaluation, and statistics education not covered in other courses.",
    "prereq": []
  },
  {
    "uid": "002247",
    "code": "EPSY5221",
    "subject": "EPSY",
    "number": "5221",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Educ & Psy Meas",
    "fullname": "Principles of Educational and Psychological Measurement",
    "info": "Concepts, principles, and methods in educational/psychological measurement. Reliability, validity, item analysis, scores, score reports (e.g., grades). Modern measurement theories, including item response theory and generalizability theory. Emphasizes construction, interpretation, use, and evaluation of assessments regarding achievement, aptitude, interests, attitudes, personality, and exceptionality.",
    "prereq": []
  },
  {
    "uid": "804058",
    "code": "EPSY5223",
    "subject": "EPSY",
    "number": "5223",
    "honors": false,
    "writingIntensive": false,
    "name": "Standard Setting",
    "fullname": "Introduction to Performance Standard Setting Methods",
    "info": "Current performance standard setting practices, particularly as applied to achievement tests.",
    "prereq": []
  },
  {
    "uid": "002018",
    "code": "EPSY5231",
    "subject": "EPSY",
    "number": "5231",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Stat/Meas Ed",
    "fullname": "Introductory Statistics and Measurement in Education",
    "info": "Students develop an understanding of basic statistics and measurement concepts and tools and apply them to the collection, analysis, and interpretation of data.",
    "prereq": []
  },
  {
    "uid": "792018",
    "code": "EPSY5243",
    "subject": "EPSY",
    "number": "5243",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles & Methods of Eval",
    "fullname": "Principles and Methods of Evaluation",
    "info": "Introductory course in program evaluation; planning an evaluation study, collecting and analyzing information, reporting results; overview of the field of program evaluation.",
    "prereq": []
  },
  {
    "uid": "791039",
    "code": "EPSY5244",
    "subject": "EPSY",
    "number": "5244",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey Design/Sampling/Implem",
    "fullname": "Survey Design, Sampling, and Implementation",
    "info": "Survey methods, including mail, phone, and Web-based/e-mail surveys.  Principles of measurement, constructing questions/forms, pilot testing, sampling, data analysis, reporting. Students develop a survey proposal and a draft survey, pilot the survey, and develop sampling/data analysis plans.prereq: [5221 or 5231 or 5261 or equiv], [CEHD grad student or MEd student]",
    "prereq": {
      "or": [
        {
          "code": "EPSY 5221",
          "subject": "EPSY",
          "id": "5221"
        },
        {
          "code": "EPSY 5231",
          "subject": "EPSY",
          "id": "5231"
        },
        {
          "code": "EPSY 5261",
          "subject": "EPSY",
          "id": "5261"
        }
      ]
    }
  },
  {
    "uid": "804066",
    "code": "EPSY5245",
    "subject": "EPSY",
    "number": "5245",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey Data Analysis",
    "fullname": "Advanced Survey Data Analysis for Categorical and Rating Scale Data",
    "info": "Practical course. Specific nature of survey data (typically categorical or ordinal). Appropriate data analytic methods.prereq: 5244, 5261",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5244",
          "subject": "EPSY",
          "id": "5244"
        },
        {
          "code": "EPSY 5261",
          "subject": "EPSY",
          "id": "5261"
        }
      ]
    }
  },
  {
    "uid": "790757",
    "code": "EPSY5246",
    "subject": "EPSY",
    "number": "5246",
    "honors": false,
    "writingIntensive": false,
    "name": "Eval Colloq:PsyF",
    "fullname": "Evaluation Colloquium: Psychological Foundations",
    "info": "Informal seminar of faculty and advanced students interested in the issues and problems of program evaluation.prereq: 5243 or EdPA 5501",
    "prereq": {
      "or": [
        {
          "code": "EPSY 5243",
          "subject": "EPSY",
          "id": "5243"
        },
        {
          "code": "EDPA 5501",
          "subject": "EDPA",
          "id": "5501"
        }
      ]
    }
  },
  {
    "uid": "791921",
    "code": "EPSY5247",
    "subject": "EPSY",
    "number": "5247",
    "honors": false,
    "writingIntensive": false,
    "name": "Qualitative Methods in EPsy",
    "fullname": "Qualitative Methods in Educational Psychology",
    "info": "Introduction to qualitative methods of inquiry. Contrasting different research traditions (e.g., case study, phenomenology, ethnography, social interactionism, critical theory). Practice with field notes, observations, and interviewing. Use of NVIVO to track/code data.prereq: Graduate student or Applied Psychology in Educational and Community Settings Minor",
    "prereq": []
  },
  {
    "uid": "002250",
    "code": "EPSY5261",
    "subject": "EPSY",
    "number": "5261",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Statistical Methods",
    "fullname": "Introductory Statistical Methods",
    "info": "EPSY 5261 is designed to engage students in statistics as a principled approach to data collection, prediction, and scientific inference. Students first learn about data collection (e.g., random sampling, random assignment) and examine data descriptively using graphs and numerical summaries. Students build conceptual understanding of statistical inference through the use of simulation-based methods (bootstrapping and randomization) before going on to learn parametric methods, such as t-tests (one-sample and two-sample means), z-tests (one-sample and two-sample proportions), chi-square tests, and regression. This course uses pedagogical methods grounded in research, such as small group activities and discussion.Attention undergraduates: As this is a graduate level course, it does not fulfill the Mathematical Thinking Liberal Education requirement. If you would like to take a statistics course in our department that fulfills that requirement, please consider EPSY 3264.",
    "prereq": []
  },
  {
    "uid": "788804",
    "code": "EPSY5262",
    "subject": "EPSY",
    "number": "5262",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Stat Methods",
    "fullname": "Intermediate Statistical Methods",
    "info": "Application of statistical concepts/procedures. Analysis of variance, covariance, multiple regression. Experimental design: completely randomized, block, split plot/repeated measures.prereq: 3264 or 5261 or equiv",
    "prereq": {
      "or": [
        {
          "code": "EPSY 3264",
          "subject": "EPSY",
          "id": "3264"
        },
        {
          "code": "EPSY 5261",
          "subject": "EPSY",
          "id": "5261"
        }
      ]
    }
  },
  {
    "uid": "002252",
    "code": "EPSY5263",
    "subject": "EPSY",
    "number": "5263",
    "honors": false,
    "writingIntensive": false,
    "name": "Stat:Preprofes Stu",
    "fullname": "Statistics for Preprofessional Students",
    "info": "Descriptive statistics for continuous variables, simple regression and correlation, inferences on means, introduction to analysis of variance and multiple regression, contingency tables, and computer analysis techniques.",
    "prereq": []
  },
  {
    "uid": "791170",
    "code": "EPSY5271",
    "subject": "EPSY",
    "number": "5271",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Statistics",
    "fullname": "Becoming a Teacher of Statistics",
    "info": "Current methods of teaching first courses in statistics. Innovative teaching methods, materials, and technological tools. Types of first courses, reform recommendations, goals for student learning, recommended content, teaching methods, technology, student assessment.prereq: 5261 or equiv",
    "prereq": {
      "code": "EPSY 5261",
      "subject": "EPSY",
      "id": "5261"
    }
  },
  {
    "uid": "794255",
    "code": "EPSY5272",
    "subject": "EPSY",
    "number": "5272",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistics Teaching Internship",
    "fullname": "Statistics Teaching Internship",
    "info": "Supervised teaching experience.prereq: Grad student, instr consent",
    "prereq": []
  },
  {
    "uid": "794256",
    "code": "EPSY5273",
    "subject": "EPSY",
    "number": "5273",
    "honors": false,
    "writingIntensive": false,
    "name": "Methodology Tchg Internship",
    "fullname": "Methodology Teaching Internship",
    "info": "Supervised teaching experience as part of a course in statistics, measurement, or evaluation.",
    "prereq": []
  },
  {
    "uid": "002253",
    "code": "EPSY5281",
    "subject": "EPSY",
    "number": "5281",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Computer Oper",
    "fullname": "Introduction to Computer Operations and Data Analysis in Education and Related Fields",
    "info": "How to use the computer to access/analyze information. National, state, local, and specialty Web sites that contain data of interest to social scientists. Using EXCEL, SPSS, SAS, and R for data analysis.",
    "prereq": []
  },
  {
    "uid": "790056",
    "code": "EPSY5300",
    "subject": "EPSY",
    "number": "5300",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Educ Psych",
    "fullname": "Special Topics in Educational Psychology",
    "info": "Current issues in educational psychology or related areas not normally available through regular curriculum offerings.",
    "prereq": []
  },
  {
    "uid": "003109",
    "code": "EPSY5400",
    "subject": "EPSY",
    "number": "5400",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshp:CounselPsy",
    "fullname": "Special Topics in Counseling Psychology",
    "info": "Theory, research, and practice in counseling and student personnel psychology. Topics vary.",
    "prereq": []
  },
  {
    "uid": "002151",
    "code": "EPSY5401",
    "subject": "EPSY",
    "number": "5401",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Proc",
    "fullname": "Counseling Procedures",
    "info": "Emphasis on the counseling relationship and principles of interviewing. Case studies, role playing, and demonstration. For individuals whose professional work includes counseling and interviewing.prereq: Upper div student",
    "prereq": []
  },
  {
    "uid": "001934",
    "code": "EPSY5402",
    "subject": "EPSY",
    "number": "5402",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Theories & Skills",
    "fullname": "Counseling History and Theories",
    "info": "This course provides a broad introduction to professional counseling. Students will explore the major historical and contextual factors that have influenced the counseling field, with particular focus on theories and models of counseling practice. Roles and responsibilities of the professional counselor will also be discussed. Coursework will emphasize professional development via self-reflection, awareness of context and culture, and cultivation of counselor identity.",
    "prereq": []
  },
  {
    "uid": "001807",
    "code": "EPSY5403",
    "subject": "EPSY",
    "number": "5403",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Diverse Populations",
    "fullname": "Counseling Diverse Populations",
    "info": "This course addresses counseling implications for diverse individuals and families. Students will understand the impact of worldview and other factors such as ethnicity, culture, religious preference, socioeconomic status, gender identity, sexual orientation, and disabilities in community, higher education, and school settings. Students will examine their own worldviews as it relates to the topics discussed. Advocacy and social justice practices for working with diverse populations will also be addressed.",
    "prereq": []
  },
  {
    "uid": "001938",
    "code": "EPSY5404",
    "subject": "EPSY",
    "number": "5404",
    "honors": false,
    "writingIntensive": false,
    "name": "GroupCouns",
    "fullname": "Group Counseling",
    "info": "This course addresses foundations of group counseling that can be applied to multiple settings with a variety of diverse populations and age groups. Essential group leadership skills, types of groups, stages, planning, and evaluating groups will be covered. Additional topics include legal and ethical issues involved in group counseling, group dynamics, and therapeutic factors.",
    "prereq": []
  },
  {
    "uid": "001759",
    "code": "EPSY5405",
    "subject": "EPSY",
    "number": "5405",
    "honors": false,
    "writingIntensive": false,
    "name": "CareerCouns",
    "fullname": "Career Counseling",
    "info": "This course covers career development theories, career counseling procedures and techniques, career assessment/interpretation, and career development programming across the lifespan. Career interventions and resources will be discussed that relate to diverse populations within school, community, and higher education settings.",
    "prereq": []
  },
  {
    "uid": "796878",
    "code": "EPSY5406",
    "subject": "EPSY",
    "number": "5406",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics in Counseling",
    "fullname": "Ethics in Counseling",
    "info": "This course will help students deeply explore the ethical standards and legal principles that must be referenced when making decisions in the practice of counseling. Students will learn how to apply the ethical standards and federal/state legal statutes to complex counseling cases. Ethical standards related to assessment, diagnosis, and practice are discussed in relation to counseling diverse populations in school, community, and higher education settings.",
    "prereq": []
  },
  {
    "uid": "800646",
    "code": "EPSY5407",
    "subject": "EPSY",
    "number": "5407",
    "honors": false,
    "writingIntensive": false,
    "name": "Diagnosis and Treatment",
    "fullname": "Diagnosis and Treatment in Counseling",
    "info": "Etiology, symptom patterns, and assessment/treatment for various psychological disorders. Models of diagnosis. Empirically validated psychological assessment and counseling methods. Attention to cultural competency in assessment, diagnosis, and treatment.",
    "prereq": []
  },
  {
    "uid": "819016",
    "code": "EPSY5408",
    "subject": "EPSY",
    "number": "5408",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Skills",
    "fullname": "Counseling Skills",
    "info": "This course introduces students to fundamental techniques and skills of professional counseling. Students will practice basic interviewing skills, with a focus on rapport-building and evidence-based counseling relationships. Specific techniques for facilitating exploration, insight, and change will also be covered.  Finally, students will integrate knowledge of counseling models and basic skills through a series of videotaped counseling practice and self-reflection assignments.",
    "prereq": []
  },
  {
    "uid": "818793",
    "code": "EPSY5409",
    "subject": "EPSY",
    "number": "5409",
    "honors": false,
    "writingIntensive": false,
    "name": "Trauma and Crisis Counseling",
    "fullname": "Trauma and Crisis Counseling",
    "info": "This course provides an overview of theories and skills commonly used by counselors working with clients in crisis. The first half of the course will cover assessment, impacts, and treatment of psychological trauma, including trauma-informed approaches to crisis situations. The second half of the course will cover specific types of crises commonly seen by counselors in a range of community and educational settings, with a focus on ethical and multiculturally-competent practice. There will be an emphasis on resiliency and self-care throughout the course.",
    "prereq": []
  },
  {
    "uid": "818794",
    "code": "EPSY5411",
    "subject": "EPSY",
    "number": "5411",
    "honors": false,
    "writingIntensive": false,
    "name": "College Cnslng & Stdnt Affairs",
    "fullname": "Introduction to College Counseling and Student Affairs",
    "info": "This course introduces students to foundational knowledge, skills, and resources important for work in higher education counseling and student affairs settings. Students will learn and apply theories of leadership, organizational change, and student development important for the field, with a focus on recognizing the diversity of higher educational contexts. Orientation to professional higher education counseling (e.g. history of the profession, professional organizations, current labor market strategies) will also be emphasized. Finally, students will consider current trends in higher education, including assessment and evaluation, the impact of technology on student affairs work, and individual differences among institutions and students.",
    "prereq": []
  },
  {
    "uid": "001739",
    "code": "EPSY5412",
    "subject": "EPSY",
    "number": "5412",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro:DevCouns/Guid",
    "fullname": "Introduction to Developmental Counseling and Guidance",
    "info": "Contemporary models of counselors as advocates for all students. Emphasizes prevention and systems intervention with counselors involved in the developmental guidance curriculum, school change, staff and community collaboration, individual student planning, and learning success with diverse populations.",
    "prereq": []
  },
  {
    "uid": "818746",
    "code": "EPSY5414",
    "subject": "EPSY",
    "number": "5414",
    "honors": false,
    "writingIntensive": false,
    "name": "School Counslr Accountability",
    "fullname": "School Counselor Accountability, Advocacy, and Leadership",
    "info": "This course will equip school counselors-in-training with the knowledge and skills to develop intentional, data-driven school counseling programs. Focus will be given to evidence-based counseling interventions. Students will learn how to use data both in the development and evaluation of their school counseling program. Students will practice using data to advocate while also developing their leadership skills.",
    "prereq": []
  },
  {
    "uid": "793102",
    "code": "EPSY5415",
    "subject": "EPSY",
    "number": "5415",
    "honors": false,
    "writingIntensive": false,
    "name": "CounselingChildAdol",
    "fullname": "Counseling Children and Adolescents",
    "info": "Development, issues, and needs of children, kindergarten through high school ages. Counseling/developmental theory/strategies. Cultural diversity, legal/ethical issues in counseling children/adolescents.prereq: Grad student or MEd student or K-12 [counseling endorsement or licensure] student",
    "prereq": []
  },
  {
    "uid": "819017",
    "code": "EPSY5416",
    "subject": "EPSY",
    "number": "5416",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro - Clinical Mental Health",
    "fullname": "Introduction to Clinical Mental Health Counseling",
    "info": "This course will help students understand the foundations of the clinical mental health counseling profession. The major focus will be on developing a counselor identity and learning about the history and evolution of mental health counseling as a field.",
    "prereq": []
  },
  {
    "uid": "825655",
    "code": "EPSY5417",
    "subject": "EPSY",
    "number": "5417",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Research Prac",
    "fullname": "Counseling Research Practicum",
    "info": "The purpose of this course is to enable students to develop applied research expertise consistent with their responsibilities as licensed professional counselors, licensed professional clinical counselors, higher education counselors, school counselors, career counselors, and professionals in other counseling-related fields. This is the first course in the 2-course Counseling Research Practicum sequence.",
    "prereq": []
  },
  {
    "uid": "792017",
    "code": "EPSY5421",
    "subject": "EPSY",
    "number": "5421",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadrshp/Admin Student Affairs",
    "fullname": "Leadership and Administration of Student Affairs",
    "info": "Theoretical approaches, administrative structure, and evaluation methods used in college/university student affairs.",
    "prereq": []
  },
  {
    "uid": "001929",
    "code": "EPSY5422",
    "subject": "EPSY",
    "number": "5422",
    "honors": false,
    "writingIntensive": false,
    "name": "PrincGrpWk:Th&Proc",
    "fullname": "Principles of Group Work: Theory and Procedures",
    "info": "Principles and practices of group work for educators and the helping professions. Discussion of various types of groups (e.g., counseling support, task, psychoeducational). Applications to various settings and populations (e.g., schools and community agencies).",
    "prereq": []
  },
  {
    "uid": "825665",
    "code": "EPSY5427",
    "subject": "EPSY",
    "number": "5427",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Counseling Research Prac",
    "fullname": "Advanced Counseling Research Practicum",
    "info": "The purpose of this course is to enable students to gain further skills in developing applied research expertise consistent with their responsibilities as licensed professional counselors, licensed professional clinical counselors, higher education, school, and career counselors, and professionals in other counseling-related fields. This is the second of a 2-course Counseling Research Practicum sequence.prereq: Completion of EPSY 5417 for 2 credit hours",
    "prereq": {
      "code": "EPSY 5417",
      "subject": "EPSY",
      "id": "5417"
    }
  },
  {
    "uid": "818747",
    "code": "EPSY5429",
    "subject": "EPSY",
    "number": "5429",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Con in Clinical Ment Healt",
    "fullname": "Advanced Concepts in Clinical Mental Health",
    "info": "This course provides advanced counseling students with an opportunity to explore more deeply recent trends, new ideas, and contemporary issues in clinical mental health. Current research and practice around a variety of topics, such as identifying and counseling clients with substance use and co-occurring disorders, counseling clients with eating disorders, genetic counseling and the role of genetics in mental health, neurology, neuropharmacology, the role of counselors in referral and supporting clients under psychiatric care, and how counselors can work effectively on mental health teams, interface with other health and mental health professionals, and advocate for persons with mental health issues will be explored. Students will consider human diversity and counseling with clients from diverse backgrounds and perspectives, as well as the use of evidence-based and innovative practices in treatment within each of these areas of study.",
    "prereq": []
  },
  {
    "uid": "001784",
    "code": "EPSY5433",
    "subject": "EPSY",
    "number": "5433",
    "honors": false,
    "writingIntensive": false,
    "name": "Couns Wmn:LifeSpan",
    "fullname": "Counseling Women Over the Life Span",
    "info": "Counseling skills and interventions to facilitate career development of girls and women of different life stages and backgrounds (school girls to older women); developmental issues from a systematic integrative life planning framework; facts, myths, and trends regarding women's changing roles.",
    "prereq": []
  },
  {
    "uid": "001932",
    "code": "EPSY5434",
    "subject": "EPSY",
    "number": "5434",
    "honors": false,
    "writingIntensive": false,
    "name": "Couns Adults Trans",
    "fullname": "Counseling Adults in Transition",
    "info": "Psychological, physical, and social dimensions of adult transitions (e.g., family and personal relationships, career). Adult development theories, stress and coping, and helping skills and strategies as they relate to adult transition.",
    "prereq": []
  },
  {
    "uid": "001846",
    "code": "EPSY5435",
    "subject": "EPSY",
    "number": "5435",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Sch Counseling",
    "fullname": "Introduction to School Counseling",
    "info": "History/evolution of school counselor role in schools. Duties/demands of school counselor. Examine comprehensive guidance programming in K-12 schools. Issues in school counseling profession.prereq: Ed Psych Counselor Ed grad student in school counselor prog or instr consent",
    "prereq": []
  },
  {
    "uid": "791774",
    "code": "EPSY5436",
    "subject": "EPSY",
    "number": "5436",
    "honors": false,
    "writingIntensive": false,
    "name": "Crisis/Consulting in Schools",
    "fullname": "Crisis Management and Consulting in Schools",
    "info": "Issues, topics, problems. Diversity in school counseling. Review, discussion, analysis of current literature. Students develop prevention, intervention, guidance programs for K-12 schools.prereq: CSPP grad student in school counselor program or instr consent",
    "prereq": []
  },
  {
    "uid": "818748",
    "code": "EPSY5437",
    "subject": "EPSY",
    "number": "5437",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Research Design",
    "fullname": "Counseling Research Design",
    "info": "This capstone course is an integration of science and practice. Students will learn research design techniques that are relevant and accessible to counselors in full-time practice, counselor educators, counseling consultants, and others in the counseling professions. Students will develop knowledge and skills related to identifying evidence-based counseling practices, developing and measuring client outcomes, analyzing and using data in counseling, and understanding how to implement ethical and culturally relevant research, data interpretation, and reporting strategies. The bulk of coursework will be the development, presentation, and defense of a research proposal in students’ areas of interest. Students will learn the importance of research in advancing the counseling profession, and will practice using multiple data sources to inform programs and services in schools, counseling agencies, and higher education settings.",
    "prereq": []
  },
  {
    "uid": "818749",
    "code": "EPSY5438",
    "subject": "EPSY",
    "number": "5438",
    "honors": false,
    "writingIntensive": false,
    "name": "Evdnc-Based Prac Counseling II",
    "fullname": "Evidence-Based Practices in Counseling II",
    "info": "This two-semester capstone course is a hands-on integration of science and practice in professional counseling.  Students will learn research techniques relevant and accessible to counselors in full-time practice, including assessment of measurable client outcomes, evaluation of evidence-based counseling practice, and integration of scientific literature into professional work.  The bulk of coursework will be a semester-long research project informed by students' practicum placements, including a literature review, presentation of original single-case research, and an empirical research proposal.  ",
    "prereq": []
  },
  {
    "uid": "818750",
    "code": "EPSY5439",
    "subject": "EPSY",
    "number": "5439",
    "honors": false,
    "writingIntensive": false,
    "name": "Case Concept - Clinical MH",
    "fullname": "Case Conceptualization and Treatment Planning - Clinical Mental Health",
    "info": "This course introduces students to fundamental assessment, interviewing, case conceptualization, and treatment planning skills used by counselors in community and higher education settings. Students will have the opportunity to observe and practice intake interviews, to conceptualize clients from a culturally-informed, biopsychosocial perspective, and identify and communicate measurable treatment goals and effective interventions. Students will also work in groups to more deeply investigate and apply various approaches to case conceptualization and receive feedback from peers.",
    "prereq": []
  },
  {
    "uid": "002508",
    "code": "EPSY5451",
    "subject": "EPSY",
    "number": "5451",
    "honors": false,
    "writingIntensive": false,
    "name": "College Students Today",
    "fullname": "College Students Today",
    "info": "Issues involving diverse populations of students in colleges/universities.  Student development theory, students' expectations/interests, how college affects student outcomes. Role of curricular/extracurricular activities and of student-faculty interactions.",
    "prereq": []
  },
  {
    "uid": "003111",
    "code": "EPSY5461",
    "subject": "EPSY",
    "number": "5461",
    "honors": false,
    "writingIntensive": false,
    "name": "Cross-Cultural Counseling",
    "fullname": "Cross-Cultural Counseling",
    "info": "Effect of cross-cultural/cross-national psychological differences in human traits/characteristics. Framework for development/implementation of counseling interventions.",
    "prereq": []
  },
  {
    "uid": "826259",
    "code": "EPSY5462",
    "subject": "EPSY",
    "number": "5462",
    "honors": false,
    "writingIntensive": false,
    "name": "Case Concept. (Dual Licensure)",
    "fullname": "Case Conceptualization and Treatment Planning -- Dual Licensure",
    "info": "This course introduces students to fundamental assessment, interviewing, case conceptualization, and treatment planning skills used by counselors in clinical mental health settings. Thus, it is appropriate for students in the school counseling track intending to pursue counseling licensure or work in a mental health capacity. Students will have the opportunity to observe and practice intake interviews, to conceptualize clients from a culturally-informed, biopsychosocial perspective, and identify and communicate measurable treatment goals and effective interventions. Students will also work in groups to more deeply investigate and apply various approaches to case conceptualization and receive feedback from peers.prereq: Graduate student in counselor education or a related field, or by instructor permission",
    "prereq": []
  },
  {
    "uid": "826270",
    "code": "EPSY5463",
    "subject": "EPSY",
    "number": "5463",
    "honors": false,
    "writingIntensive": false,
    "name": "NCMHCE Test Prep",
    "fullname": "NCMHCE Test Prep",
    "info": "In this course, students will work through case studies analyzing diagnosis, treatment planning, and interventions for clinical mental health. Participants will review significant theories, assessments, interventions, and review testing vignettes for the national exam. Students will be taught how to critically analyze case studies and vignettes to make educated decisions on how to handle various clinical situations.prereq: Graduate student in counselor education or a related field, or by instructor permission.",
    "prereq": []
  },
  {
    "uid": "818795",
    "code": "EPSY5481",
    "subject": "EPSY",
    "number": "5481",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in School Counseling",
    "fullname": "Practicum in School Counseling",
    "info": "This course is designed to support student growth in their development as a school counselor and to add to the training that they receive at their on-site placements. While enrolled in this course, students will be counseling clients in schools for the first time since entering this program. This class is designed to provide group supervision and support during their time on site. It is also designed to provide classroom instruction in areas that are relevant to the practice of school counseling. The course content will be delivered via class discussion, case presentations, tape review and online discussions. During the practicum, students will accrue a minimum of 100 hours, but will not exceed 200 hours at their practicum site. Faculty will collaborate biweekly with site supervisors to ensure that their needs are met and to provide support for the individual supervision that takes place on site.",
    "prereq": []
  },
  {
    "uid": "818796",
    "code": "EPSY5482",
    "subject": "EPSY",
    "number": "5482",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac in Clinical Mental Health",
    "fullname": "Practicum in Clinical Mental Health",
    "info": "This course is designed to support student growth in their development as a counselor and to add to the training that they receive at their on-site placements. While enrolled in this course, students will be counseling clients in various settings for the first time since entering this program. This class is designed to provide group supervision and support during their time on site. It is also designed to provide classroom instruction in areas that are relevant to the practice of counseling. The course content will be delivered via class discussion, case presentations, tape review, and online discussions.",
    "prereq": []
  },
  {
    "uid": "001941",
    "code": "EPSY5483",
    "subject": "EPSY",
    "number": "5483",
    "honors": false,
    "writingIntensive": false,
    "name": "Intern I",
    "fullname": "Internship I",
    "info": "Supervised practice in counseling with individuals and groups; emphasizes systematic evaluation of student?s counseling practice through direct observations, video, and audio tapes.",
    "prereq": []
  },
  {
    "uid": "001946",
    "code": "EPSY5484",
    "subject": "EPSY",
    "number": "5484",
    "honors": false,
    "writingIntensive": false,
    "name": "Intern II",
    "fullname": "Internship II",
    "info": "Intermediate supervised practice in counseling with individuals and groups; emphasizes ethical issues with systematic evaluation of student?s practice through direct observations, video, and audio tapes.",
    "prereq": []
  },
  {
    "uid": "001591",
    "code": "EPSY5601",
    "subject": "EPSY",
    "number": "5601",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey--Special Ed",
    "fullname": "Survey of Special Education",
    "info": "Introduction to programs and services provided to people with disabilities in school and community settings. Emphasis on the needs of families, to the roles and responsibilities of teachers, and to related service providers.",
    "prereq": []
  },
  {
    "uid": "003446",
    "code": "EPSY5602",
    "subject": "EPSY",
    "number": "5602",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Tech:SpEd",
    "fullname": "Computer Technology in Special Education",
    "info": "Develop skills, understand processes, and identify resources needed to utilize technology to benefit persons with disabilities. Emphasis on learning theory, principles of effective instruction, instructional and assistive technology integration.",
    "prereq": []
  },
  {
    "uid": "001580",
    "code": "EPSY5603",
    "subject": "EPSY",
    "number": "5603",
    "honors": false,
    "writingIntensive": false,
    "name": "Childhood Lang Dev",
    "fullname": "Childhood Language Development: Classroom Implications",
    "info": "Recent trends and findings in the study of language acquisition and communication; classroom implications, including education of exceptional children and implications of diversity on instruction.",
    "prereq": []
  },
  {
    "uid": "001584",
    "code": "EPSY5604",
    "subject": "EPSY",
    "number": "5604",
    "honors": false,
    "writingIntensive": false,
    "name": "Transition From School to Work",
    "fullname": "Transition From School to Work and Community Living for Persons With Special Needs",
    "info": "Use of strategies/models for improving transition of youth from school to work and community living. Course content that specifically addresses all phases of student assessment, individualized transition planning. Parent, family, and student involvement in designing post school options. Community-based services (employment, residential living, social and recreational services, etc). Comprehensive interagency approaches.",
    "prereq": []
  },
  {
    "uid": "809191",
    "code": "EPSY5605W",
    "subject": "EPSY",
    "number": "5605",
    "honors": false,
    "writingIntensive": true,
    "name": "Collaborative Prac Sp Ed",
    "fullname": "Collaborative Practices for the Special Educator",
    "info": "Skills/knowledge required to consult/collaborate with school personnel, families, other professionals to maintain effective educational support.",
    "prereq": []
  },
  {
    "uid": "001165",
    "code": "EPSY5609",
    "subject": "EPSY",
    "number": "5609",
    "honors": false,
    "writingIntensive": false,
    "name": "Fam-Ctrd Early Intervention",
    "fullname": "Infants and Toddlers with Delays/Disabilities: Family-Centered Approaches to Early Intervention",
    "info": "This course was designed to provide pre-service and current teachers as well as related service providers with the knowledge and skills needed to understand the dynamic ecosystems of families with a child with disabilities. Students will be introduced to the major methods, philosophies, and current research that emphasize effective family-professional collaboration in planning and service delivery for infants and young children with disabilities. The focus is on a family-centered approach to assess and design educational plans and interventions, with a specific emphasis on relationship building and understanding the diverse perspectives on family life and developmental expectations.",
    "prereq": []
  },
  {
    "uid": "809192",
    "code": "EPSY5611",
    "subject": "EPSY",
    "number": "5611",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prac with Acad & Behav Dis",
    "fullname": "Research-based Practices in Academic and Behavior Disabilities",
    "info": "Research that provides conceptual basis to aid in understanding of students with academic difficulties. Develop critical thinking skills through examination of research-based practices.",
    "prereq": []
  },
  {
    "uid": "001174",
    "code": "EPSY5612",
    "subject": "EPSY",
    "number": "5612",
    "honors": false,
    "writingIntensive": false,
    "name": "Undrstnd Acad Disab",
    "fullname": "Understanding of Academic Disabilities",
    "info": "Introduction to issues related to the education of students with academic disabilities (learning disabilities, mild mental intellectual disabilities, and emotional/behavioral disabilities) including history, definition, assessment, classification, legislation, and intervention approaches.",
    "prereq": []
  },
  {
    "uid": "001601",
    "code": "EPSY5613",
    "subject": "EPSY",
    "number": "5613",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndns of SpEd--I",
    "fullname": "Foundations of Special Education I",
    "info": "To review the foundations of special education, culminating in an understanding of the application of the IDEAL Problem Solving Model. The course will address concepts related to exceptionality; historical and legal foundations; problem solving and tools of inquiry; collaborative relationships with families, educational, and community professionals; support of students with disabilities in general education; characteristics of students with high and low incidence disabilities, and ethics. Teacher candidates will learn methods of formative assessment using curriculum-based measures (CBM) and practice analyzing data to make instructional decisions and inform early intervention for struggling students.",
    "prereq": []
  },
  {
    "uid": "001099",
    "code": "EPSY5614W",
    "subject": "EPSY",
    "number": "5614",
    "honors": false,
    "writingIntensive": true,
    "name": "Assessment & Due Process Sp Ed",
    "fullname": "Assessment and Due Process in Special Education",
    "info": "Participants will learn basic standardized assessment and how it directly relates to special education. In addition, students will use the assessment as part of an ongoing process for making instructional programming decisions. Students will apply skills in designing and evaluating assessment plans and in making eligibility decisions.",
    "prereq": []
  },
  {
    "uid": "001177",
    "code": "EPSY5615",
    "subject": "EPSY",
    "number": "5615",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Academic Intervention",
    "fullname": "Advanced Academic Interventions",
    "info": "Designing, implementing, and evaluating individual educational plans (IEPs) for special education service in learning disabilities, emotional/behavioral disorders, and mild mental/intellectual disabilities.prereq: 5612",
    "prereq": {
      "code": "EPSY 5612",
      "subject": "EPSY",
      "id": "5612"
    }
  },
  {
    "uid": "001188",
    "code": "EPSY5616W",
    "subject": "EPSY",
    "number": "5616",
    "honors": false,
    "writingIntensive": true,
    "name": "Mgmt & Behavior Analy Prob Sol",
    "fullname": "Classroom Management and Behavior Analytic Problem Solving",
    "info": "Focuses on principles of behavior analysis and procedures used in the assessment and management of classroom behavior.  Although the application of behavioral principles in educational settings is the central purpose of this course, complementary issues related to general classroom management will also be addressed.  Consistent with the mission of the College of Education and Human Development, this course aims to strengthen effective educational practice, promote inquiry, and build leadership skills for regular and special educators and professionals in allied fields.Community Engaged Learning (CEL): This course integrates community engaged learning in an educational setting, which may include day-care centers, pre-kindergarten programs, K-12 schools, and post-secondary transition programs. Students are required to engage in a community placement for a minimum of 2 hours per week (20 hours total). Licensure students should use their pre-student teaching field experience placements as their CEL site and must complete the minimum number of hours required of their field experience course.Note: Teacher licensure candidates should register for the appropriate pre-student teaching field experience in accordance with their program plans. Non-licensure students have two options for securing a CEL placement: (1) register for 1 credit of EPSY 3701/5701 Practicum: Field Experience in General Education – Inclusive Classrooms or (2) secure a placement through the UMN Center for Community Engaged Learning (information provided in class).prereq: For online sections, students must be an ASD certificate candidate or a Special Education Major or Special Education M.Ed./M.A.",
    "prereq": []
  },
  {
    "uid": "809193",
    "code": "EPSY5617",
    "subject": "EPSY",
    "number": "5617",
    "honors": false,
    "writingIntensive": false,
    "name": "Acad & Social Interventions",
    "fullname": "Academic and Social Interventions for Students with Mild to Moderate Disabilities",
    "info": "Use problem solving model to make data-based decisions regarding implementation and evaluation of instruction for students with academic and behavioral difficulties.",
    "prereq": []
  },
  {
    "uid": "799944",
    "code": "EPSY5618",
    "subject": "EPSY",
    "number": "5618",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Int Students Wrt Lang",
    "fullname": "Specialized Interventions for Students With Mild/Moderate Disabilities in Reading & Written Language",
    "info": "The purpose of this course is to prepare teachers of students at risk and with academic disabilities to address their specific learning needs in the area of reading and written language, using a data-based decision-making approach. Through course readings, lectures, discussions, cooperative group work, microteaching, and field experiences, students will gain knowledge and skills to address the needs of children with difficulties or disabilities that affect reading and writing, including children with dyslexia and dysgraphia.",
    "prereq": []
  },
  {
    "uid": "809194",
    "code": "EPSY5619W",
    "subject": "EPSY",
    "number": "5619",
    "honors": false,
    "writingIntensive": true,
    "name": "Math Intv for Mild-Mod Disabil",
    "fullname": "Specialized Interventions in Mathematics for Students with Mild to Moderate Disabilities",
    "info": "Mathematics interventions using a data-based, decision-making approach. Instructional strategies. Prevention/remediation of mathematics difficulties.",
    "prereq": []
  },
  {
    "uid": "001199",
    "code": "EPSY5621",
    "subject": "EPSY",
    "number": "5621",
    "honors": false,
    "writingIntensive": false,
    "name": "Instructional Design - Dev Dis",
    "fullname": "Assessment and Instructional Design for Students with Developmental Disabilities",
    "info": "Methods/materials course. Functional/standards-based approaches to promoting academic learning in students with developmental disabilities.prereq: 5613, 5614",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5613",
          "subject": "EPSY",
          "id": "5613"
        },
        {
          "code": "EPSY 5614",
          "subject": "EPSY",
          "id": "5614"
        }
      ]
    }
  },
  {
    "uid": "001202",
    "code": "EPSY5622",
    "subject": "EPSY",
    "number": "5622",
    "honors": false,
    "writingIntensive": false,
    "name": "Prog/Curr-Dev Disabilities",
    "fullname": "Programs and Curricula for Students with Developmental Disabilities",
    "info": "Developing programs/curricula for students with moderate, severe, profound developmental delays, as well as severe multihandicapping conditions. Special consideration given to preparing children/youth for integrated community environments.prereq: 5621 or [5661 and 5662]",
    "prereq": {
      "or": [
        {
          "code": "EPSY 5621",
          "subject": "EPSY",
          "id": "5621"
        },
        {
          "and": [
            {
              "code": "EPSY 5661",
              "subject": "EPSY",
              "id": "5661"
            },
            {
              "code": "EPSY 5662",
              "subject": "EPSY",
              "id": "5662"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "816841",
    "code": "EPSY5623",
    "subject": "EPSY",
    "number": "5623",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics App Behavior Analysis",
    "fullname": "Ethics in Applied Behavior Analysis",
    "info": "This course explores ethical and professional considerations that pertain to the practice of applied behavior analysis as well as ethical and disciplinary standards of the profession. Specifically, this course examines the Professional and Ethical Compliance Code for Behavior Analysts. Emphasis will be placed upon ethical and professional conduct and legal issues relevant to BCBA level practitioners. Topics such as informed consent, due process, protection of confidentiality, and selection of least intrusive, least restrictive behavior change procedures will be discussed. This course will focus on ethical decision-making processes. Issues related to cultural and ethnic diversity and ethics in applied behavior analysis will also be explored.",
    "prereq": []
  },
  {
    "uid": "001217",
    "code": "EPSY5624",
    "subject": "EPSY",
    "number": "5624",
    "honors": false,
    "writingIntensive": false,
    "name": "Biomedical/Physical Aspects-DD",
    "fullname": "Biomedical and Physical Impairments of Students with Developmental Disabilities",
    "info": "Anatomy, physiology, kinesthiology. Central/peripheral nervous system. Prenatal, perinatal, postnatal development. Physically disabling conditions. Management/education procedures.",
    "prereq": []
  },
  {
    "uid": "001221",
    "code": "EPSY5625",
    "subject": "EPSY",
    "number": "5625",
    "honors": false,
    "writingIntensive": false,
    "name": "EducChldrnDisabIntr",
    "fullname": "Education of Infants, Toddlers, and Preschool Children with Disabilities: Introduction",
    "info": "Examination of key issues and practices related to early intervention and early childhood special education, with an emphasis on family-focused and inclusive services for children birth to age six.  Students enrolled in this course will be provided with a background in historical and philosophical issues relating to special education, components of due process and data privacy, the IEP/IFSP process, an overview of various disabilities and disorders, and information regarding how disabilities may affect individuals and families.  ",
    "prereq": []
  },
  {
    "uid": "001244",
    "code": "EPSY5626",
    "subject": "EPSY",
    "number": "5626",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Dev Dis&Instruc",
    "fullname": "Seminar: Developmental Disabilities and Instructional Management",
    "info": "Data-based strategies for school and nonschool instruction of learners with developmental disabilities including assessment, design, implementation, and evaluation of curriculum and instruction: curriculum content, concept and task analysis, classroom arrangements, natural and instructional cues, corrections, and consequences.prereq: [5621, 5622] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5621",
          "subject": "EPSY",
          "id": "5621"
        },
        {
          "code": "EPSY 5622",
          "subject": "EPSY",
          "id": "5622"
        }
      ]
    }
  },
  {
    "uid": "809728",
    "code": "EPSY5627",
    "subject": "EPSY",
    "number": "5627",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Advanced LD",
    "fullname": "Seminar: Advanced issues in Learning Disabilities",
    "info": "Read, reflect, lead discussions related to issues in field of LD. Topics examined through relevant research in field of LD.prereq: Special Education graduate or licensure student or instr consent",
    "prereq": []
  },
  {
    "uid": "809737",
    "code": "EPSY5628",
    "subject": "EPSY",
    "number": "5628",
    "honors": false,
    "writingIntensive": false,
    "name": "Characteristics of Mod/Sev LD",
    "fullname": "Characteristics of Moderate to Severe Learning Disabilities",
    "info": "Characteristics of moderate/severe learning disabilities including (but not limited to) cognitive processing, language, attention/memory, co-existing conditions. Dyslexia, dysgraphia, dyscalculia.prereq: Special Education graduate or licensure student or instr consent",
    "prereq": []
  },
  {
    "uid": "809729",
    "code": "EPSY5629",
    "subject": "EPSY",
    "number": "5629",
    "honors": false,
    "writingIntensive": false,
    "name": "Strat Inst Methods At-Risk Stu",
    "fullname": "Strategic Instructional Methods for Students Academically At-Risk",
    "info": "Knowledge/skills needed to teach KU-CRL research-based learning strategies for students considered academically at-risk. Content relevant to basic skills/content instruction for students in K-12 settings will be included.prereq: Special Education graduate or licensure student or instr consent",
    "prereq": []
  },
  {
    "uid": "809195",
    "code": "EPSY5631",
    "subject": "EPSY",
    "number": "5631",
    "honors": false,
    "writingIntensive": false,
    "name": "AAC Module 1: Intro",
    "fullname": "Module 1: Introduction to Augmentative and Alternative Communication",
    "info": "Terms/concepts related to augmentative/alternative communication. Myths/facts regarding AAC.",
    "prereq": []
  },
  {
    "uid": "809196",
    "code": "EPSY5632",
    "subject": "EPSY",
    "number": "5632",
    "honors": false,
    "writingIntensive": false,
    "name": "AAC Module 2: Assessment & Int",
    "fullname": "Module 2: Evidence-based Methods for AAC Assessment and Intervention",
    "info": "Evidence-based tools to conduct augmentative/alternative communication (AAC) assessments. AAC intervention plans. Data-driven strategies to evaluate progress.",
    "prereq": []
  },
  {
    "uid": "809197",
    "code": "EPSY5633",
    "subject": "EPSY",
    "number": "5633",
    "honors": false,
    "writingIntensive": false,
    "name": "AAC Module 3: High Tech AAC",
    "fullname": "Module 3: Speech-generating Devices and High-Tech AAC",
    "info": "Identifying, funding, customizing high-tech augmentative/alternative communication (AAC) interventions. Manufacturer/community resources. Data-driven strategies to evaluate progress.",
    "prereq": []
  },
  {
    "uid": "809649",
    "code": "EPSY5634",
    "subject": "EPSY",
    "number": "5634",
    "honors": false,
    "writingIntensive": false,
    "name": "AAC Module 4: D/HH Students",
    "fullname": "Module 4: Assistive technology with Deaf/Hard of Hearing Students",
    "info": "Theoretical/applied study communication modalities for children/adults who are Deaf or Hard of Hearing. Assessment/development of models including gestures, speech reading, Cued Speech, sign language, Picture Exchange Communication Systems, high/low tech devices.prereq: Special Education licensure student or instr consent",
    "prereq": []
  },
  {
    "uid": "001251",
    "code": "EPSY5635",
    "subject": "EPSY",
    "number": "5635",
    "honors": false,
    "writingIntensive": false,
    "name": "Educ Phys/Hlth Dis",
    "fullname": "Education of Students with Physical and Health Disabilities",
    "info": "Introduction to students with physical and health disabilities and their characteristics; the educational implications of physical disabilities; assessment procedures and appropriate educational interventions for learners with physical and health disabilities.",
    "prereq": []
  },
  {
    "uid": "001256",
    "code": "EPSY5636",
    "subject": "EPSY",
    "number": "5636",
    "honors": false,
    "writingIntensive": false,
    "name": "Sensory Impairments",
    "fullname": "Sensory Impairments of Students With Developmental Disabilities",
    "info": "Characteristics of learners with visual/auditory impairments. Design of instructional programs to remediate or circumvent disabilities, including use of prosthetic devices.prereq: 5613, 5614",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5613",
          "subject": "EPSY",
          "id": "5613"
        },
        {
          "code": "EPSY 5614",
          "subject": "EPSY",
          "id": "5614"
        }
      ]
    }
  },
  {
    "uid": "814828",
    "code": "EPSY5637",
    "subject": "EPSY",
    "number": "5637",
    "honors": false,
    "writingIntensive": false,
    "name": "Core Practices: Found. of SpEd",
    "fullname": "Core Practices in Special Education: Foundations of Special Education",
    "info": "This course is an online module designed to be taken the first semester of a 4-semester sequence in the Clinical EBD Licensure Program. All materials necessary for proficient completion of the course will be delivered via on-line course. There will be no additional readings associated with this online module.prereq: Enrolled in Special Ed MEd or Special Ed ILP MEd program with EBD Residency-Based subplan",
    "prereq": []
  },
  {
    "uid": "814829",
    "code": "EPSY5638",
    "subject": "EPSY",
    "number": "5638",
    "honors": false,
    "writingIntensive": false,
    "name": "Core Practices: IEP Writing",
    "fullname": "Core Practices in Special Education: IEP Writing",
    "info": "This course is an online module designed to be taken the second semester, in conjunction with the IEP Process course, of a 4-semester sequence in the Clinical EBD Licensure Program. All materials necessary for proficient completion of the course will be delivered via on-line course. There will be no additional readings associated with this online module.",
    "prereq": []
  },
  {
    "uid": "001552",
    "code": "EPSY5641",
    "subject": "EPSY",
    "number": "5641",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Deaf Education",
    "fullname": "Foundations of Deaf Education",
    "info": "Philosophical foundations of deaf and hard of hearing (DHH) education. Engage in discussion, debates, and processes that have influenced deaf education, communication methodologies, and placement options in the US. Considered from the perspective of deaf and hard of hearing children, adults, and their families.",
    "prereq": []
  },
  {
    "uid": "788919",
    "code": "EPSY5642",
    "subject": "EPSY",
    "number": "5642",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Intervention: DHH",
    "fullname": "Early Intervention for Infants, Toddlers and Families: Deaf and Hard of Hearing",
    "info": "Early identification and intervention with deaf and hard of hearing children including the development of ASL and English, Emergent Literacy in the homes and the role of Deaf Mentors. Emphasis on the importance of early exposure to fully accessible language and addressing the issue of language deprivation.prereq: Preservice teacher in deaf education licensing program or instr consent.",
    "prereq": []
  },
  {
    "uid": "816794",
    "code": "EPSY5643",
    "subject": "EPSY",
    "number": "5643",
    "honors": false,
    "writingIntensive": false,
    "name": "Identity Culture Diversi Deaf",
    "fullname": "Seminar: Identity, Culture and Diversity in Deaf Education",
    "info": "Reflecting on your own identity as a future teacher of the deaf and how to facilitate the identity development of your students. Having a deep understanding of the diversity of students and their families and how best to foster these relationships and communication. Synthesis of previously learned material into practice.",
    "prereq": []
  },
  {
    "uid": "001554",
    "code": "EPSY5644",
    "subject": "EPSY",
    "number": "5644",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Language & Literacy: DHH",
    "fullname": "Early Childhood Language and Literacy Development and Best Practices: Deaf and Hard of Hearing",
    "info": "Perspectives and best practices related to the development of early language and literacy skills in ASL and English for deaf and hard of hearing children.prereq: Preservice teacher in deaf education licensing program or instr consent",
    "prereq": []
  },
  {
    "uid": "816795",
    "code": "EPSY5645",
    "subject": "EPSY",
    "number": "5645",
    "honors": false,
    "writingIntensive": false,
    "name": "Deaf Plus: Deaf w/Disabilities",
    "fullname": "Deaf Plus: Educating and Understanding Deaf Students with Disabilities",
    "info": "Building an understanding of the complex issues and best practices involved in educating deaf learners with disabilities. Working with families and service providers, identifying resources, understanding identification, placement, assessment and intervention strategies to modify curriculum to work with deaf students with varying disabilities.",
    "prereq": []
  },
  {
    "uid": "001559",
    "code": "EPSY5646",
    "subject": "EPSY",
    "number": "5646",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading/Writing Prac K-12: DHH",
    "fullname": "Best Practices Teaching Reading and Writing for School Age: Deaf and Hard of Hearing",
    "info": "Understanding and application of best practices for teaching reading/writing with DHH students in school age settings including incorporating bilingual strategies (making connections between ASL and English).",
    "prereq": []
  },
  {
    "uid": "001563",
    "code": "EPSY5647",
    "subject": "EPSY",
    "number": "5647",
    "honors": false,
    "writingIntensive": false,
    "name": "Spoken Lang & Asst Tech: DHH",
    "fullname": "Spoken Language Practices and Assistive Technology: Deaf and Hard of Hearing",
    "info": "Study of the role and function of spoken English and Assistive technology in classrooms with students who are deaf or hard of hearing. Including understanding of speech and hearing mechanisms. Emphasis on application of spoken language practices in bimodal settings.prereq: EPSY 5642, 5644",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5642",
          "subject": "EPSY",
          "id": "5642"
        },
        {
          "code": "EPSY 5644",
          "subject": "EPSY",
          "id": "5644"
        }
      ]
    }
  },
  {
    "uid": "001569",
    "code": "EPSY5648",
    "subject": "EPSY",
    "number": "5648",
    "honors": false,
    "writingIntensive": false,
    "name": "CommSys:Child w/Dis",
    "fullname": "Communication Systems for Children with Disabilities",
    "info": "Applied study of assessment, selection, and application of alternative communication strategies for infants, children, and youth with disabilities. Emphasis on children with hearing loss and additional disabilities.",
    "prereq": []
  },
  {
    "uid": "001572",
    "code": "EPSY5649",
    "subject": "EPSY",
    "number": "5649",
    "honors": false,
    "writingIntensive": false,
    "name": "InstrucProgram:D/HH",
    "fullname": "Models of Instructional Programming With Deaf and Hard of Hearing Students",
    "info": "Design/development of portfolios for various models of educational service delivery systems for individuals with hearing loss. Emphasizes consultation skills, curriculum management/modifications, material/technology applications, and support service adaptations.prereq: [5641, 5644] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5641",
          "subject": "EPSY",
          "id": "5641"
        },
        {
          "code": "EPSY 5644",
          "subject": "EPSY",
          "id": "5644"
        }
      ]
    }
  },
  {
    "uid": "809774",
    "code": "EPSY5651",
    "subject": "EPSY",
    "number": "5651",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Content Areas Deaf Ed",
    "fullname": "Best Practices Teaching Content Areas: Deaf Education",
    "info": "The purpose of this course is to prepare future teachers of the deaf to understand and apply best practices for teaching students who are deaf and hard of hearing across curricular subject areas and emphasizes infusion of language and literacy into all content areas. This course is designed to be a highly practical “how to” course that will prepare students to go into classrooms with an understanding of how to integrate content across curricula using bilingual strategies and how to adapt materials to meet the needs of deaf and hard of hearing students at various reading levels.",
    "prereq": []
  },
  {
    "uid": "816796",
    "code": "EPSY5652",
    "subject": "EPSY",
    "number": "5652",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic ASL in classroom: DHH",
    "fullname": "Incorporating Academic ASL in the Classroom: Deaf and Hard of Hearing",
    "info": "Understanding/application of best practices incorporating Academic ASL in classrooms for students who are deaf or hard of hearing. Practice their own academic ASL skills while learning to facilitate their future students academic language. Demonstrating complex ASL across all subject areas using bilingual strategies and conceptually accurate signs. ",
    "prereq": []
  },
  {
    "uid": "816797",
    "code": "EPSY5653",
    "subject": "EPSY",
    "number": "5653",
    "honors": false,
    "writingIntensive": false,
    "name": "ASL/English Struct/Applic: DHH",
    "fullname": "ASL/English Structure and Application",
    "info": "Understanding the structure and assessment of ASL and English in deaf and hard of hearing children and how to analyze each language. Students gain knowledge of the parts of each language, various assessments prepare future teachers to evaluate and facilitate the development of ASL and English. Readings drawn from both bilingual and Deaf education.",
    "prereq": []
  },
  {
    "uid": "816798",
    "code": "EPSY5654",
    "subject": "EPSY",
    "number": "5654",
    "honors": false,
    "writingIntensive": false,
    "name": "Curr Research/Trends: Deaf Ed",
    "fullname": "Current Research, Issues Trends in Deaf Education",
    "info": "Examining current research, issue trends in Deaf Education to help prepare future teachers to develop an understanding of research and apply critical thinking to analyze new issues, problem solve, and consider participating in research to practice opportunities that may arise during their career in Deaf Education.",
    "prereq": []
  },
  {
    "uid": "003448",
    "code": "EPSY5656",
    "subject": "EPSY",
    "number": "5656",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Issues in EBD",
    "fullname": "Advanced Issues in Emotional Behavior Disorders",
    "info": "Emphasis on children, youth, young adults. How emotional behavior disorders affects functioning in school/post-secondary life.",
    "prereq": []
  },
  {
    "uid": "001653",
    "code": "EPSY5657",
    "subject": "EPSY",
    "number": "5657",
    "honors": false,
    "writingIntensive": false,
    "name": "Intervention Behavior Problems",
    "fullname": "Interventions for Behavioral Problems in School Settings",
    "info": "Comprehensive behavioral programs for students with social and or emotional disabilities. Instructing students with social and or emotional disabilities.",
    "prereq": []
  },
  {
    "uid": "809648",
    "code": "EPSY5658",
    "subject": "EPSY",
    "number": "5658",
    "honors": false,
    "writingIntensive": false,
    "name": "Characteristics of Mod/Sev EBD",
    "fullname": "Characteristics of Moderate to Severe Emotional/Behavioral Disorders",
    "info": "Applying principles of assessment/individualized intervention for students with severe emotional behavior disorders(EBD).prereq: Special Education graduate or licensure student",
    "prereq": []
  },
  {
    "uid": "816842",
    "code": "EPSY5659",
    "subject": "EPSY",
    "number": "5659",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Behavior Analysis",
    "fullname": "Foundations of Behavior Analysis",
    "info": "Behavior analysis is the science of behavior along a continuum of basic to applied learning processes, both operant and respondent. Applied behavior analysis (ABA) is concerned with the improvement and understanding of human behavior. It is the science in which strategies derived from the principals of basic behavior analysis are applied systematically to improve socially significant behavior and experimentation is used to identify the variables responsible for change (Cooper, Heron, & Heward, 2007). This course focuses on basic concepts and methodologies involved in behavior analysis, and their relation to other theories of learning and behavior. This course is designed for individuals interested in learning from the perspective of behavior analysis and individuals who are interested in learning theory as it applies to individuals with significant cognitive and language impairments. This course is also designed to prepare students for the Behavior Analyst Certification Board (BACB) exam.",
    "prereq": []
  },
  {
    "uid": "797298",
    "code": "EPSY5661",
    "subject": "EPSY",
    "number": "5661",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Autism Spectrum Disorder",
    "fullname": "Introduction to Autism Spectrum Disorder",
    "info": "Knowledge/skills needed to promote learning/success for school age children with Autism Spectrum Disorder. Definition, etiology, and characteristics of ASD. Current research/issues. Collaborative problem solving, family-professional partnerships, educational programming.",
    "prereq": []
  },
  {
    "uid": "809198",
    "code": "EPSY5662",
    "subject": "EPSY",
    "number": "5662",
    "honors": false,
    "writingIntensive": false,
    "name": "Assessment & Ident of ASD",
    "fullname": "Assessment and Identification of Autism Spectrum Disorders",
    "info": "Selection/use of assessment procedures that may be used to screen/identify children with autism spectrum disorders.prereq: 5661, Spec Ed grad or licensure student or instr consent",
    "prereq": {
      "code": "EPSY 5661",
      "subject": "EPSY",
      "id": "5661"
    }
  },
  {
    "uid": "809199",
    "code": "EPSY5663",
    "subject": "EPSY",
    "number": "5663",
    "honors": false,
    "writingIntensive": false,
    "name": "Assessment & Intervention ASD",
    "fullname": "Assessment and Intervention for Individuals with Autism Spectrum Disorder",
    "info": "Selection/use of range of procedures, including non-biased, specific assessments to screen/identify children with autism spectrum disorder. Specific intervention strategies designed to teach beginning communication/social skills to children with Autism Spectrum Disorder (ASD). prereq: 5661, Special Ed grad, licensure student, ASD Certificate student, IDP major or instr consent",
    "prereq": {
      "code": "EPSY 5661",
      "subject": "EPSY",
      "id": "5661"
    }
  },
  {
    "uid": "809200",
    "code": "EPSY5664",
    "subject": "EPSY",
    "number": "5664",
    "honors": false,
    "writingIntensive": false,
    "name": "Transitions with ASD",
    "fullname": "Transitions for Individuals with Autism Spectrum Disorders",
    "info": "Legal/practical aspects of transition planning, specifically for students with ASD.prereq: 5661, [Spec Ed grad or licensure student or instr consent]",
    "prereq": {
      "code": "EPSY 5661",
      "subject": "EPSY",
      "id": "5661"
    }
  },
  {
    "uid": "001285",
    "code": "EPSY5671",
    "subject": "EPSY",
    "number": "5671",
    "honors": false,
    "writingIntensive": false,
    "name": "Literary Braille",
    "fullname": "Literary Braille",
    "info": "Mastery of literary braille code including all contractions and short-form words used in Grade 2 English Braille: American Usage. Use of specialized  braille writing equipment including, braille writer, slate and stylus, and computer programs with six-key input.",
    "prereq": []
  },
  {
    "uid": "001350",
    "code": "EPSY5672",
    "subject": "EPSY",
    "number": "5672",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Braille",
    "fullname": "Advanced Braille Codes",
    "info": "Mastery of the Nemeth code for braille mathematics transcription including elementary math computation, algebra, geometry, trigonometry, and symbolic logic notation. Introduction to foreign languages, computer notation, music, and raised line drawing techniques.",
    "prereq": []
  },
  {
    "uid": "001358",
    "code": "EPSY5673",
    "subject": "EPSY",
    "number": "5673",
    "honors": false,
    "writingIntensive": false,
    "name": "Read/Write Vis Dis",
    "fullname": "Reading and Writing for Children with Visual Disabilities",
    "info": "Principles of preparation, selection, and use of instructional materials and adaptive technology for children with visual disabilities, including use of braille, large print, auditory tapes, and computer files to access and electronically convert information between these different media.",
    "prereq": []
  },
  {
    "uid": "001378",
    "code": "EPSY5674",
    "subject": "EPSY",
    "number": "5674",
    "honors": false,
    "writingIntensive": false,
    "name": "Orient & Mobility",
    "fullname": "Techniques of Orientation, Mobility, and Independence for Students with Visual Disabilities",
    "info": "Introduction to basic techniques to gain skills in pre-cane techniques, orientation to learning environments, and adaptations for activities of daily living and independence. Introduction to mobility maps, consideration of cane, guide dog, and telescopic aids to mobility.",
    "prereq": []
  },
  {
    "uid": "001392",
    "code": "EPSY5675",
    "subject": "EPSY",
    "number": "5675",
    "honors": false,
    "writingIntensive": false,
    "name": "Struct,Func:The Eye",
    "fullname": "Structure and Function of the Eye: Educational Implications",
    "info": "Anatomy and physiology of the eye and its relation to visual perception.  Educational considerations for students with low vision studied in relation to ophthalmological and optometric evaluations and functional vision assessment.",
    "prereq": []
  },
  {
    "uid": "001408",
    "code": "EPSY5676",
    "subject": "EPSY",
    "number": "5676",
    "honors": false,
    "writingIntensive": false,
    "name": "Case Manage:Vis Dis",
    "fullname": "Case Management for Children with Visual Disabilities",
    "info": "Advanced course evaluating and managing cognitive, psychosocial, physical, and academic needs of students. Consideration of parent, teacher, and student in counseling and educational program management.",
    "prereq": []
  },
  {
    "uid": "001418",
    "code": "EPSY5681",
    "subject": "EPSY",
    "number": "5681",
    "honors": false,
    "writingIntensive": false,
    "name": "Educ. Preschooler Disabilities",
    "fullname": "Educating Preschoolers with Disabilities: Specialized Approaches and Interventions",
    "info": "This course provides an opportunity to engage in in-depth learning related to a variety of specialized approaches and interventions designed to maximize developmental and educational outcomes for young children, birth to age 6, with disabilities and their families in home, community, and school-based settings.  Early educators and early childhood special educators play a major role in the development, implementation, and evaluation of individualized programming and are called upon to provide services that are interdisciplinary, multicultural, family-centered, inclusive, developmentally appropriate, and effective.  Thus, early childhood professionals must be knowledgeable of and proficient in their application of curricular adaptations and instructional strategies that address the needs of young children with a broad range of disabilities in a broad range of preschool settings.prereq: [5616, 5625] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5616",
          "subject": "EPSY",
          "id": "5616"
        },
        {
          "code": "EPSY 5625",
          "subject": "EPSY",
          "id": "5625"
        }
      ]
    }
  },
  {
    "uid": "806320",
    "code": "EPSY5682",
    "subject": "EPSY",
    "number": "5682",
    "honors": false,
    "writingIntensive": false,
    "name": "Educ Infnt-Toddler Disability",
    "fullname": "Education of Infants and Toddlers with Disabilities: Specialized Approaches and Intervention",
    "info": "This course provides an overview of specialized approaches and intervention systems available to maximize developmental and educational outcomes for infants and toddlers with developmental delays and disabilities. EPSY 5682 is a self-directed, online course that is divided into five modules. Students will learn about children’s development, components of the evaluation process to support determinations of eligibility for early intervention services, as well as how to design and provide early intervention services. As a result, students will be prepared to utilize approaches that are interdisciplinary, multicultural, family-centered, inclusive, and developmentally appropriate within the context of natural, authentic learning environments for infants and toddlers.prereq: [5616, 5625] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5616",
          "subject": "EPSY",
          "id": "5616"
        },
        {
          "code": "EPSY 5625",
          "subject": "EPSY",
          "id": "5625"
        }
      ]
    }
  },
  {
    "uid": "809941",
    "code": "EPSY5699",
    "subject": "EPSY",
    "number": "5699",
    "honors": false,
    "writingIntensive": false,
    "name": "Experimental Teaching Seminar",
    "fullname": "Experimental Teaching Seminar",
    "info": "EPsy 5699 will be taken concurrently with the student teaching experience. Coursework will center around experimental teaching utilizing data-based instruction for affecting student growth academically. Students will demonstrate this understanding by planning and conducting a 3-to-5 lesson instructional sequence for a selected focus learner during their student teaching year. In addition, students will record their instruction and reflect on the effectiveness of their academic instruction.",
    "prereq": []
  },
  {
    "uid": "016812",
    "code": "EPSY5701",
    "subject": "EPSY",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "GenEd Practicum: Inclusive",
    "fullname": "Practicum: Field Experience in General Education - Inclusive Classrooms",
    "info": "Field-Based Practicum. Observe and actively participate in an inclusive (with and without disabilities) general education classroom. An emphasis is placed on communication skills and reflective practice.",
    "prereq": []
  },
  {
    "uid": "797299",
    "code": "EPSY5702",
    "subject": "EPSY",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "ABA Supervision Seminar I",
    "fullname": "Applied Behavior Analysis: Supervision Seminar I",
    "info": "This course is designed to provide didactic instruction in supervision.   Class meets weekly for one hour.",
    "prereq": []
  },
  {
    "uid": "797300",
    "code": "EPSY5703",
    "subject": "EPSY",
    "number": "5703",
    "honors": false,
    "writingIntensive": false,
    "name": "ABA Supervision Seminar II",
    "fullname": "Applied Behavior Analysis: Supervision Seminar II",
    "info": "This course is designed to provide didactic instruction in supervision. Class meets weekly for one hour.",
    "prereq": []
  },
  {
    "uid": "809201",
    "code": "EPSY5704",
    "subject": "EPSY",
    "number": "5704",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Experience: Mid or HS/T",
    "fullname": "Clinical: Field Experiences in Middle and Secondary (HS/T) Special Education Classrooms",
    "info": "Field experiences (prior to student teaching) meet the requirements set by Minnesota’s Professional Educator Licensing and Standards Board (PELSB). The focus of this course is for initial licensure teacher candidates in the field of special education in preparation for practicing principles required for successful inclusion of students in their least restrictive environment (LRE). Teacher candidates will observe and interact with students with disabilities (license specific) teachers in middle and secondary (high school or transition) school settings. Consistent with the mission of the College of Education and Human Development and the Special Education Programs, this field experience strengthens effective educational practices, promotes inquiry and problem solving skills, and builds leadership skills for special educators who work with students with disabilities specific to the licensure area. All placements are requested and confirmed by the Field Placement Coordinator in the Special Education Program. Placements are based on licensure program requirements and information (e.g., availability) teacher candidates provide on the Field Experience Placement Questionnaire. Field experiences occur during the regular school day; scheduled between the hours of 7:30 a.m. and 4:00 p.m. Schedules vary by school and cooperating teacher. You will receive an email with all placement details once finalized.",
    "prereq": []
  },
  {
    "uid": "809202",
    "code": "EPSY5705",
    "subject": "EPSY",
    "number": "5705",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Experience: ECSE or Elem",
    "fullname": "Clinical: Field Experiences in ECSE or Elementary Special Education Classrooms",
    "info": "Field experiences (prior to student teaching) meet the requirements set by Minnesota’s Professional Educator Licensing and Standards Board (PELSB). The focus of this course is for initial licensure teacher candidates in the field of special education in preparation for practicing principles required for successful inclusion of students in their least restrictive environment (LRE). Teacher candidates will observe and interact with students with disabilities (license specific) teachers in ECSE and elementary school settings. Consistent with the mission of the College of Education and Human Development and the Special Education Programs, this field experience strengthens effective educational practices, promotes inquiry and problem solving skills, and builds leadership skills for special educators who work with students with disabilities specific to the licensure area. All placements are requested and confirmed by the Field Placement Coordinator in the Special Education Program. Placements are based on licensure program requirements and information (e.g., availability) teacher candidates provide on the Field Experience Placement Questionnaire. Field experiences occur during the regular school day; scheduled between the hours of 7:30 a.m. and 4:00 p.m. Schedules vary by school and cooperating teacher. You will receive an email with all placement details once finalized.",
    "prereq": []
  },
  {
    "uid": "809650",
    "code": "EPSY5706",
    "subject": "EPSY",
    "number": "5706",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac: Moderate/Severe DD",
    "fullname": "Practicum in Moderate to Severe Developmental Disabilities",
    "info": "Practicing principles required for successful inclusion. Address model for best practices/requirements specified by Minnesota Board of Teaching.",
    "prereq": []
  },
  {
    "uid": "809800",
    "code": "EPSY5707",
    "subject": "EPSY",
    "number": "5707",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac: Moderate/Severe LD",
    "fullname": "Practicum in Moderate to Severe Learning Disabiliites",
    "info": "Moderate/severe learning disabilities. Transfer of theoretical knowledge to practical application. Role of LD teacher in variety of settings.",
    "prereq": []
  },
  {
    "uid": "809801",
    "code": "EPSY5708",
    "subject": "EPSY",
    "number": "5708",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac: Moderate/Severe EBD",
    "fullname": "Practicum in Moderate to Severe Emotional/Behavioral Disorders",
    "info": "Moderate/severe emotional behavior disorders. Transfer of theoretical knowledge to practical application. Role of EBD teacher in variety of settings.",
    "prereq": []
  },
  {
    "uid": "827003",
    "code": "EPSY5709",
    "subject": "EPSY",
    "number": "5709",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Experience in Denmark",
    "fullname": "Field Experience in Denmark: Exploring Community, Culture, and Education",
    "info": "The Department of Educational Psychology is on a mission to provide its students with opportunities to develop the multicultural competencies necessary to work effectively with children and families of all races, cultures, languages, and ethnicities. Through this seminar, students will experience cross-cultural teaching and learning through intense immersion in Danish schools and communities. In addition, as a minority culture in Copenhagen, students will learn from diverse perspectives expanding their respect for individual differences. Consistent with the mission of the College of Education and Human Development and the Special Education Programs, this experience strengthens effective educational practices, promotes inquiry and problem-solving skills, and builds leadership skills for future professionals who aspire to work in educational psychology and related fields.",
    "prereq": []
  },
  {
    "uid": "001426",
    "code": "EPSY5720",
    "subject": "EPSY",
    "number": "5720",
    "honors": false,
    "writingIntensive": false,
    "name": "Wrkshp: Special Ed",
    "fullname": "Special Topics: Special Education",
    "info": "Lab/fieldwork approach. Generating action plan. Creating set of observation field notes. Collecting data. Specific problems/possibilities related to special education.",
    "prereq": []
  },
  {
    "uid": "004263",
    "code": "EPSY5740",
    "subject": "EPSY",
    "number": "5740",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics:Human Serv",
    "fullname": "Special Topics: Interventions and Practices in Educational and Human Service Programs",
    "info": "Concepts, issues, and practices related to the community inclusion of children, youth, and adults with developmental disabilities through weekly seminar and extensive supervised experience working with individuals within the community.",
    "prereq": []
  },
  {
    "uid": "809203",
    "code": "EPSY5741",
    "subject": "EPSY",
    "number": "5741",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching: ABS",
    "fullname": "Student Teaching: Academic and Behavioral Strategist",
    "info": "Transfer of theoretical knowledge to practical application. Responsibilities of special education teacher in variety of settings.prereq: Special education licensure program or instr consent",
    "prereq": []
  },
  {
    "uid": "809204",
    "code": "EPSY5742",
    "subject": "EPSY",
    "number": "5742",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching: ASD",
    "fullname": "Student Teaching: Autism Spectrum Disorders",
    "info": "Transfer of theoretical knowledge to practical application. Role/responsibilities of special education teacher in settings of elementary/secondary age.",
    "prereq": []
  },
  {
    "uid": "001575",
    "code": "EPSY5751",
    "subject": "EPSY",
    "number": "5751",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching Deaf Ed",
    "fullname": "Student Teaching for Deaf Education",
    "info": "Students participate in educational programming for infants, children, and youth who are deaf or hard of hearing. On-site, directed experiences under supervision of master teachers of deaf/hard of hearing students.",
    "prereq": []
  },
  {
    "uid": "001428",
    "code": "EPSY5752",
    "subject": "EPSY",
    "number": "5752",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Tchg: LD",
    "fullname": "Student Teaching: Learning Disabilities",
    "info": "Supervised experience in teaching or related work in schools or other agencies serving children and adolescents with learning disabilities.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "001429",
    "code": "EPSY5753",
    "subject": "EPSY",
    "number": "5753",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Tchg: ECSE",
    "fullname": "Student Teaching: Early Childhood Special Education",
    "info": "Supervised experience in teaching or related work in schools, agencies, or home settings with infants, toddlers, and preschoolers with disabilities and their families.",
    "prereq": []
  },
  {
    "uid": "001655",
    "code": "EPSY5754",
    "subject": "EPSY",
    "number": "5754",
    "honors": false,
    "writingIntensive": false,
    "name": "St Tchg:Soc/EmotDis",
    "fullname": "Student Teaching: Social and Emotional Disabilities",
    "info": "Teach students with social and emotional disorders at public schools and other appropriate sites. Attend a weekly seminar on student teaching competencies.prereq: Completion of licensure courses for social and emotional disorders, instr consent",
    "prereq": []
  },
  {
    "uid": "001433",
    "code": "EPSY5755",
    "subject": "EPSY",
    "number": "5755",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching:Mild-Mod DD",
    "fullname": "Student Teaching: Developmental Disabilities, Mild/Moderate",
    "info": "Supervised student teaching, or special practicum project, in schools or other agencies serving students at elementary/secondary levels who have mild to moderate developmental disabilities.prereq: Completion of all licensure coursework, instr consent",
    "prereq": []
  },
  {
    "uid": "001447",
    "code": "EPSY5756",
    "subject": "EPSY",
    "number": "5756",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching:Mod/Severe DD",
    "fullname": "Student Teaching: Developmental Disabilities, Moderate/Severe",
    "info": "Supervised student teaching, or special practicum projects, in schools or other agencies serving students at elementary/secondary levels who have moderate to severe developmental disabilities.prereq: Completion of all licensure coursework, instr consent",
    "prereq": []
  },
  {
    "uid": "001457",
    "code": "EPSY5757",
    "subject": "EPSY",
    "number": "5757",
    "honors": false,
    "writingIntensive": false,
    "name": "St Tchg:PhysHlthDis",
    "fullname": "Student Teaching: Physical and Health Related Disabilities",
    "info": "Supervised student teaching and related work (direct instruction and consultation) in schools or other agencies serving children and adolescents who have physical disabilities.",
    "prereq": []
  },
  {
    "uid": "001461",
    "code": "EPSY5758",
    "subject": "EPSY",
    "number": "5758",
    "honors": false,
    "writingIntensive": false,
    "name": "St Tchg: Visual Imp",
    "fullname": "Student Teaching: Visual Impairments",
    "info": "Supervised student teaching, or special practicum project, in schools or other agencies serving children and adolescents who have visual impairments.",
    "prereq": []
  },
  {
    "uid": "804061",
    "code": "EPSY5761",
    "subject": "EPSY",
    "number": "5761",
    "honors": false,
    "writingIntensive": false,
    "name": "ECSE Three to Five Teaching",
    "fullname": "Student Teaching in Early Childhood Special Education Settings for Children Aged Three to Five Years",
    "info": "Student teachers work closely with their cooperating teacher and University supervisor to design/implement programming for children in classrooms. Course includes a seminar with discussion, cooperative learning experiences, and some lectures.prereq: Licensure candidate in Early Childhood/Early Childhood Licensure Program, completion of all other licensure requirements for ECSE, instr consent; completion of Birth-3 student teaching should be completed after age 3-5 student teaching when possible",
    "prereq": []
  },
  {
    "uid": "804064",
    "code": "EPSY5762",
    "subject": "EPSY",
    "number": "5762",
    "honors": false,
    "writingIntensive": false,
    "name": "ECSE Birth to Three Teaching",
    "fullname": "Student Teaching in Early Childhood Special Education for Children Aged Birth to Three Years",
    "info": "Student teachers work closely with cooperating teacher and University supervisor to design/implement programming for families with children aged birth-to-three in their homes. Course includes seminar with discussion, cooperative learning experiences, and some lectures.prereq: Licensure candidate in Early Childhood/Early Childhood Licensure Program, completion of all other licensure requirements for ECSE, instr consent; completion of Birth-3 student teaching should be completed after age 3-5 student teaching when possible",
    "prereq": []
  },
  {
    "uid": "814830",
    "code": "EPSY5763",
    "subject": "EPSY",
    "number": "5763",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum: Behav. Intervention",
    "fullname": "Practicum in Special Education: Behavior Intervention Planning and Implementation",
    "info": "This course will be delivered within a clinical model of instruction where the instructor serves as a coaching guide and the candidates participate in a community of practice with their peers. It is expected that given the instructor's coaching and the interactions within the community of practice, that the candidate will complete the portfolio associated with this course and, as part of that completion, demonstrate proficiency in all competencies associated with this course in order to earn a passing grade. As such, there is not a didactic instruction component or assigned readings for this clinical model of instruction-based course.",
    "prereq": []
  },
  {
    "uid": "814831",
    "code": "EPSY5764",
    "subject": "EPSY",
    "number": "5764",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum: IEP Process",
    "fullname": "Practicum in Special Education: IEP Process",
    "info": "This course will be delivered within a clinical model of instruction where the instructor serves as a coaching guide and the candidates participate in a community of practice with their peers. It is expected that given the instructor's coaching and the interactions within the community of practice, that the candidate will complete the portfolio associated with this course and, as part of that completion, demonstrate proficiency in all competencies associated with this course in order to earn a passing grade. As such, there is not a didactic instruction component or assigned readings for this clinical model of instruction-based course.",
    "prereq": []
  },
  {
    "uid": "814832",
    "code": "EPSY5765",
    "subject": "EPSY",
    "number": "5765",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum: Instructional Plng",
    "fullname": "Practicum in Special Education: Instructional Planning and Delivery",
    "info": "This course will be delivered within a clinical model of instruction where the instructor serves as a coaching guide and the candidates participate in a community of practice with their peers. It is expected that given the instructor's coaching and the interactions within the community of practice, that the candidate will complete the portfolio associated with this course and, as part of that completion, demonstrate proficiency in all competencies associated with this course in order to earn a passing grade. As such, there is not a didactic instruction component or assigned readings for this clinical model of instruction-based course.",
    "prereq": []
  },
  {
    "uid": "790057",
    "code": "EPSY5800",
    "subject": "EPSY",
    "number": "5800",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Schl Psych",
    "fullname": "Special Topics in School Psychology",
    "info": "Current issues in school psychology or areas not normally available through regular curriculum offerings.",
    "prereq": []
  },
  {
    "uid": "002117",
    "code": "EPSY5801",
    "subject": "EPSY",
    "number": "5801",
    "honors": false,
    "writingIntensive": false,
    "name": "Assess&Dec:SchlCom",
    "fullname": "Assessment and Decision Making in School and Community Settings",
    "info": "Introduction to psychological and educational assessment for individuals who work with children, especially those experiencing academic and behavior problems. Study of standardized group and individual tests of intelligence, achievement, socio-emotional functioning, perception, reading, mathematics, adaptive behavior, and language.",
    "prereq": []
  },
  {
    "uid": "811874",
    "code": "EPSY5802",
    "subject": "EPSY",
    "number": "5802",
    "honors": false,
    "writingIntensive": false,
    "name": "History & Sci Bases of Psych",
    "fullname": "History & Scientific Bases of Psychology",
    "info": "The course is designed to provide discipline-specific knowledge comprising the core of psychology. Accordingly, students will attain substantial knowledge in (1) history and systems of psychology, (2) affective, (3) biological, (4) cognitive, (5) developmental, and (6) social aspects of behavior.",
    "prereq": []
  },
  {
    "uid": "002118",
    "code": "EPSY5849",
    "subject": "EPSY",
    "number": "5849",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Childhood MTSS",
    "fullname": "Multi-tiered Systems of Support in Early Childhood Education",
    "info": "This course explores how multi-tiered systems of support (MTSS) are applied in early childhood settings. The course features content on early childhood assessment, intervention, data-based decision making, treatment integrity and information on how to apply MTSS models with unique early childhood populations. This course focuses on educational settings for children ages birth to 5 and is intended primarily for educational psychology students (or students from related disciplines) interested in basic and applied information regarding evidence-based service delivery for young children. The course will explore the three primary components of MTSS frameworks: assessment, intervention and data-based decision making including review of assessments and intervention techniques for infants and preschoolers in various developmental domains. Enrolled students will engage in a variety of instructional strategies to learn the noted content including large and small group discussion, lectures, active learning opportunities to practice and build capacity for specified interventions, technology-based interactions to support intervention, assessment and databased decision making and cooperative learning opportunities to engage content using dynamic methods.",
    "prereq": []
  },
  {
    "uid": "002119",
    "code": "EPSY5851",
    "subject": "EPSY",
    "number": "5851",
    "honors": false,
    "writingIntensive": false,
    "name": "Diverse Students & Families",
    "fullname": "Engaging Diverse Students and Families",
    "info": "Theoretical, practical, scientific issues involved in school psychological practice/training/research. Theoretical/empirical bases for developing appropriate dispositions, practices, strategies. Illustrative lectures, discussions, group activities, case studies, presentations.prereq: Honors senior or grad student",
    "prereq": []
  },
  {
    "uid": "002120",
    "code": "EPSY5852",
    "subject": "EPSY",
    "number": "5852",
    "honors": false,
    "writingIntensive": false,
    "name": "Preven/Early Interv",
    "fullname": "Prevention and Early Intervention",
    "info": "Theory/research base for school-based primary/secondary programs to promote academic/social competence of children/youth (birth to grade 12).",
    "prereq": []
  },
  {
    "uid": "811875",
    "code": "EPSY5853",
    "subject": "EPSY",
    "number": "5853",
    "honors": false,
    "writingIntensive": false,
    "name": "Biological Bases of Behavior",
    "fullname": "Biological Bases of Behavior",
    "info": "Biological basis of behavior with emphasis on relationship between functions/structures of brain.",
    "prereq": []
  },
  {
    "uid": "002121",
    "code": "EPSY5871",
    "subject": "EPSY",
    "number": "5871",
    "honors": false,
    "writingIntensive": false,
    "name": "Interdisc  Prac",
    "fullname": "Interdisciplinary Practice and Interagency Coordination in Education and Human Services",
    "info": "Principles and procedures of interdisciplinary practice and interagency coordination. Examine the relative strengths of interdisciplinary approaches, develop skills for collaborating with others, and examine different approaches to interagency coordination.",
    "prereq": []
  },
  {
    "uid": "005254",
    "code": "EPSY5991",
    "subject": "EPSY",
    "number": "5991",
    "honors": false,
    "writingIntensive": false,
    "name": "Ind Study-EPsy",
    "fullname": "Independent Study in Educational Psychology",
    "info": "Self-directed study in areas not covered by regular courses. Specific program of study is jointly determined by student and advising faculty member.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "002254",
    "code": "EPSY8111",
    "subject": "EPSY",
    "number": "8111",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Human Expertise/Develop",
    "fullname": "Seminar: Human Expertise and Its Development",
    "info": "Analysis of human expertise. Forms of human expertise. Novice-expert differences in various occupations/fields. How human expertise is developed. Deliberate practice. Educational/psychological applications.",
    "prereq": []
  },
  {
    "uid": "809100",
    "code": "EPSY8112",
    "subject": "EPSY",
    "number": "8112",
    "honors": false,
    "writingIntensive": false,
    "name": "Mathematical Cognition",
    "fullname": "Mathematical Cognition",
    "info": "Cognitive science research. Papers investigating how adults/children understand fundamental mathematical concepts. Papers drawn from psychology, neuroscience, education literatures.prereq: 5114 or equiv",
    "prereq": {
      "code": "EPSY 5114",
      "subject": "EPSY",
      "id": "5114"
    }
  },
  {
    "uid": "810650",
    "code": "EPSY8113",
    "subject": "EPSY",
    "number": "8113",
    "honors": false,
    "writingIntensive": false,
    "name": "Scientific Reasoning",
    "fullname": "The Psychology of Scientific Reasoning",
    "info": "Research at intersection of cognitive science, educational psychology, science education. What psychology tells us about how people think, reason, make decisions. Read empirical research that explores psychological processes that underlie scientific reasoning.prereq: 5114 or equivalent",
    "prereq": {
      "code": "EPSY 5114",
      "subject": "EPSY",
      "id": "5114"
    }
  },
  {
    "uid": "006953",
    "code": "EPSY8114",
    "subject": "EPSY",
    "number": "8114",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:  Cog & Lrng",
    "fullname": "Seminar: Cognition and Learning",
    "info": "Advanced study in critical analysis and application of contemporary psychological theory and research in cognition and learning for education.",
    "prereq": []
  },
  {
    "uid": "002255",
    "code": "EPSY8115",
    "subject": "EPSY",
    "number": "8115",
    "honors": false,
    "writingIntensive": false,
    "name": "Psy of Instr & Tech",
    "fullname": "Psychology of Instruction and Technology",
    "info": "Seminar including, but not limited to, learning and instructional theories, advanced and emerging technologies, and measurement and evaluation.Prereq: A course in learning, instruction, or educational technology or consent of the instructor",
    "prereq": []
  },
  {
    "uid": "792023",
    "code": "EPSY8116",
    "subject": "EPSY",
    "number": "8116",
    "honors": false,
    "writingIntensive": false,
    "name": "Cognitive Processes in Reading",
    "fullname": "Reading for Meaning: Cognitive Processes in the Comprehension of Texts",
    "info": "Cognitive processes that take place during reading comprehension/implications of these processes for instruction/assessment.",
    "prereq": []
  },
  {
    "uid": "792024",
    "code": "EPSY8117",
    "subject": "EPSY",
    "number": "8117",
    "honors": false,
    "writingIntensive": false,
    "name": "Writing Empir Papers/Proposals",
    "fullname": "Writing Empirical Paper and Research/Grant Proposals in Education and Psychology",
    "info": "Scientific writing skills. Focuses on logic/argumentation. Each student produces an empirical paper or research proposal. Breaks down the writing process into components: one component per week. Each week, students write a section of their paper/proposal and critique others'.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "817679",
    "code": "EPSY8118",
    "subject": "EPSY",
    "number": "8118",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Cognitive Psychology",
    "fullname": "Advanced Cognitive Psychology",
    "info": "This course is a graduate introduction to cognitive psychology. It is \"advanced\" in the sense that it focuses on higher-level cognition, and also in its emphasis on theories and models in addition to empirical results. Graduate students interested in cognitive psychology are invited to register for the course, regardless of disciplinary background.",
    "prereq": []
  },
  {
    "uid": "825118",
    "code": "EPSY8119",
    "subject": "EPSY",
    "number": "8119",
    "honors": false,
    "writingIntensive": false,
    "name": "Video-based Learning Research",
    "fullname": "Video-Based Microlongitudinal Research in Learning",
    "info": "This course provides a hands-on, theoretically comprehensive introduction to the use of video in research on embodied, material, psychological, and cognitive facets of social interaction and human learning. Students in this course will review, practice, critique, and develop approaches to interaction analysis. The course covers theoretical foundations (e.g., discursive psychology, ethnomethodology, learning sciences, design-based research), data collection techniques (e.g., who controls the camera, how to record high quality video and audio), data analysis practices (e.g., stitching together multiple visual perspectives, multimodal transcription, sampling), and the formulation and documentation of research findings. Students will have opportunities to analyze instructor-supplied video data of classroom learning environments and/or work with their own video data.",
    "prereq": []
  },
  {
    "uid": "825139",
    "code": "EPSY8121",
    "subject": "EPSY",
    "number": "8121",
    "honors": false,
    "writingIntensive": false,
    "name": "Play-based Learning",
    "fullname": "Play-based Learning",
    "info": "Play has been described as nature's implicit design for learning, and yet play is both notoriously difficult to define and often marginalized in formal schooling. To understand this situation, this course will draw on scholarship primarily from educational psychology and learning sciences perspectives, and secondarily from conversation analysis, game studies, and evolutionary psychology perspectives. The course will build toward an understanding of core features of play, including how rules structure play, how players inhabit roles, and what constitutes playfulness. Students will then apply this play framework critically in reflections on the design of play in learning environments, covering how play differs from games, how power operates within play, how to design for failure in play, and why play is a brittle social activity. The course is meant primarily for graduate students in the Department of Educational Psychology and within the College of Education and Human Development who have an interest in studying the role of play in learning and/or designing learning environments to nurture play. Students in this course will have opportunities to design for play, examine through qualitative methods video data of children playing during learning, and plan for how play might inform their research.",
    "prereq": []
  },
  {
    "uid": "826924",
    "code": "EPSY8122",
    "subject": "EPSY",
    "number": "8122",
    "honors": false,
    "writingIntensive": false,
    "name": "Psychology of Misinformation",
    "fullname": "Psychology of Misinformation",
    "info": "Misinformation has been identified as a major contributor to various events ranging from elections to climate change policy to the response to the COVID-19 pandemic. Belief in misinformation exerts a lingering influence on people’s reasoning after it has been corrected and contributes to decision-making and polarization. In this seminar, we will identify and explore the cognitive, social, affective, and computational factors that lead people to believe misinformation and the psychological barriers to knowledge revision after misinformation has been corrected. We will discuss the effectiveness of interventions to reduce the effects of misinformation as well as implications for information consumers and practitioners in various areas (e.g., education, public health, social media).",
    "prereq": []
  },
  {
    "uid": "002257",
    "code": "EPSY8131",
    "subject": "EPSY",
    "number": "8131",
    "honors": false,
    "writingIntensive": false,
    "name": "Dev Moral Judg",
    "fullname": "Development of Moral-Political Judgment",
    "info": "Current research topics in socio-political moral judgment and moral development.",
    "prereq": []
  },
  {
    "uid": "002256",
    "code": "EPSY8132",
    "subject": "EPSY",
    "number": "8132",
    "honors": false,
    "writingIntensive": false,
    "name": "Pers Dev & Socializ",
    "fullname": "Personality Development and Socialization",
    "info": "Major research and theoretical work. Developmental and educational influences on personality.prereq: Personality or child psych course",
    "prereq": []
  },
  {
    "uid": "814240",
    "code": "EPSY8157",
    "subject": "EPSY",
    "number": "8157",
    "honors": false,
    "writingIntensive": false,
    "name": "Key Issues, Social Psy & Ed",
    "fullname": "Key Topics and Issues in Applying Social Psychology to Education",
    "info": "This course, designed for advanced graduate students, covers a number of classic and contemporary topics in social psychological theory, research, and methods, examining core theories and how they have persisted or changed over time and how those theories and approaches have been applied to research in and issues of education broadly conceived.",
    "prereq": []
  },
  {
    "uid": "794667",
    "code": "EPSY8215",
    "subject": "EPSY",
    "number": "8215",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Research Methods in Educ",
    "fullname": "Advanced Research Methodologies in Education",
    "info": "Quantitative research methods. Models of scientific inquiry. Role of theories/research design. Role of measurement error in quantitative data-based inference. Qualitative methods of inquiry. Quantitative/qualitative methodologies in methodologically-oriented studies in educational measurement, evaluation, stats.",
    "prereq": []
  },
  {
    "uid": "016903",
    "code": "EPSY8216",
    "subject": "EPSY",
    "number": "8216",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Research Processes",
    "fullname": "Seminar: Research Processes in Psychological Foundations of Education",
    "info": "Advanced examination of research processes in educational psychology. Invited faculty discuss specific research designs. Students refine/implement research projects and present them in class.prereq: [5216, admitted to doctoral program in psych foundations] or instr consent",
    "prereq": {
      "code": "EPSY 5216",
      "subject": "EPSY",
      "id": "5216"
    }
  },
  {
    "uid": "806663",
    "code": "EPSY8220",
    "subject": "EPSY",
    "number": "8220",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: QME",
    "fullname": "Special Topics: Seminar in Quantitative Methods",
    "info": "Seminars focus on specialized current topics in methodology in statistics, measurement, evaluation, and statistics education, including primary-source readings and in-depth exploration of advanced methodologies.",
    "prereq": []
  },
  {
    "uid": "002259",
    "code": "EPSY8221",
    "subject": "EPSY",
    "number": "8221",
    "honors": false,
    "writingIntensive": false,
    "name": "Psych Scaling",
    "fullname": "Psychological Scaling",
    "info": "Topics in uni/multidimensional scaling. Measurement theory/statistics. Rating scales, category scaling methods. Magnitude estimation, paired comparisons, multi-attribute scaling, multidimensional scaling.prereq: [5221 or equiv], [8252 or equiv]",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5221",
          "subject": "EPSY",
          "id": "5221"
        },
        {
          "code": "EPSY 8252",
          "subject": "EPSY",
          "id": "8252"
        }
      ]
    }
  },
  {
    "uid": "002258",
    "code": "EPSY8222",
    "subject": "EPSY",
    "number": "8222",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Meas:Theor/Appl",
    "fullname": "Advanced Measurement: Theory and Application",
    "info": "Topics in test theory. Classical reliability/validity theory/methods, generalizability theory. Linking, scaling, equating. Item response theory, methods for dichotomous/polytomous responses. Comparisons between classical, item response theory methods in instrument construction. prereq: [5221 or PSY 5862 or equiv], [8252 or equiv]",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "EPSY 5221",
              "subject": "EPSY",
              "id": "5221"
            },
            {
              "code": "PSY 5862",
              "subject": "PSY",
              "id": "5862"
            }
          ]
        },
        {
          "code": "EPSY 8252",
          "subject": "EPSY",
          "id": "8252"
        }
      ]
    }
  },
  {
    "uid": "804193",
    "code": "EPSY8223",
    "subject": "EPSY",
    "number": "8223",
    "honors": false,
    "writingIntensive": false,
    "name": "Equating",
    "fullname": "Test Score Equating Design and Analysis",
    "info": "Current test equating practices, particularly as applied to achievement tests.",
    "prereq": []
  },
  {
    "uid": "806265",
    "code": "EPSY8224",
    "subject": "EPSY",
    "number": "8224",
    "honors": false,
    "writingIntensive": false,
    "name": "Performance Assessment",
    "fullname": "Performance Assessment Design and Analysis",
    "info": "Conceptualization, design, implementation, analysis of performance assessments as employed in both small-scale (e.g., classrooms), large-scale (e.g., statewide, national testing programs), professional (e.g., teacher assessment, professional certification) settings.prereq: 5221, [5262 or 8261 or 8251 or equiv]",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5221",
          "subject": "EPSY",
          "id": "5221"
        },
        {
          "or": [
            {
              "code": "EPSY 5262",
              "subject": "EPSY",
              "id": "5262"
            },
            {
              "code": "EPSY 8261",
              "subject": "EPSY",
              "id": "8261"
            },
            {
              "code": "EPSY 8251",
              "subject": "EPSY",
              "id": "8251"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "808714",
    "code": "EPSY8225",
    "subject": "EPSY",
    "number": "8225",
    "honors": false,
    "writingIntensive": false,
    "name": "Operational Measurement",
    "fullname": "Operational Measurement: Test Score Quality Assurance, Standard Setting, and Equating",
    "info": "Principles/practices of test score quality assurance, standard setting/equating. Operational testing programs. Focus on achievement tests.prereq: 5221, [8252 or eqiv]",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5221",
          "subject": "EPSY",
          "id": "5221"
        },
        {
          "code": "EPSY 8252",
          "subject": "EPSY",
          "id": "8252"
        }
      ]
    }
  },
  {
    "uid": "808716",
    "code": "EPSY8226",
    "subject": "EPSY",
    "number": "8226",
    "honors": false,
    "writingIntensive": false,
    "name": "Item Response Models",
    "fullname": "Applications of Item Response Theory Models",
    "info": "This course introduces item response theory (IRT) and its application in education, psychology, and social science. Fundamental concepts and assumptions of IRT are discussed. Several IRT models for dichotomous and polytomous item responses are introduced. Many applications of IRT models including equating, differential item functioning, and computerized adaptive testing will also be discussed.",
    "prereq": []
  },
  {
    "uid": "791190",
    "code": "EPSY8227",
    "subject": "EPSY",
    "number": "8227",
    "honors": false,
    "writingIntensive": false,
    "name": "Accountability Testing",
    "fullname": "Educational Accountability Testing",
    "info": "Introduction to methods of test-based educational accountability. Topics covered include the meaning of student and school accountability in both a U.S. and international context; methods for aligning assessments for accountability; assessment challenges associated with accountability testing of special populations and international samples; and critiques of past and current test-based accountability efforts. The course uses a combination of lecture, group discussion, and computer analysis sessions to acquaint students with the use of data in educational decision making for purposes of educational accountability at the individual student- and school-levels. Students will also become familiar with current areas of research in educational accountability.",
    "prereq": []
  },
  {
    "uid": "798078",
    "code": "EPSY8247",
    "subject": "EPSY",
    "number": "8247",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Interviewing & NVIVO",
    "fullname": "Advanced Interviewing and NVIVO",
    "info": "Practice in designing, conducting, and analyzing interviews. Students design interview protocols, video/audio tape themselves conducting interviews, analyze their techniques, and critique others.  Students use NVIVO to analyze data they have collected.prereq: 5247 or qualitative course or instr consent",
    "prereq": {
      "code": "EPSY 5247",
      "subject": "EPSY",
      "id": "5247"
    }
  },
  {
    "uid": "806938",
    "code": "EPSY8251",
    "subject": "EPSY",
    "number": "8251",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistical Methods in Educ I",
    "fullname": "Statistical Methods in Education I",
    "info": "Statistical Methods in Education I is the first course in an entry-level, doctoral sequence for students in education. This course covers estimation and hypothesis testing with a particular focus on ANOVA and an introduction to multiple linear regression. Prepares students for EPSY 8252/8262.prereq: [EPSY 5261 or equiv] or undergrad statistics course",
    "prereq": {
      "code": "EPSY 5261",
      "subject": "EPSY",
      "id": "5261"
    }
  },
  {
    "uid": "806939",
    "code": "EPSY8252",
    "subject": "EPSY",
    "number": "8252",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistical Methods in Educ II",
    "fullname": "Statistical Methods in Education II",
    "info": "Statistical Methods in Education II is the second course in an entry-level, doctoral sequence for students in education. This course focuses on multiple linear regression and provides an introduction to linear mixed models.prereq: [8251, 8261 or equiv]",
    "prereq": {
      "and": [
        {
          "code": "EPSY 8251",
          "subject": "EPSY",
          "id": "8251"
        },
        {
          "code": "EPSY 8261",
          "subject": "EPSY",
          "id": "8261"
        }
      ]
    }
  },
  {
    "uid": "002261",
    "code": "EPSY8261",
    "subject": "EPSY",
    "number": "8261",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistical Methods in Educ I",
    "fullname": "Statistical Methods in Education I",
    "info": "Statistical Methods in Education I is the first course in an entry-level, doctoral sequence for students in education. This course covers estimation and hypothesis testing with a particular focus on ANOVA and an introduction to multiple linear regression. Prepares students for EPSY 8252/8262.prereq: 3264 or 5261 or equiv",
    "prereq": {
      "or": [
        {
          "code": "EPSY 3264",
          "subject": "EPSY",
          "id": "3264"
        },
        {
          "code": "EPSY 5261",
          "subject": "EPSY",
          "id": "5261"
        }
      ]
    }
  },
  {
    "uid": "002262",
    "code": "EPSY8262",
    "subject": "EPSY",
    "number": "8262",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistical Methods in Educ II",
    "fullname": "Statistical Methods in Education II",
    "info": "Statistical Methods in Education II is the second course in an entry-level, doctoral sequence for students in education. This course focuses on multiple linear regression and provides an introduction to linear mixed models.prereq: [EPSY 8251, 8261 or equiv]",
    "prereq": {
      "and": [
        {
          "code": "EPSY 8251",
          "subject": "EPSY",
          "id": "8251"
        },
        {
          "code": "EPSY 8261",
          "subject": "EPSY",
          "id": "8261"
        }
      ]
    }
  },
  {
    "uid": "002263",
    "code": "EPSY8263",
    "subject": "EPSY",
    "number": "8263",
    "honors": false,
    "writingIntensive": false,
    "name": "Design/Analysis-Exp",
    "fullname": "Design and Analysis of Experiments",
    "info": "Advanced treatment of various experimental designs, including completely randomized factorial, randomized block, hierarchical, repeated measures, and Latin square designs. Major computer packages used for data analyses. Univariate and multivariate approaches to these designs.",
    "prereq": []
  },
  {
    "uid": "002264",
    "code": "EPSY8264",
    "subject": "EPSY",
    "number": "8264",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvMult RegAnalysis",
    "fullname": "Advanced Multiple Regression Analysis",
    "info": "General linear model used as context for regression. Matrix algebra, multiple regression, path analysis, polynomial regression, standardized regression, stepwise solutions, analysis of variance, weighted least squares, logistic regression.prereq: [8252 or equiv], regression/ANOVA course, familiarity with statistical analysis package",
    "prereq": {
      "code": "EPSY 8252",
      "subject": "EPSY",
      "id": "8252"
    }
  },
  {
    "uid": "002318",
    "code": "EPSY8265",
    "subject": "EPSY",
    "number": "8265",
    "honors": false,
    "writingIntensive": false,
    "name": "Factor Analysis",
    "fullname": "Factor Analysis",
    "info": "Factor analytic techniques/applications. Component, common factor, confirmatory analysis. Factor extraction, estimating number of dimensions. Rotation, factor scores, hierarchical factor analysis.prereq: [8252 or equiv or instr consent]",
    "prereq": {
      "code": "EPSY 8252",
      "subject": "EPSY",
      "id": "8252"
    }
  },
  {
    "uid": "002321",
    "code": "EPSY8266",
    "subject": "EPSY",
    "number": "8266",
    "honors": false,
    "writingIntensive": false,
    "name": "Structural Equations",
    "fullname": "Statistical Analysis Using Structural Equation Methods",
    "info": "Quantitative techniques using manifest/latent variable approaches for analysis of educational/social science data. Introduction to structural equation modeling approaches to multiple regression, factor analysis, path modeling. Developing, estimating, interpreting structural equation models.",
    "prereq": []
  },
  {
    "uid": "794671",
    "code": "EPSY8267",
    "subject": "EPSY",
    "number": "8267",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Multivariate Analysis",
    "fullname": "Applied Multivariate Analysis",
    "info": "Use/interpretation of results from several multivariate statistical techniques. Matrix algebra, variance/covariance, Hotelling's T2, GLM, MANOVA, MANCOVA, discriminant analysis, canonical correlations, dimensionality, principal components, latent composites, distance, hierarchical clustering.prereq: [8252 or equiv], familiarity with matrix algebra, knowledge of a computerized statistics package",
    "prereq": {
      "code": "EPSY 8252",
      "subject": "EPSY",
      "id": "8252"
    }
  },
  {
    "uid": "797835",
    "code": "EPSY8268",
    "subject": "EPSY",
    "number": "8268",
    "honors": false,
    "writingIntensive": false,
    "name": "HLM in Educ Research",
    "fullname": "Hierarchical Linear Modeling in Educational Research",
    "info": "Conceptual framework of hierarchical linear models for nested data, their application in educational research. Nature/effects of nested data, logic of hierarchical models, mixed-effects models. Estimation/hypothesis testing in these models, model-checking, nonlinear models.prereq: [8252 or equiv]",
    "prereq": {
      "code": "EPSY 8252",
      "subject": "EPSY",
      "id": "8252"
    }
  },
  {
    "uid": "796876",
    "code": "EPSY8269",
    "subject": "EPSY",
    "number": "8269",
    "honors": false,
    "writingIntensive": false,
    "name": "Matrix Algebra",
    "fullname": "Matrix Algebra for Statistical Modeling",
    "info": "Linear/matrix algebra, including vector operations, applications to multivariate statistics. Procedures for solving systems of linear equations. Geometry of vectors/matrices. Regression/regression diagnostics in matrix framework. Uses SPSS MATRIX language.prereq: [8252 or 8262 or equiv]",
    "prereq": {
      "or": [
        {
          "code": "EPSY 8252",
          "subject": "EPSY",
          "id": "8252"
        },
        {
          "code": "EPSY 8262",
          "subject": "EPSY",
          "id": "8262"
        }
      ]
    }
  },
  {
    "uid": "794134",
    "code": "EPSY8271",
    "subject": "EPSY",
    "number": "8271",
    "honors": false,
    "writingIntensive": false,
    "name": "Stat Educ Research Seminar",
    "fullname": "Statistics Education Research Seminar: Studies on Teaching and Learning Statistics",
    "info": "Introduction to classic/current research related to teaching/learning of statistics. Research from psychology, education, and statistics. Students focus on a particular research question and review the literature related to that question.",
    "prereq": []
  },
  {
    "uid": "797836",
    "code": "EPSY8272",
    "subject": "EPSY",
    "number": "8272",
    "honors": false,
    "writingIntensive": false,
    "name": "Nonpar Statistics in Educ",
    "fullname": "Nonparametric Statistics in Education",
    "info": "Estimation/inferential techniques outside normal-theory tests. One-, two-, K-sample procedures for between-/within-subject differences, including factorial analysis of variance/covariance. Contingency table analysis (tests of independence, homogeneity).prereq: [8252 or equiv]",
    "prereq": {
      "code": "EPSY 8252",
      "subject": "EPSY",
      "id": "8252"
    }
  },
  {
    "uid": "002316",
    "code": "EPSY8281",
    "subject": "EPSY",
    "number": "8281",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Analysis--SAS",
    "fullname": "Advanced Statistical Computing and Data Analysis",
    "info": "Cross-disciplinary course. Use SAS statistical package to perform data management, data analysis, report writing.prereq: [5261 or equiv]",
    "prereq": {
      "code": "EPSY 5261",
      "subject": "EPSY",
      "id": "5261"
    }
  },
  {
    "uid": "796877",
    "code": "EPSY8282",
    "subject": "EPSY",
    "number": "8282",
    "honors": false,
    "writingIntensive": false,
    "name": "Stat Analysis Longitudinl Data",
    "fullname": "Statistical Analysis of Longitudinal Data",
    "info": "Traditional/modern approaches to analyzing longitudinal data. Dependent t-test, repeated measures ANOVA/MANOVA. Linear mixed models, multilevel models, generalized models. prereq: [8252 or equiv]",
    "prereq": {
      "code": "EPSY 8252",
      "subject": "EPSY",
      "id": "8252"
    }
  },
  {
    "uid": "818124",
    "code": "EPSY8283",
    "subject": "EPSY",
    "number": "8283",
    "honors": false,
    "writingIntensive": false,
    "name": "Meta-Analysis",
    "fullname": "Research Synthesis and Meta-Analysis",
    "info": "Meta-analysis is a methodology for conducting quantitative literature reviews in which the outcomes of empirical research studies are aggregated and their variation studied. This course will cover topics on problem formulation, sampling, variable coding, data analysis, and presentation of results in meta-analytic research.prereq: EPSY 8252 or equiv",
    "prereq": {
      "code": "EPSY 8252",
      "subject": "EPSY",
      "id": "8252"
    }
  },
  {
    "uid": "003439",
    "code": "EPSY8290",
    "subject": "EPSY",
    "number": "8290",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: PsyFndns",
    "fullname": "Special Topics: Seminar in Psychological Foundations",
    "info": "Students formulate research designs. Learning and cognition, social psychology, measurement, and statistics.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "792020",
    "code": "EPSY8295",
    "subject": "EPSY",
    "number": "8295",
    "honors": false,
    "writingIntensive": false,
    "name": "Problems: Evaluation",
    "fullname": "Evaluation Problems",
    "info": "Individually directed study of an issue in the theory or practice of program evaluation.",
    "prereq": []
  },
  {
    "uid": "806667",
    "code": "EPSY8296",
    "subject": "EPSY",
    "number": "8296",
    "honors": false,
    "writingIntensive": false,
    "name": "QME Internship",
    "fullname": "Quantitative Methods in Education Internship",
    "info": "Practical experience in applying concepts and skills in measurement, statistics, and evaluation in a real-world setting under supervision of a research professional.prereq: EPsy MA or PhD student, QME track",
    "prereq": []
  },
  {
    "uid": "790440",
    "code": "EPSY8300",
    "subject": "EPSY",
    "number": "8300",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Educ Psych",
    "fullname": "Special Topics in Educational Psychology",
    "info": "Issues or related coursework in areas not normally available through regular curriculum offerings.",
    "prereq": []
  },
  {
    "uid": "799139",
    "code": "EPSY8311",
    "subject": "EPSY",
    "number": "8311",
    "honors": false,
    "writingIntensive": false,
    "name": "Education Sciences Proseminar",
    "fullname": "Education Sciences Proseminar",
    "info": "Education-related research issues. Problems of school-based research. Diverse research methodologies. Educational research, diversity of K?12 students. Role of lab-based studies in education research. Critiques of education research. Relation of cognitive theory to school-based research. Translating research into school-based practice.prereq: Doctoral student, instr consent",
    "prereq": []
  },
  {
    "uid": "788110",
    "code": "EPSY8333",
    "subject": "EPSY",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "791051",
    "code": "EPSY8400",
    "subject": "EPSY",
    "number": "8400",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in CSPP",
    "fullname": "Topics: Counseling and Student Personnel Psychology",
    "info": "Current issues in counseling and student personnel psychology, or related coursework in areas not normally available through regular curriculum offerings.",
    "prereq": []
  },
  {
    "uid": "001812",
    "code": "EPSY8411",
    "subject": "EPSY",
    "number": "8411",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Counseling Res",
    "fullname": "Advanced Counseling Research",
    "info": "Focus on critically reviewing counseling research, qualitatively and quantitatively integrating research, and designing valid research.prereq: Ed psy PhD student with CSPP subprog or instr consent",
    "prereq": []
  },
  {
    "uid": "002085",
    "code": "EPSY8412",
    "subject": "EPSY",
    "number": "8412",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvCoun Thry&Ethics",
    "fullname": "Seminar: Advanced Counseling Theory and Ethics",
    "info": "Comparative analysis of theoretical models and methods used in contemporary counseling and psychotherapy; ethical standards and models of ethical decision making for professional roles.prereq: Ed psy PhD student with CSPP subprog or instr consent",
    "prereq": []
  },
  {
    "uid": "002087",
    "code": "EPSY8413",
    "subject": "EPSY",
    "number": "8413",
    "honors": false,
    "writingIntensive": false,
    "name": "Personality Assess",
    "fullname": "Personality Assessment of Adolescents and Adults",
    "info": "Assessment interviews, objective personality assessments (e.g., MMPI-2), projective tests (e.g., Thematic Apperception Test), and assessment report writing.prereq: [8407 or PSY 5604H or PSY 8111 or PSY 8112], doctoral student, instr consent",
    "prereq": {
      "or": [
        {
          "code": "EPSY 8407",
          "subject": "EPSY",
          "id": "8407"
        },
        {
          "code": "PSY 8111",
          "subject": "PSY",
          "id": "8111"
        },
        {
          "code": "PSY 8112",
          "subject": "PSY",
          "id": "8112"
        }
      ]
    }
  },
  {
    "uid": "001822",
    "code": "EPSY8431",
    "subject": "EPSY",
    "number": "8431",
    "honors": false,
    "writingIntensive": false,
    "name": "MA Resrch Sem:CSPP",
    "fullname": "Master's Research Seminar: CSPP",
    "info": "Survey of research methods, data-based decision making, basic research design skills, and research simulation.prereq: 5261 or equiv, 5221 or equiv, EPsy MA student with CSPP subprog or instr consent",
    "prereq": {
      "and": [
        {
          "code": "EPSY 5261",
          "subject": "EPSY",
          "id": "5261"
        },
        {
          "code": "EPSY 5221",
          "subject": "EPSY",
          "id": "5221"
        }
      ]
    }
  },
  {
    "uid": "788347",
    "code": "EPSY8444",
    "subject": "EPSY",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "001855",
    "code": "EPSY8452",
    "subject": "EPSY",
    "number": "8452",
    "honors": false,
    "writingIntensive": false,
    "name": "Psy Asp:Couns Suprv",
    "fullname": "Psychological Aspects of Counseling Supervision",
    "info": "Theories, review of relevant research, demonstration, and in-class practice of supervision skills.prereq: Ed psy PhD student with CSPP subprog or instr consent",
    "prereq": []
  },
  {
    "uid": "001865",
    "code": "EPSY8501",
    "subject": "EPSY",
    "number": "8501",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Pre-Practicum",
    "fullname": "Counseling Pre-Practicum",
    "info": "Overview of basic helping skills through demonstration, in-class practice.prereq: [CSPP or genetic counseling] grad student",
    "prereq": []
  },
  {
    "uid": "001953",
    "code": "EPSY8502",
    "subject": "EPSY",
    "number": "8502",
    "honors": false,
    "writingIntensive": false,
    "name": "Fld Placement:CSPP",
    "fullname": "Field Placement in Counseling and Student Personnel Psychology",
    "info": "Students participate under supervision in practitioner activities within a counseling work environment.prereq: 8501 or instr consent",
    "prereq": {
      "code": "EPSY 8501",
      "subject": "EPSY",
      "id": "8501"
    }
  },
  {
    "uid": "003112",
    "code": "EPSY8509",
    "subject": "EPSY",
    "number": "8509",
    "honors": false,
    "writingIntensive": false,
    "name": "Supervision Practicum: CSPP",
    "fullname": "Supervision Practicum: CSPP",
    "info": "Doctoral students meet weekly with master's prepracticum or practicum students for didactic supervision activities. Specific activities determined by master's prepracticum or practicum instructor. Doctoral students meet weekly with master's prepracticum or practicum instructor and other doctoral student supervisors for consultation/supervision.prereq: [Ed psy PhD student with CSPP subprog] or instr consent",
    "prereq": []
  },
  {
    "uid": "001956",
    "code": "EPSY8512",
    "subject": "EPSY",
    "number": "8512",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship: CSPP",
    "fullname": "Internship: CSPP",
    "info": "Supervised internship in counseling psychology.prereq: EdPsy PhD student with CSPP subprog",
    "prereq": []
  },
  {
    "uid": "001895",
    "code": "EPSY8513",
    "subject": "EPSY",
    "number": "8513",
    "honors": false,
    "writingIntensive": false,
    "name": "U Counseling Pract",
    "fullname": "University Counseling Practicum I",
    "info": "Science of counseling psychology. Supervised practice in University Counseling and Consulting Services with career, academic, and personal clients.",
    "prereq": []
  },
  {
    "uid": "001909",
    "code": "EPSY8514",
    "subject": "EPSY",
    "number": "8514",
    "honors": false,
    "writingIntensive": false,
    "name": "U Couns Prac II",
    "fullname": "University Counseling Practicum II",
    "info": "Integrates science of counseling psychology with supervised practice in University Counseling and Consulting Services with career, academic, and personal clients.",
    "prereq": []
  },
  {
    "uid": "001965",
    "code": "EPSY8521",
    "subject": "EPSY",
    "number": "8521",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac: CSPP Stu Dev",
    "fullname": "Practicum in Student Affairs and Student Development",
    "info": "Supervised practice in university and college student development offices.prereq: EdPsy MA or PhD student with CSPP subprog or instr consent",
    "prereq": []
  },
  {
    "uid": "003113",
    "code": "EPSY8522",
    "subject": "EPSY",
    "number": "8522",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Practicum: Advanced",
    "fullname": "Counseling Practicum: Advanced",
    "info": "Advanced skills practicum in counseling, counseling psychology, or student development.prereq: [Grad EPsy PhD student with CSPP subprog] or instr consent; instructor consent required after 2 repeats",
    "prereq": []
  },
  {
    "uid": "003114",
    "code": "EPSY8600",
    "subject": "EPSY",
    "number": "8600",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Sp Ed",
    "fullname": "Special Topics: Special Education Issues",
    "info": "Current trends (e.g., schoolwide discipline, models of collaboration, and diversity) investigated by formulating research projects. Students write a media piece describing an issue and its impact on the community.",
    "prereq": []
  },
  {
    "uid": "818211",
    "code": "EPSY8602",
    "subject": "EPSY",
    "number": "8602",
    "honors": false,
    "writingIntensive": false,
    "name": "Doc Sem in Special Education",
    "fullname": "Advanced Topics in Special Education Research",
    "info": "This course will offer sections on varying topics focused on research, policy, practice, and related issues in special education and disability services for advanced graduate seminars. The course is intended to allow enrolled students to conduct in-depth and focused review and analysis of scholarship in a contemporary area of special education, and to provide each student the opportunity to develop in-depth understanding of a specific topic within this area. This is a seminar course, with a combination of faculty-presented, student-presented, and group discussion content. Course topics will include an overview of relevant theoretical models, research methods, empirical and other findings, and areas of emerging interest, scholarship, policy, and practice.prereq: Completion of EPsy 8701, 8702, and 8694 or equivalent coursework; doctoral Student in Special Education or a related academic area, or permission of instructor",
    "prereq": {
      "and": [
        {
          "code": "EPSY 8701",
          "subject": "EPSY",
          "id": "8701"
        },
        {
          "code": "EPSY 8702",
          "subject": "EPSY",
          "id": "8702"
        },
        {
          "code": "EPSY 8694",
          "subject": "EPSY",
          "id": "8694"
        }
      ]
    }
  },
  {
    "uid": "001475",
    "code": "EPSY8612",
    "subject": "EPSY",
    "number": "8612",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Academic Diff",
    "fullname": "Seminar: Students with Academic Difficulties",
    "info": "Survey, analysis, and application of relevant theories and research related to current issues. Students in course develop skills in scholarly inquiry, writing, and debate.",
    "prereq": []
  },
  {
    "uid": "001478",
    "code": "EPSY8621",
    "subject": "EPSY",
    "number": "8621",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Intellec Impair",
    "fullname": "Seminar on Intellectual Impairments",
    "info": "Review of research and theories in context of relevant developmental theories; important contributions in primary sources concerning principles of cognition and behavior and applied problems. Procedures for deriving appropriate field applications; generalizing and implementing researchable questions.",
    "prereq": []
  },
  {
    "uid": "001658",
    "code": "EPSY8651",
    "subject": "EPSY",
    "number": "8651",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Soc/Emot Disab",
    "fullname": "Seminar on Social and Emotional Disabilities",
    "info": "Review and critical analysis of current trends and future directions of education of students with social and emotional disabilities.",
    "prereq": []
  },
  {
    "uid": "788471",
    "code": "EPSY8666",
    "subject": "EPSY",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral Pre-Thesis Creditsprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "001487",
    "code": "EPSY8677",
    "subject": "EPSY",
    "number": "8677",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Info Acqui-Disa",
    "fullname": "Seminar: Information Acquisition for Persons with Disabilities",
    "info": "Research findings from diverse disciplines on impact of hearing and visual disabilities on ability to acquire and/or access information.",
    "prereq": []
  },
  {
    "uid": "001495",
    "code": "EPSY8694",
    "subject": "EPSY",
    "number": "8694",
    "honors": false,
    "writingIntensive": false,
    "name": "Rsrch in Special Ed",
    "fullname": "Research in Special Education",
    "info": "Design and implementation of research related to the unique developmental characteristics of exceptional learners.",
    "prereq": []
  },
  {
    "uid": "001502",
    "code": "EPSY8701",
    "subject": "EPSY",
    "number": "8701",
    "honors": false,
    "writingIntensive": false,
    "name": "DocCoreSem:SpEd I",
    "fullname": "Doctoral Core Seminar: Special Education I",
    "info": "Required for students with a family/life span focus on social development, behavioral interaction, and cultural interactions.prereq: EdPsy PhD student with spec ed subprog or instr consent",
    "prereq": []
  },
  {
    "uid": "001506",
    "code": "EPSY8702",
    "subject": "EPSY",
    "number": "8702",
    "honors": false,
    "writingIntensive": false,
    "name": "DocCoreSem: SpEd II",
    "fullname": "Doctoral Core Seminar: Special Education II",
    "info": "Required for students focusing on communication/language/academics.prereq: 8701 or instr consent",
    "prereq": {
      "code": "EPSY 8701",
      "subject": "EPSY",
      "id": "8701"
    }
  },
  {
    "uid": "001524",
    "code": "EPSY8706",
    "subject": "EPSY",
    "number": "8706",
    "honors": false,
    "writingIntensive": false,
    "name": "Single Case Design",
    "fullname": "Single Case Designs in Intervention Research",
    "info": "Design and analysis of single-case experiments to examine effects of interventions on individual behavior in school, home, and community.",
    "prereq": []
  },
  {
    "uid": "803743",
    "code": "EPSY8707",
    "subject": "EPSY",
    "number": "8707",
    "honors": false,
    "writingIntensive": false,
    "name": "Princ Beh Analys & Lrng",
    "fullname": "Principles of Behavior Analysis and Learning",
    "info": "Historical development of behavioral science. Thinking about learning/behavior, applying principles to common human experiences. Scholarly leadership skills.prereq: [Grad student, foundational course in [learning or psychology]] or instr consent",
    "prereq": []
  },
  {
    "uid": "803744",
    "code": "EPSY8708",
    "subject": "EPSY",
    "number": "8708",
    "honors": false,
    "writingIntensive": false,
    "name": "Functional Behavior Assessment",
    "fullname": "Functional Behavior Assessment",
    "info": "Applications of principles of behavior. Historical/contemporary approaches. Functional analysis. Treatment of challenging behavior/learning problems.prereq: [Grad student, one [learning or psychology] course] or instr consent",
    "prereq": []
  },
  {
    "uid": "815736",
    "code": "EPSY8709",
    "subject": "EPSY",
    "number": "8709",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Language & Early Literacy",
    "fullname": "Sp Ed Issues - Language & Early Literacy Dev., Assmnt, & Intervention for Young Children",
    "info": "This seminar course will address contemporary issues in theory, assessment, and interventions to promote language and early literacy development for young children (typically, those not yet age-eligible to enroll in kindergarten) at risk for later reading delays. The course will review and analyze relevant theoretical models, basic research related to these theories, and applied research in assessment and intervention, particularly research conducted in the past five years as well as emerging issues of research and practice.",
    "prereq": []
  },
  {
    "uid": "001537",
    "code": "EPSY8772",
    "subject": "EPSY",
    "number": "8772",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Early Intervent",
    "fullname": "Seminar in Early Intervention",
    "info": "Explores research from diverse disciplines related to education of infants, toddlers, and preschool children with disabilities and their families. Discusses practical application of this research.",
    "prereq": []
  },
  {
    "uid": "788598",
    "code": "EPSY8777",
    "subject": "EPSY",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "790441",
    "code": "EPSY8800",
    "subject": "EPSY",
    "number": "8800",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Schl Psych",
    "fullname": "Special Topics in School Psychology",
    "info": "Issues or related coursework in areas not normally available through regular curriculum offerings.",
    "prereq": []
  },
  {
    "uid": "002124",
    "code": "EPSY8811",
    "subject": "EPSY",
    "number": "8811",
    "honors": false,
    "writingIntensive": false,
    "name": "Assessment I: School Psy",
    "fullname": "Assessment in School Psychology I: Foundations of Academic Assessment",
    "info": "Theories and models of psychoeducational assessment of children and adolescents within home, school, and community. Conceptual and empirical foundations of eco-behavioral assessment that lead to efficient but comprehensive assessment of children presented from problem-solving perspective.",
    "prereq": []
  },
  {
    "uid": "002125",
    "code": "EPSY8812",
    "subject": "EPSY",
    "number": "8812",
    "honors": false,
    "writingIntensive": false,
    "name": "Assessment II:SchP",
    "fullname": "Assessment in School Psychology II: Intellectual and Social-Emotional Domains",
    "info": "Builds on EPsy 8811. Emphasizes gathering data on a child's intellectual and social-emotional functioning and educational progress.prereq: Grad ed psy major with school psy subprog or instr consent",
    "prereq": []
  },
  {
    "uid": "002122",
    "code": "EPSY8813",
    "subject": "EPSY",
    "number": "8813",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Practicum School Psych",
    "fullname": "Introductory Practicum in School Psychology",
    "info": "Students complete a variety of learning activities intended to foster familiarity with the school environment and role of the school psychologist including school observations and formal and informal assessment techniques. All measures complement other facets of assessment presented in EPSY 8811 and 8812.",
    "prereq": []
  },
  {
    "uid": "002126",
    "code": "EPSY8815",
    "subject": "EPSY",
    "number": "8815",
    "honors": false,
    "writingIntensive": false,
    "name": "Behav/Social/Emot Prev/Interv",
    "fullname": "Behavioral and Social Emotional Prevention and Intervention",
    "info": "Theories and research-based practices underlying prevention and intervention practices to support students behavioral, social, and emotional development. Applied projects and assignments in practicum placements.prereq: 8821, 8811, 8812",
    "prereq": {
      "and": [
        {
          "code": "EPSY 8821",
          "subject": "EPSY",
          "id": "8821"
        },
        {
          "code": "EPSY 8811",
          "subject": "EPSY",
          "id": "8811"
        },
        {
          "code": "EPSY 8812",
          "subject": "EPSY",
          "id": "8812"
        }
      ]
    }
  },
  {
    "uid": "002129",
    "code": "EPSY8816",
    "subject": "EPSY",
    "number": "8816",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Prev/Intervention",
    "fullname": "Academic Prevention and Intervention",
    "info": "Theories and research-based approaches to prevention, instruction, and intervention practices to support students cognitive and academic development in core curricular domains. Applied projects and assignments in practicum placements.",
    "prereq": []
  },
  {
    "uid": "805464",
    "code": "EPSY8817",
    "subject": "EPSY",
    "number": "8817",
    "honors": false,
    "writingIntensive": false,
    "name": "Problm Analysis & Consultation",
    "fullname": "Problem Analysis and Consultation in School Psychology",
    "info": "Practical application of problem analysis and consultation models with school staff, parents, and students. Theories, approaches, and barriers to research-based indirect services in school psychology. Applied projects and assignments in practicum placements.",
    "prereq": []
  },
  {
    "uid": "002131",
    "code": "EPSY8818",
    "subject": "EPSY",
    "number": "8818",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Pract in School Psychology",
    "fullname": "Intermediate Practicum in School Psychology",
    "info": "Students complete a variety of learning activities intended to foster familiarity with the role of the school psychologist including formal and informal assessment techniques, academic and social-emotional interventions, and consultation. All interventions and consultation activities are linked to didactic portions of EPSY 8815, 8816, 8817.prereq: concurrent registration is required (or allowed) in  8815 or concurrent registration is required (or allowed) in  8816",
    "prereq": {
      "or": [
        {
          "code": "EPSY 8815",
          "subject": "EPSY",
          "id": "8815"
        },
        {
          "code": "EPSY 8816",
          "subject": "EPSY",
          "id": "8816"
        }
      ]
    }
  },
  {
    "uid": "815202",
    "code": "EPSY8819",
    "subject": "EPSY",
    "number": "8819",
    "honors": false,
    "writingIntensive": false,
    "name": "Emot & Childhd Psychopathology",
    "fullname": "Emotion & Childhood Psychopathology",
    "info": "This seminar is designed to provide an overview of historical and current perspectives on emotion and childhood psychopathology, including current diagnostic and classification systems, with emphasis on specific disorders. The course will focus on disorders that are typically observed by psychologists working in schools and other applied settings.",
    "prereq": []
  },
  {
    "uid": "002136",
    "code": "EPSY8821",
    "subject": "EPSY",
    "number": "8821",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in School Psychology",
    "fullname": "Issues in School Psychology",
    "info": "School psychology as professional field of specialization in psychology/education. Historical, theoretical, and research basis of school psychology. How school systems operate. Common roles/functions of school psychologists. In-class discussion, didactic/field-based assignments.",
    "prereq": []
  },
  {
    "uid": "002133",
    "code": "EPSY8822",
    "subject": "EPSY",
    "number": "8822",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in School Psychology",
    "fullname": "Research in School Psychology",
    "info": "Integrative, developmental series of discussions/activities about research in school psychology. Instruction/discussion regarding consumption, synthesis, conduct, dissemination of school psychology research.",
    "prereq": []
  },
  {
    "uid": "791775",
    "code": "EPSY8823",
    "subject": "EPSY",
    "number": "8823",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics/Prof Standards-SchPsy",
    "fullname": "Ethics and Professional Standards in School Psychology",
    "info": "Ethics, law, and current educational issues applied to study/practice of school psychology. Ethical principles, state/federal laws governing educational practices. How mandates are applied to work of school psychologists in general/special populations (e.g., special education, ESL, ethnic/racial minorities). Students apply learning as researchers and practicing school psychologists in schools.prereq: 8821",
    "prereq": {
      "code": "EPSY 8821",
      "subject": "EPSY",
      "id": "8821"
    }
  },
  {
    "uid": "002138",
    "code": "EPSY8831",
    "subject": "EPSY",
    "number": "8831",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in School Psychology",
    "fullname": "Comprehensive School Practicum in School Psychology",
    "info": "Supervised school field placement requiring assessment, consultation, prevention, and intervention activities.",
    "prereq": []
  },
  {
    "uid": "002139",
    "code": "EPSY8832",
    "subject": "EPSY",
    "number": "8832",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Pract in School Psychology",
    "fullname": "Advanced Practicum in School Psychology",
    "info": "Supervised field placement individualized to student interests and training goals. May require variety of assessment, consultation, prevention, and intervention activities.",
    "prereq": []
  },
  {
    "uid": "002141",
    "code": "EPSY8841",
    "subject": "EPSY",
    "number": "8841",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac:Instr/SupvSchP",
    "fullname": "Practicum: Instruction and Supervision in School Psychology",
    "info": "Didactic training/supervised experience teaching. Knowledge/skills in strategies for effective classroom instruction/supervision in individual/small group instruction. Construct teaching portfolio.",
    "prereq": []
  },
  {
    "uid": "002140",
    "code": "EPSY8842",
    "subject": "EPSY",
    "number": "8842",
    "honors": false,
    "writingIntensive": false,
    "name": "Internshp:SchP Serv",
    "fullname": "Internship: School Psychological Services",
    "info": "Advanced field placement. Full-time supervised experience for one year or part-time for no more than two years.prereq: Grad ed psy major with school psy subprog, instr consent",
    "prereq": []
  },
  {
    "uid": "816517",
    "code": "EPSY8843",
    "subject": "EPSY",
    "number": "8843",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship - School Psychology",
    "fullname": "Internship - School Psychology",
    "info": "Advanced field placement. Full-time supervised experience for one year or part-time for no more than two years.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "810084",
    "code": "EPSY8849",
    "subject": "EPSY",
    "number": "8849",
    "honors": false,
    "writingIntensive": false,
    "name": "Assessment in Early Childhood",
    "fullname": "Assessment in Early Childhood",
    "info": "Training psychologists/researchers in use of various assessment tools, including observational assessment strategies, for children birth-age 7. Intended primarily for graduate level practitioners-in-training interested in applied information on assessment/intervention services.prereq: [8811, 8812] or equivalent in related programs",
    "prereq": {
      "and": [
        {
          "code": "EPSY 8811",
          "subject": "EPSY",
          "id": "8811"
        },
        {
          "code": "EPSY 8812",
          "subject": "EPSY",
          "id": "8812"
        }
      ]
    }
  },
  {
    "uid": "799122",
    "code": "EPSY8850",
    "subject": "EPSY",
    "number": "8850",
    "honors": false,
    "writingIntensive": false,
    "name": "School Psychology Doc Seminar",
    "fullname": "Doctoral Seminar in School Psychology: Research, Training, Practice, Policy Issues, and Action Plans",
    "info": "Critical issues in school psychology, led by students or visiting professionals. Outside reading/research. Scientific findings/implications for training, practice, policy, and research. Students create professional-development plan.prereq: [[Grad student in school psychology, coursework in school psychology] or advanced PhD student from related department], instr consent",
    "prereq": []
  },
  {
    "uid": "787859",
    "code": "EPSY8888",
    "subject": "EPSY",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "002330",
    "code": "EPSY8905",
    "subject": "EPSY",
    "number": "8905",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist,Sys,Issue:EPsy",
    "fullname": "History and Systems of Psychology: Landmark Issues in Educational Psychology",
    "info": "Critical issues in learning and cognition, statistics and measurement, counseling, school psychology, social psychology of education, and special education.prereq: Ed psy PhD student",
    "prereq": []
  },
  {
    "uid": "005280",
    "code": "EPSY8993",
    "subject": "EPSY",
    "number": "8993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study:EPsy",
    "fullname": "Directed Study: Educational Psychology",
    "info": "Arranged independently with individual faculty members.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "005279",
    "code": "EPSY8994",
    "subject": "EPSY",
    "number": "8994",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Problems: EPsy",
    "fullname": "Research Problems: Educational Psychology",
    "info": "Research methodology, techniques, and literature. Students participate in formulating/executing research proposal.prereq: instr consent",
    "prereq": []
  }
]