[
  {
    "uid": "794153",
    "code": "ES1128",
    "subject": "ES",
    "number": "1128",
    "honors": false,
    "writingIntensive": false,
    "name": "ES Orientation Seminar",
    "fullname": "Seminar: Environmental Science Orientation",
    "info": "Orientation to University facilities, opportunities in environmental science, study skills, career planning, environmental topics.",
    "prereq": []
  },
  {
    "uid": "007290",
    "code": "ES4121",
    "subject": "ES",
    "number": "4121",
    "honors": false,
    "writingIntensive": false,
    "name": "Microbial Ecology & Appl Micro",
    "fullname": "Microbial Ecology and Applied Microbiology",
    "info": "Evolution/structure of microbial communities. Population interaction within ecosystems. Quantitative/habitat ecology. Biogeochemical cycling. Molecular microbial ecology, gene transfer in the environment. Molecular phylogeny of microorganisms. Application of microbes in agriculture. Production of commodity chemicals, drugs, and other high-value products.",
    "prereq": []
  },
  {
    "uid": "789813",
    "code": "ES5212",
    "subject": "ES",
    "number": "5212",
    "honors": false,
    "writingIntensive": false,
    "name": "Env. Biophysics & Ecol. Lab",
    "fullname": "Environmental Biophysics and Ecology Laboratory",
    "info": "Introduces experimental techniques in environmental biophysics and ecological studies. Measuring biophysical parameters of plants, animals, and their surrounding environments. Defining/describing physical status of a living organism, determining the rate of mass/energy exchange.",
    "prereq": []
  },
  {
    "uid": "008069",
    "code": "ES5421",
    "subject": "ES",
    "number": "5421",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Atmospheric Science",
    "fullname": "Introduction to Atmospheric Science",
    "info": "Calculus-based, introductory description of the atmosphere including atmospheric dynamics, radiation, thermodynamics, chemical composition, and cloud processes. Discuss applications to climate, meteorology, the hydrologic cycle, air quality, and biogeochemical cycles.",
    "prereq": []
  }
]