[
  {
    "uid": "002431",
    "code": "ESCI1001",
    "subject": "ESCI",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth and Its Environments",
    "fullname": "Earth and Its Environments",
    "info": "Physical processes that shape the Earth: volcanoes, earthquakes, plate tectonics, glaciers, rivers. Current environmental issues/global change. Lecture/lab. Optional field experience.",
    "prereq": []
  },
  {
    "uid": "002432",
    "code": "ESCI1002",
    "subject": "ESCI",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth History",
    "fullname": "Earth History",
    "info": "Evolution of life on Earth.  Interrelationships of plate tectonism, climate change and organic evolution that led to the present ecosystem.  Impacts of hominid evolution on Earth systems and of geological processes on human society.",
    "prereq": []
  },
  {
    "uid": "002433",
    "code": "ESCI1003",
    "subject": "ESCI",
    "number": "1003",
    "honors": false,
    "writingIntensive": false,
    "name": "Dinosaurs and Our World",
    "fullname": "Dinosaurs and Our World",
    "info": "Dinosaur evolution, ecology, and extinction. Evolution of modern ecosystems from the Mesozoic Era to the Anthropocene (and dinosaurs roles in that evolution). Human interactions with our environment and our roles as historic agents. Structure and function of biological forms, interpreting past life, and the social history of scientific inquiry.",
    "prereq": []
  },
  {
    "uid": "820345",
    "code": "ESCI1004",
    "subject": "ESCI",
    "number": "1004",
    "honors": false,
    "writingIntensive": false,
    "name": "Music of the Earth",
    "fullname": "Music of the Earth",
    "info": "The purpose of this class is to introduce some core mathematical concepts to students that may not be mathematically inclined. To do so, we will begin by exploring the mathematical expression of familiar concepts in sound and music. Examples include relating the pitch and volume of a pure tone to the frequency and amplitude of a sinusoidal function. We will build on the complexity of the concepts to include Fourier spectra and how they relate, for example, to the timbre of an instrument. The other key component of the class is exploring how these same concepts are used in understanding our planet, from its internal structure to variations in its climate.",
    "prereq": []
  },
  {
    "uid": "794176",
    "code": "ESCI1005",
    "subject": "ESCI",
    "number": "1005",
    "honors": false,
    "writingIntensive": false,
    "name": "Geology and Cinema",
    "fullname": "Geology and Cinema",
    "info": "Physical processes shaping the Earth, materials it comprises, its nearly five billion year history as told spectacularly, but often wrongly, by Hollywood movies.",
    "prereq": []
  },
  {
    "uid": "002435",
    "code": "ESCI1006",
    "subject": "ESCI",
    "number": "1006",
    "honors": false,
    "writingIntensive": false,
    "name": "Oceanography",
    "fullname": "Oceanography",
    "info": "How various processes in the ocean interact.  Marine biology, waves, tides, chemical oceanography, marine geology, and human interaction with the sea. Labs include study of live marine invertebrates, manipulation of oceanographic data, and discussion using videos showing unique aspects of ocean research.",
    "prereq": []
  },
  {
    "uid": "798666",
    "code": "ESCI1007",
    "subject": "ESCI",
    "number": "1007",
    "honors": false,
    "writingIntensive": false,
    "name": "From Microbes to Mammoths",
    "fullname": "From Microbes to Mammoths: History of Life on Earth",
    "info": "Scientific evidence from biology, paleontology, and geology for origin/evolution of life over 4.5 billion years of Earth's history. Biochemical basis of life, biogeochemical cycles, natural selection, origin of species, genetics, phylogeny reconstruction, timescales for evolution.",
    "prereq": []
  },
  {
    "uid": "014153",
    "code": "ESCI1011",
    "subject": "ESCI",
    "number": "1011",
    "honors": false,
    "writingIntensive": false,
    "name": "Volcanoes",
    "fullname": "Volcanoes of the Earth",
    "info": "Nonmathematical introduction to volcanoes, their origin and distribution on Earth and through time; theory of plate tectonics, origin of magmas and the Earth's interior; products of volcanoes, types of eruptions and hazards, and impact on climate, vegetation, and society.",
    "prereq": []
  },
  {
    "uid": "805403",
    "code": "ESCI1012",
    "subject": "ESCI",
    "number": "1012",
    "honors": false,
    "writingIntensive": false,
    "name": "Natural Disasters",
    "fullname": "Natural Disasters",
    "info": "Geological processes that give rise to natural hazards and the emerging technologies that allow societies to mitigate their effects.",
    "prereq": []
  },
  {
    "uid": "011213",
    "code": "ESCI1081",
    "subject": "ESCI",
    "number": "1081",
    "honors": false,
    "writingIntensive": false,
    "name": "Fraud in Earth Hist",
    "fullname": "Conspiracies, Fraud, and Deception in Earth History",
    "info": "Famous cases of geological deception from three centuries are presented in the intellectual context of their time and demonstrate the prevailing power of scientific reasoning.",
    "prereq": []
  },
  {
    "uid": "016327",
    "code": "ESCI1101",
    "subject": "ESCI",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Geology",
    "fullname": "Introduction to Geology (lecture only)",
    "info": "Physical processes that shape the Earth: volcanoes, earthquakes, plate tectonics, glaciers, rivers. Current environmental issues and global change. Lecture.",
    "prereq": []
  },
  {
    "uid": "016328",
    "code": "ESCI1102",
    "subject": "ESCI",
    "number": "1102",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Earth History",
    "fullname": "Introduction to Earth History",
    "info": "Evolution of life on Earth. Interrelationships of plate tectonism, climate change, and organic evolution that led to the present ecosystem. Impacts of hominid evolution on Earth systems and of geological processes on human society.",
    "prereq": []
  },
  {
    "uid": "798673",
    "code": "ESCI1105",
    "subject": "ESCI",
    "number": "1105",
    "honors": false,
    "writingIntensive": false,
    "name": "Geology and Cinema",
    "fullname": "Geology and Cinema (lecture only)",
    "info": "Physical processes shaping the Earth, materials it comprises, its nearly five billion year history as told spectacularly, but often wrongly, by Hollywood movies.",
    "prereq": []
  },
  {
    "uid": "798674",
    "code": "ESCI1106",
    "subject": "ESCI",
    "number": "1106",
    "honors": false,
    "writingIntensive": false,
    "name": "Oceanography",
    "fullname": "Oceanography",
    "info": "How various processes in the ocean interact. Marine biology, waves, tides, chemical oceanography, marine geology, human interaction with sea.",
    "prereq": []
  },
  {
    "uid": "817873",
    "code": "ESCI1201",
    "subject": "ESCI",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Earth Sciences Lab",
    "fullname": "Into Earth Sciences Lab",
    "info": "ESCI 1201 is simply the same suite of laboratory explorations that comprise the lab component of ESCI 1001. ESCI 1201's only purpose is to allow students who have previously taken ESCI 1101 (the lecture-only equivalent of ESCI 1001) to combine ESCI 1101 and ESCI 1201 to complete the standard ESCI 1001 class in order to satisfy LE requirements as a Physical Science (students who completed ESCI 1101 have already fulfilled the requirements for the Environment theme). ESCI 1201 is only available to students who have previously taken ESCI 1101, it cannot be taken as a stand-alone course. Please refer to ESCI 1001 for an equivalent description of the combined ESCI 1101/1201 program. ",
    "prereq": []
  },
  {
    "uid": "818421",
    "code": "ESCI1205",
    "subject": "ESCI",
    "number": "1205",
    "honors": false,
    "writingIntensive": false,
    "name": "Geology and Cinema Lab",
    "fullname": "Geology and Cinema Lab",
    "info": "ESCI 1205 is simply the same suite of laboratory explorations that comprise the lab component of ESCI 1005. ESCI 1205's only purpose is to allow students who have previously taken ESCI 1105 (the lecture-only equivalent of ESCI 1005) to combine ESCI 1105 and ESCI 1205 to complete the standard ESCI 1005 class in order to satisfy LE requirements as a Physical Science (students who completed ESCI 1105 have already fulfilled the requirements for the Environment theme). ESCI 1205 is only available to students who have previously taken ESCI 1105, it cannot be taken as a stand-alone course. Please refer to ESCI 1005 for an equivalent description of the combined ESCI 1105/1205 program. ",
    "prereq": []
  },
  {
    "uid": "818404",
    "code": "ESCI1206",
    "subject": "ESCI",
    "number": "1206",
    "honors": false,
    "writingIntensive": false,
    "name": "Oceanography Lab",
    "fullname": "Oceanography Lab",
    "info": "ESCI 1206 is simply the same suite of laboratory explorations that comprise the lab component of ESCI 1006. ESCI 1206's only purpose is to allow students who have previously taken ESCI 1106 (the lecture-only equivalent of ESCI 1006) to combine ESCI 1106 and ESCI 1206 to complete the standard ESCI 1006 class in order to satisfy LE requirements as a Physical Science (students who completed ESCI 1106 have already fulfilled the requirements for the Environment theme). ESCI 1206 is only available to students who have previously taken ESCI 1106, it cannot be taken as a stand-alone course. Please refer to ESCI 1006 for an equivalent description of the combined ESCI 1106/1206 program. ",
    "prereq": []
  },
  {
    "uid": "790044",
    "code": "ESCI1901",
    "subject": "ESCI",
    "number": "1901",
    "honors": false,
    "writingIntensive": false,
    "name": "Polar Environments",
    "fullname": "Polar Environments: Rocks, Ice, and Human Impact",
    "info": "With a focus on the Earth?s polar regions, this freshman seminar addresses general principles of Earth science, climate change on various temporal scales, and the relation among human activities, climate, and the environment. These principles are illustrated by selected readings of the Earth science and climatology literature, which will allow students to connect knowledge with real-world practice. Assignments develop research skills, writing proficiency, oral expression, logical reasoning, and critical analysis. Emphasis is placed on current debates, particularly regarding global climate change, such that students develop critical and ethical thinking skills related to these challenges. Reading assignments are chosen to show that solutions to environmental issues are part of a larger societal evolution, where individuals in society are viewed as historical agents, one that involves a combination of technological advances, science policy, and shared individual and community responsibility. Work for this course involves synthesis of datasets, writing of essays based on journal and magazine articles, and group presentations. The science and policy part of the course is balanced by writers and artist?s expression of the beauty and awesomeness of polar landscapes. Three credits are justified by the amount of work required to come prepared for seminar, upon which the success of the course rests, and the time spent on personal research and writing assignments, as well as the preparation of group presentations.",
    "prereq": []
  },
  {
    "uid": "817141",
    "code": "ESCI1902",
    "subject": "ESCI",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Geology of Minnesota",
    "fullname": "Geology of Minnesota",
    "info": "This course addresses important societal questions, such as \"Where does my drinking water come from? Do I really need to buy bottled water? What should my stand be regarding major water-related environmental issues in Minnesota?\" In this course, we will explore the world around us, and apply what we learn to better contribute to the solutions we will need as a society to deal with impacts on water quality and quantity due to factors such as agriculture, flood control, groundwater pumping, hydroelectric power, integrity of surface water features, interbasin transfers, invasive biota, mining, and shipping. In doing so, we will explore ways for everyone to better take responsibility for their role in optimizing public health, maximizing economic benefits, maintaining biodiversity, and protecting the integrity of surface water features on our landscape. Emphasis will be placed on how our choices and solutions will in the long term affect our principal drinking water source--the groundwater that is hosted in ancient rocks in the north and in the deep subsurface, younger limestone and sandstone in the south, and the sediments of the most recent Ice Age from which our soils have formed. A full-day field trip planned for a Saturday in September will examine how societal choices affect our use of and protection of water resources in our rivers and lakes, and a second full-day trip on a Saturday in October will address the same issues in relation to our largest source of drinking water--our wells. Those unable to attend a field trip may instead prepare a paper. ",
    "prereq": []
  },
  {
    "uid": "817142",
    "code": "ESCI1903",
    "subject": "ESCI",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "Sea Level in the 21st Century",
    "fullname": "Sea Level in the 21st Century: Societal Response to Coastal Processes",
    "info": "This course focuses on the oceanic shorelines of planet Earth and examines the role of changing sea level and its impact on both humans and ecosystems that inhabit coastal regions as well as its impact on the broader global society. Scientific literature and popular press are replete with the view that global sea level is rising in the 21st century. However, in reality, some sectors of the marine shorelines are experiencing a sea-level fall. Thus understanding what controls changing sea level is key to guide society?s response and to promote responsible public policy. Students will develop scientific fluency in fundamental coastal processes associated with waves, tides, beaches, storms (hurricanes), rising or sinking land, river deltas, and nearshore regions in general. These coastal processes will be examined in the face of changing sea level and its interrelationship with land-use policies, engineering practices, human infrastructure, coastal laws, risk assessment in the insurance industry, and global geopolitics. Assignments will enhance students? skills in research, logical reasoning, and critical analysis as well as foster lifelong skills in writing proficiency and oral communication. The societal challenges posed by changing sea level, both local and international, lie at the heart of this seminar.",
    "prereq": []
  },
  {
    "uid": "818023",
    "code": "ESCI1904",
    "subject": "ESCI",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Astrobiology",
    "fullname": "Astrobiology: The Science of the Search for Life on Other Planets",
    "info": "Astrobiology brings together concepts from many different scientific fields, including geology, chemistry, biology, astronomy, and planetary science, to help answer one of the most enduring questions humankind has asked while looking up at the stars: Are we alone in the Universe? Building from a foundation of what we know about life today and what we have learned about past life preserved in the rock record on Earth, we are looking for signs of life on habitable worlds within our solar system (including Mars, Europa, Ganymede, and Enceladus). Further, with an ever-increasing catalog of worlds detected around stars outside of our solar system, we are studying how to look for life on worlds beyond our solar system.This course will address questions that are fundamental to astrobiology, including: What is life? What are the physical and chemical requisites for life as we know it? Were these requisites present on other worlds in the past, or are they present today? How do we look for signs of past or present life on other worlds? To help address these questions, students will learn the basic principles of astronomy (star formation, planetary accretion), geology (planetary composition, geologic time, plate tectonics, preservation of biosignatures), chemistry (elements and reactions essential to life, chemical signatures life produces), and biology (metabolism, chemotrophy, phototrophy, biological innovation).Students will complete this course with a deeper understanding of: (1) how our solar system and planet formed; (2) how life developed and evolved; (3) planetary geology and geologic time; (4) the strategies for life in extreme environments; (5) the conditions necessary for a habitable world; (6) past, present, and future missions looking for life on other worlds; and (7) the place of our planet in the universe.",
    "prereq": []
  },
  {
    "uid": "790933",
    "code": "ESCI1905",
    "subject": "ESCI",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary. See Class Schedule.",
    "prereq": []
  },
  {
    "uid": "791303",
    "code": "ESCI1906W",
    "subject": "ESCI",
    "number": "1906",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar: WI/Env",
    "fullname": "Freshman Seminar: Writing Intensive and Environmental Theme",
    "info": "Topics vary: see freshman seminar topics.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "818069",
    "code": "ESCI1907",
    "subject": "ESCI",
    "number": "1907",
    "honors": false,
    "writingIntensive": false,
    "name": "Caves and Karst",
    "fullname": "Caves and Karst: Rocks, Water, and Human Impact",
    "info": "With a focus on caves in Minnesota and throughout the world, this freshman seminar addresses general principles of earth science and climate change on various temporal scales, and the relationship between human activities (e.g., land use) and the environment. Environmental issues surrounding urban and agricultural groundwater water quality and use are a primary focus. We will be using the underlying scientific principles of geology, hydrology, biology, and chemistry of karst and cave systems in order to more clearly grapple with these environmental issues. We will examine the current limitations of our technologies to model groundwater flow in complex cave and karst environments, and discuss the ramifications of these limitations on the development of reasonable zoning regulations, agricultural practices, and groundwater quality criteria. Additionally, this course aims to show that caves have often acted as inhabited places throughout history (even in modern times) and may contain cultural (archaeological) resources worthy of protection. Finally, this course hopes to encourage an appreciation for the roles that caves and karst play in modern society as gas and groundwater reservoirs, the latter of which can be compromised by the migration of contaminated waters. Students will read peer-reviewed research to identify for themselves the environmental issues facing caves and karst and to begin to propose their own potential solutions. Student appreciation for the fragility of cave environments will be grounded in first-hand experiences gained during field trips to local caves.",
    "prereq": []
  },
  {
    "uid": "819704",
    "code": "ESCI1908",
    "subject": "ESCI",
    "number": "1908",
    "honors": false,
    "writingIntensive": false,
    "name": "Sea Change",
    "fullname": "Sea Change: Geological Perspective",
    "info": "Paleoceanography is the study of the environmental history of the planet from records of ancient oceans. This seminar course is intended for first-year students who are interested in understanding how and why the planet has changed in the geologic past and learning how scientists gather evidence of environmental change from marine sediments. We will examine how to use fossils and other evidence for reconstructing sea-level, ancient ocean currents, and abrupt paleoclimatic events and their impacts on marine life, and we will discuss major ideas about the driving forces of these past changes. Understanding the geologic past is highly relevant to understanding current and future environmental change.",
    "prereq": []
  },
  {
    "uid": "820046",
    "code": "ESCI1909",
    "subject": "ESCI",
    "number": "1909",
    "honors": false,
    "writingIntensive": false,
    "name": "Manoomin/Wild Rice Environment",
    "fullname": "Manoomin (Wild Rice) and Its Environment",
    "info": "Manoomin (Ojibwe for wild rice) is Minnesota’s beloved state grain, and it plays a central role in both the diet and cultural identity of many Native peoples around the Great Lakes.  Manoomin/wild rice is an aquatic grass that grows naturally in shallow lakes and streams, but unfortunately, due to its high sensitivity to various environmental stressors (e.g., perturbed water levels, contaminants, competitive and invasive species, and climate change), it has been experiencing progressive declines across the region.  This has been alarming for Native and non-Native people for whom manoomin/wild rice holds special meaning.  In this course, students will gain an interdisciplinary perspective on how multiple components of the environment, as well as people’s relationships and actions with it, together influence the health of manoomin/wild rice stands.  Understanding what supports manoomin/wild rice requires a look at local lake to greater watershed-scale conditions; interacting ecological, hydrological, geochemical, and geological processes; and different environmental management approaches driven by diverse values.  While manoomin/wild rice has served as a flashpoint between tribes and industries that impair their environment, we will learn how it can also become a rallying point for Indigenous knowledge-holders and conventional academic scientists to share different worldviews, for tribal and non-tribal policy-makers to collaboratively manage resources, and for all communities living around manooomin/wild rice waters to be better stewards of the whole environment.Students will learn a holistic approach to studying manoomin/wild rice and its environment through readings and exercises that span disciplines.  They will also participate in community-engaged learning activities that integrate perspectives beyond conventional academic cultures that can deepen our understanding of the environment.  There will also be a two-night field trip during the first weekend of the semester for students to experience first-hand manoomin/wild rice waters, traditional processing methods, and Ojibwe craft-making with elders from the White Earth Indian Reservation.",
    "prereq": []
  },
  {
    "uid": "820540",
    "code": "ESCI2001",
    "subject": "ESCI",
    "number": "2001",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth System Science -with lab",
    "fullname": "Intro to Problems in Earth System Sci -with lab",
    "info": "In this course, we study Earth as an integrated system of many interacting components. Examples of these components include the atmosphere, the ocean, continents, rivers and lakes, plants and animals, and humans. Changes within and among these components are shaping our planet and environment. Many grand challenges facing our society today, ranging from climate change to natural hazards, cannot be fully understood without a better understanding of these interactions. This course introduces some key concepts and principles of Earth System Science through a collection of recent scientific discoveries and outstanding problems in the field. The class touches on a wide range of fascinating topics related to the Earth’s deep interior, surface environments, life, and its 4.5 billion-year history, highlighting the interdisciplinary nature of the subject. Meanwhile, all the topics are centered around introducing basic physical and chemical processes that regulate the operation of the Earth as a system. This course gives students an excellent opportunity to explore a broad spectrum of active research in the Earth and Environmental Sciences, state-of-the-art research techniques, and potential career options in this field. Students are expected to develop quantitative skills in addressing questions in Earth System Science through lectures, in-class discussions, and assignments.",
    "prereq": []
  },
  {
    "uid": "825662",
    "code": "ESCI2101",
    "subject": "ESCI",
    "number": "2101",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth System Sci-lecture only",
    "fullname": "Intro to Problems in Earth System Science - lecutre only",
    "info": "In this course, we study Earth as an integrated system of many interacting components. Examples of these components include the atmosphere, the ocean, continents, rivers and lakes, plants and animals, and humans. Changes within and among these components are shaping our planet and environment. Many grand challenges facing our society today, ranging from climate change to natural hazards, cannot be fully understood without a better understanding of these interactions. This course introduces some key concepts and principles of Earth System Science through a collection of recent scientific discoveries and outstanding problems in the field. The class touches on a wide range of fascinating topics related to the Earth’s deep interior, surface environments, life, and its 4.5 billion-year history, highlighting the interdisciplinary nature of the subject. Meanwhile, all the topics are centered around introducing basic physical and chemical processes that regulate the operation of the Earth as a system. This course gives students an excellent opportunity to explore a broad spectrum of active research in the Earth and Environmental Sciences, state-of-the-art research techniques, and potential career options in this field. Students are expected to develop quantitative skills in addressing questions in Earth System Science through lectures, in-class discussions, and assignments.",
    "prereq": []
  },
  {
    "uid": "003952",
    "code": "ESCI2201",
    "subject": "ESCI",
    "number": "2201",
    "honors": false,
    "writingIntensive": false,
    "name": "Solid Earth Dynamics",
    "fullname": "Solid Earth Dynamics",
    "info": "Dynamics of solid Earth, particularly tectonic system. Seismology, internal structure of Earth. Earth's gravity, magnetic fields. Paleomagnetism, global plate tectonics, tectonic systems. Field trip.prereq: concurrent registration is required (or allowed) in PHYS 1301 or instr consent",
    "prereq": {
      "code": "PHYS 1301",
      "subject": "PHYS",
      "id": "1301"
    }
  },
  {
    "uid": "803865",
    "code": "ESCI2202",
    "subject": "ESCI",
    "number": "2202",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth History",
    "fullname": "Earth History",
    "info": "Big Bang cosmology, plate tectonics, evolution. Formation of Earth. Chemical evolution of Earth, atmosphere, and ocean. Origin/tectonic evolution of continents. Origin of life, its patterns/processes. Long-term interactions between geosphere, atmosphere, and biosphere.prereq: [2201, 2301] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "ESCI 2201",
          "subject": "ESCI",
          "id": "2201"
        },
        {
          "code": "ESCI 2301",
          "subject": "ESCI",
          "id": "2301"
        }
      ]
    }
  },
  {
    "uid": "804895",
    "code": "ESCI2203",
    "subject": "ESCI",
    "number": "2203",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth Surface Dynamics",
    "fullname": "Earth Surface Dynamics",
    "info": "Earth's surface processes, drivers, and implications. Interactions between atmosphere, lithosphere, hydrosphere, and biosphere.",
    "prereq": []
  },
  {
    "uid": "003953",
    "code": "ESCI2301",
    "subject": "ESCI",
    "number": "2301",
    "honors": false,
    "writingIntensive": false,
    "name": "Mineralogy",
    "fullname": "Mineralogy",
    "info": "Crystallography, crystal chemistry, physics. Physical/chemical properties, crystal structures, chemical equilibria of major mineral groups. Lab includes crystallographic, polarizing microscope, X-ray powder diffraction exercises, hand-specimen mineral identification.prereq: [concurrent registration is required (or allowed) in CHEM 1061, concurrent registration is required (or allowed) in CHEM 1065, concurrent registration is required (or allowed) in MATH 1271] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CHEM 1061",
          "subject": "CHEM",
          "id": "1061"
        },
        {
          "code": "CHEM 1065",
          "subject": "CHEM",
          "id": "1065"
        },
        {
          "code": "MATH 1271",
          "subject": "MATH",
          "id": "1271"
        }
      ]
    }
  },
  {
    "uid": "003954",
    "code": "ESCI2302",
    "subject": "ESCI",
    "number": "2302",
    "honors": false,
    "writingIntensive": false,
    "name": "Petrology",
    "fullname": "Petrology",
    "info": "Magmatic and metamorphic processes, with an emphasis on plate tectonic interpretation of rock sequences.prereq: 2301 or instr consent",
    "prereq": {
      "code": "ESCI 2301",
      "subject": "ESCI",
      "id": "2301"
    }
  },
  {
    "uid": "005377",
    "code": "ESCI3001",
    "subject": "ESCI",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth Materials",
    "fullname": "Earth Materials",
    "info": "Common rocks/minerals and their geologic settings. Properties of these materials as basis for identification/use in industry/society.",
    "prereq": []
  },
  {
    "uid": "005378",
    "code": "ESCI3002",
    "subject": "ESCI",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate and History",
    "fullname": "Climate Change and Human History",
    "info": "Causes of long-/short-term climate change. Frequency/magnitude of past climate changes; their geologic records. Relationship of past climate changes to development of agrarian societies and to shifts in power among kingdoms/city-states. Emphasizes last 10,000 years.",
    "prereq": []
  },
  {
    "uid": "005379",
    "code": "ESCI3003",
    "subject": "ESCI",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Geohazards",
    "fullname": "Geohazards",
    "info": "Geologic hazards associated with earthquakes/volcanoes. How society confronts dangers posed by these phenomena. Geological/geophysical nature/causes of earthquakes/volcanoes. Prediction/risk assessment. Public policy issues.",
    "prereq": []
  },
  {
    "uid": "005380",
    "code": "ESCI3004",
    "subject": "ESCI",
    "number": "3004",
    "honors": false,
    "writingIntensive": false,
    "name": "Water and Society",
    "fullname": "Water and Society",
    "info": "For non-science majors. Study of (1) the role of humans as agents influencing the composition (quality) of water resources through domestic, agricultural, industrial, and other land-use practices; (2) the role of water in various ecosystem services which may be at odds with the anthropocentric view of water as a resource; (3) how population increase and climate change, coupled with human actions, is affecting the quality and quantity of available water, leading to lack of access to clean water and decent sanitation, and to severe water shortages (e.g., for irrigation) in some areas, especially in developing nations and politically unstable regions; and (4) how the availability of water shapes a societys view of water as a resource and its view of the non-human demands for water (which is not uniform across the globe).",
    "prereq": []
  },
  {
    "uid": "005382",
    "code": "ESCI3005",
    "subject": "ESCI",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth Resources",
    "fullname": "Earth Resources",
    "info": "Geologic aspects of energy/material resources. Resource size/life-times. Environmental consequences of resource use. Issues of international/public ethics associated with resource production, distribution, and use.",
    "prereq": []
  },
  {
    "uid": "005383",
    "code": "ESCI3006",
    "subject": "ESCI",
    "number": "3006",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Planetary Science",
    "fullname": "Rocks and Stars: Introduction to Planetary Science",
    "info": "ESCI 3006 is designed for students without strong backgrounds in math or physical sciences that are interested in an introductory level survey of planetary science. Students with stronger backgrounds in earth or other physical sciences may also find much of interest, although the approach will be largely non-quantitative. The course will introduce undergraduate students to the dazzling variety of worlds in our solar system and illustrate how many of the planetary scale systems of the Earth compare and contrast to those of other planets. The course will also consider the dynamical and chemical processes that lead to the origin of our solar system and Earth. Additionally, we will also survey recent exciting observations and discoveries of exoplanets, including consideration of how the diversity of other solar systems aids understanding of our own. The physical and chemical principles underlying planetary processes will be a unifying theme of the course. The course will take advantage of the many resources made available by planetary exploration missions, including those producing the most recent new observations. Owing to the fast-moving pace of discovery in planetary science the curricular content will be and updated each time the course is taught.  prereq: An interest in the solar system and planets.",
    "prereq": []
  },
  {
    "uid": "006273",
    "code": "ESCI3093",
    "subject": "ESCI",
    "number": "3093",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies in ESci:Jr",
    "fullname": "Directed Studies in Earth & Environmental Sciences: Junior",
    "info": "Directed studies in earth & environmental sciences under the direction of a faculty member.Prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "793865",
    "code": "ESCI3096",
    "subject": "ESCI",
    "number": "3096",
    "honors": false,
    "writingIntensive": false,
    "name": "Geology of Iceland",
    "fullname": "Geology of Iceland",
    "info": "Geologic processes that form Iceland. Tectonics, volcanology, geomorphology, glaciology. Interplay between physical environment of Iceland and its social structure and culture. Lectures, field trips.",
    "prereq": []
  },
  {
    "uid": "826888",
    "code": "ESCI3105",
    "subject": "ESCI",
    "number": "3105",
    "honors": false,
    "writingIntensive": false,
    "name": "21st Century Env Justice",
    "fullname": "Environmental Justice in the 21st Century",
    "info": "This course explores the concept of Environmental Justice as both a topic that is rooted in scientific study and as a social movement in the United States. Following an introduction to the development of environmental justice as a concept in the US since the reconstruction following the Civil War, we will consider specific case studies during the 20th and 21st centuries that align with topics in the Earth and Environmental Sciences, including petroleum extraction and hydrofracturing, mapping and resource extraction, native American environmental justice, hazardous waste disposal, and climate justice, as framed by Robert Bullard’s 6 Pillars of the Environmental Justice Movement. We will conclude by exploring similarities and differences in how Environmental Justice is addressed in the US compared to other countries globally. The overall course goal is for students to gain an understanding of the pervasiveness of environmental justice issues and of social and scientific approaches to evaluating issues in the broad field of environmental justice.",
    "prereq": []
  },
  {
    "uid": "817531",
    "code": "ESCI3190",
    "subject": "ESCI",
    "number": "3190",
    "honors": false,
    "writingIntensive": false,
    "name": "Curricular Practical Training",
    "fullname": "Curricular Practical Training",
    "info": "Work assignments involving advanced earth science training.  Reviewed by the Director of Undergraduate Studies.",
    "prereq": []
  },
  {
    "uid": "003956",
    "code": "ESCI3202",
    "subject": "ESCI",
    "number": "3202",
    "honors": false,
    "writingIntensive": false,
    "name": "Fluid Earth Dynamics",
    "fullname": "Fluid Earth Dynamics",
    "info": "Dynamics of fluid Earth, mainly surface processes and convection.prereq: concurrent registration is required (or allowed) in 2201",
    "prereq": {
      "code": "ESCI 2201",
      "subject": "ESCI",
      "id": "2201"
    }
  },
  {
    "uid": "003955",
    "code": "ESCI3303W",
    "subject": "ESCI",
    "number": "3303",
    "honors": false,
    "writingIntensive": true,
    "name": "Geochem Principles",
    "fullname": "Geochemical Principles",
    "info": "Origin of elements (nucleosynthesis, elemental abundances). Geochemical classifications. Isotopes (radioactive, stable). Phase equilibria. Models of Earth's geochemical evolution. Basic geochemical processes that produced Earth's lithosphere, hydrosphere, atmosphere.prereq: [concurrent registration is required (or allowed) in CHEM 1061, concurrent registration is required (or allowed) in CHEM 1065] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CHEM 1061",
          "subject": "CHEM",
          "id": "1061"
        },
        {
          "code": "CHEM 1065",
          "subject": "CHEM",
          "id": "1065"
        }
      ]
    }
  },
  {
    "uid": "003957",
    "code": "ESCI3401",
    "subject": "ESCI",
    "number": "3401",
    "honors": false,
    "writingIntensive": false,
    "name": "Geochronology",
    "fullname": "Geochronology and Earth History",
    "info": "Modern high precision techniques for quantifying geologic time. Litho-, bio-, and chrono-stratigraphic correlation techniques for reconstructing geologic history.",
    "prereq": []
  },
  {
    "uid": "802417",
    "code": "ESCI3402",
    "subject": "ESCI",
    "number": "3402",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci & Politics Global Warming",
    "fullname": "Science and Politics of Global Warming",
    "info": "Detection/attribution of global warming using concepts of radiation, climate system, and carbon cycle. Effects on society/biodiversity. National/global efforts/controversy over responses/consequences.",
    "prereq": []
  },
  {
    "uid": "819778",
    "code": "ESCI3403",
    "subject": "ESCI",
    "number": "3403",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Applications,EarthSci",
    "fullname": "Computer Applications in Earth & Environmental Sciences",
    "info": "This class is meant to provide students with skills in scientific computer programming, specifically with a special focus on the Earth & environmental sciences and other disciplines where spatial data are important. The course assumes no previous knowledge of computer programming. Although the class will use MATLAB, topics covered in the course include concepts common to all programming languages including functions, logic, branching, loops, data types, binary code, data formatting for input/output, among others. Additionally, students will develop problem-solving skills in learning how to design algorithms to achieve a task and in learning how to troubleshoot and debug their code. Students taking the class at the 5xxx level will be required to complete a programming project related to their own research. This course will be different from other introductory-level programming courses in that it will have a spatial emphasis and focus on examples and datasets related to the Earth and environmental sciences. Students will learn how to access a variety of Earth and environmental science data repositories and work with data in standard formats (i.e. NetCDF). Working with geographically referenced data in different projections will be explored using different toolboxes available for that purpose. Plotting of data will also be extensively covered including the production of publication-quality figures and animations. Prereq: upper division or instructor consent.",
    "prereq": []
  },
  {
    "uid": "805499",
    "code": "ESCI3425",
    "subject": "ESCI",
    "number": "3425",
    "honors": false,
    "writingIntensive": false,
    "name": "From Smog to Climate Change",
    "fullname": "Atmospheric Pollution: From Smog to Climate Change",
    "info": "Processes governing chemical makeup of Earth's atmosphere. Implications for air pollution, climate, human welfare.  Evolution of atmosphere. Atmospheric structure/transport. Biogeochemical cycles of carbon, nitrogen, oxygen, mercury.  Greenhouse effect. Aerosols. Stratospheric ozone loss.prereq: [CHEM 1061, PHYS 1101W, MATH 1142 or 1271] or equiv or instr consent. Course cross-listed with ESCI 3425.",
    "prereq": {
      "and": [
        {
          "code": "CHEM 1061",
          "subject": "CHEM",
          "id": "1061"
        },
        {
          "code": "PHYS 1101W",
          "subject": "PHYS",
          "id": "1101W"
        },
        {
          "code": "MATH 1142",
          "subject": "MATH",
          "id": "1142"
        },
        {
          "code": "ESCI 1271",
          "subject": "ESCI",
          "id": "1271"
        }
      ]
    }
  },
  {
    "uid": "005388",
    "code": "ESCI3870",
    "subject": "ESCI",
    "number": "3870",
    "honors": false,
    "writingIntensive": false,
    "name": "Modeling Wkshp",
    "fullname": "Modeling Workshop",
    "info": "Modeling of geologic or geophysical systems.prereq: Geo or Geophys or GeoEng major or instr consent",
    "prereq": []
  },
  {
    "uid": "005387",
    "code": "ESCI3880",
    "subject": "ESCI",
    "number": "3880",
    "honors": false,
    "writingIntensive": false,
    "name": "Laboratory Workshop",
    "fullname": "Laboratory Workshop",
    "info": "Geologic or geophysical lab study.prereq: ESCI major or CEGE major or instr consent",
    "prereq": []
  },
  {
    "uid": "005386",
    "code": "ESCI3890",
    "subject": "ESCI",
    "number": "3890",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Workshop",
    "fullname": "Field Workshop",
    "info": "Earth sciences field workshop where students learn about the geological aspects of specific area(s) and culminates in a field trip to that area(s) to see the geology first-hand.",
    "prereq": []
  },
  {
    "uid": "803155",
    "code": "ESCI3891",
    "subject": "ESCI",
    "number": "3891",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Methods",
    "fullname": "Field Methods",
    "info": "Methods in geologic field mapping.",
    "prereq": []
  },
  {
    "uid": "818367",
    "code": "ESCI3896",
    "subject": "ESCI",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship in Geosciences",
    "fullname": "Internship in Earth and Environmental Sciences",
    "info": "This course is meant for students who are in the process of doing an internship related earth and environmental sciences at a firm, nonprofit organization, or public agency (at the federal, state, county, or municipal level) that is off-site from the University. The course is designed to help you analyze, reflect on, and construct meaning from your internship experience through the following: 1) self-assessment of personal and career needs and goals, 2) examination of what it means to be a \"professional\" and operate within professional environments, 3) evaluation of performance & accomplishments, 4) articulation of knowledge and skills via effective resume writing and/or interviewing. You will accomplish this through processing/discussing your internship experience through academic assignments and interaction with fellow classmates and departmental staff.It's important to work with your internship supervisor to create a learning contract that outlines what you plan to learn and accomplish during your internship and how you plan to contribute and add value to the organization. You will complete various additional assignments including blogs, readings, and a resume that will allow you to gain knowledge and insight from your experience. What you gain from this class will be the direct result of the effort you put into it!",
    "prereq": []
  },
  {
    "uid": "005389",
    "code": "ESCI3911",
    "subject": "ESCI",
    "number": "3911",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Field Geology",
    "fullname": "Introductory Field Geology",
    "info": "Geologic mapping on topographic maps and aerial photos. Field identification of igneous, sedimentary, and metamorphic rocks. Measurement of stratigraphic sections. Structural/geomorphic features.prereq: ESci 3891 or instr consent",
    "prereq": {
      "code": "ESCI 3891",
      "subject": "ESCI",
      "id": "3891"
    }
  },
  {
    "uid": "825209",
    "code": "ESCI3980",
    "subject": "ESCI",
    "number": "3980",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Topics in Earth&EnvSci",
    "fullname": "Seminar: Current Topics in Earth & Environmental Sciences",
    "info": "Topics in Earth sciences investigated in a seminar format, for undergraduate students.",
    "prereq": []
  },
  {
    "uid": "006274",
    "code": "ESCI4010",
    "subject": "ESCI",
    "number": "4010",
    "honors": false,
    "writingIntensive": false,
    "name": "Undergrad Seminar-Earth&EnvSci",
    "fullname": "Undergraduate Seminar: Current Topics in Earth & Environmental Sciences",
    "info": "Topics in earth sciences investigated in a seminar format.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "006275",
    "code": "ESCI4093",
    "subject": "ESCI",
    "number": "4093",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies in ESci:Sr",
    "fullname": "Directed Studies in Earth & Environmental Sciences: Senior",
    "info": "Directed studies in earth & environmental sciences under the direction of a faculty member.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "006276",
    "code": "ESCI4094",
    "subject": "ESCI",
    "number": "4094",
    "honors": false,
    "writingIntensive": false,
    "name": "Senior Thesis",
    "fullname": "Senior Thesis",
    "info": "Senior-level majors engage in independent research under faculty supervision. Select problems according to individual interests and in consultation with faculty committee. Thesis and oral defense.prereq: Sr, Geo or ESci major, instr consent",
    "prereq": []
  },
  {
    "uid": "793867",
    "code": "ESCI4096",
    "subject": "ESCI",
    "number": "4096",
    "honors": false,
    "writingIntensive": false,
    "name": "Geologic Studies in Iceland",
    "fullname": "Geologic Field Studies in Iceland",
    "info": "Lectures, field research in various parts of Iceland. Focuses on individual projects in southwest Iceland. Write-up, oral presentation of field studies.",
    "prereq": []
  },
  {
    "uid": "792614",
    "code": "ESCI4102W",
    "subject": "ESCI",
    "number": "4102",
    "honors": false,
    "writingIntensive": true,
    "name": "Vertebrate Paleontology",
    "fullname": "Vertebrate Paleontology: Evolutionary History and Fossil Records of Vertebrates",
    "info": "Vertebrate evolution (exclusive of mammals) in phylogenetic, temporal, functional, and paleoecological contexts. Vertebrate anatomy. Methods in reconstructing phylogenetic relationships and origin/history of major vertebrate groups, from Cambrian Explosion to modern diversity of vertebrate animals.prereq: 1001 or 1002 or Biol 1001 or Biol 1002 or Biol 1009 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "ESCI 1001",
          "subject": "ESCI",
          "id": "1001"
        },
        {
          "code": "ESCI 1002",
          "subject": "ESCI",
          "id": "1002"
        },
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 1002",
          "subject": "BIOL",
          "id": "1002"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        }
      ]
    }
  },
  {
    "uid": "794177",
    "code": "ESCI4103W",
    "subject": "ESCI",
    "number": "4103",
    "honors": false,
    "writingIntensive": true,
    "name": "Fossil Record of Mammals",
    "fullname": "Fossil Record of Mammals",
    "info": "Evolutionary history of mammals and their extinct relatives. Methods in reconstructing phylogeny. Place of mammals in evolutionary history of vertebrate animals. Major morphological/ecological transitions. Origins of modern groups of mammals. Continuing controversies in studying fossil mammals.",
    "prereq": []
  },
  {
    "uid": "820254",
    "code": "ESCI4104",
    "subject": "ESCI",
    "number": "4104",
    "honors": false,
    "writingIntensive": false,
    "name": "Fossil Reptiles",
    "fullname": "Evolution and Paleobiology of Fossil Reptiles",
    "info": "Reptiles first appear in the fossil record about 315 million years ago as small lizard-like carnivores and diversified greatly into a wide range of ecological roles during the Mesozoic. This radiation includes multiple invasions of the aquatic realm by groups as diverse as turtles, ichthyosaurs, plesiosaurs, and mosasaurs, and also encompasses two of the three groups of vertebrates to evolve active flight, namely birds and pterosaurs. Dinosaurs, most famous among the reptilian clades, dominated terrestrial ecosystems for over 100 million years and evolved large body sizes unsurpassed by any other terrestrial group. This course will cover the fossil record, evolution and paleobiology of reptiles (including birds) from the Carboniferous to the Present. Using both literature and demonstrations on skeletons/casts, students will learn the basics of reptilian anatomy and biology, and how those are used to infer evolutionary relationships and ecology of the diverse extinct reptilian clades listed above. Methods for inferring phylogenetic relationships, measuring biodiversity in the fossil record, and reconstructing the physiology and life history strategies of extinct reptiles will also be covered. The relationship between major geological events, such as changing climate and continental drift, and the origination, diversification, and extinction of reptilian groups through more than 300 million years of in Earth history will be explored. Prerequisites: ESci 1001 or ESci 1002 or Biol 1001 or Biol 1002 or Biol 1009 or instructor consent.",
    "prereq": {
      "or": [
        {
          "code": "ESCI 1001",
          "subject": "ESCI",
          "id": "1001"
        },
        {
          "code": "ESCI 1002",
          "subject": "ESCI",
          "id": "1002"
        },
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 1002",
          "subject": "BIOL",
          "id": "1002"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        }
      ]
    }
  },
  {
    "uid": "005390",
    "code": "ESCI4203",
    "subject": "ESCI",
    "number": "4203",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Geophysics",
    "fullname": "Environmental Geophysics",
    "info": "Seismic exploration (reflection and refraction); potential techniques (gravity and magnetics) and electrical techniques of geophysical exploration.prereq: Phys 1301",
    "prereq": {
      "code": "PHYS 1301",
      "subject": "PHYS",
      "id": "1301"
    }
  },
  {
    "uid": "005391",
    "code": "ESCI4204",
    "subject": "ESCI",
    "number": "4204",
    "honors": false,
    "writingIntensive": false,
    "name": "Geomag/Paleomag",
    "fullname": "Geomagnetism and Paleomagnetism",
    "info": "Present geomagnetic field at the Earth's surface, secular variation,  geomagnetic field reversals.  Physical and chemical basis of paleomagnetism: origin of natural remanent magnetization, mineralogy of magnetic minerals, magnetic polarity stratigraphy, apparent polar wander, and environmental magnetism.prereq: 2201, Phys 1302, Math 1272 or instr consent",
    "prereq": {
      "and": [
        {
          "code": "ESCI 2201",
          "subject": "ESCI",
          "id": "2201"
        },
        {
          "code": "PHYS 1302",
          "subject": "PHYS",
          "id": "1302"
        },
        {
          "code": "MATH 1272",
          "subject": "MATH",
          "id": "1272"
        }
      ]
    }
  },
  {
    "uid": "005384",
    "code": "ESCI4211",
    "subject": "ESCI",
    "number": "4211",
    "honors": false,
    "writingIntensive": false,
    "name": "Geophysics I",
    "fullname": "Solid Earth Geophysics I",
    "info": "Basic elasticity, basic seismology, and physical structure of the Earth's crust and deep interior.prereq: 2201, Phys 1302",
    "prereq": {
      "and": [
        {
          "code": "ESCI 2201",
          "subject": "ESCI",
          "id": "2201"
        },
        {
          "code": "PHYS 1302",
          "subject": "PHYS",
          "id": "1302"
        }
      ]
    }
  },
  {
    "uid": "005385",
    "code": "ESCI4212",
    "subject": "ESCI",
    "number": "4212",
    "honors": false,
    "writingIntensive": false,
    "name": "Geodynamics",
    "fullname": "Geodynamics",
    "info": "This course focuses on the dynamics of the solid Earth, particularly that of the lithosphere and the asthenosphere, probing further into the geodynamic problems that are introduced in ESCI 2201 through applications of continuum mechanics. Key continuum mechanics concepts to be examined include constitutive relations for different rheological classes (elastic, plastic, viscous, visco-elastic, visco-elasto-plastic), conservation laws (conservation of mass, momentum, and energy; continuity, force balance, and heat transfer), and simplifications and assumptions involved in their applications. Geodynamic problems to be discussed include plate cooling, lithospheric deformation, mantle convection, shear (viscous and frictional) heating, subduction, faulting, and their effects on the Earth’s thermochemical structures, geoid and topography, and the distributions of earthquakes and volcanism. Analytical solutions and numerical models of simple geodynamic problems are introduced, and recent applications of complex geodynamic models to explain geological, geophysical, and geochemical observations are discussed based on selected scientific journal articles. Graduate students are expected to present and lead paper discussions, and their performance will be graded and counted towards their participation. Instructor’s consent will be required if the following prerequisites are not met: ESCI 2201, MATH 1371 and 1372 (or equivalent), and PHYS 1301 and 1302 (or equivalent).",
    "prereq": {
      "and": [
        {
          "code": "ESCI 2201",
          "subject": "ESCI",
          "id": "2201"
        },
        {
          "code": "MATH 1371",
          "subject": "MATH",
          "id": "1371"
        },
        {
          "code": "ESCI 1372",
          "subject": "ESCI",
          "id": "1372"
        },
        {
          "code": "PHYS 1301",
          "subject": "PHYS",
          "id": "1301"
        },
        {
          "code": "ESCI 1302",
          "subject": "ESCI",
          "id": "1302"
        }
      ]
    }
  },
  {
    "uid": "005392",
    "code": "ESCI4301",
    "subject": "ESCI",
    "number": "4301",
    "honors": false,
    "writingIntensive": false,
    "name": "Ig/Met Petrology",
    "fullname": "Igneous and Metamorphic Petrology",
    "info": "Theoretical development of basic thermodynamic tools, chemographic analysis for interpreting chemical processes in igneous/metamorphic rocks. Problem sets.",
    "prereq": []
  },
  {
    "uid": "005407",
    "code": "ESCI4401",
    "subject": "ESCI",
    "number": "4401",
    "honors": false,
    "writingIntensive": false,
    "name": "Aqueous Environmental Geochem",
    "fullname": "Aqueous Environmental Geochemistry",
    "info": "General principles of solution chemistry applied to geology. Solution-mineral equilibria. Redox processes in natural waters. Geochemistry of hydrothermal fluids. Environmental geochemistry.",
    "prereq": []
  },
  {
    "uid": "798389",
    "code": "ESCI4402",
    "subject": "ESCI",
    "number": "4402",
    "honors": false,
    "writingIntensive": false,
    "name": "Ocean Biogeochemistry",
    "fullname": "Biogeochemical Cycles in the Ocean",
    "info": "Marine biogeochemistry and chemical oceanography. Processes controlling chemical composition of oceans past/present. Cycles of major/minor constituents, including carbon, nitrogen, phosphorus, silicon, and oxygen and their isotopes. Role of these cycles in climate system.prereq: [CHEM 1021, CHEM 1022] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CHEM 1021",
          "subject": "CHEM",
          "id": "1021"
        },
        {
          "code": "CHEM 1022",
          "subject": "CHEM",
          "id": "1022"
        }
      ]
    }
  },
  {
    "uid": "803866",
    "code": "ESCI4403",
    "subject": "ESCI",
    "number": "4403",
    "honors": false,
    "writingIntensive": false,
    "name": "Atmosphere, Oceans, & Climate",
    "fullname": "Atmosphere, Oceans, and the Climate System",
    "info": "Dynamics/biogeochemistry. Modern processes that determine transport of water, energy, and trace materials within/between atmosphere and oceans. Climate models, their sensitivity to natural/anthropogenic forcings.",
    "prereq": []
  },
  {
    "uid": "825705",
    "code": "ESCI4404",
    "subject": "ESCI",
    "number": "4404",
    "honors": false,
    "writingIntensive": false,
    "name": "Aqueous Geochemical Analysis",
    "fullname": "Analytical geochemistry for aqueous solutions and geological materials",
    "info": "Chemical analysis of natural samples is essential not only in geochemical research but nearly all other subfields of Earth and Environmental Science research today. Some analytical capability routine to geochemists, such as high precision isotope analysis, has also found potential applications in many other disciplines. Outside academia, chemical analysis is fundamental to many activities directly relevant to our everyday life, ranging from pollution monitoring to soil testing. With the explosion of analytical capability and increasing applications of geochemical analysis, there is greater need for students in Earth and Environmental Sciences to get familiarized with some common analytical instruments and to grasp some fundamental principles of analytical chemistry. This course will introduce several modern analytical equipment with a particular focus on plasma source mass spectrometers, as well as important techniques developed for precise and accurate analysis of geological and environmental samples. During this course, students will have access to some of the most advanced analytical equipment in geochemical research and gain hands-on experience during in-class lab practice. The lab practice is primarily designed to illustrate some key concepts covered in lectures, rather than a comprehensive training on instrument operation. At the end of this course, students are expected to be capable of critically evaluating geochemical data and master a set of analytical skills that can serve their future careers in research or other chemical analysis related professions. This course is designed to be accessible to students with limited prior analytical experiences. Prerequisites recommended to attend this course are PHYS 1301 (or equivalency) and CHEM 1061 (or equivalency).",
    "prereq": {
      "and": [
        {
          "code": "PHYS 1301",
          "subject": "PHYS",
          "id": "1301"
        },
        {
          "code": "CHEM 1061",
          "subject": "CHEM",
          "id": "1061"
        }
      ]
    }
  },
  {
    "uid": "003958",
    "code": "ESCI4501",
    "subject": "ESCI",
    "number": "4501",
    "honors": false,
    "writingIntensive": false,
    "name": "Structural Geology",
    "fullname": "Structural Geology",
    "info": "Fundamental concepts related to deformation of Earth's crust. Processes associated with deformation, faulting, folding, fabric development. Lab/recitation include solving problems, conducting physical/numerical experiments. Field trips.",
    "prereq": []
  },
  {
    "uid": "005395",
    "code": "ESCI4502",
    "subject": "ESCI",
    "number": "4502",
    "honors": false,
    "writingIntensive": false,
    "name": "Tectonic Styles",
    "fullname": "Tectonic Styles",
    "info": "Origin and nature of major types of tectonic disturbances affecting the crust and lithosphere, including analysis of the form and development of individual structural components and relationship to plate tectonics. Changes over geologic time in the nature of orogenic processes.prereq: 4501 or instr consent",
    "prereq": {
      "code": "ESCI 4501",
      "subject": "ESCI",
      "id": "4501"
    }
  },
  {
    "uid": "005409",
    "code": "ESCI4503",
    "subject": "ESCI",
    "number": "4503",
    "honors": false,
    "writingIntensive": false,
    "name": "Neotectonics",
    "fullname": "Neotectonics",
    "info": "Integration of diverse elements of geology, geodesy, and geophysics to examine recent and active tectonics of the Earth's lithosphere; extensional, compressional and wrench tectonic regimes with case studies around the world; modern global plate motions, geodetic techniques, seismic anisotropy, climatically driven tectonics.prereq: 4501 or instr consent",
    "prereq": {
      "code": "ESCI 4501",
      "subject": "ESCI",
      "id": "4501"
    }
  },
  {
    "uid": "003959",
    "code": "ESCI4602",
    "subject": "ESCI",
    "number": "4602",
    "honors": false,
    "writingIntensive": false,
    "name": "Sediment/Stratigrph",
    "fullname": "Sedimentology and Stratigraphy",
    "info": "Interpretation of origin of sedimentary rocks through application of basic physical/chemical principles. Modern depositional environments, petrographic microscopy, basin dynamics, stratigraphy.prereq: ESci 2301 or instr consent",
    "prereq": {
      "code": "ESCI 2301",
      "subject": "ESCI",
      "id": "2301"
    }
  },
  {
    "uid": "003960",
    "code": "ESCI4631W",
    "subject": "ESCI",
    "number": "4631",
    "honors": false,
    "writingIntensive": true,
    "name": "Earth Systems",
    "fullname": "Earth Systems: Geosphere/Biosphere Interactions",
    "info": "Interdisciplinary study of global-change forcing mechanisms, feedbacks, dynamics on various time scales, using paleorecord to illustrate processes.",
    "prereq": []
  },
  {
    "uid": "005397",
    "code": "ESCI4701",
    "subject": "ESCI",
    "number": "4701",
    "honors": false,
    "writingIntensive": false,
    "name": "Geomorphology",
    "fullname": "Geomorphology",
    "info": "Origin, development, and continuing evolution of landforms in various environments. Environmental implications. Weathering, slope and shore processes, fluvial erosion and deposition, arid region processes, glacial processes. This course includes lecture and laboratory components, including field trips. Prereqs: MATH 1271 (Calculus I) or equivalent; PHYS 1301 (Physics I: Classical Mechanics) or equivalent. Instructor consent is required to take this course without the prerequisite courses or their equivalents, and it is recommended to take these classes at least concurrently (as co-requisites) with geomorphology. No help will be given on material covered in prerequisite courses.",
    "prereq": {
      "or": [
        {
          "code": "MATH 1271",
          "subject": "MATH",
          "id": "1271"
        },
        {
          "code": "PHYS 1301",
          "subject": "PHYS",
          "id": "1301"
        }
      ]
    }
  },
  {
    "uid": "801594",
    "code": "ESCI4702",
    "subject": "ESCI",
    "number": "4702",
    "honors": false,
    "writingIntensive": false,
    "name": "General Hydrogeology",
    "fullname": "General Hydrogeology",
    "info": "Theory of groundwater geology, hydrologic cycle, watershed hydrology, Darcy's law, governing equations of groundwater motion, flow net analysis, analog models, groundwater resource evaluation/development. Applied analysis of steady and transient equations of groundwater motion and chemical transport. Chemistry of natural waters.prereq: [concurrent registration is required (or allowed) in CHEM 1062, concurrent registration is required (or allowed) in CHEM 1066, MATH 1271, PHYS 1201] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CHEM 1062",
          "subject": "CHEM",
          "id": "1062"
        },
        {
          "code": "CHEM 1066",
          "subject": "CHEM",
          "id": "1066"
        },
        {
          "code": "MATH 1271",
          "subject": "MATH",
          "id": "1271"
        },
        {
          "code": "PHYS 1201",
          "subject": "PHYS",
          "id": "1201"
        }
      ]
    }
  },
  {
    "uid": "005399",
    "code": "ESCI4703",
    "subject": "ESCI",
    "number": "4703",
    "honors": false,
    "writingIntensive": false,
    "name": "Glacial Geology",
    "fullname": "Glacial Geology",
    "info": "Formation and characteristics of modern glaciers; erosional and depositional features of Pleistocene glaciers; history of quaternary environmental changes in glaciated and non-glaciated areas. Field trips and labs.prereq: 1001 or instr consent",
    "prereq": {
      "code": "ESCI 1001",
      "subject": "ESCI",
      "id": "1001"
    }
  },
  {
    "uid": "803867",
    "code": "ESCI4801",
    "subject": "ESCI",
    "number": "4801",
    "honors": false,
    "writingIntensive": false,
    "name": "Geomicrobiology",
    "fullname": "Geomicrobiology",
    "info": "Geosphere/biosphere interactions over temporal/spatial scales. Global biogeochemical cycling, microbe-metal interactions, microbial paleobiology, environmental geomicrobiology, life detection, habitability of planets.",
    "prereq": []
  },
  {
    "uid": "005400",
    "code": "ESCI4911",
    "subject": "ESCI",
    "number": "4911",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Field Geology",
    "fullname": "Advanced Field Geology",
    "info": "Geologic mapping; study of igneous, metamorphic, and sedimentary rocks; structures and surficial features; problem solving.  Paper required.prereq: 3911, instr consent",
    "prereq": {
      "code": "ESCI 3911",
      "subject": "ESCI",
      "id": "3911"
    }
  },
  {
    "uid": "005402",
    "code": "ESCI4971W",
    "subject": "ESCI",
    "number": "4971",
    "honors": false,
    "writingIntensive": true,
    "name": "Field Hydrogeology",
    "fullname": "Field Hydrogeology",
    "info": "Aquifer, vadoze zone, and surface water hydrology field techniques. Shallow soil boring, sampling. Well installation. Single/multiple well aquifer testing. Ground water sampling for chemical analysis. Weather data collection, hydrogeologic mapping, water balance calculation.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "011200",
    "code": "ESCI5001",
    "subject": "ESCI",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth Systems/Edu",
    "fullname": "Earth Systems Science for Teachers",
    "info": "Solid Earth, hydrosphere, atmosphere, biosphere, their interconnections in natural cycles of material/energy. Consequences of natural cycles for land-water-atmosphere-life environments/Earth's habitability. Human impact on natural cycles. Evidence for global environmental changes. Required project.",
    "prereq": []
  },
  {
    "uid": "810850",
    "code": "ESCI5093",
    "subject": "ESCI",
    "number": "5093",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies Earth Science",
    "fullname": "Directed Studies in Earth Sciences",
    "info": "Independent, directed study in earth sciences arranged by  student/faculty member.",
    "prereq": []
  },
  {
    "uid": "799822",
    "code": "ESCI5102",
    "subject": "ESCI",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate and History",
    "fullname": "Climate Change and Human History",
    "info": "Causes of long-/short-term climate change. Frequency/magnitude of past climate changes, their geologic records. Relationship of past climate changes to development of agrarian societies and to shifts in power among kingdoms/city-states. Emphasizes last 10,000 years.prereq: 1001 or equiv or instr consent",
    "prereq": {
      "code": "ESCI 1001",
      "subject": "ESCI",
      "id": "1001"
    }
  },
  {
    "uid": "826599",
    "code": "ESCI5105",
    "subject": "ESCI",
    "number": "5105",
    "honors": false,
    "writingIntensive": false,
    "name": "21st Century Env Justice",
    "fullname": "Environmental Justice in the 21st Century",
    "info": "This course explores the concept of Environmental Justice as both a topic that is rooted in scientific study and as a social movement in the United States.  Following an introduction to the development of environmental justice as a concept in the US since reconstruction following the Civil War, we will consider specific case studies during the 20th and 21st centuries including petroleum extraction and hydrofracturing, food deserts and insecurity, native American environmental justice, and climate justice.  Further, we will explore the similarities and differences in how Environmental Justice is addressed in the US as compared to other countries globally.",
    "prereq": []
  },
  {
    "uid": "007598",
    "code": "ESCI5108",
    "subject": "ESCI",
    "number": "5108",
    "honors": false,
    "writingIntensive": false,
    "name": "Envir Geology",
    "fullname": "Principles of Environmental Geology",
    "info": "Human impact on geological environment and effect of geology/geologic processes on human life from an ecosystems and biogeochemical cycles perspective.  Geologic limits to resources and carrying capacity of Earth. Land use planning, environmental impact assessment, ecogeologic world models.  Field project and trip.",
    "prereq": []
  },
  {
    "uid": "005403",
    "code": "ESCI5201",
    "subject": "ESCI",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Geo Time Series",
    "fullname": "Time-Series Analysis of Geological Phenomena",
    "info": "Time-series analysis of linear and nonlinear geological and geophysical phenomena. Examples drawn from ice age cycles, earthquakes, climatic fluctuations, volcanic eruptions, atmospheric phenomena, thermal convection and other time-dependent natural phenomena. Modern concepts of nonlinear dynamics and complexity theory applied to geological phenomena.prereq: Math 2263 or instr consent",
    "prereq": {
      "code": "MATH 2263",
      "subject": "MATH",
      "id": "2263"
    }
  },
  {
    "uid": "005406",
    "code": "ESCI5203",
    "subject": "ESCI",
    "number": "5203",
    "honors": false,
    "writingIntensive": false,
    "name": "Min / Rock Physics",
    "fullname": "Mineral and Rock Physics",
    "info": "Physical properties of minerals and rocks as related to the composition and dynamics of the Earth's crust, mantle, and core.prereq: 2201, Phys 1302",
    "prereq": {
      "and": [
        {
          "code": "ESCI 2201",
          "subject": "ESCI",
          "id": "2201"
        },
        {
          "code": "PHYS 1302",
          "subject": "PHYS",
          "id": "1302"
        }
      ]
    }
  },
  {
    "uid": "797400",
    "code": "ESCI5204",
    "subject": "ESCI",
    "number": "5204",
    "honors": false,
    "writingIntensive": false,
    "name": "Geostatistics / Inverse Theory",
    "fullname": "Geostatistics and Inverse Theory",
    "info": "Statistical treatment of geological and geophysical data. Statistical estimation. Stochastic processes/fields. Non-linear/non-assumptive error analysis. Cluster analysis. Eigenvalue-eigenvector methods. Regional variables. Correlograms and kriging. Theoretical framework of linear geostatistics and geophysical inverse theory.prereq: Stat 3011 or instr consent",
    "prereq": {
      "code": "STAT 3011",
      "subject": "STAT",
      "id": "3011"
    }
  },
  {
    "uid": "800520",
    "code": "ESCI5205",
    "subject": "ESCI",
    "number": "5205",
    "honors": false,
    "writingIntensive": false,
    "name": "Fluid Mechanics in Earth Sci",
    "fullname": "Fluid Mechanics in Earth and Environmental Sciences",
    "info": "Flow equations in conservation of mass, energy, momentum. Fluid flow in oceans, lakes, rivers, atmosphere. Flow of Earth's mantle/outer core. Wave propagation. Porous medium flow in soils/fractures. Diffusive, advective, dispersive transfer of heat. Microbes with subsurface fluids.prereq: MATH 2263 or instr consent",
    "prereq": {
      "code": "MATH 2263",
      "subject": "MATH",
      "id": "2263"
    }
  },
  {
    "uid": "005408",
    "code": "ESCI5302",
    "subject": "ESCI",
    "number": "5302",
    "honors": false,
    "writingIntensive": false,
    "name": "Isotope Geology",
    "fullname": "Isotope Geology",
    "info": "Theory and uses of radioactive, radiogenic, and stable isotopes in geology. Radioactive dating, geothermometry, and tracer techniques in geologic processes.prereq: 3303W or instr consent",
    "prereq": {
      "code": "ESCI 3303",
      "subject": "ESCI",
      "id": "3303"
    }
  },
  {
    "uid": "825691",
    "code": "ESCI5331",
    "subject": "ESCI",
    "number": "5331",
    "honors": false,
    "writingIntensive": false,
    "name": "Hydrologic Modeling",
    "fullname": "Hydrologic Modeling",
    "info": "Models are indispensable tools in hydrology that come in many shapes, forms, and sizes. The hydrological knowledge and computational skills needed for each can thus greatly vary. Students will be introduced to different hydrologic modeling approaches through hands-on examples (running simulations) and through “looking under the hood” (exposure to numerical methods and coding techniques). The goal is not to become an expert in every type of hydrological model, but it is to gain familiarity with the range of models in the hydrologic toolkit and how they work; be equipped to choose, implement, and interpret models effectively; and know how to critically assess model assumptions, sensitivities, and limitations. Students will learn common techniques for generating and calibrating model inputs, compiling and/or executing models, and plotting results. Prerequisites: Introductory level hydrology / hydrogeology, Calculus, Some previous exposure to Matlab or Python (or another programming language). Students without these prerequisites may contact the instructor to seek consent to register.",
    "prereq": []
  },
  {
    "uid": "825679",
    "code": "ESCI5341",
    "subject": "ESCI",
    "number": "5341",
    "honors": false,
    "writingIntensive": false,
    "name": "Numerical Geodynamic Modeling",
    "fullname": "Numerical Geodynamic Modeling",
    "info": "The objective of this course is for students to gain a basic understanding of numerical geodynamic modeling. The course consists of a lecture component and in-class modeling exercise component. The lecture component will cover general concepts of continuum mechanics/fluid dynamics, classical geodynamic problems, such as heat transfer and mantle flow, and numerical approaches to solving these problems using the finite difference and finite element methods. Through the in-class modeling exercises and homework assignments, students will learn to write numerical codes to solve simple problems, such as 2-D heat conduction and Stokes flow.prereq: Instructor’s consent is required if the following prerequisites are not met: Introductory/first-year Calculus (MATH 1371 and 1372 or equivalent), Linear Algebra and Differential Equations (MATH 2373 or equivalent), Multivariable Calculus and Vector Analysis (MATH 2374 or equivalent), and Introductory/first-year physics (PHYS 1301 and 1302 or equivalent).",
    "prereq": {
      "and": [
        {
          "and": [
            {
              "code": "MATH 1371",
              "subject": "MATH",
              "id": "1371"
            },
            {
              "code": "ESCI 1372",
              "subject": "ESCI",
              "id": "1372"
            }
          ]
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        },
        {
          "code": "MATH 2374",
          "subject": "MATH",
          "id": "2374"
        },
        {
          "and": [
            {
              "code": "PHYS 1301",
              "subject": "PHYS",
              "id": "1301"
            },
            {
              "code": "ESCI 1302",
              "subject": "ESCI",
              "id": "1302"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "800152",
    "code": "ESCI5351",
    "subject": "ESCI",
    "number": "5351",
    "honors": false,
    "writingIntensive": false,
    "name": "Geochem Modeling",
    "fullname": "Geochemical Modeling of Aqueous Systems",
    "info": "Using mass transfer reaction path models to assess chemical evolution of natural fluids, hydrothermal alteration processes, and formation of hydrothermal ore deposits.prereq: 4401",
    "prereq": {
      "code": "ESCI 4401",
      "subject": "ESCI",
      "id": "4401"
    }
  },
  {
    "uid": "011212",
    "code": "ESCI5353",
    "subject": "ESCI",
    "number": "5353",
    "honors": false,
    "writingIntensive": false,
    "name": "Electron Microprobe",
    "fullname": "Electron Microprobe Theory and Practice",
    "info": "Characterizing solid materials with electron beam instrumentation, including reduction of X-ray data to chemical compositions.prereq: [One yr chem, one yr physics] or instr consent",
    "prereq": []
  },
  {
    "uid": "804478",
    "code": "ESCI5402",
    "subject": "ESCI",
    "number": "5402",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci & Politics Global Warming",
    "fullname": "Science and Politics of Global Warming",
    "info": "Detection/attribution of global warming using radiation, climate system, and carbon cycle. Effects on society/biodiversity. National/global efforts. Controversy over responses/consequences.",
    "prereq": []
  },
  {
    "uid": "819766",
    "code": "ESCI5403",
    "subject": "ESCI",
    "number": "5403",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Applications,EarthSci",
    "fullname": "Computer Applications in Earth & Environmental Sciences",
    "info": "This class is meant to provide students with skills in scientific computer programming, with a special focus on the Earth & environmental sciences and other disciplines where spatial data are important. The course assumes no previous knowledge of computer programming. Although the class will use MATLAB, topics covered in the course include concepts common to all programming languages including functions, logic, branching, loops, data types, binary code, data formatting for input/output, among others. Additionally, students will develop problem-solving skills in learning how to design algorithms to achieve a task and in learning how to troubleshoot and debug their code. Students taking the class at the 5xxx level will be required to complete a programming project related to their own research. This course will be different from other introductory-level programming courses in that it will have a spatial emphasis and focus on examples and datasets related to the Earth and environmental sciences. Students will learn how to access a variety of Earth and environmental science data repositories and work with data in standard formats (i.e. NetCDF). Working with geographically referenced data in different projections will be explored using different toolboxes available for that purpose. Plotting of data will also be extensively covered including the production of publication-quality figures and animations.  ",
    "prereq": []
  },
  {
    "uid": "811003",
    "code": "ESCI5412",
    "subject": "ESCI",
    "number": "5412",
    "honors": false,
    "writingIntensive": false,
    "name": "Ocean Biogeochemistry",
    "fullname": "Biogeochemical Cycles in the Ocean",
    "info": "Marine biogeochemistry/chemical oceanography. Processes controlling chemical composition of oceans past/present.  Cycles of major/minor constituents, including carbon, nitrogen, phosphorus, silicon, oxygen/their isotopes. Role of cycles in climate system.",
    "prereq": []
  },
  {
    "uid": "005410",
    "code": "ESCI5502",
    "subject": "ESCI",
    "number": "5502",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Struct Geol",
    "fullname": "Advanced Structural Geology",
    "info": "Analysis of structures and fabric of deformed rocks. Determination of states of stress and strain in rocks and of evolution of these with time. Deformation mechanisms.  Extensive reading in journal literature. Field trips.prereq: 4501 or instr consent",
    "prereq": {
      "code": "ESCI 4501",
      "subject": "ESCI",
      "id": "4501"
    }
  },
  {
    "uid": "803163",
    "code": "ESCI5503",
    "subject": "ESCI",
    "number": "5503",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Petrology",
    "fullname": "Advanced Petrology",
    "info": "Quantitative approach to modern igneous/metamorphic petrology. Emphasizes thermodynamics of minerals/melts and with applications to phase diagrams, thermobarometry, melting relationships, and energetics of petrologic mass transfer.prereq: 2302, CHEM 1061, CHEM 1065, [MATH 1372 or MATH 1272 or MATH 1572]",
    "prereq": {
      "and": [
        {
          "code": "ESCI 2302",
          "subject": "ESCI",
          "id": "2302"
        },
        {
          "code": "CHEM 1061",
          "subject": "CHEM",
          "id": "1061"
        },
        {
          "code": "CHEM 1065",
          "subject": "CHEM",
          "id": "1065"
        },
        {
          "or": [
            {
              "code": "MATH 1372",
              "subject": "MATH",
              "id": "1372"
            },
            {
              "code": "MATH 1272",
              "subject": "MATH",
              "id": "1272"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "826671",
    "code": "ESCI5504",
    "subject": "ESCI",
    "number": "5504",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Geobiology",
    "fullname": "Advanced Geobiology and Astrobiology",
    "info": "This course examines interactions between the biosphere and geosphere with the goal of understanding their role in shaping evolution and environment. Topics include geosphere/biosphere interactions over various temporal/spatial scales, global biogeochemical cycling, microbe-metal interactions, microbial paleobiology, environmental geomicrobiology, and astrobiology. prereq: At least one semester of college-level biology is required, and one semester of microbiology is preferred.",
    "prereq": []
  },
  {
    "uid": "811625",
    "code": "ESCI5504W",
    "subject": "ESCI",
    "number": "5504",
    "honors": false,
    "writingIntensive": true,
    "name": "Neotectonics",
    "fullname": "Neotectonics",
    "info": "Integration of multidisciplinary elements of geology, geodesy, geodynamics, seismotectonics, tectonophysics to examine recent/active tectonics of Earth's lithosphere. Extensional, compressional, wrench-tectonic regimes with global case studies incorporating mantle to surface processes.prereq: [2201, 4501] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "ESCI 2201",
          "subject": "ESCI",
          "id": "2201"
        },
        {
          "code": "ESCI 4501",
          "subject": "ESCI",
          "id": "4501"
        }
      ]
    }
  },
  {
    "uid": "005411",
    "code": "ESCI5601",
    "subject": "ESCI",
    "number": "5601",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Sedimentology",
    "fullname": "Advanced Sedimentology",
    "info": "Modern techniques of sedimentary basin analysis focusing on interactions among the lithosphere, atmosphere, and hydrosphere.  Sedimentary facies of modern and ancient systems, petrology of clastic and carbonate deposits, tectonic and paleoclimatic interpretations, paleocurrent analysis, diagenetic effects on subsurface fluid flow, and volcanic sedimentation. ",
    "prereq": []
  },
  {
    "uid": "810795",
    "code": "ESCI5601W",
    "subject": "ESCI",
    "number": "5601",
    "honors": false,
    "writingIntensive": true,
    "name": "Adv Sedimentology",
    "fullname": "Advanced Sedimentology",
    "info": "Principles/processes of sedimentary geology. Interactions among lithosphere, biosphere, atmosphere, hydrosphere. Detrital/carbonate facies of modern/ancient systems, coastal processes, geobiology, tectonics, paleoclimate, stuctural diagenesis, paleosols, volcanic sedimentation.prereq: 4602 or instr consent",
    "prereq": {
      "code": "ESCI 4602",
      "subject": "ESCI",
      "id": "4602"
    }
  },
  {
    "uid": "005412",
    "code": "ESCI5602",
    "subject": "ESCI",
    "number": "5602",
    "honors": false,
    "writingIntensive": false,
    "name": "Depositional Mech",
    "fullname": "Depositional Mechanics",
    "info": "Elementary mechanics of sediment transport applied to quantitative interpretation of sedimentary rocks.",
    "prereq": []
  },
  {
    "uid": "005413",
    "code": "ESCI5701",
    "subject": "ESCI",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Hydrogeology",
    "fullname": "General Hydrogeology",
    "info": "Theory of groundwater geology, hydrologic cycle, watershed hydrology, Darcy's law, governing equations of groundwater motion, flow net analysis, analog models, and groundwater resource evaluation and development.  Applied analysis of steady and transient equations of groundwater motion and chemical transport. Chemistry of natural waters.",
    "prereq": []
  },
  {
    "uid": "005414",
    "code": "ESCI5702",
    "subject": "ESCI",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "Aquifer Systems",
    "fullname": "Regional Aquifer Systems of North America",
    "info": "Geologic controls on flow patterns within aquifer systems.  Case histories and specific examples from glaciated terrains and Paleozoic basins in Minnesota.  Analysis of basin-scale regional aquifer systems of North America.  Survey of famous aquifer systems of the world.",
    "prereq": []
  },
  {
    "uid": "005398",
    "code": "ESCI5705",
    "subject": "ESCI",
    "number": "5705",
    "honors": false,
    "writingIntensive": false,
    "name": "Limnogeology",
    "fullname": "Limnogeology and Paleoenvironment",
    "info": "Within-lake, hydrogeologic, and landscape (geological/biological) processes that lead to formation of various proxy records of paleoenvironment. Systems approach to physical, geochemical, biogeochemical, and biotic proxies. Basic principles, case studies. Emphasizes how proxy records relate to paleoclimate.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "007558",
    "code": "ESCI5713",
    "subject": "ESCI",
    "number": "5713",
    "honors": false,
    "writingIntensive": false,
    "name": "Karst Hydrogeology",
    "fullname": "Tracers and Karst Hydrogeology",
    "info": "Karst hydrogeology and application of tracers to determine source, age, and mixing parameters of water in various natural reservoirs. Physical and chemical principles and processes operating in karst hydrogeology; use of natural and synthetic chemical and isotopic labels or tracers to follow movement and mixing of water through hydrologic cycle.prereq: 5701, instr consent",
    "prereq": {
      "code": "ESCI 5701",
      "subject": "ESCI",
      "id": "5701"
    }
  },
  {
    "uid": "011215",
    "code": "ESCI5802",
    "subject": "ESCI",
    "number": "5802",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci Visualization",
    "fullname": "Scientific Visualization",
    "info": "Visualization hardware and software, three-dimensional graphics, representation of scientific data, modeling, user interface techniques, output, commonly used algorithms, animation, case studies and examples.",
    "prereq": []
  },
  {
    "uid": "817745",
    "code": "ESCI5805",
    "subject": "ESCI",
    "number": "5805",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Geosci Standards",
    "fullname": "Standards and Practices for Professional Geoscienists",
    "info": "This course is meant to provide students with a clear understanding of the standards and practices regularly used by Geoscience professionals in industry and agency. The course builds on the foundational knowledge offered through the core curriculum of the Earth Sciences undergraduate major, and fills a critical gap in showing how this knowledge is translated into common standards and practices, regulations, funding mechanisms, and even professional expectations within a variety of geoscience disciplines. In short, this course aims to smooth a student?s transition from University to an entry-level position from which they can build a successful and sustainable career. This course is targeted for both upper level undergraduates and graduate students. Aspects of the course include:-Detailed discussion of regional stratigraphy, bedrock and glacial geology and how they relate to various industrial applications and environmental issues.-Examination of state and federal environmental regulations, as well as the phases of environmental impact statements.-Survey of fundamental investigation techniques (GeoProbe drilling, hollow-stem auger drilling, well installation, analytical testing ? soil, groundwater, air).-Introduction to environmental clean-up grants and their management.-Assessment of topics covered in the National Association of State Boards of Geology (ASBOG) Fundamentals of Geology (FG) exam. This exam is a required step on the way to becoming a registered geologist. The exam is offered in mid-March, and the expectation is that students participating in the class will take it. -Coordination and completion of the 40 hour HAZWOPER training through UMN.-Invited lectures from select representatives of various subfields and professional organizations (groundwater & contaminant hydrogeology, mining & geophysical exploration, environmental engineering, petroleum) to give students a jumpstart in their professional networking.",
    "prereq": []
  },
  {
    "uid": "800758",
    "code": "ESCI5971",
    "subject": "ESCI",
    "number": "5971",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Hydrogeology",
    "fullname": "Field Hydrogeology",
    "info": "Aquifer, vadoze zone, and surface water hydrology field techniques. Shallow soil boring and sampling. Well installation. Single/multiple well aquifer testing. Ground water sampling for chemical analysis. Weather data collection, hydrogeologic mapping, water balance calculation.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "806435",
    "code": "ESCI5980",
    "subject": "ESCI",
    "number": "5980",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Current Topics",
    "fullname": "Seminar: Current Topics in Earth Sciences",
    "info": "Topics in earth sciences investigated in a seminar format.",
    "prereq": []
  },
  {
    "uid": "807220",
    "code": "ESCI8001",
    "subject": "ESCI",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Introductory Graduate Seminar",
    "fullname": "Introductory Graduate Seminar",
    "info": "Graduate level survey of important research, concepts, and methods in the earth sciences; familiarization with program faculty/facilities and basics of science writing and proposal craft.prereq: Grad student status in earth sci",
    "prereq": []
  },
  {
    "uid": "812231",
    "code": "ESCI8203",
    "subject": "ESCI",
    "number": "8203",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Geophysics",
    "fullname": "Environmental Geophysics",
    "info": "Seismic exploration (reflection/refraction). Potential techniques (gravity/magnetics), electrical techniques of geophysical exploration.prereq: Phys 1301 or equivalent",
    "prereq": {
      "code": "PHYS 1301",
      "subject": "PHYS",
      "id": "1301"
    }
  },
  {
    "uid": "812232",
    "code": "ESCI8204",
    "subject": "ESCI",
    "number": "8204",
    "honors": false,
    "writingIntensive": false,
    "name": "Geomagnetism & Paleomagnetism",
    "fullname": "Geomagnetism and Paleomagnetism",
    "info": "Present geomagnetic field at Earth's surface, secular variation, geomagnetic field reversals. Physical/chemical basis of paleomagnetism. Origin of natural remanent magnetization, mineralogy of magnetic minerals, magnetic polarity stratigraphy, apparent polar wander, environmental magnetism.prereq: 2201, Phys 1302, [Math 1272 or instr consent]",
    "prereq": {
      "and": [
        {
          "code": "ESCI 2201",
          "subject": "ESCI",
          "id": "2201"
        },
        {
          "code": "PHYS 1302",
          "subject": "PHYS",
          "id": "1302"
        },
        {
          "code": "MATH 1272",
          "subject": "MATH",
          "id": "1272"
        }
      ]
    }
  },
  {
    "uid": "820500",
    "code": "ESCI8212",
    "subject": "ESCI",
    "number": "8212",
    "honors": false,
    "writingIntensive": false,
    "name": "Geodynamics",
    "fullname": "Geodynamics",
    "info": "This course focuses on the dynamics of the solid Earth, particularly that of the lithosphere and the asthenosphere, probing further into the geodynamic problems that are introduced in ESCI 2201 through applications of continuum mechanics. Key continuum mechanics concepts to be examined include constitutive relations for different rheological classes (elastic, plastic, viscous, viscoelastic, viscoelastoplastic), conservation laws (conservation of mass, momentum, and energy; continuity, force balance, and heat transfer), and simplifications and assumptions involved in their applications. Geodynamic problems to be discussed include plate cooling, lithospheric deformation, mantle convection, shear (viscous and frictional) heating, subduction, faulting, and their effects on the Earth’s thermochemical structures, geoid and topography, and the distributions of earthquakes and volcanism. Analytical solutions and numerical models of simple geodynamic problems are introduced, and recent applications of complex geodynamic models to explain geological, geophysical, and geochemical observations are discussed based on selected scientific journal articles.",
    "prereq": []
  },
  {
    "uid": "010540",
    "code": "ESCI8243",
    "subject": "ESCI",
    "number": "8243",
    "honors": false,
    "writingIntensive": false,
    "name": "Rock Magnetism",
    "fullname": "Principles of Rock Magnetism",
    "info": "Remanent magnetizations, their classification and origins.  Fundamentals of fine particle magnetism; magnetic minerals; separation of multicomponent magnetizations; effects of chemical change on magnetization; magnetic proxies of climatic and environmental change; biomagnetism.prereq: 4204 or instr consent",
    "prereq": {
      "code": "ESCI 4204",
      "subject": "ESCI",
      "id": "4204"
    }
  },
  {
    "uid": "788117",
    "code": "ESCI8333",
    "subject": "ESCI",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "010059",
    "code": "ESCI8353",
    "subject": "ESCI",
    "number": "8353",
    "honors": false,
    "writingIntensive": false,
    "name": "Phase Equilibrium",
    "fullname": "Phase Equilibrium in Mineral Systems",
    "info": "Principles of homogeneous and heterogeneous equilibria and their application to problems in petrology.  Emphasis on derivations from first principles and formulation of algebraic and graphical methods essential to multicomponent systems.prereq: 4301, Chem 3501, Math 2243",
    "prereq": {
      "and": [
        {
          "code": "ESCI 4301",
          "subject": "ESCI",
          "id": "4301"
        },
        {
          "code": "CHEM 3501",
          "subject": "CHEM",
          "id": "3501"
        },
        {
          "code": "MATH 2243",
          "subject": "MATH",
          "id": "2243"
        }
      ]
    }
  },
  {
    "uid": "010061",
    "code": "ESCI8354",
    "subject": "ESCI",
    "number": "8354",
    "honors": false,
    "writingIntensive": false,
    "name": "Igneous Petrology",
    "fullname": "Igneous Petrology",
    "info": "Igneous rocks and processes, emphasizing geochemistry of melts and minerals. Content varies with instructor and student interest.prereq: 4301 or instr consent",
    "prereq": {
      "code": "ESCI 4301",
      "subject": "ESCI",
      "id": "4301"
    }
  },
  {
    "uid": "010063",
    "code": "ESCI8355",
    "subject": "ESCI",
    "number": "8355",
    "honors": false,
    "writingIntensive": false,
    "name": "Metamorph Pet",
    "fullname": "Metamorphic Petrology",
    "info": "Metamorphic processes; relation of theory and observation to current problems. Relation of fundamental concepts and techniques to progressive development of mineral assemblages. Term paper required.prereq: 8353",
    "prereq": {
      "code": "ESCI 8353",
      "subject": "ESCI",
      "id": "8353"
    }
  },
  {
    "uid": "812233",
    "code": "ESCI8401",
    "subject": "ESCI",
    "number": "8401",
    "honors": false,
    "writingIntensive": false,
    "name": "Aqueous Geochemistry",
    "fullname": "Aqueous Environmental Geochemistry",
    "info": "General principles of solution chemistry applied to geology. Solution-mineral equilibria. Redox processes in natural waters. Geochemistry of hydrothermal fluids. Environmental geochemistry.",
    "prereq": []
  },
  {
    "uid": "811248",
    "code": "ESCI8402",
    "subject": "ESCI",
    "number": "8402",
    "honors": false,
    "writingIntensive": false,
    "name": "Ocean Biogeochemistry",
    "fullname": "Biogeochemical Cycles in the Ocean",
    "info": "Marine biogeochemistry/chemical oceanography. Processes controlling chemical composition of oceans past/present. Cycles of major/minor constituents, including carbon, nitrogen, phosphorus, silicon, oxygen/their isotopes. Role of cycles in climate system.prereq: [Chem 1021, Chem 1022] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CHEM 1021",
          "subject": "CHEM",
          "id": "1021"
        },
        {
          "code": "CHEM 1022",
          "subject": "CHEM",
          "id": "1022"
        }
      ]
    }
  },
  {
    "uid": "825706",
    "code": "ESCI8404",
    "subject": "ESCI",
    "number": "8404",
    "honors": false,
    "writingIntensive": false,
    "name": "Aqueous Geochem analysis",
    "fullname": "Analytical geochemistry for aqueous solutions and geological materials",
    "info": "Chemical analysis of natural samples is essential not only in geochemical research but nearly all other subfields of Earth and Environmental Science research today. Some analytical capability routine to geochemists, such as high precision isotope analysis, has also found potential applications in many other disciplines. Outside academia, chemical analysis is fundamental to many activities directly relevant to our everyday life, ranging from pollution monitoring to soil testing. With the explosion of analytical capability and increasing applications of geochemical analysis, there is greater need for students in Earth and Environmental Sciences to get familiarized with some common analytical instruments and to grasp some fundamental principles of analytical chemistry. This course will introduce several modern analytical equipment with a particular focus on plasma source mass spectrometers, as well as important techniques developed for precise and accurate analysis of geological and environmental samples. During this course, students will have access to some of the most advanced analytical equipment in geochemical research and gain hands-on experience during in-class lab practice. The lab practice is primarily designed to illustrate some key concepts covered in lectures, rather than a comprehensive training on instrument operation. At the end of this course, students are expected to be capable of critically evaluating geochemical data and master a set of analytical skills that can serve their future careers in research or other chemical analysis related professions. This course is designed to be accessible to students with limited prior analytical experiences. Prerequisites recommended to attend this course are PHYS 1301 (or equivalency) and CHEM 1061 (or equivalency).",
    "prereq": {
      "and": [
        {
          "code": "PHYS 1301",
          "subject": "PHYS",
          "id": "1301"
        },
        {
          "code": "CHEM 1061",
          "subject": "CHEM",
          "id": "1061"
        }
      ]
    }
  },
  {
    "uid": "788353",
    "code": "ESCI8444",
    "subject": "ESCI",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(no description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "812234",
    "code": "ESCI8501",
    "subject": "ESCI",
    "number": "8501",
    "honors": false,
    "writingIntensive": false,
    "name": "Structural Geology",
    "fullname": "Structural Geology",
    "info": "Fundamental concepts related to deformation of Earth's crust. Processes associated with deformation, faulting, folding, fabric development. Lab/recitation include solving problems, conducting physical/numerical experiments. Term Paper. Field trips.prereq: 2301 or instr consent",
    "prereq": {
      "code": "ESCI 2301",
      "subject": "ESCI",
      "id": "2301"
    }
  },
  {
    "uid": "812235",
    "code": "ESCI8502",
    "subject": "ESCI",
    "number": "8502",
    "honors": false,
    "writingIntensive": false,
    "name": "Tectonic Styles",
    "fullname": "Tectonic Styles",
    "info": "Origin/nature of major types of tectonic disturbances affecting crust/lithosphere, including analysis of form/development of individual structural components/relationship to plate tectonics. Changes over geologic time in nature of orogenic processes.prereq: 4501 or 8501 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "ESCI 4501",
          "subject": "ESCI",
          "id": "4501"
        },
        {
          "code": "ESCI 8501",
          "subject": "ESCI",
          "id": "8501"
        }
      ]
    }
  },
  {
    "uid": "800701",
    "code": "ESCI8511",
    "subject": "ESCI",
    "number": "8511",
    "honors": false,
    "writingIntensive": false,
    "name": "Sed Trans",
    "fullname": "Mechanics of Sediment Transport",
    "info": "Particle motion in fluids. Criteria for incipient motion.  Formulations for bedload and suspended load. Bedform mechanics, hydraulic resistance relations. Channel stability, aggradation/degradation, alluvial stream morphology.",
    "prereq": []
  },
  {
    "uid": "800150",
    "code": "ESCI8601",
    "subject": "ESCI",
    "number": "8601",
    "honors": false,
    "writingIntensive": false,
    "name": "Stream Restoration",
    "fullname": "Introduction to Stream Restoration",
    "info": "Background material essential for participating in a stream restoration project. How to assimilate geologic, hydrologic, and ecological data at the watershed and reach scales to plan a restoration project and evaluate/critique existing stream restoration projects.prereq: Grad student in CE or ESCI or EEB or WRS or FW or BAE or FR or HORT or ENR or LA or SRSE or instr consent",
    "prereq": []
  },
  {
    "uid": "800170",
    "code": "ESCI8602",
    "subject": "ESCI",
    "number": "8602",
    "honors": false,
    "writingIntensive": false,
    "name": "Stream Restoration Practice",
    "fullname": "Stream Restoration Practice",
    "info": "Field experience, group design project. Students provide a stream restoration context for each other?s elective coursework, complete critical assessments of stream restoration projects, and design a stream restoration site.prereq: 8601 or CE 8601",
    "prereq": {
      "or": [
        {
          "code": "ESCI 8601",
          "subject": "ESCI",
          "id": "8601"
        },
        {
          "code": "CE 8601",
          "subject": "CE",
          "id": "8601"
        }
      ]
    }
  },
  {
    "uid": "788477",
    "code": "ESCI8666",
    "subject": "ESCI",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral pre-thesis credits.prereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "819363",
    "code": "ESCI8701",
    "subject": "ESCI",
    "number": "8701",
    "honors": false,
    "writingIntensive": false,
    "name": "Geomorphology",
    "fullname": "Geomorphology",
    "info": "Landscapes and the processes that shape them, encompassing fluvial, hill-slope, glacial, aeolian, and coastal environments. Mechanics of solids and fluids at Earth's surface.  Erosion, deposition, and sediment transport. Prereqs: MATH 1271 (Calculus I) or equivalent; PHYS 1301 (Physics I: Classical Mechanics) or equivalent; or instructor consent.",
    "prereq": {
      "or": [
        {
          "code": "MATH 1271",
          "subject": "MATH",
          "id": "1271"
        },
        {
          "code": "PHYS 1301",
          "subject": "PHYS",
          "id": "1301"
        }
      ]
    }
  },
  {
    "uid": "007594",
    "code": "ESCI8712",
    "subject": "ESCI",
    "number": "8712",
    "honors": false,
    "writingIntensive": false,
    "name": "Geohydrology",
    "fullname": "Transport Phenomena and Analytical Geohydrology",
    "info": "Microscopic flow parameters, momentum, mass and energy transport through porous media.  Geologic factors in aquifer performance, equations for groundwater flow, and analysis of pump tests.prereq: 5701 or CE 3502 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "ESCI 5701",
          "subject": "ESCI",
          "id": "5701"
        },
        {
          "code": "CE 3502",
          "subject": "CE",
          "id": "3502"
        }
      ]
    }
  },
  {
    "uid": "007592",
    "code": "ESCI8718",
    "subject": "ESCI",
    "number": "8718",
    "honors": false,
    "writingIntensive": false,
    "name": "Numerical Methods",
    "fullname": "Numerical Methods in Hydrogeology",
    "info": "Introduction to finite difference and finite element methods in hydrogeology.  Students develop one- and two-dimensional models of diffusion and advection-dispersion equations.prereq: 5701, CSci 1107 or instr consent",
    "prereq": {
      "and": [
        {
          "code": "ESCI 5701",
          "subject": "ESCI",
          "id": "5701"
        },
        {
          "code": "CSCI 1107",
          "subject": "CSCI",
          "id": "1107"
        }
      ]
    }
  },
  {
    "uid": "788604",
    "code": "ESCI8777",
    "subject": "ESCI",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(no description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "812236",
    "code": "ESCI8801",
    "subject": "ESCI",
    "number": "8801",
    "honors": false,
    "writingIntensive": false,
    "name": "Geomicrobiology",
    "fullname": "Geomicrobiology",
    "info": "Geosphere/biosphere interactions over temporal/spatial scales. Global biogeochemical cycling, microbe-metal interactions, microbial paleobiology, environmental geomicrobiology, life detection, habitability of planets.prereq: One semester college level biology",
    "prereq": []
  },
  {
    "uid": "787872",
    "code": "ESCI8888",
    "subject": "ESCI",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(no description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "010053",
    "code": "ESCI8970",
    "subject": "ESCI",
    "number": "8970",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Topics Earth Science",
    "fullname": "Seminar: Current Topics in Earth Sciences",
    "info": "Seminar course. Individual topics will be determined and added per semester.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "010054",
    "code": "ESCI8980",
    "subject": "ESCI",
    "number": "8980",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Earth&Env Sci Topics",
    "fullname": "Seminar: Current Topics in Earth & Environmental Sciences",
    "info": "Selected seminar topics in Earth & Environmental Sciences.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "010055",
    "code": "ESCI8994",
    "subject": "ESCI",
    "number": "8994",
    "honors": false,
    "writingIntensive": false,
    "name": "Research",
    "fullname": "Research in Earth Sciences",
    "info": "Independent research under faculty supervision.prereq: instr consent",
    "prereq": []
  }
]