[
  {
    "uid": "010352",
    "code": "ESL10",
    "subject": "ESL",
    "number": "10",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg Grammar",
    "fullname": "Beginning Grammar",
    "info": "In this course, students will develop English grammar skills by focusing on the meaning, form, and use of basic grammar structures in reading, writing, listening, and speaking. Major topics include nouns, articles and quantifiers, pronouns, possessive and descriptive adjectives, prepositions, coordinating and subordinating conjunctions, simple present and past verb tenses, and accurate use of adverbs, time expressions, and time clauses. With significant support from the instructor, students will complete sentence-level writing assignments, short controlled speaking assignments, and tests.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "787637",
    "code": "ESL105",
    "subject": "ESL",
    "number": "105",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High Beginning Grammar",
    "fullname": "SIEP: High Beginning Grammar",
    "info": "In this 7-week intensive course students will continue developing grammar skills by focusing on the meaning, form, and use of basic grammar structures in reading, writing, listening, and speaking.  Major topics include nouns, articles, pronouns, coordinating conjunctions, simple present, present progressive, and simple past verb tenses, and accurate use of adverbs, time expressions, and time clauses.  With support from the instructor, students will complete sentence and paragraph-level writing assignments, controlled speaking assignments, and tests.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "008532",
    "code": "ESL110",
    "subject": "ESL",
    "number": "110",
    "honors": false,
    "writingIntensive": false,
    "name": "High-Beg Grammar",
    "fullname": "High-Beginning Grammar",
    "info": "In this course, students will refine and extend English grammar skills by focusing on the meaning, form, and use of basic grammar structures in reading, writing, listening, and speaking.  Major topics include modals, nouns, articles and quantifiers, pronouns, direct and indirect objects, gerunds and infinitives, possessive and descriptive adjectives, prepositions, coordinating and subordinating conjunctions, present, past, and future verb tenses, and accurate use of adverbs, time expressions, and time clauses.  With support from the instructor, students will complete sentence and paragraph-level writing assignments, controlled speaking assignments, and tests.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "787638",
    "code": "ESL115",
    "subject": "ESL",
    "number": "115",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High Begin Reading/Comp",
    "fullname": "SIEP: High Beginning Reading and Composition",
    "info": "In this course, students will develop skills and strategies for reading short adapted texts and writing multi-draft papers of one or more paragraphs in English. Students will apply reading strategies and demonstrate comprehension and analysis of adapted texts. Students will also engage in extensive reading and discuss readings. In addition, students will complete informal writing assignments and 2-3 multi-draft papers of one or more paragraphs. With the instructor’s support, students will work on developing ideas and organization as well as accurate grammar and vocabulary.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "008848",
    "code": "ESL120",
    "subject": "ESL",
    "number": "120",
    "honors": false,
    "writingIntensive": false,
    "name": "High-Beg Reading/Comp",
    "fullname": "High-Beginning Reading and Composition",
    "info": "In this course, students will develop skills and strategies for reading short adapted texts and writing multi-draft papers of one or more paragraphs in English. Students will apply reading strategies and demonstrate comprehension and analysis of adapted texts. Students will also engage in extensive reading and discuss readings. In addition, students will complete informal writing assignments and at least four multi-draft papers of one or more paragraphs. With the instructor’s support, students will work on developing ideas and organization as well as accurate grammar and vocabulary in writing.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "804647",
    "code": "ESL125",
    "subject": "ESL",
    "number": "125",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High Begin Oral Skills",
    "fullname": "SIEP, High Beginning Oral Skills",
    "info": "In this course, students will continue developing skills and strategies for listening to general and adapted academic content and for speaking in conversations, discussions, and short presentations on familiar topics in English. The instructor will support students in using a variety of phrases to communicate in classroom interactions, small talk, and pair and small group discussions and in delivering individual informative presentations with personal and general examples as support. The instructor will also help students identify main ideas and important details and develop active listening skills. With support from the instructor, students will use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. A significant part of this course will include using new language skills to interact with native speakers beyond the classroom through a series of field trips in which students explore U.S. and local culture and develop critical thinking skills. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "016661",
    "code": "ESL130",
    "subject": "ESL",
    "number": "130",
    "honors": false,
    "writingIntensive": false,
    "name": "High Beginning Oral Skills",
    "fullname": "High Beginning Oral Skills",
    "info": "In this course, students will develop skills and strategies for listening to general and adapted academic content and for speaking in conversations, discussions, and short presentations on familiar topics in English. The instructor will support students in using a variety of phrases to communicate in classroom interactions, small talk, and pair and small group discussions and in delivering individual informative presentations with personal and general examples as support. The instructor will also help students identify main ideas and important details and develop active listening and note-taking skills.  With support from the instructor, students will use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "008839",
    "code": "ESL131",
    "subject": "ESL",
    "number": "131",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg Oral Skills",
    "fullname": "Beginning Oral Skills",
    "info": "Focuses on the ability to communicate in English in everyday situations. Listening and speaking are emphasized.",
    "prereq": []
  },
  {
    "uid": "809756",
    "code": "ESL15",
    "subject": "ESL",
    "number": "15",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Beg Reading/Comp",
    "fullname": "SIEP: Beginning Reading and Composition",
    "info": "In this 7-week intensive course, students will develop skills and strategies for reading short adapted texts and writing sentences and multi-draft short descriptive paragraphs in English. Students will apply basic strategies with the instructor’s support to read a variety of short and simplified texts. Students will learn the fundamentals of writing at the sentence and basic paragraph level. The instructor will support students in developing basic vocabulary and using language accurately in simple sentences. This course is intended for students with some prior English and is not for true beginners.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "016663",
    "code": "ESL191",
    "subject": "ESL",
    "number": "191",
    "honors": false,
    "writingIntensive": false,
    "name": "Eng Skills Enhancement",
    "fullname": "English Skills Enhancement",
    "info": "Improving basic English language skills through work in computer/language lab. Focused activities for individual learners.",
    "prereq": []
  },
  {
    "uid": "009265",
    "code": "ESL193",
    "subject": "ESL",
    "number": "193",
    "honors": false,
    "writingIntensive": false,
    "name": "Pronunciation",
    "fullname": "Pronunciation",
    "info": "Sspects of English pronunciation necessary to improve comprehensibility and reduce foreign-accents. Enunciation. Word, phrasal, and sentence stress. Intonation. Linking. Thought groups. Rhythm.",
    "prereq": []
  },
  {
    "uid": "010369",
    "code": "ESL20",
    "subject": "ESL",
    "number": "20",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg Reading/Comp",
    "fullname": "Beginning Reading and Composition",
    "info": "In this course, students will develop skills and strategies for reading short adapted texts and writing sentences and multi-draft short descriptive paragraphs in English. Students will apply basic strategies with the instructor’s support to read a variety of short and simplified texts. Students will learn the fundamentals of writing at the sentence and basic paragraph level. The instructor will support students in developing basic vocabulary and using language accurately in simple sentences. This course is intended for students with some prior English instruction.   Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "010385",
    "code": "ESL200",
    "subject": "ESL",
    "number": "200",
    "honors": false,
    "writingIntensive": false,
    "name": "Am Univ",
    "fullname": "Understanding American Universities",
    "info": "Strategies for success in academic classes including vocabulary development, lecture comprehension, and textbook reading; application of listening skills and the reading of supporting unadapted material.",
    "prereq": []
  },
  {
    "uid": "787641",
    "code": "ESL205",
    "subject": "ESL",
    "number": "205",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP:  Intermediate Grammar",
    "fullname": "SIEP: Intermediate Grammar",
    "info": "In this course, students will continue refining and extending their grammar skills by focusing on the meaning, form, and use of basic and more complex grammar structures in reading, writing, listening, and speaking. Major topics include modals, coordinating and subordinating conjunctions, simple present, present progressive, simple past,  past progressive, and future verb tenses, and accurate use of adverbs, time expressions, and time clauses. With some support from the instructor, students will complete sentence and paragraph-level writing assignments, controlled speaking assignments, and tests.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "009073",
    "code": "ESL210",
    "subject": "ESL",
    "number": "210",
    "honors": false,
    "writingIntensive": false,
    "name": "Int. Grammar",
    "fullname": "Intermediate Grammar",
    "info": "In this course, students will add to the range and accuracy of their English grammar skills by focusing on the meaning, form, and use of basic and more complex grammar structures in reading, writing, listening, and speaking.  Major topics include modals, phrasal verbs, nouns, articles and quantifiers, pronouns, gerunds and infinitives, comparative and superlative adjectives, a review of present and past verb tenses, present perfect, present perfect progressive, and accurate use of adverbs, time expressions, and time clauses.  With some support from the instructor, students will complete sentence and paragraph-level writing assignments, controlled speaking assignments, and tests.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "008852",
    "code": "ESL211",
    "subject": "ESL",
    "number": "211",
    "honors": false,
    "writingIntensive": false,
    "name": "High-beg Grammar",
    "fullname": "High Beginning Grammar",
    "info": "Reviews and adds to students' skills with basic structures. Focuses on increasingly complex structures with attention to form, meaning, and use; practice of structures in controlled speaking and writing activities.",
    "prereq": []
  },
  {
    "uid": "801662",
    "code": "ESL215",
    "subject": "ESL",
    "number": "215",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Intermediate Read/Comp",
    "fullname": "SIEP: Intermediate Reading and Composition",
    "info": "In this course, students will develop skills and strategies for reading adapted and simple authentic texts and writing 2-3 multi-draft papers of one or more paragraphs. Students will apply reading strategies and demonstrate comprehension and analysis of course readings. Students will also engage in extensive reading and discuss readings. In writing, students will work on paragraph development and improving their vocabulary and grammatical accuracy in formal writing assignments. Students will also develop fluency and demonstrate reading comprehension through informal writing assignments.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "015770",
    "code": "ESL220",
    "subject": "ESL",
    "number": "220",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Reading/Comp",
    "fullname": "Intermediate Reading and Composition",
    "info": "In this course, students will develop skills and strategies for reading adapted and simple authentic texts and writing 2-3 multi-draft papers of one or more paragraphs and one essay in English. Students will apply reading strategies and demonstrate comprehension and analysis of course readings.  Students will also engage in extensive reading and discuss readings. In writing, students will work on paragraph and essay development and improving their vocabulary and grammatical accuracy in formal writing assignments.  Students will also develop fluency and demonstrate reading comprehension through informal writing assignments. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "008863",
    "code": "ESL221",
    "subject": "ESL",
    "number": "221",
    "honors": false,
    "writingIntensive": false,
    "name": "High-beg Read/Comp",
    "fullname": "High Beginning Reading/Composition",
    "info": "Reading longer passages of limited difficulty with increased speed.  Main ideas, vocabulary development, reading speed, skimming and scanning.  Writing fundamentals, spelling, punctuation, paragraphing, and organization.  Writing exercises and free writing.",
    "prereq": []
  },
  {
    "uid": "804648",
    "code": "ESL225",
    "subject": "ESL",
    "number": "225",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Intermediate Oral Skills",
    "fullname": "SIEP, Intermediate Oral Skills",
    "info": "In this course, students will continue developing skills and strategies for listening to general and adapted academic content and for speaking in conversations, discussions, and presentations on familiar general and academic topics in English. With the instructor’s support, students will use a variety of phrases to communicate in classroom interactions and small talk. The instructor will support students in communicating in small group discussions and in delivering individual informative presentations with personal and general examples as support. Students will also develop inferencing and active listening skills. With support from the instructor, students will use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. A significant part of this course will include using new language skills to interact with native speakers beyond the classroom through a series of field trips in which students explore U.S. and local culture and develop critical thinking skills. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "015771",
    "code": "ESL230",
    "subject": "ESL",
    "number": "230",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Oral Skills",
    "fullname": "Intermediate Oral Skills",
    "info": "In this course, students will develop skills and strategies for listening to general and adapted academic content and for speaking in conversations, discussions, and presentations on familiar general and academic topics in English.  Students will use a variety of phrases independently to communicate in classroom interactions and small talk. The instructor will support students in communicating in small group discussions and in delivering individual and group informative presentations with personal and general examples as support.  The instructor will also help students paraphrase and summarize listening material.  Students will develop inferencing, active listening, and note-taking skills.  With support from the instructor, students will use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "008867",
    "code": "ESL231",
    "subject": "ESL",
    "number": "231",
    "honors": false,
    "writingIntensive": false,
    "name": "High-beg Oral Skills",
    "fullname": "High Beginning Oral Skills",
    "info": "Ability to communicate in English in everyday situations.  Emphasis on listening and speaking, and increasing vocabulary and fluency in spoken English.",
    "prereq": []
  },
  {
    "uid": "809757",
    "code": "ESL25",
    "subject": "ESL",
    "number": "25",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Beg Oral Skills",
    "fullname": "SIEP: Beginning Oral Skills",
    "info": "In this 7-week intensive course, students will begin to develop skills and strategies for listening to adapted general content and for speaking in basic conversations, discussions, and short presentations on familiar topics in English. The instructor will support students in using basic phrases to communicate in classroom and social interactions and pair and small group discussions and in delivering individual informative presentations with personal examples as support. The instructor will also help students to identify topic, main ideas, and important details of listening material. With significant support from the instructor, students will use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. A significant part of this course will include using new language skills to interact with native speakers beyond the classroom through a series of field trips in which students explore U.S. and local culture and develop critical thinking skills. This course is intended for students with some prior English. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "808940",
    "code": "ESL30",
    "subject": "ESL",
    "number": "30",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg Oral Skills",
    "fullname": "Beginning Oral Skills",
    "info": "In this course, students will develop skills and strategies for listening to adapted general content and for speaking in basic conversations, discussions, and short presentations on familiar topics in English. The instructor will support students in using basic phrases to communicate in classroom and social interactions and pair and small group discussions and in delivering individual informative presentations with personal examples as support.  The instructor will also help students to identify topic, main ideas, and important details of listening material.  With significant support from the instructor, students will use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. This course is intended for students with some prior English instruction.   Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "010404",
    "code": "ESL300",
    "subject": "ESL",
    "number": "300",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Lab",
    "fullname": "Computer Lab: Intro to Computer Basics",
    "info": "Students will learn basic word processing.",
    "prereq": []
  },
  {
    "uid": "804907",
    "code": "ESL3001",
    "subject": "ESL",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrated Skills Acad English",
    "fullname": "Integrated Skills for Academic English",
    "info": "This course focuses on the academic and language skills necessary to thrive in a U.S. university setting. Students will strengthen English language communication skills, both written and oral, that will help them succeed in their other content area courses at the University. Focus is on setting and achieving goals for academic success, understanding and using academic resources for the U.S. university, and building strategies and language for more effective communication with instructors and peers in academic writing, presentations, discussions, and group projects.Prerequisite: non-native speaker of English",
    "prereq": []
  },
  {
    "uid": "809980",
    "code": "ESL3006",
    "subject": "ESL",
    "number": "3006",
    "honors": false,
    "writingIntensive": false,
    "name": "Eng for Business Interactions",
    "fullname": "English for Business Interactions",
    "info": "This 2-credit course is designed for high-intermediate to advanced non-native speakers of English who are currently business majors or in a closely related major. The goal of this course is to help students polish their English skills for effective and culturally appropriate communication in the world of business. The course covers topics such as email for business communication, successful group work, cultural values, communication styles, interviewing, networking, and delivering effective presentations. This course has two major objectives: 1) to help students improve their English skills for internship- or job-seeking purposes, and 2) to help students improve their language, communication, and teamwork skills for use in a professional context in the U.S. prereq: non-native speaker of English",
    "prereq": []
  },
  {
    "uid": "813325",
    "code": "ESL3007",
    "subject": "ESL",
    "number": "3007",
    "honors": false,
    "writingIntensive": false,
    "name": "English for Physics",
    "fullname": "English for Physics",
    "info": "This course is designed for non-native speakers of English who have high-intermediate to advanced English skills and are currently enrolled in Physics 1301W. The goal of this course is to help students further develop the English and academic skills needed to be successful in their physics class. Students taking this course will gain more support and practice with the conventions of writing scientific lab reports, applying the concepts of academic integrity, interacting and participating in lab-type discussions and small group projects, using academic listening and note-taking strategies, and identifying campus resources for additional academic/social support. This course also equips students with techniques to aid in their continual improvement of English skills for science and engineering contexts beyond the class.Prerequisite: non-native speaker of English",
    "prereq": []
  },
  {
    "uid": "818303",
    "code": "ESL3008",
    "subject": "ESL",
    "number": "3008",
    "honors": false,
    "writingIntensive": false,
    "name": "English for Chemistry",
    "fullname": "English for Chemistry",
    "info": "This course is designed for non-native speakers of English who are currently enrolled in an introductory chemistry course (CHEM 1061 or 1065). Students taking this course will gain more support and practice with the conventions of writing scientific lab reports, interacting and participating in classroom and lab discussions, interpreting authentic texts (both written and aural), applying the concepts of academic integrity, and understanding the cultural expectations for seeking additional academic/social support. One of the goals of this course is to equip participants with techniques to aid in continual improvement of English skills for science contexts beyond the class.",
    "prereq": []
  },
  {
    "uid": "801660",
    "code": "ESL305",
    "subject": "ESL",
    "number": "305",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Advanced Grammar",
    "fullname": "SIEP: Advanced Grammar",
    "info": "In this course, students will review basic grammar skills and start to develop their understanding and control of complex grammar structures by focusing on their meaning, form, and use in reading, writing, listening, and speaking.  Major topics include nouns, articles and quantifiers, phrasal verbs, coordinating and subordinating conjunctions, transitions and other connectors, a review of present and past verb tenses, present perfect and present perfect progressive tense, and accurate use of adverbs, time expressions, and time clauses. Students will complete paragraph-level writing assignments, recorded speaking assignments, and tests that require increasing levels of independent production.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "010405",
    "code": "ESL310",
    "subject": "ESL",
    "number": "310",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Grammar",
    "fullname": "Advanced Grammar",
    "info": "In this course, students will review basic English grammar skills and develop their understanding and control of more complex grammar structures by focusing on their meaning, form, and use in reading, writing, listening, and speaking.  Major topics include passive voice, past modals, causatives, adjective clauses, conditionals, all verb tenses, and accurate use of adverbs, time expressions, and time clauses. Students will complete paragraph-level writing assignments, recorded speaking assignments, and tests that require increasing levels of independent production with complex grammatical structures.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "796387",
    "code": "ESL3101",
    "subject": "ESL",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced English Grammar",
    "fullname": "Advanced English Grammar",
    "info": "Form, meaning, and use of common English grammatical structures in written/oral discourse. Adverb, adjective, and noun clauses. Verb tense, aspect, and modality. Grammar beyond sentence level. Application to development of revision/editing skills.prereq: dept consent, non-native speaker of English, [C-TOEFL score 153-187 or equiv], ESL program consent",
    "prereq": []
  },
  {
    "uid": "796388",
    "code": "ESL3102",
    "subject": "ESL",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Engl Grammar for Acad Purposes",
    "fullname": "English Grammar for Academic Purposes",
    "info": "In this course, students work on increasing their accuracy and range in English grammar. Topics that are especially relevant to academic writing, such as conciseness and smooth connections between sentences, are emphasized. Among the traditional topics of grammar, these are likely to be included: subordination, coordination, and transition expressions; tense, aspect, and associated adverbials; gerunds, infinitives, and other types of complementation; and lexical grammar--the grammar associated with individual words. Activities and regular assignments improve students’ ability to analyze grammar, including their own mistakes, and to use English grammar more effectively. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "009044",
    "code": "ESL311",
    "subject": "ESL",
    "number": "311",
    "honors": false,
    "writingIntensive": false,
    "name": "Low-int Grammar",
    "fullname": "Low Intermediate Grammar",
    "info": "Reviews and adds to students' skills with basic structures.  Emphasizes increasingly complex structures with attention to form, meaning, and use;  practice of structures used in controlled speaking and writing situations.",
    "prereq": []
  },
  {
    "uid": "801667",
    "code": "ESL315",
    "subject": "ESL",
    "number": "315",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Advanced Reading & Comp",
    "fullname": "SIEP: Advanced Reading and Composition",
    "info": "In this course, students will develop skills and strategies for reading adapted and simple authentic college-level texts and writing 1-2 multi-draft essays. Students will apply reading strategies and demonstrate comprehension and analysis of course readings.  Students will also engage in extensive reading and discuss readings. Students will work on essay development, paraphrasing, and summarizing. Students will review basic and essay organization and will complete informal writing assignments. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "009132",
    "code": "ESL320",
    "subject": "ESL",
    "number": "320",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Reading & Composition",
    "fullname": "Advanced Reading and Composition",
    "info": "In this course, students will develop skills and strategies for reading adapted and simple authentic college-level texts and writing 2-3 multi-draft essays in English. Students will apply reading strategies and demonstrate comprehension and analysis of course readings.  Students will also engage in extensive reading and discuss readings.  Students will work on essay development, paraphrasing and summarizing, and incorporating and citing sources. Students will progress from developing paragraphs to developing academic essays using effective patterns of organization and will complete informal writing assignments.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "796389",
    "code": "ESL3201",
    "subject": "ESL",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Eng Reading/Composition",
    "fullname": "Advanced English Reading and Composition",
    "info": "Comprehension of main ideas, organization, and support in longer authentic English texts. Expanded vocabulary comprehension. Fluency, focus, and persuasiveness through draft/revision. Focuses on accuracy/variety of expression.prereq: Non-native speaker of English, [iBT score of 53-67 or equiv]",
    "prereq": []
  },
  {
    "uid": "796390",
    "code": "ESL3202W",
    "subject": "ESL",
    "number": "3202",
    "honors": false,
    "writingIntensive": true,
    "name": "Academic Reading & Composition",
    "fullname": "Academic Reading and Composition",
    "info": "This course is designed for students who are enrolled in degree programs at the University of Minnesota. In this course students will build and refine advanced-level skills and strategies, including audience awareness and incorporating sources, for reading authentic college-level texts and writing multi-draft papers in English. Students will read essays and articles on a variety of topics from multiple sources. Students will improve their ability to identify main ideas and details, analyze and critique support, and respond with their own ideas in writing and discussion. Students will plan and develop multi-draft papers to practice applying persuasive and expository modes of writing to accomplish specific purposes as writers and also develop informal writing skills. Prerequisite: a first language other than English.prereq: non-native speaker of English.",
    "prereq": []
  },
  {
    "uid": "009070",
    "code": "ESL321",
    "subject": "ESL",
    "number": "321",
    "honors": false,
    "writingIntensive": false,
    "name": "Low-int Read/Comp",
    "fullname": "Low Intermediate Reading/Composition",
    "info": "Reading for main ideas and supporting ideas with increased speed;  vocabulary development, word formation, and use of dictionary; spelling, punctuation and paragraphing. Organization and writing as a process.",
    "prereq": []
  },
  {
    "uid": "804649",
    "code": "ESL325",
    "subject": "ESL",
    "number": "325",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Advanced Oral Skills",
    "fullname": "SIEP, Advanced Oral Skills",
    "info": "n this course students will continue developing skills and strategies for listening to adapted and simple authentic academic content and for speaking in discussions and presentations on simple academic topics in English. The instructor will support students in participating in small group discussions and in delivering individual and group informative and/or persuasive presentations with a variety of evidence as support. The instructor will also help students paraphrase and summarize listening material and evaluate a speaker’s reasoning and support. Students will develop inferencing and active listening skills. With support from the instructor, students will use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. A significant part of this course will include using new language skills to interact with speakers of English beyond the classroom through a series of field trips in which students explore U.S. and local culture and develop critical thinking skills. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "790625",
    "code": "ESL330",
    "subject": "ESL",
    "number": "330",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Oral Skills",
    "fullname": "Advanced Oral Skills",
    "info": "In this course, students will develop skills and strategies for listening to adapted and simple authentic academic content and for speaking in discussions and presentations on simple academic topics in English. The instructor will support students in leading small group discussions and in delivering individual and group informative and persuasive presentations with a variety of evidence as support. The instructor will also help students paraphrase and summarize listening material and evaluate a speaker’s reasoning and support. Students will develop inferencing, active listening, and note-taking skills. Students will independently use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "796391",
    "code": "ESL3302",
    "subject": "ESL",
    "number": "3302",
    "honors": false,
    "writingIntensive": false,
    "name": "Writing for Academic Purposes",
    "fullname": "Writing for Academic Purposes",
    "info": "Writing process. Idea generation/development, drafting, revision, editing. Focuses on different genres of academic writing, including critical response to scholarly argument, scholarly review, and incorporation of source material in writing. \"Rush writing\" under time pressure to improve fluency in writing.prereq: 3202, non-native speaker of English, [C-TOEFL score of at least 190 or equiv], dept consent",
    "prereq": {
      "code": "ESL 3202",
      "subject": "ESL",
      "id": "3202"
    }
  },
  {
    "uid": "009062",
    "code": "ESL331",
    "subject": "ESL",
    "number": "331",
    "honors": false,
    "writingIntensive": false,
    "name": "Low-int Oral Skills",
    "fullname": "Low Intermediate Oral Skills",
    "info": "Practice in speaking in structured and semi-structured situations with special attention to basic regularities in pronunciation.",
    "prereq": []
  },
  {
    "uid": "805479",
    "code": "ESL3402W",
    "subject": "ESL",
    "number": "3402",
    "honors": false,
    "writingIntensive": true,
    "name": "Research Writing",
    "fullname": "Research Writing for the American University",
    "info": "This course enables students to develop the methods of citation, conventions of style and organization, and critical reading and thinking skills necessary for writing college-level research papers in English. Students apply a process approach to produce an academic research paper on a topic of interest. Structure and vocabulary usage are addressed individually. In addition, students learn how to use library resources effectively and become familiar with writing resources on campus.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "796392",
    "code": "ESL3501",
    "subject": "ESL",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv English Listening/Speaking",
    "fullname": "Advanced English Listening and Speaking",
    "info": "Speaking/understanding naturally spoken English in academic activities such as lecture comprehension, note taking, class discussions, and oral presentations. Emphasizes cross-cultural interaction related to academic subject matter.prereq: Non-native speaker of English, [iBT score 53-67 or equiv], dept consent",
    "prereq": []
  },
  {
    "uid": "796393",
    "code": "ESL3502",
    "subject": "ESL",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Listening & Speaking",
    "fullname": "Academic Listening and Speaking",
    "info": "In this course students will develop skills and strategies for listening to authentic academic content and for speaking in discussions and presentations on academic topics in English. Students will listen to academic lectures, develop note-taking skills, and synthesize and respond to content. This course will help students further develop both their fluency and accuracy through work on pronunciation, spoken grammar, and academic vocabulary. Students will develop skills for making effective academic presentations in English. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "804652",
    "code": "ESL3550",
    "subject": "ESL",
    "number": "3550",
    "honors": false,
    "writingIntensive": false,
    "name": "Pronunciation Improvement",
    "fullname": "Pronunciation Improvement",
    "info": "This course provides an overview of pronunciation in English. Pronunciation Improvement is designed for advanced students who want to polish their pronunciation skills in English. In order to improve awareness and production of sounds in spoken English, a variety of areas of pronunciation are covered while paying special attention to individual needs. Students will also be equipped with techniques for independent pronunciation practice. Topics covered include word stress, sentence stress, rhythm, intonation, and linking. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "797233",
    "code": "ESL3551",
    "subject": "ESL",
    "number": "3551",
    "honors": false,
    "writingIntensive": false,
    "name": "English Pronunciation",
    "fullname": "English Pronunciation",
    "info": "This course is designed for students who want to polish their pronunciation skills in English and become more aware of the sounds of the English language. In order to improve students’ ability to understand and pronounce English, a variety of areas of pronunciation will be covered while paying special attention to individual difficulties. Students will also be equipped with techniques to practice pronunciation improvement on their own. Topics covered include English sounds (individually and in combination with other sounds), word stress, sentence stress, rhythm, intonation, linking, understanding fast speech, pronunciation, and spelling connections. Open to students, visiting scholars, and members of the community with advanced English skills. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "796394",
    "code": "ESL3602",
    "subject": "ESL",
    "number": "3602",
    "honors": false,
    "writingIntensive": false,
    "name": "Speaking for Academic Purposes",
    "fullname": "Speaking for Academic Purposes",
    "info": "The goal of this course is to help advanced English speakers develop the skills needed to participate in academic interactions at the American university.  The course covers presentations, group presentations, seminar-style discussions, and informal exchanges. In this class, students learn to present themselves professionally and socially in academic settings in English with accuracy, variety, and flexibility. They learn to organize and outline academic presentations, present information clearly and effectively, explain concepts and processes from their academic field, involve audience members and respond to questions, and monitor and improve their spoken fluency, grammar, and pronunciation.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "802100",
    "code": "ESL3900",
    "subject": "ESL",
    "number": "3900",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in ESL",
    "fullname": "Special Topics in ESL",
    "info": "Topics vary.prereq: Non-native speaker of English",
    "prereq": []
  },
  {
    "uid": "798720",
    "code": "ESL3993",
    "subject": "ESL",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed Studies ",
    "prereq": []
  },
  {
    "uid": "010372",
    "code": "ESL40",
    "subject": "ESL",
    "number": "40",
    "honors": false,
    "writingIntensive": false,
    "name": "Skills",
    "fullname": "Skills Enhancement",
    "info": "Student will focus on specific areas of their English which need improvement. ",
    "prereq": []
  },
  {
    "uid": "010389",
    "code": "ESL400",
    "subject": "ESL",
    "number": "400",
    "honors": false,
    "writingIntensive": false,
    "name": "Lib/Res Skills",
    "fullname": "Library and Research Skills",
    "info": "Students will learn the basics of using the university library system for research purposes.",
    "prereq": []
  },
  {
    "uid": "801661",
    "code": "ESL405",
    "subject": "ESL",
    "number": "405",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High-Advanced Grammar",
    "fullname": "SIEP: High-Advanced Grammar",
    "info": "In this course, students will solidify their control over a range of basic and complex grammar structures by focusing on their meaning, form, and use in reading, writing, listening, and speaking.  Major topics include lexical patterns, noun clauses, coordinating and subordinating conjunctions, transitions and other connectors, and parallelism. Students will independently complete paragraph-level writing assignments, recorded speaking assignments, and assessments that require accurate use of a range of grammatical options.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "009266",
    "code": "ESL410",
    "subject": "ESL",
    "number": "410",
    "honors": false,
    "writingIntensive": false,
    "name": "Engl Grammar for Acad Purposes",
    "fullname": "English Grammar for Academic Purposes",
    "info": "In this course, students will solidify their control over a range of basic and complex grammar structures by focusing on their meaning, form, and use in reading, writing, listening, and speaking.  Major topics include past modals, lexical patterns, noun clauses, conditionals, connectors, and control of tense and aspect with tense shifting and accurate use of adverbs, time expressions, and time clauses. Students will complete writing assignments, recorded speaking assignments, and tests that require independent and accurate use of a range of complex grammatical options.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "801668",
    "code": "ESL415",
    "subject": "ESL",
    "number": "415",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High-Advanced Read/Comp",
    "fullname": "SIEP: High-Advanced Reading and Composition",
    "info": "In this course, students will develop skills and strategies for reading authentic college-level texts and writing multi-draft essays. Students will read essays and articles on a variety of topics from multiple sources and engage in extensive reading.  Students will improve their ability to apply reading strategies, analyze and critique support, and use critical thinking to respond with their own ideas in writing and discussion.  In 1-2 multi-draft essays, students will use effective organization to accomplish specific purposes as writers.  Students will also develop informal writing skills.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "015781",
    "code": "ESL420",
    "subject": "ESL",
    "number": "420",
    "honors": false,
    "writingIntensive": false,
    "name": "High Adv Reading & Composition",
    "fullname": "High Advanced Reading/Composition",
    "info": "In this course, students will develop skills and strategies for reading authentic college-level texts and writing 2-3 multi-draft essays in English. In this course students will read essays and articles on a variety of topics from multiple sources and engage in extensive reading.  Students will improve their ability to apply reading strategies, analyze and critique support, and use critical thinking to respond with their own ideas in writing and discussion.  In 2-3 multi-draft essays, students will use effective organization to accomplish specific purposes as writers.  Students will also develop informal writing skills.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "804650",
    "code": "ESL425",
    "subject": "ESL",
    "number": "425",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High Adv Oral Skills",
    "fullname": "SIEP, High Advanced Oral Skills",
    "info": "n this course, students will continue developing skills and strategies for listening to authentic academic content and for speaking in discussions and presentations on academic topics in English. Students will be supported in leading small group discussions and will independently deliver consistently fluent, logical, unified, and coherent individual and group informative and/or persuasive presentations with a variety of evidence as support. Students will independently paraphrase, summarize, and synthesize listening material, and the instructor will help students evaluate a speaker’s reasoning and support. Students will independently make inferences, apply active listening strategies, and use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. A significant part of this course will include using new language skills to interact with speakers of English beyond the classroom through a series of field trips in which students explore U.S. and local culture and develop critical thinking skills. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "009247",
    "code": "ESL430",
    "subject": "ESL",
    "number": "430",
    "honors": false,
    "writingIntensive": false,
    "name": "High Adv Oral Skills",
    "fullname": "High Advanced Oral Skills",
    "info": "In this course, students will develop skills and strategies for listening to authentic academic content and for speaking in discussions and presentations on academic topics in English. Students will independently lead small group discussions and deliver consistently fluent, logical, unified, and coherent individual and group informative and persuasive presentations with a variety of evidence as support. Students will paraphrase, summarize, and synthesize listening material and evaluate a speaker’s reasoning and support. Students will make inferences, apply active listening strategies, and use effective note-taking skills. Students will independently use clear pronunciation, level-appropriate vocabulary, and level-specific grammar accurately. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "809755",
    "code": "ESL5",
    "subject": "ESL",
    "number": "5",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Beg Grammar",
    "fullname": "SIEP: Beginning Grammar",
    "info": "In this 7-week intensive course, students begin to develop grammar skills by focusing on the meaning, form, and use of the most basic grammar structures in reading, writing, listening, and speaking.  Major topics include nouns, articles, subject pronouns, possessive and descriptive adjectives, prepositions, simple present tense, and accurate use of adverbs and time expressions.  With significant support from the instructor, students will complete sentence-level writing assignments, short controlled speaking assignments, and tests.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "010394",
    "code": "ESL500",
    "subject": "ESL",
    "number": "500",
    "honors": false,
    "writingIntensive": false,
    "name": "Com Serv Lrning",
    "fullname": "Community Service Learning",
    "info": "Students will learn about and participate in community service projects.",
    "prereq": []
  },
  {
    "uid": "809981",
    "code": "ESL5006",
    "subject": "ESL",
    "number": "5006",
    "honors": false,
    "writingIntensive": false,
    "name": "Eng for Business Interactions",
    "fullname": "English for Business Interactions",
    "info": "This course is designed for students who are currently in a graduate program in business or in a closely related graduate program. The goal of this course is to help students polish their English skills for effective and culturally appropriate communication in the world of business.  The course covers topics such as email for business communication, successful group work, cultural values, communication styles, interviewing, networking, and delivering effective presentations. This course has two major objectives: 1) to help students improve their English skills for internship- or job-seeking purposes, and 2) to help students improve their language, communication, and teamwork skills for use in a professional context in the U.S.Prerequisites: Graduate student, a first language other than English",
    "prereq": []
  },
  {
    "uid": "816297",
    "code": "ESL5008",
    "subject": "ESL",
    "number": "5008",
    "honors": false,
    "writingIntensive": false,
    "name": "Speaking for Prof Settings",
    "fullname": "Speaking for Professional Settings",
    "info": "This course is designed for graduate students who speak a first language other than English and are seeking to improve their English speaking skills for professional contexts. The goal of this course is to help students refine their English skills for effective and culturally appropriate communication in specific professional situations.  The course covers topics such as small talk, networking, interviewing, and presentation skills.  Students will increase their confidence to communicate in a variety of settings including informal exchanges, career fairs, conference presentations, and job interviews.Prerequisite: Graduate student, a first language other than English",
    "prereq": []
  },
  {
    "uid": "819683",
    "code": "ESL5009",
    "subject": "ESL",
    "number": "5009",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Engl Conversation Skills",
    "fullname": "Advanced English Conversation Skills for Professionals",
    "info": "This hybrid course is designed for graduate students who speak a first language other than English and are seeking to improve their English conversation skills for informal, professional settings. The goal of this course is to build fluency and apply culturally appropriate strategies to be effective communicators in English with peers, professors, and colleagues in graduate and post-graduate work.  Participants will increase their fluency and confidence to communicate in a variety of situations, and on a range of topics, by engaging in speaking practice outside of class such as informational interviews, peer networking, professional development events, and co-curricular activities.Prerequisites: Graduate student, a first language other than English",
    "prereq": []
  },
  {
    "uid": "826587",
    "code": "ESL5010",
    "subject": "ESL",
    "number": "5010",
    "honors": false,
    "writingIntensive": false,
    "name": "Grammar Skills for Editing",
    "fullname": "Grammar Skills for Editing in Graduate and Professional Writing",
    "info": "This course is designed for graduate students who speak a first language other than English and are seeking to improve their editing and grammar skills to communicate more effectively in professional and academic writing in English. The goal of the course is to raise awareness of common language challenges as well as individual communicative effectiveness. Students will also identify and analyze discipline-specific language to make intentional grammatical choices in their own writing. Topics such as reporting, hedging, cohesion, voice, style, and sentence structure that are relevant to writing at the graduate level will be emphasized. Students will engage in peer and self-editing, and will become familiar with resources to support revision, editing, and proofreading. Prerequisite: Graduate student, a first language other than English",
    "prereq": []
  },
  {
    "uid": "015773",
    "code": "ESL511",
    "subject": "ESL",
    "number": "511",
    "honors": false,
    "writingIntensive": false,
    "name": "High-int Grammar",
    "fullname": "High Intermediate Grammar",
    "info": "Reviews and adds to repertoire of structures with attention to meaning, use and form;  emphasizes verb phrase and control of grammar in writing.",
    "prereq": []
  },
  {
    "uid": "009251",
    "code": "ESL521",
    "subject": "ESL",
    "number": "521",
    "honors": false,
    "writingIntensive": false,
    "name": "High-int. Read/Comp",
    "fullname": "High Intermediate Reading/Composition",
    "info": "Reading unadapted as well as adapted passages; efficiency, vocabulary, drawing inferences, identifying point of view, using knowledge of organization to aid understanding, writing process, academic-style assignments.",
    "prereq": []
  },
  {
    "uid": "817316",
    "code": "ESL5302",
    "subject": "ESL",
    "number": "5302",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Writing",
    "fullname": "Academic Writing",
    "info": "This course is designed for graduate students who speak a first language other than English. The course focuses on foundational writing skills and emphasizes the writing process - developing ideas, drafting, revising, and editing.  Guided textual analyses of discipline-specific readings are used to develop writing skills through the close examination of strategies employed by accomplished writers. Through ongoing, active participation, students learn to (1) match writing to audience and purpose, (2) produce different genres of academic writing, (3) incorporate discipline-specific source material into writing, and (4) critique their writing and that of others. Gains in writing skills culminate in students’ ability to transfer acquired skills into discipline-specific writing. Through development of personal voice and an appreciation for the importance of the credibility of the writer, students also learn to recognize and avoid plagiarism. Problems with sentence structure, lexical grammar, and diction are addressed individually.Prerequisites: Graduate student, a first language other than English",
    "prereq": []
  },
  {
    "uid": "015774",
    "code": "ESL531",
    "subject": "ESL",
    "number": "531",
    "honors": false,
    "writingIntensive": false,
    "name": "High-int Oral Skills",
    "fullname": "High Intermediate Oral Skills",
    "info": "Develop fluency and accuracy in everyday situations and in academic situations;  special attention to communication strategies;  prepares students for academic lectures by introducing standard forms of organization and note-taking skills.  Students also work on understanding natural conversational speech using a variety of authentic materials.",
    "prereq": []
  },
  {
    "uid": "818204",
    "code": "ESL5900",
    "subject": "ESL",
    "number": "5900",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Eng Lang",
    "fullname": "Special Topics in English Language",
    "info": "Topics vary.prereq: Non-native speaker of English",
    "prereq": []
  },
  {
    "uid": "010399",
    "code": "ESL600",
    "subject": "ESL",
    "number": "600",
    "honors": false,
    "writingIntensive": false,
    "name": "Business English",
    "fullname": "Business English",
    "info": "Oral/written communication skills in business setting.  ",
    "prereq": []
  },
  {
    "uid": "015778",
    "code": "ESL611",
    "subject": "ESL",
    "number": "611",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Grammar",
    "fullname": "Advanced Grammar",
    "info": "Difficult areas of grammar, resources to work on them. Meaning, use, form. Complex sentence patterns.",
    "prereq": []
  },
  {
    "uid": "015779",
    "code": "ESL622",
    "subject": "ESL",
    "number": "622",
    "honors": false,
    "writingIntensive": false,
    "name": "Written Word",
    "fullname": "Advanced Reading/Composition: The Written Word",
    "info": "Continuation of ESL 0621.",
    "prereq": []
  },
  {
    "uid": "009244",
    "code": "ESL641",
    "subject": "ESL",
    "number": "641",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Listening",
    "fullname": "Advanced Listening Comprehension",
    "info": "Lecture comprehension with attention to note taking, recognizing main ideas and support, and determining the attitude of the speaker toward the subject; comprehension of complex information presented in a nonlecture format, as in television documentaries.",
    "prereq": []
  },
  {
    "uid": "009245",
    "code": "ESL651",
    "subject": "ESL",
    "number": "651",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Speaking/Pron",
    "fullname": "Advanced Speaking/Pronunciation",
    "info": "Emphasizes the use of spoken English in academic settings as well as in conversation. Pronunciation focuses on individual needs.",
    "prereq": []
  },
  {
    "uid": "010640",
    "code": "ESL661",
    "subject": "ESL",
    "number": "661",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Reading",
    "fullname": "Advanced Reading",
    "info": "Students will work on comprehending authentic texts of significant lengths. Develop strategies to apply in academic reading.",
    "prereq": []
  },
  {
    "uid": "009236",
    "code": "ESL671",
    "subject": "ESL",
    "number": "671",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Composition",
    "fullname": "Advanced Composition",
    "info": "Skills needed at every stage of the writing process: finding a topic, determining an approach to the topic, planning and drafting a composition, revising, and editing. Suiting one's writing to audience and topic, and looking at one's own writing critically.",
    "prereq": []
  },
  {
    "uid": "010402",
    "code": "ESL700",
    "subject": "ESL",
    "number": "700",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Media",
    "fullname": "Topics in the Media",
    "info": "News media as means of English improvement and as source of information/entertainment. International news events via radio broadcasts, newspaper, and other sources. Understanding American culture. Developing listening/speaking skills using American movies/television.",
    "prereq": []
  },
  {
    "uid": "010379",
    "code": "ESL701",
    "subject": "ESL",
    "number": "701",
    "honors": false,
    "writingIntensive": false,
    "name": "Top in Am Culture",
    "fullname": "Topics in American Culture",
    "info": "Areas of U.S. culture such as humor, religions, ethnic groups, lifestyles, and popular culture.",
    "prereq": []
  },
  {
    "uid": "788179",
    "code": "ESL712",
    "subject": "ESL",
    "number": "712",
    "honors": false,
    "writingIntensive": false,
    "name": "Gram Through Writing",
    "fullname": "Grammar Through Writing",
    "info": "Production of grammatically sophisticated structures in writing. Students edit their assignments.",
    "prereq": []
  },
  {
    "uid": "787636",
    "code": "ESL713",
    "subject": "ESL",
    "number": "713",
    "honors": false,
    "writingIntensive": false,
    "name": "Grammar Through Writing",
    "fullname": "Grammar Through Writing",
    "info": "Production of grammatically sophisticated structures in writing. Students edit their assignments.",
    "prereq": []
  },
  {
    "uid": "015780",
    "code": "ESL732",
    "subject": "ESL",
    "number": "732",
    "honors": false,
    "writingIntensive": false,
    "name": "High Adv Oral Skills",
    "fullname": "High Advanced Oral Skills",
    "info": "Continuation of 0731",
    "prereq": []
  },
  {
    "uid": "015782",
    "code": "ESL741",
    "subject": "ESL",
    "number": "741",
    "honors": false,
    "writingIntensive": false,
    "name": "High Adv Listening",
    "fullname": "High Advanced Listening Comprehension",
    "info": "Lecture comprehension with special attention to note taking, recognizing main ideas and support, and understanding relationship of ideas, implied information, and structure of speech; comprehension of information presented in a wide variety of authentic materials.",
    "prereq": []
  },
  {
    "uid": "015783",
    "code": "ESL751",
    "subject": "ESL",
    "number": "751",
    "honors": false,
    "writingIntensive": false,
    "name": "High Adv. Speaking",
    "fullname": "High Advanced Speaking/Pronunciation",
    "info": "Emphasizes use of spoken English in academic settings, including presentation skills and discussion skills; pronunciation focuses on individual needs of students.",
    "prereq": []
  },
  {
    "uid": "015784",
    "code": "ESL761",
    "subject": "ESL",
    "number": "761",
    "honors": false,
    "writingIntensive": false,
    "name": "High Adv Reading",
    "fullname": "High Advanced Reading",
    "info": "Continued development of strategies to increase reading efficiency and comprehension; paraphrasing/summarizing text; quoting and citing sources; understanding writer.s perspective.",
    "prereq": []
  },
  {
    "uid": "015785",
    "code": "ESL771",
    "subject": "ESL",
    "number": "771",
    "honors": false,
    "writingIntensive": false,
    "name": "High-Adv Comp",
    "fullname": "High Advanced Composition",
    "info": "Refining of skills needed in the writing process; refinement of use of complex grammatical structures; research to support writing.",
    "prereq": []
  },
  {
    "uid": "802099",
    "code": "ESL785",
    "subject": "ESL",
    "number": "785",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Speaking",
    "fullname": "Speaking for Academic Purposes",
    "info": "American academic interactions. Lectures,  presentations, seminar-style discussions, informal exchanges. Presenting oneself professionally/socially in collegial settings with accuracy, variety, and flexibility.",
    "prereq": []
  },
  {
    "uid": "010348",
    "code": "ESL80",
    "subject": "ESL",
    "number": "80",
    "honors": false,
    "writingIntensive": false,
    "name": "Engl thru Lit",
    "fullname": "English Through Literature",
    "info": "An advanced course designed for students who want further practice in reading, listening, speaking and writing for non-academic purposes.",
    "prereq": []
  },
  {
    "uid": "009286",
    "code": "ESL800",
    "subject": "ESL",
    "number": "800",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Skills",
    "fullname": "Academic Skills for the American University",
    "info": "English language needed to interact within university setting.  Academic life, student/instructor roles, communicating by email, classroom interactions, discussion/panel presentation skills. ",
    "prereq": []
  },
  {
    "uid": "787639",
    "code": "ESL831",
    "subject": "ESL",
    "number": "831",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High Begin Oral Skills",
    "fullname": "SIEP: High Beginning Oral Skills Workshop",
    "info": "English spoken language skills.",
    "prereq": []
  },
  {
    "uid": "801669",
    "code": "ESL832",
    "subject": "ESL",
    "number": "832",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Intermediate Oral Skills",
    "fullname": "SIEP: Intermediate Oral Skills Workshop",
    "info": "English language speaking skills.",
    "prereq": []
  },
  {
    "uid": "801671",
    "code": "ESL833",
    "subject": "ESL",
    "number": "833",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High Intermed Oral Skill",
    "fullname": "SIEP: High Intermediate Oral Skills Workshop",
    "info": "English language speaking skills.",
    "prereq": []
  },
  {
    "uid": "801672",
    "code": "ESL834",
    "subject": "ESL",
    "number": "834",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Advanced Oral Skills",
    "fullname": "SIEP: Advanced Oral Skills Workshop",
    "info": "English language speaking skills.",
    "prereq": []
  },
  {
    "uid": "787640",
    "code": "ESL841",
    "subject": "ESL",
    "number": "841",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP:  High Begin Community",
    "fullname": "SIEP: High Beginning Community Contact",
    "info": "Community contact for English language learners.",
    "prereq": []
  },
  {
    "uid": "801676",
    "code": "ESL842",
    "subject": "ESL",
    "number": "842",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Intermed Community",
    "fullname": "SIEP: Intermediate Community Contact",
    "info": "Community contact for English language learners.",
    "prereq": []
  },
  {
    "uid": "801673",
    "code": "ESL843",
    "subject": "ESL",
    "number": "843",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, High Intermed Community",
    "fullname": "SIEP: High Intermediate Community Contact",
    "info": "Community contact for English language learners.",
    "prereq": []
  },
  {
    "uid": "801674",
    "code": "ESL844",
    "subject": "ESL",
    "number": "844",
    "honors": false,
    "writingIntensive": false,
    "name": "SIEP, Advanced Community",
    "fullname": "SIEP: Advanced Community Contact",
    "info": "Community contact for English Language learners.",
    "prereq": []
  },
  {
    "uid": "787642",
    "code": "ESL860",
    "subject": "ESL",
    "number": "860",
    "honors": false,
    "writingIntensive": false,
    "name": "ESL, D2",
    "fullname": "High Advanced English as a Second Language: D2",
    "info": "English grammar, reading, writing, speaking/pronunciation, and listening at high advanced level. Developing strategies for expanding/activating vocabulary. Developing reading speed, finding main ideas, understanding supporting details. Letter/journal/academic writing through essays and research papers. Idioms, reduced forms.",
    "prereq": []
  },
  {
    "uid": "787643",
    "code": "ESL870",
    "subject": "ESL",
    "number": "870",
    "honors": false,
    "writingIntensive": false,
    "name": "ESL, A1",
    "fullname": "English as a Second Language for Admitted Students: A1",
    "info": "English grammar, reading, writing, speaking/pronunciation, and listening at advanced level. Active use of advanced structures in writing/speaking. Reading passages of cultural interest. Letter/journal/academic writing. Informal English for everyday purposes (idioms/reductions). Conversation, formal discussion, and presentation skills.",
    "prereq": []
  },
  {
    "uid": "787644",
    "code": "ESL880",
    "subject": "ESL",
    "number": "880",
    "honors": false,
    "writingIntensive": false,
    "name": "ESL, A2",
    "fullname": "English as a Second Language for Admitted Students: A2",
    "info": "English grammar, reading, writing, speaking/pronunciation, and listening at high advanced level. Developing strategies for expanding/activating vocabulary. Developing reading speed, finding main ideas, understanding supporting details. Letter/journal/academic writing through essays, research papers. Practice with idioms, reduced forms.",
    "prereq": []
  },
  {
    "uid": "010375",
    "code": "ESL90",
    "subject": "ESL",
    "number": "90",
    "honors": false,
    "writingIntensive": false,
    "name": "Engl thru Music",
    "fullname": "English Through Music",
    "info": "Student will learn English vocabulary and culture through folksongs and by looking at popular music in various decades.",
    "prereq": []
  },
  {
    "uid": "792804",
    "code": "ESL900",
    "subject": "ESL",
    "number": "900",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Issues in the Media",
    "fullname": "Current Issues in the Media",
    "info": "This course is open to full-time or part-time students in the Intensive English Program (IEP) at level 3 or above. Current Issues in the Media is an integrated-skills class that focuses on topics of global interest and importance. Students will develop English communication skills as they think critically about issues in the media and respond to authentic media material in English. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "793143",
    "code": "ESL901",
    "subject": "ESL",
    "number": "901",
    "honors": false,
    "writingIntensive": false,
    "name": "American Culture",
    "fullname": "American Culture",
    "info": "This course is open to full-time or part-time students in the Intensive English Program (IEP) at level 3 or above. American Culture is an integrated-skills course that focuses on key elements of culture and core U.S. values such as diversity, freedom, independence, and hard work. Students will develop English communication skills as they think critically about the concept of culture and how U.S. culture compares to other cultures. prereq: a first language other than English",
    "prereq": []
  },
  {
    "uid": "793144",
    "code": "ESL902",
    "subject": "ESL",
    "number": "902",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Skills",
    "fullname": "Academic Skills for the American University",
    "info": "This course is open to students enrolled in the Intensive English Program (IEP) at level 3 and above. This course will help students with a first language other than English polish their English skills in order to be successful in university level classes. Topics will cover the English language needed to interact within university settings. Some topics of focus are academic life, student/instructor roles, communicating by email, classroom interactions, and discussion/panel presentation skills. Prrequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "793145",
    "code": "ESL903",
    "subject": "ESL",
    "number": "903",
    "honors": false,
    "writingIntensive": false,
    "name": "Business English",
    "fullname": "Business English",
    "info": "Oral/written communication skills in business setting.prereq: Non-native English speaker",
    "prereq": []
  },
  {
    "uid": "802118",
    "code": "ESL904",
    "subject": "ESL",
    "number": "904",
    "honors": false,
    "writingIntensive": false,
    "name": "TOEFL Prep",
    "fullname": "TOEFL Preparation",
    "info": "This course is designed for non-native speakers of English who have high-intermediate to advanced English skills and who want to learn important test-taking skills in preparation for taking the internet-based Test of English as a Foreign Language (TOEFL iBT).  This course offers intensive review of the four skills assessed on this exam: reading, written expression, listening, and speaking.  In addition, students will review the grammatical structures of English, explore common question types, and advance test-taking strategies.  While this course focuses on the TOEFL (iBT), the test-taking skills and language review covered in this course would also be useful for students preparing to take the paper-based TOEFL, IELTS, or other English proficiency assessments.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "804905",
    "code": "ESL905",
    "subject": "ESL",
    "number": "905",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in ESL",
    "fullname": "Topics in ESL",
    "info": "Varying topics in learning English as a second language.prereq: Non-native speaker of English",
    "prereq": []
  },
  {
    "uid": "809979",
    "code": "ESL906",
    "subject": "ESL",
    "number": "906",
    "honors": false,
    "writingIntensive": false,
    "name": "Eng for Business Interactions",
    "fullname": "English for Business Interactions",
    "info": "This course is designed for advanced speakers for whom English is not a first language who are currently in a graduate program in business or a closely related graduate program. The goal of this course is to help students polish their English skills for effective and culturally appropriate communication in the world of business.  The course covers topics such as email for business communication, successful group work, cultural values, communication styles, interviewing, networking, and delivering effective presentations. This course has two major objectives: 1) to help students improve their English skills for internship- or job-seeking purposes, and 2) to help students improve their language, communication, and teamwork skills for use in a professional context in the U.S.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "811742",
    "code": "ESL907",
    "subject": "ESL",
    "number": "907",
    "honors": false,
    "writingIntensive": false,
    "name": "Eng for Science & Engineering",
    "fullname": "English for Science and Engineering",
    "info": "Zero-credit course is designed for students who are high-intermediate to advanced non-native speakers of English in Intensive English Program (IEP) preparing for admission to science/engineering programs at university level. Open to students at higher levels in Intensive English Program in Minnesota English Language Program (MELP).prereq: Non-native English Speaker, dept consent",
    "prereq": []
  },
  {
    "uid": "816512",
    "code": "ESL909",
    "subject": "ESL",
    "number": "909",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading for Academic Purposes",
    "fullname": "Reading for Academic Purposes",
    "info": "This course is designed for students who are high-intermediate to advanced speakers of English in the Intensive English Program at the Minnesota English Language Program preparing for admission to academic programs at the university level. Students taking this course will develop skills and strategies for reading authentic college-level texts and managing unfamiliar vocabulary. Students will improve their ability to apply reading strategies, analyze, critique, and use critical thinking to synthesize information from a variety of texts such as authentic college textbook chapters, shorter essays, and news articles. Students will respond with their own ideas in writing and discussion and will demonstrate comprehension through tests, quizzes, written assignments, and discussion. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "015755",
    "code": "ESL911",
    "subject": "ESL",
    "number": "911",
    "honors": false,
    "writingIntensive": false,
    "name": "Fundamentals in ESL",
    "fullname": "Fundamentals in English as a Second Language",
    "info": "Basic knowledge/skills needed for daily communication in spoken English.  Grammatical structures explained with reference to their uses in social situations. Pronunciation.",
    "prereq": []
  },
  {
    "uid": "015756",
    "code": "ESL912",
    "subject": "ESL",
    "number": "912",
    "honors": false,
    "writingIntensive": false,
    "name": "Fundamentals in ESL",
    "fullname": "Fundamentals in English as a Second Language",
    "info": "Basic knowledge/skills needed for daily communication in spoken English.  Grammatical structures explained with reference to their uses in social situations. Pronunciation.",
    "prereq": []
  },
  {
    "uid": "801684",
    "code": "ESL921",
    "subject": "ESL",
    "number": "921",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Writing",
    "fullname": "Academic Writing",
    "info": "This course focuses on foundational writing skills and emphasizes the writing process - developing ideas, drafting, revising, and editing.  Guided textual analyses of readings are used to develop writing skills through the close examination of strategies employed by accomplished writers. Through ongoing, active participation, students learn to (1) match writing to audience and purpose, (2) produce different genres of academic writing, (3) incorporate source material into writing, and (4) critique their writing and that of others. Gains in writing skills culminate in students’ ability to transfer acquired skills into discipline-specific writing. Through development of personal voice and an appreciation for the importance of the credibility of the writer, students also learn to recognize and avoid plagiarism.   Problems with sentence structure, lexical grammar, and diction are addressed individually. This course meets with ESL 5302.  Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "015757",
    "code": "ESL931",
    "subject": "ESL",
    "number": "931",
    "honors": false,
    "writingIntensive": false,
    "name": "Academic Speaking",
    "fullname": "Academic Speaking",
    "info": "The goal of this course is to help speakers of English who are already at the advanced level develop the skills needed to participate in American academic interactions at the university level of various types: presentations, group presentations, seminar-style discussions, and informal exchanges. In this class, students learn to present themselves professionally and socially in academic settings with accuracy, variety, and flexibility. They learn to organize and outline academic presentations, present information clearly and effectively, explain concepts and processes from their academic field, involve audience members, respond to questions, and monitor and improve their spoken fluency, grammar, and pronunciation. This course meets with ESL 3602. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "015758",
    "code": "ESL932",
    "subject": "ESL",
    "number": "932",
    "honors": false,
    "writingIntensive": false,
    "name": "Developing Fluency in ESL",
    "fullname": "Developing Fluency in English as a Second Language",
    "info": "Communication skills for social, academic, and professional purposes. Emphasizes listening/speaking. Content drawn from mass media.",
    "prereq": []
  },
  {
    "uid": "015759",
    "code": "ESL933",
    "subject": "ESL",
    "number": "933",
    "honors": false,
    "writingIntensive": false,
    "name": "Developing Fluency in ESL",
    "fullname": "Developing Fluency in English as a Second Language",
    "info": "Communication skills for social, academic, and professional purposes. Emphasizes listening/speaking. Content drawn from mass media.",
    "prereq": []
  },
  {
    "uid": "787645",
    "code": "ESL937",
    "subject": "ESL",
    "number": "937",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Bus Comm",
    "fullname": "International Business Communication",
    "info": "Oral communication in a business setting. English as used in international trade, finance, and marketing. Listening/speaking skills for business materials. E-mail, voice mail. Writing business letters.",
    "prereq": []
  },
  {
    "uid": "805480",
    "code": "ESL941",
    "subject": "ESL",
    "number": "941",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Writing",
    "fullname": "Research Writing for the American University",
    "info": "This course enables students to develop the methods of citation, conventions of style and organization, and critical reading and thinking skills necessary for writing college-level research papers. Students select topics derived from a contemporary academic theme provided by the instructor and, applying a process approach, produce a research paper. Students will learn to use the library effectively and will learn about writing resources on campus such as Peer Research Consultants and Student Writing Support.  Problems with structure and vocabulary usage are addressed individually.  This course meets with 3402. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "804906",
    "code": "ESL950",
    "subject": "ESL",
    "number": "950",
    "honors": false,
    "writingIntensive": false,
    "name": "Pronunciation Improvement",
    "fullname": "Pronunciation Improvement",
    "info": "This course meets with ESL 3550 and provides an overview of pronunciation in English. Pronunciation Improvement is designed for advanced students who want to polish their pronunciation skills in English. In order to improve awareness and production of sounds in spoken English, a variety of areas of pronunciation are covered while paying special attention to individual needs. Students will also be equipped with techniques for independent pronunciation practice. Topics covered include word stress, sentence stress, rhythm, intonation, and linking.Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "804651",
    "code": "ESL951",
    "subject": "ESL",
    "number": "951",
    "honors": false,
    "writingIntensive": false,
    "name": "English Pronunciation",
    "fullname": "English Pronunciation",
    "info": "This course is designed for advanced English speakers who want to polish their pronunciation skills in English. In order to improve students’ ability to understand and pronounce English, a variety of areas of pronunciation will be covered while paying special attention to individual difficulties. Students will also be equipped with techniques to practice pronunciation improvement on their own. Topics covered include English sounds (individually and in combination with other sounds), word stress, sentence stress, rhythm, intonation, linking, understanding fast speech, pronunciation, and spelling connections. This course meets with 3551. Prerequisite: a first language other than English",
    "prereq": []
  },
  {
    "uid": "015760",
    "code": "ESL971",
    "subject": "ESL",
    "number": "971",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Academic Writing",
    "fullname": "Advanced Academic Writing",
    "info": "Introduction to the use of library system and to types of writing required in graduate school courses. Developing/organizing ideas, drafting, revising/editing papers, writing essay exams.",
    "prereq": []
  },
  {
    "uid": "792806",
    "code": "ESL993",
    "subject": "ESL",
    "number": "993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies in ESL",
    "fullname": "Directed Studies in English as a Second Language",
    "info": "Directed study in English as a second language",
    "prereq": []
  },
  {
    "uid": "793146",
    "code": "ESL994",
    "subject": "ESL",
    "number": "994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies in ESL",
    "fullname": "Directed Studies in English as a Second Language",
    "info": "",
    "prereq": []
  },
  {
    "uid": "793147",
    "code": "ESL995",
    "subject": "ESL",
    "number": "995",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies in ESL",
    "fullname": "Directed Studies in English as a Second Language",
    "info": "",
    "prereq": []
  },
  {
    "uid": "793148",
    "code": "ESL996",
    "subject": "ESL",
    "number": "996",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies in ESL",
    "fullname": "Directed Studies in English as a Second Language",
    "info": "",
    "prereq": []
  }
]