[
  {
    "uid": "008150",
    "code": "ESPM1001",
    "subject": "ESPM",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshmen Orientation to ESPM",
    "fullname": "Freshmen Orientation to Environmental Sciences, Policy, and Management",
    "info": "Academic planning, ESPM careers, liberal education requirements, internships. Building relationships with other students/faculty, student life, information technology, critical computer skills. New freshmen.",
    "prereq": []
  },
  {
    "uid": "800465",
    "code": "ESPM1002",
    "subject": "ESPM",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Transfer Orientation Seminar",
    "fullname": "Transfer Orientation Seminar",
    "info": "This required course provides orientation and guidance in planning for students transferring into the environmental sciences, policy and management (ESPM) major. We will use course activities to enhance your success and sense of community at the University and within the ESPM major while we explore the major, maximizing your time at the University, and preparing you for an environmentally-focused career.",
    "prereq": []
  },
  {
    "uid": "012607",
    "code": "ESPM1011",
    "subject": "ESPM",
    "number": "1011",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in the Environment",
    "fullname": "Issues in the Environment",
    "info": "Introductory survey of environmental issues that explores the connections between environmental sciences, policy, and management. You will explore interrelationships between the environment and human society, as well as the underlying social, ethical, political and economic factors that affect those relationships.  You will also examine the roles for science, technology, policy, and environmental justice in meeting environmental challenges.  Asynchronous online lectures with weekly discussions in small groups.",
    "prereq": []
  },
  {
    "uid": "014339",
    "code": "ESPM1051",
    "subject": "ESPM",
    "number": "1051",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Environmental Science",
    "fullname": "Introduction to Environmental Science",
    "info": "Physical, chemical, and biological principles that shape our environment. Interactions between biological/physical components of Earth system. Current issues related to air/water pollution, urbanization, biodiversity, energy use, climate change, and interactions of human activities and the environment.",
    "prereq": []
  },
  {
    "uid": "798929",
    "code": "ESPM1145",
    "subject": "ESPM",
    "number": "1145",
    "honors": false,
    "writingIntensive": false,
    "name": "Quant Mthds for Env Sci & Mgrs",
    "fullname": "Quantitative Methods for Environmental Scientists and Managers I",
    "info": "Real world environmental science/management applications, methods required to solve associated problems. Emphasizes applications and computer-based solutions.",
    "prereq": []
  },
  {
    "uid": "008218",
    "code": "ESPM1201",
    "subject": "ESPM",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Conserv and Mgmt of Nat Res",
    "fullname": "Conservation and Management of Natural Resources",
    "info": "Issues/approaches associated with conserving/managing natural resources locally, Midwest, United States, and globally. Concepts of conserving/managing various renewable natural resources. Environmental ethics, conservation economics. Renewable resources: soil, forests, wildlife, fisheries, wind, solar power.",
    "prereq": []
  },
  {
    "uid": "811424",
    "code": "ESPM1202",
    "subject": "ESPM",
    "number": "1202",
    "honors": false,
    "writingIntensive": false,
    "name": "People, Land, and Water",
    "fullname": "People, Land, and Water: Systems Under Stress",
    "info": "Policies/community engagement around water sustainability. Students engage directly with local case on Mississippi River.",
    "prereq": []
  },
  {
    "uid": "008079",
    "code": "ESPM1425",
    "subject": "ESPM",
    "number": "1425",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Weather and Climate",
    "fullname": "Introduction to Weather and Climate",
    "info": "pre-calculus introduction to the nature of the atmosphere and its behavior. Topics covered include atmospheric composition, structure, stability, and motion; precipitation processes, air masses, fronts, cyclones, and anticyclones; general weather patterns; meteorological instruments and observation; weather map analysis; and weather forecasting.",
    "prereq": []
  },
  {
    "uid": "791045",
    "code": "ESPM1480",
    "subject": "ESPM",
    "number": "1480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Natural Resources",
    "fullname": "Topics in Natural Resources",
    "info": "Lectures by visiting scholar or regular staff member. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "797454",
    "code": "ESPM1901",
    "subject": "ESPM",
    "number": "1901",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics:  Freshman Seminar",
    "fullname": "Topics:  Freshman Seminar",
    "info": "Topics vary.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "796581",
    "code": "ESPM1905",
    "subject": "ESPM",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Freshman Seminar: Topics Vary",
    "prereq": []
  },
  {
    "uid": "799011",
    "code": "ESPM1906W",
    "subject": "ESPM",
    "number": "1906",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Issues/topics related to natural resources and the environment. Topics vary each semester.",
    "prereq": []
  },
  {
    "uid": "798928",
    "code": "ESPM2021",
    "subject": "ESPM",
    "number": "2021",
    "honors": false,
    "writingIntensive": false,
    "name": "Env Sci: Integratd Prob Solvng",
    "fullname": "Environmental Sciences: Integrated Problem Solving",
    "info": "Environmental issues facing the world today are increasingly complex. Challenges such as global climate change, air and water quality impairments, land use change for forest and agricultural production, and species conservation require an ability to conceptualize problems broadly so that solutions are crafted in a manner that addresses a multitude of perspectives and considerations.  This course will use an interdisciplinary case-study approach to expose students to the most important environmental problems facing society today as well as innovative solutions.  The case studies include investigations of ecosystem services, invasive species and pollution remediation, with world experts on these topics leading the discussions.  Throughout, a focus on interdisciplinary analysis, including linkages to environmental grand challenges will be emphasized.  An interactive approach will be utilized as well, in which students work in groups and engage in class discussions as ways to internalize and conceptualize information.       prereq: 1011, ESPM major",
    "prereq": {
      "code": "ESPM 1011",
      "subject": "ESPM",
      "id": "1011"
    }
  },
  {
    "uid": "798930",
    "code": "ESPM2401",
    "subject": "ESPM",
    "number": "2401",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Education",
    "fullname": "Environmental Education/Interpretation",
    "info": "Foundational view of environmental education/interpretation, its history, theories, and methodologies. Practical skills for teaching in the outdoors. Educational content, state/national standards, effective pedagogy for informal learning environments.",
    "prereq": []
  },
  {
    "uid": "820503",
    "code": "ESPM2886",
    "subject": "ESPM",
    "number": "2886",
    "honors": false,
    "writingIntensive": false,
    "name": "Pollinator Conservation",
    "fullname": "Pollinator Conservation: From Biodiversity to Food Production",
    "info": "Flowers are strikingly beautiful as their main purpose is to attract an animal that will transfer pollen and produce seeds. In fact, nearly 300,000 species of plants rely on these animal pollinators. Pollinators include a diverse suite of organisms including insects, mammals, birds, and even lizards. One of the most important groups of pollinators, the bees, contain over 20,000 species. Through a mix of readings, active learning activities and lectures, this course will allow students to learn about the biology, conservation, and importance of pollinators. The first portion of the class will focus on the fascinating biology of pollination and pollinators, including mutualisms, trickery and other complex species interactions. Students will explore the evolutionary biology of plant-pollinator interactions and how the millions of years of interactions between plants and pollinators have led to diverse array of colors, smells and floral forms we see today. The second section of the course will explore actions of pollinators in terms of honey production, crop pollination, economics and cultural appreciation. Students will explore how pollinators contribute to human society and how the actions of humans impact pollinator populations. Both sections will be viewed through a lens of pollinator conservation and environmental policy. Here students will be expected to ability to locate and evaluate scientific information and think critically how science does and does not affect environmental policy.",
    "prereq": []
  },
  {
    "uid": "013545",
    "code": "ESPM3000",
    "subject": "ESPM",
    "number": "3000",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem on Current Issues for ESPM",
    "fullname": "Seminar on Current Issues for ESPM",
    "info": "Environmental issues students will have to address in their future careers. Small group discussion, in-depth/focused intellectual debate. Topics depend on faculty selection or student interest.",
    "prereq": []
  },
  {
    "uid": "009308",
    "code": "ESPM3001",
    "subject": "ESPM",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Treaty Rights & Natural Resrcs",
    "fullname": "Treaty Rights and Natural Resources",
    "info": "Readings, class discussion about nature of treaty rights reserved by indigenous Americans with respect to utilization of natural resources. Emphasizes Midwest issues. Web-assisted course. ",
    "prereq": []
  },
  {
    "uid": "009318",
    "code": "ESPM3011W",
    "subject": "ESPM",
    "number": "3011",
    "honors": false,
    "writingIntensive": true,
    "name": "Ethics in Natural Resources",
    "fullname": "Ethics in Natural Resources",
    "info": "Normative/professional ethics, and leadership considerations, applicable to managing natural resources and the environment. Readings, discussion.",
    "prereq": []
  },
  {
    "uid": "799507",
    "code": "ESPM3012",
    "subject": "ESPM",
    "number": "3012",
    "honors": false,
    "writingIntensive": false,
    "name": "Stats Methods for Env Sci/Mgrs",
    "fullname": "Statistical Methods for Environmental Scientists and Managers",
    "info": "Introduction to statistical principles, foundations, and methods for examining data and drawing conclusions. Confidence intervals, hypothesis testing, analysis of variance, and regression modeling of relationships in environmental and natural resource science and management problems. Two years of high school math is strongly encouraged.",
    "prereq": []
  },
  {
    "uid": "819761",
    "code": "ESPM3014",
    "subject": "ESPM",
    "number": "3014",
    "honors": false,
    "writingIntensive": false,
    "name": "Tribal Resource Management",
    "fullname": "Tribal and Indigenous Natural Resource Management",
    "info": "This course is designed to develop and refine your understanding of tribal and Indigenous natural resource management, tribal and Indigenous perspectives, and responsibilities natural resource managers have for tribal and Indigenous communities. This course includes one eight-hour weekend field session.",
    "prereq": []
  },
  {
    "uid": "013460",
    "code": "ESPM3015",
    "subject": "ESPM",
    "number": "3015",
    "honors": false,
    "writingIntensive": false,
    "name": "Invasive Plants and Animals",
    "fullname": "Invasive Plants and Animals: Ecology and Management",
    "info": "Overview of invasive plants/animals in North America and around the world. A range of taxa are covered along with their impact and approaches to control. Readings, discussions, and lectures from experts on topics such as invasion theory and real world management.",
    "prereq": []
  },
  {
    "uid": "007161",
    "code": "ESPM3021",
    "subject": "ESPM",
    "number": "3021",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecol Veg Mgmt: Consultng Aprch",
    "fullname": "Ecological Vegetation Management: a Consulting Approach",
    "info": "Application of ecological concepts such as succession/competition to ecosystems under management. Wetlands, riparian zones, urban interfaces, agriculture, agroforestry. Northern/boreal conifer, hardwood forests, grasslands (prairie). Management objectives, methods, impacts. Evaluating practices for sustainability. Social issues. Regional (Great Lakes area), national, global case studies.",
    "prereq": []
  },
  {
    "uid": "795077",
    "code": "ESPM3031",
    "subject": "ESPM",
    "number": "3031",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied GPS for GIS",
    "fullname": "Applied Global Positioning Systems for Geographic Information Systems",
    "info": "GPS principles, operations, techniques to improve accuracy. Datum, projections, and coordinate systems. Differential correction, accuracy assessments discussed/applied in lab exercises. Code/carrier phase GPS used in exercises. GPS handheld units, PDA based ArcPad/GPS equipment.  Transferring field data to/from desktop systems, integrating GPS data with GIS.prereq: Intro GIS course",
    "prereq": []
  },
  {
    "uid": "819402",
    "code": "ESPM3051",
    "subject": "ESPM",
    "number": "3051",
    "honors": false,
    "writingIntensive": false,
    "name": "Lands and Humans in World Cult",
    "fullname": "Lands and Humans in World Cultures: the Past and the Present",
    "info": "This course focuses on globally diverse farming and land use practices and associated sustainability issues. By examining diverse land uses issues in different countries in the world, this course seeks to provide global perspective on the US and global land use practices and its sustainability.  This course seeks to build interdisciplinary perspectives to better understand the mechanisms and changes in diverse human-nature interactions via land. Class materials will be sourced from multiple disciplines including soil science, ecology, geology, geography, anthropology, and history.",
    "prereq": []
  },
  {
    "uid": "811696",
    "code": "ESPM3072",
    "subject": "ESPM",
    "number": "3072",
    "honors": false,
    "writingIntensive": false,
    "name": "Restoration Site Assessment",
    "fullname": "Site Assessment for Ecological Restoration",
    "info": "Introduction to site assessment/goal-setting for ecological restoration projects. Topography, soil, land use, hydrology, vegetation, biodiversity. Pre-requisite for other courses in series.",
    "prereq": []
  },
  {
    "uid": "811705",
    "code": "ESPM3073",
    "subject": "ESPM",
    "number": "3073",
    "honors": false,
    "writingIntensive": false,
    "name": "Restoration Seeding",
    "fullname": "Designing and Using Seed Mixes in Restoration",
    "info": "Various steps of restoration seeding including designing seed mixes, preparing planting sites, obtaining seed, installing seed, caring for establishing vegetation.",
    "prereq": []
  },
  {
    "uid": "811706",
    "code": "ESPM3074",
    "subject": "ESPM",
    "number": "3074",
    "honors": false,
    "writingIntensive": false,
    "name": "Restoration Planting",
    "fullname": "Designing, Installing, & Managing Native Plantings in Restoration",
    "info": "Successful steps for designing, installing, managing native species planting project.",
    "prereq": []
  },
  {
    "uid": "811707",
    "code": "ESPM3075",
    "subject": "ESPM",
    "number": "3075",
    "honors": false,
    "writingIntensive": false,
    "name": "Restoration Management",
    "fullname": "Vegetation Management of Restored Ecosystems",
    "info": "Re-establishing natural disturbances, controlling invasive species.",
    "prereq": []
  },
  {
    "uid": "811708",
    "code": "ESPM3076",
    "subject": "ESPM",
    "number": "3076",
    "honors": false,
    "writingIntensive": false,
    "name": "Restoration Monitoring",
    "fullname": "Monitoring Ecological Restorations",
    "info": "How to design efficient/effective monitoring program that yields information helpful for ongoing restoration management decisions/problem solving.",
    "prereq": []
  },
  {
    "uid": "008241",
    "code": "ESPM3101",
    "subject": "ESPM",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Conservt of Plant Biodiversity",
    "fullname": "Conservation of Plant Biodiversity",
    "info": "Introduction to principles underlying assessment/conservation of plant biodiversity at individual, population, and community levels. Case studies in management of biodiversity to restore/maintain ecosystem function. Issues such as genetics, timber harvesting, invasive species, plant reproduction.prereq: Biol 1001 or Biol 1009",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        }
      ]
    }
  },
  {
    "uid": "811417",
    "code": "ESPM3102",
    "subject": "ESPM",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Forests, Water and Land Use",
    "fullname": "Managing International Natural Resources Programs and Projects: Forests, Water and Land Use",
    "info": "Global hot spots where biodiversity is threatened by multiple stressors (zoonotic disease, rapid growth, opening of new frontiers, climate change). Strategies to address complex situations. Interdisciplinary applied skills, best management practices, hands-on techniques of international organizations.",
    "prereq": []
  },
  {
    "uid": "798931",
    "code": "ESPM3108",
    "subject": "ESPM",
    "number": "3108",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecology of Managed Systems",
    "fullname": "Ecology of Managed Systems",
    "info": "Ecology of ecosystems that are primarily composed of managed plant communities, such as managed forests, field-crop agroecosystems, rangelands and nature reserves, parks, and urban open-spaces. Concepts of ecology and ecosystem management.prereq: BIOL 1001 or BIOL 1009 or HORT 1001 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "HORT 1001",
          "subject": "HORT",
          "id": "1001"
        }
      ]
    }
  },
  {
    "uid": "791975",
    "code": "ESPM3111",
    "subject": "ESPM",
    "number": "3111",
    "honors": false,
    "writingIntensive": false,
    "name": "Hydro & Water Qual Fld Mthds",
    "fullname": "Hydrology and Water Quality Field Methods",
    "info": "Integrates water quality, surface/groundwater hydrology. Case studies, hands-on field data collection, calculations of hydrological/water quality parameters. Meteorological data, snow hydrology, stream gauging, well monitoring, automatic water samplers. Designing water quality sampling program. Geomorphology, interception, infiltration.",
    "prereq": []
  },
  {
    "uid": "794154",
    "code": "ESPM3128",
    "subject": "ESPM",
    "number": "3128",
    "honors": false,
    "writingIntensive": false,
    "name": "ES Seminar",
    "fullname": "Seminar: Environmental Science",
    "info": "Students analyze environmental topics presented by guest speakers. Job opportunities in environmental science. Resume writing, interviewing skills.",
    "prereq": []
  },
  {
    "uid": "792784",
    "code": "ESPM3131",
    "subject": "ESPM",
    "number": "3131",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Physics",
    "fullname": "Environmental Physics",
    "info": "Concepts and principles of classic and modern physics applied to environmental problems arising from interaction between humans and the natural environment. Forms of pollution (e.g., land, water, air). Transport mechanisms. Anthropogenic greenhouse gas emissions. Global climate change. Social issues related to environmental problems.prereq: Phys 1101",
    "prereq": {
      "code": "PHYS 1101",
      "subject": "PHYS",
      "id": "1101"
    }
  },
  {
    "uid": "014962",
    "code": "ESPM3202W",
    "subject": "ESPM",
    "number": "3202",
    "honors": false,
    "writingIntensive": true,
    "name": "Env Conflict Mgmt, Ldrshp, Pln",
    "fullname": "Environmental Conflict Management, Leadership, and Planning",
    "info": "Negotiation of natural resource management issues. Use of collaborative planning. Case study approach to conflict management, strategic planning, and building leadership qualities. Emphasizes analytical concepts, techniques, and skills.",
    "prereq": []
  },
  {
    "uid": "810630",
    "code": "ESPM3204",
    "subject": "ESPM",
    "number": "3204",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustain Com Based Nat Res Mgmt",
    "fullname": "Sustainable Community Based Natural Resource Management",
    "info": "One of the courses in the Nepal Semester Abroad Program. Study the principles of community managed natural resource based sustainable development in a developing country setting. International perspectives on sustainable resource use/management in developed/developing countries, including integration of social, economic, policy considerations related to natural resource management. Course includes visits to community forest user groups in Nepal with the opportunity to explore issues of sustainability related to development efforts within communities actively managing and conserving communal forest areas. Community forestry has been credited with protecting and reestablishing important habitat for animals such as wild elephants, rhinos and tigers in the Terai (lowland) region of Nepal.",
    "prereq": []
  },
  {
    "uid": "791974",
    "code": "ESPM3207",
    "subject": "ESPM",
    "number": "3207",
    "honors": false,
    "writingIntensive": false,
    "name": "Nat Res Based Sustain Develop",
    "fullname": "Natural Resource-based Sustainable Development in Costa Rica",
    "info": "Field trips. From conventional to organic bird-friendly coffee production/marketing to sustainable management of high-/low-land tropical forests and biodiversity. Lectures, seminars, labs, field work, written project.",
    "prereq": []
  },
  {
    "uid": "009736",
    "code": "ESPM3211",
    "subject": "ESPM",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Surv Meas Model for Env Analys",
    "fullname": "Survey, Measurement, and Modeling for Environmental Analysis",
    "info": "Survey, measurement, and modeling concepts/methods for study of natural resources/environmental issues. Emphasizes survey design for data collection, estimation, and analysis for issues encompassing land, water, air, vegetation, wildlife, and human/social variables.ESPM 3012 or FW 4001 or STAT 3011 or ANSC 3011 is strongly recommended.",
    "prereq": []
  },
  {
    "uid": "008004",
    "code": "ESPM3221",
    "subject": "ESPM",
    "number": "3221",
    "honors": false,
    "writingIntensive": false,
    "name": "Soil Conserv. & Land-Use Mngmt",
    "fullname": "Soil Conservation and Land-Use Management",
    "info": "This course is designed to provide a local and global historical perspective of soil erosion (causes and consequences); develop a scientific understanding of soil erosion processes; and relates various soil conservation and land-use management strategies to real-world situations.  Basics of soil erosion processes and prediction methods will be the fundamental building blocks of this course. From this understanding, we will discuss policies and socioeconomic aspects of soil erosion. Lastly, we will focus on effective land-use management using natural resource assessment tools. Case studies and real-world and current events examples will be used throughout the course to relate course material to experiences.prereq: SOIL 2125 or instr consent",
    "prereq": {
      "code": "SOIL 2125",
      "subject": "SOIL",
      "id": "2125"
    }
  },
  {
    "uid": "008207",
    "code": "ESPM3241W",
    "subject": "ESPM",
    "number": "3241",
    "honors": false,
    "writingIntensive": true,
    "name": "Natural Resource & Env Policy",
    "fullname": "Natural Resource and Environmental Policy",
    "info": "Political processes in management of the environment. How disagreements are addressed by different stakeholders, private-sector interests, government agencies, institutions, communities, and nonprofit organizations.",
    "prereq": []
  },
  {
    "uid": "006703",
    "code": "ESPM3245",
    "subject": "ESPM",
    "number": "3245",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustain Land Use Plng&Policy",
    "fullname": "Sustainable Land Use Planning and Policy",
    "info": "Policies affecting land use planning at local, state, and federal levels. Ecosystem and landscape scale planning. Collaborative and community-based approaches to planning for ecological, social, and economic sustainability. Class project applies interdisciplinary perspectives on planning and policy, including information gathering techniques, conservation planning tools, and evaluation of planning options.",
    "prereq": []
  },
  {
    "uid": "006695",
    "code": "ESPM3251",
    "subject": "ESPM",
    "number": "3251",
    "honors": false,
    "writingIntensive": false,
    "name": "NR in Sustain Int'l Developmnt",
    "fullname": "Natural Resources in Sustainable International Development",
    "info": "International perspectives on resource use and sustainable development. Integration of natural resource issues with social, economic, and policy considerations. Agriculture, forestry, agroforestry, non-timber forest products, water resources, certification, development issues. Global case studies. Impact of consumption in developed countries on sustainable development in lesser developed countries.",
    "prereq": []
  },
  {
    "uid": "005369",
    "code": "ESPM3261",
    "subject": "ESPM",
    "number": "3261",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ & Natural Resources Mgmt",
    "fullname": "Economics and Natural Resources Management",
    "info": "Microeconomic principles and their application to natural resource management problems. Economic and policy tools to address market failures. Discussion of regulatory and market-based instruments. Discounting and compounding concepts. Methods for conducting financial and economic analyses of natural resource management projects. Decision criteria when conducting benefit/cost analysis of natural resource projects. Methods for valuing non-market natural resource goods and services. Economics of managing renewable natural resources such as forests and fisheries. Land economics. Payments for environmental services. Planning and management problems. Case studies.College algebra or equivalent is highly recommended.",
    "prereq": []
  },
  {
    "uid": "798932",
    "code": "ESPM3271",
    "subject": "ESPM",
    "number": "3271",
    "honors": false,
    "writingIntensive": false,
    "name": "Envmntl Policy Law & Hum Behav",
    "fullname": "Environmental Policy, Law, and Human Behavior",
    "info": "What is necessary to achieve sustainable societies. What influences societal deliberation/decisions about environmental issues. How our behaviors affect natural systems. Key theoretical concepts of environmental social psychology and political science. How people respond to policies, using theoretical concepts from social psychology about attitudes, values, and social norms; applying these ideas to specific environmental problems and ethical debates.",
    "prereq": []
  },
  {
    "uid": "805357",
    "code": "ESPM3425",
    "subject": "ESPM",
    "number": "3425",
    "honors": false,
    "writingIntensive": false,
    "name": "From Smog to Climate Change",
    "fullname": "Atmospheric Pollution: From Smog to Climate Change",
    "info": "Processes governing chemical makeup of Earth's atmosphere. Implications for air pollution, climate, human welfare. Evolution of atmosphere. Atmospheric structure/transport. Biogeochemical cycles of carbon, nitrogen, oxygen, mercury.  Greenhouse effect. Aerosols. Stratospheric ozone loss.prereq: [CHEM 1061, PHYS 1101W, MATH 1142 or 1271] or equiv or instr consent",
    "prereq": {
      "and": [
        {
          "code": "CHEM 1061",
          "subject": "CHEM",
          "id": "1061"
        },
        {
          "code": "PHYS 1101W",
          "subject": "PHYS",
          "id": "1101W"
        },
        {
          "code": "MATH 1142",
          "subject": "MATH",
          "id": "1142"
        },
        {
          "code": "ESPM 1271",
          "subject": "ESPM",
          "id": "1271"
        }
      ]
    }
  },
  {
    "uid": "791046",
    "code": "ESPM3480",
    "subject": "ESPM",
    "number": "3480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Natural Resources",
    "fullname": "Topics in Natural Resources",
    "info": "Lectures by visiting scholar or regular staff member. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "010598",
    "code": "ESPM3575",
    "subject": "ESPM",
    "number": "3575",
    "honors": false,
    "writingIntensive": false,
    "name": "Wetlands",
    "fullname": "Wetlands",
    "info": "Freshwater wetland classification, wetland biota, current/historic status of wetlands, value of wetlands. National, regional, Minnesota wetlands conservation strategies, ecological principles used in wetland management.",
    "prereq": []
  },
  {
    "uid": "016125",
    "code": "ESPM3601",
    "subject": "ESPM",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustain Hsg-Comm Environ Tech",
    "fullname": "Sustainable Housing--Community, Environment, and Technology",
    "info": "How sustainable housing practices build community. How community growth has impacted the environment and how natural events impact our communities. Science and technology required to build high performance houses.",
    "prereq": []
  },
  {
    "uid": "797589",
    "code": "ESPM3602",
    "subject": "ESPM",
    "number": "3602",
    "honors": false,
    "writingIntensive": false,
    "name": "Regs & Corp Environ Mgmt",
    "fullname": "Regulations and Corporate Environmental Management",
    "info": "Concepts/issues relating to industrial ecology and industry as they are influenced by current standards/regulations at local, state, and national levels.prereq: APEC 1101 or ECON 1101 or 3261W",
    "prereq": {
      "or": [
        {
          "code": "APEC 1101",
          "subject": "APEC",
          "id": "1101"
        },
        {
          "code": "ECON 1101",
          "subject": "ECON",
          "id": "1101"
        },
        {
          "code": "ESPM 3261",
          "subject": "ESPM",
          "id": "3261"
        }
      ]
    }
  },
  {
    "uid": "797590",
    "code": "ESPM3603",
    "subject": "ESPM",
    "number": "3603",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Life Cycle Anlys",
    "fullname": "Environmental Life Cycle Analysis",
    "info": "Concepts/issues relating to inventory, subsequent analysis of production systems. Production system from holistic point of view, using term commonly used in industrial ecology: \"metabolic system.\"",
    "prereq": []
  },
  {
    "uid": "797591",
    "code": "ESPM3604",
    "subject": "ESPM",
    "number": "3604",
    "honors": false,
    "writingIntensive": false,
    "name": "Env Mgmt Systems & Strategy",
    "fullname": "Environmental Management Systems and Strategy",
    "info": "Environmental problems such as climate change, ozone depletion, and loss of biodiversity.",
    "prereq": []
  },
  {
    "uid": "797592",
    "code": "ESPM3605",
    "subject": "ESPM",
    "number": "3605",
    "honors": false,
    "writingIntensive": false,
    "name": "Recycling:Extending Materials",
    "fullname": "Recycling: Extending Raw Materials",
    "info": "Basic principles of recycling and its role in raw materials utilization, energy, and the environment. Recycling processes for commonly recycled materials, products, and their properties and environmental implications of recycling.",
    "prereq": []
  },
  {
    "uid": "797593",
    "code": "ESPM3606W",
    "subject": "ESPM",
    "number": "3606",
    "honors": false,
    "writingIntensive": true,
    "name": "Pollution Prevention",
    "fullname": "Pollution Prevention: Principles, Technologies, and Practices",
    "info": "Pollution prevention, green chemistry, cleaner production, Design for the Environment (DfE), life cycle management. Practices and technologies that reduce industrial emissions/costs by preventing pollution.",
    "prereq": []
  },
  {
    "uid": "012531",
    "code": "ESPM3607",
    "subject": "ESPM",
    "number": "3607",
    "honors": false,
    "writingIntensive": false,
    "name": "Natural Resource Consumption",
    "fullname": "Natural Resources Consumption and Sustainability",
    "info": "Current world trends for industrial raw materials; environmental/other tradeoffs related to options for satisfying demand/needs; global and systemic thinking;  provides a framework for beginning a process of thinking critically about complex environmental problems/potential solutions in a diverse global economy.",
    "prereq": []
  },
  {
    "uid": "005367",
    "code": "ESPM3612W",
    "subject": "ESPM",
    "number": "3612",
    "honors": false,
    "writingIntensive": true,
    "name": "Soil & Environmental Biology",
    "fullname": "Soil and Environmental Biology",
    "info": "Properties of microorganisms that impact soil fertility, structure, and quality. Nutrient requirements of microbes and plants and mineral transformations in biogeochemical cycling. Symbiotic plant/microbe associations and their role in sustainable agricultural production. Biodegradation of pollutants and bioremediation approaches.prereq: Biol 1009 or equiv, Chem 1021 or equiv; SOIL 2125 recommended",
    "prereq": {
      "and": [
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "CHEM 1021",
          "subject": "CHEM",
          "id": "1021"
        },
        {
          "code": "SOIL 2125",
          "subject": "SOIL",
          "id": "2125"
        }
      ]
    }
  },
  {
    "uid": "809297",
    "code": "ESPM3656",
    "subject": "ESPM",
    "number": "3656",
    "honors": false,
    "writingIntensive": false,
    "name": "Composting & Organics Utiliz",
    "fullname": "Composting and Organics Utilization",
    "info": "Practical introduction to composting technology and organics utilization for undergraduate students and industry professionals. How organics can be utilized in soils. Scientific steps involved in compost process. Application methods and rates.prereq: SOIL 2125",
    "prereq": {
      "code": "SOIL 2125",
      "subject": "SOIL",
      "id": "2125"
    }
  },
  {
    "uid": "791982",
    "code": "ESPM3703",
    "subject": "ESPM",
    "number": "3703",
    "honors": false,
    "writingIntensive": false,
    "name": "Agroforestry in Watershed Mgmt",
    "fullname": "Agroforestry in Watershed Management",
    "info": "Biological, physical, and environmental attributes of agroforestry as pertains to watershed management. Coupling production with watershed protection benefits. Implications for policy, economics, and human dimensions in sustainable development. Examples, case studies from North America and from developing countries.",
    "prereq": []
  },
  {
    "uid": "817688",
    "code": "ESPM3777",
    "subject": "ESPM",
    "number": "3777",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change-Physics & Myths",
    "fullname": "Climate Change- Physics, Myths, Mysteries, and Uncertainties",
    "info": "Climate variations are the norm; not the exception. The geological and archaeological records are rich with evidence of a climate system that is dynamic and non-steady state. Yet we face the challenges of understanding the complexities of this system in order to manage our natural resources and to prepare wisely for the future. This class examines the basic theory and Physics behind the atmospheric greenhouse effect and radiative forcings in the climate system. The Myths, Mysteries, and Uncertainties about the climate record and feedback processes operating in the Earth-Atmosphere system will be examined. Simple models will be used to demonstrate the atmospheric greenhouse effect. Sophisticated numerical weather models, such as the Regional Weather and Forecast Chemistry (WRF-CHEM) model, will be used to demonstrate climate predictions and biophysical feedback processes. We will also study some of the classic Warming Papers that provide the physical scientific basis for the anthropogenic greenhouse effect. Finally, we will explore the uncertainties related to climate predictions and how scientists use fingerprint techniques to diagnose natural versus anthropogenic climate signals. There is no prerequisite required for this course, but first year calculus and one other first year science course is recommended.",
    "prereq": []
  },
  {
    "uid": "818779",
    "code": "ESPM3921",
    "subject": "ESPM",
    "number": "3921",
    "honors": false,
    "writingIntensive": false,
    "name": "Science and Critical Thinking",
    "fullname": "Science and Critical Thinking for Understanding Our World",
    "info": "Today more than ever we must deal with multiple sources of conflicting information on topics that affect our lives in big ways.  We use this information to make important decisions, from major policy decisions to personal lifestyle choices. Understanding complex, high-stakes societal issues such as the global COVID-19 pandemic requires that we rapidly process and synthesize new science that is changing fast, and that we do so in an environment of partisan bias and media spin that make it extremely difficult for citizens to stay informed and make good decisions. The debate surrounding the response to COVID-19, climate change, water policy, and other planetary and human health issues, invoke moral or ethical principles in addition to scientific arguments. As a result, problem solving and decision making requires simultaneously evaluating complex scientific and ethical arguments. Several aspects of human psychology mean that we do not reliably make logical choices when presented with complex information. Furthermore, data and science are frequently used to mislead, from the naïve misuse of statistics to deliberate misinformation campaigns. As a result, weighing evidence and rational decision-making for complex issues requires skepticism, critical thinking, and lots of practice. In this course, students will develop critical thinking tools and cultivate scientific skepticism for evaluating claims encountered in peer-reviewed scientific papers, popular press articles, or on social media. Examples and case studies will draw heavily on current events surrounding the COVID-19 pandemic and associated societal and environmental responses,  but will also include other environmental, health, and public policy issues to demonstrate the range of ways in which data and science can be used or misused to support a position. To create the necessary habits of mind for skepticism and critical thinking, this course will cover background material from ethics, neurology, behavioral economics, statistics, and logic. We will employ a number of active learning strategies, and class meetings will frequently consist of students actively engaged in processing and understanding course content. Upon leaving this course students will be able to confidently evaluate the veracity of information as they encounter it in multiple contexts throughout their lives. Students will understand how views of the role of ethics in scientific inquiry have evolved, and the roles of science, uncertainty, and ethics in determining public opinion and policy decisions on environmental topics. Students will learn to identify and recognize misinformation in its various forms and to articulate why a particular piece of information is misleading. We will explore the various ways that our intuition and memory make interpreting data and statistics challenging, and develop tools and habits of mind to overcome these challenges.",
    "prereq": []
  },
  {
    "uid": "792707",
    "code": "ESPM3993",
    "subject": "ESPM",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. Prereq: Department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements",
    "prereq": []
  },
  {
    "uid": "792708",
    "code": "ESPM3994",
    "subject": "ESPM",
    "number": "3994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use the University-wide on-line directed research contract process in order to enroll. Prereq: Department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "005363",
    "code": "ESPM4021W",
    "subject": "ESPM",
    "number": "4021",
    "honors": false,
    "writingIntensive": true,
    "name": "Problem Solving: Env Review",
    "fullname": "Problem Solving: Environmental Review",
    "info": "Roles of governmental agencies, consultants, and private citizens in EIS process. Students read EIS/EAW, analyze their content/scope, and prepare an EAW and EIS according to Minnesota EQB guidelines.prereq: ESPM 2021 and jr or sr",
    "prereq": {
      "code": "ESPM 2021",
      "subject": "ESPM",
      "id": "2021"
    }
  },
  {
    "uid": "798953",
    "code": "ESPM4041W",
    "subject": "ESPM",
    "number": "4041",
    "honors": false,
    "writingIntensive": true,
    "name": "Prob Solvng for Environ Change",
    "fullname": "Problem Solving for Environmental Change",
    "info": "Capstone course. Students working with a team on a real world project related to selected track, gather/analyze data relevant to client's objectives, and make recommendations for future use. Students produce a final written report and formal presentation, and present findings to client group.",
    "prereq": []
  },
  {
    "uid": "012987",
    "code": "ESPM4061W",
    "subject": "ESPM",
    "number": "4061",
    "honors": false,
    "writingIntensive": true,
    "name": "Water Quality & Natural Resour",
    "fullname": "Water Quality and Natural Resources",
    "info": "Water quality decision making. International focus. Ecology of aquatic ecosystems, how they are valuable to society and changed by landscape management. Case studies, impaired waters, TMDL process, student engagement in simulating water quality decision making.",
    "prereq": []
  },
  {
    "uid": "012609",
    "code": "ESPM4096",
    "subject": "ESPM",
    "number": "4096",
    "honors": false,
    "writingIntensive": false,
    "name": "PEP:Internship",
    "fullname": "Professional Experience Program: Internship",
    "info": "Students create oral/written report based on paid or volunteered work or field experience.prereq: CFANS undergrad, instr consent, completed internship contract",
    "prereq": []
  },
  {
    "uid": "794165",
    "code": "ESPM4128",
    "subject": "ESPM",
    "number": "4128",
    "honors": false,
    "writingIntensive": false,
    "name": "ES Sr. Seminar",
    "fullname": "Senior Seminar: Environmental Science",
    "info": "Students analyze environmental topics presented by guest speakers. Job opportunities in environmental science. Resume writing, interviewing skills.",
    "prereq": []
  },
  {
    "uid": "007157",
    "code": "ESPM4195W",
    "subject": "ESPM",
    "number": "4195",
    "honors": false,
    "writingIntensive": true,
    "name": "Problm Solvng & Plnng in NR",
    "fullname": "Problem Solving and Planning in Natural Resources",
    "info": "Applying problem solving tools/skills in policy, planning, and managerial situations. Students work with \"real world\" clients, produce publishable technical report, and present their results in a professional public forum.",
    "prereq": []
  },
  {
    "uid": "788972",
    "code": "ESPM4216",
    "subject": "ESPM",
    "number": "4216",
    "honors": false,
    "writingIntensive": false,
    "name": "Contaminant Hydrology",
    "fullname": "Contaminant Hydrology",
    "info": "Principles of contaminant transport in percolate solution and in overland flow. Hydrologic cycle, percolation/runoff processes, contaminant transport, leachate sampling methods, remediation technologies, scale effects on runoff water quality, tillage technologies, control of sediment/chemical losses. Discussions mostly descriptive, but involve some computations.",
    "prereq": []
  },
  {
    "uid": "798933",
    "code": "ESPM4242",
    "subject": "ESPM",
    "number": "4242",
    "honors": false,
    "writingIntensive": false,
    "name": "Mthds: Envir/Nat Res Pol Anlys",
    "fullname": "Methods for Environmental and Natural Resource Policy Analysis",
    "info": "Methods, formal/informal, for analyzing environmental/natural resource policies. How to critically evaluate policies, using economic/non-economic decision-making criteria. Application of policy analysis to  environmental/natural resource problems. Recognizing politically-charged environment in which decisions over use, management, and protection of resources often occur.Prereqs: ESPM 3241W or ESPM 3271 and ESPM 3261, undergrads with  jr or sr standing.",
    "prereq": {
      "and": [
        {
          "code": "ESPM 3241W",
          "subject": "ESPM",
          "id": "3241W"
        },
        {
          "code": "ESPM 3271",
          "subject": "ESPM",
          "id": "3271"
        },
        {
          "code": "ESPM 3261",
          "subject": "ESPM",
          "id": "3261"
        }
      ]
    }
  },
  {
    "uid": "798934",
    "code": "ESPM4256",
    "subject": "ESPM",
    "number": "4256",
    "honors": false,
    "writingIntensive": false,
    "name": "NR Law & Mgmt of Pub Land/Wtr",
    "fullname": "Natural Resource Law and the Management of Public Lands and Waters",
    "info": "This course is intended to provide non-law students with an understanding of the role of the judiciary in the management of public lands and public waters. The course will examine Constitutional provisions affecting the management of public resources, the concept of property rights, major principles of water law, the role of the legal system in environmental review, the scope of legal authority granted to administrative agencies, and limitations of private property rights to protect public lands and public waters. The class will introduce students to the concepts of legal reasoning including case synthesis and analysis. The class will be taught using a combination of lecture, guest lectures, written exercises, and class participation. This course will be taught online.Prereqs: 3241W, juniors, seniors and graduate students or instructor permission",
    "prereq": {
      "code": "ESPM 3241",
      "subject": "ESPM",
      "id": "3241"
    }
  },
  {
    "uid": "015439",
    "code": "ESPM4293",
    "subject": "ESPM",
    "number": "4293",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Student selects and conducts a study of or project on a topic of personal interest in consultation with faculty member. The course is documented by initial proposal and reports of accomplishment.",
    "prereq": []
  },
  {
    "uid": "008223",
    "code": "ESPM4295W",
    "subject": "ESPM",
    "number": "4295",
    "honors": false,
    "writingIntensive": true,
    "name": "GIS in Eviron Science & Mgmt",
    "fullname": "GIS in Environmental Science and Management",
    "info": "Application of geographic information science and technologies (GIS) in complex environmental problems. Students gain experience in spatial data collection, database development, and spatial analysis, including GNSS and field attribute collection, image interpretation, and existing data fusion, raster/vector data integration and analysis, information extraction from LiDAR data, DEM conditioning and hydrologic analysis, neighborhood analysis, bulk processing and automation, and scripting. Problems vary depending on topics, often with extra-University partners.prereq: FNRM 3131 or Geog 3561 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "FNRM 3131",
          "subject": "FNRM",
          "id": "3131"
        },
        {
          "code": "GEOG 3561",
          "subject": "GEOG",
          "id": "3561"
        }
      ]
    }
  },
  {
    "uid": "007602",
    "code": "ESPM4601",
    "subject": "ESPM",
    "number": "4601",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Pollution",
    "fullname": "Environmental Pollution",
    "info": "This course uses the principles of chemistry, microbiology, physics, and toxicology to understand the fate and behavior of environmental contaminants and the pollution of soils, surface waters, groundwater, and sediments. The course is structured around a semester-long risk assessment project that provides a framework for integrating concepts of pollution, contaminant movement, contaminant degradation, human health risk, ecological risk, risk mitigation, environmental remediation processes, and interactions among them. The history of federal regulations concerning environmental contamination is presented in the context of the major episodes of environmental pollution that motivated legislative action.prereq: SOIL 2125, CHEM 1061 and 1062 or equiv,  or permission",
    "prereq": {
      "and": [
        {
          "code": "SOIL 2125",
          "subject": "SOIL",
          "id": "2125"
        },
        {
          "code": "CHEM 1061",
          "subject": "CHEM",
          "id": "1061"
        },
        {
          "code": "ESPM 1062",
          "subject": "ESPM",
          "id": "1062"
        }
      ]
    }
  },
  {
    "uid": "804715",
    "code": "ESPM4609",
    "subject": "ESPM",
    "number": "4609",
    "honors": false,
    "writingIntensive": false,
    "name": "Air Pollution",
    "fullname": "Air Pollution Impacts, Management, and Ethical Challenges",
    "info": "Air pollutants, sources, and impacts on humans, plants, animals, soil, water, atmosphere, and planet. Emission rates, measurement, control technologies, air pollution laws/regulations. Personal erspectives/ethics related to air pollution, how they impact professional/civic life.prereq: [BIOL 1001 or BIOL 1009], [CHEM 1011 or CHEM 1015 or CHEM 1021], CHEM 1017",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "BIOL 1001",
              "subject": "BIOL",
              "id": "1001"
            },
            {
              "code": "BIOL 1009",
              "subject": "BIOL",
              "id": "1009"
            }
          ]
        },
        {
          "or": [
            {
              "code": "CHEM 1011",
              "subject": "CHEM",
              "id": "1011"
            },
            {
              "code": "CHEM 1015",
              "subject": "CHEM",
              "id": "1015"
            },
            {
              "code": "CHEM 1021",
              "subject": "CHEM",
              "id": "1021"
            }
          ]
        },
        {
          "code": "CHEM 1017",
          "subject": "CHEM",
          "id": "1017"
        }
      ]
    }
  },
  {
    "uid": "010875",
    "code": "ESPM4811",
    "subject": "ESPM",
    "number": "4811",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Interpretation",
    "fullname": "Environmental Interpretation",
    "info": "This course is designed to be an introduction to the broad field of Environmental Interpretation, Communication Theory, Visitor Information Services (VIS), and Nonformal Education experience's found in parks, nature centers, camps, zoos, museums, arboretums, and free-choice learning environments. Students will understand the definitions, role and scope of interpretation, differences between audiences and/or users of interpretive services, and distinguish between interpretive techniques based on their advantages/disadvantages. Students can also qualify for the National Association for Interpretation's (NAI) Certified Interpretive Guide (CIG) program.",
    "prereq": []
  },
  {
    "uid": "013546",
    "code": "ESPM5000",
    "subject": "ESPM",
    "number": "5000",
    "honors": false,
    "writingIntensive": false,
    "name": "Colloquium: Envrnmt & Nat Res",
    "fullname": "Colloquium: Environment and Natural Resources",
    "info": "Lectures from experts, readings, discussions of current environmental topics/issues. Topics vary, see Class Schedule.",
    "prereq": []
  },
  {
    "uid": "013457",
    "code": "ESPM5001",
    "subject": "ESPM",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Treaty Rights & Natural Resour",
    "fullname": "Treaty Rights and Natural Resources",
    "info": "Readings, class discussion about treaty rights reserved by indigenous Americans with respect to use of natural resources. Emphasizes Midwest issues. Web-assisted course. ",
    "prereq": []
  },
  {
    "uid": "009770",
    "code": "ESPM5002",
    "subject": "ESPM",
    "number": "5002",
    "honors": false,
    "writingIntensive": false,
    "name": "Colloq: Resto of Stream Ecosys",
    "fullname": "Colloquium: Restoration of Stream Ecosystems",
    "info": "Key concepts/techniques. Overview of stream habitat restoration.  Relationship of restoration to natural stream systems, planning, research, watershed groups, interagency coordination, and management decision process.",
    "prereq": []
  },
  {
    "uid": "819734",
    "code": "ESPM5014",
    "subject": "ESPM",
    "number": "5014",
    "honors": false,
    "writingIntensive": false,
    "name": "Tribal Resource Management",
    "fullname": "Tribal and Indigenous Natural Resource Management",
    "info": "This course is designed to develop and refine your understanding of tribal and Indigenous natural resource management, tribal and Indigenous perspectives, and responsibilities natural resource managers have for tribal and Indigenous communities. This course includes one eight-hour weekend field session.",
    "prereq": []
  },
  {
    "uid": "817317",
    "code": "ESPM5015",
    "subject": "ESPM",
    "number": "5015",
    "honors": false,
    "writingIntensive": false,
    "name": "Invasive Plants and Animals",
    "fullname": "Invasive Plants and Animals: Ecology and Management",
    "info": "Overview of invasive plants/animals in North America and around the world. A range of taxa are covered along with their impact and approaches to control. Readings, discussions, and lectures from experts on topics such as invasion theory and real-world management.",
    "prereq": []
  },
  {
    "uid": "797595",
    "code": "ESPM5019",
    "subject": "ESPM",
    "number": "5019",
    "honors": false,
    "writingIntensive": false,
    "name": "Bus, Natural Env & Global Econ",
    "fullname": "Business, Natural Environment, and Global Economy",
    "info": "Business strategies that affect natural environment. Ways business strategies/practices can produce win-win outcomes for the environment and business.",
    "prereq": []
  },
  {
    "uid": "014586",
    "code": "ESPM5021",
    "subject": "ESPM",
    "number": "5021",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecol Veg Mgmt: Consultng Aprch",
    "fullname": "Ecological Vegetation Management: a Consulting Approach",
    "info": "Application of ecological concepts such as succession/competition to ecosystems under management. Wetlands, riparian zones, urban interfaces, agriculture, agroforestry. Northern/boreal conifer, hardwood forests, grasslands (prairie). Management objectives, methods, impacts. Evaluating practices for sustainability. Social issues. Regional (Great Lakes area), national, global case studies.",
    "prereq": []
  },
  {
    "uid": "791983",
    "code": "ESPM5031",
    "subject": "ESPM",
    "number": "5031",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied GPS for GIS",
    "fullname": "Applied Global Positioning Systems for Geographic Information Systems",
    "info": "GPS principles, operations, techniques to improve accuracy. Datum, projections, and coordinate systems. Differential correction, accuracy assessments discussed/applied in lab exercises. Code/carrier phase GPS used in exercises. GPS handheld units, PDA based ArcPad/GPS equipment. Transferring field data to/from desktop systems, integrating GPS data with GIS.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "789601",
    "code": "ESPM5061",
    "subject": "ESPM",
    "number": "5061",
    "honors": false,
    "writingIntensive": false,
    "name": "Water Quality & Natural Resour",
    "fullname": "Water Quality and Natural Resources",
    "info": "Recent literature in field. Complements 4061. Ecology of aquatic ecosystems, how they are valuable to society and changed by landscape management. Case studies, impaired waters, TMDL process, student engagement in simulating water quality decision making.",
    "prereq": []
  },
  {
    "uid": "808494",
    "code": "ESPM5071",
    "subject": "ESPM",
    "number": "5071",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecol Restoration",
    "fullname": "Ecological Restoration",
    "info": "Each ecosystem restoration is the product of a myriad of decisions made in response to existing site conditions (biotic and abiotic), anticipated effects from the surrounding landscape, predictions about future events, logistical realities, and, of course, desired conditions. During this course, you will learn about the ecological and social factors that affect ecosystem recovery and how people intervene to reverse ecosystem degradation. The course includes examples from ecosystems around the world, with emphasis on those found in the Midwestern US. Field trips. PREREQUISITES: This course presumes previous courses in basic ecology and plant science.",
    "prereq": []
  },
  {
    "uid": "790809",
    "code": "ESPM5101",
    "subject": "ESPM",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Conservt of Plant Biodiversity",
    "fullname": "Conservation of Plant Biodiversity",
    "info": "Introduction to principles underlying assessment/conservation of plant biodiversity at individual, population, and community levels. Case studies in management of biodiversity to restore or maintain ecosystem function. Genetics, timber harvesting, invasive species, plant reproduction.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "810999",
    "code": "ESPM5102",
    "subject": "ESPM",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "Forests, Water and Land Use",
    "fullname": "Managing International Natural Resources Programs and Projects: Forests, Water and Land Use",
    "info": "Global hot spots where biodiversity is threatened by multiple stressors (zoonotic disease, rapid growth, opening of new frontiers, climate change). Strategies to address complex situations. Emphasis on learning interdisciplinary applied skills, management practices, hands-on techniques.",
    "prereq": []
  },
  {
    "uid": "798969",
    "code": "ESPM5108",
    "subject": "ESPM",
    "number": "5108",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecology of Managed Systems",
    "fullname": "Ecology of Managed Systems",
    "info": "Analysis of functioning of ecosystems primarily structured by managed plant communities. Managed forests, field-crop agroecosystems, rangelands, aquatic systems. Structure-function relations. Roles of biodiversity in productivity, resource-use efficiency, nutrient cycling, resilience. Emerging principles for design of sustainable managed ecosystems, provision of ecological services.prereq: Sr or grad student",
    "prereq": []
  },
  {
    "uid": "792056",
    "code": "ESPM5111",
    "subject": "ESPM",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Hydro & Water Qual Fld Mthds",
    "fullname": "Hydrology and Water Quality Field Methods",
    "info": "Integrates water quality, surface/groundwater hydrology. Case studies, hands-on field data collection, calculations of hydrological/water quality parameters. Meteorological data, snow hydrology, stream gauging, well monitoring, automatic water samplers. Designing water quality sampling program. Geomorphology, interception, infiltration.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008062",
    "code": "ESPM5131",
    "subject": "ESPM",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "Env. Biophysics and Ecol.",
    "fullname": "Environmental Biophysics and Ecology",
    "info": "Basic concepts of environmental variables such as temperature, humidity, wind, and radiation. Mechanics of heat/mass transfer between a living organism and its surrounding environment. Set of practical examples to integrate concepts and transport processes.",
    "prereq": []
  },
  {
    "uid": "790810",
    "code": "ESPM5195",
    "subject": "ESPM",
    "number": "5195",
    "honors": false,
    "writingIntensive": false,
    "name": "Problem Solving & Plng in NR",
    "fullname": "Problem Solving and Planning in Natural Resources",
    "info": "Applying problem solving tools/skills in policy, planning, and managerial situations. Students work with 'real world' client to produce publishable technical report, present results in professional public forum.",
    "prereq": []
  },
  {
    "uid": "014790",
    "code": "ESPM5202",
    "subject": "ESPM",
    "number": "5202",
    "honors": false,
    "writingIntensive": false,
    "name": "Env Conflict Mgmt, Ldrshp, Pln",
    "fullname": "Environmental Conflict Management, Leadership, and Planning",
    "info": "Negotiation of natural resource management issues. Use of collaborative planning. Case study approach to conflict management, strategic planning, and building leadership qualities. Emphasizes analytical concepts, techniques, and skills.",
    "prereq": []
  },
  {
    "uid": "810594",
    "code": "ESPM5204",
    "subject": "ESPM",
    "number": "5204",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustain Com Based Nat Res Mgmt",
    "fullname": "Sustainable Community Based Natural Resource Management",
    "info": "One of the courses in the Nepal Semester Abroad Program. Study the principles of community managed natural resource based sustainable development in a developing country setting. International perspectives on sustainable resource use/management in developed/developing countries, including integration of social, economic, policy considerations related to natural resource management. Course includes visits to community forest user groups in Nepal with the opportunity to explore issues of sustainability related to development efforts within communities actively managing and conserving communal forest areas. Community forestry has been credited with protecting and reestablishing important habitat for animals such as wild elephants, rhinos and tigers in the Terai (lowland) region of Nepal.",
    "prereq": []
  },
  {
    "uid": "791981",
    "code": "ESPM5207",
    "subject": "ESPM",
    "number": "5207",
    "honors": false,
    "writingIntensive": false,
    "name": "Nat Res Based Sustain Develop",
    "fullname": "Natural Resource-based Sustainable Development in Costa Rica",
    "info": "Field trips. From conventional to organic bird-friendly coffee production/marketing. Sustainable management of high-/low-land tropical forests and of biodiversity. Lectures, seminars, labs, field work, written project.",
    "prereq": []
  },
  {
    "uid": "790811",
    "code": "ESPM5211",
    "subject": "ESPM",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "Surv Meas Model for Env Analys",
    "fullname": "Survey, Measurement, and Modeling for Environmental Analysis",
    "info": "Survey, measurement, and modeling concepts/methods for the study of natural resources/environmental issues. Emphasizes survey design for data collection, estimation, and analysis for issues encompassing land, water, air, vegetation, wildlife, and human/social variables.",
    "prereq": []
  },
  {
    "uid": "014342",
    "code": "ESPM5241",
    "subject": "ESPM",
    "number": "5241",
    "honors": false,
    "writingIntensive": false,
    "name": "Nat Resource & Env Policy",
    "fullname": "Natural Resource and Environmental Policy",
    "info": "Political processes at play in management of environment and how disagreements are addressed by different stakeholders, private-sector interests, government agencies and institutions, communities, and nonprofit organizations.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "798975",
    "code": "ESPM5242",
    "subject": "ESPM",
    "number": "5242",
    "honors": false,
    "writingIntensive": false,
    "name": "Mthd Env & NatRes Policy Anlys",
    "fullname": "Methods for Environmental and Natural Resource Policy Analysis",
    "info": "Methods, formal and informal, for analyzing environmental and natural resource policies. How to critically evaluate policies, using economic and non-economic decision-making criteria. Application of policy analysis principles/concepts to environmental/natural resource problems. Recognizing politically-charged environment in which decisions over use, management, and protection of these resources often occur.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "015422",
    "code": "ESPM5245",
    "subject": "ESPM",
    "number": "5245",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainbl Land Use Plng/Policy",
    "fullname": "Sustainable Land Use Planning and Policy",
    "info": "Planning theories, concepts, and constructs. Policies, processes, and tools for sustainable land use planning. Scientific/technical literature related to land use planning. Skills needed to participate in sustainable land use planning.",
    "prereq": []
  },
  {
    "uid": "791381",
    "code": "ESPM5251",
    "subject": "ESPM",
    "number": "5251",
    "honors": false,
    "writingIntensive": false,
    "name": "NR in Sustain Int'l Developmnt",
    "fullname": "Natural Resources in Sustainable International Development",
    "info": "International perspectives on resource use in developing countries. Integration of natural resource issues with social, economic, and policy considerations. Agriculture, forestry, agroforestry, non-timber forest products, water resources, certification, development issues. Latin American case studies.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "798976",
    "code": "ESPM5256",
    "subject": "ESPM",
    "number": "5256",
    "honors": false,
    "writingIntensive": false,
    "name": "NatRes Law & Mgmt Pub Land/Wtr",
    "fullname": "Natural Resource Law and the Management of Public Lands and Waters",
    "info": "This course is intended to provide non-law students with an understanding of the role of the judiciary in the management of public lands and public waters. The course will examine Constitutional provisions affecting the management of public resources, the concept of property rights, major principles of water law, the role of the legal system in environmental review, the scope of legal authority granted to administrative agencies, and limitations of private property rights to protect public lands and public waters. The class will introduce students to the concepts of legal reasoning including case synthesis and analysis. The class will be taught using a combination of lecture, guest lectures, written exercises and class participation.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "014336",
    "code": "ESPM5261",
    "subject": "ESPM",
    "number": "5261",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ & Natural Resources Mgmt",
    "fullname": "Economics and Natural Resources Management",
    "info": "Microeconomic principles and their application to natural resource management problems. Economic and policy tools to address market failures. Discussion of regulatory and market-based instruments. Discounting and compounding concepts. Methods for conducting financial and economic analyses of natural resource management projects. Decision criteria when conducting benefit/cost analysis of natural resource projects. Methods for valuing non-market natural resource goods and services. Economics of managing renewable natural resources such as forests and fisheries. Land economics. Payments for environmental services. Planning and management problems. Case studies.",
    "prereq": []
  },
  {
    "uid": "790812",
    "code": "ESPM5295",
    "subject": "ESPM",
    "number": "5295",
    "honors": false,
    "writingIntensive": false,
    "name": "GIS in Environ Science & Mgmt",
    "fullname": "GIS in Environmental Science and Management",
    "info": "Application of geographic information science and technologies (GIS) in complex environmental problems. Students gain experience in spatial data collection, database development, and spatial analysis, including GNSS and field attribute collection, image interpretation, and existing data fusion, raster/vector data integration and analysis, information extraction from LiDAR data, DEM conditioning and hydrologic analysis, neighborhood analysis, bulk processing and automation, and scripting. Problems vary depending on topics, often with extra-University partners.*Please note that students should have completed a semester-long, introductory lab/lecture GIS course at the graduate or undergraduate level before enrolling in this course, e.g., FNRM 5131. We do not require any given course because students come from varied universities and backgrounds. That said, we assume a knowledge commensurate with a comprehensive introductory course. Students seeking a first course are directed to FNRM 5131. If you have questions regarding your capabilities, please contact the instructor prior to enrolling.",
    "prereq": []
  },
  {
    "uid": "008072",
    "code": "ESPM5402",
    "subject": "ESPM",
    "number": "5402",
    "honors": false,
    "writingIntensive": false,
    "name": "Biometeorology",
    "fullname": "Biometeorology",
    "info": "This course examines the interactions between the atmosphere and the Earths surface. We will discuss the principles of the surface energy and radiation balance, air motion in the atmospheric boundary layer, land surface parameterization for climate models, boundary layer budgets, and field research methods. The course aims to achieve exemplary learning through hands-on activities and examining recent field studies conducted in natural and managed ecosystems. prereq: MATH 1271, PHYS 1201, STAT 3011, [instr consent]",
    "prereq": {
      "and": [
        {
          "code": "MATH 1271",
          "subject": "MATH",
          "id": "1271"
        },
        {
          "code": "PHYS 1201",
          "subject": "PHYS",
          "id": "1201"
        },
        {
          "code": "STAT 3011",
          "subject": "STAT",
          "id": "3011"
        }
      ]
    }
  },
  {
    "uid": "789538",
    "code": "ESPM5480",
    "subject": "ESPM",
    "number": "5480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Natural Resources",
    "fullname": "Topics in Natural Resources",
    "info": "Lectures by visiting scholar or regular staff member. Topics specified in class schedule.",
    "prereq": []
  },
  {
    "uid": "790875",
    "code": "ESPM5482",
    "subject": "ESPM",
    "number": "5482",
    "honors": false,
    "writingIntensive": false,
    "name": "Biosafety Science and Policy",
    "fullname": "Biosafety Science and Policy",
    "info": "Science/policy for governing environmental/health safety of genetic engineering through Minnesota, national, and international cases.",
    "prereq": []
  },
  {
    "uid": "792588",
    "code": "ESPM5501",
    "subject": "ESPM",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Biol Collectns:Curation & Mgmt",
    "fullname": "Biological Collections: Curation and Management",
    "info": "Roles/value of biology collections in natural history museums. Conservation of biodiversity record. Students participate in various hands-on curatorial activities. Lectures, tours.",
    "prereq": []
  },
  {
    "uid": "792709",
    "code": "ESPM5555",
    "subject": "ESPM",
    "number": "5555",
    "honors": false,
    "writingIntensive": false,
    "name": "Wetland Soils",
    "fullname": "Wetland Soils",
    "info": "Morphology, chemistry, hydrology, formation of mineral/organic soils in wet environments. Soil morphological indicators of wet conditions, field techniques of identifying hydric soils for wetland delineations. Peatlands. Wetland benefits, preservation, regulation, mitigation. Field trips, lab, field hydric soil delineation project.prereq: SOIL 1125 or 2125 or equiv or instr consent; concurrent registration is required (or allowed) in SOIL 4511 recommended",
    "prereq": {
      "or": [
        {
          "code": "SOIL 1125",
          "subject": "SOIL",
          "id": "1125"
        },
        {
          "code": "ESPM 2125",
          "subject": "ESPM",
          "id": "2125"
        },
        {
          "code": "SOIL 4511",
          "subject": "SOIL",
          "id": "4511"
        }
      ]
    }
  },
  {
    "uid": "010599",
    "code": "ESPM5575",
    "subject": "ESPM",
    "number": "5575",
    "honors": false,
    "writingIntensive": false,
    "name": "Wetlands",
    "fullname": "Wetlands",
    "info": "Freshwater wetland classification, wetland biota, current/historic status of wetlands, value of wetlands. National, regional, Minnesota wetlands conservation strategies. Ecological principles used in wetland management.prereq: 3575, [sr or grad student or instr consent]",
    "prereq": {
      "code": "ESPM 3575",
      "subject": "ESPM",
      "id": "3575"
    }
  },
  {
    "uid": "010347",
    "code": "ESPM5601",
    "subject": "ESPM",
    "number": "5601",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Waste Management",
    "fullname": "Principles of Waste Management",
    "info": "Waste and waste management principles. Issues, problems, and solutions in remedying waste stream. MSW and yard waste composting, WTE incineration operation, ash disposal, recycling, land fill requirements, direct land disposal, regulatory trends, and case studies.prereq: 1125 or 2125, Biol 1002/1009 or Chem 1021, Stat 3011, ApEc 1101 or instr consent",
    "prereq": {
      "and": [
        {
          "code": "ESPM 1125",
          "subject": "ESPM",
          "id": "1125"
        },
        {
          "code": "ESPM 2125",
          "subject": "ESPM",
          "id": "2125"
        },
        {
          "code": "BIOL 1002",
          "subject": "BIOL",
          "id": "1002"
        },
        {
          "code": "ESPM 1009",
          "subject": "ESPM",
          "id": "1009"
        },
        {
          "code": "CHEM 1021",
          "subject": "CHEM",
          "id": "1021"
        },
        {
          "code": "STAT 3011",
          "subject": "STAT",
          "id": "3011"
        },
        {
          "code": "APEC 1101",
          "subject": "APEC",
          "id": "1101"
        }
      ]
    }
  },
  {
    "uid": "797596",
    "code": "ESPM5602",
    "subject": "ESPM",
    "number": "5602",
    "honors": false,
    "writingIntensive": false,
    "name": "Regs & Corp Environ Mgmt",
    "fullname": "Regulations and Corporate Environmental Management",
    "info": "Concepts, major issues relating to industrial ecology and industry as they are influenced by current standards/regulations at local, state, and national levels.prereq: APEC 1101 or ECON 1101",
    "prereq": {
      "or": [
        {
          "code": "APEC 1101",
          "subject": "APEC",
          "id": "1101"
        },
        {
          "code": "ECON 1101",
          "subject": "ECON",
          "id": "1101"
        }
      ]
    }
  },
  {
    "uid": "797587",
    "code": "ESPM5603",
    "subject": "ESPM",
    "number": "5603",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Life Cycle Anlys",
    "fullname": "Environmental Life Cycle Analysis",
    "info": "Concepts, major issues relating to inventory and subsequent analysis of production systems. Production system from holistic point of view, using term commonly used in industrial ecology: \"the metabolic system.\"prereq: [Math 1142 or [Math 1271, Math 1282]], [Econ 1101 or ApEc 1101]",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "MATH 1142",
              "subject": "MATH",
              "id": "1142"
            },
            {
              "and": [
                {
                  "code": "MATH 1271",
                  "subject": "MATH",
                  "id": "1271"
                },
                {
                  "code": "MATH 1282",
                  "subject": "MATH",
                  "id": "1282"
                }
              ]
            }
          ]
        },
        {
          "or": [
            {
              "code": "ECON 1101",
              "subject": "ECON",
              "id": "1101"
            },
            {
              "code": "APEC 1101",
              "subject": "APEC",
              "id": "1101"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "797597",
    "code": "ESPM5604",
    "subject": "ESPM",
    "number": "5604",
    "honors": false,
    "writingIntensive": false,
    "name": "Env Mgmt Systems & Strategy",
    "fullname": "Environmental Management Systems and Strategy",
    "info": "Environmental problems such as climate change, ozone depletion, and loss of biodiversity.",
    "prereq": []
  },
  {
    "uid": "797598",
    "code": "ESPM5605",
    "subject": "ESPM",
    "number": "5605",
    "honors": false,
    "writingIntensive": false,
    "name": "Rcyclng:Extndng Raw Mat",
    "fullname": "Recycling: Extending Raw Materials Supplies",
    "info": "Principles of recycling. Role of recycling in raw materials utilization, energy, and the environment. Recycling processes for number of commonly recycled materials/products. Properties, environmental implications of recycling.",
    "prereq": []
  },
  {
    "uid": "797599",
    "code": "ESPM5606",
    "subject": "ESPM",
    "number": "5606",
    "honors": false,
    "writingIntensive": false,
    "name": "Pollution Prevention",
    "fullname": "Pollution Prevention: Principles, Technologies, and Practices",
    "info": "Pollution prevention, green chemistry, cleaner production, Design for the Environment (DfE), life cycle management. Pollution prevention practices and technologies that reduce industrial emissions/costs by preventing pollution.",
    "prereq": []
  },
  {
    "uid": "804645",
    "code": "ESPM5609",
    "subject": "ESPM",
    "number": "5609",
    "honors": false,
    "writingIntensive": false,
    "name": "Air Pollution",
    "fullname": "Air Pollution Impacts, Management, and Ethical Challenges",
    "info": "Air pollutants, sources, and impacts on humans, plants, animals, soil, water, atmosphere, and planet. Emission rates, measurement, control technologies, air pollution laws/regulations. Perspectives and personal ethics related to air pollution, how they impact professional/civic life.prereq: [CHEM 1021 or CHEM 1015], [BIOL 1001 or BIOL 1009 or CHEM 1017]",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "CHEM 1021",
              "subject": "CHEM",
              "id": "1021"
            },
            {
              "code": "CHEM 1015",
              "subject": "CHEM",
              "id": "1015"
            }
          ]
        },
        {
          "or": [
            {
              "code": "BIOL 1001",
              "subject": "BIOL",
              "id": "1001"
            },
            {
              "code": "BIOL 1009",
              "subject": "BIOL",
              "id": "1009"
            },
            {
              "code": "CHEM 1017",
              "subject": "CHEM",
              "id": "1017"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "006463",
    "code": "ESPM5703",
    "subject": "ESPM",
    "number": "5703",
    "honors": false,
    "writingIntensive": false,
    "name": "Agroforestry in Watershed Mgmt",
    "fullname": "Agroforestry in Watershed Management",
    "info": "Biological, physical, and environmental attributes of agroforestry as pertains to watershed management. Coupling production with watershed protection benefits. Implications for policy, economics, and human dimensions in sustainable development. Examples/case studies from North America and developing countries.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "790814",
    "code": "ESPM5811",
    "subject": "ESPM",
    "number": "5811",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Interpretation",
    "fullname": "Environmental Interpretation",
    "info": "This course is designed to be an introduction to the broad field of Environmental Interpretation, Communication Theory, Visitor Information Services (VIS), and Nonformal Education experience's found in parks, nature centers, camps, zoos, museums, arboretums, and free-choice learning environments. Students will understand the definitions, role and scope of interpretation, differences between audiences and/or users of interpretive services, and distinguish between interpretive techniques based on their advantages/disadvantages. Students can also qualify for the National Association for Interpretation's (NAI) Certified Interpretive Guide (CIG) program.",
    "prereq": []
  }
]