[
  {
    "uid": "009353",
    "code": "FMCH5201",
    "subject": "FMCH",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Cl Fam Med",
    "fullname": "Clinical Family Medicine",
    "info": "Supervised care for patients of all ages on a continuous, primary, preventive, and general diagnostic basis. Diagnosis, methods of treatment, and problem-solving devices for benefit of patient and family, emphasizing health hazard appraisal. New and refined methods of recording, documentation, and retrieval of clinical data.",
    "prereq": []
  },
  {
    "uid": "010275",
    "code": "FMCH5345",
    "subject": "FMCH",
    "number": "5345",
    "honors": false,
    "writingIntensive": false,
    "name": "Curr/Tchg Med Ed",
    "fullname": "Curriculum Design and Teaching Strategies for Medical Education I",
    "info": "Identifying/developing course goals. Developing course, teacher, learner evaluations. Students must also take 5346, which follows immediately after 5345.prereq: concurrent entollment in 5346, instr consent",
    "prereq": {
      "code": "FMCH 5346",
      "subject": "FMCH",
      "id": "5346"
    }
  },
  {
    "uid": "010286",
    "code": "FMCH5346",
    "subject": "FMCH",
    "number": "5346",
    "honors": false,
    "writingIntensive": false,
    "name": "Curr/Tchg Med Ed II",
    "fullname": "Curriculum Design and Teaching Strategies for Medical Education II",
    "info": "Taken with 5345. Practicum of lecture, demonstration, small-group discussion, clinical teaching, and computer-assisted instruction. Academic ethics, policies, copyright issues, tenure, academic freedom, problem-based learning.prereq: concurrent registration is required (or allowed) in 5345, instr consent",
    "prereq": {
      "code": "FMCH 5345",
      "subject": "FMCH",
      "id": "5345"
    }
  },
  {
    "uid": "009332",
    "code": "FMCH5564",
    "subject": "FMCH",
    "number": "5564",
    "honors": false,
    "writingIntensive": false,
    "name": "Fam Prac Sem",
    "fullname": "Family Practice Seminar",
    "info": "Knowledge, skills, and attitudes in biomedical and behavioral sciences that form foundation for academic discipline of family medicine; medical decision making, common problems and procedures, family theory and assessment, clinical pharmacy, human sexuality.prereq: MD or DO degree",
    "prereq": []
  },
  {
    "uid": "009257",
    "code": "FMCH5650",
    "subject": "FMCH",
    "number": "5650",
    "honors": false,
    "writingIntensive": false,
    "name": "Prin Geriatr I",
    "fullname": "Principles of Geriatrics I",
    "info": "First in two-course sequence. Survey of major topics in geriatric medicine. Epidemiology, etiology, diagnosis, and treatment of major geriatric syndromes and illnesses.prereq: Medical School or dental school or GNP School graduate",
    "prereq": []
  },
  {
    "uid": "009296",
    "code": "FMCH5651",
    "subject": "FMCH",
    "number": "5651",
    "honors": false,
    "writingIntensive": false,
    "name": "Prin Geriatr II",
    "fullname": "Principles of Geriatrics II",
    "info": "Second in two-course sequence.  Survey of major topics in geriatric medicine.  Epidemiology, etiology, diagnosis, and treatment of major geriatric syndromes and illnesses.prereq: Medical School or dental school or GNP school graduate",
    "prereq": []
  },
  {
    "uid": "010112",
    "code": "FMCH5950",
    "subject": "FMCH",
    "number": "5950",
    "honors": false,
    "writingIntensive": false,
    "name": "Cl Iss Human Sex",
    "fullname": "Clinical Issues in Human Sexuality",
    "info": "Assessment and treatment techniques pertaining to common sexual problems.prereq: Enrollment in health sci grad programs in CSPP, Psy, PubH, SW or FSoS or instr consent",
    "prereq": []
  },
  {
    "uid": "009351",
    "code": "FMCH5955",
    "subject": "FMCH",
    "number": "5955",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Study",
    "fullname": "Directed Study",
    "info": "Studies on special topics as arranged between student and faculty.prereq: instr consent; qualified students may arrange for work on a tutorial basis",
    "prereq": []
  },
  {
    "uid": "009785",
    "code": "FMCH5960",
    "subject": "FMCH",
    "number": "5960",
    "honors": false,
    "writingIntensive": false,
    "name": "Bas Res Meth",
    "fullname": "Basic Research Methods in Family Practice",
    "info": "History and current status of research in family medicine, research resources available in the department. How to ask/define a research question, conduct a literature search, select a research methodology, meet federal requirements for protection of human subjects in research, critically read the medical literature and facilitate its discussion, and prepare a grant proposal.",
    "prereq": []
  },
  {
    "uid": "796781",
    "code": "FMCH5961",
    "subject": "FMCH",
    "number": "5961",
    "honors": false,
    "writingIntensive": false,
    "name": "Integration Seminar",
    "fullname": "Family Medicine Fellows and Junior Faculty Integration Seminar",
    "info": "Preparation for roles in academia. Achieving success as a clinical investigator. Funding opportunities, authorship, collaboration, publishing, grant preparation.",
    "prereq": []
  },
  {
    "uid": "796736",
    "code": "FMCH6233",
    "subject": "FMCH",
    "number": "6233",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Sexuality",
    "fullname": "Human Sexuality, Year One",
    "info": "How to render effective primary care for patients with sexual concerns. Mandatory two day sexual attitude reassessment seminar. Four symposia that involve case presentations. Panel discussions, media.",
    "prereq": []
  },
  {
    "uid": "011550",
    "code": "FMCH7124",
    "subject": "FMCH",
    "number": "7124",
    "honors": false,
    "writingIntensive": false,
    "name": "Sleep Disorders",
    "fullname": "Sleep Disorders",
    "info": "Students will rotate with sleep medicine physicians at one of two sites.",
    "prereq": []
  },
  {
    "uid": "816861",
    "code": "FMCH7200",
    "subject": "FMCH",
    "number": "7200",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Residency in Family Med",
    "fullname": "Introduction to Residency in Family Medicine",
    "info": "This 2-week elective is offered at all of the University of Minnesota-affiliated Twin Cities residency programs in Family Medicine, and select other local programs. This elective provides students the opportunity to experience the full spectrum of Family Medicine and Community Health at that program. All efforts will be made to place the student at the program of their choice. The student will work with Family Medicine faculty physicians and residents in all the facets of Family Medicine care including: office, inpatient hospital service, labor and delivery, overnight call, procedures and, where applicable, nursing home rounds or home visits. ",
    "prereq": []
  },
  {
    "uid": "012501",
    "code": "FMCH7500",
    "subject": "FMCH",
    "number": "7500",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Family Medicine",
    "fullname": "Acting Intern Family Medicine",
    "info": "This elective is offered at all the University of Minnesota-affiliated Twin Cities Residency Programs in Family Medicine and selected other local programs. This elective provides students the opportunity to experience the full spectrum of Family Medicine. All efforts will be made to place the student at the program of their choice. The student will work with Family Medicine faculty physicians and Family Medicine residents in all the facets of Family Medicine care including: office, inpatient hospital service, labor and delivery, overnight call, procedures and, where applicable, nursing home rounds or home visits.  Students are expected to take both inpatient medicine and obstetrical call at a frequency of approximately one night per week, work may include evenings and weekends.",
    "prereq": []
  },
  {
    "uid": "012502",
    "code": "FMCH7501",
    "subject": "FMCH",
    "number": "7501",
    "honors": false,
    "writingIntensive": false,
    "name": "Rural Physician Assoc Program",
    "fullname": "Rural Physician Associate Program (RPAP)",
    "info": "Community-based elective with extensive primary care experience in a rural setting. Intended for the student with an interest in rural Minnesota primary care. Each student works with family physicians and local and/or visiting specialists. Problem-based learning, hands-on clinical experience and one-to-one teaching.  Scholarships are available.prereq: Med 7500, Obst 7500, USMLE Step 1 Passing Score",
    "prereq": {
      "and": [
        {
          "code": "MED 7500",
          "subject": "MED",
          "id": "7500"
        },
        {
          "code": "OBST 7500",
          "subject": "OBST",
          "id": "7500"
        }
      ]
    }
  },
  {
    "uid": "792921",
    "code": "FMCH7502",
    "subject": "FMCH",
    "number": "7502",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - OrthoSurg",
    "fullname": "Rural Physician Associate Program (RPAP): Orthopaedic Surgery",
    "info": "Community-based elective with extensive orthopaedic surgery experience in a rural setting.prereq: 7501, RPAP student",
    "prereq": {
      "code": "FMCH 7501",
      "subject": "FMCH",
      "id": "7501"
    }
  },
  {
    "uid": "015900",
    "code": "FMCH7503",
    "subject": "FMCH",
    "number": "7503",
    "honors": false,
    "writingIntensive": false,
    "name": "Preceptorship in FM Obstetrics",
    "fullname": "Preceptorship in Family Medicine Obstetrics",
    "info": "This course provides an overview of family medicine obstetrics, or maternity care. The student is given the opportunity to participate in the care of the pregnant woman both in the clinic and in the hospital. The student is assigned to call one time per week. Additionally, the student will be given time to research one topic of interest and complete a one-page summary.",
    "prereq": []
  },
  {
    "uid": "790827",
    "code": "FMCH7504",
    "subject": "FMCH",
    "number": "7504",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - Surgery",
    "fullname": "Rural Physician Associate Program (RPAP): Surgery",
    "info": "Community-based elective with extensive primary care (surgery) experience in a rural setting. Each student works with family physicians and local or visiting specialists. Problem-based learning, hands-on clinical experience, one-to-one teaching.prereq: Med 7500, Obst 7500, USMLE Step 1 Passing Score",
    "prereq": {
      "and": [
        {
          "code": "MED 7500",
          "subject": "MED",
          "id": "7500"
        },
        {
          "code": "OBST 7500",
          "subject": "OBST",
          "id": "7500"
        }
      ]
    }
  },
  {
    "uid": "790828",
    "code": "FMCH7505",
    "subject": "FMCH",
    "number": "7505",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - OB/GYN",
    "fullname": "Rural Physician Associate Program (RPAP): Obstetrics and Gynecology",
    "info": "Community-based elective with extensive obstetrics/gynecology experience in a rural setting. Each student works with family physicians and local or visiting specialists. Problem-based learning, hands-on clinical experience, one-to-one teaching.prereq: 7501",
    "prereq": {
      "code": "FMCH 7501",
      "subject": "FMCH",
      "id": "7501"
    }
  },
  {
    "uid": "790829",
    "code": "FMCH7506",
    "subject": "FMCH",
    "number": "7506",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - Peds",
    "fullname": "Rural Physician Associate Program (RPAP): Pediatrics",
    "info": "Community-based elective with extensive pediatrics experience in a rural setting.prereq: 7501",
    "prereq": {
      "code": "FMCH 7501",
      "subject": "FMCH",
      "id": "7501"
    }
  },
  {
    "uid": "790830",
    "code": "FMCH7507",
    "subject": "FMCH",
    "number": "7507",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - ENT",
    "fullname": "Rural Physician Associate Program (RPAP): Otolaryngology",
    "info": "Community-based elective with extensive otolaryngology experience in a rural setting.",
    "prereq": []
  },
  {
    "uid": "790831",
    "code": "FMCH7508",
    "subject": "FMCH",
    "number": "7508",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - UROL",
    "fullname": "Rural Physician Associate Program (RPAP): Urology",
    "info": "Community-based elective with extensive urology experience in a rural setting.",
    "prereq": []
  },
  {
    "uid": "790832",
    "code": "FMCH7509",
    "subject": "FMCH",
    "number": "7509",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - PC I",
    "fullname": "Rural Physician Associate Program (RPAP): Primary Care Clerkship I",
    "info": "Community-based elective with extensive primary care experience in a rural setting.prereq: 7501",
    "prereq": {
      "code": "FMCH 7501",
      "subject": "FMCH",
      "id": "7501"
    }
  },
  {
    "uid": "790833",
    "code": "FMCH7510",
    "subject": "FMCH",
    "number": "7510",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - PC II",
    "fullname": "Rural Physician Associate Program (RPAP): Primary Care Clerkship II",
    "info": "Community-based elective with extensive primary care experience in a rural setting.prereq: 7509",
    "prereq": {
      "code": "FMCH 7509",
      "subject": "FMCH",
      "id": "7509"
    }
  },
  {
    "uid": "012503",
    "code": "FMCH7511",
    "subject": "FMCH",
    "number": "7511",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Community Ambulatory Med",
    "fullname": "Urban Community Ambulatory Medicine (UCAM)",
    "info": "UCAM provides 12 weeks of ambulatory continuity experience in an underserved urban community Family Medicine Clinic. UCAM expands the Family Medicine Clerkship exposure to patient diversity, low income, multicultural urban medicine, and community health. Students are required to attend the Family Medicine Clerkship/Primary Care Selective seminars as well as 4 UCAM seminars. From a scheduling point of view, UCAM combines the 8 weeks of Family Medicine Clerkship/Primary Care Selective with 4 extra weeks of elective credit. The principles of urban medicine will be blended throughout the 12 weeks, as will the project. Each student will participate in a community health project and complete a journal about his/her experience. The community health project ideally combines the EBM focus of the Family Medicine clerkship project with a longitudinal project.Prereq: FMCH 7600 and FMCH 7700",
    "prereq": {
      "and": [
        {
          "code": "FMCH 7600",
          "subject": "FMCH",
          "id": "7600"
        },
        {
          "code": "FMCH 7700",
          "subject": "FMCH",
          "id": "7700"
        }
      ]
    }
  },
  {
    "uid": "015901",
    "code": "FMCH7512",
    "subject": "FMCH",
    "number": "7512",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Community Ambulatory Med",
    "fullname": "Urban Community Ambulatory Medicine (UCAM)",
    "info": "Expands primary-care clerkship (PCC) into 16 weeks of primary care experience in one underserved urban clinic. Students attend PCC seminars during first eight weeks, followed by weekly seminars covering patient diversity, indigenous medicine, and community health.prereq: 7511, InMd 5508, InMd 7509",
    "prereq": {
      "and": [
        {
          "code": "FMCH 7511",
          "subject": "FMCH",
          "id": "7511"
        },
        {
          "code": "INMD 5508",
          "subject": "INMD",
          "id": "5508"
        },
        {
          "code": "INMD 7509",
          "subject": "INMD",
          "id": "7509"
        }
      ]
    }
  },
  {
    "uid": "792231",
    "code": "FMCH7513",
    "subject": "FMCH",
    "number": "7513",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - ORSU",
    "fullname": "Rural Physician Associate Program (RPAP): Orthopaedic SurgeryRSU",
    "info": "Community-based elective with extensive orthopaedic surgery experience in a rural setting.prereq: Accepted into RPAP",
    "prereq": []
  },
  {
    "uid": "798329",
    "code": "FMCH7515",
    "subject": "FMCH",
    "number": "7515",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP-Emergency Medicine",
    "fullname": "RPAP: Emergency Medicine",
    "info": "tbd ",
    "prereq": []
  },
  {
    "uid": "012505",
    "code": "FMCH7516",
    "subject": "FMCH",
    "number": "7516",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in Human Sexuality",
    "fullname": "Research in Human Sexuality",
    "info": "This elective consists of clinical and/or laboratory research related to human sexuality in areas such as incest, rape, gender dysphoria, compulsive sexual behavior, sex offenses, and sexual dysfunction. It is adaptable to the specific interests of the student and faculty.",
    "prereq": []
  },
  {
    "uid": "012506",
    "code": "FMCH7518",
    "subject": "FMCH",
    "number": "7518",
    "honors": false,
    "writingIntensive": false,
    "name": "Inpatient Family Medicine",
    "fullname": "Inpatient Family Medicine",
    "info": "Students will participate in the family medicine residency inpatient teaching service. This service consists of a variety of patients including pediatric, obstetric, geriatric, and other adult patients. Supervision and teaching are provided by a family medicine faculty who participates daily in didactic teaching, x-ray rounds, and hospital rounds. Members of the team include a medical student, first and second year resident, and the chief resident. These individuals share responsibility for patients on the service and perform initial histories and physicals, write daily orders and progress notes, complete discharge summaries, and communicate with consultants and family members. Students will also attend daily noon conferences. Call is required at some sites.",
    "prereq": []
  },
  {
    "uid": "012508",
    "code": "FMCH7519",
    "subject": "FMCH",
    "number": "7519",
    "honors": false,
    "writingIntensive": false,
    "name": "Clin Prac of Occupational Med",
    "fullname": "Clinical Practice of Occupational Medicine",
    "info": "Students perform complete occupational health history, set up basic problem-solving approahces to occupational health problems.",
    "prereq": []
  },
  {
    "uid": "012509",
    "code": "FMCH7520",
    "subject": "FMCH",
    "number": "7520",
    "honors": false,
    "writingIntensive": false,
    "name": "Rural Rotation in Family Med",
    "fullname": "Rural Rotation in Family Medicine",
    "info": "This course is intended for students interested in observing and participating in Family Medicine in the rural setting. Students participate in patient care in the patient's home, in long-term facilities, in the doctor's office and in the hospital. Students observe close interrelationships between practicing physicians and the community.",
    "prereq": []
  },
  {
    "uid": "796625",
    "code": "FMCH7521",
    "subject": "FMCH",
    "number": "7521",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Immigrant Health",
    "fullname": "Topics in Immigrant Health",
    "info": "Course is designed to offer an intensive multidimensional exploration of immigrant health using clinical, multimedia, academic and on-line learning. The course will include an individualized in-depth project and an individualized learning plan will be developed between each student and the course director after assessing the student's experience, background and interest.This course will combine clinical experiences at a variety of sites which serve immigrant patients with text-based and web-based reading, on-line research, group and individual community visits and on-line and class discussions to provide students with an opportunity to study in-depth the issues that communities and methods by which those barriers are being overcome.",
    "prereq": []
  },
  {
    "uid": "819961",
    "code": "FMCH7522",
    "subject": "FMCH",
    "number": "7522",
    "honors": false,
    "writingIntensive": false,
    "name": "Exploration Immigrant Health",
    "fullname": "Exploration of Immigrant Health",
    "info": "This is a 2-week Family Medicine elective based on the 4 week \"Topics in Immigrant Health\" elective and incorporates much of the independent study portion of that elective.  This online elective will include significant reading (electronically available textbook, The Spirit Catches You and You Fall Down, and a book about the immigrant experience), writing, research and videos that address topics relevant to providing primary care to immigrant patients.  The course objectives are:(1) Students will end the elective with a much deeper understanding of the immigrant experience and how that experience impacts their healthcare needs (2) Students will learn research tools which will allow them to better learn about unfamiliar immigrant groups that they encounter in their future practice.  Students will be expected to spend 4 hours/day on weekdays working on class assignments.  Because it is based on the Topics in Immigrant Health elective (FMCH 7521), it is not appropriate for students who have taken or plan to take that full course.",
    "prereq": []
  },
  {
    "uid": "012513",
    "code": "FMCH7523",
    "subject": "FMCH",
    "number": "7523",
    "honors": false,
    "writingIntensive": false,
    "name": "Fam Med Clerkship in Duluth",
    "fullname": "Family Medicine Clerkship: Duluth",
    "info": "Principles of family medicine. Students engage in preceptorship with community family physicians in clinic, hospital, patient's home, and other facilities. Weekly patient care discussions/presentations, observation. Procedures such as suturing, casting.",
    "prereq": []
  },
  {
    "uid": "012514",
    "code": "FMCH7525",
    "subject": "FMCH",
    "number": "7525",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardiology for Primary Care",
    "fullname": "Cardiology for Primary Care",
    "info": "Students will participate in daily cardiology inpatient rounds. They will work 1:1 with the rounding cardiologist for the week. Responsibilities include the initial cardiology consultation and daily rounds on patients in the hospital. ",
    "prereq": []
  },
  {
    "uid": "817331",
    "code": "FMCH7527",
    "subject": "FMCH",
    "number": "7527",
    "honors": false,
    "writingIntensive": false,
    "name": "LGBT Health",
    "fullname": "Lesbian, Gay, Bisexual, and Transgender (LGBT) Health",
    "info": "In this course, students will gain an understanding of health risks experienced by LGBT individuals and will practice assessing sexual orientation, gender identity, sexual health, and discussing specific health concerns and treatment options in order to become comfortable working with this population. Students will also hear from LGBT individuals themselves about their healthcare experiences and how they wish to be treated. In addition, physicians who are LGB or transgender will talk about managing their professional and personal identities, as well as being out in the community and identifying as an LGBT-friendly healthcare provider.",
    "prereq": []
  },
  {
    "uid": "794687",
    "code": "FMCH7530",
    "subject": "FMCH",
    "number": "7530",
    "honors": false,
    "writingIntensive": false,
    "name": "Preceptorship Cmnty Family Med",
    "fullname": "Preceptorship in Community Family Medicine",
    "info": "This course is intended for students interested in pursuing family medicine as a career, or for students wishing to acquire a broadly-based medical background before training in another specialty. The student will usually participate in inpatient and outpatient care in the family medicine clinic and in the hospital.",
    "prereq": []
  },
  {
    "uid": "012518",
    "code": "FMCH7531",
    "subject": "FMCH",
    "number": "7531",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Healthcare",
    "fullname": "Introduction to Healthcare for the Underserved",
    "info": "Introduces students to the health care needs and challenges faced by special population groups served by Family Medicine. These include immigrant and refugee populations, minority populations, and various other underserved groups. During this rotation based in a clinic serving one or more of these population groups, the student will become familiar with the unique health needs of a population and the resources and methods used to address those needs. Issues such as communication, education, and traditional healing beliefs and systems will be addressed. Typically, 2.5 days per week will be spent in direct patient care, 1 day is reserved for students to perform independent learning around the population to be studied while the remaining 1.5 days may be spent in a variety of non-direct patient care or community-based activities, depending on the clinic site.",
    "prereq": []
  },
  {
    "uid": "012519",
    "code": "FMCH7533",
    "subject": "FMCH",
    "number": "7533",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clkshp Trad Indian Med",
    "fullname": "Advanced Clerkship in Traditional Indian Medicine",
    "info": "Training/experience in clinical/traditional health care settings in an American Indian community. Rotation is arranged, at site, with a community health representative and a traditional healer.",
    "prereq": []
  },
  {
    "uid": "820069",
    "code": "FMCH7534",
    "subject": "FMCH",
    "number": "7534",
    "honors": false,
    "writingIntensive": false,
    "name": "Pal Med & Hospice -Virtual",
    "fullname": "Palliative Medicine and Hospice (Virtual)",
    "info": "The course is intended to introduce students to the field of palliative care and hospice medicine. The rotation will be based out of University Medical Center. Primarily students will spend the rotation working on the University Medical Center inpatient palliative care consult team, seeing inpatient consults with physicians and other practitioners on the multidisciplinary team, including nurse practitioners, social workers, and spiritual health providers. Students also will spend one day with a hospice provider doing hospice visits in the community (at nursing homes and patient's homes). Depending on availability, students may also rotate in the outpatient clinic and the Fairview Southdale inpatient consult service.",
    "prereq": []
  },
  {
    "uid": "016277",
    "code": "FMCH7535",
    "subject": "FMCH",
    "number": "7535",
    "honors": false,
    "writingIntensive": false,
    "name": "Community Health in FP",
    "fullname": "Community Health in Family Medicine",
    "info": "Individually designed outpatient rotation. Combines clinical work in urban setting with a series of experiences in the community.prereq: At least two six-week rotations in medicine or pediatrics or obstetrics or surgery",
    "prereq": []
  },
  {
    "uid": "012520",
    "code": "FMCH7537",
    "subject": "FMCH",
    "number": "7537",
    "honors": false,
    "writingIntensive": false,
    "name": "Sports Medicine",
    "fullname": "Sports Medicine",
    "info": "Students will gain experience in the field of sports medicine including exposure to the disciplines of primary care sports medicine, orthopedic sports medicine, sports physical therapy, and athletic training.",
    "prereq": []
  },
  {
    "uid": "012521",
    "code": "FMCH7538",
    "subject": "FMCH",
    "number": "7538",
    "honors": false,
    "writingIntensive": false,
    "name": "Sports Medicine in Duluth",
    "fullname": "Sports Medicine in Duluth",
    "info": "This course is an opportunity for students interested in primary care or a musculo-skeletal specialty to develop an appreciation for the role of sports medicine in his/her practice. The student will work closely with full-time sports medicine physicians and allied health providers, including physical therapists and athletic trainers.",
    "prereq": []
  },
  {
    "uid": "820043",
    "code": "FMCH7539",
    "subject": "FMCH",
    "number": "7539",
    "honors": false,
    "writingIntensive": false,
    "name": "Sports Medicine (Virtual)",
    "fullname": "Sports Medicine (Virtual)",
    "info": "This is a 2 week, independent study in topics relating to Sports Medicine. This online elective willinclude directed musculoskeletal exam review using EBM, case study review, and power pointpresentations on a variety of topics.This elective should be considered a supplement to, and not a replacement of FMCH 7537.",
    "prereq": []
  },
  {
    "uid": "807367",
    "code": "FMCH7540",
    "subject": "FMCH",
    "number": "7540",
    "honors": false,
    "writingIntensive": false,
    "name": "Sports Medicine: USA Soccer",
    "fullname": "Sports Medicine: USA Soccer Cup",
    "info": "Course held immediately prior to the start of the USA Soccer Cup Tournaments every July. This course consists of didactic lectures and hands on workshops focusing on sports medicine topics with an emphasis on soccer.",
    "prereq": []
  },
  {
    "uid": "015903",
    "code": "FMCH7544",
    "subject": "FMCH",
    "number": "7544",
    "honors": false,
    "writingIntensive": false,
    "name": "Outpatient-HIV Mgmt Family Med",
    "fullname": "Outpatient-HIV Management in Family Medicine",
    "info": "The overall goal of this course is to familiarize the student with the many illnesses and complications of HIV disease, current Hepatitis C treatment, and some travel medicine. This includes the medical, psychological, social and economic problems which the HIV patient faces. The student will become familiar with the many antiviral medications used in HIV disease.",
    "prereq": []
  },
  {
    "uid": "802974",
    "code": "FMCH7551",
    "subject": "FMCH",
    "number": "7551",
    "honors": false,
    "writingIntensive": false,
    "name": "RCAM",
    "fullname": "Rural Community Ambulatory Medicine PCC",
    "info": "Twelve-week course. Four weeks in a Twin Cities Family Residency clinic, eight weeks in a selected Rural Community. Exposure to patients from diverse backgrounds in an outpatient setting to rural medicine, delivery systems, and community health. Small-group seminars, one-day Hospice experience, project, final exam.",
    "prereq": []
  },
  {
    "uid": "012522",
    "code": "FMCH7560",
    "subject": "FMCH",
    "number": "7560",
    "honors": false,
    "writingIntensive": false,
    "name": "Addic & Subst Abuse Disorder",
    "fullname": "Addiction and Substance Abuse Disorder Treatment",
    "info": "Intensive exposure to current approaches to therapy and rehabilitation of chemically dependent patients. For most of these patients, alcohol is the most abused drug. The course includes participant observation in group therapy sessions and lectures.",
    "prereq": []
  },
  {
    "uid": "795137",
    "code": "FMCH7577",
    "subject": "FMCH",
    "number": "7577",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Comp/Alt Therapies",
    "fullname": "An Introduction to Complementary and Alternative Therapies",
    "info": "Complementary therapies and their integration with allopathic treatments. Observation of complementary care providers in community. Examines culturally-based approaches to health care. Weekly seminars, special project, use of Internet.prereq: Internet access, basic e-mail skills; Nurs 5609 recommended",
    "prereq": {
      "code": "NURS 5609",
      "subject": "NURS",
      "id": "5609"
    }
  },
  {
    "uid": "012523",
    "code": "FMCH7580",
    "subject": "FMCH",
    "number": "7580",
    "honors": false,
    "writingIntensive": false,
    "name": "Community Emergency Medicine",
    "fullname": "Community Emergency Medicine",
    "info": "The student participates in the clinical care of patients with common emergencies. Supervision and teaching is provided by attending staff physicians and/or family practice residents. The student performs initial evaluations and formulates diagnosis and treatment plans.",
    "prereq": []
  },
  {
    "uid": "012524",
    "code": "FMCH7585",
    "subject": "FMCH",
    "number": "7585",
    "honors": false,
    "writingIntensive": false,
    "name": "Sexual Health Concerns in Clin",
    "fullname": "Sexual Health Concerns in Clinical Practice",
    "info": "This course requires a minimum commitment of 40 hours per week (some evening time possible) over a 2-4 week period. Students will have the opportunity for observation and practice of sex-related education and counseling through participation in intake and assessment sequences, individual and conjoint sessions, and group sex therapy. Each student will be supervised by a member of the Program in Human Sexuality staff. The student is expected to participate in several hours of staff conferences and seminars each week. Readings will be assigned.",
    "prereq": []
  },
  {
    "uid": "012525",
    "code": "FMCH7595",
    "subject": "FMCH",
    "number": "7595",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Medicine Research",
    "fullname": "Family Medicine Research",
    "info": "Academic research in collaboration with member of academic or clinical faculty. Identification of parameters/methodological components of family medicine research. Develops knowledge/skills essential for academic careers in family medicine.",
    "prereq": []
  },
  {
    "uid": "820060",
    "code": "FMCH7598",
    "subject": "FMCH",
    "number": "7598",
    "honors": false,
    "writingIntensive": false,
    "name": "Remote Independent Study in FM",
    "fullname": "Remote Independent Study in Family Medicine",
    "info": "This two-week elective is designed to allow students to independently select and review various Family Medicine topics in the form of cases, journals, modules, and presentations. Students will document their time, resources, and take home points throughout the course. Each week students will engage with the course director and their colleagues through the posted discussion points and through a weekly online group discussion. ",
    "prereq": []
  },
  {
    "uid": "012526",
    "code": "FMCH7599",
    "subject": "FMCH",
    "number": "7599",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Med Independent Study",
    "fullname": "Family Medicine Independent Study",
    "info": "This course is intended for a student intererested in pursuing a Family Medicine project that does not fit well in one of the other Family Medicine elective descriptions. For any directed study project, there will be a written agreement between the student and Course Director.",
    "prereq": []
  },
  {
    "uid": "803719",
    "code": "FMCH7600",
    "subject": "FMCH",
    "number": "7600",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Medicine Clerkship",
    "fullname": "Family Medicine Four-Week Clerkship",
    "info": "Ambulatory four-week clerkship.",
    "prereq": []
  },
  {
    "uid": "820007",
    "code": "FMCH7601",
    "subject": "FMCH",
    "number": "7601",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Medicine Clerkship A",
    "fullname": "Family Medicine Clerkship Part A",
    "info": "Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. Catalog Description:  This is a 4 week outpatient clinic-based experience in Family Medicine working with practicing family physicians, colleagues from other disciplines who are working in family medicine clinics and, at some sites, FM residents. The core of the rotation is the 14 days spent in the clinic (except the first Monday, final Friday, and every Wednesday). This is a very hands-on, active patient contact clerkship. Students will spend their four weeks either at a residency clinic or at a community or private practice clinic. We strive to actively involve students in direct patient care with the expectation that a student is directly involved in over 50% of patient encounters in a given day. Students should write up 2-3 notes per half-day. During the 4 weeks, students also attend weekly seminars and didactic skills workshops on Wednesday mornings. In addition there is a comprehensive online curriculum.",
    "prereq": []
  },
  {
    "uid": "820008",
    "code": "FMCH7602",
    "subject": "FMCH",
    "number": "7602",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Medicine Clerkship B",
    "fullname": "Family Medicine Clerkship Part B",
    "info": "Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. Catalog Description:  This is a 4 week outpatient clinic-based experience in Family Medicine working with practicing family physicians, colleagues from other disciplines who are working in family medicine clinics and, at some sites, FM residents. The core of the rotation is the 14 days spent in the clinic (except the first Monday, final Friday, and every Wednesday). This is a very hands-on, active patient contact clerkship. Students will spend their four weeks either at a residency clinic or at a community or private practice clinic. We strive to actively involve students in direct patient care with the expectation that a student is directly involved in over 50% of patient encounters in a given day. Students should write up 2-3 notes per half-day. During the 4 weeks, students also attend weekly seminars and didactic skills workshops on Wednesday mornings. In addition there is a comprehensive online curriculum.",
    "prereq": []
  },
  {
    "uid": "827142",
    "code": "FMCH7655",
    "subject": "FMCH",
    "number": "7655",
    "honors": false,
    "writingIntensive": false,
    "name": "Interdisciplinary Hospice Care",
    "fullname": "Interdisciplinary Rotation in Hospice Care",
    "info": "The course is intended to introduce students to the multidisciplinary field of hospice care. The rotation will be based out of AccentCare Fairview Hospice - West. Primarily students will spend the rotation working with the hospice care consult team; seeing hospice patients with physicians and other practitioners on the multidisciplinary team, including nurse practitioners, social workers, and spiritual health providers.",
    "prereq": []
  },
  {
    "uid": "803720",
    "code": "FMCH7700",
    "subject": "FMCH",
    "number": "7700",
    "honors": false,
    "writingIntensive": false,
    "name": "UCAM Acting Intern Family Med",
    "fullname": "UCAM Acting Internship Family Medicine",
    "info": "Four-week ambulatory experience in family medicine clinic.",
    "prereq": []
  },
  {
    "uid": "804476",
    "code": "FMCH7701",
    "subject": "FMCH",
    "number": "7701",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - Family Medicine Clerksh",
    "fullname": "RPAP: Family Medicine Clerkship",
    "info": "Community-based elective. Extensive primary care experience in rural setting.",
    "prereq": []
  },
  {
    "uid": "804477",
    "code": "FMCH7702",
    "subject": "FMCH",
    "number": "7702",
    "honors": false,
    "writingIntensive": false,
    "name": "RPAP - Primary Care Selective",
    "fullname": "RPAP: Primary Care Selective",
    "info": "Community-based elective. Extensive primary care experience in rural setting.",
    "prereq": []
  },
  {
    "uid": "805684",
    "code": "FMCH7910",
    "subject": "FMCH",
    "number": "7910",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Medicine Med Residency",
    "fullname": "Family Medicine Med Residency",
    "info": "Family Medicine medical residency.",
    "prereq": []
  },
  {
    "uid": "805685",
    "code": "FMCH7930",
    "subject": "FMCH",
    "number": "7930",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Medicine Med Fellowship",
    "fullname": "Family Medicine Med Fellowship",
    "info": "Family medicine medical fellowship.",
    "prereq": []
  }
]