[
  {
    "uid": "008145",
    "code": "FNRM1001",
    "subject": "FNRM",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Orientation/Information System",
    "fullname": "Orientation and Information Systems",
    "info": "Forest resources, recreation resource management, urban forestry programs. Forestry and natural resource careers. Qualification requirements for government positions, competencies, internships, and experiences to compete for jobs in industry. Course planning, mentoring, alumni contacts.  Leadership, organization, process. Lab equipment/software, GUIs, the Internet, spreadsheets, Lumina, periodical indexes.",
    "prereq": []
  },
  {
    "uid": "008244",
    "code": "FNRM1101",
    "subject": "FNRM",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Dendro: Id Forest Trees/Shrubs",
    "fullname": "Dendrology: Identifying Forest Trees and Shrubs",
    "info": "Identification nomenclature, classification, and distribution of common/important forest trees/shrubs. Use of keys. Field/lab methods of identification.",
    "prereq": []
  },
  {
    "uid": "791662",
    "code": "FNRM1901",
    "subject": "FNRM",
    "number": "1901",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "In-depth study of issues/topics related to natural resources and the environment. Topics vary each semester.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "825771",
    "code": "FNRM1902",
    "subject": "FNRM",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Satellites to Drones: Chng Env",
    "fullname": "Satellites to Drones: Monitoring our Changing Environment",
    "info": "This Freshman Seminar course explores the many ways imagery from satellites, airplanes, and more recently drones, allows us to better manage our environment and natural resources. This remotely sensed imagery, combined with other geospatial technologies, gives us an unparalleled ability to monitor our changing world, including identifying natural and anthropogenic environmental impacts such as deforestation and urbanization. Imagery also allows us to plan our land use to minimize or avoid those impacts. In this course, we will discuss how imagery and geospatial data are being used to solve environmental problems, experience imaging data applied to actual environmental issues, learn about the imaging sensors used to acquire these data, and study related applications of remote sensing. We will explore imagery from satellites such as NASA's Landsat, high-resolution commercial sensors (as seen in Google Earth), aircraft-based imaging and lidar sensors, drones, and non-Earth remote sensing. We will discuss the future of the remote sensing of the environment in light of new and emerging imaging technologies.Since this is a Freshman Seminar that is focused on new college students, each class period will begin with a “College Pro Tip” that will cover an important skill, piece of information, or resource that will help you succeed at the University of Minnesota. These will generally take 10-15 minutes, after which we will cover the geospatial topic of the day. See the Class Schedule at the end of this syllabus for more information.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "796276",
    "code": "FNRM1905",
    "subject": "FNRM",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "In-depth study of issues/topics related to natural resources and the environment. Topics vary each semester.",
    "prereq": []
  },
  {
    "uid": "008221",
    "code": "FNRM2101",
    "subject": "FNRM",
    "number": "2101",
    "honors": false,
    "writingIntensive": false,
    "name": "Identifying Forest Plants",
    "fullname": "Identifying Forest Plants",
    "info": "Field identification of common northwoods trees, shrubs, and nonwoody vascular plants. Emphasizes concept of plant communities, soil site relationships, and wildlife values. Taught at Cloquet Forestry Center.",
    "prereq": []
  },
  {
    "uid": "004682",
    "code": "FNRM2102",
    "subject": "FNRM",
    "number": "2102",
    "honors": false,
    "writingIntensive": false,
    "name": "Northern Forests Field Ecology",
    "fullname": "Northern Forests Field Ecology",
    "info": "Field examination of natural history of northern/boreal forests with respect to soils, ecological characteristics of trees, community-environment relationships, stand development, succession, and regeneration ecology. Taught at the Cloquet Forestry Center.prereq: Biol 1001 or Biol 1009",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        }
      ]
    }
  },
  {
    "uid": "004650",
    "code": "FNRM2104",
    "subject": "FNRM",
    "number": "2104",
    "honors": false,
    "writingIntensive": false,
    "name": "Measuring Forest Resources",
    "fullname": "Measuring Forest Resources",
    "info": "Introduction to land survey, tree/forest stand measurement (mensuration), and forest sampling techniques. Taught at Cloquet Forestry Center.",
    "prereq": []
  },
  {
    "uid": "791494",
    "code": "FNRM3101",
    "subject": "FNRM",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Park & Protected Area Tourism",
    "fullname": "Park and Protected Area Tourism",
    "info": "Tourism is a significant industry locally, nationally, and internationally. Park and protected area attractions are among the most visited but also the most vulnerable attractions. This course is designed to familiarize you with the basic concept of park and protected area tourism, including cultural and ecotourism, and then develop your expertise to plan and evaluate sustainable tourism development and operations. Accordingly, you will complete assignments that apply the knowledge gained to planning and evaluation activities. This course is offered partially on-line.COURSE OBJECTIVESBy the end of the class you will be able to:1.Differentiate and appreciate the complexities involved with defining and developing nature, eco, heritage, geo-, park and protected, cultural and \"sustainable tourism.\"2.Identify specific social, economic, and environmental impacts associated with park and protected area tourism, how to measure them, and methods to minimize the negative and maximize the positive impacts.3.Analyze domestic and international case studies of park and protected area tourism.4.Critically evaluate park and protected area tourism services and effective management and planning.5. Create elements of a business plan for park and protected area tourism operations that emphasize sustainability.",
    "prereq": []
  },
  {
    "uid": "005115",
    "code": "FNRM3104",
    "subject": "FNRM",
    "number": "3104",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest Ecology",
    "fullname": "Forest Ecology",
    "info": "Form and function of forests as ecological systems. Characteristics and dynamics of species, populations, communities, landscapes, and ecosystem processes. Examples applying ecology to forest management. Weekly discussions focus on research topics in forest ecology, exercises applying course concepts, and current issues in forest resource management. Required weekend field trip.Prereq: Biol 1001, 1009 or equivalent introductory biology course; 1 semester college chemistry recommended.",
    "prereq": {
      "and": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "FNRM 1009",
          "subject": "FNRM",
          "id": "1009"
        }
      ]
    }
  },
  {
    "uid": "006414",
    "code": "FNRM3114",
    "subject": "FNRM",
    "number": "3114",
    "honors": false,
    "writingIntensive": false,
    "name": "Hydrology and Watershed Mgmt",
    "fullname": "Hydrology and Watershed Management",
    "info": "Hydrologic cycle and water processes in upland/riparian systems. Applications of hydrological concepts to evaluate impacts of forest and land management activities on water yield, streamflow, groundwater erosion, sedimentation, and water quality. Concepts, principles, and applications of riparian/watershed management. Regional/national/global examples. Forest ecosystems.prereq: [[BIOL 1001 or BIOL 1009], [[CHEM 1015, CHEM 1017] or CHEM 1021], MATH 1151] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "BIOL 1001",
              "subject": "BIOL",
              "id": "1001"
            },
            {
              "code": "BIOL 1009",
              "subject": "BIOL",
              "id": "1009"
            }
          ]
        },
        {
          "or": [
            {
              "and": [
                {
                  "code": "CHEM 1015",
                  "subject": "CHEM",
                  "id": "1015"
                },
                {
                  "code": "CHEM 1017",
                  "subject": "CHEM",
                  "id": "1017"
                }
              ]
            },
            {
              "code": "CHEM 1021",
              "subject": "CHEM",
              "id": "1021"
            }
          ]
        },
        {
          "code": "MATH 1151",
          "subject": "MATH",
          "id": "1151"
        }
      ]
    }
  },
  {
    "uid": "004884",
    "code": "FNRM3131",
    "subject": "FNRM",
    "number": "3131",
    "honors": false,
    "writingIntensive": false,
    "name": "GIS for Natural Resources",
    "fullname": "Geographical Information Systems (GIS) for Natural Resources",
    "info": "Spatial data development/analysis in science/management of natural resources. Data structures/sources/collection/quality. Geodesy, map projections, spatial/tabular data analysis. Digital terrain analysis, cartographic modeling, modeling perspectives, limits of technology. Lab exercises.  Both onsite and fully online options for course enrollment.prereq: Soph or jr or sr or UHP fr",
    "prereq": []
  },
  {
    "uid": "796632",
    "code": "FNRM3201",
    "subject": "FNRM",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Travel & Tourism",
    "fullname": "Introduction to Travel and Tourism",
    "info": "Travel and tourism is called one of the largest industries in the world today. This course introduces students to the nature, structure, and complexity of the travel and tourism system. Specific focus is placed on understanding the tourism system and its impact globally on economies, environments, and people. Using a lens of sustainability, students will examine the functions and interconnectedness of the various sectors within the tourism system and the role of diverse and sometimes competing priorities of stakeholders in the creation, delivery, and integration of tourism. The course uses readings, case studies, discussion, and applied projects to develop students understanding of tourism and how communities, businesses, and government can maximize benefits associated with the demand for tourism while protecting the natural and human resources upon which it depends.",
    "prereq": []
  },
  {
    "uid": "790862",
    "code": "FNRM3203",
    "subject": "FNRM",
    "number": "3203",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest Fire & Disturbance Ecol",
    "fullname": "Forest Fire and Disturbance Ecology",
    "info": "Ecology, history, management, control of fire, wind, insect infestation, deer browsing, other disturbances in forests, including disturbance regimes of boreal, northern hardwood, savannas of North America. Influence of disturbance on wildlife habitat, urban/wildland interfaces, forest management, stand/landscape dynamics. Tree mortality in fires, successional patterns created by fires, interactions of life history traits of plants with disturbances.",
    "prereq": []
  },
  {
    "uid": "795383",
    "code": "FNRM3204",
    "subject": "FNRM",
    "number": "3204",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Ecology & Mgmt",
    "fullname": "Landscape Ecology and Management",
    "info": "Introduction to landscape ecology at different scales in time/space. Development/implications of broad-scale patterns of ecological phenomena, role of disturbance in ecosystems, characteristic spatial/temporal scales of ecological events. Principles of landscape ecology as framework for landscape research, analysis, conservation, and management.prereq: Ecology course",
    "prereq": []
  },
  {
    "uid": "795193",
    "code": "FNRM3205",
    "subject": "FNRM",
    "number": "3205",
    "honors": false,
    "writingIntensive": false,
    "name": "Prodctvty&Ecol of Forest Soils",
    "fullname": "Productivity and Ecology of Forest Soils",
    "info": "Forest soils are fundamental to the development and function of forested ecosystems. This course will focus on soil-site factors affecting plant and wildlife communities, site quality estimation, site modification and enhancement, and the effects of forest management and other human-related disturbances on forest soil functions. Prior coursework in soils, hydrology, and forest management will enhance student learning, but are not required for successful completion of the course.",
    "prereq": []
  },
  {
    "uid": "810655",
    "code": "FNRM3206",
    "subject": "FNRM",
    "number": "3206",
    "honors": false,
    "writingIntensive": false,
    "name": "Protected Area Field Studies",
    "fullname": "Park and Protected Area Management Field Studies",
    "info": "This course is designed to be a directed field study of park and protected area management including observation of and training in (1) recreation planning and visitor management, (2) cultural resource management, (3) natural resource management, (4) nature-based tourism management, and (5) resource interpretation and communication across local, state, federal and tribal park and protected areas in northern Minnesota. prereq: Sophomore status or higher",
    "prereq": []
  },
  {
    "uid": "810631",
    "code": "FNRM3208",
    "subject": "FNRM",
    "number": "3208",
    "honors": false,
    "writingIntensive": false,
    "name": "Tropical Forest Ecology",
    "fullname": "Tropical Forest Ecology, Natural History and Measurements",
    "info": "Nepal Semester Abroad course. Forest ecology/measurement skills applicable in variety of settings from forests of Minnesota to community of forests of Nepal. Participatory approach. Students work directly with members of Community Forest User Groups.",
    "prereq": []
  },
  {
    "uid": "004659",
    "code": "FNRM3218",
    "subject": "FNRM",
    "number": "3218",
    "honors": false,
    "writingIntensive": false,
    "name": "Measuring and Modeling Forests",
    "fullname": "Measuring and Modeling Forests",
    "info": "Sampling design, survey techniques to assess resource conditions. Applying metrics/sampling methods to forest vegetation. Calculating tree/stand volume. Modeling approaches. Case studies of modeling to project future growth. Landscape processes, characterization, modeling.prereq: [ESPM 3012 or STAT 3011], MATH 1151",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "ESPM 3012",
              "subject": "ESPM",
              "id": "3012"
            },
            {
              "code": "STAT 3011",
              "subject": "STAT",
              "id": "3011"
            }
          ]
        },
        {
          "code": "MATH 1151",
          "subject": "MATH",
          "id": "1151"
        }
      ]
    }
  },
  {
    "uid": "008522",
    "code": "FNRM3262",
    "subject": "FNRM",
    "number": "3262",
    "honors": false,
    "writingIntensive": false,
    "name": "Rem Sen&Geo Ana Nat Res&Env",
    "fullname": "Remote Sensing and Geospatial Analysis of Natural Resources and Environment",
    "info": "Introductory principles and techniques of remote sensing and geospatial analysis applied to mapping and monitoring land and water resources from local to global scales. Examples of applications include: Land cover mapping and change detection, forest and natural resource inventory, water quality monitoring, and global change analysis. The lab provides hands-on experience working with satellite, aircraft, and drone imagery, and image processing methods and software. Prior coursework in Geographic Information Systems and introductory Statistics is recommended.Prereq: None, but prior coursework in GIS and Statistics is recommended.",
    "prereq": []
  },
  {
    "uid": "800939",
    "code": "FNRM3301",
    "subject": "FNRM",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "International Tourism",
    "fullname": "International Tourism",
    "info": "Role of tourism across the globe. Global tourism industry. Tourist generating/receiving areas. International tourism organizations. Tourism policy.",
    "prereq": []
  },
  {
    "uid": "818256",
    "code": "FNRM3362",
    "subject": "FNRM",
    "number": "3362",
    "honors": false,
    "writingIntensive": false,
    "name": "Drones:DataAnalysis&Operations",
    "fullname": "Drones: Data, Analysis, and Operations",
    "info": "This course explores principles and techniques of Unmanned Aircraft Systems (UAS, also 'drones'), applied to natural resource and environmental issues. The course provides hands-on experience with UAS vehicles, sensors, imagery, and software. Course topics include: UAS flight characteristics, regulations/safety, mission planning, flight operations, data collection, image analysis, and applications. Examples of UAS applications to be explored include forest and natural resource inventory, wetland monitoring, and land cover mapping.Prereq: None, but prior coursework in GIS is recommended.",
    "prereq": []
  },
  {
    "uid": "006979",
    "code": "FNRM3411",
    "subject": "FNRM",
    "number": "3411",
    "honors": false,
    "writingIntensive": false,
    "name": "Manage Forest Eco Silviculture",
    "fullname": "Managing Forest Ecosystems: Silviculture",
    "info": "Management of forest ecosystems for sustaining ecological integrity, soil productivity, water quality, wildlife habitat, biological diversity, commodity production in landscape context. Silvics, forest dynamics, disturbances, regeneration, restoration, silvicultural systems. Ramifications of management choices. Weekend field trip. FEMC track students should take FNRM 5413 concurrently",
    "prereq": []
  },
  {
    "uid": "007400",
    "code": "FNRM3431",
    "subject": "FNRM",
    "number": "3431",
    "honors": false,
    "writingIntensive": false,
    "name": "Timber Harvesting & Road Plng",
    "fullname": "Timber Harvesting and Road Planning",
    "info": "Introduction to forest operations. Terminology, basic engineering, equipment and harvesting system options, productivity/costs. Relationship to forest management and silviculture. Road planning, forest management guidelines, approaches for mitigating potential impacts to forest resources. Environmental implications of method/equipment choices. Selling timber. Sale design, layout, and administration. One all-day field trip.prereq: FNRM 3411 or instr consent",
    "prereq": {
      "code": "FNRM 3411",
      "subject": "FNRM",
      "id": "3411"
    }
  },
  {
    "uid": "818257",
    "code": "FNRM3462",
    "subject": "FNRM",
    "number": "3462",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Remote Sen&Geospa Analysis",
    "fullname": "Advanced Remote Sensing and Geospatial Analysis",
    "info": "This course builds on the introductory remote sensing class, FNRM 3262/5262. It provides a detailed treatment of advanced remote sensing and geospatial theory and methods including Object-Based Image Analysis (OBIA), lidar processing and derivatives, advanced classification algorithms (including Random Forest, Neural Networks, Support Vector Machines), biophysics of remote sensing, measurements and sensors, data transforms, data fusion, multi-temporal analysis, and empirical modeling. In-class and independent lab activities will be used to apply the course topics to real-world problems. Prior coursework in Geographic Information Systems, remote sensing, and statistics is necessary.prereq: FNRM 3262/5262 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "FNRM 3262",
          "subject": "FNRM",
          "id": "3262"
        },
        {
          "code": "FNRM 5262",
          "subject": "FNRM",
          "id": "5262"
        }
      ]
    }
  },
  {
    "uid": "791359",
    "code": "FNRM3471",
    "subject": "FNRM",
    "number": "3471",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest Management Planning",
    "fullname": "Forest Management Planning",
    "info": "Management science as applied to forest decision-making to help develop better forest management plans. Helps students develop a basic understanding of common analytical tools from operations research and how they are applied to forestry problems to help explore many potential solutions. Also reviews traditional approaches based on simulation. Emphasizes trade-off information, interpretation of model results, and linkages between stand-level economic analysis and forest-wide planning.  Reviews recent modeling efforts in Minnesota. Includes synthesis of information from multiple natural resource disciplines. Guest speakers demonstrate value of analyses in planning. Emphasizes homework assignments with some group work. An individual project requires an informal class presentation.prereq: recommended ESPM 3261 and [3218 or 3411]",
    "prereq": {
      "and": [
        {
          "code": "ESPM 3261",
          "subject": "ESPM",
          "id": "3261"
        },
        {
          "or": [
            {
              "code": "FNRM 3218",
              "subject": "FNRM",
              "id": "3218"
            },
            {
              "code": "FNRM 3411",
              "subject": "FNRM",
              "id": "3411"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "015043",
    "code": "FNRM3480",
    "subject": "FNRM",
    "number": "3480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Natural Resources",
    "fullname": "Topics in Natural Resources",
    "info": "Lectures in special fields of natural resources given by visiting scholar or faculty member. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "007170",
    "code": "FNRM3501",
    "subject": "FNRM",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Arboricultr:Select/Maint Trees",
    "fullname": "Arboriculture: Selection and Maintenance of Trees",
    "info": "Selection, growth, propagation, and maintenance of trees for urban spaces.  Tree selection, site preparation, plant health care management. Prevention, diagnosis, and remediation of urban tree risks such as insects, pathogens, pollution, development, and climate change.",
    "prereq": []
  },
  {
    "uid": "819782",
    "code": "FNRM3562",
    "subject": "FNRM",
    "number": "3562",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Remote Sensing",
    "fullname": "Field Remote Sensing",
    "info": "This course is intended to be taken with, or after, the introductory remote sensing class, FNRM 3262/5262. It builds on the introductory course by providing a field context to the remote sensing discipline. We will focus on field methods and associated analyses that are typical in using and applying imagery and other spatial data. We will use a variety of remote sensing imagery, maps, field data collection tools, and software. Students will learn in an active, hands-on, way through multiple small-group field exercises. This course includes two eight-hour weekend field sessions.",
    "prereq": []
  },
  {
    "uid": "015440",
    "code": "FNRM3993",
    "subject": "FNRM",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. Prereq: Department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements",
    "prereq": []
  },
  {
    "uid": "819516",
    "code": "FNRM3994",
    "subject": "FNRM",
    "number": "3994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use the University-wide on-line directed research contract process in order to enroll. Prereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "006635",
    "code": "FNRM4232W",
    "subject": "FNRM",
    "number": "4232",
    "honors": false,
    "writingIntensive": true,
    "name": "Managing Recreational Lands",
    "fullname": "Managing Recreational Lands",
    "info": "Most of us participate in some form of outdoor recreation: hiking, hunting, riding all-terrain vehicles, or simply enjoying nature. Managing for outdoor recreation on public lands is mandated by federal law and an integral part of natural resource management. In this class, we'll learn why and how agencies manage recreation at the federal level, the management frameworks that guide this work, and apply management principles to an actual federal property in Minnesota.This course is designed to provide students with an understanding of the principles and practices of outdoor recreation management. Specific objectives are to:1)compare and contrast federal recreation land management policies & organizations,2)develop and demonstrate an understanding of conceptual frameworks for recreation resource and visitor use management,3)evaluate visitor caused impacts to resources and to visitor experiences,4)understand and apply management tools designed to reduce recreation- related impacts and conflicts, and5)demonstrate an understanding of course material through exams & applied assignments.",
    "prereq": []
  },
  {
    "uid": "791383",
    "code": "FNRM4501",
    "subject": "FNRM",
    "number": "4501",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Forest Mgmt: Greenspaces",
    "fullname": "Urban Forest Management: Managing Greenspaces for People",
    "info": "Management concepts for green infrastructure of cities, towns, and communities. Urban forest as a social/biological resource. Emphasizes management of urban forest ecosystem to maximize benefits to people. Tree selection, risk assessment, cost-benefit analysis, landscape planning, values, perceptions. How urban forestry can be a tool to improve community infrastructure.",
    "prereq": []
  },
  {
    "uid": "804415",
    "code": "FNRM4511",
    "subject": "FNRM",
    "number": "4511",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Silviculture",
    "fullname": "Field Silviculture",
    "info": "Collection of field data to prepare/write silvicultural prescriptions for regeneration, thinning, and harvesting in context of landscape, watershed, and wildlife habitat issues. Field exercises in forest entomology, pathology, tree improvement, and non-timber forest products. Tree planting. Marking stands for harvest. Taught at the Cloquet Forestry Center. Field trips to forests managed by state/industry.prereq: FNRM 3411",
    "prereq": {
      "code": "FNRM 3411",
      "subject": "FNRM",
      "id": "3411"
    }
  },
  {
    "uid": "804417",
    "code": "FNRM4515",
    "subject": "FNRM",
    "number": "4515",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Resource Survey",
    "fullname": "Field Resource Survey",
    "info": "Field applications of sampling/measurement methods for inventory and assessment of forest and other natural resources. Offered at the Cloquet Forestry Center. prereq: FNRM 3218 or instructor consent",
    "prereq": {
      "code": "FNRM 3218",
      "subject": "FNRM",
      "id": "3218"
    }
  },
  {
    "uid": "804418",
    "code": "FNRM4521",
    "subject": "FNRM",
    "number": "4521",
    "honors": false,
    "writingIntensive": false,
    "name": "Fld Timber Harvstg & Road Plng",
    "fullname": "Field Timber Harvesting and Road Planning",
    "info": "Design, layout, and administration of timber sales. Forest road planning and design. Timber appraisal, forest management guidelines. Field visits to timber harvesting and road planning sites with private organizations. Develop a harvest plan for landowner's property. Taught at the Cloquet Forestry Center. prereq: FNRM 3411 and 3431, or instructor consent.",
    "prereq": {
      "and": [
        {
          "code": "FNRM 3411",
          "subject": "FNRM",
          "id": "3411"
        },
        {
          "code": "FNRM 3431",
          "subject": "FNRM",
          "id": "3431"
        }
      ]
    }
  },
  {
    "uid": "791495",
    "code": "FNRM5101",
    "subject": "FNRM",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Park & Protected Area Tourism",
    "fullname": "Park and Protected Area Tourism",
    "info": "Tourism is a significant industry locally, nationally, and internationally. Park and protected area attractions are among the most visited but also the most vulnerable attractions. This course is designed to familiarize you with the basic concept of park and protected area tourism, including cultural and ecotourism, and then develop your expertise to plan and evaluate sustainable tourism development and operations. Accordingly, you will complete assignments that apply the knowledge gained to planning and evaluation activities. This course is offered partially online.COURSE OBJECTIVES By the end of the class you will be able to:1. Differentiate and appreciate the complexities involved with defining and developing nature, eco, heritage, geo-, park and protected, cultural & \"sustainable tourism.\"2. Identify specific social, economic, and environmental impacts associated with park and protected area tourism, how to measure them, and methods to minimize the negative and maximize the positive impacts.3. Analyze domestic and international case studies of park and protected area tourism.4. Critically evaluate park and protected area tourism services and effective management and planning.5. Create elements of a business plan for park and protected area tourism operations that emphasize sustainability.",
    "prereq": []
  },
  {
    "uid": "005077",
    "code": "FNRM5104",
    "subject": "FNRM",
    "number": "5104",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest Ecology",
    "fullname": "Forest Ecology",
    "info": "Form and function of forests as ecological systems. Characteristics and dynamics of species, populations, communities, landscapes, and ecosystem processes. Examples applying ecology to forest management. Weekly discussions on research topics, exercises, and current issues in forest resource management. Required weekend field trip.Introductory biology course recommended.",
    "prereq": []
  },
  {
    "uid": "790768",
    "code": "FNRM5114",
    "subject": "FNRM",
    "number": "5114",
    "honors": false,
    "writingIntensive": false,
    "name": "Hydrology and Watershed Mgmt",
    "fullname": "Hydrology and Watershed Management",
    "info": "Hydrologic cycle and water processes in upland/riparian systems. Applications of hydrological concepts to evaluate impacts of forest and land management activities on water yield, streamflow, groundwater erosion, sedimentation, and water quality. Concepts, principles, and applications of riparian/watershed management. Regional/national/global examples. Forest ecosystems.",
    "prereq": []
  },
  {
    "uid": "790773",
    "code": "FNRM5131",
    "subject": "FNRM",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "GIS for Natural Resources",
    "fullname": "Geographical Information Systems (GIS) for Natural Resources",
    "info": "Geographic information systems (GIS), focusing on spatial data development and analysis in the science and management of natural resources. Basic data structures, sources, collection, and quality; geodesy and map projections; spatial and tabular data analyses; digital elevation data and terrain analyses; cartographic modeling and layout. Lab exercises provide practical experiences complementing theory covered in lecture.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "825322",
    "code": "FNRM5140",
    "subject": "FNRM",
    "number": "5140",
    "honors": false,
    "writingIntensive": false,
    "name": "TEK & Nat Res Mgmt",
    "fullname": "Traditional Ecological Knowledge and Western Natural Resource Management",
    "info": "This course is designed to refine your understanding of traditional ecological knowledge, Indigenous knowledge, and the relationship to western natural resource sciences and ecology. Students read and discuss foundational and current literature (typically one book per week) on the topic. The course focuses on Indigenous authors and scholarship. This is a graduate seminar where students will lead class discussions and prepare an individual research project (typically a research paper) related to the class topic and/or their thesis. Students will also discuss and practice how to be good relatives.",
    "prereq": []
  },
  {
    "uid": "008211",
    "code": "FNRM5146",
    "subject": "FNRM",
    "number": "5146",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci & Pol of Global Envtl Chng",
    "fullname": "Science and Policy of Global Environmental Change",
    "info": "Intro to critical issues underpinning global change and its biological implications. Current scientific literature on evidence for global change and potential effects on a wide range of biological processes. Economic/political impact on global change.prereq: 3104 or Biol 3407 or equiv",
    "prereq": {
      "or": [
        {
          "code": "FNRM 3104",
          "subject": "FNRM",
          "id": "3104"
        },
        {
          "code": "BIOL 3407",
          "subject": "BIOL",
          "id": "3407"
        }
      ]
    }
  },
  {
    "uid": "006639",
    "code": "FNRM5153",
    "subject": "FNRM",
    "number": "5153",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest Hydro/Watershed Biogeo",
    "fullname": "Forest Hydrology & Watershed Biogeochemistry",
    "info": "This rigorous course examines hydrology and biogeochemical cycling in forested watersheds. Topics include role of forests in hydrologic processes (precipitation, runoff generation, and streamflow) and exports (sediment, carbon, and nitrogen). Readings from primary literature, active discussion participation, research/review paper.\n\nprereq: [Basic hydrology course, one course in ecology, and one course in chemistry [upper div or grad student]] or instr consent",
    "prereq": []
  },
  {
    "uid": "004734",
    "code": "FNRM5161",
    "subject": "FNRM",
    "number": "5161",
    "honors": false,
    "writingIntensive": false,
    "name": "Northern Forest Field Course",
    "fullname": "Northern Forest Field Course",
    "info": "Field identification of common trees, shrubs, and nonwoody vascular plants. Plant communities, soil site relationships, wildlife values. Natural history of northern/boreal forests in terms of soils, ecological characteristics of trees, community-environment relationships, stand development, succession, and regeneration ecology. Land survey, tree/forest stand measurement, forest sampling techniques. Taught at the Cloquet Forestry Center.",
    "prereq": []
  },
  {
    "uid": "796896",
    "code": "FNRM5201",
    "subject": "FNRM",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Travel & Tourism",
    "fullname": "Introduction to Travel and Tourism",
    "info": "Travel and tourism is called one of the largest industries in the world today. This course introduces students to the nature, structure and complexity of the travel and tourism system. Specific focus is placed on understanding the tourism system and its impact globally on economies, environments and people. Using a lens of sustainability, students will examine the functions and interconnectedness of the various sectors within the tourism system and the role of diverse and sometimes competing priorities of stakeholders in the creation, delivery and integration of tourism. The course uses readings, case studies, discussion, and applied projects to develop students understanding of tourism and how communities, businesses, and government can maximize benefits associated with the demand for tourism while protecting the natural and human resources upon which it depends.",
    "prereq": []
  },
  {
    "uid": "790863",
    "code": "FNRM5203",
    "subject": "FNRM",
    "number": "5203",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest Fire & Disturbance Ecol",
    "fullname": "Forest Fire and Disturbance Ecology",
    "info": "Ecology, history, management, control of fire, wind, insect infestation, deer browsing, other disturbances in forests, including disturbance regimes of boreal, northern hardwood, savannas of North America. Influence of disturbance on wildlife habitat, urban/wildland interfaces, forest management, stand/landscape dynamics. Tree mortality in fires, successional patterns created by fires, interactions of life history traits of plants with disturbances.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "795384",
    "code": "FNRM5204",
    "subject": "FNRM",
    "number": "5204",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Ecology & Mgmt",
    "fullname": "Landscape Ecology and Management",
    "info": "Introduction to landscape ecology at different scales in time/space. Development/implications of broad-scale patterns of ecological phenomena, role of disturbance in ecosystems. Characteristic spatial/temporal scales of ecological events. Principles of landscape ecology as framework for landscape research, analysis, conservation, and management.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "795194",
    "code": "FNRM5205",
    "subject": "FNRM",
    "number": "5205",
    "honors": false,
    "writingIntensive": false,
    "name": "Prodctvty/Ecology Forest Soils",
    "fullname": "Productivity and Ecology of Forest Soils",
    "info": "Forest soils are fundamental to the development and function of forested ecosystems. This course will focus on soil-site factors affecting plant and wildlife communities, site quality estimation, site modification and enhancement, and the effects of forest management and other human-related disturbances on forest soil functions. Prior coursework in introductory soils, silviculture, forest hydrology, biogeochemistry, and applied forest ecology are strongly recommended.prereq: grad student or instructor consent",
    "prereq": []
  },
  {
    "uid": "810595",
    "code": "FNRM5206",
    "subject": "FNRM",
    "number": "5206",
    "honors": false,
    "writingIntensive": false,
    "name": "Protected Area Field Studies",
    "fullname": "Park and Protected Area Management Field Studies",
    "info": "This course is designed to be a directed field study of park and protected area management including observation of and training in (1) recreation planning and visitor management, (2) cultural resource management, (3) natural resource management, (4) nature-based tourism management, and (5) resource interpretation and communication across local, state, federal and tribal park and protected areas in northern Minnesota.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "810596",
    "code": "FNRM5208",
    "subject": "FNRM",
    "number": "5208",
    "honors": false,
    "writingIntensive": false,
    "name": "Tropical Forest Ecology",
    "fullname": "Tropical Forest Ecology, Natural History and Measurements",
    "info": "Nepal Semester Abroad course. Forest ecology/forest measurement skills applicable in variety of settings from forests of Minnesota to community forests of Nepal. Participatory approach. Students work directly with members of Community Forest User Groups.",
    "prereq": []
  },
  {
    "uid": "816956",
    "code": "FNRM5216",
    "subject": "FNRM",
    "number": "5216",
    "honors": false,
    "writingIntensive": false,
    "name": "Geodesy/Coord/SurvCalc GISPro",
    "fullname": "Geodesy, Coordinate, and Surveying Calculations for GIS Professionals",
    "info": "Where exactly are we? How do we define and refine geographic locations on a lumpy, spinning, unstable planet? On course completion students will understand concepts and practices that are at the very foundation of GIS: geodesy and geographic projections. They will have a working knowledge of geodetic datums and datum evolution, be able to make common geodetic and coordinate geometry calculations, and solve common problems that arise during datum and coordinate system conversions while engaged in the practice of GIS.",
    "prereq": []
  },
  {
    "uid": "790767",
    "code": "FNRM5218",
    "subject": "FNRM",
    "number": "5218",
    "honors": false,
    "writingIntensive": false,
    "name": "Measuring & Modeling Forests",
    "fullname": "Measuring and Modeling Forests",
    "info": "General sampling design and survey techniques to assess current resource conditions. Application of metrics/sampling methods to forest vegetation.  Calculation of tree/stand volume, selection of modeling approaches. Case studies of modeling to project future growth. Landscape processes, characterization, and modeling.",
    "prereq": []
  },
  {
    "uid": "004668",
    "code": "FNRM5228",
    "subject": "FNRM",
    "number": "5228",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Top Asst & Model of Forest",
    "fullname": "Advanced Topics in Assessment and Modeling of Forests",
    "info": "Application of recently developed mathematics, computer science, and statistics methodologies to natural resource functioning, management, and use problems. Specific topics, software, and methodologies vary.prereq: 3218, Math 1272, Stat 5021",
    "prereq": {
      "and": [
        {
          "code": "FNRM 3218",
          "subject": "FNRM",
          "id": "3218"
        },
        {
          "code": "MATH 1272",
          "subject": "MATH",
          "id": "1272"
        },
        {
          "code": "STAT 5021",
          "subject": "STAT",
          "id": "5021"
        }
      ]
    }
  },
  {
    "uid": "790775",
    "code": "FNRM5232",
    "subject": "FNRM",
    "number": "5232",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Recreational Lands",
    "fullname": "Managing Recreational Lands",
    "info": "Most of us participate in some form of outdoor recreation: hiking, hunting, riding all-terrain vehicles, or simply enjoying nature. Managing for outdoor recreation on public lands is mandated by federal law and an integral part of natural resource management. In this class, well learn why and how agencies manage recreation at the federal level, the management frameworks that guide this work, and apply management principles to an actual federal property in Minnesota.This course is designed to provide students with an understanding of the principles and practices of outdoor recreation management. Specific objectives are to:1) Compare and contrast federal recreation land management policies and organizations,2) Develop and demonstrate an understanding of conceptual frameworks for recreation resource and visitor use management,3) Evaluate visitor caused impacts to resources and to visitor experiences,4) Understand and apply management tools designed to reduce recreation- related impacts and conflicts, and5) Demonstrate an understanding of course material through exams and applied assignments.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "791905",
    "code": "FNRM5259",
    "subject": "FNRM",
    "number": "5259",
    "honors": false,
    "writingIntensive": false,
    "name": "Visitor Behavior Analysis",
    "fullname": "Visitor Behavior Analysis",
    "info": "Recreation, leisure, and tourism are significant parts of the world, national, and state economies. Understanding visitor behavior is important and has significant implications for organizations, agencies, and businesses related to parks, tourism destinations, and museums.In this class, you will learn to apply both social science theory and methods to understand consumers, with an emphasis on visitors to parks and protected areas. You will immediately apply your learning of survey development, interviewing, observation and content analysis to real-word situations in class projects. This is an online course.",
    "prereq": []
  },
  {
    "uid": "790776",
    "code": "FNRM5262",
    "subject": "FNRM",
    "number": "5262",
    "honors": false,
    "writingIntensive": false,
    "name": "Rem Sen&Geo Ana Nat Res&Env",
    "fullname": "Remote Sensing and Geospatial Analysis of Natural Resources and Environment",
    "info": "Introductory principles and techniques of remote sensing and geospatial analysis applied to mapping and monitoring land and water resources from local to global scales. Examples of applications include: Land cover mapping and change detection, forest and natural resource inventory, water quality monitoring, and global change analysis. The lab provides hands-on experience working with satellite, aircraft, and drone imagery, and image processing methods and software. Prior coursework in Geographic Information Systems and introductory Statistics is recommended.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "006986",
    "code": "FNRM5264",
    "subject": "FNRM",
    "number": "5264",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Forest Mgmt Planning",
    "fullname": "Advanced Forest Management Planning",
    "info": "Modeling tools for forest planning to better integrate forest resource conditions/uses and better understand trade-offs and potential management strategies. Analyzing facets of forest management that add complexity including multi-market interactions, temporal detail, spatial objectives, planning under uncertainty, and recourse strategies. Optimization models, decomposition and heuristic techniques designed to capitalize on characteristics of forestry problems. Case studies involving recent or ongoing large-scale applications. Student projects with opportunity to tailor to student interests or expertise.",
    "prereq": []
  },
  {
    "uid": "800940",
    "code": "FNRM5301",
    "subject": "FNRM",
    "number": "5301",
    "honors": false,
    "writingIntensive": false,
    "name": "International Tourism",
    "fullname": "International Tourism",
    "info": "Role of tourism across the globe. Global tourism industry. Tourist generating/receiving areas. International tourism organizations. Tourism policy.",
    "prereq": []
  },
  {
    "uid": "818072",
    "code": "FNRM5362",
    "subject": "FNRM",
    "number": "5362",
    "honors": false,
    "writingIntensive": false,
    "name": "Drones:DataAnalysis&Operations",
    "fullname": "Drones: Data, Analysis, and Operations",
    "info": "This course explores principles and techniques of Unmanned Aircraft Systems (UAS, also \"drones\"), applied to natural resource and environmental issues. The course provides hands-on experience with UAS vehicles, sensors, imagery, and software. Course topics include: UAS flight characteristics, regulations/safety, mission planning, flight operations, data collection, image analysis, and applications. Examples of UAS applications to be explored include: forest and natural resource inventory, wetland monitoring, and land cover mapping.Prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "790777",
    "code": "FNRM5411",
    "subject": "FNRM",
    "number": "5411",
    "honors": false,
    "writingIntensive": false,
    "name": "Manage Forest Eco Silviculture",
    "fullname": "Managing Forest Ecosystems: Silviculture",
    "info": "Management of forest ecosystems for sustaining ecological integrity, soil productivity, water quality, wildlife habitat, biological diversity, commodity production in landscape context. Silvics, forest dynamics, disturbances, regeneration, restoration, silvicultural systems. Ramifications of management choices. Weekend field trip.FEMC track students should take FNRM 5413 concurrently.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "794695",
    "code": "FNRM5413",
    "subject": "FNRM",
    "number": "5413",
    "honors": false,
    "writingIntensive": false,
    "name": "Mng For Ecosys:Silvicultre Lab",
    "fullname": "Managing Forest Ecosystems: Silviculture Lab",
    "info": "Development of silvicultural prescriptions to achieve various landowner objectives. Timber cruise, growth/yield simulations, stand density management diagrams, thinning schedules, use of forest vegetation simulator. Field trips, computer labs, lectures.prereq: FNRM major or minor or grad student; FNRM-FEMC track students should take FNRM 3411/5411 concurrently or instructor consent",
    "prereq": {
      "or": [
        {
          "code": "FNRM 3411",
          "subject": "FNRM",
          "id": "3411"
        },
        {
          "code": "FNRM 5411",
          "subject": "FNRM",
          "id": "5411"
        }
      ]
    }
  },
  {
    "uid": "790778",
    "code": "FNRM5431",
    "subject": "FNRM",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "Timber Harvesting & Road Plng",
    "fullname": "Timber Harvesting and Road Planning",
    "info": "Introduction to forest operations. Terminology, basic engineering, equipment and harvesting system options, productivity/costs. Relationship to forest management and silviculture. Road planning, forest management guidelines, approaches for mitigating potential impacts to forest resources. Environmental implications of method/equipment choices. Selling timber. Sale design, layout, and administration. One all-day field trip.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "008531",
    "code": "FNRM5462",
    "subject": "FNRM",
    "number": "5462",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Remote Sen&Geospa Analysis",
    "fullname": "Advanced Remote Sensing and Geospatial Analysis",
    "info": "This course builds on the introductory remote sensing class, FNRM 3262/5262. It provides a detailed treatment of advanced remote sensing and geospatial theory and methods including Object-Based Image Analysis (OBIA), lidar processing and derivatives, advanced classification algorithms (including Random Forest, Neural Networks, Support Vector Machines), biophysics of remote sensing, measurements and sensors, data transforms, data fusion, multi-temporal analysis, and empirical modeling. In-class and independent lab activities will be used to apply the course topics to real-world problems. Prior coursework in Geographic Information Systems, remote sensing, and statistics is necessary.Prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "004823",
    "code": "FNRM5471",
    "subject": "FNRM",
    "number": "5471",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest Management Planning",
    "fullname": "Forest Management Planning",
    "info": "Management science as applied to forest decision-making to help develop better forest management plans. Helps students develop a basic understanding of common analytical tools from operations research and how they are applied to forestry problems to help explore many potential solutions. Also reviews traditional approaches based on simulation. Emphasizes trade-off information, interpretation of model results, and linkages between stand-level economic analysis and forest-wide planning. Reviews recent modeling efforts in Minnesota. Includes synthesis of information from multiple natural resource disciplines. Guest speakers demonstrate value of analyses in planning. Emphasizes homework assignments with some group work. An individual project requires an informal class presentation.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "790769",
    "code": "FNRM5480",
    "subject": "FNRM",
    "number": "5480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Natural Resources",
    "fullname": "Topics in Natural Resources",
    "info": "Lectures in special fields of natural resources given by visiting scholar or faculty member. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "007171",
    "code": "FNRM5501",
    "subject": "FNRM",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Forest Mgmt: Greenspaces",
    "fullname": "Urban Forest Management: Managing Greenspaces for People",
    "info": "Management concepts for green infrastructure of cities, towns, and communities. Urban forest as social/biological resource. Emphasizes management of urban forest ecosystem to maximize benefits. Tree selection, risk assessment, cost-benefit analysis, landscape planning, values, perceptions. How urban forestry can be a tool to improve community infrastructure.",
    "prereq": []
  },
  {
    "uid": "819735",
    "code": "FNRM5562",
    "subject": "FNRM",
    "number": "5562",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Remote Sensing",
    "fullname": "Field Remote Sensing",
    "info": "This course is intended to be taken with, or after, the introductory remote sensing class, FNRM 3262/5262. It builds on the introductory course by providing a field context to the remote sensing discipline. We will focus on field methods and associated analyses that are typical in using and applying imagery and other spatial data. We will use a variety of remote sensing imagery, maps, field data collection tools, and software. Students will learn in an active, hands-on, way through multiple small-group field exercises. This course includes two eight-hour weekend field sessions.Prerequisite: grad student",
    "prereq": []
  },
  {
    "uid": "007159",
    "code": "FNRM5611",
    "subject": "FNRM",
    "number": "5611",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Silviculture",
    "fullname": "Field Silviculture",
    "info": "Collection of field data to prepare/write silvicultural prescriptions for regeneration, thinning, and harvesting in context of landscape, watershed, and wildlife habitat issues. Field exercises in forest entomology, pathology, tree improvement, and non-timber forest products. Tree planting. Marking stands for harvest. Taught at Cloquet Forestry Center. Field trips to forests managed by state/industry.",
    "prereq": []
  },
  {
    "uid": "008520",
    "code": "FNRM5615",
    "subject": "FNRM",
    "number": "5615",
    "honors": false,
    "writingIntensive": false,
    "name": "Fld Remote Sensing/Res Survey",
    "fullname": "Field Remote Sensing and Resource Survey",
    "info": "Field applications of remote sensing, sampling/measurement methods to inventory/mapping of forest and other natural resources. Offered at the Cloquet Forestry Center.",
    "prereq": []
  },
  {
    "uid": "007398",
    "code": "FNRM5621",
    "subject": "FNRM",
    "number": "5621",
    "honors": false,
    "writingIntensive": false,
    "name": "Fld Timber Harvstg & Road Plng",
    "fullname": "Field Timber Harvesting and Road Planning",
    "info": "Design, layout, and administration of timber sales. Forest road planning and design. Protecting residual trees during harvesting operations. Timber appraisal, forest management guidelines. Road location and profiling. Planning/layout considerations. Field trips to visit timber harvesting and road planning sites with public and private organizations. Taught at the Cloquet Forestry Center.",
    "prereq": []
  },
  {
    "uid": "008480",
    "code": "FNRM8101",
    "subject": "FNRM",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prob: Physiologic Ecology",
    "fullname": "Research Problems: Physiological Ecology",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008481",
    "code": "FNRM8102",
    "subject": "FNRM",
    "number": "8102",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prob: Forest Tree Genetics",
    "fullname": "Research Problems: Forest-Tree Genetics",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008482",
    "code": "FNRM8103",
    "subject": "FNRM",
    "number": "8103",
    "honors": false,
    "writingIntensive": false,
    "name": "Resrch Prob: Forest Hydrology",
    "fullname": "Research Problems: Forest Hydrology",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008483",
    "code": "FNRM8104",
    "subject": "FNRM",
    "number": "8104",
    "honors": false,
    "writingIntensive": false,
    "name": "Resrch Prob: Forest Ecology",
    "fullname": "Research Problems: Forest Ecology",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008479",
    "code": "FNRM8105",
    "subject": "FNRM",
    "number": "8105",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Problem: Silviculture",
    "fullname": "Research Problems: Silviculture",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "014970",
    "code": "FNRM8106",
    "subject": "FNRM",
    "number": "8106",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prob:Urban For-Bio & Mgmt",
    "fullname": "Research Problems: Urban Forestry--Biology and Management",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "817916",
    "code": "FNRM8108",
    "subject": "FNRM",
    "number": "8108",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prob: Forest Ecosys Health",
    "fullname": "Research Problems: Forest Ecosystem Health",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "819993",
    "code": "FNRM8109",
    "subject": "FNRM",
    "number": "8109",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prob: Indigenous N R Mgmt",
    "fullname": "Research Problems: Indigenous Natural Resource Management",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008486",
    "code": "FNRM8201",
    "subject": "FNRM",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Resrch Prob: Forest Economics",
    "fullname": "Research Problems: Forest Economics",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008489",
    "code": "FNRM8202",
    "subject": "FNRM",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prob: Forest Biometry/Meas",
    "fullname": "Research Problems: Forest Biometry and Measurements",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008490",
    "code": "FNRM8203",
    "subject": "FNRM",
    "number": "8203",
    "honors": false,
    "writingIntensive": false,
    "name": "Resrch Prob: Forest Recreation",
    "fullname": "Research Problems: Forest Recreation",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008491",
    "code": "FNRM8204",
    "subject": "FNRM",
    "number": "8204",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Probs: Forest Policy",
    "fullname": "Research Problems: Forest Policy",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "008492",
    "code": "FNRM8205",
    "subject": "FNRM",
    "number": "8205",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prob: Spatial Data Analysi",
    "fullname": "Research Problems: Spatial Data Analysis",
    "info": "Independent research under faculty guidance.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "008485",
    "code": "FNRM8206",
    "subject": "FNRM",
    "number": "8206",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Problems: Forest Mgmt",
    "fullname": "Research Problems: Forest Management",
    "info": "Independent research under faculty guidance.",
    "prereq": []
  },
  {
    "uid": "005373",
    "code": "FNRM8207",
    "subject": "FNRM",
    "number": "8207",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ Analysis of NR  Projects",
    "fullname": "Economic Analysis of Natural Resource Projects",
    "info": "Independent research under faculty guidance.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "015392",
    "code": "FNRM8208",
    "subject": "FNRM",
    "number": "8208",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Prob: Env Lrnng & Ldrshp",
    "fullname": "Research Problems: Environmental Learning and Leadership",
    "info": "Independent research under faculty guidance.prereq: instr consent",
    "prereq": []
  }
]