[
  {
    "uid": "007426",
    "code": "FSOS1101",
    "subject": "FSOS",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intimate Relationships",
    "fullname": "Intimate Relationships",
    "info": "Couple dynamics. Overview of how to develop, maintain, and terminate an intimate relationship. Communication, conflict resolution, power, roles. Programs for marriage preparation, marriage enrichment, and marital therapy.",
    "prereq": []
  },
  {
    "uid": "794630",
    "code": "FSOS1201",
    "subject": "FSOS",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Develop Fam: Lifespan",
    "fullname": "Human Development in Families: Lifespan",
    "info": "Human development in a family context. Life-course and human development theories. Individual/family development, mate selection, birth, life cycle. Physical, cognitive, language, social, social, and personality development. Historical, social, and cultural factors. How theory/research are applied to everyday lives.",
    "prereq": []
  },
  {
    "uid": "816482",
    "code": "FSOS1211",
    "subject": "FSOS",
    "number": "1211",
    "honors": false,
    "writingIntensive": false,
    "name": "Fam in Multicultural America",
    "fullname": "An Interdisciplinary Look at the Family in Multicultural America",
    "info": "This course is designed as an introduction to multicultural families using an ecological lens. The institution of the family is recognized globally as a basic unit of a society that produces, develops, socializes, and launches the next generation of its citizenry. This course will focus on families in contemporary America, a society that has grown increasingly diverse, and faces many complex challenges in today’s global environment. Using a human ecological lens allows us to examine families in their nested and interdependent environments--how individuals shape and are shaped by families, their human built environments, their socio-cultural environments, and their natural-physical environments. This is a service learning class.",
    "prereq": []
  },
  {
    "uid": "795773",
    "code": "FSOS1301",
    "subject": "FSOS",
    "number": "1301",
    "honors": false,
    "writingIntensive": false,
    "name": "Cash or Credit:You Need toKnow",
    "fullname": "Cash or Credit: You Need to Know",
    "info": "Factual information about basic money management skills. Topics covered can be applied to everyday life. Online, interactive learning based class.",
    "prereq": []
  },
  {
    "uid": "816448",
    "code": "FSOS1461",
    "subject": "FSOS",
    "number": "1461",
    "honors": false,
    "writingIntensive": false,
    "name": "Presentations at Work",
    "fullname": "Presentations at Work: Families, Communities, Nonprofits, and Schools",
    "info": "This course prepares students to present information and adjust their messages based on audience need in a variety of future work contexts. Students interested in majoring in Family Social Science, Education, Youth Studies, and Kinesiology will take this course in order to develop the disciplinary practices used in counseling, community-based organizations, education, and health sciences to convey important, and often sensitive, material to specific audiences.",
    "prereq": []
  },
  {
    "uid": "798992",
    "code": "FSOS1905",
    "subject": "FSOS",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "007335",
    "code": "FSOS2101",
    "subject": "FSOS",
    "number": "2101",
    "honors": false,
    "writingIntensive": false,
    "name": "PrepWork w/Families",
    "fullname": "Preparation for Working With Families",
    "info": "Systematic preparation for upper division education, research/field internships, and career possibilities in Family Social Science.",
    "prereq": []
  },
  {
    "uid": "794631",
    "code": "FSOS2103",
    "subject": "FSOS",
    "number": "2103",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Policy",
    "fullname": "Family Policy",
    "info": "Connections between policies that governments enact, and families and their well-being. Conceptual frameworks for influences underlying policy choices. Evaluating consequences of such choices for diverse families.",
    "prereq": []
  },
  {
    "uid": "794632",
    "code": "FSOS2105",
    "subject": "FSOS",
    "number": "2105",
    "honors": false,
    "writingIntensive": false,
    "name": "Methods in Family Research",
    "fullname": "Methods in Family Research",
    "info": "Scientific method. Major questions/objectives of family research. Data collection/analysis/reporting. Social context of family research. prereq: STAT 3011 or PSTL 1004 or STAT 1001 or ESPY 3264 or ESPY 1261 or SOC 3811 or SOC 2550 or PSY 3801 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "STAT 3011",
          "subject": "STAT",
          "id": "3011"
        },
        {
          "code": "PSTL 1004",
          "subject": "PSTL",
          "id": "1004"
        },
        {
          "code": "STAT 1001",
          "subject": "STAT",
          "id": "1001"
        },
        {
          "code": "FSOS 3264",
          "subject": "FSOS",
          "id": "3264"
        },
        {
          "code": "FSOS 1261",
          "subject": "FSOS",
          "id": "1261"
        },
        {
          "code": "SOC 3811",
          "subject": "SOC",
          "id": "3811"
        },
        {
          "code": "PSY 3801",
          "subject": "PSY",
          "id": "3801"
        }
      ]
    }
  },
  {
    "uid": "007456",
    "code": "FSOS2106",
    "subject": "FSOS",
    "number": "2106",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Resource Mgmt",
    "fullname": "Family Resource Management",
    "info": "Analysis of how individuals/families use interpersonal, economic, natural, and community resources to make decisions, solve problems, and achieve central life purposes.",
    "prereq": []
  },
  {
    "uid": "817093",
    "code": "FSOS2107",
    "subject": "FSOS",
    "number": "2107",
    "honors": false,
    "writingIntensive": false,
    "name": "Family & Community Engagement",
    "fullname": "Preparation for Family and Community Engagement",
    "info": "This course will focus on preparing students to work with families in a community context. Central themes of the course include strategies for family and community engagement, understanding how families interact with community organizations and institutions, how to mobilize family and community assets, and collaborating with families to create systems change and build positive community resources. The course will pose questions for students about the roles of family professionals in supporting families in community contexts. The course will utilize readings about best practices in family and community engagement, both from the family studies literature and from cutting edge community-based organizations. Students will participate in a community project with a community organization that focuses on supporting families. This will enable them to attend community meetings, shadow family/community liaisons, and better understand the interface between families, community organizations, and institutions. Class assignments will allow students to engage in reflective practice and pull learning from their community-based experiences. They will learn concrete skills like meeting facilitation through a workshop format.",
    "prereq": []
  },
  {
    "uid": "817084",
    "code": "FSOS2108",
    "subject": "FSOS",
    "number": "2108",
    "honors": false,
    "writingIntensive": false,
    "name": "Money Matters in Families",
    "fullname": "Preparation for Family Financial Studies: Money Matters in Families",
    "info": "The goal of this course is to help students understand the role that money plays in the health and well-being of individuals, couples and families across differing social contexts over the life course. The course will teach student how values about money develop within families and society; how these values influence the choices made by families; and the impact of these choices on the quality of couple and family relationships. The course will introduce students to a variety of career paths related to families and money including financial coach, counselor and educator. ",
    "prereq": []
  },
  {
    "uid": "826105",
    "code": "FSOS2150",
    "subject": "FSOS",
    "number": "2150",
    "honors": false,
    "writingIntensive": false,
    "name": "SpecTopics FamSocSc",
    "fullname": "Special Topics in Family Social Science",
    "info": "Review of research/scholarly thought. Topics Specific in Class Schedule",
    "prereq": []
  },
  {
    "uid": "007679",
    "code": "FSOS2191",
    "subject": "FSOS",
    "number": "2191",
    "honors": false,
    "writingIntensive": false,
    "name": "IndStudy FamSocSci",
    "fullname": "Independent Study in Family Social Science",
    "info": "Independent reading or writing or research under faculty supervision.prereq: Soph, instr consent",
    "prereq": []
  },
  {
    "uid": "007460",
    "code": "FSOS3101",
    "subject": "FSOS",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Personal and Family Finances",
    "fullname": "Personal and Family Finances",
    "info": "Analysis of personal/family financial management principles. Financial planning of savings, investments, credit, mortgages, and taxation. Life, disability, health, and property insurance. Public/private pensions. Estate planning.",
    "prereq": []
  },
  {
    "uid": "007433",
    "code": "FSOS3102",
    "subject": "FSOS",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Systems & Diversity",
    "fullname": "Family Systems and Diversity",
    "info": "Family systems/theories applied to dynamics/processes relevant to family life. Diversity issues related to gender, ethnicity, sexual orientation, and disability. Divorce, single parenthood, remarriage. Family strengths/problems.prereq: soph or jr or sr or grad",
    "prereq": []
  },
  {
    "uid": "794633",
    "code": "FSOS3104",
    "subject": "FSOS",
    "number": "3104",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Families",
    "fullname": "Global and Diverse Families",
    "info": "Perspectives on family dynamics of various racial/ethnic populations in the United States/other countries in context of national/international economic, political, and social processes.prereq: at least Soph or instr consent",
    "prereq": []
  },
  {
    "uid": "817143",
    "code": "FSOS3105",
    "subject": "FSOS",
    "number": "3105",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech in Parenting and Family",
    "fullname": "Technology in Parenting and Family Relationships",
    "info": "The role of information and communications technologies in contemporary family life is explored through examination of theory, and research on technology use and family and family member outcomes. Applications of technology in family practice and issues regarding professional preparation will identify avenues for support and development. ",
    "prereq": []
  },
  {
    "uid": "007687",
    "code": "FSOS3150",
    "subject": "FSOS",
    "number": "3150",
    "honors": false,
    "writingIntensive": false,
    "name": "SpecTopics FamSocSc",
    "fullname": "Special Topics in Family Social Science",
    "info": "Review of research/scholarly thought. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "007681",
    "code": "FSOS3191",
    "subject": "FSOS",
    "number": "3191",
    "honors": false,
    "writingIntensive": false,
    "name": "Ind Study Fam Soc Sci",
    "fullname": "Independent Study in Family Social Science",
    "info": "Independent reading or writing or research under faculty supervision.prereq: Jr, instr consent",
    "prereq": []
  },
  {
    "uid": "818797",
    "code": "FSOS3222W",
    "subject": "FSOS",
    "number": "3222",
    "honors": false,
    "writingIntensive": true,
    "name": "Our Addicted World",
    "fullname": "Our Addicted World: Going Beyond the Individual in Looking at the Addiction",
    "info": "This course will explore addiction and how we, as members of a family and community can better understand the complexity of the systems that simultaneously create environments that foster addiction and assist individuals in their quest to heal from addiction. We will explore our personal beliefs and experiences with addiction, often challenging the dominant discourses that inform who gets blamed and who gets helped when dealing with addiction. We will do this by reading, discussing and writing about three different types of addiction that are currently being discussed by families, communities and policymakers: opiate addiction, screen addiction and gambling.",
    "prereq": []
  },
  {
    "uid": "007533",
    "code": "FSOS3426",
    "subject": "FSOS",
    "number": "3426",
    "honors": false,
    "writingIntensive": false,
    "name": "AlcohDrugs: FamCult",
    "fullname": "Alcohol and Drugs: Families and Culture",
    "info": "Psychology/sociology of drug use/abuse. Life-span, epidemiological, familial, cultural data regarding use. Fundamentals of licit/illicit drug use behavior. Variables of gender, ethnicity, social class, sexuality, sexual orientation, disability.",
    "prereq": []
  },
  {
    "uid": "007557",
    "code": "FSOS3427",
    "subject": "FSOS",
    "number": "3427",
    "honors": false,
    "writingIntensive": false,
    "name": "Alcohol & the Brain",
    "fullname": "Alcohol, Drugs, and the Brain",
    "info": "Psychopharmacology of alcohol/drug use. Licit/illicit drugs. Mechanisms of drug action in the brain. Alcohol/drug taking practices. Influence of alcohol/drugs on behavior. Note: This course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007566",
    "code": "FSOS3428",
    "subject": "FSOS",
    "number": "3428",
    "honors": false,
    "writingIntensive": false,
    "name": "Assess/Treat Drug Use",
    "fullname": "Assessment and Treatment of Alcohol and Drug Use Issues",
    "info": "Theoretical/practical approaches to diagnosis, screening, treatment. Issues of loss, trauma, family, culture. Diversity issues of gender, ethnicity, social class, sexuality, disability. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007571",
    "code": "FSOS3429",
    "subject": "FSOS",
    "number": "3429",
    "honors": false,
    "writingIntensive": false,
    "name": "Counsel Skills I",
    "fullname": "Counseling Skills Practicum I",
    "info": "Basic counseling skills. Counselor needs/motivations, non-verbal communication, basic/advanced empathy, identifying strengths, maintaining focus, challenging discrepancies, use of self. Emphasizes building from client strengths, learning through role-playing.",
    "prereq": []
  },
  {
    "uid": "007576",
    "code": "FSOS3431",
    "subject": "FSOS",
    "number": "3431",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Skills Practicum II",
    "fullname": "Counseling Skills Practicum II",
    "info": "Advanced therapeutic methods. Processes of change. Identifying, reinforcing, challenging core beliefs. Reframing. Paradox. Trance, guided imagery. Cognitive-behavioral, solution-focused, narrative therapies. Emphasizes non-pathologizing models of therapy.",
    "prereq": []
  },
  {
    "uid": "007587",
    "code": "FSOS3432",
    "subject": "FSOS",
    "number": "3432",
    "honors": false,
    "writingIntensive": false,
    "name": "Chem Abuse & Fam",
    "fullname": "Chemical Abuse and Families: An Overview",
    "info": "Relationships, family systems, families in which alcohol or drug use is a problem. Family types, family of origin, models of family therapy, family systems theory, alcoholism. Review of literature.",
    "prereq": []
  },
  {
    "uid": "007604",
    "code": "FSOS3433",
    "subject": "FSOS",
    "number": "3433",
    "honors": false,
    "writingIntensive": false,
    "name": "Grp Thpy: Th & Pr",
    "fullname": "Group Therapy: Theory and Practice",
    "info": "Introduction to group therapy concepts. Stages of group development, affective development, group communication. Education, support, therapy groups. Leadership roles/functions, critical incidents, therapeutic factors, group processes. Lecture, small groups. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007617",
    "code": "FSOS3434",
    "subject": "FSOS",
    "number": "3434",
    "honors": false,
    "writingIntensive": false,
    "name": "Gambling in America",
    "fullname": "Gambling in America",
    "info": "Introduction to risk-taking, gambling. Development of gambling problems. Sociological, historical, economic, public policy perspectives. Family influences, gambling among youth, aging adults. Frameworks for assessing/treating problematic gambling. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007620",
    "code": "FSOS3435",
    "subject": "FSOS",
    "number": "3435",
    "honors": false,
    "writingIntensive": false,
    "name": "Intern: Alco & Drug",
    "fullname": "Internship in Alcohol and Other Drug Use Problems",
    "info": "Students are placed in three-four different community agencies/treatment centers. (A separate registration is required for each placement.) An 880-hour rotating clinical internship. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007695",
    "code": "FSOS3436",
    "subject": "FSOS",
    "number": "3436",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethical Issues: Addiction",
    "fullname": "Ethical Issues in Addiction Counseling",
    "info": "Exploration/discussion of ethical issues and challenges in alcohol and drug counseling and therapy. Decision-making; values conflicts; boundary violations; client rights; professional responsibilities; issues in relationship/family therapy, group work, cross-cultural counseling; issues working with special populations.",
    "prereq": []
  },
  {
    "uid": "007697",
    "code": "FSOS3437",
    "subject": "FSOS",
    "number": "3437",
    "honors": false,
    "writingIntensive": false,
    "name": "Supervision Group",
    "fullname": "Supervision Group",
    "info": "Supervision of alcohol/drug use counseling in group format. Each student presents at least one tape of a client counseling session. Role-playing, extensive discussion of clinical issues. Focus on non-pathologizing models of therapy. Training tapes, readings. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007701",
    "code": "FSOS3450",
    "subject": "FSOS",
    "number": "3450",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics: Addiction",
    "fullname": "Special Topics: Addiction",
    "info": "Selected reading or project in alcohol/drug use/problems. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007427",
    "code": "FSOS4101",
    "subject": "FSOS",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Sex/Gender in Fam",
    "fullname": "Sexuality and Gender in Families and Close Relationships",
    "info": "Human ecology/development as frameworks for examining sexuality in close relationships. Diversity of sexual beliefs, attitudes, behaviors within differing social contexts. Using scientific knowledge to promote sexual health among individuals, couples, families through various life stages.prereq: At least jr or instr consent",
    "prereq": []
  },
  {
    "uid": "007466",
    "code": "FSOS4102",
    "subject": "FSOS",
    "number": "4102",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Families",
    "fullname": "Global and Diverse Families",
    "info": "Perspectives on family dynamics of various racial/ethnic populations in the United States/other countries in context of national/international economic, political, and social processes.",
    "prereq": []
  },
  {
    "uid": "007499",
    "code": "FSOS4103",
    "subject": "FSOS",
    "number": "4103",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Policy",
    "fullname": "Family Policy",
    "info": "Connections between policies that governments enact, and families and their well-being. Conceptual frameworks to identify/understand influences underlying policy choices and for evaluating consequences of such choices for diverse families.",
    "prereq": []
  },
  {
    "uid": "007441",
    "code": "FSOS4104",
    "subject": "FSOS",
    "number": "4104",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Psychology",
    "fullname": "Family Psychology",
    "info": "Processes in families of origin, families of choice, and other close relationships, within diverse social contexts. Evaluating current research on family dynamics within/across generations.",
    "prereq": []
  },
  {
    "uid": "007334",
    "code": "FSOS4105",
    "subject": "FSOS",
    "number": "4105",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Research",
    "fullname": "Methods in Family Research",
    "info": "Scientific method. Major questions/objectives of family research. Data collection/analysis/reporting. Social context of family research.",
    "prereq": []
  },
  {
    "uid": "817085",
    "code": "FSOS4107",
    "subject": "FSOS",
    "number": "4107",
    "honors": false,
    "writingIntensive": false,
    "name": "Trauma and Resilience in Fam",
    "fullname": "Traumatic Stress and Resilience in Vulnerable Families Across the Lifespan",
    "info": "This course will focus on stress contexts that place families at risk across the life span such as poverty, war/civil conflict, disability, social disparities/discrimination, and family dissolution. An examination of family strengths, cultural diversity, and approaches for working with families across the life course in community based settings including classrooms, programs, and agencies will be emphasized. This course focuses on vulnerable families and those affected by historical and traumatic stress. It covers family members of all ages who face particular challenges, such as intergenerational exposure to traumatic events, persistent and structural inequality, and health disparities. This course is designed to increase awareness of the conditions that place families and children at risk, the theories and frameworks available to understand these risks, and both individual and family resiliency to these conditions. The course will primarily focus on  a) individual, family, community, and developmental contexts of risk and resiliency, and b) family-level preventive and intervention frameworks and approaches to support individuals and families.",
    "prereq": []
  },
  {
    "uid": "817144",
    "code": "FSOS4108",
    "subject": "FSOS",
    "number": "4108",
    "honors": false,
    "writingIntensive": false,
    "name": "Immigrant & Refugee Families",
    "fullname": "Understanding and Working with Immigrants and Refugee Families",
    "info": "This course focuses on the impact of immigration (i.e., refugee vs. various types of immigration statuses) on family relationships, specifically how culture of origin and acculturation processes influence individuals and families over time; explores issues faced by various immigrant family systems, including a consideration of generational status, gender identities, social classes, and ethnic/racial group identities; develops intercultural interaction skills that prepare students to effectively engage with diverse immigrant families in multiple contexts; and builds practical skills that enhance students abilities to work in and collaborate with community-and faith-based organizations to strengthen cultural resources while overcoming barriers to increase service utilization. ",
    "prereq": []
  },
  {
    "uid": "817342",
    "code": "FSOS4109W",
    "subject": "FSOS",
    "number": "4109",
    "honors": false,
    "writingIntensive": true,
    "name": "Family Theories",
    "fullname": "Family Theories",
    "info": "This course will include a review of current family theories, use of writing self-assessments, and application of theory to phenomena affecting families today.",
    "prereq": []
  },
  {
    "uid": "817094",
    "code": "FSOS4111",
    "subject": "FSOS",
    "number": "4111",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Family Therapy",
    "fullname": "Introduction to Family Therapy",
    "info": "This course is designed as an introduction to the field of Family Therapy. Students who successfully complete the course should be well versed in the basics of both the foundational and contemporary theories of the discipline. Further, students will be exposed to a number of clinical vignettes and case scenarios that demonstrate the application of the theories in pre-recorded family therapy sessions. Through class assignments and discussions, students will be able to make a more informed decision as to whether or not family therapy is a field that holds potential for them in their own professional pursuits. Other mental health disciplines attend to family variables but having a background in family systems theory and family therapy theories will provide a solid knowledge base for someone embarking on a career in family clinical work. Systems theory guides the majority of what will be discussed in class.",
    "prereq": []
  },
  {
    "uid": "007603",
    "code": "FSOS4150",
    "subject": "FSOS",
    "number": "4150",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics",
    "fullname": "Special Topics in Family Social Science",
    "info": "Review of research/scholarly thought. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "007394",
    "code": "FSOS4152",
    "subject": "FSOS",
    "number": "4152",
    "honors": false,
    "writingIntensive": false,
    "name": "Queer Families",
    "fullname": "Queer Families",
    "info": "This course is designed to examine Queer people in families and their unique contribution to the understanding of diversity among families.  Current research, theory, personal narratives, and opportunities for self-reflection will be pathways to learn more about the diverse experiences of those who participate in families with LGBTQ members. Course topics include: family strengths and resilience; intersectionality and identity; racism, homophobia, biphobia, transphobia, and heterosexism; family of origin; chosen families; marriage and divorce; sexuality and intimacy; children and parenting; aging; unique health concerns; and culture. Methodological issues in research and clinical issues for serving LGBTQ families will also be addressed.  ",
    "prereq": []
  },
  {
    "uid": "015813",
    "code": "FSOS4153",
    "subject": "FSOS",
    "number": "4153",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Financial Counseling",
    "fullname": "Family Financial Counseling",
    "info": "Family financial issues are studied with an emphasis on the role of the financial counselor. This course emphasizes the development of professional skills for assisting individuals and families to cope with financial concerns in their day-to-day lives. This course includes an optional service-learning component where students will work throughout the semester with local non-profit organizations focused on financial literacy, financial counseling, financial curriculum development, and/or researching financial resources. This course will require students to produce video recordings. At minimum students will need recording equipment that captures both video and audio. The resulting file will need to be uploaded to the internet. Laptops with webcams and smart phones with video capabilities should be sufficient for this purpose. Equipment and training are available from the Library's SMART Learning Commons. ",
    "prereq": []
  },
  {
    "uid": "007526",
    "code": "FSOS4154",
    "subject": "FSOS",
    "number": "4154",
    "honors": false,
    "writingIntensive": false,
    "name": "Families & Aging",
    "fullname": "Families and Aging",
    "info": "Aging families from diverse socioeconomic/cultural groups as complex multigenerational systems interacting within ever-changing social structures.",
    "prereq": []
  },
  {
    "uid": "007465",
    "code": "FSOS4155",
    "subject": "FSOS",
    "number": "4155",
    "honors": false,
    "writingIntensive": false,
    "name": "Parent-Child Relationships",
    "fullname": "Parent-Child Relationships",
    "info": "History, theories, research, and contemporary practices of parent-child relationships in diverse families/cultures across the life span. Preparation for professionals in education, social work, and other human service occupations.",
    "prereq": []
  },
  {
    "uid": "007480",
    "code": "FSOS4156",
    "subject": "FSOS",
    "number": "4156",
    "honors": false,
    "writingIntensive": false,
    "name": "Leg/Econ Con in Fam",
    "fullname": "Legal-Economic Controversies in Families",
    "info": "Interdisciplinary course for critical thinking about legal-economic controversies across family life span. Principles of argumentation/debate are used to analyze controversies for public decision making about controversial family issues.prereq: 3101 or instr consent",
    "prereq": {
      "code": "FSOS 3101",
      "subject": "FSOS",
      "id": "3101"
    }
  },
  {
    "uid": "817865",
    "code": "FSOS4158",
    "subject": "FSOS",
    "number": "4158",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Change in Thailand",
    "fullname": "Thailand: Global Change, Communities and Families",
    "info": "This interdisciplinary course uses social justice and human ecological lenses to examine global change that is occurring at the intersections among Thailand's natural environment, communities, families, and culture. Topics include globalization, human trafficking, education, religion, environmental issues, and cultural integration/identity formation, particularly among indigenous populations in northern Thailand. Students interact with key community leaders, village leaders, elders, and students who serve as teachers; this leads to critical understanding of Thai culture and the contemporary issues faced by Thailand's families and communities. Through journaling, digital stories, blogging, and discussions, students will synthesize, integrate, apply, and communicate what they've learned.",
    "prereq": []
  },
  {
    "uid": "007682",
    "code": "FSOS4191",
    "subject": "FSOS",
    "number": "4191",
    "honors": false,
    "writingIntensive": false,
    "name": "Ind Study Fam Soc Sci",
    "fullname": "Independent Study in Family Social Science",
    "info": "Independent reading or writing or research under faculty supervision.prereq: Sr, instr consent",
    "prereq": []
  },
  {
    "uid": "798672",
    "code": "FSOS4193",
    "subject": "FSOS",
    "number": "4193",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Capstone Project",
    "fullname": "Directed Capstone Project",
    "info": "Individualizes experience by connecting aspects of major program with special academic interests.",
    "prereq": []
  },
  {
    "uid": "007705",
    "code": "FSOS4294",
    "subject": "FSOS",
    "number": "4294",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Internship",
    "fullname": "Research Internship",
    "info": "Research project with faculty. May include planning, proposal writing, literature review, data collection/coding/cleaning/analysis, and reporting.prereq: [FSOS major, at least jr] or instr consent",
    "prereq": []
  },
  {
    "uid": "826879",
    "code": "FSOS4295",
    "subject": "FSOS",
    "number": "4295",
    "honors": false,
    "writingIntensive": false,
    "name": "Preparation for Capstone",
    "fullname": "Preparation for Capstone",
    "info": "In this course, you will prepare for your FSoS capstone, either Field Experience (4296) or Research Internship (4294), and engage in a number of career exploration and career development activities. ",
    "prereq": []
  },
  {
    "uid": "007389",
    "code": "FSOS4296",
    "subject": "FSOS",
    "number": "4296",
    "honors": false,
    "writingIntensive": false,
    "name": "Field study: Work w/Families",
    "fullname": "Field Study: Working With Families",
    "info": "Directed paraprofessional work experience related to student's area of study.\n\nprereq: 2101 or 2107 or 2108",
    "prereq": {
      "or": [
        {
          "code": "FSOS 2101",
          "subject": "FSOS",
          "id": "2101"
        },
        {
          "code": "FSOS 2107",
          "subject": "FSOS",
          "id": "2107"
        },
        {
          "code": "FSOS 2108",
          "subject": "FSOS",
          "id": "2108"
        }
      ]
    }
  },
  {
    "uid": "796904",
    "code": "FSOS5014",
    "subject": "FSOS",
    "number": "5014",
    "honors": false,
    "writingIntensive": false,
    "name": "Quant Fam Res Methods I",
    "fullname": "Quantitative Family Research Methods I",
    "info": "Family research methods, issues associated with multiple levels of analysis. Conducting family-focused data analyses using basic/intermediate methods (through ANOVA and multiple regression), including power analysis. Ethical issues involved in family research such as IRB/HIPAA regulations.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "796905",
    "code": "FSOS5015",
    "subject": "FSOS",
    "number": "5015",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Res Lab",
    "fullname": "Family Research Laboratory",
    "info": "Application of basic family research methods into experiential learning using statistical software. Analyses that correspond with problem situations in 5014 and that involve secondary data analyses. Using statistical software for basic family research. Preparation to work with quantitative family data sets.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "011236",
    "code": "FSOS5032",
    "subject": "FSOS",
    "number": "5032",
    "honors": false,
    "writingIntensive": false,
    "name": "Fam Systems Theo Interv",
    "fullname": "Family Systems Theories and Interventions",
    "info": "Systemic/cybernetic frameworks as they apply to diverse families. Thinking systemically about families across multiple ecological systems. How to identify crucial epistemological issues in theoretical/applied areas of family science. Theoretical frameworks. Experiential role-playing, guest presenters, videos, field work, research projects, reading clubs, class discussion.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007514",
    "code": "FSOS5101",
    "subject": "FSOS",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Systems",
    "fullname": "Family Systems",
    "info": "Family systems and other family theories focusing on the dynamics and processes relevant to family life. Diversity issues related to gender, ethnicity, sexual orientation, and disability. Issues related to divorce, single parenthood, and remarriage are covered. Family strengths and family problems are integrated.",
    "prereq": []
  },
  {
    "uid": "819610",
    "code": "FSOS5111",
    "subject": "FSOS",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Family Therapy",
    "fullname": "Introduction to Family Therapy",
    "info": "This course is designed as an introduction to the field of marriage/couple and family therapy. Students who successfully complete the course should be well versed in the basics of both the foundational and contemporary theories of the discipline. Further, students will be exposed to a number of clinical vignettes and case scenarios that demonstrate the application of the theories in pre-recorded family therapy sessions. Through class assignments and discussions, students will be able to make a more informed decision as to whether or not family therapy is a field that holds potential for them in their own professional pursuits. Other mental health disciplines attend to family variables but having a background in family systems theory and family therapy theories will provide a solid knowledge base for someone embarking on a career in relationship-oriented clinical work. Family systems theory guides the majority of what will be discussed in class.  ",
    "prereq": []
  },
  {
    "uid": "792923",
    "code": "FSOS5150",
    "subject": "FSOS",
    "number": "5150",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics",
    "fullname": "Special Topics in Family Social Science",
    "info": "Review of research and scholarly thought. Topics specified in Class Schedule.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "012704",
    "code": "FSOS5193",
    "subject": "FSOS",
    "number": "5193",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Study in Family Social Sci",
    "fullname": "Directed Study in Family Social Science",
    "info": "Undergraduate students will need to complete the Directed Activity Contract before being able to register. https://ugresearch.umn.edu/opportunities/directed-study1 credit x 3 hours of work per week x 15 weeks in a semester equals 45 hours of academic work). Instructor consent required. ",
    "prereq": []
  },
  {
    "uid": "011290",
    "code": "FSOS5426",
    "subject": "FSOS",
    "number": "5426",
    "honors": false,
    "writingIntensive": false,
    "name": "AlcohDrugs:FamCult",
    "fullname": "Alcohol and Drugs: Families and Culture",
    "info": "Overview of psychology/sociology of drug use/abuse. Life-span, epidemiological, familial, cultural data regarding use. Fundamentals of licit/illicit drug use behavior. Gender, ethnicity, social class, sexuality, sexual orientation, disability.",
    "prereq": []
  },
  {
    "uid": "007560",
    "code": "FSOS5427",
    "subject": "FSOS",
    "number": "5427",
    "honors": false,
    "writingIntensive": false,
    "name": "Alcohol & the Brain",
    "fullname": "Alcohol, Drugs, and the Brain",
    "info": "Psychopharmacology of alcohol/drug use. Licit/illicit drugs. Mechanisms of drug action in brain. Alcohol/drug taking practices. Influence of alcohol/drugs on behavior. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007568",
    "code": "FSOS5428",
    "subject": "FSOS",
    "number": "5428",
    "honors": false,
    "writingIntensive": false,
    "name": "Ass/Trt Alcohol Use",
    "fullname": "Assessment and Treatment of Alcohol and Drug Use Issues",
    "info": "Theoretical/practical approaches to diagnosis, screening, treatment. Issues of loss, trauma, family, culture. Diversity issues of gender, ethnicity, social class, sexuality, disability. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007572",
    "code": "FSOS5429",
    "subject": "FSOS",
    "number": "5429",
    "honors": false,
    "writingIntensive": false,
    "name": "Counsel Skills I",
    "fullname": "Counseling Skills Practicum I",
    "info": "Basic counseling skills. Counselor needs/motivations, non-verbal communication, basic/advanced empathy, identifying strengths, maintaining focus, challenging discrepancies, use of self. Emphasizes building from client strengths, learning through role-playing.",
    "prereq": []
  },
  {
    "uid": "007580",
    "code": "FSOS5431",
    "subject": "FSOS",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "Counsel Skills II",
    "fullname": "Counseling Skills Practicum II",
    "info": "Advanced therapeutic methods, processes of change. Identifying, reinforcing, challenging core beliefs. Reframing, paradox, trance, guided imagery. Cognitive-behavioral, solution-focused, narrative therapies. Emphasizes non-pathologizing models of therapy.",
    "prereq": []
  },
  {
    "uid": "007590",
    "code": "FSOS5432",
    "subject": "FSOS",
    "number": "5432",
    "honors": false,
    "writingIntensive": false,
    "name": "Chem Abuse & Fam",
    "fullname": "Chemical Abuse and Families: An Overview",
    "info": "Relationships, family systems with particular application to families in which alcohol or drug use is a problem. Family types, family of origin, models of family therapy, family systems theory, alcoholism. Review of literature. ",
    "prereq": []
  },
  {
    "uid": "007610",
    "code": "FSOS5433",
    "subject": "FSOS",
    "number": "5433",
    "honors": false,
    "writingIntensive": false,
    "name": "Grp Thpy: Th & Pr",
    "fullname": "Group Therapy: Theory and Practice",
    "info": "Introduction to group therapy concepts. Stages of group development, affective development, group communication. Education, support, therapy groups. Leadership roles/functions, critical incidents, therapeutic factors, group processes. Lecture, small groups. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007619",
    "code": "FSOS5434",
    "subject": "FSOS",
    "number": "5434",
    "honors": false,
    "writingIntensive": false,
    "name": "Gambling in America",
    "fullname": "Gambling in America",
    "info": "Risk-taking, gambling, development of gambling problems. Sociological, historical, economic, public policy perspectives. Family influences. Gambling among youth, aging adults. Frameworks for assessing/treating problematic gambling. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007631",
    "code": "FSOS5435",
    "subject": "FSOS",
    "number": "5435",
    "honors": false,
    "writingIntensive": false,
    "name": "Intern: Alco & Drug",
    "fullname": "Internship in Alcohol and Other Drug Use Problems",
    "info": "Students are placed in three-four different community agencies/treatment centers. (A separate registration is required for each placement.) An 880-hour rotating clinical internship. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007696",
    "code": "FSOS5436",
    "subject": "FSOS",
    "number": "5436",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethical Issues: Addiction",
    "fullname": "Ethical Issues in Addiction Counseling",
    "info": "Ethical issues/challenges in alcohol/drug counseling/therapy. Decision-making, values conflicts, boundary violations, client rights, professional responsibilities. Issues in relationship/family therapy, group work, cross-cultural counseling, working with special populations. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007700",
    "code": "FSOS5437",
    "subject": "FSOS",
    "number": "5437",
    "honors": false,
    "writingIntensive": false,
    "name": "Supervision Group",
    "fullname": "Supervision Group",
    "info": "Supervision of alcohol/drug use counseling in group format. Each student presents at least one tape of a client counseling session. Role-playing, extensive discussion of clinical issues. Focus on non-pathologizing models of therapy. Training tapes, readings. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "007702",
    "code": "FSOS5450",
    "subject": "FSOS",
    "number": "5450",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics: Addiction",
    "fullname": "Special Topics: Addiction",
    "info": "Selected reading or project in alcohol/drug use/problems. Note: Course not offered after spring semester 2001.",
    "prereq": []
  },
  {
    "uid": "815855",
    "code": "FSOS5701",
    "subject": "FSOS",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Prevention Science",
    "fullname": "Prevention Science: Principles and Practices",
    "info": "Theoretical, empirical, and practical foundations for strategic interventions to prevent behavioral problems and promote healthy development. Multidisciplinary roots of prevention science. Trends/directions and best practices.",
    "prereq": []
  },
  {
    "uid": "816068",
    "code": "FSOS5702",
    "subject": "FSOS",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "Prevention Science Methods",
    "fullname": "Prevention Science Research Methodology",
    "info": "This course is intended to provide students with broad exposure to topics in research methodology within the field of prevention science. Prevention science as a discipline focuses on the etiology and prevention of social, physical, and mental health problems and the translation of that information to promote health and well-being. This course will emphasize research methodology as it pertains to preventive interventions in youth and family contexts. The course is intended to serve as a survey of a wide range of topics within these areas, with research design, measurement issues, and analytic methods representing the major foci. Topics will be covered with attention to the community contexts within which prevention research often occurs as well as the ethical and human subjects issues that may arise. Students who successfully complete the course are expected to be able to interpret and critically evaluate prevention research methodology as well as identify appropriate methodical strategies to address research questions within prevention science.",
    "prereq": []
  },
  {
    "uid": "816069",
    "code": "FSOS5703",
    "subject": "FSOS",
    "number": "5703",
    "honors": false,
    "writingIntensive": false,
    "name": "New Topics in Prevention",
    "fullname": "New Topics in Prevention: Implementation and Dissemination",
    "info": "This is an interdisciplinary course focused on the new science of implementation and dissemination of evidence-based/empirically-supported family-focused psychosocial prevention programs. Course content will include an overview of conceptual and theoretical foundations of implementation research, key research questions, methods for evaluating implementation and dissemination efforts, and case examples from the empirical literature. The course will take an ecological perspective to the implementation of family-based prevention programs, addressing questions such as how widespread efforts to install programs in communities can ensure that programs create change in children and families.",
    "prereq": []
  },
  {
    "uid": "002993",
    "code": "FSOS5900",
    "subject": "FSOS",
    "number": "5900",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Family,Youth,Community",
    "fullname": "Special Topics in Family, Youth, and Community",
    "info": "Topics not dealt with in regular courses. Topics vary by offering.",
    "prereq": []
  },
  {
    "uid": "003381",
    "code": "FSOS5902",
    "subject": "FSOS",
    "number": "5902",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Education Perspectives",
    "fullname": "Family Education Perspectives",
    "info": "Origins, evolution, and critique of alternative perspectives on family education. Implications for educators, programs, and participants. Online course that requires collaborative learning.",
    "prereq": []
  },
  {
    "uid": "003378",
    "code": "FSOS5904",
    "subject": "FSOS",
    "number": "5904",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary FE",
    "fullname": "Contemporary Family Education",
    "info": "Contemporary conditions of and transitions in family life. Emphasizes implications for educators and educational programs.",
    "prereq": []
  },
  {
    "uid": "003383",
    "code": "FSOS5906",
    "subject": "FSOS",
    "number": "5906",
    "honors": false,
    "writingIntensive": false,
    "name": "Program Planning in Family Ed",
    "fullname": "Program Planning in Family Education",
    "info": "Curriculum research/theory. Alternative perspectives, their concomitant implications for families. Development of and evaluation of family education curriculum/programs.",
    "prereq": []
  },
  {
    "uid": "792089",
    "code": "FSOS5908",
    "subject": "FSOS",
    "number": "5908",
    "honors": false,
    "writingIntensive": false,
    "name": "Family & Work Relationships",
    "fullname": "Family and Work Relationships",
    "info": "Interactions of work/family roles, responsibilities, and aspirations. Resources, legal aspects, gender.",
    "prereq": []
  },
  {
    "uid": "003377",
    "code": "FSOS5912",
    "subject": "FSOS",
    "number": "5912",
    "honors": false,
    "writingIntensive": false,
    "name": "Sexuality Education",
    "fullname": "Sexuality Education",
    "info": "Development, delivery, and evaluation of sexuality education curriculum/programs.",
    "prereq": []
  },
  {
    "uid": "003379",
    "code": "FSOS5914",
    "subject": "FSOS",
    "number": "5914",
    "honors": false,
    "writingIntensive": false,
    "name": "Educ for Family Communication",
    "fullname": "Education for Family Communication",
    "info": "Development, delivery, and evaluation of curriculum/programs related to family communication.",
    "prereq": []
  },
  {
    "uid": "791950",
    "code": "FSOS5932",
    "subject": "FSOS",
    "number": "5932",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro. to Parent Education",
    "fullname": "Introduction to Parent Education",
    "info": "Philosophy, history, and models of parent education. Ethical, critically reflective professional practice.  Observation of parent and family education practice.",
    "prereq": []
  },
  {
    "uid": "003390",
    "code": "FSOS5936",
    "subject": "FSOS",
    "number": "5936",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Practice of Parent Ed",
    "fullname": "Advanced Practice of Parent Education",
    "info": "Evolving perspectives of parent education. Emphasizes psycho-dynamic, conceptual-change approaches. Reflective/dialogic approaches for working with parents in understanding beliefs and examining their origins/consequences. Issues related to diversity, self-awareness, ethics, and evaluation.",
    "prereq": []
  },
  {
    "uid": "791951",
    "code": "FSOS5937",
    "subject": "FSOS",
    "number": "5937",
    "honors": false,
    "writingIntensive": false,
    "name": "Parent-Child Interaction",
    "fullname": "Parent-Child Interaction",
    "info": "In Parent-Child Interaction, we will examine the dynamic, reciprocal nature of parent-child interactions across the lifespan through multidisciplinary and diverse research, theories and practices. Emphasis will be given to the bidirectional impact of parent-child interactions on the parent-child relationship and on parents' and children's development within complex family, community, cultural and other socio-ecological contexts. Students will continue to reflect and grow in their understanding of the professional role and competencies of a parent educator and learning activities will focus on practical application to both personal lives and professional work with families.   ",
    "prereq": []
  },
  {
    "uid": "795820",
    "code": "FSOS5938",
    "subject": "FSOS",
    "number": "5938",
    "honors": false,
    "writingIntensive": false,
    "name": "Reflective Dialog in Parent Ed",
    "fullname": "Reflective Dialogue in Parent Education",
    "info": "Concepts, theories, teaching-learning processes, and materials for using reflective dialogue in parent education. Implementation of reflective dialogue parent education in participants' settings.",
    "prereq": []
  },
  {
    "uid": "798954",
    "code": "FSOS5942",
    "subject": "FSOS",
    "number": "5942",
    "honors": false,
    "writingIntensive": false,
    "name": "Diverse Family Experiences",
    "fullname": "Diverse Family Experiences",
    "info": "This course is a research-based in-depth look at family experiences from many diverse points of view. Students will examine diverse experiences of families and their relevance to parent education and to the professional development of parent educators. Research and theoretical knowledge are woven together with observation and personal reflection to create a strength-based approach to both families and professional development.",
    "prereq": []
  },
  {
    "uid": "799053",
    "code": "FSOS5943",
    "subject": "FSOS",
    "number": "5943",
    "honors": false,
    "writingIntensive": false,
    "name": "Parent Learning & Development",
    "fullname": "Parent Learning and Development: Implications for Parent Education",
    "info": "Research and theoretical perspectives critiqued. Challenging assumptions, examining competencies that promote facilitating learning with adults. Related to parent development and adult learning.",
    "prereq": []
  },
  {
    "uid": "799056",
    "code": "FSOS5944",
    "subject": "FSOS",
    "number": "5944",
    "honors": false,
    "writingIntensive": false,
    "name": "Curricular Design-Parent Ed",
    "fullname": "Curricular Design in Parent Education",
    "info": "Students will develop the skills to adapt and design curricular resources and teaching strategies for effective parent education with diverse families across multiple contexts. Students will develop competence in conducting needs assessment, identifying content, discerning teaching methods, and designing lesson plans. As they develop their own philosophy of practice, students will study the history and evolution of parent education in Minnesota and across the U.S. prereq: FSoS 5937 & FSoS 5942 or instr consent",
    "prereq": {
      "and": [
        {
          "code": "FSOS 5937",
          "subject": "FSOS",
          "id": "5937"
        },
        {
          "code": "FSOS 5942",
          "subject": "FSOS",
          "id": "5942"
        }
      ]
    }
  },
  {
    "uid": "799057",
    "code": "FSOS5945",
    "subject": "FSOS",
    "number": "5945",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching/Learning in Parent Ed",
    "fullname": "Teaching and Learning in Parent Education",
    "info": "Students will examine adult, adolescent, and parent learning and development from the perspective of their relevance for parent education. Students will select, use, and reflect on group and individual parent education teaching strategies and facilitation processes designed to meet the needs of diverse populations of adult learners. Critical reflection, ethical practices, and other parent educator competencies related to teaching methods and processes will be addressed. Personal professional development will be facilitated through challenging assumptions and examining the knowledge and competencies required for parent educators. prereq: FSoS 5937 & FSoS 5942 or instr consent",
    "prereq": {
      "and": [
        {
          "code": "FSOS 5937",
          "subject": "FSOS",
          "id": "5937"
        },
        {
          "code": "FSOS 5942",
          "subject": "FSOS",
          "id": "5942"
        }
      ]
    }
  },
  {
    "uid": "799058",
    "code": "FSOS5946",
    "subject": "FSOS",
    "number": "5946",
    "honors": false,
    "writingIntensive": false,
    "name": "Assessment in Parent Education",
    "fullname": "Assessment and Evaluation in Parent Education",
    "info": "Students will be introduced to theory, terminology, issues, and approaches in assessment and evaluation. Students will apply this new material to the tasks of monitoring program performance, assessing program quality, and measuring parent learning and development. prereq: 5944 or instr consent",
    "prereq": {
      "code": "FSOS 5944",
      "subject": "FSOS",
      "id": "5944"
    }
  },
  {
    "uid": "799059",
    "code": "FSOS5949",
    "subject": "FSOS",
    "number": "5949",
    "honors": false,
    "writingIntensive": false,
    "name": "Student Teaching in Parent Ed",
    "fullname": "Student Teaching in Parent Education",
    "info": "Students will participate in mentored and supervised parent education practice designed to meet individual student needs and interests in parent education. The student teaching assignment is supplemented with online discussions and chats intended to provide students an opportunity to engage in discussion, reflection, and cooperative learning with regard to the practice of parent education. prereq: Application for student teaching; FSoS 5937, 5942, 5944 and 5945 or instr consent",
    "prereq": {
      "and": [
        {
          "code": "FSOS 5937",
          "subject": "FSOS",
          "id": "5937"
        },
        {
          "code": "FSOS 5942",
          "subject": "FSOS",
          "id": "5942"
        },
        {
          "code": "FSOS 5944",
          "subject": "FSOS",
          "id": "5944"
        },
        {
          "code": "FSOS 5945",
          "subject": "FSOS",
          "id": "5945"
        }
      ]
    }
  },
  {
    "uid": "007623",
    "code": "FSOS8001",
    "subject": "FSOS",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Framework on Family",
    "fullname": "Conceptual Frameworks in the Family",
    "info": "Major theoretical models about families, emphasizing sociohistorical context.",
    "prereq": []
  },
  {
    "uid": "811138",
    "code": "FSOS8002",
    "subject": "FSOS",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Fam Conceptual Frameworks",
    "fullname": "Advanced Family Conceptual Frameworks",
    "info": "Builds on FSoS 8001 by focusing specifically on family level research questions. Family development/critical theoretical perspectives that can be used to understand/study family processes/contemporary ecological issues.prereq: 8001 or instr consent",
    "prereq": {
      "code": "FSOS 8001",
      "subject": "FSOS",
      "id": "8001"
    }
  },
  {
    "uid": "797234",
    "code": "FSOS8003",
    "subject": "FSOS",
    "number": "8003",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Issues Fam Sci",
    "fullname": "Current Issues in Family Science",
    "info": "Content, theories, and methodologies in family science. Emphasizes findings of recent/emerging areas of research.  Readings covering a wide range of topics. Critical examination of research studies. Targeted class discussion.",
    "prereq": []
  },
  {
    "uid": "797237",
    "code": "FSOS8005",
    "subject": "FSOS",
    "number": "8005",
    "honors": false,
    "writingIntensive": false,
    "name": "Diverse Families",
    "fullname": "Diverse Families",
    "info": "This course hopes to support graduate students in exploring the empirical literature focused on the experiences of diverse families, broadly defined, in the United States. Further, this course aims to improve students’ ability to interpret research findings and the methodological considerations in light of research on diverse families and application of a broader set of theories. Course content may include, but is not limited to: pathways to parenthood, identity-based socialization practices, culturally informed family dynamics and relationships, demographic characteristics of diverse families, or identity development among diverse youth. ",
    "prereq": []
  },
  {
    "uid": "797238",
    "code": "FSOS8007",
    "subject": "FSOS",
    "number": "8007",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethical-Moral Family Issues",
    "fullname": "Ethical Issues and Moral Dilemmas in Family Life",
    "info": "Multidisciplinary perspectives of ethics, social norms, family law, family policy, family economics, and family decision-making. Focuses on differing perspectives of individuals representing various ethnicities, socio-economic levels, religions, and sexual orientations.",
    "prereq": []
  },
  {
    "uid": "010240",
    "code": "FSOS8013",
    "subject": "FSOS",
    "number": "8013",
    "honors": false,
    "writingIntensive": false,
    "name": "Qual Fam Res Meth",
    "fullname": "Qualitative Family Research Methods",
    "info": "Approaches to qualitative family research evaluation. Phenomenological, feminist, grounded theory, content analytic, ethnomethodological, ethnographic, program evaluation. Theory, research examples, student projects.",
    "prereq": []
  },
  {
    "uid": "010172",
    "code": "FSOS8014",
    "subject": "FSOS",
    "number": "8014",
    "honors": false,
    "writingIntensive": false,
    "name": "Quant Fam Res Methods II",
    "fullname": "Quantitative Family Research Methods II",
    "info": "Quantitative research process, from developing research question to putting findings to use. Major course project  basis for class discussion. Family research. Applying research knowledge to study of families.prereq: [5014 or equiv], [8001 or equiv], [two stat courses or instr consent]",
    "prereq": {
      "and": [
        {
          "code": "FSOS 5014",
          "subject": "FSOS",
          "id": "5014"
        },
        {
          "code": "FSOS 8001",
          "subject": "FSOS",
          "id": "8001"
        }
      ]
    }
  },
  {
    "uid": "811139",
    "code": "FSOS8015",
    "subject": "FSOS",
    "number": "8015",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Qualitative Fam Res Method",
    "fullname": "Advanced Qualitative Family Research Methods",
    "info": "Applying qualitative research methods to understand individual/collective meaning, experience within/across diverse family systems.prereq: 8013 or instr consent",
    "prereq": {
      "code": "FSOS 8013",
      "subject": "FSOS",
      "id": "8013"
    }
  },
  {
    "uid": "007654",
    "code": "FSOS8031",
    "subject": "FSOS",
    "number": "8031",
    "honors": false,
    "writingIntensive": false,
    "name": "Family of Origin",
    "fullname": "Family of Origin",
    "info": "In-depth study of each student's family of origin in a group of other students and a clinical faculty therapy supervisor.prereq: Preference given to marriage and fam therapy students",
    "prereq": []
  },
  {
    "uid": "007732",
    "code": "FSOS8033",
    "subject": "FSOS",
    "number": "8033",
    "honors": false,
    "writingIntensive": false,
    "name": "Problems in Families",
    "fullname": "Problems in Families",
    "info": "Family therapy assessment/treatment approaches to problems such as depression, alcoholism, and sexual abuse, and to challenges of varying family structures, such as single-parent/remarried families.prereq: [8032 or equiv], instr consent",
    "prereq": {
      "code": "FSOS 8032",
      "subject": "FSOS",
      "id": "8032"
    }
  },
  {
    "uid": "007577",
    "code": "FSOS8034",
    "subject": "FSOS",
    "number": "8034",
    "honors": false,
    "writingIntensive": false,
    "name": "MFT Supervision",
    "fullname": "Marriage and Family Therapy Supervision",
    "info": "Theories of supervision, structures for supervision, methods of supervision, evaluation process, legal/ethical issues. Therapist-client-supervisor relationships, potential problems, contextual issues.prereq: FSOS doctoral student enrolled in Couple Family Therapy (CFT) or instr consent",
    "prereq": []
  },
  {
    "uid": "009972",
    "code": "FSOS8035",
    "subject": "FSOS",
    "number": "8035",
    "honors": false,
    "writingIntensive": false,
    "name": "Assessment",
    "fullname": "Assessment of Couples and Families",
    "info": "Issues in research and clinical assessment. Assumptions and values underlying assessment approaches. Specific assessment techniques discussed, evaluated, and administered. Ethical, legal, and practical issues.prereq: 8014 or equiv or instr consent",
    "prereq": {
      "code": "FSOS 8014",
      "subject": "FSOS",
      "id": "8014"
    }
  },
  {
    "uid": "007451",
    "code": "FSOS8036",
    "subject": "FSOS",
    "number": "8036",
    "honors": false,
    "writingIntensive": false,
    "name": "C/MFT Research",
    "fullname": "Couple/Marriage and Family Therapy Research",
    "info": "Historic/contemporary approaches to C/MFT research with emphasis on prevention, intervention, dissemination from variety of perspectives.prereq: FSOS doctoral student enrolled in Couple Family Therapy (CFT) or instr consent",
    "prereq": []
  },
  {
    "uid": "007768",
    "code": "FSOS8037",
    "subject": "FSOS",
    "number": "8037",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in MH Pract",
    "fullname": "Ethical, Legal, and Professional Issues in Mental Health Practice: Issues with Couples and Families",
    "info": "Boundaries and triangles, gender inequities, family law, confidentiality and reporting requirements, dual roles, client diversity, and value clashes.prereq: [8032, practicum or internship exper] or [grad student in cooperating mental hlth practice prog who has completed 1 course on therapy with children",
    "prereq": {
      "code": "FSOS 8032",
      "subject": "FSOS",
      "id": "8032"
    }
  },
  {
    "uid": "007738",
    "code": "FSOS8039",
    "subject": "FSOS",
    "number": "8039",
    "honors": false,
    "writingIntensive": false,
    "name": "Clin Interv Couples",
    "fullname": "Clinical Interventions for Couples",
    "info": "Interventions into problems faced by couples at various ages and stages of their relationship. Developing and implementing effective strategies for problem solving, relationship maintenance, and partner growth, including integration of sex therapy into ongoing couple therapy.prereq:  instr consent",
    "prereq": []
  },
  {
    "uid": "007859",
    "code": "FSOS8043",
    "subject": "FSOS",
    "number": "8043",
    "honors": false,
    "writingIntensive": false,
    "name": "FamSyst &Theory Dev",
    "fullname": "Family Theory Development: A Systemic Perspective",
    "info": "Concepts and principles of systems and ecosystems and their applications in family science; emphasizes theoretical integration and development of research models with appropriate methodologies.prereq: 8001 or equiv or instr consent, FSoS PhD student beyond 1st yr",
    "prereq": {
      "code": "FSOS 8001",
      "subject": "FSOS",
      "id": "8001"
    }
  },
  {
    "uid": "007767",
    "code": "FSOS8047",
    "subject": "FSOS",
    "number": "8047",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Res Sem",
    "fullname": "Integrative Research Seminar",
    "info": "For advanced doctoral students primarily in family social science who are working on independent research projects. Giving and receiving of constructive criticism and support in integrating theories, methods, and applications in order to create a totality that is logically coherent and conceptually and methodologically sound.prereq: 8001 or equiv, 8013 or equiv, 8014 or equiv",
    "prereq": {
      "and": [
        {
          "code": "FSOS 8001",
          "subject": "FSOS",
          "id": "8001"
        },
        {
          "code": "FSOS 8013",
          "subject": "FSOS",
          "id": "8013"
        },
        {
          "code": "FSOS 8014",
          "subject": "FSOS",
          "id": "8014"
        }
      ]
    }
  },
  {
    "uid": "008102",
    "code": "FSOS8101",
    "subject": "FSOS",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Stress",
    "fullname": "Family Stress, Coping, and Adaptation",
    "info": "Helping families become more resilient to stress by decreasing vulnerability to crises and traumatic stress disorders. Students develop research or intervention proposal on family stress, coping, adaptation, crisis, trauma, or resilience.prereq: 8001 or equiv, research methods course",
    "prereq": {
      "code": "FSOS 8001",
      "subject": "FSOS",
      "id": "8001"
    }
  },
  {
    "uid": "007986",
    "code": "FSOS8102",
    "subject": "FSOS",
    "number": "8102",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender Roles",
    "fullname": "Seminar in Gender Roles",
    "info": "Theory and research on gender roles in families. Gender issues in roles of mothers, fathers, marital partners, and same-sex partners. Issues of race, ethnicity, and social class as they intersect with gender.",
    "prereq": []
  },
  {
    "uid": "007758",
    "code": "FSOS8103",
    "subject": "FSOS",
    "number": "8103",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Decision Mkg",
    "fullname": "Family Decision Making",
    "info": "Analysis and assessment of methodological and theoretical approaches to studying problem-solving and decision-making processes of individuals and family groups.",
    "prereq": []
  },
  {
    "uid": "008073",
    "code": "FSOS8104",
    "subject": "FSOS",
    "number": "8104",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Policy",
    "fullname": "Family Policy Seminar",
    "info": "Distinguishing family policy research from other family research. Conceptual frameworks, methods, and roles family policy research can play in policy-making and knowledge-building processes.",
    "prereq": []
  },
  {
    "uid": "007776",
    "code": "FSOS8105",
    "subject": "FSOS",
    "number": "8105",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Gerontology",
    "fullname": "Family Gerontology",
    "info": "Integrates gerontology and family studies; new lines of inquiry, qualitative and quantitative, into aging families. Family gerontological research, family relationships, family and long-term care institutions, theoretical frameworks and research methods, and research and interventions.prereq: 4154 or equiv or instr consent",
    "prereq": {
      "code": "FSOS 4154",
      "subject": "FSOS",
      "id": "4154"
    }
  },
  {
    "uid": "011257",
    "code": "FSOS8106",
    "subject": "FSOS",
    "number": "8106",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Economic Perspective",
    "fullname": "Seminar: Families From an Economic Perspective",
    "info": "Conceptual/methodological/economic perspectives of family social science. Family investments in human/social capital. Diversities in families. Interface of public policies and family economic well-being.",
    "prereq": []
  },
  {
    "uid": "010704",
    "code": "FSOS8107",
    "subject": "FSOS",
    "number": "8107",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Values Res",
    "fullname": "Family Values Research: Theories and Critical Methods",
    "info": "Interdisciplinary seminar on critical modes of inquiry in the family domain that require designing studies using normative theories, examining values as units of observation, and solving practical problems by collaborative strategies designed to encourage change.prereq: 8013 or equiv, 8014 or equiv or instr consent; WCFE 8920 recommended",
    "prereq": {
      "and": [
        {
          "code": "FSOS 8013",
          "subject": "FSOS",
          "id": "8013"
        },
        {
          "code": "FSOS 8014",
          "subject": "FSOS",
          "id": "8014"
        },
        {
          "code": "WCFE 8920",
          "subject": "WCFE",
          "id": "8920"
        }
      ]
    }
  },
  {
    "uid": "015817",
    "code": "FSOS8150",
    "subject": "FSOS",
    "number": "8150",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in FSoS",
    "fullname": "Topics in Family Social Science",
    "info": "Special seminars on timely topics.prereq: FSoS grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "805786",
    "code": "FSOS8151",
    "subject": "FSOS",
    "number": "8151",
    "honors": false,
    "writingIntensive": false,
    "name": "Prep for Independent Teaching",
    "fullname": "Preparation for Independent Teaching in Family Studies",
    "info": "Practicum. Skills to independently teach family sciences courses to undergrads.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "797239",
    "code": "FSOS8160",
    "subject": "FSOS",
    "number": "8160",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in MFT",
    "fullname": "Topics in Marriage and Family Therapy",
    "info": "Special seminars on timely topics.prereq: MFT grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "012706",
    "code": "FSOS8193",
    "subject": "FSOS",
    "number": "8193",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Stud Fam Soc Sc",
    "fullname": "Directed Study in Family Social Science",
    "info": "Directed study.prereq: Doctoral student in FSoS or related field",
    "prereq": []
  },
  {
    "uid": "007591",
    "code": "FSOS8196",
    "subject": "FSOS",
    "number": "8196",
    "honors": false,
    "writingIntensive": false,
    "name": "Couple/Marriage Fam Thrpy Prac",
    "fullname": "Couple/Marriage Family Therapy Practicum",
    "info": "Clinical placement doing marriage/family clinical practice. Supervision of couple/marriage. Family therapy in community setting.",
    "prereq": []
  },
  {
    "uid": "015860",
    "code": "FSOS8200",
    "subject": "FSOS",
    "number": "8200",
    "honors": false,
    "writingIntensive": false,
    "name": "Orientation FSoS",
    "fullname": "Orientation for Family Social Science",
    "info": "TBD",
    "prereq": []
  },
  {
    "uid": "011228",
    "code": "FSOS8201",
    "subject": "FSOS",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Teachng Fam Courses",
    "fullname": "Teaching Family Courses in Higher Education I",
    "info": "Students cooperatively plan, administer, and evaluate (with a graduate faculty supervisor) an undergraduate core course. Improvement of teaching and evaluation methods, and conceptualization and presentation of research-based course in family studies.prereq: 12 FSoS grad cr; teaching assistant exper recommended",
    "prereq": []
  },
  {
    "uid": "011229",
    "code": "FSOS8202",
    "subject": "FSOS",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "Tchng Fam Cours II",
    "fullname": "Teaching Family Courses in Higher Education II",
    "info": "Under faculty supervision, students teach an undergraduate course in family social science for which they have appropriate academic preparation and professional experience.prereq: 8201 or equiv",
    "prereq": {
      "code": "FSOS 8201",
      "subject": "FSOS",
      "id": "8201"
    }
  },
  {
    "uid": "007626",
    "code": "FSOS8275",
    "subject": "FSOS",
    "number": "8275",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Consult",
    "fullname": "Clinical Consultation with Couples and Families",
    "info": "Supervised students serve as a consultation group working with community clinicians and their clients, utilizing a one-way window and observation room; opportunities for cotherapy.prereq: instr consent; required for grad FSoS majors in marriage and family therapy prog",
    "prereq": []
  },
  {
    "uid": "007606",
    "code": "FSOS8296",
    "subject": "FSOS",
    "number": "8296",
    "honors": false,
    "writingIntensive": false,
    "name": "Couple/MFT Internship",
    "fullname": "Couple/ Marriage Family Therapy Internship",
    "info": "Supervised clinical/other professional practical experiences in couple/marriage, family therapy.prereq: FSOS doctoral student enrolled in Couple Family Therapy (CFT) or instr consent",
    "prereq": []
  },
  {
    "uid": "788115",
    "code": "FSOS8333",
    "subject": "FSOS",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Masters",
    "fullname": "FTE: Masters",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "789783",
    "code": "FSOS8396",
    "subject": "FSOS",
    "number": "8396",
    "honors": false,
    "writingIntensive": false,
    "name": "Supervision of Supervision",
    "fullname": "Supervision of Supervision",
    "info": "Hands-on practicum to gain AAMFT-approved supervisor status.prereq: MFT student, instr consent",
    "prereq": []
  },
  {
    "uid": "788351",
    "code": "FSOS8444",
    "subject": "FSOS",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "012730",
    "code": "FSOS8550",
    "subject": "FSOS",
    "number": "8550",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Topics in Family Soc Sci",
    "fullname": "Advanced Topics in Family Social Science",
    "info": "Special seminars on topics suited to student needs.",
    "prereq": []
  },
  {
    "uid": "797240",
    "code": "FSOS8560",
    "subject": "FSOS",
    "number": "8560",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinical Topics in MFT",
    "fullname": "Advanced Clinical Topics in Marriage and Family Therapy",
    "info": "Special advanced topics or seminars.",
    "prereq": []
  },
  {
    "uid": "788475",
    "code": "FSOS8666",
    "subject": "FSOS",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbdprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "012702",
    "code": "FSOS8755",
    "subject": "FSOS",
    "number": "8755",
    "honors": false,
    "writingIntensive": false,
    "name": "Plan B Project",
    "fullname": "Master's Paper: Plan B Project",
    "info": "Graduate faculty work with students on research for Plan B paper.prereq: FSoS MA student",
    "prereq": []
  },
  {
    "uid": "788602",
    "code": "FSOS8777",
    "subject": "FSOS",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "012735",
    "code": "FSOS8794",
    "subject": "FSOS",
    "number": "8794",
    "honors": false,
    "writingIntensive": false,
    "name": "Direct Research Family Soc Sci",
    "fullname": "Directed Research in Family Social Science",
    "info": "Directed research in family social science.",
    "prereq": []
  },
  {
    "uid": "787869",
    "code": "FSOS8888",
    "subject": "FSOS",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  }
]