[
  {
    "uid": "819467",
    "code": "GCC1901",
    "subject": "GCC",
    "number": "1901",
    "honors": false,
    "writingIntensive": false,
    "name": "Living in Hyper-Change Times",
    "fullname": "Living in Hyper-Change Times",
    "info": "We are living in times of hyper-change, what some call a fourth industrial revolution. In this freshman seminar we take an interdisciplinary approach to talk about and seek to understand the implications of accelerating dislocations and disparities in education, work, social relationships, and life styles -- for young adults and those at other life stages. How can both individuals and organizations respond to this new and dynamic reality? Is technology the driver of stress and inequality, or can we harness it in ways that promote health, engagement, and happiness, as well as greater equality?  Are hyper-changes opening up risks but also possibilities for rewriting life scripts? How can we rock the boat, creating new ways of learning, working, caring, and living that make sense in these tumultuous times? These are the questions we will be addressing in this class. ",
    "prereq": []
  },
  {
    "uid": "819468",
    "code": "GCC1902",
    "subject": "GCC",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Navigating 21st Century Media",
    "fullname": "What's Truth Got to Do with It? Responsibly Navigating the 21st Century Media Environment",
    "info": "This freshman seminar will consider how the range of what we call the news media – from major newspaper newsrooms to 24-hour cable TV and even upstart channels on YouTube –shape not only our understanding of critical issues in society but, more recently, our ability to agree about the basic facts of those issues. Students will begin this course by understanding how mainstream news organizations operate, how journalists make coverage decisions and how the landscape of news has dramatically changed in this century as a result of social media, the algorithms behind those platforms or the technologies that can convincingly portray fake stories or images as true. Throughout the rest of the semester, the class will follow how various media cover selected issues in the news – major issues such as climate change, immigration or the 2020 U.S. presidential election. Using daily reading of news, journaling, in-class discussions, weekly readings, group assignments and two papers, students will identify the sometimes-conflicting narratives that emerge from the coverage they observe, reflecting on their own ethical responsibility as consumers and disseminators of news and information in a digital world and the importance of transparency, inquiry and truth-seeking in our society.",
    "prereq": []
  },
  {
    "uid": "819469",
    "code": "GCC1903",
    "subject": "GCC",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainable Development",
    "fullname": "Sustainable Development with Environmental Justice",
    "info": "This freshman seminar will provide a clear knowledge of the grand challenge - sustainable development with environmental justice via the nexus approach. The specific objectives are (1) Discuss sustainable development with environmental justice and an interacting network. (2) Explain interrelationship among resource (especially water, food and energy ? WFE) utilization, sustainable development, and environmental justice and equity. (3) Compare the currently used ?solitary? approach and the recently developed nexus approach ? theoretical considerations, detection of (un)sustainability, natural and human-based pressures, governance practices and management issues. (4) Discuss application of the nexus approaches to achieve sustainable development with environmental justice. We hypothesize that a nexus approach promotes sustainable development with environmental justice via managing the interlinked resources, enhancing WFE security, increasing efficiency, reducing trade-offs, building synergies and improving governance across sectors.",
    "prereq": []
  },
  {
    "uid": "819553",
    "code": "GCC1904",
    "subject": "GCC",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics, Society, Biotechnology",
    "fullname": "Ethics, Society, and Contemporary Biotechnologies",
    "info": "This seminar course will examine a wide range of complex ethical, social, and legal issues related to stem cells, regenerative medicine, “young blood” plasma transfusions, fecal microbiota transplants, and other contemporary biotechnologies. The seminar will address the Grand Challenges of “Fostering Just and Equitable Communities” and “Advancing Health Through Tailored Solutions.” In exploring ethical and social issues related to stem cells, regenerative medicine therapies, and other novel biotechnologies, the seminar will promote thoughtful discussion of the Liberal Education theme of “Technology and Society.” The course will situate ethical and social analysis of biomedical technologies within domestic and global contexts. Taking a multidisciplinary approach that embraces contributions from scholarship in bioethics, health policy, health law, and social studies of medicine, the course will benefit first year students seeking to examine ethical and social issues from a cross-disciplinary perspective. By the conclusion of the seminar, class participants will have an informed understanding of various contemporary biotechnologies and their moral, social, and legal significance.",
    "prereq": []
  },
  {
    "uid": "819606",
    "code": "GCC1905",
    "subject": "GCC",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Art + Health Justice",
    "fullname": "Art + Health Justice: Building Community Resiliance",
    "info": "By forming personal relationships with art and health, this interdisciplinary seminar asks students to learn while doing. As we actively reflect on the relationship between art, health, wholeness, justice, and resilience, students will explore the potential of inclusive and social art practices to generate meaningful forms of participatory culture that support individual and community health, wellbeing, and resilience. This course is built upon six foundational principles that recognize resilience building as an ongoing, dynamic process rather than a fixed outcome. Informed by these core, fundamental principles, the course is organized around the idea that learning and acting in the world is inherently iterative. Weekly classes will include visits with artists, activists, and scholars, visits to artist studios, in process art works, and sites of activism/resistance/imagination, as well as collaborative experiments in art.",
    "prereq": []
  },
  {
    "uid": "819554",
    "code": "GCC1906",
    "subject": "GCC",
    "number": "1906",
    "honors": false,
    "writingIntensive": false,
    "name": "Rare Diseases: Medical Orphans",
    "fullname": "Rare Diseases: What it Takes to Be a Medical Orphan",
    "info": "What if you are born with a condition, which very few people know about and for which there are no cures?  Or what if there is a cure, but it is very expensive and you have to take it throughout your life?  How can you encourage pharmaceutical industry invest in such cures and have policy makers consider such conditions when they draft new regulations? Rare diseases are not rare. There are 7000 diseases, but in aggregate, these diseases affect 30 million (i.e. 1 in 10) Americans of all ages and additional millions of people globally. Most of these conditions are serious and life-altering and children account for more than 50% of those affected. However, only 5% of all rare diseases have FDA-approved treatments. Thus, there is a large unmet need in this area and one way to address this is to raise awareness about these conditions. In this highly interactive course comprising of weekly seminars and related readings on topics related to the understanding of rare diseases and the economics, regulatory and public policy aspects of development of drugs (orphan products) to treat these conditions in the US and across the globe. Students will learn from and network with researchers, healthcare professionals and business leaders and gain sufficient background to appreciate the scope of this multidisciplinary field. Students will work in teams with a patient advocacy organization to learn firsthand the challenges related to the diagnosis and treatment of a specific rare disease, barriers to research and development and deliver possible solutions to a specific challenge that they have identified.",
    "prereq": []
  },
  {
    "uid": "819952",
    "code": "GCC1907",
    "subject": "GCC",
    "number": "1907",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Grand Challenges",
    "fullname": "Environmental Grand Challenges: What Impact Will You Have?",
    "info": "What does it mean to live a life that aligns with your values in a time of rapid global environmental transformations driven by climate change, mass extinction of plant and animal species, and the increasing pollution of our oceans, atmosphere, and soils? These are challenging questions, but there are resources, knowledge, and capacity across the University and the broader community that can help answer questions such as: How can we live sustainably, as individuals and societies, and what disciplines and approaches will we need to achieve this? Where does one start--at this University, in Minnesota, or around the world? Our tour of these capacities will include:an overview of sustainability science, both what it says about about human and natural systems and how it comes to make these claimsexploration of the United Nations’ Sustainable Development Goalsexploration of what we know about effective leadership within complex grand challenges, both social and environmental, and how this is enabled through a systems thinking approachExamination of the conflicts that exist within and between differing visions of sustainability through Minnesota-based case studies in climate change and ensuring safe drinking waterThroughout the course, we will meet with campus and community leaders who are working to address our environmental grand challenges and focus on solutions that are working and ways that each of us can have a positive impact. The course is directed by staff at the Institute on the Environment with direct connections to people working on sustainability and led by the Institute’s executive director. It is ideal for first year students striving to understand how they might engage sustainability  research, education and action while a student at the UMN.",
    "prereq": []
  },
  {
    "uid": "819953",
    "code": "GCC1908",
    "subject": "GCC",
    "number": "1908",
    "honors": false,
    "writingIntensive": false,
    "name": "Ways of Knowing Science",
    "fullname": "Ways of Knowing Science",
    "info": "Every human society codifies its own unique approach, understanding and experience of the world around it into systems of knowledge. However, until very recently, scientific researchers at large Western universities have paid little attention to this knowledge, in part because much is dismissed as ?unscientific? -- implying inferiority to Western science. In this seminar, we will take a more culturally sensitive ?inside look? at diverse ways of knowing. Experience is often the best teacher. By direct experience and involvement with another culture, we come to better recognize their cultural worldview and its way of seeing and making sense of the world. In this way, learners will encounter different ways of knowing. Each week, experiential learning is supplemented through reading assignments that include published inquiry by indigenous and academic authors.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "820037",
    "code": "GCC1909",
    "subject": "GCC",
    "number": "1909",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Ecosystem Health",
    "fullname": "Introduction to Ecosystem Health: Challenges at the Intersection of Human, Animal, and Environmental",
    "info": "Many of the world’s most “wicked” and urgent grand challenges occur at the interface of humans, animals, and the environment. For instance, in a given region of the world, how do we manage the effects of climate change, disease emergence, food and water security, gender, and conflict and poverty, to ensure the health of humans and animals? For many grand challenges like this, we observe a common theme: human health depends upon the environment, and the environment depends on the health and sustainability of human communities.These large-scale grand challenges can often become overwhelming, and a solution that considers only one aspect of health often seems daunting and difficult to implement in policy. How can we usefully understand the interactions between these challenges to contribute to solutions? How can one’s own discipline and career path relate to these complex grand challenges? How do we build teams and partnerships across disciplines to engage at the scale of the problem?This course introduces Ecosystem Health (ESH) as a framework and practice for developing complex solutions for grand challenges. In particular, the course will:•focus on the emerging discipline of Ecosystem Health, and associated approaches and technologies that support solutions to grand challenges of health at the interface of humans, animals, and the environment.•introduce a toolset for approaching, defining, and responding to these grand challenges, including systems thinking, complexity science, and integrative leadership.•interrogate the conflicts that exist between differing conceptions of health, through the study of several complex cases.",
    "prereq": []
  },
  {
    "uid": "820198",
    "code": "GCC1911",
    "subject": "GCC",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Can the Earth Sustain Humanity",
    "fullname": "Eleven Billion People: Can the Earth Sustain Humanity?",
    "info": "The earth is finite (an open system for energy but closed system for matter matter), thus its ability to provide resources for biosphere and to absorb waste is also finite (Figure-1, Motesharrei et al. (2016). Resource utilization and waste generation is directly related to the human’s population, need, affluence and demand (Van Timmeren et al. 2012). Humans, from its first two-legged ancestor in Pliocene to the appearance of Homo sapiens, have interacted with their environment and changed enormously the human ecological niche and the breadth of its impact on the environment. But, they also have adapted to adversities via technological developments (from stone-age hunters and gatherers to the information age of modern Homo sapiens) that have kept in pace to meet the ever increasing human population and their affluence. As the technologies (including the digital technology of 21st century) are becoming more complex, their energy demand is increasing proportionally, resulting in overexploitation of resources and accumulation of toxic waste (including global warming gases) into the environment, an unsustainable trajectory. Unless a serious corrective action is implemented, the planet may not sustain 11 billion people, the expected population by the end of 2020. This is a Grand Challenge Curriculum Course.",
    "prereq": []
  },
  {
    "uid": "814157",
    "code": "GCC3001",
    "subject": "GCC",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Can We Feed the World?",
    "fullname": "Can We Feed the World Without Destroying It?",
    "info": "In this course, we will seek solutions to the challenge of achieving global food security and sustainability. Together, we will work to answer the question, \"Can we feed the world without destroying it?\" The course begins with lectures and skills workshops, followed by a series of interactive panels with guest experts. We will also prepare group projects that are focused on finding innovative solutions to this grand challenge. We will learn about the fundamental changes occurring in the global food system, the environment, and our civilization as a whole. We will explore how to approach inherently interdisciplinary problems, how to identify solutions that are truly sustainable in the long term, and how science and technology can inform decision-making.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "814151",
    "code": "GCC3002",
    "subject": "GCC",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Beyond War & Atrocity",
    "fullname": "Beyond War and Atrocity - Reconciliation and Justice",
    "info": "This course offers a thorough introduction to the many ways of thinking through the delicate relationship between reconciliatory initiatives, processes of collective remembering and the requirements of justice, by examining theoretical and concrete practices in different historical settings: responses to the Holocaust on the part of victims and victimizers; the Spanish \"pact of oblivion\" and belated remembering the Civil War and the Franco dictatorship; the founding of the European Union between century-old enemy states; the South African experiment in Truth and Reconciliation; and in the USA the American Indian struggles for memory and justice and the Black Redress Movement.prereq: sophomore, junior, senior",
    "prereq": []
  },
  {
    "uid": "817132",
    "code": "GCC3003",
    "subject": "GCC",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Health Solutions",
    "fullname": "Seeking Solutions to Global Health Issues",
    "info": "Often, the most progress on challenging issues such as health and equity is made when you apply an interdisciplinary perspective. The same is true for global health issues. Whether responding to emerging pandemics, food insecurity, maternal mortality, or civil society collapse during conflict, solutions often lie at the intersection of animal, environmental, and human health.In this course, students will work in teams to examine the fundamental challenges to addressing complex global health problems in East Africa and East African refugee communities here in the Twin Cities. Together we will seek practical solutions that take culture, equity, and sustainability into account. In-field professionals and experts will be available to mentor each team, including professionals based in Uganda and Somalia. This exploration will help students propose realistic actions that could be taken to resolve these issues. This course will help students gain the understanding and skills necessary for beginning to develop solutions to global health issues. This is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students. ",
    "prereq": []
  },
  {
    "uid": "814178",
    "code": "GCC3004",
    "subject": "GCC",
    "number": "3004",
    "honors": false,
    "writingIntensive": false,
    "name": "The Fracking Boom",
    "fullname": "The Fracking Boom: Promises and Challenges of the Hydrocarbon Renaissance",
    "info": "This course will explore the energy revolution that has been ignited by recent technological advances (primarily hydro-fracturing or \"fracking\") and its many far-reaching consequences. Students will engage in understanding the economic, political, geological, environmental, and social aspects of this multi-faceted issue. After establishing the historical framework, we will discuss how the \"fracking boom\" has drastically altered this landscape. With a solid understanding of the role of hydrocarbons in the modern world, we will explore the promise and the perils of the fracking boom. While we will discuss all the major fracking areas, the Bakken Shale will receive special attention both because of its geographical proximity to Minnesota and because of the dramatic transformation it has spurred in North Dakota. We will explore economic and social repercussions of the Bakken boom from the interpersonal to the international, as well as issues related to environmental degradation and other potential hazards.This is a Grand Challenge Curriculum course.prereq: sophomore, junior, senior",
    "prereq": []
  },
  {
    "uid": "817133",
    "code": "GCC3005",
    "subject": "GCC",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "Design for a Disrupted World",
    "fullname": "Innovation for Changemakers: Design for a Disrupted World",
    "info": "Do you want to make a difference? We live at the intersection of COVID-19, racism, economic recession, and environmental collapse. Now is the time to make an impact.In this project-based course, you will work in interdisciplinary teams. You'll develop entrepreneurial responses to current social and environmental problems. You'll develop tools, mindsets, and skills to address any complex grand challenge. Your project may address food insecurity, unemployment, housing, environmental impacts, equity, or other issues. Proposed designs for how you might have a social impact can take many forms (student group, program intervention with an existing organization, public policy strategy, or for-profit or non-profit venture) but must have ideas for how to be financially sustainable. Community members, locally and globally, will serve as mentors and research consultants to teams. Weekly speakers will share their innovative efforts to serve the common good.A primary focus of the course is up-front work to identify the “right” problem to solve. You will use a discovery process, design thinking, and input from field research to addressing the challenge you choose. You will build a model around the community’s culture, needs, and wants.By the end of the class, you will have a well-designed plan to turn your project into an actionable solution if that is of interest. This is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students.",
    "prereq": []
  },
  {
    "uid": "814326",
    "code": "GCC3006",
    "subject": "GCC",
    "number": "3006",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change",
    "fullname": "Climate Change - Myths, Mysteries, and Uncertainties",
    "info": "Climate variations are the norm; not the exception. The geological and archaeological records are rich with evidence of a climate system that is dynamic and non-steady state. Yet we face the challenges of understanding the complexities of this system in order to manage our resources and to prepare wisely for the future. This class examines the theory behind the atmospheric greenhouse effect and radiative forcings in the climate system, and the consequences of anthropogenic climate change for present and future societies. It also explores environmental signals that are used to diagnose climate variability. The Myths, Mysteries, and Uncertainties about the climate record and the biophysical feedback processes operating in the Earth-Atmosphere system will be examined. After firmly establishing the scientific basis for climate change, the remainder of the class will focus on intersections between climate change and society.prereq: sophomore, junior, senior",
    "prereq": []
  },
  {
    "uid": "814327",
    "code": "GCC3007",
    "subject": "GCC",
    "number": "3007",
    "honors": false,
    "writingIntensive": false,
    "name": "Toward Conquest of Disease",
    "fullname": "Toward Conquest of Disease",
    "info": "Since the rise of civilization, the large predators of humans have been subdued and the most dangerous predators remaining are those unseen--vastly smaller than our bodies. They are the microbial predators that cause disease. Infectious disease has devastated human populations and even caused global population declines. Subduing and managing disease is one of the grand challenges of our time. Through an enormous global effort, we have driven smallpox in humans and Rinderpest in livestock extinct from the natural world, and guinea worm is expected to follow. Other infectious diseases are in continual decline. In this course we will combine ecological thought and ecological models with historical and future perspectives to understand the fundamental dynamics of our miniscule predators, and relate this to similar miniscule predators of wild and domestic animals, to crops, and to other plants.This is a Grand Challenge Curriculum course.prereq: sophomore, junior, senior",
    "prereq": []
  },
  {
    "uid": "815207",
    "code": "GCC3009",
    "subject": "GCC",
    "number": "3009",
    "honors": false,
    "writingIntensive": false,
    "name": "Mtg Urban Water Syst Demands",
    "fullname": "Rivers and Cities: Meeting Future Demands on Urban Water Systems",
    "info": "Ensuring access to sufficient and safe water is one of the grand challenges of the 21st century. As the world's population urbanizes, cities are at the leading edge of conflicts over water. We will evaluate changing demands on urban rivers, tracing this evolution as a hallmark of global urbanization, and challenge students to articulate their understanding of water management to local citizens and devise creative visions for better management of water. \"Rivers and Cities\" will examine urban water challenges by exploring four critical ways cities engage their river systems. This exploration will trace the evolution of urban water systems as they have been engineered to deliver drinking water, to provide power and transportation, to protect people living nearby, and to ensure a steady supply of food. Student learning will be interdisciplinary, place-based, and will engage with the community. Students will learn how and why managing water is a necessity and a challenge in Minnesota, the US, and the world.prereq: sophomore, junior, senior",
    "prereq": []
  },
  {
    "uid": "815342",
    "code": "GCC3011",
    "subject": "GCC",
    "number": "3011",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathways to Renewable Energy",
    "fullname": "Pathways to Renewable Energy",
    "info": "This interdisciplinary course will examine obstacles to energy transitions at different scales. It will explore the role of energy in society, the physics of energy, how energy systems were created and how they function, and how the markets, policies, and regulatory frameworks for energy systems in the US developed. The course will closely examine the Realpolitik of energy and the technical, legal, regulatory, and policy underpinnings of renewable energy in the US and Minnesota. Students will learn the drivers that can lead global systems to change despite powerful constraints and how local and institutional action enables broader reform. Students will put their learning into action by developing a proposal and then working on a project to accelerate the energy transition and to ensure that the energy transition benefits people in a just and equitable way. This is a Grand Challenge Curriculum course. prereq: sophomore, junior, senior",
    "prereq": []
  },
  {
    "uid": "815344",
    "code": "GCC3012",
    "subject": "GCC",
    "number": "3012",
    "honors": false,
    "writingIntensive": false,
    "name": "The Medication Experience",
    "fullname": "Structural Violence & The Medication Experience",
    "info": "The course will use a social justice framework for learning and communicating about structural violence and the intersection of culture, the medication experience, and community health. Utilizing principles of community engagement, we will focus on examining how broader community health and the individual medication experience are impacted by the overcoming of structural violence experienced by communities locally as well as globally. Using critical race theory and social ecological frameworks, we will come to a more complex understanding of our own social locations and the interplay of power and privilege while exploring the root causes of health disparities and the development of solutions that address inequities in health, education, housing, employment, and access to respectful health care. Students will learn to critically analyze these lived experiences while developing interactive storytelling, digital documentaries, digital essays and narratives to advance knowledge on health inequities in our community.prereq: sophomore, junior, senior",
    "prereq": []
  },
  {
    "uid": "815347",
    "code": "GCC3013",
    "subject": "GCC",
    "number": "3013",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change: Science & Art",
    "fullname": "Making Sense of Climate Change - Science, Art, and Agency",
    "info": "The overarching theme of the course is the role of artistic/humanistic ways of knowing as tools for making sense and meaning in the face of \"grand challenges.\" Our culture tends to privilege science, and to isolate it from the \"purposive\" disciplines--arts and humanities--that help humanity ask and answer difficult questions about what should be done about our grand challenges. In this course, we will examine climate change science, with a particular focus on how climate change is expected to affect key ecological systems such as forests and farms and resources for vital biodiversity such as pollinators. We will study the work of artists who have responded to climate change science through their artistic practice to make sense and meaning of climate change. Finally, students create collaborative public art projects that will become part of local community festivals/events late in the semester.",
    "prereq": []
  },
  {
    "uid": "816563",
    "code": "GCC3014",
    "subject": "GCC",
    "number": "3014",
    "honors": false,
    "writingIntensive": false,
    "name": "Future of Work & Life 21 Cntry",
    "fullname": "The Future of Work and Life in the 21st Century",
    "info": "This course seeks solutions to the technological, demographic, and economic forces that challenge taken-for-granted mindsets and existing policies around work, careers, and life. Students will consider positive and negative impacts of the forces that render the conventional education/work/retirement lockstep obsolete. What do these changes mean for men and women of different ages and backgrounds? What are alternative, sustainable ways of working and living in the 21st century? These questions reflect global challenges that touch the lives of people everywhere. Students will work in teams to begin to address these realities and formulate innovative solutions to better transform learning, working, caring, and community-building in the 21st century.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "816565",
    "code": "GCC3015",
    "subject": "GCC",
    "number": "3015",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioinspired Technologies",
    "fullname": "Bioinspired Approaches to Sustainability - Greening Technologies and Lives",
    "info": "How can we build a sustainable society? From designing cities and technologies that use green energy, to health care and agriculture that can sustain billions, the sustainability challenges that face us today are immense. The field of biomimicry seeks solutions to such problems by looking to the diverse ways in which organisms have adapted to varied and sometimes extreme environments. With over 1.3 million described species (and likely over 8 million in existence), chances are a species out there has evolved some solution to a particular problem. But how do we go about figuring out which species this might be? And which trait holds the adaptation in which we are interested? What might be some limitations associated with copying this adaptation--how might we build on it instead? This course teaches bio-inspired approaches to sustainability solutions. Throughout the course, students work in teams of complementary expertise to identify a sustainability problem, research a relevant biological system, and build a prototype bio-inspired solution to their focal problem.This is a Grand Challenge Curriculum course. ",
    "prereq": []
  },
  {
    "uid": "816594",
    "code": "GCC3016",
    "subject": "GCC",
    "number": "3016",
    "honors": false,
    "writingIntensive": false,
    "name": "Avoiding Antibiotic Resistance",
    "fullname": "Science and Society: Working Together to Avoid the Antibiotic Resistance Apocalypse",
    "info": "Before the discovery of antibiotics, even a simple thorn prick could lead to life threatening infection. Antibiotics are truly miracle drugs, making most bacterial infections relatively easy to cure. However, this landscape is rapidly changing with the advent of microbes that are resistant to antibiotics. This course will provide an overview of how antibiotic use invoked antibiotic resistance, including in depth discussions of antibiotic resistant microorganisms and the impact of globalization on this exploding problem. Societal and ethical implications associated with antibiotic use and restriction in humans and animals will be discussed, along with global issues of antibiotic regulation and population surveillance. The class will conclude with discussions of alternative therapeutic approaches that are essential to avoid \"antibiotic apocalypse.\" The course will include lectures by world-renowned experts in various topics, and students will leverage this knowledge with their own presentations on important topics related to issues of personal freedom versus societal needs.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "817134",
    "code": "GCC3017",
    "subject": "GCC",
    "number": "3017",
    "honors": false,
    "writingIntensive": false,
    "name": "Agronomics, Economics & Hunger",
    "fullname": "World Food Problems: Agronomics, Economics and Hunger",
    "info": "This course provides a multi-disciplinary look at problems (and some of the possible solutions) affecting food production, distribution, and requirements for the seven plus billion inhabitants of this planet. It is co-taught by a plant geneticist (Morrell) and an economist (Runge) who together have worked on international food production and policy issues for the past 40 years. Historical context, the present situation and future scenarios related to the human population and food production are examined. Presentations and discussions cover sometimes conflicting views from multiple perspectives on population growth, use of technology, as well as the ethical and cultural values of people in various parts of the world. The global challenge perspective is reflected in attention to issues of poverty, inequality, gender, the legacy of colonialism, and racial and ethnic prejudice. Emphasis is placed on the need for governments, international assistance agencies, international research and extension centers, as well as the private sector to assist in solving the complex problems associated with malnutrition, undernutrition, obesity, and sustainable food production.Through a better understanding of world food problems, this course enables students to reflect on the shared sense of responsibility by nations, the international community and ourselves to build and maintain a stronger sense of our roles as historical agents. Throughout the semester students are exposed to issues related to world food problems through the lenses of two instructors from different disciplinary backgrounds. The core issues of malnutrition and food production are approached simultaneously from a production perspective as well as an economic and policy perspective throughout the semester.  This is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students.",
    "prereq": []
  },
  {
    "uid": "817126",
    "code": "GCC3018",
    "subject": "GCC",
    "number": "3018",
    "honors": false,
    "writingIntensive": false,
    "name": "What American Dream?",
    "fullname": "What American Dream? Children of the Social Class Divide",
    "info": "As a result of the increasing and widening social class divide present in the early 21st century, American families and their children are facing more challenges than ever before. In this course, students will identify and confront the barriers to opportunities created by the divide and seek solutions that can be pursued with families, schools, and communities, and public policy to redress these inequities. Because of the complexity of this grand challenge, an interdisciplinary approach to intervention and policy is required. From course instructors' respective vantage points in prevention science, developmental and educational psychology, and family social science, and with the perspectives provided by faculty contributors from economics, law, and pediatrics, students engage with diverse modes of inquiry, epistemologies, and critical lenses by which possible solutions can be generated and implemented.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "817201",
    "code": "GCC3019",
    "subject": "GCC",
    "number": "3019",
    "honors": false,
    "writingIntensive": false,
    "name": "Bridging the Age Gap",
    "fullname": "Bridging the Age Gap: Enhancing Individual and Community Capacity",
    "info": "America’s aging population represents one of the grand challenges - and great opportunities -  we face as a country and it is almost unique in the history of the nation. Over the next 19 years, an average of 10,000 Americans will reach retirement age every day, constituting one of the largest pools of knowledge and experience in the United States and one of the largest untapped resources available to address the major social challenges. For the first time in history, a significant number of people, with extraordinary expertise, financial resources, and life expectancy will retire in the same two decades. At the same time, technology has made collaboration easier than ever before, with global challenges having become ever-more pressing and with existing resources and conventional models increasingly inadequate to the task. Too many people at or approaching retirement have to find their path on their own, with little guidance as to where they might apply their skills at a level and a pace suited to their ability, and too many very accomplished people end up performing tasks misaligned with their experience, which however personally satisfying does not make the best use of what they have to offer. This course, part of a Carlson Ventures Enterprise effort to develop a “Sharing Economy of Experienced Human Capital,” will identify the knowledge and skills needed by community organizations and linking them with both current students and experienced older people able to help.The course will include traditional students and retirees and apply their technical knowledge and life experience to the needs of Twin-Cities communities. The course will address the Grand Challenge theme of “Enhancing Individual and Community Capacity for a Changing World.” This is a time limited opportunity. If the university is to contribute to addressing this challenge, the time is now. If we take years to respond, we will miss the window.   ",
    "prereq": []
  },
  {
    "uid": "817499",
    "code": "GCC3021",
    "subject": "GCC",
    "number": "3021",
    "honors": false,
    "writingIntensive": false,
    "name": "The Achievement Gap",
    "fullname": "The Achievement Gap: Who is to Blame?",
    "info": "Students in GCC 3021 will start the semester with a review of what unequal schooling looks like in the United States. The course uses the history of Detroit to examine how underinvestment and discrimination positioned minoritized communities to receive inadequate education. School structures--including resources, climate and discipline, academic tracks, and community engagement--will be explored.Students will consider what it means to say that there are \"achievement gaps\" in our society's schools. Mainstream assumptions and meanings will be questioned and criticized, and alternatives, such as the notion of an \"education debt,\" will be explored. This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "817937",
    "code": "GCC3024",
    "subject": "GCC",
    "number": "3024",
    "honors": false,
    "writingIntensive": false,
    "name": "How Can We Sustain Humanity?",
    "fullname": "11 Billion People: How long can the planet sustain humanity?",
    "info": "As an evolved animal, humanity has always interacted with its environment, both through the ecology of its food web and through its modification of its geological surroundings. Yet the human ecological niche, and the breadth of its impact on the environment, has changed enormously through the biological and cultural evolution of our lineage, from our first two-legged ancestor; to the appearance of our own species, Homo sapiens; to the diversification of the hunter-gatherer adaptation at the end of the Pleistocene; to the invention of agriculture and animal husbandry in the Holocene; to the rise of craft specialization, social inequalities, and urbanism with the first state-level societies; and now the globalization of our food, diseases, and culture. Students in this course will explore how the cumulative effects of our biocultural evolution are putting the sustainability of our current population, now approaching 11 billion, at risk, mostly due to the unprecedented scale of humanity's impact on the Earth's ecosystems. This course investigates the origins, development, and predictions for humanity's ecological niche on the planet through a novel interdisciplinary fusion of the social and environmental sciences to give students i) the ability to see the environmental context of the present in an evolutionary light, as well as ii) the tools to evaluate possible remediation and sustainability approaches to control these problems at the local and global scale. The course provides an interdisciplinary immersion in these issues through combined instruction by anthropologists, archaeologists, historians, environmental scientists, ecologists, toxicologists, and sociologists. By focusing on multiple vectors of inquiry (i.e., society, economy, technology, environment) which can be considered at different scales (i.e., from past to present, local to global, individual to societal, temporary to long term), students' progress through the course will give them powerful tools to confront the Grand Challenges of our age, the Anthropocene. This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "817917",
    "code": "GCC3025",
    "subject": "GCC",
    "number": "3025",
    "honors": false,
    "writingIntensive": false,
    "name": "Sust. in the 21st Century",
    "fullname": "Seeking the Good Life at the End of the World: Sustainability in the 21st Century",
    "info": "What does it mean to live \"the good life\" in a time of rapid climate changes, mass extinction of plant and animal species, and the increasing pollution of our oceans, atmosphere, and soils? Is it possible to live sustainably, as individuals and societies, in what scientists are calling the Anthropocene, or this new epoch of human influence over the planet? Will sustainability require that we sacrifice the gains humanity has made in our quality of life? Or can we find a way to create a good Anthropocene? This course will attempt to answer these questions in four ways:1. By providing an overview of sustainability science, both what it says about about human and natural systems and how it comes to make these claims2. By examining various conceptions of the good life, both individual and social, and how they intersect with the findings of sustainability science 3. By exploring the conflicts that exist within and between differing visions of sustainability and the good life through case studies in energy, water, and food4. By pursuing collaborative research projects that will help students apply their knowledge and skills to current problems in sustainability studiesWe will read widely in the sciences, social sciences, and humanities to understand a range of historical and contemporary perspectives on these questions, and in doing so we will put abstract ethical principles into conversation with a diversity of specific cultures and environments. By the end of the course, students will have examined their own assumptions about personal and professional happiness, considered how these align with and diverge from societal visions and values, and explored innovative solutions to help sustain our productive economy and our planet.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "817918",
    "code": "GCC3026",
    "subject": "GCC",
    "number": "3026",
    "honors": false,
    "writingIntensive": false,
    "name": "Supporting Diversity in STEM",
    "fullname": "Stepping Into the Gap: How can you support diversity in STEM?",
    "info": "The goal of this class is to empower students to alter the cognitive, social, and emotional factors that have led to the underrepresentation of many groups in STEM fields (Science, Technology, Engineering, and Mathematics). In addition to studying research on the psychology of learning and diversity, we will survey literature about scientific communication and learn about the impact of disparities in educational opportunities. We will also engage in discussions about the persistent problems related to equity and access in STEM education.In October, November, and December, the class meets at a local middle school (easily accessible by public transportation). University students lead introductory science demos, stage a science fair so the middle school students have a chance to play judge, and then partner with the middle school students as they invent, execute and present their own science fair projects.During September, and on school holidays in October and November, the class will discuss theories and research that explains the crisis being experienced across America and in particular, in the Twin Cities. They will design evidence-based curriculum materials to address key issues and have hands-on experiences as peer mentor-teachers. Overall, this class will provide experiences that are likely to be transformative in relation to students' views of education, opportunity, and the power of their involvement.  This class builds on a partnership between the University of Minnesota and a local middle school. The overarching goal is to support students from groups typically underrepresented in science as they participate in an advanced science learning opportunity:  the science fair. Our engagement with the school science fair process should result in an experience that motivates future participation in STEM opportunities. This is a grand challenge curriculum course.",
    "prereq": []
  },
  {
    "uid": "818161",
    "code": "GCC3027",
    "subject": "GCC",
    "number": "3027",
    "honors": false,
    "writingIntensive": false,
    "name": "Power Systems Journey",
    "fullname": "Power Systems Journey: Making the Invisible Visible and Actionable",
    "info": "An energy revolution is underway, and needs to accelerate to support climate and economic goals. But the general citizenry does not understand our current energy systems, particularly the seemingly invisible phenomena of electricity, and its generation, distribution, and use. Technical knowledge is only half the solution, however. It is through human decisions and behaviors that technical solutions get applied and adopted, and the importance of communication and storytelling is being recognized for its relevance to making change. How can science literacy and behavior-motivating engagement and storytelling be combined to help make systemic change? This course explores the integration of science-based environmental education, with art-led, place-based exploration of landscapes and creative map-making to address this challenge. How do we make electricity visible, understandable, and interesting -- so we can engage citizens in energy conservation with basic literacy about the electric power system so that they can be informed voters, policy advocates, and consumers. In this class, you will take on this challenge, first learning about the electric power systems you use, their cultural and technical history, systems thinking, design thinking, and prior examples of communication and education efforts. With this foundation, you will then apply your learning to create a public education project delivered via online GIS Story maps that use a combination of data, art, and story to help others understand, and act on the power journey we are all on. All will share the  common exploration of power systems through field trips, and contribute to a multi-faceted story of power, presented in a group map and individual GIS Story maps. No prior knowledge of GIS story maps or electricity issues is needed. The study of power systems can be a model for learning and communicating about other topics that explore the interaction of technology and society toward sustainability. This is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students.",
    "prereq": []
  },
  {
    "uid": "818163",
    "code": "GCC3028",
    "subject": "GCC",
    "number": "3028",
    "honors": false,
    "writingIntensive": false,
    "name": "Building a Culture of Health",
    "fullname": "Harnessing the power of research, community, clinic and policy to build a culture of health",
    "info": "Imagine a world where factors such as race, ethnicity, and socioeconomic status had no bearing on a person's health status, quality of life, or longevity--a world where everyone had an equal opportunity to live a long and healthy life. Unfortunately, this is not the case. Despite decades of focused public health efforts, health inequities remain; individuals from low income and diverse racial/ethnic backgrounds are far more likely to, (1) struggle with chronic health conditions, (2) report lower quality of life, and (3) have a lower life expectancy, than others. Bold and innovative solutions are needed to address this grand challenge. Integration is one such method that can potentially increase the success and sustainability of approaches to reduce health disparities and create a culture of health for all. Integration is an approach to solving complex public health problems that merges academic research, clinical practice, policy and community resources in new ways.This interactive course will challenge students to identify root causes of health, including access to food, housing, transportation and education. Students will also focus on health disparities and barriers to eliminating these existing, disparate, negative outcomes. Students will be introduced to the concept of integration science and practice; will learn about the importance of integration across research, practice, community, and policy domains to address health disparities; and will cultivate the communication skills needed to intentionally and successfully facilitate integration practice. Course instructors with unique vantage points as concerned scientists, health practitioners, and policy wonks will engage students in class discussions and activities, individual writing assignments and small-group work aimed at unveiling the reasons health disparities persist globally--challenging them to consider opportunities for integration to alleviate existing disparities. The semester will culminate in students working in groups to create their own integrated projects aimed at addressing a health disparity.",
    "prereq": []
  },
  {
    "uid": "818311",
    "code": "GCC3029",
    "subject": "GCC",
    "number": "3029",
    "honors": false,
    "writingIntensive": false,
    "name": "Agents of Change",
    "fullname": "Agents of Change: scientific and philosophical perspectives",
    "info": "Grand challenges like structural racism, climate change, gender oppression, and global poverty have to be solved by individual people, acting together, often through institutions. This means that we need good agents of change to address the challenges we face.  What does it mean to be a ‘good agent’?  What are the best ways to think about this kind of agency? And how can we foster more of it in ourselves, our friends, our children, and our fellow citizens? This course is taught by a philosopher and a psychologist, and we approach questions like these from both perspectives. Traditionally, many philosophers have thought that we need to cultivate virtues such as compassion and open-mindedness in order to be good people. Some recent psychological work casts doubt on this picture: the social and environmental forces that influence our behavior cannot be overcome with virtuous character! On the other hand, psychological research also shows that some of the good traits we have are ones that develop reliably, from early childhood. Which perspective offers more opportunities for progress? Should we foster good agency by working on individual character or by changing social circumstances? Or, if both are important, what would a combined approach look like? The ultimate goal of the course is to encourage students to apply the theoretical and scientific ideas about improving agency to specific grand challenges. How do philosophy and psychology help us to define and resolve the challenges that confront people who want to make a difference? To provide a model for this kind of research, we focus on structural racism and white supremacy to expose the ways in which individual and structural forces can impede epistemic and moral agency. Course requirements include active class participation, group projects, and writing assignments designed to foster creative engagement across different fields.",
    "prereq": []
  },
  {
    "uid": "815340",
    "code": "GCC3031",
    "subject": "GCC",
    "number": "3031",
    "honors": false,
    "writingIntensive": false,
    "name": "Engaging Climate Action",
    "fullname": "The Global Climate Challenge: Creating an Empowered Movement for Change",
    "info": "Students will explore ecological and human health consequences of climate change, the psychology of climate inaction, and will be invited to join us in the radical work of discovering not only their own leadership potential but that of others. We will unpack the old story of domination and hierarchy and invite the class to become part of a vibrant new story of human partnership that will not only help humanity deal with the physical threat of climate change but will help us create a world where we have the necessary skills and attitudes to engage the many other grand challenges facing us. Using a strategy of grassroots empowerment, the course will be organized to help us connect to the heart of what we really value; to understand the threat of climate change; to examine how we feel in the light of that threat; and to take powerful action together. Students will work in groups throughout the course to assess the global ecological threat posed by climate change, and they will be part of designing and executing an activity where they empower a community to take action. This is a Grand Challenge Curriculum course.prereq: soph, jr, sr",
    "prereq": []
  },
  {
    "uid": "817503",
    "code": "GCC3032",
    "subject": "GCC",
    "number": "3032",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecosystem Health",
    "fullname": "Ecosystem Health: Leadership at the Intersection of Humans, Animals, and the Environment",
    "info": "What are the effects of climate change, disease emergence, food and water security, gender, conflict and poverty, and sustainability of ecosystem services on health, and how do we lead across boundaries for positive change? Unfortunately, these large-scale problems often become overwhelming, making single solution-based progress seem daunting and difficult to implement in policy. Fortunately, the emerging discipline of ecosystem health provides an approach to these problems grounded in trans-disciplinary science. Ecosystem health recognizes the interdependence of human, animal and environmental health, and merges theories and methods of ecological, health and political sciences. It poses that health threats can be prevented, monitored and controlled via a variety of approaches and technologies that guide management action as well as policy. Thus, balancing human and animal health with the management of our ecosystems. In this class, we will focus on the emerging discipline of ecosystem health, and how these theories, methods, and shared leadership approaches set the stage for solutions to grand challenges of health at the interface of humans, animals, and the environment. We will focus not only on the creation and evaluation of solutions but on their feasibility and implementation in the real world through policy and real-time decision making. This will be taught in the active learning style classroom, requiring pre-class readings to support didactic theory and case-based learning in class. Participation and both individual and group projects (written and oral presentation) will comprise most of the student evaluation. These projects may reflect innovative solutions, discoveries about unknowns, or development of methods useful for ecosystem health challenges. We envision that some of them will lead to peer-review publications, technical reports, or other forms of publication. This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "818766",
    "code": "GCC3033",
    "subject": "GCC",
    "number": "3033",
    "honors": false,
    "writingIntensive": false,
    "name": "Advancing Health Equity",
    "fullname": "Advancing Health Equity: The Structural Determination at Home and Abroad",
    "info": "This course immerses students in the study of health equity, the social and structural determination of health, and the principles and practice of global health in a local setting.  Through experiential study of the history, politics, and social and cultural narratives of communities in Minnesota, learners will bear witness to social forces that cause illness and those that support health.  We will seek to understand accompaniment, or the practice of walking alongside and supporting communities, as well as the efforts of those who challenge power and work for social justice to change the structural determination of health.   Demonstrating that health equity demands much more than healthcare, an interdisciplinary teaching team will draw on the disciplines of anthropology, sociology, economics, history, public policy, biomedicine, public health, and the arts to provide students with a foundation to understand the complex, interrelated forces that shape health in communities. The course will incorporate numerous “classroom-less” experiences to facilitate conversation and relationship-building between students and community members and organizations working to promote health.  The course will prioritize experiential pedagogy including community engagement; neighborhood walks and tours; group and individual reflection; theater, film, and other art forms; and prioritization of narrative to understand patient, community, and health professional experiences. Recognizing that advancing health equity requires community-building and social cohesion, the course will also utilize pedagogy that promotes critical self-reflection and builds classroom community.  The course will integrate considerable reflection upon personal experiences with power, privilege, race, class, and gender; incorporates assignments that are action-oriented and focused on learning skills to lead change; and seeks to expand social cohesion in the communities of participants. These aspects of the course will provide rich opportunities to develop leadership, advocacy, and communication skills that are important for advancing health equity in partnership with communities.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "819021",
    "code": "GCC3035",
    "subject": "GCC",
    "number": "3035",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Labor Global Perspective",
    "fullname": "Child Labor: Work, Education, and Human Rights in Global Historical Perspective",
    "info": "It seems obvious that we should oppose child labor. Or should we? This course challenges students to think critically about the many angles that need to be considered in deciding whether any particular type of children's work should be opposed or permitted. Drawing on contemporary and historical scholarship in the interdisciplinary arena of childhood and youth studies, this course takes on ethical as well as economic analyses; it reflects upon child development and legal perspectives; it examines cases ranging across the globe and across recent centuries. It may very well change the way you think about kids, forever. Historians find evidence of many different kinds of \"childhoods,\" as well as changing notions of what work is appropriate for children. Coming from social-scientific and policy studies approaches, analysts and critics of contemporary global policies affecting child labor argue that the presumed superiority of “modern Western childhood” needs rethinking. This course will also look at tensions between the presumption that schooling should be the only or primary occupation of childhood years and competing ideas child labor can be valuable and justifiable in many settings including, for example, American farm families. Looking at child labor from comparative global and historical perspectives will encourage and enable students to address some important questions: What types of “work” have children done in various modern historical and contemporary settings? When and how is work arguably bad, or good, for children and their families? Under what conditions is schooling better than work, or vice-versa? Who gets to decide “what’s best for children”? How should governments intervene, and how does intervention differ when children work for their family as opposed to other employers? What forms of regulatory measures or political activism have changed policies and practices regarding child labor in the past and present?This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "819362",
    "code": "GCC3036",
    "subject": "GCC",
    "number": "3036",
    "honors": false,
    "writingIntensive": false,
    "name": "Indigenous Lands and Languages",
    "fullname": "Seeking Connection through Decolonization: The Power of Indigenous Lands and Languages",
    "info": "Seeking Connection through Decolonization: The Power of Indigenous Languages and Place-Based Knowledge in the Face of RacismHow has unequal distribution of power resulted in the decline in Indigenous language and the loss of societal connections to the land? How might we all, from different positionalities, revitalize our relationships to indigenous land and languages, in the face of racism and attempts to perpetuate colonization? In this course students will grapple with ideological roots of the ongoing decline in Indigenous language and place-based knowledge and how their decline has implications for all peoples. To understand the connections, students will participate in Indigenous language learning (Dakota and Ojibwe) as acts of cultural production. Discussion and reading will be supplemented with visits to local sites, for example,  Medicine Gardens, Bell Museum, Gibbs Farm, and Bdote to directly interact with the land as pedagogy. Through the course themes, students will experience the interconnectedness of place-based knowledge, language, and human identity, while also seeing the importance of understanding the lands on which one resides and the power of indigenous languages in re-imagining those relationships. This is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students. ",
    "prereq": []
  },
  {
    "uid": "819950",
    "code": "GCC3037",
    "subject": "GCC",
    "number": "3037",
    "honors": false,
    "writingIntensive": false,
    "name": "Wealth & Inequality",
    "fullname": "Wealth & Inequality: Past, Present, Future",
    "info": "Fostering just and equitable communities is a grand challenge of our time. The global wealth gapbetween a handful of elites and the rest of the world’s population is increasingly unsustainable. Acrossthe last generation, wealth inequality has spiked more sharply than ever before, and even the elite havecome to recognize how concerning rising inequality has become with the World Economic Forumranking “wealth disparity” among the top five risks facing the planet right now.In this course, we will explore how our society came to produce such a severe concentration of wealth inthe hands of a privileged few. Our focus is on wealth--the total amount of accumulated assets, broadlydefined, in individuals, households, communities, and beyond--because it is precisely these starklyuneven stores of value, reproduced through inheritances across generations, that have acceleratedcontemporary inequality.We will work to understand the social structures, historical conjunctures, and global processes thatperpetuate the inequitable distribution of wealth in our current moment. We will then envision socialchanges that promise to reduce wealth disparities and create a more just and equitable world.Throughout, we will explore how culture, identity, institutions, economic and political systems, andother social forces are entangled with and constitute the global flows of money and assets.The purview of this course is global, as our attention will focus on the large global and structuralprocesses and historical conjunctures that have long shaped global wealth inequality. It makes littlesense to limit the inquiry to national borders given the unequal distribution of wealth was produced ona global scale.At the same time, we are mindful of the importance to act (and think) locally; as such, many of ourexamples and readings will focus on the United States. Given that wealth inequality in the U.S. is one ofthe worst in the world--the richest 1 percent have captured nearly 60 percent of all income gains from1977 to 2000, and in 2010, the top 20 percent of households owned almost 90 percent of all privatelyheld wealth in the US, while the net worth of the bottom 40 percent was negative-- it will serve as animportant case study.Instead of addressing the key causes of inequality, the powerful across the world have seized on theseconditions to mobilize an avalanche of discontent among sectors of the downwardly mobile in a waythat often obscures the key reasons for their predicament and scapegoats those at the social margins.Given this context, it is imperative to better understand and analyze the histories, cultural assumptions,and hierarchies that have produced contemporary inequalities, locally, regionally, and globally.Developing this shared understanding--as we will do in this course--is critical for our potential to addressthis and the other interrelated grand challenges facing us. This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "819951",
    "code": "GCC3038",
    "subject": "GCC",
    "number": "3038",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Threats to Ocean Health",
    "fullname": "Human Threats to Ocean Health",
    "info": "Human Threats to Ocean HealthThis grand challenge course addresses the scope of the anthropogenic alterations in natural biogeochemical cycling (BGCC) of oceans that will help the students to develop strategies to intervene, advocate, and sustain planetary health for all of humanity. The following grand challenge questions will be addressed: (1) How does Ocean Biogeochemical Cycling (BGCC) of nutrients support global ecosystems and biodiversity? (2) What human (anthropogenic) activities disrupt ocean BGCC of nutrients, resulting in depletion of biodiversity, ecosystem health, ecosystem services, and environmental justice for humans? (3) What do humans have to do to protect the future of ocean health and all of humanity?Global recycling of nutrients and metals within the environment (geosphere, hydrosphere and atmosphere) and the biosphere are essential for maintaining biodiversity and ecosystem services on which all of humanity depends. Living organisms extract and transform nutrients for their metabolism, growth, and reproduction, ultimately releasing these nutrients (often in a transformed state) back to the inanimate sphere via biogeochemical cycling (BGCC) driven by energy transformations. In natural environments, BGCC maintains a dynamic equilibrium/homeostasis between abiotic and biotic spheres, a process essential for survival of life on Earth. However, the current human practices have caused massive changes in the BGCC of nutrients, thus disrupting the natural cycling and (i) threatening the biosphere’s nutrient availability and (ii) precipitating many of the current environmental problems such as climate change, nitrogen pollution, ocean acidification, acid rain, mercury deposition, etc. At the current scale of human development, these alterations to the BGCC in the oceans may seriously damage the environment and biodiversity, thus threatening the entire Planet’s future. Further, the adverse effects of the loss of ecosystem services may not be shared equally amongst society, whereby access to a healthy environment is increasingly distributed by power, class, and race. An understanding of these inequities and incorporation of environmental justice in eco-centric environmental advocacy will be essential for sustaining the health of our planet. Therefore, the students registering for this course will develop an understanding and the scope of the anthropogenic alterations in natural biogeochemical cycling of oceans that will help them develop strategies to intervene, advocate, and sustain planetary health for all of humanity. The specific aims are following: (1) Describe global and local mechanisms of natural BGCC on Earth and connection to the oceans; (2) Explain human impacts on BGCC, and relationships between abnormal BGCC and nutrient distribution in water, sediment, and air; (3) Determine impact of human-altered ocean nutrient cycling on society, including members disproportionately impacted by environmental issues and underrepresented in environmental movements; (4) Strategize sustainable strategies to mitigate the health and environmental problems associated with abnormal biogeochemical nutrient cycling, bringing environmental justice perspectives to the forefront; and (5) Convince students that positive actions made now can and will impact the future.This course will focus on multiple vectors of inquiry (i.e., chemistry, toxicology, environment science and justice, sustainability and biodiversity), and students' progress through the course will give them powerful tools to confront the Grand Challenges of our age, global change in biogeochemical cycles.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "819954",
    "code": "GCC3039",
    "subject": "GCC",
    "number": "3039",
    "honors": false,
    "writingIntensive": false,
    "name": "Creative Thinking",
    "fullname": "Creative Thinking: Strategies to Enhance Creative Capital in Society",
    "info": "Our world is facing multiple crises that demand increasingly innovative solutions. This is happening just when the creative capacity of our society as a whole has steadily decreased (The Creativity Crisis by Kyung Hee Kim). The challenge is to develop more creative capital. The drive to be curious supports our ability to generate ideas that are new and valuable while the drive to conform allows us to spread those ideas. Students will study not only creativity, but characteristics of conformity that maximize the spread ideas. Creative ‘muscle’ is strengthened when people are curious, ask questions, speculate more, and test theories rather than passively observe. Creative capital increases when groups of people have an easy and attractive way to do that. The goal of this course is not only to teach individuals creative techniques, but to teach how to spread creative thinking by making creativity as contagious as a weaponized virus, as addictive as an opioid drug, as habitual as your afternoon snack.",
    "prereq": []
  },
  {
    "uid": "819994",
    "code": "GCC3041",
    "subject": "GCC",
    "number": "3041",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Sustainability",
    "fullname": "Transition to a Sustainable World: Can Behavior Modification Help Facilitate Global Sustainability?",
    "info": "Despite understanding the consequences of not acting to curb unsustainability, why do people fail to act? Human’s behavioral apathy toward sustainability may be due to an inaccurate characterization of sustainability and/or a lack of understanding of cultural diversity and behavior. Therefore, an understanding of the human behavior will contribute greatly to (i) decipher human actions that negatively impact global ecosystems, (ii) slowdown or stop human ecologically destructive trajectory, and (iii) promote sustainable alternatives. The problem is that environmental issues are not generally included in psychology programs, and psychology is not often represented in environmental programs. In the United Nation’s (UN) Sustainable Development goals 2030 (UN SDG 2030), psychological indices have been conspicuously absent (except for mental health in general terms) even though environmental degradation, social or economic inequity, all are implicated by human behavior. The UN SDG 2030 is based on the unproven concept that sustainability is an intersection of social, economic and environmental factors, the key pillars of sustainability. Since economic activity and society are subsets of human behavior, psychology should be considered central to unsustainability and/or sustainability. Therefore, we hypothesize that behavioral psychology has a critical role to play in creating a sustainable society. The aim of the proposed GCC is to discuss (un)sustainability using this new paradigm that will allow new approaches to achieve transition from unsustainability to sustainability worldwide. The specific aims of the proposed GCC are following: (i) Describe interaction between sustainability and behavioral psychology as the 4th pillar of sustainability. (ii) Explain the behavioral correlates of cultural differences in terms of transition to sustainability. (iii) Explain the consumption (related to unsustainability) and conservation (related to sustainability) behavior. (iv) Determine the place of Psychology in the UN’s Sustainable Development Goals (SDGs) that are mostly based on Sociology, Economy and Environment. (v) Describe humanity’s transition from unsustainable to sustainable development. This is a Grand Challenge Curriculum Course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students.",
    "prereq": []
  },
  {
    "uid": "820090",
    "code": "GCC3042",
    "subject": "GCC",
    "number": "3042",
    "honors": false,
    "writingIntensive": false,
    "name": "Higher Ed & Mass Incarceration",
    "fullname": "Just Education: The Role of Higher Education in Disrupting Mass Incarceration",
    "info": "The United States has the highest incarceration rate in the world. We have just 5% of the world’s population, but 25% of its prisoners. Since 1970, the number of incarcerated persons in this country has increased by 700%. Of the 2.3 million people currently in prison or jail, however, just 6 percent have access to higher education. Indeed, contemporary higher education policy and infrastructure disregards incarcerated individuals as potential postsecondary students.  Even as colleges and universities across the country champion diversity-driven and inclusivity-oriented mission statements, and look to create viable postsecondary pathways for systemically underserved students, only a handful include incarcerated and justice-impacted individuals in these efforts.  The University of Minnesota is not currently among them. This course will explore the intersection of higher education and mass incarceration in the United States with a focus on the role of higher education in disrupting the collateral consequences of incarceration and justice involvement. In particular, we will examine the potential for the University of Minnesota to play a pivotal role in disrupting what we call the “ripple effect” of incarceration and justice involvement on individuals and communities in Minnesota. Students will have an opportunity to tour local correctional facilities and both hear from and present to experts in the field, including formerly incarcerated people. In addition, students’ ideas will directly inform a “college in prisons” program that is being developed by Professors Moriearty and Shlafer, in collaboration with other University scholars and administrators, and the Minnesota Department of Corrections. In this way, students’ work in this class and their projects will directly and meaningfully inform the real world and the development of the college in prisons program in “real time.” As a teaching team with expertise in law, juvenile justice, criminal justice, child welfare, psychology, and public health, Professors Moriearty and Shlafer will highlight examples of successful interdisciplinary collaborations from their own research and practice experience. In addition, students will hear from guest lecturers from multiple disciplines and affiliations (including an Assistant Commissioner and educational expert at the Minnesota Department of Corrections and law, public heath, arts, information technology, and sociology instructors from the University) and panels of stakeholders, policy-makers and formerly incarcerated/justice impacted individuals.This is a Grand Challenge Curriculum course. ",
    "prereq": []
  },
  {
    "uid": "820187",
    "code": "GCC3043",
    "subject": "GCC",
    "number": "3043",
    "honors": false,
    "writingIntensive": false,
    "name": "Regenerative Game Studio",
    "fullname": "Regenerative Game Studio: Playing For the Future",
    "info": "Meeting the interrelated UN Sustainable development goals facing humanity will require imagination and emotional labor of unprecedented scale. We must collectively learn to overhaul our extractive systems with regenerative approaches in which humans are in a mutually beneficial relationship with the earth’s systems. The task of working across SDGs is a grand challenge in itself. Games are an effective way to engage people in understanding complex problems and collaborating toward solutions. Designing games challenges students to examine systems, identify leverage points, confront trade-offs, and be creative. In doing so, it prepares them to become system teachers, leveraging organizations and networks for change. We invite students from a range of backgrounds to apply their disciplinary expertise and interests in new ways. No prior sustainability knowledge or game design experience is needed. This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "816032",
    "code": "GCC5001",
    "subject": "GCC",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Can We Feed the World?",
    "fullname": "Can We Feed the World Without Destroying It?",
    "info": "In this course, we will seek solutions to the challenge of achieving global food security and sustainability. Together, we will work to answer the question, \"Can we feed the world without destroying it?\" The course begins with lectures and skills workshops, followed by a series of interactive panels with guest experts. We will also prepare group projects that are focused on finding innovative solutions to this grand challenge. We will learn about the fundamental changes occurring in the global food system, the environment, and our civilization as a whole. We will explore how to approach inherently interdisciplinary problems, how to identify solutions that are truly sustainable in the long term, and how science and technology can inform decision-making.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "814158",
    "code": "GCC5003",
    "subject": "GCC",
    "number": "5003",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Health Solutions",
    "fullname": "Seeking Solutions to Global Health Issues",
    "info": "Often, the most progress on challenging issues such as health and equity is made when you apply an interdisciplinary perspective. The same is true for global health issues. Whether responding to emerging pandemics, food insecurity, maternal mortality, or civil society collapse during conflict, solutions often lie at the intersection of animal, environmental, and human health.\n\nIn this course, students will work in teams to examine the fundamental challenges to addressing complex global health problems in East Africa and East African refugee communities here in the Twin Cities. Together we will seek practical solutions that take culture, equity, and sustainability into account. In-field professionals and experts will be available to mentor each team, including professionals based in Uganda and Somalia. This exploration will help students propose realistic actions that could be taken to resolve these issues. This course will help students gain the understanding and skills necessary for beginning to develop solutions to global health issues. \n\nThis is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students. ",
    "prereq": []
  },
  {
    "uid": "814234",
    "code": "GCC5005",
    "subject": "GCC",
    "number": "5005",
    "honors": false,
    "writingIntensive": false,
    "name": "Design for a Disrupted World",
    "fullname": "Innovation for Changemakers: Design for a Disrupted World",
    "info": "Do you want to make a difference? We live in a world full of complex challenges, such as COVID-19, racism, economic recession, and environmental collapse, to name a few. Now is the time to use your own skills and passion to make a positive impact in the world. \n\nIn this project-based course, you will learn how to develop effective and sustainable responses to current social and environmental problems. You'll study a variety of tools, mindsets, and skills that will help you to address any complex grand challenge, as well as engage with case studies of successful grand challenge projects in the past. Your project may address food insecurity, unemployment, housing, environmental impacts, equity, or other issues. Proposed designs for how you might have an impact may take many forms (student group, program intervention with an existing organization, public policy strategy, or for-profit or non-profit venture) but this class will focus on how to make ideas financially sustainable. \n\nThe primary focus of this (GCC 5005) course is how to develop a pilot project plan that addresses a grand challenge. You will learn business modeling, financial projections, and pitching to potential investors and funders. You will build a model for your idea around input from primary and secondary research, as well as the affected community’s culture, needs, and wants.\n\nCommunity members, locally and globally, may serve as mentors and research consultants to teams. External speakers will be brought in to share their stories of how to build and scale innovative efforts to serve the common good. Students enrolled will work either independently, or in small teams, on a project of their own choosing. Ideally, students will apply to take this class with a project in mind. By the end of the class, students will have a well-designed plan to turn their project into an actionable solution if that is of interest.\n\nThis is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students.",
    "prereq": []
  },
  {
    "uid": "814328",
    "code": "GCC5007",
    "subject": "GCC",
    "number": "5007",
    "honors": false,
    "writingIntensive": false,
    "name": "Toward Conquest of Disease",
    "fullname": "Toward Conquest of Disease",
    "info": "Since the rise of civilization, the large predators of humans have been subdued and the most dangerous predators remaining are those unseen--vastly smaller than our bodies. They are the microbial predators that cause disease. Infectious disease has devastated human populations and even caused global population declines. Subduing and managing disease is one of the grand challenges of our time. Through an enormous global effort, we have driven smallpox in humans and Rinderpest in livestock extinct from the natural world, and guinea worm is expected to follow. Other infectious diseases are in continual decline. In this course we will combine ecological thought and ecological models with historical and future perspectives to understand the fundamental dynamics of our miniscule predators, and relate this to similar miniscule predators of wild and domestic animals, to crops, and to other plants.\n\nThis is a Grand Challenge Curriculum course.\nprereq: sophomore, junior, senior, graduate student",
    "prereq": []
  },
  {
    "uid": "815255",
    "code": "GCC5008",
    "subject": "GCC",
    "number": "5008",
    "honors": false,
    "writingIntensive": false,
    "name": "Policy & Sci Global Env Change",
    "fullname": "Policy and Science of Global Environmental Change",
    "info": "Through readings, lectures, discussions, written assignments, and presentations this course introduces the critical issues underpinning global change and its environmental and social implications. The course examines current literature in exploring evidence for human-induced global change and its potential effects on a wide range of biological processes and examines the social and economic drivers, social and economic consequences, and political processes at local, national, and international scales related to global change.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "815343",
    "code": "GCC5011",
    "subject": "GCC",
    "number": "5011",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathways to Renewable Energy",
    "fullname": "Pathways to Renewable Energy",
    "info": "This interdisciplinary course will examine obstacles to energy transitions at different scales. It will explore the role of energy in society, the physics of energy, how energy systems were created and how they function, and how the markets, policies, and regulatory frameworks for energy systems in the US developed. The course will closely examine the Realpolitik of energy and the technical, legal, regulatory, and policy underpinnings of renewable energy in the US and Minnesota. Students will learn the drivers that can lead global systems to change despite powerful constraints and how local and institutional action enables broader reform. Students will put their learning into action by developing a proposal and then working on a project to accelerate the energy transition and to ensure that the energy transition benefits people in a just and equitable way. This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "815345",
    "code": "GCC5012",
    "subject": "GCC",
    "number": "5012",
    "honors": false,
    "writingIntensive": false,
    "name": "Strctrl Violence & Med Exprnc",
    "fullname": "Structural Violence & The Medication Experience",
    "info": "The course will use a social justice framework for learning and communicating about structural violence and the intersection of culture, the medication experience, and community health. Utilizing principles of community engagement, we will focus on examining how broader Community Health and the individual Medication Experience are impacted by the overcoming of structural violence experienced by communities locally as well as globally. Using Critical Race Theory and Social Ecological frameworks, we will come to a more complex understanding of our own social locations and the interplay of power and privilege while exploring the root causes of health disparities and the development of solutions that address inequities in health, education, housing, employment, and access to respectful health care. Students will learn to critically analyze these lived experiences while developing interactive storytelling, digital documentaries, digital essays and narratives to advance knowledge on health inequities in our community.",
    "prereq": []
  },
  {
    "uid": "815348",
    "code": "GCC5013",
    "subject": "GCC",
    "number": "5013",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change: Science & Art",
    "fullname": "Making Sense of Climate Change - Science, Art, and Agency",
    "info": "The overarching theme of the course is the role of artistic/humanistic ways of knowing as tools for making sense and meaning in the face of \\\"grand challenges.\\\" Our culture tends to privilege science, and to isolate it from the \\\"purposive\\\" disciplines--arts and humanities--that help humanity ask and answer difficult questions about what should be done about our grand challenges. In this course, we will examine climate change science, with a particular focus on how climate change is expected to affect key ecological systems such as forests and farms and resources for vital biodiversity such as pollinators. We will study the work of artists who have responded to climate change science through their artistic practice to make sense and meaning of climate change. Finally, students create collaborative public art projects that will become part of local community festivals/events late in the semester.\n\nThis is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "816564",
    "code": "GCC5014",
    "subject": "GCC",
    "number": "5014",
    "honors": false,
    "writingIntensive": false,
    "name": "The Future of Work & Life",
    "fullname": "The Future of Work and Life in the 21st Century",
    "info": "This course seeks solutions to the technological, demographic, and economic forces that challenge taken-for-granted mindsets and existing policies around work, careers, and life. Students will consider positive and negative impacts of the forces that render the conventional education/work/retirement lockstep obsolete.  What do these changes mean for men and women of different ages and backgrounds? What are alternative, sustainable ways of working and living in the 21st century? These questions reflect global challenges that touch the lives of people everywhere. Students will work in teams to begin to address these realities and formulate innovative solutions to better transform learning, working, caring, and community-building in the 21st century.\n\nThis is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "816566",
    "code": "GCC5015",
    "subject": "GCC",
    "number": "5015",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioinspired Technologies",
    "fullname": "Bioinspired Approaches to Sustainability: Greening Technologies and Lives",
    "info": "How can we build a sustainable society? From designing cities and technologies that use green energy, to health care and agriculture that can sustain billions, the sustainability challenges that face us today are immense. The field of biomimicry seeks solutions to such problems by looking to the diverse ways in which organisms have adapted to varied and sometimes extreme environments. With over 1.3 million described species (and likely over 8 million in existence), chances are a species out there has evolved some solution to a particular problem. But how do we go about figuring out which species this might be? And which trait holds the adaptation in which we are interested? What might be some limitations associated with copying this adaptation ? how might we build on it instead? This course teaches bioinspired approaches to sustainability solutions. Throughout the course, students work in teams of complementary expertise to identify a sustainability problem, research a relevant biological system, and build a prototype bio-inspired solution to their focal problem.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "817683",
    "code": "GCC5016",
    "subject": "GCC",
    "number": "5016",
    "honors": false,
    "writingIntensive": false,
    "name": "Antibiotic Resistance",
    "fullname": "Science and Society: Working Together to Avoid the Antibiotic Resistance Apocalypse",
    "info": "Before the discovery of antibiotics, even a simple thorn prick could lead to life threatening infection. Antibiotics are truly miracle drugs, making most bacterial infections relatively easy to cure. However, this landscape is rapidly changing with the advent of microbes that are resistant to antibiotics. This course will provide an overview of how antibiotic use invoked antibiotic resistance, including in depth discussions of antibiotic resistant microorganisms and the impact of globalization on this exploding problem. Societal and ethical implications associated with antibiotic use and restriction in humans and animals will be discussed, along with global issues of antibiotic regulation and population surveillance. The class will conclude with discussions of alternative therapeutic approaches that are essential to avoid \\\"antibiotic apocalypse.\\\" The course will include lectures by world-renowned experts in various topics, and students will leverage this knowledge with their own presentations on important topics related to issues of personal freedom versus societal needs.\n\nThis is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "817124",
    "code": "GCC5017",
    "subject": "GCC",
    "number": "5017",
    "honors": false,
    "writingIntensive": false,
    "name": "Agronomics, Economics & Hunger",
    "fullname": "World Food Problems: Agronomics, Economics and Hunger",
    "info": "This course provides a multi-disciplinary look at problems (and some of the possible solutions) affecting food production, distribution, and requirements for the seven plus billion inhabitants of this planet. It is co-taught by a plant geneticist (Morrell) and an economist (Runge) who together have worked on international food production and policy issues for the past 40 years. Historical context, the present situation and future scenarios related to the human population and food production are examined. Presentations and discussions cover sometimes conflicting views from multiple perspectives on population growth, use of technology, as well as the ethical and cultural values of people in various parts of the world. The global challenge perspective is reflected in attention to issues of poverty, inequality, gender, the legacy of colonialism, and racial and ethnic prejudice. Emphasis is placed on the need for governments, international assistance agencies, international research and extension centers, as well as the private sector to assist in solving the complex problems associated with malnutrition, undernutrition, obesity, and sustainable food production.\n\nThrough a better understanding of world food problems, this course enables students to reflect on the shared sense of responsibility by nations, the international community and ourselves to build and maintain a stronger sense of our roles as historical agents. Throughout the semester students are exposed to issues related to world food problems through the lenses of two instructors from different disciplinary backgrounds. The core issues of malnutrition and food production are approached simultaneously from a production perspective as well as an economic and policy perspective throughout the semester.  \n\nThis is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students.",
    "prereq": []
  },
  {
    "uid": "817510",
    "code": "GCC5022",
    "subject": "GCC",
    "number": "5022",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Exp. of Sensory Loss",
    "fullname": "The Human Experience of Sensory Loss: Seeking Equitable and Effective Solutions",
    "info": "This course focuses on the visual, auditory, and other sensory pathways that convey information about the world to mind and brain. Millions of people worldwide experience deficits in sensory function that affect their quality of life. We will focus on the characteristics of healthy sensory functioning as well as how sensory disorders can affect personal identity, impede information processing, and alter brain structure and function. The course will address the demographics and risk factors for sensory disabilities, the implications of these disabilities for activities of daily living, the history of society's response to sensory disability, as well as societal, ethical, and personal attitudes toward sensory disabilities. The course will also explore translational and applied approaches for addressing sensory disabilities. Each class session will be co-taught by a pair of instructors, representing multiple scientific and social perspectives. A major goal of the course is to view sensory function and impairment from multiple perspectives cognitive science, neuroscience, medicine, engineering, society, consumers, ethics and social justice. The course will combine lectures, discussions, and student-led presentations of research papers. The course will include hands-on demonstrations of assistive technology and panel discussions with people with visual and hearing disabilities. During the semester, each student (or pairs of students) will develop a mini research proposal to address a real-world issue related to sensory impairment. The proposal must be translational in nature, and must include consultation with consumers of the proposed project. The final class session will be devoted to poster presentations of the mini proposals. The proposal report must include consideration of potentially opposing viewpoints about the proposed research. This course addresses two of our University's grand challenges: Advancing Health Through Tailored Solutions, and Just and Equitable Communities.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "817692",
    "code": "GCC5023",
    "subject": "GCC",
    "number": "5023",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Across Sectors",
    "fullname": "Leading Across Sectors to Address Grand Challenges",
    "info": "\"The critical challenges society faces, such as water scarcity, access to education, and the rising cost of healthcare, increasingly require the business, government and nonprofit sectors to work together to create lasting solutions.\"-- Nick Lovegrove and Matthew Thomas, \"Why the World Needs Cross-Sector Leaders,\"  Harvard Business Review, February 13, 2013Numerous universities, including the University of Minnesota; business leaders; non-profit organizations and policy makers have increasingly emphasized the value and necessity of multisector leadership to address complex and critical challenges.  Such collaborative initiatives take place in broader social contexts; have key individual and organizational inputs; and can take many forms, from community task forces to organized collective impact initiatives to social enterprise organizations that blend private-sector incentives with public-service goals. Because they involve a conscious focus on we versus me, and operate largely apart from well-established processes or mission statements, they force us to examine civic life through a new lens and to (re)consider ethical questions related to it. This course explores multisector leadership from a variety of perspectives and provides an opportunity for students to work together to apply what they are learning individually and in teams through in-class exercises, peer coaching, and a final team grant proposal project. After an introductory session where students analyze and present answers related to specific case studies, we begin with an overview of relevant shared leadership theories and practice fields --- including collective, participatory and integrative leadership and an overview of relevant ethical questions and themes. We then consider relevant individual inputs into multisector leadership, including through having students assess their own leadership strengths, what they bring to the collaborative table, and contract with assigned interdisciplinary teams for peer coaching throughout the semester. The lens of the course moves to the collaboration itself after this focus on the individual, looking at techniques and qualities of successful teams, including those composed of diverse individuals or organizations. Finally, we move to considering different contexts, forms and specific examples of multisector leadership before concluding with presentations to an external panel of each student team?s grant proposal for a particular multisectoral initiative of their choosing that they believe will enable transformative action to tackle a significant societal issue and achieve lasting change.  Throughout the course, we consider the ethical questions that arise from focusing on multisector leadership. These questions relate, for example, to the role of trust and truth-telling in individual efforts to lead and collaborate; how and when it is appropriate to engage with others to address challenges that extend beyond the communities to which we belong; who defines priority problems to be addressed, and why; the role and potential of business to contribute to broader efforts to achieve public good; how equity and justice relate to collective leadership; and whether and how society is better off from the joining of organizational efforts across sectors. ",
    "prereq": []
  },
  {
    "uid": "817938",
    "code": "GCC5024",
    "subject": "GCC",
    "number": "5024",
    "honors": false,
    "writingIntensive": false,
    "name": "How Can We Sustain Humanity?",
    "fullname": "11 Billion People: How long can the planet sustain humanity?",
    "info": "As an evolved animal, humanity has always interacted with its environment, both through the ecology of its food web and through its modification of its geological surroundings. Yet the human ecological niche, and the breadth of its impact on the environment, has changed enormously through the biological and cultural evolution of our lineage, from our first two-legged ancestor; to the appearance of our own species, Homo sapiens; to the diversification of the hunter-gatherer adaptation at the end of the Pleistocene; to the invention of agriculture and animal husbandry in the Holocene; to the rise of craft specialization, social inequalities, and urbanism with the first state-level societies; and now the globalization of our food, diseases, and culture. Students in this course will explore how the cumulative effects of our biocultural evolution are putting the sustainability of our current population, now approaching 11 billion, at risk, mostly due to the unprecedented scale of humanity's impact on the Earth's ecosystems. This course investigates the origins, development, and predictions for humanity's ecological niche on the planet through a novel interdisciplinary fusion of the social and environmental sciences to give students i) the ability to see the environmental context of the present in an evolutionary light, as well as ii) the tools to evaluate possible remediation and sustainability approaches to control these problems at the local and global scale. The course provides an interdisciplinary immersion in these issues through combined instruction by anthropologists, archaeologists, historians, environmental scientists, ecologists, toxicologists, and sociologists. By focusing on multiple vectors of inquiry (i.e., society, economy, technology, environment) which can be considered at different scales (i.e., from past to present, local to global, individual to societal, temporary to long term), students' progress through the course will give them powerful tools to confront the Grand Challenges of our age, the Anthropocene.This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "818162",
    "code": "GCC5027",
    "subject": "GCC",
    "number": "5027",
    "honors": false,
    "writingIntensive": false,
    "name": "Power Systems Journey",
    "fullname": "Power Systems Journey: Making the Invisible Visible and Actionable",
    "info": "An energy revolution is underway, and needs to accelerate to support climate and economic goals. But the general citizenry does not understand our current energy systems, particularly the seemingly invisible phenomena of electricity, and its generation, distribution, and use. Technical knowledge is only half the solution, however. It is through human decisions and behaviors that technical solutions get applied and adopted, and the importance of communication and storytelling is being recognized for its relevance to making change. How can science literacy and behavior-motivating engagement and storytelling be combined to help make systemic change? This course explores the integration of science-based environmental education, with art-led, place-based exploration of landscapes and creative map-making to address this challenge. How do we make electricity visible, understandable, and interesting--so we can engage citizens in energy conservation with basic literacy about the electric power system so that they can be informed voters, policy advocates, and consumers. In this class, you will take on this challenge, first learning about the electric power systems you use, their cultural and technical history, systems thinking, design thinking, and prior examples of communication and education efforts. With this foundation, you will then apply your learning to create a public education project delivered via online GIS Story maps that use a combination of data, art, and story to help others understand, and act on the power journey we are all on. All will share the common exploration of power systems through field trips, and contribute to a multi-faceted story of power, presented in a group map and individual GIS Story maps. No prior knowledge of GIS story maps or electricity issues is needed. The study of power systems can be a model for learning and communicating about other topics that explore the interaction of technology and society toward sustainability. This is a Grand Challenge Curriculum course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students. ",
    "prereq": []
  },
  {
    "uid": "818164",
    "code": "GCC5028",
    "subject": "GCC",
    "number": "5028",
    "honors": false,
    "writingIntensive": false,
    "name": "Building a Culture of Health",
    "fullname": "Harnessing the Power of Research, Community, Clinic and Policy to Build a Culture of Health",
    "info": "Imagine a world where factors such as race, ethnicity, and socioeconomic status had no bearing on a person's health status, quality of life, or longevity--a world where everyone had an equal opportunity to live a long and healthy life. Unfortunately, this is not the case. Despite decades of focused public health efforts, health inequities remain; individuals from low income and diverse racial/ethnic backgrounds are far more likely to, (1) struggle with chronic health conditions, (2) report lower quality of life, and (3) have a lower life expectancy, than others. Bold and innovative solutions are needed to address this grand challenge. Integration is one such method that can potentially increase the success and sustainability of approaches to reduce health disparities and create a culture of health for all. Integration is an approach to solving complex public health problems that merges academic research, clinical practice, policy and community resources in new ways.\n\nThis interactive course will challenge students to identify root causes of health, including access to food, housing, transportation and education. Students will also focus on health disparities and barriers to eliminating these existing, disparate, negative outcomes. Students will be introduced to the concept of integration science and practice; will learn about the importance of integration across research, practice, community, and policy domains to address health disparities; and will cultivate the communication skills needed to intentionally and successfully facilitate integration practice. Course instructors with unique vantage points as concerned scientists, health practitioners, and policy wonks will engage students in class discussions and activities, individual writing assignments and small-group work aimed at unveiling the reasons health disparities persist globally--challenging them to consider opportunities for integration to alleviate existing disparities. The semester will culminate in students working in groups to create their own integrated projects aimed at addressing a health disparity.",
    "prereq": []
  },
  {
    "uid": "818165",
    "code": "GCC5029",
    "subject": "GCC",
    "number": "5029",
    "honors": false,
    "writingIntensive": false,
    "name": "Agents of Change",
    "fullname": "Agents of Change: scientific and philosophical perspectives",
    "info": "Grand challenges like structural racism, climate change, gender oppression, and global poverty have to be solved by individual people, acting together, often through institutions. This means that we need good agents of change to address the challenges we face.  What does it mean to be a ‘good agent’?  What are the best ways to think about this kind of agency? And how can we foster more of it in ourselves, our friends, our children, and our fellow citizens? \n\nThis course is taught by a philosopher and a psychologist, and we approach questions like these from both perspectives. Traditionally, many philosophers have thought that we need to cultivate virtues such as compassion and open-mindedness in order to be good people. Some recent psychological work casts doubt on this picture: the social and environmental forces that influence our behavior cannot be overcome with virtuous character! On the other hand, psychological research also shows that some of the good traits we have are ones that develop reliably, from early childhood. Which perspective offers more opportunities for progress? Should we foster good agency by working on individual character or by changing social circumstances? Or, if both are important, what would a combined approach look like? \n\nThe ultimate goal of the course is to encourage students to apply the theoretical and scientific ideas about improving agency to specific grand challenges. How do philosophy and psychology help us to define and resolve the challenges that confront people who want to make a difference? To provide a model for this kind of research, we focus on structural racism and white supremacy to expose the ways in which individual and structural forces can impede epistemic and moral agency. Course requirements include active class participation, group projects, and writing assignments designed to foster creative engagement across different fields.",
    "prereq": []
  },
  {
    "uid": "815341",
    "code": "GCC5031",
    "subject": "GCC",
    "number": "5031",
    "honors": false,
    "writingIntensive": false,
    "name": "Engaging Climate Action",
    "fullname": "The Global Climate Challenge: Creating an Empowered Movement for Change",
    "info": "Students will explore ecological and human health consequences of climate change, the psychology of climate inaction, and will be invited to join us in the radical work of discovering not only their own leadership potential but that of others. We will unpack the old story of domination and hierarchy and invite the class to become part of a vibrant new story of human partnership that will not only help humanity deal with the physical threat of climate change but will help us create a world where we have the necessary skills and attitudes to engage the many other grand challenges facing us. Using a strategy of grassroots empowerment, the course will be organized to help us connect to the heart of what we really value; to understand the threat of climate change; to examine how we feel in the light of that threat; and to take powerful action together. Students will work in groups throughout the course to assess the global ecological threat posed by climate change, and they will be part of designing and executing an activity where they empower a community to take action. This is a Grand Challenge Curriculum course.For: so, jr, sr, grad",
    "prereq": []
  },
  {
    "uid": "817504",
    "code": "GCC5032",
    "subject": "GCC",
    "number": "5032",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecosystem Health",
    "fullname": "Ecosystem Health: Leadership at the intersection of humans, animals and the environment",
    "info": "What are the effects of climate change, disease emergence, food and water security, gender, conflict and poverty, and sustainability of ecosystem services on health? Unfortunately, these large-scale problems often become overwhelming, making single solution-based progress seem daunting and difficult to implement in policy. Fortunately, the emerging discipline of ecosystem health provides an approach to these problems grounded in trans-disciplinary science. Ecosystem health recognizes the interdependence of human, animal and environmental health, and merges theories and methods of ecological, health and political sciences. It poses that health threats can be prevented, monitored and controlled via a variety of approaches and technologies that guide management action as well as policy. Thus, balancing human and animal health with management of our ecosystems. In this class, we will focus on the emerging discipline of ecosystem health, and how these theories, methods and computational technologies set the stage for solutions to grand challenges of health at the interface of humans, animals and the environment. We will focus not only on the creation and evaluation of solutions, but on their feasibility and implementation in the real world through policy and real time decision making. This will be taught in the active learning style classroom, requiring pre class readings to support didactic theory and case-based learning in class. Participation and both individual and group projects (written and oral presentation) will comprise most of the student evaluation. These projects may reflect innovative solutions, discoveries about unknowns, or development of methods useful for ecosystem health challenges. We envision that some of them will lead to peer-review publications, technical reports or other forms of publication.\n\nThis is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "818798",
    "code": "GCC5034",
    "subject": "GCC",
    "number": "5034",
    "honors": false,
    "writingIntensive": false,
    "name": "A Carbon-Neutral Economy",
    "fullname": "How Can We Transition Minnesota to a Carbon-Free Economy?",
    "info": "The science is clear that we need to decarbonize the economy on a global scale as soon as possible to prevent catastrophic effects of climate change on human health and the environment. What does it mean to develop a prosperous carbon-neutral economy, while also improving people’s lives and the environment? How can this transition happen to make the benefits of societal wealth more equitable, and while protecting vulnerable populations? Will a transition to a carbon-free economy force us to change our quality of life? Together we will seek practical solutions to address these complex challenges. While there isn’t a single “right” solution to grand challenges, progress can be made through an interdisciplinary perspective. This course will attempt to answer these questions through: A series of primers—lectures and discussions on key topics—to build your understanding of key topics for creating a carbon neutral economy Explore the conflicts that exist between solutions to rapidly reduce carbon emissions and create a clean energy future, through a deep case study of Minnesota “Knowledge to Impact” workshops that introduce key skills and capacities for addressing any complex challenge Working in interdisciplinary teams to build upon lectures, discussions, and workshops to propose a well-developed solution to a problem related to the course’s grand challenge.",
    "prereq": []
  },
  {
    "uid": "819022",
    "code": "GCC5035",
    "subject": "GCC",
    "number": "5035",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Labor Global Perspective",
    "fullname": "Child Labor: Work, Education, and Human Rights in Global Historical Perspective",
    "info": "It seems obvious that we should oppose child labor. Or should we? This course challenges students to think critically about the many angles that need to be considered in deciding whether any particular type of children's work should be opposed or permitted. Drawing on contemporary and historical scholarship in the interdisciplinary arena of childhood and youth studies, this course takes on ethical as well as economic analyses; it reflects upon child development and legal perspectives; it examines cases ranging across the globe and across recent centuries. It may very well change the way you think about kids, forever. Historians find evidence of many different kinds of \"childhoods,\" as well as changing notions of what work is appropriate for children. Coming from social-scientific and policy studies approaches, analysts and critics of contemporary global policies affecting child labor argue that the presumed superiority of \"modern Western childhood\" needs rethinking. This course will also look at tensions between the presumption that schooling should be the only or primary occupation of childhood years and competing ideas child labor can be valuable and justifiable in many settings including, for example, American farm families. Looking at child labor from comparative global and historical perspectives will encourage and enable students to address some important questions: What types of ?work? have children done in various modern historical and contemporary settings? When and how is work arguably bad, or good, for children and their families? Under what conditions is schooling better than work, or vice-versa? Who gets to decide what's best for children? How should governments intervene, and how does intervention differ when children work for their family as opposed to other employers? What forms of regulatory measures or political activism have changed policies and practices regarding child labor in the past and present?This is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "819693",
    "code": "GCC5036",
    "subject": "GCC",
    "number": "5036",
    "honors": false,
    "writingIntensive": false,
    "name": "Indigenous Lands and Languages",
    "fullname": "Seeking Connection through Decolonization: The Power of Indigenous Lands and Languages",
    "info": "Seeking Connection through Decolonization: The Power of Indigenous Languages and Place-Based Knowledge in the Face of Racism\n\nHow has unequal distribution of power resulted in the decline in Indigenous language and the loss of societal connections to the land? How might we all, from different positionalities, revitalize our relationships to indigenous land and languages, in the face of racism and attempts to perpetuate colonization? In this course students will grapple with ideological roots of the ongoing decline in Indigenous language and place-based knowledge and how their decline has implications for all peoples. To understand the connections, students will participate in Indigenous language learning (Dakota and Ojibwe) as acts of cultural production. Discussion and reading will be supplemented with visits to local sites, for example,  Medicine Gardens, Bell Museum, Gibbs Farm, and Bdote to directly interact with the land as pedagogy. Through the course themes, students will experience the interconnectedness of place-based knowledge, language, and human identity, while also seeing the importance of understanding the lands on which one resides and the power of indigenous languages in re-imagining those relationships. \n\nThis is a Grand Challenge Curriculum (GCC) course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students. ",
    "prereq": []
  },
  {
    "uid": "819955",
    "code": "GCC5039",
    "subject": "GCC",
    "number": "5039",
    "honors": false,
    "writingIntensive": false,
    "name": "Creative Thinking: Strategies",
    "fullname": "Creative Thinking",
    "info": "Our world is facing multiple crises that demand increasingly innovative solutions. This is happening just when the creative capacity of our society as a whole has steadily decreased (The Creativity Crisis by Kyung Hee Kim). The challenge is to develop more creative capital. The drive to be curious supports our ability to generate ideas that are new and valuable while the drive to conform allows us to spread those ideas. Students will study not only creativity, but characteristics of conformity that maximize the spread ideas. Creative ‘muscle’ is strengthened when people are curious, ask questions, speculate more, and test theories rather than passively observe. Creative capital increases when groups of people have an easy and attractive way to do that. The goal of this course is not only to teach individuals creative techniques, but to teach how to spread creative thinking by making creativity as contagious as a weaponized virus, as addictive as an opioid drug, as habitual as your afternoon snack.",
    "prereq": []
  },
  {
    "uid": "819995",
    "code": "GCC5041",
    "subject": "GCC",
    "number": "5041",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Sustainability",
    "fullname": "Transition to a Sustainable World: Can Psychology Help Facilitate Global Sustainability?",
    "info": "Despite understanding the consequences of not acting to curb unsustainability, why do people fail to act? Human’s behavioral apathy toward sustainability may be due to an inaccurate characterization of sustainability and/or a lack of understanding of cultural diversity and behavior. Therefore, an understanding of the human behavior will contribute greatly to (i) decipher human actions that negatively impact global ecosystems, (ii) slowdown or stop human ecologically destructive trajectory, and (iii) promote sustainable alternatives. The problem is that environmental issues are not generally included in psychology programs, and psychology is not often represented in environmental programs. In the United Nation’s (UN) Sustainable Development goals 2030 (UN SDG 2030), psychological indices have been conspicuously absent (except for mental health in general terms) even though environmental degradation, social or economic inequity, all are implicated by human behavior. The UN SDG 2030 is based on the unproven concept that sustainability is an intersection of social, economic and environmental factors, the key pillars of sustainability. Since economic activity and society are subsets of human behavior, psychology should be considered central to unsustainability and/or sustainability. Therefore, we hypothesize that behavioral psychology has a critical role to play in creating a sustainable society. The aim of the proposed GCC is to discuss (un)sustainability using this new paradigm that will allow new approaches to achieve transition from unsustainability to sustainability worldwide. The specific aims of the proposed GCC are following: (i) Describe interaction between sustainability and behavioral psychology as the 4th pillar of sustainability. (ii) Explain the behavioral correlates of cultural differences in terms of transition to sustainability. (iii) Explain the consumption (related to unsustainability) and conservation (related to sustainability) behavior. (iv) Determine the place of Psychology in the UN’s Sustainable Development Goals (SDGs) that are mostly based on Sociology, Economy and Environment. (v) Describe humanity’s transition from unsustainable to sustainable development. \n\nThis is a Grand Challenge Curriculum Course. GCC courses are open to all students and fulfill an honors experience for University Honors Program students.",
    "prereq": []
  },
  {
    "uid": "820091",
    "code": "GCC5042",
    "subject": "GCC",
    "number": "5042",
    "honors": false,
    "writingIntensive": false,
    "name": "Higher Ed & Mass Incarceration",
    "fullname": "Just Education: The Role of Higher Education in Disrupting Mass Incarceration",
    "info": "The United States has the highest incarceration rate in the world. We have just 5% of the world’s population, but 25% of its prisoners. Since 1970, the number of incarcerated persons in this country has increased by 700%. Of the 2.3 million people currently in prison or jail, however, just 6 percent have access to higher education. Indeed, contemporary higher education policy and infrastructure disregards incarcerated individuals as potential postsecondary students.  Even as colleges and universities across the country champion diversity-driven and inclusivity-oriented mission statements, and look to create viable postsecondary pathways for systemically underserved students, only a handful include incarcerated and justice-impacted individuals in these efforts.  The University of Minnesota is not currently among them. \n\nThis course will explore the intersection of higher education and mass incarceration in the United States with a focus on the role of higher education in disrupting the collateral consequences of incarceration and justice involvement. In particular, we will examine the potential for the University of Minnesota to play a pivotal role in disrupting what we call the “ripple effect” of incarceration and justice involvement on individuals and communities in Minnesota. Students will have an opportunity to tour local correctional facilities and both hear from and present to experts in the field, including formerly incarcerated people. In addition, students’ ideas will directly inform a “college in prisons” program that is being developed by Professors Moriearty and Shlafer, in collaboration with other University scholars and administrators, and the Minnesota Department of Corrections. In this way, students’ work in this class and their projects will directly and meaningfully inform the real world and the development of the college in prisons program in “real time.” \n\nAs a teaching team with expertise in law, juvenile justice, criminal justice, child welfare, psychology, and public health, Professors Moriearty and Shlafer will highlight examples of successful interdisciplinary collaborations from their own research and practice experience. In addition, students will hear from guest lecturers from multiple disciplines and affiliations (including an Assistant Commissioner and educational expert at the Minnesota Department of Corrections and law, public heath, arts, information technology and sociology instructors from the University) and panels of stakeholders, policy-makers and formerly incarcerated/justice impacted individuals.\n\nThis is a Grand Challenge Curriculum course. ",
    "prereq": []
  },
  {
    "uid": "820188",
    "code": "GCC5043",
    "subject": "GCC",
    "number": "5043",
    "honors": false,
    "writingIntensive": false,
    "name": "Regenerative Game Studio",
    "fullname": "Regenerative Game Studio: Playing For the Future",
    "info": "Meeting the interrelated UN Sustainable development goals facing humanity will require imagination and emotional labor of unprecedented scale. We must collectively learn to overhaul our extractive systems with regenerative approaches in which humans are in a mutually beneficial relationship with the earth’s systems. The task of working across SDGs is a grand challenge in itself.  \n\nGames are an effective way to engage people in understanding complex problems and collaborating toward solutions. Designing games challenges students to examine systems, identify leverage points, confront trade-offs, and be creative. In doing so, it prepares them to become system teachers, leveraging organizations and networks for change. We invite students from a range of backgrounds to apply their disciplinary expertise and interests in new ways. No prior sustainability knowledge or game design experience is needed. \n\nThis is a Grand Challenge Curriculum course.",
    "prereq": []
  },
  {
    "uid": "826544",
    "code": "GCC5044",
    "subject": "GCC",
    "number": "5044",
    "honors": false,
    "writingIntensive": false,
    "name": "A Circularity Revolution",
    "fullname": "A Circularity Revolution: Working to Close the Loop on Global Issues",
    "info": "A Circularity Revolution: Working to Close the Loop on Global Issues is designed to provide students the fundamental knowledge and perspectives to develop and critique sustainable solutions for water, energy, and materials use, re-use, and upcycling from technological, policy, and cultural viewpoints. The class will focus on how each student's personal and disciplinary identities intersect with society’s needs and on creating a common vocabulary, grounding students in natural elemental cycles, differing perspectives on circularity and resource use, and the importance of the co-creation of solutions. Key foci are introducing experimental analytical strategies, and basic tools and mechanisms to achieve and interrogate circularity, such as principles of green engineering, lifecycle assessment, economic and policy tools, and after-progress narratives. Case studies, social practice art interventions, and a group project will be used to demonstrate how science and technology, policy, and expansive community/stakeholder knowledge all are important aspects of developing and re-conceptualizing sustainable solutions to problems in water, material, and energy use. The course compliments a new National Science Foundation-sponsored Research Trainee Program with a circularity theme.",
    "prereq": []
  },
  {
    "uid": "817505",
    "code": "GCC5501",
    "subject": "GCC",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "From Knowledge to Impact",
    "fullname": "Knowledge to Impact: Creating Action with Your Grand Challenge Project Idea",
    "info": "This course provides an intensive, hands-on experience designing and developing a sustainable intervention to an aspect of a Grand Challenge. In other words, converting knowledge to impact. The target audience is students and student teams who have identified and/or worked on a specific problem in a previous GCC course and wish to dig deeper in developing a project plan. Students should enter the class with a problem statement identifying the challenge they aim to address, a target location or community, and a proposed solution or intervention that they wish to develop. Student solutions should address a problem that is about a broadly defined Grand Challenge; examples of applicable areas include water, immigration and refugees, energy, housing, educational opportunity gap, public health, food and sustainable agriculture. Ideas outside this range are also acceptable. By the end of class, students will create a plausible design and implementation plan for a solution that addresses their self-created Grand Challenge problem statement. This solution or intervention could take many forms, depending on student interest and problem statement. Business or nonprofit plans, policy and advocacy plans, media and awareness campaigns and activism plans are all possible. Determining the correct path(s) is part of the learning objectives for the course. Students will leave the course with a completed preliminary pitch deck for their plan in order to make the case for initial, or seed stage, support. Throughout this document (and course), the terms solution and intervention will be used somewhat interchangeably. This reflects the fact that different disciplines use different words to describe similar aspects of the overall process covered in this class. Understanding some of those differences is part of the learning objectives for the class.This is a Grand Challenge Curriculum course. GCC courses are open to second year undergraduate students and above and graduate students and fulfill an honors experience for University Honors Program students.",
    "prereq": []
  }
]