[
  {
    "uid": "806602",
    "code": "GCD2002W",
    "subject": "GCD",
    "number": "2002",
    "honors": false,
    "writingIntensive": true,
    "name": "Social Challenges in Genetics",
    "fullname": "Ethical and Social Challenges in Genetics",
    "info": "For nonscientists. Advances in genetics and their application to society. Ethical and social issues of advancements in genomics and genetics in our everyday lives.prereq: BIOL 1009 or equiv",
    "prereq": {
      "code": "BIOL 1009",
      "subject": "BIOL",
      "id": "1009"
    }
  },
  {
    "uid": "818863",
    "code": "GCD2171",
    "subject": "GCD",
    "number": "2171",
    "honors": false,
    "writingIntensive": false,
    "name": "Stem Cells in Biomedicine",
    "fullname": "Stem Cells in Biomedicine and Society",
    "info": "A course that focuses on the general properties of stem cells, their potential uses in biomedicine, and the potential impact of their use on society. The course is suitable for students who have successfully completed at least one general biology course that included coverage of basic genetics and cell biology. Stem cells are one of the rapidly growing topics in biology. Research into stem cells ranges from basic biology to regeneration to clinical applications to ethics. In this course, you will learn the general features of embryonic, artificial, or adult-tissue stem cells: how they contribute to tissue regeneration, how scientists create and manipulate stem cells, what scientists do with them, what the public considers stem cell research and why. Then, you will learn about bone marrow transplantation, an established stem cell-based therapy, and various diseases and potential applications of stem cells to treat/cure the diseases. By the end of this course, you will have deeper insights into stem cells. Recommended prerequisites: BIOL1009 (General Biology), BIOL1951 (Foundations of Biology Lecture I for Biological Sciences Majors) or an equivalent General Biology course that includes basic coverage of genetics and cell biology This course can NOT be used as an elective for some CBS majors, such as the GCD major. Check the Program Requirements for your major to determine if it can be used as an elective.",
    "prereq": {
      "and": [
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "BIOL 1951",
          "subject": "BIOL",
          "id": "1951"
        }
      ]
    }
  },
  {
    "uid": "006271",
    "code": "GCD3022",
    "subject": "GCD",
    "number": "3022",
    "honors": false,
    "writingIntensive": false,
    "name": "Genetics",
    "fullname": "Genetics",
    "info": "Mechanisms of heredity, implications for biological populations. Applications to practical problems.*Credit will not be granted if credit has been received for BIOL4003",
    "prereq": []
  },
  {
    "uid": "806984",
    "code": "GCD3033",
    "subject": "GCD",
    "number": "3033",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Cell Biology",
    "fullname": "Principles of Cell Biology",
    "info": "Components and activities common to eukaryotic cells. Chromosomes, membranes, organelles, and the cytoskeleton and processes including cellular communication, replication, motility, transport, and gene expression. Relevance to human health and medicine. Appropriate for non-CBS majors.prereq: BIOL 1009 or BIOL 1951*Credit will not be granted if credit has been received for BIOL4004 or GCD4005W.",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "BIOL 1951",
          "subject": "BIOL",
          "id": "1951"
        },
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        },
        {
          "code": "GCD 4005",
          "subject": "GCD",
          "id": "4005"
        }
      ]
    }
  },
  {
    "uid": "825120",
    "code": "GCD3035",
    "subject": "GCD",
    "number": "3035",
    "honors": false,
    "writingIntensive": false,
    "name": "Culture, Identity & Prec. Med.",
    "fullname": "Culture, Identity & Precision Medicine",
    "info": "Working effectively across cultural differences is essential to healthcare. As we reduce healthcare disparities and improve access to treatment, cultural competence will only become more important. This course will explore issues of culture and identity (broadly defined) relevant to the practice of precision medicine (the practice of using genomic information to predict risk, inform diagnosis, and plan treatment for medical issues). Examples of the intersections of culture/identity and precision medicine include incorporating religious beliefs and traditions into treatment or prevention recommendations, how to document gender inclusively and accurately in medical records, underrepresentation of minority groups in research databases, and identifying systemic barriers to access. Students will cultivate a better understanding of their own intersectional identity, build language to effectively address cultural differences in healthcare interactions, and critically assess the research and practice of genomic healthcare. This course is open to all students interested in culture and identity in healthcare, as the lessons will translate to all allied health fields.",
    "prereq": []
  },
  {
    "uid": "804217",
    "code": "GCD3485",
    "subject": "GCD",
    "number": "3485",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioinformatic Analysis",
    "fullname": "Bioinformatic Analysis: Introduction to the Computational Characterization of Genes and Proteins",
    "info": "Bioinformatic analysis is the exploration of molecular sequence, structure, and function using online tools and databases. In this class, we'll learn to use some of the most powerful tools available for biologists to investigate the nature of genes and proteins. We will each explore a gene and the protein it encodes that no one before us has studied. We will learn to analyze and interpret the diverse forms of bioinformatic data we obtain, and we will consider how the data we find allows us to generate and evaluate original hypotheses that can be tested in the laboratory. This is a hands-on course. While the class has no exams, it does require the completion of four problem sets and a summative final project over the course of the semester. It also involves doing some peer review of classmates’ work. prereq: introductory course in genetics and cell biology such as Foundations",
    "prereq": []
  },
  {
    "uid": "818830",
    "code": "GCD3486",
    "subject": "GCD",
    "number": "3486",
    "honors": false,
    "writingIntensive": false,
    "name": "Personal Genome Analysis",
    "fullname": "Personal Genome Analysis",
    "info": "In this course, students will analyze their personal genome data. They will gain experience using computer applications and online databases of human genetic information. They will learn about their ancestry, their regional origins, and their risks of genetically linked disease. They will learn how to put human genome results into context and how to explain human genomics in non-technical language. prereq: Biol 2003/2003H",
    "prereq": {
      "or": [
        {
          "code": "BIOL 2003",
          "subject": "BIOL",
          "id": "2003"
        },
        {
          "code": "GCD 2003",
          "subject": "GCD",
          "id": "2003"
        }
      ]
    }
  },
  {
    "uid": "808772",
    "code": "GCD4005W",
    "subject": "GCD",
    "number": "4005",
    "honors": false,
    "writingIntensive": true,
    "name": "Cell Biology-Writing Intensive",
    "fullname": "Cell Biology-Writing Intensive",
    "info": "Processes fundamental to cells. Emphasizes eukaryotic cells. Assembly/function of membranes/organelles. Cell division, cell form/movement, intercellular communication, transport, secretion pathways. Cancer cells, differentiated cells. prereq: GCD major, Biol2003/2003H or Biol4003 or grad",
    "prereq": {
      "and": [
        {
          "code": "BIOL 2003",
          "subject": "BIOL",
          "id": "2003"
        },
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        }
      ]
    }
  },
  {
    "uid": "007632",
    "code": "GCD4015",
    "subject": "GCD",
    "number": "4015",
    "honors": false,
    "writingIntensive": false,
    "name": "Genetics Lab",
    "fullname": "Genetics Laboratory",
    "info": "Introduction to experimental techniques used in genetic analyses. Although experiments may vary from semester to semester, genetic experiments with model systems ranging from viruses to plants and animals are performed.",
    "prereq": []
  },
  {
    "uid": "007637",
    "code": "GCD4025",
    "subject": "GCD",
    "number": "4025",
    "honors": false,
    "writingIntensive": false,
    "name": "Cell Biol, Dev & Regen Lab",
    "fullname": "Cell Biology, Development & Regeneration Laboratory",
    "info": "This course is designed for juniors and seniors to learn experimental approaches and techniques to study cellular processes and stem cell biology during animal development and tissue regeneration. Students will be exposed to the advantages of different model systems that include cultured cells, chick, C. elegans and zebrafish. Students will learn to manipulate the cytoskeleton, perform cell differentiation, RNAi and regeneration assays, and to image both fixed tissue and live animal samples with conventional light microscopes as well as cutting edge technology, including super-resolution and multi-photon microscopes. prereq: Biol 2003/2003H or instructor permission; Recommended prerequisite: Biol 4004 or GCD 4005W (priority enrollment to GCD majors)",
    "prereq": {
      "or": [
        {
          "code": "BIOL 2003",
          "subject": "BIOL",
          "id": "2003"
        },
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        },
        {
          "code": "GCD 4005",
          "subject": "GCD",
          "id": "4005"
        }
      ]
    }
  },
  {
    "uid": "007633",
    "code": "GCD4034",
    "subject": "GCD",
    "number": "4034",
    "honors": false,
    "writingIntensive": false,
    "name": "Molecular Genetics & Genomics",
    "fullname": "Molecular Genetics and Genomics",
    "info": "Molecular genetics and genomics of eukaryotes. Course emphasizes mechanisms of gene regulation and how these are studied. Current strategies used to study the activity and function of genes and genomes, including the role of chromatin, will be covered. Techniques will include gene knockouts/knockdown, genome engineering, genome-wide analysis of RNA and protein expression and function, as well as genome-wide protein binding and chromatin interaction mapping. Technologies covered will include next-generations and third-generation sequencing and CRISPR-based strategies for gene modification and precision gene regulation. Students will analyze and present recent primary papers in molecular genetic and genomics. prereq: BIOL 4003",
    "prereq": {
      "code": "BIOL 4003",
      "subject": "BIOL",
      "id": "4003"
    }
  },
  {
    "uid": "007629",
    "code": "GCD4111",
    "subject": "GCD",
    "number": "4111",
    "honors": false,
    "writingIntensive": false,
    "name": "Histology",
    "fullname": "Histology: Cell and Tissue Organization",
    "info": "Structure/function of vertebrate tissues/organs. Electron microscopy, light microscopy, physiology, cell biology of higher animals. Light microscopy of mammalian tissues. prereq: BIOL4004 or GCD3033 or GCD4005W or graduate student",
    "prereq": {
      "or": [
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        },
        {
          "code": "GCD 3033",
          "subject": "GCD",
          "id": "3033"
        },
        {
          "code": "GCD 4005",
          "subject": "GCD",
          "id": "4005"
        }
      ]
    }
  },
  {
    "uid": "007636",
    "code": "GCD4134",
    "subject": "GCD",
    "number": "4134",
    "honors": false,
    "writingIntensive": false,
    "name": "Endocrinology",
    "fullname": "Endocrinology",
    "info": "Survey of structure and function of invertebrate and vertebrate endocrine systems.prereq: BIOL 3211 or BIOC 3021 or BIOC 3022 or BIOC 4331 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "BIOL 3211",
          "subject": "BIOL",
          "id": "3211"
        },
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOC 3022",
          "subject": "BIOC",
          "id": "3022"
        },
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        }
      ]
    }
  },
  {
    "uid": "013299",
    "code": "GCD4143",
    "subject": "GCD",
    "number": "4143",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Genetics and Genomics",
    "fullname": "Human Genetics and Genomics",
    "info": "Human Genetics – the science of how our genomes function, vary, and shape our unique, individual characteristics – is a rapidly expanding field with major implications for medical and fundamental research, clinical practice, and many other areas. In this course, students will learn about the principles of human genetics & genomics at the levels of molecules, cells, individuals, and populations. Topics include patterns of inheritance; the molecular causes and biochemical basis of genetic disorders; disease gene identification; the origin and distribution of human genetic variation; genetic influences on common, complex diseases; epigenetics and regulation of gene expression; genomic technologies for understanding human genomes; cancer genetics; behavioral genetics; human ancestry and evolution; applications such as genetic screening, genetic counseling, and gene therapy; and ethical questions raised by emerging abilities to edit the human genome, modify the human germline, and many more. prereq: Biol 4003 or instructor consent",
    "prereq": {
      "code": "BIOL 4003",
      "subject": "BIOL",
      "id": "4003"
    }
  },
  {
    "uid": "825400",
    "code": "GCD4144W",
    "subject": "GCD",
    "number": "4144",
    "honors": false,
    "writingIntensive": true,
    "name": "Human Genetics - WI",
    "fullname": "Human Genetics - Writing Intensive",
    "info": "Human Genetics is the science of how our genomes function, vary, and shape our unique, individual characteristics and is a rapidly expanding field with major implications for medical and fundamental research, clinical practice, and many other areas. In this course, students will learn about the principles of human genetics & genomics at the levels of molecules, cells, individuals, and populations. Topics include patterns of inheritance; the molecular causes and biochemical basis of genetic disorders; disease gene identification; the origin and distribution of human genetic variation; genetic influences on common, complex diseases; epigenetics and regulation of gene expression; genomic technologies for understanding human genomes; cancer genetics; behavioral genetics; human ancestry and evolution; applications such as genetic screening, genetic counseling, and gene therapy; and ethical questions raised by emerging abilities to edit the human genome, modify the human germline, and many more. This writing intensive course is available only to Health and Genomics minors. prereq: BIOL 4003 or instr consent; Health and Genomics minor",
    "prereq": {
      "code": "BIOL 4003",
      "subject": "BIOL",
      "id": "4003"
    }
  },
  {
    "uid": "788935",
    "code": "GCD4151",
    "subject": "GCD",
    "number": "4151",
    "honors": false,
    "writingIntensive": false,
    "name": "Molecular Biology of Cancer",
    "fullname": "Molecular Biology of Cancer",
    "info": "Regulatory pathways involved in directing normal development of complex eukaryotic organisms, how disruptions of these pathways can lead to abnormal cell growth/cancer. Causes, detection, treatment, prevention of cancer.prereq: Biol 4003",
    "prereq": {
      "code": "BIOL 4003",
      "subject": "BIOL",
      "id": "4003"
    }
  },
  {
    "uid": "007638",
    "code": "GCD4161",
    "subject": "GCD",
    "number": "4161",
    "honors": false,
    "writingIntensive": false,
    "name": "Developmental Biology",
    "fullname": "Developmental Biology",
    "info": "Developmental biology is the study of the process by which organisms grow and develop from embryo to adult. This field encompasses the biology of morphogenesis, differentiation, regeneration, metamorphosis, and the growth and differentiation of stem cells. Topics focus primarily on animal development to include fertilization, cell specification, body patterning, stem cells, neurogenesis, organogenesis, limb formation, regeneration, sex determination, and developmental timing, as well as environmental impacts on development. Students will learn about genetic models such as fruit flies, nematodes, fish, mice, and plants. Coverage will be extended to human development and disease as appropriate. prereq: BIOL 4003; also recommended prerequisite: BIOL 4004 or GCD 4005W",
    "prereq": {
      "or": [
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        },
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        },
        {
          "code": "GCD 4005",
          "subject": "GCD",
          "id": "4005"
        }
      ]
    }
  },
  {
    "uid": "806842",
    "code": "GCD4171",
    "subject": "GCD",
    "number": "4171",
    "honors": false,
    "writingIntensive": false,
    "name": "Stem Cells in Biol & Med",
    "fullname": "Stem Cells in Biology and Medicine",
    "info": "Contemporary stem cell biology with emphasis on mechanisms/applications. Embryonic, tissue-specific, and induced pluripotent stem cells and potential uses in human disease. prerequisites: BIOL 4003 Genetics; recommended prerequisite: BIOL 4004 Cell Biology or GCD 4005W This course can be used as an elective for certain CBS majors, such as the GCD major. Check the Program Requirements for your major to determine if it can be used as an elective.",
    "prereq": {
      "or": [
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        },
        {
          "code": "GCD 4005",
          "subject": "GCD",
          "id": "4005"
        }
      ]
    }
  },
  {
    "uid": "825119",
    "code": "GCD4593",
    "subject": "GCD",
    "number": "4593",
    "honors": false,
    "writingIntensive": false,
    "name": "Genomics Dir. Stud. Comm. Exp.",
    "fullname": "Genomics Directed Studies - Community Experience",
    "info": "Directed Studies is an individual-study, community-based experience in which the student is mentored directly by a faculty member. The topic for the course is the application of genomics in human health and healthcare. This course is designed for students to get experience in applied genetics or genomics. The details need to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the minor before the student is allowed to register.  Four credits total of 4593, 4693, or 4694, or a combination thereof, are required for the Health & Genomics minor. prereq: department consent, instructor consent",
    "prereq": []
  },
  {
    "uid": "825108",
    "code": "GCD4693",
    "subject": "GCD",
    "number": "4693",
    "honors": false,
    "writingIntensive": false,
    "name": "Genomics Dir. Stud. Lit Review",
    "fullname": "Genomics Directed Studies - Literature Review",
    "info": "Directed Research is an individual-study, laboratory, or field investigation course. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a Research/Directed Studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. Four credits total of 4593, 4693, or 4694, or a combination thereof, are required for the Health & Genomics minor. prereq: department consent; instructor consent.",
    "prereq": []
  },
  {
    "uid": "825109",
    "code": "GCD4694",
    "subject": "GCD",
    "number": "4694",
    "honors": false,
    "writingIntensive": false,
    "name": "Genomics Directed Research",
    "fullname": "Genomics Directed Research",
    "info": "Directed Research is an individual-study, laboratory, or field investigation course. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a Research/Directed Studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. Four credits total of 4593, 4693, or 4694, or a combination thereof, are required for the Health & Genomics minor. prereq: department consent; instructor consent.",
    "prereq": []
  },
  {
    "uid": "788848",
    "code": "GCD4793W",
    "subject": "GCD",
    "number": "4793",
    "honors": false,
    "writingIntensive": true,
    "name": "Directed Studies: WI",
    "fullname": "Directed Studies: Writing Intensive",
    "info": "Writing Intensive Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. One main feature of this course is that the student will receive writing instruction and the written output of the course will be revised during the semester. The project needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, how writing instruction will take place, a timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. This course is graded S/N and approval of the DUGS is required before a grade of S can be given by the faculty mentor. prereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.",
    "prereq": {
      "and": [
        {
          "code": "GCD 4793",
          "subject": "GCD",
          "id": "4793"
        },
        {
          "code": "GCD 4794",
          "subject": "GCD",
          "id": "4794"
        },
        {
          "code": "GCD 4993W",
          "subject": "GCD",
          "id": "4993W"
        },
        {
          "code": "GCD 4994",
          "subject": "GCD",
          "id": "4994"
        }
      ]
    }
  },
  {
    "uid": "788849",
    "code": "GCD4794W",
    "subject": "GCD",
    "number": "4794",
    "honors": false,
    "writingIntensive": true,
    "name": "Directed Research: WI",
    "fullname": "Directed Research: Writing Intensive",
    "info": "Writing Intensive Directed Research is an individual-study, laboratory or field research experience in which the student is mentored directly by a faculty member. This course is not for students starting out in research. It is intended for students who already have been working in the research group of the mentor and have developed an independent research project. In this course, the student will receive writing instruction through a writing support course (corresponding to 1 credit in addition to the credits of directed research time) that will meet weekly throughout the semester. The written output usually is in the form of a scientific paper describing the results of the student's project. Written output of the course must be revised during the semester and a schedule for writing, assessment and revision needs to be in place at the beginning of the semester. The project needs to be explained in the campus Directed Research contract and the project and participation in the writing support course agreed on by both the student and faculty mentor. The contract must be approved by the Director of Undergraduate Studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, agreement about how writing instruction will take place, confirmation of understanding of the timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course - near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. The DUGS can call for a final revision before a grade is given. This course is graded S/N by the writing support course instructor, and approval of both the DUGS and the research mentor is required before a grade of S can be given by the writing support course instructor.This course is for non-Honors students. Students should register for the number of research credits they intend to pursue plus 1 cr for the writing support component (for example: 2-4 cr of research + 1 cr writing support = 3-5 cr).prereq: department consent, instructor consent, no more than a total of 7 credits of 4793W, 4794W, 4993, 4994 combined can count towards CBS major requirements.prereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.",
    "prereq": {
      "and": [
        {
          "code": "GCD 4793W",
          "subject": "GCD",
          "id": "4793W"
        },
        {
          "code": "GCD 4993",
          "subject": "GCD",
          "id": "4993"
        },
        {
          "code": "GCD 4994",
          "subject": "GCD",
          "id": "4994"
        }
      ]
    }
  },
  {
    "uid": "825225",
    "code": "GCD4950",
    "subject": "GCD",
    "number": "4950",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Genetics",
    "fullname": "Special Topics in Genetics",
    "info": "Special Topics Shell",
    "prereq": []
  },
  {
    "uid": "013034",
    "code": "GCD4993",
    "subject": "GCD",
    "number": "4993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. The topic for the course needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. prereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.",
    "prereq": {
      "and": [
        {
          "code": "GCD 4793",
          "subject": "GCD",
          "id": "4793"
        },
        {
          "code": "GCD 4794",
          "subject": "GCD",
          "id": "4794"
        },
        {
          "code": "GCD 4993W",
          "subject": "GCD",
          "id": "4993W"
        },
        {
          "code": "GCD 4994",
          "subject": "GCD",
          "id": "4994"
        }
      ]
    }
  },
  {
    "uid": "013027",
    "code": "GCD4994",
    "subject": "GCD",
    "number": "4994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed Research is an individual-study, laboratory or field investigation course. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a Research/Directed Studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. prereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.",
    "prereq": {
      "and": [
        {
          "code": "GCD 4793",
          "subject": "GCD",
          "id": "4793"
        },
        {
          "code": "GCD 4794",
          "subject": "GCD",
          "id": "4794"
        },
        {
          "code": "GCD 4993W",
          "subject": "GCD",
          "id": "4993W"
        }
      ]
    }
  },
  {
    "uid": "810651",
    "code": "GCD5005",
    "subject": "GCD",
    "number": "5005",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Programming for Biology",
    "fullname": "Computer Programming for Biology",
    "info": "Computer programming skills with applications in biology. Design/build new computer programs for applications in cell/developmental biology, including modeling of biological processes, advanced data analysis, automated image analysis. prereq: BIOL 4003 or BIOL 4004 or GCD 3033 or CBS grad or BMBB or MCDB&G grad student, general statistics course",
    "prereq": {
      "or": [
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        },
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        },
        {
          "code": "GCD 3033",
          "subject": "GCD",
          "id": "3033"
        }
      ]
    }
  },
  {
    "uid": "007635",
    "code": "GCD5036",
    "subject": "GCD",
    "number": "5036",
    "honors": false,
    "writingIntensive": false,
    "name": "Molecular Cell Biology",
    "fullname": "Molecular Cell Biology",
    "info": "Analysis of dynamic cellular activities at the molecular level in cell biological fields that are experiencing new research advances not yet reflected in textbooks. Significant emphasis is placed on understanding the experimental basis of our current knowledge of cellular processes through analysis of scientific papers. Project and presentation-based assessments of learning outcomes. prereq: Biol 4004 or GCD 4005W or grad",
    "prereq": {
      "or": [
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        },
        {
          "code": "GCD 4005",
          "subject": "GCD",
          "id": "4005"
        }
      ]
    }
  },
  {
    "uid": "825339",
    "code": "GCD5101",
    "subject": "GCD",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Reasoning in Visual Science",
    "fullname": "Critical and Translational Reasoning in Visual Science",
    "info": "This course is appropriate for graduate and senior undergraduate students in several areas of biology, including GCD, NSC, IBP, and BMBB programs. Students will be introduced to the function of the visual system, including the retina and brain, and learn to understand the visual system on a cellular level. Main goals of the course include to practice scientific and translational reasoning and scientific communication. This will be facilitated through a combination of lectures and group discussions of scientific papers, as well as writing of a term paper. In most weeks one lecture and one group discussion will be held. Scientific and translational reasoning and scientific communication are core competencies for life scientists. Scientific reasoning includes the ability to recognize why a scientific question is significant (or not), experimental design and rigor, interpretation of data, and identifying caveats to conclusions. Models of biological processes will be discussed and appropriate predictions will be identified in order to test those models. Translational reasoning is needed to move basic scientific discoveries into practice. To practice translational reasoning, we will investigate how diseases manifest on the cellular level, examine the use of disease models (cell based or animal models) and their limitations, how investigational therapeutic drugs are tested, how their effects on disease are scored, and how clinical trials are used to test the safety and efficacy of new therapeutic drug candidates. Students will interact with MD and PhD faculty and learn about their respective priorities. This course should be informative for students who are interested in the life sciences, and may help to discover personal interests and preferred career paths. The course will be taught by a team of instructors who share an interest in vision science. prereq: Senior major in GCD, Neuroscience, IBP, or BMBB or grad, open to advanced juniors with instructor permission",
    "prereq": []
  },
  {
    "uid": "818503",
    "code": "GCD5111",
    "subject": "GCD",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Quantitative Microscopy",
    "fullname": "Quantitative Fluorescence Microscopy",
    "info": "Fluorescence microscopy is an essential technique to probe the inner workings of cells and tissues. You will learn hands on the inner workings of fluorescent microscopes, how to set up and acquire fluorescent images using microscopes, and how to quantitatively analyze image data using FIJI (ImageJ) software. prereq: Undergraduate students require instructor permission for enrollment. Graduate students are allowed to register for 5111 without instructor permission. Recommended prerequisite: GCD 3033 or BIOL 4004",
    "prereq": {
      "or": [
        {
          "code": "GCD 3033",
          "subject": "GCD",
          "id": "3033"
        },
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        }
      ]
    }
  },
  {
    "uid": "825229",
    "code": "GCD5914",
    "subject": "GCD",
    "number": "5914",
    "honors": false,
    "writingIntensive": false,
    "name": "Genet Couns Issues",
    "fullname": "Ethical and Legal Issues in Genetic Counseling",
    "info": "This course will provide a foundational knowledge of the ethical and legal considerations that are relevant to individuals working at the intersection of genetics and medical science. This will involve pre-class reading and research assignments in addition to relevant videos, podcasts, blog readings, and documentaries on this topic. Students will learn to frame ethical questions using appropriate frameworks, consult research, develop strategies for reaching resolutions, and communicate their process and outcomes. Students will work individually as well as collectively through case discussions in small groups and large group settings. Class time will be split between lecture, discussion, and in-class activities.",
    "prereq": []
  },
  {
    "uid": "012633",
    "code": "GCD6103",
    "subject": "GCD",
    "number": "6103",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Histology",
    "fullname": "Human Histology",
    "info": "Human histology is a lecture and laboratory class covering light and electron microscopic anatomy of tissues and their organization into human organs.  The emphasis is on integrating structure and its relationship to function at levels from molecules to organs. prereq: Enrolled as medical or dental student or instr consent",
    "prereq": []
  },
  {
    "uid": "012634",
    "code": "GCD6104",
    "subject": "GCD",
    "number": "6104",
    "honors": false,
    "writingIntensive": false,
    "name": "Biochem,Mol/Cell Biology",
    "fullname": "Biochemistry, Molecular and Cellular Biology",
    "info": "This course for first-year medical students includes lectures, discussions and clinical sessions to describe molecular and cellular processess fundamental to the study of medicine.",
    "prereq": []
  },
  {
    "uid": "795131",
    "code": "GCD6110",
    "subject": "GCD",
    "number": "6110",
    "honors": false,
    "writingIntensive": false,
    "name": "Science of Medical Practice",
    "fullname": "Science of Medical Practice",
    "info": "Combines Biochemistry/Medical Genetics aimed toward Medical/Genetic Counseling students. Biochemistry content covers genome organization, transcription, metabolism, nutrition, stem cell biology, cell signaling, cancer. Genetics content covers inheritance, genetic/genomic conditions, inborn errors of metabolism, cancer genetics, complex inheritance/genetic susceptibility to disease, birth defects. Meets with INMD 6802.prereq: Medical student or MCDG MS student with genetic counseling specialization or instr consent",
    "prereq": []
  },
  {
    "uid": "815833",
    "code": "GCD8001",
    "subject": "GCD",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Genetic Counseling Intern I",
    "fullname": "Genetic Counseling Clinical Internship I",
    "info": "This is a 10-week clinical internship in genetic counseling practice. Students in this course will be assigned to an appropriate clinic affiliated with the graduate program of study in genetic counseling. Students must be enrolled in the program in order to take this course. Students will be expected to attend clinic and under the supervision of a board certified genetic counselor or medical geneticist, students are expected to log a minimum case load as defined by the Accreditation Council for Genetic Counseling (ACGC), the American Board of Genetic Counseling and the graduate program in genetic counseling at the University of Minnesota. The actual days and hours of the assigned clinic will be set by the clinical supervisor on site.",
    "prereq": []
  },
  {
    "uid": "815834",
    "code": "GCD8002",
    "subject": "GCD",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Genetic Counseling Intern II",
    "fullname": "Genetic Counseling Clinical Internship II",
    "info": "This is a 15-week clinical internship course in genetic counseling practice. Students in this course will be assigned two appropriate clinics affiliated with the graduate program of study in genetic counseling. Students must be enrolled in the program in order to take this course.  Students will be expected to attend clinic and will provide genetic counseling services under the supervision of a board certified genetic counselor or medical geneticist. Students are expected to log a minimum caseload that meets the criteria for clinical training by the Accreditation Council for Genetic Counseling (ACGC), the American Board of Genetic Counseling and the graduate program in genetic counseling at the University of Minnesota.  The actual days and hours of the assigned clinics will be set by the clinical supervisor on site.",
    "prereq": []
  },
  {
    "uid": "815835",
    "code": "GCD8003",
    "subject": "GCD",
    "number": "8003",
    "honors": false,
    "writingIntensive": false,
    "name": "Genetic Counseling Intern III",
    "fullname": "Genetic Counseling Clinical Internship III",
    "info": "This is a 15-week clinical internship course in genetic counseling practice.  Students in this course will be assigned two appropriate clinics affiliated with the graduate program of study in genetic counseling. Students must be enrolled in the program in order to take this course. Students will be expected to attend clinic and will provide genetic counseling services under the supervision of a board certified genetic counselor or medical geneticist. Students are expected to log a minimum caseload that meets the criteria for clinical training by the Accreditation Council for Genetic Counseling (ACGC), the American Board of Genetic Counseling and the graduate program in genetic counseling at the University of Minnesota. The actual days and hours of the assigned clinics will be set by the clinical supervisor on site.",
    "prereq": []
  },
  {
    "uid": "787745",
    "code": "GCD8008",
    "subject": "GCD",
    "number": "8008",
    "honors": false,
    "writingIntensive": false,
    "name": "Mammal Gene Trans & Genome Eng",
    "fullname": "Mammalian Gene Transfer and Genome Engineering",
    "info": "Current gene transfer and genome engineering technology. Applications of genetic modifications in animals, particularly transgenic animals and human gene therapy.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "807648",
    "code": "GCD8014",
    "subject": "GCD",
    "number": "8014",
    "honors": false,
    "writingIntensive": false,
    "name": "Small RNA Biology",
    "fullname": "Small RNA Biology",
    "info": "Small RNAs as major regulators of gene and protein expression. MicroRNAs and their potential use in diagnosis and prognosis of various disease conditions including cancers. Biology of small RNAs and their role in health and disease.prereq: MICA 8004 or BIOC 8002 or equiv or instr consent",
    "prereq": {
      "or": [
        {
          "code": "MICA 8004",
          "subject": "MICA",
          "id": "8004"
        },
        {
          "code": "BIOC 8002",
          "subject": "BIOC",
          "id": "8002"
        }
      ]
    }
  },
  {
    "uid": "010820",
    "code": "GCD8073",
    "subject": "GCD",
    "number": "8073",
    "honors": false,
    "writingIntensive": false,
    "name": "Gene & Genomics Human Health",
    "fullname": "Genetics & Genomics in Human Health",
    "info": "Application of molecular, biochemical, chromosomal, and population genetics to human variation and disease. Abnormal chromosome number and structure; abnormal enzyme, structural protein, receptor, and transport; analysis of inheritance patterns; behavioral genetics; genetic basis of common disease. Current research articles in human genetics.prereq: 8131 or BIOL 4003 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "GCD 8131",
          "subject": "GCD",
          "id": "8131"
        },
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        }
      ]
    }
  },
  {
    "uid": "790896",
    "code": "GCD8103",
    "subject": "GCD",
    "number": "8103",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Histology",
    "fullname": "Human Histology",
    "info": "Light/electron microscopic anatomy of tissues and their organization into human organs. Emphasizes integrating structure, its relationship to function at levels from molecules to organs. Lecture, lab.prereq: Undergraduate biology, chemistry, math, and physics course; instr consent",
    "prereq": []
  },
  {
    "uid": "818504",
    "code": "GCD8111",
    "subject": "GCD",
    "number": "8111",
    "honors": false,
    "writingIntensive": false,
    "name": "Quantitative Microscopy",
    "fullname": "Quantitative Fluorescence Microscopy",
    "info": "Fluorescence microscopy is an essential technique to probe the inner workings of cells and tissues. You will learn hands on the inner workings of fluorescent microscopes, how to set up and acquire fluorescent images using microscopes, and how to quantitatively analyze image data using FIJI (ImageJ) software.",
    "prereq": []
  },
  {
    "uid": "010644",
    "code": "GCD8121",
    "subject": "GCD",
    "number": "8121",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Mol Genetics",
    "fullname": "Advanced Molecular Genetics",
    "info": "Action of gene in molecular, cellular, and organismal development. Mechanisms of information transfer and regulation of these processes in various biological systems; examination of original research.",
    "prereq": []
  },
  {
    "uid": "010643",
    "code": "GCD8131",
    "subject": "GCD",
    "number": "8131",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Molecular Genetic Genomics",
    "fullname": "Advanced Molecular Genetics and Genomics",
    "info": "Literature-based course in modern molecular genetic and genomic analysis. Students will gain a deep understanding of the fundamental molecular mechanisms controlling inheritance in biological systems. Students will gain a facility in thinking critically and creatively about how genes work at cellular, organismal, and transgenerational levels. Course instruction emphasizes active-learning approaches, student presentations, and group projects.prereq: [3022 or BIOL 4003], [BIOC 3021 or BIOC 4331] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "GCD 3022",
              "subject": "GCD",
              "id": "3022"
            },
            {
              "code": "BIOL 4003",
              "subject": "BIOL",
              "id": "4003"
            }
          ]
        },
        {
          "or": [
            {
              "code": "BIOC 3021",
              "subject": "BIOC",
              "id": "3021"
            },
            {
              "code": "BIOC 4331",
              "subject": "BIOC",
              "id": "4331"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "014020",
    "code": "GCD8136",
    "subject": "GCD",
    "number": "8136",
    "honors": false,
    "writingIntensive": false,
    "name": "Biol. Elect. Micro.",
    "fullname": "Techniques of Biological Electron Microscopy",
    "info": "Theory and methodology of transmission and scanning electron microscopy.",
    "prereq": []
  },
  {
    "uid": "825212",
    "code": "GCD8141",
    "subject": "GCD",
    "number": "8141",
    "honors": false,
    "writingIntensive": false,
    "name": "Computational Genomics",
    "fullname": "Computational Genomics",
    "info": "Genomic data is increasingly prevalent in biology today, and the ability to analyze and interpret genomic data is an important skill for a career in biology. This class will provide you with an overview of the emerging genomics field by review and discussion of seminal papers, combined with hands-on analysis of genomics data. At the end of this course, you will gain a broad view of cutting edge research in the field of genomics, gain experience in analysis and interpretation of genomic data, and learn basic computer programming, data visualization, and bioinformatics skills using R and UNIX.",
    "prereq": []
  },
  {
    "uid": "010645",
    "code": "GCD8151",
    "subject": "GCD",
    "number": "8151",
    "honors": false,
    "writingIntensive": false,
    "name": "Cellular Biochem and Cell Biol",
    "fullname": "Cellular Biochemistry and Cell Biology",
    "info": "This course introduces graduate students to fundamental concepts of Biochemical Unity (Part 1) and Cell Theory (Part 2). For Part 1, we will discuss matter of life, equilibrium, entropy & law of mass action, two state systems, random walks & diffusion, rate equations of chemical reactions, and explore how they relate to regulation of biological networks (gene regulation and signal transduction). For Part 2 we will focus on properties of biological membranes, membrane trafficking, protein import & degradation, nuclear structures and their function, as well as molecular motors, cytoskeletal dynamics, and mitosis.The course assumes students have had previous undergraduate courses in cell biology, biochemistry and genetics.prereq: [[[4034 or 8121 or BioC 8002], Biol 4004] or BMBB or MCDBG grad student] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "GCD 4034",
              "subject": "GCD",
              "id": "4034"
            },
            {
              "code": "GCD 8121",
              "subject": "GCD",
              "id": "8121"
            },
            {
              "code": "BIOC 8002",
              "subject": "BIOC",
              "id": "8002"
            }
          ]
        },
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        }
      ]
    }
  },
  {
    "uid": "010646",
    "code": "GCD8161",
    "subject": "GCD",
    "number": "8161",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Cell Biol and Development",
    "fullname": "Advanced Cell Biology and Development",
    "info": "The advanced cell and developmental biology of embryos, taught through in-depth, comparative analysis of historical and current primary research articles that illustrate developmental mechanisms and experimental approaches in key invertebrate and vertebrate model organisms. prereq:[BMBB or MCDBG grad student] or [GCD 4161, [GCD 8131 or Biol 4003], Biol 4004, and GCD 4034] or instr consent",
    "prereq": {
      "and": [
        {
          "and": [
            {
              "code": "GCD 4161",
              "subject": "GCD",
              "id": "4161"
            },
            {
              "code": "GCD 8131",
              "subject": "GCD",
              "id": "8131"
            },
            {
              "code": "BIOL 4003",
              "subject": "BIOL",
              "id": "4003"
            }
          ]
        },
        {
          "code": "BIOL 4004",
          "subject": "BIOL",
          "id": "4004"
        },
        {
          "code": "GCD 4034",
          "subject": "GCD",
          "id": "4034"
        }
      ]
    }
  },
  {
    "uid": "010818",
    "code": "GCD8171",
    "subject": "GCD",
    "number": "8171",
    "honors": false,
    "writingIntensive": false,
    "name": "Literature Analysis",
    "fullname": "Literature Analysis",
    "info": "Critical reading and evaluation of current literature. May include evaluation of both excellent and flawed papers. Intensive and in-depth discussions of selected papers in molecular biology, genetics, cell biology, and developmental biology.prereq: Grad MCDB&G or BMBB major",
    "prereq": []
  },
  {
    "uid": "800980",
    "code": "GCD8181",
    "subject": "GCD",
    "number": "8181",
    "honors": false,
    "writingIntensive": false,
    "name": "Stem Cell Biology",
    "fullname": "Stem Cell Biology",
    "info": "Students read/evaluate primary literature on stem cell research and applications. Critical analysis, written summaries/critiques, oral presentations.",
    "prereq": []
  },
  {
    "uid": "010819",
    "code": "GCD8212",
    "subject": "GCD",
    "number": "8212",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Cell Develop",
    "fullname": "Selected Topics in Cell and Developmental Biology",
    "info": "Reading and discussion of papers from current literature. Topics selected from research areas of cell biology and developmental biology and experimental approaches taken in these fields.  Topics vary annually.",
    "prereq": []
  },
  {
    "uid": "016480",
    "code": "GCD8213",
    "subject": "GCD",
    "number": "8213",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Molecular Biology",
    "fullname": "Selected Topics in Molecular Biology",
    "info": "Sample topics: DNA replication, recombination and gene conversion, regulation of gene expression in procaryotes, regulation of gene expression in eucaryotes, chromatin structure and transcription, organellar gene expression. Lectures, readings, discussions.",
    "prereq": []
  },
  {
    "uid": "819560",
    "code": "GCD8401",
    "subject": "GCD",
    "number": "8401",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics Molec Cell Biology",
    "fullname": "Ethics, Public Policy & Careers in Molecular Cell Biology",
    "info": "Ethics of scientific investigation from viewpoint of western scientific enterprise. Relationship between science, culture, and public policies. Careers in molecular/cellular biology. Nontraditional career tracks. Invited speakers, case studies, small-group discussions, lectures.",
    "prereq": []
  },
  {
    "uid": "013300",
    "code": "GCD8900",
    "subject": "GCD",
    "number": "8900",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar",
    "fullname": "Seminar",
    "info": "Current scientific research.prereq: Grad MCDG major or instr consent",
    "prereq": []
  },
  {
    "uid": "013318",
    "code": "GCD8910",
    "subject": "GCD",
    "number": "8910",
    "honors": false,
    "writingIntensive": false,
    "name": "Journal Club",
    "fullname": "Journal Club",
    "info": "Critical evaluation of selected current literature.",
    "prereq": []
  },
  {
    "uid": "812287",
    "code": "GCD8911",
    "subject": "GCD",
    "number": "8911",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Genetic Counse",
    "fullname": "Introduction to Genetic Counseling Skills and Practice",
    "info": "Course focuses on basic concepts used in clinical genetic counseling practice. Students learn the necessary skills to prepare for and implement a genetic counseling session.  The class will cover a variety of areas in the genetic counseling sub-specialty of perinatal genetics as well as newborn screening. Students will practice communicating genetics and medical information in a patient-friendly manner. At the end of the semester, students will be equipped with tools to assess medical and family histories, present genetic cases, and role play genetic counseling sessions.prereq: This class is intended for Molecular, Cellular, Biology and Genetics M.S. students with genetic counseling specialization.",
    "prereq": []
  },
  {
    "uid": "010647",
    "code": "GCD8912",
    "subject": "GCD",
    "number": "8912",
    "honors": false,
    "writingIntensive": false,
    "name": "Genet Couns in Prac",
    "fullname": "Genetic Counseling in Practice",
    "info": "Practical genetic counseling, communicating genetics and medical information to the family, helping families with decision making.prereq: MCDG MS student with genetic counseling specialization or instr consent",
    "prereq": []
  },
  {
    "uid": "010648",
    "code": "GCD8913",
    "subject": "GCD",
    "number": "8913",
    "honors": false,
    "writingIntensive": false,
    "name": "Psychosocial Issues I",
    "fullname": "Psychosocial Issues in Genetic Counseling I",
    "info": "This course is designed to introduce students to the psychosocial issues that commonly arise in genetic counseling, as well as develop their individual counseling skills to assist them in effectively counseling patients.prereq: MCDG MS student with genetic counseling specialization or instr consent",
    "prereq": []
  },
  {
    "uid": "010649",
    "code": "GCD8914",
    "subject": "GCD",
    "number": "8914",
    "honors": false,
    "writingIntensive": false,
    "name": "Genet Couns Issues",
    "fullname": "Ethical and Legal Issues in Genetic Counseling",
    "info": "Professional ethics; ethical and legal concerns with new genetic technologies.prereq: MCDG MS student with genetic counseling specialization or instr consent",
    "prereq": []
  },
  {
    "uid": "817395",
    "code": "GCD8915",
    "subject": "GCD",
    "number": "8915",
    "honors": false,
    "writingIntensive": false,
    "name": "Psychosocial Issues II",
    "fullname": "Psychosocial Issues in Genetic Counseling II",
    "info": "This course is designed to introduce Genetic Counseling Masters students to the psychosocial issues that commonly arise in genetic counseling, as well as develop their individual counseling skills to assist them in effectively counseling patients.prereq: MCDG MS student with genetic counseling specialization",
    "prereq": []
  },
  {
    "uid": "818808",
    "code": "GCD8916",
    "subject": "GCD",
    "number": "8916",
    "honors": false,
    "writingIntensive": false,
    "name": "Genetic Counseling Rsrch Smnr",
    "fullname": "Genetic Counseling Research Seminar",
    "info": "This course is designed to develop student knowledge and skills needed for addressing researchable questions encountered in genetic counseling. Must be a Genetic Counseling master's student or GC-FIRST Fellow.",
    "prereq": []
  },
  {
    "uid": "819965",
    "code": "GCD8917",
    "subject": "GCD",
    "number": "8917",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Genetics I",
    "fullname": "Medical Genetics I",
    "info": "This course integrates basic biochemical, molecular, and genetic principles with human development and disease. This course will provide a scientific foundation for clinical medicine genetics. Topics covered include chromosomal abnormalities, protein structural and folding abnormalities (e.g. hemoglobinapathies, connective tissue disorders, familial hypercholesterolemia), metabolic pathways and disorders. prereq: MCDG MS student with genetic counseling specialization",
    "prereq": []
  },
  {
    "uid": "819966",
    "code": "GCD8918",
    "subject": "GCD",
    "number": "8918",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Genetics II",
    "fullname": "Medical Genetics II",
    "info": "This course integrates basic biochemical, molecular, and genetic principles with human development and disease.  This course will provide a scientific foundation for clinical medicine genetics. Topics covered include newborn screening, neurological and neuromuscular conditions, hearing and vision loss, cardiology, psychiatric conditions, and genetic therapies.prereq: MCDG MS student with genetic counseling specialization",
    "prereq": []
  },
  {
    "uid": "013354",
    "code": "GCD8920",
    "subject": "GCD",
    "number": "8920",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Special topic shell",
    "prereq": []
  },
  {
    "uid": "819967",
    "code": "GCD8921",
    "subject": "GCD",
    "number": "8921",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Dev Seminar I",
    "fullname": "Professional Development Seminar I",
    "info": "This course will focus on developing awareness, attitudes, and skills to promote readiness for clinical placements. Course content will focus on the impact of identity on the professional life of genetic counselors. After introducing the importance of metacognition and self-care to success in graduate school and the profession, the major topics of the course will be exploration of personal intersectional identity, understanding the lenses by which we view the world, tools for navigating cultural differences, and assessing systemic barriers to inclusion in healthcare. Major topics will include interprofessional collaboration, variations to traditional operating procedures, utilizing clinical supervision, and cultivation of reflective practice.",
    "prereq": []
  },
  {
    "uid": "819968",
    "code": "GCD8922",
    "subject": "GCD",
    "number": "8922",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Dev Seminar II",
    "fullname": "Professional Development Seminar II",
    "info": "We will focus on preparing students for the transition to independent practitioners and leaders in the field. The primary emphasis of the course content in the fall semester will be development of skills and materials to help secure initial job placement, including professional networking, job search strategies, preparing application materials, interviewing, and financial planning. We will also explore individual leadership styles, professional leadership roles, innovation-thinking, and revisit self-care to incorporate the pressures of clinical practice and initial career decisions. Professional longevity content will explore sources of burnout and career satisfaction, ways to diversify job responsibilities, and work-life balance.",
    "prereq": []
  },
  {
    "uid": "013355",
    "code": "GCD8993",
    "subject": "GCD",
    "number": "8993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "tbdprereq: MCDG MS student with genetic counseling specialization orinstr consent",
    "prereq": []
  },
  {
    "uid": "013357",
    "code": "GCD8994",
    "subject": "GCD",
    "number": "8994",
    "honors": false,
    "writingIntensive": false,
    "name": "Research",
    "fullname": "Research",
    "info": "Independent research determined by student's interests, in consultation with faculty mentor.prereq: MCDG MS student with genetic counseling specializationor instr consent",
    "prereq": []
  }
]