[
  {
    "uid": "817960",
    "code": "GDBA7000",
    "subject": "GDBA",
    "number": "7000",
    "honors": false,
    "writingIntensive": false,
    "name": "DBA Program Fee",
    "fullname": "DBA Program Fee",
    "info": "Course created for purpose of charging program fee to various DBA cohorts. Total cost of program charged upfront and nonrefundable. ",
    "prereq": []
  },
  {
    "uid": "817431",
    "code": "GDBA7101",
    "subject": "GDBA",
    "number": "7101",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Thinking Leadership",
    "fullname": "Critical Thinking and Leadership",
    "info": "This course integrates approaches to leadership and ethics in related courses delivered at top business schools, placing them in the distinct context of these times. The course is devoted to providing a relatively complete view for executives of enterprises, who want to take control of their organizations, realize strategies and accomplish missions, to help them rethink, review and improve their leadership of self and of their organizations.  The course will be delivered through a combination of theoretical analyses, cases study and review of practice, through which students will be better able to understand multiple dimensions of human nature; they will also practice and strengthen critical thinking (to get at the truth), creative thinking (for divergence), situational thinking (for effectiveness), and ethical thinking (for fairness).  All of these are necessary for leaders’ daily decision-making, and help leaders realize their full potential to lead their organizations by overcoming internal and external challenges in the face of uncertainty, and help them cultivate outstanding leaders and create great companies.",
    "prereq": []
  },
  {
    "uid": "817432",
    "code": "GDBA7102",
    "subject": "GDBA",
    "number": "7102",
    "honors": false,
    "writingIntensive": false,
    "name": "Explore Tsinghua University",
    "fullname": "Exploration of Tsinghua University",
    "info": "The course stems from the research, thinking and epiphany of administrators of the college, to expose students to cutting edge academic research and scholarship at Tsinghua University and elsewhere. It draws on current, contextual work from recognized \"national excellent courses\" such as \"Scientific Research in Laboratory,\" and includes research results, teachers' reflections on and comprehension of the full range of advances in liberal arts, science and economic management, and in industry-university-research integration. Staying at the forefront, this course rediscovers higher-level scientific research resources and the cultural resources of Tsinghua University, relying on its status as a comprehensive, research-based, and open university.  Based on China's national context and the need to improve the local education system in economics and management, it focuses on the frontiers of engineering, the characteristics of science and industry in the information society, and the consequent changes to the rules of economy and management. It can inspire students to think differently and learn how to make full use of the resources at Tsinghua University to create and assist the competitive enterprises of the future.",
    "prereq": []
  },
  {
    "uid": "817433",
    "code": "GDBA7103",
    "subject": "GDBA",
    "number": "7103",
    "honors": false,
    "writingIntensive": false,
    "name": "Fin Market Invest Decisions",
    "fullname": "Financial Market and Investment Decision Making",
    "info": "The course starts with the basic theory of financial markets to examine the analytical framework of China's financial market theory, in light of the financial market system and interest rate policies of the United States and Europe. The course focuses on introducing the evolution of China's credit market, bond market, stock market, derivatives market, and securities investment funds market, through analysis of cases. It also emphasizes hot issues in the capital market, such as interest rate liberalization, multi-level capital market construction and structured finance. The course also introduces the financial derivatives market and its application to corporate risk management. Discussions in the class will include cases on Chinese and foreign financial markets, and the latest research results of the academic community. Students will become familiar with the mechanism of China's financial market, and thoroughly understand the operation of capital markets through this course.",
    "prereq": []
  },
  {
    "uid": "817434",
    "code": "GDBA7104",
    "subject": "GDBA",
    "number": "7104",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Enviro & Nat'l Strategy",
    "fullname": "International Environment and National Strategy",
    "info": "The course focuses on and explores the roots of global economic and political situations. International development trends, China's overall diplomacy, domestic and international views and disputes will be addressed. The course will mainly elaborate on the relationship between China and other major powers in the world such as the United States, Russia, and Japan, and the impact of the development of these relationships on economic behaviors and interactions between these markets.",
    "prereq": []
  },
  {
    "uid": "817442",
    "code": "GDBA7105",
    "subject": "GDBA",
    "number": "7105",
    "honors": false,
    "writingIntensive": false,
    "name": "Management Psych",
    "fullname": "Management Psychology",
    "info": "This course lays stress on analyzing factors that have influence on the organization's performance from three levels of the individual psychology, group psychology and organizational leadership psychology. It reveals the essence of human psychology and behaviors to improve all executives? ability to predict, coordinate and control people?s behaviors, so as to stimulate people's enthusiasm in work and realize their potential to full extent for the purpose of achieving the organizational goals. The course will reach its goal of teaching through the analysis of real cases to lead students into the field of psychology and inform them of the psychological problems in practice of management: how to perform leadership in various types of organizations; how to stimulate and integrate views of all parties, strengthen the enterprise?s structure and develop the self-management organization; how to improve communication skills and manage and transform the conflicts into a boost for performance.",
    "prereq": []
  },
  {
    "uid": "817444",
    "code": "GDBA7106",
    "subject": "GDBA",
    "number": "7106",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt Wisdom History",
    "fullname": "Management Wisdom Learned from History",
    "info": "This course centers on discussions of the comprehensive and dynamic relationship between politics and economic development in Chinese and World history. Instruction will focus on the implications of historical events and received wisdom on modern management, and the evaluation skills needed to manage complex organizations. The course combines both Western thought and Chinese traditional philosophy to help students develop a deeper understanding of history and its implications for modern business administration.",
    "prereq": []
  },
  {
    "uid": "817445",
    "code": "GDBA7107",
    "subject": "GDBA",
    "number": "7107",
    "honors": false,
    "writingIntensive": false,
    "name": "Sinology & Mgmt",
    "fullname": "Sinology Wisdom and Management Innovation",
    "info": "This course provides an introduction to the research and theory of management, leadership, logical thinking, and governance within organizations based on the wisdom and knowledge learned from classic historical events and modern management cases in China. The course will improve students abilities in theoretical thinking and historical and cultural knowledge accumulation. The course is intended to sharpen their strategic vision, decision-making methods and leadership, based on a comprehensive understanding of Chinese and global historical management wisdom.",
    "prereq": []
  },
  {
    "uid": "817446",
    "code": "GDBA7108",
    "subject": "GDBA",
    "number": "7108",
    "honors": false,
    "writingIntensive": false,
    "name": "Macroecon & Policy",
    "fullname": "The Macroeconomic Situation and Policy",
    "info": "This course uses the perspectives and methods of modern economics to analyze problems and systematically investigate the process of Chinas economic reform, opening-up, and development since 1979. It draws lessons from other countries and regions through comparison, so as to obtain an overall understanding of China's economic achievements in the past, its current problems, and its challenges for the future.",
    "prereq": []
  },
  {
    "uid": "817447",
    "code": "GDBA7201",
    "subject": "GDBA",
    "number": "7201",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Strategic Alliances",
    "fullname": "Global Strategic Alliances",
    "info": "This course helps the students understand the strategic rationale for strategic alliances, how to choose the right alliance partner, structure and negotiate alliances, how alliances can be best managed, and learn alliance termination and restructuring, and understand alliances in the Chinese context.",
    "prereq": []
  },
  {
    "uid": "817448",
    "code": "GDBA7202",
    "subject": "GDBA",
    "number": "7202",
    "honors": false,
    "writingIntensive": false,
    "name": "Innovation Emerging Tech",
    "fullname": "Innovation through Emerging Technologies",
    "info": "This course helps top executives and leaders become tech savvy and prepare their organizations for the rapidly changing technological and social environments. The course covers current IT trends such as social media, business analytics, sharing economy, mobile, and platform economy. It also covers next generation technologies that will define and shape our future such as Internet of things, 3D printing, artificial intelligence, and augmented reality. Students will learn about the technicality, key concepts, principles, and tools of each technology, collectively envision the implications of these technologies for business operations and innovations.",
    "prereq": []
  },
  {
    "uid": "817449",
    "code": "GDBA7203",
    "subject": "GDBA",
    "number": "7203",
    "honors": false,
    "writingIntensive": false,
    "name": "Marketing Strategies Global",
    "fullname": "Marketing Strategies for Firms in the Era of Globalization",
    "info": "The course focuses on and explores the marketing strategies for firms in the new era of globalization. During the past decades, firms of western countries have been very successful in expanding their business in the global market, including in the emerging markets such as Brazil, Russia, India, China, and South Africa (BRICS) that hold great potentials. For instance, Chinas economy has been growing rapidly to become the worlds second largest economy by nominal GDP, and many western firms have successfully gained a foothold in it. One key factor that helps the western firms to be successful in the global market is the long-term accumulated wisdom of business administration, both academically and practically. Examples include Coca-Cola and Apple that have been using brilliant branding management and other marketing tactics to help boom their business across continents.",
    "prereq": []
  },
  {
    "uid": "817450",
    "code": "GDBA7204",
    "subject": "GDBA",
    "number": "7204",
    "honors": false,
    "writingIntensive": false,
    "name": "Qualitative Research",
    "fullname": "Qualitative Research Methods",
    "info": "The course focuses on important methodologies that are helpful for students to do qualitative research in business administration. The course will focus on problem formulation and building theories for your study, designing appropriate case studies, collecting and analyzing primary data, and obtaining managerial insights to help improve your business decisions. In addition, the course will expose students to a new and useful research method---field experiments for studying business decision making in the field.",
    "prereq": []
  },
  {
    "uid": "817451",
    "code": "GDBA7205",
    "subject": "GDBA",
    "number": "7205",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Accounting",
    "fullname": "Global Accounting",
    "info": "This course aims to enhance students’ understanding of contemporary issues in accounting and corporate disclosures, with particular emphasis on issues arising in the process of globalization. Building on discussions of practical reporting issues, this course also exposes students to scholarly accounting research in the context of agency and contracting theory that has practical implications. Topics addressed include the role of accounting in capital markets and contracting, real effects of accounting, recent development in accounting in the global market place, cross-country comparisons of regulatory frameworks, corporate governance and accounting, and transfer pricing in multinational corporations.",
    "prereq": []
  },
  {
    "uid": "817452",
    "code": "GDBA7206",
    "subject": "GDBA",
    "number": "7206",
    "honors": false,
    "writingIntensive": false,
    "name": "Mergers and Acquisitions",
    "fullname": "Mergers and Acquisitions",
    "info": "Mergers and acquisitions (M&A) is an important way to achieve corporate growth. In this course, we will explore various means for corporate managers to achieve growth through M&A. The objective of the course is to help students develop a good understanding of the four principal areas related to M&A transactions (our four \"learning pillars\"):  fit and strategy, M&A process, valuation, and post-merger integration. For each \"learning pillar\", we not only discuss the general principles and practices, but also emphasize the advantages and challenges of acquiring a business in a foreign country. This course uses a balanced mix of lectures and case studies to deliver key insights from theories and real-world practices.",
    "prereq": []
  },
  {
    "uid": "817453",
    "code": "GDBA7207",
    "subject": "GDBA",
    "number": "7207",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Wealth Mgmt",
    "fullname": "Family Wealth Management",
    "info": "This course offers an integrated and strategic approach to family wealth management. Wealthy individuals or families wish to protect and grow the wealth, enjoy financial security, and build a lasting legacy. Effective wealth management is critical to achieve these goals. A successful wealth management is an integrated and strategic discipline that includes investment strategy, risk management, taxes, financial planning, philanthropy, governance, and family culture. This course will help wealthy families to understand fundamentals of family wealth management, importance of diversification and risk management in family wealth, strategies that can help to achieve tax-efficient and cost-effective diversification, comprehensive family financial planning, and effective oversight of the wealth management process.",
    "prereq": []
  },
  {
    "uid": "817454",
    "code": "GDBA7208",
    "subject": "GDBA",
    "number": "7208",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt of Headquarters",
    "fullname": "Management of Headquarters",
    "info": "This course is experiential in that it provides an opportunity for the students to visit multinational companies whose headquarters are based in the Twin Cities. During the visits the students will learn about the processes and structures in place, which enable global outreach. They will also observe a variety of managerial practices that facilitate these companies? success on the world stage. Each visit will be followed by a content-driven reflection session during which the students will process their observations within established frameworks from the International business literature.",
    "prereq": []
  },
  {
    "uid": "817455",
    "code": "GDBA7209",
    "subject": "GDBA",
    "number": "7209",
    "honors": false,
    "writingIntensive": false,
    "name": "Service Operations Mgmt",
    "fullname": "Service Operations Management",
    "info": "Services represent the largest segment of most industrial economies and an important growing segment of most global regions. China is experiencing tremendous growth in its service economy, with a near doubling in its service economy during the past two decades. The focus of executive attention is strongly shifting toward services, with increasing importance of service industries such as travel, finance, health care, media, and publishing. Despite its importance in the economy, service sector productivity growth generally lags that of manufacturing. A stronger focus on managing service operations is necessary to maintain local and globally competitive businesses. In addition, the effects of increasingly sophisticated consumers, deregulation, technology changes, and expanding global services combine to create new challenges. To succeed, business executives must have the skills to lead their service managers to allocate resources, design effective processes, analyze and improve operating practices, and apply new technologies. This course examines these opportunities.",
    "prereq": []
  },
  {
    "uid": "817456",
    "code": "GDBA7210",
    "subject": "GDBA",
    "number": "7210",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Analysis",
    "fullname": "Fundamental Data Analysis",
    "info": "The course begins with an overview of descriptive statistics, which includes both graphical and numerical methods for summarizing data. Then we provide a review of essential steps of inferential statistics, which include random variables, estimation, and hypothesis testing. The second half of the course is devoted to predictive analytics, including simple linear regression, multiple linear regression, and a brief introduction of experimental design. Throughout, we focus on basic concepts and the practical use of these methods in management environments. This course provides the background in statistical methods that is required for conducting research in a doctoral program in business.",
    "prereq": []
  },
  {
    "uid": "817457",
    "code": "GDBA7211",
    "subject": "GDBA",
    "number": "7211",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Branding",
    "fullname": "Global Branding",
    "info": "This course will combine critical current perspectives from information economics, psychology, sociology, behavioral decision theory and neuro-science to inform students about how brand information is acquired, processed and employed in decision-making, across segments and cultures. Students are expected to be familiar with basic marketing concepts to allow for a discussion of strategic issues related to global branding. The course will involve multiple pedagogies including lecture, case discussion and class exercises.",
    "prereq": []
  },
  {
    "uid": "817458",
    "code": "GDBA7212",
    "subject": "GDBA",
    "number": "7212",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Talent Mgmt",
    "fullname": "Global Talent Management",
    "info": "Global talent challenges are increasingly prevalent as organizations increasingly compete on a worldwide stage. Global talent management reflects an individual's and/or organizations capacity to influence others and work with people from other countries and manage international operations and to the use of human resource practices designed to ensure needed access to talent for multinational enterprises competing in a global environment. In this course, we will put particular attention on the development of global competencies and a \"global mindset\" in individuals and organizations. We will also explore how to effectively manage talent in the context of increasing globalization. In the course, we will focus upon identifying best practices for recruiting, developing and retaining global talent and managing high performance global work systems. More specifically, we will consider how one should organize the processes and systems of hiring, rewarding, evaluating, developing, and motivating talent in today's global context.",
    "prereq": []
  },
  {
    "uid": "825142",
    "code": "GDBA7213",
    "subject": "GDBA",
    "number": "7213",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Ethics",
    "fullname": "Business Ethics",
    "info": "This course will help equip students to analyze and resolve ethical challenges that arise in business. Students will have the opportunity to reflect on the place of business in society and how to manage the tensions between their dual roles as business leaders and citizens. A special focus will be on the corporation and to whom or what it is responsible.",
    "prereq": []
  },
  {
    "uid": "817459",
    "code": "GDBA7888",
    "subject": "GDBA",
    "number": "7888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis",
    "fullname": "Thesis",
    "info": "Students have to complete and defend a thesis in order to be granted with the DBA degree.",
    "prereq": []
  }
]