[
  {
    "uid": "791297",
    "code": "GLBT1001",
    "subject": "GLBT",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to GLBT Studies",
    "fullname": "Introduction to GLBT Studies",
    "info": "History of contemporary GLBT-identified communities. Terms of theoretical debates regarding sexual orientation, identity, and experience. Analyzes problems produced and insights gained by incorporating GLBT issues into specific academic, social, cultural, and political discourses.",
    "prereq": []
  },
  {
    "uid": "826678",
    "code": "GLBT1042",
    "subject": "GLBT",
    "number": "1042",
    "honors": false,
    "writingIntensive": false,
    "name": "Engaging with Queer Cinema",
    "fullname": "Engaging with Queer Cinema",
    "info": "What codes are at work that make a film Queer? In Queer Cinema, you will be an interpretive artist and active spectator as we analyze and consider subversive cinema from across nations and historical periods. Sometimes these films will be obviously queer or trans. However, the queer and trans film is often coded or distorted, especially in response to legal or societal censorship or disapproval. As a result, Queer directors and writers sometimes speak in a liberatory way to particular oppressed/silenced groups on the level of coded content, but if the content is consumed out of the context of the code, the experience of a film may be contradictory, even offensive. Consequently we'll be looking for the queer subversions within the distortions.",
    "prereq": []
  },
  {
    "uid": "808009",
    "code": "GLBT3211",
    "subject": "GLBT",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Sexuality in Europe",
    "fullname": "History of Sexuality in Europe",
    "info": "History of sexuality in Europe, from ancient Greece to present. Plato's philosophy of love, St. Augustine's conception of sin, prostitution in 15th century, sexual science of Enlightenment. Industrial revolution and homosexual subcultures. Rape scares and imperialism. Eugenics and Nazi Germany.",
    "prereq": []
  },
  {
    "uid": "802452",
    "code": "GLBT3212",
    "subject": "GLBT",
    "number": "3212",
    "honors": false,
    "writingIntensive": false,
    "name": "Dissident Sexualities in U.S.",
    "fullname": "Dissident Sexualities in U.S. History",
    "info": "History of sexuality in United States. Emphasizes sexualities that have challenged dominant social/cultural norms. Development of transgender, bisexual, lesbian, gay identities/communities. Politics of sex across lines of race/ethnicity. Historical debates over controversial practices, including sex work.",
    "prereq": []
  },
  {
    "uid": "798482",
    "code": "GLBT3301",
    "subject": "GLBT",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "GLBT Social Movements in U.S.",
    "fullname": "Gay, Lesbian, Bisexual, and Transgender Social Movements in the United States",
    "info": "Interdisciplinary course. Development of GLBT social movements using social movement theory/service learning.",
    "prereq": []
  },
  {
    "uid": "809865",
    "code": "GLBT3305",
    "subject": "GLBT",
    "number": "3305",
    "honors": false,
    "writingIntensive": false,
    "name": "Queer Cinema",
    "fullname": "Queer Cinema",
    "info": "What \"queer\" and \"queering\" signify in relation to cinema. Directors, films, styles, genres of queer cinema. Ways in which traditional narrative codes are challenged/repackaged. Ideological dimensions. Impact of political climate. Readings, screenings, discussions, assignments.",
    "prereq": []
  },
  {
    "uid": "818097",
    "code": "GLBT3309",
    "subject": "GLBT",
    "number": "3309",
    "honors": false,
    "writingIntensive": false,
    "name": "LGBTQ Literature: Then and Now",
    "fullname": "LGBTQ Literature: Then and Now",
    "info": "LGBTQIA life in the US has changed significantly over the past few decades. By examining a selection of poetry, prose, and film, our class will try to answer the questions: \"How did we get to where we are today?\" and \"Where do we go next?\" We will look at classic works in their historical contexts to see what was revolutionary about their publication; we will trace how they paved the way for all that followed. We will look at very new works to understand the concerns of twenty-first century LGBTQIA writers and readers. From the \"lavender scare\" to the Stonewall Riots to the AIDS pandemic to marriage equality to genderqueer and trans movements, we will explore how LGBTQIA authors and filmmakers have both responded to and shaped the ethos of our times.",
    "prereq": []
  },
  {
    "uid": "802273",
    "code": "GLBT3404",
    "subject": "GLBT",
    "number": "3404",
    "honors": false,
    "writingIntensive": false,
    "name": "Transnational Sexualities",
    "fullname": "Transnational Sexualities",
    "info": "Lesbian/gay lives throughout world. Culturally-specific/transcultural aspects of lesbian/gay identity formation, political struggles, community involvement, and global networking. Lesbian/gay life in areas other than Europe and the United States.",
    "prereq": []
  },
  {
    "uid": "802274",
    "code": "GLBT3411",
    "subject": "GLBT",
    "number": "3411",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender and Sexuality in Art",
    "fullname": "Gender and Sexuality in Art Since 1863",
    "info": "Representation of gender identity/sexuality. Modernism/postmodernism's reflecting of historical changes in gender roles, feminist politics. Construction/deconstruction of masculinity/femininity. Transgender performance as avant-garde practice. Body as image, medium, site of theoretical debate.",
    "prereq": []
  },
  {
    "uid": "802278",
    "code": "GLBT3456W",
    "subject": "GLBT",
    "number": "3456",
    "honors": false,
    "writingIntensive": true,
    "name": "Sexuality and Culture",
    "fullname": "Sexuality and Culture",
    "info": "Historical/critical study of forms of modern sexuality (heterosexuality, homosexuality, romance, erotic domination, lynching). How discourses constitute/regulate sexuality. Scientific/scholarly literature, religious documents, fiction, personal narratives, films, advertisements.",
    "prereq": []
  },
  {
    "uid": "802277",
    "code": "GLBT3472",
    "subject": "GLBT",
    "number": "3472",
    "honors": false,
    "writingIntensive": false,
    "name": "Gay Men, Homophobia in America",
    "fullname": "Gay Men and Homophobia in American Culture",
    "info": "The historical experience of gay men, the social construction of same-sex desire in American society since 1700, studied in a broad context of cultural history and discourse, including literature and the arts, journalism, science and medicine, religion, and law.",
    "prereq": []
  },
  {
    "uid": "817289",
    "code": "GLBT3502",
    "subject": "GLBT",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Transgender Studies Now",
    "fullname": "Transgender Studies Now",
    "info": "Transgender studies transforms ideas about gender, sexuality, identity, and biology. We look at how knowledge is made about transgender life across disciplines and media: film, fiction, and the internet, as well as medicine, history, anthropology, and gender studies. This course also asks how transgender social practices and community politics are embedded in dynamics of race, class, sexuality, nationality, and ability.",
    "prereq": []
  },
  {
    "uid": "791795",
    "code": "GLBT3610",
    "subject": "GLBT",
    "number": "3610",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in GLBT Studies",
    "fullname": "Topics in GLBT Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "793339",
    "code": "GLBT3993",
    "subject": "GLBT",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual study. GLBT topic not available through regular course offerings. Students work with faculty who share their research interests. Number of credits based on scope of project, student needs, and advising instructor's approval.prereq: GLBT studies minor, instr consent",
    "prereq": []
  },
  {
    "uid": "802279",
    "code": "GLBT4101",
    "subject": "GLBT",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender, Politics",
    "fullname": "Gender, Sexuality, and Politics in America",
    "info": "Ways public and private life intersect through the issues of gender, sexuality, family, politics, and public life; ways in which racial, ethnic, and class divisions have been manifest in the political ideologies affecting private life.",
    "prereq": []
  },
  {
    "uid": "817283",
    "code": "GLBT4204",
    "subject": "GLBT",
    "number": "4204",
    "honors": false,
    "writingIntensive": false,
    "name": "Sex, Love, & Disability",
    "fullname": "Sex, Love, & Disability",
    "info": "In America's cultural imagination, people with disabilities are figured either as childlike and asexual, or improperly hypersexual. For disabled people (or anyone perceived as disabled) this paradox has meant denial of sexual agency and gender expression, histories of forced sterilization and institutionalization, sociopolitical marginalization, and great risk of sexual violence (and even death). In this course, we'll examine this history to better understand our contemporary present. We'll analyze constructions of disability and sexuality as they are interwoven with gender, class, race, and citizenship. We will ask: What might it mean to desire disability? Is there a disability sexual culture? Do disabled people queer sex, or does sexuality queer disability? What is the relationship between GLBTQ and disability rights and liberation movements? Drawing from feminist, queer, and disability studies, we'll answer these questions (and more) by examining how the imagined able-bodymind structures our understanding of gender/sexuality, and how disability sexual cultures resist these norms. ",
    "prereq": []
  },
  {
    "uid": "810132",
    "code": "GLBT4232",
    "subject": "GLBT",
    "number": "4232",
    "honors": false,
    "writingIntensive": false,
    "name": "Chicana Gender and Sexuality",
    "fullname": "Chicana/o - Latina/o Gender and Sexuality Studies",
    "info": "Critical thinking of Chicanas/os, Latinas/os around construction of gender. Politics of sexual identity. How self is gendered in relationship to sexual, racial, class, national identities under different social structural conditions.",
    "prereq": []
  },
  {
    "uid": "802276",
    "code": "GLBT4403",
    "subject": "GLBT",
    "number": "4403",
    "honors": false,
    "writingIntensive": false,
    "name": "Queering Theory",
    "fullname": "Queering Theory",
    "info": "This course will give you a solid theoretical foundation in the field of queer studies in addition to explaining its relation to other scholarly traditions, including (but not limited to) feminist theory, GLBT studies, literary studies, psychoanalysis, and postmodernism. Over the course of the semester you will examine the historical forces that birthed queer politics and theory, become conversant in its conceptual basis, interrogate and analyze its various uses and applications, and finally apply it in your own arguments.  prereq: Any GWSS or GLBT course",
    "prereq": []
  },
  {
    "uid": "817408",
    "code": "GLBT4415",
    "subject": "GLBT",
    "number": "4415",
    "honors": false,
    "writingIntensive": false,
    "name": "Transnational Body Politics",
    "fullname": "Transnational Body Politics",
    "info": "Our bodies are always already modified. How we shape our bodies can express our deepest feelings about who we are. Body modification can also represent cultural and subcultural identifications or expectations based on gender, race, class, and sexuality. But what we do with our bodies is never separate from the politics of cultural difference and fluctuating ideas of what is acceptable or unacceptable, civilized or uncivilized. These ideas are historically and culturally specific. This course looks at body modification on a transnational scale to ask how we come to know what differentiates \"mutilation\" from \"correction.\" We ask how feminist, queer and critical race theories illuminate these debates, reading across historical, anthropological, medical, and literary texts. Weekly topics include gender, race, and cosmetic surgery; skin whitening technologies; transnational gender reassignment; surgical tourism; female genital cutting; piercing, tattooing and scarification; the cultural politics of hair; and body modification in the context of transnational feminized labor. ",
    "prereq": []
  },
  {
    "uid": "816829",
    "code": "GLBT4502",
    "subject": "GLBT",
    "number": "4502",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender and Public Policy",
    "fullname": "Gender and Public Policy",
    "info": "Public policy issues, processes, and histories as these affect women-, children-, and gender-related issues.",
    "prereq": []
  },
  {
    "uid": "800289",
    "code": "GLBT5993",
    "subject": "GLBT",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed Study ",
    "prereq": []
  }
]