[
  {
    "uid": "814648",
    "code": "GSD1905",
    "subject": "GSD",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "008978",
    "code": "GSD3451W",
    "subject": "GSD",
    "number": "3451",
    "honors": false,
    "writingIntensive": true,
    "name": "Major Project Seminar",
    "fullname": "Major Project Seminar",
    "info": "Students prepare major project under supervision of faculty member.",
    "prereq": []
  },
  {
    "uid": "009951",
    "code": "GSD3511W",
    "subject": "GSD",
    "number": "3511",
    "honors": false,
    "writingIntensive": true,
    "name": "German & Europ Culture to 1700",
    "fullname": "Vikings, Knights, and Reformers: German and European Culture and Controversies to 1700",
    "info": "Survey of representative cultural-historical events in Europe (German-speaking countries, Scandinavian, the Netherlands) from early Germanic times to 1700.",
    "prereq": []
  },
  {
    "uid": "009980",
    "code": "GSD3512W",
    "subject": "GSD",
    "number": "3512",
    "honors": false,
    "writingIntensive": true,
    "name": "Ger, Europ Culture after 1700",
    "fullname": "Imagined Communities: German and European, Culture and Controversies, 1700 to Present",
    "info": "Survey of representative cultural-historical events in Europe (German-speaking countries, Scandinavian, the Netherlands) from 1700 to present.",
    "prereq": []
  },
  {
    "uid": "826446",
    "code": "GSD3656",
    "subject": "GSD",
    "number": "3656",
    "honors": false,
    "writingIntensive": false,
    "name": "Existentialism",
    "fullname": "Existentialism",
    "info": "What do we mean when we call something \"existential?\"  What do we mean when we speak of an \"existential\" crisis? We seem to mean that our core beliefs and assumptions are affected and the relationship with our environment is ruptured; we have fallen out of normalcy. The term existentialism -- turning existential into a noun -- came into being in the 1940s in France, reflecting the collective experience of societal breakdown, of Nazism, and WW2. It has since been applied to all modes of philosophical inquiry that take an individual's experience of alienation from society as their point of departure. The advantage of making alienation the focus of this class, too, is that it allows us to recognize the precise historical and sociological index of the emergence of an existentialist mode of thought and practice. Existentialism looks very different when it responds to a 19th century crisis of faith (Søren Kierkegaard), to 1950s colonialism (Frantz Fanon), to Weimar Germany's new democracy and the specter of a mass society (Martin Heidegger), or to the neo-authoritarian French society of the 1960s (Simone de Beauvoir). Existentialism then is understood in this class not as a conversation between great thinkers or ideas across time and space, but as a response to a specific crisis of norms and values. It only exists in plural. If existentialist concepts -- like being-in-the world, being-towards-death, or the gaze of the other -- are carried forward, then not without being repurposed. Such situatedness is inherent to existentialism itself. Accordingly, existentialist writers have no creed or ethical stance in common; they are found both on the far (fascist) right and on the Marxist left. They do share though a keen interest in a new language and in literary forms of expression and subsequently, they insist on the individuals' capacity of \"world-making\" -- in rupture and rebellion -- against seemingly compromised societal norms.",
    "prereq": []
  },
  {
    "uid": "826279",
    "code": "GSD3681",
    "subject": "GSD",
    "number": "3681",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Central & Nordic Europe",
    "fullname": "Black Central & Nordic Europe",
    "info": "Europe is constantly associated with whiteness, yet Black people have existed in Northern and Central Europe (the contemporary spaces known as Germany, Austria, the Netherlands, Belgium, and Scandinavia) for centuries. To counter this imagined whiteness, students will be reading histories and Black authors’ experiences in these nations. A closer investigation will show that Black people have been traveling to Europe (willingly and unwillingly) for centuries. While Afro-Europeans remain at the margins of these nations, they find avenues to survive and thrive in the face of microaggressions and racism. As the semester progresses, we will examine the following questions: What is daily life like in a majority white country? In what ways are these authors included or excluded from national discourses? What ways do they bring attention to anti-Blackness in their local contexts? How do they define home and belonging? These questions will help us understand the imagined citizens of Central Europe, and the people trying to tear these false images down.",
    "prereq": []
  },
  {
    "uid": "818538",
    "code": "GSD3896",
    "subject": "GSD",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer.  Typically the students work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": []
  },
  {
    "uid": "008979",
    "code": "GSD5103",
    "subject": "GSD",
    "number": "5103",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching of Germanic Languages",
    "fullname": "Teaching of Germanic Languages",
    "info": "Second language acquisition theory, methods, testing, and technology applicable to teaching of modern Germanic languages.",
    "prereq": []
  },
  {
    "uid": "009075",
    "code": "GSD8001",
    "subject": "GSD",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Approaches to Textual Analysis",
    "fullname": "Approaches to Textual Analysis",
    "info": "Theoretical approaches to textual analysis that shape disciplinary discussions in Germanic studies.",
    "prereq": []
  },
  {
    "uid": "802192",
    "code": "GSD8002",
    "subject": "GSD",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Interdiscip. Textual Analysis",
    "fullname": "Interdisciplinary Approaches to Textual Analysis",
    "info": "Theoretical approaches in textual studies that challenge conventional notions of boundaries between disciplines and between national literatures/cultures.",
    "prereq": []
  },
  {
    "uid": "825711",
    "code": "GSD8103",
    "subject": "GSD",
    "number": "8103",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Teaching Methods",
    "fullname": "Advanced Teaching Methods: Integrating Language and Disciplinary Content",
    "info": "This course explores theoretical and practical approaches to cultivating students’ advanced literacies in a second language through the integration of language proficiency development and the study of disciplinary content in upper-level literature, linguistics, and culture courses.Students must have passed FRIT 5999 or GSD 5103 or SPPT 5999 or have permission from the instructor in order to take this course.",
    "prereq": []
  },
  {
    "uid": "788274",
    "code": "GSD8333",
    "subject": "GSD",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "TBDprereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788410",
    "code": "GSD8444",
    "subject": "GSD",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "TBDprereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788531",
    "code": "GSD8666",
    "subject": "GSD",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "008624",
    "code": "GSD8801",
    "subject": "GSD",
    "number": "8801",
    "honors": false,
    "writingIntensive": false,
    "name": "Dissertation Seminar",
    "fullname": "Dissertation Seminar",
    "info": "For doctoral students in German and Scandinavian studies who are beginning to establish topics and do research for their dissertations. Discussion of a variety of topics related to this process as well as presentation of some written work.",
    "prereq": []
  },
  {
    "uid": "016475",
    "code": "GSD8802",
    "subject": "GSD",
    "number": "8802",
    "honors": false,
    "writingIntensive": false,
    "name": "Dissertation Writing Seminar",
    "fullname": "Dissertation Writing Seminar",
    "info": "Critical, supportive forum for discussion of problems/issues related to dissertation research/writing. Shaping/controlling one's topic. Developing chapter outlines. Questions of audience. Careful uses of language. Turning a dissertation into a book.prereq: 8801, completion of doctoral preliminary examinations",
    "prereq": {
      "code": "GSD 8801",
      "subject": "GSD",
      "id": "8801"
    }
  },
  {
    "uid": "787933",
    "code": "GSD8888",
    "subject": "GSD",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(no description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  }
]