[
  {
    "uid": "809921",
    "code": "HECU3555W",
    "subject": "HECU",
    "number": "3555",
    "honors": false,
    "writingIntensive": true,
    "name": "From Consumers to Creators",
    "fullname": "Making Media & Change: Digital Technologies, Storytelling, and Activism From Consumers to Creators",
    "info": "The From Consumers to Creators course is a critical exploration of the role of storytelling and media in social change efforts. In this course will examine the ways that story is both a lens through which one understand the world and a tool which can be used to shape it. Students will have the opportunity to learn about and evaluate media-based activist strategies in the context of competing theoretical perspectives on media and society. Students will use theory and field experiences to reflect upon and hone their own digital practices as an effective agent of social change. This course is one of three required linked courses taken concurrently which make up the Making Media, Making Change Digital Technologies, Storytelling, and Activism program taught through our institutional partnership with HECUA and their community partner, the Twin Cities public access media powerhouse St Paul Neighborhood Network (SPNN), which provides technical training, equipment, and video production support. Students are also enrolled in HECU 3556 Digital Laboratory and enrolled in HECU 3558 Digital Media Internship where students can strengthen relationships with the diverse set of actors in the Twin Cities committed to using digital media to share their voices and build community. Interns contribute to public access and nonprofit programming and create professional quality video for community organizations in the Twin Cities. prereq: Departmental Consent Required.",
    "prereq": []
  },
  {
    "uid": "809922",
    "code": "HECU3556",
    "subject": "HECU",
    "number": "3556",
    "honors": false,
    "writingIntensive": false,
    "name": "Media & Change Digital Lab",
    "fullname": "Making Media Making Change: Digital Technologies, Storytelling, and Activism Digital Laboratory",
    "info": "The Digital Laboratory course is focused on the development and production of compelling videos. Student videography is expected to demonstrate both innovative content and high quality production. As part of this course, students will be trained by SPNN staff in camera operations, aesthetics of video production, shot composition, audio, lighting, and editing. Work will be graded with one's growing skill set in mind. Instructors will look for improvement in both the technical elements and the student's ability to create engaging and original work that reflects our focus on media that catalyzes social change. By the end of the semester students will be able to produce video suitable for public broadcast. While the coursework is integrated, we will spend most Wednesdays focused on the Digital Laboratory. The Digital Laboratory course is one of three required linked concurrently offered courses that make up the Making Media, Making Change: Digital Technologies, Storytelling and Activism program taught through our institutional partnership with HECUA {and their community partner, the Twin Cities public access media powerhouse St Paul Neighborhood Network (SPNN), which provides technical training, equipment, and video production support). Students are also enrolled in HECU 3555W From Consumers to Creators and HECU 3558 Digital Media internship where students can strengthen relationships with the diverse set of actors in the Twin Cities committed to using digital media to share their voices and build community. Interns contribute to public access and nonprofit programming and create professional quality video for community organizations in the Twin Cities. Departmental Consent Required.",
    "prereq": []
  },
  {
    "uid": "810001",
    "code": "HECU3557",
    "subject": "HECU",
    "number": "3557",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship in Digital Media",
    "fullname": "Making Media, Making Change: Digital Technologies, Storytelling, & Activism Digital Media Internship",
    "info": "This 4 credit Internship in Digital Media course is offered for students who are participating in Making Media, Making Change: Digital Technologies, Storytelling, and Activism. The internship allows students to put their passion to work at St. Paul Neighborhood Network (SPNN) and deepen their understanding of how the core issues in the program's two linked courses (HECU 3555W and 3556) play out in this community media center and shape professional practice in digital media. While HECUA strongly encourages the 8 credit internship, in special cases students can get approval to take this 4 credit version of the Internship concurrently. Working at SPNN, students build networks in the diverse set of practitioners in the Twin Cities committed to using digital media for social change. Interns contribute to public access and nonprofit programming and create professional quality video for community organizations in the Twin Cities. Departmental Consent required. Concurrent enrollment in HECU 3555W and 3556. Credit cannot be earned if already granted for HECU 3558.",
    "prereq": []
  },
  {
    "uid": "810013",
    "code": "HECU3558",
    "subject": "HECU",
    "number": "3558",
    "honors": false,
    "writingIntensive": false,
    "name": "Media & Change Internship",
    "fullname": "Making Media, Making Change: Digital Technologies, Storytelling, & Activism Digital Media Internship",
    "info": "This required Internship in Digital Media course is offered for students who are participating in Making Media, Making Change: Digital Technologies, Storytelling, and Activism. The internship allows students to put their passion to work at St. Paul Neighborhood Network (SPNN) and deepen their understanding of how the core issues in the program's 2 linked courses (HECU 3555W and 3556) play out in this community media center and shape professional practice in digital media. Students take the Internship concurrently with the core program courses. Working at SPNN, students build networks in the diverse set of practitioners in the Twin Cities committed to using digital media for social change. Interns contribute to public access and nonprofit programming and create professional quality video for community organizations in the Twin Cities. Departmental Consent required. Concurrent enrollment in HECU 3555W and 3556. Credit can not be earned if already granted for HECU 3557.",
    "prereq": []
  },
  {
    "uid": "007641",
    "code": "HECU3571W",
    "subject": "HECU",
    "number": "3571",
    "honors": false,
    "writingIntensive": true,
    "name": "Inequality US Political Econ",
    "fullname": "Inequality in America: A Political Economy Approach",
    "info": "This seminar provides the theoretical foundations necessary for understanding the roots, dynamics, and reproduction of urban and regional economic, political, and social inequality and poverty. It will also equip students with the key theoretical tools for evaluating alternative policies and strategies for addressing various forms of poverty and inequality. Theory will be treated in an integrated fashion with students' field and internship work and will draw from numerous disciplines but with a particular focus on the field of political economy. Students examine a series of interrelated social systems relevant to the study of poverty and inequality such as the economy, the politics of economic policy, labor markets, geographic systems and housing, education and welfare systems. Theories of oppression help students understand how institutionalized racism, classism and gender discrimination factor in and among all of these systems.This course is one of three courses taken concurrently that make up the Inequality in America: Policy, Community, and the Politics of Empowerment program taught through our institutional partnership with HECUA. Students are also enrolled in HECU 3572 Political Sociology of Building Power, Change, and Equity and HECU 3573 Internship and Integration Seminar. prereq: departmental consent required",
    "prereq": []
  },
  {
    "uid": "788851",
    "code": "HECU3572",
    "subject": "HECU",
    "number": "3572",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Sociology of Equity",
    "fullname": "Inequality in America: Political Sociology of Building Power, Change, and Equity (Field Seminar)",
    "info": "This seminar illuminates, grounds, and 'tests' theoretical perspectives and insights gained in the \"Inequality in America: A Political Economy Approach\" seminar. Students will examine a variety of policy alternatives and strategies for social change used to address poverty and inequality by conversing with policy makers, community activists, and public and private organizations, and by participating in a number of structured field exercises and legislative lobbying. This course is one of three courses taken concurrently that make up the Inequality in America: Policy, Community, and the Politics of Empowerment program taught through our institutional partnership with HECUA. Students are also enrolled in HECU 3571 Inequality in America: A Political Economy Approach and HECU 3573 Internship and Integration Seminar. Departmental Consent Required. ",
    "prereq": []
  },
  {
    "uid": "788852",
    "code": "HECU3573",
    "subject": "HECU",
    "number": "3573",
    "honors": false,
    "writingIntensive": false,
    "name": "Inequality in US: Internship",
    "fullname": "Inequality in America: Internship and Integration Seminar",
    "info": "The Internship and Integration Seminar is an 8 credit course comprised of two interconnected parts.. The internship is concentrated practice, and facilitates student learning on many levels. Students integrate and refine their theoretical understanding, build and develop skills, gain a greater understanding of methods of social change, and grow in their understanding of vocation. The program deliberately integrates these experiences with themes and experiences from the other courses in the program. Students work a minimum of 200 hours at their placement, approximately 20 hours each week for the duration of the program.This seminar integrates theoretical and experiential work in the other seminars of the program with internship work, and provides further theoretical frameworks for making meaning from the internship experiences. Students analyze the operation of organizations that are dedicated to changing systemic inequalities, learn how, when, and why organizations collaborate, and explore the perspectives that internship organizations and staff bring to individual and societal change. Assignments ask students to articulate and assess worldviews on social change and movement-building, including; their own, those in texts discussed in the classroom, those expressed by field speakers who visit the program, and staff at their internship sites. Through guided examination of the assumptions they bring to interactions with practitioners and communities, students see how those varying worldviews play out within organizations and in processes of social change. Finally, students reflect on the impacts their classroom training and lived experiences have in real-world work and community environments, and articulate plans for their future engagement.This course is one of three courses taken concurrently that make up the Inequality in America: Policy, Community, and the Politics of Empowerment program taught through our institutional partnership with HECUA. Students are also enrolled in HECU 3571 Inequality in America: A Political Economy Approach and HECU 3572 Political Sociology of Building Power, Change and Equity.  Departmental consent required. ",
    "prereq": []
  },
  {
    "uid": "803900",
    "code": "HECU3574",
    "subject": "HECU",
    "number": "3574",
    "honors": false,
    "writingIntensive": false,
    "name": "Race in America: TC Rise Up",
    "fullname": "Race in America: The Twin Cities Rise Up",
    "info": "HECUA’s Race in America program poses the question: how are ordinary people moved to extraordinary action? For years, HECUA students have worked to address this question by examining The Black Freedom Movement of the 1950s and 60s, and more recently, Black Lives Matter — all from the perspective of the people and places of the American South. In response to the murder of George Floyd, and subsequent summer uprisings in our communities and across the country, HECUA is making the Race in America program a special Twin Cities-based offering for Summer 2021. As this program responds to this critical moment in the history of our community and nation, we will work to honor the thematic priorities of the Race in America program, including remote engagement with HECUA community partners in Mississippi and elsewhere in the South. The Race in America-Twin Cities program examines the unique and destructive legacy of settler colonialism in Minnesota and its impacts on our Indigenous communities, later Black Minnesotans, and more recently, other communities of color, including new immigrants. Today, Minnesotans enjoy some of the highest quality of life indicators in the country. However, there are also staggering economic and educational disparities – some of the widest gaps in the US– between BIPOC Minnesotans and their White counterparts, particularly across urban communities. The murder of George Floyd and the summer uprisings of 2020 revealed to the world that racial and economic justice in Minnesota and across this nation are far from reality. Students in HECUA’s Race in America-Twin Cities program are introduced to a new generation of leaders who are working to meet critical challenges in education, policing and public safety, voting rights, environmental justice, and the establishment of a model for grassroots cooperative economics. Students will leave this program with a profound understanding of past and current movements for justice, new ways to examine issues of power and privilege, and a deeper understanding of their own capacity to make change.",
    "prereq": []
  },
  {
    "uid": "007642",
    "code": "HECU3581",
    "subject": "HECU",
    "number": "3581",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and Culture in Context",
    "fullname": "Art for Social Change: Art and Culture in Political, Social, and Historical Context",
    "info": "In this course, students will combine new learning from field speakers, books, articles, guest speakers, and field trips to gain a deeper understanding of the need for and approach to effective community-based artistic engagement. Each student will participate in or facilitate engaged conversations with their peers to grapple with the themes of the course and have the chance to create artistic projects that help each other integrate their new learning and awareness.Concurrent registration is required in HECU 3582 and HECU 3583; Departmental Consent required.",
    "prereq": []
  },
  {
    "uid": "788929",
    "code": "HECU3582",
    "subject": "HECU",
    "number": "3582",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Justice Arts Praxis",
    "fullname": "Art for Social Change: Arts Praxis - Social Justice Theory and Practice in the Field",
    "info": "Arts, popular culture, social change. Interdisciplinary field study, seminar work, internship.prereq: concurrent registration is required (or allowed) in 3581, 3583, dept consent",
    "prereq": {
      "and": [
        {
          "code": "HECU 3581",
          "subject": "HECU",
          "id": "3581"
        },
        {
          "code": "HECU 3583",
          "subject": "HECU",
          "id": "3583"
        }
      ]
    }
  },
  {
    "uid": "788930",
    "code": "HECU3583",
    "subject": "HECU",
    "number": "3583",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Change Arts Internship",
    "fullname": "Art for Social Change: Intersections of Art, Identity and Advocacy Internship & Integration Seminar",
    "info": "In this Art for Social Change Internship and Integration seminar students will work with HECUA to be placed in an internships which will offer them the chance to integrate and apply their learning in professional settings. As an intern, students will gain skills in communication, discipline, organization, project management, and turning theory into action. By completing a HECUA internship, students will have a critical competitive edge in the job market after graduating. In addition to professional development, students will also leave their internship experience with a better sense of the type of job and work environment they want to find and the steps needed to take to get there. Students are required to be concurrently registered in HECU 3581 and 3582. Spring semester offering. ",
    "prereq": []
  },
  {
    "uid": "794484",
    "code": "HECU3591",
    "subject": "HECU",
    "number": "3591",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate & Environment Justice",
    "fullname": "Environmental Sustainability: Sci, Public Policy, & Cmty Action Climate & Environment Justice",
    "info": "In the twenty-first century, the environmental century, human beings must decide how to deal with the many planetary consequences of the ?Great Acceleration? and its conjunction with the 500-year pattern of conquest, genocide, and extreme social marginalization of indigenous peoples and poor peoples of color. As we consider how to respond to climate change, restore degraded ecosystems, and promote a sustainable quality of life in human settlements, how might we do this in an environmentally just approach? This is the basic question to be explored in this course, in light of the past record of the inequitable distribution and accumulated disadvantage resulting from historical environmental behavior in societies and global civilization as a whole.  This course is one of four courses which make up the Environmental Sustainability: Ecology, Policy and Social Transformation Program taught by Study Away partner HECUA. Concurrent registration is required in 3592, in 3593, and in 3594, Fall semester. Dept consent required. ",
    "prereq": []
  },
  {
    "uid": "794485",
    "code": "HECU3592",
    "subject": "HECU",
    "number": "3592",
    "honors": false,
    "writingIntensive": false,
    "name": "Socio-ecological System Change",
    "fullname": "Environmental Sustainability: Ecology and Socio-ecological Systems Change",
    "info": "Since our original hunter-gatherer communities, humans have had an impact, sometimes quite negative, on our environment. What is different now, since the ?Great Acceleration? that began in the mid-twentieth century, is that our environmental impacts are global in scope and potentially catastrophic in scale. Learning to become ecologically wise is thus a priority for all of humanity in the twenty-first century. Socio-Ecological Systems bridges political science and environmental sciences with the intent of fostering policy responses that help human society apply ecological wisdom in a timely manner at worst, and in an ecologically regenerative manner at best.In this course, we will integrate questions regarding sustainability challenges of water, forest, wetland, climate, soil, with those involving people, cultures, politics, and economy in a comprehensive, integral framework. This investigation will build students? ability to see complex dynamics more clearly, and prepare students to be part of efforts to create ecologically wise policy and practices for a more sustainable future.This course is one of four courses which make up the Environmental Sustainability: Ecology, Policy and Social Transformation Program taught by Study Away partner HECUA. Concurrent registration is required in 3591, in 3593, and in 3594, Fall semester program. Dept consent required. ",
    "prereq": []
  },
  {
    "uid": "794486",
    "code": "HECU3593",
    "subject": "HECU",
    "number": "3593",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Research Methods",
    "fullname": "Environmental Sustainability Sci, Public Policy, & Cmty Action Field Research Method & Investigation",
    "info": "The Field Methods course provides students with practical skills to assess and improve ecosystems and decision-making in socio-ecological systems. We will use a text by Bill Mollison, a founder of permaculture, to learn how to work with nature to improve ecological, communal, and personal health simultaneously. This course is designed to help students develop the capacity for constant and consistent ecological thinking, in order to participate in wise and effective decision-making at the interface of the human and natural worlds. All field-based learning in the course takes place in partnership with community organizations and branches of government that are working actively as ecological stewards and promoting sustainability of human society and specific settlements with wise design. We will learn and apply conceptual, organizational, and technical skills to help our community and institutional partners in this process. This course engages Lily Springs Farm as a field-learning site. We work with a permaculture designer and farmer on-site to use a variety of techniques to assess the landscape and to design and implement ecologically restoration strategies for: a lake; a wetland; a farm system, a pine plantation being slowly converted to an oak savanna mimic; and 30 acres of forest that has been largely undisturbed for the past thirty years.This course is one of four courses which make up the Environmental Sustainability: Ecology, Policy, and Social Transformation Program taught by Study Away partner HECUA. Concurrent registration is required in 3591, in 3592, and in 3594, Fall semester program. Dept consent required.",
    "prereq": []
  },
  {
    "uid": "797437",
    "code": "HECU3594",
    "subject": "HECU",
    "number": "3594",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Internship",
    "fullname": "Environmental Sustainability Sci, Public Policy, & Cmty Action Internship",
    "info": "The internship provides concentrated practice at an organization whose core work addresses issues raised in this program. At the internship, students integrate and refine their theoretical understanding, build and develop skills, and grow in their understanding of future career paths. Facilitated reflection, written assignments, and activities that include time at another student's internship site, integrate the internship experiences with the other courses. Students work a minimum of 160 hours at their placement, 12-15 hours/week for 12 weeks during the program.This course is one of four courses which make up the Environmental Sustainability: Ecology, Policy and Social Transformation Program taught by Study Away partner HECUA. Concurrent registration is required in 3591, in 3592, and in 3593, Fall semester program. Dept consent required. ",
    "prereq": []
  }
]