[
  {
    "uid": "807929",
    "code": "HINF5115",
    "subject": "HINF",
    "number": "5115",
    "honors": false,
    "writingIntensive": false,
    "name": "Interprofession Informatics",
    "fullname": "Interprofessional Healthcare Informatics",
    "info": "Implications of informatics for practice, including nursing, public health, and healthcare in general. Electronic health record issues. Relates ethical, legislative and political issues informatics. Global and future informatics issues.prereq: Grad student or professional student or instr consent",
    "prereq": []
  },
  {
    "uid": "818611",
    "code": "HINF5394",
    "subject": "HINF",
    "number": "5394",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed research arranged with faculty member.",
    "prereq": []
  },
  {
    "uid": "007227",
    "code": "HINF5430",
    "subject": "HINF",
    "number": "5430",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndn Health Informatics I",
    "fullname": "Foundations of Health Informatics I",
    "info": "An introductory survey of health informatics, focusing on foundational concepts. Topics covered include: conceptualizations of data, information, and knowledge; current terminologies, coding, and classification systems for medical information; ethics, privacy, and security; systems analysis, process and data modeling; human-computer interaction and data visualization. Lectures, readings, and exercises highlight the intersections of these topics with electronic health record systems and other health information technology.prereq: Junior, senior, grad student, professional student, or instr consent",
    "prereq": []
  },
  {
    "uid": "007228",
    "code": "HINF5431",
    "subject": "HINF",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndn Health Informatics II",
    "fullname": "Foundations of Health Informatics II",
    "info": "An introductory survey of health informatics, focusing on applications of informatics concepts and technologies. Topics covered include: health informatics research, literature, and evaluation; precision medicine; decision models; computerized decision support systems; data mining, natural language processing, social media, rule-based system, and other emerging technologies for supporting 'Big Data' applications; security for health care information handling. Lectures, readings, and exercises highlight the intersections of these topics with current information technology for clinical care and research.prereq: Junior, senior, grad student, professional student, or instr consent",
    "prereq": []
  },
  {
    "uid": "007226",
    "code": "HINF5436",
    "subject": "HINF",
    "number": "5436",
    "honors": false,
    "writingIntensive": false,
    "name": "Grand Rounds",
    "fullname": "AHC Informatics Grand Rounds",
    "info": "Presentation/discussion of research problems, current literature/topics of interest in Health Informatics.",
    "prereq": []
  },
  {
    "uid": "817396",
    "code": "HINF5440",
    "subject": "HINF",
    "number": "5440",
    "honors": false,
    "writingIntensive": false,
    "name": "Translational Bioinformatics",
    "fullname": "Foundations of Translational Bioinformatics",
    "info": "Translational bioinformatics deals with the assaying, computational analysis and knowledge-based interpretation of complex molecular data to better understand, prevent, diagnose and treat disease. This course emphasizes deep DNA sequencing methods that have persistent impact on research related to disease diagnosis and treatment. The course covers sequence analysis, applications to genome sequences, and sequence-function analysis, analysis of modern genomic data, sequence analysis for gene expression/functional genomics analysis, and gene mapping/applied population genetics.Prerequisites: MS, PhD, or MD/PhD student interested in translational bioinformatics",
    "prereq": []
  },
  {
    "uid": "817397",
    "code": "HINF5450",
    "subject": "HINF",
    "number": "5450",
    "honors": false,
    "writingIntensive": false,
    "name": "Fdns Precision Med Informatics",
    "fullname": "Foundations of Precision Medicine Informatics",
    "info": "The course will provide an introduction into the fundamental concepts of Precision Medicine with a focus on informatics-focused applications for clinical data representation, acquisition, decision making and outcomes evaluation. The student will gain an appreciation of fundamental biomedical data representation and its application to genomic, clinical, and population problems.",
    "prereq": []
  },
  {
    "uid": "007235",
    "code": "HINF5494",
    "subject": "HINF",
    "number": "5494",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Info. Topics",
    "fullname": "Topics in Health Informatics",
    "info": "Topics in health informatics.prereq: Professional student or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "790230",
    "code": "HINF5496",
    "subject": "HINF",
    "number": "5496",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship HINF",
    "fullname": "Internship in Health Informatics",
    "info": "Practical industrial experience not directly related to student's normal academic experience.prereq: HINF student or instr consent",
    "prereq": []
  },
  {
    "uid": "795403",
    "code": "HINF5499",
    "subject": "HINF",
    "number": "5499",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Project",
    "fullname": "Capstone Project for the Masters of Health Informatics",
    "info": "Final opportunity to apply newly acquired knowledge/skills to project involving practical problem in healthinformatics. Submit written project report in lieu of final examination.prereq: second semester MHI student or instr consent",
    "prereq": []
  },
  {
    "uid": "805944",
    "code": "HINF5501",
    "subject": "HINF",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to US Health System Info",
    "fullname": "US Health Care System: Information Challenges in Clinical Care",
    "info": "Health care system/its unique interaction between key health system stakeholders. Relationship between patients, providers, payers, regulatory bodies. Role of information management/challenges of information standardization/exchange.prereq: Junior or senior or professional student or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "810773",
    "code": "HINF5502",
    "subject": "HINF",
    "number": "5502",
    "honors": false,
    "writingIntensive": false,
    "name": "Python Prog Esntls Health Sci",
    "fullname": "Python Programming Essentials for the Health Sciences",
    "info": "Computer programming essentials for health sciences/health care applications using Python 3. Intended for students with limited programming background, or students wishing to obtain proficiency in Python programming language.prereq: Junior or senior or grad student or professional student or instr consent",
    "prereq": []
  },
  {
    "uid": "805945",
    "code": "HINF5510",
    "subject": "HINF",
    "number": "5510",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Health Care Databases",
    "fullname": "Applied Health Care Databases: Database Principles and Data Evaluation",
    "info": "Principles of database theory, modeling, design, and manipulation of databases will be introduced, taught with a healthcare applications emphasis. Students will gain experience using a relational database management system (RDBMS), and database manipulation will be explored using Structured Query Language (SQL) to compose and execute queries. Students will be able to critically evaluate database query methods and results, and understand their implications for health care.prereq: Junior or senior or grad student or professional student or instr consent",
    "prereq": []
  },
  {
    "uid": "805946",
    "code": "HINF5520",
    "subject": "HINF",
    "number": "5520",
    "honors": false,
    "writingIntensive": false,
    "name": "Inf Meth HC Qual Out Pt Safety",
    "fullname": "Informatics Methods for Health Care Quality, Outcomes, and Patient Safety",
    "info": "Application/operation of clinical information systems, electronic health records, decision support/application in health care system. Use of clinical information systems/association with health care delivery, payment, quality, outcomes.prereq: Junior or senior or grad student or professional student or instr consent",
    "prereq": []
  },
  {
    "uid": "805947",
    "code": "HINF5530",
    "subject": "HINF",
    "number": "5530",
    "honors": false,
    "writingIntensive": false,
    "name": "Healthcare Software Management",
    "fullname": "Health Care Software Management",
    "info": "Health care software and unique interaction between key stakeholders in health care software development and implementation. Systems analysis, software development, and software life cycle management for health care applications.prereq: HINF student or instr consent",
    "prereq": []
  },
  {
    "uid": "810772",
    "code": "HINF5531",
    "subject": "HINF",
    "number": "5531",
    "honors": false,
    "writingIntensive": false,
    "name": "Hlth Data Analytics & Data Sci",
    "fullname": "Health Data Analytics and Data Science",
    "info": "Data science methods and techniques for the extraction, preparation, and use of health data in decision making.prereq: Junior or senior or professional student or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "809335",
    "code": "HINF5540",
    "subject": "HINF",
    "number": "5540",
    "honors": false,
    "writingIntensive": false,
    "name": "Interprofessional Health Info.",
    "fullname": "Interprofessional Health Informatics",
    "info": "Informatics applications in various healthcare professions. Clinical specialties. Informatics tools to improve healthcare services/outcomes through lectures/presentations.",
    "prereq": []
  },
  {
    "uid": "817398",
    "code": "HINF5610",
    "subject": "HINF",
    "number": "5610",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Biomedical NLP",
    "fullname": "Foundations of Biomedical Natural Language Processing",
    "info": "The course will provide a systematic introduction to basic knowledge and methods used in natural language processing (NLP) research. It will introduce biomedical NLP tasks and methods as well as their resources and applications in the biomedical domain. The course will also provide hands-on experience with existing NLP tools and systems. Students will gain basic knowledge and skills in handling with main biomedical NLP tasks.Prerequisites graduate student or instructor consent; Experience with at least one programming language (Python or Perl preferred)Recommended: basic understanding of data mining concepts, basic knowledge of computational linguistics ",
    "prereq": []
  },
  {
    "uid": "817405",
    "code": "HINF5620",
    "subject": "HINF",
    "number": "5620",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Visualization Health Sci",
    "fullname": "Data Visualization for the Health Sciences",
    "info": "An advanced health informatics course, focusing on theoretical and practical aspects of data and information visualization for health care and the health sciences. Topics include classic and novel visualization types; models of human visual perception and cognition; color, text and typography; maps and diagrams; evaluation and testing; and the aesthetic and cultural aspects of visualization. Examples emphasize health sciences applications for clinicians, patients, researchers, and analysts. Modern programming and commercial tools are discussed, including D3, ggplot2, and Tableau. Students will report on and discuss visualization methods, published studies and books, culminating in a final visualization project of the student's choosing.",
    "prereq": []
  },
  {
    "uid": "817399",
    "code": "HINF5630",
    "subject": "HINF",
    "number": "5630",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Data Mining",
    "fullname": "Clinical Data Mining",
    "info": "This is a hands-on introductory data mining course specifically focusing on health care applications. Analogously to the relationship between biostatistics and statistics, the data and computational challenges, the experiment design and the model performance requirements towards data mining in the clinical domain differ from those in general applications. This course aims to teach the students the most common data mining techniques and elaborate on the differences between general and clinical data mining. Specifically, the course will focus on (i) clinical data challenges and preprocessing; (ii) survey of the most common techniques in the clinical domain; (iii) clinical application touching up on experimental design and collaborations with physicians. The class will meet twice a week, one day dedicated to lectures and one day to a hands-on lab component, where students are expected to apply the techniques to health-related data. Some of the models will be evaluated with the involvement of a physician collaborator.Prerequisites:Basic linear algebra (matrix notation), basic optimization (gradient descent)Graduate level introductory statistics (e.g. STAT 5101-5102) or equivalent or instructor consent",
    "prereq": [
      {
        "code": "STAT 5101",
        "subject": "STAT",
        "id": "5101"
      },
      {
        "code": "HINF 5102",
        "subject": "HINF",
        "id": "5102"
      }
    ]
  },
  {
    "uid": "817400",
    "code": "HINF5640",
    "subject": "HINF",
    "number": "5640",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Trans Bioinformatics Mthds",
    "fullname": "Advanced Translational Bioinformatics Methods",
    "info": "This course is designed to introduce the high throughput platforms to students who are interested in the genomics research and genomics data analysis in the basic and clinical medical science field. The course covers history of the genomics platforms, its revolution and the specifics of the data generated by all existing different platforms. The course will also introduce all existing sequencing platforms and applications to biological science, as well the current trends in this field.",
    "prereq": []
  },
  {
    "uid": "817401",
    "code": "HINF5650",
    "subject": "HINF",
    "number": "5650",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Genomics",
    "fullname": "Integrative Genomics and Computational Methods",
    "info": "Genome-scale high throughput data sets are a central feature of modern biological research and translational clinical study. Experimental, computational biologists and clinical researchers who want to get the most from their data sets need to have a firm grasp and understanding of genomic data structure characteristics, analytical methodology and the intrinsic connection to integrate. This course is designed to build competence in quantitative methods for the analysis of high-throughput genomic data and data integration.",
    "prereq": []
  },
  {
    "uid": "820341",
    "code": "HINF5660",
    "subject": "HINF",
    "number": "5660",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Causal Discovery",
    "fullname": "Applied Causal Discovery",
    "info": "Which genes cause cancer? Does cholesterol cause heart attacks? Computational causal discovery (especially from observational data) is a recently developed and developing field at the intersection of statistics and machine learning, with numerous and important untapped applications in scientific and medical research. This course provides a foundation for students to go on to apply causal discovery methods to their own data sets. The focus of this course is on developing the students’ ability to identify when and why to use computational causal discovery methods, how to determine what methods are appropriate to use in a given context, and how to interpret and report the results. Students in this course will gain hands-on experience applying causal discovery algorithms, develop an understanding of the computational challenges one faces when using causal discovery algorithms, and learn the best practices for using causal discovery algorithms.",
    "prereq": []
  },
  {
    "uid": "817406",
    "code": "HINF8220",
    "subject": "HINF",
    "number": "8220",
    "honors": false,
    "writingIntensive": false,
    "name": "Computational Causal Analytics",
    "fullname": "Computational Causal Analytics",
    "info": "Identifying causal relationships and mechanisms is the ultimate goal of natural sciences. This course will introduce concepts and techniques underlying computational causal discovery and causal inference utilizing both observational and experimental data. Example applications of the above mentioned techniques in the domain of health sciences include reconstructing the molecular pathways underlying a particular disease, identifying the complex and interacting factors influencing a mental health disorder, and evaluating the potential impact of a public health policy. The course emphasizes both on the theoretical foundations and the practical aspects of causal discovery and causal inference. Students will gain hands-on experience with applying major causal discovery algorithms on simulated and real data.",
    "prereq": []
  },
  {
    "uid": "788124",
    "code": "HINF8333",
    "subject": "HINF",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "007232",
    "code": "HINF8405",
    "subject": "HINF",
    "number": "8405",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Topics/HINF I",
    "fullname": "Advanced Topics in Health Informatics I",
    "info": "Topics may include computer systems design for health sciences, small computer concepts/use, computers for clinical services, computer-aided medical decision making, biomedical image processing, pattern recognition, data mining. Case studies from health sciences.prereq: Professional student or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007233",
    "code": "HINF8406",
    "subject": "HINF",
    "number": "8406",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Topics in Health Inform II",
    "fullname": "Advanced Topics in Health Informatics II",
    "info": "This is a topics course. Topics may include, computational causal discovery for health sciences, computer systems design for health sciences, small computer concepts and use, computers for clinical services, computer-aided medical decision making, biomedical image processing, and pattern recognition. Case studies from health sciences.",
    "prereq": []
  },
  {
    "uid": "817402",
    "code": "HINF8430",
    "subject": "HINF",
    "number": "8430",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndn Health Informatics I Lab",
    "fullname": "Foundations of Health Informatics I Lab",
    "info": "The PhD-level lab complement for introductory survey of health informatics, focusing on foundational concepts. Topics covered include: conceptualizations of data, information, and knowledge; current terminologies, coding, and classification systems for medical information; ethics, privacy, and security; systems analysis, process and data modeling; human-computer interaction and data visualization. Lectures, readings, and exercises highlight the intersections of these topics with electronic health record systems and other health information technology.",
    "prereq": []
  },
  {
    "uid": "817403",
    "code": "HINF8431",
    "subject": "HINF",
    "number": "8431",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndn Health Informatics II Lab",
    "fullname": "Foundations of Health Informatics II Lab",
    "info": "The PhD-level lab complement for an introductory survey of health informatics, focusing on applications of informatics concepts and technologies. Topics covered include: health informatics research, literature, and evaluation; precision medicine; decision models; computerized decision support systems; data mining, natural language processing, social media, rule-based system, and other emerging technologies for supporting 'Big Data' applications; security for health care information handling. Lectures, readings, and exercises highlight the intersections of these topics with current information technology for clinical care and research.",
    "prereq": []
  },
  {
    "uid": "007229",
    "code": "HINF8434",
    "subject": "HINF",
    "number": "8434",
    "honors": false,
    "writingIntensive": false,
    "name": "Med Dec Support",
    "fullname": "Medical Decision Support Techniques",
    "info": "Examines systems based on statistical and logical approaches to decision making that include statistical prediction, rule-based systems, case-based reasoning, quantitative reasoning, and neural networks, and issues related to their use.prereq: 5432 or instr consent",
    "prereq": {
      "code": "HINF 5432",
      "subject": "HINF",
      "id": "5432"
    }
  },
  {
    "uid": "007230",
    "code": "HINF8435",
    "subject": "HINF",
    "number": "8435",
    "honors": false,
    "writingIntensive": false,
    "name": "Sys Analy & O.R.",
    "fullname": "Systems Analysis and Operations Research Methods for Health Services",
    "info": "Models for queuing, inventory, networks, linear programming, and scheduling.",
    "prereq": []
  },
  {
    "uid": "817404",
    "code": "HINF8440",
    "subject": "HINF",
    "number": "8440",
    "honors": false,
    "writingIntensive": false,
    "name": "Translation Bioinformatics Lab",
    "fullname": "Foundations of Translational Bioinformatics Lab",
    "info": "Translational bioinformatics deals with the assaying, computational analysis and knowledge-based interpretation of complex molecular data to better understand, prevent, diagnose and treat disease. This course emphasizes deep DNA sequencing methods that have persistent impact on research related to disease diagnosis and treatment. The course covers sequence analysis, applications to genome sequences, and sequence-function analysis, analysis of modern genomic data, sequence analysis for gene expression/functional genomics analysis, and gene mapping/applied population genetics.Prerequisites: MS, PhD, or MD/PhD student interested in translational bioinformatics",
    "prereq": []
  },
  {
    "uid": "788359",
    "code": "HINF8444",
    "subject": "HINF",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "007231",
    "code": "HINF8446",
    "subject": "HINF",
    "number": "8446",
    "honors": false,
    "writingIntensive": false,
    "name": "Prof Stud. in HI",
    "fullname": "Professional Studies in Health Informatics",
    "info": "Health informatics as a profession, including discipline, responsibilities, resources, and job opportunities.  Directed experiences in consulting, teaching, writing, conducting research, and managing facilities.prereq: 5431, PubH 5452 or instr consent, grad hlth inf major",
    "prereq": {
      "and": [
        {
          "code": "HINF 5431",
          "subject": "HINF",
          "id": "5431"
        },
        {
          "code": "PUBH 5452",
          "subject": "PUBH",
          "id": "5452"
        }
      ]
    }
  },
  {
    "uid": "007236",
    "code": "HINF8492",
    "subject": "HINF",
    "number": "8492",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Readings / Research HI",
    "fullname": "Advanced Readings or Research in Health Informatics",
    "info": "Directed readings or research in topics of current or theoretical interest in health informatics.prereq: HINF student or instr consent",
    "prereq": []
  },
  {
    "uid": "007237",
    "code": "HINF8494",
    "subject": "HINF",
    "number": "8494",
    "honors": false,
    "writingIntensive": false,
    "name": "Research/ HI",
    "fullname": "Research in Health Informatics",
    "info": "Directed research under faculty guidance.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "805937",
    "code": "HINF8525",
    "subject": "HINF",
    "number": "8525",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Informatics Teaching",
    "fullname": "Health Informatics Teaching",
    "info": "Use selected teaching techniques to assist in the delivery of course content in health informatics curriculum. Work with a professor who is the course director. From evaluation and feedback on their teaching technique, students develop a teaching philosophy as a final course project.prereq: HINF student or instr consentprereq: HINF student or instr consent",
    "prereq": []
  },
  {
    "uid": "805938",
    "code": "HINF8535",
    "subject": "HINF",
    "number": "8535",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv HINF Research Methods",
    "fullname": "Advanced Health Informatics Research Methods",
    "info": "Application of research methods, evaluation. Design, data collection, and data analysis in the context of health informatics, including computational and health data challenges.prereq: HINF student or instr consent",
    "prereq": []
  },
  {
    "uid": "788483",
    "code": "HINF8666",
    "subject": "HINF",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "015445",
    "code": "HINF8770",
    "subject": "HINF",
    "number": "8770",
    "honors": false,
    "writingIntensive": false,
    "name": "Plan B Project",
    "fullname": "Plan B Project",
    "info": "Research project. Topic arranged between student/instructor. Written report required.prereq: Advanced plan B MS student",
    "prereq": []
  },
  {
    "uid": "788609",
    "code": "HINF8777",
    "subject": "HINF",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "787878",
    "code": "HINF8888",
    "subject": "HINF",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit: Doctoral",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: PhD candidate or department consent.Max 18 credits per semester; 24 credits required",
    "prereq": []
  }
]