[
  {
    "uid": "004270",
    "code": "HMED3001W",
    "subject": "HMED",
    "number": "3001",
    "honors": false,
    "writingIntensive": true,
    "name": "Health, Disease, and Healing",
    "fullname": "Health, Disease, and Healing I",
    "info": "Introduction to intellectual/social history of European/American medicine, health care from classical antiquity through 18th century.",
    "prereq": []
  },
  {
    "uid": "004391",
    "code": "HMED3002W",
    "subject": "HMED",
    "number": "3002",
    "honors": false,
    "writingIntensive": true,
    "name": "Health Care in History II",
    "fullname": "Health Care in History II",
    "info": "The course explores the history of medicine from the early 1800s through the present day. Topics covered include the history of public health, germ theory, medical technology, surgery, empire and medicine, health insurance, and mind-body medicine. Hands-on work at the Wangensteen Historical Library will also enrich our understanding of diseases as more than objective biological entities. Special attention is paid to the ways culture, race, and economy have shaped the history of healthcare over time.",
    "prereq": []
  },
  {
    "uid": "818781",
    "code": "HMED3035",
    "subject": "HMED",
    "number": "3035",
    "honors": false,
    "writingIntensive": false,
    "name": "Sex and Gender in US Medicine",
    "fullname": "Sex and Gender in US Medicine: Queering the Medical Model",
    "info": "Queering the Medical Model addresses homosexual, transgender, and intersex history of medicine in the United States from 1800 to the present along three intersecting themes. First, the course charts scientific constructs of sex, sexuality, and gender from the 19th to the 20th centuries.  Second, it explores how sex and gender became entangled with the so-called medical model, from the role of medical jurisprudence in leveraging a two-sex system for legal claims, sex and sexual disorder research in the early 20th century, the development of hormonal and surgical technologies to manipulate gender morphology in the later 20th century, and the impact of the medical model on medical access historically and in the present.  Finally, it identifies how queer and gender non-conforming people resisted, dodged, and mobilized changing scientific constructs, medical possibilities, and social opportunities.  This course combines lectures, discussions, and guided engagement with historical materials from several archival holdings, alongside with relevant readings from history and other disciplines.",
    "prereq": []
  },
  {
    "uid": "794922",
    "code": "HMED3040",
    "subject": "HMED",
    "number": "3040",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Health & Envir. in Hist.",
    "fullname": "Human Health, Disease, and the Environment in History",
    "info": "Introduction to historical relationship of human health and the environment. How natural/human-induced environmental changes have, over time, altered our experiences with disease and our prospects for health. ",
    "prereq": []
  },
  {
    "uid": "788650",
    "code": "HMED3055",
    "subject": "HMED",
    "number": "3055",
    "honors": false,
    "writingIntensive": false,
    "name": "Women, Health, and History",
    "fullname": "Women, Health, and History",
    "info": "Women's historical roles as healers, patients, research subjects, health activists. Biological determinism, reproduction, mental health, nursing, women physicians, public health reformers, alternative practitioners. Gender disparities in diagnosis, treatment, research, careers. Assignments allow students to explore individual interests.",
    "prereq": []
  },
  {
    "uid": "797532",
    "code": "HMED3065",
    "subject": "HMED",
    "number": "3065",
    "honors": false,
    "writingIntensive": false,
    "name": "Body, Soul, Spirit in Medieval",
    "fullname": "Body, Soul, and Spirit in Medieval and Renaissance European Medicine",
    "info": "Body/soul in medieval theology/cosmology. Religious conceptions of body/soul. Medical conceptions in medieval world. Medieval/renaissance psychology. Medical astrology and its consequences. Medical normal/abnormal body. Medicine of reproduction and sexual identity. Death, burial, dissection, and resurrection in medical/religious perspective. Macrocosmic/microcosmic body. Limits to human power/authority over body. Anatomical/chemical body/spirit.",
    "prereq": []
  },
  {
    "uid": "803459",
    "code": "HMED3075",
    "subject": "HMED",
    "number": "3075",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology & Med in Mod Amer",
    "fullname": "Technology and Medicine in Modern America",
    "info": "How technology came to medicine's center-stage. Impact on production of medical knowledge, professionalization, development of institutions/industry, health policy, and gender/race disparities in health care.",
    "prereq": []
  },
  {
    "uid": "820189",
    "code": "HMED3315",
    "subject": "HMED",
    "number": "3315",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Mod Medicine Arts & Lit",
    "fullname": "Early Modern Medicine in the Arts and Literature",
    "info": "What did the arts offer to medicine, and what did medicine offer to the arts in early modern time? How did the representation of the human being in poetry, drama, and figurative arts interplay with the new medical culture and practices at that time? This course will examine the dynamic interchange and engagement of Western Renaissance medical culture (before 1800) in relation to literary, visual and performing arts, approaching questions that cross disciplinary, geographical, and social boundaries.  Topics to be addressed include historical questions related to the intersection between the late European medieval university’s programs of medicine and arts, humanistic culture, and medical charlatanism. Moreover, we will focus on the ephemeral rituals of medical and performative practices and the visual culture in works of art and scientific illustrated treatises of life, death, and the afterlife. Finally, we will explore the embodiments in poetry and drama of illness and metaphor, gender conflicts, and medical, spiritual, and philosophical views of what it meant to be human. By exploring the value of humanistic study and medical ethical concerns in Renaissance humanism, students will understand the historical sources of a modern humanistic formation and be informed about the importance of ethics to citizenship, reconsidering the present vision of a humanistic education and imagining the future in the academic humanities and in our society. The course will culminate in a digital project involving students in the creation of a virtual exhibit on the course topics, by using the New Builder StoryMaps software proposed by DASH/U-Spatial. This is an introductory-level course.  ",
    "prereq": []
  },
  {
    "uid": "826280",
    "code": "HMED3325",
    "subject": "HMED",
    "number": "3325",
    "honors": false,
    "writingIntensive": false,
    "name": "Data, Death and Doctors",
    "fullname": "Data, Death and Doctors: Hands-on Historical Health Research",
    "info": "HMED 3325 is an applied introduction to historical medical demography: the study of who is sick or injured, and the type of treatments given, and what happens after treatment. The records created by health care workers give us important insights into how medical practice has changed over time, making the quantitative study of historical medical records central to the History of Medicine. We often ask two fundamental questions when examining medical records: “how bad is it?” and “what works?” In other words, what are the consequences of illness or injury, and how effective are medical interventions? These are questions that continue to be asked today in contemporary health and medicine, so the analytical techniques you learn in this class can be applied to modern data. Unlike modern health records whose access is restricted to protect people’s privacy, surviving historical health records can be used quite easily. This course will give you a hands-on experience in working with health data and researching the history of medicine. You will learn about different ways to collect and analyze data to effectively answer questions such as “what happened to people who were sick” and “did medical care help people?”—this is often called “causal inference”.  To do this effectively with historical medical records, we will read about how people in the past understood the illness or intervention we are studying. Understanding changes in the way people thought about illness and disease is another core part of the History of Medicine. To make sense of data, we need to know about how the people creating it understood the concepts they were measuring. This principle applies equally to modern data: effective data analysis requires us to understand what the numbers mean.The class is structured to give you an overview of the research process from data collection to initial analyses. Working as a class we will collect a sample of historical health records from the University of Minnesota or Minnesota Historical Society archives giving you hands-on experience with archival research and designing social science databases. Through your readings for class and initial data exploration you will develop a research proposal, and then complete a small research project using the data we collected. At the completion of the course, you will have gained valuable experience in social science data analysis with real data and learned about how approaches to health, healing, and medicine have changed over time.",
    "prereq": []
  },
  {
    "uid": "826513",
    "code": "HMED3345",
    "subject": "HMED",
    "number": "3345",
    "honors": false,
    "writingIntensive": false,
    "name": "Med/Health/Diseases East Asia",
    "fullname": "Medicine, Health, and Diseases in East Asia",
    "info": "This course explores the history of medicine in East Asia from the ancient period to the present day. From the globalization of acupuncture practices to the fight against the deadly SARS and COVID viruses, East and Southeast Asians in their homelands and abroad have sought to develop, transform, and disseminate their ways of healing.We will critically examine classical Chinese medicine's persistence, transformation, and globalization in the region and beyond. Other topics covered include the role of Western medicine in East Asia, the contestation over vaccination and pharmaceuticals, the role of colonialism in shaping medical practices, and the imaginations of Asian medicine in the United States.",
    "prereq": []
  },
  {
    "uid": "819038",
    "code": "HMED3940",
    "subject": "HMED",
    "number": "3940",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in History of Medicine",
    "fullname": "Topics in History of Medicine",
    "info": "Selected history of medicine topics not covered in regular courses.",
    "prereq": []
  },
  {
    "uid": "801948",
    "code": "HMED3993",
    "subject": "HMED",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.",
    "prereq": []
  },
  {
    "uid": "806334",
    "code": "HMED4965W",
    "subject": "HMED",
    "number": "4965",
    "honors": false,
    "writingIntensive": true,
    "name": "Sr Research in Medical History",
    "fullname": "Senior Research in Medical History",
    "info": "Seminar. Reading/discussion, individual directed research project with oral presentation. Students meet in peer groups and with instructor.prereq: Sr, instr consent",
    "prereq": []
  },
  {
    "uid": "008040",
    "code": "HMED5002",
    "subject": "HMED",
    "number": "5002",
    "honors": false,
    "writingIntensive": false,
    "name": "Pub Health Issues Hist Persp",
    "fullname": "Public Health Issues in Historical Perspective",
    "info": "Introduction to the evolution of major recurring problems and issues in public health including environment and health, food customs and nutrition, control of alcohol and drugs, venereal diseases and public policy, human resources regulation, and relationship of science to promotion of health.",
    "prereq": []
  },
  {
    "uid": "008065",
    "code": "HMED5035",
    "subject": "HMED",
    "number": "5035",
    "honors": false,
    "writingIntensive": false,
    "name": "Germ Theory/Modern Medicine",
    "fullname": "The Germ Theory and Modern Medicine",
    "info": "Analysis of the formulation of the germ theory of disease and of its consequences for medical procedures (therapeutics, surgery, management of hospitals), public health programs, and the structure and prestige of the medical profession.",
    "prereq": []
  },
  {
    "uid": "007192",
    "code": "HMED5045",
    "subject": "HMED",
    "number": "5045",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Medical Profession",
    "fullname": "Modern Medical Profession",
    "info": "Historical analysis of American medical profession in 19th/20th centuries. Role of institutions, influence of social/moral values. Consequences of specialization, scientific innovation.",
    "prereq": []
  },
  {
    "uid": "788651",
    "code": "HMED5055",
    "subject": "HMED",
    "number": "5055",
    "honors": false,
    "writingIntensive": false,
    "name": "Women, Health, and History",
    "fullname": "Women, Health, and History",
    "info": "Women's historical roles as healers, patients, research subjects, health activists. Biological determinism, reproduction, mental health, nursing, women physicians, public health reformers, alternative practitioners. Gender disparities in diagnosis, treatment, research, careers. Assignments allow students to explore individual interests.prereq: Grad student or [jr or sr] with prev coursework in hist or instr consent",
    "prereq": []
  },
  {
    "uid": "802977",
    "code": "HMED5075",
    "subject": "HMED",
    "number": "5075",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology & Med in Mod Amer",
    "fullname": "Technology and Medicine in Modern America",
    "info": "How technology came to medicine?s center-stage. Impact on medical practice, institutions, consumers, production of medical knowledge, professionalization, health policy, gender/race disparities in health care.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "004363",
    "code": "HMED5200",
    "subject": "HMED",
    "number": "5200",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Hist of Medicine to 1700",
    "fullname": "Early History of Medicine to 1700",
    "info": "An introductory survey of the history of medicine in Europe and America.",
    "prereq": []
  },
  {
    "uid": "004370",
    "code": "HMED5201",
    "subject": "HMED",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of Medicine 1700 to 1900",
    "fullname": "History of Medicine from 1700 to 1900",
    "info": "An introductory survey of the history of medicine in Europe and America.prereq: 5200",
    "prereq": {
      "code": "HMED 5200",
      "subject": "HMED",
      "id": "5200"
    }
  },
  {
    "uid": "004417",
    "code": "HMED5210",
    "subject": "HMED",
    "number": "5210",
    "honors": false,
    "writingIntensive": false,
    "name": "Theory/Method in Medical Hist",
    "fullname": "Seminar: Theories and Methods in Medical History",
    "info": "Historiography of the history of medicine.",
    "prereq": []
  },
  {
    "uid": "004422",
    "code": "HMED5211",
    "subject": "HMED",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "Theory/Method in Medical Hist",
    "fullname": "Seminar: Theories and Methods in Medical History",
    "info": "Use of archives, primary sources. Supervised research project.prereq: 5210",
    "prereq": {
      "code": "HMED 5210",
      "subject": "HMED",
      "id": "5210"
    }
  },
  {
    "uid": "801949",
    "code": "HMED5600",
    "subject": "HMED",
    "number": "5600",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed Studyprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "008039",
    "code": "HMED5940",
    "subject": "HMED",
    "number": "5940",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: History of Medicine",
    "fullname": "Topics in the History of Medicine",
    "info": "Selected history of medicine topics not covered in regular courses.",
    "prereq": []
  },
  {
    "uid": "016828",
    "code": "HMED7500",
    "subject": "HMED",
    "number": "7500",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist Research for Med Stud",
    "fullname": "Historical Research for Medical Students",
    "info": "This course is designed to acquaint third and fourth year medical students with the sources and the methods of historical research in medical topics and to allow them to undertake a short research project on a topic which they help design.",
    "prereq": []
  },
  {
    "uid": "803745",
    "code": "HMED8001",
    "subject": "HMED",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Medicine",
    "fullname": "Foundations in the History of Early Medicine",
    "info": "History of Western medicine, from professionalization of healing in Greco-Egyptian antiquity to association of postmortem pathology with disease and clinical movement of early 19th-century Paris.",
    "prereq": []
  },
  {
    "uid": "806947",
    "code": "HMED8002",
    "subject": "HMED",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Modern Medicine",
    "fullname": "Foundations in the History of Modern Medicine, 1800-present",
    "info": "This seminar explores the history of modern medicine from the early 1800s through the present day. Topics covered include the history of public health, germ theory, medical technology, empire and medicine, health insurance, alternative medicine, and mind-body medicine. Historiographical and research methods will be emphasized. Special attention is also paid to the ways culture, race, geography, and economy have shaped the history of medicine over time. ",
    "prereq": []
  },
  {
    "uid": "799081",
    "code": "HMED8112",
    "subject": "HMED",
    "number": "8112",
    "honors": false,
    "writingIntensive": false,
    "name": "Historiography",
    "fullname": "Historiography of Science, Technology, and Medicine",
    "info": "Models of practice, different schools. Work of representative historians of science, technology, and medicine.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "800043",
    "code": "HMED8113",
    "subject": "HMED",
    "number": "8113",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Methods",
    "fullname": "Research Methods in the History of Science, Technology, and Medicine",
    "info": "Introduction to sources, methods, and problems of research in history of science, technology, and medicine. Preparation of major research paper under faculty supervision.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "819593",
    "code": "HMED8135",
    "subject": "HMED",
    "number": "8135",
    "honors": false,
    "writingIntensive": false,
    "name": "Disease and Debility",
    "fullname": "Disease and Debility in History",
    "info": "In this graduate seminar we will examine how concepts of disease and health have changed over time and across place. We’ll move from debates over the identity of the Black Death in 14th century Europe to the treatment of infectious diseases in Imperial China and colonial India, and to the contested diagnoses of AIDS and fetal alcohol syndrome in late 20th century United States. Along the way we’ll evaluate the different methodological approaches used by scholars to study the history of disease, and we’ll examine the ways in which social values, cultural assumptions, and political interests have shaped how diseases have been defined, experienced, and treated, and we’ll consider the role that diseases have played in the shaping of health care institutions, policies, and practices. At the same time, we’ll examine the processes of medicalization and demedicalization; colonialism, post-colonialism, and the politics of state-building; the ecological understandings of disease, environmentalism, and the politics of place; and the increasingly visible role of the politicized consumer and patient activist in late 20th century health care politics.",
    "prereq": []
  },
  {
    "uid": "794483",
    "code": "HMED8220",
    "subject": "HMED",
    "number": "8220",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Topics History of Med",
    "fullname": "Seminar: Current Topics in the History of Medicine",
    "info": "Topics vary.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "788126",
    "code": "HMED8333",
    "subject": "HMED",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788361",
    "code": "HMED8444",
    "subject": "HMED",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "010147",
    "code": "HMED8631",
    "subject": "HMED",
    "number": "8631",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "tbdprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "010148",
    "code": "HMED8632",
    "subject": "HMED",
    "number": "8632",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "tbdprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "788485",
    "code": "HMED8666",
    "subject": "HMED",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbdprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "788611",
    "code": "HMED8777",
    "subject": "HMED",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "802193",
    "code": "HMED8830",
    "subject": "HMED",
    "number": "8830",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in HSciTechMed",
    "fullname": "Topics in the History of Science, Technology, and Medicine",
    "info": "Historical literature of topics common to history of science, technology, and medicine.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "787880",
    "code": "HMED8888",
    "subject": "HMED",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  }
]