[
  {
    "uid": "825813",
    "code": "HSEX4950",
    "subject": "HSEX",
    "number": "4950",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Sexuality and Sex Ed",
    "fullname": "Topics in Sexuality and Sex Education",
    "info": "Topics in Sexuality and Sex Education",
    "prereq": []
  },
  {
    "uid": "817470",
    "code": "HSEX6001",
    "subject": "HSEX",
    "number": "6001",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of Human Sexuality",
    "fullname": "Foundations of Human Sexuality",
    "info": "Foundations of Human Sexuality covers introductory topics in sexual and gender health, including professional ethics; anatomy and physiology; sexuality across the lifespan; the impact of culture and history; faith/religious traditions; sex, technology, and media; and sexuality and the law. Using readings, discussion forums, peer review, and an applied final project, students will explore the complex biopsycho sociocultural interactions that impact human sexuality.",
    "prereq": []
  },
  {
    "uid": "817471",
    "code": "HSEX6011",
    "subject": "HSEX",
    "number": "6011",
    "honors": false,
    "writingIntensive": false,
    "name": "Law, Policy on Human Sexuality",
    "fullname": "Impacts of Law, Policy, and Government Regulation on Human Sexuality",
    "info": "This course will introduce students to United States government processes that impact human sexuality across human life stages. Students will learn the differences between and processes for creating and changing law, public policy, and administrative regulation. Select international policies and laws may be examined in comparison to U.S. systems. In tandem with law and policymaking tools, students will learn the content and impact of current government actions and restrictions on gender and sexuality. The substantive law and policy topics covered include sex education, pregnancy and parenting, and gender-affirming care for young people; sexual behavior, criminalization, and consent; healthcare including abortion care; non-discrimination protections in employment and education; and issues faced by older adults. Students will illustrate their understanding of U.S. law and policy tools and content by producing a self-directed final project on the topic of their choosing. ",
    "prereq": []
  },
  {
    "uid": "817473",
    "code": "HSEX6013",
    "subject": "HSEX",
    "number": "6013",
    "honors": false,
    "writingIntensive": false,
    "name": "Sexual Health Education",
    "fullname": "Perspectives and Practices in Sexual Health Education",
    "info": "This course covers the history of sexuality education, primarily in the US with international comparison, as well as current and emerging issues in sexual health education. Using readings, discussion forums, peer review, and an applied final project, students will understand the temporal changes in sexual health education in the US and abroad and the empirical, theoretical, and educational foundations of sexual health education.",
    "prereq": []
  },
  {
    "uid": "825477",
    "code": "HSEX6015",
    "subject": "HSEX",
    "number": "6015",
    "honors": false,
    "writingIntensive": false,
    "name": "Sexual Pleasure & Intimacy",
    "fullname": "Sexual Pleasure & Intimacy",
    "info": "This course will provide information on sexual intimacy, pleasure, and sexual well-being. It will explore the theoretical understandings of pleasure, and the historical and cultural considerations in understanding sexual pleasure and intimacy. This course will also cover emerging issues as they pertain to intimacy, pleasure, and sexual well-being. This course will utilize readings, discussion forums, and an applied final project to foster students’ theoretical, empirical, and sociocultural understanding of sexual intimacy, pleasure, and well-being.",
    "prereq": []
  },
  {
    "uid": "826821",
    "code": "HSEX6016",
    "subject": "HSEX",
    "number": "6016",
    "honors": false,
    "writingIntensive": false,
    "name": "Compulsive Sexual Behavior",
    "fullname": "Compulsive Sexual Behavior",
    "info": "This course provides information on compulsive sexual behavior (CSB), or what is commonly referred to as \"sex addiction.\" Through readings, discussion, and media provided, the course emphasizes scholarly work in CSB. Students will identify symptoms, contributing factors, co-occurring disorders, and sexual health correlates of CSB. Students will also be introduced to leading treatment models in CSB.",
    "prereq": []
  },
  {
    "uid": "817472",
    "code": "HSEX6211",
    "subject": "HSEX",
    "number": "6211",
    "honors": false,
    "writingIntensive": false,
    "name": "Sexual Functioning",
    "fullname": "Dimensions of Sexual Functioning",
    "info": "This course covers various aspects of sexual function and dysfunction as well as an in-depth overview of sexual health as it pertains to the general public. Using readings, discussion forums, peer review, and an applied final project, students will understand the range of sexual responses people may experience, diagnostic categories of sexual functioning, and the range of therapies available.",
    "prereq": []
  },
  {
    "uid": "825480",
    "code": "HSEX6212",
    "subject": "HSEX",
    "number": "6212",
    "honors": false,
    "writingIntensive": false,
    "name": "Sex and Relationship Therapy",
    "fullname": "Sex and Relationship Therapy",
    "info": "This course will focus on the fundamentals and clinical application of sex therapy for couples and individuals. Course materials will address assessment, diagnosis, and treatment of the broad spectrum of sexual health concerns. In addition, it will address theories of practice, and implications for special populations, with emphasis on biopsychosocial dimensions of health.",
    "prereq": []
  },
  {
    "uid": "825478",
    "code": "HSEX6213",
    "subject": "HSEX",
    "number": "6213",
    "honors": false,
    "writingIntensive": false,
    "name": "Sexual Trauma",
    "fullname": "Sexual Trauma and Trauma Informed Care",
    "info": "This course will provide information on sexual trauma, including theoretical understandings of sexual trauma, historical and cultural considerations in understanding sexual trauma, psychological, sociological, and cultural effects of sexual trauma, and considerations in treating sexual trauma. This course will also cover emerging issues as they pertain to sexual trauma. This course will utilize readings, discussion forums, and an applied final project to foster students’ theoretical, empirical, and sociocultural understanding of sexual trauma. ",
    "prereq": []
  },
  {
    "uid": "819939",
    "code": "HSEX6311",
    "subject": "HSEX",
    "number": "6311",
    "honors": false,
    "writingIntensive": false,
    "name": "Health for Trans Adults",
    "fullname": "Introduction to Healthcare for Transgender and Gender Diverse Adults",
    "info": "Introduction to Healthcare for Transgender and Gender Diverse Adults seeks to define trans healthcare through a historical, analytical, and and concern-based curriculum. The first half of the course will explore the components of sexual identity through an intersectional lens, the systemic marginalization of gender-diverse populations, and the historical pathologization of non-conforming sexual identities in the history of healthcare. The second half of this course seeks to define trans healthcare through a tripartite lens of care preceding and during transition, care for non-conforming people, and healthcare for trans concerns before analyzing the historicity of the World Professional Association for Transgender Health (WPATH) standards of care and relevant ongoing care for gender-diverse patients. Students will engage in a discussion-rich curriculum that focuses on destabilizing of race, class, and gender-centric assumptions surriounding the topics of gender identity, sexual orientation, birth-assigned sex, and gender expression. They will also complete a number of case studies to critically engage with topics such as broader trans representation, non-binary healthcare options, historical advances in trans health, and reproductive justice for trans communities. The course will culminate in a student-directed final project that asks them to reflect on how they might apply this knowledge to their specific career trajectory.",
    "prereq": []
  },
  {
    "uid": "825827",
    "code": "HSEX6312",
    "subject": "HSEX",
    "number": "6312",
    "honors": false,
    "writingIntensive": false,
    "name": "Intersectional Trans Health",
    "fullname": "Intersectional and Decolonizing Approaches to Transgender Health",
    "info": "This foundational course seeks to provide the groundwork for understanding intersectional and decolonizing pedagogy and theory and application to transgender health. Theories will also focus on examining historical, analytical, and community-informed factors that influence access to care. This course explores the components of identity development through an intersectional lens, systemic marginalization of gender-diverse populations, and historical pathologization of diverse gender and sexual identities in healthcare. Students will be exposed to discourse that focuses on destabilizing biases and western assumptions surrounding the topics of gender identity, sexual orientation, sex assigned at birth, and gender expression. Overall, this course aims to prepare students to engage in reflexive thinking about systems-level interventions in transgender health.",
    "prereq": []
  },
  {
    "uid": "825828",
    "code": "HSEX6313",
    "subject": "HSEX",
    "number": "6313",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender Diversity&Sexual Health",
    "fullname": "Gender Diversity, Sexuality, & Sexual Health",
    "info": "This course seeks to introduce the core conceptual and theoretical approaches to applied sexual health care. The first portion of the course will provide an overview of the components of sexual identity, including gender identity, sex assigned at birth, sexual orientation, and gender expression. The second portion of the course will introduce the theoretical and empirical literature within public health, epidemiology, sex therapy, and sexology fields regarding sexual health issues with TGD communities. The course will provide deeper exploration of these broader introductory topics from a sex positive and pleasure oriented framework including medical and relational impacts of medical transition, sex therapy interventions, gender euphoria and gender dysphoria, and gender embodiment. Students will complete a number of case studies to critically engage and apply learnings from the course as well as be exposed to empirical and conceptual readings from an interdisciplinary gender affirming perspective. The course will culminate in a student-directed final project that asks them to reflect on how they might apply this knowledge to their specific career trajectory.",
    "prereq": []
  },
  {
    "uid": "825829",
    "code": "HSEX6314",
    "subject": "HSEX",
    "number": "6314",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender Diverse Children Adoles",
    "fullname": "Considerations in the Care of Transgender and Gender Diverse Children and Adolescents",
    "info": "This course will review considerations for the care of transgender and gender-diverse children and adolescents. As a foundation of this course, we will emphasize well-balanced, nuanced, and thoughtful approaches to the available research, clinical knowledge, and dilemmas in the field. This course will cover the historical context and evolution of gender-affirming care over time, behavioral/mental/medical healthcare, health disparities, strengths and resilience, emerging issues and controversies, and current sociopolitical climate as it pertains to care for trans and gender-diverse children and adolescents. This course will utilize readings, youth-centered resources, discussion forums, and an applied final project to foster students’ theoretical, empirical, and sociocultural understanding of the care needs of trans and gender-diverse children and adolescents.",
    "prereq": []
  },
  {
    "uid": "825697",
    "code": "HSEX6950",
    "subject": "HSEX",
    "number": "6950",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Sexual Gender Health",
    "fullname": "Topics in Sexual and Gender Health",
    "info": "Topics in Sexual and Gender Health",
    "prereq": []
  },
  {
    "uid": "825692",
    "code": "HSEX6993",
    "subject": "HSEX",
    "number": "6993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies in Sexual Health",
    "info": "Directed Studies in Sexual Health.",
    "prereq": []
  },
  {
    "uid": "825693",
    "code": "HSEX6994",
    "subject": "HSEX",
    "number": "6994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research in Sexual Health",
    "info": "Directed Research in Sexual Health",
    "prereq": []
  }
]