[
  {
    "uid": "791347",
    "code": "HSM3040",
    "subject": "HSM",
    "number": "3040",
    "honors": false,
    "writingIntensive": false,
    "name": "Dying & Death in Society",
    "fullname": "Dying and Death in Contemporary Society: Implications for Intervention",
    "info": "This course provides basic background information on concepts, attitudes, ethics, and lifestyle management related to dying, death, grief, and bereavement. The emphasis is on preparing teachers, community health professionals, and other helping professionals for educational activities in this area. Prerequisite:  sophomore",
    "prereq": []
  },
  {
    "uid": "818138",
    "code": "HSM3051",
    "subject": "HSM",
    "number": "3051",
    "honors": false,
    "writingIntensive": false,
    "name": "Career & Intrnshp Skills-HSM",
    "fullname": "Career and Internship Skills in Health Services Management",
    "info": "This course is a requirement in the Bachelor of Applied Science major in Health Services Management. It can also be an elective for HSM minor and certificate students, with adviser permission. Its overall goal is to enable students to apply concepts and skills gained in the Health Services Management program and contribute their knowledge of best practices to make a positive impact on the health services management workplace and industry. To successfully complete this class, students will create a career interest statement, resume, cover letter, and LinkedIn profile.They will also apply to at least one health services-related internship or work position, participate in networking opportunities, and create an action plan to successfully obtain an HSM internship and enroll in HSM 4596. Prerequisites: HSM major or premajor; WRIT 1301 or 1401 or equivalent; HSM 3521; HSM 4561.",
    "prereq": {
      "or": [
        {
          "code": "WRIT 1301",
          "subject": "WRIT",
          "id": "1301"
        },
        {
          "code": "HSM 1401",
          "subject": "HSM",
          "id": "1401"
        },
        {
          "code": "HSM 3521",
          "subject": "HSM",
          "id": "3521"
        },
        {
          "code": "HSM 4561",
          "subject": "HSM",
          "id": "4561"
        }
      ]
    }
  },
  {
    "uid": "825444",
    "code": "HSM3101",
    "subject": "HSM",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Health Economics",
    "fullname": "Applied Health Economics",
    "info": "Provides a pragmatic, applied understanding of health economics with the specific aim of increasing the effectiveness of management in the health care industry. As effective management requires understanding and application of the economic incentives and choices of the various agents in that industry, this course reviews the health economic principles that drive the behavior of providers, insurers, and patients. It provides an overview of the structure of the hospital, provider, and pharmaceutical and medical device industries and their responses to economic forces given the incentives faced by the various economic agents--patients, providers, payers, and health care manufacturers (i.e., the pharmaceutical and medical device industries). This includes both an examination of private and government insurers and the ways health system actions are influenced by the policies of private and government insurance. Health equity is an issue that applies broadly in the health care industry, and as such, it has implications for its management. Similarly, health care management must prepare for the potential impact of health care reform on the health care industry so that it is positioned to thrive in a dynamic environment. Accordingly, this course reviews various reform approaches and their implications for the health care industry.Prerequisites: None, but successful completion of a course in introductory microeconomics is strongly recommended.",
    "prereq": []
  },
  {
    "uid": "820123",
    "code": "HSM3350",
    "subject": "HSM",
    "number": "3350",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Health Services Mgmt",
    "fullname": "Special Topics in Health Services Management",
    "info": "Timely issues and themes in health services management.",
    "prereq": []
  },
  {
    "uid": "795485",
    "code": "HSM3501",
    "subject": "HSM",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Clin Rsch Concepts & Practice",
    "fullname": "Clinical Research Concepts and Practice",
    "info": "Research processes. Focuses on health science applications. Statistics (descriptive, inferential). Research study design, problem statement and protocol development, hypothesis development, feasibility, sampling methods/nstruments, data management, data analysis/interpretation, dissemination of research.",
    "prereq": []
  },
  {
    "uid": "795486",
    "code": "HSM3521",
    "subject": "HSM",
    "number": "3521",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Care Delivery Systems",
    "fullname": "Health Care Delivery Systems",
    "info": "Health care (HC) delivery systems, health economics, third-party/public reimbursement, current trends in HC organizations/management/administration. Regulations, standards, quality assurance, accreditation, current ethical issues. Implications for HC providers/professionals, patients/families, communities, international health.prereq: 30 cr",
    "prereq": []
  },
  {
    "uid": "825247",
    "code": "HSM3621",
    "subject": "HSM",
    "number": "3621",
    "honors": false,
    "writingIntensive": false,
    "name": "Hlth Care Ldrship in a Crisis",
    "fullname": "Health Care Leadership in a Crisis",
    "info": "Developing and activating an emergency management plan during a health care crisis takes leadership and management expertise. It's often said, \"Leaders are identified in times of crisis.\" You will learn how to execute many important crisis leadership actions: Detect issues before they reach an emergency level. Apply strategic thinking and decision-making skills in crisis situations through a well-organized, executable plan. Mitigate the safety, financial, and operational effects of a health care emergency. Find opportunities amid the crisis to improve the organization and prevent future crises. Throughout the course, you will hear from experts on how they have led internal and external stakeholders through a crisis, including COVID-19. Prerequisites: None.",
    "prereq": []
  },
  {
    "uid": "819004",
    "code": "HSM4041",
    "subject": "HSM",
    "number": "4041",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership in Health Srvs Mgmt",
    "fullname": "Leadership in Health Services Management",
    "info": "Learning about health care leadership will occur in three ways: exploration of foundational leadership theory with strategies, values, characteristics, and styles (the context);  analysis of personal perspectives and beliefs about leadership (interpretation of the context); and examination of evolving health care industry trends. The course will assist students in understanding the most serious challenges facing the health care services market, presenting ways to address these challenges through emerging best practices and tapping existing relevant theories of leadership in health care.  Each student will learn about their personal leadership style, and emphasis will be placed on self-awareness, critical thinking skills, culture development, and management of conflict. Case studies will be used to explore up-to-date examples concerning the external environment leaders face as they attempt to deal with what seems like daily change in their redesigned health care organizations. It is a hybrid course with live lectures, group projects, and leadership simulation. ",
    "prereq": []
  },
  {
    "uid": "818137",
    "code": "HSM4043",
    "subject": "HSM",
    "number": "4043",
    "honors": false,
    "writingIntensive": false,
    "name": "Project Mgt in Health Services",
    "fullname": "Project and Program Management in Health Services Management",
    "info": "This is a hands-on course aimed at providing a practical, holistic perspective on the complexities of evidence-based project and program management within the health care organization.  It describes the nature of health care projects, characteristics of project teams, and relevant trends in health care. You will become familiar with multiple project management tools, including Microsoft Project, as well as the necessary leadership, facilitation, and team skills. You will be exposed to case studies, examples, discussions, and readings on the disciplines and tools that professional health care project managers use. Upon completion of this course, you will have experienced the activities required to initiate, plan, execute, monitor, control, and close a successful health care project. Prerequisites: None",
    "prereq": []
  },
  {
    "uid": "817680",
    "code": "HSM4065",
    "subject": "HSM",
    "number": "4065",
    "honors": false,
    "writingIntensive": false,
    "name": "Info Security Health Services",
    "fullname": "Information Privacy and Security in Health Services Management",
    "info": "Developing and implementing a security and privacy program in a health care environment. Privacy and security from societal, health care operations, and regulatory perspectives. Final project uses resources in the public domain to design a security and privacy program that supports regulatory compliance requirements and that considers customer/patient concerns and experience, health care provider experience and workflows, operational workflows, and regulatory compliance. Topics include importance of security in health care; risk concepts and value of health information, usability, and security/privacy; federal and state regulations; impact of technology on security; health care operations; what can be learned from other industries; security certifications; and breach response. ",
    "prereq": []
  },
  {
    "uid": "816633",
    "code": "HSM4193",
    "subject": "HSM",
    "number": "4193",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Independent project. Topic arranged with and supervised by Health Services Management faculty member.  prereq: admitted to HSM major, minor, or certificate; department consent.",
    "prereq": []
  },
  {
    "uid": "816876",
    "code": "HSM4301",
    "subject": "HSM",
    "number": "4301",
    "honors": false,
    "writingIntensive": false,
    "name": "HC Quality Patient Safety",
    "fullname": "Health Care Quality & Patient Safety Management",
    "info": "Principles of health care improvement, quality, and patient safety management from the role of the manager and project leadership in health services management. Overall the course is designed to provide an understanding of the concepts and principles of quality management and tools, patient safety, and related quality and safety management accreditation and regulatory requirements. The course will use an applied, real-world approach to ensure understanding of these important issues in health services management.  ",
    "prereq": []
  },
  {
    "uid": "795488",
    "code": "HSM4501",
    "subject": "HSM",
    "number": "4501",
    "honors": false,
    "writingIntensive": false,
    "name": "Writing for Health Professions",
    "fullname": "Writing for the Health Professions",
    "info": "How to critically review medical literature and present research data. Scientific method, logic, systematic approach, objective analysis. Students support a hypothesis using research of previously conducted work and present data in graphic/narrative form according to professional standards.",
    "prereq": []
  },
  {
    "uid": "820529",
    "code": "HSM4521",
    "subject": "HSM",
    "number": "4521",
    "honors": false,
    "writingIntensive": false,
    "name": "Inclusion & Equity in HC Mgmt",
    "fullname": "Inclusion and Equity in Health Care Management",
    "info": "Knowledge and skills needed to create ethical and just health care access, delivery, and outcomes within racially and culturally diverse populations.  Through reflection and discussion, the course explores equity, bias, racial disparities, and culture as they relate to health care delivery, outcomes, and leadership. Analysis of case studies, organizational models, and social justice programs will create a foundation to ethically and strategically plan, actively engage in, and promote transformative change that will enable health care managers and leaders to create more inclusive health care delivery models.Prerequisites: None",
    "prereq": []
  },
  {
    "uid": "813524",
    "code": "HSM4531",
    "subject": "HSM",
    "number": "4531",
    "honors": false,
    "writingIntensive": false,
    "name": "HR in Health Care Settings",
    "fullname": "Human Resources in Health Care Settings",
    "info": "Basic understanding of human resources issues within health care organizations--management of human capital to meet organizational objectives, and building and motivating an engaged workforce. Legal principles; labor supply and demand; sourcing, recruitment, selection and orientation; compensation; benefits; diversity; performance management.prereq: 45 cr",
    "prereq": []
  },
  {
    "uid": "796337",
    "code": "HSM4541",
    "subject": "HSM",
    "number": "4541",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Care Finance",
    "fullname": "Health Care Finance",
    "info": "General principles of financial management for health care industry. Operational knowledge of financial management theory, esp., how hospitals and their departments develop/balance operating/capital budget for business growth/development. Governmental policies, procedures, and ethical issues controlling the health care industry.prereq: Basic accounting knowledge, a course such as ACCT 2050, and knowledge of Microsoft Excel are strongly recommended. HSM pre-majors should wait for major status to take this course.",
    "prereq": {
      "code": "ACCT 2050",
      "subject": "ACCT",
      "id": "2050"
    }
  },
  {
    "uid": "796338",
    "code": "HSM4561W",
    "subject": "HSM",
    "number": "4561",
    "honors": false,
    "writingIntensive": true,
    "name": "Health Care Admin & Mgmt",
    "fullname": "Health Care Administration and Management",
    "info": "Knowledge and and skills in the organizational and managerial aspects of health care. Applications of behavioral and organizational theory to health care settings. Topics will include organization models, supervision, employee evaluation, problem solving, productivity management, group leadership, and case studies. As a Writing Intensive course, it will provide management-level communication skills to develop a thoughtful and reflective understanding of the writing (and rewriting) process.",
    "prereq": []
  },
  {
    "uid": "809336",
    "code": "HSM4571",
    "subject": "HSM",
    "number": "4571",
    "honors": false,
    "writingIntensive": false,
    "name": "Grant Writ: Health & Nonprofit",
    "fullname": "Introduction to Grant Writing for Health Care and NonprofitOrganizations",
    "info": "Nonprofits and health care entities will continue to be challenged by limited resources and increased needs in communities they serve. This reality also results in an increased need for these groups to find additional financial support. This course will provide an understanding of ways to find, research, and write proposals for grants offered by government and private entities.  As a writing intensive course, it will spend significant time focusing on the writing process. Writing is crucial to the field because the only way for a nonprofit to be awarded a grant is by submitting a written proposal. The strength of the proposal has a significant impact on the money that an organization will receive.  Students will become familiar with various sections of the proposal by drafting, editing, and seeking feedback, and by revising a needs assessment, goal statement, budget justification, and statement of organizational purpose. By learning how to write well in the field, students will increase their chances of being employed by a nonprofit and securing funding for their organization.",
    "prereq": []
  },
  {
    "uid": "819187",
    "code": "HSM4572",
    "subject": "HSM",
    "number": "4572",
    "honors": false,
    "writingIntensive": false,
    "name": "Gerontol & Geriatrics for HSEs",
    "fullname": "Gerontology and Geriatrics for Health Services Executives",
    "info": "This course helps students understand aging as well as nursing facility operations and functions, administrative structures and responsibilities, and roles of professional and nonprofessional staff.  It is designed to meet the National Association of Long Term Care Administrator Boards (NAB) accreditation standards for Health Services Executive (HSE) certification. The NAB has set forth domains of practice for HSEs, which have been adopted by the Minnesota Board of Examiners for nursing home administrators. This course covers the following NAB domains of practice: resident-centered care and quality of life, environment, leadership and management, and core skills across all domains.  Prerequisite: Students must have some basic knowledge of the long term care field. Those without it are encouraged to meet with the instructor prior to registering to explore learning strategies.",
    "prereq": []
  },
  {
    "uid": "819188",
    "code": "HSM4573",
    "subject": "HSM",
    "number": "4573",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Regulatory Mgmt and Law",
    "fullname": "Long Term Care Regulatory Management and Law",
    "info": "This course helps students understand policies and laws that dictate the minimum standards for nursing facility operations.  It is designed to meet the National Association of Long Term Care Administrator Boards (NAB) accreditation standards for the Health Services Executive (HSE) certification. The NAB set forth domains of practice for Health Services Executives. These domains of practice have been adopted by the Minnesota Board of Examiners for nursing home administrators.  This course covers the domains involving regulatory and legal aspects of long term care.Prerequisite: Students must have some basic knowledge of the long term care field. Those without it are encouraged to meet with the instructor prior to registering to explore learning strategies.",
    "prereq": []
  },
  {
    "uid": "818081",
    "code": "HSM4575",
    "subject": "HSM",
    "number": "4575",
    "honors": false,
    "writingIntensive": false,
    "name": "Innovation in Health Services",
    "fullname": "Innovation in Health Services",
    "info": "This interactive course will help you understand the theory and practical application of innovation to solve big challenges in the health care system. You will learn and apply multiple approaches and tools for innovation and human-centered design to reshape organizational culture, strategy, structures, and systems.",
    "prereq": []
  },
  {
    "uid": "796339",
    "code": "HSM4581",
    "subject": "HSM",
    "number": "4581",
    "honors": false,
    "writingIntensive": false,
    "name": "Teach in  Health  Care Setting",
    "fullname": "Teaching in the Health Care Setting",
    "info": "Components of contemporary learning theory. How to design teaching strategies, evaluate educational outcomes.  Evaluation of educational needs, development of curriculum, application of various instructional methods, assessment of learning. Working with allied health practitioners, patients, and families.",
    "prereq": []
  },
  {
    "uid": "818176",
    "code": "HSM4582",
    "subject": "HSM",
    "number": "4582",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in Long Term Care",
    "fullname": "Practicum in Long Term Care",
    "info": "The Practicum course is the final component of the long term care administrator's education. A broad range of performance parameters are affected by management practices (e.g., employee morale, clinical processes, financial performance, regulatory compliance, quality of life for residents, customer satisfaction, and community/public relations). The course is a transition between the classroom and this executive level of management. Students will undertake a formal practicum project that must be coordinated with 1) the practicum site, 2) a preceptor who is a licensed nursing home administrator at the sponsoring organization, and 3) the course instructor. The intern is expected to make positive contributions to the sponsoring organization. The preceptor functions as a mentor, coach, and tutor. The intern identifies learning objectives and opportunities to meet both short-range goals for gaining work experience and long-range goals for career development through the development of a learning agreement. prereq: Most prelicensure courses completed--at a minimum, HSM 4583/6583-LTC Supports and Services; HSM 4585/6585 -LTC Organizational Management; HSM 4589/6589-LTC Human Resource Management; HSM 4593/6593-Gerontology for Health Care Managers.",
    "prereq": {
      "and": [
        {
          "code": "HSM 4583",
          "subject": "HSM",
          "id": "4583"
        },
        {
          "code": "HSM 6583",
          "subject": "HSM",
          "id": "6583"
        },
        {
          "code": "HSM 4585",
          "subject": "HSM",
          "id": "4585"
        },
        {
          "code": "HSM 6585",
          "subject": "HSM",
          "id": "6585"
        },
        {
          "code": "HSM 4589",
          "subject": "HSM",
          "id": "4589"
        },
        {
          "code": "HSM 6589",
          "subject": "HSM",
          "id": "6589"
        },
        {
          "code": "HSM 4593",
          "subject": "HSM",
          "id": "4593"
        },
        {
          "code": "HSM 6593",
          "subject": "HSM",
          "id": "6593"
        }
      ]
    }
  },
  {
    "uid": "818234",
    "code": "HSM4583",
    "subject": "HSM",
    "number": "4583",
    "honors": false,
    "writingIntensive": false,
    "name": "Long Term Care Supports & Serv",
    "fullname": "Long Term Care Supports and Services",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure to complete accredited postsecondary academic courses covering key competencies. This course covers the organization, operations, functions, services, and programs of long-term care supports and services, including the following: governing and oversight bodies and their relationship to the administrator; administrative responsibilities and structures; operations and functions of each facility department; functions and roles of professional and nonprofessional staff and consulting personnel.  Prerequisites: Some basic knowledge of the long-term care field. Students without this knowledge are encouraged to meet with the instructor to explore preparation strategies.",
    "prereq": []
  },
  {
    "uid": "818235",
    "code": "HSM4584",
    "subject": "HSM",
    "number": "4584",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Health and Medical Needs",
    "fullname": "Long Term Care Health and Medical Needs",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota's regulatory requirements for experience or certification) to complete accredited post-secondary academic courses covering key competencies. This course covers the medical and health needs of nursing facility residents and persons living in community-based settings. Topics include: How anatomic and physiologic changes associated with the aging process affect disease processes and clinical needs. Impact and management of common syndromes associated with aging, including vision/hearing impairment, nutrition/malnutrition, and balance and mobility impairment. Prevention and management of common conditions such as pressure ulcers and delirium. Common psychiatric and neurodegenerative disorders such as dementias (including Alzheimer's), depression, anxiety, psychotic disorders, and alcohol and drug abuse. Advance care planning and the role of palliative care and end-of-life care. Basic medical and pharmacological terminology. Innovative medical trends and emergent technologies used in long-term care settings.Prerequisite: Basic knowledge of the long-term care field. Students who do not have this knowledge are encouraged to meet with the instructor to discuss strategies for obtaining it prior to registering for this course.   ",
    "prereq": []
  },
  {
    "uid": "818177",
    "code": "HSM4585",
    "subject": "HSM",
    "number": "4585",
    "honors": false,
    "writingIntensive": false,
    "name": "Long Term Care Orgnztnl Mgmt",
    "fullname": "Long Term Care Organizational Management",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota's regulatory requirements for experience or certification) to complete accredited postsecondary academic courses covering key competencies. HSM 4585 covers the following basic management functions: planning and objective setting; organizing and delegating; and observing, monitoring, and evaluating outcomes. prereq: Basic knowledge of the long term care field. Students without this knowledge are encouraged to consult with the instructor prior to registering to explore preparatory strategies.",
    "prereq": []
  },
  {
    "uid": "820530",
    "code": "HSM4586",
    "subject": "HSM",
    "number": "4586",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt Assistd Liv & Senior Care",
    "fullname": "Management in Assisted Living and Senior Care Settings",
    "info": "Assisted living directors increasingly lead complex organizations that provide many different types of services to residents and their families. This course helps students understand aging as well as the operations and functions of assisted living communities, governance and leadership, administrative structures and responsibilities, and the roles of professional and nonprofessional staff. In 2019, the Minnesota State Legislature passed historic regulatory reform in assisted living, culminating in a new facility license and a new director license. State statute sets forth domains of practice for assisted living directors. Education in these domains is required prior to licensure. This course is designed to meet the Assisted Living Director license requirements of the State of Minnesota Board of Examiners for Long Term Services and Supports. Prerequisites: While there are no formal prerequisites, the successful student must have some basic knowledge of aging services and/or the long term care field. Students who are unfamiliar with this field are encouraged to meet with the instructor prior to registering for this course.  ",
    "prereq": []
  },
  {
    "uid": "818178",
    "code": "HSM4587",
    "subject": "HSM",
    "number": "4587",
    "honors": false,
    "writingIntensive": false,
    "name": "Long Term Care Regulatory Mgmt",
    "fullname": "Long Term Care Regulatory Management",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota's regulatory requirements for experience or certification) to complete accredited post-secondary academic courses covering key competencies. This course is one of those areas. It covers regulatory and funding provisions and requirements governing operation of long-term care services and related health care programs. Topics include Resident rights, resident choice/resident risk and protection from maltreatment; Guardianship and conservatorship; Health and safety codes including OSHA and National Life Safety Code; Medicare and Medicaid, standards for managed care and sub-acute care, and third-party payer requirements and reimbursement; Federal and state nursing home survey and compliance regulations and processes; Requirements affecting the quality of care and life of residents; Resident acuity and assessment methodology; Quality assurance and performance improvement.prereq: Basic knowledge of the long term care field. Students without this knowledge are encouraged to meet with the instructor prior to registering to discuss options.  ",
    "prereq": []
  },
  {
    "uid": "818236",
    "code": "HSM4588",
    "subject": "HSM",
    "number": "4588",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Qual Mgmt & Perf Improvmt",
    "fullname": "Long Term Care Quality Management and Performance Improvement",
    "info": "This course integrates competencies, knowledge, and skills from three interrelated areas to support evidence-based management decision making in long term care. These areas include 1) problem-solving skills, 2) quality management and quality improvement practices, and 3) data analytics. Classwork consists of preclass readings, online preclass discussion, face-to-face one-day seminar, one-day comprehensive Excel homework assignment, and homework assignments.Prerequisites: Basic knowledge of the long term care field. Students without this knowledge are encouraged to meet with the instructor prior to registering to discuss ways of acquiring it. Skill with Excel is strongly recommended. ",
    "prereq": []
  },
  {
    "uid": "818237",
    "code": "HSM4589",
    "subject": "HSM",
    "number": "4589",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Human Resources Mgmt",
    "fullname": "Long Term Care Human Resources Management",
    "info": "Long term care organizations operate within a dynamic environment of changing care demands, regulatory requirements, and financial constraints. This course is designed to provide students with an overview of leadership principles; organizational governance and change management; advocacy and public relations; and strategic business planning within the context of nursing homes. This course meets national and state requirements for licensure as a nursing home administrator. Prerequisites: None, but knowledge of the long-term care field is very helpful. Students without this knowledge are encouraged to meet with the director of the LTC program prior to registering to discuss strategies for acquiring it.",
    "prereq": []
  },
  {
    "uid": "813981",
    "code": "HSM4591",
    "subject": "HSM",
    "number": "4591",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Care Law and Ethics",
    "fullname": "Health Care Law and Ethics",
    "info": "Introduction to the major legal and ethical aspects and principles as applied in health services management.  Topics include organization and governance of healthcare organizations; regulation; healthcare fraud and abuse; professional licensing and credentialing; compliance, quality and risk management; privacy and security of individually identifiable health information; healthcare decision-making; professional liability and malpractice. Other topics include legal and ethical issues surrounding healthcare technologies, medical research, and medical breakthroughs.",
    "prereq": []
  },
  {
    "uid": "818238",
    "code": "HSM4592",
    "subject": "HSM",
    "number": "4592",
    "honors": false,
    "writingIntensive": false,
    "name": "Long Term Care Health Care Law",
    "fullname": "Long Term Care Health Care Law",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota's regulatory requirements for experience or certification) to complete accredited post-secondary academic courses covering key competencies. HSM 4592 covers legal and regulatory issues, ethical perspectives, public policy advocacy and professional reporting requirements related to the operation of long-term care service delivery organizations. The following topics are covered: Professional and biomedical ethics; Liability, negligence, and malpractice; Data confidentiality, privacy and practices; Professional licensing, certification and reporting for staff and consulting personnel; and Advocacy for public policies.Prerequisites: Knowledge of the long-term care field. Students who do not have this knowledge are encouraged to meet with the instructor prior to registering to discuss strategies for gaining this knowledge.",
    "prereq": []
  },
  {
    "uid": "818239",
    "code": "HSM4593",
    "subject": "HSM",
    "number": "4593",
    "honors": false,
    "writingIntensive": false,
    "name": "Gerontology for Hlth Care Mgrs",
    "fullname": "Gerontology for Health Care Managers",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota?s regulatory requirements for experience or certification) to complete accredited post-secondary academic courses covering key competencies. This course covers the requirement related to Gerontology. HSM 4593 covers the following: Issues of cultural diversity and human relationships between and among employees and residents of nursing facilities and their family members. Physical, biological, social and psychological aspects of the aging process. Policies and programs designed to meet the needs of a rapidly aging population. Therapeutic programs for individuals with cognitive impairments. Services to support the needs of family caregivers.Prerequisites: Knowledge of the long-term care field. Students without this knowledge are encouraged to meet with the instructor prior to registering to discuss strategies for acquiring it.",
    "prereq": []
  },
  {
    "uid": "815287",
    "code": "HSM4596",
    "subject": "HSM",
    "number": "4596",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Services Mgt Internship",
    "fullname": "Health Services Management Internship",
    "info": "This course serves as a requirement in the Bachelor of Applied Science degree in Health Services Management. Students will apply coursework in the health services management area and contribute knowledge of best practices to make a positive impact on the health services management workplace and industry. Students will participate in career development activities,  a challenge project, and networking.   prereq: HSM major; dept. consent.  Permission to enroll will be granted only upon completion of HSM 3051, 3521, 4531, 4541, 4561W, & 4591. Highly recommended: HSM 4043 & 4301 (and HINF 5430 for HSM technology internships).",
    "prereq": {
      "and": [
        {
          "code": "HSM 3051",
          "subject": "HSM",
          "id": "3051"
        },
        {
          "code": "HSM 3521",
          "subject": "HSM",
          "id": "3521"
        },
        {
          "code": "HSM 4531",
          "subject": "HSM",
          "id": "4531"
        },
        {
          "code": "HSM 4541",
          "subject": "HSM",
          "id": "4541"
        },
        {
          "code": "HSM 4561W",
          "subject": "HSM",
          "id": "4561W"
        },
        {
          "code": "HSM 4591",
          "subject": "HSM",
          "id": "4591"
        },
        {
          "code": "HSM 4043",
          "subject": "HSM",
          "id": "4043"
        },
        {
          "code": "HSM 4301",
          "subject": "HSM",
          "id": "4301"
        },
        {
          "code": "HINF 5430",
          "subject": "HINF",
          "id": "5430"
        }
      ]
    }
  },
  {
    "uid": "796340",
    "code": "HSM4611",
    "subject": "HSM",
    "number": "4611",
    "honors": false,
    "writingIntensive": false,
    "name": "Allied Health Grand Rounds",
    "fullname": "Allied Health Grand Rounds",
    "info": "Capstone course. Allied health clinical/professional issues. Caregiver roles. Global views of national health policy, economics, ethical/legal problems. Challenging clinical cases. Multidisciplinary review. Cases relating individual patient and family experiences. Service project.",
    "prereq": []
  },
  {
    "uid": "826056",
    "code": "HSM4682",
    "subject": "HSM",
    "number": "4682",
    "honors": false,
    "writingIntensive": false,
    "name": "Long Term Care, Svcs, & Suprts",
    "fullname": "Long Term Care, Services, and Supports",
    "info": "Long term care organizations provide housing, services, and supports to older adults and others with complex medical and health care needs. Part health care facility and part home, skilled nursing facilities need administrators with a core understanding of gerontology and geriatrics. This course is designed to provide an overview of the biological, psychological, and sociological aspects of aging and, in turn, how long term care responds to needs through services and supports. This course meets national and state requirements for licensure as a nursing home administrator.  Prerequisites:  None.",
    "prereq": []
  },
  {
    "uid": "826057",
    "code": "HSM4683",
    "subject": "HSM",
    "number": "4683",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Environment and Quality",
    "fullname": "Long Term Care Environment and quality",
    "info": "Long term care organizations must continue to evolve based on consumer demand and regulatory frameworks. To achieve continuous quality improvement, administrators must understand the fundamentals of quality as well as how the regulatory environment impacts quality. This course is designed to explore the regulatory framework in which skilled nursing facilities operate as well as the concept of quality.  It meets national and state requirements for licensure as a nursing home administrator. Prerequisites:  None.",
    "prereq": []
  },
  {
    "uid": "826058",
    "code": "HSM4684",
    "subject": "HSM",
    "number": "4684",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Leadership and Strategy",
    "fullname": "Long Term Care Leadership and Strategy",
    "info": "Long term care organizations operate within a dynamic environment of changing care demands, regulatory requirements, and financial constraints. This course is designed to provide students with an overview of leadership principles, organizational governance and change management, advocacy and public relations, and strategic business planning within the context of nursing homes. This course meets national and state requirements for licensure as a nursing home administrator.  Prerequisites: None.",
    "prereq": []
  },
  {
    "uid": "816221",
    "code": "HSM4861",
    "subject": "HSM",
    "number": "4861",
    "honors": false,
    "writingIntensive": false,
    "name": "HSM Capstone",
    "fullname": "Leadership and Business Planning in Health Care: Capstone",
    "info": "The course is a core requirement in the HSM major and allows students to synthesize and integrate lessons from previous courses. It covers theory and practice of leadership skills needed for high-performing health care organizations in changing and turbulent times. It emphasizes a four-phase approach: environmental assessment, planning, strategy and innovation, and implementation/measurement. Students will be prepared to embrace innovation and lead business plans through to successful implementation.  They will learn to integrate a wide range of management tools through collaborative development of a strategic business plan.prereq: HSM 3521, 4531, 4541, 4561, 4591. HSM major. Final year status required.",
    "prereq": {
      "and": [
        {
          "code": "HSM 3521",
          "subject": "HSM",
          "id": "3521"
        },
        {
          "code": "HSM 4531",
          "subject": "HSM",
          "id": "4531"
        },
        {
          "code": "HSM 4541",
          "subject": "HSM",
          "id": "4541"
        },
        {
          "code": "HSM 4561",
          "subject": "HSM",
          "id": "4561"
        },
        {
          "code": "HSM 4591",
          "subject": "HSM",
          "id": "4591"
        }
      ]
    }
  },
  {
    "uid": "820332",
    "code": "HSM6350",
    "subject": "HSM",
    "number": "6350",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Health Services Mgmt",
    "fullname": "Special Topics in Health Services Management",
    "info": "Timely issues and themes in health services management.",
    "prereq": []
  },
  {
    "uid": "825327",
    "code": "HSM6541",
    "subject": "HSM",
    "number": "6541",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Care Finance",
    "fullname": "Health Care Finance",
    "info": "General principles of financial management for the health care industry. Operational knowledge of financial management theory, especially how hospitals and their departments develop and balance operating and capital budgets for business growth and development. Governmental policies, procedures, and ethical issues controlling the health care industry. HSM 6541 is cross-listed with the undergraduate version of the course (HSM 4541) and contains additional required content at the graduate level.  Prereq: Basic accounting knowledge from a course such as ACCT 2050 and knowledge of Microsoft Excel are strongly recommended. ",
    "prereq": {
      "code": "ACCT 2050",
      "subject": "ACCT",
      "id": "2050"
    }
  },
  {
    "uid": "825328",
    "code": "HSM6582",
    "subject": "HSM",
    "number": "6582",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in Long Term Care",
    "fullname": "Practicum in Long Term Care",
    "info": "The Practicum course is the final component of the long term care administrator's education.  A broad range of performance parameters are affected by management practices (e.g., employee morale, clinical processes, financial performance, regulatory compliance, quality of life for residents, customer satisfaction, and community/public relations). The course is a transition between the classroom and this executive level of management. Students will undertake a formal practicum project that must be coordinated with 1) the practicum site, 2) a preceptor who is a licensed nursing home administrator at the sponsoring organization, and 3) the course instructor. The intern is expected to make positive contributions to the sponsoring organization. The preceptor functions as a mentor, coach, and tutor. The intern identifies learning objectives and opportunities to meet both short-range goals for gaining work experience and long-range goals for career development through the development of a learning agreement.  HSM 6582 is cross-listed with the undergraduate version of the practicum (HSM 4582) and contains additional required content at the graduate level. prereqs: Most prelicensure courses completed--at a minimum, HSM 4583/6583-LTC Supports and Services; HSM 4585/6585 -LTC Organizational Management; HSM 4589/6589-LTC Human Resource Management; HSM 4593/6593-Gerontology for Health Care Managers.",
    "prereq": {
      "and": [
        {
          "code": "HSM 4583",
          "subject": "HSM",
          "id": "4583"
        },
        {
          "code": "HSM 6583",
          "subject": "HSM",
          "id": "6583"
        },
        {
          "code": "HSM 4585",
          "subject": "HSM",
          "id": "4585"
        },
        {
          "code": "HSM 6585",
          "subject": "HSM",
          "id": "6585"
        },
        {
          "code": "HSM 4589",
          "subject": "HSM",
          "id": "4589"
        },
        {
          "code": "HSM 6589",
          "subject": "HSM",
          "id": "6589"
        },
        {
          "code": "HSM 4593",
          "subject": "HSM",
          "id": "4593"
        },
        {
          "code": "HSM 6593",
          "subject": "HSM",
          "id": "6593"
        }
      ]
    }
  },
  {
    "uid": "819568",
    "code": "HSM6583",
    "subject": "HSM",
    "number": "6583",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Supports and Services",
    "fullname": "Long Term Care Supports and Services",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure to complete accredited postsecondary academic courses covering key competencies. This course covers the organization, operations, functions, services, and programs of long-term care supports and services, including the following: governing and oversight bodies and their relationship to the administrator; administrative responsibilities and structures; operations and functions of each facility department; functions and roles of professional and nonprofessional staff and consulting personnel. Prerequisites: Some basic knowledge of the long- term care field. Students without this knowledge are encouraged to meet with the instructor to explore preparation strategies.",
    "prereq": []
  },
  {
    "uid": "818983",
    "code": "HSM6584",
    "subject": "HSM",
    "number": "6584",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Health and Medical Needs",
    "fullname": "Long Term Care Health and Medical Needs",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota's regulatory requirements for experience or certification) to complete accredited post-secondary academic courses covering key competencies. This course covers the medical and health needs of nursing facility residents and persons living in community-based settings. Topics include the following:- How anatomic and physiologic changes associated with the aging process affect disease processes and clinical needs- Impact and management of common syndromes associated with aging including vision/hearing impairment, nutrition/malnutrition, and balance and mobility impairment- Prevention and management of common conditions such as pressure ulcers and delirium- Common psychiatric and neurodegenerative disorders such as dementias (including Alzheimer's), depression, anxiety, psychotic disorders, and alcohol and drug abuse- Advance care planning and the role of palliative care and end-of-life care- Basic medical and pharmacological terminology- Innovative medical trends and emergent technologies used in long-term care settingsPrerequisite: Basic knowledge of the long-term care field. Students who do not have this knowledge are encouraged to meet with the instructor to discuss strategies for obtaining it prior to registering for this course.   ",
    "prereq": []
  },
  {
    "uid": "818984",
    "code": "HSM6585",
    "subject": "HSM",
    "number": "6585",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Organizational Management",
    "fullname": "Long Term Care Organizational Management",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota's regulatory requirements for experience or certification) to complete accredited postsecondary academic courses covering key competencies. HSM 6585 covers the following basic management functions: planning and objective setting; organizing and delegating; and observing, monitoring and evaluating outcomes, including customer satisfactionprereq: Basic knowledge of the long term care field. Students without this knowledge are encouraged to consult with the instructor prior to registering to explore preparatory strategies.",
    "prereq": []
  },
  {
    "uid": "820488",
    "code": "HSM6586",
    "subject": "HSM",
    "number": "6586",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt Assistd Liv & Senior Care",
    "fullname": "Management in Assisted Living and Senior Care Settings",
    "info": "HSM 6586 is the graduate version of HSM 4586. Assisted living directors increasingly lead complex organizations that provide many different types of services to residents and their families. This course helps students understand aging as well as the operations and functions of assisted living communities, governance and leadership, administrative structures and responsibilities, and the roles of professional and nonprofessional staff. In 2019, the Minnesota State Legislature passed historic regulatory reform in assisted living, culminating in a new facility license and a new director license. State statute sets forth domains of practice for assisted living directors. Education in these domains is required prior to licensure. This course is designed to meet the Assisted Living Director license requirements of the State of Minnesota Board of Examiners for Long Term Services and Supports.  Prerequisites: While there are no formal prerequisites, the successful student must have some basic knowledge of aging services and/or the long term care field. Students who are unfamiliar with this field are encouraged to meet with the instructor prior to registering for this course.  ",
    "prereq": []
  },
  {
    "uid": "819569",
    "code": "HSM6587",
    "subject": "HSM",
    "number": "6587",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Regulatory Management",
    "fullname": "Long Term Care Regulatory Management",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota's regulatory requirements for experience or certification) to complete accredited post-secondary academic courses covering key competencies. HSM 6587 is one of those areas. It covers regulatory and funding provisions and requirements governing operation of long-term care services and related health care programs. Topics include Resident rights, resident choice/resident risk and protection from maltreatment; Guardianship and conservatorship; Health and safety codes including OSHA and National Life Safety Code; Medicare and Medicaid, standards for managed care and sub-acute care, and third-party payer requirements and reimbursement; Federal and state nursing home survey and compliance regulations and processes; Requirements affecting the quality of care and life of residents; Resident acuity and assessment methodology; Quality assurance and performance improvement.prereq: Basic knowledge of the long term care field. Students without this knowledge are encouraged to meet with the instructor prior to registering to discuss options.  ",
    "prereq": []
  },
  {
    "uid": "818985",
    "code": "HSM6588",
    "subject": "HSM",
    "number": "6588",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Qual Mgmt & Perf Improvmnt",
    "fullname": "Long Term Care Quality Management and Performance Improvement",
    "info": "This course integrates competencies, knowledge, and skills from three interrelated areas to support evidence-based management decision making in long term care. These areas include 1) problem-solving skills, 2) quality management and quality improvement practices, and 3) data analytics. Classwork consists of preclass readings, online preclass discussion, face-to-face one-day seminar, one-day comprehensive Excel homework assignment, and homework assignments.Prerequisites: Basic knowledge of the long term care field. Students without this knowledge are encouraged to meet with the instructor prior to registering to discuss ways of acquiring it. Skill with Excel is strongly recommended.",
    "prereq": []
  },
  {
    "uid": "818986",
    "code": "HSM6589",
    "subject": "HSM",
    "number": "6589",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Human Resources Management",
    "fullname": "Long Term Care Human Resources Management",
    "info": "Long term care organizations operate within a dynamic environment of changing care demands, regulatory requirements, and financial constraints. This course is designed to provide students with an overview of leadership principles; organizational governance and change management; advocacy and public relations; and strategic business planning within the context of nursing homes. This course meets national and state requirements for licensure as a nursing home administrator.prereq: None, but knowledge of the long-term care field is very helpful. Students without this knowledge are encouraged to meet with the director of the LTC program prior to registering to discuss strategies for acquiring it.",
    "prereq": []
  },
  {
    "uid": "819570",
    "code": "HSM6592",
    "subject": "HSM",
    "number": "6592",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Health Care Law",
    "fullname": "Long Term Care Health Care Law",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota's regulatory requirements for experience or certification) to complete accredited post-secondary academic courses covering key competencies. HSM 6592 covers legal and regulatory issues, ethical perspectives, public policy advocacy and professional reporting requirements related to the operation of long-term care service delivery organizations. The following topics are covered: Professional and biomedical ethics; Liability, negligence, and malpractice; Data confidentiality, privacy and practices; Professional licensing, certification and reporting for staff and consulting personnel; and Advocacy for public policies.Prerequisites: Knowledge of the long-term care field. Students who do not have this knowledge are encouraged to meet with the instructor prior to registering to discuss strategies for gaining this knowledge.",
    "prereq": []
  },
  {
    "uid": "819571",
    "code": "HSM6593",
    "subject": "HSM",
    "number": "6593",
    "honors": false,
    "writingIntensive": false,
    "name": "Gerontol for Health Care Mgrs",
    "fullname": "Gerontology for Health Care Managers",
    "info": "The Minnesota Board of Examiners for Nursing Home Administrators (BENHA) requires applicants for initial licensure (and those who are licensed in other states but do not meet Minnesota?s regulatory requirements for experience or certification) to complete accredited post-secondary academic courses covering key competencies. This course covers the requirement related to Gerontology. HSM 6593 covers the following: Issues of cultural diversity and human relationships between and among employees and residents of nursing facilities and their family members. Physical, biological, social and psychological aspects of the aging process. Policies and programs designed to meet the needs of a rapidly aging population. Therapeutic programs for individuals with cognitive impairments. Services to support the needs of family caregivers.Prerequisites: Knowledge of the long-term care field. Students without this knowledge are encouraged to meet with the instructor prior to registering to discuss strategies for acquiring it.",
    "prereq": []
  },
  {
    "uid": "825913",
    "code": "HSM6682",
    "subject": "HSM",
    "number": "6682",
    "honors": false,
    "writingIntensive": false,
    "name": "Long Term Care, Svcs, & Suprts",
    "fullname": "Long Term Care, Services, and Supports",
    "info": "Long term care organizations provide housing, services, and supports to older adults and others with complex medical and health care needs. Part health care facility and part home, skilled nursing facilities need administrators with a core understanding of gerontology and geriatrics. This course is designed to provide an overview of the biological, psychological, and sociological aspects of aging and, in turn, how long term care responds to needs through services and supports. This course meets national and state requirements for licensure as a nursing home administrator.  Prerequisites:  None.",
    "prereq": []
  },
  {
    "uid": "825915",
    "code": "HSM6683",
    "subject": "HSM",
    "number": "6683",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Environment and Quality",
    "fullname": "Long Term Care Environment and Quality",
    "info": "Long term care organizations must continue to evolve based on consumer demand and regulatory frameworks. To achieve continuous quality improvement, administrators must understand the fundamentals of quality as well as how the regulatory environment impacts quality. This course is designed to explore the regulatory framework in which skilled nursing facilities operate as well as the concept of quality.  It meets national and state requirements for licensure as a nursing home administrator. Prerequisites:  None.",
    "prereq": []
  },
  {
    "uid": "825914",
    "code": "HSM6684",
    "subject": "HSM",
    "number": "6684",
    "honors": false,
    "writingIntensive": false,
    "name": "LTC Leadership and Strategy",
    "fullname": "Long Term Care Leadership and Strategy",
    "info": "Long term care organizations operate within a dynamic environment of changing care demands, regulatory requirements, and financial constraints. This course is designed to provide students with an overview of leadership principles, organizational governance and change management, advocacy and public relations, and strategic business planning within the context of nursing homes. This course meets national and state requirements for licensure as a nursing home administrator.  Prerequisites: None.",
    "prereq": []
  }
]