[
  {
    "uid": "825960",
    "code": "HSPH5001",
    "subject": "HSPH",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Disability Justice & Heritage",
    "fullname": "Disability Justice and Cultural Heritage",
    "info": "This course is designed to prepare advanced undergraduates and graduate students to more effectively engage issues of disability in public history. This class is rooted in activism, taking an intersectional approach, which will push students to reflect on the numerous ways other forms of identity intersect and have been classified as disability. This class is organized as a workshop where students from multiple disciplines will focus on strategies for increasing public awareness and understanding of disability histories as expressed in American buildings and landscapes. The class will be grounded in scholarly and activist perspectives on disability justice connected with various aspects of public history: historic preservation, archival practices, community-engaged work, and exhibition design, among others.",
    "prereq": []
  },
  {
    "uid": "816944",
    "code": "HSPH8001",
    "subject": "HSPH",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Who Owns the Past? Pub History",
    "fullname": "Who Owns the Past? Common Concerns and Big Questions in Heritage and Public History",
    "info": "Course offers a survey through case studies of the common concerns, concepts and ethics of heritage and public history. Students will learn about the history and social contexts of heritage studies and public history, the stakes and stakeholders, and the conflicts and positive interventions that can be made through the work of these affiliated professions.",
    "prereq": []
  },
  {
    "uid": "816927",
    "code": "HSPH8002",
    "subject": "HSPH",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Core Practices Heritage Study",
    "fullname": "Core Practices in Heritage Studies and Public History",
    "info": "Course is open to all Heritage Studies and Public History (HSPH) graduate students. DGS or Instructor permission required for others. Course offers a survey of how heritage and public history concern and ethics are embedded into practice. Through illustrated lectures, case studies, field trips, readings and class discussion, students will learn about the professional practice of heritage studies and public history, how approaches to practice are aligned to institutional mission, customization of programs for diverse audiences, and professional evaluation and management of financial resources. \n",
    "prereq": []
  },
  {
    "uid": "816928",
    "code": "HSPH8003",
    "subject": "HSPH",
    "number": "8003",
    "honors": false,
    "writingIntensive": false,
    "name": "Race & Indigeneity in Hrtg Rep",
    "fullname": "Race and Indigeneity in Heritage Representation",
    "info": "This seminar will explore the changes in how diversity has been represented in historical interpretations in the past, and how practice is changing in response to the contemporary and anticipated social context of the United States. \\\"Diversity\\\" has historically been assumed to derive from categories such as race or culture, concepts constructed in the discipline of anthropology but taken up as the foundation for typologies in other arenas such as art history, architectural history, museums, and public policy. What is problematic in such an approach?  What happens to communities defined by shared history, political sovereignty, and disenfranchisement? What are the implications beyond museums for those communities? Finally, how can we think differently about diversity without re-inscribing harmful constructions of difference? ",
    "prereq": []
  },
  {
    "uid": "816929",
    "code": "HSPH8004",
    "subject": "HSPH",
    "number": "8004",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone in HSPH",
    "fullname": "Capstone in Heritage Studies and Public History",
    "info": "This course will operate as a workshop, drawing together a cohort of students, working individually or as part of a team, to craft independent heritage studies and public history research projects under the supervision of a faculty instructor. Projects may be based in archival research, public exhibitions, archaeology, material culture studies and preservation, architecture and preservation, or landscape studies. Consistent with the values of the program, projects shall have multidisciplinary perspectives, broadly consider aspects of diversity, and will be accountable to some stakeholder(s) identified by the students. ",
    "prereq": []
  },
  {
    "uid": "816930",
    "code": "HSPH8005",
    "subject": "HSPH",
    "number": "8005",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership&Future of Hist Orgs",
    "fullname": "Leadership and Future of Historical Organizations",
    "info": "This course will operate as a series of lectures and discussions in which leaders of historical organizations explain how they are navigating major changes and challenges associated with their professional practice. Speakers in this course will be invited and organized by the instructor in coordination with HSPH faculty and colleagues at the Minnesota Historical Society. Topics to be presented by speakers may include: making history accessible and meaningful to increasingly diverse audiences; interpreting difficult or traumatic histories; gathering, storing, and providing access to physical collections in a digital age; engaging the public in historical research and interpretation; the financial management and leadership of historical organizations. The course has several objectives: students will learn from, and have the opportunity to meet, leaders of historical organizations located throughout Minnesota and the United States; it will also be a cohort-building opportunity as students in the first and second years of the program meet regularly in this course to hear from professional practitioners and discuss presentations and readings.",
    "prereq": []
  },
  {
    "uid": "817997",
    "code": "HSPH8006",
    "subject": "HSPH",
    "number": "8006",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Methods/HerStu&PubHist",
    "fullname": "Digital Methods for Heritage Studies & Public History",
    "info": "Digital technologies are significantly altering the speed and scale of the foundational\nmethodologies of archeology, history, and preservation. Moreover, they are shifting the way the\npublic engages with the past in cultural institutions and across the myriad screens that pervade\ntheir daily life. In this course, students will not only learn how emerging digital technologies can\nenhance their research, but also how those technologies are fundamentally transforming the\npossibilities for the public presentation of that research.\n\nThis course privileges hands-on learning and balances deeping essential methodological skills\nwith exposure to a breadth of field-altering technologies. It is structured around five core\nmethodologies--excavation, documentation, reconstruction, interpretation, and exhibition. In\neach unit, students will be first be tasked with identifying the underlying principles of these\nmethodological approaches. They will then use class time to explore technologies that extend\nthose methods such as high-resolution imaging, relational databases, text mining programs,\nvirtual environments, and content management systems for website building. Bookending the\ncourse is a focus on effective collaboration--the foundation of successful digital projects--and\npublic engagement in an increasingly connected yet fractured society.",
    "prereq": []
  },
  {
    "uid": "820148",
    "code": "HSPH8007",
    "subject": "HSPH",
    "number": "8007",
    "honors": false,
    "writingIntensive": false,
    "name": "Archives",
    "fullname": "Archives",
    "info": "Working in close collaboration with the archivists of the Department of Archives and Special Collections at the University Libraries, this hands-on course will explore how archivists do their work and how a deeper understanding of that work can help scholars in any field grasp the practice of historical research.  Rooted in the theory and tradition of archival science, the course will cover the core practices of archivists as well as the emerging issues and technologies changing the way archives are built, maintained, and accessed.  In this course, students will gain experience with archival theory, archival ethics, selection, appraisal, arrangement, description, reference, access, preservation, exhibits, and outreach.  Through engaging with those topics, students will be prepared to situate archives and archival material within the socio-historical contexts in which they were produced and in which they are maintained, affording them a critical perspective on the historical sources they contain.  \n\nEach week’s course will be co-taught with an archivist from the Department of Archives and Special Collections at the University Libraries.\n",
    "prereq": []
  },
  {
    "uid": "818886",
    "code": "HSPH8010",
    "subject": "HSPH",
    "number": "8010",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in HSPH",
    "fullname": "Topics in Heritage Studies and Public History",
    "info": "Topics in Heritage Studies and Public History explores new and emerging issues in the field that are not examined in other coursework.",
    "prereq": []
  },
  {
    "uid": "816931",
    "code": "HSPH8101",
    "subject": "HSPH",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship",
    "fullname": "Internship",
    "info": "Internships are an opportunity to apply your skills and deepen your understanding of careers in historical sites and museums, community heritage organizations, or preservation/oversight agencies. This experience is for both skill-building and general professional development. Internship placements will be determined through conversations with advisors regarding student areas of interest and career goals, and available professional opportunities within the Minnesota Historical Society or a partnering organization. MHSPH degree students are required to complete two internships, one within MNHS and one outside. There are small stipends paid to students for their internship work, and depending on the site/project there may be funds available for project materials.\n",
    "prereq": []
  },
  {
    "uid": "818896",
    "code": "HSPH8992",
    "subject": "HSPH",
    "number": "8992",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Readings in HSPH",
    "fullname": "Directed Readings in HSPH",
    "info": "Directed Readings in Heritage Studies and Public History enable a student to explore new and emerging issues in the field that are not examined in other coursework. Student(s) will work with a member of the HSPH faculty to develop a reading list, schedule, deliverables, meeting times and other expectations, all of which will be recorded using the School of Arch Independent Study contract form. ",
    "prereq": []
  }
]