[
  {
    "uid": "812238",
    "code": "IBH6002",
    "subject": "IBH",
    "number": "6002",
    "honors": false,
    "writingIntensive": false,
    "name": "Portfolio Review",
    "fullname": "Portfolio Review",
    "info": "Required one credit registration for portfolio completion. Permission to register for IBH 6002 is dependent on submission of the Portfolio.",
    "prereq": []
  },
  {
    "uid": "808441",
    "code": "IBH6011",
    "subject": "IBH",
    "number": "6011",
    "honors": false,
    "writingIntensive": false,
    "name": "Found. Differential Diagnosis",
    "fullname": "Foundations in Differential Diagnosis",
    "info": "Concepts, theories, research in neuropsychology. Brain-behavior relationships through study of neurologic disorders. Processes related to learning/decision-making. Neuropsychological assessment using actual patient material.",
    "prereq": []
  },
  {
    "uid": "808442",
    "code": "IBH6021",
    "subject": "IBH",
    "number": "6021",
    "honors": false,
    "writingIntensive": false,
    "name": "Client Centered Care",
    "fullname": "Methods and Models III: Synthesis Seminar in Client Centered Care",
    "info": "Chronic substance use disorders or co-occurring combination. Applying step-wise, individualized, recovery oriented evidence-based practices for risk reduction, relapse prevention, recovery maintenance. Use case studies to evaluate/apply risk reduction/personalized interventions.",
    "prereq": []
  },
  {
    "uid": "813208",
    "code": "IBH6022",
    "subject": "IBH",
    "number": "6022",
    "honors": false,
    "writingIntensive": false,
    "name": "Found. of Psych. Assessment",
    "fullname": "Foundations of Psychological Assessment",
    "info": "Course focuses on major concepts and principles of educational and psychological assessment and the use of standardized instruments with differing populations.",
    "prereq": []
  },
  {
    "uid": "808443",
    "code": "IBH6031",
    "subject": "IBH",
    "number": "6031",
    "honors": false,
    "writingIntensive": false,
    "name": "Trauma and Anxiety",
    "fullname": "Methods and Models IV: Trauma and Anxiety, Assessment and Treatment Intervention",
    "info": "Basic/applied research on trauma/anxiety. Assessing/treating anxiety/post-trauma reactions in adults. Definition of anxiety, traumatic events. Assessment methods, PTSD assessment interview. Theory/techniques of evidence-based treatments. Field placement component. ",
    "prereq": []
  },
  {
    "uid": "812237",
    "code": "IBH6032",
    "subject": "IBH",
    "number": "6032",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Multicultural Practice",
    "fullname": "Advanced Multicultural Practice",
    "info": "Incorporate various sources of knowledge/content to provide deepening perspective on multiple layers of diversity/counseling individuals with substance use/co-occurring mental health disorders. Aspects of various cultural experiences (i.e., race/ethnicity, class status, sexual/affectional orientation, gender, religion) as they impinge upon client, counselor, counseling relationship.prereq: ADDS 5081 or equivalent",
    "prereq": {
      "code": "ADDS 5081",
      "subject": "ADDS",
      "id": "5081"
    }
  },
  {
    "uid": "818913",
    "code": "IBH6036",
    "subject": "IBH",
    "number": "6036",
    "honors": false,
    "writingIntensive": false,
    "name": "Trauma Focused Approaches",
    "fullname": "Trauma Focused Approaches and Crisis Intervention",
    "info": "This course will give students a foundation for assessing and treating post-trauma responses in various populations through the exploration of current theory, conceptualization, and models related to trauma and crisis intervention. Major treatment approaches to be covered will include Stress-Inoculation Therapy (SIT), Cognitive Processing Therapy (CPT), Seeking Safety, and Eye-Movement Desensitization and Reprocessing (EMDR). Special emphasis will be given to survivors of various types of trauma (e.g. Historical trauma, Abuse/Neglect) and Post-Traumatic Stress Disorder (PTSD). ",
    "prereq": []
  },
  {
    "uid": "808469",
    "code": "IBH6041",
    "subject": "IBH",
    "number": "6041",
    "honors": false,
    "writingIntensive": false,
    "name": "PET for PTSD",
    "fullname": "Prolonged Exposure Therapy for PTSD",
    "info": "Advanced practice methods and interventions for working with trauma and co-occurring disorders. Emerging and evidence-based practices presented, practiced, and applied.",
    "prereq": []
  },
  {
    "uid": "808470",
    "code": "IBH6051",
    "subject": "IBH",
    "number": "6051",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Group Practice",
    "fullname": "Advanced Group Practice",
    "info": "Advanced Group Practice is a graduate level course designed to allow students to apply previously learned group theories and concepts in an experiential environment.  Students will explore a variety of theoretical orientations (cognitive behavioral therapy, existentialism, psychodynamic, and person centered) through readings, short papers, and in-class group exercises, in addition to participating in structured inpatient group experience. Students will be expected to lead groups with a peer co-leader in class and co-lead therapeutic groups with the instructor outside of class. An important emphasis of this course will be in-class processing of group leadership skills, interventions, group dynamics, ethical dilemmas, documentation of process notes, and reactions to clients within the groups. ",
    "prereq": []
  },
  {
    "uid": "808471",
    "code": "IBH6061",
    "subject": "IBH",
    "number": "6061",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Adv Diagnostics I",
    "fullname": "Applied Advanced Diagnostics I",
    "info": "Diagnosing individuals with chronic/persistent mental health disorders, personality disorders, associated substance use disorders. Case studies, field placement with multidisciplinary team.",
    "prereq": []
  },
  {
    "uid": "809838",
    "code": "IBH6062",
    "subject": "IBH",
    "number": "6062",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Adv Diagnostics II",
    "fullname": "Applied Advanced Diagnostics II",
    "info": "Applied Advanced Diagnostics II.prereq: 6061, must be admitted IBH student",
    "prereq": {
      "code": "IBH 6061",
      "subject": "IBH",
      "id": "6061"
    }
  },
  {
    "uid": "808444",
    "code": "IBH6071",
    "subject": "IBH",
    "number": "6071",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Professional Issues",
    "fullname": "Advanced Professional Issues: Ethics",
    "info": "Develop ethical decision model that incorporates five moral principles. ACA/NAADAC codes of ethics/statutes/regulations that apply to mental health/substance abuse counseling. Case studies.",
    "prereq": []
  },
  {
    "uid": "808445",
    "code": "IBH6081",
    "subject": "IBH",
    "number": "6081",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Lifespan Development",
    "fullname": "Human Lifespan Development and Behavioral Health",
    "info": "Human development across life span. Implications for direct clinical practice. Theories of human development. Co-occurring mental health/substance use disorders. Normative changes, individual differences, typical/atypical patterns of development.",
    "prereq": []
  },
  {
    "uid": "808446",
    "code": "IBH6091",
    "subject": "IBH",
    "number": "6091",
    "honors": false,
    "writingIntensive": false,
    "name": "Career and Mental Health",
    "fullname": "Intersection of Career and Mental Health",
    "info": "Vocational choice theory, lifestyle choices, occupational/educational information, career exploration, assessment tools. Diverse populations/ethical standards. Employment/career concerns for persons with mental health, substance use, previously incarcerated.",
    "prereq": []
  },
  {
    "uid": "808447",
    "code": "IBH6101",
    "subject": "IBH",
    "number": "6101",
    "honors": false,
    "writingIntensive": false,
    "name": "Family Dynamics and Therapy",
    "fullname": "Family Dynamics and Therapy",
    "info": "Family dynamics/life cycle, communication patterns, multi-generational patterns. Systems theory/interventions for appropriate use of family resources to enhance intervention, treatment, family/individual functioning/maintenance processes.",
    "prereq": []
  },
  {
    "uid": "808448",
    "code": "IBH6111",
    "subject": "IBH",
    "number": "6111",
    "honors": false,
    "writingIntensive": false,
    "name": "Research & Evaluation Methods",
    "fullname": "Research and Evaluation Methods",
    "info": "Models of program evaluation. Use of research findings for program modification. Elements of research process, types of designs, program evaluation. Ethical considerations of research. Measurement concepts.",
    "prereq": []
  },
  {
    "uid": "809290",
    "code": "IBH6112",
    "subject": "IBH",
    "number": "6112",
    "honors": false,
    "writingIntensive": false,
    "name": "Management and Administration",
    "fullname": "Mental Health and Addiction Management and Administration",
    "info": "State/regulatory standards rules/statutes. Health care financing/reimbursement.prereq: ADDS 5091 or ADDS 4001",
    "prereq": {
      "or": [
        {
          "code": "ADDS 5091",
          "subject": "ADDS",
          "id": "5091"
        },
        {
          "code": "ADDS 4001",
          "subject": "ADDS",
          "id": "4001"
        }
      ]
    }
  },
  {
    "uid": "812230",
    "code": "IBH6121",
    "subject": "IBH",
    "number": "6121",
    "honors": false,
    "writingIntensive": false,
    "name": "Portfolio Development",
    "fullname": "Professional Seminar 2: Portfolio Development",
    "info": "The purpose of this seminar is to provide the groundwork for the development of the professional portfolio and should be taken 1 to 2 semesters before you plan to register for the IBH 8002 portfolio. Discussion and practice will focus on the main components to be included in the student's professional portfolio such as professional statements and clinical competencies.IBH 6121 should be taken after completion of 50 credits. ",
    "prereq": []
  },
  {
    "uid": "817929",
    "code": "IBH6221",
    "subject": "IBH",
    "number": "6221",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Theories",
    "fullname": "Applications of Counseling Theories",
    "info": "Course explores grand theories, practice theories, and practice models in counseling. Comparing and contrasting theoretical applicability across differing clinical circumstances. Develop theoretical orientation and build case conceptualization skills. Connecting between theory and practice.\n",
    "prereq": []
  },
  {
    "uid": "809861",
    "code": "IBH6222",
    "subject": "IBH",
    "number": "6222",
    "honors": false,
    "writingIntensive": false,
    "name": "Adolescents Co-occurring",
    "fullname": "Adolescents and Co-occurring Substance Use and Mental Health Disorders",
    "info": "Adolescents differ from adults physiologically, cognitively, and emotionally. Therefore, it is important for professionals who come into regular contact with this population to be familiar with the developmental issues and current trends in adolescent substance use. It is also essential to be able to recognize the risk and protective factors, biopsychosocial effects, and signs of potential substance use problems in adolescents.",
    "prereq": []
  },
  {
    "uid": "809862",
    "code": "IBH6224",
    "subject": "IBH",
    "number": "6224",
    "honors": false,
    "writingIntensive": false,
    "name": "Spirituality in Practice",
    "fullname": "Integrating Spirituality in Counseling Practice",
    "info": "Knowledge/skills of counseling students/practitioners in professional competencies for addressing spiritual/religious issues. Lecture, discussion, experiential exercises/readings to advance cognitive, interpersonal/practical skills. Treatment of persons with co-occurring disorders.",
    "prereq": []
  },
  {
    "uid": "809863",
    "code": "IBH6226",
    "subject": "IBH",
    "number": "6226",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Vital Involvement",
    "fullname": "Introduction to Vital Involvement Practice (VIP)",
    "info": "Students will understand how to utilize VIP principles to help empower clients in living their everyday lives in ways that achieve personal goals, promote health, exercise strengths, prevent problems, and contribute to the community.",
    "prereq": []
  },
  {
    "uid": "809864",
    "code": "IBH6227",
    "subject": "IBH",
    "number": "6227",
    "honors": false,
    "writingIntensive": false,
    "name": "Supervision Models and Methods",
    "fullname": "Supervision Models and Methods in Integrated Behavioral Health",
    "info": "This course will provide an overview of the practice of supervision and will identify its role in meeting the current demands of the practice environment. The course is based on sound practice principles and will offer a comprehensive framework for understanding the administrative, educational, and supportive functions of supervision.The main topics covered in this course are:supervisory techniques and relationship;styles and methods of supervision;legal, ethical, and theoretical issues related to clinical supervision and consultation.",
    "prereq": []
  },
  {
    "uid": "809867",
    "code": "IBH6228",
    "subject": "IBH",
    "number": "6228",
    "honors": false,
    "writingIntensive": false,
    "name": "Program Administration",
    "fullname": "Mental Health and Addiction Program Administration",
    "info": "Most often, good employees or strong counselors are promoted into leadership positions with an assumption that a good clinician is a good leader. This course will review strategies to develop strong leaders along with understanding of the importance of regulations and accreditation standards in creating consistent practice and consistency across all treatment programs.Students will obtain an introductory understanding of leadership skills and begin using evidence-based leadership. Students will review and apply Department of Human Service Statutes and Joint Commission Standards. Students will learn how to read budgets and complete a review and analysis of assigned budgets.",
    "prereq": []
  },
  {
    "uid": "809868",
    "code": "IBH6229",
    "subject": "IBH",
    "number": "6229",
    "honors": false,
    "writingIntensive": false,
    "name": "Crisis Assessment and Mgmt",
    "fullname": "Crisis Assessment and Management",
    "info": "Observe/participate with five different levels of crisis intervention settings. Chemical dependency evaluation,  hospital emergency department, mental health urgent care, mental health clinic, community mobile crisis intervention.prereq: [AddS 5091 or AddS 4001], dept consent, background check",
    "prereq": {
      "or": [
        {
          "code": "ADDS 5091",
          "subject": "ADDS",
          "id": "5091"
        },
        {
          "code": "ADDS 4001",
          "subject": "ADDS",
          "id": "4001"
        }
      ]
    }
  },
  {
    "uid": "809869",
    "code": "IBH6230",
    "subject": "IBH",
    "number": "6230",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Application in PET",
    "fullname": "Clinical Application in Prolonged Exposure Therapy",
    "info": "Clinical Application in Prolonged Exposure Therapy.",
    "prereq": []
  },
  {
    "uid": "810668",
    "code": "IBH6231",
    "subject": "IBH",
    "number": "6231",
    "honors": false,
    "writingIntensive": false,
    "name": "Management of Eating Disorders",
    "fullname": "Management of Eating Disorders",
    "info": "Etiology, occurrence, course, treatment, prevention of eating disorders from multidisciplinary perspective. Roles/responsibilities of eating disorder treatment team members of varying types across various treatment milieus.",
    "prereq": []
  },
  {
    "uid": "817190",
    "code": "IBH6232",
    "subject": "IBH",
    "number": "6232",
    "honors": false,
    "writingIntensive": false,
    "name": "Sexual Health and Gender",
    "fullname": "Sexual Health and Gender",
    "info": "This is a graduate level course that is meant to broaden your understanding of issues regarding sexual health and gender that you may encounter in the therapy session. A large part of this course is focused on increasing your comfort and competence in having conversations about sexual health and gender with your clients, as well as knowing when to intervene and when to refer. Additional attention will be given to developing and keeping appropriate boundaries with clients when addressing issues of sexual health and gender. Theoretical frameworks regarding human sexuality, sexual disorders, normative vs. non-normative sexual behavior, issues of gender identity and expression, and applicable therapeutic interventions will be discussed. Specific focus will also be given to the co-occurrence of sexual and gender concerns with mental health and substance use disorders, including discussions regarding prevalence and potential presentations. Please be aware that in the process of this course, you will be asked to engage in dialogue about and reflect upon your own beliefs and values around issues of sex, sexuality, relationships, gender identity, etc. It is expected that you be willing to challenge yourself to critically examine course discussions and materials, particularly as they may apply to your future work as a counselor.This  course  combines  the  use  of  lectures,  group  discourse,  group  presentations,  clinical role-plays, readings, self-reflective activities, and additional experiential exercises to aid you in expanding your knowledge base and competence in managing these issues as they may arise in the therapy session.",
    "prereq": []
  },
  {
    "uid": "816771",
    "code": "IBH6233",
    "subject": "IBH",
    "number": "6233",
    "honors": false,
    "writingIntensive": false,
    "name": "DBT Skills Training",
    "fullname": "DBT Skills Training: Group Practices and Treatment Modalities",
    "info": "This course focuses on teaching the delivery of Dialectical Behavior Therapy (DBT) Treatment: Skills Training in a group format. This opportunity allows students to learn the skills taught in a DBT Program as well as learn the treatment components involved in a behavioral therapy orientation. Students will explore the core skill of mindfulness, behavioral therapy, dialectics and cognitive behavioral therapy in a group and experiential format. Students will be expected to participate in weekly group discussion and assignments. Discussion will assist students with learning how this treatment is delivered to clients. Weekly assignments will provide experiential learning of skills group and mindfulness, the foundation\nskill in a DBT Program.",
    "prereq": []
  },
  {
    "uid": "817192",
    "code": "IBH6234",
    "subject": "IBH",
    "number": "6234",
    "honors": false,
    "writingIntensive": false,
    "name": "Counseling Grief and Loss",
    "fullname": "Counseling Grief and Loss",
    "info": "This course will provide students with an overview of current conceptualizations of grief and loss. It will prepare students with specialized knowledge and skills for understanding and identifying the process/progress of how people deal with loss. Special attention will be given to theoretical foundations of grief and loss, different types of loss, impact of loss, and cultural considerations. Additional strategies will be presented for intervening with those who have been impacted by loss.",
    "prereq": []
  },
  {
    "uid": "809391",
    "code": "IBH6910",
    "subject": "IBH",
    "number": "6910",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in IBH",
    "fullname": "Topics in Integrated Behavioral Health",
    "info": "Topics in Integrated Behavioral Health.",
    "prereq": []
  },
  {
    "uid": "809283",
    "code": "IBH6950",
    "subject": "IBH",
    "number": "6950",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Multicultural Practice",
    "fullname": "Topics in Multicultural Practice",
    "info": "Topics in multicultural practice.",
    "prereq": []
  },
  {
    "uid": "808449",
    "code": "IBH6993",
    "subject": "IBH",
    "number": "6993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study in Integrated Behavioral Health",
    "info": "Directed study.prereq: Must be admitted IBH student, dept consent",
    "prereq": []
  },
  {
    "uid": "808450",
    "code": "IBH6994",
    "subject": "IBH",
    "number": "6994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research in Integrated Behavioral Health",
    "info": "Directed research.prereq: Must be admitted IBH student, dept consent",
    "prereq": []
  },
  {
    "uid": "808451",
    "code": "IBH6996",
    "subject": "IBH",
    "number": "6996",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for IBH",
    "fullname": "Internship for Integrated Behavioral Health",
    "info": "Culminating field experience of MPS-IBH. On-site placement in public or private mental health, addictions/integrated treatment setting. Bridge between training/professionalism.\n\nprereq: dept consent",
    "prereq": []
  }
]