[
  {
    "uid": "818734",
    "code": "IFSL7001",
    "subject": "IFSL",
    "number": "7001",
    "honors": false,
    "writingIntensive": false,
    "name": "Keys to Authentic Leadership",
    "fullname": "Keys to Authentic and Effective Leadership",
    "info": "Learn authentic and effective leadership skills and how to transition them into the workplace. Students will explore strategies for a 24/7 world, navigating crucial conversations, leading across organizations, situational awareness and cascading effects, emotional awareness, decision-making, strategic thinking, and their personal leadership style.",
    "prereq": []
  },
  {
    "uid": "818735",
    "code": "IFSL7011",
    "subject": "IFSL",
    "number": "7011",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Production Farm to Fork",
    "fullname": "Food Production Farm to Fork",
    "info": "Explore the complexity and diversity within the food system using different food products, from on-farm production through processing and distribution to the consumer, including the impact of global supply chains. Learn how the agricultural-based food system from farm to fork impacts the quality, safety, and security of the foods produced. ",
    "prereq": []
  },
  {
    "uid": "818736",
    "code": "IFSL7021",
    "subject": "IFSL",
    "number": "7021",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Policy and Regulation",
    "fullname": "Food Governance, Policy, and Regulation",
    "info": "Learn to navigate the regulatory system for food product formulation, manufacturing, labeling, and advertising including the jurisdiction and complex interaction of regulatory agencies. Gain insight into how regulations, and the underlying food governance and policy, are affected by scientific developments and changing societal values and concerns.",
    "prereq": []
  },
  {
    "uid": "818737",
    "code": "IFSL7031",
    "subject": "IFSL",
    "number": "7031",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Security Safety & Defense",
    "fullname": "Food Security, Safety, and Defense",
    "info": "This course will provide students with an understanding of the basic principles of food security including the availability, accessibility, affordability, safety, and nutritional value of food. It will allow students to differentiate food security, food safety, and food defense, and to grasp the complexity of ethical and science trade-offs affecting decision-making across food security, food safety, and food defense. These principles will be highlighted through a variety of historical food security, safety, and defense incidents. At the conclusion of the course, students will evaluate a current, major food-borne disease outbreak using concepts learned from past outbreaks. This course requires program approval/consent to register.",
    "prereq": []
  },
  {
    "uid": "818738",
    "code": "IFSL7041",
    "subject": "IFSL",
    "number": "7041",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Business and Marketing",
    "fullname": "Food Business, Marketing, and Product Development",
    "info": "Evaluate the economic implications of decisions made at each stage of the agricultural and food production system and how they relate to current food system issues. Explore current food system issues and opportunities related to business, marketing, and product development, including issue breadth, complexity, scientific advances, and new ideas.",
    "prereq": []
  },
  {
    "uid": "818739",
    "code": "IFSL7051",
    "subject": "IFSL",
    "number": "7051",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Across Food Systems",
    "fullname": "Leading Across Integrated Food Systems",
    "info": "Integrate the concepts from food production, policy, security, and business using real-world case studies. Explore the impact that decisions, policies, and unforeseen circumstances can have as they ripple across the food system. Prepare a case-study that demonstrates a food systems approach to a current issue.",
    "prereq": []
  },
  {
    "uid": "820346",
    "code": "IFSL7052",
    "subject": "IFSL",
    "number": "7052",
    "honors": false,
    "writingIntensive": false,
    "name": "IFSL Capstone",
    "fullname": "Integrated Food Systems Leadership Capstone",
    "info": "Each cohort member will complete an individual capstone project demonstrating a food systems approach to a current issue. At the completion of this course, participants are able to more effectively synthesize program concepts with daily experience.",
    "prereq": []
  },
  {
    "uid": "818740",
    "code": "IFSL7061",
    "subject": "IFSL",
    "number": "7061",
    "honors": false,
    "writingIntensive": false,
    "name": "Tmwrk: Food Systems in Action",
    "fullname": "Teamwork: Food Systems in Action",
    "info": "In this course, all members of the Integrated Food Systems Cohort will work together to complete a Food Systems in Action Project. The Food Systems in Action Project will address an issue or grand challenge affecting the food system. Each cohort will receive a different issue or grand challenge that is currently being discussed with potential impacts across the food system. Enrollment is limited to students accepted into the Integrated Food Systems Leadership Certificate Program.",
    "prereq": []
  },
  {
    "uid": "818726",
    "code": "IFSL7070",
    "subject": "IFSL",
    "number": "7070",
    "honors": false,
    "writingIntensive": false,
    "name": "Communications & Crit Thinking",
    "fullname": "Communications and Critical Thinking",
    "info": "This is the second of two in-person Leadership Focused Course in the Integrated Food Systems Leadership Certificate Program. Students will spend four (4) consecutive days on the University of Minnesota campus, with a focus on communication and critical thinking as using a food systems approach while working across disciplines in industry, academia, government agencies, and inter-governmental organizations. Enrollment is limited to students accepted into the Integrated Food Systems Leadership Certificate Program.",
    "prereq": []
  }
]