[
  {
    "uid": "000222",
    "code": "JOUR1001",
    "subject": "JOUR",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Media in a Changing World",
    "fullname": "Media in a Changing World",
    "info": "In an era when almost everybody's a content creator and just about every company is connected with media, what makes mass communication different from other forms of message exchange? We'll examine journalism, advertising, public relations, video gaming, music recording, music and more. We'll think about issues like free speech, \"fake news,\" censorship, social media, demographics, psychographics and graphic content. Hear from mass media professionals who provide real-world, real-time material for discussion and debate. This class covers ground that is shifting by the day and uses current cases to help you apply what you learn and sharpen your own media literacy skills. ",
    "prereq": []
  },
  {
    "uid": "810566",
    "code": "JOUR1501",
    "subject": "JOUR",
    "number": "1501",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Games and Society",
    "fullname": "Digital Games and Society",
    "info": "Digital games have a wide-ranging impact on our culture and society and are one of the fastest-growing sectors of the entertainment media industry, generating enormous profits for the game companies. In this course, you will: (1) be introduced to the academic study of video games; (2) examine digital games as forms of communication and interactive storytelling, as well as games of entertainment, commerce, social activism, professional training, and education; (3) consider the impact of mobile media, particularly for games and gameplay; (4) discuss next-generation virtual reality technology that may change the way we think about immersive media experiences; and (5) study the history, ethics, and socio-cultural impact of digital games and related technologies.",
    "prereq": []
  },
  {
    "uid": "809923",
    "code": "JOUR1904",
    "subject": "JOUR",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in class schedule.",
    "prereq": []
  },
  {
    "uid": "789298",
    "code": "JOUR1905",
    "subject": "JOUR",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in class schedule.",
    "prereq": []
  },
  {
    "uid": "791431",
    "code": "JOUR1910W",
    "subject": "JOUR",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "816996",
    "code": "JOUR1911",
    "subject": "JOUR",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "What’s Money REALLY About?",
    "fullname": "What’s Money REALLY About?",
    "info": "Do you ever wonder why some people run away from money, while most people chase after it? Or why some people who could afford better buy their clothes at Savers while others (who maybe can't afford it) prefer to shop at Gucci or Armani? Or why husbands and wives, and parents and children, so seldom agree on what to do with money? Understanding the symbolic messages money sends to people is the key to learning how to answer these questions. Whether your interest is business, liberal arts, or a particular profession, this seminar ought to be interesting and useful for you. ",
    "prereq": []
  },
  {
    "uid": "817866",
    "code": "JOUR1912",
    "subject": "JOUR",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Art and Science of Persuasion",
    "fullname": "Winning People Over: The Art and Science of Persuasion",
    "info": "Seven days a week, everywhere in the world, people are busily trying to persuade other people. Students want their professors to accept late work. Professors want students to throw themselves into their coursework. Advertisers want consumers to buy their products. PR practitioners want people to think more highly of their clients. Newspaper editorialists want readers to change their minds. Defense lawyers want juries to acquit their clients. And politicians want constituents to vote for them.Some of these people are very effective persuaders; others less so. In this course, we will search out the best techniques for persuading different kinds of people to do various things. We'll study really good textbooks, meet top-quality professional persuaders, and search out real-life instances of good and bad persuasive efforts. And we'll try our hands at persuading someone to do something that's important to us. All the while we will be trying to build our own theories of persuasion and maybe have some fun!",
    "prereq": []
  },
  {
    "uid": "818810",
    "code": "JOUR1913",
    "subject": "JOUR",
    "number": "1913",
    "honors": false,
    "writingIntensive": false,
    "name": "Keep Out of Money Trouble",
    "fullname": "How to Keep Out of Money Trouble",
    "info": "Money can’t buy happiness, but managing your money well can have an amazing impact on your whole life.  This course will teach you how to manage your money well.  We’ll pay special attention to the financial implications of decisions you’re making today – choosing a career, funding your education, giving to people who need help – but we’ll also help you think about future decisions like buying a house and a car, starting a family, and helping people who need help.",
    "prereq": []
  },
  {
    "uid": "820190",
    "code": "JOUR1914",
    "subject": "JOUR",
    "number": "1914",
    "honors": false,
    "writingIntensive": false,
    "name": "News: Confronting Misinfo",
    "fullname": "Real News, Fake News: Confronting Misinformation",
    "info": "Various forms of misleading information?including online rumors, political propaganda, and media manipulation?has become part of contemporary media and politics. These forms of misleading information can be destructive for the fabric of society as well as erode public trust in the media, politics, businesses, and other institutions. Misleading information can also intensify political and ideological polarization, and shape individual and collective attitudes. This course considers the role of actors including journalists, malignant players, and social media platforms, as well as the socio-political contexts that underlie the problem of misinformation. Through discussion, students will learn about key concepts related to the contemporary information disorder ranging from misinformation, infodemic, and publicity and propaganda. And students will discuss and learn how to critically evaluate content using various verification techniques used in media organizations worldwide.",
    "prereq": []
  },
  {
    "uid": "826061",
    "code": "JOUR1915",
    "subject": "JOUR",
    "number": "1915",
    "honors": false,
    "writingIntensive": false,
    "name": "A steady diet of confusion",
    "fullname": "A steady diet of confusion: Communicating about nutrition, health, and science in today’s media envi",
    "info": "Communicating about nutrition, health, and science has never been easy. Public health authorities and researchers have long tried to convince the public to follow scientific guidance about staying healthy—for example, to eat well, exercise, and avoid risky behaviors like tobacco use—while health and science journalists have often struggled to translate complex research findings and recommendations into advice that is readily understood. These efforts have only become more challenging in the past few years, with the widespread availability of health misinformation online, infusion of politics into discussions of health and science, and ongoing debates and conflicting advice about what we should eat, how often we should screen for diseases like cancer, and, most recently, whether and how we should protect ourselves and our communities from COVID-19. This course will introduce students to these many challenges, and together we will consider potential paths forward—both for improving messaging and for rebuilding public trust in health and science. ",
    "prereq": []
  },
  {
    "uid": "826350",
    "code": "JOUR1916",
    "subject": "JOUR",
    "number": "1916",
    "honors": false,
    "writingIntensive": false,
    "name": "Thriving as Media Professional",
    "fullname": "Thriving as a Media Professional: Self-care and Wellness",
    "info": "In media work there is an increasing push for online and social media engagement. This has come with its dark side. Media professionals have noted an increase in political polarization, abuse, and hostility against the media especially for women and people of color which can affect their personal and professional lives such as through self-censorship. Through critical reading, discussions, and engagement with case studies, and with a focus on media work, from social media creators to journalism, students will learn about critical concepts and tools about self-care and wellness. ",
    "prereq": []
  },
  {
    "uid": "826351",
    "code": "JOUR1917",
    "subject": "JOUR",
    "number": "1917",
    "honors": false,
    "writingIntensive": false,
    "name": "The Medium is the Message",
    "fullname": "The Medium is the Message: Communication, Technology and Society",
    "info": "This class will examine the various theories of communication mediation and the relationship between technological change and various dimensions of social life (economic, historical, political, pedagogical, cultural, and so forth). For instance, what if cellular telephones with video and immediate transmission capabilities had existed in the Warsaw Ghetto in 1943, or in Arawak villages in the Caribbean in the 1490s? Media enable witnessing and that is a fundamental role of journalists. Media extend our optic and audial nervous systems. We will examine how the invention and operationalization of various technologies have altered our views of reality.  ",
    "prereq": []
  },
  {
    "uid": "826515",
    "code": "JOUR1918",
    "subject": "JOUR",
    "number": "1918",
    "honors": false,
    "writingIntensive": false,
    "name": "Brand Activism and Advocacy",
    "fullname": "Brand Activism and Advocacy: Strategic Communication for Change",
    "info": "From Amazon to Zappos, companies around the world increasingly are engaging in brand activism and advocacy as a way to enhance their brand image, recruit and retain employees, and enact change. In this course, students will ask and answer 4 questions about brand activism and advocacy as a form of strategic communication: What are the different ways that corporations use brand activism/advocacy messages to influence the public sphere? What are the various outcomes, for companies and society, that may occur as a result of brand activism/advocacy messaging? Why do companies engage in brand activism/advocacy communication? What are ethical concerns that may be raised by brand activism/advocacy?",
    "prereq": []
  },
  {
    "uid": "000223",
    "code": "JOUR3004",
    "subject": "JOUR",
    "number": "3004",
    "honors": false,
    "writingIntensive": false,
    "name": "Info for Mass Communication",
    "fullname": "Information for Mass Communication",
    "info": "The ability to acquire, evaluate, and use different information sources are essential skills for professional communicators and citizens. This course teaches the process of information gathering, evaluation, and implications through the lens of mass communication. A case study is used to study this process in depth throughout the semester.prereq: [JOUR 1001 or JOUR 100H], [JOUR major, Strat Comm major, Media and Information major or Media and Information minor or approved BIS/IDIM/ICP program] ",
    "prereq": {
      "code": "JOUR 1001",
      "subject": "JOUR",
      "id": "1001"
    }
  },
  {
    "uid": "800370",
    "code": "JOUR3005",
    "subject": "JOUR",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "Media Effects",
    "fullname": "Media Effects",
    "info": "Does the media cause social problems, or just reflect them? Why and how have mass media been feared, bemoaned, used, and dismissed as tools to change public beliefs, attitudes, and behavior? This course explores a century's worth of thinking as to how and when media might have such effects. We examine media influence in a range of contexts, including political advertising, health campaigns, video game violence, pornography, and educational television. We approach the topic largely from a social science perspective (for example, by reviewing experimental tests of the effects of media violence) but we will address some of the advantages and limitations inherent in looking for effects in that way. Although our focus is on mass media, interpersonal and digital media sources will be considered as well.",
    "prereq": []
  },
  {
    "uid": "000225",
    "code": "JOUR3006",
    "subject": "JOUR",
    "number": "3006",
    "honors": false,
    "writingIntensive": false,
    "name": "Visual Communication",
    "fullname": "Visual Communication",
    "info": "From Instagram to YouTube to memes-we live in a visual culture. How can we interpret this flood of images? Learn how to analyze advertisements, photographs, television, and social media from multiple perspectives. Historical, cultural, and ethical approaches unearth the changing role of visual media in society. You'll actively interpret current images to learn how to effectively communicate with visuals.",
    "prereq": []
  },
  {
    "uid": "000226",
    "code": "JOUR3007",
    "subject": "JOUR",
    "number": "3007",
    "honors": false,
    "writingIntensive": false,
    "name": "Media in American Hist & Law",
    "fullname": "The Media in American History and Law: Case Studies",
    "info": "In this class, you'll study news media and their social, cultural, and political impact during a specific historical time period, based on the instructor's expertise and area of research. Examples include: Journalism during the Civil War; Mass media and the African American struggle for civil rights; the Sixties and rise of the New Journalism.  Instructors of the course may vary from term to term and students may wish to contact the instructor for information on the specific focus of his or her section. ",
    "prereq": []
  },
  {
    "uid": "000227",
    "code": "JOUR3008",
    "subject": "JOUR",
    "number": "3008",
    "honors": false,
    "writingIntensive": false,
    "name": "Mass Comm Processes",
    "fullname": "Mass Communication Processes and Structure",
    "info": "Communication theories as they relate to mass communication processes. Major structural aspects of mass communication systems.",
    "prereq": []
  },
  {
    "uid": "000229",
    "code": "JOUR3101W",
    "subject": "JOUR",
    "number": "3101",
    "honors": false,
    "writingIntensive": true,
    "name": "News Reporting and Writing",
    "fullname": "News Reporting and Writing",
    "info": "This course is the foundation for training as a working journalist--students will learn how to write and report news accurately, quickly, fairly and with a clear, informative style that reflects today’s news demands. Its main focus is on news writing. Students will be expected to model proper journalistic forms and style, for a variety of platforms, as well as demonstrate proper English usage, grammar, spelling, and style. Students will also be asked to think about – and analyze – news and the varying ways it is presented in today’s media world. At the end of the course, students must demonstrate the ability to write clearly, report accurately, adhere to AP style, meet deadlines, and judge what is newsworthy.prereq: [JOUR 3004 or 3004H or concurrent registration], Jour major",
    "prereq": {
      "code": "JOUR 3004",
      "subject": "JOUR",
      "id": "3004"
    }
  },
  {
    "uid": "790544",
    "code": "JOUR3102",
    "subject": "JOUR",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Multimedia Prod & Storytelling",
    "fullname": "Multimedia Production and Storytelling",
    "info": "This course is an introduction to photography, video, audio, and slideshow storytelling and production; understanding the differences in content for different media; and understanding content management. Students will learn basic skills in understanding the differences in content for different platforms (Web, print, radio, mobile and television), in identifying, writing, and producing different story forms for video, audio, and social media and in understanding content management. Students will tell stories using a variety of technologies to gather, edit and disseminate information for journalism and strategic communication messages. We’ll work to understand how each technology has a particular audience or application, apply visual principles, and use the principles of visual grammar. Students will gain a basic proficiency in still and video camera operation, in video, audio and mixed media writing and production, in creating images for a video and social media or other mixed media story. They will also learn to manage and publish content in an organized manner.prereq: [JOUR 3004 or 3004H or coreq], [JOUR  3101 or coreq or JOUR  3279 or coreq or JOUR  3241 or coreq], [JOUR major or Strat Comm major]  ",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "or": [
            {
              "code": "JOUR 3101",
              "subject": "JOUR",
              "id": "3101"
            },
            {
              "code": "JOUR 3279W",
              "subject": "JOUR",
              "id": "3279W"
            },
            {
              "code": "JOUR 3241",
              "subject": "JOUR",
              "id": "3241"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "810238",
    "code": "JOUR3103",
    "subject": "JOUR",
    "number": "3103",
    "honors": false,
    "writingIntensive": false,
    "name": "Interactive & Data Journalism",
    "fullname": "Interactive and Data Journalism",
    "info": "This course teaches concepts, tools, and techniques for effective data journalism storytelling on digital platforms. Students will develop ways to display stories through the most important emerging tools for using structured information in journalism, including learning the fundamentals of gathering data and performing analyses to find stories and creating visualizations to illustrate trends and patterns. Students will use maintain a blog to curate their work, learning how to use what they build in one of the most common content management systems. Students will rely on open-source tools, but will also learn basic coding to customize those tools for more effective digital presentation. Students will also learn about and critique other digital storytelling formats, user experience concepts, and web analytics.prereq: [JOUR 3004 or 3004H], JOUR 3101, JOUR major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        }
      ]
    }
  },
  {
    "uid": "000230",
    "code": "JOUR3121",
    "subject": "JOUR",
    "number": "3121",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate News Reporting",
    "fullname": "Intermediate News Reporting",
    "info": "This course is a skills-based course designed to teach journalism students how to report and write the types of stories that are central to the basic beats in most newsrooms. The course expands upon the competencies learned in JOUR 3101, but requires more in-depth records searches, interviewing, and writing. Students also learn the basics of such subjects as libel law, public records law, and media ethics.  Students will learn in this course how to find news that matters to people, and how to write it so that readers understand it. Whether a student is planning a career in newspapers, television, or other media, they will learn enough to get started as a reporter and to understand how things work (or don't work) in a real newsroom. prereq: [JOUR 3004 or 3004H], JOUR 3101, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        }
      ]
    }
  },
  {
    "uid": "000232",
    "code": "JOUR3155",
    "subject": "JOUR",
    "number": "3155",
    "honors": false,
    "writingIntensive": false,
    "name": "Editing-Print/Digital Audience",
    "fullname": "Editing for Print and Digital Audiences",
    "info": "In this course, students will learn the fundamentals of editing for print and digital publications. Students will learn to edit copy, to exercise news judgment and to improve the flow and accuracy of stories. The course will also cover how to write search-engine friendly headlines, to utilize online tools for fact-checking and to execute compelling visual designs for digital and print. Successful students will develop an excellent understanding of AP style, hone their ability to improve copy and learn to navigate legal, ethical and production challenges. These skills are particularly important in the modern newsroom — where economic pressures have removed some layers of fact-checking and editing and forced traditional roles to shift and expand.prereq: [JOUR 3004 or 3004H], JOUR 3101, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        }
      ]
    }
  },
  {
    "uid": "000233",
    "code": "JOUR3173W",
    "subject": "JOUR",
    "number": "3173",
    "honors": false,
    "writingIntensive": true,
    "name": "Magazine & Feature Writing",
    "fullname": "Magazine & Feature Writing",
    "info": "This course is about writing feature stories for magazines. You'll learn how that enterprise differs from newspaper writing. You'll also learn about the various types of magazines that exist as well as what constitutes a magazine in this digital age. We will focus on niche - on the importance of writing for the magazine's audience. You'll learn how to sell your work to different markets and platforms. You'll also discover, if you don't already know it, that the best magazine writing is rooted in solid reporting. You'll be doing more interviewing, fact-finding, and field work than you may have imagined, all of which will improve your writing.prereq: [JOUR 3004 or 3004H], JOUR 3101, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        }
      ]
    }
  },
  {
    "uid": "000236",
    "code": "JOUR3201",
    "subject": "JOUR",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Strategic Comm",
    "fullname": "Principles of Strategic Communication",
    "info": "Strategic communication has been growing rapidly in the past two decades. In this course, you will be introduced to the two major fields of strategic communication, namely public relations and advertising. You will get fundamental understanding about the main theories, methods, and practices of strategic communication and engage with questions about the profession’s roles in society. Through the activities and assignments, you will gain entry-level skills such as handling consumer insights data, preparing creative briefs, designing ads headlines or thumbnails, and drafting campaign planning documents. These materials will help you build your strategic communication portfolio and explore your career paths and goals.prereq: [JOUR 3004 or 3004H or concurrent registration], [Jour major, Strat Comm major, Media & Information major or Media & Information minor or approved BIS/IDIM/ICP program]",
    "prereq": {
      "code": "JOUR 3004",
      "subject": "JOUR",
      "id": "3004"
    }
  },
  {
    "uid": "000231",
    "code": "JOUR3202",
    "subject": "JOUR",
    "number": "3202",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Communication: PR",
    "fullname": "Principles of Strategic Communication: Public Relations",
    "info": "History/development of public relations practice/principles. Professional writing assignments in various institutional settings. Analysis/critique of public relations in contemporary society.",
    "prereq": []
  },
  {
    "uid": "000237",
    "code": "JOUR3241W",
    "subject": "JOUR",
    "number": "3241",
    "honors": false,
    "writingIntensive": true,
    "name": "Advrtsng Strat/Creative Dvlpmt",
    "fullname": "Advertising Strategy and Creative Development",
    "info": "This course is focused on giving strategic communications students the tools needed to better understand how the creative process works to help solve business problems. We will accomplish this by studying successful advertising campaigns (current and past) and by creating concepts for campaigns. Advertising today is more than just the development of a traditional TV or print ad. Creative concepts include the traditional advertising platforms of TV, Radio, Print, and Outdoor along with the vast array of digital platforms. The strategic and creative development experiences and discussions from this class will help aid students in the development of decision-making and concept development skills that are needed to pursue a career in this field.prereq: [JOUR 3004 or 3004H], JOUR 3201, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "000238",
    "code": "JOUR3251",
    "subject": "JOUR",
    "number": "3251",
    "honors": false,
    "writingIntensive": false,
    "name": "Strat Comm Research & Analytic",
    "fullname": "Strategic Communication Research and Analytics",
    "info": "This course is designed to teach strategic communication students the fundamentals of research used by communication and marketing research professionals to evaluate the effectiveness of campaigns. Students will be exposed to various data collection and analysis methods with particular emphasis on quantitative research methods (e.g., surveys, experiments, digital analytics) commonly used to collect data to aid strategic communication decision making.prereq: JOUR 3004 or 3004H, JOUR 3201, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "807880",
    "code": "JOUR3253",
    "subject": "JOUR",
    "number": "3253",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Brand Planning",
    "fullname": "Strategic Brand Planning",
    "info": "This course examines the role of account planning in integrated marketing communications development for today’s complex cultural and media environments. It is designed to teach you how to use research and analytic tools to identify strategic insights about target consumers. These insights will then be used to develop effective brand positioning and message strategies. You will develop an awareness and understanding of the skills needed to become a strategic brand planner and an opportunity to apply these strategic skills in various situations and settings.prereq: [JOUR 3004 or 3004H], JOUR 3201, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "000251",
    "code": "JOUR3261",
    "subject": "JOUR",
    "number": "3261",
    "honors": false,
    "writingIntensive": false,
    "name": "Media Planning",
    "fullname": "Media Planning",
    "info": "The objective of the course is to provide a basic understanding of the media strategy, planning, and selection process within the context of the broader marketing communications process. The course will cover paid, owned and earned media across advertising, digital (including social), and direct marketing disciplines. The media planning process incorporates subjective decision making after reviewing significant amounts of objective data. The development of recommendations with supporting rationale is the basis for the process. Students are introduced to this process focusing on the prioritization of strategies and media selection within a fixed budget. Marketing and media examples covering number industries to help students grasp theoretical concepts. The media selection process incorporates the demographic media consumption patterns of the American consumer. Students will also be exposed to the measurement methodologies for all major media. The course will cover the strengths and weaknesses of various media and how they are applied to accomplish marketing communication objectives. Students will garner hands on experience with data and planning resources.prereq: [JOUR 3004 or 3004H], JOUR 3201, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "808086",
    "code": "JOUR3275",
    "subject": "JOUR",
    "number": "3275",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Strategy in Strat Comm",
    "fullname": "Digital Strategy in Strategic Communication",
    "info": "This course is designed to provide a basic understanding of digital communications and strategy development. The course covers the digital communications planning process and emphasizes how to develop effective communications strategies in today’s digital-centric environment. The digital revolution of the last fifteen years makes it imperative for communications professionals to understand how to evaluate and select digital marketing channels to best achieve business goals. This course is designed to assist students to build the professional skills they need to compete in a digital world. This course teaches students how to develop a digital communications plan from start to finish. Students will increase their understanding of how digital communications relate to more traditional marketing and PR tactics. Students will move through a discovery process learning to analyze consumers’ digital marketing behavior, their demand for content, the effectiveness of various social media channels including website performance. The course will review current digital tools, trends, and tactics; weighing the difference between what is “hot” versus which channels can best be used to achieve a brand’s communications goals. Students will leave the course with an increased knowledge of digital communications and ability to evaluate and strategically apply digital marketing techniques in a real-world communications environment.prereq: [JOUR 3004 or 3004H], JOUR 3201, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "000234",
    "code": "JOUR3279W",
    "subject": "JOUR",
    "number": "3279",
    "honors": false,
    "writingIntensive": true,
    "name": "Prof Writing for Strat Comm",
    "fullname": "Professional Writing for Strategic Communication",
    "info": "This course is designed to develop writing expertise for public relations and advertising agency work, corporate and non-profit strategic communication and development of tactical thinking and publicity techniques. The course focuses on developing the essential writing capabilities needed to complete a wide variety of projects in public relations and related strategic communication professions. It is designed to help students gain experience in researching, interviewing, writing, and producing materials used by strategic communication professionals. These include biographies, press releases, fact sheets, backgrounders, newsletters, brochures, speeches, A/V scripts, and other materials for broadcast.Discussion of public relations tactics, the role of public relations and advertising agencies and various media channels is integrated into the course – so that students should develop a strong understanding of the many aspects of the strategic communication profession. Theories of persuasion, social influence, and compliance gaining are interwoven into class discussions.prereq: [JOUR 3004 or 3004H], JOUR 3201, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "000239",
    "code": "JOUR3321",
    "subject": "JOUR",
    "number": "3321",
    "honors": false,
    "writingIntensive": false,
    "name": "Media Design",
    "fullname": "Media Design",
    "info": "This course will introduce students to basic skills in visual communication through hands-on projects, observation, discussion, and collaboration. Students will learn the vocabulary necessary to communicate effectively about graphic design processes. Students will develop a sense of their own design aesthetic and be able to talk about their solutions to design communication challenges by producing and presenting the projects assigned in the course. They also will learn to provide and receive constructive criticism and encouragement with their peers through both process and final class project critiques. Students will become familiar with the tools and processes necessary to execute simple design projects, from concept through production. Course projects will facilitate diversity through projects that reflect each students interests and research.prereq: [JOUR 3004 or 3004H or concurrent registration], [JOUR major or Strat Comm major]",
    "prereq": {
      "code": "JOUR 3004",
      "subject": "JOUR",
      "id": "3004"
    }
  },
  {
    "uid": "000240",
    "code": "JOUR3451",
    "subject": "JOUR",
    "number": "3451",
    "honors": false,
    "writingIntensive": false,
    "name": "TV/Radio/Digital News Reportg",
    "fullname": "TV, Radio and Digital News Reporting",
    "info": "This course is the introductory broadcast and digital writing and reporting course. It is the student's introduction to writing in broadcast and digital style, video photojournalism, and digital video editing. This is not a production class. It will apply journalism to the production techniques learned in JOUR 3102. Also included: source and story development, ethical decision-making, audio storytelling, and vocal and on-camera delivery.prereq: [JOUR 3004 or 3004H], JOUR 3101, JOUR 3102, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "code": "JOUR 3102",
          "subject": "JOUR",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "790568",
    "code": "JOUR3551",
    "subject": "JOUR",
    "number": "3551",
    "honors": false,
    "writingIntensive": false,
    "name": "Business of Digital Media",
    "fullname": "The Business of Digital Media: Innovation, Disruption, and Adaptation",
    "info": "Digital media enterprises have uprooted many established industries and continue to be among the most important factors shaping our economy and society today. Where do these innovations come from? Why do some startups prosper while others fail? How do legacy firms respond to disruptions to their business models? What makes adaptations possible? What makes them risky? Learn to analyze and evaluate the economic strategies of existing digital media firms across various sectors of society including news, entertainment, social media, mobile, and retail. Assess their impacts on cultural and civic life for better and for worse. Use these skills to incubate your own ideas for the next great media innovations of the future. ",
    "prereq": []
  },
  {
    "uid": "791364",
    "code": "JOUR3552",
    "subject": "JOUR",
    "number": "3552",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech, Comm & Global Society",
    "fullname": "Technology, Communication & Global Society",
    "info": "This course examines the various ways in which technology continues to evolve, and to have a role in ongoing societal changes. The course focuses on unpacking the specific ways in which technology are evolving, and connecting those changes to impacts on communication and media  A variety of theories or perspectives relevant or related to technology use and global communication will be considered to help make sense of the interplay between the technology use and societies in a global setting. The course is divided into three main parts: first, understanding of the specifics of relevant technology; second, connecting the technical features to theoretical views of technology; third, examining global patterns of technology use in media and communication.  The readings and discussions place special emphasis on specific forms of technology, including mobile phones, Web, and social media. Grounded in a global context, we will investigate the political, cultural, social, technological, and economic conditions that shape and are shaped by the presence of the Internet at the national and cross-national levels; the effects of technology use on the form and content of mass communication at the global level; and the implications of technology use for human and social relations across national borders.",
    "prereq": []
  },
  {
    "uid": "820347",
    "code": "JOUR3553",
    "subject": "JOUR",
    "number": "3553",
    "honors": false,
    "writingIntensive": false,
    "name": "Mobile Communication",
    "fullname": "Mobile Communication",
    "info": "In the past 20 years, mobile communication has emerged as a rapidly-growing, popular, and economically and socially significant mode of communication around the world. First as voice-only devices intended for business use, mobile devices have proliferated and gained new functionalities. Smartphones are now the most common means of internet access in many countries, and mobile devices have brought together the capabilities of watches, computers, GPS trackers, and many other specialized tools. Today, two-thirds of the world’s population has reliable mobile phone access, and there are more mobile devices in existence than there are people on earth.In light of these rapid developments, this course introduces students to scholarly analysis of mass mobile phone communication in the United States and globally. Beginning with a set of foundational discussions about mobile communication, the course moves through a series of thematic units examining mobile crowdsourcing, social movements, social life, development, media, and the future of mobile communication. Throughout, the course explores how mobile devices have been put to use and what new possibilities and risks lie ahead. ",
    "prereq": []
  },
  {
    "uid": "798216",
    "code": "JOUR3590",
    "subject": "JOUR",
    "number": "3590",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic Mass Comm: Context",
    "fullname": "Special Topics in Mass Communication: Context",
    "info": "Context course not regularly offered. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "000546",
    "code": "JOUR3614",
    "subject": "JOUR",
    "number": "3614",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Media Communication",
    "fullname": "History of Media Communication",
    "info": "In the history of humankind, there have been five major changes in how we communicate and we're in the middle of the latest revolution. This class helps you make sense of these uncharted waters by exploring how humanity adopted, and adapted to, past disruptions. From the alphabet to the internet and social media, learn how technological innovations in the media have changed not only how people share information and values but also what people have communicated throughout history. We will learn about these five phases in mediated communication over 5,000 years, and how they relate to major changes in politics, society and culture. And then we'll use history's lessons to peek into the future: When presidents tweet and everyone's foodie photos are on Instagram, how does the world communicate?",
    "prereq": []
  },
  {
    "uid": "800798",
    "code": "JOUR3615",
    "subject": "JOUR",
    "number": "3615",
    "honors": false,
    "writingIntensive": false,
    "name": "History of the Documentary",
    "fullname": "History of the Documentary",
    "info": "Invention of photographic media. Truth-value of factual versus fictive representations. Influence of political/economic contexts on form/content. Convergence of distinct realms of media practice. Role of media maker. Documentary photography/film. Screenings of landmark films, photographs.",
    "prereq": []
  },
  {
    "uid": "819854",
    "code": "JOUR3690",
    "subject": "JOUR",
    "number": "3690",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic Jour Skills",
    "fullname": "Special Topics in Journalism Skills",
    "info": "Journalism professional skills course not regularly offered.  Topics and prerequisites specified in Class Schedule.  Students must be Journalism majors and meet the prerequisites for the specific course offering.",
    "prereq": []
  },
  {
    "uid": "000241",
    "code": "JOUR3741",
    "subject": "JOUR",
    "number": "3741",
    "honors": false,
    "writingIntensive": false,
    "name": "Diversity and Media",
    "fullname": "Diversity and Media",
    "info": "How are our perceptions of crime been influenced by the news? How do social movements use media to share their messages? What can we as audiences do? Social media, news, and entertainment media help shape our ideas about identity and differences. Learn how representation and inclusion have been negotiated through media with a particular focus on local case studies. Topics include race, ethnicity, social class, physical ability, and gender. Students will learn how to use media literacy to build a just and equitable society.",
    "prereq": []
  },
  {
    "uid": "000243",
    "code": "JOUR3745",
    "subject": "JOUR",
    "number": "3745",
    "honors": false,
    "writingIntensive": false,
    "name": "Media and Popular Culture",
    "fullname": "Media and Popular Culture",
    "info": "Popular culture is everywhere. Social media, film, music, video games, television, websites, and news bring popular culture into our daily lives. In this class, we will examine popular culture in modern and historical contexts through various mass communication, sociological, and cultural theories. Is popular culture of the people? or dictated by corporate interests? What social and commercial pressures result in stereotypes, misrepresentation and exclusion in popular culture? Does popular culture mirror or shape social reality? This course will provide you with the tools to become active and thoughtful consumers of media and popular culture.",
    "prereq": []
  },
  {
    "uid": "790548",
    "code": "JOUR3751",
    "subject": "JOUR",
    "number": "3751",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Media and Culture",
    "fullname": "Digital Media and Culture",
    "info": "How have digital media innovations like social media, mobile phones, artificial intelligence, drones and games shaped and been shaped by a culture and society globally? Learn to critically examine the function of digital media in your life. Take away a socio-historical understanding of digital media innovation, and the social, political, and economical impact of new media in creativity, industry, and culture from a cross-disciplinary perspective. Topics range from the concept of branding in an online context, to the varied uses of digital media in the context of journalism, social mobilization, law and privacy, business, globalization, content creation, and beyond. You will read, discuss, and debate cutting edge material from documentaries, podcasts, popular press, and academic literature. This course balances local contexts with global perspectives, and provides details into the practicalities of working and living in a new media environment.",
    "prereq": []
  },
  {
    "uid": "817966",
    "code": "JOUR3757",
    "subject": "JOUR",
    "number": "3757",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Communication Strategy",
    "fullname": "Principles of Health Communication Strategy",
    "info": "Health information is in the news, nearly every corner of the internet, on your favorite television show, and advertising campaigns. Using principles of mass communication, public health, sociology, and psychology this course explores how mediated health content impacts students' lives at both micro- and macro-levels. We will explore questions such as: how do individuals use media to achieve health-related goals? What role does media and health literacy play in achieving these goals? What effect does health information in entertainment media or strategic public health campaigns, for example, effect your own health-related beliefs and behaviors? To what extent do media portrayals of health and illness impact society?s understanding of complex health issues such as mental health, substance use disorder, or cancers? What influence does news coverage of health issues have on health policy and health reform? ",
    "prereq": []
  },
  {
    "uid": "826579",
    "code": "JOUR3761",
    "subject": "JOUR",
    "number": "3761",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Media Management",
    "fullname": "Social Media Management",
    "info": "Social media has changed how businesses and nonprofits function. In almost every industry,\nsocial media has driven fundamental changes in how audiences interact with brands and each\nother. Social media has also opened up new communication channels for brands to connect\nwith existing and potential audiences. This course is designed to help you understand the\nimpact the rise of social media has had on organizations. The course has a broad focus on\nsocial media to orient social media management from a communication strategist’s standpoint.\nYou will gain a clear perspective on audiences’ social interactions, various social media\nplatforms available to businesses and nonprofits, current social media strategy practices, and\ntools for tracking effective engagement. You will also gain the practical skills necessary to\ndevelop digital communication strategies that achieve an organization's goals.",
    "prereq": []
  },
  {
    "uid": "000552",
    "code": "JOUR3771",
    "subject": "JOUR",
    "number": "3771",
    "honors": false,
    "writingIntensive": false,
    "name": "Media Ethics",
    "fullname": "Media Ethics",
    "info": "Citizens expect journalists to separate fact from falsehoods, opinion and propaganda. But is it possible for journalists to be unbiased and objective? Advertisers are expected to push products. But is it acceptable to mislead by exaggerating what the product can do? Public relations professionals must protect a company's brand. But what should they do when a company becomes entangled in a scandal? This course examines the ethical and unethical ways that communicators respond to such challenges, and uses real-life examples to identify values and principles that can lead to sound, ethical decisions under the most difficult circumstances. Learn about ethical communication on all platforms, from television to social media to newspapers and magazines. Build a solid foundation for your own ethical thinking that can guide you as a student and as a professional communicator.",
    "prereq": []
  },
  {
    "uid": "808233",
    "code": "JOUR3775",
    "subject": "JOUR",
    "number": "3775",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Communication Law",
    "fullname": "Strategic Communication Law",
    "info": "Learn practical legal skills and ethics as they pertain to marketing, public relations and advertising by focusing on the actions of the Federal Trade Commission, the Federal Communications, and the Federal Elections Commission. Learn about the administrative process including adjudication and rule making. Learn through a range of legal, policy and ethics discussions ranging from the First Amendment, the regulation of commercial speech, advertising deception, substantiation of material claims, digital privacy, contesting, political advertising, and controls on native advertising and social media influencers.",
    "prereq": []
  },
  {
    "uid": "000244",
    "code": "JOUR3776",
    "subject": "JOUR",
    "number": "3776",
    "honors": false,
    "writingIntensive": false,
    "name": "Media Law",
    "fullname": "Media Law",
    "info": "The First Amendment protects the freedom of speech, and of the press. Does that mean that journalists can write anything they want, broadcast any video images they choose, or go wherever they like in order to gather news? In this course, we will examine significant court decisions that have defined the legal rights and privileges of journalists. We will look at statutes like the Freedom of Information Act and journalist 'shield laws.' We will consider how new technology raises questions, and challenges, about how to balance First Amendment freedoms with other interests, like privacy and national security. Learn legal rules and principles, and apply them in classroom debate and discussion and in written exercises and examinations. The goal is to understand how the First Amendment and other laws protect the rights of freedom of expression, not just for journalists, but for all of us.",
    "prereq": []
  },
  {
    "uid": "000245",
    "code": "JOUR3786",
    "subject": "JOUR",
    "number": "3786",
    "honors": false,
    "writingIntensive": false,
    "name": "Media and Politics",
    "fullname": "Media and Politics",
    "info": "Do facts matter anymore? Is press freedom under threat? Are audiences trapped in filter bubbles? Why do people hate the media, and how can the news be improved to better serve citizens? Explore the historical and contemporary dynamics that shape the relationship between professionals in the media, the mass public, and political actors across different parts of government. Study major forms of mass media, including television and newspapers, alongside new forms such as digital and social media. Look at specific reporting rituals and practices, as well as issues involving media ownership, regulation, ethics, and press freedom. We will study politicians? efforts to craft messages, advertise strategically, and target select audiences for political gain. The course will focus primarily, but not exclusively, on the United States, and you will be asked to engage with current events and the role of communication technologies in political and civic life.",
    "prereq": []
  },
  {
    "uid": "819834",
    "code": "JOUR3790",
    "subject": "JOUR",
    "number": "3790",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic SC Skills",
    "fullname": "Special Topics in Strategic Communication Skills",
    "info": "Strategic Communication professional skills course not regularly offered.  Topics and prerequisites specified in Class Schedule.  Students must be Strategic Communication majors and meet the prerequisites for the specific course offering.",
    "prereq": []
  },
  {
    "uid": "819835",
    "code": "JOUR3890",
    "subject": "JOUR",
    "number": "3890",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic SC Skills-plg",
    "fullname": "Special Topics in Strategic Communication Skills - Planning",
    "info": "Strategic Communication professional skills planning course not regularly offered.  Topics and prerequisites specified in Class Schedule.  Students must be Strategic Communication majors and meet the prerequisites for the specific course offering.",
    "prereq": []
  },
  {
    "uid": "000558",
    "code": "JOUR3896",
    "subject": "JOUR",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Internship",
    "fullname": "Directed Internship",
    "info": "This is an independent study internship practicum.  Students obtain an internship with the organization of their choice, such as a TV station, advertising agency, magazine, corporation or non-profit organization, to gain real-world professional experience. The internship should be in students field of concentration and improve their professional skills; the internship should be guided by a person already working in their chosen field.  The course will assist students to examine, reflect on and construct meaning from their internship experience and will encourage them to examine what it means to be a professional and to operate within professional environments.  A student may only earn credit for a given internship through one course at a time. prereq: Jour major, dept consent",
    "prereq": []
  },
  {
    "uid": "000559",
    "code": "JOUR3990",
    "subject": "JOUR",
    "number": "3990",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic in Mass Comm: Prof",
    "fullname": "Special Topics in Mass Communication: Professional",
    "info": "Professional-skills-learning opportunity not regularly offered. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "000557",
    "code": "JOUR3993",
    "subject": "JOUR",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed study, projects.Prereq [Jour major or jour minor or approved IDIM major or ICP major or BIS major], instr consent, dept consent, college consent.Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including: the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project. the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit)the faculty mentor is qualified to serve in this roleassessment of student learning and grading criteria are clear and appropriatethe student will be working in a respectful, inclusive environment",
    "prereq": []
  },
  {
    "uid": "000560",
    "code": "JOUR4171",
    "subject": "JOUR",
    "number": "4171",
    "honors": false,
    "writingIntensive": false,
    "name": "Covering the Arts",
    "fullname": "Covering the Arts",
    "info": "As arts journalism continues to migrate from print to online media, the distinctions between entertainment and art have begun to merge, and the boundaries between professional journalism and promotion have blurred. Yet the task of the arts journalist remains an important independent voice for developing arts literacy on print and digital platforms. This course will not only develop practical and critical thinking needed to write about the arts as a journalist but will also do so via digital approaches to arts coverage. Accordingly, students will be immersed and engaged on a variety of platforms to produce relevant journalism about a wide variety of arts for 21st  century readers.prereq: [Jour 3004 or 3004H], Jour 3101, [Jour major, Mass Comm major or approved BIS/IDIM/ICP program]",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        }
      ]
    }
  },
  {
    "uid": "818921",
    "code": "JOUR4172",
    "subject": "JOUR",
    "number": "4172",
    "honors": false,
    "writingIntensive": false,
    "name": "Sports Reporting",
    "fullname": "Sports Reporting",
    "info": "This course will cover game-story writing, multimedia/digital storytelling, interview/press conference techniques, sports-business reportage, data-driven journalism, effective use of social media and opinion/column writing. Top sports media professionals and other local sports personalities will come in periodically to tell their stories and teach students some of what they know about good sports journalism. The aim of this course is to provide first steps toward working in today's sports media environment. Some possible sports career destinations include becoming: an authoritative sports blogger; TV sports anchor, reporter, or sideline analyst; beat reporter or sports editor for a newspaper (and its website); team sports information director; writer of long, beautiful prose for a national magazine or website.prereq: [JOUR 3004 or 3004H], JOUR 3101, JOUR 3121 or instructor permission, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "code": "JOUR 3121",
          "subject": "JOUR",
          "id": "3121"
        }
      ]
    }
  },
  {
    "uid": "819594",
    "code": "JOUR4173",
    "subject": "JOUR",
    "number": "4173",
    "honors": false,
    "writingIntensive": false,
    "name": "Podcast Production",
    "fullname": "Podcast Production and Storytelling",
    "info": "Nieman Journalism lab declared Podcasting the last mass medium. WNYC invested $15 million in development on podcasts last year alone with the New York Times, the LA Times, and now the Washington Post not far behind.  Whether it's for news and information, strategic communication messaging, or pure entertainment, podcasting has changed how the world seeks and delivers information.  This class will take the mystery out of audio: what makes it different, where its challenges lie, and what makes it such an enticing medium to work in.  Students will learn the basics of narrative audio storytelling, which is used extensively in some of the most influential podcasts including Serial, This American Life, Caliphate, Dirty John to podcasts like Target's Coffee and Crayons (produced in partnership with Slate Studios) and the Trader Joe's podcast Inside Trader Joe’s. Audio has the power to involve the listeners, to make them a part of the story - whether it's buying crayons or explaining an Islamic insurgency - the tools are the same: real voices, sound, and conversational writing. Students will learn how to harness sound, to use it to develop a narrative and tell stories with scope, sound, and texture.prereq: [JOUR 3004 or 3004H], JOUR 3101, JOUR 3102, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "code": "JOUR 3102",
          "subject": "JOUR",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "792927",
    "code": "JOUR4175",
    "subject": "JOUR",
    "number": "4175",
    "honors": false,
    "writingIntensive": false,
    "name": "Brovald-Sim Comm Journalism",
    "fullname": "Brovald-Sim Community Journalism Practicum",
    "info": "Community journalism is arguably the most relevant source of news and information for our citizenry, whether in urban, suburban, or rural settings. That's still true today, but the nature of what we call community journalism is changing. For decades, community journalism has been defined by its geographical boundaries, concerning chiefly the institutions - schools, churches, businesses, or government - within those borders. While that traditional community journalism is certainly still alive today, the reach of digital journalism and social media has transformed the notion of community. New communities can define themselves beyond geography, a shift that creates opportunities for journalists to cover a broader sense of \"where\" people live. This course will explore this shift through practical, hands-on experience, and thoughtful consideration of the journalist's role in covering diverse communities. Through readings, lectures and discussions with professionals who do the work, students will consider the notion of community journalism and the best practices for it. Students will target a community in and around the University of Minnesota and develop cover that community on the student-run website AccessU. The goal is for those teams to publish relevant stories about the community on that site in text, photos, video, and visualizations.prereq: [JOUR 3004 or 3004H], JOUR 3101, [JOUR 3103 or JOUR 3121 or JOUR 3155 or JOUR 3173 or JOUR 4302], Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "or": [
            {
              "code": "JOUR 3103",
              "subject": "JOUR",
              "id": "3103"
            },
            {
              "code": "JOUR 3121",
              "subject": "JOUR",
              "id": "3121"
            },
            {
              "code": "JOUR 3155",
              "subject": "JOUR",
              "id": "3155"
            },
            {
              "code": "JOUR 3173",
              "subject": "JOUR",
              "id": "3173"
            },
            {
              "code": "JOUR 4302",
              "subject": "JOUR",
              "id": "4302"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "800231",
    "code": "JOUR4242",
    "subject": "JOUR",
    "number": "4242",
    "honors": false,
    "writingIntensive": false,
    "name": "Advertising Portfolio Dvlpmnt",
    "fullname": "Advertising Portfolio Development",
    "info": "This course improves students' creative development and conceptual thinking. Students will develop creative ideas based on sound strategies, with emphasis on developing ideas for current and evolving creative media opportunities. At the end of the term, students will be able to apply strategic and insightful creativity to advertising ideas and will have a basic understanding of how to put a book together for the field of advertising.prereq: [JOUR 3004 or 3004H], JOUR 3201, JOUR 3241, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        },
        {
          "code": "JOUR 3241",
          "subject": "JOUR",
          "id": "3241"
        }
      ]
    }
  },
  {
    "uid": "814256",
    "code": "JOUR4243",
    "subject": "JOUR",
    "number": "4243",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Content for Brand Comm",
    "fullname": "Digital Content Development and Production for Brand Communications",
    "info": "This course focuses on the conceptual and practical skills necessary for strategic communication practitioners, especially those focused on careers in public relations, corporate communications, and sponsored content generation, to create, produce, publish, and distribute content for brands. The course addresses new technologies for branded storytelling including various forms of online video, longer form digital content such as blogs and web sites, and social media community content created for social platforms. The course also incorporates elements of user experience and graphic design and the skills necessary to adapt and modify content in an iterative process after analyzing audience data.  Discussion of professional ethics in the creation of branded content is incorporated throughout.prereq: [JOUR 3004 or 3004H], JOUR 3201, [JOUR 3241 or JOUR 3279], Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        },
        {
          "or": [
            {
              "code": "JOUR 3241",
              "subject": "JOUR",
              "id": "3241"
            },
            {
              "code": "JOUR 3279W",
              "subject": "JOUR",
              "id": "3279W"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "825075",
    "code": "JOUR4244",
    "subject": "JOUR",
    "number": "4244",
    "honors": false,
    "writingIntensive": false,
    "name": "Crisis Communication",
    "fullname": "Crisis Communication",
    "info": "This course teaches the concepts and strategies of effective crisis communication. Crisis communication is an important and integral part of an organization's strategic communication repertoire. Effective crisis communication can save lives, reduce negative outcomes, and protect an organization's employees, reputation, and brand image. Topics taught in this course include crisis type identification and evaluation, forming a crisis management team, planning and execution of crisis communication strategies, and post-crisis communication evaluation. Case studies will be used to teach and analyze crisis communication concepts. Students will participate in a crisis communication simulation to gain experience planning and executing the concepts and strategies learned in this course. prereq: [Jour 3004 or 3004H], Jour 3201, any 32xx skills course, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "000250",
    "code": "JOUR4251",
    "subject": "JOUR",
    "number": "4251",
    "honors": false,
    "writingIntensive": false,
    "name": "Psychology of Advertising",
    "fullname": "Psychology of Advertising",
    "info": "Ever wonder what your brain does when you see an advertisement? Ever wonder why advertisements work? And why sometimes they don't? How does advertising compel you to buy things you don't need and what strategies do you use to resist these messages? In this course we explore a range of theories that explain how advertisements influence memory, attitudes, emotions, and behaviors and how humans actively process and resist persuasive messages.  ",
    "prereq": []
  },
  {
    "uid": "825121",
    "code": "JOUR4258",
    "subject": "JOUR",
    "number": "4258",
    "honors": false,
    "writingIntensive": false,
    "name": "Corp Soc Responsibility Comm",
    "fullname": "Corporate Social Responsibility Communication",
    "info": "This course seeks to provide the knowledge and skills needed to research, plan, and implement communication campaigns for corporate social responsibility (CSR) practices. In response to increasing social demand, corporations today make significant efforts to integrate CSR initiatives into all aspects of their business. Strategic communication of CSR has a vital role to play in maximizing its business impact, but also creating a more responsible and sustainable society. Effective CSR initiatives and communication must be deliberate, planned, and evaluated. This course examines theories and practices related to CSR in order to understand the business environment in which public relations/advertising operate and apply them to developing and evaluating communication campaigns. Specifically, this course provides an overview of CSR, its evolution, and theories in management and psychology that underlay strategic approaches and consumer behavior. This course also covers the planning and integration of media into strategic CSR communication programs. Students will learn to set objectives, develop CSR campaign plans, integrate traditional and social media into overall communication plans, measure program results, utilize digital media technologies, and about the macro-environmental issues affecting CSR governances.prereq: [JOUR 3004 or 3004H], JOUR 3201, any 32xx skills course, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "000248",
    "code": "JOUR4259",
    "subject": "JOUR",
    "number": "4259",
    "honors": false,
    "writingIntensive": false,
    "name": "Strat Comm Case Analysis",
    "fullname": "Strategic Communication Case Analysis",
    "info": "This course explores a wide range of strategic communications campaigns in a case study setting. Students will explore real-life situations and analyze them from a strategic, integrated communications point of view. The cases will focus on building relationships with key stakeholder groups, using strategic communication in today’s global environment, and critically analyzing ethical and legal issues. The course objective is to provide students with opportunities to apply their analytical skills when identifying communication opportunities and problems, evaluating the cost and benefits of alternative communication strategies, and evaluating the outcomes of communication campaign decisions. Students will learn how quantitative and qualitative evidence can be used to support strategic decisions, recommendations, and campaign evaluation. Campaigns are drawn from the business, nonprofit, government, and political sectors, and they focus on communication issues addressed through strategic communication, including public relations, advertising, marketing, and/or social media. Students also examine cases involving crisis communication, media relations, and multicultural communication. The case study approach will prepare students to develop their decision-making skills based on best practices learned through the critical evaluation of past and present campaigns.prereq: [JOUR 3004 or 3004H], JOUR 3201, any 32xx skills course, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "808050",
    "code": "JOUR4262",
    "subject": "JOUR",
    "number": "4262",
    "honors": false,
    "writingIntensive": false,
    "name": "Management for Strat Comm",
    "fullname": "Management for Strategic Communication",
    "info": "This course teaches the concepts and methods for effective management by placing them in the context of organizations in the field of strategic communication. These organizations are diverse in their scale of operations and in the products and services they produce. They are highly responsive to the latest developments in digital media technology, conditions in the local and global economy, and trends in society. They include advertising agencies, public relations firms, media organizations, digital media agencies, brand content developers, and communication departments in client organizations, both for profit and nonprofit businesses. The topics taught in this course include strategic business planning, budgeting, understanding fundamental financial concepts, leadership skills, human resource management, project management and marketing, and selling skills. The concepts, skills and perspectives covered in this course apply to both working within organizations and to understanding the business circumstances of clients and competitors. The course also serves to awaken students to the potential, when opportunities arise, to propose and develop new business ideas of their own.prereq: [JOUR 3004 or 3004H], JOUR 3201, any 32xx skills course, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "000252",
    "code": "JOUR4263",
    "subject": "JOUR",
    "number": "4263",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Comm Campaigns",
    "fullname": "Strategic Communication Campaigns",
    "info": "This course provides an in-depth look at all aspects of strategic communications culminating in the development of a strategically sound communications campaign.  Emphasis is on “real-life” examples of campaigns, their creation, and development.  All essentials of developing a strategic campaign are covered, including advertising strategy, positioning, developing creative, consumer research, planning and setting objectives, media strategies, budgeting, public relations programs, and promotion.  This course is designed to bring together all aspects of communications planning that students have gained from previous classes.  The class will focus on the integration of various techniques and elements available to most effectively create a strategic communications campaign.  This course will simulate the teamwork involved in working in a strategic communications agency.  Case studies will be used extensively to apply the theory to the practice in a meaningful, memorable way.prereq: [JOUR 3004 or 3004H], JOUR 3201, any 32xx skills course, any 4/5xxx skills course or coreq, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "826026",
    "code": "JOUR4264",
    "subject": "JOUR",
    "number": "4264",
    "honors": false,
    "writingIntensive": false,
    "name": "Campaigns/NSAC",
    "fullname": "Campaigns/National Student Advertising Competition",
    "info": "This course is designed to bring together all aspects of strategic communications planning that students have gained from previous strategic communication classes. This class will aid students in the development of decision-making skills that are needed to develop an integrated\nstrategic communications plan. All the essentials of developing a campaign are covered, including advertising strategy, brand positioning, developing creative/content, consumer research, planning and setting communication objectives, media strategies/plans, budgeting, public relations programs, digital, social, and promotion. The core project in this course will be participation in the AAF's National Student Advertising\nCompetition (NSAC).\n\nStudents will need to apply to the NSAC Competition team for admission to this class. Applications to register for this course will be available through the Hubbard School student services office (sjmcugs@umn.edu).",
    "prereq": []
  },
  {
    "uid": "790547",
    "code": "JOUR4272",
    "subject": "JOUR",
    "number": "4272",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Advertising",
    "fullname": "Digital Advertising: Theory and Practice",
    "info": "This course introduces you to the fascinating and ever-changing world of digital advertising and marketing. Learn its history and evolution, current trends, future possibilities, and legal/ethical issues. We'll study the innovative research and theories explaining the practice and effects of various forms, including social media, search marketing, gaming, native, viral, online video advertising, online behavioral advertising, and mobile. Through a combination of lectures, in-class discussions, and guest presentations by industry professionals, you'll learn the basic theories for developing effective and socially-responsible digital advertising campaigns in the increasingly diverse and global media environment.",
    "prereq": []
  },
  {
    "uid": "000253",
    "code": "JOUR4274W",
    "subject": "JOUR",
    "number": "4274",
    "honors": false,
    "writingIntensive": true,
    "name": "Advertising in Society",
    "fullname": "Advertising in Society",
    "info": "Advertising in Society asks students to think about the ways that advertising intersects with cultural and political life in the 21st century, examining the influence of advertising from many perspectives—legal, constitutional, social and ethical. This course tackles a variety of current topics in advertising, including the many other powerful social institutions that advertising underpins (such as journalism and entertainment content), the role of American political advertising, the way advertising depicts gender and sexuality, the obligations of advertisers toward vulnerable audiences, and the ethics and impact of increasingly pervasive personalized hyper-niche ads on Twitter, Facebook and Instagram. This course helps students learn how to conduct thorough analyses of issues, develop positions on issues, and present coherent and convincing arguments for the positions they have taken. ",
    "prereq": []
  },
  {
    "uid": "790718",
    "code": "JOUR4302",
    "subject": "JOUR",
    "number": "4302",
    "honors": false,
    "writingIntensive": false,
    "name": "Photojournalism",
    "fullname": "Photojournalism",
    "info": "Students in this course can expect to learn skills in understanding convergence journalism and visual roles and responsibilities in newsrooms, understanding basic video news production using a DSLR, and using those to create a portfolio of still images with significant journalistic content. Students will study some concept and theory, plus approaches in covering story events and using a variety of technologies to gather, edit, and disseminate stories. Students will look at ways to tailor stories for print, broadcast, web, and mobile reporting, and talk about the differences in audience and will study ethics all along the way, too. Students will get photo-nerdy. They will learn production skills that include visual grammar and application, how to use a DSLR camera for both still and video images, and how to use light and color to tell news and feature stories. Plus, students will learn to edit photos and video for great images and for great stories. prereq: [JOUR 3004 or 3004H], JOUR 3101, JOUR 3102, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "code": "JOUR 3102",
          "subject": "JOUR",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "801898",
    "code": "JOUR4303",
    "subject": "JOUR",
    "number": "4303",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Visual Storytelling",
    "fullname": "Advanced Visual Storytelling",
    "info": "Students produce in-depth multimedia stories, using photography, audio, video, text, and infographics, working both individually and in groups. Students will produce and participate in a completed multimedia project (with at least three story forms)  by the end of the semester. Students examine the implications of differing approaches to multimedia production and consider ethical issues raised by it. Exemplary work of multimedia journalism is regularly presented and reviewed.prereq: [JOUR 3004 or 3004H], JOUR 3101, JOUR 3102, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "code": "JOUR 3102",
          "subject": "JOUR",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "000256",
    "code": "JOUR4321",
    "subject": "JOUR",
    "number": "4321",
    "honors": false,
    "writingIntensive": false,
    "name": "Publication Graphics",
    "fullname": "Publication Graphics",
    "info": "Design process applied to production of magazines, brochures, newsletters. Computer as tool to prepare electronic documents for printing.",
    "prereq": []
  },
  {
    "uid": "000258",
    "code": "JOUR4451",
    "subject": "JOUR",
    "number": "4451",
    "honors": false,
    "writingIntensive": false,
    "name": "Long-form Video Reporting",
    "fullname": "Long-form Video Reporting",
    "info": "Emphasis in this course is on longer-form storytelling using video, audio, graphics and still photography, edited into multimedia presentations for journalistic and persuasive messages.  Story conceptualization, enterprise, source development, access, narrative approaches and related issues will be addressed.  Ethical and legal implications of multimedia storytelling in journalistic and strategic communications settings will be reviewed.prereq: [Jour 3004 or 3004H], Jour 3101, Jour 3102, Jour 3451 [Jour major, Mass Comm major or approved BIS/IDIM/ICP program]",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "code": "JOUR 3102",
          "subject": "JOUR",
          "id": "3102"
        },
        {
          "code": "JOUR 3451",
          "subject": "JOUR",
          "id": "3451"
        }
      ]
    }
  },
  {
    "uid": "000257",
    "code": "JOUR4452",
    "subject": "JOUR",
    "number": "4452",
    "honors": false,
    "writingIntensive": false,
    "name": "Newscast Producing",
    "fullname": "Newscast Producing",
    "info": "The emphasis of the course is planning, writing, producing and presenting live TV newscasts. Students will produce University Report newscasts during the semester. Much of the class will also be spent writing broadcast news copy. Students will also generate their own stories as needed and anchor newscasts or segments. prereq: [Jour 3004 or 3004H], Jour 3101, Jour 3102, Jour 3451 [Jour major, Mass Comm major or approved BIS/IDIM/ICP program]",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "code": "JOUR 3102",
          "subject": "JOUR",
          "id": "3102"
        },
        {
          "code": "JOUR 3451",
          "subject": "JOUR",
          "id": "3451"
        }
      ]
    }
  },
  {
    "uid": "798217",
    "code": "JOUR4590",
    "subject": "JOUR",
    "number": "4590",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic Mass Comm: Context",
    "fullname": "Special Topics in Mass Communication: Context",
    "info": "Special context topics not regularly offered. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "000263",
    "code": "JOUR4611",
    "subject": "JOUR",
    "number": "4611",
    "honors": false,
    "writingIntensive": false,
    "name": "Dev Amer Broadcastg",
    "fullname": "Development of American Broadcasting",
    "info": "Historic/economic development of U.S. radio/television. Government regulation, industry self-regulation, forms of social control. Issues in contemporary broadcasting. Journalist as broadcaster.",
    "prereq": []
  },
  {
    "uid": "819836",
    "code": "JOUR4690",
    "subject": "JOUR",
    "number": "4690",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic Jour Skills",
    "fullname": "Special Topics in Journalism Skills",
    "info": "Journalism professional skills course not regularly offered.  Topics and prerequisites specified in Class Schedule.  Students must be Journalism majors and meet the prerequisites for the specific course offering.",
    "prereq": []
  },
  {
    "uid": "000265",
    "code": "JOUR4721",
    "subject": "JOUR",
    "number": "4721",
    "honors": false,
    "writingIntensive": false,
    "name": "Mass Media and U.S. Society",
    "fullname": "Mass Media and U.S. Society",
    "info": "Are the news media doing a good job? How can you tell? Does it matter? Is The Daily Show the best news program on television? Why or why not? Most people seem to have an opinion about all of these questions. Most discussions seem to center on one of four themes: 1) who owns the media and what they care about; 2) whether the news media are becoming more or less credible and/or biased; 3) whether entertainment is replacing or enhancing information in news programming; and 4) how much, if at all, is the Internet changing everything about the way the media work, including who we think of as a journalist. Mass Media and U.S. Society explores the validity and importance of these themes in terms of what roles can the media play in society, what roles does it play, and how have those roles have changed over time. The course draws on ideas from various social sciences to develop tools for discussing a number of specific issues related to these themes. ",
    "prereq": []
  },
  {
    "uid": "819837",
    "code": "JOUR4790",
    "subject": "JOUR",
    "number": "4790",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic SC Skills",
    "fullname": "Special Topics in Strategic Communication Skills",
    "info": "Strategic Communication professional skills courses are not regularly offered. Topics and prerequisites are specified in the class schedule. Students must be Strategic Communication majors and meet the prerequisites for the specific course offering.",
    "prereq": []
  },
  {
    "uid": "000270",
    "code": "JOUR4801",
    "subject": "JOUR",
    "number": "4801",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Communication",
    "fullname": "Global Communication",
    "info": "How does communication affect international affairs? That's literally a question of war and peace, and this class guides you through the big theories and the real life stories of how news, information and entertainment travels around the world. Analyze the role of communication in globalization, addressing possible interpretations ranging from cultural imperialism to democratic development. Examine how different media cover foreign countries. What does it take to cover the world, historically and at a time of unprecedented challenges for professional journalism? What are the practices that have made international news what it is for the last century? Through theory and case studies from journalists and diplomats, examine the possible effects of international communication on international relations and policy making. ",
    "prereq": []
  },
  {
    "uid": "819838",
    "code": "JOUR4890",
    "subject": "JOUR",
    "number": "4890",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topic SC Skills-plg",
    "fullname": "Special Topics in Strategic Communication Skills - Planning",
    "info": "Strategic Communication professional skills planning course not regularly offered.  Topics and prerequisites specified in Class Schedule.  Students must be Strategic Communication majors and meet the prerequisites for the specific course offering.",
    "prereq": []
  },
  {
    "uid": "790951",
    "code": "JOUR4990",
    "subject": "JOUR",
    "number": "4990",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topics in Mass Comm: Prof",
    "fullname": "Special Topics in Mass Communication: Professional",
    "info": "Professional-skills-learning opportunity not regularly offered. Topics specified in Class Schedule.prereq: [3101 or 3201 or 3202)], 3004, [Jour major or approved IDIM major or ICP major or BIS major]",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "JOUR 3101",
              "subject": "JOUR",
              "id": "3101"
            },
            {
              "code": "JOUR 3201",
              "subject": "JOUR",
              "id": "3201"
            },
            {
              "code": "JOUR 3202",
              "subject": "JOUR",
              "id": "3202"
            }
          ]
        },
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        }
      ]
    }
  },
  {
    "uid": "818716",
    "code": "JOUR4999",
    "subject": "JOUR",
    "number": "4999",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone",
    "fullname": "Capstone",
    "info": "JOUR 4999 is a one-credit course to round out professional career competencies for all the majors in the Hubbard School of Journalism and Mass Communication (Journalism, Strategic Communication, Media and Information). It is designed to complement and provide capstone reflection on a student's development through the Hubbard School's curriculum for journalism, strategic communication and media and information majors. Students enroll in this one-credit, seven-week course to be taken S/N along with an advanced skills course during their last semester. JOUR 4999 has three parts: professional competency evaluations of previously taken JOUR courses; translating those competencies for personal branding, networking, and professional development; and connecting your professional competencies with your career readiness.\n",
    "prereq": []
  },
  {
    "uid": "814216",
    "code": "JOUR5001",
    "subject": "JOUR",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro MC Theory & Research",
    "fullname": "Introduction to Mass Communication Theory and Research",
    "info": "Course is designed to provide an overview of the evolution and content of the major intellectual perspectives, theories, and methodological approaches that serve as the basis for the mass communication discipline. Provides the intellectual base for first-year master's students' graduate work in mass communication, as well introduces advanced undergraduate students to graduate study in the discipline.prereq: Grad students enrolled in Mass Communication MA or PhD program",
    "prereq": []
  },
  {
    "uid": "794041",
    "code": "JOUR5004",
    "subject": "JOUR",
    "number": "5004",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Info for Mass Comm",
    "fullname": "Advanced Information for Mass Communication",
    "info": "Messages, information, audiences, and storytelling. Search strategy and question analysis. Informal information sources. Libraries, electronic information, and data tools. Institutional sources. Interviews, polls, surveys, and evaluating information. Ethics and information for messages.",
    "prereq": []
  },
  {
    "uid": "791367",
    "code": "JOUR5101",
    "subject": "JOUR",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Writing",
    "fullname": "Health Writing",
    "info": "Overview/techniques of news reporting/writing. Complex health topics. Techniques of other forms of health writing, including health feature writing and health new media/communication. ",
    "prereq": []
  },
  {
    "uid": "000246",
    "code": "JOUR5131",
    "subject": "JOUR",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "In-Depth Reporting",
    "fullname": "In-Depth Reporting",
    "info": "The approach to the class is dual: First, there is an academic component - studying the best examples in-depth reporting from muckrakers to yesterday’s New York Times. This part of the course will be presented in a seminar style with a high-expectation for student involvement. Second, there is a hands-on component - giving students the opportunity to exercise what they learn in this class and elsewhere in their journalism program. This part of the course will require students to identify appropriate stories for in-depth reporting, outline the proposed stories to the instructor, thoroughly report the stories and go through the editing process. Students will also produce graphics and photographs, and might consider various multi-media possibilities. The class topics will be organized around essential social issues, such as health care, politics, poverty, business, or other topics. During some semesters, students will produce news stories for publication at a professional news organization, such as MinnPost.com. Such opportunities in past classes have allowed students to work with professional reporters and editors and get bylines stories read by thousands.prereq: [JOUR 3004 or 3004H], JOUR 3101, JOUR 3121, Jour major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "code": "JOUR 3121",
          "subject": "JOUR",
          "id": "3121"
        }
      ]
    }
  },
  {
    "uid": "000247",
    "code": "JOUR5155",
    "subject": "JOUR",
    "number": "5155",
    "honors": false,
    "writingIntensive": false,
    "name": "Database Reporting",
    "fullname": "Database Reporting",
    "info": "Obtaining and analyzing digital data for computer-assisted reporting that can be published on various media platforms. Using spreadsheets and databases to manage information, find news stories, produce maps and graphics.prereq: [Jour 3004W or 3004V], 3101, [3103 or 3121]; jour major or approved BIS/IDIM/ICP program",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004W",
          "subject": "JOUR",
          "id": "3004W"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "or": [
            {
              "code": "JOUR 3103",
              "subject": "JOUR",
              "id": "3103"
            },
            {
              "code": "JOUR 3121",
              "subject": "JOUR",
              "id": "3121"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "000249",
    "code": "JOUR5174",
    "subject": "JOUR",
    "number": "5174",
    "honors": false,
    "writingIntensive": false,
    "name": "Magazine Editing & Production",
    "fullname": "Magazine Editing and Production",
    "info": "This course focuses on magazine and web writing, editing, photography, graphic design, and production. Students will study concepts of magazine and web communication with a special concern for how words, pictures, multimedia and design can be combined effectively. Over the semester, the class will create and produce a professional quality single-theme magazine and website. During this process, students will experience firsthand the organization and working of an editorial and production staff, and the implications of specific divisions of labor and working relationships. All students will write an article and/or produce web content as well as hold a staff job.prereq: [JOUR 3004 or 3004H], [{JOUR 3101 and [JOUR 3155 or JOUR 3173 or JOUR 3321 or JOUR 4171 or JOUR 4302]}, Jour major.  Strat Comm majors must have completed Jour 3279W and need to contact sjmcugs@umn.edu for a permission number.",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3101",
          "subject": "JOUR",
          "id": "3101"
        },
        {
          "or": [
            {
              "code": "JOUR 3155",
              "subject": "JOUR",
              "id": "3155"
            },
            {
              "code": "JOUR 3173",
              "subject": "JOUR",
              "id": "3173"
            },
            {
              "code": "JOUR 3321",
              "subject": "JOUR",
              "id": "3321"
            },
            {
              "code": "JOUR 4171",
              "subject": "JOUR",
              "id": "4171"
            },
            {
              "code": "JOUR 4302",
              "subject": "JOUR",
              "id": "4302"
            }
          ]
        },
        {
          "code": "JOUR 3279W",
          "subject": "JOUR",
          "id": "3279W"
        }
      ]
    }
  },
  {
    "uid": "801353",
    "code": "JOUR5195",
    "subject": "JOUR",
    "number": "5195",
    "honors": false,
    "writingIntensive": false,
    "name": "On-Line Media Creation, Design",
    "fullname": "Online Media Creation and Design",
    "info": "Concepts/development of online media products. Health news/informational opportunities in new media.",
    "prereq": []
  },
  {
    "uid": "798218",
    "code": "JOUR5196",
    "subject": "JOUR",
    "number": "5196",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Based Practicum",
    "fullname": "Field Based Practicum",
    "info": "This class will teach advanced reporting skills through hands-on experience, professional oversight and thoughtful discussions with working journalists. Classes will be held at news organizations, where students will also work directly with editors to produce news, features or other content. That work experience will be complemented in weekly sessions by readings, projects and discussions and with journalists. Students apply to this course and completion of Jour 3121 is encouraged. Applications are available in the HSJMC student services office about a  month before registration begins.\n\nprereq: Jour major and instructor permission",
    "prereq": []
  },
  {
    "uid": "787600",
    "code": "JOUR5251",
    "subject": "JOUR",
    "number": "5251",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Communication Theory",
    "fullname": "Strategic Communication Theory",
    "info": "This course is an introduction to psychologically-grounded concepts, theories and research and their applications for strategic communication. The course objectives involve comprehension and application of a range of psychological concepts and theories related to attitude development, susceptibility to message influence, and opinion formation and change. The course will provide opportunities to apply theoretical concepts to critically evaluate strategic communications (advertising, public relations, brand marketing, etc.) and to use psychological theory and research to inform the development of communication strategies. The course will examine how these theories help us understand communication processes in digital media environments, as well as how they inform relationship-building areas of strategic communication such as reputation and crisis management. The course will provide opportunities for students to apply concepts and theories to potential research for graduate degree capstone projects.Prereq: Strat Comm MA grad major ",
    "prereq": []
  },
  {
    "uid": "819819",
    "code": "JOUR5252",
    "subject": "JOUR",
    "number": "5252",
    "honors": false,
    "writingIntensive": false,
    "name": "Issue Mgmt Comm & Brand Advoc",
    "fullname": "Issue Management Communication and Brand Advocacy",
    "info": "Advocacy and issue management communication provides organizations with a tool for promoting change, forming attitudes, and furthering dialogue about substantive issues. This course examines how advocacy and issue management communication creates dialogue that represents the goals of the organization and society, and the persuasive and media tactics used in advocacy and issue management communication. Typical class sessions will include a lecture and case discussion.Prerequisite:  Strategic Communication MA student or instructor permission.",
    "prereq": []
  },
  {
    "uid": "819905",
    "code": "JOUR5253",
    "subject": "JOUR",
    "number": "5253",
    "honors": false,
    "writingIntensive": false,
    "name": "Content Strategy & Development",
    "fullname": "Content Strategy and Development",
    "info": "In today’s disruptive world of digital and social communications, brands/organizations have found it necessary to become content publishers. This course will expose students to evolving, highly dynamic best practices in content strategy and brand journalism. The course will consider how editorial strategies, emerging technologies and digital delivery platforms can lead to more effective content creation, distribution, audience engagement and measurement.Students will learn the various stages of content development, from organizing the brand’s storyline and mapping it to the customer’s brand journey, to the processes of planning, implementing and auditing an organization’s content strategy. The course includes weekly readings and case studies for each topic; guest lecturers who are experts in their area of content strategy; as well as a semester-long class project that aligns with each stage of the content development process.prereq: Strategic Communication MA student or instructor permission",
    "prereq": []
  },
  {
    "uid": "000255",
    "code": "JOUR5316",
    "subject": "JOUR",
    "number": "5316",
    "honors": false,
    "writingIntensive": false,
    "name": "Theories of Visual Comm",
    "fullname": "Theories of Visual Communication",
    "info": "Perspectives on study/analysis of visual communication. Message structure, systems of production, use of visual media. Contributions from sociology, anthropology, psychology, and history.",
    "prereq": []
  },
  {
    "uid": "000259",
    "code": "JOUR5501",
    "subject": "JOUR",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Comm/Publ Opinion/Social Media",
    "fullname": "Communication, Public Opinion, and Social Media",
    "info": "Sharpen your understanding of public opinion and its role in political and civic life: What does it mean? Where does it come from? How is it measured? What impact does it have? How are the public's preferences shaped by the larger communications environment and the strategic messages of politicians, interest groups, and other actors in society? What are polls really measuring, and why do they seem so unreliable sometimes? How are social media technologies giving voice to new segments and dimensions of public opinion? But how are they vulnerable to manipulation from bots and other efforts designed to alter perceptions of collective opinions? Examine the theories of communication, psychology, political science, and sociology that underlie these dynamic questions. We'll consider cutting edge approaches used by market researchers, political analysts, and data scientists to harness new forms of data about what the public thinks. We investigate theories that explain how people form their opinions, deliberate with others, change their minds, and reveal their preferences, and we apply these frameworks to understand contemporary public opinion issues and campaigns.",
    "prereq": []
  },
  {
    "uid": "000561",
    "code": "JOUR5531",
    "subject": "JOUR",
    "number": "5531",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Opinion II",
    "fullname": "Communication and Public Opinion II",
    "info": "Advanced study of theories/research on opinion formation, persuasion, and diffusion of information. Social science contributions to studies of process/effects of mass communication.",
    "prereq": []
  },
  {
    "uid": "000260",
    "code": "JOUR5541",
    "subject": "JOUR",
    "number": "5541",
    "honors": false,
    "writingIntensive": false,
    "name": "Mass Comm & Public Health",
    "fullname": "Mass Communication and Public Health",
    "info": "This course provides an overview of theory and research that lies at the intersection of mass communication and public health. We examine the potential for media exposure to influence public health outcomes, both as a product of people's everyday interactions with media and the strategic use of media messages to accomplish public health goals. To this end, we will explore large-scale public health campaigns in the context of tobacco, obesity, and cancer screening. We also will explore news media coverage of controversial health issues, such as the human papillomavirus (HPV) vaccine, and health information in entertainment media, such as smoking in movies. This course seeks to understand whether media messages have had intended and/or unintended effects on public attitudes and behavior. Although our focus is on mass media, interpersonal, medical, and digital media sources will be considered as well.  prereq:  JOUR 3005 or JOUR 3757 or Mass Communication grad",
    "prereq": {
      "or": [
        {
          "code": "JOUR 3005",
          "subject": "JOUR",
          "id": "3005"
        },
        {
          "code": "JOUR 3757",
          "subject": "JOUR",
          "id": "3757"
        }
      ]
    }
  },
  {
    "uid": "801899",
    "code": "JOUR5542",
    "subject": "JOUR",
    "number": "5542",
    "honors": false,
    "writingIntensive": false,
    "name": "Theory-based Health Messaging",
    "fullname": "Theory-based Health Message Design",
    "info": "This course is designed to provide an overview of theory and research relevant for the design of health messages, and specifically focuses on how such theory and research informs message design. It builds on social and behavioral science approaches to public health communication and media effects with the primary objective to better understand issues and strategies related to the design of media health messages.\n\nprereq: Jour 3005 or Jour 3757 or Jour 5541 or PubH 6074\n",
    "prereq": {
      "or": [
        {
          "code": "JOUR 3005",
          "subject": "JOUR",
          "id": "3005"
        },
        {
          "code": "JOUR 3757",
          "subject": "JOUR",
          "id": "3757"
        },
        {
          "code": "JOUR 5541",
          "subject": "JOUR",
          "id": "5541"
        },
        {
          "code": "PUBH 6074",
          "subject": "PUBH",
          "id": "6074"
        }
      ]
    }
  },
  {
    "uid": "801900",
    "code": "JOUR5543",
    "subject": "JOUR",
    "number": "5543",
    "honors": false,
    "writingIntensive": false,
    "name": "Prgs for Soc Good: Dsgn & Eval",
    "fullname": "Programs for Social Good: Design and Evaluation",
    "info": "Despite the amount of money spent on (and the faith placed in) campaigns and other programs for social good, we often cannot answer basic questions about how these programs worked and the impact they had. There are methodological, programmatic, practical, and political reasons for this—all of which we will address in this course. In so doing, we will identify the key components of program design and evaluation, drawing on examples from domains including the environment, public health, and social justice. The overarching goal of this course is to give students the skills they need to understand and assess the effectiveness of campaigns and other programs for social good, whether as consumers or producers of such content.\n\nprereq: [JOUR 3004 or 3004H], JOUR 3201, any 32xx skills course, Strat Comm major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 3004",
          "subject": "JOUR",
          "id": "3004"
        },
        {
          "code": "JOUR 3201",
          "subject": "JOUR",
          "id": "3201"
        }
      ]
    }
  },
  {
    "uid": "790563",
    "code": "JOUR5552",
    "subject": "JOUR",
    "number": "5552",
    "honors": false,
    "writingIntensive": false,
    "name": "Law of Internet Communication",
    "fullname": "Law of Internet Communication",
    "info": "Digital communication technologies continue to raise a variety of legal issues, including whether and how (and which) traditional media and regulatory laws will apply, and how policy should be applied through regulatory law to enhance and regulate that communication. This course is conducted as a seminar, with an open discussion of legal precedent and the influence of policy on internet and digital communications. This course covers the First Amendment as it applies in a digital era as well as regulatory topics like net neutrality, broadband access, privacy, and copyright.\n",
    "prereq": []
  },
  {
    "uid": "000261",
    "code": "JOUR5601W",
    "subject": "JOUR",
    "number": "5601",
    "honors": false,
    "writingIntensive": true,
    "name": "History of Journalism",
    "fullname": "History of Journalism",
    "info": "What is (real/fake) news? Who's a journalist? What is journalism? How did we get to where we are today regarding journalism both as a profession and as an essential tool of democracy? Learn the fundamental chronology of the development of journalism in the United States from the Revolution to today, and then delve into the big quandaries: How free has journalism been? What have been its professional standards? How has journalism affected a diverse audience? What are the challenges of international journalism? And how have new communication technologies interacted with journalism?",
    "prereq": []
  },
  {
    "uid": "000262",
    "code": "JOUR5606W",
    "subject": "JOUR",
    "number": "5606",
    "honors": false,
    "writingIntensive": true,
    "name": "Literary Aspects of Journalism",
    "fullname": "Literary Aspects of Journalism",
    "info": "Journalism isn't fiction. Yet the relationship between what is true and what is artfully constructed toward a \"larger truth\" -- beyond the facts -- has a complex and intriguing history. This writing-intensive course explores that relationship through close readings of some the best writers of long-form nonfiction, starting with the birth of the novel from journalistic roots in the 18th century and ending with postmodern forms that challenge the notion of what we can ever know. Discover the literary devices used by Stephen Crane's reported street scenes or Nellie Bly's first-hand investigations into conditions for the mentally ill in the 19th century, and, later, Truman Capote's nonfiction novel about a Kansas farm family's murder. Readings include works by pivotal 20th-century writers such as John Hersey, Joseph Mitchell, Lillian Ross, Michael Herr, Norman Mailer, Gay Talese, Joan Didion, Tom Wolfe, and Hunter S. Thompson, and will trace how their pioneering methods influenced contemporary journalism as well as the documentary films of Errol Morris and contemporary nonfiction writers expanding into new forms.",
    "prereq": []
  },
  {
    "uid": "000264",
    "code": "JOUR5615",
    "subject": "JOUR",
    "number": "5615",
    "honors": false,
    "writingIntensive": false,
    "name": "History of the Documentary",
    "fullname": "History of the Documentary",
    "info": "Social history of photography, film, video. Informational, documentary, propaganda, entertainment functions of visual communication. Rise/influence of visual media industries/public-image making.",
    "prereq": []
  },
  {
    "uid": "000266",
    "code": "JOUR5725",
    "subject": "JOUR",
    "number": "5725",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt of Media Org",
    "fullname": "Management of Media Organizations",
    "info": "The modern media industry is marked by complexity as new entrants compete for consumers, industry mainstays struggle to survive, and disruptions continue. Consumers are increasingly more educated and proactive about their media consumption, and organizations face a complex array of marketing and advertising decisions. \nThis course introduces students to the organizational structure of media organizations, and of organizations at large. The course focuses on the business aspects of media and prepares students to navigate the complexities of working in modern organizations. The course is designed to expose journalism and strategic communication majors and other interested students to core concepts and principles of managerial and organizational theory as they apply to these organizations. Students will learn about the key management challenges facing media organizations today in the modern technological landscape. \nA variety of theories or perspectives relevant or related to management, communication, and technology will be considered to help make sense of the modern media organization's structure and competitive landscape. ",
    "prereq": []
  },
  {
    "uid": "000562",
    "code": "JOUR5726",
    "subject": "JOUR",
    "number": "5726",
    "honors": false,
    "writingIntensive": false,
    "name": "Case Studies in Media Mgmt",
    "fullname": "Case Studies in Modern Media Management",
    "info": "Key issues confronting media organizations. Mission: integrating journalism, business, entertainment; corporate citizenship, public relations. Deciding what organization does: business/market definition, performance measurement, management of creative process. Investment: new business, media boundaries, technology.",
    "prereq": []
  },
  {
    "uid": "000268",
    "code": "JOUR5771",
    "subject": "JOUR",
    "number": "5771",
    "honors": false,
    "writingIntensive": false,
    "name": "Media Ethics",
    "fullname": "Media Ethics: Principles and Practice",
    "info": "Connecting theoretical approaches to media ethics with real-life case studies. History of ethical standards in print, broadcast, photojournalism, public relations, and advertising. Making ethical judgments in complex situations.",
    "prereq": []
  },
  {
    "uid": "000269",
    "code": "JOUR5777",
    "subject": "JOUR",
    "number": "5777",
    "honors": false,
    "writingIntensive": false,
    "name": "Freedom of Speech and Press",
    "fullname": "Contemporary Problems in Freedom of Speech and Press",
    "info": "Most of us use devices like Smartphones, GPS, streaming services, or hands-free speakers like Amazon's Echo that connect to online voice services like Alexa without thinking about them very much. But, what kind of information are they collecting? Are merchants allowed to gather your shopping history and use it to send you targeted advertising, or to sell it to other companies for profit? Should other people be able to post your personal information or photos online without your consent? Can the government read your emails, track your online browsing, or intercept your text messages? This course considers how growing concerns about privacy and national security affect the First Amendment and the rights of journalists to gather and report the news. We will read significant court decisions and take a look at current statutory and regulatory initiatives both in the United States and abroad. You can expect lively debates and discussion, and the opportunity to explore a privacy or national security issue in depth in a substantial research paper.prereq: Jour major, Strat Comm major, Media and Information major or Media and Information minor or approved BIS/IDIM/ICP program or graduate or law student status. Course is open to students have previously taken a relevant law course - contact instructor for permission.",
    "prereq": []
  },
  {
    "uid": "000271",
    "code": "JOUR5825",
    "subject": "JOUR",
    "number": "5825",
    "honors": false,
    "writingIntensive": false,
    "name": "World Comm Systems",
    "fullname": "World Communication Systems",
    "info": "Mass media systems of world, described/analyzed regionally/nationally. Historical roots. Social, economic, cultural context. Contemporary conditions/prospects. Relevance of journalism/mass communication to international affairs.",
    "prereq": []
  },
  {
    "uid": "000273",
    "code": "JOUR5990",
    "subject": "JOUR",
    "number": "5990",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Mass Comm Professional",
    "fullname": "Special Topics in Mass Communication: Professional",
    "info": "Professional skills and learning opportunity not regularly offered. Topics specified in class schedule.",
    "prereq": []
  },
  {
    "uid": "798219",
    "code": "JOUR5991",
    "subject": "JOUR",
    "number": "5991",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Mass Comm: Context",
    "fullname": "Special Topics in Mass Communication: Context",
    "info": "Special context topics not regularly offered. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "000565",
    "code": "JOUR5993",
    "subject": "JOUR",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed study/projects.Prereq [Jour major or jour minor or approved IDIM major or ICP major or BIS major], GPA of at least 3.00, college consent, dept consent, instr consent.Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including: the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project. the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit)the faculty mentor is qualified to serve in this roleassessment of student learning and grading criteria are clear and appropriatethe student will be working in a respectful, inclusive environment",
    "prereq": []
  },
  {
    "uid": "000274",
    "code": "JOUR8001",
    "subject": "JOUR",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies and Theories of MC",
    "fullname": "Studies and Theories of Mass Communication",
    "info": "Introduction to key concepts, theories, methods in study of mass communication from social sciences perspective. Survey of research literature using individualistic/structural approaches. ",
    "prereq": []
  },
  {
    "uid": "000275",
    "code": "JOUR8002",
    "subject": "JOUR",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies MassComm II",
    "fullname": "Studies in Mass Communication II",
    "info": "Literature on history of the field, cultural and humanistic approaches to its study, and legal and ethical issues.prereq: 8001",
    "prereq": {
      "code": "JOUR 8001",
      "subject": "JOUR",
      "id": "8001"
    }
  },
  {
    "uid": "790549",
    "code": "JOUR8003",
    "subject": "JOUR",
    "number": "8003",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Media Issues & Theor",
    "fullname": "Digital Media Issues and Theories",
    "info": "Nonprofessional skills course. Prepares entering graduate students to work in changing media environment. Political, social, economic, legal, ethical, technological implications nationally/globally. Produce scholarly research about changing media.prereq: Journalism grad student",
    "prereq": []
  },
  {
    "uid": "810133",
    "code": "JOUR8009",
    "subject": "JOUR",
    "number": "8009",
    "honors": false,
    "writingIntensive": false,
    "name": "Pro-seminar in Mass Comm",
    "fullname": "Pro-seminar in Mass Communication",
    "info": "Introduction/socialization to scholarly discipline of mass communication, mass communication pedagogy, pathways to successful career. Develop action plan for completing graduate school/starting career in academy or relevant communication industries.prereq: Grad students enrolled in Mass Communication MA or PhD program",
    "prereq": []
  },
  {
    "uid": "791814",
    "code": "JOUR8191",
    "subject": "JOUR",
    "number": "8191",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Journalism",
    "fullname": "Health Journalism: Introduction to Health and Medical Journalism",
    "info": "Best practices in health/medical reporting in different formats/media. Story ideas that challenge conventional wisdom about health care. Elements of health beat. Narrative/investigative styles of journalism. Students do semester-long project.prereq: Enrolled in MA in health journalism or instr consent",
    "prereq": []
  },
  {
    "uid": "791815",
    "code": "JOUR8192",
    "subject": "JOUR",
    "number": "8192",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Health Journalism",
    "fullname": "Advanced Health Journalism: Computer-Assisted Reporting on Health",
    "info": "How to use data/databases to tell health news stories or help with health campaigns. Databases, how to access them. How to mine data for effective communication to consumer audience.prereq: Enrolled in MA in health journalism or instr consent",
    "prereq": []
  },
  {
    "uid": "794713",
    "code": "JOUR8193",
    "subject": "JOUR",
    "number": "8193",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Communication Capstone",
    "fullname": "Health Communication Capstone",
    "info": "Focus on different aspects of a health issue, audience, context, and message mix that is central to the Health Communication M.A. program. Develop a final project focusing on a health communication topic of interest. Projects would be a publishable article, research paper, multimedia production, or any other format relevant for the chosen topic. Project is accompanied by a reflection paper.",
    "prereq": []
  },
  {
    "uid": "800740",
    "code": "JOUR8194",
    "subject": "JOUR",
    "number": "8194",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Comm Practicum",
    "fullname": "Health Commuinication Practicum",
    "info": "Field-based practicum for students enrolled in the Health Communication M.A. program. Work with a local non-profit or for profit organization in the health care domain. Participatory observation study: work with organization staff on a strategic communication project and use experiences to analyze how message, audience, and context design processes take place in professional health communication settings.",
    "prereq": []
  },
  {
    "uid": "791816",
    "code": "JOUR8195",
    "subject": "JOUR",
    "number": "8195",
    "honors": false,
    "writingIntensive": false,
    "name": "On-line Media Creation,Design",
    "fullname": "Seminar: Online Media Creation and Design",
    "info": "Concepts/development of online media products. Health news and informational opportunities in new media.",
    "prereq": []
  },
  {
    "uid": "797250",
    "code": "JOUR8200",
    "subject": "JOUR",
    "number": "8200",
    "honors": false,
    "writingIntensive": false,
    "name": "Stat Comm Research Methods",
    "fullname": "Strategic Communication Research Methods",
    "info": "Concepts, analytical techniques, and methods to analyze audiences, target markets, and social trends affecting communication strategy in context of complex and rapidly changing media environments.\n\nprereq: Strat Comm MA grad major",
    "prereq": []
  },
  {
    "uid": "797251",
    "code": "JOUR8201",
    "subject": "JOUR",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Commun Strategy Factors",
    "fullname": "Factors Affecting Communication Strategy",
    "info": "Literature/research concerning identification/analysis of the media and environmental, regulatory, competitive, and economic factors that affect the development of communication strategy.\n\nprereq: Strat Comm MA grad major",
    "prereq": []
  },
  {
    "uid": "797252",
    "code": "JOUR8202",
    "subject": "JOUR",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "Brand Thinking",
    "fullname": "Brand Thinking: Building Brands People Can Believe In",
    "info": "Effective brand building can provide organizations of all kinds with the competitive advantage needed for success. From helping drive stakeholder engagement to building overall brand value, brand thinking plays a central role in the way today's most dynamic organizations build brands people can believe in.\n\nprereq: Strat Comm MA grad major",
    "prereq": []
  },
  {
    "uid": "797253",
    "code": "JOUR8203",
    "subject": "JOUR",
    "number": "8203",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrated Media Strategies",
    "fullname": "Integration of Communication Strategies Across Media",
    "info": "Concepts, analytical techniques, and methodologies used to plan communication strategies and implement communication campaigns utilizing a diverse range of media.\n\nprereq: 8200, 8201, 8202, strat comm MA grad major",
    "prereq": {
      "and": [
        {
          "code": "JOUR 8200",
          "subject": "JOUR",
          "id": "8200"
        },
        {
          "code": "JOUR 8201",
          "subject": "JOUR",
          "id": "8201"
        },
        {
          "code": "JOUR 8202",
          "subject": "JOUR",
          "id": "8202"
        }
      ]
    }
  },
  {
    "uid": "797254",
    "code": "JOUR8204",
    "subject": "JOUR",
    "number": "8204",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Commun Effectiveness",
    "fullname": "Measuring the Effectiveness of Strategic Communication Campaigns",
    "info": "Examination, evaluation, and application of concepts/methods to evaluate effectiveness of strategic communication campaigns and their components.prereq: 8203, Strat Comm MA grad major",
    "prereq": {
      "code": "JOUR 8203",
      "subject": "JOUR",
      "id": "8203"
    }
  },
  {
    "uid": "797255",
    "code": "JOUR8205",
    "subject": "JOUR",
    "number": "8205",
    "honors": false,
    "writingIntensive": false,
    "name": "Strat Comm Cases & Campaigns",
    "fullname": "Strategic Communication Cases & Campaigns",
    "info": "Case study analysis concerning development, implementation, and evaluation of communication strategies. Cases cover broad range of organizations, focus on such issues as brand introduction, brand reinforcement, revitalizations, crisis communication, issues management, and legal/ethical considerations.prereq: 8203, strat comm MA grad major",
    "prereq": {
      "code": "JOUR 8203",
      "subject": "JOUR",
      "id": "8203"
    }
  },
  {
    "uid": "797256",
    "code": "JOUR8206",
    "subject": "JOUR",
    "number": "8206",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study-Strat Camp Dev",
    "fullname": "Directed Study: Development of an Integrated Strategic Communication Campaign",
    "info": "Project to develop a case study analysis concerning development, implementation, and evaluation of a strategic communication campaign.prereq: 8205, strat comm MA grad major",
    "prereq": {
      "code": "JOUR 8205",
      "subject": "JOUR",
      "id": "8205"
    }
  },
  {
    "uid": "819971",
    "code": "JOUR8208",
    "subject": "JOUR",
    "number": "8208",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Strat, Plan & Analytic",
    "fullname": "Digital Strategy, Planning and Analytics",
    "info": "This is a class that will feel more like a workshop; purpose-built to provide a hands-on learning experience while developing a digital presence for a real-world brand. Starting with the why (business problem or opportunity), students will collaborate on a strategy that informs the what throughout the remainder of the class, including the creation of a website, content and ads - as well as becoming Google Analytics certified. At the end of the semester, each student will play a key role in presenting the digital strategy and work that came from it directly to the client, along with an articulation of the impact it made on the client’s business.",
    "prereq": []
  },
  {
    "uid": "813400",
    "code": "JOUR8290",
    "subject": "JOUR",
    "number": "8290",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in Strat Comm",
    "fullname": "Special Topics in Strategic Communication",
    "info": "Topics specified in Class Schedule.prereq: Strat Comm MA grad major",
    "prereq": []
  },
  {
    "uid": "000283",
    "code": "JOUR8317",
    "subject": "JOUR",
    "number": "8317",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Visual Comm Re",
    "fullname": "Seminar: Visual Communication Research",
    "info": "Theoretical approaches, analysis of research methods, development of research designs/projects. ",
    "prereq": []
  },
  {
    "uid": "788132",
    "code": "JOUR8333",
    "subject": "JOUR",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "002215",
    "code": "JOUR8442",
    "subject": "JOUR",
    "number": "8442",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Brdcst News",
    "fullname": "Seminar: Broadcast News",
    "info": "Major issues. Confrontations between federal government and network news departments. Historical studies.prereq: 4442 or instr consent",
    "prereq": []
  },
  {
    "uid": "788367",
    "code": "JOUR8444",
    "subject": "JOUR",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "820050",
    "code": "JOUR8500",
    "subject": "JOUR",
    "number": "8500",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Adv Methods Special Topic",
    "fullname": "Seminar: Advanced Methods Special Topics",
    "info": "Advanced topics in mass communication research methods; addresses the theoretical, conceptual, and analytical perspectives associated with advanced methodological approaches to mass communication scholarship, which may include qualitative, quantitative, ethnographic, humanistic, historical, legal, and/or social network approaches; emphasis on application of course materials to developing, analyzing, and describing data as appropriate for mass communication scholarship.",
    "prereq": []
  },
  {
    "uid": "000276",
    "code": "JOUR8501",
    "subject": "JOUR",
    "number": "8501",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Methods in MC",
    "fullname": "Research Methods in Mass Communication",
    "info": "Epistemological issues and overview of qualitative and quantitative methodological approaches in mass communication research, basic principles and logic of scientific research, relationship between theory and research, concept explication, measurement, instrumentation, and design issues.",
    "prereq": []
  },
  {
    "uid": "000277",
    "code": "JOUR8502",
    "subject": "JOUR",
    "number": "8502",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Quantitative Methods",
    "fullname": "Advanced Quantitative Research Methods",
    "info": "Advanced quantitative research principles/techniques applied to mass communication research, including experimental methods, survey methods, among others. prereq: 8501, [EPsy 5260 or equiv or concurrent registration is required (or allowed) in  EPsy 5260]",
    "prereq": {
      "and": [
        {
          "code": "JOUR 8501",
          "subject": "JOUR",
          "id": "8501"
        },
        {
          "code": "EPSY 5260",
          "subject": "EPSY",
          "id": "5260"
        }
      ]
    }
  },
  {
    "uid": "810134",
    "code": "JOUR8503",
    "subject": "JOUR",
    "number": "8503",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Qualitative Methods",
    "fullname": "Advanced Qualitative Methods in Mass Communication Research",
    "info": "Advanced qualitative research principles/techniques applied to mass communication research, including ethnography, interviews, focus groups, case study, qualitative content analysis, historical research.  prereq: Grad students enrolled in Mass Communication MA or PhD program or instr consent",
    "prereq": []
  },
  {
    "uid": "811461",
    "code": "JOUR8504",
    "subject": "JOUR",
    "number": "8504",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Analyzing Media Conte",
    "fullname": "Seminar: Analyzing Media Content",
    "info": "Methods of analyzing media content/application of methods to theoretically-driven studies of media content. Conceptual/methodological issues surrounding analyzing media content in today's contemporary digital media environment, including collecting social media data, computer-aided analyses.prereq: Grad students enrolled in Mass Communication MA or PhD program or instr consent",
    "prereq": []
  },
  {
    "uid": "000278",
    "code": "JOUR8513",
    "subject": "JOUR",
    "number": "8513",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Ethnogr Method",
    "fullname": "Seminar: Ethnographic Methods in Mass Communication Research",
    "info": "Theoretical foundations in anthropology/sociology. Field projects.prereq: [8001, 8002] or instr consent; same as Anth 8810",
    "prereq": {
      "or": [
        {
          "and": [
            {
              "code": "JOUR 8001",
              "subject": "JOUR",
              "id": "8001"
            },
            {
              "code": "JOUR 8002",
              "subject": "JOUR",
              "id": "8002"
            }
          ]
        },
        {
          "code": "ANTH 8810",
          "subject": "ANTH",
          "id": "8810"
        }
      ]
    }
  },
  {
    "uid": "000284",
    "code": "JOUR8514",
    "subject": "JOUR",
    "number": "8514",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Mass Comm Theories",
    "fullname": "Seminar: Advanced Mass Communication Theories",
    "info": "Research paradigms, concepts, findings for developing general theory of mass communication.prereq: 8001",
    "prereq": {
      "code": "JOUR 8001",
      "subject": "JOUR",
      "id": "8001"
    }
  },
  {
    "uid": "000279",
    "code": "JOUR8601",
    "subject": "JOUR",
    "number": "8601",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Meth Hist Res",
    "fullname": "Seminar: Methods in Mass Communication History Research",
    "info": "Critical analysis of research in journalism/communication history. Research designs/methods. Development of a research project.prereq: 8001, 8002",
    "prereq": {
      "and": [
        {
          "code": "JOUR 8001",
          "subject": "JOUR",
          "id": "8001"
        },
        {
          "code": "JOUR 8002",
          "subject": "JOUR",
          "id": "8002"
        }
      ]
    }
  },
  {
    "uid": "002216",
    "code": "JOUR8602",
    "subject": "JOUR",
    "number": "8602",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Hist Mass Comm",
    "fullname": "Seminar: History of Mass Communication",
    "info": "Research in history/development of U.S. mass media.",
    "prereq": []
  },
  {
    "uid": "000285",
    "code": "JOUR8603",
    "subject": "JOUR",
    "number": "8603",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Hist Mass Comm",
    "fullname": "Seminar: Theories and Models in Mass Communication History Research",
    "info": "Literature on theory in historical research. Uses of theoretical models in historical explanations. Role of theory in historical research, debate about uses. Specific works in journalism/communication history in context of theoretical models. Development of major paper examining models/theories relevant to student's project.prereq: 5601, instr consent",
    "prereq": {
      "code": "JOUR 5601",
      "subject": "JOUR",
      "id": "5601"
    }
  },
  {
    "uid": "820083",
    "code": "JOUR8611",
    "subject": "JOUR",
    "number": "8611",
    "honors": false,
    "writingIntensive": false,
    "name": "Jour Studies Theory & Research",
    "fullname": "Journalism Studies Theory and Research",
    "info": "This graduate seminar provides an overview of journalism studies scholarship. As a survey of journalism research, students will be introduced to both classic and cutting-edge journalism research. The course explores multiple epistemic, methodological, and geographic perspectives that approach journalism as a practice, a cultural form, and an institution embedded in political and civic life. Readings will cover core debates surrounding professionalism and organizational structures, normative commitments involving objectivity and its alternatives, news audiences, race, colonialism, inclusivity, and questions arising from recent technological and economic developments. The course will also interrogate how journalism studies scholars consider their conceptual assumptions, research practices, and power. The learning objectives for this course include: introducing the fundamentals of journalism research field, and how the field has changed over the years; understanding how varying approaches to studying journalism shape and constrain how journalism is thought about; examining recent research on the impact of emerging media technologies on long-standing theoretical and conceptual underpinnings; and providing students an opportunity to conduct their own research on a journalism-related topic. The overview of journalism research that this course provides is central for students with a journalism studies focus, but it also provides a helpful background for students with journalism-adjacent focuses in strategic communication, health communication, and mass communication, political communication, and other social science foci.",
    "prereq": []
  },
  {
    "uid": "000281",
    "code": "JOUR8620",
    "subject": "JOUR",
    "number": "8620",
    "honors": false,
    "writingIntensive": false,
    "name": "Advertising Theory & Research",
    "fullname": "Seminar: Advertising Theory and Research",
    "info": "Advertising as persuasive communication. Current research/theory related to advertising decision-making process.prereq: Grad students enrolled in Mass Communication MA or PhD program or instr consent",
    "prereq": []
  },
  {
    "uid": "811462",
    "code": "JOUR8621",
    "subject": "JOUR",
    "number": "8621",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: PR Theory and Research",
    "fullname": "Seminar: Public Relations Theory and Research",
    "info": "Study of theoretical body of knowledge in public relations field. Diverse roles played by public relations in organization. Current state of public relations research in regard to theory building. How theory informs professional practice of public relations.prereq: Grad students enrolled in Mass Communication MA or PhD program or instr consent",
    "prereq": []
  },
  {
    "uid": "811463",
    "code": "JOUR8650",
    "subject": "JOUR",
    "number": "8650",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Psy of Media Effects",
    "fullname": "Seminar: Psychology of Media Effects",
    "info": "In-depth study of psychological concepts/theories concerning individual cognitive processing of content of both traditional/new electronic media. Critically evaluate latest empirical research concerning how individuals respond to the content of both traditional mass media/newest electronic digital media.prereq: Grad students enrolled in Mass Communication MA or PhD program or instr consent",
    "prereq": []
  },
  {
    "uid": "000569",
    "code": "JOUR8651",
    "subject": "JOUR",
    "number": "8651",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Mass Comm, Aud & Soc",
    "fullname": "Seminar: Mass Communication, Audiences, and Society",
    "info": "Interplay between social theories/media studies. Pragmatism, structural-functionalism, Marxism, political economy, cultural studies, globalization.prereq: 8001 or 8002 or equiv",
    "prereq": {
      "or": [
        {
          "code": "JOUR 8001",
          "subject": "JOUR",
          "id": "8001"
        },
        {
          "code": "JOUR 8002",
          "subject": "JOUR",
          "id": "8002"
        }
      ]
    }
  },
  {
    "uid": "816391",
    "code": "JOUR8661",
    "subject": "JOUR",
    "number": "8661",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Pol Comm Digital Age",
    "fullname": "Seminar: Mediated Political Communication in the Digital Age",
    "info": "Mediated political communication in the digital age. How news, advertising, and entertainment media shape political perceptions, motivate voters, and influence policy decisions. Agenda-setting, priming, and framing, networked communications, micro-targeting, and mobile technology.",
    "prereq": []
  },
  {
    "uid": "000286",
    "code": "JOUR8662",
    "subject": "JOUR",
    "number": "8662",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Literary Aspec",
    "fullname": "Seminar: Literary Aspects of Journalism",
    "info": "Research in literary aspects of journalism exemplified in careers/works of American/British writers.prereq: 5606",
    "prereq": {
      "code": "JOUR 5606",
      "subject": "JOUR",
      "id": "5606"
    }
  },
  {
    "uid": "788490",
    "code": "JOUR8666",
    "subject": "JOUR",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbdprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "000570",
    "code": "JOUR8671",
    "subject": "JOUR",
    "number": "8671",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Comm Ethics",
    "fullname": "Seminar: Communication Ethics--Public/Civic Journalism",
    "info": "Historical underpinnings, philosophical debate, theoretical dynamics, legal concerns, ethical implications.",
    "prereq": []
  },
  {
    "uid": "000571",
    "code": "JOUR8673",
    "subject": "JOUR",
    "number": "8673",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Media Mgmt",
    "fullname": "Seminar: Media Management",
    "info": "Management issues in media organizations. Relation to dynamics of organization structure, employees, markets, economics/finances.prereq: 5725 recommended",
    "prereq": {
      "code": "JOUR 5725",
      "subject": "JOUR",
      "id": "5725"
    }
  },
  {
    "uid": "000287",
    "code": "JOUR8675",
    "subject": "JOUR",
    "number": "8675",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Issues Info Ac",
    "fullname": "Seminar: Issues in Information Access and Communication",
    "info": "Societal, industry, technological, and policy aspects/developments that affect information access, particularly through mass media.prereq: Grad students enrolled in Mass Communication MA or PhD program or instr consent",
    "prereq": []
  },
  {
    "uid": "000289",
    "code": "JOUR8678",
    "subject": "JOUR",
    "number": "8678",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Constitut Law",
    "fullname": "Seminar: Constitutional Law--Theories of Freedom of Expression",
    "info": "Problems of constitutional/tort law affecting the press. Underlying theories.prereq: 5777 or instr consent or law student",
    "prereq": {
      "code": "JOUR 5777",
      "subject": "JOUR",
      "id": "5777"
    }
  },
  {
    "uid": "000290",
    "code": "JOUR8679",
    "subject": "JOUR",
    "number": "8679",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Ethics/Law Res",
    "fullname": "Seminar: Research Methods in Media Ethics and Law",
    "info": "Research at intersection of first amendment and media ethics.",
    "prereq": []
  },
  {
    "uid": "000291",
    "code": "JOUR8681",
    "subject": "JOUR",
    "number": "8681",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Intl Media Perspectives",
    "fullname": "Seminar: International Media Perspectives",
    "info": "Main problems/currents. Concepts, research, policy relevant to global development. Issues of freedom/constraint, media technology, role of journalism in world affairs.",
    "prereq": []
  },
  {
    "uid": "811464",
    "code": "JOUR8720",
    "subject": "JOUR",
    "number": "8720",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Communication",
    "fullname": "Health Communication Theory and Research",
    "info": "Theories, methods, research that characterize field of health communication. Mass media influence on health, including use of mass media to promote health behaviors. Theoretical frameworks that inform health communication scholarship, as well as methodological approaches to studying health communication issues.prereq: Grad students enrolled in Mass Communication MA or PhD program or instr consent",
    "prereq": []
  },
  {
    "uid": "009799",
    "code": "JOUR8721",
    "subject": "JOUR",
    "number": "8721",
    "honors": false,
    "writingIntensive": false,
    "name": "Media Orgs as Institutions",
    "fullname": "Media Organizations as Institutions",
    "info": "This seminar introduces students to key theories and concepts in the study of media organizations as institutions. It explores the influences and effects of media, the internal dynamics of media organizations, and criticism/modes of reform. It introduces students to foundational questions and perspectives in research about the communicative processes of established and more diffused media organizations, including in journalism, health communication, and strategic communication. And it assesses theoretical frameworks for analysis from a multiplicity of viewpoints including sociology of work, organizational communication, management studies, etc. ",
    "prereq": []
  },
  {
    "uid": "788617",
    "code": "JOUR8777",
    "subject": "JOUR",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required (Plan A only)",
    "prereq": []
  },
  {
    "uid": "000568",
    "code": "JOUR8801",
    "subject": "JOUR",
    "number": "8801",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Comparative Research",
    "fullname": "Seminar: Comparative Research in Mass Communication, a Cross-National Approach",
    "info": "Comparative research designs/strategies. Analysis of production, presentation, transmission, and consumption of mass media products/services (particularly news, entertainment, and information) across national borders. Theoretical concerns, empirical problems, policy. Ethical issues involving research on form/content of mass communication within/between countries.prereq: 4801 or 5825",
    "prereq": {
      "or": [
        {
          "code": "JOUR 4801",
          "subject": "JOUR",
          "id": "4801"
        },
        {
          "code": "JOUR 5825",
          "subject": "JOUR",
          "id": "5825"
        }
      ]
    }
  },
  {
    "uid": "787885",
    "code": "JOUR8888",
    "subject": "JOUR",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "000293",
    "code": "JOUR8990",
    "subject": "JOUR",
    "number": "8990",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Problems-MC",
    "fullname": "Special Problems in Mass Communications",
    "info": "Topics specified in Class Schedule.\n\nprereq: Mass comm grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "013762",
    "code": "JOUR8993",
    "subject": "JOUR",
    "number": "8993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed study.prereq: Grad mass comm major or minor, instr consent, dept consent",
    "prereq": []
  }
]