[
  {
    "uid": "010555",
    "code": "JWST1034",
    "subject": "JWST",
    "number": "1034",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Jewish History & Culture",
    "fullname": "Introduction to Jewish History and Cultures",
    "info": "This course traces the development of Judaism and Jewish civilizations from their beginnings to the present. With over three millennia as its subject, the course must of necessity be a general survey. Together we will explore the mythic structures, significant documents, historical experiences, narratives, practices, beliefs, and worldviews of the Jewish people. The course begins by examining the roots of Judaism in the Hebrew Bible and the history of ancient Israel but quickly focuses on the creative forces that developed within Judaism as a national narrative confronted the forces of history, especially in the forms of the Persian, Greek, and Roman empires.  Rabbinic Judaism becomes the most dominant creative force and will receive our greatest attention, both in its formative years and as it encounters the rise of Christianity and Islam. After studying the Jewish experience in the medieval world, we will turn to Judaism’s encounter with the enlightenment and modernity. The historical survey concludes by attending to the transformations within Judaism and Jewish life of the last 150 years, including a confrontation with the experience of the Holocaust. Woven throughout this historical survey will be repeated engagements with core questions: “Who is a Jew?” “What do Jews believe?” “What do Jews do?” “What do we mean by ‘religion’?”   “How do Jews read texts within their tradition?” And perhaps most importantly, “How many answers are there to a Jewish question?” Students in this course can expect to come away with some knowledge of the Bible in Judaism, rabbinic literature and law, Jewish mysticism and philosophy, Jewish nationalism and Zionism, Jewish culture, ritual, and worship in the synagogue, the home, and the community, and Jewish celebrations of life cycle events and the festivals.",
    "prereq": []
  },
  {
    "uid": "789773",
    "code": "JWST1083",
    "subject": "JWST",
    "number": "1083",
    "honors": false,
    "writingIntensive": false,
    "name": "Jesus the Jew",
    "fullname": "Jesus the Jew",
    "info": "Historic figure of Jesus within context of first century Palestinian Judaism. Main groups/institutions of Judaism at time of Jesus. Rabbinic literature/traditions. Works describing Jesus' life/sayings (synoptic gospels). Jesus and the Law, Messianic ideals/expectations, problem of religious authority. Positions regarding Rome, its authority. James and the Jerusalem Church.",
    "prereq": []
  },
  {
    "uid": "797684",
    "code": "JWST1201",
    "subject": "JWST",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Contxt & Interp, Hebrew Bible",
    "fullname": "The Bible: Context and Interpretation, World of the Hebrew Bible",
    "info": "The Hebrew Bible and Old Testament are literary collections that modern Jewish and Christian traditions maintain as important, but these collections were initially produced by ancient Israelite scribes who composed and/or compiled the biblical texts at particular time periods in the ancient Near East. This course will introduce the academic study of biblical texts, which demands critical analysis of the literature and an openness to reading the literature from the perspective of ancient Israelite writers (who lived in a world far different from today). The course will spend considerable time on the literary (and scribal) composition of biblical prose texts; time will also be spent on the historical circumstances of biblical prophets and other writers of the biblical texts. This course will only address the ancient setting of the biblical texts and not re-interpretations in Jewish or Christian traditions. Given the scope of the course, modern interpretations of the biblical literature will not be discussed; we will only focus on this literature in its ancient setting.prereq: Knowledge of Hebrew not required",
    "prereq": []
  },
  {
    "uid": "826231",
    "code": "JWST1205",
    "subject": "JWST",
    "number": "1205",
    "honors": false,
    "writingIntensive": false,
    "name": "The Bible and Film",
    "fullname": "The Bible and Film: The Holy Book Meets the Silver Screen",
    "info": "The Bible has been a star of Hollywood and the silver screen since the birth of cinema. This course tells that story. The Bible has deep roots in American society, in communities of faith, in politics, in art and literature, and in popular culture. It is no surprise, then, that filmmakers have frequently drawn on the Bible as source text and as inspiration. This course explores the ways in which the Bible has been interpreted and reimagined in film over the past century. We will examine the relationships between the biblical texts and the films they inspired, considering questions such as: How do the filmmakers rework their sources to make them relevant to contemporary audiences? How beholden are the filmmakers to the interpretations of communities that view biblical texts as authoritative, and where are they free to depart from their sources? Is it possible to \"translate\" biblical narratives into film without losing something in the translation?",
    "prereq": []
  },
  {
    "uid": "800596",
    "code": "JWST1701",
    "subject": "JWST",
    "number": "1701",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Yiddish I",
    "fullname": "Beginning Yiddish I",
    "info": "Introduction to Yiddish.",
    "prereq": []
  },
  {
    "uid": "800597",
    "code": "JWST1702",
    "subject": "JWST",
    "number": "1702",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Yiddish II",
    "fullname": "Beginning Yiddish II",
    "info": "First year, second semester introduction to Yiddish.",
    "prereq": []
  },
  {
    "uid": "799126",
    "code": "JWST1905",
    "subject": "JWST",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "795960",
    "code": "JWST1909W",
    "subject": "JWST",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr or less than 30 cr",
    "prereq": []
  },
  {
    "uid": "817576",
    "code": "JWST3011",
    "subject": "JWST",
    "number": "3011",
    "honors": false,
    "writingIntensive": false,
    "name": "Jewish American Literature",
    "fullname": "Jewish American Literature: Religion, Culture, and the Immigrant Experience",
    "info": "Immigrant? Jewish? American?  What do these labels mean, why are they applied, and do they ever cease to be applicable? Can we distinguish religion from culture, and what are the implications when we try? Why is it frequently asked whether Saul Bellow was “really” a Jewish writer, but it is impossible to read Philip Roth as anything other than that? How does Grace Paley’s “Jewishness” come through even when she is writing about non-Jewish characters? We will address these issues and others as we explore the literature growing out of the Jewish immigrant experience in America, as well as the literature by Jewish writers more firmly, though still sometimes anxiously, rooted in American soil.In this course we will engage in a highly contextualized and historicized study of Jewish American literature from the 19th century to today.  We will discover in these texts how inherited Jewish culture and literary imaginings, developed over centuries of interaction between Jewish communities and the “outside world,” get reexamined, questioned, rejected, reimagined, reintegrated, and transformed within the crucible of American experience. The discussions that ensue will also provide a framework for engaging with the creative energies and cultural productivity of more recent immigrant communities in the United States and beyond. Immigration and the experience of immigrant communities continues to be at the forefront of American consciousness, as immigrants work to create new meanings and new narratives for their lives, and as those who immigrated before them provide contested meanings for the impact of immigration on their own narratives. This course, though grounded in Jewish narratives, will therefore provide students with an expanded vocabulary and perspective for engaging in this central and very current debate within the American experience. ",
    "prereq": []
  },
  {
    "uid": "016513",
    "code": "JWST3013W",
    "subject": "JWST",
    "number": "3013",
    "honors": false,
    "writingIntensive": true,
    "name": "Biblical Law & Jewish Ethics",
    "fullname": "Biblical Law and Jewish Ethics",
    "info": "This course introduces students to the original meaning and significance of religious law and ethics within Judaism. Law is the single most important part of Jewish history and identity. At the same time, law is also the least understood part of Judaism and has often been the source of criticism and hatred. We shall therefore confront one of the most important parts of Jewish civilization and seek to understand it on its own terms. In demonstrating how law becomes a fundamental religious and ethical ideal, the course will focus on the biblical and Rabbinic periods but spans the entire history of Judaism. Consistent with the First Amendment, the approach taken is secular. There are no prerequisites: the course is open to all qualified students.The course begins with ideas of law in ancient Babylon and then studies the ongoing history of those ideas. The biblical idea that a covenant binds Israel to God, along with its implications for human worth - including the view of woman as person - will be examined. Comparative cultural issues include the reinterpretations of covenant within Christianity and Islam. The course investigates the rabbinic concept of oral law, the use of law to maintain the civil and religious stability of the Jewish people, and the kabbalistic transformation of law. The course concludes with contemporary Jewish thinkers who return to the Bible while seeking to establish a modern system of universal ethics.The premise of the course is the discipline of academic religious studies. The assumptions of the course are therefore academic and secular, as required by the First Amendment. All texts and all religious traditions will be examined analytically and critically. Students are expected to understand and master this approach, which includes questioning conventional cultural assumptions about the composition and authorship of the Bible. Willingness to ask such questions and openness to new ways of thinking are essential to success in the course.",
    "prereq": []
  },
  {
    "uid": "797145",
    "code": "JWST3034",
    "subject": "JWST",
    "number": "3034",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Jewish History & Culture",
    "fullname": "Introduction to Jewish History and Cultures",
    "info": "This course traces the development of Judaism and Jewish civilizations from their beginnings to the present. With over three millennia as its subject, the course must of necessity be a general survey. Together we will explore the mythic structures, significant documents, historical experiences, narratives, practices, beliefs, and worldviews of the Jewish people. The course begins by examining the roots of Judaism in the Hebrew Bible and the history of ancient Israel but quickly focuses on the creative forces that developed within Judaism as a national narrative confronted the forces of history, especially in the forms of the Persian, Greek, and Roman empires.  Rabbinic Judaism becomes the most dominant creative force and will receive our greatest attention, both in its formative years and as it encounters the rise of Christianity and Islam. After studying the Jewish experience in the medieval world, we will turn to Judaism’s encounter with the enlightenment and modernity. The historical survey concludes by attending to the transformations within Judaism and Jewish life of the last 150 years, including a confrontation with the experience of the Holocaust. Woven throughout this historical survey will be repeated engagements with core questions: “Who is a Jew?” “What do Jews believe?” “What do Jews do?” “What do we mean by ‘religion’?”   “How do Jews read texts within their tradition?” And perhaps most importantly, “How many answers are there to a Jewish question?” Students in this course can expect to come away with some knowledge of the Bible in Judaism, rabbinic literature and law, Jewish mysticism and philosophy, Jewish nationalism and Zionism, Jewish culture, ritual, and worship in the synagogue, the home, and the community, and Jewish celebrations of life cycle events and the festivals.",
    "prereq": []
  },
  {
    "uid": "789774",
    "code": "JWST3083",
    "subject": "JWST",
    "number": "3083",
    "honors": false,
    "writingIntensive": false,
    "name": "Jesus the Jew",
    "fullname": "Jesus the Jew",
    "info": "Historic figure of Jesus within context of first century Palestinian Judaism. Main groups/institutions of Judaism at time of Jesus. Rabbinic literature/traditions. Works describing Jesus' life/sayings (synoptic gospels). Jesus and the Law, Messianic ideals/expectations, problem of religious authority. Positions regarding Rome, its authority. James and the Jerusalem Church.",
    "prereq": []
  },
  {
    "uid": "797738",
    "code": "JWST3111",
    "subject": "JWST",
    "number": "3111",
    "honors": false,
    "writingIntensive": false,
    "name": "Too Jewish?",
    "fullname": "Too Jewish? The Complex Construction of the Jewish American Psyche in Literature, Art, and Film",
    "info": "Questions about image/location of Jews in American arts and pop culture. Examples from literature, music, film.",
    "prereq": []
  },
  {
    "uid": "790839",
    "code": "JWST3112",
    "subject": "JWST",
    "number": "3112",
    "honors": false,
    "writingIntensive": false,
    "name": "Jewish Mysticism and Kabbalah",
    "fullname": "Jewish Mysticism, Magic, and Kabbalah",
    "info": "Mystical traditions from early rabbinic traditions to Zohar (Book of Splendor) in 13th century. Literature of heavenly ascent (Hekhalot, Merkavah), Book of Creation (Sefer Yetzirah), precursors of Zohar.the Bahir. Schools of Provence, Gerona, and Zohar. Tension between legal/mystical aspects, magical theurgic techniques, evolution of doctrine of Sefirot, mystical interpretation of Scripture, erotic dimension.",
    "prereq": []
  },
  {
    "uid": "010533",
    "code": "JWST3113",
    "subject": "JWST",
    "number": "3113",
    "honors": false,
    "writingIntensive": false,
    "name": "Afro-Am Jewsh-Am",
    "fullname": "African American and Jewish American Relations in the United States",
    "info": "Historical and social scientific study of relations between African Americans and Jewish Americans in the U. S. during the 20th century. Includes immigration, work, cultures, gender, and alliance, and conflict.",
    "prereq": []
  },
  {
    "uid": "010805",
    "code": "JWST3115",
    "subject": "JWST",
    "number": "3115",
    "honors": false,
    "writingIntensive": false,
    "name": "Midrash: Reading and Retelling",
    "fullname": "Midrash: Reading and Retelling the Hebrew Bible",
    "info": "How did the Jews of the first seven centuries of the common era read and understand the Hebrew Bible? What were the problems they faced -- interpretive, historical, theological -- in trying to apply their holy scriptures? This course explores key issues that led to the development of a new form of Judaism in late antiquity, rabbinic Judaism, and its methods of scriptural interpretation. The course's study will focus on the forms and practices of rabbinic scriptural interpretation (midrash) as it developed in Roman Palestine and Sasanian Babylonia, focusing on key narrative and legal passages in the Five Books of Moses (Torah). A main focus of the course will be on the ways the rabbis adapted the Hebrew Bible to express their own core concerns.",
    "prereq": []
  },
  {
    "uid": "795331",
    "code": "JWST3116",
    "subject": "JWST",
    "number": "3116",
    "honors": false,
    "writingIntensive": false,
    "name": "Jews and Popular Culture",
    "fullname": "Jews and Popular Culture in 20th Century United States",
    "info": "Many types of 20th century American popular culture shaped, in part, by European Jewish immigrants and their native born descendants. How theater, film, music, humor, and television were affected by the Jews' innovations, social marginality, their wish to assimilate and to resist assimilation to the culture. How the nation was and was not reshaped in the process.",
    "prereq": []
  },
  {
    "uid": "797155",
    "code": "JWST3126",
    "subject": "JWST",
    "number": "3126",
    "honors": false,
    "writingIntensive": false,
    "name": "Judaism-Mod World",
    "fullname": "Judaism in the Modern World",
    "info": "Jewish theology, religion, and ideology in the 19th and 20th centuries. American Judaism: orthodox, conservative, reform, reconstructionist; religious and communal organizational structures.  Zionism in Europe, Israel, and America. Hasidism. Jewish responses to feminism and the democratic ideal.  ",
    "prereq": []
  },
  {
    "uid": "797685",
    "code": "JWST3201",
    "subject": "JWST",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Contxt & Interp, Hebrew Bible",
    "fullname": "The Bible: Context and Interpretation, World of the Hebrew Bible",
    "info": "The Hebrew Bible and Old Testament are literary collections that modern Jewish and Christian traditions maintain as important, but these collections were initially produced by ancient Israelite scribes who composed and/or compiled the biblical texts at particular time periods in the ancient Near East. This course will introduce the academic study of biblical texts, which demands critical analysis of the literature and an openness to reading the literature from the perspective of ancient Israelite writers (who lived in a world far different from today). The course will spend considerable time on the literary (and scribal) composition of biblical prose texts; time will also be spent on the historical circumstances of biblical prophets and other writers of the biblical texts. This course will only address the ancient setting of the biblical texts and not re-interpretations in Jewish or Christian traditions. Given the scope of the course, modern interpretations of the biblical literature will not be discussed; we will only focus on this literature in its ancient setting.prereq: Knowledge of Hebrew not required",
    "prereq": []
  },
  {
    "uid": "810224",
    "code": "JWST3202",
    "subject": "JWST",
    "number": "3202",
    "honors": false,
    "writingIntensive": false,
    "name": "Bible: Prophecy Ancnt Israel",
    "fullname": "Bible: Prophecy in Ancient Israel",
    "info": "Survey of Israelite prophets. Emphasizes Amos, Hosea, Isaiah, Jeremiah, Ezekiel, Second Isaiah. Prophetic contributions to Israelite religion. Personality of prophets. Politics, prophetic reaction. Textual analysis, biblical scholarship. Prophecy viewed cross-culturally.prereq: [RelS 1001] or [CNES 1201 or JWST 1201 or RELS 1201 or CNES 3201 or JWST 3201 or RELS 3201]",
    "prereq": {
      "or": [
        {
          "code": "RELS 1001",
          "subject": "RELS",
          "id": "1001"
        },
        {
          "or": [
            {
              "code": "CNES 1201",
              "subject": "CNES",
              "id": "1201"
            },
            {
              "code": "JWST 1201",
              "subject": "JWST",
              "id": "1201"
            },
            {
              "code": "RELS 1201",
              "subject": "RELS",
              "id": "1201"
            },
            {
              "code": "CNES 3201",
              "subject": "CNES",
              "id": "3201"
            },
            {
              "code": "JWST 3201",
              "subject": "JWST",
              "id": "3201"
            },
            {
              "code": "RELS 3201",
              "subject": "RELS",
              "id": "3201"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "808486",
    "code": "JWST3203",
    "subject": "JWST",
    "number": "3203",
    "honors": false,
    "writingIntensive": false,
    "name": "The Bible: Wisdom, Poetry",
    "fullname": "The Bible: Wisdom, Poetry, and Apocalyptic",
    "info": "Survey of books of Psalms, Proverbs, Job, Song of Songs, Lamentations, Ecclesiastes (Qoheleth). Characteristics of biblical poetry. Conceptions of Israelite wisdom writing. Traits of early Jewish apocalyptic writing.",
    "prereq": []
  },
  {
    "uid": "804684",
    "code": "JWST3204",
    "subject": "JWST",
    "number": "3204",
    "honors": false,
    "writingIntensive": false,
    "name": "The Dead Sea Scrolls",
    "fullname": "The Dead Sea Scrolls",
    "info": "Introduction to Dead Sea Scrolls and Qumran. Contents of Dead Sea Scrolls, significance for understanding development of the Bible. Background of Judaism and Christianity. Archaeological site of Qumran.",
    "prereq": []
  },
  {
    "uid": "811577",
    "code": "JWST3205",
    "subject": "JWST",
    "number": "3205",
    "honors": false,
    "writingIntensive": false,
    "name": "Women, Gender, & Hebrew Bible",
    "fullname": "Women, Gender, and the Hebrew Bible",
    "info": "How men, women, gender, sexuality is portrayed in Hebrew Bible. Social/religious roles/status of women in ancient Israel. Read biblical texts from academic point of view.",
    "prereq": []
  },
  {
    "uid": "818563",
    "code": "JWST3206",
    "subject": "JWST",
    "number": "3206",
    "honors": false,
    "writingIntensive": false,
    "name": "Purity and Pollution",
    "fullname": "Sex, Murder, and Bodily Discharges: Purity and Pollution in the Ancient World",
    "info": "\"Dirt is dangerous,\" Mary Douglas declared more than 50 years ago in her groundbreaking study, \"Purity and Danger.\" Douglas's ideas have been influential in ancient Mediterranean and Near Eastern studies and provide a framework for us to analyze how people in antiquity conceptualized ideas of purity, pollution, ritual sacrifice, sacred spaces, bodily leakages, and the liminal stages of life and death. We'll delve into Douglas's theory in light of ancient examples with a special focus on ancient Israelite texts (the Tanakh or Old Testament) as well as ancient Mediterranean and Near Eastern building inscriptions, specialist manuals, and rituals. Through this evidence, we'll gain profound insight into the ancient notions of \"sacred/clean\" (purity) and the \"unclean/profane\" (pollution).",
    "prereq": []
  },
  {
    "uid": "010754",
    "code": "JWST3315",
    "subject": "JWST",
    "number": "3315",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemp Israeli Lit",
    "fullname": "Contemporary Israeli Literature in English",
    "info": "Modern short stories and poetry. Works of Agnon, Yizhar, Hazaz, Yhehoshua, Greenberg, Amihai, Pagis, and others. Alienation, the crisis of faith, war, holocaust, Jews and Arabs.",
    "prereq": []
  },
  {
    "uid": "010758",
    "code": "JWST3401",
    "subject": "JWST",
    "number": "3401",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of Jewish Peopl",
    "fullname": "The Art and Architecture of the Jewish People",
    "info": "Jewish art and architecture from antiquity to 7th-century C.E. Issues include Jewish art and the Second Commandment, non-Jewish artistic traditions, the nature of Jewish art. ",
    "prereq": []
  },
  {
    "uid": "806301",
    "code": "JWST3502W",
    "subject": "JWST",
    "number": "3502",
    "honors": false,
    "writingIntensive": true,
    "name": "Anc Israel: Conquest to Exile",
    "fullname": "Ancient Israel: From Conquest to Exile",
    "info": "Israel and Judah were not states of great importance in the ancient Near East.  Their population and territory were small, and they could not resist conquest by larger, more powerful states like Assyria and Rome.  Yet their ancient history matters greatly today, out of proportion to its insignificance during the periods in which it transpired.  The historical experiences of the people of Israel and Judah were accorded religious meaning and literary articulation in the Hebrew Bible (the Old Testament), which became a foundational text for Judaism, Christianity, and Islam.  Essential features of Western as well as Islamic civilization are predicated on some element of Israel’s ancient past, as mediated through the Bible; therefore it behooves us to understand that past.  But the Bible is a religious work, not a transcript of events, and the history of ancient Israel is not derived merely from reading the biblical accounts of it.  Archaeological excavations have revealed the physical remains of the cultures of Israel and neighboring lands, as well as bringing to light inscriptions, documents, and literary works produced by those cultures.  These sources, which complement and sometimes contradict the accounts conveyed in the Bible, provide the basis for reconstructing a comprehensive history of ancient Israel.This course covers the history of Israel and Judah from the Late Bronze Age (c. 1550-1200 BCE), by the end of which Israel had emerged as a distinct ethnic entity, to the period of Roman rule (63 BCE-330 CE), which saw the final extinction of ancient Israel, represented by the kingdom of Judea, as a political entity.  Knowledge of this history is based on archaeological, epigraphic, and literary sources, including the Hebrew Bible.N.B.: Students should be aware that the study of history, like all the human and natural sciences, is predicated on inquiry, not a priori judgments.  Accordingly, the Bible is not privileged as an intrinsically true or authoritative record.  No text is presumed inerrant, and all sources are subject to scrutiny, in the context of scholarly discourse.  Biblical texts are treated just like all other texts, as the products of human beings embedded in a historical context, and as the subject of analysis and interpretation.  Persons of all faiths and of no faith are equally welcome to participate in such scholarly discourse.  However, students who feel that their own religious beliefs require an understanding of the Bible that is antithetical to the foregoing statements are cautioned that they may find themselves uncomfortable with this course.",
    "prereq": []
  },
  {
    "uid": "814001",
    "code": "JWST3504",
    "subject": "JWST",
    "number": "3504",
    "honors": false,
    "writingIntensive": false,
    "name": "Jewish Resistance in Antiquity",
    "fullname": "Apocalypticism, Cosmic Warfare, and the Maccabees: Jewish Strategies of Resistance in Antiquity",
    "info": "The rise of Hellenistic kingdoms in the ancient Mediterranean and Near East created a variety of responses from local, subjugated peoples, and some of the most documented cases are those of Jewish populations in Koele-Syria/Palestine. The main objective of this course is to analyze Jewish responses to imperial rule and military conflict during the Hellenistic and early Roman periods (c. 300 B.C.E. - 150 C.E.), but we will also spend time examining the broader picture of how local, ancestral groups fared under foreign rule. Along with discussing pertinent archaeological evidence, we will discuss Jewish literature and documentary material from this period, including, the sectarian documents of the Dead Sea Scrolls, the Book of Judith (a Jewish \"novel\"), the Books of Daniel and the Maccabees (all of which provide historical information about the Maccabean revolt and rise of the Hasmoneans), and the writings of Josephus (a Jewish writer who witnessed the Roman takeover of Palestine in the first century C.E.). This course will stay within the confines of the ancient evidence and not examine later interpretations when analyzing each historical period; it will begin with Ptolemaic control of the region and conclude with the Bar Kokhba revolt, its aftermath, and the resilience of Jewish populations in northern Palestine. Topics that will be examined in depth are messianism and apocalypticism, the Jerusalem Temple, Jewish ancestral traditions (which include biblical literature), and theoretical models used by scholars to analyze power relationships in antiquity.",
    "prereq": []
  },
  {
    "uid": "825598",
    "code": "JWST3506",
    "subject": "JWST",
    "number": "3506",
    "honors": false,
    "writingIntensive": false,
    "name": "The Israeli Mossad",
    "fullname": "The Israeli Mossad in Film and Literature: History, Narrative, and Ethics",
    "info": "This course will look at Mossad's activities and their perceptions in Israeli culture through lenses of collective memory and national identity. Students will examine primary and secondary sources to understand the historic background and the various narratives, shaping the Israeli culture. Students will conduct discussions pertaining to the place of Mossad in Israeli culture expressing opinions about the ethical component of Mossad's activities.",
    "prereq": []
  },
  {
    "uid": "807122",
    "code": "JWST3511",
    "subject": "JWST",
    "number": "3511",
    "honors": false,
    "writingIntensive": false,
    "name": "Muslims and Jews",
    "fullname": "Muslims and Jews: Conflict and Co-existence in the Middle East and North Africa since 1700",
    "info": "Diversity of social/cultural interactions between Muslims and Jews and between Islam and Judaism since 1700. What enabled the two religious communities to peacefully coexist? What were causes of conflict? Why is history of Muslim-Jewish relations such a contested issue? ",
    "prereq": []
  },
  {
    "uid": "807123",
    "code": "JWST3512",
    "subject": "JWST",
    "number": "3512",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of Mod Israel/Palestine",
    "fullname": "History of Modern Israel/Palestine: Society, Culture, and Politics",
    "info": "History of Zionism/Israel. Arab-Jewish conflict, tensions between religious/Jews. Relationships between Mizrahi, Ashkenazi, Russian, Ethiopian, Arab citizens. Israeli cultural imagery. Newsreels, political posters, television shows, films, popular music.",
    "prereq": []
  },
  {
    "uid": "818240",
    "code": "JWST3515",
    "subject": "JWST",
    "number": "3515",
    "honors": false,
    "writingIntensive": false,
    "name": "Multiculturalism in Israel",
    "fullname": "Multiculturalism in Modern Israel: how communities, ideologies, and identities intersect",
    "info": "This course focuses on the way various cultural groups in Israel attempt to achieve cultural recognition. Students will learn how various ethnic and religious groups shape their identities through process of acculturation and struggle. Students will learn about several Israeli cultures by reading literature, book chapters and case-studies, and watching movies, all of which center on these debates.Students will examine various case studies centered on these multicultural issues in Israel and will discuss and reflect on the implications of the issues raised by the course material for the international community, the United States, and for their own lives.",
    "prereq": []
  },
  {
    "uid": "826214",
    "code": "JWST3518",
    "subject": "JWST",
    "number": "3518",
    "honors": false,
    "writingIntensive": false,
    "name": "Jewish Humor",
    "fullname": "Jewish Humor: Seriously Funny from Text to Stage to Screen",
    "info": "In the U.S. the comic world has been so dominated by Jewish writers and performers that the \"People of the Book\" have come to be known as the \"People of the Joke.\" A 2013 Pew Research poll showed that for American Jews, a sense of humor is essential to their Jewish identity, more important than ritual or the observance of traditional religious commandments. While surveying a broad range of humor in print, on stage, and in films along with classical Jewish texts including the Torah and Talmud, students will learn about the historical and cultural contexts that make such humor not only possible, but existentially necessary, a serious business indeed. And we'll accomplish all this while laughing hysterically. No prior knowledge of Jewish history and culture is required or assumed.",
    "prereq": []
  },
  {
    "uid": "805609",
    "code": "JWST3520",
    "subject": "JWST",
    "number": "3520",
    "honors": false,
    "writingIntensive": false,
    "name": "History of the Holocaust",
    "fullname": "History of the Holocaust",
    "info": "Study of 1933-1945 extermination of six million Jews and others by Nazi Germany on basis of race. European anti-Semitism. Implications of social Darwinism and race theory. Perpetrators, victims, onlookers, resistance. Theological responses of Jews and Christians.",
    "prereq": []
  },
  {
    "uid": "797140",
    "code": "JWST3521W",
    "subject": "JWST",
    "number": "3521",
    "honors": false,
    "writingIntensive": true,
    "name": "History of the Holocaust",
    "fullname": "History of the Holocaust",
    "info": "Study of the 1933-1945 extermination of six million Jews and others by Nazi Germany on the basis of race. European anti-Semitism, implications of social Darwinism and race theory, perpetrators, victims, onlookers, resistance, and theological responses of Jews and Christians.",
    "prereq": []
  },
  {
    "uid": "010550",
    "code": "JWST3522",
    "subject": "JWST",
    "number": "3522",
    "honors": false,
    "writingIntensive": false,
    "name": "Arab-Is Conflict",
    "fullname": "History of the Arab-Israeli Conflict",
    "info": "The events leading to the re-establishment of the State of Israel in 1948 and subsequent conflicts and negotiations up to present.   Zionism and Arab resistance, Great Powers' involvement, War of Independence/First Palestine War, subsequent conflicts and their aftermath.",
    "prereq": []
  },
  {
    "uid": "807383",
    "code": "JWST3601",
    "subject": "JWST",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Fleeing Hitler: Ger Filmmakers",
    "fullname": "Fleeing Hitler: German and Austrian Filmmakers BetweenEurope and Hollywood",
    "info": "German/American films by famous directors who left Europe inNazi period. Analysis of films by Fritz Lang, Max Ophuls, Robert Siodmak, Otto Preminger, Billy Wilder, Douglas Sirk, and others. Films as art works and as cultural products of particular social, political, and historical moments.",
    "prereq": []
  },
  {
    "uid": "811355",
    "code": "JWST3603",
    "subject": "JWST",
    "number": "3603",
    "honors": false,
    "writingIntensive": false,
    "name": "Jews/Muslims: Medieval Iberia",
    "fullname": "Jews and Muslims in Medieval Iberia",
    "info": "Cultural production of Sephardic Jews/Andalusi Muslims. Andalusi poetry. Fiction of alSaraqusti,Judah alHarizi, uan Ruiz. Treatises of Averroes/Maimonides. How cultural assimilation in medieval alAndalus complicates notions of identity, subalternity, postcoloniality. How literary, historical, philosophical, theological works of major Jewish/Muslim thinkers survived among later Spanish Christian intellectuals.",
    "prereq": []
  },
  {
    "uid": "808759",
    "code": "JWST3606",
    "subject": "JWST",
    "number": "3606",
    "honors": false,
    "writingIntensive": false,
    "name": "Christians, Muslims, and Jews",
    "fullname": "Christians, Muslims, and Jews in the Middle Ages",
    "info": "A Pew Research survey of the global religious landscape in 2010 found 2.2 billion Christians (31.5% of the world's population), 1.6 billion Muslims (23.2%), and 14 million Jews (.2%). In this class, we explore how the histories of these religious communities became deeply entangled in an age of diplomacy, trade, jihad, and crusade.",
    "prereq": []
  },
  {
    "uid": "797087",
    "code": "JWST3631",
    "subject": "JWST",
    "number": "3631",
    "honors": false,
    "writingIntensive": false,
    "name": "Jews, Germans, Race, Memory",
    "fullname": "Jewish and German Writing at the Margins: Multilingualism, Race, Memory",
    "info": "How are minority stories, novels, and poems constructed at the margins of a majority culture's language? This course addresses this question by exploring the complexity of Jewish culture in modernity, with a focus on 20th and 21st century German and American literature. We will first tackle the open-ended and endlessly productive question of what is meant by Jewish culture. What is a Jewish writer and is there such a thing as Jewish writing? What makes a text \"Jewish\"? How do Jewish authors challenge the assumptions of majority culture in their work? What role do multilingualism and translation play in the formation of Jewish cultures at the margins? We will trace the lines of affinity between the U.S. and Europe to explore the entangled histories of Germans and Jews, and between German Jews and Turkish Germans, as we look at works that challenge and expand the definition of Jewishness in the 20th century. Additional topics to be considered include how the legacies of American slavery and European colonialism shape our understandings of the Nazi genocide of the Jews, and whether Jewish writing should be understood under the rubric of \"whiteness.\" Moving beyond the approach to German Jewish literary studies anchored in Weimar Germany, we will explore the circulation of Jewish memory between Europe and the U.S. in the aftermath of the Holocaust. We will read works by, among others, Franz Kafka, Paul Celan, Gershon Scholem, Hannah Arendt, Benjamin Stein, Walter Benjamin, Barbara Honigmann, Hélène Cixous, Raymond Federman, W.G. Sebald, Allen Ginsberg, Adeena Karasick, Alfred Kazin, Saul Bellow, Philip Roth, Bernard Malamud, Avram Sutzkever, Zafer Senocak.prereq: No knowledge of German required; some work in German must be done in order to count this course toward a German minor or a German, Scandinavian, Dutch major.",
    "prereq": []
  },
  {
    "uid": "009693",
    "code": "JWST3632W",
    "subject": "JWST",
    "number": "3632",
    "honors": false,
    "writingIntensive": true,
    "name": "Jewish Women in the US",
    "fullname": "Jewish Women in the United States",
    "info": "History of American Jewish women. Uses literary/religious texts, primary documents, films, and histories to analyze Jewish women's experiences in the United States and their transformation of Judaism, political activism, and their role in the bourgeois family. How they are represented, how they represent themselves. Interdisciplinary approach.",
    "prereq": []
  },
  {
    "uid": "816804",
    "code": "JWST3633",
    "subject": "JWST",
    "number": "3633",
    "honors": false,
    "writingIntensive": false,
    "name": "The Holocaust",
    "fullname": "The Holocaust: Memory, Narrative, History",
    "info": "Decades after the end of the second world war, the Holocaust continues to play a formative role in public discourse about the past in Germany and Austria. As the event itself recedes into the past, our knowledge about the Holocaust has become increasingly shaped by literary and filmic representations of it. This course has several objectives: first, to deepen students' historical knowledge of the events and experiences of the Holocaust, and at the same time to introduce critical models for examining the relationship between personal experience, historical events, and forms of representation. This class will introduce students to the debates about the politics of memory and the artistic representation of the Holocaust, with special focus on public debates about the complex ways in which Holocaust memory surfaces in contemporary Germany and Austria, and by the accrual of layers of text and discourse about the Holocaust. We will explore the controversies and debates about public Holocaust memorialization in Germany, Austria, and the U.S. We will also explore the complex interplay between documentary and fictional accounts of the Holocaust, with attention paid to literary and film texts that challenge and \"remediate\" the limits of Holocaust representation. Additional topics will include Holocaust testimony; Holocaust memoirs, and 2nd and 3rd generation Holocaust literature, the Historians' Debate of the 1980s.No knowledge of German required.",
    "prereq": []
  },
  {
    "uid": "802197",
    "code": "JWST3711",
    "subject": "JWST",
    "number": "3711",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Yiddish I",
    "fullname": "Intermediate Yiddish I",
    "info": "Continuing studies in Yiddish.",
    "prereq": []
  },
  {
    "uid": "803087",
    "code": "JWST3712",
    "subject": "JWST",
    "number": "3712",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Yiddish II",
    "fullname": "Intermediate Yiddish II",
    "info": "Continuing studies in Yiddish.",
    "prereq": []
  },
  {
    "uid": "802199",
    "code": "JWST3721",
    "subject": "JWST",
    "number": "3721",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Yiddish I",
    "fullname": "Advanced Yiddish I",
    "info": "Continuing studies in Yiddish.",
    "prereq": []
  },
  {
    "uid": "803089",
    "code": "JWST3722",
    "subject": "JWST",
    "number": "3722",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Yiddish II",
    "fullname": "Advanced Yiddish II",
    "info": "Continuing studies in Yiddish.",
    "prereq": []
  },
  {
    "uid": "811889",
    "code": "JWST3729",
    "subject": "JWST",
    "number": "3729",
    "honors": false,
    "writingIntensive": false,
    "name": "Nazi Germany/Hitler's Europe",
    "fullname": "Nazi Germany and Hitler's Europe",
    "info": "Comprehensive exploration of Third Reich. How Nazis came to power, transformations of 1930s, imposition of racial politics against Jews/others, nature of total war. Historical accounts, memoirs, state documents, view films.",
    "prereq": []
  },
  {
    "uid": "818603",
    "code": "JWST3745",
    "subject": "JWST",
    "number": "3745",
    "honors": false,
    "writingIntensive": false,
    "name": "The Holocaust in France",
    "fullname": "The Holocaust in France: Literature, History, Testimony",
    "info": "This course examines the event of the Holocaust (which we call \"Shoah\" in France since the 80s and especially since the film of the same name by Claude Lanzmann) in literature, film, and archives. France has a complex relationship with Jews since the Middle Ages. During the French Revolution (1789), then under the Empire (Napoleon Bonaparte, 1800-1815), the Jews benefitted from political emancipation. The Republic defended the equality of Jews before the law as French citizens. But France was also the country of political anti-Semitism and of the Dreyfus Affair (there were in the nineteenth century some very virulent anti-Semitic propaganda writers, for example, Edouard Drumont, author of Jewish France, in 1880, just before the Dreyfus Affair). This history of the Jews in France culminates with the Vichy regime, the policy of collaboration with Nazi Germany, antisemitic writings and propaganda emanating from important writers such as Louis-Ferdinand Celine and politicians, and the deportation of part of the Jewish population to the extermination camps. How does this story affect fictional writing and debates on how to represent this event? More than a course on the Holocaust, we explore the story of its reminiscence in French culture. It is not a history class, but a class in culture, literature, memory, and testimony. FREN 3345 and 3745 meet together. Both FREN 3345 and 3745 are taught in English. Reading and writing assignments for FREN 3345 are in modern French. FREN 3345 may count towards the major or minor in French Studies. Reading and writing assignments for FREN 3745 are in English. FREN 3745 does not count towards the major or minor in French Studies.prereq: None",
    "prereq": []
  },
  {
    "uid": "806451",
    "code": "JWST3775",
    "subject": "JWST",
    "number": "3775",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of Jews in Europe",
    "fullname": "History of Jews in Europe and the Atlantic World, from 1700 to Present",
    "info": "Social, cultural, and political experience of Jews in Europe and the Americas. Emancipation, social/economic development, assimilation, migration, political anti-Semitism, Zionism, the holocaust, transformations after 1945.",
    "prereq": []
  },
  {
    "uid": "805504",
    "code": "JWST3778",
    "subject": "JWST",
    "number": "3778",
    "honors": false,
    "writingIntensive": false,
    "name": "Jews of the Mediterranean",
    "fullname": "Jews of the Islamic Mediterranean and Christian Europe, 7th-17th Centuries",
    "info": "Experience of Jews, their interactions with Christian Europe and Muslim Mediterranean. Social, cultural, and intellectual life of Jews. Migration, trade. Relationship of Jews to governments and non-Jewish religious/secular authorities.",
    "prereq": []
  },
  {
    "uid": "825649",
    "code": "JWST3837",
    "subject": "JWST",
    "number": "3837",
    "honors": false,
    "writingIntensive": false,
    "name": "Orienting Hebrew Literature",
    "fullname": "Orienting Hebrew Literature",
    "info": "An introductory survey of Modern Hebrew Literature and its journey from Eastern Europe through Ottoman/British Palestine to the State of Israel. The class centers on the manner in which Hebrew literature has envisioned the Middle East or \"the Orient,\" reflecting, manipulating, or challenging orientalist paradigms. The first part of the course focuses on Hebrew literature written by Eastern European writers, their fantasies of the East as well as their engagements with orientalist or anti-Semite prejudices. The second part examines Hebrew literature's attempts to \"nativize\" in Palestine. Finally, we will read a series of texts by Ashkenazi, Mizrahi, and Palestinian Israeli writers that complicate any attempt to position Hebrew within an Orient/Occident dichotomy. No prior familiarity with Hebrew literature is necessary. All texts will be read in English.",
    "prereq": []
  },
  {
    "uid": "818533",
    "code": "JWST3896",
    "subject": "JWST",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Jewish Studies Internship",
    "fullname": "Jewish Studies Internship for Academic Credit",
    "info": "The Jewish Studies Internship is intended to support an applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals which are related to the field of Jewish studies. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate knowledge and theories gained previously within the classroom context with practical application and skill development in professional or community settings, alongside academic assignments intended to reflect upon, inform, and reinforce the workplace experiences. The skills and knowledge learned within the workplace setting should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor, and the instructor is responsible for evaluating the specifically academic component of the internship course. Academic credit reflects academic learning, with the understanding that such learning may also take place within the workplace environment.",
    "prereq": []
  },
  {
    "uid": "010809",
    "code": "JWST3900",
    "subject": "JWST",
    "number": "3900",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Jewish Studies",
    "fullname": "Topics: Jewish Studies",
    "info": "Historical, religious, sociological, anthropological, and humanistic study of Judaism and the Jewish people. Approach, method of study vary with topic.",
    "prereq": []
  },
  {
    "uid": "796079",
    "code": "JWST3970",
    "subject": "JWST",
    "number": "3970",
    "honors": false,
    "writingIntensive": false,
    "name": "Suppl. Discussion in JWST",
    "fullname": "Supplemental Discussion in Jewish Studies",
    "info": "Extra discussion section with T.A. Attached to concurrent 3xxx course.",
    "prereq": []
  },
  {
    "uid": "817612",
    "code": "JWST3993",
    "subject": "JWST",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study. Prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "795484",
    "code": "JWST4000W",
    "subject": "JWST",
    "number": "4000",
    "honors": false,
    "writingIntensive": true,
    "name": "Final Project",
    "fullname": "Final Project, Writing Intensive",
    "info": "Independent research/writing under supervision of a faculty sponsor. A student may approach any JwSt faculty member to develop a program of independent research/writing in an area of student's choosing.prereq: JwSt major, permission of dir of undergrad studies",
    "prereq": []
  },
  {
    "uid": "010825",
    "code": "JWST4001W",
    "subject": "JWST",
    "number": "4001",
    "honors": false,
    "writingIntensive": true,
    "name": "Final Project",
    "fullname": "Final Project, Writing Intensive",
    "info": "Independent research and writing, under supervision of a faculty sponsor. Student makes a contract with instructor to write an in-depth research paper, or comparable project, to be completed in conjunction with a JwSt 5xxx course.prereq: concurrent registration is required (or allowed) in  5xxx, JwSt major, permission of dir of undergrad studies",
    "prereq": []
  },
  {
    "uid": "816905",
    "code": "JWST4315",
    "subject": "JWST",
    "number": "4315",
    "honors": false,
    "writingIntensive": false,
    "name": "Memory Politics after Genocide",
    "fullname": "Never Again! Memory & Politics after Genocide",
    "info": "Course focuses on the social repercussions and political consequences of large-scale political violence, such as genocide, war crimes, and crimes against humanity. Students learn how communities and states balance the demands for justice and memory with the need for peace and reconciliation and addresses cases from around the globe and different historical settings.prereq: SOC 1001 or 1011V recommended, A-F required for Majors/Minors.",
    "prereq": {
      "or": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "code": "JWST 1011",
          "subject": "JWST",
          "id": "1011"
        }
      ]
    }
  },
  {
    "uid": "820263",
    "code": "JWST4319",
    "subject": "JWST",
    "number": "4319",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Antisemitism",
    "fullname": "\"Jews will not replace us!\" Global Antisemitism from its Origins to the Present",
    "info": "This course will explore the topic of antisemitism, its history and cultural logic, and the relation to other forms of exclusion tied to race, religion, and citizenship in modern times. Starting with the history of Jewish emancipation in Europe and the subsequent debates about the \"Jewish Question,\" students will learn to identify the key features of political antisemitism and the ways that antisemitism has been explained by different social theories, including Marxism, Functionalism, and Critical theory. The course will examine the differences and continuities between older theological forms of anti-Judaism and modern antisemitism, the connections between antisemitism, nativism, and xenophobia in the US and globally, and engage with current debates regarding the correlation between anti-Zionism and antisemitism. We will also explore Jewish social, political, and ideological responses to antisemitism in Europe and the US, from the Holocaust to the present.Pre-reqs: sophomore or above; Soc 3701 recommended; soc majors/minors must register A-F ",
    "prereq": []
  },
  {
    "uid": "802198",
    "code": "JWST4711",
    "subject": "JWST",
    "number": "4711",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Yiddish I",
    "fullname": "Intermediate Yiddish I",
    "info": "Continuing studies in Yiddish.",
    "prereq": []
  },
  {
    "uid": "803088",
    "code": "JWST4712",
    "subject": "JWST",
    "number": "4712",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Yiddish II",
    "fullname": "Intermediate Yiddish II",
    "info": "Continuing studies in Yiddish.",
    "prereq": []
  },
  {
    "uid": "802200",
    "code": "JWST4721",
    "subject": "JWST",
    "number": "4721",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Yiddish I",
    "fullname": "Advanced Yiddish I",
    "info": "Continuing studies in Yiddish.",
    "prereq": []
  },
  {
    "uid": "803090",
    "code": "JWST4722",
    "subject": "JWST",
    "number": "4722",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Yiddish II",
    "fullname": "Advanced Yiddish II",
    "info": "Continuing studies in Yiddish.",
    "prereq": []
  },
  {
    "uid": "811626",
    "code": "JWST4878W",
    "subject": "JWST",
    "number": "4878",
    "honors": false,
    "writingIntensive": true,
    "name": "Israeli-Palestinian Situation",
    "fullname": "Israeli-Palestinian Situation",
    "info": "Situation as clash of two communities. History, politics, respective narratives of each community. Divisions within each community that are consequential for reconciliation. Examples of reconciliation literature from both communities.",
    "prereq": []
  },
  {
    "uid": "016514",
    "code": "JWST5013W",
    "subject": "JWST",
    "number": "5013",
    "honors": false,
    "writingIntensive": true,
    "name": "Biblical Law & Jewish Ethics",
    "fullname": "Biblical Law and Jewish Ethics",
    "info": "This course introduces students to the original meaning and significance of religious law and ethics within Judaism. Law is the single most important part of Jewish history and identity. At the same time, law is also the least understood part of Judaism and has often been the source of criticism and hatred. We shall therefore confront one of the most important parts of Jewish civilization and seek to understand it on its own terms. In demonstrating how law becomes a fundamental religious and ethical ideal, the course will focus on the biblical and Rabbinic periods but spans the entire history of Judaism. Consistent with the First Amendment, the approach taken is secular. There are no prerequisites: the course is open to all qualified students.The course begins with ideas of law in ancient Babylon and then studies the ongoing history of those ideas. The biblical idea that a covenant binds Israel to God, along with its implications for human worth - including the view of woman as person - will be examined. Comparative cultural issues include the reinterpretations of covenant within Christianity and Islam. The course investigates the rabbinic concept of oral law, the use of law to maintain the civil and religious stability of the Jewish people, and the kabbalistic transformation of law. The course concludes with contemporary Jewish thinkers who return to the Bible while seeking to establish a modern system of universal ethics.The premise of the course is the discipline of academic religious studies. The assumptions of the course are therefore academic and secular, as required by the First Amendment. All texts and all religious traditions will be examined analytically and critically. Students are expected to understand and master this approach, which includes questioning conventional cultural assumptions about the composition and authorship of the Bible. Willingness to ask such questions and openness to new ways of thinking are essential to success in the course.",
    "prereq": []
  },
  {
    "uid": "797149",
    "code": "JWST5111",
    "subject": "JWST",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Histor/Rep of the Holocaust",
    "fullname": "Problems in Historiography and Representation of the Holocaust",
    "info": "Relationship of paintings, memorials, and other art forms to the question of understanding the Holocaust. Issues of sources, especially use of the Survivors of the Shoah project in U libraries.",
    "prereq": []
  },
  {
    "uid": "790840",
    "code": "JWST5112",
    "subject": "JWST",
    "number": "5112",
    "honors": false,
    "writingIntensive": false,
    "name": "Jewish Mysticism and Kabbalah",
    "fullname": "Jewish Mysticism, Magic, and Kabbalah",
    "info": "Mystical traditions from early rabbinic traditions to Zohar (Book of Splendor) in 13th century. Literature of heavenly ascent (Hekhalot, Merkavah), Book of Creation (Sefer Yetzirah), precursors of Zohar.the Bahir. Schools of Provence, Gerona, and Zohar. Tension between legal/mystical aspects, magical theurgic techniques, evolution of doctrine of Sefirot, mystical interpretation of Scripture, erotic dimension.",
    "prereq": []
  },
  {
    "uid": "793566",
    "code": "JWST5115",
    "subject": "JWST",
    "number": "5115",
    "honors": false,
    "writingIntensive": false,
    "name": "Midrash: Reading and Retelling",
    "fullname": "Midrash: Reading and Retelling the Hebrew Bible",
    "info": "How did the Jews of the first seven centuries of the common era read and understand the Hebrew Bible? What were the problems they faced -- interpretive, historical, theological -- in trying to apply their holy scriptures? This course explores key issues that led to the development of a new form of Judaism in late antiquity, rabbinic Judaism, and its methods of scriptural interpretation. The course?s study will focus on the forms and practices of rabbinic scriptural interpretation (midrash) as it developed in Roman Palestine and Sasanian Babylonia, focusing on key narrative and legal passages in the Five Books of Moses (Torah). A main focus of the course will be on the ways the rabbis adapted the Hebrew Bible to express their own core concerns.",
    "prereq": []
  },
  {
    "uid": "804685",
    "code": "JWST5204",
    "subject": "JWST",
    "number": "5204",
    "honors": false,
    "writingIntensive": false,
    "name": "The Dead Sea Scrolls",
    "fullname": "The Dead Sea Scrolls",
    "info": "Introduction to Dead Sea Scrolls and Qumran. Contents of Dead Sea Scrolls, significance for understanding development of the Bible. Background of Judaism and Christianity. Archaeological site of Qumran.Open to graduate students across the college; knowledge of classical Hebrew will not be required. The course is open to upper level undergraduate students with permission of the instructor.",
    "prereq": []
  },
  {
    "uid": "790569",
    "code": "JWST5513W",
    "subject": "JWST",
    "number": "5513",
    "honors": false,
    "writingIntensive": true,
    "name": "Scripture and Interpretation",
    "fullname": "Scripture and Interpretation in Israelite Religion and Judaism",
    "info": "Idea of divine revelation. Impact on religion/literature. How history of Bible's creation, transmission, interpretation help us think critically about role of revelation in religious traditions.prereq: At least one upper level course (3xxx or higher) in academic biblical or religious studies",
    "prereq": []
  },
  {
    "uid": "789352",
    "code": "JWST5900",
    "subject": "JWST",
    "number": "5900",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Jewish Studies",
    "fullname": "Topics in Jewish Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "008598",
    "code": "JWST5992",
    "subject": "JWST",
    "number": "5992",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Readings",
    "fullname": "Directed Readings",
    "info": "Guided individual reading or study.prereq: instr consent",
    "prereq": []
  }
]