[
  {
    "uid": "806416",
    "code": "LA1001",
    "subject": "LA",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainability By Design",
    "fullname": "Sustainability by Design",
    "info": "How the Twin Cities region (as example of many metropolitan areas) can adapt to climate change, depleted energy resources, and other environmental impacts. How cities and places are designed, how places influence sustainable lifestyles. How to adapt the Twin Cities/other cities to a changing world.",
    "prereq": []
  },
  {
    "uid": "797170",
    "code": "LA1101W",
    "subject": "LA",
    "number": "1101",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro Dsgn Thinking",
    "fullname": "Introduction to Design Thinking",
    "info": "Introduction to theories and processes that underpin design thinking. Survey of the design professions; the power of design; and interactions between humans and their natural, social, and designed environments.",
    "prereq": []
  },
  {
    "uid": "791201",
    "code": "LA1201",
    "subject": "LA",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Learning Landscape",
    "fullname": "Learning from the Landscape",
    "info": "This course is about the ordinary landscape: the objects, spaces, sites, and stories that are the stage for our everyday lives. But the landscape is not just a neutral stage. The landscape influences our lives and we construct and shape the landscape. This course examines the landscape through lenses of race, equity, justice, and climate change, taking an environmental justice framing in our investigations. ",
    "prereq": []
  },
  {
    "uid": "797163",
    "code": "LA1301",
    "subject": "LA",
    "number": "1301",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro LArch Drwng",
    "fullname": "Introduction to Landscape Architecture Drawing",
    "info": "Development of basic skills in perceiving/representing material environment. Sketching/drawing conventions of visual phenomena/forms.",
    "prereq": []
  },
  {
    "uid": "797162",
    "code": "LA1401",
    "subject": "LA",
    "number": "1401",
    "honors": false,
    "writingIntensive": false,
    "name": "The Designed Environment",
    "fullname": "The Designed Environment",
    "info": "Examination of relationships between place and space, and realms of the ideal and real, public and private. Survey of how the fields of architecture, landscape architecture, and urban design have explored those issues.",
    "prereq": []
  },
  {
    "uid": "809537",
    "code": "LA1601",
    "subject": "LA",
    "number": "1601",
    "honors": false,
    "writingIntensive": false,
    "name": "Design and Equity",
    "fullname": "Design and Equity",
    "info": "Investigate world from new perspectives. Spaces of everyday life that reflect/shape values. Meets with LA 3601.",
    "prereq": []
  },
  {
    "uid": "803701",
    "code": "LA2301",
    "subject": "LA",
    "number": "2301",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Representation",
    "fullname": "Mixed Analog and Digital Representation Methods",
    "info": "Explore multimedia rendering techniques using analog (hand sketching/drawing) and digital techniques for raster and vector image generation used to illustrate landscape architecture analysis and design processes. prereq: LA 1301 OR GDES 1311 OR instructor consent",
    "prereq": {
      "or": [
        {
          "code": "LA 1301",
          "subject": "LA",
          "id": "1301"
        },
        {
          "code": "GDES 1311",
          "subject": "GDES",
          "id": "1311"
        }
      ]
    }
  },
  {
    "uid": "803702",
    "code": "LA2302",
    "subject": "LA",
    "number": "2302",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Rep for Envirn Design",
    "fullname": "Computer-Aided Representation for Environmental Design",
    "info": "Use of computer-aided design (CAD) technologies in developing, representing, and communicating environmental design ideas. Adobe Creative Suite, Autodesk AutoCAD, DynaSCAPE, ESRI ArcMap, etc. Integration of images generated from various computer and hand-rendered technologies.",
    "prereq": []
  },
  {
    "uid": "013086",
    "code": "LA3001",
    "subject": "LA",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Understanding Landscape Space",
    "fullname": "Understanding and Creating Landscape Space",
    "info": "The subject of this course is Landscape Architecture. In this class we investigate its principles, focusing on the discipline's distinct fusion of both the arts and sciences to create useful and meaningful outdoor spaces to meet specific environmental and social needs. Class periods alternate between lectures and studio work periods in which students actively work on projects (site analysis, representation, modeling, and oral presentation). Over the course of the semester student receive feedback (instructor, guests, and peer review) and participate in class discussion. Students receive additional assignments including critical literature review, site analysis, and infrastructure research.",
    "prereq": []
  },
  {
    "uid": "795083",
    "code": "LA3002",
    "subject": "LA",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Informants of Creating Space",
    "fullname": "Informants of Creating Landscape Space",
    "info": "In this course, you will analyze and design specific projects, considering both their physical and conceptual connection to the larger context in which they are located. The aim is for you to gain an understanding of the relationship of landscape to architecture at the site and urban scales; consider the effects of construction and ground manipulation on the perception and experience of space; and explore the possibilities of layering and transparency, enclosure and adjacencies, in between spaces and connectors. Ultimately, the course will investigate the intersection of physical, biological, and cultural attributes, the opportunities and constraints they produce, the design of space based upon these features, and the [re]presentation of these designs. We will also be building the soft skills that help us grow to be more empathetic and understanding of our client's needs and desired outcomes and practice them throughout the workshop in order to translate experience and input into program + design.",
    "prereq": []
  },
  {
    "uid": "803703",
    "code": "LA3003",
    "subject": "LA",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change Adaptation",
    "fullname": "Climate Change Adaptation",
    "info": "This course will study nations, regions, cities, and communities that have adapted or are undergoing adaptation to climate change. The course will examine different approaches in planning, policy, economics, infrastructure, and building design that increase the adaptive capacity of human settlements. These approaches will vary in scale from the construction of new neighborhoods to the implementation of storm water gardens. The course will emphasize multi-functional strategies which couple climate change adaptation with other urban improvements. Learning Objectives: To understand role of climate adaptation in the reconfiguration of human settlements. To apply design thinking to the issue of climate adaptation in the context of an urban society.To apply knowledge to challenge-based coursework on managing climate risk, decreasing climate vulnerability, and building resilience to climate change.",
    "prereq": []
  },
  {
    "uid": "803704",
    "code": "LA3004",
    "subject": "LA",
    "number": "3004",
    "honors": false,
    "writingIntensive": false,
    "name": "Regional Environ LA Planning",
    "fullname": "Regional Environmental Landscape Planning",
    "info": "An exploration of critical regional landscape parameters affecting the growth and development of metropolitan areas. Students assess these parameters and prepare a multifunctional land use plan for a defined locale.prereq: prereq FR 3131 or Concurrent registration is required (or allowed) in FR 3131 or GEOG 3561 or Concurrent registration is required (or allowed) in GEOG 3561, or equivalent",
    "prereq": {
      "or": [
        {
          "code": "FR 3131",
          "subject": "FR",
          "id": "3131"
        },
        {
          "code": "GEOG 3561",
          "subject": "GEOG",
          "id": "3561"
        }
      ]
    }
  },
  {
    "uid": "789690",
    "code": "LA3204",
    "subject": "LA",
    "number": "3204",
    "honors": false,
    "writingIntensive": false,
    "name": "Holistic Landscape Ecology",
    "fullname": "Holistic Landscape Ecology and Bioregional Practice",
    "info": "Bioregional practice, how it responds to landscape ecology of great bioregions. Scientific/cultural basis for bioregional design and landscape sustainability.",
    "prereq": []
  },
  {
    "uid": "826371",
    "code": "LA3411",
    "subject": "LA",
    "number": "3411",
    "honors": false,
    "writingIntensive": false,
    "name": "Learning from Medit Landscape",
    "fullname": "Learning from the Mediterranean Landscape: Montpellier, France",
    "info": "This course explores the designed public landscapes of the Montpellier, France metropolitan area as a product of the specific time periods, cultures, geographies, and political influences that created them. Students study different districts of the city and regional landscape, focusing on streets, plazas, parks, gardens, and river edges to understand how the design of specific spaces were influenced by different ideas and cultural time periods. Students use different observational and recording methods to understand how these spaces function today and what role they play in the current culture of the city. Students read about ideas and histories that contributed to the shaping of these spaces and complete comparisons, using photography, writing, and observation of environmental factors to more completely understand the designed landscape as both an artifact and a living, breathing, dynamic system.",
    "prereq": []
  },
  {
    "uid": "008877",
    "code": "LA3413",
    "subject": "LA",
    "number": "3413",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro LA History",
    "fullname": "Introduction to Landscape Architectural History",
    "info": "Study of  landscape architecture's roots by examining the creation of landscapes over time. Influences of ecological and environmental issues as well as political, economic, and social contexts on the cultural construction of landscape ideas and meaning and creation of landscape architectural works.",
    "prereq": []
  },
  {
    "uid": "011148",
    "code": "LA3501",
    "subject": "LA",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Env Des: Biol/Phys Context",
    "fullname": "Environmental Design and Its Biological and Physical Context",
    "info": "Dynamic relationships between environmentally designed places and biological/physical contexts. Integration of created place and biological/physical contexts. Case studies, student design.",
    "prereq": []
  },
  {
    "uid": "794105",
    "code": "LA3514",
    "subject": "LA",
    "number": "3514",
    "honors": false,
    "writingIntensive": false,
    "name": "Making the Mississippi",
    "fullname": "Making the Mississippi",
    "info": "Environmental parameters affecting growth/development of metropolitan areas. Students assess these parameters and prepare a multi-functional land use plan for a defined locale.",
    "prereq": []
  },
  {
    "uid": "791186",
    "code": "LA3571",
    "subject": "LA",
    "number": "3571",
    "honors": false,
    "writingIntensive": false,
    "name": "Site Systems",
    "fullname": "Landscape Construction: Site Systems and Engineering",
    "info": "Theory applications of landform systems for design. Landform typology, representation methods, manipulation techniques, use of land survey data, earthwork construction issues. Spatial accommodation of vehicles in landscape architecture, including road design.prereq: BED major or BED minor or instr consent",
    "prereq": []
  },
  {
    "uid": "819757",
    "code": "LA3572",
    "subject": "LA",
    "number": "3572",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Tech  2",
    "fullname": "Landscape Construction: Materials, Assemblies and Performance",
    "info": "The subject of this course is Landscape Architecture construction. In this technology-based class, the principles, identification, and application of building materials as well as construction standards and creative developmental strategies in the built environment will be explored.  Significantly, functional outdoor spaces that meet specific environmental and social needs are a product of the infrastructures that support human occupation. The material’s responsiveness to site, its programming and durability define the abilities of a project scope to deliver superior performance.  Over the course of the semester students will research, analyze, document and apply material solutions that meet specific programmatic, aesthetic and performance requirements.",
    "prereq": []
  },
  {
    "uid": "809538",
    "code": "LA3601",
    "subject": "LA",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Design and Equity",
    "fullname": "Design and Equity",
    "info": "Investigate world from new perspectives. Spaces of everyday life that reflect/shape values. Meets with LA 1601.",
    "prereq": []
  },
  {
    "uid": "825148",
    "code": "LA3801",
    "subject": "LA",
    "number": "3801",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro. to Garden Design",
    "fullname": "Finding Order: An Introduction to Garden Design",
    "info": "The course explores local gardens and classical gardens and offers students opportunities to learn and practice garden design by engaging students in the first hand observational analysis of extant garden spaces across the Twin Cities.",
    "prereq": []
  },
  {
    "uid": "803706",
    "code": "LA4001",
    "subject": "LA",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Sust LA Design & Plan Practice",
    "fullname": "Sustainable Landscape Design and Planning Practices Studio",
    "info": "Applications of sustainable landscape design and planning practices. Examination of the systemic, formal, and spatial relationships across the integration of these practices and quantitative and qualitative changes in biodiversity, quality of the earth’s air, soil, and water resources, development and consumption of energy resources and climate change. Development of design processes for selection, deployment, and management of sustainable practices to create evocative and meaningful landscape in the context of cultural change. prereq: LA 2302 and LA 3002 or instructor consent.",
    "prereq": {
      "and": [
        {
          "code": "LA 2302",
          "subject": "LA",
          "id": "2302"
        },
        {
          "code": "LA 3002",
          "subject": "LA",
          "id": "3002"
        }
      ]
    }
  },
  {
    "uid": "803729",
    "code": "LA4002",
    "subject": "LA",
    "number": "4002",
    "honors": false,
    "writingIntensive": false,
    "name": "Design of Urban Landscapes",
    "fullname": "Design of Urban Landscapes",
    "info": "LA 4002 will provide an in-depth look at the urban environment. The studio will explore the forces that shape the city and how the city will potentially meet the challenges exerted upon it by a changing climate, reorganized populations, and the technologies of the future. prereq: LA 2302, LA 3002",
    "prereq": {
      "and": [
        {
          "code": "LA 2302",
          "subject": "LA",
          "id": "2302"
        },
        {
          "code": "LA 3002",
          "subject": "LA",
          "id": "3002"
        }
      ]
    }
  },
  {
    "uid": "803707",
    "code": "LA4096",
    "subject": "LA",
    "number": "4096",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship in Land DesignPlan",
    "fullname": "Internship in Landscape Design and Planning",
    "info": "Supervised professional experience in environmental design firms or government agencies. Students perform professional services and relate these experiences to their education in environmental design.\n\nprereq: 1301, 2301, 2302, 3001, 3002, 3003",
    "prereq": {
      "and": [
        {
          "code": "LA 1301",
          "subject": "LA",
          "id": "1301"
        },
        {
          "code": "LA 2301",
          "subject": "LA",
          "id": "2301"
        },
        {
          "code": "LA 2302",
          "subject": "LA",
          "id": "2302"
        },
        {
          "code": "LA 3001",
          "subject": "LA",
          "id": "3001"
        },
        {
          "code": "LA 3002",
          "subject": "LA",
          "id": "3002"
        },
        {
          "code": "LA 3003",
          "subject": "LA",
          "id": "3003"
        }
      ]
    }
  },
  {
    "uid": "819758",
    "code": "LA4501",
    "subject": "LA",
    "number": "4501",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Analysis",
    "fullname": "Landscape Analysis",
    "info": "The subject of this course is Landscape Architecture analysis. Students will explore the principles and practices of experiential site inventory, data analysis, the documentation of landscape resources, site character and morphology. These will be explored at multiple scales using analog and digital tools. Students will evaluate the layers of existing and historic site conditions that comprehensively include but are not limited to-  the  biophysical, geologic, architectonic, cultural, political, social and economic factors that comprise the existing conditions and their contexts.",
    "prereq": []
  },
  {
    "uid": "819759",
    "code": "LA4573",
    "subject": "LA",
    "number": "4573",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology and Systems 3",
    "fullname": "Landscape Construction: Plant and Soil Systems",
    "info": "In this course, students will explore the inter-dependent systems of plants and soil in the design and construction of landscapes. Students will learn how to develop construction level planting plans and details, while identifying the contextually rich species and vegetative communities that enhance the performance and experience of landscape space.  Students will investigate planting technologies and the unique profiles of soil systems utilized and amended in the construction of site specific landscapes.",
    "prereq": []
  },
  {
    "uid": "795080",
    "code": "LA4755",
    "subject": "LA",
    "number": "4755",
    "honors": false,
    "writingIntensive": false,
    "name": "Infrastructure&Natural Systems",
    "fullname": "Infrastructure, Natural Systems, and Space of Inhabited Landscapes",
    "info": "Seminar, cross-disciplinary. Urban infrastructural solutions to mitigate/reverse anthropogenic impacts on Earth. Design of sustainable urban infrastructure systems. Policy options, technologies. Criteria, design methods.prereq: Jr or sr",
    "prereq": []
  },
  {
    "uid": "825149",
    "code": "LA4901",
    "subject": "LA",
    "number": "4901",
    "honors": false,
    "writingIntensive": false,
    "name": "Design of Regional Landscapes",
    "fullname": "Design of Regional Landscapes",
    "info": "This design and planning studio focuses on challenges in the creation of sustainable frameworks for resilient multifunctional regional landscapes.  This studio will explore the interconnected systems of landscapes at a large, planning scale and engage communities by studying current issues that impact Minnesota landscapes, places, and people.  The studio will employ digital geographic information systems and large scale landscape analysis tools to tackle future design and planning issues facing large suburban and/or rural regions.  Projects will be approached through a combination of team and individual assignments requiring field work, environmental and human (social, economic, political, etc.) analysis, scenario planning, and visual representation techniques.",
    "prereq": []
  },
  {
    "uid": "825150",
    "code": "LA4902",
    "subject": "LA",
    "number": "4902",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Landscape Arch Design",
    "fullname": "Advanced Landscape Architecture Design",
    "info": "This final design studio explores emerging design topics in landscape architecture at various scales and across different project types.  Each student will be presented with design problems of high complexity as defined by their studio instructor.  Exact project sites and programs will vary each year with attention to professional currency and emerging literature. Topics will focus on emerging areas of practice related to urban landscape architecture, climate change adaptation, and/or resilient design. This studio will emphasize professional processes, responsibilities, and outcomes as a final preparation for professional practice.",
    "prereq": []
  },
  {
    "uid": "807345",
    "code": "LA5001",
    "subject": "LA",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Design of Regional Landscapes",
    "fullname": "Design of Regional Landscapes",
    "info": "This design and planning studio focuses on challenges in the creation of sustainable frameworks for resilient multifunctional regional landscapes.  This studio will explore the interconnected systems of landscapes at a large planning scale, and engage communities by studying current issues that impact Minnesota landscapes, places, and people.  The studio will employ digital geographic information systems and large-scale landscape analysis tools to tackle future design and planning issues facing large suburban and/or rural regions.  Projects will be approached through a combination of team and individual assignments requiring field work, environmental and human (social, economic, political, etc.) analysis, scenario planning, and visual representation techniques.",
    "prereq": []
  },
  {
    "uid": "807369",
    "code": "LA5002",
    "subject": "LA",
    "number": "5002",
    "honors": false,
    "writingIntensive": false,
    "name": "LA Studio 6",
    "fullname": "Advanced Landscape Architecture Design",
    "info": "This final design studio explores emerging design topics in landscape architecture at various scales and across different project types. Each student will be presented with design problems of high complexity as defined by their studio instructor. Exact project sites and programs will vary each year with attention to professional currency and emerging literature. Topics will focus on emerging areas of practice related to urban landscape architecture, climate change adaptation, and/or resilient design. This studio will emphasize professional processes, responsibilities and outcomes as a final preparation for professional practice.",
    "prereq": []
  },
  {
    "uid": "807346",
    "code": "LA5003",
    "subject": "LA",
    "number": "5003",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change Adaptation",
    "fullname": "Climate Change Adaptation",
    "info": "This course studies climate change mitigation and adaptation by examining different responses to human-designed systems including energy, transportation, and inhabitation (housing, work, production). The cities of Minneapolis and St. Paul are used as locations for students to research and develop local responses to climate change that both encompass carbon emissions reductions, environmental justice, and equity.",
    "prereq": []
  },
  {
    "uid": "807335",
    "code": "LA5004",
    "subject": "LA",
    "number": "5004",
    "honors": false,
    "writingIntensive": false,
    "name": "Regional Environ LA Planning",
    "fullname": "Regional Environmental Landscape Planning",
    "info": "An exploration of critical regional landscape parameters affecting the growth and development of metropolitan areas. Students assess these parameters and prepare a multifunctional land use plan for a defined locale.prereq: PA 5271 or LA 5131 or FR 3131 or GEOG 3561 or GEOG 5561 or equivalent",
    "prereq": {
      "or": [
        {
          "code": "PA 5271",
          "subject": "PA",
          "id": "5271"
        },
        {
          "code": "LA 5131",
          "subject": "LA",
          "id": "5131"
        },
        {
          "code": "FR 3131",
          "subject": "FR",
          "id": "3131"
        },
        {
          "code": "GEOG 3561",
          "subject": "GEOG",
          "id": "3561"
        },
        {
          "code": "GEOG 5561",
          "subject": "GEOG",
          "id": "5561"
        }
      ]
    }
  },
  {
    "uid": "816963",
    "code": "LA5096",
    "subject": "LA",
    "number": "5096",
    "honors": false,
    "writingIntensive": false,
    "name": "Intern Master Landscape Arch",
    "fullname": "Internship for Master of Landscape Architecture Students",
    "info": "Students will receive supervised professional experience in a landscape architectural design firm in order to gain employment experience related to the field as well as receiving graduate credit. As a requirement of the course, students will submit a reflection paper relating the professional experiences to their education. Must have director of graduate studies (DGS) approval of the internship to register.",
    "prereq": []
  },
  {
    "uid": "819901",
    "code": "LA5100",
    "subject": "LA",
    "number": "5100",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Landscape Architecture",
    "fullname": "Topics: Landscape Architecture",
    "info": "Current and emerging topics in the field of landscape architecture. Taught by regular or visiting faculty in their areas of specialization.",
    "prereq": []
  },
  {
    "uid": "810851",
    "code": "LA5131",
    "subject": "LA",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "Geospatial Analysis and Design",
    "fullname": "Geospatial Data Analysis and Design",
    "info": "Introduction to geospatial data analysis/application in landscape architectural, environmental design research/practice.\n\nprereq: Master of Landscape Architecture Student or instr consent",
    "prereq": []
  },
  {
    "uid": "013080",
    "code": "LA5201",
    "subject": "LA",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Studio 01 Landscape Spaces",
    "fullname": "Making Landscape Spaces and Types",
    "info": "Introductory studio for landscape architecture. Consideration of built environments for human and other than human habitation. Introduction to ways in which site conditions (soils, water, climate, plant communities, etc.) are mapped, analyzed, and incorporated into design process. Consideration of ways that landscapes are complex combinations of issues of aesthetics, politics, economics, identity, biophysical, and ecological elements.prereq:  LA grad or instr consent",
    "prereq": []
  },
  {
    "uid": "016559",
    "code": "LA5202",
    "subject": "LA",
    "number": "5202",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Analysis Workshop",
    "fullname": "Landscape Analysis Workshop",
    "info": "One week session prior to the start of the Fall Semester for incoming students based in Minneapolis and Itasca Biological Research Station. Introduction to ecological systems and landscape of Minnesota through on-site techniques for analysis of site conditions, including vegetation, soil, and landform description using different representation techniques and media.",
    "prereq": []
  },
  {
    "uid": "013078",
    "code": "LA5203",
    "subject": "LA",
    "number": "5203",
    "honors": false,
    "writingIntensive": false,
    "name": "Studio 02 Ecological Design",
    "fullname": "Ecological Dimensions of Space Making",
    "info": "The course is a landscape design studio focused on human-influenced ecological systems as a starting point for design proposals that address human use and ecological management and/or modification. Course includes the in-depth studies of vegetal species and their place in ecological systems, the relationship of humans and non-humans to human-influenced or modified environments.",
    "prereq": []
  },
  {
    "uid": "009753",
    "code": "LA5204",
    "subject": "LA",
    "number": "5204",
    "honors": false,
    "writingIntensive": false,
    "name": "Metropolitan Landscape Ecology",
    "fullname": "Metropolitan Landscape Ecology",
    "info": "This course addresses how different types of systems thinking and disciplinary lenses are relevant to understanding the context, structure, and situation of the American urban landscape—including the ecology, culture, and politics of its urban forms and  processes. The American urban landscape is a mirror for society’s values, attitudes, beliefs, behaviors, and norms about what is “good” urban nature. American society’s values, attitudes, and beliefs reflect deeply-rooted ideas about what urban nature is “best” appreciated, what urban nature is “best” protected, what urban nature is “best” produced, what urban nature is “best” consumed,  what urban nature is “best” abandoned. prereq:  LA grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "016556",
    "code": "LA5301",
    "subject": "LA",
    "number": "5301",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Drawing",
    "fullname": "Introduction to Landscape Architecture Drawing",
    "info": "Perceiving/representing material environment. Sketching/drawing conventions, visual phenomena/forms.prereq: LA grad student or accelerated B.E.D. student",
    "prereq": []
  },
  {
    "uid": "819760",
    "code": "LA5302",
    "subject": "LA",
    "number": "5302",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Practice",
    "fullname": "Professional Practice",
    "info": "In this course students will examine historic and current models of professional practices for Landscape Architecture. The course will investigate emerging strategies to accommodate future demands within the discipline. Topics will include office and project management, organizational behavior, marketing, sales, strategic planning, financial/cost accounting, insurance, legal issues, contracts and ethics. The class will offer students the opportunity to explore their own emerging professional focuses in light of the organizational structure of the professional landscape architecture practice settings.",
    "prereq": []
  },
  {
    "uid": "797164",
    "code": "LA5351",
    "subject": "LA",
    "number": "5351",
    "honors": false,
    "writingIntensive": false,
    "name": "AutoCAD I",
    "fullname": "AutoCAD I",
    "info": "Making course inactive, this field is in pink which leads me to believe I needed to something with this field in order to save to make it inactive.  Basic concepts, tools, and techniques of computer-aided drawing. Introduction to current AutoCAD Release software. Strategies and techniques for producing dimensioned and annotated drawings. Introduction to 3-D drawing capabilities. Use of dimension variables, attributes, blocks, symbols, and creation of customized menus.prereq: B.E.D. major or LA grad or instr consent; may not be taken for graduate credit",
    "prereq": []
  },
  {
    "uid": "797165",
    "code": "LA5352",
    "subject": "LA",
    "number": "5352",
    "honors": false,
    "writingIntensive": false,
    "name": "AutoCAD II",
    "fullname": "AutoCAD II",
    "info": "Intermediate concepts, tools, and techniques of computer-aided drawing with current AutoCAD Release software. Strategies and techniques for producing dimensioned and annotated drawing. Use of dimension variables, attributes, blocks, symbols, and creation of customized menus.prereq: Arch 5351 or LA 5351, B.E.D. major or LA grad or instr consent; may not be taken for graduate credit",
    "prereq": {
      "or": [
        {
          "code": "ARCH 5351",
          "subject": "ARCH",
          "id": "5351"
        },
        {
          "code": "LA 5351",
          "subject": "LA",
          "id": "5351"
        }
      ]
    }
  },
  {
    "uid": "797173",
    "code": "LA5371",
    "subject": "LA",
    "number": "5371",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Methods I",
    "fullname": "Computer Methods I",
    "info": "Introduction to current techniques, programs, and new editions of computer programs, and their application to landscape architecture computing.",
    "prereq": []
  },
  {
    "uid": "797174",
    "code": "LA5372",
    "subject": "LA",
    "number": "5372",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Methods II",
    "fullname": "Computer Methods II",
    "info": "Current techniques and computer programs, and their application to landscape architecture computing.",
    "prereq": []
  },
  {
    "uid": "790460",
    "code": "LA5373",
    "subject": "LA",
    "number": "5373",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Methods III",
    "fullname": "Computer Methods III",
    "info": "Advanced techniques and computer programs, and their application to landscape architecture computing in design, theory, and technology.",
    "prereq": []
  },
  {
    "uid": "803724",
    "code": "LA5374",
    "subject": "LA",
    "number": "5374",
    "honors": false,
    "writingIntensive": false,
    "name": "Rep for Landscape Arch Constr",
    "fullname": "Representation for Landscape Architectural Construction",
    "info": "Technical/presentation graphics. Concepts/procedures for creating landscape architectural construction documents using AutoCAD 2009. Representation of information in graphic form. Moving information from AutoCAD to Photoshop/Illustrator.",
    "prereq": []
  },
  {
    "uid": "803725",
    "code": "LA5375",
    "subject": "LA",
    "number": "5375",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Rendering",
    "fullname": "Advanced Rendering in Landscape Architecture",
    "info": "Hand-drawing. Color theory. Rendering techniques.Materials/technologies. Contemporary graphic styles/artists.Increasing speed of drawing/renderings. Strengthening personal graphic style. Creating portfolio-quality work.",
    "prereq": []
  },
  {
    "uid": "809997",
    "code": "LA5376",
    "subject": "LA",
    "number": "5376",
    "honors": false,
    "writingIntensive": false,
    "name": "Representation I",
    "fullname": "Representation I",
    "info": "This course develops students' observation skills and the ability to communicate ideas and concepts through visual expression. Students learn basic conventions of landscape architectural drawing in 2 and 3-dimensions using analog and digital tools, including Adobe Creative Cloud and Rhino.",
    "prereq": []
  },
  {
    "uid": "809998",
    "code": "LA5377",
    "subject": "LA",
    "number": "5377",
    "honors": false,
    "writingIntensive": false,
    "name": "Representation II",
    "fullname": "Representation II",
    "info": "This course further develops student?s digital skills with an emphasis on advanced skills in Adobe Illustrator and Rhino, including some work in parametric scripting with Grasshopper and digital fabrication with 3-D printers or CNC milling machine.\n\nprereq: Master of Landscape Architecture (MLA) ",
    "prereq": []
  },
  {
    "uid": "815377",
    "code": "LA5378",
    "subject": "LA",
    "number": "5378",
    "honors": false,
    "writingIntensive": false,
    "name": "Representation III",
    "fullname": "Representation III",
    "info": "Increase skills learned in Representation I and Representation II and develop 3-D modeling skills, distill complex information to visually explain a design concept while gaining skills that are valuable in the workplace and create portfolio quality work.",
    "prereq": []
  },
  {
    "uid": "817685",
    "code": "LA5381",
    "subject": "LA",
    "number": "5381",
    "honors": false,
    "writingIntensive": false,
    "name": "The City in Visual Culture",
    "fullname": "The City in Visual Culture",
    "info": "Visual culture is not just that we see the way we do because we are social animals, but also that our social arrangements take the forms they do because we are seeing animals. The social arrangements of the city, the buildings and public spaces, are concretized expressions of power and culture. The course will, through multiple drawings, attempt to critically examine these social arrangements as they have evolved over time (history) by re-presenting the city (as human experience and aesthetic form). The course will be structured around on-site work sessions, critical readings, on- and off-site lectures, and weekly drawing assignments.",
    "prereq": []
  },
  {
    "uid": "014435",
    "code": "LA5400",
    "subject": "LA",
    "number": "5400",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Land Arch",
    "fullname": "Topics in Landscape Architecture",
    "info": "Current topics in landscape architecture. Taught by regular or visiting faculty in their areas of specialization.",
    "prereq": []
  },
  {
    "uid": "014439",
    "code": "LA5401",
    "subject": "LA",
    "number": "5401",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies in Emerging Areas of Landscape Architecture",
    "info": "tbdprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "014461",
    "code": "LA5402",
    "subject": "LA",
    "number": "5402",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Stud: LA Hist, Theory",
    "fullname": "Directed Studies in Landscape Architecture History and Theory",
    "info": "Independent studies under the direction of landscape architecture faculty.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "014463",
    "code": "LA5403",
    "subject": "LA",
    "number": "5403",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Stud: LA Tech",
    "fullname": "Directed Studies in Landscape Architecture Technology",
    "info": "Independent studies under the direction of landscape architecture faculty.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "014465",
    "code": "LA5404",
    "subject": "LA",
    "number": "5404",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Stud: LA Design",
    "fullname": "Directed Studies in Landscape Architecture Design",
    "info": "Independent studies under the direction of landscape architecture faculty.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "014468",
    "code": "LA5405",
    "subject": "LA",
    "number": "5405",
    "honors": false,
    "writingIntensive": false,
    "name": "Interdisc Stud: LA",
    "fullname": "Interdisciplinary Studies in Landscape Architecture",
    "info": "Research, planning, or design projects. Topics vary.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "014693",
    "code": "LA5406",
    "subject": "LA",
    "number": "5406",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Design Journal",
    "fullname": "Urban Design Journal",
    "info": "Methods and theories in urban design and human behavior. Students develop journal as tool for experiencing, analyzing, and recording the urban landscape, its fabric, spatial elements, and individual components, and for analyzing design solutions.",
    "prereq": []
  },
  {
    "uid": "014766",
    "code": "LA5407",
    "subject": "LA",
    "number": "5407",
    "honors": false,
    "writingIntensive": false,
    "name": "LA Studio",
    "fullname": "Landscape Architecture Studio",
    "info": "Individual and small-group projects focusing on urban issues; design process in Danish conditions; solutions based on knowledge of Danish problems in landscape and urban design and an understanding of how these problems are solved within Danish and European contexts.prereq: Admitted to Denmark International Study Program co-sponsored by the University; given in Denmark",
    "prereq": []
  },
  {
    "uid": "014771",
    "code": "LA5408",
    "subject": "LA",
    "number": "5408",
    "honors": false,
    "writingIntensive": false,
    "name": "LA, Arch, Planning",
    "fullname": "Landscape Architecture, Architecture, and Planning",
    "info": "Methods and theories in urban design and human behavior. Students develop urban design journal as tool for experiencing, analyzing, and recording the urban landscape, its fabric, spatial elements, and individual components, and for analyzing design solutions.prereq: Admitted to Denmark International Study Program co-sponsored by the University; given in Denmark",
    "prereq": []
  },
  {
    "uid": "014948",
    "code": "LA5413",
    "subject": "LA",
    "number": "5413",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro LA History",
    "fullname": "Introduction to Landscape Architectural History",
    "info": "This introductory course examines the multiple roots of landscape architecture by examining the making of types of landscapes over time. Emphasis on ecological and environmental issues, and issues related to political, economic, and social contexts of landscape architectural works.prereq: One course in history at 1xxx or higher",
    "prereq": []
  },
  {
    "uid": "817686",
    "code": "LA5414",
    "subject": "LA",
    "number": "5414",
    "honors": false,
    "writingIntensive": false,
    "name": "History and Culture Abroad",
    "fullname": "Study Abroad: History and Culture",
    "info": "This is a history course aimed at investigating the rich urban, landscape and architectural legacy of Spain, tracing the multiple histories of the Spain through the ceremonial and quotidian spaces of Madrid as it developed as the capital city of the Catholic monarchy and the monuments of Al-Andalus, the Islamic caliphate in Southern Spain. The course is structures so that each week there will be an in-class lecture and a walking tour of Madrid. There will also be several field trips to historic sites.",
    "prereq": []
  },
  {
    "uid": "016558",
    "code": "LA5431",
    "subject": "LA",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "History/Theory",
    "fullname": "History of Landscape Architecture: Individual Influences",
    "info": "Assessment of influences of individuals on formation of the profession of landscape architecture from 1800 to present. Lectures, presentations, field trips, readings, papers, projects.",
    "prereq": []
  },
  {
    "uid": "804282",
    "code": "LA5514",
    "subject": "LA",
    "number": "5514",
    "honors": false,
    "writingIntensive": false,
    "name": "Making the Mississippi",
    "fullname": "Making the Mississippi",
    "info": "Critical environmental parameters affecting growth/development of metropolitan areas. Students assess these parameters and prepare a multi-functional land use plan for a defined locale.",
    "prereq": []
  },
  {
    "uid": "009156",
    "code": "LA5571",
    "subject": "LA",
    "number": "5571",
    "honors": false,
    "writingIntensive": false,
    "name": "Landforms & Space",
    "fullname": "Landscape Construction: Landform Systems and Spatial Performance",
    "info": "Theory and professional applications of landform systems for design.  Landform typology, representation methods, manipulation techniques, use of land survey data, earthwork construction issues. Spatial accommodation of vehicles in landscape architecture, including road design.",
    "prereq": []
  },
  {
    "uid": "013071",
    "code": "LA5572",
    "subject": "LA",
    "number": "5572",
    "honors": false,
    "writingIntensive": false,
    "name": "Plants in Design",
    "fullname": "Plants in Design",
    "info": "Design principles for using plants in landscape. Cultural/ecological principles in design projects of various scales. Lectures, presentations, field trips, readings, projects.prereq: [5201, 5203, plant identification course] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "LA 5201",
          "subject": "LA",
          "id": "5201"
        },
        {
          "code": "LA 5203",
          "subject": "LA",
          "id": "5203"
        }
      ]
    }
  },
  {
    "uid": "013085",
    "code": "LA5573",
    "subject": "LA",
    "number": "5573",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to GIS",
    "fullname": "Landscape Technology: Introduction to Geographic Information Systems",
    "info": "GIS as an analytical tool to solve geographical problems of regional landscape design and resource management. Topics include application techniques, analytical procedures, data characteristics, data sources, input/output methods, and implementation. ",
    "prereq": []
  },
  {
    "uid": "791239",
    "code": "LA5574",
    "subject": "LA",
    "number": "5574",
    "honors": false,
    "writingIntensive": false,
    "name": "ID MN Flora",
    "fullname": "Identification of Minnesota Flora",
    "info": "Introduction to identification of approximately 500 plants commonly used by landscape architects and environmental designers in Minnesota. Students develop a working knowledge of over 250 plants. Focuses on plant selection techniques, plant landscape associations, and issues of plants for use in standard landscape architectural settings. Regular field sessions.",
    "prereq": []
  },
  {
    "uid": "811376",
    "code": "LA5576",
    "subject": "LA",
    "number": "5576",
    "honors": false,
    "writingIntensive": false,
    "name": "Restoration Project Planning",
    "fullname": "Ecological Restoration Project Planning and Management",
    "info": "Applied practice of ecological restoration of landscapes. Grasslands, wetlands, forests, disturbed agricultural sites, former industrial parcels. Restoration management, skills needed to lead successful projects.prereq: [MLA student, senior B.E.D.] or senior or grad with one college course in ecology/one college course in plant science or botany or instr consent",
    "prereq": []
  },
  {
    "uid": "810866",
    "code": "LA5705",
    "subject": "LA",
    "number": "5705",
    "honors": false,
    "writingIntensive": false,
    "name": "Regreening Cities and Regions",
    "fullname": "Regreening Minds, Cities, and Regions",
    "info": "Emerging types of green spaces. Urban agriculture, urban waterscapes, urban wilderness. Politics, policies, metrics, planning of alternative visions of urban nature/sustainability in American cities. Role of social networks in creating emerging types of green spaces.prereq: Landscape Architecture graduate student or instr consent",
    "prereq": []
  },
  {
    "uid": "794212",
    "code": "LA5721",
    "subject": "LA",
    "number": "5721",
    "honors": false,
    "writingIntensive": false,
    "name": "Proseminar Metro Design",
    "fullname": "Proseminar in Metropolitan Design",
    "info": "Reading seminar. Evolution of the contemporary city. Dynamics that created contemporary urban spatial patterns. Planning/design theories that have guided public interventions in the built environment. Thematic texts, classroom discussions.",
    "prereq": []
  },
  {
    "uid": "804828",
    "code": "LA5755",
    "subject": "LA",
    "number": "5755",
    "honors": false,
    "writingIntensive": false,
    "name": "Infrastructure&Natural Systems",
    "fullname": "Infrastructure, Natural Systems and the Space of Inhabited Landscapes",
    "info": "Cross-disciplinary exploration of urban infrastructural solutions to mitigate/reverse anthropogenic impacts on Earth. Design of sustainable urban infrastructure systems, policy options, available technologies, criteria, design methods.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "817687",
    "code": "LA5761",
    "subject": "LA",
    "number": "5761",
    "honors": false,
    "writingIntensive": false,
    "name": "Infrastructure + Culture",
    "fullname": "Infrastructure + Culture",
    "info": "As attitudes about ecology and nature are shifting and as the threats from climate change are becoming more pronounced, new infrastructure works in the Netherlands are caught a a double bind of responding to ecological concerns and protection of the land. This course will explore both historic and modern water management infrastructures as cultural and engineering constructs through visual representation as a form of critique. The course will be structured around study trips, preparatory readings, on-site lectures, and will be supplemented by the participation of several guest speakers. ",
    "prereq": []
  },
  {
    "uid": "810852",
    "code": "LA5771",
    "subject": "LA",
    "number": "5771",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Systems I",
    "fullname": "Landscape Infrastructure and Systems I",
    "info": "Basic principles, techniques, and skills for creating sustainable infrastructures of built landscapes. Basic concepts of plant taxonomy, plant community structure, earthwork, water management, and landscape structures. Considerations of sustainability of construction materials and processes and how landscape infrastructures relate to climate change adaptation. Skills in creating technical construction drawings. Consideration of construction costs including economic cost and carbon footprints. Understanding of local building codes and introduction to the ADA.prereq: Master of Landscape Architecture Student, [or instr consent]",
    "prereq": []
  },
  {
    "uid": "810853",
    "code": "LA5772",
    "subject": "LA",
    "number": "5772",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Systems II",
    "fullname": "Landscape Infrastructure Systems II",
    "info": "LA 5772 focuses on the creation and construction of sustainable through the management of water. Alternate techniques of “soft” engineering using green infrastructure are emphasized as the primary methods of controlling water flows and volumes. Skills in creating technical construction drawings. More in-depth consideration of construction costs including economic cost and carbon footprints. More in-depth considerations of local building codes and ADA specifications.prereq: Master of Landscape Architecture Student",
    "prereq": []
  },
  {
    "uid": "794218",
    "code": "LA5790",
    "subject": "LA",
    "number": "5790",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics Met Design",
    "fullname": "Special Topics in Metropolitan Design",
    "info": "This course is no longer offered.",
    "prereq": []
  },
  {
    "uid": "009773",
    "code": "LA8201",
    "subject": "LA",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Land & Dwelling",
    "fullname": "Designing Landscapes for Dwelling and Settlement",
    "info": "Professional design studio. Hypothetical projects include development of schematic master plans for site layout, grading, and planting. Design for residential, commercial, and civic uses with attention to zoning and other controls, environmental quality, human behavior, markets, project finance, and technics. Requires concurrent registration in LA 8202.prereq: 5203, 5571, grad LA major, concurrent registration is required (or allowed) in  8202 or instr consent",
    "prereq": {
      "and": [
        {
          "code": "LA 5203",
          "subject": "LA",
          "id": "5203"
        },
        {
          "code": "LA 5571",
          "subject": "LA",
          "id": "5571"
        },
        {
          "code": "LA 8202",
          "subject": "LA",
          "id": "8202"
        }
      ]
    }
  },
  {
    "uid": "009812",
    "code": "LA8202",
    "subject": "LA",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "Dsgn Planned Dev",
    "fullname": "Design of Planned Developments",
    "info": "Issues related to planned community developments: historical precedents; design for residential, commercial, and civic uses; role of zoning and other controls; deed restrictions; preparation of design brief; environmental quality; human behavior; market; project finance; and techniques of site development.prereq: Grad LA major or instr consent",
    "prereq": []
  },
  {
    "uid": "011159",
    "code": "LA8203",
    "subject": "LA",
    "number": "8203",
    "honors": false,
    "writingIntensive": false,
    "name": "Make Regl Lands Space",
    "fullname": "Making Regional Landscape Space",
    "info": "Design exploration of landscape ecology, landscape perception, regional economics, and public policy as informants of design decision-making in regional landscapes at or exceeding township level. Geographic information systems as design tools.",
    "prereq": []
  },
  {
    "uid": "011154",
    "code": "LA8204",
    "subject": "LA",
    "number": "8204",
    "honors": false,
    "writingIntensive": false,
    "name": "Regl Lands Space",
    "fullname": "Regional Landscape Space",
    "info": "Theoretical investigations and current advances in use of landscape ecology, landscape perception, regional economics, and public policy as informants of design decision-making in regional landscapes at or exceeding township level. Geographic information systems as design tools.prereq: Grad LA major or instr consent",
    "prereq": []
  },
  {
    "uid": "004708",
    "code": "LA8205",
    "subject": "LA",
    "number": "8205",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Form Options: Landscape",
    "fullname": "Urban Form Options: Landscape Architecture Studio",
    "info": "Urban-focused design studio addresses current urban issues including climate change, environmental justice, displacement/gentrification, water management, and novel ecosystems. Urban theories and problems are explored through design inquiry in studio and a paired reading seminar.prereq: 2 yrs of studio, grad LA major or instr consent",
    "prereq": []
  },
  {
    "uid": "805530",
    "code": "LA8206",
    "subject": "LA",
    "number": "8206",
    "honors": false,
    "writingIntensive": false,
    "name": "Making Urban Landscape Space",
    "fullname": "Making Urban Landscape Space",
    "info": "Advanced design studio course focusing on current or emerging topics in urban or urbanizing landscapes. The specific course topics vary slightly from year to year and between sections. Each studio is focused on the same set of learning objectives, but with different studio sites and focus. Each studio explores a site and local culture of a metropolitan area and involves brief travel to the studio site. In general, these studios will examine changing conditions due to industrial decline, technological advancement, climate change, etc. as experimental ground for studio investigations into new paradigms of landscape-based solutions to urban design/development, and infrastructure.prereq: MLA grad student",
    "prereq": []
  },
  {
    "uid": "809357",
    "code": "LA8207",
    "subject": "LA",
    "number": "8207",
    "honors": false,
    "writingIntensive": false,
    "name": "LA Study Abroad Grad Studio",
    "fullname": "Cities on Water International Workshop",
    "info": "Intensive studio course on international applications of sustainable urban design in the contexts of climate change and environmental justice.prereq: Grad LA or ARCH major or instr consent",
    "prereq": []
  },
  {
    "uid": "011169",
    "code": "LA8301",
    "subject": "LA",
    "number": "8301",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Iss & Meth",
    "fullname": "Landscape Architecture: Research Issues and Methods",
    "info": "Alternative methodological approaches to landscape architectural research and consideration of their appropriateness for contemporary research topics.prereq: 8201 or concurrent registration is required (or allowed) in  8201, grad LA major or instr consent",
    "prereq": {
      "code": "LA 8201",
      "subject": "LA",
      "id": "8201"
    }
  },
  {
    "uid": "012846",
    "code": "LA8302",
    "subject": "LA",
    "number": "8302",
    "honors": false,
    "writingIntensive": false,
    "name": "Prof Prac",
    "fullname": "Professional Practice",
    "info": "How are professional design offices managing their practices and addressing goals of sustainability and equity? What are the financial and cost accounting, insurance, legal, and policy issues that frame professional practice? prereq: 8205, grad LA major or instr consent",
    "prereq": {
      "code": "LA 8205",
      "subject": "LA",
      "id": "8205"
    }
  },
  {
    "uid": "788135",
    "code": "LA8333",
    "subject": "LA",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Masters",
    "fullname": "FTE: Masters",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "014335",
    "code": "LA8400",
    "subject": "LA",
    "number": "8400",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Landscape Architecture",
    "fullname": "Topics in Landscape Architecture",
    "info": "Seminar offered by regular or visiting faculty in their area of specialization. Content varies with interest of instructor.",
    "prereq": []
  },
  {
    "uid": "014443",
    "code": "LA8401",
    "subject": "LA",
    "number": "8401",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Studies LA",
    "fullname": "Directed Studies in Emerging Areas of Landscape Architecture",
    "info": "Current topics in landscape architecture. Seminar offered by regular or visiting faculty in their area of specialization. Subject matter varies with instructor.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "014444",
    "code": "LA8402",
    "subject": "LA",
    "number": "8402",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Studies LA Hist Theory",
    "fullname": "Directed Studies in Landscape Architecture History and Theory",
    "info": "Advanced independent studies under direction of landscape architecture faculty.prereq: Grad LA major or instr consent",
    "prereq": []
  },
  {
    "uid": "014445",
    "code": "LA8403",
    "subject": "LA",
    "number": "8403",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Studies LA Tech",
    "fullname": "Directed Studies in Landscape Architecture Technology",
    "info": "Advanced independent studies under direction of landscape architecture faculty.prereq: Grad LA major or instr consent",
    "prereq": []
  },
  {
    "uid": "014447",
    "code": "LA8404",
    "subject": "LA",
    "number": "8404",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Studies LA Dsgn",
    "fullname": "Directed Studies in Landscape Architecture Design",
    "info": "Advanced independent studies under direction of landscape architecture faculty.prereq: Grad LA major or instr consent",
    "prereq": []
  },
  {
    "uid": "014475",
    "code": "LA8405",
    "subject": "LA",
    "number": "8405",
    "honors": false,
    "writingIntensive": false,
    "name": "Interdisc Studies LA",
    "fullname": "Interdisciplinary Studies in Landscape Architecture",
    "info": "Research, planning, and/or design project. Sample topics: energy efficient design, historic preservation, urban revitalization, agricultural land use, computerized land-use planning, housing.prereq: Grad LA major or instr consent",
    "prereq": []
  },
  {
    "uid": "011183",
    "code": "LA8406",
    "subject": "LA",
    "number": "8406",
    "honors": false,
    "writingIntensive": false,
    "name": "Concepts of Land Eval",
    "fullname": "Concepts of Landscape Evaluation",
    "info": "Philosophical basis for wide-ranging approaches to evaluating qualitative aspects of landscape. Aesthetic factors and integration of landscape evaluation into regional design decision-making.prereq: Grad land arch major or instr consent",
    "prereq": []
  },
  {
    "uid": "004827",
    "code": "LA8407",
    "subject": "LA",
    "number": "8407",
    "honors": false,
    "writingIntensive": false,
    "name": "Perception Manip",
    "fullname": "Perception Manipulation in Design of Exterior Space",
    "info": "Historic and modern design devices that alter one's sense of spatial control and arrangement to create illusionary situations in exterior environment. Organized to inform and test principles of perception distortion in exterior space.prereq: Grad land arch major or instr consent",
    "prereq": []
  },
  {
    "uid": "008884",
    "code": "LA8408",
    "subject": "LA",
    "number": "8408",
    "honors": false,
    "writingIntensive": false,
    "name": "18th C LA Theory: SBP",
    "fullname": "18th-Century Landscape Theory: Nature and the Sublime, the Beautiful, and the Picturesque",
    "info": "Eighteenth-century landscape architectural theory underpinned most modern western traditions in landscape architecture. These theoretical positions framed the nature of Nature in the context of human experience through treatises and works of landscape architecture.prereq: Grad land arch or arch major or instr consent",
    "prereq": []
  },
  {
    "uid": "010831",
    "code": "LA8409",
    "subject": "LA",
    "number": "8409",
    "honors": false,
    "writingIntensive": false,
    "name": "Fit Build to Land",
    "fullname": "Fitting Buildings to the Land",
    "info": "Exercises and projects in site manipulation to adjust structures and attendant uses and circulation to specific land parcels.prereq: Land arch or arch grad student with 1 yr grad design or instr consent",
    "prereq": []
  },
  {
    "uid": "809354",
    "code": "LA8411",
    "subject": "LA",
    "number": "8411",
    "honors": false,
    "writingIntensive": false,
    "name": "LA Study Abroad Immersion",
    "fullname": "The foundational studio course on international applications of sustainable design in urban Europe.",
    "info": "Design preparation for restoration/reuse of abandoned sites in urban/exurban areas reclaimed from/influenced by saltwater coastal environments.prereq: Grad LA or ARCH major or instr consent",
    "prereq": []
  },
  {
    "uid": "004780",
    "code": "LA8554",
    "subject": "LA",
    "number": "8554",
    "honors": false,
    "writingIntensive": false,
    "name": "Project Programming",
    "fullname": "Project Programming",
    "info": "Independent research focused on defining and delineating a landscape design project for LA 8555 studio.prereq: 8203, [grad land arch major or instr consent]",
    "prereq": {
      "code": "LA 8203",
      "subject": "LA",
      "id": "8203"
    }
  },
  {
    "uid": "004779",
    "code": "LA8555",
    "subject": "LA",
    "number": "8555",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Land Plan Dsgn",
    "fullname": "Advanced Landscape Planning and Design",
    "info": "Landscape design studio focused on an independent, research-based project defined by the student. Project addresses contemporary issues including climate change, degraded ecologies, inequity, and water scarcity.prereq: 8205, grad land arch major or instr consent",
    "prereq": {
      "code": "LA 8205",
      "subject": "LA",
      "id": "8205"
    }
  },
  {
    "uid": "009222",
    "code": "LA8574",
    "subject": "LA",
    "number": "8574",
    "honors": false,
    "writingIntensive": false,
    "name": "Storm Water Mngmt",
    "fullname": "Landscape Storm Water Management",
    "info": "Theory and applications of hydrology and storm water management techniques. Applied hydrology, catchment delineation, storm water runoff models, and storm water management techniques (detention ponds, swales, channels, culverts, small storm sewer systems, run-off systems, sedimentation, and erosion control systems).prereq: 8201, grad land arch major or instr consent",
    "prereq": {
      "code": "LA 8201",
      "subject": "LA",
      "id": "8201"
    }
  },
  {
    "uid": "009115",
    "code": "LA8575",
    "subject": "LA",
    "number": "8575",
    "honors": false,
    "writingIntensive": false,
    "name": "Art of Landscape Detail",
    "fullname": "The Art and Ecology of Landscape Detail",
    "info": "Design of pavements, enclosures, decks, lighting, electrical, and irrigation systems for landscape architecture. Theory/principles of design of light structures, properties/use of materials, construction communication. Landscape integrity and economic viability as performance issues.prereq: Grad LA major or instr consent",
    "prereq": []
  },
  {
    "uid": "794926",
    "code": "LA8741",
    "subject": "LA",
    "number": "8741",
    "honors": false,
    "writingIntensive": false,
    "name": "Metropolitan Design Workshop",
    "fullname": "Metropolitan Design Workshop and Optional Seminar",
    "info": "Introduction to discipline/methodologies of urban design. Contributing fields/issues, including government/community goals, land use, housing, economic development, natural resources, services, and transportation. Implementation program.prereq: Enrollment in CMD prog or instr consent",
    "prereq": []
  },
  {
    "uid": "810854",
    "code": "LA8773",
    "subject": "LA",
    "number": "8773",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Technology III",
    "fullname": "Landscape Infrastructure and Systems III",
    "info": "LA 8773 focuses on the use of plant materials, plant communities, and the design of planted spaces in supporting the construction of sustainable landscapes. Emphasis is placed on understanding the ecology of plant communities and the use of plants in different environments, including dry and wet landscapes. Advanced work in creating professional drawing sets (planting plans and specifications) for construction.prereq: Master of Landscape Architecture Student or instr consent",
    "prereq": []
  },
  {
    "uid": "810855",
    "code": "LA8774",
    "subject": "LA",
    "number": "8774",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Systems IV",
    "fullname": "Landscape Infrastructure and Systems IV",
    "info": "Builds on LA 8773. In-depth consideration of materials and assemblies including case studies of including carbon neutral and biophyllic approaches. Emphasis is placed on understanding longevity of materials and assemblies, embodied carbon, and lifecycle of materials and assemblies. Explores building codes and basic engineering principles. Advanced work in creating professional drawing sets for construction.\n\nConsideration of how new materials and assemblies relate to current code requirements. Advanced drawing techniques. Consideration of construction costs including economic cost and carbon footprinting and lifecycle analysis.\n\nprereq: Master of Landscape Architecture Student or instr consent",
    "prereq": []
  },
  {
    "uid": "810862",
    "code": "LA8775",
    "subject": "LA",
    "number": "8775",
    "honors": false,
    "writingIntensive": false,
    "name": "Landscape Technology V",
    "fullname": "Landscape Infrastructure and Site Technology V",
    "info": "Seminar, cross-disciplinary. Advanced inquiry into complex site-scale problems requiApplied theory. Professional practice applications with emphasis on urban/post-industrial sites. Programmatic, regulatory/construction contexts. Directed research of emerging/speculative infrastructure.prereq: 8773, 8774 preferred, students outside of Master of Landscape Architecture program are encouraged to enroll upon demonstration of similar pre-requisite coursework and instr consent",
    "prereq": {
      "and": [
        {
          "code": "LA 8773",
          "subject": "LA",
          "id": "8773"
        },
        {
          "code": "LA 8774",
          "subject": "LA",
          "id": "8774"
        }
      ]
    }
  },
  {
    "uid": "788620",
    "code": "LA8777",
    "subject": "LA",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required (Plan A only)",
    "prereq": []
  }
]