[
  {
    "uid": "013594",
    "code": "LAMP3050",
    "subject": "LAMP",
    "number": "3050",
    "honors": false,
    "writingIntensive": false,
    "name": "Path for MS Student",
    "fullname": "Pathology for Mortuary Science Students",
    "info": "Students are assigned to laboratory and cooperative learning groups.  Examine photos of gross or microscopic pathology to learn basic principles of disease and identify external evidence of traumatic injury.  View at least one autopsy.  Twenty-one lectures, five 2-hr labs.",
    "prereq": []
  },
  {
    "uid": "013409",
    "code": "LAMP4172",
    "subject": "LAMP",
    "number": "4172",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathology for Allied Hlth Stdt",
    "fullname": "Pathology for Allied Health Students",
    "info": "General and organ system pathology.prereq: Regis allied health program, anatomy course, physiology course or instr consent",
    "prereq": []
  },
  {
    "uid": "013410",
    "code": "LAMP4177",
    "subject": "LAMP",
    "number": "4177",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathology for Allied Hlth Stdt",
    "fullname": "Nature of Disease: Pathology for Allied Health Students",
    "info": "Human disease as alteration of normal structure/function of anatomy/physiology. Variety of lecturers cover their area of expertise. Grade based on five unit exams. Offered online in spring and summer.prereq: One anatomy course, one physiology course, or instr consent",
    "prereq": []
  },
  {
    "uid": "013411",
    "code": "LAMP5100",
    "subject": "LAMP",
    "number": "5100",
    "honors": false,
    "writingIntensive": false,
    "name": "Path for Dental Stu",
    "fullname": "General and Systemic Pathology for Dental Students",
    "info": "Causes, courses, mechanisms, and outcomes of disease. Required as preparation for clinical dental practice and oral pathology.prereq: Registered dental student",
    "prereq": []
  },
  {
    "uid": "014600",
    "code": "LAMP5125",
    "subject": "LAMP",
    "number": "5125",
    "honors": false,
    "writingIntensive": false,
    "name": "Chronobiology",
    "fullname": "Chronobiology",
    "info": "How to interpret biologic time series and how to use them in practice as well as in designing chronobiology experiments. Chronobiologic procedures of data collection and analysis, interpretation of the output in clinical practice.",
    "prereq": []
  },
  {
    "uid": "012649",
    "code": "LAMP6101",
    "subject": "LAMP",
    "number": "6101",
    "honors": false,
    "writingIntensive": false,
    "name": "General Path",
    "fullname": "General Pathology",
    "info": "General pathology.prereq: Registered Medical Student",
    "prereq": []
  },
  {
    "uid": "014661",
    "code": "LAMP6102",
    "subject": "LAMP",
    "number": "6102",
    "honors": false,
    "writingIntensive": false,
    "name": "Systemic Path",
    "fullname": "Organic System Pathology",
    "info": "In this year 2 course, diseases are presented in the context of three organ systems: cardiac, respiratory and neuropathology.  Morphologic alterations caused by disease are emphasized using gross specimens, microscopic slides and videotape. Appropriate use of laboratory test also is discussed, often in conjunction with case studies.",
    "prereq": []
  },
  {
    "uid": "014663",
    "code": "LAMP6103",
    "subject": "LAMP",
    "number": "6103",
    "honors": false,
    "writingIntensive": false,
    "name": "Systemic Path",
    "fullname": "Organ System Pathology",
    "info": "In this year 2 course, diseases are presented in the context of three organ systems: endocrine, reproduction, renal.  Morphologic alterations caused by disease are emphasized using gross specimens, microscopic slides and videotape. Appropriate use of laboratory test is also discussed, often in conjunction with case studies.",
    "prereq": []
  },
  {
    "uid": "014664",
    "code": "LAMP6104",
    "subject": "LAMP",
    "number": "6104",
    "honors": false,
    "writingIntensive": false,
    "name": "Systemic Path",
    "fullname": "Organ System Pathology",
    "info": "In this year 2 course, diseases are presented in the context of three organ systems: bones and joints, gastrointestinal and blood. Morphologic alterations caused by disease are emphasized using gross specimens, microscopic slides and videotape. Appropriate use of laboratory test is also discussed, often in conjunction with case studies.",
    "prereq": []
  },
  {
    "uid": "789556",
    "code": "LAMP6290",
    "subject": "LAMP",
    "number": "6290",
    "honors": false,
    "writingIntensive": false,
    "name": "Laboratory Medicine",
    "fullname": "Laboratory Medicine",
    "info": "Introduction to principles/techniques of laboratory medicine.",
    "prereq": []
  },
  {
    "uid": "800974",
    "code": "LAMP6300",
    "subject": "LAMP",
    "number": "6300",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardio/Resp Path",
    "fullname": "Cardiovascular/Respiratory Pathology",
    "info": "Pathology of cardiovascular/respiratory systems.prereq: MS 2 standing",
    "prereq": []
  },
  {
    "uid": "800975",
    "code": "LAMP6301",
    "subject": "LAMP",
    "number": "6301",
    "honors": false,
    "writingIntensive": false,
    "name": "Neuropath",
    "fullname": "Neuropathology",
    "info": "Pathology of nervous system.prereq: MS 2 standing",
    "prereq": []
  },
  {
    "uid": "800976",
    "code": "LAMP6302",
    "subject": "LAMP",
    "number": "6302",
    "honors": false,
    "writingIntensive": false,
    "name": "Musculoskel/Derm Path",
    "fullname": "Musculoskeletal and Dermatology Pathology",
    "info": "Pathology of musculoskeletal system and skin.prereq: MS 2 standing",
    "prereq": []
  },
  {
    "uid": "800977",
    "code": "LAMP6303",
    "subject": "LAMP",
    "number": "6303",
    "honors": false,
    "writingIntensive": false,
    "name": "Renal/Endo/Reprod Path",
    "fullname": "Renal, Endocrine, and Reproductive Pathology",
    "info": "Pathology of renal, endocrine, and reproductive systems.",
    "prereq": []
  },
  {
    "uid": "800978",
    "code": "LAMP6304",
    "subject": "LAMP",
    "number": "6304",
    "honors": false,
    "writingIntensive": false,
    "name": "Gastrointestinal Path",
    "fullname": "Gastrointestinal Pathology",
    "info": "Pathology of gastrointestinal system.prereq: MS 2 standing",
    "prereq": []
  },
  {
    "uid": "800979",
    "code": "LAMP6305",
    "subject": "LAMP",
    "number": "6305",
    "honors": false,
    "writingIntensive": false,
    "name": "Hematopathology",
    "fullname": "Hematopathology",
    "info": "Pathology of blood and related tissues.",
    "prereq": []
  },
  {
    "uid": "012550",
    "code": "LAMP7113",
    "subject": "LAMP",
    "number": "7113",
    "honors": false,
    "writingIntensive": false,
    "name": "Surgical Pathology",
    "fullname": "Surgical Pathology- Fairview University Medical Center",
    "info": "The student participates in the dissection, gross description, microscopic description, and diagnosis of surgical pathology specimens; in frozen section procedures; and in intradepartmental conferences. The student has access to surgical pathology student sets specifically designed for this course, to microfiche \"Key Concepts in Pathology,\" and to tumor microscopic sets, W.H.O. SPECIAL INSTRUCTIONS: Reading assignment: Rosai J: Ackerman's Surgical Pathology, ed 7. St. Louis, CV Mosby, 1989. This text and other books are available as part of a small student library in Surgical Pathology. Projection slides and other educational material of the Bell Institute of Pathology.prereq: Registered 3rd and 4th year medical students",
    "prereq": []
  },
  {
    "uid": "012551",
    "code": "LAMP7114",
    "subject": "LAMP",
    "number": "7114",
    "honors": false,
    "writingIntensive": false,
    "name": "Surgical Pathology",
    "fullname": "Surgical Pathology",
    "info": "The student participates in all areas of surgical pathology activities.",
    "prereq": []
  },
  {
    "uid": "012553",
    "code": "LAMP7115",
    "subject": "LAMP",
    "number": "7115",
    "honors": false,
    "writingIntensive": false,
    "name": "Surgical Pathology Elective",
    "fullname": "Surgical Pathology-Veterans Affairs Medical Center",
    "info": "The student is expected to take part in the processing and diagnosis of surgical specimens under supervision. The student is assigned their own cases and will follow them through, from receipt in the laboratory to dictation of the final report. In selected cases, the student is expected to review patient charts and correlate the histologic findings with the clinical and lab data. They are expected to attend conferences in which the surgical pathology staff participates. A student may elect to spend time in electron microscopy and/or participate in one or more autopsies. Time is made available for a student to review areas of special interest in pathology. SPECIAL INSTRUCTIONS: Under special circumstances the student is allowed to take this course for 3 or 4 weeks, but it is essential that the student contact Dr. Guzman at least one month prior to beginning elective.prereq: Registered 3rd and 4th year medical students.",
    "prereq": []
  },
  {
    "uid": "820240",
    "code": "LAMP7116",
    "subject": "LAMP",
    "number": "7116",
    "honors": false,
    "writingIntensive": false,
    "name": "Virtual Anatomic Pathology",
    "fullname": "Virtual Anatomic Pathology Elective",
    "info": "This elective offers the opportunity for students to virtually participate in a rotation in the Anatomic Pathology Department at the University of Minnesota. The student will become acquainted with current basic concepts of Anatomic Pathology and how it applies to clinical and surgical medicine. Students will have the opportunity to focus their learning based on their desired specialties of interest.  COVID-19 has converted a majority of clinical rotations to the virtual environment for the foreseeable future. This includes Anatomic Pathology, which is an essential rotation for students interested in applying to Pathology this upcoming residency cycle. Therefore, the aim is to create a virtual Anatomic Pathology elective that will allow students to gain exposure to the field, make connections with pathologists, and provide opportunities for research and obtaining letters of recommendation. In addition, our goal is to also make this elective applicable to students going into other specialities (surgery, internal medicine, Ob/Gyn, among others) by individualizing the curriculum to focus on pathology that is specific to those specialities. Additionally, a secondary goal of this elective is to produce resources that will be utilized by future medical students and/or visiting medical students or international medical graduates. ",
    "prereq": []
  },
  {
    "uid": "012554",
    "code": "LAMP7119",
    "subject": "LAMP",
    "number": "7119",
    "honors": false,
    "writingIntensive": false,
    "name": "Forensic Pathology",
    "fullname": "Forensic Pathology",
    "info": "This course acquaints students with the field of forensic medicine. The student will become familiar with the function of a medical examiner's office in determining the various causes and manners of death that fall under the jurisdiction of such a public official.",
    "prereq": []
  },
  {
    "uid": "816923",
    "code": "LAMP7120",
    "subject": "LAMP",
    "number": "7120",
    "honors": false,
    "writingIntensive": false,
    "name": "Perinatal/Pediatric Pathology",
    "fullname": "Perinatal/Pediatric Pathology",
    "info": "This elective will expose medical students to pediatric pathology, a diagnostic subspecialty that ranges broadly across anatomic and clinical pathology as these relate to children and adolescents, fetuses and infants, and pregnant women. It should prove useful to medical students interested in pediatric medicine, pediatric surgery, obstetrics and gynecology, or pathology.",
    "prereq": []
  },
  {
    "uid": "012556",
    "code": "LAMP7141",
    "subject": "LAMP",
    "number": "7141",
    "honors": false,
    "writingIntensive": false,
    "name": "Experimental Pathology",
    "fullname": "Problems in Experimental Pathology",
    "info": "Students choose from cardiac pathology, neuropathology, pediatric pathology, renal pathology, surgical pathology, immunobiology, hematology, genetics, cell biology, tumor immunology/transplantation genetics, molecular diagnostics, diabetes, cancer immunology, electron microscopy (diagnostic/research), experimental oncology, chemical carcinogenesis, immunopathology, chronobiology, tumor pathology, immunocytochemistry.prereq: [3rd or 4th] yr medical student; before beginning project, contact Mary Ramey, D-142 Mayo, 612-625-5421",
    "prereq": {
      "code": "LAMP 5421",
      "subject": "LAMP",
      "id": "5421"
    }
  },
  {
    "uid": "798163",
    "code": "LAMP7145",
    "subject": "LAMP",
    "number": "7145",
    "honors": false,
    "writingIntensive": false,
    "name": "Neuropathology",
    "fullname": "Neuropathology",
    "info": "The course is a practical introduction to neuropathology. The students will work with the attending neuropathologist and residents (from LMP, Neurology and/or Neurosurgery) performing diagnostic services in neuropathology.",
    "prereq": []
  },
  {
    "uid": "012557",
    "code": "LAMP7150",
    "subject": "LAMP",
    "number": "7150",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomic Pathology",
    "fullname": "Anatomic Pathology",
    "info": "The student will become acquainted with current basic concepts of anatomic pathology, especially in relation to morphological interpretation.",
    "prereq": []
  },
  {
    "uid": "012560",
    "code": "LAMP7152",
    "subject": "LAMP",
    "number": "7152",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomic Pathology-VA",
    "fullname": "Anatomic Pathology-VA",
    "info": "The goal of this rotation is to familiarize the medical student with the role of pathology in the diagnosis, prognosis and treatment of patients through the activities of pathologist as members of the clinical team.",
    "prereq": []
  },
  {
    "uid": "012561",
    "code": "LAMP7153",
    "subject": "LAMP",
    "number": "7153",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomic Path-Regions",
    "fullname": "Anatomic Pathology in a Hospital Setting-Regions Medical Center",
    "info": "The student participates in the performance and evaluation of autopsy cases. They study specimen processing and evaluation insurgical pathology, cytology, and diagnostic electron-microscopic laboratories. The student participates in the on-going activities of the department, including attendance at all departmental and selected interdepartmental conferences, where the clinicopathological correlations of certain cases are discussed. Each student will be assigned to or select a topic of interest, and conduct a literature review, independent study, and critical presentation at the departmental conference.prereq: Registered 3rd and 4th year medical students",
    "prereq": []
  },
  {
    "uid": "012562",
    "code": "LAMP7154",
    "subject": "LAMP",
    "number": "7154",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomic Path in Hosp - NW",
    "fullname": "Anatomic Pathology in a Hospital Setting-Abbott Northwestern Hospital",
    "info": "The student participates in all aspects of a busy anatomic pathology department based in a community hospital, with exposure to and responsibilities in surgical pathology including frozen section diagnosis, specimen examination, and dictation and microscopic evaluation and sign-out under supervision. The student has the opportunity to observe and participate in the performance of autopsies during this rotation as well. The student also participates in various regularly scheduled conferences.Each student's experience in the externship can be modified depending on individual background and experience.prereq: Registered 3rd and 4th year medical students considering the practice of pathology or laboratory medicine as a career. Noon meal and parking provided. Contact course director 6 weeks prior to starting.",
    "prereq": []
  },
  {
    "uid": "012563",
    "code": "LAMP7158",
    "subject": "LAMP",
    "number": "7158",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardiac Pathology",
    "fullname": "Cardiac Pathology",
    "info": "Students will observe examinations of existing and newly acquired cardiovascular specimens to identify variations of specific congenital and acquired disease entities and their functional significance. ",
    "prereq": []
  },
  {
    "uid": "012564",
    "code": "LAMP7181",
    "subject": "LAMP",
    "number": "7181",
    "honors": false,
    "writingIntensive": false,
    "name": "Hematopathology",
    "fullname": "Hematopathology",
    "info": "Over the course of the rotation, students will be fully integrated into the blood and bone marrow biopsy service, with \"ownership\" of their cases and graduated responsibility for their level of training. They will learn to preview/interpret blood smears and write up preliminary diagnostic reports.",
    "prereq": []
  },
  {
    "uid": "012566",
    "code": "LAMP7184",
    "subject": "LAMP",
    "number": "7184",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Transfusion Therapy",
    "fullname": "Introduction to Transfusion Therapy",
    "info": "The student will address transfusion problems in patients with red cell, white cell, and platelet antibodies and coagulopathy.",
    "prereq": []
  },
  {
    "uid": "012567",
    "code": "LAMP7186",
    "subject": "LAMP",
    "number": "7186",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab Med Community Hospital",
    "fullname": "Laboratory Medicine in a Community Hospital",
    "info": "The student will specialize in one or two areas of the clinical lab but will participate in all its general teaching activities. SPECIAL INSTRUCTIONS: Students must contact Dr. Apple at least one month prior to beginning elective.",
    "prereq": []
  },
  {
    "uid": "012569",
    "code": "LAMP7187",
    "subject": "LAMP",
    "number": "7187",
    "honors": false,
    "writingIntensive": false,
    "name": "Interpretation of Lab Data",
    "fullname": "Interpretation of Lab Data",
    "info": "This course is designed for 3rd and 4th year medical students who are faced with the challenge of bringing the extensive diagnostic capabilities of the clinical laboratory to bear on specific clinical problems.prereq: Med Student Yr 3 or 4/one previous rotation",
    "prereq": []
  },
  {
    "uid": "012570",
    "code": "LAMP7188",
    "subject": "LAMP",
    "number": "7188",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab Med/Surg Elect",
    "fullname": "Pathology Externship: Clinical and Surgical-Methodist Hospital",
    "info": "The student participates in the practice of clinical and surgical pathology in a community hospital. In surgical pathology, this may consist of examining gross specimens and microscopic sections and correlating them with clinical findings. Clinical pathology teaching may include the following: clinical chemistry, hematology, immunology, microbiology, blood transfusions, and nuclear medicine. This course is designed as an independent study program: the student may select as many of the above areas as desired. The student participates in routine duties with staff pathologists while they rotate through the various areas. No night orweekend call is required.prereq: Registered 3rd and 4th year medical students considering the practice of pathology or laboratory medicine as a career. Noon meals provided. Contact Dr. Manoles one month prior to start.",
    "prereq": []
  },
  {
    "uid": "012571",
    "code": "LAMP7193",
    "subject": "LAMP",
    "number": "7193",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab med/surg elec",
    "fullname": "Pathology and Laboratory Medicine Externship: Central Mesabi Medical",
    "info": "The student and the pathologist work as a team in those areas of laboratory medicine mutually selected. Emphasis is on clinical correlation, with daily rounds on interesting cases and close interaction with clinicians. All clinical laboratory results are reviewed daily and, if appropriate, correlated with surgical and autopsy pathology by direct student participation. The coursework emphasizes interpretation of lab results and appropriate selection of tests. The 175-bed hospital, opened in October 1980, provides primary and secondary care for a rural and industrial community of approximately 40,000 people. Normally the student writes apaper for presentation to the medical staff and/or publication.prereq: Registered 3rd and 4th year medical students. Meals and housing provided. Contact Dr. Uncini one month prior to starting elective (to make arrangements).",
    "prereq": []
  },
  {
    "uid": "012572",
    "code": "LAMP7195",
    "subject": "LAMP",
    "number": "7195",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Informatics",
    "fullname": "Medical Informatics",
    "info": "Medical informatics uses computer and information science to solve problems in medicine, health care delivery, and medical research. The student works on a project under the supervision of faculty and/or fellows in medical informatics. The specific project depends on faculty availability and the student's background, interests, and experience. Projects have included computer assisted instruction for medical students or patients, computer-based medical decision support systems, creation of clinical database management systems, and statistical analysis of data from clinical research. As schedule permits, the student is expected to attend health informatics courses and seminars.",
    "prereq": []
  },
  {
    "uid": "013063",
    "code": "LAMP7210",
    "subject": "LAMP",
    "number": "7210",
    "honors": false,
    "writingIntensive": false,
    "name": "Surgical Path for Post MDs",
    "fullname": "Surgical Pathology for Post-M.D.s",
    "info": "Surgical Pathology for post MD's.prereq: Regis med fellow special",
    "prereq": []
  },
  {
    "uid": "013064",
    "code": "LAMP7211",
    "subject": "LAMP",
    "number": "7211",
    "honors": false,
    "writingIntensive": false,
    "name": "AP for Post-M.D.s",
    "fullname": "Anatomic Pathology for Post-M.D.s",
    "info": "Anatomic pathology experience.",
    "prereq": []
  },
  {
    "uid": "013065",
    "code": "LAMP7213",
    "subject": "LAMP",
    "number": "7213",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab Medicine for Post M.D.s",
    "fullname": "Laboratory Medicine for Post-M.D.s",
    "info": "Post graduate training in all areas of laboratory medicine.",
    "prereq": []
  },
  {
    "uid": "796080",
    "code": "LAMP7400",
    "subject": "LAMP",
    "number": "7400",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathology-Duluth",
    "fullname": "Pathology-Duluth",
    "info": "Students experience practice of pathology in a tertiary care regional medical center. Clinical pathology disciplines of transfusion medicine, microbiology, chemistry, and hematology. Students spend time with medical directors and supervisors of each section. Directed self-study, case-based, didactic, and hands-on instruction. Laboratory medicine's role in ongoing patient care.",
    "prereq": []
  },
  {
    "uid": "826071",
    "code": "LAMP7500",
    "subject": "LAMP",
    "number": "7500",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern-Hematopathology",
    "fullname": "Acting Internship-Hematopathology",
    "info": "Over the course of the 4 week rotation, students (acting as a first year LMP resident) will be fully integrated into the blood and bone marrow biopsy service, with “ownership” of their cases and graduated responsibility for their level of training. They will learn to preview/interpret blood smears and write up preliminary diagnostic reports. Once they are competent with blood smears, they will progress to bone marrow aspirate and biopsy interpretation, including drafting a diagnostic report. Special studies are often performed simultaneously and may include immunohistochemistry and flow cytometry; the student will learn how these influence overall diagnosis and how they are integrated into the report. There are weekly multidisciplinary and unknown teaching conferences, as well as a daily consensus/teaching conference. The student will become acquainted with the various complimentary modalities used to distinguish between reactive etiologies and malignant neoplasms and learn how to classify the more common types of hematopoietic neoplasms, including leukemias and lymphomas. The student will typically work individually with each of the 7 faculty over the course of the month. The evaluation is done as a group to gather input from each faculty member. The course grade is based on the appraisal of the student's ability to recognize and describe the more common types of hematolymphoid disorders, both reactive and neoplastic as well as all core competencies including professionalism and medical knowledge. The student is required to select a topic in hematopathology, review the medical literature and present a 20-minute talk to the residents, fellows and faculty. The talk is usually case-based, with a brief presentation followed by literature review.",
    "prereq": []
  },
  {
    "uid": "826072",
    "code": "LAMP7501",
    "subject": "LAMP",
    "number": "7501",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Path Transfusion",
    "fullname": "Acting Internship Pathology_Transfusion Medicine",
    "info": "The acting intern will function as an integral part of the Transfusion Medicine service. Responsibilities will go beyond that of the general medical student clerkship (LAMP 7184), and will align with the expectations and goals of pathology residents on this rotation. These enhanced responsibilities will include:- Coverage of the daytime service pager. This will greatly enhance the acting intern's ability to function as an integral part of the health care team. These calls include interactions with laboratory staff as well as clinical teams.- Primary responsibility to collect, evaluate, and present assessments of blood bank evaluation forms and transfusion reactions.- Develop the skills to perform clinical consultations for apheresis patients, beginning with stem cell collections, and moving on to therapeutic apheresis procedures. Write consultation notes to document these interactions and activities.- Write orders for upcoming apheresis procedures.- Take 1 week of overnight call with a University of Minnesota Transfusion Medicine physician. Plan for this during week 3 or 4 of the acting internship.- Seek out independent learning on transfusion medicine topics. Physical textbooks are available onsite; additional suggestions for online materials and resources can also be made available.",
    "prereq": []
  },
  {
    "uid": "826073",
    "code": "LAMP7502",
    "subject": "LAMP",
    "number": "7502",
    "honors": false,
    "writingIntensive": false,
    "name": "Surg Path Acting Internship",
    "fullname": "Acting Internship Pathology_Surgical Pathology",
    "info": "The acting intern will function as an integral part of the Surgical Pathology service. The surgical pathology service at the University of Minnesota is a sub-specialty based sign-out (primarily based on organ system). Interns will be placed onto service(s) based on their interests, career goals, and service availability. Responsibilities will go beyond that of the general medical student clerkship, and will align with the expectations and goals of pathology residents on this rotation. Acting interns will be expected to take cases to preview, review with the attending, and compose reports in Beaker. They will have graduated responsibilities as the rotation proceeds, but will begin the rotation reviewing the patient's clinical history and start composing the pathology report. They will meet with a surgical pathology attending to sign-out cases on days that they are not in the gross room. The acting intern will be in the gross room intermittently (likely once per week) and will also participate in frozen sections when they are in the gross room.",
    "prereq": []
  },
  {
    "uid": "805708",
    "code": "LAMP7910",
    "subject": "LAMP",
    "number": "7910",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab Med Path Med Residency",
    "fullname": "Laboratory Medicine and Pathology Medical Residency",
    "info": "Laboratory medicine and pathology medical residency.",
    "prereq": []
  },
  {
    "uid": "805709",
    "code": "LAMP7930",
    "subject": "LAMP",
    "number": "7930",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab Med Path Med Fellowship",
    "fullname": "Laboratory Medicine and Pathology Medical Fellowship",
    "info": "Laboratory medicine and pathology medical fellowship.",
    "prereq": []
  }
]