[
  {
    "uid": "820482",
    "code": "LEAD1030",
    "subject": "LEAD",
    "number": "1030",
    "honors": false,
    "writingIntensive": false,
    "name": "Connection, Identity, and Lead",
    "fullname": "Connection, Identity, and Leadership",
    "info": "This course is intended to engage students in a concentrated study on identity, culture, and leadership through a digital lens. We will use reflective storytelling through our own personal experiences and the critical impact that connection has on shaping us as leaders.",
    "prereq": []
  },
  {
    "uid": "015768",
    "code": "LEAD1961W",
    "subject": "LEAD",
    "number": "1961",
    "honors": false,
    "writingIntensive": true,
    "name": "Personal Leadership in the U",
    "fullname": "Personal Leadership in the University",
    "info": "Examine personal views of leadership, differences between personal/positional leadership, leadership ethics/values, personal leadership strengths/skills.",
    "prereq": []
  },
  {
    "uid": "015908",
    "code": "LEAD3961",
    "subject": "LEAD",
    "number": "3961",
    "honors": false,
    "writingIntensive": false,
    "name": "Ldership, You & Your Community",
    "fullname": "Leadership, You, and Your Community",
    "info": "How do effective leaders create positive systemic change within complex systems? What is community and how does it shape the work of leadership? Students examine leadership from a multi-dimensional and multicultural perspective and critically examine leadership theories in authentic, complex community settings.",
    "prereq": []
  },
  {
    "uid": "790211",
    "code": "LEAD3971",
    "subject": "LEAD",
    "number": "3971",
    "honors": false,
    "writingIntensive": false,
    "name": "Ldrship Minor Field Experience",
    "fullname": "Leadership Minor: Field Experience",
    "info": "Students apply and integrate leadership theory in a community experience, think critically about their positional leadership roles, extrapolate the experience to future leadership issues within their specific fields, and work through challenges of positional leadership.  ",
    "prereq": []
  },
  {
    "uid": "812850",
    "code": "LEAD3972",
    "subject": "LEAD",
    "number": "3972",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Exp: Intercultral Intern",
    "fullname": "Field Experience: Intercultural Internship",
    "info": "Internship-based course focused on leadership principles and intercultural values that impact the work environment. Possible internship locations include New York City, San Francisco, and Minneapolis.  For students in the undergraduate Leadership Minor, this is the opportunity to apply what they have learned in a real-life setting.  Prior to departure for the on-site internship in the city location, students spend a week in class at the University studying the theoretical frameworks that will provide the foundation for the 6-week internship, reflection process, and living experience. The composition of the class cohort will include international and domestic students, which provides the opportunity to experience and reflect upon the internship and the designated city living experience through an intercultural lens. Upon completion of the internship, the class cohort will return to the University to complete a final week of class on campus.",
    "prereq": []
  },
  {
    "uid": "818385",
    "code": "LEAD4481",
    "subject": "LEAD",
    "number": "4481",
    "honors": false,
    "writingIntensive": false,
    "name": "Ldrship/Social Change, Ireland",
    "fullname": "Leadership and Social Change in Ireland",
    "info": "Learn how ordinary individuals and communities can inspire, mobilize, and engage with others to make a difference and to tackle what might appear to be an impossible public problem. The city of Belfast, Northern Ireland will provide a rich context for students to learn about the role that ordinary citizens, informal leaders, and public officials played in facilitating a reconciliation of a long-standing conflict (The Troubles), which still remains ever present. Despite public perception that Northern Ireland has moved forward from the Troubles, more walls have gone up since the peace agreement was signed, and there is still significant segregation between Protestants and Catholics. Learn how ordinary individuals and communities can inspire, mobilize, and engage with others to make a difference and to tackle what might appear to be an impossible public problem. The city of Belfast, Northern Ireland will provide a rich context for students to learn about the role that ordinary citizens, informal leaders, and public officials played in facilitating a reconciliation of a long-standing conflict (The Troubles), which still remains ever present. Despite public perception that Northern Ireland has moved forward from the Troubles, more walls have gone up since the peace agreement was signed, and there is still significant segregation between Protestants and Catholics. In addition to analyzing leadership and social change in the context of Ireland, students will simultaneously reflect on their own capacities for leadership and cultural competence, and the role that they might play in a social issue when they return to the US.",
    "prereq": []
  },
  {
    "uid": "817666",
    "code": "LEAD4482",
    "subject": "LEAD",
    "number": "4482",
    "honors": false,
    "writingIntensive": false,
    "name": "Ldrship/Social Change, Panama",
    "fullname": "Leadership and Social Change in Panama",
    "info": "On the surface, Isla Bastimentos is a beautiful island, located in a marine park near the Costa Rican border with picturesque beaches including Red Frog Beach.  But under the surface, there is a complex story.  Students will learn about leadership and social change by examining the local commitment to eco-tourism and biodiversity, indigenous communities that inhabit the island, local organizations started by ordinary individuals that are trying to fulfill community needs, and the real-life story of the journey to build the Red Frog Beach Resort.  In addition to analyzing leadership and social change in the context of Isla Bastimentos and Bocas Del Toro, Panama, students will simultaneously reflect on their own capacities for leadership and cultural competence, and the role that they might play in a social issue when they return to the U.S.",
    "prereq": []
  },
  {
    "uid": "818820",
    "code": "LEAD4483",
    "subject": "LEAD",
    "number": "4483",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership in South Africa",
    "fullname": "Leadership in South Africa: From Townships to Urban Centers",
    "info": "During pre-departure meetings and the first week in Cape Town, students will begin the journey of discovering the context of South Africa. Through readings, movies, anddiscussions about South Africa’s history and current events, as well as by visiting various significant sights and geographical points in the Cape Town area, students will gain a sense of understanding of where they are, why it is the way it is, and what they can look forward to for the remainder of the course. During the second week, students will live, volunteer, observe, and interact with the communities of Gugulethu and Mitchell’s Plain. During this process, there will be opportunity to deepen understanding and perspectives about the cultural context of South Africa while deepening our immersion in the community through volunteer projects, meaning dialogue with local community members, youth, and leaders, and through living with a local family for the week. During the final week in South Africa, students will return to the University of Cape Town area to live and learn about the many complex and noteworthy experiences that have been generated thus far in the experience. Significant amount of time and energy will begiven to creating meaningful conversation as a classroom community about all of the experiences in the course through the lens of leadership. Participants will leave with a deepening understanding of their own leadership lens from different cultural contexts.",
    "prereq": []
  },
  {
    "uid": "788958",
    "code": "LEAD4484",
    "subject": "LEAD",
    "number": "4484",
    "honors": false,
    "writingIntensive": false,
    "name": "Cross-Cultural Leadership Bali",
    "fullname": "Cross-Cultural Leadership Bali",
    "info": "This 4000-level study abroad course explores leadership development as related to global citizenship. It is designed for students who are interested in exploring topics and themes of leadership, globalization, and happiness in a different cultural context. Specifically, this course will take students to Bali, Indonesia, and utilize the history, sites, people, and agencies of Tabanan, Ubud, Sanur, and Denpasar to explore and learn about those communities as well as how culture affects leadership and the social constructs of happiness. Students will use their knowledge of leadership, particularly the notions of community, intercultural leadership, and social constructs of happiness to examine the current opportunities and challenges the Balinese face. Students will interact with local community leaders who are working to make change, as well as citizens in the community.In this course, students will:1.Understand the ways in which different cultural norms and values can change the manner in which leadership skills and initiatives are utilized to create change.2.Explore the role that particular social, environmental, and spiritual belief systems can play in the practice of community leadership.3.Gain knowledge about global issues in Bali and, more specifically, how different individuals can use their experiences, knowledge, and practice to make a difference.4.Continue personal development growth through awareness of the history of Bali, as well as the cultural context of Tabanan, Ubud, Bedulu, and Denpasar, its people, and its surrounding areas.5.Explore the intersections of culture and happiness in the Balinese context and contrast that with their own cultural understanding of happiness.",
    "prereq": []
  },
  {
    "uid": "826780",
    "code": "LEAD4487",
    "subject": "LEAD",
    "number": "4487",
    "honors": false,
    "writingIntensive": false,
    "name": "Feminist Leadership/Argentina",
    "fullname": "Feminist Leadership in Argentina Global Seminar",
    "info": "This 4000-level study abroad course is open to undergraduate students from all disciplines and will appeal to students with broad interest in women’s and gender equity, feminism, and leadership in a global context. Students will examine the past and current aspects of and trends in women's and gender rights in Argentina and compare approaches to feminism and leadership between Argentina and the United States. The course will adopt an intersectional framework (as described by legal scholar Kimberlé Crenshaw) and invite students to engage with an array of topics, including: body politics; reproductive justice; historical perspectives and current political involvement; anti-violence and anti-femicide movements; sex workers’ rights and advocacy; the experiences of indigenous women and women of color; and LGBTQIA+ activism. As a learning abroad seminar, students will learn about their level of intercultural competence using the support of The Developmental Model of Intercultural Sensitivity (DMIS) and Intercultural Development Inventory (IDI) as created by Dr. Milton Bennett (1986, 1993, 2004, 2013) as a framework to explain how people experience and engage cultural difference; students will also practice engaging with another culture in reflective, mindful, and justice-centered ways. We wish to emphasize that students of any/all gender identities are welcome to join us.Students in this course will:- Immerse themselves in Argentinian culture to better understand its role in shaping and impacting gender justice movements and approaches to leadership. - Think ethically about important challenges facing our society and world.- Reflect on a shared sense of responsibility required to build and maintain community and make meaningful social change by learning how ordinary citizens, informal leaders, community organizations, and public officials are engaged in feminist leadership and examine different leadership approaches/styles as well as diverse understandings of feminism.- Explore Argentinian concepts of feminism, gender equity, justice, and leadership through readings and lectures.- The arts and experiences in-country to various sites including the Evita Museum, the museum of the Grandmothers of the Disappeared, the offices of the federal Ministry of Women, Gender & Diversity, the Chinatown area of Buenos Aires, a local ranch, and more. - Examine feminism and gender equity through interdisciplinary Argentine and American lenses, developing new and expanded understandings of gender justice and intersectional feminist leadership.",
    "prereq": []
  },
  {
    "uid": "016755",
    "code": "LEAD4961W",
    "subject": "LEAD",
    "number": "4961",
    "honors": false,
    "writingIntensive": true,
    "name": "Leadership-Global Citizenship",
    "fullname": "Leadership for Global Citizenship",
    "info": "In this final, writing intensive capstone course, students pull together the threads of leadership theory and practice worked with over the course of the Leadership Minor. In addition, students gain experience working with diverse leaders from around the world, mapping political contexts, and planning their own global leadership path within their specific field.",
    "prereq": []
  },
  {
    "uid": "810098",
    "code": "LEAD4971",
    "subject": "LEAD",
    "number": "4971",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study, Ldrship Minor",
    "fullname": "Directed Study, Leadership Minor",
    "info": "Design/carry out study project under direction of leadership minor instructors/faculty.To apply, please create a contract here: https://goo.gl/forms/K8s9ZhrY6Vp5oRGf2Please note: The UMN's Credit policy can be found here: https://policy.umn.edu/education/studentwork. One credit represents, for the average University undergraduate student, three hours of academic work per week, averaged over the semester, in order to complete the work of the course to achieve an average grade. One credit equals 42 to 45 hours of work over the course of the semester (1 credit x 3 hours of work per week x 14 or 15 weeks in a semester equals 42 to 45 hours of academic work). Students should keep the above policy in mind while determining their project and the amount of credits for enrollment. The amount of enrolled credits also proportionally influences the amount of instructor contact hours/week.",
    "prereq": []
  },
  {
    "uid": "816611",
    "code": "LEAD4972",
    "subject": "LEAD",
    "number": "4972",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Rsrch, Ldrship Minor",
    "fullname": "Directed Research, Leadership Minor",
    "info": "Students complete individually arranged research project with Leadership Minor instructor. Contact Leadership Minor office for registration requirements.*Please note - The University of Minnesota's Credit policy can be found here: https://policy.umn.edu/education/studentwork. One credit represents, for the average University undergraduate student, three hours of academic work per week, averaged over the semester, in order to complete the work of the course to achieve an average grade. One credit equals 42 to 45 hours of work over the course of the semester (1 credit x 3 hours of work per week x 14 or 15 weeks in a semester equals 42 to 45 hours of academic work). Students should keep the above policy in mind while determining their project and the amount of credits for enrollment. The amount of enrolled credits also proportionally influences the amount of instructor contact hours/week.prereq: instr consentContract URL: https://goo.gl/forms/iw89wCSrPN30HbAz2",
    "prereq": []
  }
]