[
  {
    "uid": "010822",
    "code": "LGTT5101",
    "subject": "LGTT",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology & Language Teaching",
    "fullname": "Applications of Technology in Language Teaching",
    "info": "Explore uses of technology in language teaching;  theoretical background, demonstrations, and applications.",
    "prereq": []
  },
  {
    "uid": "017026",
    "code": "LGTT5110",
    "subject": "LGTT",
    "number": "5110",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech & Second Lang Classroom",
    "fullname": "Technology in the Second Language Classroom",
    "info": "Examine, evaluate, and use technology in language teaching. Theoretical background, demonstration, hands-on exploration.",
    "prereq": []
  },
  {
    "uid": "818897",
    "code": "LGTT5111",
    "subject": "LGTT",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "The Web for Language Learning",
    "fullname": "Using the Web for Communicative Language Learning",
    "info": "This is a fully online course that is intended for K­16 second language instructors who are looking for ways to increase their knowledge of web applications and ways to incorporate them into their second language curriculum to encourage student communication and collaboration. Participants can expect to learn effective ways to incorporate current web technology into their curriculum to promote written and spoken language comprehension and production, and interpersonal communication. The course will address lesson planning, implementation, and assessment issues related to using these tools in second language learning.",
    "prereq": []
  },
  {
    "uid": "016656",
    "code": "LGTT5611",
    "subject": "LGTT",
    "number": "5611",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech in Sec Lang Instruction",
    "fullname": "Technology in Second Language Instruction",
    "info": "Using audio, video, and computer technology in second language teaching/learning in classroom, independent study, and distance education environments.",
    "prereq": []
  },
  {
    "uid": "789462",
    "code": "LGTT5710",
    "subject": "LGTT",
    "number": "5710",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Language Teach & Tech",
    "fullname": "Special Topics in Language Teaching and Technology",
    "info": "Examine, evaluate, apply specific area of technology to K-higher education, second/foreign language teaching/learning in classroom, independent study, distance education environments.",
    "prereq": []
  },
  {
    "uid": "798394",
    "code": "LGTT5738",
    "subject": "LGTT",
    "number": "5738",
    "honors": false,
    "writingIntensive": false,
    "name": "Web-based Language Instruction",
    "fullname": "Web-based Second Language Instruction: Issues, Models, and Designs",
    "info": "Issues, models, and designs related to Web-based second language instruction in K-Higher Education settings.   Evaluating course Web sites. Pedagogical value of Web technology. Applying technology in creating course Web sites.",
    "prereq": []
  },
  {
    "uid": "826601",
    "code": "LGTT5993",
    "subject": "LGTT",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Individual reading/study, with guidance of a faculty member, on topics not covered in regular courses.Prerequisite-instructor consent, department consent.",
    "prereq": []
  },
  {
    "uid": "825707",
    "code": "LGTT8999",
    "subject": "LGTT",
    "number": "8999",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Teaching Methods",
    "fullname": "Advanced Teaching Methods: Integrating Language and Disciplinary Content",
    "info": "This course explores theoretical and practical approaches to cultivating students' advanced literacies in a second language through the integration of language proficiency development and the study of disciplinary content in upper-level literature, linguistics, and culture courses.Students must have passed FRIT 5999 or GSD 5103 or SPPT 5999 or have permission from the instructor in order to take this course.",
    "prereq": []
  }
]