[
  {
    "uid": "792587",
    "code": "MBA1",
    "subject": "MBA",
    "number": "1",
    "honors": false,
    "writingIntensive": false,
    "name": "MBA Business Careers Course",
    "fullname": "MBA Business Careers Workshop",
    "info": "Tools/information for career search, MBA marketplace. Prseenting a personal portfolio. Students engage in early career planning. Methods to focus, present oneself well, and interview competitively.",
    "prereq": []
  },
  {
    "uid": "792341",
    "code": "MBA2",
    "subject": "MBA",
    "number": "2",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Mgmt & Org Workshop",
    "fullname": "Strategic Management and Organization Workshop",
    "info": "This workshop series introduces 1st year MBA students to critical organizational behavior skills necessary to navigate through the first semester.  Given the emphasis on teamwork in the integrated core and the COMS computerizes business simulation, the workshops will focus on the structure and functioning of teams.  Specifically, the workshops are designed to anticipate the progression of stages in MBA teams and provide students with the skills necessary to effectively handle the challenges that arise at each stage of team development.  The workshops are designed as skill building sessions.  Students will be provided with a strong foundation in organizational behavior theory in each of the topics covered in the workshop.  Students will also be given a series of self-diagnostic inventories to illustrate how the theories apply to them and will engage in an experiential exercise and case discussion to practive applying their newly acquired skills.  Overall, the workshop series is designed to provide a more productive and enriching experience working in teams.",
    "prereq": []
  },
  {
    "uid": "015895",
    "code": "MBA5100",
    "subject": "MBA",
    "number": "5100",
    "honors": false,
    "writingIntensive": false,
    "name": "MBA Topics",
    "fullname": "MBA Topics",
    "info": "MBA Topics",
    "prereq": []
  },
  {
    "uid": "790838",
    "code": "MBA5120",
    "subject": "MBA",
    "number": "5120",
    "honors": false,
    "writingIntensive": false,
    "name": "Vienna Seminar",
    "fullname": "Vienna Seminar: Doing Business in Central and Eastern Europe",
    "info": "What corporations face Central/Eastern Europe. During spring term, student teams study business practices of corporations in newly emerging markets. For two weeks in May/June, students travel to Vienna to work on case study by multinational corporation. Students travel also to an Eastern Eurpoean city to present final recommendations to corporate partner. Taught by CSOM and Wirschaftsuniversitat Wien. Taught in English.",
    "prereq": []
  },
  {
    "uid": "790848",
    "code": "MBA5130",
    "subject": "MBA",
    "number": "5130",
    "honors": false,
    "writingIntensive": false,
    "name": "Lyon Summer Program",
    "fullname": "Lyon Summer Program",
    "info": "Comparative perspectives of international business environment from French, European, and U.S. points of view. Students travel to Geneva, Switzerland, to tour World Trade Organization and United Nations. They also visit several corporations in Lyon to study French business environment. Four-week program from mid-June to mid-July. Taught entirely in English.",
    "prereq": []
  },
  {
    "uid": "790849",
    "code": "MBA5140",
    "subject": "MBA",
    "number": "5140",
    "honors": false,
    "writingIntensive": false,
    "name": "Vienna Summer Program",
    "fullname": "Vienna Summer Program",
    "info": "Students from Eastern/Western Europe, North/South America and Asia study together with international group of professors. Challenges facing global business world. Students select three courses from list of electives. One course is in German language. Field trip to an Eastern European city. Several social activities introduce students to Austrian/Viennese culture. Four-week program during August. Taught in English.",
    "prereq": []
  },
  {
    "uid": "015894",
    "code": "MBA5200",
    "subject": "MBA",
    "number": "5200",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies for CPT",
    "fullname": "Directed Studies for Curricular Practical Training",
    "info": "CPT is work authorization which allows a student to work in a job directly related to the student's major area of study before degree completion. prereq: International student with approval from the Program Office",
    "prereq": []
  },
  {
    "uid": "015893",
    "code": "MBA5300",
    "subject": "MBA",
    "number": "5300",
    "honors": false,
    "writingIntensive": false,
    "name": "MBA Exchange",
    "fullname": "MBA Exchange",
    "info": "Study abroad program",
    "prereq": []
  },
  {
    "uid": "016835",
    "code": "MBA5400",
    "subject": "MBA",
    "number": "5400",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgr Comm, HR Prof",
    "fullname": "Managerial Communication for the HR Professional",
    "info": "Memo writing, oral presentations, and team communication required of the HR professional. Emphasizes hands-on, experiential learning, including videotaping.",
    "prereq": []
  },
  {
    "uid": "015892",
    "code": "MBA5500",
    "subject": "MBA",
    "number": "5500",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Mgrl Communication",
    "fullname": "Strategic Managerial Communication",
    "info": "Theories of persuasion, motivation, and credibility translated into communication strategies. Students practice communication skills for corporate workplace. Cooperative/accelerative learning techniques.",
    "prereq": []
  },
  {
    "uid": "790817",
    "code": "MBA5510",
    "subject": "MBA",
    "number": "5510",
    "honors": false,
    "writingIntensive": false,
    "name": "Persuasive Writing in Business",
    "fullname": "Persuasive Writing in Business",
    "info": "Writing to motivate/affect chanage. Form and content. Techniques of persuasion. Producing polished text. Writing with power.",
    "prereq": []
  },
  {
    "uid": "790818",
    "code": "MBA5520",
    "subject": "MBA",
    "number": "5520",
    "honors": false,
    "writingIntensive": false,
    "name": "Pers.Writing in Bus:Non-Native",
    "fullname": "Persuasive Writing in Business: Non-Native Speakers of English",
    "info": "Prepares non-native speakers of English for writing tasks in MBA program and in business settings. Emphasizes writing to motivate/affect change.  Form/content, techniques of persuasion. Producing polished text. Writing with power.",
    "prereq": []
  },
  {
    "uid": "790819",
    "code": "MBA5530",
    "subject": "MBA",
    "number": "5530",
    "honors": false,
    "writingIntensive": false,
    "name": "Strat, Skills for Mgrl Present",
    "fullname": "Strategies and Skills for Managerial Presentations",
    "info": "Delivering key messages with clarity/confidence, regardless of audience or setting. Maximizing impact as a speaker, seated/standing. Understanding personal communication style and audience and tailoring message accordingly. Handling questions/answers. Using audio/visual tools. Presenting as a team.",
    "prereq": []
  },
  {
    "uid": "791247",
    "code": "MBA5540",
    "subject": "MBA",
    "number": "5540",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgrl Presentations:Non-native",
    "fullname": "Strategies and Skills for Managerial Presentations: Non-native speakers of English",
    "info": "Prepares non-native speakers of English in delivering key messages with clarity/confidence, regardless of audience or setting. Maximizing impact as a speaker, seated/standing. Understanding personal communication style and audience. Tailoring message. Handling questions/answers. Using audio/visual tools. Presenting as a team.",
    "prereq": []
  },
  {
    "uid": "790820",
    "code": "MBA5590",
    "subject": "MBA",
    "number": "5590",
    "honors": false,
    "writingIntensive": false,
    "name": "Man Comm for HR Professionals",
    "fullname": "Managerial Communication for HR Professionals",
    "info": "Business writing, speaking, meeting management. Audience analysis, how different audiences process/perceive messages. Tailoring messages to audience. Memo writing, presentation speaking. Performance coaching, revisions, dress rehearsals. International communication, collaborative writing, communication ethics.",
    "prereq": []
  },
  {
    "uid": "790850",
    "code": "MBA6020",
    "subject": "MBA",
    "number": "6020",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Accounting",
    "fullname": "Financial Accounting for Full-Time MBA Students",
    "info": "Usefulness/limitations of financial statement information in evaluating a company's performance for credit, investment, or other purposes. How accounting issues/rules affect views/decisions. Accounting principles, how they are used to prepare financial statements.",
    "prereq": []
  },
  {
    "uid": "015811",
    "code": "MBA6031",
    "subject": "MBA",
    "number": "6031",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Acctg",
    "fullname": "Financial Accounting",
    "info": "Basic principles of financial accounting, involving the consecution/interpretation of corporate financial statements.prereq: MBA or Mgmt Sci MBA Student",
    "prereq": []
  },
  {
    "uid": "015812",
    "code": "MBA6035",
    "subject": "MBA",
    "number": "6035",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Acctg",
    "fullname": "Managerial Accounting",
    "info": "Cost systems introduced as potential sources of sustainable competitive advantage. Focuses on designing cost systems to provide manager with accurate, relevant, and timely information. prereq: 6030, 6230, MBA or Mgmt Sci MBA student",
    "prereq": {
      "and": [
        {
          "code": "MBA 6030",
          "subject": "MBA",
          "id": "6030"
        },
        {
          "code": "MBA 6230",
          "subject": "MBA",
          "id": "6230"
        }
      ]
    }
  },
  {
    "uid": "814917",
    "code": "MBA6108",
    "subject": "MBA",
    "number": "6108",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Self",
    "fullname": "Leading Self",
    "info": "Preparing for leadership journey of full-time MBA program through process of self-examination. Identifying personal leadership strengths/vulnerabilities via external multi-rater feedback and self-assessments. Introduction of leadership competencies. Creating customized leadership development plan.",
    "prereq": []
  },
  {
    "uid": "013508",
    "code": "MBA6111",
    "subject": "MBA",
    "number": "6111",
    "honors": false,
    "writingIntensive": false,
    "name": "Organizational Behavior",
    "fullname": "Organizational Behavior",
    "info": "Organizational behavior offers a framework for the systematic study of how people behave in organizational settings and involves individual, group, and organizational characteristics that affect people and their behavior at work. In this course we consider how individual workers respond to their job and organization (attitudes and motivation), interpersonal processes and how to make them more effective (decision making, conflict management, teamwork), and the role organizational culture in shaping individual and group behavior. Topics come together as we consider how to effectively lead organizational change.Prior to Fall 2022 the course number was MBA 6110.  Prior to Spring 2023 the course name was Leading Others. ",
    "prereq": []
  },
  {
    "uid": "814921",
    "code": "MBA6112",
    "subject": "MBA",
    "number": "6112",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Organizations",
    "fullname": "Leading Organizations",
    "info": "Leverage leadership journey of full-time MBA program through Enterprise experience. Course integrated with work of MBA Enterprise teams as they set vision and strategy, translate strategy for optimal team functioning, and execute strategy for clients. Exercises, assessments, role-playing, discussions.",
    "prereq": []
  },
  {
    "uid": "013927",
    "code": "MBA6121",
    "subject": "MBA",
    "number": "6121",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Analysis for Managers",
    "fullname": "Data Analysis and Statistics for Managers",
    "info": "Concepts/ principles of business statistics, data analysis, and presentation of results. Topics: exploratory data analysis and graphics, basic inferential procedures including estimation and hypothesis testing, correlation, bivariate and multiple regression analysis, forecasting and predictive modeling using regression, and introduction to the design of experiments. These methods are selected for their relevance to managerial decision making and problem solving.prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "015048",
    "code": "MBA6130",
    "subject": "MBA",
    "number": "6130",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Accounting",
    "fullname": "Financial Accounting",
    "info": "Basic principles of financial accounting, involving the consecution and interpretation of corporate financial statements.",
    "prereq": []
  },
  {
    "uid": "015049",
    "code": "MBA6141",
    "subject": "MBA",
    "number": "6141",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Economics",
    "fullname": "Managerial Economics",
    "info": "Introduction to some parts of microeconomics that are useful for managers, with attention to the circumstances that give rise to firm profitability. The first half of the course covers supply and demand, price elasticity, and market equilibrium. The second part of the course covers firms with differentiated products and market power, with particular focus on pricing models such as segmentation, bundling, and two part tariffs. Pricing models involve profit maximization and associated conceptual tools. The course touches on game theory and strategic interaction among small numbers of firms and ends with a discussion of market failure and the business opportunities that they sometimes create. The course also emphasizes links to other parts of the core business curriculum. The course makes extensive reference to statistical empirical examples.prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "803501",
    "code": "MBA6150",
    "subject": "MBA",
    "number": "6150",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Comm",
    "fullname": "Managerial Communications",
    "info": "Thinking strategically about communication. Writing/presentation skills. Communications best practices, guidelines from research/experience. Opportunity to practice/strengthen skills.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "014152",
    "code": "MBA6211",
    "subject": "MBA",
    "number": "6211",
    "honors": false,
    "writingIntensive": false,
    "name": "Marketing Management",
    "fullname": "Marketing Management",
    "info": "Management of the marketing function; understanding the basic foundational marketing concepts and skills in strategy development and planning of operational and strategic levels pertaining to product offering decisions, distribution channels, pricing and communication.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "015052",
    "code": "MBA6215",
    "subject": "MBA",
    "number": "6215",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Resource Mgmt",
    "fullname": "Human Resource Management",
    "info": "Explores the function of managing human resources in organizations. Emphasizes work design, acquiring, developing, compensating, and assessing the performance of employees. As part of an integrated functional core, attention focuses on the role of human resources in meeting business strategy goals and being responsive to changing legal and economic environments.",
    "prereq": []
  },
  {
    "uid": "013933",
    "code": "MBA6221",
    "subject": "MBA",
    "number": "6221",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain & Operations",
    "fullname": "Supply Chain & Operations",
    "info": "Supply chain and operations are at the core of how organizations deliver value to their customers. Effectively matching supply and demand is key to the success of any organization and world-class operations can lead to a significant and enduring competitive advantage. In contrast, poorly managed operations and supply chains can result in low customer satisfaction and diminished profit margins, ultimately leading to company failure in the long run. Beyond generating profits, companies around the world are also facing increasing pressure to perform well on the other two dimensions that constitute the ‘triple bottom line’, namely people and the planet. By taking an ‘end-to-end’ view, we will explore a variety of topics related to managing today’s global supply chains, including environmental and social responsibility. The specific questions this course will address include: How can supply chain and operations help firms succeed? What are the issues and trade-offs confronting supply chain and operations managers? What tools and frameworks can managers use to tackle these challenges and develop and sustain a competitive advantage? What are the emergent environmental and social responsibility challenges facing supply chain managers and how should they address them? Topics covered: operations strategy, process analysis, statistical process control, lean operations, forecasting, inventory management under certain demand, sourcing, environmental and social responsibility in supply chainsprereq: MBA student",
    "prereq": []
  },
  {
    "uid": "014582",
    "code": "MBA6225",
    "subject": "MBA",
    "number": "6225",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrated Info Mgt",
    "fullname": "Integrated Information Management",
    "info": "Use of IT/Is in organizations; development of an IT/IS project; management of the IS function in an organization. Basic approaches to data and information requirements; role of IT/IS in changing design of supply chain; historical trends in IT capability and implications.",
    "prereq": []
  },
  {
    "uid": "014054",
    "code": "MBA6231",
    "subject": "MBA",
    "number": "6231",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Management",
    "fullname": "Financial Management",
    "info": "This course is required for all MBA students because of the financial implications of decisions across all departments and disciplines in business.  Managerial decisions can be broken down into two main categories:  how to raise capital and how to employ capital.  The decisions managers make in this context can add or destroy value.  With this context in mind, the course provides students with an understanding of financial markets and the main types of securities that are issued by corporations.  The course will leverage basic statistics in understanding of risk of a security as a stand-alone investment and as part of a well-diversified portfolio to provide an understanding of how risk affects required returns of investors.  The course emphasizes the concept of time value of money as a basis for decision making.  Managers make decisions that affect the cash flows of the firm; the course provides students with a context for thinking about forecasting cash flows, discounting cash flows, and assessing whether the decisions they are considering are value-added for the firm.prereq: MBA 6031 (equiv. is also MBA 6030 before course number change in Fall 2022), MBA student",
    "prereq": [
      {
        "code": "MBA 6031",
        "subject": "MBA",
        "id": "6031"
      },
      {
        "code": "MBA 6030",
        "subject": "MBA",
        "id": "6030"
      }
    ]
  },
  {
    "uid": "015050",
    "code": "MBA6235",
    "subject": "MBA",
    "number": "6235",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Accounting",
    "fullname": "Managerial Accounting",
    "info": "Cost systems introduced as potential sources of sustainable competitive advantage. Course focuses on designing cost systems to provide manager with accurate, relevant, and timely information. Taught as part of an integrated functional core.prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "792055",
    "code": "MBA6241",
    "subject": "MBA",
    "number": "6241",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Data-Driven Digital Age",
    "fullname": "Competing in a Data-Driven Digital Age",
    "info": "Contemporary managers must understand how the convergence of mobility, analytics, social media, cloud computing, and AI are transforming firms, industries, markets, and society. This course provides tools and conceptual frameworks for competing in the digital age. Students will learn state-of-the-art skills in the context of digital disruption, platform based business models, Internet of Things, digital advertising, social networks, social media, big-data, and open innovation that pervade competition in the digital age. These will include the fundamentals of predictive modeling, large scale A/B testing, social networks analysis, and an exposure to the issues on the ethics and bias involved in AI applications. While this course will use case studies in the digital domain, the methods taught here have a wide range of applicability across functions and verticals in modern business environments.prereq: FT MBA, Mgmt Sci MBA or Online MBA student",
    "prereq": []
  },
  {
    "uid": "013506",
    "code": "MBA6301",
    "subject": "MBA",
    "number": "6301",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Mgmt",
    "fullname": "Strategic Management",
    "info": "This course focuses on the competitive strategy of the firm, examining how firms achieve and maintain superior profitability relative to their competitors in the long run, and the firm's role in building a more just and sustainable world. Starting from overall industry analysis, we cover how firms position themselves to succeed in various competitive contexts based on their resources and capabilities. We then analyze how firms innovate and adapt their capabilities over time, especially in the digital age. We extend our analysis to the scope choices of the firm and discuss how firms can successfully compete across multiple countries and businesses. Throughout the course, case discussions examine and simulate the process through which strategic decisions are made and carried out. Students are placed in the role of decision-makers and frequently asked to analyze the key choices they must make to define, reinforce, and successfully implement the firm's strategy.prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "013512",
    "code": "MBA6315",
    "subject": "MBA",
    "number": "6315",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Ethics",
    "fullname": "The Ethical Environment of Business",
    "info": "Understanding the ethical environment within which business and managers operate. Focus is on the ethical expectations surrounding organizational activities, firm responsibilities to shareholders and stakeholders, and providing a comprehensive framework for ethical decision-making by individuals. The goal of the class is two-fold. First, to help people in business find a voice and advance a point of view as they go forward with their career. Second, to prepare managers to successfully navigate and manage this critical component of a firm’s competitive environment. prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "816985",
    "code": "MBA6402",
    "subject": "MBA",
    "number": "6402",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology Industry",
    "fullname": "Technology Industry",
    "info": "This course focuses on firms engaged in three major sub areas of technology including e-commerce, defense, and manufacturing sub-sectors. Cases and live case studies to focus on firms ranging from 3M, Lockheed, Amazon, and Google. Federal agency oversight focus includes the Departments of Defense, Transportation, Commerce, and Education.",
    "prereq": []
  },
  {
    "uid": "816986",
    "code": "MBA6403",
    "subject": "MBA",
    "number": "6403",
    "honors": false,
    "writingIntensive": false,
    "name": "Energy Industry",
    "fullname": "Strategic Change in the Energy Industry",
    "info": "Throughout this two-semester program, students participate in coursework that teaches best practices, frameworks, and methodologies crucial for identifying and evaluating new ventures. In a teach-then-apply environment, students manage client based projects solving real-world problems in real time, whether helping an entrepreneur develop their new business or an established organization evaluate opportunities for growth. prereq: MBA or Mgmt Sci MBA student; program approval",
    "prereq": []
  },
  {
    "uid": "015954",
    "code": "MBA6500",
    "subject": "MBA",
    "number": "6500",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Consulting Proj",
    "fullname": "MBA Projects",
    "info": "Interdisciplinary team approach to formulation/execution of an actual business problem. Teams work on problems currently faced by business, nonprofit, and government organizations in the Twin Cities metropolitan area.prereq: MBA student, instr consent",
    "prereq": []
  },
  {
    "uid": "791458",
    "code": "MBA6501",
    "subject": "MBA",
    "number": "6501",
    "honors": false,
    "writingIntensive": false,
    "name": "Carlson Funds Enter: Growth",
    "fullname": "Carlson Funds Enterprise: Growth",
    "info": "Experiential Learning: students integrate finance skills by managing an institutional equity portfolio. Sustainable finance, financial modeling, portfolio management, and presentations to clients / investment professionals are all critical skills developed in this course. prereq: MBA or Mgmt Sci MBA student; program approval",
    "prereq": []
  },
  {
    "uid": "791459",
    "code": "MBA6502",
    "subject": "MBA",
    "number": "6502",
    "honors": false,
    "writingIntensive": false,
    "name": "Carlson Funds Enter: Fixed Inc",
    "fullname": "Carlson Funds Enterprise: Fixed Income",
    "info": "Experiential Learning: students integrate finance skills by managing an institutional bond portfolio. Sustainable finance, financial modeling, portfolio management, and presentations to clients / investment professionals are all critical skills developed in this course. prereq: MBA or Mgmt Sci MBA student; program approval",
    "prereq": []
  },
  {
    "uid": "791460",
    "code": "MBA6503",
    "subject": "MBA",
    "number": "6503",
    "honors": false,
    "writingIntensive": false,
    "name": "Carlson Ventures Enterprise",
    "fullname": "Carlson Ventures Enterprise",
    "info": "Carlson Ventures Enterprise (CVE) is intended for highly-motivated entrepreneurially minded graduate and undergraduate students who seek opportunities to develop creative problem solving and critical analysis skills to aid in better identifying, creating and evaluating any new business opportunity, whether a start-up, social venture, or innovation initiative inside a Fortune 500 company.CVE’s comprehensive curriculum includes the best practices, frameworks, and tools used in entrepreneurial and innovative pursuits. In a teach-then-apply environment, students manage client-based projects solving real-world problems in real time, whether helping an entrepreneur develop their new business or an established organization evaluate opportunities for growth. CVE fits with multiple degree plans, in multiple schools at the University, as either a requirement, an elective or a capstone. Registration for this course is by permission only.prereq: MBA or Mgmt Sci MBA student; program approval",
    "prereq": []
  },
  {
    "uid": "791461",
    "code": "MBA6504",
    "subject": "MBA",
    "number": "6504",
    "honors": false,
    "writingIntensive": false,
    "name": "Carlson Consulting Enterprise",
    "fullname": "Carlson Consulting Enterprise",
    "info": "Connects cutting-edge ideas/technologies from classroom to real problems presented by clients. Students work collaboratively with clients to integrate strategy/technology. How to lead complex change initiatives. prereq: MBA or Mgmt Sci MBA student; program approval",
    "prereq": []
  },
  {
    "uid": "798890",
    "code": "MBA6505",
    "subject": "MBA",
    "number": "6505",
    "honors": false,
    "writingIntensive": false,
    "name": "Carlson Brand Enterprise",
    "fullname": "Carlson Brand Enterprise",
    "info": "Students assist companies/organizations with marketing/brand challenges; apply theory, industry best practices. Work collaboratively in real-world environment. Critical thinking, applied marketing skills. prereq: MBA or Mgmt Sci MBA student; program approval",
    "prereq": []
  },
  {
    "uid": "015955",
    "code": "MBA6600",
    "subject": "MBA",
    "number": "6600",
    "honors": false,
    "writingIntensive": false,
    "name": "Top Mgmt Perspectives",
    "fullname": "Top Management Perspectives",
    "info": "Brings students face-to-face with leading executives an entrepreneurs from throughout the nation.  Values, attitudes, and skills for leadership.  How personal characteristics and beliefs of leaders shape situations.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "795242",
    "code": "MBA6990",
    "subject": "MBA",
    "number": "6990",
    "honors": false,
    "writingIntensive": false,
    "name": "MBA Topics",
    "fullname": "MBA Topics",
    "info": "Various topics.",
    "prereq": []
  },
  {
    "uid": "820479",
    "code": "MBA6999",
    "subject": "MBA",
    "number": "6999",
    "honors": false,
    "writingIntensive": false,
    "name": "FTMBA Internship",
    "fullname": "Full Time MBA Internship Course",
    "info": "The focus of this course is to prepare students for internship experience and to help summarize that experience as they look for full time positions post-MBA. The course will focus on preparation and reflection with the goal of helping each feel ready to apply MBA skills in a work setting whether that is working for an organization, starting a venture, or creating a project experience over the summer. Post-internship we will discuss how to communicate growth and learning over the summer in career marketing materials and communication. ",
    "prereq": []
  }
]