[
  {
    "uid": "816548",
    "code": "MDI5001",
    "subject": "MDI",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Technical Writing Essentials",
    "fullname": "Technical Writing Essentials",
    "info": "This course lays the groundwork for the Medical Device Innovation capstone as well as aspects of technical writing critical for success in the Medical Device Innovation MS program.prereq: grad MDI major",
    "prereq": []
  },
  {
    "uid": "811298",
    "code": "MDI5002",
    "subject": "MDI",
    "number": "5002",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech Foresight and Forecasting",
    "fullname": "Technology Foresight and Forecasting",
    "info": "Tools and techniques for technology forecasting, assessment, foresight for decision making in medical device industry. Topics include technology dynamics, research and development, portfolio management, and resource allocation.prereq: grad MDI major",
    "prereq": []
  },
  {
    "uid": "816549",
    "code": "MDI5003",
    "subject": "MDI",
    "number": "5003",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech Foresight Forecast Lab",
    "fullname": "Technology Foresight & Forecasting Analytical Lab",
    "info": "This course is a continuation of MDI 5002: Technology Foresight & Forecasting and will afford students with an opportunity to complete the therapeutic area analysis they began in the summer semester, prepare a Powerpoint presentation in consultation with the instructor, and then present the results of their analysis to a group of MDI faculty.prereq: grad MDI major",
    "prereq": []
  },
  {
    "uid": "811468",
    "code": "MDI5004",
    "subject": "MDI",
    "number": "5004",
    "honors": false,
    "writingIntensive": false,
    "name": "Clin Fndns of Med Device Innov",
    "fullname": "Clinical Foundations of Medical Device Innovation",
    "info": "Master essential topics to deepen knowledge of Clinical Environment in which products will be conceived, tested, used. Topics include surgical protocols, physician, surgeon, nursing, technical support functions. Medical terminology, anatomy/physiology, ethnology research, Healthcare Law, Medicare/Medicaid, HIPAA requirements.prereq: MDI grad student. Non-MDI graduate students and non-degree graduate students may register for this course with permission of the MDI program.",
    "prereq": []
  },
  {
    "uid": "812848",
    "code": "MDI5006",
    "subject": "MDI",
    "number": "5006",
    "honors": false,
    "writingIntensive": false,
    "name": "Finance, Valuation and Entr.",
    "fullname": "Finance, Valuation, and Entrepreneurship",
    "info": "Course provides students the opportunity to develop the entrepreneurial skills important in managing design, development, and commercialization of medical devices.  Focuses on creating value within the organization, financial methods important to managers in technology-based organizations, and business plan development.  Topics include budgeting capital, projecting financial needs, and managing working capital. Registration is limited to MDI students only.",
    "prereq": []
  },
  {
    "uid": "812849",
    "code": "MDI5008",
    "subject": "MDI",
    "number": "5008",
    "honors": false,
    "writingIntensive": false,
    "name": "Qlty, Regulatory, and Op. Mgmt",
    "fullname": "Quality, Regulatory, and Operations Management",
    "info": "MDI 5008 is built on understanding and applying the Total Product Life Cycle (TPLC) and Product Development Stage Gate methodologies as they relate to the global quality and regulatory environment in which the medical device industry operates. This is a practicum-based course using authentic FDA and ISO requirements to prepare the real-world documents and reports that are associated with the development of medical devices through to commercialization (pre-market to post-market) and includes key Operations Management principles that translate to delivering the product to market. The framework of the course and materials studied focus on effectively navigating the regulatory labyrinth to bring new and novel medical devices to market.",
    "prereq": []
  },
  {
    "uid": "811299",
    "code": "MDI5010",
    "subject": "MDI",
    "number": "5010",
    "honors": false,
    "writingIntensive": false,
    "name": "Product Innovation & Dev Mgmt",
    "fullname": "Product Innovation & Development Management",
    "info": "Framework for conceptualization, design, development, commercialization process for medical products. Survey of key steps in innovation, from engineering/business perspective. Cross-functional development of concepts/processes.prereq: Grad MDI student. Non-MDI graduate students and non-degree graduate students may register for this course with permission of the MDI program.",
    "prereq": []
  },
  {
    "uid": "811382",
    "code": "MDI5012",
    "subject": "MDI",
    "number": "5012",
    "honors": false,
    "writingIntensive": false,
    "name": "Med Industry Strat Analysis",
    "fullname": "Medical Industry Strategic Analysis",
    "info": "Application of macro environmental analysis to medical device industry. Methods reviewed. Industry-relevant case studies/macro environmental analysis of firms of interest. Political, economic, social, technological, legal, ecological factors that impact medical innovation.Prereq: MDI grad student. Non-MDI graduate students and non-degree graduate students may register for this course with permission of the MDI program.",
    "prereq": []
  },
  {
    "uid": "811300",
    "code": "MDI5013",
    "subject": "MDI",
    "number": "5013",
    "honors": false,
    "writingIntensive": false,
    "name": "Biodesign Practicum I",
    "fullname": "Biodesign Practicum I",
    "info": "First of three part series of practicum courses for MDI program. Focus on teaching innovation steps/process using known/pre-assigned clinical needs as examples in collaboration with Medical Device Center. Essential steps in BioDesign process. Apply knowledge to specific real-world examples.prereq: Grad MDI student",
    "prereq": []
  },
  {
    "uid": "811698",
    "code": "MDI5014",
    "subject": "MDI",
    "number": "5014",
    "honors": false,
    "writingIntensive": false,
    "name": "Biodesign Practicm II",
    "fullname": "Biodesign Practicum II",
    "info": "Second of three part series of practicum courses for MDI program. Clinical environment, including research tools/methods, filtering/translating needs, ideation/prototype development, communication with functional managers, corporate executives/investors.prereq: Grad MDI student",
    "prereq": []
  },
  {
    "uid": "813069",
    "code": "MDI5015",
    "subject": "MDI",
    "number": "5015",
    "honors": false,
    "writingIntensive": false,
    "name": "Biodesign Practicm III",
    "fullname": "Biodesign Practicum III",
    "info": "Medical Device Innovation Practicum III is the third of a three part series. Students will gain a high-level understanding of essential steps in the BioDesign process related to ideation. The steps of the ideation process will include brainstorming and prototyping of potential solutions, risk assessment, and business strategy development. Students will prepare and present a technical evaluation that articulates the value of their new technology or device to functional managers, corporate executives, and/or investors.prereq: Grad MDI student",
    "prereq": []
  },
  {
    "uid": "814253",
    "code": "MDI5020",
    "subject": "MDI",
    "number": "5020",
    "honors": false,
    "writingIntensive": false,
    "name": "MDI Capstone",
    "fullname": "Medical Device Innovation Capstone",
    "info": "The MDI capstone is an independent, original, and applied investigation on a relevant subject, problem, or issue in areas of medical device technologies, policy, business, and innovation. ",
    "prereq": []
  },
  {
    "uid": "811301",
    "code": "MDI5050",
    "subject": "MDI",
    "number": "5050",
    "honors": false,
    "writingIntensive": false,
    "name": "Intrpersnl &Team Effectiveness",
    "fullname": "Interpersonal & Team Effectiveness",
    "info": "MDI 5050 builds the context and capability innovation leaders need to manage effective interpersonal relationships and develop high performance teams. Emphasis is placed on foundational principles and practices that help leaders self-manage, engage and influence key stakeholders, and generate shared commitment for team and project success. Students will increase their self-awareness through self and peer feedback and develop an action plan to enhance their leadership effectiveness in both their current work role and their MDI practicum teams.prereq: Grad MDI student",
    "prereq": []
  },
  {
    "uid": "813896",
    "code": "MDI5051",
    "subject": "MDI",
    "number": "5051",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Innovation & Change",
    "fullname": "Leading Innovation & Change",
    "info": "MDI 5051 explores the role and differentiating capabilities of outstanding innovation leaders in complex and dynamic environments. Emphasis is placed on principles and practices that help leaders focus on the right strategies, build the organizational capability required to execute a strategy, lead change initiatives and sustain commitment versus compliance among diverse stakeholders. Students will practice improving their team effectiveness and develop a change leadership plan to support implementation of either a current work initiative or their upcoming Capstone Project.prereq: Grad MDI Student and completion of MDI 5050.",
    "prereq": {
      "code": "MDI 5050",
      "subject": "MDI",
      "id": "5050"
    }
  },
  {
    "uid": "817388",
    "code": "MDI5060",
    "subject": "MDI",
    "number": "5060",
    "honors": false,
    "writingIntensive": false,
    "name": "MDI Independent Study Course",
    "fullname": "MDI Independent Study",
    "info": "Independent study in MDI-related topic.prereq: MDI grad student",
    "prereq": []
  },
  {
    "uid": "826129",
    "code": "MDI5101",
    "subject": "MDI",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Med Dev Cybersecurity",
    "fullname": "Introduction to Medical Device Cybersecurity",
    "info": "The course will introduce the student to all the security-specific activities needed to meet regulatory and customer expectations across the medical device lifecycle.  Emphasis on security testing and post-market vulnerability management are essential goals of the course.  The intended audience is graduate students, upper-class undergraduate students, and working professionals.",
    "prereq": []
  }
]