[
  {
    "uid": "010374",
    "code": "MEDC5185",
    "subject": "MEDC",
    "number": "5185",
    "honors": false,
    "writingIntensive": false,
    "name": "Prin Biomolec Sim",
    "fullname": "Principles of Biomolecular Simulation",
    "info": "Molecular simulation for students in medicinal chemistry, pharmaceutics, biochemistry, and chemical physicsprereq: Chem 3502 or instr consent",
    "prereq": {
      "code": "CHEM 3502",
      "subject": "CHEM",
      "id": "3502"
    }
  },
  {
    "uid": "015513",
    "code": "MEDC5202",
    "subject": "MEDC",
    "number": "5202",
    "honors": false,
    "writingIntensive": false,
    "name": "Devel Process Pharmaceuticals",
    "fullname": "Research and Development Process of Pharmaceutical Products",
    "info": "New drug development process in the U.S. pharmaceutical industry",
    "prereq": []
  },
  {
    "uid": "789001",
    "code": "MEDC5245",
    "subject": "MEDC",
    "number": "5245",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Drug Design",
    "fullname": "Introduction to Drug Design",
    "info": "Concepts that govern design/discovery of drugs. Physical, bioorganic, medicinal chemical principles applied to explain rational design, mechanism of action drugs.prereq: Chem",
    "prereq": []
  },
  {
    "uid": "825368",
    "code": "MEDC5485",
    "subject": "MEDC",
    "number": "5485",
    "honors": false,
    "writingIntensive": false,
    "name": "DMPK",
    "fullname": "Drug Metabolism and Pharmacokinetics",
    "info": "Drug Metabolism and Pharmacokinetics is a stand-alone elective that is intended for Medicinal Chemistry graduate students or other students interested in the drug development process. Absorption and pharmacokinetic principles will be supplemented with problem sets. The primary method of instruction is lecture-based with the use of textbook readings and review articles as support for class notes and discussions. A total of 2 non-cumulative exams will be given during the semester. Prerequisites: Organic Chemistry, Med Chem 8001 (may be waived for students from other programs). This course adheres to the items listed in the College of Pharmacy Central Syllabus: https://docs.google.com/a/umn.edu/document/d/1artQ5e1rbzxe8lEtWo7BE8k8snZAEgMMz_QcW8yJ-II/edit?pli=1",
    "prereq": {
      "code": "CHEM 8001",
      "subject": "CHEM",
      "id": "8001"
    }
  },
  {
    "uid": "011124",
    "code": "MEDC5494",
    "subject": "MEDC",
    "number": "5494",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Meth Drug Analysis",
    "fullname": "Advanced Methods in Quantitative Drug Analysis",
    "info": "Quantitative methods (HPLC, GC, TLC, immunoassays) for analysis of drugs/metabolites in biological fluids. Advanced techniques such as capillary electrophoresis, supercritical fluid chromatography, GC-MS, LC-MS, tandem mass spectrometry. Chromatographic theory/statistical approaches to method validation.",
    "prereq": []
  },
  {
    "uid": "010381",
    "code": "MEDC5495",
    "subject": "MEDC",
    "number": "5495",
    "honors": false,
    "writingIntensive": false,
    "name": "Vistas Med Chem Res",
    "fullname": "Vistas in Medicinal Chemistry Research",
    "info": "Selected topics of contemporary interest in medicinal chemistry",
    "prereq": []
  },
  {
    "uid": "003705",
    "code": "MEDC5700",
    "subject": "MEDC",
    "number": "5700",
    "honors": false,
    "writingIntensive": false,
    "name": "Gen Prin Med Chem",
    "fullname": "General Principles of Medicinal Chemistry",
    "info": "Fundamental principles of molecular recognition, physicohemical properties of drugs, drug metabolism and disposition, interaction of molecules with DNA/RNA. ",
    "prereq": []
  },
  {
    "uid": "796307",
    "code": "MEDC5710",
    "subject": "MEDC",
    "number": "5710",
    "honors": false,
    "writingIntensive": false,
    "name": "Gen Prin Med Chem",
    "fullname": "General Principles of Medicinal Chemistry",
    "info": "Fundamental principles of enzyme inhibitors, combinatorial chemistry and library design, drug receptor interactions and signal transduction mechanisms, and molecular modeling.prereq: MedC grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "807576",
    "code": "MEDC8001",
    "subject": "MEDC",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Gen Prin Med Chem",
    "fullname": "General Principles of Medicinal Chemistry",
    "info": "Fundamental principles of molecular recognition, physiochemical properties of drugs, drug metabolism and disposition, interaction of molecules with DNA/RNA.prereq: Med chem grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "807829",
    "code": "MEDC8002",
    "subject": "MEDC",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Gen Prin Med Chem",
    "fullname": "General Principles of Medicinal Chemistry",
    "info": "Fundamental principles of molecular recognition, physicochemical properties of drugs, drug metabolism and disposition, interaction of molecules with DNA/RNA.prereq: Med chem grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "808900",
    "code": "MEDC8050",
    "subject": "MEDC",
    "number": "8050",
    "honors": false,
    "writingIntensive": false,
    "name": "PHYS AND MECH ORG CHEM",
    "fullname": "Physical and Mechanistic Organic Chemistry",
    "info": "Didactic instruction in foundational principles of physical and mechanistic organic chemistry. Recitation component in which students actively solve organic chemistry reaction mechanisms and related problems in organic and medicinal chemistry during course meeting times with faculty guidance.prereq: First-year Medicinal Chemistry grad students or by permission.",
    "prereq": []
  },
  {
    "uid": "816550",
    "code": "MEDC8070",
    "subject": "MEDC",
    "number": "8070",
    "honors": false,
    "writingIntensive": false,
    "name": "Chem & Bio Infectious Diseases",
    "fullname": "The Chemistry and Biology of Infectious Diseases",
    "info": "The objectives of this course are to provide a comprehensive overview of antimicrobial agents used in infectious diseases with an emphasis on the underlying foundational principles in chemistry and biology. Antibiotic, antifungal, and antiprotozoal agents will be covered. For each antimicrobial agent, the history, discovery, synthesis, structure-activity relationships, spectrum of activity, clinical uses, mechanism(s) of action, resistance, drug disposition properties, and adverse reactions will be discussed in great detail.",
    "prereq": []
  },
  {
    "uid": "003707",
    "code": "MEDC8100",
    "subject": "MEDC",
    "number": "8100",
    "honors": false,
    "writingIntensive": false,
    "name": "Med Chem Sem",
    "fullname": "Medicinal Chemistry Seminar",
    "info": "Current topics.prereq: Grad  major or instr consent",
    "prereq": []
  },
  {
    "uid": "788242",
    "code": "MEDC8333",
    "subject": "MEDC",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "825227",
    "code": "MEDC8396",
    "subject": "MEDC",
    "number": "8396",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac Training Med Chem",
    "fullname": "Practical Training in Medicinal Chemistry",
    "info": "Industrial or other external work experience involving medicinal chemistry and/or related disciplines. Reviewed/approved by faculty advisor and director of graduate studies. Grade based on report prepared by the student summarizing the completed work experience. ",
    "prereq": []
  },
  {
    "uid": "818285",
    "code": "MEDC8401",
    "subject": "MEDC",
    "number": "8401",
    "honors": false,
    "writingIntensive": false,
    "name": "Chemistry of Counterterrorism",
    "fullname": "Chemistry of Counterterrorism: Chemical, Biological, Radiological, Nuclear & High Explosive Threats",
    "info": "Students will acquire fundamental knowledge of the mechanisms of action, risks, and potential effects of the major CBRNE (chemical, biological, radiological, nuclear, and high explosive) agents that pose a threat in terrorist attacks. Students will also develop familiarity with current countermeasures (pre- and post-exposure) and relevant medical treatments, focusing on effectiveness, limitations, unmet needs, challenges, and roadblocks to countermeasure development.  Detection, protection, and decontamination techniques will also be discussed.This course is designed for scientists and engineers: graduate students in Medicinal Chemistry, Chemistry, Biochemistry, Chemical Engineering, Biomedical Engineering, or Physics.  Advanced undergraduates in the above programs, and professional students in PharmD, MD, MD/PhD, DVM, or MPH programs, who meet all required prerequisites, may enroll with the course director?s permission. Note that the emphasis of this course is on the chemistry, biology, and physics of CBRNE agents and their countermeasures, not policy, policymaking, or sociocultural issues (although these may come up for discussion).",
    "prereq": []
  },
  {
    "uid": "826826",
    "code": "MEDC8405",
    "subject": "MEDC",
    "number": "8405",
    "honors": false,
    "writingIntensive": false,
    "name": "Trnsltnl Exp in Drug Disc Dvlp",
    "fullname": "Translational Experience in Drug Discovery and Development (TED3)",
    "info": "To provide an overview and understanding of the process of drug discovery and exposure to the issues and challenges of drug discovery.  ",
    "prereq": []
  },
  {
    "uid": "806489",
    "code": "MEDC8413",
    "subject": "MEDC",
    "number": "8413",
    "honors": false,
    "writingIntensive": false,
    "name": "Nucleic Acids",
    "fullname": "Chemistry of Nucleic Acids",
    "info": "Chemical aspects of nucleic acid structure and function, synthesis, and functional variants.prereq: [Medicinal chem or chem or biochem] grad student",
    "prereq": []
  },
  {
    "uid": "807886",
    "code": "MEDC8420",
    "subject": "MEDC",
    "number": "8420",
    "honors": false,
    "writingIntensive": false,
    "name": "Nat Prod Chem",
    "fullname": "Natural Products Chemistry",
    "info": "Biosynthesis of natural products with an emphasis on how these biochemical principles can be used in drug discovery and design through metabolic engineering and combinatorial biosynthesis. Natural product isolation, structure determination, target identification, and the role of synthetic organic chemistry.prereq: [CHEM 8321, biochemistry] or equiv or course director approval",
    "prereq": {
      "code": "CHEM 8321",
      "subject": "CHEM",
      "id": "8321"
    }
  },
  {
    "uid": "813090",
    "code": "MEDC8435",
    "subject": "MEDC",
    "number": "8435",
    "honors": false,
    "writingIntensive": false,
    "name": "BioAssays",
    "fullname": "BioAssay & Data Analysis",
    "info": "Emphasis is an intro to bioassay & rodent experimental design approaches, data analysis & basic statistical analysis of corresponding data. Concepts of what instrumentation resources are available within the Department of Medicinal Chemistry & the Institute for Therapeutics Discovery & Development (ITDD), what the corresponding bioassays that can be measured on those resources, considerations & criteria for the development of a new bioassay, how to design basic rodent (mouse & rat) animal experiments including power-analysis (how to predict the number of animals needed for the experiment), as well as data analysis [mean, standard error of the mean (SEM), standard deviation of the mean (SD)] & statistical analysis [student t-test, one-way Anova, two-way Anova, & appropriate post-hoc tests).prereq: MEDC 8001 or instructor permission.",
    "prereq": {
      "code": "MEDC 8001",
      "subject": "MEDC",
      "id": "8001"
    }
  },
  {
    "uid": "788377",
    "code": "MEDC8444",
    "subject": "MEDC",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "815583",
    "code": "MEDC8461",
    "subject": "MEDC",
    "number": "8461",
    "honors": false,
    "writingIntensive": false,
    "name": "Design of Cancer Therapeutics",
    "fullname": "Design of Cancer Therapeutics",
    "info": "Cancer Drug Therapy is a relatively new field of medicine that has undergone many medical and societal changes over the course of the last 100 years and in particular the last 60 years. The emphasis in this course will be to familiarize the student with the basic concepts of cancer biology and to survey current advanced approaches for the development and design of small molecule, protein and cell based therapeutics for the treatment of cancer.",
    "prereq": []
  },
  {
    "uid": "808340",
    "code": "MEDC8471",
    "subject": "MEDC",
    "number": "8471",
    "honors": false,
    "writingIntensive": false,
    "name": "HIGH THRU DRUG DISC",
    "fullname": "High Throughput Drug Discovery",
    "info": "Combinatorial chemistry, multi-compound based technologies, their use in screening bioassays to discover lead compounds. Solidphase synthesis, designing compound libraries, pharmacological assay design, data interpretation, biological target selection, compound lead optimization.prereq: Undergraduate [chemistry or biochemistry] or instr consent",
    "prereq": []
  },
  {
    "uid": "010386",
    "code": "MEDC8500",
    "subject": "MEDC",
    "number": "8500",
    "honors": false,
    "writingIntensive": false,
    "name": "Des Chemother Agent",
    "fullname": "Design of Chemotherapeutic Agents",
    "info": "Modern aspects of designing chemotherapeutic agents. Strategies for enzyme inhibition and metabolic blocks in development of anticancer, antimicrobial, and antiviral agents.prereq: 5600 or instr consent",
    "prereq": {
      "code": "MEDC 5600",
      "subject": "MEDC",
      "id": "5600"
    }
  },
  {
    "uid": "010391",
    "code": "MEDC8600",
    "subject": "MEDC",
    "number": "8600",
    "honors": false,
    "writingIntensive": false,
    "name": "Drug Metabolism",
    "fullname": "Chemical Aspects of Drug Metabolism and Bioactivation",
    "info": "Chemical and enzymatic mechanisms of biotransformation and bioactivationof drugs and other xenobiotics. Reactivity and fate of bioactivatedmetabolites.prereq: 5600 or instr consent",
    "prereq": {
      "code": "MEDC 5600",
      "subject": "MEDC",
      "id": "5600"
    }
  },
  {
    "uid": "788499",
    "code": "MEDC8666",
    "subject": "MEDC",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbdprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "010393",
    "code": "MEDC8700",
    "subject": "MEDC",
    "number": "8700",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Con Drug Design",
    "fullname": "Advanced Concepts in Drug Design",
    "info": "Current approaches to rational design of drugs.prereq: 5600 or instr consent",
    "prereq": {
      "code": "MEDC 5600",
      "subject": "MEDC",
      "id": "5600"
    }
  },
  {
    "uid": "808341",
    "code": "MEDC8753",
    "subject": "MEDC",
    "number": "8753",
    "honors": false,
    "writingIntensive": false,
    "name": "Molecular Target DrugDiscovery",
    "fullname": "Molecular Targets of Drug Discovery",
    "info": "Structure of biological macromolecules that are targets of drugs. Techniques to accelerate directed drug discovery. Protein structure/interactions. Popular target classes. Computational tools for visualizing/analyzing protein-ligand and protein-protein interactions. Structural characterization at a level sufficient to underpin critical data evaluation. Biophysical techniques to assess weak ligand binding and suitable for fragment-based lead discovery.prereq: 5710 or 8002 or CHEM 5412 or structural biochemistry or instr consent",
    "prereq": {
      "or": [
        {
          "code": "MEDC 5710",
          "subject": "MEDC",
          "id": "5710"
        },
        {
          "code": "MEDC 8002",
          "subject": "MEDC",
          "id": "8002"
        },
        {
          "code": "CHEM 5412",
          "subject": "CHEM",
          "id": "5412"
        }
      ]
    }
  },
  {
    "uid": "010356",
    "code": "MEDC8760",
    "subject": "MEDC",
    "number": "8760",
    "honors": false,
    "writingIntensive": false,
    "name": "Des Peptidomimetics",
    "fullname": "Design of Peptidomimetics",
    "info": "Current approaches to design and synthesis of mimetics of biologically active peptides. Structural and conformational rationale used in peptidomimetic design.prereq: 5600 or instr consent",
    "prereq": {
      "code": "MEDC 5600",
      "subject": "MEDC",
      "id": "5600"
    }
  },
  {
    "uid": "788627",
    "code": "MEDC8777",
    "subject": "MEDC",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "010364",
    "code": "MEDC8800",
    "subject": "MEDC",
    "number": "8800",
    "honors": false,
    "writingIntensive": false,
    "name": "Med Chem Lab Tech",
    "fullname": "Medicinal Chemistry Laboratory Techniques",
    "info": "Experiential rotations in medicinal chemistry research laboratories.prereq: Grad med chem major or instr consent",
    "prereq": []
  },
  {
    "uid": "787894",
    "code": "MEDC8888",
    "subject": "MEDC",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "010367",
    "code": "MEDC8900",
    "subject": "MEDC",
    "number": "8900",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies in Med Chem",
    "fullname": "Directed Studies in Medicinal Chemistry",
    "info": "Directed Studies in Medicinal Chemistry facilitates advisor directed study in a special topic for credit, affording students the opportunity to acquire a level of expertise in a specific specialty of laboratory work or scholarship beyond that which can obtained in other didactic coursework. It is required that all students obtaining a Plan B Master of Science in Medicinal Chemistry (Plan B MS) complete at least one project in Directed Studies. Other graduate students with an interest in Medicinal Chemistry research are also eligible to enroll. The course may be taken more than once, and even concurrently. If taken concurrently, different research advisors must guide each project.  The course will be open for enrollment during all academic terms (Fall, Spring and Summer).Prior to enrollment, the student will work to identify a MedChem graduate faculty member to serve as project advisor, who will help the student outline project goals and expectations.  A short outline of the project should be presented to the Course Director for approval prior to enrollment.prereq: Grad med chem major or instr consent",
    "prereq": []
  }
]