[
  {
    "uid": "790343",
    "code": "MEST1001",
    "subject": "MEST",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Middle Ages: Intro",
    "fullname": "The Middle Ages: An Introduction to Medieval StudiesMiddle Ages: Intro",
    "info": "An introduction to the history, culture, literature, and architecture of the Middle Ages and to interdisciplinary methods of study.",
    "prereq": []
  },
  {
    "uid": "808473",
    "code": "MEST1002",
    "subject": "MEST",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Medieval Tales/Modern Echoes",
    "fullname": "Medieval Tales and their Modern Echoes",
    "info": "Knights of the Round Table, dragon-slayers, magic djinn, pilgrims in Hell. How these stories have been retold in modern fiction, film, and the arts. Texts from Europe and other regions of globe.  ",
    "prereq": []
  },
  {
    "uid": "817694",
    "code": "MEST1081W",
    "subject": "MEST",
    "number": "1081",
    "honors": false,
    "writingIntensive": true,
    "name": "World Christianity: 100-1400",
    "fullname": "Martyrs, Monks, Crusaders: World Christianity, 100-1400",
    "info": "This course surveys the history of Christianity from its status as a persecuted minority religion of the Roman Empire to its dominant role in medieval Europe and Byzantium. We study Christian traditions in Asia and Africa as well as Europe with special attention to the relationship between Christianity and culture in the ancient and medieval world.",
    "prereq": []
  },
  {
    "uid": "807791",
    "code": "MEST1200",
    "subject": "MEST",
    "number": "1200",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Medieval Studies",
    "fullname": "Topics in Medieval Studies",
    "info": "See course schedule for specific topic titles. ",
    "prereq": []
  },
  {
    "uid": "808526",
    "code": "MEST1905",
    "subject": "MEST",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "814067",
    "code": "MEST3001",
    "subject": "MEST",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Med Hist",
    "fullname": "Introduction to Medieval History",
    "info": "Europe from decline of Rome to early Renaissance. Politics, institutions, society, economy, and culture of Middle Ages.",
    "prereq": []
  },
  {
    "uid": "808474",
    "code": "MEST3002",
    "subject": "MEST",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Medieval Tales/Modern Echoes",
    "fullname": "Medieval Tales and their Modern Echoes",
    "info": "Knights of the Round Table, dragon-slayers, magic djinn, pilgrims in Hell.  How these stories have been retold in modern fiction, film, and the arts. Texts from Europe and other regions of globe.",
    "prereq": []
  },
  {
    "uid": "813639",
    "code": "MEST3009",
    "subject": "MEST",
    "number": "3009",
    "honors": false,
    "writingIntensive": false,
    "name": "Intersectional Medieval Art",
    "fullname": "Intersectional Medieval Art",
    "info": "Grounded in critical race theory, intersectionality, and queer theory, this class draws on primary texts and a range of visual and material sources to trace the histories, experiences, and representations of marginalized identities in the medieval world. We will consider gender, sexuality, and race in the context of Jewish, Christian, and Islamic cultures during the Middle Ages. This class will examine topics including transgender saints, miraculous transformations, demonic possession, female artists and patrons, the \"monstrous races\" of travel accounts, and gender-affirming surgeries. In contrast to misconceptions of a homogenous white European past, the reality of medieval Europe was diverse and complex, and its boundaries - geographical, cultural, bodily, and otherwise - were in flux, as reflected in its visual and material culture.",
    "prereq": []
  },
  {
    "uid": "820434",
    "code": "MEST3072",
    "subject": "MEST",
    "number": "3072",
    "honors": false,
    "writingIntensive": false,
    "name": "Witchcraft, Possession, Magic",
    "fullname": "Witchcraft, Possession, Magic: Concepts in the Atlantic Supernatural, 1500-1800",
    "info": "Salem is what typically comes to mind when we think of witchcraft, and our class will indeed focus on the 1692 trials and their aftermath. But we will also range more broadly, exploring witchcraft in the early Atlantic world by paying special attention to the roles played by magic and possession. A fundamental aspect of this course, moreover, is its distinction as a literary one. This is not a class about how witchcraft, possession, and magic \"change over time\" but a class about their representations. From the beginning, we will be deeply attentive to the fact that each and every \"evidence\" of witchcraft, possession, or magic is an act of representation in the first place. As literary historians, we will move from Europe to the Americas, looking at how invocations and accusations of witchcraft traveled between the 16th and late-18th centuries. More importantly, as literary critics we will trace and examine depictions of witchcraft and the idea of the witch across four interrelated socio-historical contexts: the Protestant Reformation in 16th-century Europe; slave medicine and obeah in the Caribbean; possession and the \"invisible world\" in Puritan Massachusetts; and revivalism in 18th-century New England. By the end of this course, you will be able to: interpret literary texts and understand the literary aspects of historical documents; place literature in relation to its historical and cultural contexts; locate and evaluate relevant scholarship and cultural commentary; and formulate and communicate a focused and stylistically appropriate that supports its claims with textual evidence, especially through close and critical reading.",
    "prereq": []
  },
  {
    "uid": "817695",
    "code": "MEST3081W",
    "subject": "MEST",
    "number": "3081",
    "honors": false,
    "writingIntensive": true,
    "name": "World Christianity: 100-1400",
    "fullname": "Martyrs, Monks, Crusaders: World Christianity, 100-1400",
    "info": "This course surveys the history of Christianity from its status as a persecuted minority religion of the Roman Empire to its dominant role in medieval Europe and Byzantium. We study Christian traditions in Asia and Africa as well as Europe with special attention to the relationship between Christianity and culture in the ancient and medieval world.",
    "prereq": []
  },
  {
    "uid": "816637",
    "code": "MEST3101",
    "subject": "MEST",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Knights and Pilgrims",
    "fullname": "Knights and Pilgrims in Medieval Literature",
    "info": "Medieval writers and readers were fascinated by stories about knights and about pilgrims.  In this course, we study some of the best-known and most compelling narratives and poems from the Middle Ages.  Although written hundreds of years ago, these literary works speak to us of the human desire to strive for meaning and excellence, to work toward shared ideas of community, and to explore worlds beyond the sometimes narrow confines of home.Knights and pilgrims appear as central figures in a wide range of literary works.  Some of the texts are humorous, like Chaucer's Canterbury Tales in which pilgrims, from social classes ranging from knights to tradespeople, travel together and tell stories.  Some are exciting and emotional, like Malory's retelling of stories about King Arthur and his knights.  Others provide us with explorations of longing for change:  in these works people search for new kinds of social and spiritual life such as Margery Kempe's autobiographical account of her experiences as a pilgrim to Rome and the Holy Land.  Still others, such as Langland's Piers Plowman, which incorporates pilgrimage and chivalric quest, critique and explode static ideas about social problems such as poverty and hunger.  Some draw our attention to the dangers and turmoil involved in love and relationships, such as Marie de France's courtly, aristocratic lays:  Marie's knights and ladies take up the search for love and meaning.  Some, finally, invite us to imagine ourselves in mysterious otherworlds, such as Mandeville's Travels and Sir Orfeo, both of which focus on travel and self knowledge.  These exciting and challenging works continue to speak to us about the quest to pursue ideals and to change the world and ourselves",
    "prereq": []
  },
  {
    "uid": "814238",
    "code": "MEST3102",
    "subject": "MEST",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Chaucer",
    "fullname": "Chaucer",
    "info": "Major/representative works written by Chaucer, including The Canterbury Tales, Troilus and Criseyde, and the dream visions. Historical, intellectual, and cultural background of the poems. Language, poetic theory, form.",
    "prereq": []
  },
  {
    "uid": "825104",
    "code": "MEST3206",
    "subject": "MEST",
    "number": "3206",
    "honors": false,
    "writingIntensive": false,
    "name": "Purity and Pollution",
    "fullname": "Sex, Murder, and Bodily Discharges: Purity and Pollution in the Ancient World",
    "info": "\"Dirt is dangerous,\" Mary Douglas declared more than 50 years ago in her groundbreaking study, \"Purity and Danger.\" Douglas's ideas have been influential in ancient Mediterranean and Near Eastern studies and provide a framework for us to analyze how people in antiquity conceptualized ideas of purity, pollution, ritual sacrifice, sacred spaces, bodily leakages, and the liminal stages of life and death. We'll delve into Douglas's theory in light of ancient examples with a special focus on ancient Israelite texts (the Tanakh or Old Testament) as well as ancient Mediterranean and Near Eastern building inscriptions, specialist manuals, and rituals. Through this evidence, we'll gain profound insight into the ancient notions of \"sacred/clean\" (purity) and the \"unclean/profane\" (pollution).",
    "prereq": []
  },
  {
    "uid": "825171",
    "code": "MEST3271",
    "subject": "MEST",
    "number": "3271",
    "honors": false,
    "writingIntensive": false,
    "name": "The Viking World",
    "fullname": "The Viking World: Story, History, and Archaeology",
    "info": "Viking society and expansion of Viking influence abroad. Viking impact on Western Europe; interactions with Slavic lands; settlement of North Atlantic islands; and Western Europe's impact on Scandinavian lands. Analyzes archaeological, historical, linguistic, and numismatic evidence.",
    "prereq": []
  },
  {
    "uid": "825174",
    "code": "MEST3426",
    "subject": "MEST",
    "number": "3426",
    "honors": false,
    "writingIntensive": false,
    "name": "Piracy in the Mediterranean",
    "fullname": "Piracy in the Mediterranean: The World of Merchants and Pirates",
    "info": "This course will use the vehicle of piracy and privateering in the Mediterranean world to explore issues of cross-cultural interaction, global connections, and identity from earliest times when people took to the sea to the Middle Ages through the early modern era, 500-1800. Wherever there was trade, wherever there was movement on the seas, there was piracy. Recent scholarship on the Mediterranean has focused on connectivities, micro-environments, the uniqueness of islands, and various climatic spheres in a geographic tradition that follows the path-breaking work of Fernand Braudel. This course will consider the urban and rural dimensions of the Mediterranean region as they relate to the history of merchants and pirates. Finally, the political and military aspects of Mediterranean history will be examined. There was a continuum from piracy to privateering to war. Students should gain a deeper understanding of a region that continues to fascinate us today.",
    "prereq": []
  },
  {
    "uid": "825173",
    "code": "MEST3502",
    "subject": "MEST",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Myths",
    "fullname": "Scandinavian Myths",
    "info": "Literary and cultural investigation of the popular beliefs, myths, and religion of the medieval Scandinavians; the interaction of paganism and Christianity; the reflection of myths in Old Scandinavian literature and art.  All readings in English.",
    "prereq": []
  },
  {
    "uid": "807919",
    "code": "MEST3600",
    "subject": "MEST",
    "number": "3600",
    "honors": false,
    "writingIntensive": false,
    "name": "The Renaissance",
    "fullname": "The Renaissance",
    "info": "Relationships between the visual arts, literature, science, philosophy, and politics in Europe from about 1300-1600. Works of artists, writers, and intellectuals (e.g., Michelangelo Buonarotti, Niccolo Machiavelli, Michel de Montaigne), different artistic and literary forms (e.g., portrait, sonnet, essay), and broad thematic issues that include the individual, antiquity, state, and discovery. Team taught.",
    "prereq": []
  },
  {
    "uid": "825192",
    "code": "MEST3606",
    "subject": "MEST",
    "number": "3606",
    "honors": false,
    "writingIntensive": false,
    "name": "Christians, Muslims, and Jews",
    "fullname": "Christians, Muslims, and Jews in the Middle Ages",
    "info": "A Pew Research survey of the global religious landscape in 2010 found 2.2 billion Christians (31.5% of the world's population), 1.6 billion Muslims (23.2%), and 14 million Jews (.2%). In this class, we explore how the histories of these religious communities became deeply entangled in an age of diplomacy, trade, jihad, and crusade.",
    "prereq": []
  },
  {
    "uid": "004097",
    "code": "MEST3610",
    "subject": "MEST",
    "number": "3610",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Medieval Studies",
    "fullname": "Topics in Medieval Studies",
    "info": "Fall of Rome through end of Middle Ages (ca. 300-1500 A.D.). Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "816337",
    "code": "MEST3611",
    "subject": "MEST",
    "number": "3611",
    "honors": false,
    "writingIntensive": false,
    "name": "Medieval Cities of Europe",
    "fullname": "Medieval Cities of Europe: 500-1500",
    "info": "European cities changed from Roman times through the urban nadir of the Early Middle Ages to the flowering of cities in the High and Late Middle Ages. We explore planned towns, ad hoc developments, revived Roman sites, and economic, political, cultural, and sensory elements of city life. Students design a medieval city using Arc.GIS and StoryMap. Contact the instructor for more information.",
    "prereq": []
  },
  {
    "uid": "814161",
    "code": "MEST3613",
    "subject": "MEST",
    "number": "3613",
    "honors": false,
    "writingIntensive": false,
    "name": "History of the Crusades",
    "fullname": "History of the Crusades",
    "info": "Crusading spirit in Europe. Results of classic medieval crusades ca 1095-1285. States established by crusaders in Near East. Internal European crusades. Chronological prolongation of crusading phenomenon.",
    "prereq": []
  },
  {
    "uid": "816264",
    "code": "MEST3616",
    "subject": "MEST",
    "number": "3616",
    "honors": false,
    "writingIntensive": false,
    "name": "The Hundred Years War",
    "fullname": "The Hundred Years War: France and England in the Middle Ages",
    "info": "Politics, society, and culture in medieval France from the end of the Carolingians to the end of the Hundred Years War.",
    "prereq": []
  },
  {
    "uid": "814002",
    "code": "MEST3617",
    "subject": "MEST",
    "number": "3617",
    "honors": false,
    "writingIntensive": false,
    "name": "Pagans, Christians, Barbarians",
    "fullname": "Pagans, Christians, Barbarians: The World of Late Antiquity",
    "info": "Between classical and medieval, pagan and Christian, Roman and barbarian, the late antique world was a dynamic age. Course focuses on the Mediterranean region from the 2nd to the mid-7th century exploring such topics as the conversion of Constantine, the fall of Rome, barbarian invasions, the spread of Christianity, and the rise of Islam.",
    "prereq": []
  },
  {
    "uid": "797540",
    "code": "MEST3993",
    "subject": "MEST",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies in Medieval Studies",
    "info": "Directed study with one of core faculty members of Medieval Studies program.prereq: Previous work in a medieval studies discipline, instr consent",
    "prereq": []
  },
  {
    "uid": "816478",
    "code": "MEST4043",
    "subject": "MEST",
    "number": "4043",
    "honors": false,
    "writingIntensive": false,
    "name": "Archaeology of Northern Europe",
    "fullname": "Romans, Anglo-Saxons and Vikings: Archaeology of Northern Europe",
    "info": "Archaeology of the British Isles, Scandinavia, and northern continental Europe, from the Romans through the Viking period. Themes to be examined include social and political organization, cross-cultural interactions, art and symbolism, and religion and rituals.",
    "prereq": []
  },
  {
    "uid": "013707",
    "code": "MEST4610",
    "subject": "MEST",
    "number": "4610",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Topics in Med. St",
    "fullname": "Intermediate Topics in Medieval Studies",
    "info": "Topics between fall of Roman Empire and end of Middle Ages (ca. 300-1500 A.D.). Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "814239",
    "code": "MEST4612",
    "subject": "MEST",
    "number": "4612",
    "honors": false,
    "writingIntensive": false,
    "name": "Old English I",
    "fullname": "Old English I",
    "info": "\"I am learning Anglo-Saxon and it is a vastly superior thing to what we have now\" (Gerard Manley Hopkins, letter to fellow poet Robert Bridges, 1882).  This course is an introduction to the rich language and literature of Anglo-Saxon England (ca. 500-1100).  \"Old English,\" or as it is sometimes known, \"Anglo-Saxon,\" is the earliest form of the English language; therefore, the primary course goal will be to acquire the ability to read Old English texts in the original.  No previous experience with Old English or any other language is necessary or expected; undergraduates and graduate students from all departments are welcome.  For graduate students in English, Old English I may count for the rhetoric/language/literacy distribution area. This course also fulfills the literary theory/linguistic requirement for the undergraduate English major. A knowledge of Old English will allow you to touch the most ancient literary sensibilities in the English tradition; these sensibilities are familiar and strange at the same time, as we sense our deep cultural connection to these texts across the centuries, yet also find that the past is a strange place indeed.  The power of Old English literature has profoundly influenced authors such as Tennyson, Pound, Graves, Wilbur, Hopkins, Gunn, Auden, Seamus Heaney, C.S. Lewis, and of course, J.R.R. Tolkien.",
    "prereq": []
  },
  {
    "uid": "815423",
    "code": "MEST4613",
    "subject": "MEST",
    "number": "4613",
    "honors": false,
    "writingIntensive": false,
    "name": "Old English II",
    "fullname": "Old English II",
    "info": "The second semester of Old English is devoted to a full translation and study of the great Anglo-Saxon epic \"Beowulf.\" J.R.R. Tolkien wrote of the poem that \"its maker was telling of things already old and weighted with regret, and he expended his art in making keen that touch upon the heart which sorrows have that are both poignant and remote.\" \"Beowulf\" is an exciting tale of strife and heroism; but it is also a subtle meditation upon the character of humanity as it struggles to understand the hazards of a harsh world, the inscrutability of fate, and the nature of history itself. \"Beowulf\" is not only important for a detailed understanding of Anglo-Saxon culture, but it is also a significant and moving poetic achievement in the context of world literature. We will read and translate the poem in the original Old English; thus ENGL 4612 (or a similar course resulting in a basic reading knowledge of Old English) is a prerequisite. \"Beowulf\" has been the object of intensive scholarly study; we will delve into the debates over the poem's date, genesis, manuscript and historical context and critical interpretation. Spending an entire semester studying one complex work can be an invaluable experience. Please contact the instructor for any questions concerning the prerequisite.",
    "prereq": []
  },
  {
    "uid": "825172",
    "code": "MEST5271",
    "subject": "MEST",
    "number": "5271",
    "honors": false,
    "writingIntensive": false,
    "name": "The Viking World",
    "fullname": "The Viking World: Story, History, and Archaeology",
    "info": "Viking society and expansion of Viking influence abroad. Viking impact on Western Europe, interactions with Slavic lands, settlement of North Atlantic islands, Western Europe's impact on Scandinavian lands. Analyzes archaeological, historical, linguistic, and numismatic evidence.",
    "prereq": []
  },
  {
    "uid": "004113",
    "code": "MEST5610",
    "subject": "MEST",
    "number": "5610",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Topics: Medieval Studies",
    "fullname": "Advanced Topics in Medieval Studies",
    "info": "From late antiquity through end of Middle Ages (circa 300-1500 A.D.). Topics specified in Class Schedule.prereq: One yr work in some area of Middle Ages, reading knowledge of appropriate language.",
    "prereq": []
  },
  {
    "uid": "825152",
    "code": "MEST5701",
    "subject": "MEST",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Old Norse Lang, Lit",
    "fullname": "Old Norse Language and Literature",
    "info": "Acquisition of a reading knowledge of Old Norse; linguistic, philological, and literary study of Old Norse language and literature.",
    "prereq": []
  },
  {
    "uid": "826835",
    "code": "MEST5774",
    "subject": "MEST",
    "number": "5774",
    "honors": false,
    "writingIntensive": false,
    "name": "The Body in Indian Art",
    "fullname": "The Body in Indian Art",
    "info": "This course explores the concept of embodiment and the nature of representation, from images of gods to human portraits, in Hindu, Jain, Buddhist, Muslim, and courtly contexts. We consider diverse media from ancient to modern periods, including painting, sculpture, photography, architecture, inscriptions, and literature. This course explores the concept of embodiment in the diverse artistic traditions of South Asia. We will consider how ideas of representation of an individual have been understood and expressed differently across the history of South Asian art and religions. The course will consider the embodied representation of deities and semi-divine figures along with those of “real” people; we will consider, given the ontologies of such representations in their religious and cultural contexts. Representation of an individual – a portrait – is a foundational subject in the canon of art history. What does the very idea of a portrait mean so far outside the canon of (Western) art history? As we survey the diverse traditions and media of images of the body, we will be attentive to questions such as, does media make meaning for these types of images? Can a ‘portrait’ be textual? Is verisimilitude essential to the depiction of a person? In what ways are practices of depiction informed by other modes of image-making, such as images of religious devotion, and traditions of representation encountered through trade or gift? We will consider diverse media from Ancient India to the modern period, including painting, stone and metal sculpture, photography, architecture, inscriptions, and even a Sanskrit play. ",
    "prereq": []
  },
  {
    "uid": "004112",
    "code": "MEST5993",
    "subject": "MEST",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies in Medieval Studies",
    "info": "Directed study with one of the core faculty of medieval studies program.prereq: One yr work in some area of Middle Ages, reading knowledge of appropriate language, instr consent",
    "prereq": []
  },
  {
    "uid": "004220",
    "code": "MEST8010",
    "subject": "MEST",
    "number": "8010",
    "honors": false,
    "writingIntensive": false,
    "name": "Colloq. Mediev Stud",
    "fullname": "Medieval Studies Colloquium",
    "info": "Lectures by and discussions with faculty and visiting speakers.",
    "prereq": []
  },
  {
    "uid": "004224",
    "code": "MEST8110",
    "subject": "MEST",
    "number": "8110",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Medieval Studies",
    "fullname": "Seminar in Medieval Studies",
    "info": "Offered when feasible.\n\nprereq: Appropriate languages",
    "prereq": []
  }
]