[
  {
    "uid": "789634",
    "code": "MGMT1350",
    "subject": "MGMT",
    "number": "1350",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Bs and Bs Careers",
    "fullname": "Introduction to Business and Business Careers",
    "info": "Organizations as systems, profit centers, and political communities. Current business issues, trends for the future. Concepts applied to other settings. Basic business processes, needs, contexts, problems.",
    "prereq": []
  },
  {
    "uid": "817104",
    "code": "MGMT1910W",
    "subject": "MGMT",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Social Media in a Risky World",
    "fullname": "When it Hits the Fan: Business, Crisis Communication, and Social Media in a Risky World",
    "info": "Effective crisis communication is increasingly important in a world of expanding technological dependence, sociopolitical instability, and daunting environmental challenges. Crises can be broadcast around the world in minutes via social media, creating negative headlines for months. In addition, complex, world-wide problems like climate change, religious fundamentalism, cyber security, health care, population growth, urbanization, and terrorism require effective communications to lessen the consequences of a crisis on an organization's activities, reputation, and stakeholders. We will examine a variety of current international and national case studies to examine what went wrong and consider how businesses can better prepare for, prevent, and respond to global crises.",
    "prereq": []
  },
  {
    "uid": "013478",
    "code": "MGMT2350",
    "subject": "MGMT",
    "number": "2350",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Bus and Bus Careers",
    "fullname": "Introduction to Business and Business Careers",
    "info": "Career exploration and self-development for students.  Introduction to functional areas of business and to issues related to the purpose of business.",
    "prereq": []
  },
  {
    "uid": "013133",
    "code": "MGMT3001",
    "subject": "MGMT",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Fund. of Mgmt",
    "fullname": "Fundamentals of Management",
    "info": "This course is about the foundational principles of management, encompassing disciplinary and topical boundaries. We will look at these principles from the perspective of how they guide action, specifically: planning, organizing, leading and controlling. By the end of the course, students will know the basics of how to set up organizations to be effective and innovative, and not just efficient. During the course, you will engage with the material in the course and understand how management frameworks can be used to choose the right internal structures and processes that can best react to your particular industry context and general business environment.",
    "prereq": []
  },
  {
    "uid": "801689",
    "code": "MGMT3004",
    "subject": "MGMT",
    "number": "3004",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Management",
    "fullname": "Strategic Management",
    "info": "Business strategy. How business firms set and pursue their goals. Key categories of strategic issues and concepts/frameworks managers use to analyze and address those issues. Attention to specific firms and situations.prereq: CSOM, soph or jr",
    "prereq": []
  },
  {
    "uid": "016489",
    "code": "MGMT3014",
    "subject": "MGMT",
    "number": "3014",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Int'l Bs, Gov, Soc",
    "fullname": "Topics in International Business, Government, and Society",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "794815",
    "code": "MGMT3015",
    "subject": "MGMT",
    "number": "3015",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Entrepreneurship",
    "fullname": "Introduction to Entrepreneurship",
    "info": "Fundamentals of entrepreneurship. Career paths, including new business start-ups, franchising, acquisitions (including family business succession), corporate venturing, and entre-preneurial services. Legal structures for new business formation. Aspects of business law/ethics.",
    "prereq": []
  },
  {
    "uid": "806257",
    "code": "MGMT3039",
    "subject": "MGMT",
    "number": "3039",
    "honors": false,
    "writingIntensive": false,
    "name": "Intercultural Bus Comm",
    "fullname": "Intercultural Business Communication",
    "info": "This course teaches students how to create culturally aware messages in business settings. Students will learn to recognize the cultural dimensions and communication patterns of various social identities that form at the intersection of nationality, religion, race, ethnicity, and gender. Through intercultural development assessments, case studies, simulations, business writing assignments, and discussions, students will: 1) reflect on their own cultural identities and worldview, 2) recognize how different cultural values can impact business success, and 3) engage in debates about the complex ethical, political, and social issues that arise from cross-cultural exchange.",
    "prereq": []
  },
  {
    "uid": "013993",
    "code": "MGMT3041",
    "subject": "MGMT",
    "number": "3041",
    "honors": false,
    "writingIntensive": false,
    "name": "Individual & the Organization",
    "fullname": "The Individual and the Organization",
    "info": "The purpose of this course is to understand both the impact and experience of the individual in an organizational setting. We will discuss the influence that individual differences and behaviors play within an organization, focusing on the employee as the key factor through which organizations function and grow. An employer’s success is largely attributable to the motivation and performance of those they employ. The factors that influence both their motivation and performance will be the focus of our content. We will explore topics such as personality, values, perceptions, and diversity among others. Each topic covered will enrich our understanding of the complex relationship between the individual and the organization. Recommended prerequisite: HRIR 3021. Prior, this course's designator was HRIR 3041.",
    "prereq": {
      "and": [
        {
          "code": "HRIR 3021",
          "subject": "HRIR",
          "id": "3021"
        },
        {
          "code": "HRIR 3041",
          "subject": "HRIR",
          "id": "3041"
        }
      ]
    }
  },
  {
    "uid": "014385",
    "code": "MGMT3042",
    "subject": "MGMT",
    "number": "3042",
    "honors": false,
    "writingIntensive": false,
    "name": "Org Behavior: Groups & Teams",
    "fullname": "Organizational Behavior: Groups and Teams",
    "info": "The purpose of this course is to understand both the impact and experience of the individual, leaders, and teams in an organizational setting. We will discuss the influence that individual differences and behaviors play within work teams, and how leadership may shape team experiences, focusing on the team as the key factor through which organizations function and grow. An employer’s success is largely attributable to the motivation and performance of those they employ. The factors that influence group, team, and organizational performance will be the focus of this class. We will explore topics such as communication, conflict, negotiation, leadership, organizational structure and change, among others. Each topic covered will enrich our understanding of the complex relationship between the individual, team, and the organization. Recommended prerequisite: HRIR 3021. Prior, the course's designator was: HRIR 3042.",
    "prereq": {
      "and": [
        {
          "code": "HRIR 3021",
          "subject": "HRIR",
          "id": "3021"
        },
        {
          "code": "HRIR 3042",
          "subject": "HRIR",
          "id": "3042"
        }
      ]
    }
  },
  {
    "uid": "014003",
    "code": "MGMT3045",
    "subject": "MGMT",
    "number": "3045",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Environment of Firms",
    "fullname": "Understanding the International Environment of Firms: International Business",
    "info": "Theories, frameworks, tools, and facts for understanding the environment of firms in international competition. Main world-level economic flows (trade, investment, finance). How country-/industry-level economic, political, and sociocultural factors influence behavior/functions of firms in international competition.\n\nprereq: MGMT 3001 or 3004",
    "prereq": {
      "or": [
        {
          "code": "MGMT 3001",
          "subject": "MGMT",
          "id": "3001"
        },
        {
          "code": "MGMT 3004",
          "subject": "MGMT",
          "id": "3004"
        }
      ]
    }
  },
  {
    "uid": "825551",
    "code": "MGMT3061",
    "subject": "MGMT",
    "number": "3061",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership in Practice",
    "fullname": "Leadership in Practice: Everyday Moments of Leadership",
    "info": "Every day, life gives us opportunities to practice leadership: experiencing group conflicts, recognizing the achievements of a classmate, overhearing an offensive joke, observing microaggressions, sharing innovative ideas with your team. In this course, you will learn how to investigate and respond to these moments of leadership using fundamental leadership science and frameworks based on leadership theory and empirical evidence. These moments provide an opportunity to become something, to do something different, usually through understanding complex issues, navigating change, empathy, and influencing others. The course will expose you to fundamental leadership science and frameworks backed by leadership theory and empirical evidence. You will focus on understanding personal leadership strengths and vulnerabilities through assessments, reflection, and feedback. To improve your leadership capabilities, you must know from what point you are starting. Throughout the class, there will be reflection exercises and assessments that will help you understand your values, default traits, and work styles as you navigate everyday moments of leadership.Leadership skills are best learned by integrating and applying evidence-based theoretical concepts to practical situations. These skills are difficult to meaningfully assess with exams and typical assignments. Thus, we will learn with practical exercises and the application of course materials to your life as a leader. The experiential learning of the class will allow you to navigate leadership moments and bring the course concepts to life. ",
    "prereq": []
  },
  {
    "uid": "016524",
    "code": "MGMT3070",
    "subject": "MGMT",
    "number": "3070",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Mgmt",
    "fullname": "Topics in Management",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "016497",
    "code": "MGMT3080",
    "subject": "MGMT",
    "number": "3080",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Ethics",
    "fullname": "Topics in Ethics",
    "info": "Topics vary with each offering.",
    "prereq": []
  },
  {
    "uid": "016498",
    "code": "MGMT3090",
    "subject": "MGMT",
    "number": "3090",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Leadership",
    "fullname": "Topics in Leadership",
    "info": "Topics Vary",
    "prereq": []
  },
  {
    "uid": "016615",
    "code": "MGMT3111",
    "subject": "MGMT",
    "number": "3111",
    "honors": false,
    "writingIntensive": false,
    "name": "Fundamentals of Mgmt",
    "fullname": "Fundamentals of Management",
    "info": "Introduction to organizational analysis/behavior. Structure/functioning of complex organizations. Leadership/management for establishing goals, policies, procedures, and plans. Motivation, culture, organizational design, group dynamics, performance appraisal, negotiation.",
    "prereq": []
  },
  {
    "uid": "798484",
    "code": "MGMT3480",
    "subject": "MGMT",
    "number": "3480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Natural Resources",
    "fullname": "Topics: Natural Resources",
    "info": "Individual topics related to natural resources.",
    "prereq": []
  },
  {
    "uid": "799141",
    "code": "MGMT3602",
    "subject": "MGMT",
    "number": "3602",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Environment Regulation",
    "fullname": "Topics: Environmental Regulations",
    "info": "Concepts/issues relating to industrial ecology and industry as they are influenced by current standards/regulations at local, state, and national levels.",
    "prereq": []
  },
  {
    "uid": "799142",
    "code": "MGMT3603",
    "subject": "MGMT",
    "number": "3603",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Environmental Issues",
    "fullname": "Topics: Environmental Issues",
    "info": "Concepts/issues relating to inventory, subsequent analysis of production systems. Production system from holistic point of view, using term commonly used in industrial ecology: \"metabolic system.\"prereq: [MATH 1142 or [MATH 1271, MATH 1272]], [APEC 1101 or ECON 1101 or 3261W]",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "MATH 1142",
              "subject": "MATH",
              "id": "1142"
            },
            {
              "and": [
                {
                  "code": "MATH 1271",
                  "subject": "MATH",
                  "id": "1271"
                },
                {
                  "code": "MATH 1272",
                  "subject": "MATH",
                  "id": "1272"
                }
              ]
            }
          ]
        },
        {
          "or": [
            {
              "code": "APEC 1101",
              "subject": "APEC",
              "id": "1101"
            },
            {
              "code": "ECON 1101",
              "subject": "ECON",
              "id": "1101"
            },
            {
              "code": "MGMT 3261W",
              "subject": "MGMT",
              "id": "3261W"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "799143",
    "code": "MGMT3604",
    "subject": "MGMT",
    "number": "3604",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Environmental Issues",
    "fullname": "Topics: Environmental Issues",
    "info": "Environmental problems such as climate change, ozone depletion, and loss of biodiversity.",
    "prereq": []
  },
  {
    "uid": "803442",
    "code": "MGMT4001",
    "subject": "MGMT",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Venturing in Action",
    "fullname": "Social Venturing in Action",
    "info": "Capstone course. Students choose projects with nonprofit organizations in local communities. Readings/discussions tie managerial theory to experiences. \n\nThe focus of this course is on sectors of the economy that provide goods and services with motivation beyond generating profits for investors. The non-profit sector and impact-related for-profit organizations are a large, growing, and increasingly entrepreneurial part of our economy. Non-profit administration and social entrepreneurship require knowledge of subjects unique to this sector. This class will provide a basis of knowledge about these issues from the standpoint of practitioners and researchers.\nBecause the landscape of the non-profit and impact-related for-profit world is broad, one seminar course cannot possibly cover all of the important and interesting issues in this field. In this course, we will focus our attention by exploring a number of issues that involve the intersection of the for-profit and the not-for- profit economies.\n\nprereq: Senior standing",
    "prereq": []
  },
  {
    "uid": "013532",
    "code": "MGMT4002",
    "subject": "MGMT",
    "number": "4002",
    "honors": false,
    "writingIntensive": false,
    "name": "Managerial Psych",
    "fullname": "Managerial Psychology",
    "info": "Behavioral principles, methods, and skills that underlie and compose dimensions of managerial competence and contribute to managers' effectiveness in preventing and solving problems within and between individuals and groups; development of human resource skills management needs based partially on experiential exercises.",
    "prereq": []
  },
  {
    "uid": "013240",
    "code": "MGMT4004W",
    "subject": "MGMT",
    "number": "4004",
    "honors": false,
    "writingIntensive": true,
    "name": "Bus Policy:Strategy",
    "fullname": "Business Policy: Strategy Formulation and Implementation",
    "info": "Integrative perspective on overall direction of the enterprise involving both choice of products and markets and selection of organization structures and management styles; case analysis involving the identification of key issues, evaluation of options, and making recommendations under conditions of uncertainty and incomplete information.prereq: 3040, 90 cr, completion of business core courses",
    "prereq": {
      "code": "MGMT 3040",
      "subject": "MGMT",
      "id": "3040"
    }
  },
  {
    "uid": "013536",
    "code": "MGMT4005",
    "subject": "MGMT",
    "number": "4005",
    "honors": false,
    "writingIntensive": false,
    "name": "Multinational Bus",
    "fullname": "Managing the Multinational Business",
    "info": "Structures/strategies of global business. Personnel, technology, and operations in host nations. Challenges unique to management of multinational firm. May include topics such as comparative culture, trade, and ethics.",
    "prereq": []
  },
  {
    "uid": "016117",
    "code": "MGMT4006",
    "subject": "MGMT",
    "number": "4006",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Bus Mgmt",
    "fullname": "Small Business  Management",
    "info": "Role of small business, alternative entry strategies, functional expertise required as a firm competes in it's environment.",
    "prereq": []
  },
  {
    "uid": "013530",
    "code": "MGMT4008",
    "subject": "MGMT",
    "number": "4008",
    "honors": false,
    "writingIntensive": false,
    "name": "EntrepreneurialMgmt",
    "fullname": "Entrepreneurial Management",
    "info": "Management of a new venture after founding. Internal/external challenges of managing a startup organization. Working with resource constraints and understanding how business models may change over time.\n\nprereq: MGMT 3015 or MGMT 3010 or IBUS 3010",
    "prereq": {
      "or": [
        {
          "code": "MGMT 3015",
          "subject": "MGMT",
          "id": "3015"
        },
        {
          "code": "MGMT 3010",
          "subject": "MGMT",
          "id": "3010"
        },
        {
          "code": "IBUS 3010",
          "subject": "IBUS",
          "id": "3010"
        }
      ]
    }
  },
  {
    "uid": "805874",
    "code": "MGMT4031",
    "subject": "MGMT",
    "number": "4031",
    "honors": false,
    "writingIntensive": false,
    "name": "Industry Analysis Global Cntxt",
    "fullname": "Industry Analysis in a Global Context",
    "info": "This course covers concepts and tools required to devise strategies that enable a global business to create superior value for customers and to capture a sufficient share of that value. It will offer perspectives on analyzing competitive situations and identifying and evaluating strategic options. In particular, it focuses on:\n- Applying fundamental concepts of strategic management--including strategy identification, the relationship of strategy and organization, industry analysis, competitor analysis, firm and industry evolution--coupled with economic theory and quantitative analysis to evaluate competitive strategies in a global context;\n- Developing an awareness of the impact of external environmental forces and of strategic actions by the firm and its rivals on business strategy.\n- Integrating knowledge gained in previous and concurrent core courses with a focus on understanding applying analytical concepts that are most useful to business analysts and managers. \n\nprereq: Mgmt 3004 ",
    "prereq": {
      "code": "MGMT 3004",
      "subject": "MGMT",
      "id": "3004"
    }
  },
  {
    "uid": "819196",
    "code": "MGMT4032",
    "subject": "MGMT",
    "number": "4032",
    "honors": false,
    "writingIntensive": false,
    "name": "Corporate Strategy",
    "fullname": "Corporate Strategy",
    "info": "This course examines issues of corporate strategy, i.e., issues associated with creating and managing a firm that operates in multiple businesses. Some of the key questions we shall seek to address through this course are:  \n\n• What are the drivers of corporate scope? How should a firm choose the activities/businesses it participates in?\n• What are the sources of value for a firm from being diversified across multiple businesses?\n• What are the challenges associated with managing across multiple businesses and markets?\n• How are these challenges best dealt with? What structures and processes enable successful corporate diversification over time?\n\nThe learning objective of this course is to help you learn to identify and define successful corporate strategies and offer solutions for the common problems that diversified firms face. The course not only introduces you to core concepts around corporate strategy, but it also seeks to develop your ability to critically evaluate the strategies of multi-business firms, through the extensive use of case discussions. \n\nprereq: Mgmt 3004",
    "prereq": {
      "code": "MGMT 3004",
      "subject": "MGMT",
      "id": "3004"
    }
  },
  {
    "uid": "819202",
    "code": "MGMT4033",
    "subject": "MGMT",
    "number": "4033",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategy Implementation",
    "fullname": "Strategy Implementation",
    "info": "This course focuses on implementing and executing strategy at both the organizational and functional level.  It will focus on the relationship between strategy formulation and execution, the systematic and structural problems with implementing strategy, and various methods to minimize these problems.  The course is designed both as a standalone topic and to deepen the student’s understanding of the other strategic concepts covered in the strategy minor.prereq: Mgmt 3004 or 3001.",
    "prereq": {
      "or": [
        {
          "code": "MGMT 3004",
          "subject": "MGMT",
          "id": "3004"
        },
        {
          "code": "MGMT 3001",
          "subject": "MGMT",
          "id": "3001"
        }
      ]
    }
  },
  {
    "uid": "819203",
    "code": "MGMT4034",
    "subject": "MGMT",
    "number": "4034",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology Strategy",
    "fullname": "Technology Strategy",
    "info": "This course addresses challenges and opportunities in the strategic management of technology and innovation. The course will equip students with the conceptual frameworks, tools, and language for analyzing and managing businesses in environments of technological change. We will examine how new technologies transform industries and create new markets, strategies for addressing technological change, and approaches for managers to shape and/or respond to new technologies. Because innovating or responding to new technologies often involves strategic and organizational change, we will also discuss how organizations change in response to new technologies.  We will use a combination of readings, lectures, case discussions, and simulations. The final team project provides an opportunity to explore in-depth the technology strategy and innovation challenges of a particular organization. The class is heavily discussion-based, which means that all students must read the material and be prepared to contribute to the learning process.prereq: Mgmt 3004 or 3001",
    "prereq": {
      "or": [
        {
          "code": "MGMT 3004",
          "subject": "MGMT",
          "id": "3004"
        },
        {
          "code": "MGMT 3001",
          "subject": "MGMT",
          "id": "3001"
        }
      ]
    }
  },
  {
    "uid": "819205",
    "code": "MGMT4035",
    "subject": "MGMT",
    "number": "4035",
    "honors": false,
    "writingIntensive": false,
    "name": "Mergers & Acquisition Strategy",
    "fullname": "Mergers & Acquisitions Strategy",
    "info": "This course focuses on the strategic use of mergers and acquisitions (M&A) as a means of new market entry and growth. It covers such questions as: when should one pursue an acquisition? What are the sources of value from an acquisition? What are the common challenges acquirers face? What should acquirers look for in a potential target? How should they integrate a target post-acquisition? It also considers the sell-side strategies for firms looking to exit businesses through divestiture.\n\nThe learning objective of this course is to help you learn to identify and define successful mergers and acquisitions, and offer solutions for the common problems that firms face when undertaking acquisitions. The course not only introduces you to core concepts around M&A, it also seeks to develop your ability to critically evaluate firms’ M&A choices, and to effectively communicate your assessment of these choices to a business audience. \n\nprereq: Mgmt 4032",
    "prereq": {
      "code": "MGMT 4032",
      "subject": "MGMT",
      "id": "4032"
    }
  },
  {
    "uid": "802453",
    "code": "MGMT4044",
    "subject": "MGMT",
    "number": "4044",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiation Strategies",
    "fullname": "Negotiation Strategies",
    "info": "This course is an introduction to the theory and practice of negotiation as the art and science of securing agreements between two or more interdependent parties seeking to maximize their own outcomes. The concepts you learn and the skills you develop in this class will apply to both your work and personal negotiations. At the heart of this class is the idea that the best way to learn to negotiate is by engaging in negotiation and then rigorously analyzing your experience. Therefore, this course is designed to be a highly interactive learning experience. The role of the course instructor is to help you get the most out of this experience by selecting relevant and compelling exercises and readings, as well as by facilitating engaging and meaningful discussion of class negotiations, negotiation research and best practices.",
    "prereq": []
  },
  {
    "uid": "013535",
    "code": "MGMT4055",
    "subject": "MGMT",
    "number": "4055",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Innovation & Change",
    "fullname": "Managing Innovation and Change In Action",
    "info": "This course focuses on how business organizations innovate and change. The course covers foundational topics and combines both theoretical insights and practical knowledge based on cases and hands-on exercises. The class topics address the following questions:\n\n·       What are the sources, types and patterns of innovation?\n\n·       What are the characteristics of an organization’s innovation ecosystem?\n\n·       How do organizations compete and collaborate in innovation ecosystems?\n\n·       What are some external forces shaping organizational innovations? \n\n·       How do organizations adapt to these external forces?\n\nBy the end of this course, students will:\n\nLearn the key principles of success and failure of innovation and change in business organizations across different products, services and geographies.\nApply course concepts to real organizational cases, diagnose problems and recommend solutions.\nUse clear written, verbal and online communication skills.\nCollaborate to create novel solutions to tasks and problems.\nDemonstrate the use of a wide range of qualitative and quantitative sources to support conclusions and recommendations.\n\nprereq: MGMT 3001 or MGMT 3004 or MGMT 3010 or MGMT 3015",
    "prereq": {
      "or": [
        {
          "code": "MGMT 3001",
          "subject": "MGMT",
          "id": "3001"
        },
        {
          "code": "MGMT 3004",
          "subject": "MGMT",
          "id": "3004"
        },
        {
          "code": "MGMT 3010",
          "subject": "MGMT",
          "id": "3010"
        },
        {
          "code": "MGMT 3015",
          "subject": "MGMT",
          "id": "3015"
        }
      ]
    }
  },
  {
    "uid": "802537",
    "code": "MGMT4060",
    "subject": "MGMT",
    "number": "4060",
    "honors": false,
    "writingIntensive": false,
    "name": "Entrepreneurial Perspectives",
    "fullname": "Entrepreneurial Perspectives",
    "info": "Students are paired in small groups with entrepreneur of a leading Minnesota businesses to write/present paper on the development of their business. Students analyze cases of five other participating entrepreneurs.",
    "prereq": []
  },
  {
    "uid": "802538",
    "code": "MGMT4080W",
    "subject": "MGMT",
    "number": "4080",
    "honors": false,
    "writingIntensive": true,
    "name": "Applied Technology Entre",
    "fullname": "Applied Technology Entrepreneurship",
    "info": "Team projects based on commercializable technologies or innovations. Teams present their ideas to investors and industry professionals. Students are encouraged to submit their business plans to Minnesota Cup.",
    "prereq": []
  },
  {
    "uid": "808217",
    "code": "MGMT4100",
    "subject": "MGMT",
    "number": "4100",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Management",
    "fullname": "Topics in Management",
    "info": "Topics vary for each offering.",
    "prereq": []
  },
  {
    "uid": "796308",
    "code": "MGMT4101",
    "subject": "MGMT",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Ind Study: Strat Mgmt & Org",
    "fullname": "Independent Study in Strategic Management and Organization",
    "info": "Students contract with faculty on independent studies.prereq: instr consent or dept consent",
    "prereq": []
  },
  {
    "uid": "802539",
    "code": "MGMT4171W",
    "subject": "MGMT",
    "number": "4171",
    "honors": false,
    "writingIntensive": true,
    "name": "Entrepreneurship in Action I",
    "fullname": "Entrepreneurship in Action I",
    "info": "Two-semester course. In fall, students identify a business oportunity, develop concept, determine resources required, and launch the business. In spring, students implement business plan, manage business, and determine exit strategy.prereq: 3010, [4008 or concurrent registration is required (or allowed) in 4008], completed coursework in business core, CSOM upper division, approved application",
    "prereq": {
      "and": [
        {
          "code": "MGMT 3010",
          "subject": "MGMT",
          "id": "3010"
        },
        {
          "code": "MGMT 4008",
          "subject": "MGMT",
          "id": "4008"
        }
      ]
    }
  },
  {
    "uid": "802540",
    "code": "MGMT4172",
    "subject": "MGMT",
    "number": "4172",
    "honors": false,
    "writingIntensive": false,
    "name": "Entrepreneurship in Action II",
    "fullname": "Entrepreneurship in Action II",
    "info": "Second of two-semester sequence. In fall, students identify business opportunity, develop concept, determine resources required, and launch business. In spring, students implement busienss plan, manage business, and determine exit strategy.prereq: 4171",
    "prereq": {
      "code": "MGMT 4171",
      "subject": "MGMT",
      "id": "4171"
    }
  },
  {
    "uid": "820315",
    "code": "MGMT4173",
    "subject": "MGMT",
    "number": "4173",
    "honors": false,
    "writingIntensive": false,
    "name": "New Venture Financing",
    "fullname": "New Venture Financing & Seed Stage Investing",
    "info": "This experiential course is offered to University undergraduate students interested in learning about new venture\nfinancing through the operation of an independent angel investment fund. It serves as an introduction to the subject\nmatter, while providing a forum for the students to review investment opportunities, connect with members from the\nentrepreneurial and investor communities, and learn about startup fundraising through direct participation in the\ninvestment process.\n\nThis course is being offered to complement a student-owned private venture capital fund in collaboration with\nindividual accredited investors, which was initially formed in April of 2018. In addition to the ongoing management of\nthe fund operations and reporting, the students will be responsible for ongoing capital raising. Final authority for all\ninvestment decisions rests with the students.",
    "prereq": []
  },
  {
    "uid": "802597",
    "code": "MGMT4175W",
    "subject": "MGMT",
    "number": "4175",
    "honors": false,
    "writingIntensive": true,
    "name": "New Business Feasibility",
    "fullname": "New Business Feasibility and Planning",
    "info": "The purpose of this course is to provide students with the following insights into • Techniques for developing and screening business ideas • Criteria for properly assessing idea feasibility • Equipping yourself with the necessary information and analysis to develop a useful business plan • Preparing an effective business plan • Effectively pitching the plan to stakeholders, primarily prospective investors The class makes use of lecture, videos, articles, cases, class exercises, assignments, and quizzes to help develop depth of understanding amongst students of the relevant subject matter of this course. \n\nprereq: MGMT 3010 or MGMT 3015 or IBUS 3010",
    "prereq": {
      "or": [
        {
          "code": "MGMT 3010",
          "subject": "MGMT",
          "id": "3010"
        },
        {
          "code": "MGMT 3015",
          "subject": "MGMT",
          "id": "3015"
        },
        {
          "code": "IBUS 3010",
          "subject": "IBUS",
          "id": "3010"
        }
      ]
    }
  },
  {
    "uid": "016499",
    "code": "MGMT4177",
    "subject": "MGMT",
    "number": "4177",
    "honors": false,
    "writingIntensive": false,
    "name": "The Business Plan",
    "fullname": "The Business Plan",
    "info": "Structure of business plans. Critically analyzing business plans. Formulating an original business plan.",
    "prereq": []
  },
  {
    "uid": "804192",
    "code": "MGMT4505",
    "subject": "MGMT",
    "number": "4505",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Int'l Business",
    "fullname": "Seminar in International Business",
    "info": "Globalization and technological developments of the digital age have created exciting new opportunities for managers who seek growth and profits by accessing resources and serving markets worldwide. At the same time, managing across cultures and nations in a world where foreign companies are not always viewed in a positive light, and where political realities often obstruct business opportunities, poses multiple challenges. This course will address the global context and then focus on the strategic and cultural challenges involved in managing activities across borders, in an increasingly interconnected world. It  will also draw on the students’  international experience (a semester abroad or a short term experience). Overall, as current challenges abound, they also provide an extremely rich context within which we can discuss the topics on our syllabus.prereq: CSOM jr or sr; strongly recommended completed international experience requirement; MGMT 3045 required only for IB majors/minors",
    "prereq": {
      "code": "MGMT 3045",
      "subject": "MGMT",
      "id": "3045"
    }
  },
  {
    "uid": "013534",
    "code": "MGMT5004",
    "subject": "MGMT",
    "number": "5004",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiations",
    "fullname": "Negotiations",
    "info": "Art and science of securing agreements between two or more parties who are interdependent and who are seeking to maximize their own outcomes; understanding individual, group, and organizational behavior in the context of these competitive situations; theory and process of negotiation applied to broad spectrum of problems faced by managers and professionals.",
    "prereq": []
  },
  {
    "uid": "818509",
    "code": "MGMT5018",
    "subject": "MGMT",
    "number": "5018",
    "honors": false,
    "writingIntensive": false,
    "name": "Philanthropy/Fundraising Strat",
    "fullname": "Philanthropy & Fundraising Strategy",
    "info": "This brief experiential course explores the evolving world of philanthropy and provides an opportunity to directly influence a real-life nonprofit’s funding strategies. It shows students how, despite resource constraints, nonprofit organizations can effectively build meaningful engagement and financial support around society’s most pressing needs. It provides an immersive experience – supported by a professional ecosystem – where students can learn, be inspired and leave this class more driven (and capable) to be “a force for good.”  By the end of this course, students will have gained hands-on consulting experience in partnership with nonprofit organizational leaders, active consultants and major philanthropists. They will have devised and presented implementable strategies at the “virtuous nexus” between potential donors and their client’s organizational needs - solutions which increase engagement and promote lasting symbiotic relationships between the private and nonprofit sectors. They will be well-positioned to make a significant positive impact throughout their careers in the Twin Cities and beyond.",
    "prereq": []
  },
  {
    "uid": "013522",
    "code": "MGMT5019",
    "subject": "MGMT",
    "number": "5019",
    "honors": false,
    "writingIntensive": false,
    "name": "Bus, Natural Enviro",
    "fullname": "Business, Natural Environment, and Global Economy",
    "info": "Resource deployment policies that affect the natural environment. Sustainability. Local/global environmental threats, how government policies address these issues. Business strategies/practices that produce \"win-win\" outcomes.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "013538",
    "code": "MGMT5101",
    "subject": "MGMT",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Topics",
    "fullname": "Advanced Topics",
    "info": "Specialized topics in management that vary and may include downsizing, ethics, trust, risk, alliances, organizational identity, organizational change, industry definition, team performance, organizational renewal, competitive advantage, hypercompetition, managing the knowledge worker, competence acquisition and preservation, and negotiation.",
    "prereq": []
  },
  {
    "uid": "816877",
    "code": "MGMT5102",
    "subject": "MGMT",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "StartUp: Customer Dev/Testing",
    "fullname": "StartUp: Customer Development and Testing",
    "info": "Provides a structured process with faculty and mentor oversight for students at any level and from any college at the University to learn the initial process of customer development by testing market acceptance of a specific new business concept. Students primarily take this course individually and must have an idea or technology that they are interested in pursuing. The goal of the curse is to teach the process to quickly and efficiently test the value and market fit for a new concept.",
    "prereq": []
  },
  {
    "uid": "014009",
    "code": "MGMT5175",
    "subject": "MGMT",
    "number": "5175",
    "honors": false,
    "writingIntensive": false,
    "name": "Emerging Global Markets",
    "fullname": "Managing in Newly Emerging Global Markets",
    "info": "Understanding the institutional and cultural environments in major new emerging markets. Focus is on two or three countries from emerging markets (such as China, India, Eastern Europe, Mexico, Brazil and others), the problems and opportunities provided by these environments, and how to do business in these countries.",
    "prereq": []
  },
  {
    "uid": "798647",
    "code": "MGMT5480",
    "subject": "MGMT",
    "number": "5480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Natural Resouces",
    "fullname": "Topics in Natural Resources",
    "info": "Specific topic for each offering.",
    "prereq": []
  },
  {
    "uid": "013521",
    "code": "MGMT6004",
    "subject": "MGMT",
    "number": "6004",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiation Strategies",
    "fullname": "Negotiation Strategies",
    "info": "At its core, negotiation is the art and science of getting what you want in a world of innumerable interests, possibilities, and standards of fairness---a world in which we must often compete or cooperate with others to do anything from picking a restaurant to transforming markets. The objective of this course is to equip students with a simple, ready-to-use framework from which we can prepare for and engage in negotiations. Topics include interest-based bargaining, psychological biases, multiparty negotiations, and hard tactics. Regular cases and exercises reinforce our negotiation framework and provide students a safe forum to thoughtfully reflect on their experiences and improve. prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "016272",
    "code": "MGMT6020",
    "subject": "MGMT",
    "number": "6020",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Formation",
    "fullname": "Business Formation",
    "info": "From concept development through startup. Concept, plan, forecast, budget. Resource markets/assembly. Cases, exercises, projects, guest speakers.",
    "prereq": []
  },
  {
    "uid": "015942",
    "code": "MGMT6021",
    "subject": "MGMT",
    "number": "6021",
    "honors": false,
    "writingIntensive": false,
    "name": "Preparing/Implementing Bs Plan",
    "fullname": "Preparing and Implementing the Business Plan",
    "info": "Students teams develop/implement business plans for business venture launch via startup or acquisition. Each team presents aspects of their business plan: \"elevator pitch,\" company mission, product/service value proposition, customer/market segmentation, competitive analysis, business strategy, marketing plan, financial projects. Students provide feedback on each other's plans.",
    "prereq": []
  },
  {
    "uid": "016617",
    "code": "MGMT6023",
    "subject": "MGMT",
    "number": "6023",
    "honors": false,
    "writingIntensive": false,
    "name": "Financing Business Ventures",
    "fullname": "Financing Business Ventures",
    "info": "How America's financing system works for all types of business ventures. Emphasizes financing of high-growth ventures. Translating a business plan into a financing plan. Developing alternative financing plans for a specific business/plan.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "016288",
    "code": "MGMT6030",
    "subject": "MGMT",
    "number": "6030",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Business Growth",
    "fullname": "Managing Business Growth",
    "info": "Opportunities/challenges of growing individual businesses, multi-business organizations. Elements/strategy for emerging/established businesses. Planning, implementing, auditing growth strategies. Attracting/deploying resources to fuel/facilitate growth. Models of business growth, factors affecting growth. Cases, exercises, group projects, guest speakers.",
    "prereq": []
  },
  {
    "uid": "013513",
    "code": "MGMT6031",
    "subject": "MGMT",
    "number": "6031",
    "honors": false,
    "writingIntensive": false,
    "name": "Industry Analysis",
    "fullname": "Industry Analysis and Competitive Strategy",
    "info": "Processes by which firms maximize long-term returns in face of competition, uncertainty, changing market/technological conditions. Resource commitments to gain sustainable advantage. Choices to leverage resources.prereq: MBA 6301 (previously MBA 6300), MBA student",
    "prereq": [
      {
        "code": "MBA 6301",
        "subject": "MBA",
        "id": "6301"
      },
      {
        "code": "MBA 6300",
        "subject": "MBA",
        "id": "6300"
      }
    ]
  },
  {
    "uid": "013519",
    "code": "MGMT6032",
    "subject": "MGMT",
    "number": "6032",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Alliances",
    "fullname": "Strategic Alliances",
    "info": "How inter-/intra-alliance rivalry influences global competitive landscape. How interplay of competitive/cooperative arrangements among firms invigorate intellectual/operational tasks. Designing/managing international strategy, organizational structure, and alliances. prereq: MBA or Mgmt Sci MBA studentt",
    "prereq": []
  },
  {
    "uid": "013514",
    "code": "MGMT6033",
    "subject": "MGMT",
    "number": "6033",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategy Implementation",
    "fullname": "Strategy Implementation",
    "info": "This course focuses on strategy execution at both the organizational and functional levels. Specific topics include the relationships between strategy formulation and execution, and between implementation and change. The course goes into depth on the systemic and structural problems that make most of these efforts difficult and often unsuccessful, along with various methods to minimize these problems. prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "790396",
    "code": "MGMT6034",
    "subject": "MGMT",
    "number": "6034",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Leadership",
    "fullname": "Strategic Leadership",
    "info": "Role of leadership in making strategy a reality while maintaining learning/adaptive organization capable of meeting competitive challenges. Students prepare project set in an organization. Advanced materials, complex cases.prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "790397",
    "code": "MGMT6035",
    "subject": "MGMT",
    "number": "6035",
    "honors": false,
    "writingIntensive": false,
    "name": "Complex, Cross-Cultural Negot",
    "fullname": "Complex and Cross-Cultural Negotiations",
    "info": "Principles, role play of multi-party/-issue, team-based negotiations/conflicts. How to structure ambiguous situations, bridge national/organizational cultures (e.g., alliances, mergers), functions (R&D, finance), and institutional contexts (regulators, interest groups).prereq: [MGMT 6004, MBA or Mgmt Sci MBA student] or instr consent",
    "prereq": {
      "code": "MGMT 6004",
      "subject": "MGMT",
      "id": "6004"
    }
  },
  {
    "uid": "013517",
    "code": "MGMT6041",
    "subject": "MGMT",
    "number": "6041",
    "honors": false,
    "writingIntensive": false,
    "name": "Competing Globally",
    "fullname": "Competing Globally",
    "info": "Dealing with enormous complexity in competitive environment, in strategy, and in organizations. Focuses on strategic/organizational issues in managing across borders.prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "790398",
    "code": "MGMT6051",
    "subject": "MGMT",
    "number": "6051",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Org Innovation",
    "fullname": "Managing Organizational Innovation and Change",
    "info": "How innovation typically unfolds in wide variety of new technologies, products, programs, and services. What paths are likely to lead to success/failure. Diagnostic skills/principles.prereq: Credit will not be granted if credit has been received for: : 5051; 6050",
    "prereq": [
      {
        "code": "MGMT 5051",
        "subject": "MGMT",
        "id": "5051"
      },
      {
        "code": "MGMT 6050",
        "subject": "MGMT",
        "id": "6050"
      }
    ]
  },
  {
    "uid": "013523",
    "code": "MGMT6055",
    "subject": "MGMT",
    "number": "6055",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt of Innovation",
    "fullname": "Management of Innovation and Change",
    "info": "How organizations innovate/change. Focuses on innovation in wide variety of new technologies, products, programs, and services. What paths likely to lead to success/failure.\n\nprereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "789439",
    "code": "MGMT6071",
    "subject": "MGMT",
    "number": "6071",
    "honors": false,
    "writingIntensive": false,
    "name": "Strat Mgmt of Tech Change",
    "fullname": "Strategic Management of Technological Change",
    "info": "This course addresses challenges and opportunities in the strategic management of technology. It will equip students with conceptual frameworks tools, and language for analyzing and managing businesses in environments of technological change. Students will understand how new technologies transform industries and create new markets, ways that firms shape and/or respond to technological evolution in industries, and the strategic decisions for managing technological change and creating and capturing value from new technologies. We will also consider the influences of factors outside the control of a particular firm, such as complementary markets or the organization of innovations in the broader technology developing community. Because innovation and responding to technological change involve changing organizations, we will also consider factors in leading and managing organizational change. The course uses a combination of readings, lectures, case discussions, exercises, and simulations, and includes cases and vignettes on situations of specific companies managing technology strategy. Anyone who wants to lead innovation or create and capture value from new technologies should take this course. We live in a world of constant technological change and disruption. An understanding of the patterns and processes of innovation and technological change will help students formulate and execute successful technology strategies.",
    "prereq": []
  },
  {
    "uid": "015930",
    "code": "MGMT6082",
    "subject": "MGMT",
    "number": "6082",
    "honors": false,
    "writingIntensive": false,
    "name": "New Business Dev",
    "fullname": "New Business Development",
    "info": "Understanding how to develop a new business; analyzing the opportunities and managing the constraints; structuring the venture, obtaining the resources, and writing the business plan; course covers main factors needed to start a successful business--the key operations, marketing, financial, legal, and competitive issues; topics covered are relevant to buyouts, franchises, and the family firm.",
    "prereq": []
  },
  {
    "uid": "015931",
    "code": "MGMT6083",
    "subject": "MGMT",
    "number": "6083",
    "honors": false,
    "writingIntensive": false,
    "name": "Consulting",
    "fullname": "Consulting",
    "info": "Management consulting. Engaging the client. Problem definition, proposal formulation. Establishing project schedules, work plans. Coordinating work. Writing reports, doing presentations. Evaluating the product. Professional learning, career development, balancing work/family. Field projects.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "015932",
    "code": "MGMT6084",
    "subject": "MGMT",
    "number": "6084",
    "honors": false,
    "writingIntensive": false,
    "name": "Management of Teams",
    "fullname": "Management of Teams",
    "info": "Factors that influence performance and well-being of groups in organizations. Group dynamics, norms, culture, structure, leadership, decision-making, and problem-solving. Managing dynamics, learning, performance, and creativity of groups. Intergroup relations, incentives, and effect of environment.",
    "prereq": []
  },
  {
    "uid": "015933",
    "code": "MGMT6085",
    "subject": "MGMT",
    "number": "6085",
    "honors": false,
    "writingIntensive": false,
    "name": "Corp Strategy",
    "fullname": "Corporate Strategy",
    "info": "Case for/against insourcing vs outsourcing, and corporate diversification. Managing a multi-business firm. Role of acquisitions/mergers in corporate diversification. Contrasting mergers with strategic alliances. Corporate restructuring and divestitures. prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "015934",
    "code": "MGMT6086",
    "subject": "MGMT",
    "number": "6086",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech and Strategy",
    "fullname": "Technology and Strategy",
    "info": "Limitations/strengths of various strategy models in different technology contexts. Innovation vs. imitation. Vertical/horizontal integration in high tech industries. Aligning technology strategy with business strategy. Renewing, sharing, leveraging corporate technology competencies across business units. Roles of CEO/CTO in technology intense businesses.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "790434",
    "code": "MGMT6100",
    "subject": "MGMT",
    "number": "6100",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics",
    "fullname": "Topics in Management",
    "info": "Topics vary.\n\nprereq: CSOM grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "796309",
    "code": "MGMT6101",
    "subject": "MGMT",
    "number": "6101",
    "honors": false,
    "writingIntensive": false,
    "name": "Ind Study: Strat Mgmt & Org",
    "fullname": "Independent Study in Strategic Management and Organization",
    "info": "Students contract with faculty on independent studies.prereq: instr consent or dept consent",
    "prereq": []
  },
  {
    "uid": "016390",
    "code": "MGMT6110",
    "subject": "MGMT",
    "number": "6110",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing People & Orgs",
    "fullname": "Managing People and Organizations",
    "info": "Behavioral science theory of employee behavior in organizations. Theory applied to practical situations. Motivation, cultural differences in management, ethical dilemmas, decision-making, leadership, timing.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "820164",
    "code": "MGMT6131",
    "subject": "MGMT",
    "number": "6131",
    "honors": false,
    "writingIntensive": false,
    "name": "Competitive Dynamics of Indust",
    "fullname": "Competitive Dynamics of Industries",
    "info": "This course offers perspectives on analyzing competitive situations and identifying and evaluating strategic options. In particular, the course focuses on applying fundamental concepts of strategic management—including competitor analysis, game theory, co-operation, network effects, firm and industry evolution—coupled with economic theory and quantitative analysis to evaluate competitive strategies; Developing an awareness of the impact of external environmental forces and of strategic actions buy the firm and its rivals on business strategy; Integrating knowledge gained in previous and concurrent core courses with a focus on understanding applying analytical concepts that are most useful to general managers.\nPrerequisites: MBA 6300; MBA student",
    "prereq": {
      "code": "MBA 6300",
      "subject": "MBA",
      "id": "6300"
    }
  },
  {
    "uid": "826376",
    "code": "MGMT6222",
    "subject": "MGMT",
    "number": "6222",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Diversity & Inclusion",
    "fullname": "Creating and Managing Diversity and Inclusion",
    "info": "This course covers the challenges and rewards associated with managing today’s increasingly diverse workforce. Diversity has the potential to benefit employees and organizations alike, yet the benefits of diversity are only realized in organizations with effective diversity management practices. In this course, we will discuss the power of inclusion as it relates to the employee experience. We will study effective strategies for building diverse and inclusive companies, and will address the barriers that can often exist. We will look at approaches to organizational design that limit unconscious bias and produce more objective decisions across the employee experience—from engaging and hiring candidates to retaining employees and helping them thrive. Finally, we will dive into how to create inclusive cultures and a sense of belonging, across local and global contexts. Student engagement and willingness to share diverse perspectives are critical to the success of this course.prereq: CSOM graduate students must register A-F",
    "prereq": []
  },
  {
    "uid": "013511",
    "code": "MGMT6305",
    "subject": "MGMT",
    "number": "6305",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Envrmt of Business",
    "fullname": "The International Environment of Business",
    "info": "Introduction to international trade/finance theory and political economy. Institutional governance of international trade/monetary policy, differences in political-economic/sociocultural systems, implications for managerial decision-making. prereq: MBA or Mgmt Sci MBA student",
    "prereq": []
  },
  {
    "uid": "816665",
    "code": "MGMT6311",
    "subject": "MGMT",
    "number": "6311",
    "honors": false,
    "writingIntensive": false,
    "name": "Cross-Cultural Management",
    "fullname": "Cross-Cultural Management: Developing Intercultural Compentence",
    "info": "The emphasis of this course is on people-related (i.e., psychological and behavioral) issues that arise when managing across cultures. Through the use of cases and interactive experiential activities, this course will develop your intellectual ability to critically examine, analyze, and deal with cross-cultural problems in business contexts, while also cultivating a tolerance for ambiguity that is necessary in the global workplace.The combination of materials and experiences will allow you to evaluate your cross-cultural savvy, understand and appreciate the nuances of cultural identities and the impact these have on work relationships, and create a plan to increase your intercultural competence.Prior to Spring 2023 course number was: MBA 6310.",
    "prereq": []
  },
  {
    "uid": "825874",
    "code": "MGMT6345",
    "subject": "MGMT",
    "number": "6345",
    "honors": false,
    "writingIntensive": false,
    "name": "Powerful Problem Solving",
    "fullname": "Powerful Problem Solving",
    "info": "One of the key distinguishing characteristics of effective leaders is the ability to parse through the overwhelming number of inputs we all receive to understand what needs to be done. “What problem are we trying to solve?” is a crucial question that too often goes unaddressed in the rush to “just fix it”.  Powerful Problem Solving will expose students to a clear problem-solving framework and process, a variety of perspectives on how to approach problems, as well as individual and group activities and assignments to inform and sharpen skills.",
    "prereq": []
  },
  {
    "uid": "801336",
    "code": "MGMT6402",
    "subject": "MGMT",
    "number": "6402",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Leadership",
    "fullname": "Integrative Leadership: Leading Across Sectors to Address Grand Challenges",
    "info": "Are you interested in working across government, business, and the non-profit sector for public good? Are you wondering how you can create sustainable shared leadership on challenges that can best be addressed together? This course explores multi-sector leadership and related governance and management challenges from a variety of perspectives and provides an opportunity for students to work together to apply what they are learning individually and in teams through in-class exercises and a final team project. The course is taught by a team of interdisciplinary faculty and considers different contexts, forms, and specific examples of multisector leadership that can enable transformative action to tackle a significant societal issue and achieve lasting change. Credit will be not be granted if credit has been received for GCC 5023, OLPD 6402, PUBH 6702, PA 5105, PA 5130, LAW 6623 prereq: Doctoral or master's student",
    "prereq": []
  },
  {
    "uid": "810054",
    "code": "MGMT6411",
    "subject": "MGMT",
    "number": "6411",
    "honors": false,
    "writingIntensive": false,
    "name": "Corporate Responsibility",
    "fullname": "Corporate Responsibility",
    "info": "Managing with appreciation for corporate responsibility. Corporate responsibility/how executives think about it. Factors that make assessing corporate responsibility complex. Need for business leaders to understand/make choices with respect to corporate responsibility issues.prereq: MBA 6301 (previously MBA 6300), CSOM grad student",
    "prereq": [
      {
        "code": "MBA 6301",
        "subject": "MBA",
        "id": "6301"
      },
      {
        "code": "MBA 6300",
        "subject": "MBA",
        "id": "6300"
      }
    ]
  },
  {
    "uid": "826377",
    "code": "MGMT6443",
    "subject": "MGMT",
    "number": "6443",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Coaching",
    "fullname": "Principles of Effective Coaching",
    "info": "Skills/competencies required to coach, mentor, develop employees/leaders. Managing coaching process. Planning coaching relationship. Coaching as leadership development strategy. Coaching executives.prereq: CSOM graduate students must register A-F",
    "prereq": []
  },
  {
    "uid": "826378",
    "code": "MGMT6444",
    "subject": "MGMT",
    "number": "6444",
    "honors": false,
    "writingIntensive": false,
    "name": "Emp Engagement & Wellbeing",
    "fullname": "Employee Engagement and Wellbeing",
    "info": "Employee motivation, behavior, job attitudes. How they can be channeled into productive/unproductive behaviors/employee well-being. How work behavior is influenced by individuals, groups, features of organizations.prereq: CSOM graduate student or dept consent",
    "prereq": []
  },
  {
    "uid": "803460",
    "code": "MGMT6465",
    "subject": "MGMT",
    "number": "6465",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership & Personal Dev",
    "fullname": "Leadership and Personal Development",
    "info": "Understanding effective leadership. Identifying personal leadership strengths/vulnerabilities through feedback. Developing leadership skills through practice as informed by theory/evidence. Exercises, role play. Creating customized leadership development plan.prereq: CSOM Grad student or dept consent",
    "prereq": []
  },
  {
    "uid": "004451",
    "code": "MGMT8101",
    "subject": "MGMT",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD Seminar: Theory Building",
    "fullname": "PhD Seminar: Theory Building",
    "info": "Problem formulation, conceptual modeling, and theory building, in the social and behavioral sciences.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "819979",
    "code": "MGMT8102",
    "subject": "MGMT",
    "number": "8102",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Methods I",
    "fullname": "Research Methods I - Applied Empirical Methods",
    "info": "This is a course in applied empirical methods, focusing on approaches to causal inference commonly used in strategic management and entrepreneurship research, as well as other research design and execution issues.  We will discuss issues of the validity of independent and dependent measures, econometric approaches to implementing various designs.  We will study these methods by reading and discussing empirical papers in strategy and entrepreneurship and by working with data in problem sets.",
    "prereq": []
  },
  {
    "uid": "820001",
    "code": "MGMT8104",
    "subject": "MGMT",
    "number": "8104",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD Seminar: Research Design",
    "fullname": "PhD Seminar: Research Design",
    "info": "Problem formulation, conceptual modeling, and research design in the social and behavioral sciences.",
    "prereq": []
  },
  {
    "uid": "004452",
    "code": "MGMT8201",
    "subject": "MGMT",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations of BGS",
    "fullname": "Foundations of Business, Government, and Society",
    "info": "Considers works in political and legal philosophy, ethics, and economics.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004458",
    "code": "MGMT8202",
    "subject": "MGMT",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "International Management",
    "fullname": "Seminar in International Management",
    "info": "Overview of the field of international management research.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004455",
    "code": "MGMT8203",
    "subject": "MGMT",
    "number": "8203",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'Mgmt/BGS Sem.",
    "fullname": "International Management/Business, Government, and Society Seminar",
    "info": "Topics vary yearly.",
    "prereq": []
  },
  {
    "uid": "792493",
    "code": "MGMT8204",
    "subject": "MGMT",
    "number": "8204",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in BGS - I",
    "fullname": "Topics in BGS - I",
    "info": "Topics vary.prereq: PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "792494",
    "code": "MGMT8205",
    "subject": "MGMT",
    "number": "8205",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in BGS - II",
    "fullname": "Topics in Business, Government, and Society II",
    "info": "Topics vary.prereq: PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004453",
    "code": "MGMT8301",
    "subject": "MGMT",
    "number": "8301",
    "honors": false,
    "writingIntensive": false,
    "name": "Org. Behavior Sem.",
    "fullname": "Seminar in Organizational Behavior",
    "info": "Major theories and current research on individual behavior and group processes in organizations from a micro perspective.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004459",
    "code": "MGMT8302",
    "subject": "MGMT",
    "number": "8302",
    "honors": false,
    "writingIntensive": false,
    "name": "Organizational Theory",
    "fullname": "Seminar in Organizational Theory",
    "info": "Major theories and current research on organizational and interorganizational topics from a macro perspective.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004456",
    "code": "MGMT8303",
    "subject": "MGMT",
    "number": "8303",
    "honors": false,
    "writingIntensive": false,
    "name": "Org. Seminar",
    "fullname": "Organizations Seminar",
    "info": "Topics vary yearly.",
    "prereq": []
  },
  {
    "uid": "792495",
    "code": "MGMT8304",
    "subject": "MGMT",
    "number": "8304",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Organizations - I",
    "fullname": "Topics in Organizations I",
    "info": "Topics vary.prereq: PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "792496",
    "code": "MGMT8305",
    "subject": "MGMT",
    "number": "8305",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Organizaitons - II",
    "fullname": "Topics in Organizations II",
    "info": "Topics vary.prereq: PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004454",
    "code": "MGMT8401",
    "subject": "MGMT",
    "number": "8401",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategy I",
    "fullname": "Strategy I",
    "info": "Review of research in strategy.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004460",
    "code": "MGMT8402",
    "subject": "MGMT",
    "number": "8402",
    "honors": false,
    "writingIntensive": false,
    "name": "Behavioral Strategy",
    "fullname": "Seminar in Behavioral Strategy",
    "info": "Designed to help doctoral students interpret and conduct research on strategic management. Will focus on research that reflects a behavioral approach to strategy.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004457",
    "code": "MGMT8403",
    "subject": "MGMT",
    "number": "8403",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategy II",
    "fullname": "Strategy II",
    "info": "This is the second strategy core course for Business admin PhD students in Strategic Management and Entrepreneurship. It will focus on both strategy content and process.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "792497",
    "code": "MGMT8404",
    "subject": "MGMT",
    "number": "8404",
    "honors": false,
    "writingIntensive": false,
    "name": "Non-Market Strategy",
    "fullname": "Seminar in Non-Market Strateg",
    "info": "This is a Ph.D. seminar in the field of nonmarket strategy, i.e., the strategies by which firms alter, influence, or adapt to their existing institutional environment in order to gain competitive advantage. Drawing on foundations in both institutional economics and institutional theory, the seminar examines a body of recent research in the field of strategic management that studies how and to what effect firms engage with political, legal, and social stakeholders. While the primary focus of the course is on the antecedents and consequences of such nonmarket strategies for firms, we shall also consider the impact of these strategies on social welfare, and the resulting implications for public policy. prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "792498",
    "code": "MGMT8405",
    "subject": "MGMT",
    "number": "8405",
    "honors": false,
    "writingIntensive": false,
    "name": "Technology Strategy",
    "fullname": "Seminar in Technology Strategy",
    "info": "This is a course that will cover theories and phenomena that are central to the field of technology strategy. The course will include readings on a broad range of topics and perspectives pertaining to firms’ technology and innovation strategy. An illustrative list of readings are provided below. These readings will be grouped into required and recommended readings.The course is intended to prepare students to undertake research in technology strategy. Towards this goal students will prepare summaries of assigned readings, serve as discussion leaders for the class topics and write a research proposal (including a research question, theory and hypotheses and research design) that builds on the course concepts.prereq: PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "826702",
    "code": "MGMT8406",
    "subject": "MGMT",
    "number": "8406",
    "honors": false,
    "writingIntensive": false,
    "name": "Organizational Theory I",
    "fullname": "Organizational Theory I",
    "info": "Major theories and current research on organizational and inter-organizational topics from a macro perspective. This is course one of two. Previously offered as Mgmt 8302.prereq: Business admin PhD student or instructor consent",
    "prereq": []
  },
  {
    "uid": "826706",
    "code": "MGMT8407",
    "subject": "MGMT",
    "number": "8407",
    "honors": false,
    "writingIntensive": false,
    "name": "Organizational Theory II",
    "fullname": "Organizational Theory II",
    "info": "Major theories and current research on organizational and inter-organizational topics from a macro perspective. This course is two of two. Previously offered as Mgmt 8302.prereq: Mgmt 8406, Business admin PhD student or instructor consent",
    "prereq": {
      "code": "MGMT 8406",
      "subject": "MGMT",
      "id": "8406"
    }
  },
  {
    "uid": "826731",
    "code": "MGMT8408",
    "subject": "MGMT",
    "number": "8408",
    "honors": false,
    "writingIntensive": false,
    "name": "Compu Soc.Sci for Org Research",
    "fullname": "Computational Social Science for Organizational Research",
    "info": "This seminar will provide a general introduction to the field of computational social science, with an emphasis on applications for research on organizations and management. The course will beginwith an examination of the benefits of computational methods and their relationship to other, more established research approaches. Subsequently, we will consider several broad categories oftopics, theories, and tools, including, for example, social network analysis, simulation, and natural language processing. In addition to providing an overview of the emerging field of computationalsocial science, the course will help you gain hands on experience with using the methods discussed through lab demonstrations and a research project.",
    "prereq": []
  },
  {
    "uid": "815971",
    "code": "MGMT8501",
    "subject": "MGMT",
    "number": "8501",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar in Entrepreneurship",
    "fullname": "Seminar in Entrepreneurship",
    "info": "This seminar provides a broad introduction to the field of entrepreneurship. It helps students develop the skills and knowledge needed to conduct their own research within this domain. It introduces them to the theoretical and empirical foundations of the field of entrepreneurship as a scholarly discipline. It will familiarize students with key debates in the field. It will also sharpen students' conceptual and analytical skills, and help them develop their research agenda.",
    "prereq": []
  },
  {
    "uid": "004669",
    "code": "MGMT8892",
    "subject": "MGMT",
    "number": "8892",
    "honors": false,
    "writingIntensive": false,
    "name": "Rdgs in Management",
    "fullname": "Readings in Management Theory and Administration",
    "info": "Intensive research on a management topic; major term paper.prereq: Business admin PhD student or instr consent, adviser consent",
    "prereq": []
  },
  {
    "uid": "004670",
    "code": "MGMT8894",
    "subject": "MGMT",
    "number": "8894",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in Mgmt",
    "fullname": "Graduate Research in Management Theory and Administration",
    "info": "Research project on a management problem of interest to student; may be completed in cooperation with a business firm.prereq: Business admin PhD student or instr consent, adviser consent",
    "prereq": []
  }
]