[
  {
    "uid": "807419",
    "code": "MILI3585",
    "subject": "MILI",
    "number": "3585",
    "honors": false,
    "writingIntensive": false,
    "name": "Navigating Healthcare Mktplace",
    "fullname": "Navigating the Healthcare Marketplace with Economic, Social and Policy Lenses",
    "info": "The healthcare marketplace constitutes over three trillion dollars in the United States and several trillion spent throughout the world.  With growing demand for medical technology and the aging of the population, the scale and complexity of the healthcare supply chain is expected to dramatically increase over the next two decades.  The healthcare sector is comprised of several markets for goods and services, including physician services, hospital services, insurance, pharmaceuticals and medical devices, and information technology.  At the core of it all is healthcare consumers: us as patients, patient family members and caregivers. This course aims to 1) provide a historical evolution and social transformation of the healthcare sector, 2) critically review the current survey of the health economy, 3) discuss new health policy and reform initiatives and compare to international health system models. The overall goal is to provide an understanding of the scale and interactions between different health sector markets and consumers; to identify market opportunities and policy initiatives, as well as barriers to this expanding and global industry.",
    "prereq": []
  },
  {
    "uid": "808268",
    "code": "MILI3589",
    "subject": "MILI",
    "number": "3589",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Technology and Society",
    "fullname": "Medical Technology and Society",
    "info": "Course DescriptionInnovations in medical technologies are one of the leading areas of economic growth in the world. Whether new technologies take the form of pharmaceutical, medical device, biotechnology, information technology of some combination of these innovations, the opportunities for both private enterprise and social welfare are substantial. However, these innovations are not without cost, and require reimbursement from either a privately or publicly financed health care delivery system. Thus, the demand for the evaluation of new medical technologies continues to grow as new treatments are developed and health care costs continue to rise. This course aims to provide knowledge of the skills, data, and methodology required to critically evaluate new medical technologies from a social perspective as well as from a business perspective in order to meet financial investment and regulatory compliance objectives. The course will provide an introduction to the analytic tool kit needed to critically evaluate new medical technologies including:1.Understanding regulatory pathways such as the FDA approval2.Understanding the U.S. payment policy & reimbursement for medical technology3.Assessing unmet needs and the relevant market for the technology4.Evaluating the social and economic value to convince payers to cover and reimburse the technology5.Recognizing provider, healthcare organization and market-level factors that influence adoption of new medical technologies. Throughout the course, students will work on team-based hands-on exercises that will provide them gain further understanding of the impact of medical technology from the perspectives of an innovator, a regulator, a payer, a public entity, and consumers of the medical technology including physicians, hospitals, health systems and patients.",
    "prereq": []
  },
  {
    "uid": "819084",
    "code": "MILI3963",
    "subject": "MILI",
    "number": "3963",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Market Analytics",
    "fullname": "Health Market Analytics",
    "info": "This course prepares students to analyze large health care databases with a focus on advanced applications with health insurance claims data. The course is designed to be a STEM offering with the use of statistical programming languages including R, Tableau, and SAS. This course is designed to appeal to students with an interest in developing data science as core skill and already have knowledge of some programming tools, and experience with data manipulation in Excel, SQL, or Access.  \n\nPrerequisite: We recommended that students have a background in statistics. Consider MKTG 3005 -  or STAT 3011 or BA 2551 or equivalent course. We also recommend a previously taken class with Excel, R, SAS, SQL, or Access.",
    "prereq": {
      "or": [
        {
          "code": "MKTG 3005",
          "subject": "MKTG",
          "id": "3005"
        },
        {
          "code": "STAT 3011",
          "subject": "STAT",
          "id": "3011"
        },
        {
          "code": "BA 2551",
          "subject": "BA",
          "id": "2551"
        }
      ]
    }
  },
  {
    "uid": "804000",
    "code": "MILI5995",
    "subject": "MILI",
    "number": "5995",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Industry Valuation Lab",
    "fullname": "Medical Industry Valuation Laboratory",
    "info": "Interdisciplinary student teams create rapid production market analysis of promising medical technologies/services to determine potential for success in market. Exposure to University innovations, venture firms, inventors.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "804001",
    "code": "MILI5999",
    "subject": "MILI",
    "number": "5999",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study.",
    "prereq": []
  },
  {
    "uid": "798039",
    "code": "MILI6235",
    "subject": "MILI",
    "number": "6235",
    "honors": false,
    "writingIntensive": false,
    "name": "Pharmaceutical Industry",
    "fullname": "Pharmaceutical Industry: Business and Policy",
    "info": "Business/policy issues specific to pharmaceutical industry. Interdisciplinary perspectives, active involvement by industry leaders.",
    "prereq": []
  },
  {
    "uid": "813054",
    "code": "MILI6421",
    "subject": "MILI",
    "number": "6421",
    "honors": false,
    "writingIntensive": false,
    "name": "Healthcare Law: Strat & Bus Im",
    "fullname": "Healthcare Law: Stratrategic and Business Implications",
    "info": "This course will survey fundamental healthcare laws that apply to a wide variety of healthcare businesses, and will examine their impact on business strategy and operations. The goal is to enable current and prospective managers and leaders in the healthcare space to understand compliance requirements and how healthcare law impacts business strategy and decisions. In the end, healthcare law can be a competitive advantage. In addition, the course will address key current healthcare policy challenges and how these impact business environment and strategy.",
    "prereq": []
  },
  {
    "uid": "798034",
    "code": "MILI6562",
    "subject": "MILI",
    "number": "6562",
    "honors": false,
    "writingIntensive": false,
    "name": "Info Technology in Healthcare",
    "fullname": "Information Technology in Health Care",
    "info": "Theoretical/conceptual base for health care information technology. Applications of current/developing health IT. Approaches to evaluate effectiveness of health IT systems. Information technology, computer technology, and data structures commonly found in health care information systems. Information system design/evaluation.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "798035",
    "code": "MILI6589",
    "subject": "MILI",
    "number": "6589",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Technology Evaluation",
    "fullname": "Medical Technology Evaluation and Market Research",
    "info": "This course aims to provide knowledge of the skills, data, and methodology required to critically evaluate new medical technologies in order to meet financial investment as well as regulatory compliance objectives, such as FDA approval. The course is designed to provide an introduction to the analytic tool kit needed to critically evaluate new medical technology, such as cost-benefit analysis, cost effectiveness analysis as well as other decision-analytic models and markov-models.",
    "prereq": []
  },
  {
    "uid": "798036",
    "code": "MILI6726",
    "subject": "MILI",
    "number": "6726",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Device Industry",
    "fullname": "Medical Device Industry: Business and Public Policy",
    "info": "This course, with the insight of industry leaders, addresses public-private sector interactions and the business, public policy, regulatory, and technology management issues that concern medical device and biotechnology companies.",
    "prereq": []
  },
  {
    "uid": "819636",
    "code": "MILI6920",
    "subject": "MILI",
    "number": "6920",
    "honors": false,
    "writingIntensive": false,
    "name": "MILI Topic Course",
    "fullname": "MILI Topic Course",
    "info": " Discussion and analysis of current topics and developments in the medical industry.",
    "prereq": []
  },
  {
    "uid": "817761",
    "code": "MILI6963",
    "subject": "MILI",
    "number": "6963",
    "honors": false,
    "writingIntensive": false,
    "name": "Healthcare Analytics",
    "fullname": "Healthcare Analytics",
    "info": "This course prepares students to analyze large health care databases with a focus on advanced applications with health insurance claims data. The course is designed to be a STEM offering with the use of statistical programming languages including R, Tableau, and SAS. This course is designed to appeal to students with an interest in developing data science as a core skill and already have knowledge of some programming tools, and experience with data manipulation in Excel, SQL, or Access. The course utilizes a novel synthetic health insurance claims database representing 300 million covered lives of the major private and publicly insured insured populations in the United States. Major topics include market sizing, actuarial projection, quality of care metrics, and national health account calculation.",
    "prereq": []
  },
  {
    "uid": "798038",
    "code": "MILI6985",
    "subject": "MILI",
    "number": "6985",
    "honors": false,
    "writingIntensive": false,
    "name": "The Healthcare Marketplace",
    "fullname": "The Health Care Marketplace",
    "info": "Survey of trillion dollar medical industry. Physician/hospital services, insurance, pharmaceuticals, medical devices, information technology.  Scale, interactions, inter-relationships, market opportunities, barriers.prereq: MBA student",
    "prereq": []
  },
  {
    "uid": "800598",
    "code": "MILI6991",
    "subject": "MILI",
    "number": "6991",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomy & Physiology for Mgrs",
    "fullname": "Anatomy and Physiology for Managers",
    "info": "Overview of medical vocabulary/physiology of major body systems. Understanding current clinical practice. Market opportunities of major body systems, Medical technology innovation.",
    "prereq": []
  },
  {
    "uid": "808882",
    "code": "MILI6992",
    "subject": "MILI",
    "number": "6992",
    "honors": false,
    "writingIntensive": false,
    "name": "Healthcare Delivery Innovation",
    "fullname": "Healthcare Delivery Innovations:Optimizing Cost and Quality",
    "info": "Understand stakeholders that impact healthcare delivery including providers, payers, employers and patients and how they are trying to transform this unique value chain to improve care while reducing cost.",
    "prereq": []
  },
  {
    "uid": "802014",
    "code": "MILI6995",
    "subject": "MILI",
    "number": "6995",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Industry Valuation Lab",
    "fullname": "Medical Industry Valuation Laboratory",
    "info": "Interdisciplinary student teams create rapid production market analysis of promising medical technologies/services to determine potential for success in market. Exposure to University innovations, venture firms, inventors.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "804534",
    "code": "MILI6996",
    "subject": "MILI",
    "number": "6996",
    "honors": false,
    "writingIntensive": false,
    "name": "Med Industry Valuation Lab II",
    "fullname": "Medical Industry Valuation Laboratory II",
    "info": "Interdisciplinary student teams create rapid production market analysis of promising medical technologies/services to determine potential for success in market. Exposure to University innovations, venture firms, inventors.prereq: Approved application",
    "prereq": []
  },
  {
    "uid": "811156",
    "code": "MILI6997",
    "subject": "MILI",
    "number": "6997",
    "honors": false,
    "writingIntensive": false,
    "name": "MILI Global Valuation Lab",
    "fullname": "MILI Global Valuation Lab",
    "info": "Global version of medical industry leadership institute valuation lab. Assess value of proprietary inventions.",
    "prereq": []
  },
  {
    "uid": "814452",
    "code": "MILI6998",
    "subject": "MILI",
    "number": "6998",
    "honors": false,
    "writingIntensive": false,
    "name": "MILI Fellows",
    "fullname": "MILI Fellows",
    "info": "Fellows will apply the knowledge they have acquired in the MILI Valuation Lab course to assess the commercial viability of innovations developed by the Medical Device Centers Innovation Fellows.",
    "prereq": []
  },
  {
    "uid": "799289",
    "code": "MILI6999",
    "subject": "MILI",
    "number": "6999",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study.",
    "prereq": []
  }
]