[
  {
    "uid": "810598",
    "code": "MLSP1010",
    "subject": "MLSP",
    "number": "1010",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to MLS",
    "fullname": "Introduction to Medical Laboratory Science",
    "info": "Introduction to medical laboratory sciences. Primary disciplines in field/areas of specialty practice. Career pathways explored in hospital laboratories, public health, research.",
    "prereq": []
  },
  {
    "uid": "819741",
    "code": "MLSP2015",
    "subject": "MLSP",
    "number": "2015",
    "honors": false,
    "writingIntensive": false,
    "name": "MLS Role Patient Care",
    "fullname": "Medical Laboratory Scientist’s Vital Role in Patient Care",
    "info": "Introduction to medical laboratory sciences and its critical role in health care. Discussion of basic functions of organ systems and laboratorytests associated with health and disease. Exploration of the profession through case studies as well as career pathways and specialty areas of practice.",
    "prereq": []
  },
  {
    "uid": "827090",
    "code": "MLSP2022",
    "subject": "MLSP",
    "number": "2022",
    "honors": false,
    "writingIntensive": false,
    "name": "Lab Role in Disease Diagnosis",
    "fullname": "Cracking the Code: The Crucial Role of Laboratories in Diagnosing and Understanding Diseases",
    "info": "Explore health and wellness topics through medical laboratory scientists performing and evaluating test results to partner with physicians in diagnosing disease.",
    "prereq": []
  },
  {
    "uid": "827091",
    "code": "MLSP2033",
    "subject": "MLSP",
    "number": "2033",
    "honors": false,
    "writingIntensive": false,
    "name": "Infect Disease Lab Perspective",
    "fullname": "Infectious Disease Detection, Diagnosis, and Treatment",
    "info": "Human infectious diseases may be caused by bacteria, fungi, parasites, or viruses. This course will provide insight into the laboratories role in detection and diagnosis of commonly known human pathogens and the correlation of these pathogens to the laboratory results. Also to be discussed is the laboratories role and interaction with pharmacy to determine effective treatment for these infections.",
    "prereq": []
  },
  {
    "uid": "820131",
    "code": "MLSP3010",
    "subject": "MLSP",
    "number": "3010",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in MLS",
    "fullname": "Topics in Medical Laboratory Science",
    "info": "Topics shell. See title descriptions.",
    "prereq": []
  },
  {
    "uid": "810793",
    "code": "MLSP5011W",
    "subject": "MLSP",
    "number": "5011",
    "honors": false,
    "writingIntensive": true,
    "name": "Prof Issues Health Care Comm",
    "fullname": "Professional Issues in the Health Care Community",
    "info": "Current literature and written discussion to explore the laboratory profession: healthcare systems, professional scope of practice, regulatory and licensure issues, medical ethics, Interprofessional practice models and current topics impacting health care delivery. Focus is on the medical laboratorys crucial role in patient care.",
    "prereq": []
  },
  {
    "uid": "810599",
    "code": "MLSP5012",
    "subject": "MLSP",
    "number": "5012",
    "honors": false,
    "writingIntensive": false,
    "name": "Ed Methods Interprof Practice",
    "fullname": "Educational Methods and Interprofessional Practice",
    "info": "Introduction to basic education theory, instructional design, development of lesson goals, objectives, content delivery methods, and assessments. Course also includes exploration of interprofessional approach to health care. Professional identity and integrity, relationships between professions and those they serve, and teamwork. ",
    "prereq": []
  },
  {
    "uid": "810600",
    "code": "MLSP5013",
    "subject": "MLSP",
    "number": "5013",
    "honors": false,
    "writingIntensive": false,
    "name": "Schol Inq Analysis Med Lab Sci",
    "fullname": "Scholarly Inquiry and Analysis in Medical Laboratory Sciences",
    "info": "Review concepts of scientific inquiry. Major steps of research project. How to select topics, evaluate literature, and construct and test working hypothesis. Analyze and interpret data, report results. Quantitative, qualitative, and mixed methods research designs.",
    "prereq": []
  },
  {
    "uid": "810633",
    "code": "MLSP5014W",
    "subject": "MLSP",
    "number": "5014",
    "honors": false,
    "writingIntensive": true,
    "name": "Lab Oper in Health Care",
    "fullname": "Laboratory Operations and Management in Health Care Systems",
    "info": "Operational aspects of medical laboratory fiscal and personnel management laboratory information systems, total quality management, legal aspects of test reporting, government regulatory issues, certification, licensure, accreditation policies. This course meets the campus requirement for an upper division, writing intensive course, in the major.",
    "prereq": []
  },
  {
    "uid": "810601",
    "code": "MLSP5111",
    "subject": "MLSP",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Diagnostic Microbiology",
    "fullname": "Concepts of Diagnostic Microbiology",
    "info": "Investigation of pathophysiologic mechanisms of disease for medically significant human bacteria and yeast including epidemiology, pathogenesis, spectrum of disease, antimicrobial susceptibility testing and therapy. Current analytical methods and applications are discussed.",
    "prereq": []
  },
  {
    "uid": "810602",
    "code": "MLSP5112",
    "subject": "MLSP",
    "number": "5112",
    "honors": false,
    "writingIntensive": false,
    "name": "Appl Diagn Microbiology Princ",
    "fullname": "Application of Diagnostic Microbiology Principles",
    "info": "Application of laboratory methods to identify and treat commonly encountered and clinically significant bacterial and yeast pathogens including specimen processing, culture workup, conventional microscopy, susceptibility testing, and molecular and immunological techniques. Emphasis on aerobic and anaerobic bacteria, mycobacteria, and yeast from various body sites. ",
    "prereq": []
  },
  {
    "uid": "810603",
    "code": "MLSP5113",
    "subject": "MLSP",
    "number": "5113",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Diagnostic Microbiology",
    "fullname": "Advanced Concepts in Diagnostic Microbiology",
    "info": "Physiology and pathogenic interactions between man and clinically significant fungal, parasitic, viral, and miscellaneous bacterial agents including the epidemiology, prevention, detection, and treatment of these agents. Current analytical methods and applications are discussed. ",
    "prereq": []
  },
  {
    "uid": "810604",
    "code": "MLSP5211",
    "subject": "MLSP",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "Fund. Hematology & Hemostasis",
    "fullname": "Fundamentals in Hematology and Hemostasis",
    "info": "Anatomy and physiology of hematopoietic and coagulation systems including cell morphology, theory of routine and specialized hematology and hemostasis tests, non-malignant alterations and their etiologies, current therapeutic regimens, and clinical implications. Current analytical methods and applications are discussed.",
    "prereq": []
  },
  {
    "uid": "810605",
    "code": "MLSP5212",
    "subject": "MLSP",
    "number": "5212",
    "honors": false,
    "writingIntensive": false,
    "name": "Appl Hematology & Hemostasis",
    "fullname": "Application of Hematology & Hemostasis Principles",
    "info": "Theory, performance, and application of routine and specialized diagnostic procedures. Practice in venipuncture, cell counting, white blood cell differential, red cell, white cell and platelet morphology and interpretation, and coagulation studies. Quality control in diagnostic procedures. Interpretation and correlation of laboratory findings.",
    "prereq": []
  },
  {
    "uid": "810606",
    "code": "MLSP5213",
    "subject": "MLSP",
    "number": "5213",
    "honors": false,
    "writingIntensive": false,
    "name": "Diagnostic Hematology",
    "fullname": "Diagnostic Hematology",
    "info": "Blood and bone marrow in assessment of hematologic function and disease. Focus on normal development, differentiation, and abnormal changes in disease. Group integration of case data including bone marrow collection, interpretation of cytochemical stains, flow cytometry, cytogenetics, molecular diagnostics in hematologic neoplasms and disorders. ",
    "prereq": []
  },
  {
    "uid": "810607",
    "code": "MLSP5214",
    "subject": "MLSP",
    "number": "5214",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Hematology Morphology",
    "fullname": "Advanced Hematology Morphology",
    "info": "Blood and bone marrow in assessment of hematologic function and presence of disease. Focus on normal development and differentiation, abnormal changes in pathologic conditions. Practice in bone marrow differential. Mastery in peripheral blood differential and morphology. Integration and interpretation of case history and specialized test data. ",
    "prereq": []
  },
  {
    "uid": "810608",
    "code": "MLSP5311",
    "subject": "MLSP",
    "number": "5311",
    "honors": false,
    "writingIntensive": false,
    "name": "Laboratory Techniques",
    "fullname": "Fundamental Biomedical Laboratory Techniques",
    "info": "Foundations of biomedical laboratory methods, development of technical skills: safety, lab math, total testing process, method validation, Quality Control and Assurance. Emphasis on documentation and analysis, analytical techniques, microscopy, spectrophotometry, chromatography, electrochemical, immunologic, nucleic acid (molecular) techniques.Recommended Prerequisites: 8 credits general chemistry, 3 credits organic chemistry",
    "prereq": []
  },
  {
    "uid": "810609",
    "code": "MLSP5312",
    "subject": "MLSP",
    "number": "5312",
    "honors": false,
    "writingIntensive": false,
    "name": "Body Fluid Analysis",
    "fullname": "Body Fluid Analysis",
    "info": "Formation and analysis of urine, cerebrospinal, pleural, peritoneal, amniotic, synovial, seminal, and other body fluids, and the correlation to pathological conditions are discussed. Laboratory skills for analysis of the physical, chemical, and microscopic characteristics of body fluids will be developed.",
    "prereq": []
  },
  {
    "uid": "810610",
    "code": "MLSP5313",
    "subject": "MLSP",
    "number": "5313",
    "honors": false,
    "writingIntensive": false,
    "name": "Chem Analysis Health & Disease",
    "fullname": "Chemical Analysis in Health and Disease",
    "info": "In this course, you will develop an understanding of various health conditions through the lens of how Chemistry is applied in the medical laboratory. We will discuss electrolytes, blood gases, carbohydrates, lipoproteins, bone disorders, tumor markers, therapeutic drug monitoring, and cardiac, hepatic, renal, endocrine, and gastrointestinal disorders. We will correlate medically significant substances found in the body to pathophysiology and metabolic disorders. Discover how current analytical methods and applications allow Medical Laboratory Scientists to partner with healthcare professionals in diagnosing disease.prereq: BioC 3021 or equivalent",
    "prereq": {
      "code": "BIOC 3021",
      "subject": "BIOC",
      "id": "3021"
    }
  },
  {
    "uid": "810611",
    "code": "MLSP5511",
    "subject": "MLSP",
    "number": "5511",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Immunobiology",
    "fullname": "Principles of Immunobiology",
    "info": "Comprehensive exploration of the immune system and functions. Fundamental principles of humoral and cellular immunity. Adaptive immunity, clinical outcomes, hypersensitivity, autoimmunity, cancer, transplantation, immunotherapy, and immunity against infectious diseases. Immunologic testing methods and immune function assessment are discussed.",
    "prereq": []
  },
  {
    "uid": "810616",
    "code": "MLSP5513",
    "subject": "MLSP",
    "number": "5513",
    "honors": false,
    "writingIntensive": false,
    "name": "Transfusion Med Princ/Methods",
    "fullname": "Transfusion Medicine Principles and Methods",
    "info": "Investigation of genetics, structure and detection of clinically significant blood group antigens/antibodies. Principles of donor requirements, component therapy, transfusion reactions, hemolytic disease of the fetus and newborn, immune hemolytic anemias, quality systems, and automation in the blood bank.",
    "prereq": []
  },
  {
    "uid": "810617",
    "code": "MLSP5514",
    "subject": "MLSP",
    "number": "5514",
    "honors": false,
    "writingIntensive": false,
    "name": "Appl of Transfusion Med Princ",
    "fullname": "Application of Transfusion Medicine Principles",
    "info": "Application of standard serologic techniques to the detection/identification of blood group antigens/antibodies and hemolytic disease of the fetus and newborn. Evaluation of clinically significant serum titers. Performance of direct antiglobulin, compatibility, gel and molecular testing. Utilization protocols. Recognizing/resolving common problems.",
    "prereq": []
  },
  {
    "uid": "810618",
    "code": "MLSP5701",
    "subject": "MLSP",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Exper Microbiology",
    "fullname": "Clinical Experience in Microbiology",
    "info": "Practical hands-on experience, application of theory, technical, and affective competencies learned on campus in a microbiology laboratory. Designed to assist students in making transition to clinical practitioner. ",
    "prereq": []
  },
  {
    "uid": "810620",
    "code": "MLSP5702",
    "subject": "MLSP",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Experience Heme/Coag",
    "fullname": "Clinical Experience in Hematology and Hemostasis",
    "info": "Practical hands-on experience, apply technical and affective competencies learned on campus in a hematology and coagulation laboratory. Designed to assist students in making transition to clinical practitioner. ",
    "prereq": []
  },
  {
    "uid": "810621",
    "code": "MLSP5703",
    "subject": "MLSP",
    "number": "5703",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Exper Clin Chem/UA",
    "fullname": "Clinical Experience in Clinical Chemistry and Urinalysis",
    "info": "Practical hands-on experience, apply technical and affective competencies learned on campus to a chemistry, urinalysis, and body fluids laboratory. Designed to assist students in making transition to clinical practitioner. ",
    "prereq": []
  },
  {
    "uid": "810622",
    "code": "MLSP5704",
    "subject": "MLSP",
    "number": "5704",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Exper Transfusion Med",
    "fullname": "Clinical Experience in Transfusion Medicine",
    "info": "Practical hands-on experience, apply technical and affective competencies learned on campus to a transfusion services laboratory. Designed to assist students in making transition to clinical practitioner. ",
    "prereq": []
  },
  {
    "uid": "810623",
    "code": "MLSP5801",
    "subject": "MLSP",
    "number": "5801",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Pract Special Disciplines",
    "fullname": "Advanced Practicum Experience in Specialty Disciplines",
    "info": "Students select an advanced specialty discipline of MLS: cytogenetics, flow cytometry, bone marrow, molecular diagnostics, toxicology, education, management, research, public health, etc. ",
    "prereq": []
  },
  {
    "uid": "819059",
    "code": "MLSP6000",
    "subject": "MLSP",
    "number": "6000",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Grad Studies & Profess",
    "fullname": "Introduction to Graduate Studies and Professionalism in BLS",
    "info": "This online interactive course provides an introduction to the BLS masters degree plan and career pathways in the field. Includes strategies for leadership assessment, professional development, and career advancement.",
    "prereq": []
  },
  {
    "uid": "819060",
    "code": "MLSP6012",
    "subject": "MLSP",
    "number": "6012",
    "honors": false,
    "writingIntensive": false,
    "name": "Ed. Methods, Lrnng & Tchnlgy",
    "fullname": "Educational Methods, Learning and Technology for Laboratory Practitioners",
    "info": "This course provides a foundation to develop instructional units for students and professionals in a variety of settings. Course also explores issues impacting the delivery of medical education including adult learners, active engagement, cultural awareness, and technology enhanced delivery. Students will also participate in teaching activity.",
    "prereq": []
  },
  {
    "uid": "819061",
    "code": "MLSP6013",
    "subject": "MLSP",
    "number": "6013",
    "honors": false,
    "writingIntensive": false,
    "name": "Accreditation for Lab Sci Prog",
    "fullname": "Accreditation Processes for Laboratory Science Programs",
    "info": "Introduction to the accreditation process for laboratory science education programs. Includes discussion on standards, documentation requirements, and outcomes assessments for academic programs and clinical sites.  Preparation of self-studies and the site visit review process are included. 3 credits",
    "prereq": []
  },
  {
    "uid": "817843",
    "code": "MLSP6024",
    "subject": "MLSP",
    "number": "6024",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Lab Ops and Management",
    "fullname": "Advanced Laboratory Operations and Management",
    "info": "Principles of quality management, process improvement in laboratory and health care systems. Project based application of human resources and financial management, informatics, leadership, marketing and quality improvement. Includes professional development, ethics, and strategic planning.",
    "prereq": []
  },
  {
    "uid": "819062",
    "code": "MLSP6044",
    "subject": "MLSP",
    "number": "6044",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Lab Regulatory Issues",
    "fullname": "Clinical Laboratory Regulatory Issues",
    "info": "An overview of the management and regulatory operations of a clinical diagnostic and reference laboratories. Topics include licensure requirements for laboratories and personnel; regulations of testing and instrumentation; financial and personnel compliance, PHI and data management; regulations for special applications.",
    "prereq": []
  },
  {
    "uid": "818104",
    "code": "MLSP6111",
    "subject": "MLSP",
    "number": "6111",
    "honors": false,
    "writingIntensive": false,
    "name": "Concepts in Diag Micro",
    "fullname": "Concepts in Diagnostic Microbiology",
    "info": "Investigation of pathophysiological mechanisms of disease for medically significant human bacteria and yeast including epidemiology, pathogenesis, spectrum of disease, antimicrobial susceptibility testing, and therapy. Current instrumentation and techniques used in the clinical laboratory are discussed. Analysis of current and emerging topics in Microbiology.",
    "prereq": []
  },
  {
    "uid": "818105",
    "code": "MLSP6113",
    "subject": "MLSP",
    "number": "6113",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Diag Micro",
    "fullname": "Advanced Diagnostic Microbiology",
    "info": "Physiology and pathogenic interactions between man and clinically significant fungal, parasitic, viral, and miscellaneous bacterial agents including the epidemiology, prevention, detection, and treatment of these agents. Current analytical methods and applications are discussed. Analysis of current and emerging topics in Microbiology.",
    "prereq": []
  },
  {
    "uid": "819063",
    "code": "MLSP6140",
    "subject": "MLSP",
    "number": "6140",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinical Microbio Sem I",
    "fullname": "Advanced Clinical Microbiology Seminar I",
    "info": "Current topics and advanced case studies in clinical bacteriology, parasitology, mycology or virology. Emerging pathogens, antimicrobial resistance, microbiomes, global health issues, and new technologies will be discussed. Presentations given by students, faculty, and visitors on topics drawn from current practice.",
    "prereq": []
  },
  {
    "uid": "819064",
    "code": "MLSP6160",
    "subject": "MLSP",
    "number": "6160",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinical Microbio Sem II",
    "fullname": "Advanced Clinical Microbiology Seminar II",
    "info": "Continuation of MLSP 6140 discussion of current topics and advanced case studies in clinical bacteriology, parasitology, mycology or virology. Presentations given by students, faculty, and visitors on topics drawn from current practice.",
    "prereq": []
  },
  {
    "uid": "818106",
    "code": "MLSP6211",
    "subject": "MLSP",
    "number": "6211",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Prin in Hematology and Hem",
    "fullname": "Advanced Principles in Hematology and Hemostasis",
    "info": "Anatomy and physiology of the hematopoietic and coagulation systems including normal morphology, non-malignant alterations and etiologies, routine and specialized tests, current therapeutic regimens, and clinical implications. Instrumentation and techniques are discussed. Discussion of current issues facing the hematology laboratory.",
    "prereq": []
  },
  {
    "uid": "818107",
    "code": "MLSP6213",
    "subject": "MLSP",
    "number": "6213",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Diag Hematology",
    "fullname": "Advanced Diagnostic Hematology",
    "info": "Blood and bone marrow in assessment of hematologic function. Normal development and differentiation, abnormal change found in disease. Group integration of case data including bone marrow collection, cytochemical stains, flow cytometry, cytogenetics, molecular diagnostics in neoplasm or disorders. Focused discussion of current topics in hematology.",
    "prereq": []
  },
  {
    "uid": "819065",
    "code": "MLSP6240",
    "subject": "MLSP",
    "number": "6240",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinical Hematology Sem I",
    "fullname": "Advanced Clinical Hematology Seminar I",
    "info": "Current topics and advanced case studies in clinical hematology and hemostasis. Advanced diagnostic testing, the impact of new therapeutic regimens on current testing technology, global health issues, and new technologies will be discussed. Presentations given by students, faculty, and visitors on topics drawn from current practice.",
    "prereq": []
  },
  {
    "uid": "819066",
    "code": "MLSP6260",
    "subject": "MLSP",
    "number": "6260",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinical Hematology Sem II",
    "fullname": "Advanced Clinical Hematology Seminar II",
    "info": "Current topics and advanced case studies in clinical hematology. Newly identified molecular genetic markers for disease, diagnostic approaches to detecting the disease, global health issues, and new technologies will be discussed. Presentations given by students, faculty, and visitors on topics drawn from current practice.",
    "prereq": []
  },
  {
    "uid": "818108",
    "code": "MLSP6313",
    "subject": "MLSP",
    "number": "6313",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Chem Anal Health & Dis",
    "fullname": "Advanced Chemical Analysis in Health and Disease",
    "info": "Correlation of medically significant organic and inorganic substances found in body fluids to pathophysiology of organ systems and metabolic disorders. Analysis of case studies will be discussed to support the development of critical thinking and leadership skills needed for the medical laboratory.",
    "prereq": []
  },
  {
    "uid": "819067",
    "code": "MLSP6340",
    "subject": "MLSP",
    "number": "6340",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinical Chmstry Seminar I",
    "fullname": "Advanced Clinical Chemistry Seminar I",
    "info": "Current topics and advanced case studies in clinical chemistry, quality management, quality improvement, and new and emerging clinical laboratory technologies. Presentations given by students, faculty, and visitors on topics drawn from current practice.",
    "prereq": []
  },
  {
    "uid": "819068",
    "code": "MLSP6360",
    "subject": "MLSP",
    "number": "6360",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clinical Chemistry Sem II",
    "fullname": "Advanced Clinical Chemistry Seminar II",
    "info": "Continuation of MLSP 6340 discussion of current topics and advanced case studies in clinical chemistry, quality management, and new technologies. Presentations given by students, faculty, and visitors on topics drawn from current practice.",
    "prereq": []
  },
  {
    "uid": "818109",
    "code": "MLSP6401",
    "subject": "MLSP",
    "number": "6401",
    "honors": false,
    "writingIntensive": false,
    "name": "Fund Mole Diag",
    "fullname": "Fundamentals of Molecular Diagnostics",
    "info": "Fundamental concepts of molecular science as it relates to molecular diagnostics. Principles of molecular technologies used for diagnostic purposes. Students will be introduced to the unique operation considerations applicable to molecular diagnostic methods and laboratories including design, quality assurance and regulatory issues.",
    "prereq": []
  },
  {
    "uid": "818110",
    "code": "MLSP6402",
    "subject": "MLSP",
    "number": "6402",
    "honors": false,
    "writingIntensive": false,
    "name": "App Molec Diag Tech",
    "fullname": "Application of Molecular Diagnostics Techniques",
    "info": "Fundamental techniques in molecular science related to molecular diagnostics. Principles of molecular technologies used for diagnostic purposes and obtain the technical skills to perform those techniques. Unique operational considerations applicable to a molecular diagnostics laboratory including design, quality assurance and regulatory issues.",
    "prereq": []
  },
  {
    "uid": "818111",
    "code": "MLSP6410",
    "subject": "MLSP",
    "number": "6410",
    "honors": false,
    "writingIntensive": false,
    "name": "Diagnostic Molecular Science",
    "fullname": "Diagnostic Molecular Science",
    "info": "This course presents the role of genetics in medicine and related molecular testing methodologies, and highlights the importance of genetics by linking disease diagnosis, prognosis, prevention and treatment with molecular testing applications. Specimen procurement, patient education, quality assurance, ethics and consent are discussed.",
    "prereq": []
  },
  {
    "uid": "818112",
    "code": "MLSP6411",
    "subject": "MLSP",
    "number": "6411",
    "honors": false,
    "writingIntensive": false,
    "name": "Diag Molecular Science Lab",
    "fullname": "Diagnostic Molecular Science Laboratory",
    "info": "Presentation of the role of genetics in medicine with emphasis on related molecular testing methodologies. Addresses performance of laboratory techniques in genetics, cancer medicine and microbiology. Focus on topics unique to molecular diagnostics in specimen procurement, patient education, quality assurance, ethics and consent.",
    "prereq": []
  },
  {
    "uid": "818113",
    "code": "MLSP6513",
    "subject": "MLSP",
    "number": "6513",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Prin in Transfusion Med",
    "fullname": "Advanced Principles in Transfusion Medicine",
    "info": "Investigation of genetics, structure and detection of blood group antigens/antibodies. Principles of donor requirements, component therapy, transfusion reactions, hemolytic disease of the fetus and newborn, hemolytic anemias, quality systems, and automation in the blood bank. Analysis of current and emerging topics in transfusion medicine.",
    "prereq": []
  },
  {
    "uid": "819069",
    "code": "MLSP6540",
    "subject": "MLSP",
    "number": "6540",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvClncl Transfusion Med Sem I",
    "fullname": "Advanced Clinical Transfusion Medicine Seminar I",
    "info": "Discussion of current topics and advanced case studies in transfusion medicine. Presentations given by students, faculty, and visitors on topics drawn from current practice.",
    "prereq": []
  },
  {
    "uid": "819070",
    "code": "MLSP6560",
    "subject": "MLSP",
    "number": "6560",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvClncl TransfusionMed Sem II",
    "fullname": "Advanced Clinical Transfusion Medicine Seminar II",
    "info": "Continuation of MLSP 6540, discussion of current topics and advanced case studies in transfusion medicine. Presentations given by students, faculty, and visitors on topics drawn from current practice.",
    "prereq": []
  },
  {
    "uid": "817811",
    "code": "MLSP6610",
    "subject": "MLSP",
    "number": "6610",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrated Concepts in MLS",
    "fullname": "Integrated Concepts in Medical Laboratory Science",
    "info": "Interpretation of routine laboratory testing ordered for patient care. Case study discussions, reference ranges and common laboratory tests performed for health assessment, diabetes, cholesterol, anemia, urinalysis, cardiac function, blood typing, common infections and more. Course supports preparation for the Board of Certification exam.",
    "prereq": []
  },
  {
    "uid": "817812",
    "code": "MLSP6620",
    "subject": "MLSP",
    "number": "6620",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Concepts in MLS",
    "fullname": "Advanced Concepts in Medical Laboratory Science",
    "info": "Case studies and journal exploration of advanced diagnostic testing, method development and validation, pathophysiology, and future directions of the field of laboratory medicine. Relationships among research, theory/theoretical formulations, and practice.",
    "prereq": []
  },
  {
    "uid": "818114",
    "code": "MLSP6801",
    "subject": "MLSP",
    "number": "6801",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Practicum in MLS",
    "fullname": "Advanced Practicum in Medical Laboratory Science",
    "info": "Students select an advanced specialty discipline of MLS: cytogenetics, flow cytometry, molecular diagnostics, toxicology, virology, education, management, research, public health, bone marrow, tissue transplantation, etc. Includes career exploration.",
    "prereq": []
  },
  {
    "uid": "818115",
    "code": "MLSP6905",
    "subject": "MLSP",
    "number": "6905",
    "honors": false,
    "writingIntensive": false,
    "name": "Research/Capstone Project",
    "fullname": "Research Methods and Capstone Project",
    "info": "Overview of important concepts of research design, data collection, statistical and interpretative analysis, and final report presentation. The course will develop ability to use the following tasks: Development of a hypothesis, outlining the research problem, related questions, quantitative, qualitative, and mixed methods designs.",
    "prereq": []
  },
  {
    "uid": "819071",
    "code": "MLSP7005",
    "subject": "MLSP",
    "number": "7005",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Rsrch Methds Lab Sciences",
    "fullname": "Advanced Research Methods in Laboratory Sciences",
    "info": "Concepts of scientific inquiry and research design, scientific inquiry, literature review and topic selection. Includes quantitative, qualitative, and mixed methods designs. Students will develop a research proposal appropriate for their area of thesis focus",
    "prereq": []
  },
  {
    "uid": "819072",
    "code": "MLSP7010",
    "subject": "MLSP",
    "number": "7010",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Seminar Med Lab Sci",
    "fullname": "Research Seminar in Medical Laboratory Sciences",
    "info": "In-depth exploration of current research and pertinent topics within the field of Medical Laboratory Sciences. Through weekly presentations, critical analysis, and discussions of original and relevant research, students will engage with the latest advancements, methodologies, and shaping this discipline. ",
    "prereq": []
  },
  {
    "uid": "819073",
    "code": "MLSP7999",
    "subject": "MLSP",
    "number": "7999",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Project in BLS",
    "fullname": "Thesis Project in Biomedical Laboratory Sciences",
    "info": "Thesis Project. The project can be literature-based or lab-based with a testable hypothesis and a final paper and poster, which is an in-depth examination and analysis of a particular area, problem, technique, in laboratory science. ",
    "prereq": []
  }
]