[
  {
    "uid": "819085",
    "code": "MORT2171",
    "subject": "MORT",
    "number": "2171",
    "honors": false,
    "writingIntensive": false,
    "name": "Introductory Anatomy",
    "fullname": "Introductory Anatomy",
    "info": "Study of the human body systems and functions in a systemic approach with an emphasis placed on providing a foundation for funeral service preparation in the areas of embalming and restorative art.  Systems covered include integumentary, skeletal, muscular, nervous, endocrine, cardiovascular, lymphatic, respiratory, digestive, urinary, and reproductive.Pre- / co-requisite: Medical Terminology",
    "prereq": []
  },
  {
    "uid": "014415",
    "code": "MORT3005",
    "subject": "MORT",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "History",
    "fullname": "History of Funeral Service",
    "info": "Development of funeral practices from a historical perspective with emphasis on ethnic and cultural groups that have had an impact on contemporary funeral service.",
    "prereq": []
  },
  {
    "uid": "825622",
    "code": "MORT3009",
    "subject": "MORT",
    "number": "3009",
    "honors": false,
    "writingIntensive": false,
    "name": "Introductory Accounting",
    "fullname": "Introductory Accounting",
    "info": "This course is an introduction to the basic principles of financial and cost accounting with an emphasis on small business and funeral home operations. Accounting provides financial information about a business to owners, creditors, managers, and other interested parties that need to make various business decisions.  This course covers the preparation and analysis of financial statements, accounting for sales and accounts receivable, accounting for purchases and accounts payable, cash flow and working capital management, payroll computations, inventory management, investment in fixed assets, debt and equity capital management, and valuation of business and assets, as well as an introduction to cost accounting concepts including cost behavior, basic budgeting, and cost-revenue analysis.",
    "prereq": []
  },
  {
    "uid": "014419",
    "code": "MORT3012W",
    "subject": "MORT",
    "number": "3012",
    "honors": false,
    "writingIntensive": true,
    "name": "Org & Mgnt Funeral Business",
    "fullname": "Organization and Management of Funeral Business",
    "info": "How to create an entrepreneurial marketing strategy and business plan for a small funeral business. Various forms of ownership. Financial requirements, risk management, human resources management. Theory supplemented with practical information, real-life experiences. Prerequisites: Diversified Core Mathematical Thinking, ACCT 2050: Introduction to Financial Reporting",
    "prereq": {
      "code": "ACCT 2050",
      "subject": "ACCT",
      "id": "2050"
    }
  },
  {
    "uid": "014421",
    "code": "MORT3014",
    "subject": "MORT",
    "number": "3014",
    "honors": false,
    "writingIntensive": false,
    "name": "Rules & Regs",
    "fullname": "Funeral Service Rules and Regulations",
    "info": "Licensing/government regulations, compliance with regulations of state/federal regulatory agencies, cemetery and crematory rules and regulations, and Federal Trade Commission Funeral Practice Rule for the funeral industry.",
    "prereq": []
  },
  {
    "uid": "014423",
    "code": "MORT3016",
    "subject": "MORT",
    "number": "3016",
    "honors": false,
    "writingIntensive": false,
    "name": "Marketing & Merchandising",
    "fullname": "Funeral Service Marketing and Merchandising",
    "info": "Introduction to key elements of funeral service merchandising/marketing. How to manage delivery process.  Theory supplemented with contemporary product offerings, merchandising techniques.",
    "prereq": []
  },
  {
    "uid": "014425",
    "code": "MORT3018",
    "subject": "MORT",
    "number": "3018",
    "honors": false,
    "writingIntensive": false,
    "name": "Funeral Service Practice I",
    "fullname": "Funeral Service Practice I",
    "info": "A study of the practice of funeral service, the conduct of funerals in the diverse American society; various survivor benefits including Social Security, Veterans benefits, active military benefits, and others; private and National cemetery familiarization, including eligibility; merchandise familiarization",
    "prereq": []
  },
  {
    "uid": "796832",
    "code": "MORT3019",
    "subject": "MORT",
    "number": "3019",
    "honors": false,
    "writingIntensive": false,
    "name": "Funeral Service Practice II",
    "fullname": "Funeral Service Practice II",
    "info": "The purpose of this course is to provide students with a multidisciplinary perspective on information, issues and problems associated with, and relating to, the contemporary practice of funeral service. Building upon the foundational theories, definitions and activities presented in complementary mortuary science courses, this class is designed to deepen students' understanding of how funeral service is practiced in a variety of different contexts today from the perspectives of multiple stakeholders.",
    "prereq": []
  },
  {
    "uid": "014426",
    "code": "MORT3020W",
    "subject": "MORT",
    "number": "3020",
    "honors": false,
    "writingIntensive": true,
    "name": "Psych & Counsel",
    "fullname": "Funeral Psychology and Counseling",
    "info": "Applied psychological principles helpful in dealing with clients, especially those experiencing emotional crisis.  Principles, techniques, and basic helping skills of counseling as applied to the funeral arrangement conference.",
    "prereq": []
  },
  {
    "uid": "790480",
    "code": "MORT3021W",
    "subject": "MORT",
    "number": "3021",
    "honors": false,
    "writingIntensive": true,
    "name": "Funeral Psych. & Arrangements",
    "fullname": "Funeral Service Psychology and Arrangements Theory",
    "info": "This course instructs students in grief psychology principles as they relate to funeral service, as well as principles underlying successful funeral arrangements. Coursework includes psychology, counseling, and communication principles, as well as an introduction to helping skills, communication techniques, and other tools to conduct funeral arrangements with diverse client families. Particular emphasis is placed on adapting these tools to a variety of arrangement factors, including disposition type, family dynamics, veteran status, and religious affiliation. Coursework is delivered and assessed via readings, lectures, in-class role-playing, writing-to-learn activities, quizzes, tests, discussions, qualitative research, and reflective writing assignments. Prerequisites: WRIT 1301, PSY 1001, COMM 3401 or COMM 3402",
    "prereq": {
      "and": [
        {
          "code": "WRIT 1301",
          "subject": "WRIT",
          "id": "1301"
        },
        {
          "code": "PSY 1001",
          "subject": "PSY",
          "id": "1001"
        },
        {
          "code": "COMM 3401",
          "subject": "COMM",
          "id": "3401"
        },
        {
          "code": "COMM 3402",
          "subject": "COMM",
          "id": "3402"
        }
      ]
    }
  },
  {
    "uid": "790481",
    "code": "MORT3022W",
    "subject": "MORT",
    "number": "3022",
    "honors": false,
    "writingIntensive": true,
    "name": "Funeral Arrangements Lab",
    "fullname": "Funeral Service Arrangements Laboratory",
    "info": "This course provides students with practical tools to conduct funeral arrangements with diverse client families. Coursework includes application of MORT 3021W material, group discussion, and laboratory-based application of skills. Each student will conduct a simulated arrangement with a community volunteer based on real-world arrangement scenarios. Delivery and assessment of coursework will be via readings, lectures, in-class role-playing, quizzes, tests, writing-to-learn activities, and reflective writing assignments. Prerequisites: MORT 3021W, MORT 3014",
    "prereq": {
      "and": [
        {
          "code": "MORT 3021W",
          "subject": "MORT",
          "id": "3021W"
        },
        {
          "code": "MORT 3014",
          "subject": "MORT",
          "id": "3014"
        }
      ]
    }
  },
  {
    "uid": "014417",
    "code": "MORT3025",
    "subject": "MORT",
    "number": "3025",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Law",
    "fullname": "Business Law",
    "info": "Principles of business law relating to funeral service. U.S. judicial system. Contracts. Sales. Bailments (including carriers). Commercial paper. Agency. Employment. Business organization.",
    "prereq": []
  },
  {
    "uid": "791953",
    "code": "MORT3031",
    "subject": "MORT",
    "number": "3031",
    "honors": false,
    "writingIntensive": false,
    "name": "Funeral Service Law",
    "fullname": "Funeral Service Law",
    "info": "Duty of burial. Right to control funeral arrangements. Final disposition, liability for funeral expenses. Torts involving dead human body and the funeral director. Wills. Estates. Probate.Prerequisites: MORT 3025: Business Law",
    "prereq": {
      "code": "MORT 3025",
      "subject": "MORT",
      "id": "3025"
    }
  },
  {
    "uid": "811469",
    "code": "MORT3048",
    "subject": "MORT",
    "number": "3048",
    "honors": false,
    "writingIntensive": false,
    "name": "Microbio/Path for Funeral Srvc",
    "fullname": "Microbiology and Pathology for Funeral Service",
    "info": "Basic principles of microbiology/pathology for funeral service, including bacteriology, rickettsiology, virology, protozoology, mycology, methods of transmission of infectious disease. Control procedures for protection of public health as related to funeral practice. Scientific focus on causes of disease, mechanisms of disease development, pathways by which morphologic changes occur.",
    "prereq": []
  },
  {
    "uid": "791954",
    "code": "MORT3049",
    "subject": "MORT",
    "number": "3049",
    "honors": false,
    "writingIntensive": false,
    "name": "Microbiology",
    "fullname": "Microbiology",
    "info": "Basic principles of microbiology. Bacteriology, rickettsiology, virology, protozoology, mycology. Methods of transmission of infectious diseases. Control procedures for protection of public health as related to funeral service practice.",
    "prereq": []
  },
  {
    "uid": "789627",
    "code": "MORT3050",
    "subject": "MORT",
    "number": "3050",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathology",
    "fullname": "Pathology",
    "info": "Scientific focus on causes of disease, mechanisms of disease development, and pathways by which morphologic changes occur.",
    "prereq": []
  },
  {
    "uid": "014428",
    "code": "MORT3051",
    "subject": "MORT",
    "number": "3051",
    "honors": false,
    "writingIntensive": false,
    "name": "Restorative Art",
    "fullname": "Restorative Art",
    "info": "In Restorative Art 3051, we will consider the importance of, and techniques for, creating an acceptable physical appearance upon deceased persons for the benefit of the survivors.Over the semester, we will study a variety of topics for the purpose of building skills in the area of restorative art, including anatomical terminology; skeletal structures of the face and cranium; musculature of the face and neck; photographic interpretations; classical proportions of the face and cranium; physiognomy of the face and cranium; essential components of the nose, mouth, eyes, and ears; various modeling techniques; proper placement guides for the restoration of damaged structures and/or missing features; treatments and techniques for both general and specific injuries; color theory, and cosmetology related to the funeral profession.Pre / Co-requisite: MORT 3061 Embalming TheoryPrerequisites: MORT 2171 Introductory Human Anatomy; MORT 3171 Human Anatomy Laboratory",
    "prereq": [
      {
        "code": "MORT 2171",
        "subject": "MORT",
        "id": "2171"
      },
      {
        "code": "MORT 3171",
        "subject": "MORT",
        "id": "3171"
      }
    ]
  },
  {
    "uid": "014427",
    "code": "MORT3055W",
    "subject": "MORT",
    "number": "3055",
    "honors": false,
    "writingIntensive": true,
    "name": "Complicated Grief",
    "fullname": "Complicated Grief",
    "info": "Issues related to loss, grief, bereavement, traumatology. Complicated bereavement/traumatology, complicated vs. non-complicated loss. Current treatment methods.",
    "prereq": []
  },
  {
    "uid": "014431",
    "code": "MORT3061",
    "subject": "MORT",
    "number": "3061",
    "honors": false,
    "writingIntensive": false,
    "name": "Embalming Theory",
    "fullname": "Embalming Theory",
    "info": "This is an introductory course which covers the phenomenon of death of the human body, and the fundamental procedures associated with the practice of the art and science of embalming. Embalming is the process of chemically treating the dead human body in order to: (1) reduce the presence and growth of microorganisms; (2) retard organic decomposition; and (3) restore an acceptable physical appearance to the decedent.1 The semester begins with such topics as personal and public health considerations, and government regulations that are applicable to the embalming process and the fundamentals of embalming. Next are the topics of terminology and identification of embalming instruments, the importance of embalming analysis, and the completion of embalming reports. We advance to vessel location and selection, and procedures for preparing the body before the embalming process begins. We move on to the subject of embalming chemicals, with our lectures and discussions focusing on the reasons why we use various quantities and types of chemicals for each individual case.The course continues with presentations focusing on treatments for embalming difficult cases, including discussion of traumatic and pathological conditions, infections, communicable diseases, autopsied bodies, organ and tissue donors, and other various conditions.Prerequisites: MORT 2171 Introductory Human Anatomy; MORT 3171 Human Anatomy Laboratory",
    "prereq": [
      {
        "code": "MORT 2171",
        "subject": "MORT",
        "id": "2171"
      },
      {
        "code": "MORT 3171",
        "subject": "MORT",
        "id": "3171"
      }
    ]
  },
  {
    "uid": "014433",
    "code": "MORT3062W",
    "subject": "MORT",
    "number": "3062",
    "honors": false,
    "writingIntensive": true,
    "name": "Emb II",
    "fullname": "Embalming II",
    "info": "Theory and procedure of embalming.",
    "prereq": []
  },
  {
    "uid": "790058",
    "code": "MORT3065",
    "subject": "MORT",
    "number": "3065",
    "honors": false,
    "writingIntensive": false,
    "name": "Embalming Chemistry",
    "fullname": "Embalming Chemistry",
    "info": "A survey of the basic principles of chemistry as relate to funeral service. Emphasis on the chemical principles and precautions involved in thepreservation and disinfection of the dead human body. ",
    "prereq": []
  },
  {
    "uid": "790802",
    "code": "MORT3090",
    "subject": "MORT",
    "number": "3090",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study Project",
    "fullname": "Independent Study Project",
    "info": "Independent study contracted between instructor, program director, and student.prereq: Mortuary science major",
    "prereq": []
  },
  {
    "uid": "014441",
    "code": "MORT3091W",
    "subject": "MORT",
    "number": "3091",
    "honors": false,
    "writingIntensive": true,
    "name": "Independent Study",
    "fullname": "Independent Study in Funeral Service",
    "info": "Students complete a project supervised by a faculty member.  Credit(s) is negotiated with the faculty member based on the size and scope of the project. Students must demonstrate that the project has value within the major.prereq: Mortuary science major",
    "prereq": []
  },
  {
    "uid": "014429",
    "code": "MORT3151",
    "subject": "MORT",
    "number": "3151",
    "honors": false,
    "writingIntensive": false,
    "name": "Restorative Art Lab",
    "fullname": "Restorative Art Laboratory",
    "info": "Principles/techniques for restorative art. Modeling facial features with clay or wax. Use of restorative techniques. Cosmetic application on human remains.Mortuary Science MajorPre / Co-requisites: MORT 3051 Restorative Art",
    "prereq": []
  },
  {
    "uid": "014432",
    "code": "MORT3161",
    "subject": "MORT",
    "number": "3161",
    "honors": false,
    "writingIntensive": false,
    "name": "Embalming Laboratory",
    "fullname": "Embalming Laboratory",
    "info": "Practices/procedures of chemically preserving/restoring human remains.Mortuary Science MajorPre / Co-requisites: MORT 3061 Embalming Lecture",
    "prereq": []
  },
  {
    "uid": "014434",
    "code": "MORT3162",
    "subject": "MORT",
    "number": "3162",
    "honors": false,
    "writingIntensive": false,
    "name": "Emb II Lab",
    "fullname": "Embalming II Laboratory",
    "info": "Continuation of the embalming laboratory sequence.  Students develop and refine embalming techniques and skills using dead human bodies.",
    "prereq": []
  },
  {
    "uid": "794313",
    "code": "MORT3171",
    "subject": "MORT",
    "number": "3171",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Anatomy Laboratory",
    "fullname": "Human Anatomy Laboratory",
    "info": "Study of gross human anatomy using cadavers, with emphasis on anatomical structures as relate to embalming, restorative art, and postmortem decedent care. prerec: PHAR 1002: Medical Terminology; Co-requisite: MORT 2171: Introductory Anatomy",
    "prereq": []
  },
  {
    "uid": "014437",
    "code": "MORT3371",
    "subject": "MORT",
    "number": "3371",
    "honors": false,
    "writingIntensive": false,
    "name": "Funeral Rites & Customs",
    "fullname": "Funeral Service Rites, Customs, and Ceremonies",
    "info": "This course explores funeral and death-care customs of select faith, religious, and philosophical traditions, with emphasis on the role of the funeral director in caring for the deceased, in service to survivors. The course curriculum is based on the American Board of Funeral Service Education Student Learning Outcomes for mortuary science students. Mortuary customs to be studied will include Christian, Jewish, Islamic, Buddhist, and Hindu traditions, as well as secular rites and ceremonies.",
    "prereq": []
  },
  {
    "uid": "790803",
    "code": "MORT3379",
    "subject": "MORT",
    "number": "3379",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Funeral Srvc Rotation",
    "fullname": "Clinical Funeral Service Rotation",
    "info": "Practical experience working in clinical settings related to funeral service. What it means to be a funeral director in contemporary American society.Mortuary Science MajorPre / Co-requisite: 3021WPrerequisites: MORT 3051; 3061; 3151; 3161",
    "prereq": [
      {
        "code": "MORT 3051",
        "subject": "MORT",
        "id": "3051"
      },
      {
        "code": "MORT 3061",
        "subject": "MORT",
        "id": "3061"
      },
      {
        "code": "MORT 3151",
        "subject": "MORT",
        "id": "3151"
      },
      {
        "code": "MORT 3161",
        "subject": "MORT",
        "id": "3161"
      }
    ]
  },
  {
    "uid": "014438",
    "code": "MORT3380",
    "subject": "MORT",
    "number": "3380",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum",
    "fullname": "Funeral Service Practicum",
    "info": "Practical experience during one academic term in a funeral home as assigned by the program.",
    "prereq": []
  },
  {
    "uid": "825672",
    "code": "MORT3384",
    "subject": "MORT",
    "number": "3384",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Capstone Course",
    "fullname": "Mortuary Science Practice in the US: An Integrative Capstone Course For Professional Practice",
    "info": "The purpose of this course is to synthesize concepts relating to professional practice, culminating in the completion of the National Board Examination of the International Conference of Funeral Examining Boards (ICFSEB).  The course will consider the application of mortuary science-related concepts to professional practice practice, and will include activities that integrate funeral service knowledge with problems as presented by the National Funeral Service Task Analysis of the ICFSEB.  In the course we  will explore issues related to licensure, continuing professional education and development, and the application of mortuary science principles to professional practice.  The course will integrate key theories relating to the practice of mortuary science for the goal of ensuring competency in professional practice upon graduation.Note: This course will be taken during the student's last semester of enrollment in the program.",
    "prereq": []
  }
]