[
  {
    "uid": "800688",
    "code": "MOT4001",
    "subject": "MOT",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Ldrshp and Business Basics Eng",
    "fullname": "Leadership, Professionalism and Business Basics for Engineers",
    "info": "Elements of business, environment in which technology/business operate. Classes of 15 to 20 students.",
    "prereq": []
  },
  {
    "uid": "826015",
    "code": "MOT4002",
    "subject": "MOT",
    "number": "4002",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech Speak'g Ldrshp Lec Series",
    "fullname": "Technically Speaking Leadership Lecture Series",
    "info": "The course features a selection of highly accomplished industry speakers, including UMN alumni, who share their unique insights on industry developments, leadership, and innovation accumulated through experience in their careers. The lecture series serves as a discovery course for topics at the intersection of technology innovation and entrepreneurship.",
    "prereq": []
  },
  {
    "uid": "826017",
    "code": "MOT4003",
    "subject": "MOT",
    "number": "4003",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Tech Innovation",
    "fullname": "Leading Technology Innovation",
    "info": "This course provides students the perspective of a Technology Leader of an organization or product team. Details the innovation process, from an idea's inception through impact in the economy, regardless of organizational setting. Explores how solutions are developed to become ready for broader market deployment. Includes testing and development of the problem-solution fit, probing of solutions for robustness, and testing of both technical and operational scaling of proposed solutions. Examines the human aspects of innovation, specifically issues of team building and readiness. Considers the broader system for innovation, including the role of key stakeholders in shaping its success in order to arrive at an impactful solution. Addresses intellectual property, the effect of regulations and social and cultural differences across varied global markets, and the personal skills necessary to align and manage these issues.",
    "prereq": []
  },
  {
    "uid": "826018",
    "code": "MOT4004",
    "subject": "MOT",
    "number": "4004",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Innovation Teams",
    "fullname": "Leading Innovation Teams",
    "info": "This course provides students the perspective of a Chief Technology Officer leading the transformation of technologies to products entering the market.  Includes testing and development of the value proposition, and product-market fit. Examines the human aspects of company culture and building a team for growth. Considers the broader requirements for a business model, go-to-market, funding, and resources required to build and scale a business.  Addresses the skills needed to effectively communicate the organization’s strategy, technology roadmap, and growth and impact objectives.",
    "prereq": []
  },
  {
    "uid": "806721",
    "code": "MOT4010",
    "subject": "MOT",
    "number": "4010",
    "honors": false,
    "writingIntensive": false,
    "name": "Middle East Seminar",
    "fullname": "Management of Science and Technology in the Middle East, Global Seminar",
    "info": "Middle East global seminar, including 8 weeks of classroom learning prior to May departure. Technology areas such as solar energy, water desalination, security technology, alternative fuels, and biomedical devices. ",
    "prereq": []
  },
  {
    "uid": "817233",
    "code": "MOT4020",
    "subject": "MOT",
    "number": "4020",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics in MOT",
    "fullname": "Special Topics in Management of Technology",
    "info": "Special Topics in Management of Technology",
    "prereq": []
  },
  {
    "uid": "807184",
    "code": "MOT5001",
    "subject": "MOT",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech Business Fundamentals",
    "fullname": "Technological Business Fundamentals",
    "info": "Provides scientists and engineers with a working knowledge of the broader business context in which science and technology ideas are translated into solutions that address market needs and generate economic value. This two-unit course will broaden students’ business knowledge and project leadership abilities, enabling technical professionals to increase their business impact and career success. The three modules of the course will build practical knowledge and skills in (1) project leadership, professionalism, teamwork, and effective communication, (2) the process of innovation (i.e., transforming technical ideas into value-creating solutions), and (3) business acumen fundamentals.prereq: Degree seeking or non-degree graduate students",
    "prereq": []
  },
  {
    "uid": "812767",
    "code": "MOT5002",
    "subject": "MOT",
    "number": "5002",
    "honors": false,
    "writingIntensive": false,
    "name": "Creating Tech Innovation",
    "fullname": "Creating Technological Innovation",
    "info": "This hands-on, project-based course provides students the perspective of a Technology Leader of an organization or product team. Details the innovation process, from an idea's inception through impact in the economy, regardless of organizational setting. Explores how solutions are developed to become ready for broader market deployment. Includes testing and development of the problem-solution fit, probing of solutions for robustness, and testing of both technical and operational scaling of proposed solutions. Examines the human aspects of innovation, specifically issues of team building and readiness. Considers the broader system for innovation, including the role of key stakeholders in shaping its success in order to arrive at an impactful solution. Addresses intellectual property, the effect of regulations and social and cultural differences across varied global markets, and the personal skills necessary to align and manage these issues.prereq: Degree seeking or non-degree graduate students.",
    "prereq": []
  },
  {
    "uid": "811593",
    "code": "MOT5003",
    "subject": "MOT",
    "number": "5003",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech Business Planning Wrkshp",
    "fullname": "Technological Business Planning Workshop",
    "info": "Applies lessons of 5001 or 5002 directly to technology of the student's choosing, possibly thesis topic. Aspects of strategic technology plan or business plan, culminating in  presentation of plan. Must be taken in parallel with 5001 or 5002.prereq: Degree seeking or non-degree graduate students. Student must also enroll for MOT 5001 or MOT 5002.",
    "prereq": {
      "or": [
        {
          "code": "MOT 5001",
          "subject": "MOT",
          "id": "5001"
        },
        {
          "code": "MOT 5002",
          "subject": "MOT",
          "id": "5002"
        }
      ]
    }
  },
  {
    "uid": "826809",
    "code": "MOT5004",
    "subject": "MOT",
    "number": "5004",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Innovation Teams",
    "fullname": "Leading Innovation Teams",
    "info": "This hands-on, project-based course provides students the perspective of a Chief Technology Officer leading the transformation of technologies to products entering the market.  Includes iterating, testing, and developing value propositions and product-market fit. Examines the human aspects of company culture and building a team for growth. Considers the broader requirements for business model, go-to-market, funding, and resources required to build and scale a business. Addresses the skills needed to effectively communicate the organization’s strategy, technology roadmap, and growth and impact objectives.",
    "prereq": []
  },
  {
    "uid": "826540",
    "code": "MOT5005",
    "subject": "MOT",
    "number": "5005",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech Speak'g Ldrshp Lec Series",
    "fullname": "Technically Speaking Leadership Lecture Series",
    "info": "The course features a selection of highly accomplished industry speakers, including UMN alumni, who share their unique insights on industry developments, leadership, and innovation accumulated through experience in their careers. The lecture series serves as a discovery course for topics at the intersection of technology innovation and leadership. prereq: Degree seeking or non-degree graduate students",
    "prereq": []
  },
  {
    "uid": "014597",
    "code": "MOT5009",
    "subject": "MOT",
    "number": "5009",
    "honors": false,
    "writingIntensive": false,
    "name": "Communication for Tech Leaders",
    "fullname": "Communication for Technology Leaders",
    "info": "In the rapidly evolving domain of technology, effective communication stands paramount for technological leaders. This course focuses on developing foundational and advanced communication strategies, underscoring the importance of clear, impactful, and influential communication. Recognizing the myriad challenges and nuances of communicating in a technological environment—from risk assessment to executive decision-making—the curriculum provides a holistic exploration of theories, practices, and real-world applications. Through a combination of case studies, hands-on exercises, theoretical insights, and practical application, students will be equipped to navigate various communication scenarios as they prepare to lead, influence, and drive success in diverse technological settings.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "826235",
    "code": "MOT5010",
    "subject": "MOT",
    "number": "5010",
    "honors": false,
    "writingIntensive": false,
    "name": "Enhancing Tech Ldrsh Skills",
    "fullname": "Enhancing Technology Leadership Skills",
    "info": "Critically important to success as a technology leader is demonstrating executive presence and gravitas when dealing with all levels of the organization: staff, leaders, customers. Students will gain an understanding of how, as a technology leader, they must also be a strategic thought leader, a catalyst for change, and consider innovative and values-driven strategies for their work and their organizations. Students will focus on understanding and refining their personal values, emotional intelligence strengths and challenges, business and technical communication, persuasion, personal management, and impact.  ",
    "prereq": []
  },
  {
    "uid": "826236",
    "code": "MOT5011",
    "subject": "MOT",
    "number": "5011",
    "honors": false,
    "writingIntensive": false,
    "name": "Creating High Perf'g Tech Org",
    "fullname": "Creating a High Performing Technology Organization",
    "info": "This course will provide the student with a blueprint for creating and maintaining a technical workforce that is high-performing and diverse, helping students become technical leaders that can effectively lead a transformation to support business strategies. This course will provide the tools and context to ensure the technology leader is creating and sustaining a culture of innovation, accountability, and creativity.",
    "prereq": []
  },
  {
    "uid": "826237",
    "code": "MOT5012",
    "subject": "MOT",
    "number": "5012",
    "honors": false,
    "writingIntensive": false,
    "name": "Understanding Tech of Future",
    "fullname": "Understanding Technology of the Future",
    "info": "Technology leadership begins with the understanding of what new and innovative technologies are being developed. Students will develop skills and gain a deep understanding of available tools to evaluate the relevance and impact of these emerging technologies. Students will learn how to take insights gained from foresight into the strategic plan and address the significant discord between strategic planning and execution experience by many organizations.",
    "prereq": []
  },
  {
    "uid": "826238",
    "code": "MOT5013",
    "subject": "MOT",
    "number": "5013",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading the Business of Tech",
    "fullname": "Leading the Business of Technology",
    "info": "This course is designed for people with a basic understanding of business principles in a technical setting and are looking to progress toward being a technology leader. This course will bring together knowledge and skills necessary to be a leader in budget, legal, pricing, marketing, and finance facets, strategies, and formulation, and consider portfolio management and business governance on a foundational level. There will be lecture and hands-on components.",
    "prereq": []
  },
  {
    "uid": "826929",
    "code": "MOT5020",
    "subject": "MOT",
    "number": "5020",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Workshop",
    "fullname": "Capstone Workshop",
    "info": "The Capstone Workshop culminates a graduate student’s experience at TLI. Using concepts and methods learned throughout their course of study, students will identify a problem and opportunity to complete one of the following: an applied or hypothetical project, a technology analysis, or a start-up/business plan. Students will conduct primary research and secondary research and analyze resulting data to produce evidence-based, actionable recommendations. Based on project results, students will complete a written report and presentation.",
    "prereq": []
  },
  {
    "uid": "825992",
    "code": "MOT5101",
    "subject": "MOT",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Electrification",
    "fullname": "Introduction to Electrification",
    "info": "Introduction to Electrification is the first in a series of electrification courses intended to prepare technologists, engineers, scientists, and technically minded managers for the migration to an electric future. It will cover electrification trends in the industry, the current state of the art, and a survey of core technologies and safety procedures key to the electrification process. There will be lecture and hands-on components. ",
    "prereq": []
  },
  {
    "uid": "825993",
    "code": "MOT5102",
    "subject": "MOT",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "Electrification for Engineers",
    "fullname": "Electrification for Engineers",
    "info": "Electrification for Engineers is the second in a series of applied electrification courses intended for those who have completed the Introduction to Electrification or have a sufficient background in this technology and are seeking more in-depth instruction. This course will incorporate more mathematical models of electrification technologies, include associated laboratories, and explore electrification systems from electromechanical energy conversion to discrete electronic components.",
    "prereq": []
  },
  {
    "uid": "826006",
    "code": "MOT5103",
    "subject": "MOT",
    "number": "5103",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Electrification",
    "fullname": "Advanced Electrification",
    "info": "Advanced Electrification is the third in a series of applied electrification courses intended for those who have completed Electrification for Engineers (MOT 5102) or have a sufficient background in this technology. It is the final course in the sequence. It will provide for mathematical modeling of key electrification technologies, advanced laboratory assessment of electrical and mechanical components, and comprehensive discussion of the physics underpinning and connecting associated systems. There will be lecture and hands-on components.",
    "prereq": []
  },
  {
    "uid": "807581",
    "code": "MOT5224",
    "subject": "MOT",
    "number": "5224",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Tech Ldrsh & Mgmt",
    "fullname": "Introduction to Technological Leadership and Management: Assessing Emerging and Pivotal Technologies",
    "info": "Selected emerging technologies expected to play key roles in future industrial development.",
    "prereq": []
  },
  {
    "uid": "792660",
    "code": "MOT5991",
    "subject": "MOT",
    "number": "5991",
    "honors": false,
    "writingIntensive": false,
    "name": "MOT Independent Study Course",
    "fullname": "MOT Independent Study",
    "info": "Independent study in MOT-related topic.prereq: MOT grad student",
    "prereq": []
  },
  {
    "uid": "014589",
    "code": "MOT8111",
    "subject": "MOT",
    "number": "8111",
    "honors": false,
    "writingIntensive": false,
    "name": "Marketing Strategy for Tech",
    "fullname": "Marketing Strategy for Technology",
    "info": "Development of a rigorous analytical framework for marketing, specifically for technology-intensive organizations. The emphasis is on case studies of engineering and technology corporations. Technology and marketing strategy are interrelated through data-driven approaches. Recent case study subjects include companies in computing, artificial intelligence, electronics, renewable energy, and social media spaces. Comparisons between U.S. and international companies are also featured.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014591",
    "code": "MOT8112",
    "subject": "MOT",
    "number": "8112",
    "honors": false,
    "writingIntensive": false,
    "name": "Acctg & Fin Mgmt for Tech Org",
    "fullname": "Accounting and Financial Management for Technology-Based Organizations",
    "info": "Exploration of management accounting as an information framework to organize, evaluate, and report proprietary data in order to evaluate a firm's sustainable advantage in competitive tech markets. Adopts a case-driven approach to discuss how this data can be used for strategic decision-making for the firm. Emphasis on data analysis and financial statistics. Topics such as R&D investment, software costs, and manufacturing overhead are covered. Financial data analysis of numerous technology-intensive and engineering companies, including in software, computing, automotive, retail, and services sectors. prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014592",
    "code": "MOT8113",
    "subject": "MOT",
    "number": "8113",
    "honors": false,
    "writingIntensive": false,
    "name": "Operations Mgmt Comp Adv",
    "fullname": "Operations Management for Competitive Advantage",
    "info": "Overview of the relationships between the supply chain and operations with other functions. Analyzes the impact of process, people, and technology on supply chain and operations within manufacturing and service environments. Tools and concepts covered include manufacturing and supply chain operations, statistical process control and process control charts, process flow dynamics, engineering product specifications, process and product layout, modeling, and simulation. Industries discussed include aircraft, construction, machine shops, batch chemicals, oil refining, and food.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014593",
    "code": "MOT8114",
    "subject": "MOT",
    "number": "8114",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Tech Analysis",
    "fullname": "Strategic Technology Analysis",
    "info": "Technology, its creation, history, and dynamics/interaction with economics, industry, and society. Role of technology in business and management. Tools/techniques for analysis of technologies. Emerging technologies, their significance.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014594",
    "code": "MOT8121",
    "subject": "MOT",
    "number": "8121",
    "honors": false,
    "writingIntensive": false,
    "name": "Mng Org Tech Environ",
    "fullname": "Managing Organizations in a Technological Environment",
    "info": "General management principles for organizations, people, and business systems in technology-intensive industries. Application of managerial approaches to project, business, and corporate levels of organizations and to demands entrepreneurial/established technology firms.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014595",
    "code": "MOT8122",
    "subject": "MOT",
    "number": "8122",
    "honors": false,
    "writingIntensive": false,
    "name": "Financial Mgmt for Tech Org",
    "fullname": "Financial Management for Technology-based Organizations",
    "info": "Quantitative, rigorous overview of financial methods critical for technology-based managers and organizations. Key topics include creating and measuring value, projecting financial needs, and managing working capital. Outlines differences between corporate and venture finance with an emphasis on financing new ventures. Covers probability and statistics related to financial management. Introduces financial formulae and spreadsheets and toolkits for solutions. prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014596",
    "code": "MOT8131",
    "subject": "MOT",
    "number": "8131",
    "honors": false,
    "writingIntensive": false,
    "name": "Mngrl Decision Mkg",
    "fullname": "Problem Formulation and Managerial Decision Making",
    "info": "Characteristics of managerial decision making and concept of bounded rationality. General approach to defining unstructured problems encountered by upper management. Methods for problem expansion based on such lines of reasoning as cause-and-effect and systems thinking.",
    "prereq": []
  },
  {
    "uid": "014599",
    "code": "MOT8134",
    "subject": "MOT",
    "number": "8134",
    "honors": false,
    "writingIntensive": false,
    "name": "Mfg Processes",
    "fullname": "Support and Control of Manufacturing Processes",
    "info": "Overview of mechanical, microelectronic, and process industries. Discrete and continuous flow manufacturing. Impact of information technology on integration and automation of design and manufacturing. Concurrent engineering and emphasis on quality and reduced cycle time. Tools for computer-aided design, manufacturing, and standardization.",
    "prereq": []
  },
  {
    "uid": "014601",
    "code": "MOT8212",
    "subject": "MOT",
    "number": "8212",
    "honors": false,
    "writingIntensive": false,
    "name": "Devlp New Tech Products & Srvs",
    "fullname": "Developing New Technology Products and Services",
    "info": "Structured approach based on engineering principles for developing new products, including hardware, software, solutions, and services. The course covers all aspects of new offering developments including customer needs identification, idea generation, technology development, project execution, productization, and commercialization. Key topics covered include design thinking; stage-gate, waterfall, and agile development processes; metrics and tools for lean-agile execution; ideation and idea funnel management; road mapping and open innovation; and project portfolio management. prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014602",
    "code": "MOT8213",
    "subject": "MOT",
    "number": "8213",
    "honors": false,
    "writingIntensive": false,
    "name": "Macroenvironment of Tech",
    "fullname": "Macroenvironment of Technology",
    "info": "Development of scenarios of anticipated social, political, governmental, and economic forces affecting technological change. Use of scenarios to respond to industry threats, opportunities, and uncertainties. Corporate strategies, including building alliances for global competitiveness.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014603",
    "code": "MOT8214",
    "subject": "MOT",
    "number": "8214",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech Foresight and Forecast",
    "fullname": "Technology Foresight and Forecasting",
    "info": "Fundamental definitions, understanding, and dynamics of technology from several perspectives, including science, engineering, and society.  Introduces and applies tools and concepts for critical decision-making in engineering, research, and technology strategy. Topics include the analysis and forecasting of technology, the development of product and technology roadmaps, and how to identify new technologies that are relevant to the company or organization. prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "818537",
    "code": "MOT8218",
    "subject": "MOT",
    "number": "8218",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Transformation",
    "fullname": "Digital Transformation",
    "info": "Effective methods to transform into a digital organization. Examines how a highly intentional collaboration between technology and business leaders can identify what being digital means for a company and where it is on the digital maturity continuum. Discusses pragmatic digital transformation journeys grounded in firms' experiences. Digital transformation topics discussed include machine learning, artificial intelligence, blockchain, data science, and software/platform-as-a-service.prereq Grad MOT major.",
    "prereq": []
  },
  {
    "uid": "014612",
    "code": "MOT8221",
    "subject": "MOT",
    "number": "8221",
    "honors": false,
    "writingIntensive": false,
    "name": "Program/Project Management",
    "fullname": "Program/Project Management",
    "info": "Effective project management principles to support both core operations and innovation growth. Emphasizes practical application for effective planning and execution of complex engineering and technology projects. Leading program management methodologies covered including Project Management Professional requirements, Six Sigma, Lean, and Design for Six Sigma. Knowledge management features frameworks for evaluating knowledge assets as well as for knowledge transfer in technology organizations.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014613",
    "code": "MOT8224",
    "subject": "MOT",
    "number": "8224",
    "honors": false,
    "writingIntensive": false,
    "name": "Pivotal Technologies",
    "fullname": "Pivotal Technologies",
    "info": "Analysis and application of transformational technologies are expected to play key roles in future industrial development. Discusses the state-of-the-art status and analyzes commercialization barriers and opportunities. Includes group analysis of potential applications to various industry sectors. Students’ presentations discuss how developments in emerging technologies such as robotics, quantum computing, digital ledgers, advanced batteries, autonomous vehicles, the internet of things, and industry 4.0 can be engineered towards new products and services, and what application domains these could be deployed for. prereq: MOT grad major",
    "prereq": []
  },
  {
    "uid": "014614",
    "code": "MOT8231",
    "subject": "MOT",
    "number": "8231",
    "honors": false,
    "writingIntensive": false,
    "name": "Mng Info Resources Tech Org",
    "fullname": "Managing Information Resources in Technology-based Organizations",
    "info": "Managing information resources/technology in an organization where technology is a critical part of value chain. Database management systems, electronic commerce. Managerial issues: strategic planning for IT/IS, infrastructure, outsourcing, competitive value, implementation.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "789786",
    "code": "MOT8232",
    "subject": "MOT",
    "number": "8232",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Tech Innovation",
    "fullname": "Managing Technological Innovation",
    "info": "Understanding innovation's role as the primary driver of business success. Critical analysis of innovation drivers: building organizations for sustained innovation, digital and large-scale transformation, bringing ideas to market in existing businesses and new ventures, and measuring and enhancing the innovation ecosystem. Engineering approaches for reducing risk for high-impact innovation.prereq: Grad MOT major.",
    "prereq": []
  },
  {
    "uid": "014616",
    "code": "MOT8233",
    "subject": "MOT",
    "number": "8233",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Mgmt of Tech",
    "fullname": "Strategic Management of Technology",
    "info": "Identifying key issues, formulating strategies for situations involving business/technology. Industry dynamics, competitive challenges for improving corporate performance and leveraging technological competence.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014617",
    "code": "MOT8234",
    "subject": "MOT",
    "number": "8234",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Project",
    "fullname": "Capstone Project",
    "info": "Practical project applying MOT concepts and methods to an opportunity in the student's workplace. Faculty advisors serve as consultants, under nondisclosure agreements where needed. Recommendations and action plans generated, often providing immediate return on investment for students and employers from the MOT program. Recent capstone topics include new product introduction framework for a large manufacturing company, energy efficiency in construction, the development of a knowledge management strategies for nonprofit organizations, technology strategy and roadmap development processes for enterprises, technology-intensive entrepreneurial ventures, and applications prereq: Completion of two semesters, grad MOT major",
    "prereq": []
  },
  {
    "uid": "788245",
    "code": "MOT8333",
    "subject": "MOT",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "811347",
    "code": "MOT8500",
    "subject": "MOT",
    "number": "8500",
    "honors": false,
    "writingIntensive": false,
    "name": "Innov Ldrsh & Org Effectv",
    "fullname": "Innovation Leadership and Organizational Effectiveness",
    "info": "Made up of four ½ credit units that unfold over four semesters of MOT program. Building talent, organizational capability, culture needed to execute innovation strategy.prereq: MOT major",
    "prereq": []
  },
  {
    "uid": "814916",
    "code": "MOT8501",
    "subject": "MOT",
    "number": "8501",
    "honors": false,
    "writingIntensive": false,
    "name": "Leading Indv & Team Perform.",
    "fullname": "Leading Individual & Team Performance",
    "info": "Develop the context and capability innovation leaders need to optimize engagement and performance at the individual and team levels. Emphasis is placed on foundational principles, capabilities and practices that help leaders self-manage, engage and influence diverse team members, and generate shared commitment for team and project success.prereq: MOT grad major",
    "prereq": []
  },
  {
    "uid": "815367",
    "code": "MOT8502",
    "subject": "MOT",
    "number": "8502",
    "honors": false,
    "writingIntensive": false,
    "name": "Innovat Leadrshp & Org Effectv",
    "fullname": "Innovation Leadership and Organizational Effectiveness",
    "info": "The MOT 8501 and 8502 sequence provides emerging and mid-career technology professionals with the leadership mindset, tool set, and skill set needed to focus, align, and engage multi-disciplinary individuals and teams in translating technology assets and foresight into customer solutions that generate profitable growth. MOT 8502 explores the role of outstanding leaders as developers of innovation strategy and architects of the organizational capability and team commitment needed to execute strategic choices. Emphasis is placed on principles and practices that help leaders focus on the right strategies, build the organizational capability required to execute a strategy, foster continuous improvement in individual and business performance, and lead change initiatives to sustain commitment versus compliance across diverse stakeholders. Students will practice improving their team effectiveness and develop a change leadership plan to support implementation of a key business initiative.",
    "prereq": []
  },
  {
    "uid": "014618",
    "code": "MOT8900",
    "subject": "MOT",
    "number": "8900",
    "honors": false,
    "writingIntensive": false,
    "name": "Conflict Mgmt",
    "fullname": "Conflict Management",
    "info": "Theory and methods for applying conflict management techniques in organizations. Cooperative and competitive models of conflict, basics of bargaining, conflict strategies, communication styles, listening skills, dispute resolution, third-party mediation, and use of computers for conflict mediation.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014619",
    "code": "MOT8910",
    "subject": "MOT",
    "number": "8910",
    "honors": false,
    "writingIntensive": false,
    "name": "Corp Responsibility",
    "fullname": "Corporate Responsibility",
    "info": "Principles of stakeholder management. Ethical framework for responsible management of investors, employees, suppliers, customers, and external community. Moral leadership, trust in organizations, and quality control. New metaphors and techniques for managing the socially responsible organization.prereq: Grad MOT major",
    "prereq": []
  },
  {
    "uid": "014621",
    "code": "MOT8920",
    "subject": "MOT",
    "number": "8920",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci & Tech Policy",
    "fullname": "Science and Technology Policy",
    "info": "Overview of the role of government and the influence of companies and individuals related to science and technology policy. Reviews and evaluates current and proposed regional, national, and global technology-related public policies. Emphasis on rigorous, systematic principles for navigating the policy landscape, such as the Bardach framework.\nprereq: MOT grad student",
    "prereq": []
  },
  {
    "uid": "809500",
    "code": "MOT8921",
    "subject": "MOT",
    "number": "8921",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Management of Technolog",
    "fullname": "Global Management of Technology",
    "info": "Global management of technology.\n\nprereq: MOT student",
    "prereq": []
  },
  {
    "uid": "787917",
    "code": "MOT8930",
    "subject": "MOT",
    "number": "8930",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Emerg Tech",
    "fullname": "Topics in Emerging Technologies",
    "info": "Invited speakers give half- or full-day seminars on special topics in emerging technologies (e.g., energy systems, tissue engineering, thermal spray coating technology).prereq: MOT grad student",
    "prereq": []
  },
  {
    "uid": "787921",
    "code": "MOT8940",
    "subject": "MOT",
    "number": "8940",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Intellectual Property",
    "fullname": "Managing Intellectual Property",
    "info": "Managing technology by protecting intellectual property rights. Analyzes various intellectual property areas—patents, copyrights, trade secrets, publications, etc.—and the protection afforded by each. Leverages protection strategies based on company culture, market pace, and technology maturity. Case studies and discussions centered around high-tech companies, including in the information technology, manufacturing, consumer goods, and electronics industry sectors.prereq: MOT grad student",
    "prereq": []
  },
  {
    "uid": "787922",
    "code": "MOT8950",
    "subject": "MOT",
    "number": "8950",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Mgmt of Tech Proj",
    "fullname": "International Management of Technology Project",
    "info": "On-site residency in international locations for up to two weeks. Visits to local, technology-intensive companies. Lectures/discussions with company executives, government officials, and university faculty. Comparative analysis of management of technology concepts/issues in an international business context: social, economic, cultural, and governmental perspectives. Written assignment required.prereq: MOT grad student",
    "prereq": []
  },
  {
    "uid": "817474",
    "code": "MOT8960",
    "subject": "MOT",
    "number": "8960",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt Technology & Innovation",
    "fullname": "Seminars in Management of Technology (MOT) and Innovation",
    "info": "Guest lectures and panels featuring technology leaders from the private and public sectors. Focuses on experiential learnings from breakthrough innovation; entrepreneurship and intrapreneurship; emerging technologies and markets; technology, business, and policy interplays; and the regional high-tech ecosystem. Guest lecturers have included Chief Technology Officers, Vice Presidents of Engineering, and CEOs of emerging-technology startups.prereq: MOT grad major",
    "prereq": []
  }
]