[
  {
    "uid": "819425",
    "code": "MSBA6111",
    "subject": "MSBA",
    "number": "6111",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Essentials",
    "fullname": "Business Essentials",
    "info": "Introduction to fundamental concepts and applications in core business disciplines such as financial accounting, marketing, operations, and strategy, with an emphasis on their connection to business analytics. The course aims to increase students’ business acumen and allows them to effectively partner with key functional areas of an organization. ",
    "prereq": []
  },
  {
    "uid": "811243",
    "code": "MSBA6121",
    "subject": "MSBA",
    "number": "6121",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Stats for Scientists",
    "fullname": "Introduction to Statistics for Data Scientists",
    "info": "This course is designed to develop statistical thinking, i.e., understanding variation and using data to identify possible sources of variation. Specific techniques include basic descriptive and inferential procedures and regression modeling. The emphasis is on understanding such analysis for their relevance to decision making. ",
    "prereq": []
  },
  {
    "uid": "819426",
    "code": "MSBA6131",
    "subject": "MSBA",
    "number": "6131",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Business Analytics",
    "fullname": "Introduction to Business Analytics in R",
    "info": "Introduction to key processes, building blocks, and use cases of business analytics through R, including data acquisition, engineering, visualization, basic concepts of exploratory and predictive analytics, and lifecycle of business analytics projects.",
    "prereq": []
  },
  {
    "uid": "816435",
    "code": "MSBA6141",
    "subject": "MSBA",
    "number": "6141",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics and Data Privacy",
    "fullname": "Ethics and Data Privacy",
    "info": "Explore the moral, social, ethical, and legal ramifications of the choices made at the different stages of the data analysis pipeline, from data collection and storage to analysis and use. Students will learn the basics of ethical thinking in data science, understand the history of ethical dilemmas in scientific work, study issues of fairness, transparency, and algorithmic bias associated with machine learning, and explore the distinct challenges associated with ethics and privacy in modern data science. ",
    "prereq": []
  },
  {
    "uid": "810881",
    "code": "MSBA6250",
    "subject": "MSBA",
    "number": "6250",
    "honors": false,
    "writingIntensive": false,
    "name": "Analytics for Comp. Adv. II",
    "fullname": "Analytics for Competitive Advantage II",
    "info": "Case/discussion-based introduction to variety of analytics-related issues/examples in business. Business value, impact, benefits/limitations, as well as ethical, legal, privacy issues. Use of case studies, examples, guest speakers.",
    "prereq": []
  },
  {
    "uid": "816002",
    "code": "MSBA6255",
    "subject": "MSBA",
    "number": "6255",
    "honors": false,
    "writingIntensive": false,
    "name": "Analytics for Comp. Adv. I",
    "fullname": "Analytics for Competitive Advantage I",
    "info": "Quantitative problem solving formulation and solving skills.",
    "prereq": []
  },
  {
    "uid": "810882",
    "code": "MSBA6311",
    "subject": "MSBA",
    "number": "6311",
    "honors": false,
    "writingIntensive": false,
    "name": "Programming for Data Science",
    "fullname": "Programming for Data Science",
    "info": "According to recent industry surveys, Python is one of the most popular tools used by organizations data analysis. We will explore the emerging popularity of Python for tasks such as general purpose computing, data analysis, website scraping, and data visualization. You will first learn the basics of the Python language.  Participants will then learn how to apply functionality from powerful and popular data science-focused libraries. In addition, we will learn advanced programming techniques such as lambda functions and closures. We will spend most of our class time completing practical hands-on exercises.",
    "prereq": []
  },
  {
    "uid": "810883",
    "code": "MSBA6321",
    "subject": "MSBA",
    "number": "6321",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Mgmt, DB & Data Warehsing",
    "fullname": "Data Management, Databases, and Data Warehousing",
    "info": "Fundamentals of database modeling/design, normalization. Extract, transform, load. Data cubes/setting up data warehouse. Data pre-processing, quality, integration/stewardship issues. Advances in database/storage technologies.",
    "prereq": []
  },
  {
    "uid": "810884",
    "code": "MSBA6331",
    "subject": "MSBA",
    "number": "6331",
    "honors": false,
    "writingIntensive": false,
    "name": "Big Data Analytics",
    "fullname": "Big Data Analytics",
    "info": "Exploring big data infrastructure and ecosystem, ingesting and managing big data, analytics with big data; Hadoop, MapReduce, Hive, Spark, scalable machine Learning, scalable real-time streaming analytics, NoSQL, cloud computing, and other recent developments in big data.",
    "prereq": []
  },
  {
    "uid": "810885",
    "code": "MSBA6345",
    "subject": "MSBA",
    "number": "6345",
    "honors": false,
    "writingIntensive": false,
    "name": "Consult Prob-Solv & Agile Mgmt",
    "fullname": "Consultative Problem-Solving & Agile Management for Analytics Projects",
    "info": "Consultative problem-solving techniques, including using collaborative frameworks to bring strategic thinking skills to analytics projects. Project management skills with a focus on the Agile mindset and the implementation of Scrum practices using tools such as Jira and Confluence. Teams will apply these skills in real-time through the Business Analytics Experiential Learning Project which will be run in conjunction with this course.prereq: MSBA student",
    "prereq": []
  },
  {
    "uid": "814379",
    "code": "MSBA6355",
    "subject": "MSBA",
    "number": "6355",
    "honors": false,
    "writingIntensive": false,
    "name": "Building and Managing Teams",
    "fullname": "Building and Managing Teams",
    "info": "Examine individual, group and organizational aspects of team effectiveness; learn and practice basic skills central to team management; develop appreciation for team leadership function; learn the tools for effective team decision making and conflict management; develop general diagnostic skills for assessment of team issues within and across organizations and national boundaries.",
    "prereq": []
  },
  {
    "uid": "810887",
    "code": "MSBA6411",
    "subject": "MSBA",
    "number": "6411",
    "honors": false,
    "writingIntensive": false,
    "name": "Exploratory Data Analytics",
    "fullname": "Exploratory Data Analytics",
    "info": "Fundamentals of exploratory business analytics. Solving real-world business problems using appropriate data analysis techniques and effective technical/managerial communication. Foundational methods allow for the detection of relationships and patterns in structured and unstructured data through clustering, dimensionality reduction,  probabilistic graphical models, anomaly detection, and deep neural networks.",
    "prereq": []
  },
  {
    "uid": "810888",
    "code": "MSBA6421",
    "subject": "MSBA",
    "number": "6421",
    "honors": false,
    "writingIntensive": false,
    "name": "Predictive Analytics",
    "fullname": "Predictive Analytics",
    "info": "Fundamentals of predictive modeling and machine learning, assessing the performance of predictive models: logistic regression, decision trees, naïve Bayesian classifiers, support vector machine, ensemble learning, deep neural network, and their applications in structured and unstructured data.",
    "prereq": []
  },
  {
    "uid": "811000",
    "code": "MSBA6431",
    "subject": "MSBA",
    "number": "6431",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Issues in Bus Analytics",
    "fullname": "Advanced Issues in Business Analytics",
    "info": "Analysis of time series data, interpretation and forecasting; fundamentals of network analysis, mining digital media and social networks, community detection and friend recommendation; personalization technologies, and recommender systems.",
    "prereq": []
  },
  {
    "uid": "811001",
    "code": "MSBA6441",
    "subject": "MSBA",
    "number": "6441",
    "honors": false,
    "writingIntensive": false,
    "name": "Inference via Ecnmtrcs Exprmnt",
    "fullname": "Causal Inference via Econometrics and Experimentation",
    "info": "Controlled experiments in business settings, experiment design, A/B testing. Specialized statistical methodologies. Fundamentals of econometrics, instrument variable regression, propensity score matching.",
    "prereq": []
  },
  {
    "uid": "811002",
    "code": "MSBA6451",
    "subject": "MSBA",
    "number": "6451",
    "honors": false,
    "writingIntensive": false,
    "name": "Optmzng/Simulation Decsn Mkng",
    "fullname": "Optimization and Simulation for Decision Making",
    "info": "Fundamentals of decision analysis, linear optimization, mixed integer linear programming, Bayesian inference, Monte Carlo simulation, and decision technologies.",
    "prereq": []
  },
  {
    "uid": "820231",
    "code": "MSBA6461",
    "subject": "MSBA",
    "number": "6461",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced AI for Bus Apps",
    "fullname": "Advanced AI for Business Applications",
    "info": "This course covers some advanced topics in machine learning and artificial intelligence for solving analytics problems and building business applications. Topics include but are not limited to: reinforcement learning and recent advances on natural language processing. Students are introduced to the basic concepts of reinforcement learning such as Markov decision process, bandits, and regret minimization, and are trained to build simple and practical reinforcement learning systems. The course also discusses some recent progress in natural language processing / understanding, such as representation learning, sequential models, and transformer models, as well as their business applications.",
    "prereq": []
  },
  {
    "uid": "812404",
    "code": "MSBA6511",
    "subject": "MSBA",
    "number": "6511",
    "honors": false,
    "writingIntensive": false,
    "name": "BA Experiential Learning",
    "fullname": "Business Analytics Experiential Learning",
    "info": "This course involves hands-on application of the analytics methodologies, techniques, and tools learned throughout the program to a real-world problem (such as consulting for a real-world business client in the area of marketing, strategy, operation/supply chain, information technology, finance, accounting, or human resources) as well as the development and presentation of results, interpretations, insights, and recommendations.",
    "prereq": []
  },
  {
    "uid": "817193",
    "code": "MSBA6515",
    "subject": "MSBA",
    "number": "6515",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Project in Analytics",
    "fullname": "Capstone Project in Analytics",
    "info": "Hands-on, integrative application of analytics methodologies, techniques, and tools learned throughout the program in the context of a specific analytics problem. Experience with the entire data analytics cycle, starting from business and data understanding as well as data cleaning and integration and ending with the development and presentation of results, interpretations, insights, and recommendations.",
    "prereq": []
  }
]