[
  {
    "uid": "797544",
    "code": "NUTR5621W",
    "subject": "NUTR",
    "number": "5621",
    "honors": false,
    "writingIntensive": true,
    "name": "Macronutrient Metabolism",
    "fullname": "Macronutrient Metabolism",
    "info": "Carbohydrate, lipid, protein, and energy metabolism. Systems/holistic approaches of metabolic pathways. Regulation/alteration of metabolic pathways. Macronutrient metabolism techniques/research.",
    "prereq": []
  },
  {
    "uid": "797545",
    "code": "NUTR5622",
    "subject": "NUTR",
    "number": "5622",
    "honors": false,
    "writingIntensive": false,
    "name": "Vitamin & Mineral Biochemistry",
    "fullname": "Vitamin and Mineral Biochemistry",
    "info": "Nutritional, biochemical, and physiological aspects of vitamins and essential minerals in human and experimental-animal models.\n\nprereq: BioC 3021, Phsl 3051, FSCN 4612",
    "prereq": {
      "and": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "PHSL 3051",
          "subject": "PHSL",
          "id": "3051"
        },
        {
          "code": "FSCN 4612",
          "subject": "FSCN",
          "id": "4612"
        }
      ]
    }
  },
  {
    "uid": "797555",
    "code": "NUTR5623W",
    "subject": "NUTR",
    "number": "5623",
    "honors": false,
    "writingIntensive": true,
    "name": "Regulation of Energy Balance",
    "fullname": "Regulation of Energy Balance",
    "info": "Regulation of energy balance in humans, including regulation of food intake and energy expenditure.",
    "prereq": []
  },
  {
    "uid": "800716",
    "code": "NUTR5624",
    "subject": "NUTR",
    "number": "5624",
    "honors": false,
    "writingIntensive": false,
    "name": "Nutrition and Genetics",
    "fullname": "Nutrition and Genetics",
    "info": "Overview of gene-diet interactions and relevant technologies used to study such interactions. Nutrigenomics, epigenetics, transcriptomics, proteomics, metabolomics. Examples of gene-diet interactions, implications. Current issues.Prerequisites: Courses in Nutritional Biochemistry (e.g., NUTR 5625), and Vitamin and Mineral Biochemistry (e.g., NUTR 5622), or consent of instructor",
    "prereq": {
      "and": [
        {
          "code": "NUTR 5625",
          "subject": "NUTR",
          "id": "5625"
        },
        {
          "code": "NUTR 5622",
          "subject": "NUTR",
          "id": "5622"
        }
      ]
    }
  },
  {
    "uid": "805131",
    "code": "NUTR5625",
    "subject": "NUTR",
    "number": "5625",
    "honors": false,
    "writingIntensive": false,
    "name": "Nutritional Biochemistry",
    "fullname": "Nutritional Biochemistry",
    "info": "Overview of biochemical molecules and pathways important in nutritional events.prereq: BIOC 3021 or instr consent",
    "prereq": {
      "code": "BIOC 3021",
      "subject": "BIOC",
      "id": "3021"
    }
  },
  {
    "uid": "805132",
    "code": "NUTR5626",
    "subject": "NUTR",
    "number": "5626",
    "honors": false,
    "writingIntensive": false,
    "name": "Nutritional Physiology",
    "fullname": "Nutritional Physiology",
    "info": "Whole body macronutrient metabolism as it relates to etiology of metabolic diseases. Signaling between tissues to control homeostasis. How dysregulation of crosstalk can lead to metabolic diseases. How diet, exercise, or starvation impact metabolism. Regulation of food intake and energy expenditure. Designing/analyzing/interpreting research data.prereq: NUTR 5625",
    "prereq": {
      "code": "NUTR 5625",
      "subject": "NUTR",
      "id": "5625"
    }
  },
  {
    "uid": "808037",
    "code": "NUTR5627",
    "subject": "NUTR",
    "number": "5627",
    "honors": false,
    "writingIntensive": false,
    "name": "Nutritional & Food Toxicology",
    "fullname": "Nutritional and Food Toxicology",
    "info": "Toxic agents, organisms, and toxic effects that are important in the toxic events, with a focus on food toxicants and nutrient-toxicant interaction.prereq: BIOC 3021; designed for students majoring in [nutrition or food science or toxicology]",
    "prereq": {
      "code": "BIOC 3021",
      "subject": "BIOC",
      "id": "3021"
    }
  },
  {
    "uid": "819595",
    "code": "NUTR5993",
    "subject": "NUTR",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. prereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "819596",
    "code": "NUTR5994",
    "subject": "NUTR",
    "number": "5994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carriesout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use theUniversity-wide on-line directed research contract process in order to enroll. Prereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "uid": "826133",
    "code": "NUTR6014",
    "subject": "NUTR",
    "number": "6014",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Nutrition Ed & Counseling",
    "fullname": "Advanced Nutrition Education and Counseling",
    "info": "Effective counseling skills are especially important for clinical dietitians. This course will build off the basic nutrition counseling skills covered in FSCN 3614, and help students develop advanced skills needed to navigate difficult interactions, understand diverse patient populations, and communicate complex concepts in an educational setting.This course is suitable for advanced/graduate-level dietetics students, entry-level practitioners, and seasoned professionals who want to refresh their skills.The first half of the course will focus on Motivational Interviewing, and the second half will focus on several specific patient populations and communication issues that may arise during nutrition counseling sessions. We will discuss establishing rapport with patients who have food insecurity, neurodivergence, chronic health conditions, personality disorders, and challenging family dynamics. You will develop skills and explore these concepts through application by practicing in small group breakout sessions and by completing written assignments.",
    "prereq": []
  },
  {
    "uid": "826132",
    "code": "NUTR6064",
    "subject": "NUTR",
    "number": "6064",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Trends in Dietetics",
    "fullname": "Current Trends in the Dietetics Profession",
    "info": "This course will explore current trends and issues in the dietetics profession.  We will review the Academy of Nutrition and Dietetics’ code of ethics, scope of practice, standards of professional performance and professional development.Students will develop skills in salary negotiation and familiarity with the legislative process surrounding dietetics.  Additional topics will include sustainability, fad diets, and inter-professional education.  This course allows the student to demonstrate formulation and analysis of professional opinions based on current research and evidence-based resources.",
    "prereq": []
  },
  {
    "uid": "826134",
    "code": "NUTR6067",
    "subject": "NUTR",
    "number": "6067",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Decision-Making",
    "fullname": "Clinical Decision-Making in Nutrition",
    "info": "Real-world patients often present with complex medical and social histories, comorbidities, individual health beliefs and values, and other complexities that do not fit within simple, clear clinical guidelines, or have clinical conditions for which research and clinical guidelines for nutrition therapy are lacking. Thus, clinical decision-making is an essential skill for evidence-based dietetics practice.In this course, students will apply current research, evidence-based guidelines, foundational knowledge in medical nutrition therapy, ethical practice principles, and critical thinking skills to work through a variety of complex clinical case studies using the steps of the Nutrition Care Process.",
    "prereq": []
  },
  {
    "uid": "826316",
    "code": "NUTR8001",
    "subject": "NUTR",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Nutrition Grad Orientation",
    "fullname": "Orientation to the Nutrition Graduate Program",
    "info": "Orientation to nutrition graduate program. Presenting scientific seminars, using electronic presentation programs and equipment.",
    "prereq": []
  },
  {
    "uid": "788251",
    "code": "NUTR8333",
    "subject": "NUTR",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "825931",
    "code": "NUTR8411",
    "subject": "NUTR",
    "number": "8411",
    "honors": false,
    "writingIntensive": false,
    "name": "Obesity Prevention",
    "fullname": "Obesity Prevention - From the Molecule to the Bedside",
    "info": "This course will cover research topics in obesity prevention at a graduate level.  The course will emphasize a multidisciplinary understanding of obesity in the following areas:• Adipocyte biology, including relevant issues relating to fat storage, retrieval, and trafficking of intracellular energy; adipose tissue function at a system level especially factors favoring fat storage and retrieval.• Physiology of obesity, to include neural and hormonal influences on energy balance, including brain mechanisms of appetite, feedback mechanisms triggered by negative energy balance, hedonic mechanisms, and feedback systems triggered by excess consumption. The interaction between obesity and hypertension, inflammation, cardiovascular disease, sleep, exercise, stress and the microbiome. • Clinical consequences of obesity with specific reference to the many organ system dysfunctions related to excess body weight. Treatment of obesity, with understanding of behavior change therapies. Bariatric and pharmaceutical approaches to the treatment of obesity, with emphasis on basic mechanisms involving brain, adipose tissue, and adipocytes. We will also cover special issues related to fetal programming of diabetes and pediatric obesity. Study design and analyses for studies will be discussed within all arms. Students will engage in critical evaluation of literature in biological and clinical obesity prevention research. Course learning objectives:  The student will gain a comprehensive understanding of adipocyte biology and function; animal obesity models; physiology of body fat regulation; central nervous system regulation of energy intake and energy expenditure; cardiovascular disease, hypertension, stress, microbiome and sleep effects in obesity; genetic and individual propensity for obesity; fetal programming of diabetes and clinical consequences and treatment of obesity in adults and children; pharmaceutical approaches; an understanding of design and analyses in all types of studies, and an ability to critically analyze relevant literature. Prerequisites:  This 8000 level course is intended for graduate students pursuing graduate work in a health science-related program.  Undergraduate degrees can include, but are not limited to, a Bachelor of Science in nutrition, physiology, integrative biology or other related degree.  The instructor will consider other majors on an individual basis and permission.",
    "prereq": {
      "code": "NUTR 8000",
      "subject": "NUTR",
      "id": "8000"
    }
  },
  {
    "uid": "788383",
    "code": "NUTR8444",
    "subject": "NUTR",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "011138",
    "code": "NUTR8610",
    "subject": "NUTR",
    "number": "8610",
    "honors": false,
    "writingIntensive": false,
    "name": "Nutr Grad Seminar",
    "fullname": "Nutrition Graduate Seminar",
    "info": "Presentation of thesis (M.S. or Ph.D.) or plan B project work in public seminar.",
    "prereq": []
  },
  {
    "uid": "812614",
    "code": "NUTR8611",
    "subject": "NUTR",
    "number": "8611",
    "honors": false,
    "writingIntensive": false,
    "name": "Nutrition and Cancer",
    "fullname": "The Role of Nutrition in Cancer Causation and Prevention",
    "info": "This is a lecture and seminar based course that covers issues in nutrition and cancer, with an emphasis on the role of nutritional factors in the etiology and prevention of cancer and how nutrition research is translated into dietary recommendations for cancer prevention. During the seminars, students will discuss current epidemiological, clinical and laboratory evidences on modulation of cancer risk by dietary factors.prereq: FScN 1112 (Principles of Nutrition), FScN 4612 (Advanced Human Nutrition), NUTR 5626 (Nutritional Physiology), Toxicology, Advanced Biology/Biochemistry/Genetics/Molecular Biology",
    "prereq": {
      "and": [
        {
          "and": [
            {
              "code": "FSCN 1112",
              "subject": "FSCN",
              "id": "1112"
            },
            {
              "code": "FSCN 4612",
              "subject": "FSCN",
              "id": "4612"
            }
          ]
        },
        {
          "code": "NUTR 5626",
          "subject": "NUTR",
          "id": "5626"
        }
      ]
    }
  },
  {
    "uid": "012379",
    "code": "NUTR8612",
    "subject": "NUTR",
    "number": "8612",
    "honors": false,
    "writingIntensive": false,
    "name": "Diet & Chronic Disease",
    "fullname": "Advances in Nutrition: Diet and Chronic Disease",
    "info": "Recent research on relationship of diet to development/treatment of chronic diseases, including cancer, diabetes, and osteoporosis. Clinical, animal, and cell culture studies examined epidemiologically.",
    "prereq": []
  },
  {
    "uid": "012392",
    "code": "NUTR8613",
    "subject": "NUTR",
    "number": "8613",
    "honors": false,
    "writingIntensive": false,
    "name": "Lipopro, Cholest",
    "fullname": "Advances in Nutrition: Lipoproteins, Cholesterol, and Atherosclerosis",
    "info": "Lipoprotein biochemistry and physiology, environmental and genetic factors influencing cholesterol metabolism, efficacy of diet therapy and lipid lowering in heart disease prevention, use of drugs in atherosclerosis, putative role of lipoprotein oxidation in atherosclerosis. Human studies and animal models in atherosclerosis research.",
    "prereq": []
  },
  {
    "uid": "012399",
    "code": "NUTR8614",
    "subject": "NUTR",
    "number": "8614",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Energy Balance",
    "fullname": "Advances in Nutrition: Advanced Energy Balance",
    "info": "Recent literature on energy balance and body composition in animals and humans.",
    "prereq": []
  },
  {
    "uid": "012401",
    "code": "NUTR8615",
    "subject": "NUTR",
    "number": "8615",
    "honors": false,
    "writingIntensive": false,
    "name": "Exercise Metabolism",
    "fullname": "Advances in Nutrition: Exercise Metabolism",
    "info": "Review of research on effects of diet on exercise metabolism.",
    "prereq": []
  },
  {
    "uid": "012402",
    "code": "NUTR8616",
    "subject": "NUTR",
    "number": "8616",
    "honors": false,
    "writingIntensive": false,
    "name": "Micro Nutrients",
    "fullname": "Advances in Nutrition: Free Radicals, Trace Elements, and Other Micronutrients",
    "info": "Free radical chemistry, cellular biology, and micronutrient nutrition considered in roles of pro-oxidants and antioxidants in human diseases and aging. Current understanding of biological action of free radicals and role of micronutrients in antioxidant protection in humans and animals.",
    "prereq": []
  },
  {
    "uid": "788956",
    "code": "NUTR8617",
    "subject": "NUTR",
    "number": "8617",
    "honors": false,
    "writingIntensive": false,
    "name": "Cancer and Chemoprevention",
    "fullname": "Chemical Carcinogenesis and Chemoprevention",
    "info": "Fundamental background in  chemical carcinogenesis, carcinogen activation/detoxification, carcinogen-DNA adduct formation, cellular oncogenesis, cancer chemoprevention, nutrition/cancer. Topics integrated/interrelated.",
    "prereq": []
  },
  {
    "uid": "791849",
    "code": "NUTR8618",
    "subject": "NUTR",
    "number": "8618",
    "honors": false,
    "writingIntensive": false,
    "name": "Neuroregulation of Metabolism",
    "fullname": "Neuroregulation of Energy Metabolism",
    "info": "Advanced topics on neural regulation of food intake and energy expenditure. Neurotransmitters, including NPY, opioids, urocortin, melanocortins, oxytocin, and vasopressin. Genetics of obesity. Behavioral aspects of feeding. Energy balance. Macronutrient specific appetite. Energy expenditure. Uncoupling proteins. Vagal feeding regulation. Drug therapy for obesity. Eating disorders. Students read/discuss key research papers.",
    "prereq": []
  },
  {
    "uid": "012373",
    "code": "NUTR8620",
    "subject": "NUTR",
    "number": "8620",
    "honors": false,
    "writingIntensive": false,
    "name": "Advances in Nutrition",
    "fullname": "Advances in Nutrition",
    "info": "Recent research or special topics (e.g., obesity, vitamin biochemistry, nutrition education).",
    "prereq": []
  },
  {
    "uid": "011139",
    "code": "NUTR8621",
    "subject": "NUTR",
    "number": "8621",
    "honors": false,
    "writingIntensive": false,
    "name": "Presentation Skills",
    "fullname": "Presentation Skills",
    "info": "Orientation to nutrition graduate program. Presenting scientific seminars, using electronic presentation programs/equipment.prereq: dept consent",
    "prereq": []
  },
  {
    "uid": "788505",
    "code": "NUTR8666",
    "subject": "NUTR",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbdprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "787915",
    "code": "NUTR8695",
    "subject": "NUTR",
    "number": "8695",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study: Nutrition",
    "fullname": "Independent Study: Nutrition",
    "info": "Written report for master's plan B project.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "788633",
    "code": "NUTR8777",
    "subject": "NUTR",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "787900",
    "code": "NUTR8888",
    "subject": "NUTR",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "789997",
    "code": "NUTR8900",
    "subject": "NUTR",
    "number": "8900",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Lifestyle Nutr",
    "fullname": "Advances in Nutrition: Advanced Lifestyle Nutrition",
    "info": "Evaluation and discussion of research and research issues in nutrition during various stages of the life cycle. Methodological issues of applied human nutrition investigation, current status of knowledge, and implication of research results to public health policies, programs, and future research.",
    "prereq": []
  }
]