[
  {
    "uid": "826109",
    "code": "ORSU7100",
    "subject": "ORSU",
    "number": "7100",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopedic Boot Camp",
    "fullname": "Orthopedic Surgery Boot Camp",
    "info": "The orthopedic surgery bootcamp is focused on students who are planning for residency and careers in orthopedic surgery. The course will provide foundational medical knowledge in orthopedic musculoskeletal concepts, simulations of surgical/procedural techniques, key points for the optimal functioning of the surgical team and interprofessional education, and management of patients across the continuum of orthopedic care. prereq: SURG 7500 or OBST 7500",
    "prereq": {
      "or": [
        {
          "code": "SURG 7500",
          "subject": "SURG",
          "id": "7500"
        },
        {
          "code": "OBST 7500",
          "subject": "OBST",
          "id": "7500"
        }
      ]
    }
  },
  {
    "uid": "011595",
    "code": "ORSU7180",
    "subject": "ORSU",
    "number": "7180",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedics I Elec",
    "fullname": "Orthopaedics I",
    "info": "A brief survey course with exposure to a large number of patients, rather than a didactic and highly structured course. Instruction is given by audiovisual technique, conference, and seminars, in addition to teaching primarily in the outpatient clinic. There are opportunities for participation in the inpatient service and in surgery for the student interested in this additional experience. To round out the somewhat limited experience inherent in a three week rotation, independent study ofthe text, Disorders and Disease of the Musculoskeletal System, by Robert B. Salter, is strongly recommended. ",
    "prereq": []
  },
  {
    "uid": "011596",
    "code": "ORSU7185",
    "subject": "ORSU",
    "number": "7185",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Orthopaedic Surg",
    "fullname": "Acting Intern Orthopaedic Surgery",
    "info": "This course provides a more comprehensive, detailed exposure to orthopaedics for those students who are interested in orthopaedics or another surgical specialty, or who desire more experience in preparation for a career in family practice.",
    "prereq": []
  },
  {
    "uid": "011597",
    "code": "ORSU7186",
    "subject": "ORSU",
    "number": "7186",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Surg Research",
    "fullname": "Orthopaedic Surgery Research",
    "info": "This course will initiate or extend the student's experience in medical research projects in skeletal-muscular related areas.",
    "prereq": []
  },
  {
    "uid": "011598",
    "code": "ORSU7188",
    "subject": "ORSU",
    "number": "7188",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Pediatric Ortho",
    "fullname": "Acting Intern Pediatric Orthopaedics",
    "info": "This course provides an opportunity for students with a special interest in pediatric orthopaedics and the care of the multiply-handicapped child.",
    "prereq": []
  },
  {
    "uid": "011600",
    "code": "ORSU7190",
    "subject": "ORSU",
    "number": "7190",
    "honors": false,
    "writingIntensive": false,
    "name": "ActingIntern GenReconGeriOrtho",
    "fullname": "Acting Intern General, Reconstructive, and Geriatric Orthopaedics",
    "info": "This course consists of supervised clinical experience in the primary care of both adult inpatients and outpatients with an emphasis on reconstructive types of orthopaedic surgery. The student has a great deal of individual ward and surgical responsibility and is expected to present their cases. The student functions at the junior resident level. While the student does not take call individually, they may choose to take call with the resident to whom they are assigned. Recommended for the student interested in an orthopaedic surgery career and for the student choosing a non-orthopaedic surgery career. Primary text for externship: Salter RB: Textbook of Disorders and Injuries of the Musculoskeletal System, Baltimore, Williams & Wilkins. ",
    "prereq": []
  },
  {
    "uid": "011603",
    "code": "ORSU7191",
    "subject": "ORSU",
    "number": "7191",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern OrthoTrauma Surg",
    "fullname": "Acting Intern Orthopaedic Trauma Surgery",
    "info": "This course provides detailed exposure to orthopaedic reconstruction and trauma. ",
    "prereq": []
  },
  {
    "uid": "011605",
    "code": "ORSU7192",
    "subject": "ORSU",
    "number": "7192",
    "honors": false,
    "writingIntensive": false,
    "name": "Primary Care Orthopaedics",
    "fullname": "Primary Care Orthopaedics",
    "info": "The students will be observing and assisting orthopaedic surgeons in a general orthopaedic practice. The student's interest and initiative will determine the level of responsiblities and the extent of participation in surgical procedures. Students are responsible for weekly case conference presentations.",
    "prereq": []
  },
  {
    "uid": "011607",
    "code": "ORSU7194",
    "subject": "ORSU",
    "number": "7194",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Elec",
    "fullname": "Orthopaedic Externship-MC",
    "info": "An introductory course to outpatient orthopaedic patient evaluation and treatment in a private office setting. The student observes and, under direct supervision, participates in efficient evaluation of pediatric and adult patients with musculoskeletal complaints. This includes obtaining pertinent history and doing a complete musculoskeletal exam appropriate tothe patient's complaints. Emphasis is on physical diagnosis and evaluation of diagnostic data including x-rays and other imaging modalities. * The student spends most of their time with Dr. Aadalen at his Edina office, but they also accompany him to Children's Health Care-Minneapolis, Fairview-University Medical Center (Riverside Campus) and Shriner's Hospital. ",
    "prereq": []
  },
  {
    "uid": "011608",
    "code": "ORSU7195",
    "subject": "ORSU",
    "number": "7195",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Elec",
    "fullname": "Orthopaedics for the Generalist",
    "info": "Provides the opportunity to recognize and treat common orthopaedic problems. The experience consists of emergency room, ambulatory setting, and operating room exposure with an emphasis on problems encountered in primary care. The student may also have an opportunity to work with a sports medicine physician in the office and travel to rural site visits for orthopaedic consultations.Text: Disorders and Disease of the Musculoskeletal System, Robert B. Salter. Texts are available (no charge) through the UMD Department of Family Medicine for students use while on this rotation.SPECIAL INSTRUCTIONS: To request the Duluth site, contact the UMD Department of Family Medicine, 10 University Drive, Duluth, MN 55812 (218-726-7916) at least one month prior to quarterly cancel/add deadline.",
    "prereq": []
  },
  {
    "uid": "790580",
    "code": "ORSU7200",
    "subject": "ORSU",
    "number": "7200",
    "honors": false,
    "writingIntensive": false,
    "name": "Surg Subspecialty Orthopaedics",
    "fullname": "Surgical Subspecialty Orthopaedics",
    "info": "The orthopedic surgery selective consists of a 2 or 4 week rotation concentrating on the areas of general orthopedics, sports medicine, and pediatric orthopedics. ",
    "prereq": []
  },
  {
    "uid": "013088",
    "code": "ORSU7401",
    "subject": "ORSU",
    "number": "7401",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Conference",
    "fullname": "Orthopaedic Conference",
    "info": "Orthopaedic conference.",
    "prereq": []
  },
  {
    "uid": "013089",
    "code": "ORSU7405",
    "subject": "ORSU",
    "number": "7405",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Diagnosis",
    "fullname": "Orthopaedic Diagnosis",
    "info": "Orthopaedic diagnosis. ",
    "prereq": []
  },
  {
    "uid": "013090",
    "code": "ORSU7408",
    "subject": "ORSU",
    "number": "7408",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Probs/Mgmt",
    "fullname": "Orthopaedic Problems and Management",
    "info": "Orthopaedic problems and management.",
    "prereq": []
  },
  {
    "uid": "013091",
    "code": "ORSU7410",
    "subject": "ORSU",
    "number": "7410",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Pathology",
    "fullname": "Orthopaedic Pathology",
    "info": "Orthopaedic pathology.",
    "prereq": []
  },
  {
    "uid": "013092",
    "code": "ORSU7411",
    "subject": "ORSU",
    "number": "7411",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Operative Surgery",
    "fullname": "Orthopaedic Operative Surgery",
    "info": "Orthopaedic operative surgery.",
    "prereq": []
  },
  {
    "uid": "013093",
    "code": "ORSU7412",
    "subject": "ORSU",
    "number": "7412",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Anatomy",
    "fullname": "Orthopaedic Anatomy",
    "info": "Orthopaedic anatomy.",
    "prereq": []
  },
  {
    "uid": "818419",
    "code": "ORSU7550",
    "subject": "ORSU",
    "number": "7550",
    "honors": false,
    "writingIntensive": false,
    "name": "Ortho/ENT for Primary Care",
    "fullname": "Orthopaedic Surgery and Otolaryngology for the Primary Care Provider",
    "info": "The orthopaedic surgery component of the Ortho/ENT selective is two weeks and concentrates on the areas of general orthopaedics, sports medicine, and pediatrics. This course is designed for students entering careers in primary care specialties and will provide students with perspective on the diagnosis and management of orthopaedic conditions. Each selective will be geared toward the student's desired orthopaedic interest. In all rotations, the student is expected to be involved in the clinic setting, pre-operative planning, assisting in the operating room, and post-operative call of patients. Each student will be expected to learn the objectives as outlined in the course description. The student will be expected to attend conferences that are currently active in the residency curriculum. He or she may be requested to present cases as part of these conferences. The experience will be a mixture of diverse clinical exposure in addition to operating room activity. Under direct supervision by orthopaedic surgery faculty, the student will create and optimize patient care/management plans, write notes and orders and perform orthopaedic examinations and assist in surgical procedures. The medical student is expected to take call during the rotation.The ENT component of the Ortho/ENT selective is two weeks and focuses on general ENT. This course is designed for students entering careers in primary care specialties and will allow students to become familiar with common ENT conditions that they are likely to see in primary care. During the two weeks, students will gain perspective and knowledge on the diagnosis and management of these ENT conditions, including but not limited to middle ear disease, acute and chronic sinusitis, tonsillitis, hoarseness, and epistaxis. Students are expected to be involved in the clinic setting and assisting in the operating room. Each student will be expected to learn the objectives as outlined in the course description. The student will be expected to attend conferences that are currently active in the residency curriculum. The experience will be a mixture of clinic exposure and operating room exposure, though the majority of time will be weighted toward the clinic experience. Under the direct supervision of the ENT faculty, the student will create and optimize patient care/management plans, write notes, gain proficiency in the head and neck physical exam, and assist in surgical procedures. The student is not expected to take call during the rotation since it will be mostly a clinic experience.",
    "prereq": []
  },
  {
    "uid": "820506",
    "code": "ORSU7551",
    "subject": "ORSU",
    "number": "7551",
    "honors": false,
    "writingIntensive": false,
    "name": "Virtual Ortho/ENT Primary Care",
    "fullname": "Virtual Orthopedic Surgery and Otolaryngology for the Primary Care Provider",
    "info": "The orthopedic surgery component of the Ortho/ENT selective is two weeks. This course is designed for students entering careers in primary care specialties and will provide students with perspective on the diagnosis and management of orthopedic conditions. Each selective will be geared toward the student's desired orthopedic interest. In all rotations, the student is expected to be involved in the clinic setting, pre-operative planning, assisting in the operating room, and post-operative call of patients. Each student will be expected to learn the objectives as outlined in the course description. The student will be expected to attend conferences that are currently active in the residency curriculum. He or she may be requested to present cases as part of these conferences. The experience will be a mixture of diverse clinical exposure in addition to operating room activity. Under direct supervision by orthopedic surgery faculty, the student will create and optimize patient care/management plans, write notes and orders and perform orthopedic examinations and assist in surgical procedures. The medical student is expected to take call during the rotation; call shall not be scheduled more frequently than once per week.The ENT component of the Ortho/ENT selective is two weeks and focuses on general ENT. This course is designed for students entering careers in primary care specialties and will allow students to become familiar with common ENT conditions that they are likely to see in primary care. During the two weeks, students will gain perspective and knowledge on the diagnosis and management of these ENT conditions, including but not limited to middle ear disease, acute and chronic sinusitis, tonsillitis, hoarseness, and epistaxis. Students are expected to be involved in the clinic setting and assisting in the operating room. Each student will be expected to learn the objectives as outlined in the course description. The student will be expected to attend conferences that are currently active in the residency curriculum. The experience will be a mixture of clinic exposure and operating room exposure, though the majority of time will be weighted toward the clinic experience. Under the direct supervision of the ENT faculty, the student will create and optimize patient care/management plans, write notes, gain proficiency in the head and neck physical exam, and assist in surgical procedures. The student is not expected to take call during the rotation since it will be mostly a clinic experience.prereq: SURG 7500 or combination of SURG 7520 and SURG 7521",
    "prereq": {
      "and": [
        {
          "code": "SURG 7500",
          "subject": "SURG",
          "id": "7500"
        },
        {
          "code": "SURG 7520",
          "subject": "SURG",
          "id": "7520"
        },
        {
          "code": "SURG 7521",
          "subject": "SURG",
          "id": "7521"
        }
      ]
    }
  },
  {
    "uid": "825083",
    "code": "ORSU7600",
    "subject": "ORSU",
    "number": "7600",
    "honors": false,
    "writingIntensive": false,
    "name": "Womens Sports Medicine at TRIA",
    "fullname": "Womens Sports Medicine at TRIA",
    "info": "This four-week advanced selective offers exposure to multi-disciplinary care of the active and athletic female. Students will work with orthopaedic surgery sports medicine and primary care sports medicine physicians, a sports dietitian, physical therapists, and athletic trainers. Students may have the option to work with a physician for sporting event coverage to learn the intricacies of on-field medical care for athletes. There is some flexibility in the exact layout of this course, in particular allowing students to choose whether they wish to spend time in the operating room with a sports medicine orthopedic surgeon, or more time spent in clinic with sports medicine providers. The medical student is not expected to take any call during the rotation. If a sideline coverage opportunity arises, these tend to occur in the evening or on a weekend. Otherwise, there are no overnight or weekend coverage expectations during this rotation. Most weeks will include 4.5 to 5 days of clinical exposure at TRIA Woodbury.",
    "prereq": []
  },
  {
    "uid": "805712",
    "code": "ORSU7910",
    "subject": "ORSU",
    "number": "7910",
    "honors": false,
    "writingIntensive": false,
    "name": "Orthopaedic Surg Med Residency",
    "fullname": "Orthopaedic Surgery Medical Residency",
    "info": "Orthopaedic surgery medical residency.",
    "prereq": []
  },
  {
    "uid": "805713",
    "code": "ORSU7930",
    "subject": "ORSU",
    "number": "7930",
    "honors": false,
    "writingIntensive": false,
    "name": "Ortho Surg Med Fellowship",
    "fullname": "Orthopaedic Surgery Medical Fellowship",
    "info": "Orthopaedic surgery medical fellowship.",
    "prereq": []
  }
]