[
  {
    "uid": "801863",
    "code": "PA1005",
    "subject": "PA",
    "number": "1005",
    "honors": false,
    "writingIntensive": false,
    "name": "GreatDebates:USPolicy/Politics",
    "fullname": "Great Debates of Our Time: U.S. Policy and Politics",
    "info": "Topical political/policy debates with prominent government officials/experts. Constitutional crisis over authority/roles of legislative/executive branches. Visiting lecturers, in-class simulations, readings.",
    "prereq": []
  },
  {
    "uid": "806835",
    "code": "PA1021",
    "subject": "PA",
    "number": "1021",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Microecon for Pub Aff",
    "fullname": "Introduction to Microeconomics for Public Affairs",
    "info": "Microeconomic behavior of consumers, firms, markets in domestic/world economy. Demand/supply, competition/monopoly, distribution of income, externalities, public goods/common resources, economic interdependencies in global economy, effects of global linkages on individual decisions.prereq: Students must be admitted to/intend to enroll in Humphrey School's masters program in development practice or public policy or urban and regional planning or science, technology, and environmental policy",
    "prereq": []
  },
  {
    "uid": "798892",
    "code": "PA1401",
    "subject": "PA",
    "number": "1401",
    "honors": false,
    "writingIntensive": false,
    "name": "Organizing for the Public Good",
    "fullname": "Public Affairs: Community Organizing Skills for Public Action",
    "info": "Public affairs work, roles of citizens in democratic way of life. Community organizing skills, their importance for public affairs. Negotiations among diverse audiences, understanding different interests, mapping power relationships. Relevant public affairs and governance theory.",
    "prereq": []
  },
  {
    "uid": "788554",
    "code": "PA1490",
    "subject": "PA",
    "number": "1490",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Social Policy",
    "fullname": "Topics in Social Policy",
    "info": "Topics in social policy.",
    "prereq": []
  },
  {
    "uid": "789837",
    "code": "PA1907W",
    "subject": "PA",
    "number": "1907",
    "honors": false,
    "writingIntensive": true,
    "name": "Fr Sem: Cultural Diversity",
    "fullname": "Freshman Seminar: Cultural Diversity",
    "info": "Reading, discussion, critical analysis, writing. Intensive, small-group setting.",
    "prereq": []
  },
  {
    "uid": "795203",
    "code": "PA1990",
    "subject": "PA",
    "number": "1990",
    "honors": false,
    "writingIntensive": false,
    "name": "General Topics: Public Policy",
    "fullname": "General Topics in Public Policy",
    "info": "General topics in public policy.",
    "prereq": []
  },
  {
    "uid": "817414",
    "code": "PA3001",
    "subject": "PA",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Public Policy",
    "fullname": "Changing the World: Contemporary Public Policy",
    "info": "Foundation for understanding the what, who, where, and how of public policy making. These components are explored from different perspectives while delving into questions such as: What is public policy good for? Who decides policy priorities? What effect does public policy actually have in solving public problems? How can we improve public policy making? After successfully completing this course, students will understand the process, structure, and context of policymaking; identify who, how, and what influences the policy process; and apply knowledge of public policy and the policymaking process to a specific policy issue. A strong understanding of the American political system is encouraged.",
    "prereq": []
  },
  {
    "uid": "808512",
    "code": "PA3002",
    "subject": "PA",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Basic Methods of Pol Analysis",
    "fullname": "Basic Methods of Policy Analysis",
    "info": "Introduction to policy analysis. Theoretical foundations/practical methods of analysis. Tools for problem definition, data collection/analysis, presentation techniques, implementation strategies. Multidisciplinary case-study approach.",
    "prereq": []
  },
  {
    "uid": "797455",
    "code": "PA3003",
    "subject": "PA",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Nonprofit & Public Fin Mgmt",
    "fullname": "Nonprofit and Public Financial Management",
    "info": "Concepts/tools for project/budget planning. Program analysis. Interpreting financial reports. Identifying/resolving organizational performance issues. Case studies, real-world exercises.prereq: Jr or sr",
    "prereq": []
  },
  {
    "uid": "798444",
    "code": "PA3311W",
    "subject": "PA",
    "number": "3311",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro Public Policy Analysis",
    "fullname": "Introduction to Public Policy Analysis",
    "info": "Elements of public policy analysis, policy analysts' roles, market failure, public choice, bureaucratic decision making, and public services.",
    "prereq": []
  },
  {
    "uid": "016426",
    "code": "PA3401",
    "subject": "PA",
    "number": "3401",
    "honors": false,
    "writingIntensive": false,
    "name": "Arts of Liberty: Educ for Dem",
    "fullname": "The Arts of Liberty: Educating for Democracy in Information Age",
    "info": "Education for democracy. Core concepts. Different meanings in American history. Freedom, work, democracy. Community projects. Two essays/journal.",
    "prereq": []
  },
  {
    "uid": "815414",
    "code": "PA3481",
    "subject": "PA",
    "number": "3481",
    "honors": false,
    "writingIntensive": false,
    "name": "Cedar Riverside Immersion",
    "fullname": "Cedar Riverside: Where The World Meets MN",
    "info": "The Cedar Riverside Neighborhood; Where the World Meets Minnesota is an immersion course in our Cedar Riverside neighborhood that parallels the immersion experience of study abroad. The course encourages civic engagement and will provide opportunity to learn and work in the Cedar Riverside community while examining questions of leadership, power, cultural diversity and social change. Students will participate in class-based discussion seminars, neighborhood excursions and community work. Throughout the immersion experience, students are challenged to question, think, and respond thoughtfully to current issues facing the Cedar-Riverside community and cultivate leadership skills. Students can expect to gain new frameworks for understanding leadership and civic engagement in a domestic cultural context, deepened skill in identifying complex problems, strategic questioning, reflection and meaning making, as well as consciousness of relationship between self, world and text/theory.",
    "prereq": []
  },
  {
    "uid": "800135",
    "code": "PA3490",
    "subject": "PA",
    "number": "3490",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Social Policy",
    "fullname": "Topics in Social Policy",
    "info": "--",
    "prereq": []
  },
  {
    "uid": "818451",
    "code": "PA3852",
    "subject": "PA",
    "number": "3852",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Entrepren/Diplomacy: Ghana",
    "fullname": "Social Entrepreneurship & Diplomacy in Ghana",
    "info": "This global seminar will take place in Ghana, focusing on visits within the country to the following cities; Accra,Kumasi, Senchi-Ferry, and Elmina/Cape Coast. The course content will focus on social entrepreneurship, diplomacy, and how public policy and social enterprises are helping shape Ghana as one of the most stable emerging countries in West Africa. During the seminar, students will be engaged in lectures that focus on Ghanaian diplomacy, and the evolving role of social entrepreneurship in Ghana. Academic content will focus on meaningful interactions in the form of lectures, panels, site visits, and excursions with speakers from a variety of institutions in Ghana. Speakers will consist of entrepreneurs, policymakers, faculty from a variety of institutions (the University of Ghana Legon, University of Cape Coast, and Ashesi University) and public servants working in Ghana. Cultural excursion locations will align with the location of the academic content, lectures and site visits, which will enable students to develop a deeper understanding of social life and culture in Ghana. Also, the course will examine private and public sectors of higher education, and youth workforce development  in Ghana as an impetus for the emergence of social enterprises.Lastly, students will participate in an educational project that investigates youth development and education within rural and urban communities and the role social entrepreneurs are planning on creating innovative solutions for young people to thrive. The course will have some readings that provide students with background information, history or news related to the lectures, site visits, and excursions that will occur during the seminar.Lecture topics include: Conversational Twi (3-day language course) at the University of Ghana Legon; Diplomacy 101 presented by the State Department at the U.S. Embassy in Ghana; traditional governance role in Ghanaian society; educational policy and workforce development in Ghana; women leadership in Markets: Exploration of a hub of entrepreneurship; impact on social entrepreneurship in Ghana panel of local organizations impacting Ghana. General Outcomes: Upon successful completion, student will be able to: Become familiar with diplomacy from an international context, and the role that they play in practicing diplomacy through their participation in the program and exposure to the role of the State Department; build on the knowledge gained from studying social entrepreneurship and how motivated individuals are developing strategies to address societal challenges; discuss diversity of cultures that exists within a country and how traditional and modern governments work together in order to ensure that the country is thriving, preserving its history and traditions; understand diverse philosophies and cultures within and across societies; and develop skills for effective citizenship and lifelong learning.",
    "prereq": []
  },
  {
    "uid": "817523",
    "code": "PA3969",
    "subject": "PA",
    "number": "3969",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey of Election Admin",
    "fullname": "Survey of Election Administration",
    "info": "Survey of building blocks of election administration, from voter registration to recounts.",
    "prereq": []
  },
  {
    "uid": "817748",
    "code": "PA3972",
    "subject": "PA",
    "number": "3972",
    "honors": false,
    "writingIntensive": false,
    "name": "Elections and the Law",
    "fullname": "Elections and the Law",
    "info": "Theories and basic structure of the American legal system. Experience with basic tools and skills for using the law to understand and analyze issues facing election administrators across the nation. Use of election-related and non-election related materials to prepare election administrators for interacting with counsel, legislators and the courts in carrying out their responsibilities.",
    "prereq": []
  },
  {
    "uid": "817524",
    "code": "PA3973",
    "subject": "PA",
    "number": "3973",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Mgmt of Elec Admin",
    "fullname": "Strategic Management of Election Administration",
    "info": "Strategic management for election administrators in the political environment. Election official tools and challenges. The role of the lawmaking process in budgeting and organizational planning.",
    "prereq": []
  },
  {
    "uid": "817751",
    "code": "PA3974",
    "subject": "PA",
    "number": "3974",
    "honors": false,
    "writingIntensive": false,
    "name": "Election Admin Capstone",
    "fullname": "Election Administration Capstone Project",
    "info": "Application of interdisciplinary methods, approaches, and perspectives from core courses. Written report of an election administration issue or problem in jurisdiction of student's choice. Research best practices and possible solutions. Final paper or presentation with findings.",
    "prereq": []
  },
  {
    "uid": "817752",
    "code": "PA3975",
    "subject": "PA",
    "number": "3975",
    "honors": false,
    "writingIntensive": false,
    "name": "Election Design",
    "fullname": "Election Design",
    "info": "Election administration design principles, including ballot and polling place design and poll worker training materials. Application of principles of field.",
    "prereq": []
  },
  {
    "uid": "817525",
    "code": "PA3976",
    "subject": "PA",
    "number": "3976",
    "honors": false,
    "writingIntensive": false,
    "name": "Voter Participation",
    "fullname": "Voter Participation",
    "info": "Voter participation issues and challenges including historical survey of voter participation in US and methods to increase voter turnout.",
    "prereq": []
  },
  {
    "uid": "808568",
    "code": "PA3981",
    "subject": "PA",
    "number": "3981",
    "honors": false,
    "writingIntensive": false,
    "name": "American Institutions",
    "fullname": "American Institutions in Historical Perspective",
    "info": "History of churches, fraternal organizations, charities, and institutions more directly related to government.prereq: Basic course in U.S. history preferred",
    "prereq": []
  },
  {
    "uid": "817753",
    "code": "PA3982",
    "subject": "PA",
    "number": "3982",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Analysis for Elec Admin",
    "fullname": "Data Analysis for Election Administration",
    "info": "Evidence-based election administration. Collection and analysis of quantitative data to solve problems and identify opportunities for improvement. Emphasis on pre-election forecasting for planning purposes and post-election auditing of election results.",
    "prereq": []
  },
  {
    "uid": "818156",
    "code": "PA3983",
    "subject": "PA",
    "number": "3983",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Election Security",
    "fullname": "Introduction to Election Security",
    "info": "This course will examine the history of cyberattacks on the United States and the American election system, with special attention to the 2016 election cycle. Students will explore the types of cybersecurity threats that exist and strategies to protect against them; understand the roles different levels of government can play in the process, and hear from key officials about the issues raised by the official response to election security threats at the federal, state and local levels as well as in related private sector communities.",
    "prereq": []
  },
  {
    "uid": "819739",
    "code": "PA3984",
    "subject": "PA",
    "number": "3984",
    "honors": false,
    "writingIntensive": false,
    "name": "Elections Security",
    "fullname": "Elections Security: How to Protect America’s Elections",
    "info": "“Elections Security” uses the Russian efforts to influence the 2016 election as a case study to identify the vulnerabilities of US elections (especially state voter registration databases) as well as catalogue new protections. Readings and discussion will focus on best practices and technology options available to the public (social media) and elections professionals (cybersecurity) in guarding against future influence efforts and assuring public confidence in election outcomes. Special focus will be given to describing how local election officials can protect their election technology, most notably those vulnerabilities associated with their voting system and voter registration database. “Elections Security” will draw heavily on concrete cases and challenges facing election professionals, using government and independent reports and an indepth analysis of new resources created by the US Department of Homeland Security and its collaborations with election professionals.",
    "prereq": []
  },
  {
    "uid": "820534",
    "code": "PA3985",
    "subject": "PA",
    "number": "3985",
    "honors": false,
    "writingIntensive": false,
    "name": "Physical Election Security",
    "fullname": "Physical Election Security",
    "info": "U.S. Homeland Security designated election security as a “critical infrastructure” after threats from foreign governments, and collaborates with states in detecting and responding to foreign interference. This course will provide students with a deeper understanding of the current security context and best practices and processes for physically safeguarding elections based on 2016 and 2020. Students will learn the difference between physical and cyber threats to U.S. systems; tangible steps to protect election offices and their equipment; the use of audits to ensure the accuracy of elections; the integration of security into vendor relationships; and the connection between physical election security and citizen trust in elections. Content will be explored through readings (including government documents and studies), videos, discussions, and writing assignments.",
    "prereq": []
  },
  {
    "uid": "789487",
    "code": "PA3990",
    "subject": "PA",
    "number": "3990",
    "honors": false,
    "writingIntensive": false,
    "name": "General topics: Public Policy",
    "fullname": "General Topics in Public Policy",
    "info": "General topics in public policy.",
    "prereq": []
  },
  {
    "uid": "803737",
    "code": "PA3991",
    "subject": "PA",
    "number": "3991",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "797930",
    "code": "PA4101",
    "subject": "PA",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Nonprofit Mgmt & Governance",
    "fullname": "Nonprofit Management and Governance",
    "info": "Managing/governing nonprofit/public organizations. Theories, concepts, real-world examples. Governance systems, strategic management practices, effect of different funding environments, management of multiple constituencies.",
    "prereq": []
  },
  {
    "uid": "810922",
    "code": "PA4144",
    "subject": "PA",
    "number": "4144",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Entrepreneurship",
    "fullname": "Social Entrepreneurship",
    "info": "Introduction to field of social entrepreneurship. Prepares current/future managers/leaders to create, develop, lead socially entrepreneurial organizations/initiatives.prereq: Junior or senior",
    "prereq": []
  },
  {
    "uid": "016428",
    "code": "PA4190",
    "subject": "PA",
    "number": "4190",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics:Pub/NonProf Ldrship/Man",
    "fullname": "Topics in Public and Nonprofit Leadership and Management",
    "info": "Topics in public/nonprofit leadership/management.",
    "prereq": []
  },
  {
    "uid": "016437",
    "code": "PA4200",
    "subject": "PA",
    "number": "4200",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban & Regional Planning",
    "fullname": "Urban and Regional Planning",
    "info": "Fundamental principles of urban/regional land-use planning. Introduction to planning theory and its applications. Political-economic context of urban/regional planning.",
    "prereq": []
  },
  {
    "uid": "788957",
    "code": "PA4290",
    "subject": "PA",
    "number": "4290",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Planning",
    "fullname": "Topics in Planning",
    "info": "Topics in social policy.",
    "prereq": []
  },
  {
    "uid": "800554",
    "code": "PA4414",
    "subject": "PA",
    "number": "4414",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Human Rights: Work&Educ",
    "fullname": "Child Human Rights: Work and Education",
    "info": "International child labor issues. Options for improving child well-being, including policies/programs that have potential to affect the lives of millions of children.",
    "prereq": []
  },
  {
    "uid": "790176",
    "code": "PA4421",
    "subject": "PA",
    "number": "4421",
    "honors": false,
    "writingIntensive": false,
    "name": "Racial Inequality",
    "fullname": "Racial Inequality and Public Policy",
    "info": "Historical roots of racial inequality in American society. Contemporary economic consequences. Public policy responses to racial inequality. Emphasizes thinking/analysis that is critical of strategies offered for reducing racism and racial economic inequality.",
    "prereq": []
  },
  {
    "uid": "812864",
    "code": "PA4790",
    "subject": "PA",
    "number": "4790",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Sci/Tech/Env Policy",
    "fullname": "Topics in Science, Technology, and Environmental Policy",
    "info": "Selected topics in the field of science, technology, and environmental policy. Topics vary. ",
    "prereq": []
  },
  {
    "uid": "811229",
    "code": "PA4890",
    "subject": "PA",
    "number": "4890",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Global Policy",
    "fullname": "Topics in Global Policy",
    "info": "Topics in global policy. Topics vary.",
    "prereq": []
  },
  {
    "uid": "817089",
    "code": "PA4997",
    "subject": "PA",
    "number": "4997",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Pub Affairs & Politics",
    "fullname": "Topics in Public Affairs & Politics",
    "info": "Topics in public policy, with emphasis on the politics of public affairs. One topic uses the struggles over national security and liberty to explore core aspects of the politics of public affairs - power; institutional development; political communications; and democratic accountability. A rigorous understanding of these political dynamics offers a general approach to policy and public affairs that moves beyond superficial impressions to understanding and engaging in the practical work of public affairs. These tools of analysis are indispensable for making sense of America's constitutional crises as well as other issues. Class sessions are organized around interactive discussions of major Supreme Court decisions, debates in Congress, and other original documents that bring students into direct contact with the competing perspectives of each case, and with penetrating studies of politics.",
    "prereq": []
  },
  {
    "uid": "010690",
    "code": "PA5001",
    "subject": "PA",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intellectual Fdns of PubAction",
    "fullname": "Intellectual Foundations of Public Action",
    "info": "Evolution of intellectual approaches that underlie public planning, management, and policy analysis in a democratic society. How decision making is shaped by knowledge/values. Role of rationality. Conceptual, descriptive/normative, and structure/process approaches.",
    "prereq": []
  },
  {
    "uid": "010691",
    "code": "PA5002",
    "subject": "PA",
    "number": "5002",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction Policy Analysis",
    "fullname": "Introduction to Policy Analysis",
    "info": "Process of public policy analysis from problem structuring to communication of findings. Commonly used analytical methods. Alternative models of analytical problem resolution.",
    "prereq": []
  },
  {
    "uid": "014775",
    "code": "PA5003",
    "subject": "PA",
    "number": "5003",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Fin Analysis & Mgmt",
    "fullname": "Introduction to Financial Analysis and Management",
    "info": "Finance/accounting concepts/tools in public/nonprofit organizations. Fund accounting. Balance sheet/income statement analysis. Cash flow analysis. Public/nonprofit sector budgeting processes. Lectures, discussions. Cases.prereq: Public policy major/minor or major in development practice,  public affairs or liberal studies or grad nonprofit mgmt cert or instr consent",
    "prereq": []
  },
  {
    "uid": "010693",
    "code": "PA5004",
    "subject": "PA",
    "number": "5004",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Planning",
    "fullname": "Introduction to Planning",
    "info": "History/institutional development of urban planning as  profession. Intellectual foundations, planning theory. Roles of urban planners in U.S./international settings. Scope, legitimacy, limitations of planning/planning process. Issues in planning ethics/settings of diverse populations/stakeholders.prereq: Major/minor in urban/regional planning or instr consent",
    "prereq": []
  },
  {
    "uid": "007792",
    "code": "PA5011",
    "subject": "PA",
    "number": "5011",
    "honors": false,
    "writingIntensive": false,
    "name": "Dynamics of Organizations",
    "fullname": "Dynamics of Public Affairs Organizations",
    "info": "Critical analysis of organizations in the world of public affairs from multiple levels - including the individual, group, organization, and sector - and the dynamics of relationships among them. Develop actionable recommendations to improve organizational effectiveness in the context of multiple (often contested) prosocial purposes and conflicting stakeholder demands. Memo writing, case analyses, simulations, guest speakers, and self-awareness exercises",
    "prereq": []
  },
  {
    "uid": "007800",
    "code": "PA5012",
    "subject": "PA",
    "number": "5012",
    "honors": false,
    "writingIntensive": false,
    "name": "The Politics of Public Affairs",
    "fullname": "The Politics of Public Affairs",
    "info": "Politics is how we make collective decisions about matters of shared consequence. This course examines politics and introduces students to key concepts and skills needed for effective political analysis. The central themes of the course focus on power; institutions and organizations; discourse; and citizenship.",
    "prereq": []
  },
  {
    "uid": "007790",
    "code": "PA5013",
    "subject": "PA",
    "number": "5013",
    "honors": false,
    "writingIntensive": false,
    "name": "Law and Urban Land Use",
    "fullname": "Law and Urban Land Use",
    "info": "Role of law in regulating/shaping urban development, land use, environmental quality, local/regional governmental services. Interface between public/private sector.prereq: Major or minor in urban/regional planning or instr consent",
    "prereq": []
  },
  {
    "uid": "013939",
    "code": "PA5021",
    "subject": "PA",
    "number": "5021",
    "honors": false,
    "writingIntensive": false,
    "name": "Microecon for Policy Analysis",
    "fullname": "Microeconomics for Policy Analysis",
    "info": "Introduction to tools useful for public policy. Intermediate microeconomics.",
    "prereq": []
  },
  {
    "uid": "014016",
    "code": "PA5022",
    "subject": "PA",
    "number": "5022",
    "honors": false,
    "writingIntensive": false,
    "name": "Apps of Econ for Pol Analysis",
    "fullname": "Applications of Economics for Policy Analysis",
    "info": "Application of economic reasoning to a wide range of contemporary public policy issues. The following topically-focused courses also fulfill the MPP economics requirement: PA 5431: Public Policies on Work and Pay, PA 5503: Economics of Development, PA 5521: Development Planning and Policy Analysis, PA 5722: Economics of Natural Resource and Environmental Policy, and PA 5805: Global Economics. prereq: 5021 or equiv",
    "prereq": {
      "code": "PA 5021",
      "subject": "PA",
      "id": "5021"
    }
  },
  {
    "uid": "825786",
    "code": "PA5023",
    "subject": "PA",
    "number": "5023",
    "honors": false,
    "writingIntensive": false,
    "name": "Stratification Econ & Pub Pol",
    "fullname": "Stratification Economics and Public Policy",
    "info": "Stratification economics differs from conventional neoclassical economics and its related offspring of behavioral economics because it does not assume that the nature of inequality arises solely via rational choices made in competitive markets. Rather, it posits structural and historical processes that impede the ability of marginalized groups to gain access to markets. One of the key insights from stratification economics is that conventional policy mechanisms (e.g. deterrence policies in the criminal justice system) don’t work because they fail to take account of the legacy of inequality (e.g. convict lease systems and vagrancy laws). The arguments in favor of reparations, baby bonds, universal health care can be viewed and examined using the methods and techniques of stratification economics. This course introduces students to some new methodologies that complement their training in conventional economic analysis.\n\nTopics:\n· A review of conventional microeconomic approaches to policy analysis, including the core assumptions and key conclusions\n· Summary and critique of the conventional microeconomic approach\n· The historical backdrop to the evolution of “identity economics” and stratification economics for understanding racial disparities\n· Core assumptions of stratification economics\n· Applications: Housing markets and residential segregation; racial profiling; discrimination in labor markets.\n· Policy proposals based on stratification economics – reparations, baby bonds, universal income and health payments.\n\nAdvanced undergraduate students may register with permission of the instructor.",
    "prereq": []
  },
  {
    "uid": "007786",
    "code": "PA5031",
    "subject": "PA",
    "number": "5031",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistics for Public Affairs",
    "fullname": "Statistics for Public Affairs",
    "info": "Basic statistical tools for empirical analysis of public policy alternatives. Frequency distributions, descriptive statistics, elementary probability/probability distributions, statistical inference. Estimation/hypothesis testing. Cross-tabulation/chi-square distribution. Analysis of variance, correlation. Simple/multiple regression analysis.",
    "prereq": []
  },
  {
    "uid": "010696",
    "code": "PA5032",
    "subject": "PA",
    "number": "5032",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Regression",
    "fullname": "Applied Regression",
    "info": "Bivariate/multivariate models of regression analysis and assumptions behind them. Problems using these models when such assumptions are not met.",
    "prereq": []
  },
  {
    "uid": "010697",
    "code": "PA5033",
    "subject": "PA",
    "number": "5033",
    "honors": false,
    "writingIntensive": false,
    "name": "Multivariate Techniques",
    "fullname": "Multivariate Techniques",
    "info": "Use of bivariate and multivariate statistical approaches for analyzing and evaluating public affairs issues and the assumptions behind the analytical approaches. Designed to help students read, understand, interpret, use, and evaluate empirical work used in social sciences by policy analysts and policy makers.prereq: Students who register for PA 5033 must take PA 5044 and PA 5033 in the same semester. The same grade will be issued for PA 5044 and PA 5033 after PA 5033 is completed.",
    "prereq": {
      "code": "PA 5044",
      "subject": "PA",
      "id": "5044"
    }
  },
  {
    "uid": "010698",
    "code": "PA5034",
    "subject": "PA",
    "number": "5034",
    "honors": false,
    "writingIntensive": false,
    "name": "Comm anal plan tech",
    "fullname": "Community Analysis and Planning Techniques",
    "info": "Data analysis techniques for practitioners in fields of planning, management, and policy analysis who work at community and regional levels. Population analysis and forecasting techniques relevant for small geographic areas. Techniques for regional/local economic analysis such as shift-share analysis, economic base, and location quotient analysis.",
    "prereq": []
  },
  {
    "uid": "010699",
    "code": "PA5035",
    "subject": "PA",
    "number": "5035",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey Research",
    "fullname": "Survey Research and Data Collection",
    "info": "Introduction to survey research methods. Emphasizes applications to policy/applied research. Research design choices (e.g., descriptive, experimental, case studies), sampling, variable specification, measurement. Conducting interviews, self-administered questionnaires. Qualitative techniques.",
    "prereq": []
  },
  {
    "uid": "798012",
    "code": "PA5036",
    "subject": "PA",
    "number": "5036",
    "honors": false,
    "writingIntensive": false,
    "name": "Regional Economic Analysis",
    "fullname": "Regional Economic Analysis",
    "info": "Economic data analysis techniques for practitioners in planning and economic development working at local/regional levels. Shift-share analysis, economic base model, base multipliers, location quotient analysis, minimum requirements method, economic impact analysis. Individual/group projects. ",
    "prereq": []
  },
  {
    "uid": "798013",
    "code": "PA5037",
    "subject": "PA",
    "number": "5037",
    "honors": false,
    "writingIntensive": false,
    "name": "Regional Demographic Analysis",
    "fullname": "Regional Demographic Analysis",
    "info": "Demographic data analysis, population projection techniques for practitioners in planning, social service delivery, and community development at local/regional levels. Population extrapolation using curve fitting methods, demographic indicators, cohort-component method of population projection, estimation of fertility/migration rates, life tables. Individual/group projects.",
    "prereq": []
  },
  {
    "uid": "804102",
    "code": "PA5038",
    "subject": "PA",
    "number": "5038",
    "honors": false,
    "writingIntensive": false,
    "name": "Analytics for Leaders I",
    "fullname": "Analytics for Leaders I",
    "info": "Skills to do basic quantitative analyses, evaluate research, develop evidence-based policy, and lead data-driven organizations. Descriptive statistics, research design. Ethical issues in interpretation, analysis, and use.prereq: Major in public affairs or public affairs leadership certificate or instr consent",
    "prereq": []
  },
  {
    "uid": "804103",
    "code": "PA5039",
    "subject": "PA",
    "number": "5039",
    "honors": false,
    "writingIntensive": false,
    "name": "Analytics for Leaders II",
    "fullname": "Analytics for Leaders II",
    "info": "Builds on 5038. Skills to do basic quantitative analyses, evaluate research, develop evidence-based policy, and lead data-driven organizations. Descriptive statistics, research design. Ethical issues in interpretation, analysis, and use.prereq: 5038",
    "prereq": {
      "code": "PA 5038",
      "subject": "PA",
      "id": "5038"
    }
  },
  {
    "uid": "805500",
    "code": "PA5041",
    "subject": "PA",
    "number": "5041",
    "honors": false,
    "writingIntensive": false,
    "name": "Qual Methods Policy Analysts",
    "fullname": "Qualitative Methods for Policy Analysts",
    "info": "Qualitative analysis techniques, examples of application. Meet with researcher. Hands-on experience in designing, gathering, analyzing data.",
    "prereq": []
  },
  {
    "uid": "809904",
    "code": "PA5042",
    "subject": "PA",
    "number": "5042",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban and Regional Economics",
    "fullname": "Urban and Regional Economics",
    "info": "Evaluation of city existence/growth using economics. Economic forces in development of cities. Economic analysis of urban areas/land market. Economic analysis of planning issues in land use, transportation, housing, environment.prereq: [Major or minor in urban and regional planning, microeconomics course] or instr consent",
    "prereq": []
  },
  {
    "uid": "809905",
    "code": "PA5043",
    "subject": "PA",
    "number": "5043",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ & Demographic Analysis",
    "fullname": "Economic and Demographic Data Analysis",
    "info": "Economic/demographic data analysis techniques for planning. Exposure to most important data sources. Conceptual understanding of range of methods/hands-on experience in applying these methods.prereq: Major or minor in urban/regional planning or instr consent",
    "prereq": []
  },
  {
    "uid": "811878",
    "code": "PA5044",
    "subject": "PA",
    "number": "5044",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Regression, Accel.",
    "fullname": "Applied Regression, Accelerated",
    "info": "Bivariate/multivariate models used in regression analysis, including assumptions behind them/problems that arise when assumptions are not met. Course covers similar topics as PA 5032 but delves deeper into theory/application of methods.prereq: Students who register for PA 5044 must take PA 5044 and PA 5033 in the same semester. The same grade will be issued for PA 5044 and PA 5033 after PA 5033 is completed.",
    "prereq": {
      "code": "PA 5033",
      "subject": "PA",
      "id": "5033"
    }
  },
  {
    "uid": "818227",
    "code": "PA5045",
    "subject": "PA",
    "number": "5045",
    "honors": false,
    "writingIntensive": false,
    "name": "Stats for PublicAffairs, Accel",
    "fullname": "Statistics for Public Affairs, Accelerated",
    "info": "Introduces a range of quantitative tools that are commonly used to inform issues in public affairs. The course provides an introduction to descriptive statistics, probability, and statistical inference, with an emphasis on the ways in which quantitative tools are applied to a diverse range of practical policy questions. PA 5045 is an accelerated treatment of applied statistics for public affairs and serves as a more mathematically and conceptually rigorous alternative to PA 5031.",
    "prereq": []
  },
  {
    "uid": "826823",
    "code": "PA5046",
    "subject": "PA",
    "number": "5046",
    "honors": false,
    "writingIntensive": false,
    "name": "Econometrics for Public Policy",
    "fullname": "Econometrics for Public Policy",
    "info": "This course covers basic econometric methods commonly used by policy analysts and social scientists, including bivariate and multivariate regression. Students will become familiar with the application and interpretation of these methods, including the assumptions behind them and the problems that arise when these assumptions are not met. The course also covers more advanced methods such as panel data and fixed effects, instrumental variables, and basic time series analysis and forecasting. It is intended to provide students with the foundation to take more advanced quantitative methods courses. During the course, students will demonstrate their learning by completing a research project of their own design, culminating with a poster presentation at the conclusion of the course. Students will also become familiar with the Stata statistical package.",
    "prereq": []
  },
  {
    "uid": "807259",
    "code": "PA5051",
    "subject": "PA",
    "number": "5051",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership Foundations",
    "fullname": "Leadership Foundations",
    "info": "Leadership concepts, tools, and strategies in a personal, community, and organizational context for mid-career students.Prereq: Master in Public Affairs student(cohort program) or public affairs leadership certificate student (cohort program). 5051-5052 must be taken in same academic yr",
    "prereq": {
      "code": "PA 5052",
      "subject": "PA",
      "id": "5052"
    }
  },
  {
    "uid": "807260",
    "code": "PA5052",
    "subject": "PA",
    "number": "5052",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Affairs Leadership",
    "fullname": "Public Affairs Leadership",
    "info": "Continues 5051. Leadership concepts, tools, and strategies in diverse settings for mid-career students.Prereq: Master in Public Affairs student(cohort program) or public affairs leadership certificate student (cohort program). 5051-5052 must be taken in same academic yr",
    "prereq": {
      "code": "PA 5051",
      "subject": "PA",
      "id": "5051"
    }
  },
  {
    "uid": "807261",
    "code": "PA5053",
    "subject": "PA",
    "number": "5053",
    "honors": false,
    "writingIntensive": false,
    "name": "Policy Analysis in Pub Affairs",
    "fullname": "Policy Analysis in Public Affairs",
    "info": "Process of public policy and program analysis, including problem formulation, program design, and implementation. Opportunity to draw upon published research and conduct field-based research to understand implementation conditions. Professional communications, including writing of memos, requests for proposals, and implementation briefs, are stressed.Prereq: Master in Public Affairs student (cohort program) or public affairs leadership certificate student (cohort program). 5053-5054 must be taken in same academic yr",
    "prereq": {
      "code": "PA 5054",
      "subject": "PA",
      "id": "5054"
    }
  },
  {
    "uid": "807262",
    "code": "PA5054",
    "subject": "PA",
    "number": "5054",
    "honors": false,
    "writingIntensive": false,
    "name": "Prog Design & Implem Analysis",
    "fullname": "Program Design and Implementation Analysis",
    "info": "Continues 5053. Process of public policy and program analysis, including problem formulation, program design, and implementation. Opportunity to draw upon published research and conduct field-based research to understand implementation conditions. Professional communications, including writing of memos, requests for proposals, and implementation briefs, are stressed.Prereq: Master in Public Affairs student (cohort program) or public affairs leadership certificate student (cohort program). 5053-5054 must be taken in same academic yr",
    "prereq": {
      "code": "PA 5053",
      "subject": "PA",
      "id": "5053"
    }
  },
  {
    "uid": "807263",
    "code": "PA5055",
    "subject": "PA",
    "number": "5055",
    "honors": false,
    "writingIntensive": false,
    "name": "Qual Res Methods & Analysis",
    "fullname": "Qualitative Research Methods and Analysis",
    "info": "Problem-based learning of analytical reasoning through social science research methods. Systematic review and literature review. Qualitative research including interviews, focus groups, and analysis. Research proposal.prereq: Major in public affairs (cohort) or public affairs certificate (cohort); 5055-5056 must be taken in same academic yr",
    "prereq": {
      "code": "PA 5056",
      "subject": "PA",
      "id": "5056"
    }
  },
  {
    "uid": "807264",
    "code": "PA5056",
    "subject": "PA",
    "number": "5056",
    "honors": false,
    "writingIntensive": false,
    "name": "Quant Res Methods & Analysis",
    "fullname": "Quantitative Research Methods and Analysis",
    "info": "Problem-based learning to analytical reasoning through social science research methods. Frequency distributions, descriptive statistics, elementary probability, statistical inference. Hypothesis testing. Cross-tabulation, analysis of variance, correlation. Simple regression analysis.prereq: Master in Public Affairs student (cohort program) or public affairs leadership certificate student (cohort program). 5055-5056 must be taken in same academic yr",
    "prereq": {
      "code": "PA 5055",
      "subject": "PA",
      "id": "5055"
    }
  },
  {
    "uid": "809341",
    "code": "PA5057",
    "subject": "PA",
    "number": "5057",
    "honors": false,
    "writingIntensive": false,
    "name": "Executive Leadership I",
    "fullname": "Executive Leadership I",
    "info": "Institutional leadership, management, interdisciplinary studies. Emerging issues/public policy to develop executive leaders. Opportunities for practicing/reassessing leadership inside/outside workplace. Field-based management issues.prereq: Executive Leadership postbaccalaureate certificate student",
    "prereq": []
  },
  {
    "uid": "809342",
    "code": "PA5058",
    "subject": "PA",
    "number": "5058",
    "honors": false,
    "writingIntensive": false,
    "name": "Executive Leadership II",
    "fullname": "Executive Leadership II",
    "info": "Institutional leadership, management, interdisciplinary studies. Emerging issues/public policy to develop executive leaders. Opportunities for practicing/reassessing leadership inside/outside the workplace. Field-based management issues.prereq: Executive leadership post-baccalaureate certificate",
    "prereq": []
  },
  {
    "uid": "803722",
    "code": "PA5080",
    "subject": "PA",
    "number": "5080",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Preparation Workshop",
    "fullname": "Capstone Preparation Workshop",
    "info": "Project management, qualitative research, and critical framework to complete Capstone course. Students write draft of client project group norms and client contract.",
    "prereq": []
  },
  {
    "uid": "809909",
    "code": "PA5081",
    "subject": "PA",
    "number": "5081",
    "honors": false,
    "writingIntensive": false,
    "name": "Power/Teamwork in Pub Aff Educ",
    "fullname": "Understanding Power and Teamwork in Public Affairs Education",
    "info": "Power and teamwork in public affairs education.",
    "prereq": []
  },
  {
    "uid": "007760",
    "code": "PA5101",
    "subject": "PA",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt & Gov of Nonprofit Orgs",
    "fullname": "Management and Governance of Nonprofit Organizations",
    "info": "Theories, concepts, and real world examples of managerial challenges. Governance systems, strategic management practices, effect of funding environments, management of multiple constituencies. Types of nonprofits using economic/behavioral approaches.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007746",
    "code": "PA5102",
    "subject": "PA",
    "number": "5102",
    "honors": false,
    "writingIntensive": false,
    "name": "Org Performance & Change",
    "fullname": "Organization Performance and Change",
    "info": "Measuring outcomes of mission-driven organizations. Theory/operation of organizations from structural/cultural/symbolic perspectives. Development/use of performance information. Organizational assessment, structure, change. Mission, vision, strategy, systems thinking. Evaluation of change efforts.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "799510",
    "code": "PA5103",
    "subject": "PA",
    "number": "5103",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership and Change",
    "fullname": "Leadership and Change",
    "info": "Models of change/leadership. How leaders can promote personal, organizational, and societal change. Case studies, action research. Framework for leadership and change.",
    "prereq": []
  },
  {
    "uid": "798993",
    "code": "PA5104",
    "subject": "PA",
    "number": "5104",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Res Mgmt for Pub/NP Orgs",
    "fullname": "Human Resource Management for Public and Nonprofit Organizations",
    "info": "Theory/practice of developing, utilizing, and aligning human resources to improve culture/outcomes of nonprofit/public organizations. HR strategy, individual diversity, leadership, selection, training, compensation, classification, performance appraisal, future HR practices.",
    "prereq": []
  },
  {
    "uid": "805121",
    "code": "PA5105",
    "subject": "PA",
    "number": "5105",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Leadership",
    "fullname": "Integrative Leadership: Leading Across Sectors to Address Grand Challenges",
    "info": "Are you interested in working across government, business, and the non-profit sector for public good? Are you wondering how you can create sustainable shared leadership on challenges that can best be addressed together? This course explores multi-sector leadership and related governance and management challenges from a variety of perspectives and provides an opportunity for students to work together to apply what they are learning individually and in teams through in-class exercises and a final team project. The course is taught by a team of interdisciplinary faculty and considers different contexts, forms, and specific examples of multisector leadership that can enable transformative action to tackle a significant societal issue and achieve lasting change. Credit will be not be granted if credit has been received for GCC 5023, OLPD 6402, PUBH 6702, MGMT 6402, PA 5130, LAW 6623.",
    "prereq": []
  },
  {
    "uid": "805126",
    "code": "PA5106",
    "subject": "PA",
    "number": "5106",
    "honors": false,
    "writingIntensive": false,
    "name": "Gov't, Ethics, & Public Will",
    "fullname": "Government, Ethics and the Public Will",
    "info": "Links between core ethical values/formation documents that have shaped democracy in United States or student's homeland. Ethics/agency. Ethics in context of leadership development. Compose narrative of ethical practice.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "807275",
    "code": "PA5107",
    "subject": "PA",
    "number": "5107",
    "honors": false,
    "writingIntensive": false,
    "name": "Ldrship & Reflective Practice",
    "fullname": "Leadership, Reflective Practice, and Critical Theory: A Practicum",
    "info": "For students immersed in a cultural shift, organization, or leadership form who wish to learn how to negotiate international, cross-cultural/political contradictions. Critical approach to understanding adult learning. How to perceive and challenge dominant ideology, unmask power, contest hegemony, overcome alienation, and practice democracy.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "809721",
    "code": "PA5108",
    "subject": "PA",
    "number": "5108",
    "honors": false,
    "writingIntensive": false,
    "name": "Board ldrship development",
    "fullname": "Board leadership development",
    "info": "Nonprofit board governance. Governance models, roles/responsibilities, ethics/dynamics. Current research/concepts along with students' current board experiences to illuminate challenges/explore solutions that build board leadership competencies.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "014674",
    "code": "PA5111",
    "subject": "PA",
    "number": "5111",
    "honors": false,
    "writingIntensive": false,
    "name": "Financing Public & NP Orgs",
    "fullname": "Financing Public and Nonprofit Organizations",
    "info": "Financial statements/theories, terminology, principles, skills to prepare solutions for public/nonprofit organization financing. Analysis of operating/capital budgets, short-term/long-term debt management, retirement financing, endowment investing. Tools/techniques.prereq: 5003 or instr consent",
    "prereq": {
      "code": "PA 5003",
      "subject": "PA",
      "id": "5003"
    }
  },
  {
    "uid": "014403",
    "code": "PA5112",
    "subject": "PA",
    "number": "5112",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Budgeting",
    "fullname": "Public Budgeting",
    "info": "Budget processes in legislative/executive branches of federal, state, and local government. Program planning evaluation/administration. Techniques of budget/program analysis. Use of budget as policy/management tool. Analysis of fund flows within/among governments.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007749",
    "code": "PA5113",
    "subject": "PA",
    "number": "5113",
    "honors": false,
    "writingIntensive": false,
    "name": "St/Loc Publ Finance",
    "fullname": "State and Local Public Finance",
    "info": "Theory/practice of financing. Providing public services at state/local level of government. Emphasizes integrating theory/practice, applying materials to specific policy areas, and documenting wide range of institutional arrangements across/within the 50 states.",
    "prereq": []
  },
  {
    "uid": "813765",
    "code": "PA5114",
    "subject": "PA",
    "number": "5114",
    "honors": false,
    "writingIntensive": false,
    "name": "Public/Nprofit Budget Analysis",
    "fullname": "Budget Analysis in Public and Nonprofit Orgs",
    "info": "Techniques, terminology, concepts and skills for developing and analyzing operating and capital budgets in public and nonprofit organizations. Budget analysis using case studies, problem sets, and spreadsheets. Time value of money, cost-benefit analysis, break-even analysis, sensitivity analysis, and fiscal analysis.prereq: PA 5003",
    "prereq": {
      "code": "PA 5003",
      "subject": "PA",
      "id": "5003"
    }
  },
  {
    "uid": "016599",
    "code": "PA5115",
    "subject": "PA",
    "number": "5115",
    "honors": false,
    "writingIntensive": false,
    "name": "State/Local Public Svcs/Financ",
    "fullname": "State and Local Public Services and Finance",
    "info": "Organization, delivery, economic analysis, and finance of state and local public services and functions.",
    "prereq": []
  },
  {
    "uid": "813775",
    "code": "PA5116",
    "subject": "PA",
    "number": "5116",
    "honors": false,
    "writingIntensive": false,
    "name": "Financing Public/NP Orgs",
    "fullname": "Financing Public and Nonprofit Organizations",
    "info": "Financial resource management for public and nonprofit organizations. Short-term and long-term debt management, retirement financing, and endowment investing. Conceptual frameworks and analytical techniques applied to real-world problems. Financial management in context of national and regional economies.prereq: PA 5003; credit will not be granted if credit already received for: PA 5111",
    "prereq": [
      {
        "code": "PA 5003",
        "subject": "PA",
        "id": "5003"
      },
      {
        "code": "PA 5111",
        "subject": "PA",
        "id": "5111"
      }
    ]
  },
  {
    "uid": "007773",
    "code": "PA5121",
    "subject": "PA",
    "number": "5121",
    "honors": false,
    "writingIntensive": false,
    "name": "Intergov Relations",
    "fullname": "Intergovernmental Relations",
    "info": "Theory/practice of intergovernmental relations in the United States. Historical, political, and economic roots of contemporary institutions. Intergovernmental dimensions of specific policy areas: education, economic development, metropolitan affairs, social welfare, and other areas of student interest.",
    "prereq": []
  },
  {
    "uid": "014295",
    "code": "PA5122",
    "subject": "PA",
    "number": "5122",
    "honors": false,
    "writingIntensive": false,
    "name": "Law and Public Affairs",
    "fullname": "Law and Public Affairs",
    "info": "Law and public policy in the United States are in a dialogue with each other. This dynamic is reflected in the differing roles of legislatures and courts, as well as the other institutions (for example, executive agencies that adopt regulations) involved in making law and policy. This course aims to give students an understanding of how law and policy interact in the American context using historical materials and examples from other countries to provide a broader perspective on how the interaction works today.  Our exploration will necessarily involve the critical role of the United States Constitution and state constitutions in establishing the parameters for both law and policy.  We will also examine particular instances of policy and law interactions on topics such as abortion, civil rights, criminal justice, elections, education and speech.Readings will include judicial opinions, legislation examples, policy and legal articles and other materials.  Class time will include guest speakers from the disciplines of law, politics and public affairs, discussion in small and large groups and only an occasional short lecture. Grades will be based on written student reflections on the readings, 2-3 short papers exploring how law and policy apply to particular topics, and a longer research paper that examines the interaction of law and policy on a topic important to the student.Instructors have been legal, political and policy practitioners.  Some have served in the state legislature.",
    "prereq": []
  },
  {
    "uid": "014799",
    "code": "PA5123",
    "subject": "PA",
    "number": "5123",
    "honors": false,
    "writingIntensive": false,
    "name": "Philanthropy in America",
    "fullname": "Philanthropy in America: History, Practice, and Trends",
    "info": "Theory/practice of philanthropy. Foundation/corporate/ individual giving. History/economic structure/dynamics. Models of philanthropy, components of grant making/seeking. Current debates, career options.",
    "prereq": []
  },
  {
    "uid": "805014",
    "code": "PA5130",
    "subject": "PA",
    "number": "5130",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Leadership Seminar",
    "fullname": "Integrative Leadership Seminar",
    "info": "Concepts, practices, people, and organizations associated with integrative leadership: public-private partnerships to address strategic challenges for mutual benefit. Case materials, readings, presentations, discussion.",
    "prereq": []
  },
  {
    "uid": "014369",
    "code": "PA5131",
    "subject": "PA",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "Conflict Mgt Theory",
    "fullname": "Conflict Management: Readings in Theory and Practice",
    "info": "Current theory. Review of conflict resolution strategies. Aspects of interpersonal, group, organizational, and systemic conflict.",
    "prereq": []
  },
  {
    "uid": "014774",
    "code": "PA5132",
    "subject": "PA",
    "number": "5132",
    "honors": false,
    "writingIntensive": false,
    "name": "Mediation Training",
    "fullname": "Mediation Training",
    "info": "Creating an arena for mediation. Skills/expectations needed to mediate disputes between individuals, among groups: balanced (peer or colleague), imbalanced (power differentials). Role playing, group debriefing, critique. Cases.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "014777",
    "code": "PA5133",
    "subject": "PA",
    "number": "5133",
    "honors": false,
    "writingIntensive": false,
    "name": "Conflict Mgt Prosem",
    "fullname": "Conflict Management Proseminar",
    "info": "Topics in conflict management research/practice. Theoretical implications, practical applications from the perspectives of participants. National/international issues.",
    "prereq": []
  },
  {
    "uid": "014781",
    "code": "PA5134",
    "subject": "PA",
    "number": "5134",
    "honors": false,
    "writingIntensive": false,
    "name": "Conflict Mgt Prosem",
    "fullname": "Conflict Management Proseminar",
    "info": "Topics in conflict management. Theoretical implications, practical applications from the perspectives of participants. National/international issues.",
    "prereq": []
  },
  {
    "uid": "815303",
    "code": "PA5135",
    "subject": "PA",
    "number": "5135",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Conflict: Negotiation",
    "fullname": "Managing Conflict: Negotiation",
    "info": "This course teaches the theory and the practice of negotiation strategies with an emphasis on applied, personal skill building constructed on a foundation of research and practice in the field. Students will apply their negotiation skills across interpersonal, public dispute, government, and private sector settings. The course focuses on developing students’ personal theory of practice for decision-making, effective communication and impactful leadership through practice of distributive bargaining, value creation, consensus building, facilitation, and mediation exercises and discussions. ",
    "prereq": []
  },
  {
    "uid": "816312",
    "code": "PA5136",
    "subject": "PA",
    "number": "5136",
    "honors": false,
    "writingIntensive": false,
    "name": "Group Process Facilitation",
    "fullname": "Group Process Facilitation for Organizational and Public/Community Engagement",
    "info": "Group process facilitation components, theories, tools, techniques. Facilitators role in group goals and processes. Facilitation in public policy. Cross-cultural challenges. Topics may include meeting management, group decision-making, conflict, participatory leadership, and other tools.",
    "prereq": []
  },
  {
    "uid": "816313",
    "code": "PA5137",
    "subject": "PA",
    "number": "5137",
    "honors": false,
    "writingIntensive": false,
    "name": "Project Management in Public",
    "fullname": "Project Management in the Public Arena",
    "info": "Project management and leadership strategies for implementing public policy, including new or revised government programs, public works, and regulations. Use of project management concepts, principles, and tools, including project definition, scoping, planning, scheduling (using the critical path method), budgeting, monitoring, staffing, and managing project teams. Application of \"agile\" and \"extreme\" project management in situations of complexity and uncertainty, including those due to the scrutiny and expectations of elected officials, the media, citizens, and other stakeholders.",
    "prereq": []
  },
  {
    "uid": "792332",
    "code": "PA5142",
    "subject": "PA",
    "number": "5142",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Issues Fac Strategies",
    "fullname": "Public Issues Facilitation Strategies",
    "info": "Processes that encourage civic participation and effective, timely decision-making. Students identify/examine facilitation components and link them to public issues, examine one approach/theory of facilitation and apply it to a case study, and share experiences/cases with other learners.",
    "prereq": []
  },
  {
    "uid": "792333",
    "code": "PA5143",
    "subject": "PA",
    "number": "5143",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Ldrship for Comm Good",
    "fullname": "Teaching Leadership for the Common Good",
    "info": "Main concepts in \"leadership for the common good\" framework. Tools/exercises for applying these concepts. How to teach others about leadership for the common good.",
    "prereq": []
  },
  {
    "uid": "809722",
    "code": "PA5144",
    "subject": "PA",
    "number": "5144",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Entrepreneurship",
    "fullname": "Social Entrepreneurship",
    "info": "Introduction to field of social entrepreneurship. Prepares current/future managers/leaders to create, develop, lead socially entrepreneurial organizations/initiatives.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "810135",
    "code": "PA5145",
    "subject": "PA",
    "number": "5145",
    "honors": false,
    "writingIntensive": false,
    "name": "Civic Participation",
    "fullname": "Civic Participation in Public Affairs",
    "info": "Critique/learn various approaches to civic participation in defining/addressing public issues. Readings, cases, classroom discussion, facilitating/experiencing engagement techniques. Examine work of practitioner, design engagement process.",
    "prereq": []
  },
  {
    "uid": "815304",
    "code": "PA5151",
    "subject": "PA",
    "number": "5151",
    "honors": false,
    "writingIntensive": false,
    "name": "Org Perspectives on Global Dev",
    "fullname": "Organizational Perspectives on Global Development & Humanitarian Assistance",
    "info": "Organizational analysis of international development and humanitarian assistance, including perspectives from sociology, political science, psychology, public administration, and management. Examines efforts of multiple organizational players, including NGOs, governments, bi-lateral and multi-lateral organizations, corporations, foundations, and international organizations. Critical analysis of aid organizations, especially regarding ways in which they reflect and create power and privilege, the manner in which individuals needs and desires interact with, support, or challenge the needs of the organization, and how all of this is influenced by forces outside the boundary of the organization. Students practice developing actionable recommendations to improve the effectiveness of international aid organizations in the context of multiple (and often contested) understandings of global development needs and conflicting stakeholder demands. Readings, class discussions, mini-lectures, simulations, case analyses, group projects, oral presentations, memo writing, opinion writing.",
    "prereq": []
  },
  {
    "uid": "815940",
    "code": "PA5152",
    "subject": "PA",
    "number": "5152",
    "honors": false,
    "writingIntensive": false,
    "name": "Ldrshp for Grand Challenges",
    "fullname": "Leadership to Address Global Grand Challenges",
    "info": "Global grand challenges are novel, emergent, complex, and beyond the resources of any single sector to address. Skills-based course that introduces participants to integrative leadership strategies effective in addressing such challenges, with specific focus on leadership practices that foster collective action across diverse groups of people.",
    "prereq": []
  },
  {
    "uid": "816966",
    "code": "PA5161",
    "subject": "PA",
    "number": "5161",
    "honors": false,
    "writingIntensive": false,
    "name": "Redesigning Human Services",
    "fullname": "Redesigning Human Services",
    "info": "This course provides an in-depth examination of the history and institutions delivering human services in the United States, with an emphasis on how  human-centered design can help  improve service provision and outcomes. It explores how public, nonprofit, and philanthropic structures create unique operational realities and cultures that must be navigated to lead change across institutional boundaries. It also systematically investigates contributors to disparities in the human services system, particularly race. The use of frameworks such as human-centered design, human services value curve, and an equity lens will help us on this exploration. Course learning materials take students through a design process to highlight strategies for systems change and improvement grounded in outcomes.  Design processes are iterative and involve understanding and engaging the people and context in problem solving. Through project-based learning approach, students will understand the various constraints that need to be navigated in design: feasibility, viability, and desirability. Students gain experience using design to help appreciate these constraints and develop strategies for overcoming them. ",
    "prereq": []
  },
  {
    "uid": "817376",
    "code": "PA5162",
    "subject": "PA",
    "number": "5162",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Service Redesign",
    "fullname": "Public Service Redesign Workshop",
    "info": "Public service delivery innovation and redesign in health and human services fields to improve outcomes. Study and application of theories of organizational development, leadership, and system change. Social system dynamics analysis. Engaging diverse stakeholders. Effects and influence of implicit bias on current and redesigned efforts. Models and tools for public service redesign.",
    "prereq": []
  },
  {
    "uid": "809910",
    "code": "PA5180",
    "subject": "PA",
    "number": "5180",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Exec Ldrship",
    "fullname": "Topics in Executive Leadership",
    "info": "Selected topics in executive leadership.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "816314",
    "code": "PA5181",
    "subject": "PA",
    "number": "5181",
    "honors": false,
    "writingIntensive": false,
    "name": "Exec Public Safety Ldrship I",
    "fullname": "Executive Public Safety Leadership I",
    "info": "Public safety executive leadership, citizen engagement, and organizational change. Understanding the self and community. Leadership foundations and methods. Public trust and legitimacy. Community participation, inclusion and problem solving. This hybrid course meets 1-2 days per month with all other coursework completed online. It is a prerequisite for PA 5182: Public Safety Leadership II.prereq: Public or nonprofit officials with experience in or with public safety agencies, including law enforcement, fire, emergency management/medical services, or military.",
    "prereq": []
  },
  {
    "uid": "816315",
    "code": "PA5182",
    "subject": "PA",
    "number": "5182",
    "honors": false,
    "writingIntensive": false,
    "name": "Exec Public Safety Ldship II",
    "fullname": "Executive Public Safety Leadership II",
    "info": "Public safety executive leadership, citizen engagement, and organizational change. Applying Executive Leadership in Complex Situations. Collaboration. Leadership, bias, and diversity. Decision-making and public communications during crisis. Employee wellness and human resources leadership. Application of executive leadership in building teams. This hybrid course meets 1-2 days per month with all other coursework completed online. It is the second in a series with Public Safety Leadership I offered fall term.prereq: Public or nonprofit officials with experience in or with public safety agencies, including law enforcement, fire, emergency management/medical services, or military.",
    "prereq": []
  },
  {
    "uid": "010176",
    "code": "PA5190",
    "subject": "PA",
    "number": "5190",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership & Mgmt Topics",
    "fullname": "Topics in Public and Nonprofit Leadership and Management",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "792167",
    "code": "PA5201W",
    "subject": "PA",
    "number": "5201",
    "honors": false,
    "writingIntensive": true,
    "name": "American Cities I",
    "fullname": "American Cities I: Population and Housing",
    "info": "Emergence of North American cities. Residential building cycles, density patterns. Metropolitan housing stocks, supply of housing services. Population/household types. Neighborhood-level patterns of housing use. Housing prices. Intraurban migration. Housing submarkets inside metro areas. Emphasizes linking theory, method, and case studies.",
    "prereq": []
  },
  {
    "uid": "790462",
    "code": "PA5202W",
    "subject": "PA",
    "number": "5202",
    "honors": false,
    "writingIntensive": true,
    "name": "American Cities II",
    "fullname": "American Cities II: Land Use, Transportation, and the Urban Economy",
    "info": "Urban economy, its locational requirements. Central place theory. Transportation and urban land use, patterns/conflicts. Industrial/commercial land blight. Real estate redevelopment. Historic preservation. Emphasizes links between land use, transportation policy, economic development, and local fiscal issues. U.S.-Canadian contrasts.",
    "prereq": []
  },
  {
    "uid": "792281",
    "code": "PA5203W",
    "subject": "PA",
    "number": "5203",
    "honors": false,
    "writingIntensive": true,
    "name": "Perspectives on Planning",
    "fullname": "Geographical Perspectives on Planning",
    "info": "Includes additional weekly seminar-style meeting and bibliography project on topic selected in consultation with instructor.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "803014",
    "code": "PA5204",
    "subject": "PA",
    "number": "5204",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Spatial&Social Dynamics",
    "fullname": "Urban Spatial and Social Dynamics",
    "info": "Behavioral theories of internal spatial arrangement, functioning, characteristics of cities at macro level/how they produce system of cities. Factors influencing urban spatial structure over time. Urban form, land use/rent. Spatial expression of economic, social, political forces.prereq: urban/regional planning Major/minor in or public affairs PhD or instr consent",
    "prereq": []
  },
  {
    "uid": "818228",
    "code": "PA5205",
    "subject": "PA",
    "number": "5205",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistics for Planning",
    "fullname": "Statistics for Planning",
    "info": "Basic statistical tools for empirical analysis in urban and regional planning, including descriptive statistics, frequency distributions, elementary probability theory, research design and sampling, statistical inference, hypothesis testing, cross-tabulation/chi-square distribution, correlation, and simple/multiple regression analysis.",
    "prereq": []
  },
  {
    "uid": "825351",
    "code": "PA5206",
    "subject": "PA",
    "number": "5206",
    "honors": false,
    "writingIntensive": false,
    "name": "The City of White Supremacy",
    "fullname": "The City of White Supremacy",
    "info": "The title of this course is meant to signal the objective of scrutinizing how systems of white supremacy have shaped the American city and how the American city functions in ways that reproduce and reinforce white supremacy. The colonization of the Americas coincided with the fabrication of racial identities that set the terms for membership in what became a white supremacist/racial state wherein all things, including spatial thinking and design, conformed to a racial calculus. As Lipsitz (2007: 12) tells us, “The lived experience of race has a spatial dimension, and the lived experience of space has a racial dimension.” The core of this class will, however, focus on later developments characteristic of the period of rapid urbanization from the Jim Crow era through the New Deal and Civil Rights periods to today. The first section of the course will focus on frameworks for understanding white supremacy generally, and as it relates to urban development specifically.  The second section considers specific domains of urban policy and planning using white supremacy as the analytic framework. In these weeks we examine how white supremacy has been expressed across a range of urban development issue areas, including housing, transportation, the urban environment, education, criminal justice, and urban design, and how policies and planning practice have maintained or disrupted systems of white supremacy.",
    "prereq": []
  },
  {
    "uid": "818119",
    "code": "PA5209",
    "subject": "PA",
    "number": "5209",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Planning & Health Equity",
    "fullname": "Urban Planning and Health Equity",
    "info": "This interdisciplinary course examines the causes and consequences of place-based health disparities in cities, explores how health disparities can be mitigated and exacerbated by urban planning decisions, and introduces best practices in urban planning for achieving community health equity. The course will involve extensive readings, guest lectures, field-based assignments, data-collection activities, and local community involvement. Twin Cities has one of the largest disparities in health outcomes in the nation and local practitioners are pioneering new urban planning solutions to reduce place-based health disparities. The course will utilize this location advantage and use the region as an immersive learning environment. Students are expected to apply knowledge and skills learned in the class locally in the Twin Cities region.At the end of the course, students will be able to: Understand the historical foundations, current trends and challenges, and international perspectives in connecting urban planning to health equity issues; investigate how various planning sectors and urban environment dimensions, including land use, transportation, open space, housing, food systems, and community social capital, interact to affect health disparities in cities; critically evaluate how existing planning processes and decisions respond to the needs of vulnerable populations and contribute to health equity; and develop skills to engage communities and identifying community-sensitive solutions for reducing place-based health disparities. Fulfills a requirement for graduate Health Equity Minor (http://www.sph.umn.edu/academics/minor/health-equity/). ",
    "prereq": []
  },
  {
    "uid": "007813",
    "code": "PA5211",
    "subject": "PA",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "Land Use Planning",
    "fullname": "Land Use Planning",
    "info": "Physical/spatial basis for land use planning at community/regional level. Role of public sector in guiding private development. Land use regulations, comprehensive planning, growth management, innovative land use planning/policies.prereq: Major or minor in urban/regional planning or instr consent",
    "prereq": []
  },
  {
    "uid": "007740",
    "code": "PA5212",
    "subject": "PA",
    "number": "5212",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Urb Change",
    "fullname": "Managing Urban Growth and Change",
    "info": "Theory/practice of planning, promoting, and controlling economic growth/change in urban areas. Economic development tools available to state/local policymakers, historic context of their use in the United States. legal, social, and economic implementation constraints. Interactions among economic, social, and demographic trends.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "808393",
    "code": "PA5213",
    "subject": "PA",
    "number": "5213",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Site Planning",
    "fullname": "Introduction to Site Planning",
    "info": "Analyzing/preparing graphic plans for development or redevelopment of property. Site planning issues, process, opportunities, details, and techniques. Hands-on preparation of a site plan. Site visits, lectures, research, presentations, exam, in-class exercises.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "825352",
    "code": "PA5214",
    "subject": "PA",
    "number": "5214",
    "honors": false,
    "writingIntensive": false,
    "name": "Planning/Design:UrbPublicRealm",
    "fullname": "Planning & Design for the Urban Public Realm",
    "info": "The Great Inversion, or what former Minneapolis Mayor RT Rybak called “the flight to the city,” has been ongoing for two decades, and to preserve and enhance the quality of life in our cities, we must continue to invest in our urban public realm.  Cities must maintain and improve older parks, plazas and streets, but they must also provide new public spaces in developing areas that never had them before - waterfronts, industrial sites, rail yards, and acres of surface parking.  Perhaps most important yet easily overlooked is the re-envisioning of the public right-of-way – the street – as a place that accommodates not just cars but multiple transportation modes including buses, rail, bicycles, and scooters and other forms of personal transport, all integrated into an accessible, pedestrian-friendly, safe, and green environment.  The greening of city streets is critical for the creation of lush and livable places while also producing social, economic, and environmental benefits.Since the start of the Covid 19 pandemic in March 2020, our collective experience of the urban public realm and its meaning and value to us have changed dramatically.  Our use of public places has increased as parkways once dominated by cars were closed off and filled with pedestrians, cyclists, skateboarders, roller skaters, roller skiers, and people on all other sorts of wheeled conveyances.  Park spaces that were once often largely empty filled with people getting exercise, enjoying nature, visiting playgrounds, meeting friends, social-distance dating, taking walking happy hours, having picnics, playing spike ball, hula-hooping, and in the case of the homeless, camping out to avoid the dangers of shelters, to socially distance themselves, and in some cases, both.  Following the May 2020 death of George Floyd in police custody, our experience of the public realm changed again to include protests, marches, riots, property damage, the creation of new public art, the erection of new monuments, and the removal of old ones.  Since March 2020, we have been learning to use our public places many new ways, some traditional, some adaptive, and some temporary.  And the economic effects of the Coronavirus – the recession, job losses, reduced spending, and a decline in business – mean that cities and other governments will likely have less tax revenue and therefore less money to invest in the public realm in the coming years.  This will mean not only fewer projects for new or revitalized public places, but also less money for maintenance, operations, and programming of existing places.  It is possible that our public realm will become a little worn in the coming years.Now more than ever, the work of improving our public realm requires a commitment to multi-disciplinary collaboration and broad and genuine stakeholder engagement processes at an entirely new level.  Complicated public realm projects require a form of project team leadership that looks more like representative democracy than the imposition of a wonderfully pure vision by a single brilliant designer.  Facilitating this process successfully requires uniquely skilled and open-minded planners and designers who can help us all envision a better way to live together in our cities.  Last but not least, 2020 has shown us that social investment and planning for equity and justice in the public realm is as important, if not more important, than capital investment in the actual physical infrastructure.The purpose of this course is to help planners, designers, and other city builders come to understand the opportunities and challenges of project implementation through the lens of a specific project type:  The Urban Public Realm Project.  The course integrates theory and practice into a framework for understanding the experience of public places and the role of planning and design in the implementation of urban public realm projects – from inception through construction, start-up, and ongoing operations.",
    "prereq": []
  },
  {
    "uid": "804586",
    "code": "PA5215",
    "subject": "PA",
    "number": "5215",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Apps in Land Use Planning",
    "fullname": "Computer Applications in Land Use Planning",
    "info": "Geographical information system software, simulation modeling of land use/development, 3D software, the Internet. Project applications in citizen participation/decision-making. Meets weekly in mostly lab setting.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "816787",
    "code": "PA5216",
    "subject": "PA",
    "number": "5216",
    "honors": false,
    "writingIntensive": false,
    "name": "Graphics for Planning & PubPol",
    "fullname": "Digital Graphics for Planning and Public Policy Makers",
    "info": "Concepts, tools, and techniques of graphic representation software tools commonly used in urban planning and basic fundamentals of information design for public policy (InDesign, AutoCAD, Illustrator, PhotoShop). Workflow among programs and production of posters. Course project utilizes individual and group work. ",
    "prereq": []
  },
  {
    "uid": "014504",
    "code": "PA5221",
    "subject": "PA",
    "number": "5221",
    "honors": false,
    "writingIntensive": false,
    "name": "Priv Sect Developmt",
    "fullname": "Private Sector Development",
    "info": "Roles of various participants in land development. Investment objectives, effects of regulation. Overview of development process from private/public perspective.",
    "prereq": []
  },
  {
    "uid": "007798",
    "code": "PA5231",
    "subject": "PA",
    "number": "5231",
    "honors": false,
    "writingIntensive": false,
    "name": "Transit Planning/Mgmt",
    "fullname": "Transit Planning and Management",
    "info": "Principles/techniques related to implementing transit systems. Historical perspective, characteristics of travel demand, demand management. Evaluating/benchmarking system performance. Transit-oriented development. Analyzing alternative transit modes. System design/finance. Case studies, field projects.prereq: Grad student or  instr consent",
    "prereq": []
  },
  {
    "uid": "797464",
    "code": "PA5232",
    "subject": "PA",
    "number": "5232",
    "honors": false,
    "writingIntensive": false,
    "name": "Trans Pol/Planning/Deployment",
    "fullname": "Transportation Policy, Planning, and Deployment",
    "info": "Development of transportation policy, making of transportation plans, deployment of transportation technologies. Lectures, interactive case studies, role playing.",
    "prereq": []
  },
  {
    "uid": "810045",
    "code": "PA5233",
    "subject": "PA",
    "number": "5233",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainable Transportation",
    "fullname": "Sustainable Transportation",
    "info": "This course emphasizes the theories and practices associated with a sustainable transportation system, especially pedestrian and bicycle transportation. It covers key concepts of sustainable transportation, climate mitigation and adaptation, and planning for pedestrian and bicycle transportation.  The specific topics regarding pedestrian and bicycle transportation include benefits and advocacy, data collection and performance measures, demand forecasting, behavior and its connection with neighborhood design and zoning, safety, planning, design principles of facilities, equity, and innovations.",
    "prereq": []
  },
  {
    "uid": "818912",
    "code": "PA5234",
    "subject": "PA",
    "number": "5234",
    "honors": false,
    "writingIntensive": false,
    "name": "UrbanTransportation Plng/Pol",
    "fullname": "Urban Transportation Planning and Policy",
    "info": "This course will integrate key theories and practices, traditional and emerging policy instruments, and techniques for urban and transportation planning. The goal is to introduce students to essential concepts, influential thinkers, and important debates associated with the land use-transportation connection as a foundation for both professional and academic work. By the end of the course, students will be able to comprehend urban transportation planning process and demand forecasting; the theories and empirical evidence on land use and transportation interactions; land use and transportation policy instruments and their effectiveness; and land use and transportation planning in developing countries.",
    "prereq": []
  },
  {
    "uid": "007799",
    "code": "PA5241",
    "subject": "PA",
    "number": "5241",
    "honors": false,
    "writingIntensive": false,
    "name": "Environ Planning",
    "fullname": "Environmental Planning",
    "info": "Relationship between natural resources, ecology, and urban development; planning design principles in balancing these. Legal/regulatory context of environmental planning. Methods of environmental impact analysis.",
    "prereq": []
  },
  {
    "uid": "807899",
    "code": "PA5242",
    "subject": "PA",
    "number": "5242",
    "honors": false,
    "writingIntensive": false,
    "name": "Env Planning/Pol/Dec Making",
    "fullname": "Environmental Planning, Policy, and Decision Making",
    "info": "Theory and practice. Ethical, legal, and institutional frameworks relative to a range of environmental issues.  Innovative environmental decision making informed by collaboration, conflict resolution, adaptive management, and resilience thinking.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "820160",
    "code": "PA5243",
    "subject": "PA",
    "number": "5243",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Justice",
    "fullname": "Environmental Justice in Urban Planning & Public Policy",
    "info": "Environmental racism can be defined as policies and practices that result in communities of Black, Indigenous and other people of color (BIPoC communities) being overexposed to environmental harms and being denied access to environmental goods. The environmental justice (EJ) movement in the United States was birthed in the 1980s with the aim of ending environmental racism. Early EJ activism was led by Black rural communities protesting the disproportionate presence of toxic waste facilities in their neighborhoods and Latinx migrant farmworkers who were overexposed to harmful pesticides. Central to the course is the understanding that structural racism, in the form of social, political, and economic forces, has denied BIPoC individuals and communities their rights to live in clean environments and access natural resources that allow communities to build and maintain their physical, mental, emotion, and fiscal health. Although the course focuses on race and racism, it takes as axiomatic that racism is intertwined with other systems of oppression including, but not limited to, sexism, classism, ableism, homophobia, and transphobia. The course begins by tracing the history of the EJ movement and unpacking the terms “racism” and “justice.” The main body of the course will focus on a series of issues that EJ scholars and activists address including pollution, greening, transportation, disasters, and climate change. The course ends with discussions and reflections on our roles, responsibilities and possibilities as public policy and planning scholars, researchers and practitioners to work towards ending environmental racism and achieving EJ for all. The required “readings” for the course will include academic journal articles, news stories, governmental policies, podcasts, videos, poetry, and short stories. This will allow us to understand the theoretical and methodological approaches to EJ activism and research and explore popular and creative forms of knowledge about EJ which will add depth to our understanding and analysis of relevant plans and policies. Our time together in the classroom will primarily be a mix of lectures, group discussions, in-class exercises, and occasionally guest speakers. While we will reflect on some international issues and materials, we will largely focus on EJ in the United States. ",
    "prereq": []
  },
  {
    "uid": "007802",
    "code": "PA5251",
    "subject": "PA",
    "number": "5251",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Planning & Mgmt",
    "fullname": "Strategic Planning and Management",
    "info": "Theory and practice of strategic planning and management for public and nonprofit organizations and networks. Strategic planning process, management systems; stakeholder analyses. Tools and techniques such as purpose expansions, SWOT analyses, oval mapping, portfolio analyses, and logic models.",
    "prereq": []
  },
  {
    "uid": "007797",
    "code": "PA5252",
    "subject": "PA",
    "number": "5252",
    "honors": false,
    "writingIntensive": false,
    "name": "Project Plang/Mgmt",
    "fullname": "Strategy and Tactics in Project Planning and Management",
    "info": "Planning, analysis, evaluation, and implementation of short-term plans/projects. Technical analyses, interactional elements of completing projects within budget/time constraints. Strategic/tactical choices in planning. Case examples.",
    "prereq": []
  },
  {
    "uid": "007796",
    "code": "PA5253",
    "subject": "PA",
    "number": "5253",
    "honors": false,
    "writingIntensive": false,
    "name": "Planning/Participation Process",
    "fullname": "Designing Planning and Participation Processes",
    "info": "Theory/practice of design, implementation, evaluation of planning/participation processes. Types of planning. Stakeholders, including underrepresented groups. Costs/benefits of participation. Participant roles. Planning/participation tools/techniques.prereq: Major or minor in urban/regional planning or instr consent",
    "prereq": []
  },
  {
    "uid": "795802",
    "code": "PA5254",
    "subject": "PA",
    "number": "5254",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic  Planning Tools/Tech",
    "fullname": "Strategic Planning Tools and Techniques",
    "info": "Techniques may include purpose expansions, competitive/collaborative analysis methods, core/distinctive competency identification, portfolio methods, logic and business process models, scenario construction, balanced scorecards, and related strategy mapping tools.",
    "prereq": []
  },
  {
    "uid": "795803",
    "code": "PA5255",
    "subject": "PA",
    "number": "5255",
    "honors": false,
    "writingIntensive": false,
    "name": "Stakeholder Identification",
    "fullname": "Stakeholder Identification, Analysis, and Influence Techniques",
    "info": "Techniques include basic identification, power vs. interest grids, stakeholder influence diagrams, discerning the common good, support vs. opposition matrices, participation planning matrices, and ethical analysis.",
    "prereq": []
  },
  {
    "uid": "797107",
    "code": "PA5261",
    "subject": "PA",
    "number": "5261",
    "honors": false,
    "writingIntensive": false,
    "name": "Housing Policy",
    "fullname": "Housing Policy",
    "info": "Institutional/environmental setting for housing policy in the United States. Competing views of solving housing problems through public intervention in the market. Federal/local public sector responses to housing problems.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "818915",
    "code": "PA5262",
    "subject": "PA",
    "number": "5262",
    "honors": false,
    "writingIntensive": false,
    "name": "Neighborhood Revitalization",
    "fullname": "Neighborhood Revitalization Theories and Strategies",
    "info": "Policymaking/politics of planning in housing, community development, social policy. Connecting policy to local/regional politics. Role of institutional decision-making structures on policy outcomes. Importance of citizens, social movements, interest groups in policymaking process. ",
    "prereq": []
  },
  {
    "uid": "825659",
    "code": "PA5263",
    "subject": "PA",
    "number": "5263",
    "honors": false,
    "writingIntensive": false,
    "name": "Financing Affordable Hsg in US",
    "fullname": "Financing Affordable Multi-Family Rental Hsg in US",
    "info": "Financing affordable multifamily housing in the United States is a complicated endeavor that requires more than just a command of financial principles and analysis but also an appreciation for the nuances and fluidity of policy, public-private-partnership, and public discourse. This course will demystify the financial drivers and consequences in our affordable housing delivery system. It will simultaneously build participants’ confidence in basic financial modeling of affordable housing using the most common capital structures, while also exploring the relationship of finance with policy and regulation, real estate and urban planning objectives, design, and program limitations.Participants in this course will emerge with:- An understanding of the roles, risk sharing and influence of public and private actors in the financing and provision of affordable housing.- A practical familiarity with the major financing programs and policies that drive investment in this sector.- Experience in financial modeling specific to multifamily affordable housing which will prepare them for work in the industry, regardless of role.",
    "prereq": []
  },
  {
    "uid": "797459",
    "code": "PA5271",
    "subject": "PA",
    "number": "5271",
    "honors": false,
    "writingIntensive": false,
    "name": "GIS: Apps in Planning/Pol Anal",
    "fullname": "Geographic Information Systems: Applications in Planning and Policy Analysis",
    "info": "Introduction to GIS. Applications in public planning and policy analysis. Operational skills in GIS software. Mapping analysis of U.S. Census material. Local/state government management/planning. Spatial statistical analysis for policy/planning.prereq: Major in urban/regional planning or instr consent",
    "prereq": []
  },
  {
    "uid": "807283",
    "code": "PA5281",
    "subject": "PA",
    "number": "5281",
    "honors": false,
    "writingIntensive": false,
    "name": "Immigrants: Planning &Policies",
    "fullname": "Immigrants, Urban Planning and Policymaking in the U.S.",
    "info": "This course examines the impact of contemporary immigration in the U.S. on urban planning and public affairs. Through a review of canonical scholarship and contemporary research, it engages several issues including migration theory, an exploration of immigrant settlement patterns, labor market outcomes for immigrants, and community development in immigrant communities. The course concludes with a focus on how urban planners and public policy makers can work more effectively with immigrants in the U.S. ",
    "prereq": []
  },
  {
    "uid": "010179",
    "code": "PA5290",
    "subject": "PA",
    "number": "5290",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Planning",
    "fullname": "Topics in Planning",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "007736",
    "code": "PA5301",
    "subject": "PA",
    "number": "5301",
    "honors": false,
    "writingIntensive": false,
    "name": "Pop Issues: US & Global South",
    "fullname": "Population Methods & Issues for the United States & Global South",
    "info": "Basic demographic measures/methodology. Demographic transition, mortality, fertility. Perspectives on nonmarital fertility, marriage, divorce, cohabitation. Cultural differences in family structure, aging, migration, refugee movements, population policies. Discussion of readings.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "014584",
    "code": "PA5311",
    "subject": "PA",
    "number": "5311",
    "honors": false,
    "writingIntensive": false,
    "name": "Program Evaluation",
    "fullname": "Program Evaluation",
    "info": "This course covers the core principals, methods, and implementation of evaluation research. Students will learn through an applied partnership with a nonprofit or state/local government clients. The course is designed for both students interested in a potential career in evaluation and those that want to be better consumers of research. Past programmatic/policy areas included health and human services, education, environment science, economic development, transportation, and evidence-based policymaking. ",
    "prereq": []
  },
  {
    "uid": "825184",
    "code": "PA5312",
    "subject": "PA",
    "number": "5312",
    "honors": false,
    "writingIntensive": false,
    "name": "CBA for Program Evaluation",
    "fullname": "Cost-Benefit Analysis for Program Evaluation",
    "info": "This class introduces students to cost-benefit analysis, the leading evidenced-based method for determining whether a government program or policy improves the well-being of society. Starting with the foundations of welfare economics, students learn how to monetize important benefits and costs associated with government activities. Topics include discounting future benefits and costs, the roles of standing and risk, ways of valuing human lives and other benefits that may be hard to value in dollar terms. Students will acquire skills needed to perform relevant calculations needed for the economic assessment of benefits relative to costs and the ability to critique the use of these methods regarding how they may advantage or disadvantage some members of society or particular types of policies. Policy areas include preventive interventions in social, health and education as well as applications in transportation and environmental policy.  Prerequisite: PA 5021 or other prior course in microeconomics.",
    "prereq": {
      "code": "PA 5021",
      "subject": "PA",
      "id": "5021"
    }
  },
  {
    "uid": "006913",
    "code": "PA5341",
    "subject": "PA",
    "number": "5341",
    "honors": false,
    "writingIntensive": false,
    "name": "State/Local Public Svcs/Financ",
    "fullname": "State and Local Public Services and Finance",
    "info": "Organization, delivery, economic analysis, and finance of state and local public services and functions.",
    "prereq": []
  },
  {
    "uid": "010178",
    "code": "PA5390",
    "subject": "PA",
    "number": "5390",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Adv Pol Analysis Methd",
    "fullname": "Topics in Advanced Policy Analysis Methods",
    "info": "Topics in advanced policy analysis methods.",
    "prereq": []
  },
  {
    "uid": "014860",
    "code": "PA5401",
    "subject": "PA",
    "number": "5401",
    "honors": false,
    "writingIntensive": false,
    "name": "Poverty, Inequality",
    "fullname": "Poverty, Inequality, and Public Policy",
    "info": "Nature/extent of poverty/inequality in the United States, causes/consequences, impact of government programs/policies. Extent/causes of poverty/inequality in other developed/developing countries.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "801864",
    "code": "PA5405",
    "subject": "PA",
    "number": "5405",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Policy Implementation",
    "fullname": "Public Policy Implementation",
    "info": "Theory, tools, and practice of the implementation of public policy, particularly in areas involving public, private, and nonprofit organizations. Analytical approach focuses on multiple levels in policy fields to pinpoint and assess implementation challenges and levers for improvement. ",
    "prereq": []
  },
  {
    "uid": "797161",
    "code": "PA5411",
    "subject": "PA",
    "number": "5411",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Welfare Policy",
    "fullname": "Child Welfare Policy",
    "info": "Intersection of conceptual orientations of developmental psychology with policies that affect children/families. Demographic, historical, social trends that underlie assumptions driving policies directed at women/children. Projections of future policies.",
    "prereq": []
  },
  {
    "uid": "014585",
    "code": "PA5412",
    "subject": "PA",
    "number": "5412",
    "honors": false,
    "writingIntensive": false,
    "name": "Aging & Disability",
    "fullname": "Aging and Disability Policy",
    "info": "Policy debates concerning populations that are aging or disabled. Students learn/practice analyses in context of important health, social, and economic policy debates. Readings on current theory/evidence.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "810246",
    "code": "PA5413",
    "subject": "PA",
    "number": "5413",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Childhood & Public Pol",
    "fullname": "Early Childhood and Public Policy",
    "info": "State/federal/int'l policies/legislation touching first 5 years of child's life. Family, community, institutional roles in promoting children's social/cognitive/emotional development. Health, mental health, poverty, special needs, economic/social justice. Part of Early Childhood Pol cert.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "800555",
    "code": "PA5414",
    "subject": "PA",
    "number": "5414",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Human Rights: Work&Educ",
    "fullname": "Child Human Rights: Work and Education",
    "info": "International child labor issues. Options for improving child well-being, including policies/programs that have potential to affect the lives of millions of children.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "818042",
    "code": "PA5415",
    "subject": "PA",
    "number": "5415",
    "honors": false,
    "writingIntensive": false,
    "name": "Effective Policies forChildren",
    "fullname": "Effective Policies for Children in the First Decade",
    "info": "Policies to improve the wellbeing of children through the first decade of life are examined using examples from economics and other disciplines. The course focuses on the role of government in helping to promote early childhood development. Readings and projects focus on policies or programs that affect child outcomes from the prenatal period to third grade. Students will become familiar with the importance of rigorous impact evaluations and the use of cost-effectiveness and cost-benefit analysis as a tool for efficient resource allocation. Some familiarity with regression analysis would be helpful.",
    "prereq": []
  },
  {
    "uid": "825353",
    "code": "PA5416",
    "subject": "PA",
    "number": "5416",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ of US Social Ins Programs",
    "fullname": "Economics of U.S. Social Insurance Programs",
    "info": "This class will introduce you to the Economics of Social Insurance Programs.  It begins by introducing a framework to evaluate the efficiency and equity of social insurance programs, drawing on theory from the economics of insurance programs and behavioral economics.   It then applies this framework to social insurance programs such as workers’ compensation, unemployment insurance, health insurance, social security, TANF and Supplemental Nutritional Assistance, and the Earned Income Tax Credit.  Prerequisite: PA 5021 or other prior course in microeconomics. ",
    "prereq": {
      "code": "PA 5021",
      "subject": "PA",
      "id": "5021"
    }
  },
  {
    "uid": "008421",
    "code": "PA5421",
    "subject": "PA",
    "number": "5421",
    "honors": false,
    "writingIntensive": false,
    "name": "Racial Inequality",
    "fullname": "Racial Inequality and Public Policy",
    "info": "Historical roots of racial inequality in American society. Contemporary economic consequences. Public policy responses to racial inequality. Emphasizes thinking/analysis that is critical of strategies offered for reducing racism and racial economic inequality.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "808513",
    "code": "PA5422",
    "subject": "PA",
    "number": "5422",
    "honors": false,
    "writingIntensive": false,
    "name": "Diversity and Public Policy",
    "fullname": "Diversity and Public Policy",
    "info": "What is diversity? What role does it play in public policy? What role should it play? Whom does diversity include or exclude? In this highly participatory class, we will apply a policy analysis lens to explore how diversity interacts with, contributes to, and is impacted by policy. The interdisciplinary course readings draw from topics such as gender identity, intersectionality, socio-economic class, race and ethnicity, indigenous ways of knowing, sexual orientation, and disability. Students examine the evolution of difference and diversity, explore various domains of diversity (gender, race, ethnicity, sexuality, disability, class), and synthesize and apply this knowledge to the development of a policy brief that focuses on a particular policy or organizational problem.",
    "prereq": []
  },
  {
    "uid": "816839",
    "code": "PA5426",
    "subject": "PA",
    "number": "5426",
    "honors": false,
    "writingIntensive": false,
    "name": "Marginalized Grps:Comm-Eng Res",
    "fullname": "Community-Engaged Research and Policy with Marginalized Groups",
    "info": "Marginalized populations tend to be viewed as objects of social policy, passive victims, or a cause of social problems. Processes of marginalization we will explore in this class include: structural racism, colonization, economic exclusion and exploitation, gender bias, and more. Policy and research are typically driven by mainstream/dominant society members with little direct knowledge about the real lives of people on the margins. This can lead to misguided actions, misunderstandings, paternalism, unintended negative consequences, and further marginalization and/or stigmatization. In this course, we will learn about community-engaged research methodologies such as participatory action research (PAR) and community-based participatory research (CPBR). We will use case studies to explore the challenges, rewards, and ethical implications of these community-engaged approaches to research and policy-making. Possible topics include, but are not limited to, sex trafficking, housing, and youth work. Instructors and students in the course will work together on a real-world research and policy challenge so that students contribute to ongoing work in the field in real-time.",
    "prereq": []
  },
  {
    "uid": "789807",
    "code": "PA5431",
    "subject": "PA",
    "number": "5431",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Policies on Work & Pay",
    "fullname": "Public Policies on Work and Pay",
    "info": "Public policies affecting employment, hours of work, and institutions in labor markets. Public programs impacting wages, unemployment, training, collective bargaining, job security, and workplace governance. Policy implications of the changing nature of work.prereq: [[PA 5031 or equiv], grad student] or instr consent",
    "prereq": {
      "code": "PA 5031",
      "subject": "PA",
      "id": "5031"
    }
  },
  {
    "uid": "007605",
    "code": "PA5441",
    "subject": "PA",
    "number": "5441",
    "honors": false,
    "writingIntensive": false,
    "name": "Ed Pol & State Leg",
    "fullname": "Education Policy and the State Legislature",
    "info": "How Minnesota legislature decides K-12 issues. Implications for higher education. How to increase one's influence in process. Discussions with persons who influence statewide educational policy. Presentations. Field trip to state legislature.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "014495",
    "code": "PA5442",
    "subject": "PA",
    "number": "5442",
    "honors": false,
    "writingIntensive": false,
    "name": "Education Law and Policy",
    "fullname": "Education Law and Policy",
    "info": "The nation's schools have become a conflict zone where our polarized views and values are clashing. There are new arguments over curriculum, books in school libraries, and support for transgender students, as well as continuing struggles over racial segregation, disparities in learning, the quality of education, and how to pay for it.This course will explore these challenges from the perspectives of law and public policy, recognizing that decisions of institutions in both sectors contribute to the design of America's system of public preK-12 education. Justice, equity, diversity, and inclusion are central to nearly all the topics we will discuss. We will explore the process of education law and policy change, including school integration, the inclusion of students with disabilities, accountability, and calls for education reform. We will also consider the existing empirical evidence informing the debates on policy alternatives.Discussions and readings about a diverse range of cultures and countries will help us think about education law and policy in a broader context. Course readings will include judicial decisions, statutes, policy analyses, law reviews, empirical research articles, and journalistic accounts of education and human development issues. Classes will consist of active student discussion of legal and policy design issues, presentations by guest speakers who are active practitioners and advocates in education law and policy, and presentations of group research projects.",
    "prereq": []
  },
  {
    "uid": "792007",
    "code": "PA5451",
    "subject": "PA",
    "number": "5451",
    "honors": false,
    "writingIntensive": false,
    "name": "Immigration Health Pub Policy",
    "fullname": "Immigration, Health and Public Policy",
    "info": "How to access demographic, health, and background information on US immigrants. Characteristics and health needs of immigrants. Designing culturally competent health programs. How to advocate for needed policy changes to promote immigrant health and wellbeing. Community visits required. Online course.",
    "prereq": []
  },
  {
    "uid": "797932",
    "code": "PA5452",
    "subject": "PA",
    "number": "5452",
    "honors": false,
    "writingIntensive": false,
    "name": "Immigration and Public Policy",
    "fullname": "Immigration and Public Policy",
    "info": "How to employ an analytical framework to analyze a current immigration policy proposal. Topics vary (e.g., president's guest worker proposal, democratic alternative proposals).prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "794674",
    "code": "PA5480",
    "subject": "PA",
    "number": "5480",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Race/Ethnicity/Pub Pol",
    "fullname": "Topics in Race, Ethnicity, and Public Policy",
    "info": "Link between race/ethnicity and public policy. How to identify/measure racial/ethnic disparities and their historical/cultural origins and policy impacts and to craft politically feasible remedies. Topics may include criminal justice, housing, child welfare, and education.prereq: Jr or sr or grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "010180",
    "code": "PA5490",
    "subject": "PA",
    "number": "5490",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Social Policy",
    "fullname": "Topics in Social Policy",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "007763",
    "code": "PA5501",
    "subject": "PA",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Theories & Policies of Dev",
    "fullname": "Theories and Policies of Development",
    "info": "What makes some countries wealthier than others, one group of people healthier and more educated than another? How does the behavior of rich nations affect poor nations? Origins of development thought, contemporary frameworks and policy debates. Economic, human, and sustainable development.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007764",
    "code": "PA5502",
    "subject": "PA",
    "number": "5502",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ Development II",
    "fullname": "Economic Development II",
    "info": "Economic development from macroeconomic/open-economy perspective. Sources of economic growth. Agricultural development. Import-substitution industrialization. Endogenous growth models. Population, migration, and human development. Policy reform/adjustment.",
    "prereq": []
  },
  {
    "uid": "809933",
    "code": "PA5503",
    "subject": "PA",
    "number": "5503",
    "honors": false,
    "writingIntensive": false,
    "name": "Economics of Development",
    "fullname": "Economics of Development",
    "info": "Economic growth, inequality, poverty, rural/urban labor markets, risk/insurance. Investments in human capital, credit markets, gender/household economics, governance/institutional issues. Microfinance, conditional cash transfers, labor/education policies.prereq: PA 5501 or concurrent registration is required (or allowed) in PA 5501",
    "prereq": {
      "code": "PA 5501",
      "subject": "PA",
      "id": "5501"
    }
  },
  {
    "uid": "825354",
    "code": "PA5504",
    "subject": "PA",
    "number": "5504",
    "honors": false,
    "writingIntensive": false,
    "name": "Transforming Development",
    "fullname": "Transforming Development",
    "info": "Emerging infectious diseases such as COVID-19, antimicrobial resistance, climate change, loss of species, and habitats are driven by our dominant definition of development and pose existential challenges to humankind. COVID-19 has laid bare the ethnic, racial, class, and gender inequalities in the ways societies across the globe lead material life (economy). Current social and environmental challenges are global and local in scale and challenge us to consider poverty alleviation not as an international issue and only of concern for low resourced communities and developing countries, but one in need of attention in every country in the world, including peoples in the wealthy West.  This course examines the emerging pluriverse paradigm and some of the models intending to transform development: nature rights movement, community economy, solidarity movement, degrowth, transition design, and ontologies and epistemologies of First Nations in North and South America. We will contrast these development models to sustainable development goals and the green growth approach.",
    "prereq": []
  },
  {
    "uid": "014706",
    "code": "PA5511",
    "subject": "PA",
    "number": "5511",
    "honors": false,
    "writingIntensive": false,
    "name": "PlanningforEquitableEconomies",
    "fullname": "Planning for Equitable Economies",
    "info": "How do we make our local economies work well for more people in a community, inclusive of the needs of workers, families, and youth that are most at risk of being left behind. This course provides an overview of a range of community economic development tools and strategies, as well as emergent and established debates around their use and implementation. Students will learn to think critically about the merits and limits of specific strategies, from industrial recruitment and business investment incentives to innovation districts and small business and entrepreneurial assistance. We will also explore the conditions that enable certain cities, regions, and communities to implement these strategies in more equitable and environmentally sensitive ways. prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "812967",
    "code": "PA5512",
    "subject": "PA",
    "number": "5512",
    "honors": false,
    "writingIntensive": false,
    "name": "Planning for Jobs",
    "fullname": "Planning for Jobs",
    "info": "This seminar explores the changing nature of the American job and the transformative forces—from corporate power and labor union decline to the rise of the ‘gig’ economy and even climate change—that have influenced this shift in recent decades and have added to growing economic insecurity. We will consider local and regional strategies for helping today’s workers withstand changing economic and environmental pressures, including: shoring up labor laws and wage protections; coordinating economic and workforce development initiatives; advancing forms of labor and community organizing that promote economic and environmental justice; using novel employer engagement tools to promote strong, safe, and opportunity-rich workplaces. This seminar will not only help you think through the policy and planning implications of U.S. labor market restructuring, but also consider how the forces behind this restructuring potentially affect your own career prospects.prereq: Grad or instructor consent",
    "prereq": []
  },
  {
    "uid": "007766",
    "code": "PA5521",
    "subject": "PA",
    "number": "5521",
    "honors": false,
    "writingIntensive": false,
    "name": "Devlpmt Plan/Policy",
    "fullname": "Development Planning and Policy Analysis",
    "info": "Techniques of development planning/policy analysis at national, regional, and project levels. Effects of external shocks and government interventions on national/regional economies. Macroeconomic modeling, input-output analysis, social accounting matrices/multipliers, project evaluation.prereq: 5031 or equiv recommended or instr consent",
    "prereq": {
      "code": "PA 5031",
      "subject": "PA",
      "id": "5031"
    }
  },
  {
    "uid": "014813",
    "code": "PA5522",
    "subject": "PA",
    "number": "5522",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl dev pol/families/health",
    "fullname": "International Development Policy, Families, and Health",
    "info": "Implications of paid/unpaid labor for development policy, using household as prism. Legal/cultural use of property rights. Financial effects of ill health. Caregiving. Work-family conflict, policies that alleviate it. Role of gender. Qualitativequantitative methods. Readings, lectures, discussions.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007795",
    "code": "PA5531",
    "subject": "PA",
    "number": "5531",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainable Dev in Prac",
    "fullname": "Global Sustainable Development in Practice",
    "info": "Introduction to the concept of global sustainable development, with a particular focus on the systems and institutions supporting and implementing development and the challenges associated with achieving positive development outcomes. The class will cover the Sustainable Development Goals and other key development indicators; explore theoretical concepts underpinning development practice including political economy and political ecology; provide critical insight into the institutions engaging in sustainable development including governments, NGOs, and international financial institutions; and consider ethical issues associated with working in the field of sustainable development.",
    "prereq": []
  },
  {
    "uid": "807916",
    "code": "PA5561",
    "subject": "PA",
    "number": "5561",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender & Int'l Development",
    "fullname": "Gender and International Development",
    "info": "Women and men are affected differently by development and participate differently in policy formulation and implementation. Gender-sensitive perspective. Historical, political context. Global South. Policy, practice, and experience (theory and measurement; international, national, local stakeholders; effects of policy and practice on development).prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "010182",
    "code": "PA5590",
    "subject": "PA",
    "number": "5590",
    "honors": false,
    "writingIntensive": false,
    "name": "Economic & Comm Dev Topics",
    "fullname": "Topics in Economic and Community Development",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "007869",
    "code": "PA5601",
    "subject": "PA",
    "number": "5601",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Survey: Gender/Pub Pol",
    "fullname": "Global Survey of Gender and Public Policy",
    "info": "Introduction to the key concepts and tools necessary for gender policy analysis. Survey of the major findings in the field of gender and public policy in policy areas such as poverty alleviation, health, international security, environment and work-family reconciliation. Scope includes local, national, and global policy arenas as well as exploration of gender and the politics of policy formulation. ",
    "prereq": []
  },
  {
    "uid": "007755",
    "code": "PA5611",
    "subject": "PA",
    "number": "5611",
    "honors": false,
    "writingIntensive": false,
    "name": "Feminist Economics",
    "fullname": "Feminist Economics",
    "info": "Feminist philosophy, methodology, and economic practice. Feminist perspectives on development and the global economy, work/family. Heterodox traditions in economics.",
    "prereq": []
  },
  {
    "uid": "800839",
    "code": "PA5621",
    "subject": "PA",
    "number": "5621",
    "honors": false,
    "writingIntensive": false,
    "name": "Board Svc in Women & Pub Pol",
    "fullname": "Board Service in Women and Public Policy",
    "info": "Students serve as full members of a board of directors for a women's movement organization. Organizational leadership. How to be an effective board member. Twin Cities feminist nonprofit organizations.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "818459",
    "code": "PA5622",
    "subject": "PA",
    "number": "5622",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender/IntersectionalLdrshipI",
    "fullname": "GAINS: Gender and Intersectional Network Series, Leadership Workshop I",
    "info": "GAINS: Gender and Intersectional Network Series, Leadership Workshop prepares students with the skills to lead effectively and challenge institutional norms and practices that perpetuate disparities based on gender, race and other structural inequalities. Women, racially marginalized individuals, and LGBTI-identified individuals are still disproportionately underrepresented in leadership roles in public, private, and nonprofit institutions in spite of high rates of educational attainment and equal opportunity legislation. Women of color and indigenous women face even greater obstacles to advancement compared to white women. Barriers to diverse leadership today stem less from overt discrimination and more from \"second generation\" forms of bias—often invisible but still powerful cultural beliefs as well as workplace structures and practices. Achieving leadership parity thus entails individual, collective and institutional change. Course pedagogy includes case studies, group discussions, self-reflection and simulations that have been proven to have a lasting impact on individual leaders in developing their own leadership capacity. Guest speakers offer potential role models and share their leadership perspectives. The workshop and two-semester format of the course allows students to benefit from a cohort model of learning and develop their own network of practice. Moreover, GAINS focuses not just on individual leadership development, but also organizational and systems level change. Students of all genders interested in addressing personal and institutional barriers to advancement that are rooted in gender inequalities and their intersections with race and other forms of inequality are welcome to enroll. To get the most out of the network and cohort development aspects of this course, students are encouraged to participate for two semesters.",
    "prereq": []
  },
  {
    "uid": "818458",
    "code": "PA5623",
    "subject": "PA",
    "number": "5623",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender/IntersectionalLdrship I",
    "fullname": "GAINS: Gender and Intersectional Network Series, Leadership Workshop II",
    "info": "GAINS: Gender and Intersectional Network Series, Leadership Workshop prepares students with the skills to lead effectively and challenge institutional norms and practices that perpetuate disparities based on gender, race and other structural inequalities. Women, racially marginalized individuals, and LGBTI-identified individuals are still disproportionately underrepresented in leadership roles in public, private, and nonprofit institutions in spite of high rates of educational attainment and equal opportunity legislation. Women of color and indigenous women face even greater obstacles to advancement compared to white women. Barriers to diverse leadership today stem less from overt discrimination and more from “second generation” forms of bias – often invisible but still powerful cultural beliefs as well as workplace structures and practices. Achieving leadership parity thus entails individual, collective and institutional change. Course pedagogy includes case studies, group discussions, self-reflection and simulations that have been proven to have a lasting impact on individual leaders in developing their own leadership capacity. Guest speakers offer potential role models and share their leadership perspectives. The workshop and two-semester format of the course allows students to benefit from a cohort model of learning and develop their own network of practice. Moreover, GAINS focuses not just on individual leadership development, but also organizational and systems level change. Students of all genders interested in addressing personal and institutional barriers to advancement that are rooted in gender inequalities and their intersections with race and other forms of inequality are welcome to enroll. To get the most out of the network and cohort development aspects of this course, students are encouraged to participate for two semesters. ",
    "prereq": []
  },
  {
    "uid": "825355",
    "code": "PA5631",
    "subject": "PA",
    "number": "5631",
    "honors": false,
    "writingIntensive": false,
    "name": "LGBTQ Politics & Policy",
    "fullname": "LGBTQ Politics & Policy",
    "info": "The advancement of LGBTQ rights in the United States has experienced unprecedented success over the last twenty years, shifting both public attitude towards and legal protection for LGBTQ Americans. This course will provide an in-depth analysis of current LGBTQ policy achievements in the United States, including the recognition of marriage equality in all 50 states, the repeal of Don’t Ask, Don’t Tell, increased anti-discrimination protections, and rights for people who are transgender or gender non-conforming. Emphasis will be placed on how these victories were achieved, including background on the strategies and tactics used to generate policy results. We will also take a critical look at such milestones and examine what they mean for the entire LGBTQ population, including queer people of color, transgender and gender nonconforming individuals, the disabled, and economically disadvantaged. Intersectionality will be a key aspect of the course, in particular, analysis on how the differential effects of policy among segments of the population that may not experience the benefits of policy passage as quickly or as broadly. Incorporated into this analysis will be readings from queer liberation scholars to help us evaluate the pros and cons of existing LGBTQ policy gains. The course will explore what full equality might look like for LGBTQ people in the United States with an examination of what can and cannot be achieved through policy. Practical application on how policy is made will be intertwined throughout the course. Topics to be covered include the meaning and measurement of LGBTQ identity; estimates of those who identify as LGBTQ; the measurement of Americans’ attitudes on LGBTQ issues and how these attitudes have changed over the past few decades; assessment of changes in law and policies at the national, state and local levels; and the implications of these changes for the lived experience of LGBTQ people and their families, including health, well-being, stigma and discrimination.",
    "prereq": []
  },
  {
    "uid": "826448",
    "code": "PA5662",
    "subject": "PA",
    "number": "5662",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender&Soc Pol:Europe/Americas",
    "fullname": "Gender & Social Policy in Europe & the Americas",
    "info": "The variety of approaches to social welfare policies around the globe – from pensions to poverty relief to parental leave – offer many lessons not only for how to address basic needs, but also for building more gender- and race- equitable societies. This course provides conceptual and historical grounding for understanding the origins and impacts of social welfare policies, and how these policies serve as crucial arbiters of gender, race and class relations. The course compares historical and contemporary social policy regimes and their impacts on individuals and societies in Europe and the Americas. The course centers on four questions: 1) How are social policies “gendered”, “raced” and “classed”?  The course readings and discussions consider multiple feminist perspectives and approaches which show how social policies are based on specific assumptions about gender and its intersections with race, class, and immigrant status, and in turn create or reinforce a particular social order. 2) Why do social policies in different countries look so different? The course traces the historical development of specific social welfare regimes with attention to interactions between states, political parties, unions, firms, and social movements. Understanding the historical political determinants of current policies can provide clues to appropriate strategies for change. 3) What lessons can we glean from other countries to promote equity across gender and other forms of inequality? The course dives into research that measures the impact of specific social policies on equity and considers the appropriateness and transferability of policy ideas across borders. 4) What are the contemporary challenges to social welfare systems and their ability to promote gender equity? The course considers a variety of such challenges such as stagnating birth rates that threaten the economic solvency of social policy systems; the pressures of refugees and mass migration; and how the global COVID-19 pandemic both revealed and exacerbated underlying deficiencies in social policy systems.",
    "prereq": []
  },
  {
    "uid": "819039",
    "code": "PA5683",
    "subject": "PA",
    "number": "5683",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender, Race & Political Rep",
    "fullname": "Gender, Race and Political Representation",
    "info": "Explores intersection of gender, race and political issues to identify best practices for strengthening roles of under-represented groups in governance.  Individual, structural and institutional factors attributed to increasing the election and appointment of under-represented groups.  Theories of citizen representation.  Global approach with cross-national evidence and comparative country studies. ",
    "prereq": []
  },
  {
    "uid": "014768",
    "code": "PA5690",
    "subject": "PA",
    "number": "5690",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Women/Gender/Pub Pol",
    "fullname": "Topics in Women, Gender and Public Policy",
    "info": "Selected topics.\n\nprereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "009327",
    "code": "PA5701",
    "subject": "PA",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Science and State",
    "fullname": "Science and State",
    "info": "Relationship between science and contemporary society. Nature of science: its values, processes, and ways of knowing. How science has influenced U.S. political institutions and political/judicial processes. Issues in current debate over U.S. science policy.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "009342",
    "code": "PA5711",
    "subject": "PA",
    "number": "5711",
    "honors": false,
    "writingIntensive": false,
    "name": "Science, Tech & Environ Policy",
    "fullname": "Science, Technology & Environmental Policy",
    "info": "Interplay of science, technology, the environment, and society. Approaches from across the social sciences will cover how science and technology can create new environmental pressures as well as policy challenges in a range of spheres from climate change to systems of intellectual property and international development.",
    "prereq": []
  },
  {
    "uid": "814497",
    "code": "PA5712",
    "subject": "PA",
    "number": "5712",
    "honors": false,
    "writingIntensive": false,
    "name": "Science to Action",
    "fullname": "Science to Action: All Paths",
    "info": "Understanding best practices for translating science to action for the common good, integrating action across multiple sectors: i.e., coordinating action by communities, government, for-profit, non-profit/NGO and academia. Case studies and theories are discussed to address societal grand challenge topic.",
    "prereq": []
  },
  {
    "uid": "806436",
    "code": "PA5715",
    "subject": "PA",
    "number": "5715",
    "honors": false,
    "writingIntensive": false,
    "name": "Deliberating Sci/Tech/Env Pol",
    "fullname": "Deliberating Science, Technology, and Environmental Policy",
    "info": "Exploration of the conceptual and ethical dimensions of science, technology, and environmental policy. Discussion-based course with rotating topics.",
    "prereq": []
  },
  {
    "uid": "015861",
    "code": "PA5721",
    "subject": "PA",
    "number": "5721",
    "honors": false,
    "writingIntensive": false,
    "name": "Energy Systems and Policy",
    "fullname": "Energy Systems and Policy",
    "info": "Impact of energy production/consumption choices on environmental quality, sustainable development, and other economic/social goals. Emphasizes public policy choices for energy/environment, linkages between them.",
    "prereq": []
  },
  {
    "uid": "007725",
    "code": "PA5722",
    "subject": "PA",
    "number": "5722",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ of Environmental Policy",
    "fullname": "Economics of Environmental Policy",
    "info": "Introduction to economic principles and methods as they apply to environmental issues such as climate change, biodiversity conservation, and water quality. Course will cover benefit-cost analysis, methods of environmental valuation, as well as critiques of market-based solutions to environmental challenges.",
    "prereq": []
  },
  {
    "uid": "806666",
    "code": "PA5723",
    "subject": "PA",
    "number": "5723",
    "honors": false,
    "writingIntensive": false,
    "name": "Water Policy",
    "fullname": "Water Policy",
    "info": "Socio-cultural, legal, and economic forces that affect water resource use. Water quality, Clean Water Act contrasted with international laws, roles of State and Local agencies. Water supply, drought, flooding, drainage, irrigation, storage. Sulfide mining, Line 3, hypoxia, wildfire, climate, snowpack, extreme events, China south-to-north transfer, CEC’s, AIS, Aral Sea, CAFOs, and more.",
    "prereq": []
  },
  {
    "uid": "815941",
    "code": "PA5724",
    "subject": "PA",
    "number": "5724",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change Policy",
    "fullname": "Climate Change Policy",
    "info": "Existing and proposed approaches to mitigate and adapt to climate change through policies that cross scales of governance (from local to global) and impact a wide range of sectors. Exploration of climate change policy from a variety of disciplinary approaches and perspectives, emphasizing economic logic, ethical principles, and institutional feasibility. How policy can be shaped in the face of a variety of competing interests to achieve commonly desired outcomes. Students develop a deep knowledge of climate change in particular countries through a team final project. prereq: Intro microecon (such as Econ 1101 or equiv)",
    "prereq": {
      "code": "ECON 1101",
      "subject": "ECON",
      "id": "1101"
    }
  },
  {
    "uid": "806653",
    "code": "PA5731",
    "subject": "PA",
    "number": "5731",
    "honors": false,
    "writingIntensive": false,
    "name": "Emerging Science&Technologies",
    "fullname": "Emerging Sciences and Technologies: Policy, Ethics and Law",
    "info": "This interdisciplinary course will examine issues at the nexus of public policy, ethics, law, and emerging sciences and technologies (ES&T) including nanotechnology, genetic and biomedical engineering, synthetic biology, and artificial intelligence. Topics we will explore include the role of science and technology as both a tool for and the subject of policy and law; the policy, ethical, economic, and legal implications of ES&T research and development; environmental and human health risk analysis and regulation (e.g., EPA, FDA, OSHA, and state and local regulatory mechanisms); intellectual property issues; liability issues; and global impacts. Topics will be approached from the perspective of different stakeholders (e.g., federal agencies, industry, academic researchers, the environment, international organizations, and the public) and in the context of different application areas (e.g., drugs, devices, food, agriculture, energy, environmental remediation) using a variety of interdisciplinary approaches. Students with a broad range of interests are encouraged to enroll.     ",
    "prereq": []
  },
  {
    "uid": "806654",
    "code": "PA5741",
    "subject": "PA",
    "number": "5741",
    "honors": false,
    "writingIntensive": false,
    "name": "Risk/Resilience/Dec-making",
    "fullname": "Risk, Resilience and Decision Making",
    "info": "Interplay between risk analysis, decision making, and policy in the context of new and emerging technologies, environmental and human well-being, risk and resilience.  Assessment methods; risk management processes, issues and methods; role/treatment of uncertainty; factors in decision making; risk-based rule making; public values; risk communication and perception. Scientific, technical, social, political, and ethical issues.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "814498",
    "code": "PA5742",
    "subject": "PA",
    "number": "5742",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Study Design",
    "fullname": "Interdisciplinary Environmental Study: Practice and Design",
    "info": "Practice & design of interdisciplinary study to support environmental policy-making. Research design (models, experiments, quasi-experiments, case studies & meta-analysis) from a range of disciplines. Their integration in an overarching framework to address pressing STEP issues (e.g., climate change, food security, energy, future cities).",
    "prereq": []
  },
  {
    "uid": "817378",
    "code": "PA5743",
    "subject": "PA",
    "number": "5743",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Innovation Design Lab",
    "fullname": "Social Innovation Design Lab: Making Your Idea a Reality",
    "info": "Do you have an idea for an organization, initiative or venture that that could address a social or environmental problem? This course is designed to help aspiring social entrepreneurs and changemakers from all disciplines develop a viable proposal for social change. Course content includes an introduction to human-centered design thinking, change management, leadership skills, non-profit and for-profit business models, and social entrepreneurship frameworks. At the end of the course, students present their project to a panel of experts. Students will be prepared to compete in the Acara Challenge for funding if interested.  Students or teams interested in this course should apply by emailing a 1-page resume and project description (1 paragraph to 1 page) of your project/idea to acara@umn.edu. The essay should address your motivation for taking the course, along with describing your idea, where you are with developing it, and what you need to take it forward.",
    "prereq": []
  },
  {
    "uid": "811490",
    "code": "PA5751",
    "subject": "PA",
    "number": "5751",
    "honors": false,
    "writingIntensive": false,
    "name": "Local Climate&EnergyChallenges",
    "fullname": "Addressing Climate and Energy Challenges at the Local Scale",
    "info": "Examine energy and climate innovations at local and community scales. Understand how to implement local policies, projects, and programs with a diverse set of perspectives on energy issues. Develop professional and analytical skills that support solutions to energy and climate challenges.",
    "prereq": []
  },
  {
    "uid": "814499",
    "code": "PA5752",
    "subject": "PA",
    "number": "5752",
    "honors": false,
    "writingIntensive": false,
    "name": "Material-EnergyFlows&SusDev",
    "fullname": "Material-Energy Flows & Sustainable Development",
    "info": "How do material and energy flows shape the development of a sustainable society? Part I introduces concepts of human wellbeing, sustainable development, the role of natural resources and key physical infrastructure in advancing Sustainable Development Goals (SDGs). Part II describes ways to measure progress toward SDGs, particularly those related to material and energy flows. Part III highlights pathways to work toward SDGs, emphasizing principles and concepts from environmental economics.",
    "prereq": []
  },
  {
    "uid": "819927",
    "code": "PA5761",
    "subject": "PA",
    "number": "5761",
    "honors": false,
    "writingIntensive": false,
    "name": "Food-Energy-Water Systems",
    "fullname": "Environmental Systems Analysis at the Food-Energy-Water Nexus",
    "info": "Agricultural lands, water resources, and energy production and transport are interconnected systems with implications for policy and management at local to global scales. This course will explore contemporary issues at the nexus of food, energy, and water with a focus on Midwestern landscapes. Specific topics include farm policy, permitting of pipelines and energy production, mitigation of air and water pollution, and strategies to incentivize the conservation and restoration of landscapes. Students will develop professional skills in systems thinking, scenario analysis, science communication, facilitation, and collective leadership.",
    "prereq": []
  },
  {
    "uid": "825708",
    "code": "PA5771",
    "subject": "PA",
    "number": "5771",
    "honors": false,
    "writingIntensive": false,
    "name": "Change Ldrship for ESG Action",
    "fullname": "Change Leadership for Environmental, Social and Governance Action",
    "info": "Sustainability is increasingly being defined broadly to include the environmental, social and governance (ESG) actions, and effects of organizations.  ESG concepts integrate environmental sustainability with diversity, equity, and inclusion. Individuals working within organizations or seeking to join those organizations have expressed desires to affect the actions of an organization. This course aims to give students hands-on experience with a project investigating, designing, advocating for and implementing an ESG improvement in an existing or new organization. We imagine students in this course as future intrapreneurs (an employee of an organization who creates new opportunities or products in the style of an entrepreneur) transforming practices in existing organizations or as entrepreneurs seeking to create new sustainable organizations, or both. Non-degree-seeking students possessing a bachelor's degree are encouraged to contact the instructor for permission to register.",
    "prereq": []
  },
  {
    "uid": "010183",
    "code": "PA5790",
    "subject": "PA",
    "number": "5790",
    "honors": false,
    "writingIntensive": false,
    "name": "Science/Tech/Env Pol Topics",
    "fullname": "Topics in Science, Technology, and Environmental Policy",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "013920",
    "code": "PA5801",
    "subject": "PA",
    "number": "5801",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Public Policy",
    "fullname": "Global Public Policy",
    "info": "This course explores the emergence and evolution of rules, norms, and institutions that constitute international relations. It will focus, in particular, on those related to questions of war, peace, and governance. For students with an interest in international security, foreign military intervention, democracy and governance promotion, and the political economy of aid.",
    "prereq": []
  },
  {
    "uid": "805511",
    "code": "PA5802",
    "subject": "PA",
    "number": "5802",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Economic Policy",
    "fullname": "Global Economic Policy",
    "info": "Economic logic of globalization, national policy objectives, international finance/financial institutions, international trade and agreements including regional pacts and the WTO, global environmental and resource governance, immigration and emigration, and development challenges.prereq: Major in [public affairs or public policy] or instr consent",
    "prereq": []
  },
  {
    "uid": "814058",
    "code": "PA5805",
    "subject": "PA",
    "number": "5805",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Economics",
    "fullname": "Global Economics",
    "info": "Global trade, exchange rates, finance, international business, and migration in the context of theories and evidence that inform the policies pursued at a national level. The operation of main international organizations dealing with these issues will also be examined.",
    "prereq": []
  },
  {
    "uid": "013830",
    "code": "PA5811",
    "subject": "PA",
    "number": "5811",
    "honors": false,
    "writingIntensive": false,
    "name": "Globalization",
    "fullname": "Public Policy Problems of Globalization",
    "info": "Policy problems facing national and subnational decision makers. Problems caused by increasing international mobility of goods, services, capital, persons, and ideas.",
    "prereq": []
  },
  {
    "uid": "014819",
    "code": "PA5812",
    "subject": "PA",
    "number": "5812",
    "honors": false,
    "writingIntensive": false,
    "name": "Open Economies",
    "fullname": "Open Economy Models: An Assessment",
    "info": "Open economics, implications for policy making/implementation. Issues at level of international/domestic economies.",
    "prereq": []
  },
  {
    "uid": "815942",
    "code": "PA5813",
    "subject": "PA",
    "number": "5813",
    "honors": false,
    "writingIntensive": false,
    "name": "US Foreign Policy",
    "fullname": "US Foreign Policy: Issues and Institutions",
    "info": "This course helps students develop a deep understanding of U.S. foreign policy issues and institutions, and the implications of U.S. global engagement. Through readings, class discussions, and guest lectures, we look at the institutions and processes involved in developing and managing US foreign policy, and use case studies to advance students' knowledge of bilateral and regional issues. We examine the workings of the State Department, the National Security Council, and the Department of Defense; how economic instruments like sanctions are used to advance policy; and how American citizens, lobbyists, and foreign governments influence policy. We incorporate discussions of current events into each class, with students developing skills in writing and presentation critical to foreign policy careers.",
    "prereq": []
  },
  {
    "uid": "815943",
    "code": "PA5814",
    "subject": "PA",
    "number": "5814",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Diplomacy",
    "fullname": "Global Diplomacy in a Time of Change",
    "info": "Taught by the Humphrey School’s diplomat in residence, this course examines the changing world of twenty-first century global diplomacy and how state and nonstate actors are challenging the status quo.  We look at the dynamics behind major international developments—with case studies including BREXIT, the Iran Agreement, climate negotiations, and China’s global initiatives—placed in the context of an examination of how states operate in the international diplomatic sphere and how multilateral organizations enhance or challenge the concept of state sovereignty.  Students gain knowledge about the complexities of diplomacy and negotiation through readings, classroom discussions, and guest speakers and develop professional skills through writing and presentation assignments.",
    "prereq": []
  },
  {
    "uid": "805739",
    "code": "PA5821",
    "subject": "PA",
    "number": "5821",
    "honors": false,
    "writingIntensive": false,
    "name": "Humanitarianism",
    "fullname": "Humanitarianism",
    "info": "Foundations, logic, dynamics, dilemmas, and consequences of humanitarianism, a form of governance that operates in the name of--and for--the international community.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "807299",
    "code": "PA5822",
    "subject": "PA",
    "number": "5822",
    "honors": false,
    "writingIntensive": false,
    "name": "International Security",
    "fullname": "International Security",
    "info": "Theoretical constructs, current debates. Why states fight wars. Causes/consequences of war in Iraq. Effect of nuclear weapons on world safety. Terrorism, civil wars. Nonconventional security threats. Selective abortion and world (un)stability. Causes/effects of wartime sexual violence. Environmental concerns and conflict.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "815944",
    "code": "PA5823",
    "subject": "PA",
    "number": "5823",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Humanitarian Crises",
    "fullname": "Human Rights and Humanitarian Crises: Policy Challenges",
    "info": "Examines response of governments, international organizations, NGOs, and others to global humanitarian and human rights challenges posed by civil conflict and other complex emergencies in places such as Syria, Ukraine, South Sudan, Somalia, Burma, and elsewhere. Course will also consider and assess UN and other institutions established to address these issues (like UNOCHA and UNHCR). In addition, course will examine US policy toward humanitarian issues and refugees (including US refugee admissions).",
    "prereq": []
  },
  {
    "uid": "816316",
    "code": "PA5824",
    "subject": "PA",
    "number": "5824",
    "honors": false,
    "writingIntensive": false,
    "name": "Crisis Simulation",
    "fullname": "International Humanitarian Crisis Simulation",
    "info": "Students learn/practice humanitarian crisis response skills reflecting international standards through a multi-day, humanitarian dynamic crisis simulation. Includes training in international crisis response standards (SPHERE) and population assessment, WASH (water, sanitation and hygiene) for refugee camps, nutrition, interactive shelter design/planning, the international legal basis for humanitarian response, safety and security issues, psychosocial trauma awareness, and field hospital scenarios. Composed of class meetings and an on-site sector skill training and field crisis simulation.",
    "prereq": []
  },
  {
    "uid": "816317",
    "code": "PA5825",
    "subject": "PA",
    "number": "5825",
    "honors": false,
    "writingIntensive": false,
    "name": "Crisis Mgmt in Foreign Affairs",
    "fullname": "Crisis Management in Foreign Affairs",
    "info": "Crisis decision making in foreign policy. Examination of the organization and structure of crisis decision-making within U.S. national security apparatus.  Analysis of in-depth four foreign policy crises (Cuban Missile Crisis, Vietnam—Tet, Iraq, and a current crisis). Crisis simulation with students in the role of national security leaders.",
    "prereq": []
  },
  {
    "uid": "818916",
    "code": "PA5826",
    "subject": "PA",
    "number": "5826",
    "honors": false,
    "writingIntensive": false,
    "name": "National Security Policy",
    "fullname": "National Security Policy",
    "info": "This course will analyze U.S. national security policy and process from the viewpoint of the National Security Council staff.  Students will examine the organization and structure of the U.S. national security apparatus and the national security decision-making process, including individual and political factors; assess central threats to U.S. and international security and develop and discuss policy options to deal with those threats; undertake a major policy review on a specific national security challenge facing the United States, including analysis and recommendations; produce products, both written and oral, crucial to national security policy making (e.g., concise information and action memorandum), and put themselves in the position of national security leaders as part of a policy simulation.  Grades will be based on oral participation, papers, and class reports.  ",
    "prereq": []
  },
  {
    "uid": "826581",
    "code": "PA5827",
    "subject": "PA",
    "number": "5827",
    "honors": false,
    "writingIntensive": false,
    "name": "Int’l Crisis Negotiation Exer",
    "fullname": "International Strategic Crisis Negotiation Exercise",
    "info": "The course will enable students to engage in a simulated multi-party negotiation of a complex, high stakes international crisis with multiple players, focused on a future or current international crisis. It provides students across all degree programs the opportunity to participate in a dynamic, actively managed exercise in which teams attempt to negotiate a solution to a fictional future crisis based on current global realities.  Students will be divided into six or seven teams representing countries or non-state actors involved in the crisis. A subject-matter expert (such as a retired ambassador) will guide the negotiations playing the role of a UN envoy. Each team will be mentored by a retired diplomat, military officer ,or other experienced volunteer who will provide negotiating and strategic advice. A team from the Army War College, a leading institution in strategic exercises, will lead the exercise, providing structured input that gives students a realistic sense of how strategic actors must think and behave in crisis negotiation scenarios. Students are given course material in advance and meet with mentors to prepare for the exercise. A different international crisis is featured each year, and students are encouraged to participate more than once.",
    "prereq": []
  },
  {
    "uid": "827207",
    "code": "PA5828",
    "subject": "PA",
    "number": "5828",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics of Nuclear Weapons",
    "fullname": "The Politics of Nuclear Weapons",
    "info": "Nuclear weapons have been a feature of international politics since the development of nuclear weapons by the United States during World War II. But how exactly do nuclear weapons affect international politics? This course tackles this question. In doing so, we examine the history of the nuclear era, the theories we can use to try to understand the ways in which nuclear weapons affect international politics and key current policy challenges associated with nuclear weapons. For example, we'll ask: how do nuclear weapons work and how are nuclear materials created? Are nuclear weapons a force for peace or for instability and war? How likely is a nuclear war and how close did we come to nuclear war in the Cuban Missile Crisis or other crises? How dangerous is nuclear proliferation and why does the United States go to such lengths to stop other countries from acquiring nuclear weapons? Why does the United States have so many nuclear weapons and what drove the nuclear arms race between the United States and the Soviet Union? Why have indigenous populations often borne the brunt of nuclear testing and how have issues of race and gender played into the history of nuclear weapons? What role do nuclear weapons play in India-Pakistan relations and what role will they play in future U.S.-China relations? How likely is nuclear terrorism? Is nuclear disarmament possible? Is it desirable?",
    "prereq": []
  },
  {
    "uid": "807284",
    "code": "PA5841",
    "subject": "PA",
    "number": "5841",
    "honors": false,
    "writingIntensive": false,
    "name": "Women/Violence/Armed Conflict",
    "fullname": "Women, Violence, and Armed Conflict",
    "info": "Role of women in recent armed conflicts/how women are affected by wartime as combatants, civilians, victims, and perpetrators of war violence. Conflicts in Sierra Leone, Liberia and El Salvador, where women participated in fighting forces in large numbers, as well as women's roles in the Abu Ghraib scandal, female suicide bombers, wartime sexual violence. Policy solutions offered by policymakers and NGOs to deal with problems of gender-based violence.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "814072",
    "code": "PA5851",
    "subject": "PA",
    "number": "5851",
    "honors": false,
    "writingIntensive": false,
    "name": "Middle East Politics",
    "fullname": "Middle East Politics",
    "info": "Middle East Politics examines the domestic, regional, and transnational politics of the Middle East and North Africa. It explores key policy-relevant issues in MENA such as external intervention/occupation, human rights, social movements, political economy, religion and politics, democratization and elections, civil society, and gender.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "810588",
    "code": "PA5880",
    "subject": "PA",
    "number": "5880",
    "honors": false,
    "writingIntensive": false,
    "name": "Exploring Global Cities",
    "fullname": "Exploring Global Cities",
    "info": "Study abroad offered in cities across globe. Opportunities to study policy/planning issues in varied contexts from comparative/inter-cultural perspective. Study/work with practitioners/peers in field. Tanzania odd years/Austria even years. Additional countries may be added in future.",
    "prereq": []
  },
  {
    "uid": "815945",
    "code": "PA5885",
    "subject": "PA",
    "number": "5885",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Rights Policy",
    "fullname": "Human Rights Policy: Issues and Actors",
    "info": "Politics of human rights issue emergence; relevant international, regional, and domestic norms; correlates of state repression; measurement of human rights abuse and remedies; human rights promotion by states, political parties, international organizations, NGOs, social movements, faith-based organizations, and providers of international development assistance.",
    "prereq": []
  },
  {
    "uid": "815968",
    "code": "PA5886",
    "subject": "PA",
    "number": "5886",
    "honors": false,
    "writingIntensive": false,
    "name": "MHR Cohort Sem I",
    "fullname": "Master of Human Rights Cohort Seminar I",
    "info": "The Master of Human Rights Cohort Seminar is a required course for all first-year MHR students. The course is intended to create a cohort group and ensure that all MHR students have an opportunity to work together to explore current issues related to human rights practice, focusing on emerging events or crises, and debates over policy, practice, or theory and for direct contact with and networking particularly with counterparts in the Global South. This course is in a series with, and taken before, PA 5887.prereq: First-year MHR",
    "prereq": []
  },
  {
    "uid": "815969",
    "code": "PA5887",
    "subject": "PA",
    "number": "5887",
    "honors": false,
    "writingIntensive": false,
    "name": "MHR Cohort Sem II",
    "fullname": "Master of Human Rights Cohort Seminar II",
    "info": "The Master of Human Rights Cohort Seminar is a required course for all first-year MHR students. The course is intended to create a cohort group and ensure that all MHR students have an opportunity to work together to explore current issues related to human rights practice, focusing on emerging events or crises, and debates over policy, practice, or theory and for direct contact with and networking particularly with counterparts in the Global South. This course is in a series with, and taken after, PA 5886.",
    "prereq": []
  },
  {
    "uid": "827211",
    "code": "PA5888",
    "subject": "PA",
    "number": "5888",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Rts/Business/Governance",
    "fullname": "Human Rights, Business, and Governance",
    "info": "Businesses are, and always have been, political actors. Perhaps more so today, we see businesses take a stand or remain silent on key issues, including race-based violence in the United States, how to engage in environmental and social protections around mining sites in Peru, or whether to remove investments from Russia at the onset of the war in Ukraine.In 2011, the United Nation’s Human Rights Council unanimously passed the Guiding Principles on Business and Human Rights. This framework outlines that states have the duty to protect human rights, businesses have the responsibility to respect human rights, and all actors—including civil society—should work toward ensuring victims have access to remedy when, and if, a human rights violation occurs.This class focuses on how the “business and human rights” movement emerged, what it has achieved, and the distance it still must go. Together, we will explore the ways in which policy shapes how markets and states are intertwined. We will investigate how governance of private actors occurs, or how local, domestic, and global efforts are combined to shape the prospects of firms to mitigate or exacerbate violence and how policy helps firms promote or degrade democratic practices.",
    "prereq": []
  },
  {
    "uid": "010184",
    "code": "PA5890",
    "subject": "PA",
    "number": "5890",
    "honors": false,
    "writingIntensive": false,
    "name": "Foreign Pol & Intl Aff Topics",
    "fullname": "Topics in Foreign Policy and International Affairs",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "790642",
    "code": "PA5900",
    "subject": "PA",
    "number": "5900",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Apps in Pub Aff (Summer)",
    "fullname": "Computer Applications in Public Affairs (Summer)",
    "info": "Introduction to basic computer systems/applications in public affairs practice (e.g., MS Windows, MS Word). Offered summer.",
    "prereq": []
  },
  {
    "uid": "014796",
    "code": "PA5901",
    "subject": "PA",
    "number": "5901",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Apps in PA",
    "fullname": "Computer Applications in Public Affairs",
    "info": "Introduction to computer systems/applications in public affairs practice.",
    "prereq": []
  },
  {
    "uid": "790419",
    "code": "PA5902",
    "subject": "PA",
    "number": "5902",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Apps in PA",
    "fullname": "Computer Applications in Public Affairs",
    "info": "Introduction to computer systems/applications in public affairs practice.",
    "prereq": []
  },
  {
    "uid": "016901",
    "code": "PA5903",
    "subject": "PA",
    "number": "5903",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Computers at HHH",
    "fullname": "Introduction to Computers and Applications at the Humphrey Institute",
    "info": "Computers/applications. Basic skills. Software such as MS Word, Excel, PowerPoint, Access. Using Internet, e-mail, search engines (for research), HTML (through Web page creation software).",
    "prereq": []
  },
  {
    "uid": "795069",
    "code": "PA5910",
    "subject": "PA",
    "number": "5910",
    "honors": false,
    "writingIntensive": false,
    "name": "Developing Your Pub Svc Career",
    "fullname": "Developing Your Public Service Career",
    "info": "Students investigate/analyze interests, skills, and abilities and combine them in a career plan. Develop tools to demonstrate abilities, document experiences/knowledge, and explore public service career options.",
    "prereq": []
  },
  {
    "uid": "827111",
    "code": "PA5911",
    "subject": "PA",
    "number": "5911",
    "honors": false,
    "writingIntensive": false,
    "name": "Summer Internship",
    "fullname": "Humphrey School Summer Internship",
    "info": "This course is designed to guide students through their summer internship experiences with meaningful exercises in goal setting, networking, professional and identity development, and practical skill building. It is a requirement for students receiving funding through the Humphrey School's Office of Career and Student Success's Unpaid Internship Grants.",
    "prereq": []
  },
  {
    "uid": "797617",
    "code": "PA5912",
    "subject": "PA",
    "number": "5912",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol of Pub Aff/Civ Engagement",
    "fullname": "Politics of Public Affairs and Civic Engagement",
    "info": "Potential for public affairs professionals to be agents/architects of democracy in a radically changing, diverse, global landscape of governance.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "798476",
    "code": "PA5920",
    "subject": "PA",
    "number": "5920",
    "honors": false,
    "writingIntensive": false,
    "name": "Skills Workshop",
    "fullname": "Skills Workshop",
    "info": "Topics on public policy or planning skills. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "809723",
    "code": "PA5924",
    "subject": "PA",
    "number": "5924",
    "honors": false,
    "writingIntensive": false,
    "name": "Intercultural Competence",
    "fullname": "Intercultural Competence",
    "info": "Interacting with/working effectively with diverse populations. Researching ancestry. Analyzing cross-cultural communication issues in organizations. Prejudice, discrimination, group belonging. Analyze intercultural competence of global leader.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "810589",
    "code": "PA5925",
    "subject": "PA",
    "number": "5925",
    "honors": false,
    "writingIntensive": false,
    "name": "Creating an Online Portfolio",
    "fullname": "Creating a Professional Online Portfolio",
    "info": "Build electronic portfolio reflecting knowledge/skills learned in coursework, internships, volunteer efforts, leadership roles, research activities. Promote professional selves using social networking platform.prereq: [MDP, MPA, MPP, MS-STEP, MURP] or instr consent",
    "prereq": []
  },
  {
    "uid": "816318",
    "code": "PA5926",
    "subject": "PA",
    "number": "5926",
    "honors": false,
    "writingIntensive": false,
    "name": "Presentation Skills",
    "fullname": "Presentation Skills: How to Inspire Your Audience and Change the World",
    "info": "Learn techniques for making effective, persuasive presentations to different kinds of audiences. Practice is essential to improve speaking skills and reduce anxiety. Students practice by recording brief weekly presentations and making class presentations in a supportive environment. Techniques for using Powerpoint to create effective slides are practiced. Course components include presentation assignments; peer reviews; readings/videos and reflections; and class participation. May be repeated once.",
    "prereq": []
  },
  {
    "uid": "816319",
    "code": "PA5927",
    "subject": "PA",
    "number": "5927",
    "honors": false,
    "writingIntensive": false,
    "name": "Effective Grantwriting",
    "fullname": "Effective Grantwriting for Nonprofit Organizations",
    "info": "Grantwriting skills, processes, problem,s and resources for nonprofit organizations. Researching and seeking grants. Communication with potential funders and generating financial support. Collaborating effectively with the organization and clients to create substantive, fundable proposals.",
    "prereq": []
  },
  {
    "uid": "819126",
    "code": "PA5928",
    "subject": "PA",
    "number": "5928",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Mgmt/Visualization With R",
    "fullname": "Data Management and Visualization with R",
    "info": "Introduction to R Studio software. Use of R Studio to carry out R file and related database management functions. Tools and techniques for data analysis and statistical programming in quantitative research or related applied areas. Topics include data selection, data manipulation, and data and spatial visualization (including charts, plots, histograms, maps, and other graphs). Prerequisite knowledge: Introductory statistics; ability to create bar graphs, line graphs, and scatter plots in MS Excel; and familiarity with principles of data visualization.",
    "prereq": []
  },
  {
    "uid": "816320",
    "code": "PA5929",
    "subject": "PA",
    "number": "5929",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Visualization",
    "fullname": "Data Visualization: Telling Stories with Numbers",
    "info": "Tools for communicating quantitative information in an intelligent, effective and persuasive way. Topics covered include 1) writing and speaking about data; 2) data management in Excel in order to prepare data for charting; 3) understanding and ability to deploy core concepts in of design, layout, typography and color to maximize the impact of their data visualizations 4) determining which types of statistical measures are most effective for each type of data and message; 5) determining which types of design to use for communicating quantitative information; and 6) designing graphs and tables that are intelligent and compelling for communicating quantitative information.",
    "prereq": []
  },
  {
    "uid": "007478",
    "code": "PA5931",
    "subject": "PA",
    "number": "5931",
    "honors": false,
    "writingIntensive": false,
    "name": "Media in Pub Aff",
    "fullname": "Role of the Media in Public Affairs",
    "info": "Historical/contemporary role of news media in defining/shaping public opinion/policy, primarily in the United States. Emphasizes critical research, professional skills in three forms of journalism: hard news coverage, investigative reporting, documentaries. Field experience, practice in governmental public relations.",
    "prereq": []
  },
  {
    "uid": "819473",
    "code": "PA5932",
    "subject": "PA",
    "number": "5932",
    "honors": false,
    "writingIntensive": false,
    "name": "Working with Data",
    "fullname": "Working with Data: Finding, Managing, and Using Data",
    "info": "Hands-on experience with common issues that arise when using secondary data sets. After successful completion of the course, students should be able to: 1. Determine where to find data and information about data (metadata) for policy-related topics. 2. Repurpose, manipulate, and/or clean data collected by someone else or for a different purpose in order to answer questions.3. Determine appropriate units of analysis, weights, data structure, and variables of interest in order to answer policy-related questions.4. Document workflow to allow reproducibility and protect the confidentiality of the data.5. Conduct basic data manipulation tasks (making tables) using existing software including Excel and Stata.6. Learn how to find answers for questions through online support.  This course will focus on Excel and Stata equally.  Previous experience in Stata is preferred, but the course will include a brief introduction to relevant skills. ",
    "prereq": []
  },
  {
    "uid": "819470",
    "code": "PA5933",
    "subject": "PA",
    "number": "5933",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey Methods: Questionnaires",
    "fullname": "Survey Methods:  Designing Effective Questionnaires",
    "info": "Applied (hands-on) introduction to survey questionnaire design. Student teams design a questionnaire for a client. For example, students may draft and revise questions about respondents' demographics and employment; life histories; knowledge, use, and opinions about services; and/or anxiety and well-being. The syllabus evolves depending on the needs of the client and the class' decisions about how to build the survey; a complete syllabus will not be available at the beginning of class for this reason. Readings include a textbook and articles related to the client's survey. Students actively engage in class and in groups about draft questions, thus learning how to improve them, with regular feedback from the instructor. Questions are tested on volunteers. Students learn: the process of questionnaire design in a team; pitfalls of survey design; and how to track questions, coded responses, and prompts for interviewers. This class is not a substitute for a comprehensive survey research class or a statistical course on sampling and weighting.Students will learn:- The process of questionnaire design in a team- Basic pitfalls of survey design – names, definitions, examples. - How to use Excel to track questions, coded responses, and prompts for interviewers- How to use interviewing software SurveyToGoThis class is not a substitute for a comprehensive survey research class or a statistical course on sampling and weighting.",
    "prereq": []
  },
  {
    "uid": "819787",
    "code": "PA5934",
    "subject": "PA",
    "number": "5934",
    "honors": false,
    "writingIntensive": false,
    "name": "Humphrey Public Affairs Review",
    "fullname": "HPAR - Humphrey Public Affairs Review Board Seminar",
    "info": "This course provides a seminar context for the work of members of the editorial board for the Humphrey Public Affairs Review (HPAR). It meets seven times over the course of Fall semester to provide logistical and technical guidance for the Board as it produces the online journal. Students engage in the various activities required to publish the journal. In the beginning of the semester, students conduct outreach to solicit submissions and discuss the selection criteria for submissions. They work closely with the conventions of APA style and citations, while developing their copyediting abilities. Central to journal production is engaging with the peer-review process, through providing feedback to authors and discussing critiques with editing teams. Finally, students submit their own pieces of writing to the journal for publication. As a result, students participate in peer-review as both an editor and an author.",
    "prereq": []
  },
  {
    "uid": "007219",
    "code": "PA5941",
    "subject": "PA",
    "number": "5941",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership for the Common Good",
    "fullname": "Leadership for the Common Good",
    "info": "Personal, team, organizational, visionary, political, ethical aspects of leadership. Building/experiencing learning community.prereq: Major in development practice or public affairs or public affairs leadership certificate or minor in integrative leadership or instr consent",
    "prereq": []
  },
  {
    "uid": "015912",
    "code": "PA5951",
    "subject": "PA",
    "number": "5951",
    "honors": false,
    "writingIntensive": false,
    "name": "Humphrey Intl Fellows Seminar",
    "fullname": "Humphrey International Fellows Seminar",
    "info": "This seminar introduces Humphrey International Fellows to the public policy landscape of Minnesota and the US, and provides opportunities for professional growth. Through a series of discussions, trainings, and site visits, fellows will be exposed to professional development, skills building, and networking opportunities. The seminar provides a forum for fellows to exchange views with one another and with guest speakers. ",
    "prereq": []
  },
  {
    "uid": "798094",
    "code": "PA5952",
    "subject": "PA",
    "number": "5952",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Commons Seminar II",
    "fullname": "Global Commons Seminar II",
    "info": "Research/presentations related to professional development projects. Each week selected students assign readings, deliver a presentation on their professional development project, and distribute a summary of the talk. Presentations are developed in collaboration with at least one faculty specialist in the subject area.",
    "prereq": []
  },
  {
    "uid": "015769",
    "code": "PA5961",
    "subject": "PA",
    "number": "5961",
    "honors": false,
    "writingIntensive": false,
    "name": "Ldership, You, & World Sem",
    "fullname": "Seminar: Leadership, You, and the World",
    "info": "Leadership theory, community building and social change, and systems thinking. Students conduct/present research on leadership models through literature review, interships, and study groups. Study groups produce major paper describing research project. Participants assemble portfolio demonstrating their leadership learning as University student.",
    "prereq": []
  },
  {
    "uid": "816788",
    "code": "PA5962",
    "subject": "PA",
    "number": "5962",
    "honors": false,
    "writingIntensive": false,
    "name": "State Governing/Legislating",
    "fullname": "State Governing and Legislating: Working the Process",
    "info": "The Minnesota Capitol and rules and reality of state governance and legislating. Classroom discussions, high-profile guest speakers (including legislators, lobbyists, and potentially the governor), and an extensive State Capitol practicum to explore state politics and policies. ",
    "prereq": []
  },
  {
    "uid": "826403",
    "code": "PA5963",
    "subject": "PA",
    "number": "5963",
    "honors": false,
    "writingIntensive": false,
    "name": "Tribal-State Relations Wkshop",
    "fullname": "Tribal-State Relations Workshop",
    "info": "The State of Minnesota occupies and shares geography with many sovereign Indian nations. Tribal jurisdiction impacts thousands of acres of land in Minnesota both within and beyond reservation boundaries, and tribes are among the top 20 employers in the state. While tribes share prominent nation-to-nation diplomatic relationships with the U.S. federal government, tribal relationships with state agencies are increasingly significant. Since the administration of Governor Jesse Ventura, each Minnesota governor has implemented an executive order focused on state relations with Indian nations. In 2021, the body of policy associated with those executive orders was passed into law and codified in a state statute providing a considerable mandate for state agencies to develop and implement tribal consultation policies and to build associated partnerships.This class introduces participants to the legal and policy contexts in which contemporary tribal-state relations occur. We will explore the shifting history of federal Indian policy, the often-contentious past of tribal-state interactions, current emphases on building government-to-government relationships, and potential future trends. Participants will engage with elected tribal leaders and with the Tribal-State Relations Training program delivered to state employees through a partnership between the Minnesota Indian Affairs Council, MnDOT, and the University of Minnesota Duluth Tribal Sovereignty Institute. Students will consider how their own civic and professional trajectories may connect to Indian nations, and collaboratively draw conceptual and practical links between tribal affairs and other areas of study.",
    "prereq": []
  },
  {
    "uid": "814453",
    "code": "PA5971",
    "subject": "PA",
    "number": "5971",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey of Election Admin",
    "fullname": "Survey of Election Administration",
    "info": "Survey of building blocks of election administration, from voter registration to recounts.",
    "prereq": []
  },
  {
    "uid": "814454",
    "code": "PA5972",
    "subject": "PA",
    "number": "5972",
    "honors": false,
    "writingIntensive": false,
    "name": "Elections and the Law",
    "fullname": "Elections and the Law",
    "info": "Theories and basic structure of the American legal system. Experience with basic tools and skills for using the law to understand and analyze issues facing election administrators across the nation. Use of election-related and non-election related materials to prepare election administrators for interacting with counsel, legislators and the courts in carrying out their responsibilities.",
    "prereq": []
  },
  {
    "uid": "814455",
    "code": "PA5973",
    "subject": "PA",
    "number": "5973",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Mgmt of Elec Admin",
    "fullname": "Strategic Management of Election Administration",
    "info": "Strategic management for election administrators in the political environment. Election official tools and challenges. The role of the lawmaking process in budgeting and organizational planning.",
    "prereq": []
  },
  {
    "uid": "814456",
    "code": "PA5974",
    "subject": "PA",
    "number": "5974",
    "honors": false,
    "writingIntensive": false,
    "name": "Election Admin Capstone",
    "fullname": "Election Administration Capstone Project",
    "info": "Application of interdisciplinary methods, approaches, and perspectives from core courses. Written report of an election administration issue or problem in jurisdiction of student's choice. Research best practices and possible solutions. Final paper or presentation with findings.",
    "prereq": []
  },
  {
    "uid": "814457",
    "code": "PA5975",
    "subject": "PA",
    "number": "5975",
    "honors": false,
    "writingIntensive": false,
    "name": "Election Design",
    "fullname": "Election Design",
    "info": "Election administration design principles, including ballot and polling place design and poll worker training materials. Application of principles of field.",
    "prereq": []
  },
  {
    "uid": "814458",
    "code": "PA5976",
    "subject": "PA",
    "number": "5976",
    "honors": false,
    "writingIntensive": false,
    "name": "Voter Participation",
    "fullname": "Voter Participation",
    "info": "Voter participation issues and challenges including historical survey of voter participation in US and methods to increase voter turnout.",
    "prereq": []
  },
  {
    "uid": "814459",
    "code": "PA5977",
    "subject": "PA",
    "number": "5977",
    "honors": false,
    "writingIntensive": false,
    "name": "Pub Budgeting for Elec Admin",
    "fullname": "Public Budgeting for Election Administration",
    "info": "Budget processes in legislative/executive branches of federal, state, and local government and techniques of budget and program analysis. Application to election administration programs.",
    "prereq": []
  },
  {
    "uid": "814460",
    "code": "PA5978",
    "subject": "PA",
    "number": "5978",
    "honors": false,
    "writingIntensive": false,
    "name": "Org Mgmt for Elec Admin",
    "fullname": "Management of Organizations for Election Admin",
    "info": "Organization management in a public/government office. Management issues in public organizations in mixed economy/democratic republic. Challenges. Constraints.",
    "prereq": []
  },
  {
    "uid": "814461",
    "code": "PA5979",
    "subject": "PA",
    "number": "5979",
    "honors": false,
    "writingIntensive": false,
    "name": "Communications for Elec Admin",
    "fullname": "Communications for the Elections Administrator",
    "info": "Public communications and media relations in election administration. Role of media in elections. Communication strategies. Interview techniques.",
    "prereq": []
  },
  {
    "uid": "809906",
    "code": "PA5980",
    "subject": "PA",
    "number": "5980",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Amer Election Admin",
    "fullname": "Topics in American Election Administration",
    "info": "Selected topics in American election administration.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "808508",
    "code": "PA5981",
    "subject": "PA",
    "number": "5981",
    "honors": false,
    "writingIntensive": false,
    "name": "American Institutions",
    "fullname": "American Institutions in Historical Perspective",
    "info": "History of churches, fraternal organizations, charities, and institutions more directly related to government.prereq: Grad student or instr consent; basic US history course recommended",
    "prereq": []
  },
  {
    "uid": "816789",
    "code": "PA5982",
    "subject": "PA",
    "number": "5982",
    "honors": false,
    "writingIntensive": false,
    "name": "Data Analysis for Elec Admin",
    "fullname": "Data Analysis for Election Administration",
    "info": "Evidence-based election administration. Collection and analysis of quantitative data to solve problems and identify opportunities for improvement. Emphasis on pre-election forecasting for planning purposes and post-election auditing of election results.",
    "prereq": []
  },
  {
    "uid": "818136",
    "code": "PA5983",
    "subject": "PA",
    "number": "5983",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Election Security",
    "fullname": "Introduction to Election Security",
    "info": "This course will examine the history of cyberattacks on the United States and the American election system, with special attention to the 2016 election cycle. Students will explore the types of cybersecurity threats that exist and strategies to protect against them; understand the roles different levels of government can play in the process, and hear from key officials about the issues raised by the official response to election security threats at the federal, state and local levels as well as in related private sector communities.",
    "prereq": []
  },
  {
    "uid": "819633",
    "code": "PA5984",
    "subject": "PA",
    "number": "5984",
    "honors": false,
    "writingIntensive": false,
    "name": "Elections Security",
    "fullname": "Elections Security: How to Protect America’s Elections",
    "info": "“Elections Security” uses the Russian efforts to influence the 2016 election as a case study to identify the vulnerabilities of US elections (especially state voter registration databases) as well as catalogue new protections. Readings and discussion will focus on best practices and technology options available to the public (social media) and elections professionals (cybersecurity) in guarding against future influence efforts and assuring public confidence in election outcomes. Special focus will be given to describing how local election officials can protect their election technology, most notably those vulnerabilities associated with their voting system and voter registration database. “Elections Security” will draw heavily on concrete cases and challenges facing election professionals, using government and independent reports and an indepth analysis of new resources created by the US Department of Homeland Security and its collaborations with election professionals.",
    "prereq": []
  },
  {
    "uid": "820401",
    "code": "PA5985",
    "subject": "PA",
    "number": "5985",
    "honors": false,
    "writingIntensive": false,
    "name": "Physical Election Security",
    "fullname": "Physical Election Security",
    "info": "U.S. Homeland Security designated election security as a “critical infrastructure” after threats from foreign governments, and collaborates with states in detecting and responding to foreign interference. This course will provide students with a deeper understanding of the current security context and best practices and processes for physically safeguarding elections based on 2016 and 2020. Students will learn the difference between physical and cyber threats to U.S. systems; tangible steps to protect election offices and their equipment; the use of audits to ensure the accuracy of elections; the integration of security into vendor relationships; and the connection between physical election security and citizen trust in elections. Content will be explored through readings (including government documents and studies), videos, discussions, and writing assignments.",
    "prereq": []
  },
  {
    "uid": "016436",
    "code": "PA5990",
    "subject": "PA",
    "number": "5990",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Pub Affairs - General",
    "fullname": "Topics: Public Affairs - General Topics",
    "info": "General topics in public policy.",
    "prereq": []
  },
  {
    "uid": "814380",
    "code": "PA5993",
    "subject": "PA",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study in Pub Affairs",
    "fullname": "Directed Study in Public Affairs",
    "info": "Self-directed study, with faculty advice.",
    "prereq": []
  },
  {
    "uid": "015719",
    "code": "PA8001",
    "subject": "PA",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Transforming Public Policy",
    "fullname": "Transforming Public Policy",
    "info": "Development of interdisciplinary understanding of one or more policy areas through explorations of theory, readings, cases, and model-building exercises. Articulating policy/system improvements and leadership implications for formulating/implementing them.prereq: 5941 or instr consent",
    "prereq": {
      "code": "PA 5941",
      "subject": "PA",
      "id": "5941"
    }
  },
  {
    "uid": "015720",
    "code": "PA8002",
    "subject": "PA",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Synthesis Workshop",
    "fullname": "Synthesis Workshop",
    "info": "Development of public policy to advance public interest, common good. Recommendations flow from interdisciplinary understanding of problem, stakeholder analyses, modeling/analysis. Political feasibility, marketing, entrepreneurship, advocacy.",
    "prereq": []
  },
  {
    "uid": "811879",
    "code": "PA8003",
    "subject": "PA",
    "number": "8003",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD seminar in Pub Aff I",
    "fullname": "Integrative Doctoral Seminar in Public Affairs I",
    "info": "Lays foundation for doctoral-level study of public affairs through introduction of key concepts, literature, research questions of public affairs. Critically examines paradigms/methodologies through readings, discussions, writing assignments, research presentations. Facilitates development of dissertation research ideas.prereq: Public Affairs doctoral student",
    "prereq": []
  },
  {
    "uid": "811880",
    "code": "PA8004",
    "subject": "PA",
    "number": "8004",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD seminar in Pub Aff II",
    "fullname": "Integrative Doctoral Seminar in Public Affairs II",
    "info": "Continues PA 8003. Lays foundation for doctoral-level study of public affairs through introduction of key concepts, literature, research questions of public affairs. Critically examines paradigms/methodologies through readings, discussions, writing assignments, research presentations. Facilitates development of dissertation research ideas.prereq: Public Affairs doctoral student",
    "prereq": []
  },
  {
    "uid": "812708",
    "code": "PA8005",
    "subject": "PA",
    "number": "8005",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD Research Sem in Pub Aff",
    "fullname": "Doctoral Research Seminar in Public Affairs",
    "info": "Conduct of research, including ethics. Students develop and refine their research ideas. Facilitates development of dissertation research prospectus.prereq: Public Affairs doctoral student",
    "prereq": []
  },
  {
    "uid": "817369",
    "code": "PA8006",
    "subject": "PA",
    "number": "8006",
    "honors": false,
    "writingIntensive": false,
    "name": "Current Research in Pub Aff",
    "fullname": "Current Research in Public Affairs: Topics, Approaches, and Cultures",
    "info": "Students participate in research seminars exploring current topics, approaches, and cultures in public affairs. Students responsible for discussion, presentation, and evaluation of research, including peer review of papers and presentations. Discussion of research ethics and skills, including literature reviews, research design, data visualization, public engagement, presentation, and project management.",
    "prereq": []
  },
  {
    "uid": "789909",
    "code": "PA8081",
    "subject": "PA",
    "number": "8081",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Workshop",
    "fullname": "Capstone Workshop",
    "info": "Project for external client on issue agreed upon by student, client, and instructor. Students apply interdisciplinary methods, approaches, and perspectives from core courses. Written report with analysis and policy recommendations. Oral presentation. Topics vary by term.\n\nprereq: completion of core courses or instr consent",
    "prereq": []
  },
  {
    "uid": "789910",
    "code": "PA8082",
    "subject": "PA",
    "number": "8082",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Paper-Writing Sem",
    "fullname": "Professional Paper-Writing Seminar",
    "info": "Facilitates completion of research paper on current issues in public policy, management, and science, technology and environment. Students apply interdisciplinary methods, approaches, and perspectives studied in core courses. Written report includes analysis of issue, policy recommendations. All topics accepted. Plan A students welcome. prereq: completion of core courses, or instr consent",
    "prereq": []
  },
  {
    "uid": "010878",
    "code": "PA8105",
    "subject": "PA",
    "number": "8105",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Resources",
    "fullname": "Human Resources and Organizational Performance",
    "info": "Impact of human resource policies and practices on organizational productivity and effectiveness. Role of government, unions, and private sector institutions on organizational effectiveness.",
    "prereq": []
  },
  {
    "uid": "815667",
    "code": "PA8106",
    "subject": "PA",
    "number": "8106",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Sem in Mgmt, Leadshp, Gov",
    "fullname": "Research Seminar in Management, Leadership & Governance",
    "info": "This seminar provides an introduction to the research and theory of management, leadership, and governance within the public, nonprofit organizations, and cross-sector networks involved in public affairs. The course is team-taught by faculty in the Humphrey Schools Leadership & Management area, and focuses on the following research literature: democracy and governance (public participation, civic engagement, and public values); organizational theory and behavior; leadership and management practices (strategic management, financial management, and human resource management); policy and program design and implementation; and cross-boundary collaboration. prereq: inst consent",
    "prereq": []
  },
  {
    "uid": "817281",
    "code": "PA8151",
    "subject": "PA",
    "number": "8151",
    "honors": false,
    "writingIntensive": false,
    "name": "Org Perspectives on Global Dev",
    "fullname": "Organizational Perspectives on Global Development & Humanitarian Assistance",
    "info": "Organizational analysis of international development and humanitarian assistance, including perspectives from sociology, political science, psychology, public administration, and management. Examines efforts of multiple organizational players, including NGOs, governments, bi-lateral and multi-lateral organizations, corporations, foundations, and international organizations. Critical analysis of aid organizations, especially regarding ways in which they reflect and create power and privilege, the manner in which individuals' needs and desires interact with, support, or challenge the needs of the organization, and how all of this is influenced by forces outside the boundary of the organization. Students increase analytical capabilities in understanding international aid organizations in the context of multiple (and often contested) perspectives on global development and stakeholder demands. Class time involves class discussions, mini-lectures, simulations, and case analyses. Main graded work is a research prospectus or longer research paper.",
    "prereq": []
  },
  {
    "uid": "009330",
    "code": "PA8181",
    "subject": "PA",
    "number": "8181",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshp Public Mgmt",
    "fullname": "Capstone Workshop in Public and Nonprofit Leadership and Management",
    "info": "Project is completed for external client on issue agreed upon by student, client, and instructor. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "009328",
    "code": "PA8182",
    "subject": "PA",
    "number": "8182",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar Public Mgmt",
    "fullname": "Capstone Seminar in Public and Nonprofit Leadership and Management",
    "info": "Facilitates completion of research paper on current issue in public affairs. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "007769",
    "code": "PA8183",
    "subject": "PA",
    "number": "8183",
    "honors": false,
    "writingIntensive": false,
    "name": "Collaborations Mgmt",
    "fullname": "Managing Collaborations",
    "info": "Management challenges of operating within multiparty (combination of nonprofit, for-profit, and public enterprises) collaborations formed to deal with a social problem. Combines in-class discussions of conceptual materials with application in community. Student teams work for half a semester with local collaborations on management problems.",
    "prereq": []
  },
  {
    "uid": "014382",
    "code": "PA8186",
    "subject": "PA",
    "number": "8186",
    "honors": false,
    "writingIntensive": false,
    "name": "Pub Svcs Redesign",
    "fullname": "Public Services Redesign",
    "info": "Theory, strategy, politics, and practical mechanics required to adapt public service systems given constraints on resources and continuing pressure for effectiveness/equity. In-class interviews with persons involved in redesign. Student presentations on current redesign issues.",
    "prereq": []
  },
  {
    "uid": "014352",
    "code": "PA8187",
    "subject": "PA",
    "number": "8187",
    "honors": false,
    "writingIntensive": false,
    "name": "Pub Aff Leadership",
    "fullname": "Leadership for Public Policy and Planning",
    "info": "Introduction to major theoretical perspectives on leadership in public affairs. Role of leadership in policy change, governance, planning, and management. Personal, team, organizational, visionary, political, and ethical aspects of leadership. Students develop their own theory of leadership-in-action. Cases employed.",
    "prereq": []
  },
  {
    "uid": "014705",
    "code": "PA8190",
    "subject": "PA",
    "number": "8190",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Ldrship & Mgmt Topics",
    "fullname": "Advanced Topics in Public and Nonprofit Leadership and Management",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "015640",
    "code": "PA8201",
    "subject": "PA",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Env & Infrastructure Planning",
    "fullname": "Environment and Infrastructure Planning",
    "info": "Relationship between infrastructure, human settlement design. Natural resource systems as foundation of infrastructure provision. Environmental basis of, and political/legal/institutional frameworks for, land-use planning. Parallel computer lab, practicum assignment.prereq: Major/minor in urban and regional planning or PA PhD or instr consent",
    "prereq": []
  },
  {
    "uid": "015644",
    "code": "PA8202",
    "subject": "PA",
    "number": "8202",
    "honors": false,
    "writingIntensive": false,
    "name": "Transportation/Land Use/Design",
    "fullname": "Networks and Places: Transportation, Land Use, and Design",
    "info": "Relationship between land use and transportation. Developing synthetic design skills for linking land use transportation in urban/regional settlements. Economic, political, legal, institutional frameworks for planning. Parallel practicum assignment.prereq: Major/minor in urban and regional planning or PA PhD or instr consent",
    "prereq": []
  },
  {
    "uid": "015652",
    "code": "PA8203",
    "subject": "PA",
    "number": "8203",
    "honors": false,
    "writingIntensive": false,
    "name": "Neighborhood Revitalization",
    "fullname": "Neighborhood Revitalization Strategies and Theories",
    "info": "Policymaking/politics of planning in housing, community development, social policy. Connecting policy to local/regional politics. Role of institutional decision-making structures on policy outcomes. Importance of citizens, social movements, interest groups in policymaking process.prereq: Major/minor in urban and regional planning or PA PhD or instr consent",
    "prereq": []
  },
  {
    "uid": "789868",
    "code": "PA8204",
    "subject": "PA",
    "number": "8204",
    "honors": false,
    "writingIntensive": false,
    "name": "Creating Good Work",
    "fullname": "Creating Good Work: Economic and Workforce Development",
    "info": "Job-oriented economic development. Theories on how/why jobs are created. Tools used by communities and economic developers (e.g., tax abatement, infrastructure, job training, entrepreneurship). Strategy, politics, effectiveness.",
    "prereq": []
  },
  {
    "uid": "812968",
    "code": "PA8206",
    "subject": "PA",
    "number": "8206",
    "honors": false,
    "writingIntensive": false,
    "name": "Planning Theory",
    "fullname": "Planning Theory",
    "info": "An overview of the major theories that have shaped the field of urban and regional planning, including the analysis of theories related to the process and substance of urban planning.prereq: Public Affairs Ph.D. student, urban planning subplan",
    "prereq": []
  },
  {
    "uid": "813458",
    "code": "PA8210",
    "subject": "PA",
    "number": "8210",
    "honors": false,
    "writingIntensive": false,
    "name": "Planning Theory",
    "fullname": "Planning Theory: From Knowledge To Action",
    "info": "What is an urban planner? What is the domain of today's professional urban planning expert? Explores form and character of professional education required to help doctoral scholars train future urban planners in an occupation experiencing expanding base of knowledge and a growing range of sociopolitical practice roles.prereq: Public Affairs PhD",
    "prereq": []
  },
  {
    "uid": "790804",
    "code": "PA8212",
    "subject": "PA",
    "number": "8212",
    "honors": false,
    "writingIntensive": false,
    "name": "Transportation/Land Use/Design",
    "fullname": "Networks and Places: Transportation, Land Use, and Design",
    "info": "Relationship between land use and transportation. Developing synthetic design skills for linking land use transportation in urban/regional settlements. Economic, political, legal, institutional frameworks for planning.",
    "prereq": []
  },
  {
    "uid": "009333",
    "code": "PA8281",
    "subject": "PA",
    "number": "8281",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshp on Planning",
    "fullname": "Capstone Workshop in Planning",
    "info": "Project is completed for external client on issue agreed upon by student, client, and instructor. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "009331",
    "code": "PA8282",
    "subject": "PA",
    "number": "8282",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar on Planning",
    "fullname": "Capstone Seminar in Planning",
    "info": "Facilitates completion of research paper on current issue in public affairs. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "007787",
    "code": "PA8286",
    "subject": "PA",
    "number": "8286",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev & Urban Planning",
    "fullname": "International Development and Urban Planning",
    "info": "Urbanization process and planning responses in cities of developing world. Urban sustainability, migration, housing, transportation, employment, and urban service delivery. Phenomena such as squatter settlements and informal economy that normally proceed unplanned and without formal government control.",
    "prereq": []
  },
  {
    "uid": "014709",
    "code": "PA8290",
    "subject": "PA",
    "number": "8290",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Topics in Planning",
    "fullname": "Advanced Topics in Planning",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "799127",
    "code": "PA8302",
    "subject": "PA",
    "number": "8302",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Policy Analysis",
    "fullname": "Applied Policy Analysis",
    "info": "Design/evaluation of public policies. Emphasizes market/non-market contexts. Microeconomics and welfare economics of policy analysis. Econometric tools for measurement of policy outcomes. Applications to policy problems.prereq: Intermediate microeconomics, introduction to econometrics",
    "prereq": []
  },
  {
    "uid": "013941",
    "code": "PA8311",
    "subject": "PA",
    "number": "8311",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol Analysis Cases",
    "fullname": "Case Studies in Policy Analysis",
    "info": "Topics in microeconomics applied to systems problems of government. Market and nonmarket resource allocation; cost-effectiveness and cost-benefit analysis. Case method employed.",
    "prereq": []
  },
  {
    "uid": "010539",
    "code": "PA8312",
    "subject": "PA",
    "number": "8312",
    "honors": false,
    "writingIntensive": false,
    "name": "Analysis of Discrimination",
    "fullname": "Analysis of Discrimination",
    "info": "Policy analysis/other applied social sciences as tools for measuring/detecting discrimination in market/nonmarket contexts. Application of modern tools of labor econometrics/race relations research to specific problems of market/nonmarket discrimination.",
    "prereq": []
  },
  {
    "uid": "816300",
    "code": "PA8331",
    "subject": "PA",
    "number": "8331",
    "honors": false,
    "writingIntensive": false,
    "name": "Economic Demography",
    "fullname": "Economic Demography",
    "info": "Classical theory, advanced econometric methods, recent empirical work, and available datasets for research in economic demography. Topics include the economics of mortality, fertility, migration, marriage, women's labor supply, intra-family bargaining, and age structure. Students develop critical analysis and academic discourse skills through in-depth discussions and replications of papers, presentations, referee-style writing assignments, and a term paper.prereq: Grad-level economic theory (PA 5021 or equiv) and econometrics (PA 5033 or equiv) and instructor permission",
    "prereq": {
      "and": [
        {
          "code": "PA 5021",
          "subject": "PA",
          "id": "5021"
        },
        {
          "code": "PA 5033",
          "subject": "PA",
          "id": "5033"
        }
      ]
    }
  },
  {
    "uid": "788255",
    "code": "PA8333",
    "subject": "PA",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "009334",
    "code": "PA8381",
    "subject": "PA",
    "number": "8381",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshp Policy Analys",
    "fullname": "Capstone Workshop in Advanced Policy Analysis Methods",
    "info": "Project is completed for external client on issue agreed upon by student, client, and instructor. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "009335",
    "code": "PA8382",
    "subject": "PA",
    "number": "8382",
    "honors": false,
    "writingIntensive": false,
    "name": "Semnr Policy Analys",
    "fullname": "Capstone Seminar in Advanced Policy Analysis Methods",
    "info": "Facilitates completion of research paper on current issue in public affairs. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "010869",
    "code": "PA8386",
    "subject": "PA",
    "number": "8386",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Methods in Public Pol",
    "fullname": "Research Methods in Public Policy",
    "info": "Social science research methods to analyze and develop public policies. Nature of the research process in analyzing public policies. Qualities of policy analysis and other types of research. Major data sources available to examine public policy issues in the U.S. and abroad. Statistical approaches to examining public policies. prereq: A semester statistics class focusing on advanced applied topics in regression analysis (e.g. PA 5033, Multivariate Techniques).",
    "prereq": {
      "code": "PA 5033",
      "subject": "PA",
      "id": "5033"
    }
  },
  {
    "uid": "014712",
    "code": "PA8390",
    "subject": "PA",
    "number": "8390",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv: Advanced Policy Analysis",
    "fullname": "Advanced Topics in Advanced Policy Analysis Methods",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "812111",
    "code": "PA8444",
    "subject": "PA",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "FTE: Doctoralprereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "816321",
    "code": "PA8461",
    "subject": "PA",
    "number": "8461",
    "honors": false,
    "writingIntensive": false,
    "name": "Health and Mortality",
    "fullname": "Global and U.S. Perspectives on Health and Mortality",
    "info": "The health of populations in developing and developed countries is very different. Within countries, great health disparities exist between more advantaged and more disadvantaged populations. When crafting policies that aim to improve population health, it is crucial to know how to measure health and how to think about the health needs of the specific population in question. This course will provide an overview to the factors driving health, mortality, and aging across different populations. In addition, students will learn the best sources of data and measures to use to describe the health status of a population. They will also be able to assess policy options that address the health of their population.",
    "prereq": []
  },
  {
    "uid": "009336",
    "code": "PA8481",
    "subject": "PA",
    "number": "8481",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshp Soc Policy",
    "fullname": "Capstone Workshop in Social Policy",
    "info": "Project is completed for external client on issue agreed upon by student, client, and instructor. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "009337",
    "code": "PA8482",
    "subject": "PA",
    "number": "8482",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar Soc Policy",
    "fullname": "Capstone Seminar in Social Policy",
    "info": "Facilitates completion of research paper on current issue in public affairs. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "007741",
    "code": "PA8486",
    "subject": "PA",
    "number": "8486",
    "honors": false,
    "writingIntensive": false,
    "name": "Work & Family",
    "fullname": "Work and Family in the United States and the Third World",
    "info": "Topics based on students' interests. Topics must relate to formal and informal labor force work, household work, child care, child labor, youth employment, education, training, or their interrelationships. Data collection and measurement issues; economic and demographic theories of work and education decisions in context of the family. ",
    "prereq": []
  },
  {
    "uid": "014714",
    "code": "PA8490",
    "subject": "PA",
    "number": "8490",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Topics: Social Policy",
    "fullname": "Advanced Topics in Social Policy",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "009338",
    "code": "PA8581",
    "subject": "PA",
    "number": "8581",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshp Development",
    "fullname": "Capstone Workshop in Economic and Community Development",
    "info": "Project is completed for external client on issue agreed upon by student, client, and instructor. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "009339",
    "code": "PA8582",
    "subject": "PA",
    "number": "8582",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar Development",
    "fullname": "Capstone Seminar in Economic and Community Development",
    "info": "Facilitates completion of research paper on current issue in public affairs. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "007759",
    "code": "PA8583",
    "subject": "PA",
    "number": "8583",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Wkshop: Econ/Comm Dev",
    "fullname": "Capstone Workshop on Economic and Community Development",
    "info": "Comprehensive overview of state, local, community-based economic development strategies. Processes involved in producing broadly conceived economic development strategy. Institutional structures/processes to deal with economic change, new political realities.",
    "prereq": []
  },
  {
    "uid": "014717",
    "code": "PA8590",
    "subject": "PA",
    "number": "8590",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Topics: Econ/Comm Dev",
    "fullname": "Advanced Topics in Economic and Community Development",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "825660",
    "code": "PA8601",
    "subject": "PA",
    "number": "8601",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Gender & Public Policy",
    "fullname": "Global Survey of Gender and Public Policy",
    "info": "Graduate level introduction to the key theoretical concepts and tools necessary for gender policy analysis. Survey of the major findings in the field of gender and public policy in policy areas such as poverty alleviation, health, international security, environment and work-family reconciliation. Scope includes local, national, and global policy arenas as well as exploration of gender and the politics of policy formulation.",
    "prereq": []
  },
  {
    "uid": "826449",
    "code": "PA8662",
    "subject": "PA",
    "number": "8662",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender&Soc Pol:Europe/Americas",
    "fullname": "Gender & Social Policy in Europe & the Americas",
    "info": "The variety of approaches to social welfare policies around the globe – from pensions to poverty relief to parental leave – offer many lessons not only for how to address basic needs, but also for building more gender- and race- equitable societies. This course provides conceptual and historical grounding for understanding the origins and impacts of social welfare policies, and how these policies serve as crucial arbiters of gender, race and class relations. The course compares historical and contemporary social policy regimes and their impacts on individuals and societies in Europe and the Americas. The course centers on four questions: 1) How are social policies “gendered”, “raced” and “classed”?  The course readings and discussions consider multiple feminist perspectives and approaches which show how social policies are based on specific assumptions about gender and its intersections with race, class, and immigrant status, and in turn create or reinforce a particular social order. 2) Why do social policies in different countries look so different? The course traces the historical development of specific social welfare regimes with attention to interactions between states, political parties, unions, firms, and social movements. Understanding the historical political determinants of current policies can provide clues to appropriate strategies for change. 3) What lessons can we glean from other countries to promote equity across gender and other forms of inequality? The course dives into research that measures the impact of specific social policies on equity and considers the appropriateness and transferability of policy ideas across borders. 4) What are the contemporary challenges to social welfare systems and their ability to promote gender equity? The course considers a variety of such challenges such as stagnating birth rates that threaten the economic solvency of social policy systems; the pressures of refugees and mass migration; and how the global COVID-19 pandemic both revealed and exacerbated underlying deficiencies in social policy systems.",
    "prereq": []
  },
  {
    "uid": "814381",
    "code": "PA8666",
    "subject": "PA",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Credits",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral Pre-Thesis Creditsprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr.",
    "prereq": []
  },
  {
    "uid": "009344",
    "code": "PA8681",
    "subject": "PA",
    "number": "8681",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshp Women Policy",
    "fullname": "Capstone Workshop in Women and Public Policy",
    "info": "Project is completed for external client on issue agreed upon by student, client, and instructor. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "009345",
    "code": "PA8682",
    "subject": "PA",
    "number": "8682",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminr Women Policy",
    "fullname": "Capstone Seminar in Women and Public Policy",
    "info": "Facilitates completion of research paper on current issue in public affairs. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "819040",
    "code": "PA8683",
    "subject": "PA",
    "number": "8683",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender, Race & Political Rep",
    "fullname": "Gender, Race and Political Representation",
    "info": "Explores intersection of gender, race and political issues to identify best practices for strengthening roles of under-represented groups in governance.  Individual, structural and institutional factors attributed to increasing the election and appointment of under-represented groups.  Theories of citizen representation.  Global approach with cross-national evidence and comparative country studies. ",
    "prereq": []
  },
  {
    "uid": "007861",
    "code": "PA8686",
    "subject": "PA",
    "number": "8686",
    "honors": false,
    "writingIntensive": false,
    "name": "WPP Seminar",
    "fullname": "Feminist Organizations",
    "info": "Uses social movement literature and histories of U.S. second-wave feminism to study feminist organizations. Recurring issues and conflicts within organizations and movements examined through comparative studies of feminism in Latin America, Eastern Europe, Britain, and Italy. Methods and sources for studying feminism.  ",
    "prereq": []
  },
  {
    "uid": "794053",
    "code": "PA8687",
    "subject": "PA",
    "number": "8687",
    "honors": false,
    "writingIntensive": false,
    "name": "Women & Electoral Politics",
    "fullname": "Women and Electoral Politics",
    "info": "Political science and women's studies literature on American women and electoral politics.",
    "prereq": []
  },
  {
    "uid": "014718",
    "code": "PA8690",
    "subject": "PA",
    "number": "8690",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Top: Women/Gender/Pub Pol",
    "fullname": "Advanced Topics in Women, Gender and Public Policy",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "814981",
    "code": "PA8706",
    "subject": "PA",
    "number": "8706",
    "honors": false,
    "writingIntensive": false,
    "name": "Interdiscpl Resrch Sem on STEP",
    "fullname": "Interdisciplinary Research Seminar on Science, Technology, and Environmental Policy",
    "info": "Foundational understanding of conducting research on social and policy processes concerning science, technology, and the environment. Key concepts, literature, and new and emerging research directions will be explored with the objective of developing individual research programs. prereq: Public Affairs Ph.D. student with STEP subplan",
    "prereq": []
  },
  {
    "uid": "815054",
    "code": "PA8707",
    "subject": "PA",
    "number": "8707",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Sustainability Sys Res Sem",
    "fullname": "Interdisciplinary Sustainability Systems Research Seminar",
    "info": "Sustainability from systems perspective. Explores what environmental sustainability, health, and well being mean for people and the planet; how these attributes are measured and prioritized by different stakeholders, and how different social-ecological and infrastructural systems transition toward improved health and sustainability outcomes.",
    "prereq": []
  },
  {
    "uid": "015938",
    "code": "PA8777",
    "subject": "PA",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "009346",
    "code": "PA8781",
    "subject": "PA",
    "number": "8781",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshop: Science/Tech/Env Pol",
    "fullname": "Capstone Workshop in Science, Technology, and Environmental Policy",
    "info": "Project is completed for external client on issue agreed upon by student, client, and instructor. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "009347",
    "code": "PA8782",
    "subject": "PA",
    "number": "8782",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Science/Tech/Env Pol",
    "fullname": "Capstone Seminar in Science, Technology, and Environmental Policy",
    "info": "Facilitates completion of research paper on current issue in public affairs. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "014721",
    "code": "PA8790",
    "subject": "PA",
    "number": "8790",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Topics: Science/Tech/Env",
    "fullname": "Advanced Topics in Science, Technology, and Environmental Policy",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "013923",
    "code": "PA8811",
    "subject": "PA",
    "number": "8811",
    "honors": false,
    "writingIntensive": false,
    "name": "Strat Issues in Int'l Econ Pol",
    "fullname": "Strategic Issues in International Economic Policy",
    "info": "Compares/contrasts experiences of industrial/developing countries in trade, investment, exchange rates, and immigration.",
    "prereq": []
  },
  {
    "uid": "007203",
    "code": "PA8821",
    "subject": "PA",
    "number": "8821",
    "honors": false,
    "writingIntensive": false,
    "name": "Nat'l Security Pol",
    "fullname": "National Security Policy",
    "info": "Politics and economics of national security policy. Defense policy, military strategy, and weapons procurement. While emphasis is on the United States, other countries also discussed.",
    "prereq": []
  },
  {
    "uid": "009348",
    "code": "PA8881",
    "subject": "PA",
    "number": "8881",
    "honors": false,
    "writingIntensive": false,
    "name": "Wkshp Foreign Pol",
    "fullname": "Capstone Workshop in Foreign Policy and International Affairs",
    "info": "Project is completed for external client on issue agreed upon by student, client, and instructor. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "009349",
    "code": "PA8882",
    "subject": "PA",
    "number": "8882",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar Foreign Pol",
    "fullname": "Capstone Seminar in Foreign Policy and International Affairs",
    "info": "Facilitates completion of research paper on current issue in public affairs. Student applies interdisciplinary methods, approaches, and perspectives studied in core courses to the issue. Written report includes analysis of issue and policy recommendations. Oral presentation of major findings.",
    "prereq": []
  },
  {
    "uid": "812112",
    "code": "PA8888",
    "subject": "PA",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit: Doctoral",
    "fullname": "Thesis Credit: Doctoral",
    "info": "Doctoral thesis credit.prereq: [Max 18 cr per semester or summer], 24 cr required",
    "prereq": []
  },
  {
    "uid": "014722",
    "code": "PA8890",
    "subject": "PA",
    "number": "8890",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Topics: For Pol & Intl Aff",
    "fullname": "Advanced Topics in Foreign Policy and International Affairs",
    "info": "Selected topics.",
    "prereq": []
  },
  {
    "uid": "806655",
    "code": "PA8921",
    "subject": "PA",
    "number": "8921",
    "honors": false,
    "writingIntensive": false,
    "name": "Master's Prof Paper Individual",
    "fullname": "Master's: Professional Paper (Individual Option)",
    "info": "Students work under guidance of paper adviser and committee members to complete their Professional Paper (individual option).prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "806656",
    "code": "PA8922",
    "subject": "PA",
    "number": "8922",
    "honors": false,
    "writingIntensive": false,
    "name": "Master's Paper: Plan B",
    "fullname": "Master's Paper: Plan B",
    "info": "Masters of science in science, technology, and environmental policy majors work under guidance of paper adviser to complete their Plan B.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "814651",
    "code": "PA8931",
    "subject": "PA",
    "number": "8931",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD Pub Affairs Prof Skills I",
    "fullname": "PhD Public Affairs Professional Skills I",
    "info": "First of three professional skills workshops to prepare Public Affairs PhD students to be engaged scholars and public policy practitioners. Develop skills and tactics for leadership in public affairs scholarship.",
    "prereq": []
  },
  {
    "uid": "814918",
    "code": "PA8932",
    "subject": "PA",
    "number": "8932",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD Pub Affairs Prof Skills II",
    "fullname": "PhD Public Affairs Professional Skills II",
    "info": "Second of three professional skills workshops to prepare Public Affairs PhD students to be engaged scholars and public policy practitioners. Communicate complex policy problems and solutions with a wide variety of audiences.",
    "prereq": []
  },
  {
    "uid": "814919",
    "code": "PA8933",
    "subject": "PA",
    "number": "8933",
    "honors": false,
    "writingIntensive": false,
    "name": "PhD Pub Affairs Pro Skills III",
    "fullname": "PhD Public Affairs Professional Skills III",
    "info": "Third of three professional skills workshops to prepare Public Affairs PhD students to be engaged scholars and public policy practitioners. Utilize communication platforms to engage diverse audiences. Build a digital portfolio to share research and accelerate teaching impact.",
    "prereq": []
  },
  {
    "uid": "015582",
    "code": "PA8991",
    "subject": "PA",
    "number": "8991",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study.Limit of 6 credits applied toward a Humphrey School of Public Affairs degree or post-baccalaureate certificate program.",
    "prereq": []
  }
]