[
  {
    "uid": "002619",
    "code": "PE1004",
    "subject": "PE",
    "number": "1004",
    "honors": false,
    "writingIntensive": false,
    "name": "Diving",
    "fullname": "Diving: Springboard",
    "info": "Fundamentals of diving. Proper mechanics/techniques to ensure safety. Technical/numerical aspects. Lecture, participatory testing.prereq: 1007 or equiv or instr consent",
    "prereq": {
      "code": "PE 1007",
      "subject": "PE",
      "id": "1007"
    }
  },
  {
    "uid": "002623",
    "code": "PE1007",
    "subject": "PE",
    "number": "1007",
    "honors": false,
    "writingIntensive": false,
    "name": "Swimming For Beginners",
    "fullname": "Swimming For Beginners",
    "info": "Introduction to basic aquatic safety, fundamentals of swimming and hydrodynamics. Principles of hydrodynamics and stroke mechanics; five basic strokes; basic rescue techniques with use of pool equipment; hydrotherapy for disabilities and other conditions, opportunities for competitive activities, lifetime enjoyment of aquatics. ",
    "prereq": []
  },
  {
    "uid": "800840",
    "code": "PE1012",
    "subject": "PE",
    "number": "1012",
    "honors": false,
    "writingIntensive": false,
    "name": "Running for Beginners",
    "fullname": "Running for Beginners",
    "info": "This physically active class will expose students to the joys of running. Course topics and physical activities will explore technique, equipment, safety, etiquette, injury prevention, full-body conditioning, endurance, mobility, strength, and long-term training and goal setting.  This course is designed for novices who aspire to run 5K.",
    "prereq": []
  },
  {
    "uid": "002625",
    "code": "PE1014",
    "subject": "PE",
    "number": "1014",
    "honors": false,
    "writingIntensive": false,
    "name": "Conditioning",
    "fullname": "Conditioning",
    "info": "Fundamentals of personal fitness. Principles of fitness; health and motor skill components of fitness; principles of training/conditioning programs; nutrition; weight control; common fitness injuries; motivation and consistency in fitness programs; stress management.",
    "prereq": []
  },
  {
    "uid": "002627",
    "code": "PE1015",
    "subject": "PE",
    "number": "1015",
    "honors": false,
    "writingIntensive": false,
    "name": "Weight Training",
    "fullname": "Weight Training",
    "info": "Introduction to weight training. Basic aspects of weight training including exercise selection and technique, charting workouts, program design, nutritional considerations, and safety. ",
    "prereq": []
  },
  {
    "uid": "004287",
    "code": "PE1016",
    "subject": "PE",
    "number": "1016",
    "honors": false,
    "writingIntensive": false,
    "name": "Posture & Individual Exercise",
    "fullname": "Posture and Individual Exercise",
    "info": "Good posture techniques, individual exercises, fitness concepts, and mental techniques. Specific overall sound body and mind techniques to include flexibility exercises, cardiovascular fitness, resistance training, nutrition management, weight control, stress management, and self-thought.",
    "prereq": []
  },
  {
    "uid": "793791",
    "code": "PE1022",
    "subject": "PE",
    "number": "1022",
    "honors": false,
    "writingIntensive": false,
    "name": "Whitewater Kayaking",
    "fullname": "Whitewater Kayaking",
    "info": "Basic/intermediate whitewater kayaking skills. Equipment parts/use, group development, river hydrology, navigation, paddle strokes, self/assisted rescues, river maneuvers/etiquette, swift-water safety. Emphasizes progression of practical skills necessary for kayaking. Includes 4-day paddling/camping trip.",
    "prereq": []
  },
  {
    "uid": "002551",
    "code": "PE1029",
    "subject": "PE",
    "number": "1029",
    "honors": false,
    "writingIntensive": false,
    "name": "Handball",
    "fullname": "Handball",
    "info": "Hand and eye coordination, footwork in practice and game conditions, and skills and strategies of service and rally for the court sport handball (four-wall version). Novice to intermediate levels of play accommodated.",
    "prereq": []
  },
  {
    "uid": "002663",
    "code": "PE1031",
    "subject": "PE",
    "number": "1031",
    "honors": false,
    "writingIntensive": false,
    "name": "Sabre Fencing",
    "fullname": "Sabre Fencing",
    "info": "Basic sabre techniques, movement, an overview of fencing as a recreational sport and an Olympic sport, and the history of fencing.",
    "prereq": []
  },
  {
    "uid": "002552",
    "code": "PE1032",
    "subject": "PE",
    "number": "1032",
    "honors": false,
    "writingIntensive": false,
    "name": "Badminton",
    "fullname": "Badminton",
    "info": "Fundamentals including etiquette, terminology, game rules for singles and doubles, footwork, shot selection, and strategy.",
    "prereq": []
  },
  {
    "uid": "002661",
    "code": "PE1033",
    "subject": "PE",
    "number": "1033",
    "honors": false,
    "writingIntensive": false,
    "name": "Foil Fencing",
    "fullname": "Foil Fencing",
    "info": "Fending fundamentals, including basic foil techniques, movement, a general overview of fencing as a recreational sport and an Olympic sport, and the history of fencing.",
    "prereq": []
  },
  {
    "uid": "002553",
    "code": "PE1034",
    "subject": "PE",
    "number": "1034",
    "honors": false,
    "writingIntensive": false,
    "name": "Judo",
    "fullname": "Judo",
    "info": "Basic skills for throwing, falling, grappling (matwork), choking, arm and neck techniques; contest judo from Jiu-Jitsu; fundamental rules and scoring of contests. Videotapes used for technique instruction and contest appreciation.",
    "prereq": []
  },
  {
    "uid": "002554",
    "code": "PE1035",
    "subject": "PE",
    "number": "1035",
    "honors": false,
    "writingIntensive": false,
    "name": "Karate",
    "fullname": "Karate",
    "info": "Introduction to Traditional Japanese Shotokan Karate. Students learn to punch, block, strike, & kick with a focus on proper form, posture, & body mechanics. Students also learn a Kata (choreographed form), techniques with partners, & practical self-defense. Non-contact - no pads, hitting, or throwing.",
    "prereq": []
  },
  {
    "uid": "002556",
    "code": "PE1036",
    "subject": "PE",
    "number": "1036",
    "honors": false,
    "writingIntensive": false,
    "name": "Racquetball",
    "fullname": "Racquetball",
    "info": "Fundamentals of racquetball, including equipment; safety and etiquette; terminology; game rules of singles, doubles, and cutthroat; grips; basic strategies; serves and shots.  ",
    "prereq": []
  },
  {
    "uid": "002557",
    "code": "PE1037",
    "subject": "PE",
    "number": "1037",
    "honors": false,
    "writingIntensive": false,
    "name": "Squash",
    "fullname": "Squash",
    "info": "Entry-level technique, basic equipment, international dimension courts, and fitness. ",
    "prereq": []
  },
  {
    "uid": "002657",
    "code": "PE1038",
    "subject": "PE",
    "number": "1038",
    "honors": false,
    "writingIntensive": false,
    "name": "Tennis",
    "fullname": "Tennis",
    "info": "Fundamental strokes, including forehands, backhands, volleys, lobs, overheads, and serves; introduction to doubles play; terminology, rules, and etiquette.",
    "prereq": []
  },
  {
    "uid": "826229",
    "code": "PE1039",
    "subject": "PE",
    "number": "1039",
    "honors": false,
    "writingIntensive": false,
    "name": "Pickleball",
    "fullname": "Pickleball",
    "info": "Pickleball is a sport that was created for all ages and skill levels to find ways to enjoy physical activity and develop agility, technique, and a competitive spirit. Pickleball is a highly entertaining sport that is engaging and approachable to the true novice, which this course is designed for. This course is a beginning level, physically active course designed for students of all abilities. Students will develop a working knowledge of the etiquette, sportspersonship, rules, safety concerns, safe/healthy techniques, game theory, sport culture and regulations of pickleball. Physical literacy will also be developed through in-class activities and drills that support the development of techniques and agilities in relation to the sport that students will be able to utilize in multiple environments that benefit the healthy development of the whole person. Skills will include ball control, forehand/backhand drives, serving, drive/lobs, smash and general strategy.  This course includes lectures, demonstrations, and active student participation. The pursuit of this lifelong activity is the ultimate goal, so students will have out-of-the-classroom opportunities to engage in this sport culture. This will expose students to the exciting local, national, and international competitive and basic engagement opportunities for individuals interested in this physical activity. This course is ideal for students interested in learning more about a growing and inclusive physical activity and a unique way to encourage a physically active lifestyle.",
    "prereq": []
  },
  {
    "uid": "002660",
    "code": "PE1041",
    "subject": "PE",
    "number": "1041",
    "honors": false,
    "writingIntensive": false,
    "name": "Cycling",
    "fullname": "Cycling",
    "info": "Fundamentals of cycling, including physical fitness associated with aerobic training, stretching, safety, and bike maintenance. Students should provide bicycle in good working condition.",
    "prereq": []
  },
  {
    "uid": "002558",
    "code": "PE1042",
    "subject": "PE",
    "number": "1042",
    "honors": false,
    "writingIntensive": false,
    "name": "Orienteering",
    "fullname": "Orienteering",
    "info": "Fundamentals, including navigation of an orienteering course using map and compass; types of orienteering courses; multiple techniques and tactics of orienteering. Course is physically challenging and requires participation in three orienteering meets (Sunday afternoons).",
    "prereq": []
  },
  {
    "uid": "003970",
    "code": "PE1043",
    "subject": "PE",
    "number": "1043",
    "honors": false,
    "writingIntensive": false,
    "name": "Begin Horse Riding",
    "fullname": "Beginning Horse Riding",
    "info": "Techniques, styles, and communication of English riding. Students will learn riding techniques at a walk, trot, canter, and jumping.",
    "prereq": []
  },
  {
    "uid": "002559",
    "code": "PE1044",
    "subject": "PE",
    "number": "1044",
    "honors": false,
    "writingIntensive": false,
    "name": "Self-Defense",
    "fullname": "Self-Defense",
    "info": "Physical, psychological, and de-escalation skills for acting in crisis situations. Distance, body language, and tone of voice are addressed. Physical skills include striking, kicking, shifting, blocking, releasing techniques, floor defenses, and applications to armed attackers and multiple attackers.",
    "prereq": []
  },
  {
    "uid": "791896",
    "code": "PE1045",
    "subject": "PE",
    "number": "1045",
    "honors": false,
    "writingIntensive": false,
    "name": "Rock Climbing",
    "fullname": "Rock Climbing",
    "info": "Safety, knots, equipment, techniques, and anchor systems used in climbing. Course includes all necessary equipment. prereq: Good general health, no [neck or back] problems",
    "prereq": []
  },
  {
    "uid": "790638",
    "code": "PE1046",
    "subject": "PE",
    "number": "1046",
    "honors": false,
    "writingIntensive": false,
    "name": "Tae Kwon Do",
    "fullname": "Tae Kwon Do",
    "info": "Fundamentals of Tae Kwon Do. Principles of martial arts, body mechanics of Tae Kwon Do, practical self-defense.",
    "prereq": []
  },
  {
    "uid": "792594",
    "code": "PE1047",
    "subject": "PE",
    "number": "1047",
    "honors": false,
    "writingIntensive": false,
    "name": "Backpacking",
    "fullname": "Backpacking",
    "info": "Packing/fitting a backpack, trip planning, trail safety, gear selection, backcountry cooking, minimum impact camping/travel. Emphasizes practical skills and best practices. Four-day backpacking trip.",
    "prereq": []
  },
  {
    "uid": "002629",
    "code": "PE1048",
    "subject": "PE",
    "number": "1048",
    "honors": false,
    "writingIntensive": false,
    "name": "Bowling",
    "fullname": "Bowling",
    "info": "Fundamentals, including stance, approach and delivery, scoring, bowling terminology, and etiquette.",
    "prereq": []
  },
  {
    "uid": "826230",
    "code": "PE1052",
    "subject": "PE",
    "number": "1052",
    "honors": false,
    "writingIntensive": false,
    "name": "Curling",
    "fullname": "Curling",
    "info": "This 16th century Chess on Ice game has gained popularity since being reintroduced to the world during the 1998 Winter Olympics in Japan. Curling is now a beloved event in both modern Winter Olympics and Paralympics. With the sport's growing popularity, this traditionally cold weather sport is now available to curlers year-round with the development of indoor facilities (sheets).  This physically active course will explore curling history and introduce this exciting sport to novice curlers.  Course topics will include curling rules, technique, game plan, safety, fitness, strategy, equipment, ice, and general etiquette. Physical literacy will also be developed through in-class activities and drills that support the development of techniques and agilities in relation to the sport that students will be able to utilize in multiple environments that benefit the healthy development of the whole person. Skills will include ball control, forehand/backhand drives, serving, drive/lobs, smash, and general strategy. Could replace with: “Skills will include throwing the stone, sweeping, guards, curling your rock, takeouts, and timing the stones.” This course includes lectures, demonstrations, and active student participation. The pursuit of this lifelong activity is the ultimate goal, so students will have out-of-the-classroom opportunities to engage in this sport culture.  This will expose students to the exciting local, national, and international competitive and basic engagement opportunities for individuals interested in this physical activity. This course is ideal for students interested in learning more about a growing and inclusive physical activity and a unique way to encourage a physically active lifestyle.",
    "prereq": []
  },
  {
    "uid": "002632",
    "code": "PE1053",
    "subject": "PE",
    "number": "1053",
    "honors": false,
    "writingIntensive": false,
    "name": "Ice Skating",
    "fullname": "Ice Skating",
    "info": "Basic turns, basic stops, balance techniques, and various other skills from both the forward and backward positions. Equipment, safety issues, ice skating terminology.",
    "prereq": []
  },
  {
    "uid": "002631",
    "code": "PE1055",
    "subject": "PE",
    "number": "1055",
    "honors": false,
    "writingIntensive": false,
    "name": "Golf",
    "fullname": "Golf",
    "info": "Proper grip, stance, ball address, swing, club selection, psychological management, rules, and etiquette. Basic instruction in analyzing, assisting with, and coaching golf.",
    "prereq": []
  },
  {
    "uid": "004286",
    "code": "PE1056",
    "subject": "PE",
    "number": "1056",
    "honors": false,
    "writingIntensive": false,
    "name": "Nordic Skiing",
    "fullname": "Nordic (Cross-Country) Skiing",
    "info": "Introduction to the fundamental techniques of classical and freestyle cross country skiing. Students will be taught through lecture and direct experience on cross country skiing trails.",
    "prereq": []
  },
  {
    "uid": "004561",
    "code": "PE1057",
    "subject": "PE",
    "number": "1057",
    "honors": false,
    "writingIntensive": false,
    "name": "Skiing",
    "fullname": "Skiing",
    "info": "Alpine skiing. How to stop, turn, and use lifts. Safety, etiquette, and purchase of equipment. Class held at Highland Hills ski area in Bloomington.",
    "prereq": []
  },
  {
    "uid": "789678",
    "code": "PE1058",
    "subject": "PE",
    "number": "1058",
    "honors": false,
    "writingIntensive": false,
    "name": "Snowboarding",
    "fullname": "Snowboarding",
    "info": "Snowboarding is an exciting winter sport that is engaging and approachable to the true novice, which this course is designed for. This course is a beginning level, physically active course designed for students of all abilities. Students will develop a working knowledge of the etiquette, sportspersonship, rules, safety concerns, safe/healthy techniques, sports culture, and regulations of the international winter sport of Snowboarding. Physical literacy will be developed through in-class activities and drills that support the development of techniques and agilities in relation to the sport that students will be able to utilize in multiple environments that benefit the healthy development of the whole person. The pursuit of this lifelong activity is the ultimate goal, so students will have out-of-the-classroom opportunities to engage in this sport culture. This will expose students to the exciting local, national, and international competitive and basic engagement opportunities for individuals interested in this physical activity. This course is ideal for students interested in learning more about a growing and inclusive physical activity and a unique way to encourage a physically active lifestyle. This course takes place off-campus at an area ski hill so students need to make arrangements for their own transportation. Snowboarding equipment is available to rent at the facility for those who need it. Cold weather gear will be essential as class will take place as long as the ski hill is open.",
    "prereq": []
  },
  {
    "uid": "002635",
    "code": "PE1059",
    "subject": "PE",
    "number": "1059",
    "honors": false,
    "writingIntensive": false,
    "name": "Track and Field",
    "fullname": "Track and Field",
    "info": "Introduction to track and field: conditioning and training, events and skills, strategies, track and field knowledge, equipment, facilities, and technology.",
    "prereq": []
  },
  {
    "uid": "002637",
    "code": "PE1065",
    "subject": "PE",
    "number": "1065",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Tumbling &Gymnastics",
    "fullname": "Beginning Tumbling and Gymnastics",
    "info": "Rolls, handstands, cartwheels, extensions, handsprings, tucks (flips). Spotting techniques. Skills on bars, vault, and beam.",
    "prereq": []
  },
  {
    "uid": "002638",
    "code": "PE1067",
    "subject": "PE",
    "number": "1067",
    "honors": false,
    "writingIntensive": false,
    "name": "Basketball",
    "fullname": "Basketball",
    "info": "Fundamental skills and rules of basketball, with emphasis on basic court movement and different offensive and defensive strategies.",
    "prereq": []
  },
  {
    "uid": "826402",
    "code": "PE1068",
    "subject": "PE",
    "number": "1068",
    "honors": false,
    "writingIntensive": false,
    "name": "Wheelchair Basketball",
    "fullname": "Wheelchair Basketball",
    "info": "Wheelchair basketball is a local and international pastime for individuals of all ages and abilities. This sport can be a highly competitive, sophisticated, Paralympic-level sport that provides athletes, coaches, and volunteers an inclusive way to engage in one of America’s favorite activities.  This is also a sport that is engaging and approachable to the true novice. This course is a beginning level, lab-based, experiential course designed for students of all abilities. Throughout the semester, students will develop a working knowledge of the etiquette, safety concerns, applicable techniques, rules and regulations of wheelchair basketball, while also exploring the sport and Paralympic movement’s rich history.  The Americans with Disabilities  Act will be an overarching conversation throughout the course that supports the class as they consider opportunities and barriers to participating in this activity.  Physical literacy will also be developed through in-class activities and drills that support the development of techniques and agilities in relation to the sport: shooting, passing, dribbling, conditioning strategies, and game-specific strategies. The course includes lectures, demonstrations, and active student participation.  This course provides students with an opportunity to learn about barriers individuals with disabilities have experienced throughout history, while also exposing them to exciting local, national, and international competitive opportunities that have been created for athletes who utilize wheelchairs.  It is ideal for students interested in: Learning more about a growing, inclusive sport, working in physically active or rehabilitation-based environments, and/or exploring creative ways to encourage a physically active lifestyle for a range of abilities.",
    "prereq": []
  },
  {
    "uid": "796166",
    "code": "PE1071",
    "subject": "PE",
    "number": "1071",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Cricket",
    "fullname": "Beginning Cricket",
    "info": "Fundamentals of Cricket. Laws of Cricket, bowling/batting techniques, competitive/recreational Cricket opportunities.",
    "prereq": []
  },
  {
    "uid": "003682",
    "code": "PE1072",
    "subject": "PE",
    "number": "1072",
    "honors": false,
    "writingIntensive": false,
    "name": "Soccer",
    "fullname": "Soccer",
    "info": "Fundamentals of soccer including sporting behavior both on and off the field, game rules, soccer terminology, participation and competition drills, fundamental soccer skills, practical instruction in strategy.",
    "prereq": []
  },
  {
    "uid": "002649",
    "code": "PE1073",
    "subject": "PE",
    "number": "1073",
    "honors": false,
    "writingIntensive": false,
    "name": "Softball",
    "fullname": "Softball",
    "info": "Development of basic skills for lifetime involvement.",
    "prereq": []
  },
  {
    "uid": "002650",
    "code": "PE1074",
    "subject": "PE",
    "number": "1074",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg. Volleyball",
    "fullname": "Beginning Volleyball",
    "info": "Basic skills, team play, rules, officiating, and strategy.",
    "prereq": []
  },
  {
    "uid": "002647",
    "code": "PE1075",
    "subject": "PE",
    "number": "1075",
    "honors": false,
    "writingIntensive": false,
    "name": "Ice Hockey",
    "fullname": "Ice Hockey",
    "info": "Offensive/defensive strategies/techniques, goal tending, scrimmage play. Students need their own equipment.prereq: 1053 or equiv or instr consent",
    "prereq": {
      "code": "PE 1053",
      "subject": "PE",
      "id": "1053"
    }
  },
  {
    "uid": "804926",
    "code": "PE1076",
    "subject": "PE",
    "number": "1076",
    "honors": false,
    "writingIntensive": false,
    "name": "Flag Football",
    "fullname": "Flag Football",
    "info": "Introduction to flag football, techniques, field positions, rules/regulations. Students will participate in vigorous exercise activities including running, throwing, kicking, and catching.",
    "prereq": []
  },
  {
    "uid": "804927",
    "code": "PE1077",
    "subject": "PE",
    "number": "1077",
    "honors": false,
    "writingIntensive": false,
    "name": "Lacrosse",
    "fullname": "Lacrosse",
    "info": "Introduction to lacrosse, techniques, field positions, rules, regulations. Students participate in vigorous exercise activities including running, throwing, catching, and stick handling.",
    "prereq": []
  },
  {
    "uid": "804928",
    "code": "PE1078",
    "subject": "PE",
    "number": "1078",
    "honors": false,
    "writingIntensive": false,
    "name": "Ultimate Disc",
    "fullname": "Ultimate Disc",
    "info": "Introduction to ultimate disc, techniques, field positions, rules, regulations. Students participate in vigorous exercise activities including running, throwing, and catching.",
    "prereq": []
  },
  {
    "uid": "805425",
    "code": "PE1079",
    "subject": "PE",
    "number": "1079",
    "honors": false,
    "writingIntensive": false,
    "name": "Rugby",
    "fullname": "Rugby (Non-contact)",
    "info": "Appropriate techniques and field positions. Safe play using appropriate rules and laws. Vigorous exercise activities, including running, passing, catching, evasion, and other physical activity associated with rugby.",
    "prereq": []
  },
  {
    "uid": "805426",
    "code": "PE1082",
    "subject": "PE",
    "number": "1082",
    "honors": false,
    "writingIntensive": false,
    "name": "Broomball",
    "fullname": "Broomball",
    "info": "Techniques. Safe play using appropriate rules and regulations. Vigorous exercise activities, including running, stick handling, shooting, passing, and other physical activity associated with broomball.",
    "prereq": []
  },
  {
    "uid": "002651",
    "code": "PE1107",
    "subject": "PE",
    "number": "1107",
    "honors": false,
    "writingIntensive": false,
    "name": "Int. Swimming",
    "fullname": "Intermediate Swimming",
    "info": "Intermediate swimming skills. Fundamentals of swimming and hydrodynamics.prereq: 1007 or equiv, proficient ability to swim 100 meters or instr consent",
    "prereq": {
      "code": "PE 1007",
      "subject": "PE",
      "id": "1007"
    }
  },
  {
    "uid": "826766",
    "code": "PE1115",
    "subject": "PE",
    "number": "1115",
    "honors": false,
    "writingIntensive": false,
    "name": "Personal Training",
    "fullname": "Personal Training",
    "info": "This course provides students the opportunity to develop the required knowledge and the technical, physical, and professional skill sets of a personal trainer. The curriculum includes practical exercise knowledge that will support the safe delivery of basic exercise prescriptions and effectively lead personal training sessions for individuals of differing fitness levels, abilities, and experiences. Physical literacy will also be developed through in-class activities and drills that support the development of techniques and training queues. Students who are successful in completing the course can pursue, at an additional personal cost, certification through the American Council on Exercise (ACE) Personal Training Exam.    This course is ideal for students interested in learning more about leading inclusive physical activity and ways to engage with community members in a physically active lifestyle.",
    "prereq": []
  },
  {
    "uid": "802393",
    "code": "PE1129",
    "subject": "PE",
    "number": "1129",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Handball",
    "fullname": "Intermediate Handball",
    "info": "Hand/eye coordination, footwork. Skills in practice/game conditions. Strategies of service/rally.prereq: 1029 or instr consent",
    "prereq": {
      "code": "PE 1029",
      "subject": "PE",
      "id": "1029"
    }
  },
  {
    "uid": "002662",
    "code": "PE1133",
    "subject": "PE",
    "number": "1133",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Foil Fencing",
    "fullname": "Intermediate Foil Fencing",
    "info": "Intermediate/advanced technical/tactical actions in foil, rudimentary epee skills, intermediate/advanced footwork. Rules, officiating, bout tactics.prereq: 1033 or equiv or instr consent",
    "prereq": {
      "code": "PE 1033",
      "subject": "PE",
      "id": "1033"
    }
  },
  {
    "uid": "002658",
    "code": "PE1135",
    "subject": "PE",
    "number": "1135",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Karate",
    "fullname": "Intermediate Karate",
    "info": "Techniques of Japanese traditional Shotokan Karate taught through Ippon Kumite (one step sparring), San Kumite (three step sparring), and Heian Shodan Kata/Nidan Kata (forms). Testing for orange belt is optional.prereq: 1035 or equiv or instr consent",
    "prereq": {
      "code": "PE 1035",
      "subject": "PE",
      "id": "1035"
    }
  },
  {
    "uid": "002652",
    "code": "PE1136",
    "subject": "PE",
    "number": "1136",
    "honors": false,
    "writingIntensive": false,
    "name": "Int. Racquetball",
    "fullname": "Intermediate Racquetball",
    "info": "Improvement of basic skills and strategies. Format is determined by the number of players and their level of ability. ",
    "prereq": []
  },
  {
    "uid": "802093",
    "code": "PE1137",
    "subject": "PE",
    "number": "1137",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Squash",
    "fullname": "Intermediate Squash",
    "info": "Stroke mechanics, shot placement, changing pace. Court movement/positioning. Fitness requirements, joint/muscle stresses. Weight training for squash. On-court etiquette.prereq: 1037 or instr consent",
    "prereq": {
      "code": "PE 1037",
      "subject": "PE",
      "id": "1037"
    }
  },
  {
    "uid": "002659",
    "code": "PE1138",
    "subject": "PE",
    "number": "1138",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Tennis",
    "fullname": "Intermediate Tennis",
    "info": "Review terminology, rules, etiquette. Improve basic skills. Singles/doubles strategy, competitive play.",
    "prereq": []
  },
  {
    "uid": "799431",
    "code": "PE1146",
    "subject": "PE",
    "number": "1146",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Tae Kwan Do",
    "fullname": "Intermediate Tae Kwan Do",
    "info": "Continuation of 1046. Focuses on Olympic-style intermediate skills/techniques. Self-defense techniques for men/women.prereq: 1046, previous Tae Kwon Do experience (World Tae Kwon Do Federation sanctioned), basic white Tae Kwon Do uniform",
    "prereq": {
      "code": "PE 1046",
      "subject": "PE",
      "id": "1046"
    }
  },
  {
    "uid": "002561",
    "code": "PE1154",
    "subject": "PE",
    "number": "1154",
    "honors": false,
    "writingIntensive": false,
    "name": "Figure Skating",
    "fullname": "Figure Skating",
    "info": "Terminology, rules. Basic moves, jumps, spins. On-/off-ice assignments.prereq: 1053 or equiv or instr consent",
    "prereq": {
      "code": "PE 1053",
      "subject": "PE",
      "id": "1053"
    }
  },
  {
    "uid": "004562",
    "code": "PE1157",
    "subject": "PE",
    "number": "1157",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Skiing",
    "fullname": "Intermediate Skiing",
    "info": "Developing advanced skills in alpine skiing. Skiing safely on more difficult terrain. Class held at Highland Hills ski area in Bloomington.",
    "prereq": []
  },
  {
    "uid": "002653",
    "code": "PE1165",
    "subject": "PE",
    "number": "1165",
    "honors": false,
    "writingIntensive": false,
    "name": "IntermediateTumbling&Gymnastcs",
    "fullname": "Intermediate Tumbling and Gymnastics",
    "info": "Rolls, handstands, cartwheels, extensions, handsprings, tucks (flips), twists. Spotting techniques. Skills on bars, vault, and beam.",
    "prereq": []
  },
  {
    "uid": "002654",
    "code": "PE1174",
    "subject": "PE",
    "number": "1174",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Volleyball",
    "fullname": "Intermediate Volleyball",
    "info": "Volleyball systems of play. Incorporating offensive/defensive formations. Team play, transition, coaching, officiating.prereq: [1074 or equiv], instr consent",
    "prereq": {
      "code": "PE 1074",
      "subject": "PE",
      "id": "1074"
    }
  },
  {
    "uid": "002562",
    "code": "PE1205",
    "subject": "PE",
    "number": "1205",
    "honors": false,
    "writingIntensive": false,
    "name": "Scuba",
    "fullname": "Scuba and Skin Diving",
    "info": "Diving equipment, physics, physiology, decompression, emergencies, recreational dive planning, oceans, currents and aquatic life, snorkeling/SCUBA equipment usage, buoyancy control, entries, emergencies.\n\nprereq: Ability to swim 400 yds comfortably or instr consent",
    "prereq": []
  },
  {
    "uid": "805427",
    "code": "PE1207",
    "subject": "PE",
    "number": "1207",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Swimming",
    "fullname": "Advanced Swimming",
    "info": "Principles of lifetime physical fitness, derived from aquatic exercise. Workout made up of various drills and exercises demonstrating value of swimming fundamentals and training. Training variety, proper technique, and appropriate safety procedures.prereq: [PE 1007, PE 1107, PE 1306, PE 1411] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "PE 1007",
          "subject": "PE",
          "id": "1007"
        },
        {
          "code": "PE 1107",
          "subject": "PE",
          "id": "1107"
        },
        {
          "code": "PE 1306",
          "subject": "PE",
          "id": "1306"
        },
        {
          "code": "PE 1411",
          "subject": "PE",
          "id": "1411"
        }
      ]
    }
  },
  {
    "uid": "802282",
    "code": "PE1262",
    "subject": "PE",
    "number": "1262",
    "honors": false,
    "writingIntensive": false,
    "name": "Marathon Training",
    "fullname": "Marathon Training",
    "info": "Physical challenge achieved through physiological/psychological adaptation. Goal setting that fosters adaptation in many facets of life. Marathon history.All students must show proof of a medical physical on the first day of class and be able to run for 30 minutes, continuously.",
    "prereq": []
  },
  {
    "uid": "788858",
    "code": "PE1305",
    "subject": "PE",
    "number": "1305",
    "honors": false,
    "writingIntensive": false,
    "name": "Scuba Stress Rescue & Acc Mgmt",
    "fullname": "Scuba Stress Rescue and Accident Management",
    "info": "Continuing education after basic SCUBA certification course. Accident prevention, personal safety, SCUBA rescue, recognizing/reducing diver stress. SCUBA Schools International (SSI) Stress and Rescue certification.",
    "prereq": []
  },
  {
    "uid": "002655",
    "code": "PE1306",
    "subject": "PE",
    "number": "1306",
    "honors": false,
    "writingIntensive": false,
    "name": "Lifeguard Training",
    "fullname": "Lifeguard Training",
    "info": "Upon completion, certifications are obtained in the following categories: American Red Cross Lifeguarding Today and First Aid; CPR for the Professional Rescuer; and Waterfront Lifeguarding.",
    "prereq": []
  },
  {
    "uid": "002656",
    "code": "PE1411",
    "subject": "PE",
    "number": "1411",
    "honors": false,
    "writingIntensive": false,
    "name": "Water Safety Instructor",
    "fullname": "Water Safety Instructor",
    "info": "Advanced lifesaving techniques, treading strategies.",
    "prereq": []
  },
  {
    "uid": "013872",
    "code": "PE1415",
    "subject": "PE",
    "number": "1415",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Weight Trning & Condition",
    "fullname": "Advanced Weight Training and Conditioning",
    "info": "Introduction to advanced forms of cardiovascular/weight training. Powerlifting, Olympic weightlifting, bodybuilding, sport-specific training. Proper technique, exercise selection, programming, nutrition, anatomy/physiology of weight training.",
    "prereq": []
  },
  {
    "uid": "789555",
    "code": "PE1720",
    "subject": "PE",
    "number": "1720",
    "honors": false,
    "writingIntensive": false,
    "name": "Activities in Physical Educ",
    "fullname": "Special Activities in Physical Education",
    "info": "Activities or related opportunities not normally available through regular course offerings.",
    "prereq": []
  },
  {
    "uid": "825709",
    "code": "PE2C",
    "subject": "PE",
    "number": "2",
    "honors": false,
    "writingIntensive": false,
    "name": "Spts Ed",
    "fullname": "Spts Ed",
    "info": "",
    "prereq": []
  }
]