[
  {
    "uid": "802978",
    "code": "PED6121",
    "subject": "PED",
    "number": "6121",
    "honors": false,
    "writingIntensive": false,
    "name": "Conflict, Anger, Aggression",
    "fullname": "Conflict, Anger, Aggression, Violence",
    "info": "Current studies of biological bases (e.g., evolutionary adaptation, genetic, physiological substrates), behavioral expression (e.g., roles of environment, development, learning/motivation, personality, psychopathology), and social interactions (e.g., culture, criminal violence, warfare, genocide).prereq: Ped 6121/PubH 6121",
    "prereq": {
      "code": "PUBH 6121",
      "subject": "PUBH",
      "id": "6121"
    }
  },
  {
    "uid": "811519",
    "code": "PED6996",
    "subject": "PED",
    "number": "6996",
    "honors": false,
    "writingIntensive": false,
    "name": "Summer Internship in Pediatric",
    "fullname": "Department of Pediatrics- Summer Internship in Pediatrics. EPAC Explore Students Only.",
    "info": "Exposure to clinical general pediatrics early in medical school. Two-week preceptorship with general pediatrician during summer hiatus between first/second year of medical school. Only available to students part of EPAC Explore group. Participating students need to be in academic good standing at the medical school.",
    "prereq": []
  },
  {
    "uid": "820457",
    "code": "PED7000",
    "subject": "PED",
    "number": "7000",
    "honors": false,
    "writingIntensive": false,
    "name": "New Parent/Caregiver Elective",
    "fullname": "New Parent/Caregiver Elective",
    "info": "This flexible rotation is designed to allow medical students who become new parents or further grow their family with the addition of a new child to spend additional time learning from and benefiting from the early days with their new child.",
    "prereq": []
  },
  {
    "uid": "804104",
    "code": "PED7091",
    "subject": "PED",
    "number": "7091",
    "honors": false,
    "writingIntensive": false,
    "name": "Neural Basis: Anger/Aggression",
    "fullname": "Independent Study in the Neural Basis of Anger, Tantrums, and Aggression",
    "info": "Neural and other biological bases for emotional expression of anger and for tantrum/aggression.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "013060",
    "code": "PED7204",
    "subject": "PED",
    "number": "7204",
    "honors": false,
    "writingIntensive": false,
    "name": "Residency in Pediatrics",
    "fullname": "Residency in Pediatrics",
    "info": "Residency in pediatrics rotation.",
    "prereq": []
  },
  {
    "uid": "013061",
    "code": "PED7206",
    "subject": "PED",
    "number": "7206",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Special Interest",
    "fullname": "Pediatric Fellowship",
    "info": "Graduate medical education in pediatric subspecialties.",
    "prereq": []
  },
  {
    "uid": "011612",
    "code": "PED7501",
    "subject": "PED",
    "number": "7501",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Clerkship",
    "fullname": "Pediatric Clerkship",
    "info": "Provides basic pediatric skills and knowledge necessary for each student, no matter what field of medicine they select.",
    "prereq": []
  },
  {
    "uid": "820018",
    "code": "PED7510",
    "subject": "PED",
    "number": "7510",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Clerkship A",
    "fullname": "Pediatric Clerkship Part A",
    "info": "Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. Catalog Description: The Pediatric 7501 externship is designed to provide basic pediatric skills and knowledge necessary for all students, no matter what field of medicine they select. Students will develop a basic understanding of normal growth and development, the influence of the environment on health, the impact of hospitalization on the child/family unit, and basic principles of common diseases affecting children. Students will be assigned patients on wards and, at some sites, newborn nurseries. Teaching rounds and conferences will review work-ups, discuss problems, and evaluate progress.",
    "prereq": []
  },
  {
    "uid": "820019",
    "code": "PED7511",
    "subject": "PED",
    "number": "7511",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Clerkship B",
    "fullname": "Pediatric Clerkship Part B",
    "info": "Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. Catalog Description: The Pediatric 7501 externship is designed to provide basic pediatric skills and knowledge necessary for all students, no matter what field of medicine they select. Students will develop a basic understanding of normal growth and development, the influence of the environment on health, the impact of hospitalization on the child/family unit, and basic principles of common diseases affecting children. Students will be assigned patients on wards and, at some sites, newborn nurseries. Teaching rounds and conferences will review work-ups, discuss problems, and evaluate progress.",
    "prereq": []
  },
  {
    "uid": "011636",
    "code": "PED7512",
    "subject": "PED",
    "number": "7512",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Elective",
    "fullname": "Pedicatric Acting Internship",
    "info": "An intensive learning experience focusing on children with diseases treated by subspecialty services, generally cardiology, nephrology, or oncology. The student functions as an acting intern.prereq: 7501",
    "prereq": {
      "code": "PED 7501",
      "subject": "PED",
      "id": "7501"
    }
  },
  {
    "uid": "013062",
    "code": "PED7531",
    "subject": "PED",
    "number": "7531",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatrics-Psych Internship",
    "fullname": "Pediatrics-Psychology Internship",
    "info": "The aim of the University of Minnesota Medical School Psychology Internship is to prepare interns to meet the mental health needs of children and to function as psychologists in academic health centers or other clinical contexts. Interns provide clinical assessments and care for children and their families in a broad mix of clinical settings within a teaching hospital. In addition to extensive supervised clinical experiences, interns participate in a blend of didactics, conferences, and team meetings to further their professional development. The internship year provides ample opportunities for interns to collaborate closely with faculty and develop collegial relationships with our faculty, staff, and each other.The Internship has been continuously accredited since 1965 by the American Psychological Association making it the longest APA-accredited internship in this region, and is known for its quality assessment and improvement activities. William Robiner, PhD, ABPP, is the Internship Director.",
    "prereq": []
  },
  {
    "uid": "011666",
    "code": "PED7533",
    "subject": "PED",
    "number": "7533",
    "honors": false,
    "writingIntensive": false,
    "name": "Ped Allergy Elec",
    "fullname": "Clinical Allergy at Fairview-University Medical Center",
    "info": "Emphasizes the practical aspects of allergic and immunologic work-ups and treatments. The particular content of the course is modified depending upon individual needs.",
    "prereq": []
  },
  {
    "uid": "011667",
    "code": "PED7534",
    "subject": "PED",
    "number": "7534",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Cardiology",
    "fullname": "Pediatric Cardiology",
    "info": "The elective rotation in Pediatric Cardiology is open to third and fourth year medical students who are interested in pediatric cardiovascular disease. The rotation is primarily an outpatient one.",
    "prereq": []
  },
  {
    "uid": "011669",
    "code": "PED7535",
    "subject": "PED",
    "number": "7535",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Infectious Disease",
    "fullname": "Pediatric Infectious Disease",
    "info": "The student works closely with the infectious disease fellow and pediatric resident on service, and contribute to the diagnosis and management of patients with suspected or proven infections.prereq: Med Student Yr 3 or 4/PED 7501 or equivalent courses/one other pediatric elective",
    "prereq": {
      "code": "PED 7501",
      "subject": "PED",
      "id": "7501"
    }
  },
  {
    "uid": "011670",
    "code": "PED7536",
    "subject": "PED",
    "number": "7536",
    "honors": false,
    "writingIntensive": false,
    "name": "Ped Hematology, Oncology, BMT",
    "fullname": "Pediatric Hematology/Oncology/Bone Marrow Transplantation",
    "info": "This course provides inpatient and outpatient experience in clinical management of children, adolescents and young adults with various blood, cancer, immunologic, or other diagnoses.",
    "prereq": []
  },
  {
    "uid": "011671",
    "code": "PED7537",
    "subject": "PED",
    "number": "7537",
    "honors": false,
    "writingIntensive": false,
    "name": "Ped Endocrinology & Diabetes",
    "fullname": "Pediatric Endocrinology & Diabetes",
    "info": "The student works with faculty, fellows, and residents in a small group. This course is particularly suitable for students planning to pursue residency programs in Internal Medicine and in Pediatrics.",
    "prereq": []
  },
  {
    "uid": "011673",
    "code": "PED7538",
    "subject": "PED",
    "number": "7538",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Gastro & Nutrition",
    "fullname": "Pediatric Gastroenterology and Nutrition",
    "info": "The student sees GI and nutrition consults on the pediatric stations, attends clinic and observes all diagnostic and biopsy procedures pertaining to gastrointestinal patients.",
    "prereq": []
  },
  {
    "uid": "011674",
    "code": "PED7539",
    "subject": "PED",
    "number": "7539",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Neonatal Med",
    "fullname": "Acting Intern Neonatal Medicine",
    "info": "This course offers the student an opportunity to be an extern in one of the neonatal intensive care units. For assigned patients, the student will assume the responsibility of a first-year resident: the student will make rounds with the house officers and attending staff on all patients, write orders and progress notes on assigned patients, and carry out necessary procedures under supervision.",
    "prereq": []
  },
  {
    "uid": "011675",
    "code": "PED7540",
    "subject": "PED",
    "number": "7540",
    "honors": false,
    "writingIntensive": false,
    "name": "Ped Neurology Elec",
    "fullname": "Pediatric Neurology",
    "info": "Successful completion of this rotation satisfies the Department of Neurology 7-510 requirement. Pediatric neurology patients have a variety of problems ranging from coma, muscular dystrophy, epilepsy to learning disabilities; from inborn errors of metabolism, metabolic neurologic dysfunction to behavior disorders.",
    "prereq": []
  },
  {
    "uid": "818121",
    "code": "PED7541",
    "subject": "PED",
    "number": "7541",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric ENT Elective",
    "fullname": "Children's Hospitals and Clinics of MN Pediatric ENT Elective",
    "info": "This rotation would be geared towards those with strong interest in ENT or strong interest in Pediatrics with the objectives to improve ENT assessment of the pediatric patient and gain proficiency in head and neck exam. Reading about pertinent issues that the student is encountering in clinic, rounds or the operating room will be expected.",
    "prereq": []
  },
  {
    "uid": "818244",
    "code": "PED7542",
    "subject": "PED",
    "number": "7542",
    "honors": false,
    "writingIntensive": false,
    "name": "Ped Palliative Med and Hospice",
    "fullname": "Pediatric Palliative Medicine and Hospice",
    "info": "This course is designed to introduce students to the fields of pediatric hospice and palliative medicine. Students will primarily spend time with the Pain and Advanced/Complex Care Team (PACCT), the pain and palliative consult service at the University of Minnesota Masonic Children's Hospital (UMMCH), as well as its broader interdisciplinary team members (nurse practitioners, social workers, child life specialists, music therapists, and spiritual health providers). Students will also spend at least one day with the interdisciplinary pediatric home hospice and palliative care team teams at Fairview Homecare and Hospice. Depending on availability, students may also rotate in the outpatient clinic at UMMCH. They will be expected to engage in patient care planning, including family meetings and interdisciplinary team collaborations. ",
    "prereq": []
  },
  {
    "uid": "011676",
    "code": "PED7543",
    "subject": "PED",
    "number": "7543",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Nephrology",
    "fullname": "Pediatric Nephrology",
    "info": "Daily working rounds with the staff will be made, and the team will make formal rounds with the students to discuss the patients in hospital. Outpatient management of a wide variety of problems, both nephrologic and urologic, are considered in clinics.",
    "prereq": []
  },
  {
    "uid": "011677",
    "code": "PED7544",
    "subject": "PED",
    "number": "7544",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Pulmonary Disease",
    "fullname": "Pediatric Pulmonary Disease",
    "info": "This pediatric course will focus on care of pulmonary problems of patients with diverse lung diseases and will include work with the pediatric pulmonary health care team.",
    "prereq": []
  },
  {
    "uid": "818208",
    "code": "PED7545",
    "subject": "PED",
    "number": "7545",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Gen Ped Outptnt",
    "fullname": "Acting Intern General Pediatrics Outpatient Elective",
    "info": "This is a general pediatric primary care elective. It will allow students to work closely with an outpatient clinical practice team to provide care for patients and families seeking ongoing pediatric primary care.",
    "prereq": []
  },
  {
    "uid": "819112",
    "code": "PED7546",
    "subject": "PED",
    "number": "7546",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Hematology Oncology",
    "fullname": "Children's Minnesota - Hematology Oncology Elective",
    "info": "The focus of this rotation is to increase exposure to pediatric patients with cancer and blood disorders. Depending on availability, students will have an opportunity to rotate in both hematology and oncology clinics and occasionally on the inpatient service. Medical students will work with the attending to see patients throughout the clinic day. This rotation will provide exposure to a wide variety of disorders including oncology diagnosis (CNS tumors, solid tumors, and hematologic malignancies), vascular anomalies, and hematology diagnosis (bleeding disorders, clotting disorders, cytopenias, congenital anemia and hemoglobinopathies.)",
    "prereq": []
  },
  {
    "uid": "818122",
    "code": "PED7547",
    "subject": "PED",
    "number": "7547",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Sleep Medicine Elect",
    "fullname": "Children's Hospitals and Clinics of MN Pediatric Sleep Medicine Elective",
    "info": "Pediatric sleep disorders are common in all ages and populations. There is limited exposure during medical school and residency to sleep medicine in general and pediatric sleep medicine specifically. This rotation will explore the common pediatric sleep disorders that every pediatrician should be aware of.",
    "prereq": []
  },
  {
    "uid": "011678",
    "code": "PED7548",
    "subject": "PED",
    "number": "7548",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Genetics",
    "fullname": "Clinical Genetics",
    "info": "This course will be valuable for students interested in any discipline and allows exposure to patients in pediatrics, medicine, and obstetrics/perinatology.",
    "prereq": []
  },
  {
    "uid": "826811",
    "code": "PED7549",
    "subject": "PED",
    "number": "7549",
    "honors": false,
    "writingIntensive": false,
    "name": "Adoption Medicine",
    "fullname": "Pediatric Care of Children with a History of Foster Care and/or Adoption",
    "info": "This rotation is currently offered to residents at UMN. We wish to broaden it so that visiting students, residents, fellows, and other medical students can rotate with us to learn more about care for children in foster care, those adopted domestically and internationally. It combines a lot of concepts from developmental behavioral pediatrics, psychiatry, infectious disease, and gen peds and we work closely with occupational therapists and psychologists in a team setting to optimize care of children with a history of prenatal exposures and adverse childhood experiences. ",
    "prereq": []
  },
  {
    "uid": "818123",
    "code": "PED7550",
    "subject": "PED",
    "number": "7550",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Ethics Elective",
    "fullname": "Children's Hospitals and Clinics of MN Pediatric Ethics Elective",
    "info": "Clinical ethics is an integral part of the practice of medicine—medicine by definition is an ethical practice. Taking the time to understand how the ethical principles work in day to day clinical decision making is paramount to the development of ethically astute clinicians. In order to provide students with an immersive experience in clinical ethics this elective has been created for those who seek more directive knowledge on how ethics affects patient care.",
    "prereq": []
  },
  {
    "uid": "011679",
    "code": "PED7553",
    "subject": "PED",
    "number": "7553",
    "honors": false,
    "writingIntensive": false,
    "name": "Adolescent Medicine",
    "fullname": "Adolescent Medicine",
    "info": "This elective involves two adolescent interviewing workshops and one adolescent pelvic exam workshop. Special emphasis is placed on acquisition of effective clinical communication skills. Students are exposed to a variety of community-based services for youth, including general adolescent medicine clinics, programs for at-risk youth, and for youth in foster care.",
    "prereq": []
  },
  {
    "uid": "011680",
    "code": "PED7555",
    "subject": "PED",
    "number": "7555",
    "honors": false,
    "writingIntensive": false,
    "name": "Ped Neonatal Elec",
    "fullname": "Neonatal Clerkship - Marshfield, WI",
    "info": "This elective revolves primarily around medical problems related to the newborn, including neonatal infections, metabolic problems, cardiovascular problems, shock, pulmonary insufficiency, central nervous system asphyxia and hemorrhage.prereq: 7512,enrolled yr 4 med",
    "prereq": {
      "code": "PED 7512",
      "subject": "PED",
      "id": "7512"
    }
  },
  {
    "uid": "011681",
    "code": "PED7556",
    "subject": "PED",
    "number": "7556",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Elective",
    "fullname": "Pedicatrics Clerkship - Marshfield, WI",
    "info": "The student functions as a house officer on the pediatric ward and in the emergency room and has night call every third or fourth night.prereq: 7501,enrolled yr 4 med",
    "prereq": {
      "code": "PED 7501",
      "subject": "PED",
      "id": "7501"
    }
  },
  {
    "uid": "818120",
    "code": "PED7557",
    "subject": "PED",
    "number": "7557",
    "honors": false,
    "writingIntensive": false,
    "name": "Peds/Adolescent Gynecology",
    "fullname": "Children's Hospitals and Clinics of MN Pediatric/Adolescent Gynecology Elective",
    "info": "Pediatric and Adolescent Gynecology (PAG) is an important aspect of clinical education for Pediatrics training programs. Furthermore, PAG is an integral part of Pediatrics and Adolescent Medicine licensing exams. Specific PAG learning objectives, like those found in the American Board of Pediatrics must be fulfilled. Residents have indicated that they do not feel they get enough exposure to PAG topics and have expressed a desire to learn more about this population during their training.",
    "prereq": []
  },
  {
    "uid": "011682",
    "code": "PED7559",
    "subject": "PED",
    "number": "7559",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Ped Intensv Care",
    "fullname": "Acting Internship in Pediatric Intensive Care",
    "info": "The student works as a member of the resident-fellow-attending physician team in assessing and treating all medical and surgical patients on the pediatric intensive care unit.",
    "prereq": []
  },
  {
    "uid": "011683",
    "code": "PED7560",
    "subject": "PED",
    "number": "7560",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Research",
    "fullname": "Pediatric Research",
    "info": "A research experience in pediatrics can be arranged on an individual basis with various members in the Pediatrics Department. This course affords the student opportunity to work with a pediatric faculty member on a predetermined research project.",
    "prereq": []
  },
  {
    "uid": "820191",
    "code": "PED7565",
    "subject": "PED",
    "number": "7565",
    "honors": false,
    "writingIntensive": false,
    "name": "Childhood Cancer Survivorship",
    "fullname": "Childhood Cancer Survivorship Medicine",
    "info": "This is a two week clinical rotation involving both direct patient care as well as didactic learning specific to childhood cancer survivors of all ages.  When in-person clinical care is not possible (e.g. periods during pandemic response), the rotation is available virtually.  Learners will become familiar with practice guidelines, the value of a Survivor Care Plans, and the sentinel literature related to childhood cancer survivor care.",
    "prereq": []
  },
  {
    "uid": "011685",
    "code": "PED7566",
    "subject": "PED",
    "number": "7566",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Elective",
    "fullname": "Evolution of American Pediatrics",
    "info": "This course explores the evolution of American Pediatrics from the post-Civil War period to the present. American Pediatrics may be divided into several distinct eras based on the forces which defined its boundaries and identity. These include societal and governmental influences, changing norms of medical practice, emerging scientific knowledge, and reforms in medical education. The course will also examine Pediatrics' contribution to medical knowledge and the influence of pediatrics on the attitudes of government and society toward children. Team teaching format combines formal lectures, assigned readings, and student/faculty discussion.",
    "prereq": []
  },
  {
    "uid": "011686",
    "code": "PED7583",
    "subject": "PED",
    "number": "7583",
    "honors": false,
    "writingIntensive": false,
    "name": "Ped Oncology",
    "fullname": "Fundamentals of Clinical Oncology",
    "info": "This multidisciplinary course provides an introduction to the fundamentals of clinical oncology (adult and pediatric) and is designed for the medical student interested in entering any specialty.prereq: Med 7500 or 7501",
    "prereq": {
      "or": [
        {
          "code": "MED 7500",
          "subject": "MED",
          "id": "7500"
        },
        {
          "code": "PED 7501",
          "subject": "PED",
          "id": "7501"
        }
      ]
    }
  },
  {
    "uid": "803556",
    "code": "PED7700",
    "subject": "PED",
    "number": "7700",
    "honors": false,
    "writingIntensive": false,
    "name": "Primary Care Selective - Peds",
    "fullname": "Primary Care Selective - Pediatrics",
    "info": "A 4-week ambulatory experience with a focus on both the specialty specific content areas and the process-of-care in the ambulatory setting.",
    "prereq": []
  },
  {
    "uid": "817864",
    "code": "PED7800",
    "subject": "PED",
    "number": "7800",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Pediatrics",
    "fullname": "Acting Intern Pediatrics",
    "info": "The Advanced Selective in Pediatrics is an opportunity for students to serve patients in a community-based general inpatient setting. Advanced selective students will take on the responsibility of an acting intern on the general pediatrics inpatients team. They will collaborate with pediatric and medicine-pediatric interns and medical students in their foundational training. They will be supervised by pediatric and medicine-pediatric senior residents and faculty attendings.",
    "prereq": []
  },
  {
    "uid": "826556",
    "code": "PED7801",
    "subject": "PED",
    "number": "7801",
    "honors": false,
    "writingIntensive": false,
    "name": "Acting Intern Subspecialty Ped",
    "fullname": "Acting Internship in Subspecialty Pediatrics",
    "info": "The Advanced Selective in Subspecialty Pediatrics is an opportunity for students to serve patients in an inpatient setting on subspecialty services such as Hematology/Oncology, Nephrology, Gastroenterology, and Emergency Pediatrics.  This rotation also includes a variety of phases of care including Emergency Room, Night Coverage (admissions and cross cover), and daily inpatient setting with a subspecialty team.  Students will take on the responsibility of an acting intern in these various care settings. They will collaborate with pediatric interns and medical students in their foundational training. They will be supervised by pediatric senior residents and faculty attendings.",
    "prereq": []
  },
  {
    "uid": "805720",
    "code": "PED7910",
    "subject": "PED",
    "number": "7910",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Med Residency",
    "fullname": "Pediatric Medical Residency",
    "info": "Pediatric medical residency.",
    "prereq": []
  },
  {
    "uid": "805721",
    "code": "PED7930",
    "subject": "PED",
    "number": "7930",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Med Fellowship",
    "fullname": "Pediatric Medical Fellowship",
    "info": "Pediatric medical fellowship.",
    "prereq": []
  },
  {
    "uid": "804275",
    "code": "PED91",
    "subject": "PED",
    "number": "91",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Global Health Track",
    "fullname": "Pediatric Global Health Track",
    "info": "Pediatric Global Health Track.",
    "prereq": []
  }
]