[
  {
    "uid": "006300",
    "code": "PHIL1001",
    "subject": "PHIL",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Logic",
    "fullname": "Introduction to Logic",
    "info": "Sharpen your reasoning skills through a close examination of arguments. Learn formal methods for representing and assessing arguments, including how to represent informal arguments in formal languages, and how to evaluate whether the premises of an argument entail its conclusion.",
    "prereq": []
  },
  {
    "uid": "005117",
    "code": "PHIL1002W",
    "subject": "PHIL",
    "number": "1002",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Philosophy",
    "fullname": "Introduction to Philosophy",
    "info": "Problems, methods, historical/contemporary schools of philosophy.",
    "prereq": []
  },
  {
    "uid": "006379",
    "code": "PHIL1003W",
    "subject": "PHIL",
    "number": "1003",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Ethics",
    "fullname": "Introduction to Ethics",
    "info": "Are values/principles relative to our culture? Is pleasure valuable? Are there any absolute rules? These questions and others are addressed through critical study of moral theories.",
    "prereq": []
  },
  {
    "uid": "005138",
    "code": "PHIL1004W",
    "subject": "PHIL",
    "number": "1004",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Political Philosophy",
    "fullname": "Introduction to Political Philosophy",
    "info": "Government -- what are its purpose; the limits on its authority; its responsibilities to citizens (and vice versa)? What roles do freedom, equality, rights, property, punishment and justice play here? Join in as we discuss and debate competing views.",
    "prereq": []
  },
  {
    "uid": "006388",
    "code": "PHIL1005",
    "subject": "PHIL",
    "number": "1005",
    "honors": false,
    "writingIntensive": false,
    "name": "Scientific Reasoning",
    "fullname": "Scientific Reasoning",
    "info": "How does science work? What is scientific method? How to evaluate scientific information in popular media or specialized publications, especially when it relates to technology used in everyday life? General reasoning skills.prereq: [1st or 2nd] yr student or instr consent",
    "prereq": []
  },
  {
    "uid": "005440",
    "code": "PHIL1006W",
    "subject": "PHIL",
    "number": "1006",
    "honors": false,
    "writingIntensive": true,
    "name": "Phil and Cultural Diversity",
    "fullname": "Philosophy and Cultural Diversity",
    "info": "Central problems/methods of philosophy through culturally diverse texts. Focus is critical/comparative, reflecting range of U.S. philosophical traditions.",
    "prereq": []
  },
  {
    "uid": "005139",
    "code": "PHIL1007",
    "subject": "PHIL",
    "number": "1007",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Pol Phil Prac",
    "fullname": "Introduction to Political Philosophy Practicum",
    "info": "Students do at least two hours a week of community service and connect their service activities in writing to issues discussed in 1004.prereq: concurrent registration is required (or allowed) in  1004W",
    "prereq": {
      "code": "PHIL 1004",
      "subject": "PHIL",
      "id": "1004"
    }
  },
  {
    "uid": "017028",
    "code": "PHIL1021",
    "subject": "PHIL",
    "number": "1021",
    "honors": false,
    "writingIntensive": false,
    "name": "Accel Intro to Logic",
    "fullname": "Accelerated Introduction to Logic",
    "info": "Application of formal techniques for evaluating arguments.",
    "prereq": []
  },
  {
    "uid": "017029",
    "code": "PHIL1026W",
    "subject": "PHIL",
    "number": "1026",
    "honors": false,
    "writingIntensive": true,
    "name": "Phil and Cul Div",
    "fullname": "Philosophy and Cultural Diversity",
    "info": "Central problems/methods of philosophy through culturally diverse texts. Focus is critical/comparative, reflecting a range of U.S. philosophical traditions.",
    "prereq": []
  },
  {
    "uid": "790420",
    "code": "PHIL1102",
    "subject": "PHIL",
    "number": "1102",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Philosophy",
    "fullname": "Introduction to Philosophy",
    "info": "Problems, methods, historical/contemporary schools of philosophy.",
    "prereq": []
  },
  {
    "uid": "790421",
    "code": "PHIL1103",
    "subject": "PHIL",
    "number": "1103",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Ethics",
    "fullname": "Introduction to Ethics",
    "info": "Are values/principles relative to our culture? Is pleasure valuable? Are there any absolute rules? These questions and others are addressed through critical study of moral theories.",
    "prereq": []
  },
  {
    "uid": "818253",
    "code": "PHIL1201",
    "subject": "PHIL",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Reasoning",
    "fullname": "Critical Reasoning",
    "info": "In this course, much of our focus will be on what makes reasoning good or bad. We will learn to suss out bad argumentation, and pinpoint the precise mistake in reasoning that is at fault in particular cases. Patterns will emerge, which will help us learn how to better argue for beliefs that we hold, and claims we take to be true. We will especially focus on developing these skills in various, real-world contexts, so that they can be transferable to your future life, career, and decision-making. To that end, special attention will be paid to the kinds of traps we can fall into when we encounter argumentation via social media. ",
    "prereq": []
  },
  {
    "uid": "817575",
    "code": "PHIL1760",
    "subject": "PHIL",
    "number": "1760",
    "honors": false,
    "writingIntensive": false,
    "name": "Selected Topics in Philosophy",
    "fullname": "Selected Topics in Philosophy",
    "info": "Philosophical topics of contemporary interest. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "793568",
    "code": "PHIL1905",
    "subject": "PHIL",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788182",
    "code": "PHIL1910W",
    "subject": "PHIL",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "817097",
    "code": "PHIL1911W",
    "subject": "PHIL",
    "number": "1911",
    "honors": false,
    "writingIntensive": true,
    "name": "Amadeus: In Search of Mozart",
    "fullname": "Amadeus: In Search of Mozart",
    "info": "Wolfgang Amadeus Mozart is one of the greatest composers in the Western classical canon. He is also the one who seems to have the strongest hold on the modern imagination. This seminar will explore Mozart's life and music through both listening and viewing. Why should anyone today care about music by someone who lived more than 200 years ago? Part of the answer is that this music, like the plays of Shakespeare and the paintings of Rembrandt, is of such greatness and power that every age since has found something in it to value. Mozart is also an intriguing figure for other reasons. What we know about his personality seems wildly at odds with the sublime character of his music. The music itself presents us with a mystery: much of it is so lighthearted that one wonders how it manages to be so profound at the same time. No prior knowledge about music is required, just an open mind.",
    "prereq": []
  },
  {
    "uid": "817014",
    "code": "PHIL1912",
    "subject": "PHIL",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Sports, Reason, and Society",
    "fullname": "Sports, Reason, and Society",
    "info": "Sports constitute both a pervasive institution in our society as well as a source of interesting philosophical issues. In this course we investigate various topics within and related to sports using philosophical and logical methods. Among the topics that we consider are the following: the insights that statistics and inductive logic bring to sports analysis; controversies surrounding performance enhancement, cheating, and the nature of rules; the ethics of sports consumption; and issues related to sex and gender that arise in competition.",
    "prereq": []
  },
  {
    "uid": "817147",
    "code": "PHIL1913",
    "subject": "PHIL",
    "number": "1913",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Ethics",
    "fullname": "Food Ethics",
    "info": "Food is a political and cultural phenomena. We all eat. But does what we eat matter, ethically? Are there some things that it is wrong to eat? Vegetarians and vegans avoid meat and animal products, but is this just a preference? Are animals treated ethically in the global food system? Is there such a thing as ethical meat? Are cultures and workers exploited in these systems? These are some of the questions that we will address using philosophical methods and analysis. Ethical dilemmas and philosophical puzzles are part of our everyday lives, if we stop to consider it. Is it wrong to eat endangered tuna? What if it is likely to go extinct whether you eat it or not? This is a puzzling question to try to answer. We will use conceptual analysis and ethical reasoning to understand the ethical challenges facing us as consumers and as citizens.",
    "prereq": []
  },
  {
    "uid": "817113",
    "code": "PHIL1914",
    "subject": "PHIL",
    "number": "1914",
    "honors": false,
    "writingIntensive": false,
    "name": "Space Time Aristotle-Einstein",
    "fullname": "Space and Time: from Aristotle to Einstein",
    "info": "Space and time belong to those concepts that we all intuitively use to make sense of the world around us. They are also crucial in all of modern science. But modern physics has brought along radical revisions in our view on these concepts. This course will introduce you to these revisions but also raise questions that still remain unestablished. This course will take you through a history of ideas about the nature of space and time ranging from Aristotle and Euclid in the 3rd century BC to Einstein's theory of general relativity, and the Big Bang model and black holes of modern cosmology. Along the way, we will discuss specific questions like: what is the geometry of physical space? Or is the choice of geometry a mere convention? Is space merely a relational notion? Or should we conceive of it as some kind of entity in its own right: as the stage on which the evolution of the universe takes place? How does Einstein's relativity theory change the verdict on these questions? Similar questions will be raised about time. In addition, we will discuss questions like: Is time travel physically possible? Does time have a direction? Do the past, present and future have a different status? And if not, how do we distinguish the past from the future?",
    "prereq": []
  },
  {
    "uid": "817881",
    "code": "PHIL1915",
    "subject": "PHIL",
    "number": "1915",
    "honors": false,
    "writingIntensive": false,
    "name": "The Philosophy of Food",
    "fullname": "The Philosophy of Food: You Are What You Eat... Or Are You?",
    "info": "Food is a central feature of our lives. Not only do we need it to survive, but it is what brings us together. Just think about how many of our daily activities, and important milestones, are centered around food! But, what is food, exactly? Does something have to nourish us, to count as food? Is candy food? What about beer? What is taste? What does it mean to have manners? And why are there so many manners associated with food? What kinds of food should we eat? Is eating foods that are sourced locally really better? Are genetically modified foods bad? What about eating meat? How do we square the ubiquity and importance of food with Western standards of beauty, especially for women? How should food be distributed? What does it say about a culture if foods that are considered bad for us are the only ones that vast segments of the population can afford? These are just some of the questions we will ponder in this freshman seminar.",
    "prereq": []
  },
  {
    "uid": "817904",
    "code": "PHIL1916W",
    "subject": "PHIL",
    "number": "1916",
    "honors": false,
    "writingIntensive": true,
    "name": "Classical Music",
    "fullname": "What's So Great About Classical Music?",
    "info": "Why should anyone today care about classical music? How could music composed ages ago have anything to say to us now? Aren't classical music enthusiasts just a bunch of snobs living in the past? The answers to these questions might surprise you!Many reasons are given for the importance of classical music, but only one matters: that it is, at its best, great art. But why? This seminar will try to answer that question by focusing on the canonical masterpieces as the product of unsurpassed artistic imagination. They are a kind of cinema of the ear? a play of motion, light, and shadow in some ways more vivid than anything presented to the eye. Once you understand this you have a way of getting quickly to the essentials, in which great forces collide, quests are undertaken, new worlds are visited, alien creatures emerge from the depths of the unconscious? and much, much more. All of this will be illustrated by a selection of music from a number of periods, genres and styles extending from the eighteenth century to the middle of the twentieth. You don't need any prior background in classical music for this course?  just bring an open mind.",
    "prereq": []
  },
  {
    "uid": "818852",
    "code": "PHIL1917",
    "subject": "PHIL",
    "number": "1917",
    "honors": false,
    "writingIntensive": false,
    "name": "How Should We Value Persons?",
    "fullname": "How Should We Value Persons?",
    "info": "A capacity for valuing (a capacity for, among other things, effectively responding to the significance of events, actions, or persons) is central to our status as moral beings. Moreover, how well or poorly we value influences the kinds of feelings we warrant in turn. A proper orientation to the value of things and persons likewise is necessary if we are to live good lives. A good life, that is, plausibly requires that we concern ourselves not only with the truth of what we believe and the efficacy of what we do but, also, with the appropriateness of our evaluative attitudes and feelings toward things and persons (including oneself). This class will explore the complexity and moral significance of our modes of valuing persons by introducing and investigating a class of esteem-based, person-focused evaluative attitudes. Paradigms of the class include forms of contempt, shame, pride, and love. Although these attitudes are both commonplace and arguably central to holding others and ourselves accountable to moral ideals, contemporary Anglo-American moral philosophy lacks a systematic account of them as a class.",
    "prereq": []
  },
  {
    "uid": "825135",
    "code": "PHIL1918",
    "subject": "PHIL",
    "number": "1918",
    "honors": false,
    "writingIntensive": false,
    "name": "Comics as Art",
    "fullname": "Comics as Art",
    "info": "In this seminar, we will explore the idea that comics are as legitimate an art form as painting or poetry. We will ask: How do comics differ from other artistic media? How does reading a comic differ from reading poetry or novels? How have comics influenced, and been influenced by, culture and politics? And what, exactly, makes a comic a comic (and not something else)?",
    "prereq": []
  },
  {
    "uid": "825386",
    "code": "PHIL1919",
    "subject": "PHIL",
    "number": "1919",
    "honors": false,
    "writingIntensive": false,
    "name": "Africana Philosophy",
    "fullname": "Africana Philosophy",
    "info": "In this course, we will engage concepts related to Blackness, particularly race, gender, and sexuality. We will investigate them individually then through conversation untangle the ways that they intersect. We will see that Black philosophers reveal an epistemic insight from the ways that they push on the western status quo both rationally and morally. In terms of rationality, Black philosophers propel us to redefine Blackness, sexuality, imperialism, communal care, and whiteness in general. In relation to morality, Black philosophers place us in a tension between the inner and the outer, the individual and the community, the personal and the social; it insists on seriously inquiring into the blame, blameworthiness, and shame that avoids and rejects Black lives, i.e., of the outer, the community, and figure without being on the edges of society. It is at this intersection of the rational and moral in relation to Blacks that a breakdown of singularity creates a new something. I want us to get close to understanding that “new something” by exploring the rational and moral in Black thought.",
    "prereq": []
  },
  {
    "uid": "791464",
    "code": "PHIL1999",
    "subject": "PHIL",
    "number": "1999",
    "honors": false,
    "writingIntensive": false,
    "name": "DANTES: Ethics in America",
    "fullname": "DANTES: \"Ethics in America,\"  SE-474 TestDANTES: Ethics in America",
    "info": "Defense Activity for Non-Traditional Support Subject Standardized Tests Program (DANTES): \"Ethics in America,\"  SE-474 Test.",
    "prereq": []
  },
  {
    "uid": "005443",
    "code": "PHIL3001W",
    "subject": "PHIL",
    "number": "3001",
    "honors": false,
    "writingIntensive": true,
    "name": "History of Phil: Ancient",
    "fullname": "General History of Western Philosophy: Ancient Period",
    "info": "Major developments in ancient Greek philosophic thought: pre-Socrates, Socrates, Plato, Aristotle, Hellenistic thinkers.",
    "prereq": []
  },
  {
    "uid": "005471",
    "code": "PHIL3003",
    "subject": "PHIL",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Medieval Philosophy",
    "fullname": "General History of Western Philosophy: Medieval Period",
    "info": "Survey of several major figures (e.g., Augustine (pre-medieval), Anselm, Maimonides, Aquinas, Ockham, Cusanus).",
    "prereq": []
  },
  {
    "uid": "005442",
    "code": "PHIL3005W",
    "subject": "PHIL",
    "number": "3005",
    "honors": false,
    "writingIntensive": true,
    "name": "History of Philosophy: Modern",
    "fullname": "General History of Western Philosophy: Modern Period",
    "info": "Can anything be known beyond a shadow of a doubt? How ought scientific knowledge be discovered and justified? In what does one's identity as a person consist? How does our human nature affect the way that we conceive of and come to know the world? This course examines the momentous intellectual transformations in Europe during the 17th and 18th centuries that inspired such questions and their innovative solutions.",
    "prereq": []
  },
  {
    "uid": "005473",
    "code": "PHIL3007",
    "subject": "PHIL",
    "number": "3007",
    "honors": false,
    "writingIntensive": false,
    "name": "19th Cent Phil",
    "fullname": "History of Western Philosophy: 19th-Century",
    "info": "Survey of several major figures from 19th century, e.g., Hegel, Schopenhauer, Mill, Kierkegaard, Marx, Nietzsche.  Kant (18th century) is studied as background.",
    "prereq": []
  },
  {
    "uid": "826299",
    "code": "PHIL3009",
    "subject": "PHIL",
    "number": "3009",
    "honors": false,
    "writingIntensive": false,
    "name": "Existentialism",
    "fullname": "Existentialism",
    "info": "What do we mean when we call something \"existential?\"  What do we mean when we speak of an \"existential\" crisis? We seem to mean that our core beliefs and assumptions are affected and the relationship with our environment is ruptured; we have fallen out of normalcy. The term existentialism -- turning existential into a noun -- came into being in the 1940s in France, reflecting the collective experience of societal breakdown, of Nazism, and WW2. It has since been applied to all modes of philosophical inquiry that take an individual's experience of alienation from society as their point of departure. The advantage of making alienation the focus of this class, too, is that it allows us to recognize the precise historical and sociological index of the emergence of an existentialist mode of thought and practice. Existentialism looks very different when it responds to a 19th century crisis of faith (Søren Kierkegaard), to 1950s colonialism (Frantz Fanon), to Weimar Germany's new democracy and the specter of a mass society (Martin Heidegger), or to the neo-authoritarian French society of the 1960s (Simone de Beauvoir). Existentialism then is understood in this class not as a conversation between great thinkers or ideas across time and space, but as a response to a specific crisis of norms and values. It only exists in plural. If existentialist concepts -- like being-in-the world, being-towards-death, or the gaze of the other -- are carried forward, then not without being repurposed. Such situatedness is inherent to existentialism itself. Accordingly, existentialist writers have no creed or ethical stance in common; they are found both on the far (fascist) right and on the Marxist left. They do share though a keen interest in a new language and in literary forms of expression and subsequently, they insist on the individuals' capacity of \"world-making\" -- in rupture and rebellion -- against seemingly compromised societal norms.",
    "prereq": []
  },
  {
    "uid": "017030",
    "code": "PHIL3010W",
    "subject": "PHIL",
    "number": "3010",
    "honors": false,
    "writingIntensive": true,
    "name": "Classical Ancient Text",
    "fullname": "Classical Ancient Text",
    "info": "Introduction to and in-depth analysis of Plato's Republic.",
    "prereq": []
  },
  {
    "uid": "801342",
    "code": "PHIL3100",
    "subject": "PHIL",
    "number": "3100",
    "honors": false,
    "writingIntensive": false,
    "name": "Value Theory Practicum",
    "fullname": "Value Theory Practicum",
    "info": "Combines issues in ethics/political philosophy courses to needs of people in Twin Cities through community service. At least 26 hours of community service for semester is required.prereq: [concurrent registration is required (or allowed) in 3301 or concurrent registration is required (or allowed) in 3302W or concurrent registration is required (or allowed) in 3304 or concurrent registration is required (or allowed) in 3307 or concurrent registration is required (or allowed) in 3308], instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 3301",
          "subject": "PHIL",
          "id": "3301"
        },
        {
          "code": "PHIL 3302W",
          "subject": "PHIL",
          "id": "3302W"
        },
        {
          "code": "PHIL 3304",
          "subject": "PHIL",
          "id": "3304"
        },
        {
          "code": "PHIL 3307",
          "subject": "PHIL",
          "id": "3307"
        },
        {
          "code": "PHIL 3308",
          "subject": "PHIL",
          "id": "3308"
        }
      ]
    }
  },
  {
    "uid": "790422",
    "code": "PHIL3101",
    "subject": "PHIL",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Phil: Ancient",
    "fullname": "General History of Western Philosophy: Ancient Period",
    "info": "Major developments in ancient Greek philosophic thought: pre-Socrates, Socrates, Plato, Aristotle, Hellenistic thinkers.",
    "prereq": []
  },
  {
    "uid": "790423",
    "code": "PHIL3105",
    "subject": "PHIL",
    "number": "3105",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist Phil: Modern",
    "fullname": "General History of Western Philosophy: Modern Period",
    "info": "Major developments in philosophic thought of the modern period: renaissance beginnings, Descartes through Hume. Some attention to Kant.",
    "prereq": []
  },
  {
    "uid": "801952",
    "code": "PHIL3201",
    "subject": "PHIL",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Free Will and Responsibility",
    "fullname": "Free Will and Responsibility",
    "info": "What distinguishes actions from mere happenings? How do we accommodate our conception of ourselves as agents in a world governed by causal laws? Does free action require alternate possibilities? Is free will required to hold people accountable for actions? Conditions of moral responsibility.",
    "prereq": []
  },
  {
    "uid": "005144",
    "code": "PHIL3231",
    "subject": "PHIL",
    "number": "3231",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil and Language",
    "fullname": "Philosophy and Language",
    "info": "Philosophical issues concerning the nature and use of human language.",
    "prereq": []
  },
  {
    "uid": "006671",
    "code": "PHIL3234",
    "subject": "PHIL",
    "number": "3234",
    "honors": false,
    "writingIntensive": false,
    "name": "Knowledge & Society",
    "fullname": "Knowledge and Society",
    "info": "Critical discussion of concepts such as knowledge, objectivity, justification, rationality, evidence, authority, expertise, and trust in relation to the norms and privileges of gender, race, class, and other social categories.",
    "prereq": []
  },
  {
    "uid": "790179",
    "code": "PHIL3301",
    "subject": "PHIL",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Environmental Ethics",
    "fullname": "Environmental Ethics",
    "info": "Philosophical basis for membership in moral community. Theories applied to specific problems (e.g., vegetarianism, wilderness preservation). Students defend their own reasoned views about moral relations between humans, animals, and nature.",
    "prereq": []
  },
  {
    "uid": "005152",
    "code": "PHIL3302W",
    "subject": "PHIL",
    "number": "3302",
    "honors": false,
    "writingIntensive": true,
    "name": "Moral Probs:Contemp Society",
    "fullname": "Moral Problems of Contemporary Society",
    "info": "How do we determine what is right and wrong? How should we live our lives? What do we owe others? Moral/ethical thought applied to problems and public disputes (e.g., capital punishment, abortion, affirmative action, animal rights, same-sex marriage, environmental protection).",
    "prereq": []
  },
  {
    "uid": "790180",
    "code": "PHIL3303W",
    "subject": "PHIL",
    "number": "3303",
    "honors": false,
    "writingIntensive": true,
    "name": "Business Ethics",
    "fullname": "Business Ethics",
    "info": "The course offers a comprehensive overview of ethical questions that arise in the context of doing business, including questions regarding what duties companies have to consumers and the general public, and what the moral obligations businesses have to employees and shareholders.",
    "prereq": []
  },
  {
    "uid": "006384",
    "code": "PHIL3304",
    "subject": "PHIL",
    "number": "3304",
    "honors": false,
    "writingIntensive": false,
    "name": "Law and Morality",
    "fullname": "Law and Morality",
    "info": "What is law? Must true laws be just? When (if ever) are civil disobedience or legal punishment morally justified? Do good laws incorporate (or legislate) morality? Consider and debate these issues using philosophical texts, case law, and the occasional novel.",
    "prereq": []
  },
  {
    "uid": "005482",
    "code": "PHIL3305",
    "subject": "PHIL",
    "number": "3305",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Ethics",
    "fullname": "Medical Ethics",
    "info": "Moral problems confronting physicians, patients, and others concerned with medical treatment, research, and public health policy. Topics include abortion, living wills, euthanasia, genetic engineering, informed consent, proxy decision-making, and allocation of medical resources.",
    "prereq": []
  },
  {
    "uid": "006312",
    "code": "PHIL3307",
    "subject": "PHIL",
    "number": "3307",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Just & Com Ser",
    "fullname": "Social Justice and Community Service",
    "info": "Exploration of concepts of justice, charity, equality, freedom, community service in connection with current social issues. Perspectives from philosophy, history, literature, and student involvement in the community. Community service for at least three hours per week.",
    "prereq": []
  },
  {
    "uid": "006357",
    "code": "PHIL3308",
    "subject": "PHIL",
    "number": "3308",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Just & Com Serv",
    "fullname": "Social Justice and Community Service",
    "info": "Special exploration of diversity in connection with concepts of justice, charity, equality, freedom, community service. Perspectives from philosophy, history, literature, and student involvement in the community. Community service for at least three hours per week. Students may enroll in this course without having taken 3307.",
    "prereq": []
  },
  {
    "uid": "006984",
    "code": "PHIL3311W",
    "subject": "PHIL",
    "number": "3311",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Ethical Th",
    "fullname": "Introduction to Ethical Theory",
    "info": "Nature and justification of moral judgments and moral principles; analysis of representative moral views.",
    "prereq": []
  },
  {
    "uid": "017031",
    "code": "PHIL3322W",
    "subject": "PHIL",
    "number": "3322",
    "honors": false,
    "writingIntensive": true,
    "name": "Moral Probs:Contemp Society",
    "fullname": "Moral Problems of Contemporary Society",
    "info": "How do we determine what is right and wrong? How should we live our lives? What do we owe others? Moral/ethical thought applied to problems and public disputes (e.g., capital punishment, abortion, affirmative action, animal rights, same-sex marriage, environmental protection).",
    "prereq": []
  },
  {
    "uid": "790424",
    "code": "PHIL3402",
    "subject": "PHIL",
    "number": "3402",
    "honors": false,
    "writingIntensive": false,
    "name": "Moral Probs:Contemp Society",
    "fullname": "Moral Problems of Contemporary Society",
    "info": "How do we determine what is right and wrong? How should we live our lives? What do we owe others? Moral/ethical thought applied to problems and public disputes (e.g., capital punishment, abortion, affirmative action, animal rights, same-sex marriage, environmental protection).",
    "prereq": []
  },
  {
    "uid": "005448",
    "code": "PHIL3502W",
    "subject": "PHIL",
    "number": "3502",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro to Aesthetics",
    "fullname": "Introduction to Aesthetics",
    "info": "Development of aesthetic theories with applications to specific aesthetic problems.",
    "prereq": []
  },
  {
    "uid": "006362",
    "code": "PHIL3521",
    "subject": "PHIL",
    "number": "3521",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophy of Religion",
    "fullname": "Philosophy of Religion",
    "info": "Conceptual problems that arise from attempts to provide rational justification for religious belief.",
    "prereq": []
  },
  {
    "uid": "006465",
    "code": "PHIL3601W",
    "subject": "PHIL",
    "number": "3601",
    "honors": false,
    "writingIntensive": true,
    "name": "Scientific Thought",
    "fullname": "Scientific Thought",
    "info": "Science influences us daily, shaping how we understand ourselves and interpret nature. This course is an introduction to how scientists reason about the world, what that means for our lives, and the status of science as a human activity. What is science and what’s so great about it? Is science the ultimate authority on the world and our place in it? This course examines the authority of science, how scientists reason, and science’s status as a human activity. prereq: One course in philosophy or natural science",
    "prereq": []
  },
  {
    "uid": "788183",
    "code": "PHIL3602",
    "subject": "PHIL",
    "number": "3602",
    "honors": false,
    "writingIntensive": false,
    "name": "Science, Tech, and Society",
    "fullname": "Science, Technology, and Society",
    "info": "Philosophical issues that arise out of interaction between science, technology, society (e.g., religion and science, genetics and society, science and the environment).",
    "prereq": []
  },
  {
    "uid": "818596",
    "code": "PHIL3605",
    "subject": "PHIL",
    "number": "3605",
    "honors": false,
    "writingIntensive": false,
    "name": "Conceptual Issues in Medicine",
    "fullname": "Disease, Diagnosis, and Intervention: Conceptual Issues in Medicine",
    "info": "Contemporary medicine dominates our daily concerns and societal conversation. From insurance coverage to the consumer advertising of pharmaceuticals, the variety of issues and their visibility is patently obvious. However, conceptual issues in medicine, such as what counts as health and disease or what do we mean by \"evidence-based\" or \"precision\" medicine, are arguably just as important--if not prior to--many of these other issues. For example, if doctors do not consider something an \"official\" disease or condition, it is unlikely your insurance company will pay to treat it. Additional conceptual questions include: what role do theories play in medicine? Can scientific experiments be replicated in clinical medicine? Should all medicine be based on evidence? How do we know what causes health or disease? What do advances in neuroscience reveal about the relationship between mind and body, especially with respect to mental health and illness? What properties do physicians measure and why? How does probability and chance enter into medical practice (e.g., diagnosis, therapy, and rehabilitation)?This course is an introduction to these and other related issues in medicine with an emphasis on their diversity and heterogeneity. It is designed for undergraduates across a variety of majors with an interest in these conceptual questions, including but not limited to Animal Science; Anthropology; Biochemistry; Biology, Society and Environment; Chemistry; Ecology, Evolution and Behavior; Genetics, Cell Biology and Development; Microbiology; Neuroscience; Physiology; Psychology). No prior knowledge of medicine or philosophy is required; I do not assume that you have any previous exposure to the material we will be covering.Most of the assignments for this course are writing oriented. The goal is to identify, characterize, and critically reflect on the issues raised in our discussions and do this in the medium of writing. At the end of the class you will possess new analytical skills and recognize the value of philosophical investigation into the medical concepts and practices, including its application to your everyday life. Additionally, it is directly relevant to the Critical Analysis and Reasoning Skills portion of the MCAT.",
    "prereq": []
  },
  {
    "uid": "006474",
    "code": "PHIL3607",
    "subject": "PHIL",
    "number": "3607",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophy of Psychology",
    "fullname": "Philosophy of Psychology",
    "info": "What are minds and mental states (like desires and beliefs)? How are these different from brains and brain states? Should scientific explanation abandon any appeal to the mental (like behaviorism) or can we offer a scientific account of mind?prereq: One course in philosophy or psychology",
    "prereq": []
  },
  {
    "uid": "826287",
    "code": "PHIL3760",
    "subject": "PHIL",
    "number": "3760",
    "honors": false,
    "writingIntensive": false,
    "name": "Selected Topics in Philosophy",
    "fullname": "Selected Topics in Philosophy",
    "info": "Philosophical problems of contemporary interest. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "818530",
    "code": "PHIL3896",
    "subject": "PHIL",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": []
  },
  {
    "uid": "007214",
    "code": "PHIL3910W",
    "subject": "PHIL",
    "number": "3910",
    "honors": false,
    "writingIntensive": true,
    "name": "Major Seminar",
    "fullname": "Major Seminar",
    "info": "Development and presentation of the major project.",
    "prereq": []
  },
  {
    "uid": "007213",
    "code": "PHIL3993",
    "subject": "PHIL",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study.Prereq instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "005474",
    "code": "PHIL4008",
    "subject": "PHIL",
    "number": "4008",
    "honors": false,
    "writingIntensive": false,
    "name": "Surv Contemp Phil",
    "fullname": "Survey of Contemporary Philosophy",
    "info": "Survey of major figures in contemporary analytic/phenomenological philosophy (e.g., Dewey, Russell, Wittgenstein, Heidegger, Carnap, de Beauvoir).",
    "prereq": []
  },
  {
    "uid": "005475",
    "code": "PHIL4009",
    "subject": "PHIL",
    "number": "4009",
    "honors": false,
    "writingIntensive": false,
    "name": "Existentialism",
    "fullname": "Existentialism",
    "info": "Existentialism as a French philosophical and artistic movement of the mid-twentieth century, is commonly associated with Jean-Paul Sartre, Albert Camus, or Simone de Beauvoir. Only in retrospect did it become transnational, dating back to at least the 19th century--Søren Kierkegaard and Friedrich Nietzsche--and comprising figures like Martin Heidegger, Hannah Arendt, Ayn Rand, Silvia Plath, or Franz Fanon. This list already makes it a hard to define a creed or an ethical or political commitment that these writers have in common. What then will allow us to call them existentialist? To begin with, it is perhaps the focus on individual experience, on the experience of finitude, a heightened awareness of the individual's embeddedness in a here and now and a quest for the possibility of an unalienated life. Such concerns cannot easily be expressed through a systematic philosophy, a set of definitions and principles that can be passed on. Instead literary writing became a form of philosophical inquiry. Further, how these concerns could lend themselves to the most revolutionary as well as the most conservative, even Fascist politics, will be one of the puzzles we will seek to answer in this course. We will engage with a number of canonical existentialist texts and trace what defines Existentialism as a key mode of modern philosophizing.",
    "prereq": []
  },
  {
    "uid": "005463",
    "code": "PHIL4010",
    "subject": "PHIL",
    "number": "4010",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Philosophers",
    "fullname": "Ancient Philosophers",
    "info": "Major work of selected ancient philosophers (e.g., Plato's Parmenides, Plato's Sophist, Aristotle's Metaphysics). Works discussed may vary from offering to offering.prereq: 3001 or instr consent",
    "prereq": {
      "code": "PHIL 3001",
      "subject": "PHIL",
      "id": "3001"
    }
  },
  {
    "uid": "005464",
    "code": "PHIL4030",
    "subject": "PHIL",
    "number": "4030",
    "honors": false,
    "writingIntensive": false,
    "name": "Medieval Philosophers",
    "fullname": "Medieval Philosophers",
    "info": "Major work of selected medieval philosophers (e.g., Anselm's Proslogion, Aquinas's Summa contra Gentiles, Books I/II, Nicholas of Cusa's On Learned Ignorance). Works discussed may vary from offering to offering.",
    "prereq": []
  },
  {
    "uid": "005465",
    "code": "PHIL4040",
    "subject": "PHIL",
    "number": "4040",
    "honors": false,
    "writingIntensive": false,
    "name": "Rationalists",
    "fullname": "Rationalists",
    "info": "Major work of selected early modern rationalists (e.g., Descartes' Principles of Philosophy, Spinoza's Ethics, Conway's Principles of the Most Ancient and Modern Philosophy, Leibniz's Discourse on Metaphysics). Works discussed may vary from offering to offering.",
    "prereq": []
  },
  {
    "uid": "005466",
    "code": "PHIL4050",
    "subject": "PHIL",
    "number": "4050",
    "honors": false,
    "writingIntensive": false,
    "name": "Empiricists",
    "fullname": "Empiricists",
    "info": "Major work of selected early modern empiricists (e.g., Locke's Essay Concerning Human Understanding, Berkeley's Principles of Human Knowledge, Hume's Treatise of Human Nature). Works discussed may vary from offering to offering.",
    "prereq": []
  },
  {
    "uid": "005468",
    "code": "PHIL4055",
    "subject": "PHIL",
    "number": "4055",
    "honors": false,
    "writingIntensive": false,
    "name": "Kant",
    "fullname": "Kant",
    "info": "Immanuel Kant has long been recognized as a particularly systematic thinker, one who wrote foundational texts in epistemology, metaphysics, ethics, politics, aesthetics, religion, teleology, and anthropology, which still resonate and influence contemporary thought. This course studies the wide breadth of Kant's philosophical system, paying especial attention to its relevance today.prereq: 3005 or 4004 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 3005",
          "subject": "PHIL",
          "id": "3005"
        },
        {
          "code": "PHIL 4004",
          "subject": "PHIL",
          "id": "4004"
        }
      ]
    }
  },
  {
    "uid": "005469",
    "code": "PHIL4070",
    "subject": "PHIL",
    "number": "4070",
    "honors": false,
    "writingIntensive": false,
    "name": "19th- 20th Century  Philosophy",
    "fullname": "Selected 19th- or Early to Middle 20th-Century Philosophy",
    "info": "Major writings of selected 19th- or early to middle 20th-century philosopher (e.g., Schopenhauer's World as Will and Idea, Thoreau's Walden, Du Bois's The Souls of Black Folk, Wittgenstein's Philosophical Investigations, de Beauvoir's The Second Sex).prereq: One sem history of philosophy",
    "prereq": []
  },
  {
    "uid": "005470",
    "code": "PHIL4085",
    "subject": "PHIL",
    "number": "4085",
    "honors": false,
    "writingIntensive": false,
    "name": "Wittgenstein",
    "fullname": "Wittgenstein",
    "info": "In \"Philosophical Investigations\" Wittgenstein challenged some of the most long-standing and entrenched intuitions of philosophers -- basic intuitions about mind, rationality, linguistic understanding, and the very nature of philosophical/conceptual inquiry.  Many of these intuitions remain entrenched and Wittgenstein's challenge is as relevant today as it was in 1950.  In Phil 4805 we examine the text and the secondary literature, and do so in the light of issues and debates that continue to demand attention.",
    "prereq": []
  },
  {
    "uid": "801344",
    "code": "PHIL4100",
    "subject": "PHIL",
    "number": "4100",
    "honors": false,
    "writingIntensive": false,
    "name": "Value Theory Practicum",
    "fullname": "Value Theory Practicum",
    "info": "Issues studied in ethics/political philosophy courses applied to needs of people in Twin Cities through community service. At least 26 hours of community service for semester is required.prereq: [concurrent registration is required (or allowed) in 4320 or concurrent registration is required (or allowed) in 4321 or or concurrent registration is required (or allowed) in 4330 or concurrent registration is required (or allowed) in 4324 or concurrent registration is required (or allowed) in 4414], instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 4320",
          "subject": "PHIL",
          "id": "4320"
        },
        {
          "code": "PHIL 4321",
          "subject": "PHIL",
          "id": "4321"
        },
        {
          "code": "PHIL 4330",
          "subject": "PHIL",
          "id": "4330"
        },
        {
          "code": "PHIL 4324",
          "subject": "PHIL",
          "id": "4324"
        },
        {
          "code": "PHIL 4414",
          "subject": "PHIL",
          "id": "4414"
        }
      ]
    }
  },
  {
    "uid": "006359",
    "code": "PHIL4101",
    "subject": "PHIL",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Metaphysics",
    "fullname": "Metaphysics",
    "info": "Broadly speaking, metaphysics is the study of the nature of reality.  Metaphysical questions include questions about what kinds of things exist, what is the nature of things, what are persons, what is possible or impossible, what is the nature of time, what is causality, and many other fundamental questions about the world.  The aim of this course is to introduce students to some of the central questions of metaphysics to investigate some of their answers. prereq: One course in history of philosophy or instr consent",
    "prereq": []
  },
  {
    "uid": "790425",
    "code": "PHIL4104",
    "subject": "PHIL",
    "number": "4104",
    "honors": false,
    "writingIntensive": false,
    "name": "19th Cent Phil",
    "fullname": "Nineteenth Century Philosophy",
    "info": "Survey of several major figures from 19th century (e.g., Hegel, Schopenhauer, Mill, Kierkegaard, Marx, Nietzsche).",
    "prereq": []
  },
  {
    "uid": "005142",
    "code": "PHIL4105W",
    "subject": "PHIL",
    "number": "4105",
    "honors": false,
    "writingIntensive": true,
    "name": "Epistemology",
    "fullname": "Epistemology",
    "info": "Epistemology is the study of knowledge. Epistemological questions include questions about the nature of knowledge, the difference between knowledge and true belief, the nature of justification, and the structure of our knowledge about the world. Epistemology is also centrally concerned with understanding and responding to arguments for skepticism, the view that we do not know anything about the world around us. The aim of this course is to introduce students to the some of the main problems of epistemology and to investigate some of their solutions. prereq: 1001 or instr consent",
    "prereq": {
      "code": "PHIL 1001",
      "subject": "PHIL",
      "id": "1001"
    }
  },
  {
    "uid": "790426",
    "code": "PHIL4109",
    "subject": "PHIL",
    "number": "4109",
    "honors": false,
    "writingIntensive": false,
    "name": "Existentialism",
    "fullname": "Existentialism",
    "info": "Central themes (e.g., being-in-the-world, freedom, engagement) of several important existentialist thinkers (e.g., Kierkegaard, Jaspers, Sartre, de Beauvoir, Baldwin).",
    "prereq": []
  },
  {
    "uid": "006361",
    "code": "PHIL4231",
    "subject": "PHIL",
    "number": "4231",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophy of Language",
    "fullname": "Philosophy of Language",
    "info": "Theories of reference, linguistic truth, relation of language/thought, translation/synonymy.prereq: 1001 or 5201 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 1001",
          "subject": "PHIL",
          "id": "1001"
        },
        {
          "code": "PHIL 5201",
          "subject": "PHIL",
          "id": "5201"
        }
      ]
    }
  },
  {
    "uid": "006990",
    "code": "PHIL4311W",
    "subject": "PHIL",
    "number": "4311",
    "honors": false,
    "writingIntensive": true,
    "name": "History of Moral Theories",
    "fullname": "History of Moral Theories",
    "info": "Is human nature fundamentally selfish or are we sympathetic creatures? What is free will and do we have it? Do moral principles have a rational basis or are our moral judgments expressions of feelings? Should morality be thought of in terms of acting on principle or producing good outcomes? We will focus on these and other questions as they are explored in primary texts from the early modern history of western philosophy. prereq: 1003 or instr consent",
    "prereq": {
      "code": "PHIL 1003",
      "subject": "PHIL",
      "id": "1003"
    }
  },
  {
    "uid": "006375",
    "code": "PHIL4320",
    "subject": "PHIL",
    "number": "4320",
    "honors": false,
    "writingIntensive": false,
    "name": "Historical Moral Theory",
    "fullname": "Intensive Study of a Historical Moral Theory",
    "info": "Intensive consideration of an author or theory in the history of moral or political philosophy.prereq: 1003 or instr consent",
    "prereq": {
      "code": "PHIL 1003",
      "subject": "PHIL",
      "id": "1003"
    }
  },
  {
    "uid": "006991",
    "code": "PHIL4321W",
    "subject": "PHIL",
    "number": "4321",
    "honors": false,
    "writingIntensive": true,
    "name": "Theories of Justice",
    "fullname": "Theories of Justice",
    "info": "What is justice, understood as a central virtue of our social (e.g., political and legal) institutions?  What does justice require in the political realm and what kind of state is best suited to achieve it?  Ideally, what image of the just state should regulate our behavior? How do the requirements of justice change, if they do, in non-ideal circumstances, such as in cases of noncompliance with the law or in the context of violent conflict (e.g., in war)?This course is intended to provide upper-level undergraduates and philosophy graduate students with a selective survey of important work in contemporary theory of justice that addresses such questions.prereq: 1003 or 1004 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 1003",
          "subject": "PHIL",
          "id": "1003"
        },
        {
          "code": "PHIL 1004",
          "subject": "PHIL",
          "id": "1004"
        }
      ]
    }
  },
  {
    "uid": "006358",
    "code": "PHIL4324",
    "subject": "PHIL",
    "number": "4324",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics and Educ",
    "fullname": "Ethics and Education",
    "info": "What constitutes good education, both in terms of educational outcomes and of processes that promote learning? What connections are there between concepts of good education and of good society?",
    "prereq": []
  },
  {
    "uid": "013592",
    "code": "PHIL4325",
    "subject": "PHIL",
    "number": "4325",
    "honors": false,
    "writingIntensive": false,
    "name": "Ed and Soc Change",
    "fullname": "Education and Social Change",
    "info": "Connections between education, social change. Theories of democratic/popular education, their application through in-depth practicum in community education setting.",
    "prereq": []
  },
  {
    "uid": "791058",
    "code": "PHIL4326",
    "subject": "PHIL",
    "number": "4326",
    "honors": false,
    "writingIntensive": false,
    "name": "Lives Worth Living",
    "fullname": "Lives Worth Living: Questions of Self, Vocation, and Community",
    "info": "Immersion experience. Students live together as a residential community of learners. Works of philosophy, history, and literature form backdrop for exploring such questions as \\\"How is identity constructed?,\\\" \\\"What is vocation?,\\\" and \\\"What experiences of community are desirable in a life?\\\" Each student creates a life-hypothesis for a life worth living.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "006993",
    "code": "PHIL4331",
    "subject": "PHIL",
    "number": "4331",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemp Moral Theories",
    "fullname": "Contemporary Moral Theories",
    "info": "Is morality objective, just a matter of feeling, or something in between? How do we know even the most basic of moral truths? Do I always have a reason to do what is moral? What motivates people to be moral and why do some people behave immorally? This class looks at these and related questions in metaethics, moral psychology, and other areas of contemporary moral theory. prereq: 1003 or instr consent",
    "prereq": {
      "code": "PHIL 1003",
      "subject": "PHIL",
      "id": "1003"
    }
  },
  {
    "uid": "803496",
    "code": "PHIL4350",
    "subject": "PHIL",
    "number": "4350",
    "honors": false,
    "writingIntensive": false,
    "name": "Catching Lives Worth Living",
    "fullname": "Catching Lives Worth Living: Participation in the Growth of a Living-Learning Community",
    "info": "Involvement in a democratic living-learning community built by students/instructors. Students participate in community activities and daily instructor meetings. Four seven-day offerings each summer.\n\nprereq: Application, instr consent",
    "prereq": []
  },
  {
    "uid": "006376",
    "code": "PHIL4414",
    "subject": "PHIL",
    "number": "4414",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Phil",
    "fullname": "Political Philosophy",
    "info": "Survey of historical/contemporary works in political philosophy.prereq: 1004 or instr consent",
    "prereq": {
      "code": "PHIL 1004",
      "subject": "PHIL",
      "id": "1004"
    }
  },
  {
    "uid": "005477",
    "code": "PHIL4501",
    "subject": "PHIL",
    "number": "4501",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Aesth",
    "fullname": "Principles of Aesthetics",
    "info": "Problems arising in attempts to identify, characterize, or evaluate art.prereq: 3502 or philosophy course or instr consent",
    "prereq": {
      "code": "PHIL 3502",
      "subject": "PHIL",
      "id": "3502"
    }
  },
  {
    "uid": "005478",
    "code": "PHIL4510",
    "subject": "PHIL",
    "number": "4510",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil of Indiv Arts",
    "fullname": "Philosophy of the Individual Arts",
    "info": "Aesthetic problems that arise in studying or practicing an art.prereq: 3502",
    "prereq": {
      "code": "PHIL 3502",
      "subject": "PHIL",
      "id": "3502"
    }
  },
  {
    "uid": "006478",
    "code": "PHIL4605",
    "subject": "PHIL",
    "number": "4605",
    "honors": false,
    "writingIntensive": false,
    "name": "Space and Time",
    "fullname": "Space and Time",
    "info": "Philosophical problems concerning nature/structure of space, time, and space-time.prereq: Courses in [philosophy or physics] or instr consent",
    "prereq": []
  },
  {
    "uid": "006483",
    "code": "PHIL4607",
    "subject": "PHIL",
    "number": "4607",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophy of Biol Sciences",
    "fullname": "Philosophy of the Biological Sciences",
    "info": "Biology dominates the landscape of contemporary scientific research, and yet \"biology\" consists of a variety of different disciplinary approaches: from protein biochemistry to field ecology, from developmental biology to evolutionary genetics. Many philosophical issues can be found in the concepts and practices of life science researchers from these different disciplines. What is the structure of evolutionary theory? What is a gene? What are the units of selection? What is an individual? What counts as a \"cause\"? What is the relationship between evolution and development? Are all biological phenomena reducible to genes or molecules? What are adaptations, and how do we identify them? What is an ecological niche? Is there a progressive trend in the history of life? Is there such a thing as 'human nature'? This course is an introduction to these and other related issues in the biological sciences with an emphasis on their diversity and heterogeneity. It is designed for advanced undergraduates with an interest in conceptual questions and debates in biology that are manifested across a variety of majors (e.g., animal science; anthropology; biochemistry; biology, society and environment; biosystems and agricultural engineering; chemistry; ecology, evolution and behavior; genetics, cell biology and development; microbiology; neuroscience; physiology; plant biology; psychology). Some of these issues will appear familiar from previous coursework or opportunities, whereas new issues will be intriguing because of their similarities and differences with those that have been encountered in other contexts.",
    "prereq": []
  },
  {
    "uid": "006488",
    "code": "PHIL4611",
    "subject": "PHIL",
    "number": "4611",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil Soc Sciences",
    "fullname": "Philosophy of the Social Sciences",
    "info": "Criteria for describing/explaining human actions. Problems of objectivity, reduction, freedom.",
    "prereq": []
  },
  {
    "uid": "006496",
    "code": "PHIL4614",
    "subject": "PHIL",
    "number": "4614",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil of Psychology",
    "fullname": "Philosophy of Psychology",
    "info": "Problems/prospects in recent developments in psychology, cognitive science, and philosophy of mind.",
    "prereq": []
  },
  {
    "uid": "006498",
    "code": "PHIL4615",
    "subject": "PHIL",
    "number": "4615",
    "honors": false,
    "writingIntensive": false,
    "name": "Minds, Bodies, and Machines",
    "fullname": "Minds, Bodies, and Machines",
    "info": "Mind-body problem. Philosophical relevance of cybernetics, artificial intelligence, computer simulation.Mental phenomena present the philosopher with a number of deep but inescapable puzzles and challenges.  We tend to suppose that we know what it is to have a mind, to have beliefs, desires, etc., and we think that we know how to explain our own behavior and that of others -- and all of this without any formal training in the relevant science.  All of this is surely amazing; indeed it verges on the outrageous.  We admit to not knowing the makeup of the simplest structures, to not knowing how to explain the behavior of the simplest organisms -- we, OF COURSE, leave such issues to scientific investigation. Yet, at the same time, we think we know how to explain the behavior of this most complex of systems; we know how to do it, and we know what we are talking about when we explain behavior by citing the relevant beliefs, desires, etc. And, to repeat, we know all of this with no formal training.  Strange indeed.  Not only is this initial confidence puzzling, but attempts to articulate the mental story and to integrate it into the larger scientific picture have all proven problematical.   We start our investigation with a very brief glance at a mid-century proposal that initiated a very different way of thinking about mind: the proposal by Turing -- one of the great minds of the 20th Century--that machines of a certain kind could exhibit intelligence. A story told in part in the recent movie, The Imitation Game. We then turn to some more traditional approaches to mind: Cartesianism, Behaviorism and Materialism. prereq: one course in philosophy or instr consent",
    "prereq": []
  },
  {
    "uid": "006363",
    "code": "PHIL4622",
    "subject": "PHIL",
    "number": "4622",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophy & Feminist Theory",
    "fullname": "Philosophy and Feminist Theory",
    "info": "Encounters between philosophy/feminism. Gender's influence in traditional philosophical problems/methods. Social role of theorist/theorizing as they relate to politics of feminism. This course surveys central debates in feminist philosophy, with a focus on the methods and virtues of resistance. Along the way, we will consider the question of how we should live in an oppressive society. Topics may include intimidation, gaslighting, silencing, epistemic injustice, emotional labor, intersectionality, resistance, anger and violence. prereq: 8 crs in [philosophy or women's studies] or instr consent",
    "prereq": []
  },
  {
    "uid": "007210",
    "code": "PHIL4760",
    "subject": "PHIL",
    "number": "4760",
    "honors": false,
    "writingIntensive": false,
    "name": "Selected Topics in Philosophy",
    "fullname": "Selected Topics in Philosophy",
    "info": "Philosophical problems of contemporary interest. Topics specified in Class Schedule.\n\nprereq: 3 [3xxx-5xxx] cr in philosophy or instr consent",
    "prereq": []
  },
  {
    "uid": "825625",
    "code": "PHIL4888",
    "subject": "PHIL",
    "number": "4888",
    "honors": false,
    "writingIntensive": false,
    "name": "Senior Capstone",
    "fullname": "Philosophy Senior Capstone",
    "info": "The Philosophy capstone course culminates students' work in the major. It offers the opportunity to engage and combine skills in analysis, critical thought and clear and cogent expression developed throughout the course of undergraduate work in philosophy.  Students will identify a provisional paper or paper topic prior to enrolling in the capstone course and will spend the semester writing, expanding, and revising this paper under the supervision of the faculty teaching the capstone.  The capstone course will incorporate career readiness elements, and overall will strive to provide students with a culminating shared experience as Philosophy majors.  ",
    "prereq": []
  },
  {
    "uid": "800026",
    "code": "PHIL4893",
    "subject": "PHIL",
    "number": "4893",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone: Directed Studies",
    "fullname": "Capstone: Directed Studies",
    "info": "Guided individual study leading to research paper that satisfies senior capstone requirement. Students enrolling in this directed study/research course will complete the Philosophy Senior Capstone: Directed Study contract form with a faculty mentor. The faculty member will ensure academic standards are upheld, including: - the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project. - the project scope is reasonable (42 hours of work per credit) - the faculty mentor is qualified to serve in this role - assessment of student learning and grading criteria are clear and appropriate - the student will be working in a respectful, inclusive environment. The contract will include the learning objectives for the course, the methods that will be employed, and how assessment will be conducted by the faculty mentor. The contract must be approved by the department academic approver before the student can register. prereq: instr consent, dept consent",
    "prereq": []
  },
  {
    "uid": "007212",
    "code": "PHIL4993",
    "subject": "PHIL",
    "number": "4993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study.Prereq instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "820550",
    "code": "PHIL5009",
    "subject": "PHIL",
    "number": "5009",
    "honors": false,
    "writingIntensive": false,
    "name": "Existentialism",
    "fullname": "Existentialism",
    "info": "Existentialism as a French philosophical and artistic movement of the mid-twentieth century, is commonly associated with Jean-Paul Sartre, Albert Camus, or Simone de Beauvoir. Only in retrospect did it become transnational, dating back to at least the 19th century--Søren Kierkegaard and Friedrich Nietzsche--and comprising figures like Martin Heidegger, Hannah Arendt, Ayn Rand, Silvia Plath, or Franz Fanon. This list already makes it a hard to define a creed or an ethical or political commitment that these writers have in common. What then will allow us to call them existentialist? To begin with, it is perhaps the focus on individual experience, on the experience of finitude, a heightened awareness of the individual's embeddedness in a here and now, and a quest for the possibility of an unalienated life. Such concerns cannot easily be expressed through a systematic philosophy, a set of definitions and principles that can be passed on. Instead literary writing became a form of philosophical inquiry. Further, how these concerns could lend themselves to the most revolutionary as well as the most conservative, even Fascist politics, will be one of the puzzles we will seek to answer in this course. We will engage with a number of canonical existentialist texts and trace what defines Existentialism as a key mode of modern philosophizing.",
    "prereq": []
  },
  {
    "uid": "808476",
    "code": "PHIL5010",
    "subject": "PHIL",
    "number": "5010",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Philosophers",
    "fullname": "Ancient Philosophers",
    "info": "Major work of selected ancient philosophers (e.g., Plato's Parmenides, Plato's Sophist, Aristotle's Metaphysics). Works discussed vary.prereq: 3001 or instr consent",
    "prereq": {
      "code": "PHIL 3001",
      "subject": "PHIL",
      "id": "3001"
    }
  },
  {
    "uid": "798756",
    "code": "PHIL5040",
    "subject": "PHIL",
    "number": "5040",
    "honors": false,
    "writingIntensive": false,
    "name": "Rationalists",
    "fullname": "Rationalists",
    "info": "Major work of selected early modern rationalists (e.g., Descartes' Principles of Philosophy, Spinoza's Ethics, Conway's Principles of the Most Ancient and Modern Philosophy, Leibniz's Discourse on Metaphysics). Works discussed may vary from offering to offering.",
    "prereq": []
  },
  {
    "uid": "798757",
    "code": "PHIL5050",
    "subject": "PHIL",
    "number": "5050",
    "honors": false,
    "writingIntensive": false,
    "name": "Empiricists",
    "fullname": "Empiricists",
    "info": "Major work of selected early modern empiricists (e.g., Locke's Essay Concerning Human Understanding, Berkeley's Principles of Human Knowledge, Hume's Treatise of Human Nature). Works discussed may vary from offering to offering.prereq: 3005 or instr consent",
    "prereq": {
      "code": "PHIL 3005",
      "subject": "PHIL",
      "id": "3005"
    }
  },
  {
    "uid": "825137",
    "code": "PHIL5055",
    "subject": "PHIL",
    "number": "5055",
    "honors": false,
    "writingIntensive": false,
    "name": "Kant",
    "fullname": "Kant",
    "info": "Immanuel Kant has long been recognized as a particularly systematic thinker, one who wrote foundational texts in epistemology, metaphysics, ethics, politics, aesthetics, religion, teleology, and anthropology, which still resonate and influence contemporary thought. This course studies the wide breadth of Kant's philosophical system, paying especial attention to its relevance today.prereq: 3005 or 4004 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 3005",
          "subject": "PHIL",
          "id": "3005"
        },
        {
          "code": "PHIL 4004",
          "subject": "PHIL",
          "id": "4004"
        }
      ]
    }
  },
  {
    "uid": "800563",
    "code": "PHIL5085",
    "subject": "PHIL",
    "number": "5085",
    "honors": false,
    "writingIntensive": false,
    "name": "Wittgenstein",
    "fullname": "Wittgenstein",
    "info": "In \"Philosophical Investigations\" Wittgenstein challenged some of the most long-standing and entrenched intuitions of philosophers -- basic intuitions about mind, rationality, linguistic understanding, and the very nature of philosophical/conceptual inquiry. Many of these intuitions remain entrenched, and Wittgenstein's challenge is as relevant today as it was in 1950. In Phil 4805 we examine the text and the secondary literature, and do so in the light of issues and debates that continue to demand attention.",
    "prereq": []
  },
  {
    "uid": "818309",
    "code": "PHIL5101",
    "subject": "PHIL",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Metaphysics",
    "fullname": "Metaphysics",
    "info": "Broadly speaking, metaphysics is the study of the nature of reality. Metaphysical questions include questions about what kinds of things exist, what is the nature of things, what are persons, what is possible or impossible, what is the nature of time, what is causality, and many other fundamental questions about the world. The aim of this course is to introduce students to some of the central questions of metaphysics to investigate some of their answers. prereq: One course in history of philosophy or instr consent",
    "prereq": []
  },
  {
    "uid": "825126",
    "code": "PHIL5105",
    "subject": "PHIL",
    "number": "5105",
    "honors": false,
    "writingIntensive": false,
    "name": "Epistemology",
    "fullname": "Epistemology",
    "info": "Epistemology is the study of knowledge.  Epistemological questions include questions about the nature of knowledge, the difference between knowledge and true belief, the nature of justification, and the structure of our knowledge about the world.  Epistemology is also centrally concerned with understanding and responding to arguments for skepticism, the view that we do not know anything about the world around us.  The aim of this course is to introduce students to the some of the main problems of epistemology and to investigate some of their solutions.prereq: 1001 or instr consent",
    "prereq": {
      "code": "PHIL 1001",
      "subject": "PHIL",
      "id": "1001"
    }
  },
  {
    "uid": "006309",
    "code": "PHIL5201",
    "subject": "PHIL",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Symbolic Logic I",
    "fullname": "Symbolic Logic I",
    "info": "Study of syntax and semantics of sentential and first-order logic. Symbolization of natural-language sentences and arguments. Development of deductive systems for first-order logic. Metatheoretic proofs and methods, including proof by mathematical induction and proof of consistency and completeness.prereq: 1001 or instr consent",
    "prereq": {
      "code": "PHIL 1001",
      "subject": "PHIL",
      "id": "1001"
    }
  },
  {
    "uid": "006310",
    "code": "PHIL5202",
    "subject": "PHIL",
    "number": "5202",
    "honors": false,
    "writingIntensive": false,
    "name": "Symbolic Logic II",
    "fullname": "Symbolic Logic II",
    "info": "Elements of set theory, including the concepts of enumerability and nonenumerability. Turing machines and recursive functions; the results of Church, Godel, and Tarski and the philosophical significance of those results.prereq: 5201 or instr consent",
    "prereq": {
      "code": "PHIL 5201",
      "subject": "PHIL",
      "id": "5201"
    }
  },
  {
    "uid": "818518",
    "code": "PHIL5209",
    "subject": "PHIL",
    "number": "5209",
    "honors": false,
    "writingIntensive": false,
    "name": "Math. Methods for Philosophy",
    "fullname": "Mathematical Methods for Philosophy",
    "info": "Introduction to some of the mathematical methods used throughout philosophy, such as sets, graphs, automata, probability and decision theory, statistics, and computer simulation, both explicitly and through example applications.prereq: prior course in mathematics, logic, or mathematics-related discipline or or instr consent",
    "prereq": []
  },
  {
    "uid": "006311",
    "code": "PHIL5211",
    "subject": "PHIL",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "Modal Logic",
    "fullname": "Modal Logic",
    "info": "Axiomatic and semantic treatment of propositional and predicate modal logics; problems of interpreting modal languages.prereq: 5201 or instr consent",
    "prereq": {
      "code": "PHIL 5201",
      "subject": "PHIL",
      "id": "5201"
    }
  },
  {
    "uid": "005461",
    "code": "PHIL5221",
    "subject": "PHIL",
    "number": "5221",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil Logic",
    "fullname": "Philosophy of Logic",
    "info": "In this course, we will look at some of the central topics in philosophical logic, concentrating on issues that motivate the introduction of various non-classical logics as alternatives to the standard classical account of logical consequence. Topics covered include (but are not limited to) the Liar paradox, vagueness, the paradoxes of relevance, and intuitionism.prereq: 5202 or instr consent",
    "prereq": {
      "code": "PHIL 5202",
      "subject": "PHIL",
      "id": "5202"
    }
  },
  {
    "uid": "006374",
    "code": "PHIL5222",
    "subject": "PHIL",
    "number": "5222",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil Math",
    "fullname": "Philosophy of Mathematics",
    "info": "Major philosophical questions arising in connection with mathematics. What is mathematics about? How do we know the mathematics we do? What is the relation between mathematics and the natural sciences? Selected readings of leading contributors such as Frege, Dedekind, Russell, Hilbert, Brouwer, Godel, Quine.prereq: College level logic or mathematics course or instr consent",
    "prereq": []
  },
  {
    "uid": "819199",
    "code": "PHIL5231",
    "subject": "PHIL",
    "number": "5231",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophy of Language",
    "fullname": "Philosophy of Language",
    "info": "Theories of reference, linguistic truth, relation of language/thought, translation/synonymy.prereq: 1001 or 5201 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 1001",
          "subject": "PHIL",
          "id": "1001"
        },
        {
          "code": "PHIL 5201",
          "subject": "PHIL",
          "id": "5201"
        }
      ]
    }
  },
  {
    "uid": "818657",
    "code": "PHIL5311",
    "subject": "PHIL",
    "number": "5311",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Moral Theories",
    "fullname": "History of Moral Theories",
    "info": "Is human nature fundamentally selfish or are we sympathetic creatures?  What is free will and do we have it?  Do moral principles have a rational basis or are our moral judgments expressions of feelings?  Should morality be thought of in terms of acting on principle or producing good outcomes?  We will focus on these and other questions as they are explored in primary texts from the early modern history of western philosophy.prereq: 1003W or instr consent or GRAD",
    "prereq": {
      "code": "PHIL 1003",
      "subject": "PHIL",
      "id": "1003"
    }
  },
  {
    "uid": "817750",
    "code": "PHIL5320",
    "subject": "PHIL",
    "number": "5320",
    "honors": false,
    "writingIntensive": false,
    "name": "Historical Moral Theory",
    "fullname": "Intensive Study of a Historical Moral Theory",
    "info": "Intensive consideration of an author or theory in the history of moral or political philosophy.prereq: 1003 or instr consent",
    "prereq": {
      "code": "PHIL 1003",
      "subject": "PHIL",
      "id": "1003"
    }
  },
  {
    "uid": "825141",
    "code": "PHIL5321",
    "subject": "PHIL",
    "number": "5321",
    "honors": false,
    "writingIntensive": false,
    "name": "Theories of Justice",
    "fullname": "Theories of Justice",
    "info": "What is justice, understood as a central virtue of our social (e.g., political and legal) institutions?  What does justice require in the political realm and what kind of state is best suited to achieve it?  Ideally, what image of the just state should regulate our behavior? How do the requirements of justice change, if they do, in non-ideal circumstances, such as in cases of noncompliance with the law or in the context of violent conflict (e.g., in war)?This course is intended to provide upper-level undergraduates and philosophy graduate students with a selective survey of important work in contemporary theory of justice that addresses such questions.prereq: 1003 or 1004 or grad student or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 1003",
          "subject": "PHIL",
          "id": "1003"
        },
        {
          "code": "PHIL 1004",
          "subject": "PHIL",
          "id": "1004"
        }
      ]
    }
  },
  {
    "uid": "794973",
    "code": "PHIL5323",
    "subject": "PHIL",
    "number": "5323",
    "honors": false,
    "writingIntensive": false,
    "name": "Ed and Soc Change",
    "fullname": "Education and Social Change",
    "info": "Connections between education, social change. Theories of democratic/popular education, their application through in-depth practicum in community education setting.",
    "prereq": []
  },
  {
    "uid": "794974",
    "code": "PHIL5324",
    "subject": "PHIL",
    "number": "5324",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics and Educ",
    "fullname": "Ethics and Education",
    "info": "What constitutes good education in terms of educational outcomes and of processes that promote learning. Connections between concepts of good education and of good society.",
    "prereq": []
  },
  {
    "uid": "005476",
    "code": "PHIL5325",
    "subject": "PHIL",
    "number": "5325",
    "honors": false,
    "writingIntensive": false,
    "name": "Biomedical Ethics",
    "fullname": "Biomedical Ethics",
    "info": "A survey of major topics and issues in biomedical ethics including patients' rights and duties, informed consent, confidentiality, ethical issues in medical research, the initiation and termination of medical treatment, euthanasia, abortion, and the allocation of medical resources.",
    "prereq": []
  },
  {
    "uid": "794975",
    "code": "PHIL5326",
    "subject": "PHIL",
    "number": "5326",
    "honors": false,
    "writingIntensive": false,
    "name": "Lives Worth Living",
    "fullname": "Lives Worth Living: Questions of Self, Vocation, and Community",
    "info": "Immersion experience. Students live together as a residential community of learners. Works of philosophy, history, and literature form backdrop for exploring such questions as \\\"How is identity constructed?,\\\" \\\"What is vocation?,\\\" and \\\"What experiences of community are desirable in a life?\\\" Each student creates a life-hypothesis for a life worth living.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "819028",
    "code": "PHIL5331",
    "subject": "PHIL",
    "number": "5331",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Moral Theories",
    "fullname": "Contemporary Moral Theories",
    "info": "Is morality objective, just a matter of feeling, or something in between?  How do we know even the most basic of moral truths?  Do I always have a reason to do what is moral?  What motivates people to be moral and why do some people behave immorally? This class looks at these and related questions in metaethics, moral psychology, and other areas of contemporary moral theory.prereq: 1003 or instr consent",
    "prereq": {
      "code": "PHIL 1003",
      "subject": "PHIL",
      "id": "1003"
    }
  },
  {
    "uid": "804891",
    "code": "PHIL5350",
    "subject": "PHIL",
    "number": "5350",
    "honors": false,
    "writingIntensive": false,
    "name": "Catching Lives Worth Living",
    "fullname": "Catching Lives Worth Living: Participation in the Growth of a Living-Learning Community",
    "info": "Involvement in a democratic living-learning community built by students/instructors. Students participate in community activities and daily instructor meetings. Four seven-day offerings each summer.prereq: Application, instr consent",
    "prereq": []
  },
  {
    "uid": "819433",
    "code": "PHIL5414",
    "subject": "PHIL",
    "number": "5414",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Phil",
    "fullname": "Political Philosophy",
    "info": "Works in political philosophy, whether historical or more contemporary, are one central element of the study of philosophy more broadly. As we will address these works, and the issues and concepts they take up, they fall within the larger field of moral philosophy. Like other works in this broad category, discussion in political philosophy typically consider both metaethical and normative questions. Metaethical questions concern the concepts we use as we consider matters of right and wrong or of ethical value. In the realm of political philosophy, authors consider rightness, wrongness and ethical value as they bear on political societies and political leaders, and not only on citizens but on non-citizens who experience the effects of political power. Examples of such questions include: What is justice? What is political power? What are freedom, equality and autonomy?Normative questions, by contrast, concern matters of practice. In the context of moral and political philosophy, they are typically questions about what we must do or refrain from doing if we are to act rightly (as opposed to prudently or efficiently for instance). Examples in the political realm include: What are just standards of criminal punishment? What obligations does a just state have to citizens and to non-citizen residents? What right, if any, do citizens and others have to protest state laws, policies and actions? What rights can citizens or others claim to equality under the law? What grounds or justifies our responses to such questions?Over the course of this semester, we will read both canonical texts in the history of political philosophy and pieces by a variety of authors who are less well known. Our aim will be to improve our ability to understand broad claims and more nuanced points, to compare and critically assess contrasting views, and to appreciate the ways in which political philosophers often draw or expand on others' works even as they challenge them. We will also be working towards improvements in the difficult task of explaining and supporting claims and analyses, in short written pieces, longer essays and oral discussions. prereq: 1004 or instr consent",
    "prereq": {
      "code": "PHIL 1004",
      "subject": "PHIL",
      "id": "1004"
    }
  },
  {
    "uid": "006985",
    "code": "PHIL5415",
    "subject": "PHIL",
    "number": "5415",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil of Law",
    "fullname": "Philosophy of Law",
    "info": "Analytical accounts of law and legal obligation.prereq: 1003 or 1004 or 3302 or social science major or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 1003",
          "subject": "PHIL",
          "id": "1003"
        },
        {
          "code": "PHIL 1004",
          "subject": "PHIL",
          "id": "1004"
        },
        {
          "code": "PHIL 3302",
          "subject": "PHIL",
          "id": "3302"
        }
      ]
    }
  },
  {
    "uid": "800605",
    "code": "PHIL5510",
    "subject": "PHIL",
    "number": "5510",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil of Indiv Arts",
    "fullname": "Philosophy of the Individual Arts",
    "info": "Aesthetic problems that arise in studying or practicing an art.prereq: 3502",
    "prereq": {
      "code": "PHIL 3502",
      "subject": "PHIL",
      "id": "3502"
    }
  },
  {
    "uid": "794001",
    "code": "PHIL5601",
    "subject": "PHIL",
    "number": "5601",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of PhilSci",
    "fullname": "History of the Philosophy of Science",
    "info": "History of logical empiricism, from its European origins in first half of 20th century to its emergence as nearly universal account of science in post-war Anglo-American philosophy.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "794976",
    "code": "PHIL5602",
    "subject": "PHIL",
    "number": "5602",
    "honors": false,
    "writingIntensive": false,
    "name": "Sci Rep & Expla",
    "fullname": "Scientific Representation and Explanation",
    "info": "Contemporary issues concerning representation and explanation of scientific facts.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "794977",
    "code": "PHIL5603",
    "subject": "PHIL",
    "number": "5603",
    "honors": false,
    "writingIntensive": false,
    "name": "Scientific Inquiry",
    "fullname": "Scientific Inquiry",
    "info": "Philosophical theories of methods for evaluating scientific hypotheses. Role of experimentation in science. How hypotheses are accepted within scientific community.",
    "prereq": []
  },
  {
    "uid": "794978",
    "code": "PHIL5605",
    "subject": "PHIL",
    "number": "5605",
    "honors": false,
    "writingIntensive": false,
    "name": "Space and Time",
    "fullname": "Space and Time",
    "info": "Philosophical problems concerning nature/structure of space, time, and space-time.prereq: Courses in [philosophy or physics] or instr consent",
    "prereq": []
  },
  {
    "uid": "005462",
    "code": "PHIL5606",
    "subject": "PHIL",
    "number": "5606",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil QM",
    "fullname": "Philosophy of Quantum Mechanics",
    "info": "Problems of interpretation in ordinary (nonrelativistic) quantum mechanics. Two-slit experiment, Schrodinger cat paradox (measurement problem), Einstein-Podolsky-Rosen paradox. Leading approaches to interpretation (Copenhagen, hidden variables, universal wave function) and their connections with philosophical issues.",
    "prereq": []
  },
  {
    "uid": "818966",
    "code": "PHIL5607",
    "subject": "PHIL",
    "number": "5607",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil Biol Sciences",
    "fullname": "Philosophy of the Biological Sciences",
    "info": "Biology dominates the landscape of contemporary scientific research, and yet \"biology\" consists of a variety of different disciplinary approaches: from protein biochemistry to field ecology, from developmental biology to evolutionary genetics. Many philosophical issues can be found in the concepts and practices of life science researchers from these different disciplines. What is the structure of evolutionary theory? What is a gene? What are the units of selection? What is an individual? What counts as a \"cause\"? What is the relationship between evolution and development? Are all biological phenomena reducible to genes or molecules? What are adaptations, and how do we identify them? What is an ecological niche? Is there a progressive trend in the history of life? Is there such a thing as 'human nature'? This course is an introduction to these and other related issues in the biological sciences with an emphasis on their diversity and heterogeneity. It is designed for advanced undergraduates with an interest in conceptual questions and debates in biology that are manifested across a variety of majors (e.g., Animal Science; Anthropology; Biochemistry; Biology, Society and Environment; Biosystems and Agricultural Engineering; Chemistry; Ecology, Evolution and Behavior; Genetics, Cell Biology and Development; Microbiology; Neuroscience; Physiology; Plant Biology; Psychology). Some of these issues will appear familiar from previous coursework or opportunities, whereas new issues will be intriguing because of their similarities and differences with those that have been encountered in other contexts.prereq: Courses in [philosophy or biology] or instr consent",
    "prereq": []
  },
  {
    "uid": "793905",
    "code": "PHIL5611",
    "subject": "PHIL",
    "number": "5611",
    "honors": false,
    "writingIntensive": false,
    "name": "Phil Soc Sciences",
    "fullname": "Philosophy of the Social Sciences",
    "info": "Criteria for describing/explaining human actions. Problems of objectivity, reduction, freedom.",
    "prereq": []
  },
  {
    "uid": "819600",
    "code": "PHIL5615",
    "subject": "PHIL",
    "number": "5615",
    "honors": false,
    "writingIntensive": false,
    "name": "Mind, Bodies and Machines",
    "fullname": "Mind, Bodies and Machines",
    "info": "Mind-body problem. Philosophical relevance of cybernetics, artificial intelligence, computer simulation.\n\nMental phenomena present the philosopher with a number of deep but inescapable puzzles and challenges.  We tend to suppose that we know what it is to have a mind, to have beliefs, desires, etc., and we think that we know how to explain our own behavior and that of others -- and all of this without any formal training in the relevant science.  All of this is surely amazing; indeed it verges on the outrageous.  We admit to not knowing the makeup of the simplest structures, to not knowing how to explain the behavior of the simplest organisms -- we, OF COURSE, leave such issues to scientific investigation. Yet, at the same time, we think we know how to explain the behavior of this most complex of systems; we know how to do it, and we know what we are talking about when we explain behavior by citing the relevant beliefs, desires, etc. And, to repeat, we know all of this with no formal training.  Strange indeed.  Not only is this initial confidence puzzling, but attempts to articulate the mental story and to integrate it into the larger scientific picture have all proven problematical.   \n\nWe start our investigation with a very brief glance at a mid-century proposal that initiated a very different way of thinking about mind: the proposal by Turing -- one of the great minds of the 20th Century--that machines of a certain kind could exhibit intelligence. A story told in part in the recent movie, The Imitation Game. We then turn to some more traditional approaches to mind: Cartesianism, Behaviorism and Materialism. \n\n\nprereq: one course in philosophy or instr consent",
    "prereq": []
  },
  {
    "uid": "796253",
    "code": "PHIL5622",
    "subject": "PHIL",
    "number": "5622",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophy & Feminist Theory",
    "fullname": "Philosophy and Feminist Theory",
    "info": "Encounters between philosophy/feminism. Gender's influence in traditional philosophical problems/methods. Social role of theorist/theorizing as they relate to politics of feminism.  This course surveys central debates in feminist philosophy, with a focus on the methods and virtues of resistance. Along the way, we will consider the question of how we should live in an oppressive society. Topics may include intimidation, gaslighting, silencing, epistemic injustice, emotional labor, intersectionality, resistance, anger and violence.prereq: 8 crs in [philosophy or women's studies] or instr consent",
    "prereq": []
  },
  {
    "uid": "007209",
    "code": "PHIL5760",
    "subject": "PHIL",
    "number": "5760",
    "honors": false,
    "writingIntensive": false,
    "name": "Selected Topics in Philosophy",
    "fullname": "Selected Topics in Philosophy",
    "info": "Philosophical problems of contemporary interest. Topics specified in Class Schedule.\n\nprereq: 3xxx-5xxx course in phil or instr consent",
    "prereq": []
  },
  {
    "uid": "007216",
    "code": "PHIL5993",
    "subject": "PHIL",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study.prereq: instr consent, dept consent, college consent",
    "prereq": []
  },
  {
    "uid": "007521",
    "code": "PHIL8010",
    "subject": "PHIL",
    "number": "8010",
    "honors": false,
    "writingIntensive": false,
    "name": "Wksh:Hist of Phil",
    "fullname": "Workshop in History of Philosophy",
    "info": "Topics vary by offering.prereq: concurrent registration is required (or allowed) in  4xxx hist of phil course, instr consent",
    "prereq": []
  },
  {
    "uid": "791897",
    "code": "PHIL8080",
    "subject": "PHIL",
    "number": "8080",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Hist of Ancien/Medie Phil",
    "fullname": "Seminar: History of Ancient and Medieval Philosophy",
    "info": "Topics vary by offering.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "008530",
    "code": "PHIL8081",
    "subject": "PHIL",
    "number": "8081",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of Phil:Ancien",
    "fullname": "Seminar: History of Philosophy--Ancient Philosophers",
    "info": "Major developments in ancient Greek philosophic thought; methods and role of history of philosophy in discipline of philosophy.",
    "prereq": []
  },
  {
    "uid": "008534",
    "code": "PHIL8085",
    "subject": "PHIL",
    "number": "8085",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of Phil:Modern",
    "fullname": "Seminar: History of Philosophy--Modern Philosophers",
    "info": "Major developments in modern philosophic thought; methods and role of history of philosophy in discipline of philosophy.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "007491",
    "code": "PHIL8090",
    "subject": "PHIL",
    "number": "8090",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Hist. of Mod. Phil.",
    "fullname": "Seminar: History of Modern Philosophy",
    "info": "Topics vary by offering.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "007528",
    "code": "PHIL8100",
    "subject": "PHIL",
    "number": "8100",
    "honors": false,
    "writingIntensive": false,
    "name": "Wksh:Epistem & Meta",
    "fullname": "Workshop in Epistemology and Metaphysics",
    "info": "Topics vary by offering.prereq: concurrent registration is required (or allowed) in  4xxx [epistemology or metaphysics] course, instr consent",
    "prereq": []
  },
  {
    "uid": "007507",
    "code": "PHIL8110",
    "subject": "PHIL",
    "number": "8110",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Metaphysics",
    "fullname": "Seminar: Metaphysics",
    "info": "Topics vary by offering.prereq: 4101 or instr consent",
    "prereq": {
      "code": "PHIL 4101",
      "subject": "PHIL",
      "id": "4101"
    }
  },
  {
    "uid": "007508",
    "code": "PHIL8130",
    "subject": "PHIL",
    "number": "8130",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Epistemology",
    "fullname": "Seminar: Epistemology",
    "info": "Problems in the theory of knowledge. Topics specified in [Class Schedule].prereq: 4105 or instr consent",
    "prereq": {
      "code": "PHIL 4105",
      "subject": "PHIL",
      "id": "4105"
    }
  },
  {
    "uid": "007510",
    "code": "PHIL8131",
    "subject": "PHIL",
    "number": "8131",
    "honors": false,
    "writingIntensive": false,
    "name": "Epistem Survey",
    "fullname": "Epistemology Survey",
    "info": "Survey, against background of traditional issues, of contemporary developments in theory of knowledge.",
    "prereq": []
  },
  {
    "uid": "796459",
    "code": "PHIL8133",
    "subject": "PHIL",
    "number": "8133",
    "honors": false,
    "writingIntensive": false,
    "name": "Feminist Theories of Knowledge",
    "fullname": "Feminist Theories of Knowledge",
    "info": "Interdisciplinary seminar; feminist approaches to knowledge and criticism of paradigms of knowledge operative in the disciplines. Feminists' use of concepts of subjectivity, objectivity, and intersubjectivity; feminist empiricism, standpoint theory, and contextualism, and postmodern and postcolonial theorizing.",
    "prereq": []
  },
  {
    "uid": "007509",
    "code": "PHIL8180",
    "subject": "PHIL",
    "number": "8180",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Phil of Lang",
    "fullname": "Seminar: Philosophy of Language",
    "info": "Topics vary by offering.prereq: 4231 or instr consent",
    "prereq": {
      "code": "PHIL 4231",
      "subject": "PHIL",
      "id": "4231"
    }
  },
  {
    "uid": "787908",
    "code": "PHIL8182",
    "subject": "PHIL",
    "number": "8182",
    "honors": false,
    "writingIntensive": false,
    "name": "Formal Semantics of Nat Lang",
    "fullname": "Formal Semantics of Natural Language",
    "info": "Truth-conditional model-theoretic semantics applied to treatment of opacity, intensionality, quantification, and related phenomena in natural language.prereq: Phil 5201 or instr consent",
    "prereq": {
      "code": "PHIL 5201",
      "subject": "PHIL",
      "id": "5201"
    }
  },
  {
    "uid": "007515",
    "code": "PHIL8200",
    "subject": "PHIL",
    "number": "8200",
    "honors": false,
    "writingIntensive": false,
    "name": "Wksh:Log&Phil Math",
    "fullname": "Workshop in Logic and Philosophy of Mathematics",
    "info": "Topics vary by offering.prereq: [concurrent registration is required (or allowed) in  4xxx logic or 4xxx phil of math], instr consent",
    "prereq": []
  },
  {
    "uid": "007493",
    "code": "PHIL8210",
    "subject": "PHIL",
    "number": "8210",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Logical Theory",
    "fullname": "Seminar: Logical Theory",
    "info": "Topics vary by offering.prereq: [5201, 5205] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "PHIL 5201",
          "subject": "PHIL",
          "id": "5201"
        },
        {
          "code": "PHIL 5205",
          "subject": "PHIL",
          "id": "5205"
        }
      ]
    }
  },
  {
    "uid": "007496",
    "code": "PHIL8220",
    "subject": "PHIL",
    "number": "8220",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Phil of Math",
    "fullname": "Seminar: Philosophy of Mathematics",
    "info": "Topics such as significance of limitative metatheorems (Goedel, et al), assessment of major foundational programs (set theoretic, modern Hilbertian, constructivist), modal/structuralist alternatives to standard platonism.prereq: 5202 or [4xxx or 5xxx] math course or instr consent",
    "prereq": {
      "code": "PHIL 5202",
      "subject": "PHIL",
      "id": "5202"
    }
  },
  {
    "uid": "007517",
    "code": "PHIL8300",
    "subject": "PHIL",
    "number": "8300",
    "honors": false,
    "writingIntensive": false,
    "name": "Wksh:Moral & Pol",
    "fullname": "Workshop in Moral and Political Philosophy",
    "info": "Topics vary by offering.prereq: [concurrent registration is required (or allowed) in  4xxx moral phil or 4xxx pol phil] instr consent",
    "prereq": []
  },
  {
    "uid": "007498",
    "code": "PHIL8310",
    "subject": "PHIL",
    "number": "8310",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Moral Phil",
    "fullname": "Seminar: Moral Philosophy",
    "info": "Concepts/problems relating to ethical discourse.prereq: 4310 or 4320 or 4330 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 4310",
          "subject": "PHIL",
          "id": "4310"
        },
        {
          "code": "PHIL 4320",
          "subject": "PHIL",
          "id": "4320"
        },
        {
          "code": "PHIL 4330",
          "subject": "PHIL",
          "id": "4330"
        }
      ]
    }
  },
  {
    "uid": "007501",
    "code": "PHIL8320",
    "subject": "PHIL",
    "number": "8320",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Medical Ethics",
    "fullname": "Seminar on Medical Ethics",
    "info": "Patients' rights/duties, informed consent, confidentiality, ethical issues in medical research, initiation/termination of medical treatment, euthanasia, abortion, maternal/fetal conflicts, allocation of medical resources.prereq: [4xxx or 5xxx] ethics course or instr consent",
    "prereq": []
  },
  {
    "uid": "788258",
    "code": "PHIL8333",
    "subject": "PHIL",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "007504",
    "code": "PHIL8410",
    "subject": "PHIL",
    "number": "8410",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Phil of Law",
    "fullname": "Seminar: Philosophy of Law",
    "info": "Primarily for law students and advanced political science, history, or sociology majors or minors.prereq: 5415 or instr consent",
    "prereq": {
      "code": "PHIL 5415",
      "subject": "PHIL",
      "id": "5415"
    }
  },
  {
    "uid": "007506",
    "code": "PHIL8420",
    "subject": "PHIL",
    "number": "8420",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Political Phil",
    "fullname": "Seminar: Political Philosophy",
    "info": "Topics vary by offering.prereq: 4321 or 4414 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 4321",
          "subject": "PHIL",
          "id": "4321"
        },
        {
          "code": "PHIL 4414",
          "subject": "PHIL",
          "id": "4414"
        }
      ]
    }
  },
  {
    "uid": "788392",
    "code": "PHIL8444",
    "subject": "PHIL",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "007525",
    "code": "PHIL8500",
    "subject": "PHIL",
    "number": "8500",
    "honors": false,
    "writingIntensive": false,
    "name": "Wksh:Aesthetics",
    "fullname": "Workshop in Aesthetics",
    "info": "Topics vary by offering.prereq: concurrent registration is required (or allowed) in  4xxx aesthetics course, instr consent",
    "prereq": []
  },
  {
    "uid": "007512",
    "code": "PHIL8510",
    "subject": "PHIL",
    "number": "8510",
    "honors": false,
    "writingIntensive": false,
    "name": "Aesth. Sem",
    "fullname": "Seminar: Aesthetics Studies",
    "info": "Topics vary by offering.",
    "prereq": []
  },
  {
    "uid": "007511",
    "code": "PHIL8550",
    "subject": "PHIL",
    "number": "8550",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Phil of Relig",
    "fullname": "Seminar: Philosophy of Religion",
    "info": "Topics vary by offering.prereq: 4521 or instr consent",
    "prereq": {
      "code": "PHIL 4521",
      "subject": "PHIL",
      "id": "4521"
    }
  },
  {
    "uid": "007527",
    "code": "PHIL8600",
    "subject": "PHIL",
    "number": "8600",
    "honors": false,
    "writingIntensive": false,
    "name": "Wksh:Phil of Scienc",
    "fullname": "Workshop in the Philosophy of Science",
    "info": "Topics vary by offering.prereq: concurrent registration is required (or allowed) in  4xxx phil of sci course,  instr consent",
    "prereq": []
  },
  {
    "uid": "008083",
    "code": "PHIL8601",
    "subject": "PHIL",
    "number": "8601",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Sci Inquiry",
    "fullname": "Seminar: Scientific Inquiry",
    "info": "Philosophical theories of the nature of scientific methods for evaluating scientific hypotheses, of role of experimentation in science, and of how hypotheses come to be accepted within a scientific community.",
    "prereq": []
  },
  {
    "uid": "008085",
    "code": "PHIL8602",
    "subject": "PHIL",
    "number": "8602",
    "honors": false,
    "writingIntensive": false,
    "name": "Scientific Rep & Explanation",
    "fullname": "Scientific Representation and Explanation",
    "info": "Contemporary issues concerning representation and explanation of scientific facts.",
    "prereq": []
  },
  {
    "uid": "008087",
    "code": "PHIL8605",
    "subject": "PHIL",
    "number": "8605",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Hist of PhilSci",
    "fullname": "Seminar: History of the Philosophy of Science",
    "info": "Historical development of logical empiricism from its European origins in first half of 20th century to its emergence as nearly universal account of science in post-war Anglo-American philosophy.",
    "prereq": []
  },
  {
    "uid": "008088",
    "code": "PHIL8606",
    "subject": "PHIL",
    "number": "8606",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Medicine & Biol",
    "fullname": "Seminar: Philosophy of Medicine and the Biomedical Sciences",
    "info": "Aims and goals of medicine; concepts of health, illness, and disease; nature of reasoning in clinical medicine; theoretical evolution in medicine; and role of values in practice of medicine and healthcare.",
    "prereq": []
  },
  {
    "uid": "790916",
    "code": "PHIL8610",
    "subject": "PHIL",
    "number": "8610",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Mod Phys Sci",
    "fullname": "Seminar: History of Modern Physical Sciences",
    "info": "Topics specified in [Class Schedule].prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "008090",
    "code": "PHIL8620",
    "subject": "PHIL",
    "number": "8620",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Phil ofBiol Sci",
    "fullname": "Seminar: Philosophy of the Biological Sciences",
    "info": "Topics vary by offering.",
    "prereq": []
  },
  {
    "uid": "008092",
    "code": "PHIL8640",
    "subject": "PHIL",
    "number": "8640",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Phil of Cog Sci",
    "fullname": "Seminar: Philosophy of the Cognitive Sciences",
    "info": "Philosophical framework for analyzing cognitive sciences. Recent developments in metaphysics/epistemology. Nature of scientific theories, methodologies of cognitive sciences, relations among cognitive sciences. Relation of cognitive science to epistemology and to various philosophical problems. Topics very by offering",
    "prereq": []
  },
  {
    "uid": "008528",
    "code": "PHIL8660",
    "subject": "PHIL",
    "number": "8660",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc & Cult Stud Sci",
    "fullname": "Seminar: Social and Cultural Studies of Science",
    "info": "Review of recent work; analysis of theoretical and methodological differences among practitioners; selected responses from historians and philosophers of science.",
    "prereq": []
  },
  {
    "uid": "788510",
    "code": "PHIL8666",
    "subject": "PHIL",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "008080",
    "code": "PHIL8670",
    "subject": "PHIL",
    "number": "8670",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Phil of Science",
    "fullname": "Seminar: Philosophy of Science",
    "info": "Topics vary by offering.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "796458",
    "code": "PHIL8710",
    "subject": "PHIL",
    "number": "8710",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar:  Feminist Philosophy",
    "fullname": "Seminar:  Feminist Philosophy",
    "info": "Topics vary by offering.prereq: 4622 or 5622 or WoSt 4122 or WoSt 5122 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHIL 4622",
          "subject": "PHIL",
          "id": "4622"
        },
        {
          "code": "PHIL 5622",
          "subject": "PHIL",
          "id": "5622"
        },
        {
          "code": "WOST 4122",
          "subject": "WOST",
          "id": "4122"
        },
        {
          "code": "WOST 5122",
          "subject": "WOST",
          "id": "5122"
        }
      ]
    }
  },
  {
    "uid": "788639",
    "code": "PHIL8777",
    "subject": "PHIL",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "787912",
    "code": "PHIL8888",
    "subject": "PHIL",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "825978",
    "code": "PHIL8980",
    "subject": "PHIL",
    "number": "8980",
    "honors": false,
    "writingIntensive": false,
    "name": "Philosophy Proseminar",
    "fullname": "Philosophy Proseminar",
    "info": "This course will provide a structured forum for introducing new graduate students to the PhD program, to aid integration into the program, and to build community among first and second year students.prereq: first or second year student in Philosophy doctoral program",
    "prereq": []
  },
  {
    "uid": "007488",
    "code": "PHIL8993",
    "subject": "PHIL",
    "number": "8993",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Study",
    "fullname": "Directed Study",
    "info": "tbdprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "013234",
    "code": "PHIL8994",
    "subject": "PHIL",
    "number": "8994",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Research",
    "fullname": "Directed Research",
    "info": "tbdprereq: instr consent",
    "prereq": []
  }
]