[
  {
    "uid": "010565",
    "code": "PHSL1001",
    "subject": "PHSL",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Anatomy and Physiology",
    "fullname": "Introductory Human Anatomy and Physiology for Non-Majors",
    "info": "Have you ever wondered why you get the chills when you are sick? Or what the lung of a lifelong smoker actually looks like? Ever curious about what your brain looks like compared to someone with Alzheimer's? If your answer is yes, then this class is for you! This entirely human-based course is designed to tap into the curiosities we all have about our bodies by providing you with a foundational understanding of how your body works. The goal of this course is for you to learn about the human body and how it functions when it is both healthy and when things break down. In the classroom setting, we will focus on understanding the functions of each major organ system from the heart to the brain. Then in the lab, each of you will have the opportunity to see and touch real human organs you just learned about in class. Additionally, in this course, you will compare both healthy and diseased human tissue to better understand how choices you make every day can affect your organ's structure and function. When you leave this course, you will leave empowered, not only by your understanding of your own physiology, but by your ability to evaluate and understand the science you will continue to hear about and see in the media.",
    "prereq": []
  },
  {
    "uid": "825951",
    "code": "PHSL2001",
    "subject": "PHSL",
    "number": "2001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Physiology & Anatomy",
    "fullname": "Introductory Physiology for Human Physiology Majors",
    "info": "This introductory human physiology course is designed to give human physiology majors a basic understanding of the human body and how it functions when it is both healthy and when things break down. During lecture, we will focus on understanding the functions of each major organ system from the heart to the brain. Then in the lab, we will build on what you have learned by applying the content to actual human cadaveric material. Students will be asked to observe and document changes in structure of diseased organs and hypothesize how these changes would have affected the function of this organ in a human body. Additionally, the discussion portion of the class will focus on specific pathology as it relates to the organ systems you learned about in lecture and lab. These discussions will challenge students to think critically about disease mechanisms by studying primary literature and by diving into well understood mechanisms that highlight powerful physiology. The goal of this course is to provide students a strong foundation in physiology and the important role each organ system plays in maintaining homeostasis within the body.",
    "prereq": []
  },
  {
    "uid": "820084",
    "code": "PHSL2041",
    "subject": "PHSL",
    "number": "2041",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology and Medicine",
    "fullname": "Physiology and Medicine",
    "info": "An understanding of Human Physiology is the basis of the practice of medicine.  This course will provide an introduction and exploration of Physiology as it relates to the functions of the Human Body with special emphasis on the role of Physiology in Contemporary Medicine.   The role of physiological research on advances in our understanding of health and disease will be emphasized.  Students interested preparing for health science based careers and/or considering the Human Physiology major are encouraged to enroll.",
    "prereq": []
  },
  {
    "uid": "826215",
    "code": "PHSL2061",
    "subject": "PHSL",
    "number": "2061",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Human Physiology",
    "fullname": "Introduction to Human Physiology",
    "info": "The human body consists of multiple organ systems that not only work independently but rely on each other to form a functioning human body.  In this introductory human physiology course, you will learn about each major organ systems and its basic physiological function.  While studying each system we will start with the normal physiology and transition to predicting how these systems break down under diseased conditions.  This active learning class will be broken up in to mini-lectures and small group discussion.  Each mini lecture will include an introduction to the current system and will be followed by a group discussion where you will be asked to predict, illustrate, articulate, and summarize the normal physiology and the changes that occur in the face of outside stressors.   You will see that some physiological changes occur rapidly, and some over many years.  Moreover, some changes are physiological while others pathological.   This introductory course is designed to provide you with a foundation in human physiology while simultaneously inspire you to appreciate the complexities and beauty in each of our bodies.",
    "prereq": []
  },
  {
    "uid": "806678",
    "code": "PHSL3050",
    "subject": "PHSL",
    "number": "3050",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology Cells to Systems",
    "fullname": "Physiology From Cells to Systems",
    "info": "Basic physiology of human cells and organ systems, including nerve, muscle, cardiovascular, respiratory, renal, digestive, endocrine, metabolic and reproductive systems. Critical thinking about physiological concepts through active learning exercises involving analysis and manipulation of ideas. Apply concepts in basic research or clinical settings.prereq: BIOL 1009 or equiv [including eukaryotic cellular biology], [[CHEM 1021, CHEM 1022] or 1 yr of college-level chemistry]",
    "prereq": {
      "and": [
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "CHEM 1021",
          "subject": "CHEM",
          "id": "1021"
        },
        {
          "code": "CHEM 1022",
          "subject": "CHEM",
          "id": "1022"
        }
      ]
    }
  },
  {
    "uid": "010566",
    "code": "PHSL3051",
    "subject": "PHSL",
    "number": "3051",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Physiology",
    "fullname": "Human Physiology",
    "info": "How major organ systems function (nerve, muscle, circulation, respiration, endocrine, renal, gastrointestinal, temperature regulation and energy metabolism). Three one-hour lectures, two-hour lab.prereq: [BIOL 1009 or 1 yr college biol], 1 yr college chem",
    "prereq": {
      "code": "BIOL 1009",
      "subject": "BIOL",
      "id": "1009"
    }
  },
  {
    "uid": "010511",
    "code": "PHSL3061",
    "subject": "PHSL",
    "number": "3061",
    "honors": false,
    "writingIntensive": false,
    "name": "Prin. Physiol.",
    "fullname": "Principles of Physiology",
    "info": "Human physiology with emphasis on quantitative aspects. Organ systems (circulation, respiration, gastrointestinal, renal, endocrine, muscle, peripheral and central nervous systems), cellular transport processes, and scaling in biology.prereq: 1 year college chem and physics and math through integral calculus",
    "prereq": []
  },
  {
    "uid": "797546",
    "code": "PHSL3062W",
    "subject": "PHSL",
    "number": "3062",
    "honors": false,
    "writingIntensive": true,
    "name": "Physiol Majors Paper",
    "fullname": "Research Paper for Physiology Majors",
    "info": "Students write a research review on a physiological topic. Students select an area of focus within the discipline of physiology, and complete a literature review of basic science papers published in the past 10 years in their topic area. All students will work with a faculty advisor, who will assist the student in selecting their topic area, refining the focus of their literature review, and provide guidance on writing a scientific review article. prereq: concurrent registration is required (or allowed) in 3061, physiology major, 1 yr [college chem, physics], math through integral calculus",
    "prereq": {
      "code": "PHSL 3061",
      "subject": "PHSL",
      "id": "3061"
    }
  },
  {
    "uid": "798486",
    "code": "PHSL3063",
    "subject": "PHSL",
    "number": "3063",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Human Physiology",
    "fullname": "Principles of Human Physiology",
    "info": "Physiology of human organ systems. Emphasizes quantitative aspects. Lab exercises integrated with lectures. Material presented includes all organ systems, neurophysiology, and cellular transport processes.",
    "prereq": []
  },
  {
    "uid": "010434",
    "code": "PHSL3071W",
    "subject": "PHSL",
    "number": "3071",
    "honors": false,
    "writingIntensive": true,
    "name": "Physiol for Majors",
    "fullname": "Principles of Physiology for Majors",
    "info": "Human physiology with emphasis on quantitative aspects.  Organ systems (circulation, respiration, gastrointestinal, renal, endocrine, muscle, peripheral and central nervous systems), cellular transport processes, and scaling in biology. Papers on current topics of interest based on published laboratory research required. ",
    "prereq": []
  },
  {
    "uid": "010771",
    "code": "PHSL3095",
    "subject": "PHSL",
    "number": "3095",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology Problems",
    "fullname": "Problems in Physiology",
    "info": "Individualized study in physiology.  Students address a selected problem in physiology through library or lab research, supervised by physiology faculty.prereq: concurrent registration is required (or allowed) in  college physiology, instr consent",
    "prereq": []
  },
  {
    "uid": "790198",
    "code": "PHSL3101",
    "subject": "PHSL",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Neurosci I",
    "fullname": "Introduction to Neuroscience I: From Molecules to Madness",
    "info": "Basic principles of cellular/ molecular neurobiology and nervous systems.",
    "prereq": []
  },
  {
    "uid": "790909",
    "code": "PHSL3701",
    "subject": "PHSL",
    "number": "3701",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology Laboratory",
    "fullname": "Physiology Laboratory",
    "info": "Experiments in physiology. Emphasizes quantitative aspects, including analysis of organ systems.prereq: Physiology major",
    "prereq": []
  },
  {
    "uid": "801121",
    "code": "PHSL4021",
    "subject": "PHSL",
    "number": "4021",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology of Bionic Human",
    "fullname": "Advanced Physiology and Bioengineering: Bionic Human",
    "info": "Is \"Iron Man\" technology just around the corner? This course will examine how, and if, biomedical devices can address the needs of humans suffering from various pathologies and/or disabilities, or enhance human performance. Advanced discussion of the physiology of organs/organ systems and relevant devices past, present, and future. Emphasis will be on an in-depth understanding of normal physiology including cardiovascular, respiratory, renal, liver, motor, sensory, and pancreatic physiology. Classes will involve review of the physiology of organ systems, design considerations for  medical devices, and discussions of published papers about basic science and clinical trials. Classes will be a combination of content presentation and discussion.",
    "prereq": []
  },
  {
    "uid": "804736",
    "code": "PHSL4031",
    "subject": "PHSL",
    "number": "4031",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiological Discussions",
    "fullname": "Physiological Discussions: Contemporary Topics",
    "info": "Students read, critically evaluate, present, and discuss research in cellular and organ system physiology. Journal club setting led by faculty members.prereq: 3061 or 3063 or 5061 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHSL 3061",
          "subject": "PHSL",
          "id": "3061"
        },
        {
          "code": "PHSL 3063",
          "subject": "PHSL",
          "id": "3063"
        },
        {
          "code": "PHSL 5061",
          "subject": "PHSL",
          "id": "5061"
        }
      ]
    }
  },
  {
    "uid": "010435",
    "code": "PHSL4094",
    "subject": "PHSL",
    "number": "4094",
    "honors": false,
    "writingIntensive": false,
    "name": "Dir Res Human Physiology",
    "fullname": "Directed Research in Human Physiology",
    "info": "Students pursue a selected topic in physiology through library or lab research supervised by physiology faculty.Prereq &3061, physiology honors candidate, approval of director of undergrad studies in physiology.",
    "prereq": {
      "code": "PHSL 3061",
      "subject": "PHSL",
      "id": "3061"
    }
  },
  {
    "uid": "010567",
    "code": "PHSL4151",
    "subject": "PHSL",
    "number": "4151",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Topics Neurosci",
    "fullname": "Research Topics in Neuroscience",
    "info": "Primarily for undergraduates majoring in neuroscience or physiology. In-depth study of specific topics from genetics to  physiology to behavior, such as aspects of neurodevelopment, neurochemistry or molecular neuroscience, sensory systems, motor control, and behavioral neuroscience.",
    "prereq": []
  },
  {
    "uid": "825624",
    "code": "PHSL4221",
    "subject": "PHSL",
    "number": "4221",
    "honors": false,
    "writingIntensive": false,
    "name": "Computational Physiology",
    "fullname": "Systems and Computational Physiology",
    "info": "Physiological processes can involve a complex level of interactions that can be challenging to understand based on intuition alone. Quantitative and computational approaches can be used to help us better understand the mechanisms regulating such complex processes, both in healthy and pathological conditions. In this course, students will be introduced to current methods from systems biology, computational biology, and artificial intelligence to better understand human physiology. We will discuss mathematical approaches to model biological interactions that describe fundamental physiological concepts such as feedback and homeostasis that operate across biological scales, from intracellular enzymes to organ regulation. We will apply these approaches to understand a range of physiological systems, including hormone secretion, circadian rhythms, and inflammation. We will also introduce students to machine learning and deep learning methods, and discuss how these computational approaches are being applied in the areas of clinical physiology and biomedical imaging.",
    "prereq": []
  },
  {
    "uid": "815289",
    "code": "PHSL4242",
    "subject": "PHSL",
    "number": "4242",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Skill Development",
    "fullname": "Professional Skills Development for Biomedical Scientists",
    "info": "Students will gain valuable experience in professional development for bio-medical science, applicable to academic, clinical, biotech, pharma, medical and other career paths. This course features essential professional skills development, including critical evaluation of the scientific literature, oral short presentations, development of research project specific aims, and development of individual WOW statements (aka the Bill Gates elevator pitch). Students will gain knowledge of grant mechanisms and on strategies and mechanics to writing a winning grant. Students will evaluate funded research projects, develop and write their own grant, (possibly based on their previous PHSL 3062W paper or other experiences) and perform peer review critiques of their submitted grants. There are no conventional tests in this class. prereq: PHSL 3062W is recommended.",
    "prereq": {
      "code": "PHSL 3062",
      "subject": "PHSL",
      "id": "3062"
    }
  },
  {
    "uid": "808397",
    "code": "PHSL4702",
    "subject": "PHSL",
    "number": "4702",
    "honors": false,
    "writingIntensive": false,
    "name": "Cell Physiology",
    "fullname": "Cell Physiology",
    "info": "Critical cell functions. Regulation of pH, volume, intracellular electrolyte composition, calcium signaling, membrane potential dynamics, motility, aspects of intercellular communication.prereq: [3051 or 3061 or BIOL 3211], [CHEM 1022 or equiv], [MATH 1272 or equiv]",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "PHSL 3051",
              "subject": "PHSL",
              "id": "3051"
            },
            {
              "code": "PHSL 3061",
              "subject": "PHSL",
              "id": "3061"
            },
            {
              "code": "BIOL 3211",
              "subject": "BIOL",
              "id": "3211"
            }
          ]
        },
        {
          "code": "CHEM 1022",
          "subject": "CHEM",
          "id": "1022"
        },
        {
          "code": "MATH 1272",
          "subject": "MATH",
          "id": "1272"
        }
      ]
    }
  },
  {
    "uid": "805355",
    "code": "PHSL4900",
    "subject": "PHSL",
    "number": "4900",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Physiology Laboratory",
    "fullname": "Advanced Physiology Teaching Laboratory",
    "info": "Teaching in undergrad physiology labs. Instructional sessions, hands-on teaching experiences.prereq: [3051 or [3061, 3071]], instr consent",
    "prereq": {
      "or": [
        {
          "code": "PHSL 3051",
          "subject": "PHSL",
          "id": "3051"
        },
        {
          "and": [
            {
              "code": "PHSL 3061",
              "subject": "PHSL",
              "id": "3061"
            },
            {
              "code": "PHSL 3071",
              "subject": "PHSL",
              "id": "3071"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "010527",
    "code": "PHSL5061",
    "subject": "PHSL",
    "number": "5061",
    "honors": false,
    "writingIntensive": false,
    "name": "Prin. Physiol.",
    "fullname": "Principles of Physiology for Biomedical Engineering",
    "info": "Human physiology with emphasis on quantitative aspects. Organ systems (circulation, respiration, renal, gastrointestinal, endocrine, muscle, central and peripheral nervous systems), cellular transport processes, and scaling in biology.prereq: Biomedical engineering grad, one yr college chem and physics and math through integral calculus",
    "prereq": []
  },
  {
    "uid": "015019",
    "code": "PHSL5094",
    "subject": "PHSL",
    "number": "5094",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiol Research",
    "fullname": "Research in Physiology",
    "info": "Independent lab research project in physiology, supervised by physiology faculty.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "010564",
    "code": "PHSL5095",
    "subject": "PHSL",
    "number": "5095",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology Problems",
    "fullname": "Problems in Physiology",
    "info": "Individualized study in physiology. Students address selected problem through library or lab research, supervised by physiology faculty.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "808861",
    "code": "PHSL5096",
    "subject": "PHSL",
    "number": "5096",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrative Biology Advances",
    "fullname": "Integrative Biology and Physiology Research Advances",
    "info": "Attend/participate in IBP Fall/Spring seminar series.  Seminars given by faculty, invited speakers, students. Exposure to key topics. How to present seminars.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "789506",
    "code": "PHSL5101",
    "subject": "PHSL",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Physiology",
    "fullname": "Human Physiology",
    "info": "Survey of human physiology: Cardiovascular, muscle, respiratory, gastrointestinal, nutrition, renal physiology. Integrative, systems approach. Emphasizes normal function.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "794305",
    "code": "PHSL5115",
    "subject": "PHSL",
    "number": "5115",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Physiology I",
    "fullname": "Clinical Physiology I",
    "info": "Cellular mechanisms, disease states and clinical applications of excitable tissues: cellular transport, neurophysiology, skeletal muscle physiology, cardiovascular physiology.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "794306",
    "code": "PHSL5116",
    "subject": "PHSL",
    "number": "5116",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Physiology II",
    "fullname": "Clinical Physiology II",
    "info": "Cellular mechanisms, disease states and clinical applications of metabolic systems: respiratory physiology, renal physiology, acid base physiology, metabolism, gastrointestinal physiology, endocrine physiology, physiology of pregnancy and labor.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "798452",
    "code": "PHSL5150",
    "subject": "PHSL",
    "number": "5150",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Topics Neurosci",
    "fullname": "Research Topics in Neuroscience",
    "info": "",
    "prereq": []
  },
  {
    "uid": "809109",
    "code": "PHSL5197",
    "subject": "PHSL",
    "number": "5197",
    "honors": false,
    "writingIntensive": false,
    "name": "Stress Physiology",
    "fullname": "Stress Physiology",
    "info": "Journal club format. Meets weekly to examine foundations of stress, historical progress, development of stress, modern stress physiology. Focus on stress-induced pathology with attention to cardiovascular, metabolic, neuroendocrine disorders.Students participating in the weekly discussion are assessed on discussion participation, completion of weekly writing assignments and quality of the presentation in the class, are eligible for 1 credit.Students completing a midterm (test) and a final project (specific aims page of an NIH RO1 grant) in addition to the criteria described above are eligible for 3 credits.Prerequisite: instructor consent is required. Graduate student standing, master students, and post-doctoral fellows (if they are eligible for credits). Undergraduate students must have taken PHSL 3061 or equivalent, and have previous laboratory research experience.",
    "prereq": {
      "code": "PHSL 3061",
      "subject": "PHSL",
      "id": "3061"
    }
  },
  {
    "uid": "010568",
    "code": "PHSL5201",
    "subject": "PHSL",
    "number": "5201",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Neurosci I",
    "fullname": "Computational Neuroscience I: Membranes and Channels",
    "info": "Neural excitation (ion channels, excitation models, effects of neural morphology) using UNIX workstations to simulate empirical results.  Includes the Hodgkin-Huxley model, nonlinear dynamic systems analysis, voltage and ligand gated ion channels, ion transport theories, and impulse initiation and propagation.prereq: calculus through differential equations",
    "prereq": []
  },
  {
    "uid": "010569",
    "code": "PHSL5202",
    "subject": "PHSL",
    "number": "5202",
    "honors": false,
    "writingIntensive": false,
    "name": "Theoretical Neuroscience",
    "fullname": "Theoretical Neuroscience: Systems and Information Processing",
    "info": "Quantitative examination of information processing by networks based on experimental data and theoretical models.  Neural codes, neural network models and information processing, neural control systems, computational maps.",
    "prereq": []
  },
  {
    "uid": "820329",
    "code": "PHSL5211",
    "subject": "PHSL",
    "number": "5211",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology of Inflammation",
    "fullname": "Physiology of Inflammation in Disease",
    "info": "In this course, we will explore the latest developments in the field of inflammation-mediated chronic diseases. The students will learn basic concepts of immunity and inflammation and the mechanisms by which non-infectious inflammatory processes mediate chronic disease. Instructor consent is required. Courses in physiology, such as PHSL3051, 3061, and Microbiology and Immunology, such as  MICB 4131, are recommended but not required.",
    "prereq": []
  },
  {
    "uid": "825454",
    "code": "PHSL5221",
    "subject": "PHSL",
    "number": "5221",
    "honors": false,
    "writingIntensive": false,
    "name": "Computational Physiology",
    "fullname": "Systems and Computational Physiology",
    "info": "Physiological processes can involve a complex level of interactions that can be challenging to understand based on intuition alone. Quantitative and computational approaches can be used to help us better understand the mechanisms regulating such complex processes, both in healthy and pathological conditions. In this course, students will be introduced to current methods from systems biology, computational biology, and artificial intelligence to better understand human physiology. We will discuss mathematical approaches to model biological interactions that describe fundamental physiological concepts such as feedback and homeostasis that operate across biological scales, from intracellular enzymes to organ regulation. We will apply these approaches to understand a range of physiological systems, including hormone secretion, circadian rhythms, and inflammation. We will also introduce students to machine learning and deep learning methods, and discuss how these computational approaches are being applied in the areas of clinical physiology and biomedical imaging. ",
    "prereq": []
  },
  {
    "uid": "801451",
    "code": "PHSL5315",
    "subject": "PHSL",
    "number": "5315",
    "honors": false,
    "writingIntensive": false,
    "name": "Exercise Medicine",
    "fullname": "Human Power, Sports Performance, and Disease Treatment",
    "info": "Seminar. Multiple physiological systems in sports/exercise medicine and elite athletic performance. Human power training, sports performance, treatment of disease using exercise prescriptions. Students review literature, analyze data, make PowerPoint presentations.",
    "prereq": []
  },
  {
    "uid": "800999",
    "code": "PHSL5350",
    "subject": "PHSL",
    "number": "5350",
    "honors": false,
    "writingIntensive": false,
    "name": "Humans in Extreme Environments",
    "fullname": "Humans in Extreme Environments",
    "info": "Physiological systems, human factors, psychological reactions. Countermeasures to enhance performance and prevent negative health consequences. Readings, required paper, final exam.prereq: [3061 or equiv], instr consent",
    "prereq": {
      "code": "PHSL 3061",
      "subject": "PHSL",
      "id": "3061"
    }
  },
  {
    "uid": "800938",
    "code": "PHSL5355",
    "subject": "PHSL",
    "number": "5355",
    "honors": false,
    "writingIntensive": false,
    "name": "Humans in Extreme Environments",
    "fullname": "Directed Study: Humans in Extreme Environments",
    "info": "Individualized study on topics related to human physiology in extreme environments. Library or lab research.",
    "prereq": []
  },
  {
    "uid": "800958",
    "code": "PHSL5356",
    "subject": "PHSL",
    "number": "5356",
    "honors": false,
    "writingIntensive": false,
    "name": "Extreme Environment Research",
    "fullname": "Research: Humans in Extreme Environments",
    "info": "Independent lab research on physiology in extreme environments.",
    "prereq": []
  },
  {
    "uid": "011309",
    "code": "PHSL5444",
    "subject": "PHSL",
    "number": "5444",
    "honors": false,
    "writingIntensive": false,
    "name": "Muscle",
    "fullname": "Muscle",
    "info": "Muscle molecular structure/function and disease.  Muscle regulation, ion transport, and force generation.  Muscular dystrophy and heart disease. prereq: PHSL 3061 or PHSL 5061 or BioC 3021, BIOL 3021 or BIOL 4331 or instr consent",
    "prereq": {
      "and": [
        {
          "code": "PHSL 3061",
          "subject": "PHSL",
          "id": "3061"
        },
        {
          "code": "PHSL 5061",
          "subject": "PHSL",
          "id": "5061"
        },
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOL 3021",
          "subject": "BIOL",
          "id": "3021"
        },
        {
          "code": "BIOL 4331",
          "subject": "BIOL",
          "id": "4331"
        }
      ]
    }
  },
  {
    "uid": "789589",
    "code": "PHSL5510",
    "subject": "PHSL",
    "number": "5510",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Cardiac Physiology",
    "fullname": "Advanced Cardiac Physiology and Anatomy",
    "info": "Fundamental concepts, advanced topics related to clinical/biomedical cardiac physiology. Lectures, laboratories, workshops, anatomical dissections. Intense, one week course.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "790050",
    "code": "PHSL5511",
    "subject": "PHSL",
    "number": "5511",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Neuromuscular Jx Phsl",
    "fullname": "Advanced Neuromuscular Junction Physiology",
    "info": "Fundamental concepts and advanced topics related to clinical/biomedical aspects of neuromuscular junction physiology. Lectures, laboratories, workshops, anatomical dissections. Intense, one week course.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "790486",
    "code": "PHSL5520",
    "subject": "PHSL",
    "number": "5520",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Pulmonary Mechanics",
    "fullname": "Advanced Pulmonary Mechanics: Physiology and Pathophysiology",
    "info": "Fundamental concepts and advanced topics related to mechanical aspects of pulmonary function (e.g., elastic recoil, airway resistance). Lectures, laboratories, demonstrations. Intense, one week course.",
    "prereq": []
  },
  {
    "uid": "805941",
    "code": "PHSL5525",
    "subject": "PHSL",
    "number": "5525",
    "honors": false,
    "writingIntensive": false,
    "name": "Pelvis and Urinary System",
    "fullname": "Anatomy and Physiology of the Pelvis and Urinary System",
    "info": "Two-day intensive course. Pelvis, perineum, and urinary system with cadaveric dissection. Structure/function of pelvic and urinary organs, including common dysfunction and pathophysiology. Laboratory dissections, including kidneys, ureters, urinary bladder, pelvic viscera and perineum (male or female), pelvic floor, vascular and nervous structures. Grand rounds section.prereq: One undergrad anatomy course, one undergrad physiology course, instr consent",
    "prereq": []
  },
  {
    "uid": "793182",
    "code": "PHSL5530",
    "subject": "PHSL",
    "number": "5530",
    "honors": false,
    "writingIntensive": false,
    "name": "Drug Physiology",
    "fullname": "Physiology of Drug Absorption, Distribution, and Elimination",
    "info": "Topics in pharmacokinetics. Non-compartmental calculations of clearance and volume of distribution. Compartmental modeling. Deconvolution approaches. Physiologically-based pharmacokinetic modeling. Course is designed around the pharmacokinetic program PKQuest.",
    "prereq": []
  },
  {
    "uid": "795438",
    "code": "PHSL5540",
    "subject": "PHSL",
    "number": "5540",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Exercise Medicine",
    "fullname": "Advanced Exercise Medicine:  Physiology and Bioenergetics",
    "info": "Three-day intensive course. Physiology, bioenergetics, nutrition, and sports medicine. Focuses on application of principles to treatment of diseases and functional deficits. Lectures, demonstrations, hands-on experiences in an exercise medicine facility.prereq: [Grad student or practicing health professional], instr consent",
    "prereq": []
  },
  {
    "uid": "790910",
    "code": "PHSL5701",
    "subject": "PHSL",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology Laboratory",
    "fullname": "Physiology Laboratory",
    "info": "Experiments in physiology. Emphasizes quantitative aspects, including analysis of organ systems.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "804088",
    "code": "PHSL5702",
    "subject": "PHSL",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "Cell Physiology",
    "fullname": "Cell Physiology",
    "info": "Control mechanisms in maintaining homeostasis with respect to critical cell functions. Regulation of pH, volume, nutrient transport, intracellular electrolyte composition, membrane potential. Aspects of intercellular communication.prereq: [Two semesters of physics/chemistry, calculus, one semester of systems-level physiology] or instr consent",
    "prereq": []
  },
  {
    "uid": "016571",
    "code": "PHSL6041",
    "subject": "PHSL",
    "number": "6041",
    "honors": false,
    "writingIntensive": false,
    "name": "Neurophysiology",
    "fullname": "Neurophysiology",
    "info": "Introduction to neurophysiology.",
    "prereq": []
  },
  {
    "uid": "007450",
    "code": "PHSL6051",
    "subject": "PHSL",
    "number": "6051",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology",
    "fullname": "Systems Physiology",
    "info": "General physiology, endocrine, circulatory, respiratory, digestive, energy metabolism, and renal physiology examined at molecular, cellular, and organ level. Emphasizes homeostasis and basic regulatory aspects of physiological processes of organ systems.prereq: [Prev or current] neuroscience course; [biochemistry, human anatomy] recommended",
    "prereq": []
  },
  {
    "uid": "794158",
    "code": "PHSL6061",
    "subject": "PHSL",
    "number": "6061",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology",
    "fullname": "Systems Physiology",
    "info": "Survey of general physiology, endocrine, circulatory, respiratory, digestive, energy metabolism, and renal physiology at molecular, cellular, and organ level. Emphasizes homeostasis and basic regulatory aspects of physiological processes of organ systems.",
    "prereq": []
  },
  {
    "uid": "010651",
    "code": "PHSL6101",
    "subject": "PHSL",
    "number": "6101",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Physiology",
    "fullname": "Human Physiology",
    "info": "Human physiology course for first year medical students.  This course covers muscle, cardiovascular, respiratory, gastrointestinal and renal physiology.  An integrative, systems approach is used and normal function is emphasized.",
    "prereq": []
  },
  {
    "uid": "826716",
    "code": "PHSL8211",
    "subject": "PHSL",
    "number": "8211",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology of Inflammation",
    "fullname": "Physiology of Inflammation in Disease",
    "info": "The activation of inflammatory pathways is part of the immune response against pathogens. However, observational studies and laboratory research indicate that inflammation is an important common causative factor in several chronic diseases and their comorbidities. In this course, we will explore the latest developments in the field of inflammation-mediated chronic diseases. The students will learn about the mechanisms by which non-infectious inflammatory processes mediate chronic disease. First, we will review basic concepts of innate and adaptive immune responses including the role of immune cells, recognition and signaling mechanisms, and inflammatory cytokines. We will learn basic concepts of immunity and inflammation followed by a discussion of how inflammation is a central mechanism of chronic diseases including diabetes (type I and II), atherosclerosis, heart failure, fatty liver disease, and hypertension. The inflammatory diseases that we will cover will include a short patient-case study. We will study technical advances in the fight against disease and explore future directions for new treatments involving immunotherapy or anti-inflammatory strategies. Courses in physiology, such as PHSL3051, 3061, and Microbiology and Immunology, such as MICB 4131 and MICB 8003, are recommended but not required.",
    "prereq": []
  },
  {
    "uid": "794121",
    "code": "PHSL8216",
    "subject": "PHSL",
    "number": "8216",
    "honors": false,
    "writingIntensive": false,
    "name": "Ans/Endo",
    "fullname": "Selected Topics in Autonomic and Neuroendocrine Regulation",
    "info": "Advanced seminar.",
    "prereq": []
  },
  {
    "uid": "794159",
    "code": "PHSL8222",
    "subject": "PHSL",
    "number": "8222",
    "honors": false,
    "writingIntensive": false,
    "name": "Cent Reg Auto Funct",
    "fullname": "Central Regulation of Autonomic Function",
    "info": "Neural/hormonal sensory pathways affecting central autonomic nuclei involved in maintenance of homeostasis. Current research on physiological control systems at cellular, organ, and integrative levels. Offered fall of odd-numbered years.prereq: NSC 5561 or instr consent",
    "prereq": {
      "code": "NSC 5561",
      "subject": "NSC",
      "id": "5561"
    }
  },
  {
    "uid": "807741",
    "code": "PHSL8232",
    "subject": "PHSL",
    "number": "8232",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Reading in Physiology",
    "fullname": "Critical Reading of Journal Articles in Physiology",
    "info": "Integrative physiology, critical reading of current scientific literature related to lecture topics in the Human Physiology course.prereq: concurrent registration is required (or allowed) in PHSL 5101, instr consent",
    "prereq": {
      "code": "PHSL 5101",
      "subject": "PHSL",
      "id": "5101"
    }
  },
  {
    "uid": "807742",
    "code": "PHSL8242",
    "subject": "PHSL",
    "number": "8242",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Skill Development",
    "fullname": "Professional Skills Development For Biomedical Scientists",
    "info": "Professional skills development, including critical evaluation of the scientific literature, short oral presentations, development of research project specific aims and grant writing.  Students will become familiar with strategies/mechanics of writing a grant proposal, NIH study section grant reviews, scientific presentations, dissecting scientific literature, and PubMed/NIHreporter tools. prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "819977",
    "code": "PHSL8252",
    "subject": "PHSL",
    "number": "8252",
    "honors": false,
    "writingIntensive": false,
    "name": "Obesity prevention",
    "fullname": "Obesity prevention, from the molecule to the bedside",
    "info": "This course will cover research topics in obesity prevention at a graduate level. Starting with the second week, a professor will review a topic area, and a student will present one assigned refereed research paper in the area, to be discussed by the class. All students will submit a weekly written critique of the manuscript, prior to the discussion. This 8000 level course is intended for graduate students pursuing graduate work in a health science-related program. Undergraduate degrees can include, but are not limited to, a bachelor of science in nutrition, physiology, integrative biology, or other related degree. The instructor will consider other majors on an individual basis and permission. Prereq: Must be in a graduate program. Must have taken PHSL 5101, if not, instructor consent.",
    "prereq": {
      "code": "PHSL 5101",
      "subject": "PHSL",
      "id": "5101"
    }
  },
  {
    "uid": "010775",
    "code": "PHSL8294",
    "subject": "PHSL",
    "number": "8294",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology Research",
    "fullname": "Research in Physiology",
    "info": "Directed laboratory research.prereq: Grad cellular and integrative Phsl major, instr consent",
    "prereq": []
  },
  {
    "uid": "013619",
    "code": "PHSL8310",
    "subject": "PHSL",
    "number": "8310",
    "honors": false,
    "writingIntensive": false,
    "name": "Top in Cell Physiol",
    "fullname": "Advanced Topics in Cellular Physiology",
    "info": "Discussion of primary research publications. Topics vary by semester.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "788260",
    "code": "PHSL8333",
    "subject": "PHSL",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788400",
    "code": "PHSL8444",
    "subject": "PHSL",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788513",
    "code": "PHSL8666",
    "subject": "PHSL",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "788641",
    "code": "PHSL8777",
    "subject": "PHSL",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "787919",
    "code": "PHSL8888",
    "subject": "PHSL",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  }
]