[
  {
    "uid": "005515",
    "code": "POL1001",
    "subject": "POL",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Amer Govt & Politics",
    "fullname": "American Democracy in a Changing World",
    "info": "This course is intended to introduce students to the expressed hopes of the American people for their government and to the institutions and processes that have been created and recreated to achieve these hopes. The course is designed to help students understand what liberal education is by engaging in the study of American politics as a fundamentally critical and creative enterprise, and by grappling with the most complex and challenging problems of political life, such as the sources of political equality and inequality, and the tension between individual aspirations and political control.  Questions of power and choice, opportunity and discrimination, freedom and restrictions on freedom are fundamental to the historical development of and current controversies within the American political system, and we will attend to all of these. We will explore topics including the ideas underlying the nation’s founding and its constitutional foundations; civil rights and civil liberties; the role of the United States in an increasingly globalized world; the structure and function of American political institutions; and the behavior of American citizens in the political process. In addition, we will learn to think and communicate like political scientists.  We will read primary documents, such as the Federalist papers, engage with scholarly arguments about the way the American political system works, and critically evaluate critiques of the American political system that have been offered from a variety of perspectives. By the end of the semester students should have a basic understanding of the structure and function of American government as well as an increased ability to critically reflect on the degree to which our institutions, processes, and citizens live up to the expectations placed on them.  Students will be able to identify, define, and solve problems and to locate and critically evaluate information.  Students will have mastered a body of knowledge and a mode of inquiry.  This course fulfills the liberal education requirements for the Social Sciences Core.",
    "prereq": []
  },
  {
    "uid": "007188",
    "code": "POL1015",
    "subject": "POL",
    "number": "1015",
    "honors": false,
    "writingIntensive": false,
    "name": "Mass Politics in a Media Age",
    "fullname": "Mass Politics in a Media Age",
    "info": "In a world of sound bites, soft news, and ubiquitous information/images, do we make rational voting decisions? Are we politically engaged?  Do politicians, the media, and political institutions promote or obstruct our efforts to be good citizens? What does responsible citizenship entail? What can be done to enhance citizenship?",
    "prereq": []
  },
  {
    "uid": "789790",
    "code": "POL1019",
    "subject": "POL",
    "number": "1019",
    "honors": false,
    "writingIntensive": false,
    "name": "Indigenous Peoples Global Pers",
    "fullname": "Indigenous Peoples in Global Perspective",
    "info": "Colonial experiences of selected indigenous peoples in Americas, Euroasia, Pacific Rim.",
    "prereq": []
  },
  {
    "uid": "006577",
    "code": "POL1025",
    "subject": "POL",
    "number": "1025",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Politics",
    "fullname": "Global Politics",
    "info": "Global politics is complex, fast-paced, and often confusing. This introductory course explores both the enduring challenges of international politics as well as more recent transformative trends. The course introduces theoretical traditions, but its focus is on making sense of real-world problems, both today and in the past. Why is the world organized into states, and what implications does the states system have for indigenous populations globally? Why and when do states go to war and use military force? Why do they sign international agreements and treaties, on matters from arms control to investment? In what ways do existing systems of international law and trade exacerbate or mitigate global inequities? Why has human rights emerged as a central problem in world politics? What are the prospects for international cooperation to address climate change? How have inequities and prejudices, along the lines of race and other categorical identities, shaped our world - from the practice of global security to the structures of the international political economy? These are among the pressing real-world questions that this course in Global Politics will address and that it will give you the tools to answer - though particular instructors will naturally emphasize different topics and questions. But the course will also highlight how our answers to these questions are changing along with the deep power structures of global politics - as US dominance wanes and others, most notably China, rise; as core ideas and discourses underpinning the international system, such as sovereignty, come under assault; as institutions, such as those governing international law, thicken; and as attention grows to the structuring effects of race and other ascriptive categories. Global Politics is an essential guide to our increasingly globalized world.",
    "prereq": []
  },
  {
    "uid": "006579",
    "code": "POL1026",
    "subject": "POL",
    "number": "1026",
    "honors": false,
    "writingIntensive": false,
    "name": "U.S. Foreign Policy",
    "fullname": "U.S. Foreign Policy",
    "info": "The United States is the most powerful country in the world. This means that how the United States behaves in the world is hugely important. As a result, we should all try to better understand U.S. foreign policy: why the U.S. behaves in the way it does, how the U.S. should behave, and how it has behaved in the past. These are the questions that this class tackles. For example, we'll ask: why does the United States play such an active role in world politics? Might this change in the future and has the United States always behaved in this way? Why is the United States so often at war despite being so militarily powerful and secure? What role has race and racism played in key episodes of U.S. foreign policy? Does the rise of China pose a threat to the United States and if so, what should the United States do about it? Why does the United States care so much about stopping other countries from acquiring nuclear weapons? Should addressing climate change be a key priority of U.S. foreign policy and how should it be addressed?",
    "prereq": []
  },
  {
    "uid": "006364",
    "code": "POL1054",
    "subject": "POL",
    "number": "1054",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics Around the World",
    "fullname": "Politics Around the World",
    "info": "This course is an introduction to the study of politics in different countries around the world. It focuses on domestic politics within countries, as opposed to a course in international relations, which focuses on relations between countries. Some of the questions we tackle include: Why are some countries prone to violent conflict while others remain peaceful? Why do some countries grow rich while others remain poor? Why does democracy emerge in some countries, while dictators hold onto power elsewhere? How do attitudes about gender and sexuality influence politics? Do particular religions, or the strength of religious faith, strengthen or weaken democracy? The readings and assignments help you make sense of the complexity of world politics - to sift through and distill the avalanche of information available and learn how to develop your own arguments about pertinent global issues. Upon completion of this course you will be able to understand and provide examples of 1) the difference between strong and weak states; 2) the distinctions between democratic and non-democratic forms of government; 3) the various ways democracies are governed; 4) arguments explaining the origin of democracy and the persistence of non-democracy; 5) the significance of different forms of political identity such as ethnicity, religion, and gender; 6) why some countries are rich while others remain poor; and 7) why some countries tax and spend more than others. Assignments seek to develop your skills at developing arguments through logic and evidence and to give you the ability to distinguish between a persuasive argument about politics and simply stating an opinion.",
    "prereq": []
  },
  {
    "uid": "005523",
    "code": "POL1201",
    "subject": "POL",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Ideas",
    "fullname": "Political Ideas",
    "info": "This course serves as an introduction to the study of political theory. Political theory analyzes the meaning and significance of fundamental concepts in politics. Starting from such basic concerns as the nature of politics, humans, power and justice, political theorists explore how these basic starting assumptions organize the norms, practices, and institutions of political and social order. To explore these topics, the field turns to key texts, as well as to political and social events and other media (film, historical documents, etc.). In this introductory course, students will investigate some of the basic texts in political theory, with the goal of learning how to read texts more analytically and to address fundamental questions in political theory. Among the topics that might be the nature of justice and injustice, political obligation and civil disobedience, democracy and other forms of governance. Students who complete this course will understand the deep issues about the nature of politics, will have learned to read and to analyze complex texts. They will also have had the opportunity to reflect upon their own ethical engagement in political life and upon the ways in which historically, political ideas change.",
    "prereq": []
  },
  {
    "uid": "800632",
    "code": "POL1234",
    "subject": "POL",
    "number": "1234",
    "honors": false,
    "writingIntensive": false,
    "name": "Citizen U",
    "fullname": "Citizen U: Building Tomorrow's Citizens Today",
    "info": "Questions of public engagement and higher education. Focuses on U as public space for citizen action/discussion. Hisotry of U, its ongoing initiatives in public engagement. Core concepts of public achievement. Model of public engagement practiced at U.",
    "prereq": []
  },
  {
    "uid": "788757",
    "code": "POL1903",
    "subject": "POL",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr or no more than 30 cr",
    "prereq": []
  },
  {
    "uid": "799129",
    "code": "POL1904",
    "subject": "POL",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman seminar",
    "fullname": "Topics: Freshman seminar",
    "info": "International perspectives.prereq: Fr or FRFY",
    "prereq": []
  },
  {
    "uid": "799291",
    "code": "POL1905",
    "subject": "POL",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788548",
    "code": "POL1908W",
    "subject": "POL",
    "number": "1908",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "788185",
    "code": "POL1909W",
    "subject": "POL",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "809815",
    "code": "POL1910W",
    "subject": "POL",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics titles printed in Class Schedule.prereq: Freshman",
    "prereq": []
  },
  {
    "uid": "817054",
    "code": "POL1911",
    "subject": "POL",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Dictatorships in Central Asia",
    "fullname": "Dictatorship and Violence in Central Asia and Afghanistan",
    "info": "This course is an introduction to Central Asia, a region of the world that has layers of history, culture, and politics, that extend back to the time of Alexander the Great's conquest, Islamicization by the Arabs, Tamerlane's empire, and the Great Game of the 19th century. Our focus will mainly be on the twentieth century to the present, a period of invasion and control by the Soviet Union, then independence and a 30 year struggle to establish independent states and new forms of political power.Otherwise known as the \"stans\" (the land of) - this region includes the land of the Kyrgyz, Kazakhs, Uzbeks, Turkmen, Tajiks, and Afghans. We will also discuss Azerbaijan, a Turkic post-Soviet republic in the Caucasus that is a neighbor to the Central Asian region. We will focus on the role of ethnic, religious, and national identities in Soviet and post-Soviet politics. We will explore their history, and especially the legacy of communism for the present day. We will particularly address the problems of the post-Soviet era, including political transition to new regimes, the struggle by some for democracy, human rights issues, the challenges of economic reform, environmental catastrophes, ethnic conflict, civil war, and the growth of radical Islamist movements. We will consider US policy in the region, and how it has positively or negatively affected political developments.",
    "prereq": []
  },
  {
    "uid": "817211",
    "code": "POL1912",
    "subject": "POL",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Cyberwar & Int'l Security",
    "fullname": "Cyberwar and International Security: Fact vs. Fiction",
    "info": "Cyberwar is constantly referred to in movies, television, and literature, but what does it really entail? How similar is cyberwar, or more ambiguous ?cyber weapons,? to traditional conceptions of war and international security? Can our theories about conventional warfare, nuclear war, espionage, and other types of confrontations help us to understand this new environment? In this course, we will watch and read the best and the worst depictions of cyber attacks. First, we will analyze whether or not these portrayals represent realistic situations, given current and developing technology. Next, we will analyze how traditional international security scholarship may help to inform our understanding of the changing global, technological landscape.",
    "prereq": []
  },
  {
    "uid": "817212",
    "code": "POL1913",
    "subject": "POL",
    "number": "1913",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Rights, Inhumane Wrongs",
    "fullname": "Human Rights, Inhumane Wrongs: Rights Violations and Armed Conflict",
    "info": "The Declaration of Human Rights, UN Protocols and Conventions, and the Geneva Conventions were created to protect and respect human dignity in times of war and beyond. Has this been the case in practice? This seminar is designed to introduce students to international mechanisms for the protection of human rights and how they have been both respected and ignored in contexts of armed conflict. We will explore cases from across the globe, from the Democratic Republic of Congo to the former Yugoslavia. Of special concern is how the human rights of women and children, have been violated during periods of violent conflict. Students will also explore how mass human rights violations perpetrated during these periods can be addressed and redressed, through a variety of transitional justice mechanisms, including international criminal tribunals, reparations, and traditional healing and cleansing practices. We will draw on a variety of sources, including films, documentaries, and other media. We will also benefit from guest speakers and a local human rights oriented fieldtrip. ",
    "prereq": []
  },
  {
    "uid": "817898",
    "code": "POL1914",
    "subject": "POL",
    "number": "1914",
    "honors": false,
    "writingIntensive": false,
    "name": "Young Adult Political Action",
    "fullname": "Generation Now: Young Adult Political Action in America",
    "info": "There is no shortage of challenging and contentious issues with which young adult Americans are confronting today. In this course, our focus will not be on debating these issues, but instead on exploring the translation of political goals into policy change on the ground. We will begin with the historical under-representation of young adult Americans in the political space, and the ways in which American political institutions structure, support, and inhibit young adult action in the linked spaces of politics and policy. We will explore ways in which individuals have challenged and reshaped these norms and institutions in the effort to make lasting social change. Along the way, we will learn the tools of policy analysis, with which students will be able to act more effectively in the American policy space. ",
    "prereq": []
  },
  {
    "uid": "817903",
    "code": "POL1915",
    "subject": "POL",
    "number": "1915",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Civil Wars",
    "fullname": "Contemporary Civil Wars",
    "info": "Why did civil war erupt in Syria, but not Jordan? Why has the Syrian regime targeted civilians so brutally? How will the rise of the Islamic State affect the conduct and conclusion of the civil war? How will the fractured nature of the rebels affect the possibilities for peace? Will additional international intervention prolong war or bring it to a close more quickly? Will the Kurdish minority that populates parts of Syria, Iraq, and Turkey finally gain an independent state? We will address these and other questions in this class, keeping in mind the effects that civil wars have on ordinary citizens in war-torn countries. We will focus particularly on developing an operational definition of civil war, understanding causes of civil war, examining strategies of violence employed in civil war, and civil war termination. Current events, such as those in Syria, Yemen, Colombia, Ukraine, South Sudan, and the Central African Republic will be brought into the class throughout the semester.",
    "prereq": []
  },
  {
    "uid": "826397",
    "code": "POL1916",
    "subject": "POL",
    "number": "1916",
    "honors": false,
    "writingIntensive": false,
    "name": "The Politics of Trade & Money",
    "fullname": "The Politics of Trade and Money",
    "info": "This seminar introduces students to the study of international political economy. After illuminating some important current issues about trade and monetary affairs, including recent efforts to restrict trade with China and China?s effort to promote economic development through its Belt and Road Initiative, we study the post-World War II evolution of the global trading and monetary systems. This includes evaluating some contending theoretical perspectives about these systems. Then we analyze the politics of trade. Among the topics singled out for close study are the distributional consequences of trade, particularly, how trade produces skill and occupational cleavages within democratic countries and, in turn, these cleavages produce populism. Institutions for governing trade like the World Trade Organization also are studied. The effects of monetary flows?both of currency and capital?are examined next. Topics in this part of the class include the American Federal Reserve as a world lender of last resort, the reasons why countries adopt the U.S. dollar as their currency, the demand for and consequence of direct foreign investment, and the workings and activities of the World Bank. In the closing weeks of the class we take a closer look at trade and monetary developments in Asia, Latin America, and Africa. The recent claim that developing countries are falling into to Chinese financed ?debt trap? is studied in these weeks.",
    "prereq": []
  },
  {
    "uid": "826398",
    "code": "POL1921",
    "subject": "POL",
    "number": "1921",
    "honors": false,
    "writingIntensive": false,
    "name": "Dictators Democracy Dev EAsia",
    "fullname": "Dictatorship, Democracy, and Development in East Asia",
    "info": "Home to the world?s most advanced economies and mature democracies, but also history?s biggest authoritarian party and one of the poorest totalitarian states ? East Asia is a region full of contrasts despite their interconnected pasts. How do we understand the political trajectories of China, Japan, North/South Korea, and Taiwan, as they experienced significant socioeconomic transformations from the late 19th century up until the present? In this freshman seminar, we will examine the entangled relationship between modernization and political systems through a comparative lens, and ask what East Asia can teach us about the evolution and persistence of democratic and authoritarian regimes in the rest of the world.",
    "prereq": []
  },
  {
    "uid": "809816",
    "code": "POL1942",
    "subject": "POL",
    "number": "1942",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics titles printed in Class Schedule.prereq: Freshman",
    "prereq": []
  },
  {
    "uid": "006963",
    "code": "POL3051",
    "subject": "POL",
    "number": "3051",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Analysis",
    "fullname": "Power and Choice: Who Gets What, When, and Why",
    "info": "Introduction to major concepts and issues in political science including political participation, policy making; justice, legitimacy, political development, and types of political systems. Explore empirical and normative problems and compare among major countries.                                                                                       ",
    "prereq": []
  },
  {
    "uid": "816751",
    "code": "POL3065",
    "subject": "POL",
    "number": "3065",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Engagement Careers",
    "fullname": "Political Engagement Careers: Planning and Preparing For Your Future",
    "info": "Are you interested in pursuing a career in public service? Do you plan to run for office in the future, or work in a government agency (such as the State Department or the FBI or the MN DNR), or become a professional campaign manager or lobbyist, or work as an issue activist on a cause important to you? Would you like to learn more about the variety of public service careers open to a college graduate? Do you wonder what motivates people to pursue careers in politics, public administration, and community service, and how these motivations vary across career fields? Would you like to explore some options for future internship or service learning while at the University? Then this course is for you!This course is the Political Science Department's introduction to careers in political and civic engagement. Through readings focused on theories about and case studies of political engagement, and on the ethics of politics and public service, numerous guest speakers with extensive experience as public service professionals, and a discussion-oriented class format, we will explore the meaning of public service and the main types of public service careers that you could pursue. We will think about the virtues and challenges associated with doing public service work, and how these differ across different types of jobs and venues for serving the public. Finally, you will acquire practical knowledge and skills related to the search for public service work opportunities, including how to write a resume and cover letter, how to conduct an informational interview, networking, and the job search and application process. Intended primarily for first- and second-year undergraduates, but open to students of any major at any point in their undergraduate program.",
    "prereq": []
  },
  {
    "uid": "005519",
    "code": "POL3080",
    "subject": "POL",
    "number": "3080",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship in Politics or Govt",
    "fullname": "Internship in Politics or Government",
    "info": "Students search for and arrange an internship with an organization or office working in government or politics, and then complete academic coursework in association with their internship.prereq: instr consent, dept consent",
    "prereq": []
  },
  {
    "uid": "005261",
    "code": "POL3085",
    "subject": "POL",
    "number": "3085",
    "honors": false,
    "writingIntensive": false,
    "name": "Quant. Political Analysis",
    "fullname": "Quantitative Analysis in Political Science",
    "info": "POL 3085 teaches students how to study politics scientifically and introduces them to how to use quantitative analysis to answer political questions. The first part of the class covers how to formulate a theory (a possible answer to a question), specify testable hypotheses (what you would see if the theory is correct or incorrect), and set up a research design to test those hypotheses. In the second part of the class, we cover quantitative data analysis, beginning from preliminary statistical analysis to multivariate linear regression. There is no mathematical or statistical background required for this course. By the end of the class, students should be able to ask and answer political questions using quantitative data and fluently evaluate statistical analyses of political phenomena in the media and many academic articles.",
    "prereq": []
  },
  {
    "uid": "006675",
    "code": "POL3210",
    "subject": "POL",
    "number": "3210",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Political Theory",
    "fullname": "Topics in Political Theory",
    "info": "Topics courses provide students with the opportunity to study key concepts, thinkers, and themes in Political Theory not normally covered in the standard slate of course offerings. The specific content of these courses varies considerably from year to year. See the current class schedule for details.",
    "prereq": []
  },
  {
    "uid": "006677",
    "code": "POL3215",
    "subject": "POL",
    "number": "3215",
    "honors": false,
    "writingIntensive": false,
    "name": "Controversies",
    "fullname": "Current Controversies and Problems in Politics",
    "info": "Exploration and examination of contemporary controversies in American politics (e.g., affirmative action, health care, abortion, euthanasia) as they affect questions of citizenship and cultural diversity.",
    "prereq": []
  },
  {
    "uid": "006680",
    "code": "POL3225",
    "subject": "POL",
    "number": "3225",
    "honors": false,
    "writingIntensive": false,
    "name": "American Political Thought",
    "fullname": "American Political Thought",
    "info": "This course provides an introduction to several key periods and some of the leading concepts and debates in American political thought. It might also focus on a broader theme such as: conceptions of destiny, mission, and exceptionalism; arguments over economic development and inequality; or debates over government and corporate power. The course will begin with Puritan religious and political thought, tracing its secularization over time. Considerable attention will be paid to the ideas behind the Declaration of Independence and the Constitution, such as the social contract and the right of resistance to civil authority, civic republicanism, and the founders’ new science of politics and government. The course will consider some if not all of the following: debates over slavery and emancipation, women’s rights, the rise of imperialism and nationalism, race and racism, and the rise of rule by public and private bureaucratic organizations, and the consequences of these developments for the possibility of continued individual liberty, equality, and justice. This course requires considerable reading of difficult texts. The ultimate goal of this course is for students to gain a deeper understanding of American political thought as a product of the country’s ever-evolving political discourse. prereq: Suggested prerequisite POL 1201",
    "prereq": {
      "code": "POL 1201",
      "subject": "POL",
      "id": "1201"
    }
  },
  {
    "uid": "006681",
    "code": "POL3235W",
    "subject": "POL",
    "number": "3235",
    "honors": false,
    "writingIntensive": true,
    "name": "Democracy and Citizenship",
    "fullname": "Democracy and Citizenship",
    "info": "This course considers the nature of contemporary democracy and the role that members of the political community do, can, and should play.  While approaches in teaching the class vary, students can expect to read historical and contemporary texts, see films and videos, to approach questions about the nature of democracy, justifications for democracy, and challenges faced by contemporary democracy as it relates to racial inequality, immigration, gender inequality, and ecological crises.  Topics will include: the centrality of social movements for democracies; deliberative and participatory democracy; as well as questions about how members of political communities can best participate in democratic life to address structural inequalities. Students will write a longer essay that allows them to demonstrate their capacities to understand and explain complex ideas and to make a theoretically compelling argument, using appropriate supporting evidence.prereq: Suggested prerequisite 1201",
    "prereq": {
      "code": "POL 1201",
      "subject": "POL",
      "id": "1201"
    }
  },
  {
    "uid": "813938",
    "code": "POL3237",
    "subject": "POL",
    "number": "3237",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum: Democracy & Citizen",
    "fullname": "Practicum: Democracy and Citizenship",
    "info": "Students complete at least 2 hours/week of a community service-learning or individual civic engagement project.prereq: concurrent registration is required (or allowed) in  POL 3235W, instr consent",
    "prereq": {
      "code": "POL 3235",
      "subject": "POL",
      "id": "3235"
    }
  },
  {
    "uid": "006686",
    "code": "POL3251W",
    "subject": "POL",
    "number": "3251",
    "honors": false,
    "writingIntensive": true,
    "name": "Power, Virtue, and Vice",
    "fullname": "Power, Virtue, and Vice: Ancient and Early Modern Political Theory",
    "info": "Key concepts of contemporary political life such as democracy, tyranny, authority and indeed politics itself derive from ancient sources. This course offers students an opportunity to return to the foundations of this vocabulary by delving into work by such major thinkers as Plato, Aristotle, Augustine, Aquinas, and Machiavelli. Lectures and discussion shall consider the endurance of certain basic questions of political life, such as: What is justice? What is the best regime? What is the relationship between human nature and political order? Can politics be virtuous and, if so, in what way? The course will also consider the radically diverse responses to these essential questions through examination of a wide range of historical periods and the unique terms of political order each offered. Previous iterations of the course have included examination of the Classical Greek city-state system and its fragile experiments with democracy; the rise and fall of the Roman empire; the establishment of Western Christendom; the Renaissance, so-called discovery of the New World, and dawn of the modern era. Students will gain a glimpse into worlds preoccupied by matters of truth, virtue and nobility, but also widely populated by slavery, imperialism, violence, and religious strife. In this way, the study of ancient theory is intended to serve as both supplement and challenge to the terms of contemporary political life.",
    "prereq": []
  },
  {
    "uid": "006687",
    "code": "POL3252W",
    "subject": "POL",
    "number": "3252",
    "honors": false,
    "writingIntensive": true,
    "name": "Modern Political Thought",
    "fullname": "Revolution, Democracy, and Empire: Modern Political Thought",
    "info": "From the seventeenth through the nineteenth centuries, Europe and its colonies were wracked by large scale, sweeping changes: from the violent emergence of the sovereign state, to intense religious conflict, to geographic expansions at once transformative and brutal in search of new economic markets. These changes posed extraordinary challenges to usual ways of conceiving of political order and governance. Our course this semester will read these changes through three key concepts – revolution, democracy, and empire. Class discussion will seek to understand different meanings of these concepts, their political stakes, and ways of knowing how to move between political ideals and historical examples. Students will read a range of materials – from primary historical sources, to philosophic texts, political pamphlets and treatises, and travel journals – so as to study the effects on both the European context and beyond.prereq: Suggested prerequisite 1201",
    "prereq": {
      "code": "POL 1201",
      "subject": "POL",
      "id": "1201"
    }
  },
  {
    "uid": "811287",
    "code": "POL3265",
    "subject": "POL",
    "number": "3265",
    "honors": false,
    "writingIntensive": false,
    "name": "Ideas & Protest French Postwar",
    "fullname": "Ideas and Protest in French Postwar Thought",
    "info": "France witnessed a number of extraordinary events in the 20th century:  the carnage and trauma of World Wars I and II; the Vichy regimes collaboration with German Nazis; the general strike and student protests of the 1960s; the tensions prompted by anti-colonialism and later decolonization in North Africa; and the challenges of post-colonialism and racial politics. This course will examine these events, the political and ethical challenges they raised, and the intellectuals who shaped the ensuing public debates. It will draw on historical documents, cultural media (e.g. posters, art, film), and philosophical texts to explore contemporary France in its century of politics and protest.  Thinkers range from film-maker Gillo Pontecorvo, to philosopher-playwright Jean-Paul Sartre, to philosopher Michel Foucault.",
    "prereq": []
  },
  {
    "uid": "817073",
    "code": "POL3272",
    "subject": "POL",
    "number": "3272",
    "honors": false,
    "writingIntensive": false,
    "name": "Colonial Encounters",
    "fullname": "Colonial Encounters",
    "info": "If politics classically is the exercise of power by rulers over the ruled, how have different communities, traditions, and contexts sought to organize this power and render it just?  What are the lessons to be learned from looking to past experiences with political communities ranging in size from the face-to-face polis to the far-flung reaches of empire? How does the ‘discovery’ of other societies disorient our usual frames of reference for thinking about political community? What different frames might we use? What should we make of problems that seem to exceed the capacity of existing institutions to manage, such as mass violence and total war? The aim of this course is to examine exemplary moments that consider the radical conflict of interpretations that can arise when different cultures come into contact with one another (whether through trade, war, intellectual exchange, or the like), and how these exchanges transform the scale of political community (local, regional, global, universal). Here, we are concerned with large-scale upheaval, processes that are more than simply difficult political problems, but in fact transform the very institutions, relationships, and concepts through which we come to understand what political community is and can be. The substantive focus of the course varies according to instructor, and may include: Colonial Encounters; the Black Atlantic; Revolutionary Moments; Colonialism and the Post-colony.",
    "prereq": []
  },
  {
    "uid": "825370",
    "code": "POL3282",
    "subject": "POL",
    "number": "3282",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Political Thought",
    "fullname": "Black Political Thought: Conceptions of Freedom",
    "info": "On January 21, 1964, Ella Baker, one of the most important Black leaders of the Civil Rights Movement stood in front of a large crowd in Hattiesburg, Mississippi and said: \"Even if segregation is gone, we will still need to be free; we will still have to see that everyone has a job. Even if we can all vote, but if people are still hungry, we will not be free. Remember, we are not fighting for the freedom of the Negro alone, but for the freedom of the human spirit, a larger freedom that encompasses all mankind.\"With these words, Baker held before the crowd a political vision that went beyond the immediate goals of social struggle and defined one of the central impulses of Black political thought: to articulate a large and expansive conception of freedom. In this course, our main objective is to enter an intellectual terrain of rich and vibrant debates between African American political thinkers over the meaning of Black freedom.We will explore questions about 1) the geographical reach of their visions of freedom 2) their strategies for agitating for and achieving freedom 3) their different understandings of the nature of domination and how this informs their conception of freedom and 4) their emphasis on political affect in the struggle for freedom.Our orientation will be historical and theoretical. To this end, we reconstruct theoretical debates from four important periods of African American history. 1) pre-Civil War debates about the abolition of slavery (1830-1860) 2) Turn of the century debates about racial progress (1880-1910) 3) Civil rights era debates about integration and separatism (1950-1970) and 4) contemporary debates about law enforcement, police killings, mass incarceration, and political disenfranchisement (1990-present).",
    "prereq": []
  },
  {
    "uid": "006531",
    "code": "POL3306",
    "subject": "POL",
    "number": "3306",
    "honors": false,
    "writingIntensive": false,
    "name": "Presidential Leadership",
    "fullname": "Presidential Leadership and American Democracy",
    "info": "To most Americans—if not most human beings—the President of the United States is probably the most powerful person on the planet. This course examines how, why, and whether that is the case. What does the US President do, and why? Why is so much power entrusted to just one person? Students will critically analyze these questions and synthesize answers by evaluating the history, evolution, and current state of the \"highest office in the land.\" ",
    "prereq": []
  },
  {
    "uid": "800677",
    "code": "POL3308",
    "subject": "POL",
    "number": "3308",
    "honors": false,
    "writingIntensive": false,
    "name": "Congress Pol & Inst",
    "fullname": "Congressional Politics and Institutions",
    "info": "This course is an introduction to the politics of the U.S. Congress and the federal legislative process. Throughout the semester, we will focus on the behavior of individual legislators and the role that they play in crafting federal legislation in policy areas such as healthcare, civil rights and the environment. We will devote special attention to changes in Congress, as well as current political and scholarly controversies such as congressional confirmation process of Supreme Court justices, congressional war powers, the influence of parties, and campaign finance. The theme of the course is why do legislators behave as they do and who interests do they represent.",
    "prereq": []
  },
  {
    "uid": "800684",
    "code": "POL3309",
    "subject": "POL",
    "number": "3309",
    "honors": false,
    "writingIntensive": false,
    "name": "Supreme Court Politics",
    "fullname": "U.S. Supreme Court Decision-Making, Process, and Politics",
    "info": "The principal purpose of this course is to introduce you to judicial politics and decision-making of the U.S. Supreme Court. Specifically, we will examine theoretical issues regarding judicial process and politics. Unlike constitutional law and civil liberties classes, this course does not study legal doctrine. Rather, it examines political aspects of the legal system with an emphasis on the social scientific literature about how the U.S. Supreme Court functions. Thus, we will cover nominations of justices, decision making models, and how justices interact with one another and the political world beyond the ivory tower.Recommended prerequisite: POL 1001",
    "prereq": {
      "code": "POL 1001",
      "subject": "POL",
      "id": "1001"
    }
  },
  {
    "uid": "801694",
    "code": "POL3310",
    "subject": "POL",
    "number": "3310",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in US Politics",
    "fullname": "Topics in American Politics",
    "info": "Topic in American politics, as specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "818871",
    "code": "POL3311",
    "subject": "POL",
    "number": "3311",
    "honors": false,
    "writingIntensive": false,
    "name": "Law, Justice & Film",
    "fullname": "Law and Justice: The View From Hollywood",
    "info": "Politics and the law have played major thematic roles in American films.  This course analyzes eight films that focus on justice, the law, and the legal system, to see what they tell us about political and legal culture, and what messages (if any) they have for contemporary politics.  To that end, we will read about, watch, talk about, and write about films.  Mostly we will be focusing on questions about the relationship between law and justice, the practice of law, and the role of courts and trials in a political system; however, many other issues will arise in the course of these discussions—race/class/gender and the law, legal ethics, legal education, the adversarial system, the relationship between law and popular culture, among others.  You should expect to develop a more in-depth understanding of these issues as well as a better appreciation of the cultural and political significance of the way that law, lawyers, and judges are depicted in the movies.",
    "prereq": []
  },
  {
    "uid": "811434",
    "code": "POL3317",
    "subject": "POL",
    "number": "3317",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Politics",
    "fullname": "Food Politics: Actors, Arenas, and Agendas",
    "info": "Food:  Everyone eats it but we increasingly fight about how it is grown, transported, processed and consumed.  This disagreements find their ways into politics, whether it is neighbors battling over backyard chicken ordinances, Members of Congress arguing over how best to protect the safety of the food supply, or countries engaging in trade wars to limit the importation of agricultural products.  This course takes a broad, multi-disciplinary perspective on food politics drawing on concepts and ideas from political science, sociology, and economics to analyze several contemporary \"food fights,\" including agricultural trade, U.S. farm bills, the National School Lunch Program, proposals for taxing sodas and fatty foods, and the labeling of genetically modified food.  Take this course if you want to learn more about the various resources, arguments, evidence, and rules of engagement that structure contemporary food politics. This course satisfies the Social Science Core of the Liberal Education requirements and is an eligible elective for the public health minor in CLA and the Food Systems major in CFANS. ",
    "prereq": []
  },
  {
    "uid": "793703",
    "code": "POL3319",
    "subject": "POL",
    "number": "3319",
    "honors": false,
    "writingIntensive": false,
    "name": "Education & the American Dream",
    "fullname": "Education and the American Dream",
    "info": "What role does education play in American democracy? What role should it play? Does American education, particularly public education, live up to its citizens' hopes and expectations? And, perhaps most importantly, what do we mean by a \"good education\"? This is a question with deep historical roots in this country, one that is the subject of current policy debates and one that cannot be separated from questions of discrimination and inequality. The over-arching theme of the course is to wrestle with what it means to be an educated citizen in the context of historical struggles to achieve that vision in the face of multiple and inter-related inequalities and competing visions about how to make the American dream a reality in the field of public education. No one political perspective will be offered or favored. No magic powder will be revealed on the last day of the course. The fact is that the underlying issues are really complicated, often seemingly intractable, and very, very political. This course is intended as introduction to education politics and policy in the United States. It will focus on K-12 education, especially in the public system. It is designed for any student who might have an interest in exploring education, public policy, or American government. Topics will include equality of educational opportunity, educating democratic citizens, school finance, the role of political institutions in making educational policy, and efforts to reform and remake American education, including charter schools, private school vouchers, and standardized testing. By the end of the course, students should have a basic understanding of the provision of public education in the United States, including the ways in which education is governed and the institutions involved in that governance. Students should be able to critically reflect on the degree to which American education fulfills the sometimes-competing goals Americans have for their schools. This course fulfills the Social Sciences Core of the University liberal education requirements. In this course students will act as policy analysts, with all of the complexity that such a task entails in the field of American public education. This course also fulfills the Diversity and Social Justice in the United States theme of the University liberal education requirements.",
    "prereq": []
  },
  {
    "uid": "005520",
    "code": "POL3321",
    "subject": "POL",
    "number": "3321",
    "honors": false,
    "writingIntensive": false,
    "name": "American Public Policy",
    "fullname": "Issues in American Public Policy",
    "info": "This course examines the politics of social policy in the United States. Recent controversies over Social Security reform, the Patient Protection and Affordable Care Act (?Obamacare?), and the No Child Left Behind Act and Common Core showcase the profound political and substantive impact of this topic. The first half of the course places the United States in comparative perspective. Scholars typically describe the United States as a ?laggard? where social policies developed relatively late, grew relatively slowly, and are less generous than are corresponding policies in other advanced industrial democracies. Is this an accurate portrayal of American social policy? Recent scholarship challenges the conventional wisdom, suggesting that the United States does not necessarily do less in terms of social policy but that it relies on an unusual set of policy tools to pursue objectives like poverty alleviation. What explains the distinctive shape of American social policy? This course investigates the impact of political culture, the relative power of various interest groups, the American constitutional system, and other factors. The second half of the course examines recent trends in American social policy, focusing on four specific policy areas: pensions, health care, education, and income support. It examines both the historical origins of contemporary American policies and recent reform proposals. A major theme of the course is that it is impossible to understand the contemporary shape of social policy, and the positions of specific stakeholders, without understanding the long-term historical processes that have shaped, and that continue to shape, the present political terrain of preferences and actors. New generations of leaders do not have the opportunity to build social policy from scratch. Rather, they have to react to what already exists. Some reforms will seem like logical extensions of what is already in place, while existing programs might make other alternatives difficult if not impossible to pursue. By understanding the roots of contemporary American social policy it becomes possible to devise a political strategy for major policy change.",
    "prereq": []
  },
  {
    "uid": "005521",
    "code": "POL3323",
    "subject": "POL",
    "number": "3323",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Tolerance in the US",
    "fullname": "Political Tolerance in the United States",
    "info": "Intergroup conflict continues to be one of the defining fault lines in American politics. Most obviously, the existence of racial inequality has consequences for any given individual’s social and economic standing.  However, it also has had an enormous impact on the pattern of attitudes and beliefs that have served as the backdrop for many of society’s most pressing political debates and conflicts. The purpose of this course is to provide students with an introduction to how political scientists have studied ethno-racial attitudes and the larger problem of inter-ethnic conflict in American society. ",
    "prereq": []
  },
  {
    "uid": "802082",
    "code": "POL3325",
    "subject": "POL",
    "number": "3325",
    "honors": false,
    "writingIntensive": false,
    "name": "U.S. Campaigns & Elections",
    "fullname": "U.S. Campaigns and Elections",
    "info": "Presidential/congressional campaigns/elections in the United States. How political scientists study electoral politics.  Theoretical generalizations about candidates, voters, parties, and the media. Ways electoral context and \"rules of the game\" matter.",
    "prereq": []
  },
  {
    "uid": "006537",
    "code": "POL3327",
    "subject": "POL",
    "number": "3327",
    "honors": false,
    "writingIntensive": false,
    "name": "City Politics in the US",
    "fullname": "Suburbs, Stadiums, and Scandals: The Politics of American Cities",
    "info": "Study of politics and policy in the contemporary American city; role of local government in a federal system; evolution of cities in the United States; forms and structures of local government; local politics and patterns of power and influence; special topics in Minnesota local politics.prereq: 1001, non-pol sci grad major or equiv or instr consent",
    "prereq": {
      "code": "POL 1001",
      "subject": "POL",
      "id": "1001"
    }
  },
  {
    "uid": "818241",
    "code": "POL3329",
    "subject": "POL",
    "number": "3329",
    "honors": false,
    "writingIntensive": false,
    "name": "Federalism & Community in US",
    "fullname": "The Balance of Power: Federalism & Community in the United States",
    "info": "The appropriate balance of power between the national government and the states has been the subject of intense debate since the United States became an independent country in the eighteenth century, and it has never been resolved. This unresolved controversy has profound democratic and policy implications. Some of the political and social rights that are part and parcel of what it means to be a member of the American community are influenced by geography and the specific state in which an individual resides. For example, state governments make numerous decisions that define voter eligibility, an especially important form of community membership and political participation. In addition, federalism strongly affects the policymaking process. In fields as diverse as environmental protection and health care, the relationship between the national government and the states affects which policies are adopted and how they work in practice. While federalism is rarely at the forefront of the minds of the American public, it plays a central and increasingly important role in the U.S. political system. This course seeks to give students a better understanding of American federalism. By examining both the historical evolution of intergovernmental relations in the United States and contemporary policy debates, it also aims to help students develop the substantive knowledge and analytical skills they need to become critical thinkers. All of the writing assignments that students will complete in the course have been designed with this objective in mind, and the course will emphasize systematic thinking about politics, the explication of logically coherent arguments, and the use of relevant and appropriate empirical evidence to evaluate those arguments. The successful development of the critical thinking and writing skills emphasized in this course will enable students to communicate effectively in a variety of future roles, including as employees and citizens.",
    "prereq": []
  },
  {
    "uid": "005522",
    "code": "POL3352W",
    "subject": "POL",
    "number": "3352",
    "honors": false,
    "writingIntensive": true,
    "name": "Fldwrk in Legislat",
    "fullname": "Fieldwork in the Legislature",
    "info": "Field study of Minnesota Legislature; campaigns and elections, party leadership, committee structure, staffing, lobbying, relations with other branches. Students arrange work assignments with legislators.",
    "prereq": []
  },
  {
    "uid": "825966",
    "code": "POL3362",
    "subject": "POL",
    "number": "3362",
    "honors": false,
    "writingIntensive": false,
    "name": "Race, Class, and US Policy",
    "fullname": "Politics of Race, Class, and US Social Policy",
    "info": "This course examines the causes and effects of the vast social and economic inequalities that exist between blacks and whites in US society. Specifically, the course examines the complex role that federal, state, and local government plays in creating as well as addressing high rates of poverty, unemployment, violent crime, residential segregation, and under performing schools found in African American communities. Students will examine critically whether class-based policies such as Social Security, Medicaid, and unemployment insurance are more effective than race-based affirmative action policies in reducing the racial disparities between blacks and whites. Further, in discussions, the course will emphasize general concepts that recur in the readings and in other classes. Students will master the key concepts in race and ethnic studies necessary to conduct original research and policy analysis.",
    "prereq": []
  },
  {
    "uid": "016170",
    "code": "POL3365",
    "subject": "POL",
    "number": "3365",
    "honors": false,
    "writingIntensive": false,
    "name": "Government and Medicine",
    "fullname": "Government and Medicine",
    "info": "Why is the United States the only industrialized nation that lacks national health insurance? Should the government regulate health care?  Who should address these issues? Introduction to American government. Health care policy, constitution, elections, congress, the presidency.",
    "prereq": []
  },
  {
    "uid": "818759",
    "code": "POL3409",
    "subject": "POL",
    "number": "3409",
    "honors": false,
    "writingIntensive": false,
    "name": "Authoritarian Politics",
    "fullname": "Introduction to Authoritarian Politics",
    "info": "For much of history, states were largely organized along dictatorial principles. There were the days of emperors and empresses, of kings and queens, of rulers who ruled not because they were elected by their subjects, but because they saw it as their right to reign and were shrewd enough to maintain their position in power. While it is true that monarchies have virtually disappeared from the modern political landscape, the same cannot be said about dictatorships.The purpose of this class is to examine this regime type by introducing students to the current literature on dictatorships. The core questions that will be addressed in the class are as follows: Are dictatorships qualitatively different from democracies or do regimes instead lie somewhere on a democracy-dictatorship continuum? How do dictators survive in power? In the absence of free and fair elections, how does the transfer of power occur in this political setting? In asking these questions, the goal is to go beyond the often simplistic descriptions of dictators as the all-powerful and omnipotent tyrant, the one who does as he pleases without having to fear any repercussions for his actions. Instead, we will learn that the dictator is only one among may other political elites that make up the regime and to survive, much less thrive, he must traverse the terrain of power politics with the utmost care.",
    "prereq": []
  },
  {
    "uid": "801690",
    "code": "POL3410",
    "subject": "POL",
    "number": "3410",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Comparative Politics",
    "fullname": "Topics in Comparative Politics",
    "info": "Topics of current analytical or policy importance to comparative politics. Topics vary, as specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "816980",
    "code": "POL3423",
    "subject": "POL",
    "number": "3423",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics of Disruption",
    "fullname": "Politics of Disruption: Violence and Its Alternatives",
    "info": "Political struggles aimed at undermining the existing political order have been a pervasive feature of global politics. Modern states have constantly been sites of relentless challenges from their citizenry, which sometimes take the form of non-violent action while on other occasions manifest in terrorism and violence. This course introduces students to the politics of disruption and violent and non-violent struggles targeted at bringing about political change. We will study a range of manifestations of such struggles focusing on some well-known cases such as the US civil rights movement, the Arab Springs, the Ferguson riots and the Islamic State (ISIS). Can non-violent resistance succeed against a coercive state? Why do individuals and groups participate in high-risk political struggles? What explains patterns of violence in civil conflicts? What are the effects of violence? What facilitates peace? This course will enable you to answer these questions.",
    "prereq": []
  },
  {
    "uid": "816409",
    "code": "POL3431",
    "subject": "POL",
    "number": "3431",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics of India",
    "fullname": "Politics of India",
    "info": "The course introduces students to the politics of India; a non-Western, parliamentary political system that stands out as a bastion of democracy in the developing world, despite underdevelopment & significant ethno-religious divisions. By focusing on India, we offer an understanding of the problems of democratization, underdevelopment, governance & political violence. We examine Indias political institutions & challenges confronting the institutions such as socio-economic inequalities, social exclusion, social divisions, ethno-religious & ideological insurgencies, criminalization of politics & rampant corruption. The course enables students to answer important questions: Why did democracy endure in post-colonial India when much of the developing world endured authoritarian regimes? What accounts for the persistence of ethno-religious conflict & violence? What determines a countrys approach to socio-economic development? What accounts for Indias economic development over the last few decades? How do we explain the existence of political democracy and rampant corruption?",
    "prereq": []
  },
  {
    "uid": "825621",
    "code": "POL3435",
    "subject": "POL",
    "number": "3435",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Dynam Horn of Afric",
    "fullname": "Political Dynamics in the Horn of Africa",
    "info": "Who wields political power? Who challenges those in power? And how do they legitimize their claims and go about enforcing them? These are the core questions that will guide our exploration of the political dynamics in the Horn of Africa. Just like most regions in Africa, the Horn is home to diverse cultures and languages. What distinguishes it, however, is the contested nature of state borders, which have been redrawn in ways not observed anywhere else in Africa since the end of European colonialism. The purpose of this class is to delve deeper into these conflicts, to examine the interactions between incumbent governments, armed rebel groups, and international actors in shaping war and peace in the Horn. Throughout this journey, we will pay special attention to ideas of sovereignty, identity, and violence and draw on literature outside of the Horn to help us better dissect what is going on within it. ",
    "prereq": []
  },
  {
    "uid": "006965",
    "code": "POL3441",
    "subject": "POL",
    "number": "3441",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol/Environ Protect",
    "fullname": "Politics of Environmental Protection",
    "info": "How the American political system deals with environmental issues, how third world countries deal with problems of environmental protection and economic growth, and the way the international community deals with global environmental problems.",
    "prereq": []
  },
  {
    "uid": "014136",
    "code": "POL3451W",
    "subject": "POL",
    "number": "3451",
    "honors": false,
    "writingIntensive": true,
    "name": "Politics/Soc in New Europe",
    "fullname": "Politics and Society in the New Europe",
    "info": "The devastation of Europe through two World Wars put the deadly results of ultra-nationalism on full display. To avoid such destruction again, a group of European technocrats and leaders embarked on a mission of incrementally deepening economic and later, social partnerships between an ever-expanding number of European countries. These efforts culminated in the birth of the European Union in the late 20th Century. From its inception, the Union has found obstacles in the forms of a weak institutional structure and authority, deep skepticism of a central European authority, financial crisis, ethnic anxiety, and resurgent nationalism. Yet, the continuation and strengthening of the Union is seen as the antidote to the rise of anti-democratic and authoritarian tendencies on the continent. Some of the key questions that we will engage in are: What are the ideological and historical roots of the European Union? What are the structural flaws of the Union?  What are the obstacles to a stronger Union?  Is the Union still or even more essential than ever? What are the ways the Union could collapse from within and from the intervention of outside forces?",
    "prereq": []
  },
  {
    "uid": "006528",
    "code": "POL3462",
    "subject": "POL",
    "number": "3462",
    "honors": false,
    "writingIntensive": false,
    "name": "Race, Class, and Ethnicity",
    "fullname": "The Politics of Race, Class, and Ethnicity in the United States, South Africa and Cuba",
    "info": "Is it true that since the election of Donald Trump, the United States is more racist than ever? Is racism on the rise elsewhere in the world?  Consistent with the goals of liberal education, this course helps students navigate their way through what is often seen as one of the most perplexing and intractable problems in today's world—racial and ethnic conflicts. It supplies a set of theoretical tools that can be utilized in the most diverse of settings—including, though to a lesser extent, gender. Rather than looking at these conflicts, as the media and popular knowledge often does, as centuries-old conflicts deeply set in our memory banks, a script from which none of us can escape, the course argues that inequalities in power and authority—in other words, class—go a long way in explaining racial and ethnic dynamics. To support this argument, the course examines the so-called “black-white” conflict in three settings, the U.S., South Africa, and Cuba. While all three share certain similarities, their differences provide the most explanatory power. Most instructive is the Cuba versus U.S. and South Africa comparison. Specifically, what are the consequences for race relations when a society, Cuba, attempts to eliminate class inequalities? The course hopes to show that while we all carry with us the legacy of the past, we are not necessarily its prisoners.",
    "prereq": []
  },
  {
    "uid": "808464",
    "code": "POL3464",
    "subject": "POL",
    "number": "3464",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics Economic Inequality",
    "fullname": "The Politics of Economic Inequality",
    "info": "Distributional issues are at the core of the study of politics. This is because while democracy is premised on formal political equality, if wealth and property can shape political power then equal rights do not mean equal influence. This class meets the UMN \"Race, Power, and Justice in the US\" Liberal Education theme by engaging the question of the tension between democracy and economic inequality. What policies increase or decrease inequality? What are the political consequences of rising inequality - in general and particularly for ethnic and racial minorities? The course focuses on the USA but puts American politics in global perspective. To do so, the course explores how dominant socio-economic groups in the US have historically shaped political institutions and attitudes to generate, perpetuate, and defend inequality. We will also explore the extent to which and why white and non-white citizens have bought into the concept of the \"American Dream,\" undermining efforts to redress social injustice.",
    "prereq": []
  },
  {
    "uid": "808463",
    "code": "POL3465",
    "subject": "POL",
    "number": "3465",
    "honors": false,
    "writingIntensive": false,
    "name": "Theories of Political Economy",
    "fullname": "Theories of Political Economy",
    "info": "Theories of economics/politics that underlie debates between politicians and commentators in modern life. Classic debates among economists and political scientists. Role of government in the market. Applying theories to contemporary debate on causes of and response to current financial crisis.",
    "prereq": []
  },
  {
    "uid": "825613",
    "code": "POL3471",
    "subject": "POL",
    "number": "3471",
    "honors": false,
    "writingIntensive": false,
    "name": "Dictatorships in Central Asia",
    "fullname": "Dictatorships & Violence in Central Asia",
    "info": "This course is an overview of politics in Central Asia, a region of the world that has layers of history, culture, and politics, that extend back to the time of Alexander the Great's conquest, Islamization by the Arabs, Tamerlane's empire, and the Great Game of the 19th Century. Our focus will mainly be on the twentieth century to the present, including the period of control by the Soviet Union, then independence and 30-years of independent nation-states with new forms of political power.Otherwise known as the \"stans\" (the land of)-this region includes the land of the Kyrgyz, Kazakhs, Uzbeks, Turkmen, Tajiks, Uighurs, and Afgans. We will also discuss Azerbaijan, a Turkic post-Soviet republic in the Caucasus that is a neighbor to the Central Asian region. We will focus on the role of ethnic, religious, and national identities in Soviet and post-Soviet politics. We will explore their history, and especially the legacy of communism for the present day. We will particularly address the problems of the post-Soviet era, including political transition to new regimes, the struggle by some for democracy, human rights issues, the challenges of economic reform, ethnic conflict, civil war, and the growth of both moderate and radical Islamist movements. We will focus on religious repression by the Central Asian states, and religious and ethnic repression of the Uighurs by the Chinese state. We will consider US policy in the region, and how it has positively or negatively affected political developments. We will also analyze the growing competition between Russia, China, and the US for influence in the region.",
    "prereq": []
  },
  {
    "uid": "808465",
    "code": "POL3475",
    "subject": "POL",
    "number": "3475",
    "honors": false,
    "writingIntensive": false,
    "name": "Islamist Politics",
    "fullname": "Islamist Politics",
    "info": "The relationship between Islam and politics-both in the Muslim world and in the West-is one of the most important political issues of our day. This class will address these issues by taking a historical and political look at the development of Islam (the religion) and Islamism (Islamic political movements) in many areas of the Muslim world. We will begin by discussing the Islamic faith and historical debates about its relationship to politics. Then we will turn to the twentieth century, and examine the rise of Islamist politics in the Middle East and North Africa (e.g. Saudi Arabia, Egypt, Iran, Sudan) and south central Asia (e.g. Pakistan, Afghanistan). We will study the successes and failures of Islamist revolutions. Then we will focus on the evolution of the \"Arab Spring\" and its implications for both Islamism and democracy. In doing so, we will discuss debates about the compatibility of Islam and democracy, and examine attempts at democracy in the Muslim World (e.g. Tunisia). We will examine the revival of Islam and rise of post-Soviet Islamism in Eurasia (Central Asia, Russia, and the Caucasus) during the last two to three decades. We will examine the effects of state repression of Islam and religious freedom in those countries. We will also discuss varying ideas about jihad, and the rise of global jihadists and terrorist groups, such as Al Qaeda and ISIS. We will study the jihads waged by Al Qaeda, the Taliban, and ISIS, and the implications of militancy and terrorism for establishing stability and democracy in the Muslim world.We will read both Muslim and non-Muslim, American and non-American perspectives on these problems. Understanding these issues is critical to gaining perspective on the troubling state of today's complex global politics, and US foreign policy in Afghanistan, Iraq, Syria, and elsewhere.",
    "prereq": []
  },
  {
    "uid": "006365",
    "code": "POL3476",
    "subject": "POL",
    "number": "3476",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Politics",
    "fullname": "Chinese Politics: History and Contemporary Issues",
    "info": "How has Chinese history, in the forms of Confucian, republican, nationalist, and communist legacies, informed and shaped political issues in China today? This course seeks to provide an introductory survey of Chinese politics, starting with the Republican revolution in the early 20th century, and ending with critical challenges in the current era. Throughout the semester, we will be juxtaposing historical lessons with contemporary reflections on different themes, ranging from revolution, state power, socioeconomic reform and development, civil society, and foreign relations. We will be examining a diverse set of perspectives from political leaders, scholars, and everyday citizens, through a combination of academic analyses, nonfiction reporting, primary sources, and other mediums. The goal for this course is to not only familiarize students with important issues facing Chinese political leaders and citizens at both the domestic and international level today, but to also provide students with a historicized and grounded approach towards the study of Chinese politics and society.",
    "prereq": []
  },
  {
    "uid": "006967",
    "code": "POL3477",
    "subject": "POL",
    "number": "3477",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Economy of Dvlpmnt",
    "fullname": "Political Economy of Development",
    "info": "How can the vast disparities of wealth between countries be explained? Why have some countries in the post-colonial world, in particular, those of East Asia, experienced stunning economic growth, while those in other parts have not? We will explore inequality among nations through an engagement with competing explanations from multiple disciplines. Do free markets, the legacies of colonialism, state power, culture, or geography offer the most persuasive account of current patterns of global inequality? The course also examines what we mean by \"development\" and exposes students to cutting-edge debates in contemporary development studies. By the end of the course, students will have a better understanding of the causes of and possible solutions to global inequality.",
    "prereq": []
  },
  {
    "uid": "006980",
    "code": "POL3478W",
    "subject": "POL",
    "number": "3478",
    "honors": false,
    "writingIntensive": true,
    "name": "Contemporary African Politics",
    "fullname": "Contemporary Politics in Africa and the Colonial Legacy",
    "info": "At the core, this class is about the interaction between the assertion of and challenge to political authority in Africa. Who should have the right to make decisions that structure people's lives? To what extent is \"might\" an important source of political authority? How, in turn, do people respond to these different means of establishing political authority? Using these questions as a springboard, this class will examine some broader themes relating to colonialism, state building, conflict, and development in Africa. Politics in Africa, just as in any other place in the world, is complex and for that reason, the objective of the class is not to give you answers, but to have you think critically about the issues we cover. Towards this end, this class will draw on different sources ranging from novels to manifestos so as to illustrate both the mundane and extraordinary events that have helped shape the political landscape of the continent.",
    "prereq": []
  },
  {
    "uid": "006561",
    "code": "POL3479",
    "subject": "POL",
    "number": "3479",
    "honors": false,
    "writingIntensive": false,
    "name": "Latin American Politics",
    "fullname": "Latin American Politics",
    "info": "This course offers an introduction to the political history and contemporary politics of Latin America, along with some of the main concepts and theories used by social scientists to explain the region’s political dynamics. Through a comparative, historical approach, the course aims to help students understand the continued challenges faced by countries in the region-- to the establishment of security, the rule of law and rights protection, to the stability and quality of democracy, and to sustainable and equitable economic growth—and how these interact. The objective of the course is not only to help students understand the similarities and differences in outcomes in Latin America over time, but also to reflect on what the region’s experiences can teach us about the requirements of and barriers to meaningful democracy and sustainable and equitable development around the world, including “north of the border.” In other words, the course seeks not just to provide students’ knowledge about Latin America, but to help them learn from Latin America.",
    "prereq": []
  },
  {
    "uid": "799016",
    "code": "POL3489W",
    "subject": "POL",
    "number": "3489",
    "honors": false,
    "writingIntensive": true,
    "name": "Citizens, Consumers & Corps",
    "fullname": "Citizens, Consumers, and Corporations",
    "info": "Corporations are the most powerful actors in the global political economy. They employ millions of people, produce a wide variety of goods, and have massive effects on the communities where they do business. Although considered to be \"legal persons,\" corporations are not living beings with a conscience. Milton Friedman famously proclaimed that the only moral obligation of corporations is the maximize shareholder returns. Yet maximizing financial returns may negatively affect humans, other living beings, and the planet. This potential conflict between profit and ethics is at the heart of this course, which focuses on how people have mobilized as citizens and consumers to demand ethical behavior from corporations. We will explore these different modes of action through an examination of corporate social responsibility for sweatshops, the industrial food system in the United States, and the privatization of life, water, and war. The course also considers how corporations exploit racial hierarchies and immigration status in their pursuit of profit.",
    "prereq": []
  },
  {
    "uid": "016172",
    "code": "POL3491",
    "subject": "POL",
    "number": "3491",
    "honors": false,
    "writingIntensive": false,
    "name": "Film and Latin Amer Politics",
    "fullname": "Film and Latin American Politics",
    "info": "Introduction to using film to study Latin American politics. Hollywood films explore how the United States \"sees\" Latin America, its people, and its political problems; films from Latin America explore how Latin American popular culture reflects a country's political issues. One feature film per week. Brief readings about issues raised by each film.",
    "prereq": []
  },
  {
    "uid": "789791",
    "code": "POL3701",
    "subject": "POL",
    "number": "3701",
    "honors": false,
    "writingIntensive": false,
    "name": "Indigenous Gov. & Politics",
    "fullname": "Indigenous Tribal Governments and Politics",
    "info": "History, development, structure, politics of American Indian Governments.  North American indigenous societies from pre-colonial times to present.  Evolution of aboriginal governments confronted/affected by colonizing forces of European/Euro-American states. Bearing of dual citizenship on nature/powers of tribal governments in relation to states and federal government.",
    "prereq": []
  },
  {
    "uid": "811609",
    "code": "POL3733",
    "subject": "POL",
    "number": "3733",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender, Politics, Policy in US",
    "fullname": "From Suffragettes to Senators: Gender, Politics & Policy in the U.S.",
    "info": "Overview to field of gender/politics. Examine role women play in U.S. policy process. How public policies are \"gendered.\" How policies compare to feminist thinking about related issue area. Theories of role(s) gender plays in various aspects of politics.",
    "prereq": []
  },
  {
    "uid": "006529",
    "code": "POL3751",
    "subject": "POL",
    "number": "3751",
    "honors": false,
    "writingIntensive": false,
    "name": "Fieldwork in Polit",
    "fullname": "Fieldwork in Politics",
    "info": "Field study of political organizations, leadership, campaigns. Students arrange work assignments with candidates.",
    "prereq": []
  },
  {
    "uid": "798897",
    "code": "POL3752",
    "subject": "POL",
    "number": "3752",
    "honors": false,
    "writingIntensive": false,
    "name": "Chicana/o Politics",
    "fullname": "Chicana/o Politics",
    "info": "Theory/practice of Chicana/o politics through analysis of Mexican American experience, social agency. Response to larger political systems/behaviors using social science methods of inquiry. Unequal power relations, social justice, political economy.",
    "prereq": []
  },
  {
    "uid": "005546",
    "code": "POL3766",
    "subject": "POL",
    "number": "3766",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol Psych of Mass Behavior",
    "fullname": "Political Psychology of Mass Behavior",
    "info": "How do people develop their political opinions? What makes people vote the way that they do? Why do some people love, and other loathe, Donald Trump? Understanding how ordinary citizens engage with the political sphere is essential to understanding how politics work. This course applies a psychological approach to understanding how average people - members of the mass public - think about politics, make political decisions, and decide how (and whether) to take political actions. We will explore arguments about the role that ideology, biological and evolutionary factors, personality, identity and partisanship, racial attitudes, and political discussion play in shaping the opinion and behavior of members of the mass public. In addition, this class introduces students to the methodology of political psychology and how political psychologists approach questions and attempt to understand the political world.Students will exit the class having mastered a body of knowledge about how they and their fellow citizens think about politics and the different approaches that scholars take to study these decisions. They will also gain the critical capacity to judge arguments about politics, the ability to identify, define, and solve problems, and the skill to locate and critically evaluate information relevant to these tasks. Finally, this course takes a cooperative approach to learning, and many course activities will be structured around learning and working with a group of fellow students over the course of the semester.",
    "prereq": []
  },
  {
    "uid": "795797",
    "code": "POL3767",
    "subject": "POL",
    "number": "3767",
    "honors": false,
    "writingIntensive": false,
    "name": "PolPsy of Elite Behavior",
    "fullname": "Political Psychology of Elite Behavior",
    "info": "Why do some world leaders seek cooperation while others advocate war? Why do some Presidents effect major change while others are relegated to the dustbin of history? How does the personality of leaders affect how they behave in office? In this class, we will address questions like these by exploring the psychology of political elites, those members of society who wield outsized influence over political decisions. This outsized influence means that understanding how elites think is particularly important. It is also unusually difficult, leading some to argue that political psychology can play little role in understanding elite decision-making. Students will exit the class having mastered a body of knowledge about elite decision-making and learned about the different approaches that scholars take to study these decisions. They will also gain the critical capacity to judge arguments about politics, the ability to identify, define, and solve problems, and the skill to locate and critically evaluate information relevant to these tasks. Finally, this course takes a cooperative approach to learning, and many course activities will be structured around learning and working with a group of fellow students over the course of the semester. This course fulfills the Civic Life and Ethics theme requirement.",
    "prereq": []
  },
  {
    "uid": "006544",
    "code": "POL3769",
    "subject": "POL",
    "number": "3769",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Opinion & Voting Behav",
    "fullname": "Public Opinion and Voting Behavior",
    "info": "Polls are ubiquitous, measuring what Americans think on topics big and small. This course examines the nature, measurement, and consequences of public opinion in the contemporary United States, with a particular emphasis on understanding why some voters preferred Donald Trump to Hillary Clinton - vice versa – in the 2016 presidential election. We’ll address the following questions throughout the term. First, how do pollsters measure what the public thinks about government and public affairs? Second, can we assume that the responses people give to survey questions reflect their true thoughts and feelings about politics? Third, what are the major factors that shape voter decision making in U.S. presidential elections? By the end of this semester you will have a broader and deeper understanding of the nature, measurement, meaning, and consequences of public opinion.",
    "prereq": []
  },
  {
    "uid": "793704",
    "code": "POL3785",
    "subject": "POL",
    "number": "3785",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Propaganda",
    "fullname": "Persuasion and Political Propaganda",
    "info": "Introduction to persuasion and political propaganda. Persuasion theories relevant to designing effective political propaganda. Applying theories to analyze WWI/WWII propaganda posters, films, and political campaign commercials. Use of fiction as propaganda tool.",
    "prereq": []
  },
  {
    "uid": "818655",
    "code": "POL3786",
    "subject": "POL",
    "number": "3786",
    "honors": false,
    "writingIntensive": false,
    "name": "Media and Politics",
    "fullname": "Media and Politics",
    "info": "Do facts matter anymore? Is press freedom under threat? Are audiences trapped in filter bubbles? Why do people hate the media, and how can the news be improved to better serve citizens? Explore the historical and contemporary dynamics that shape the relationship between professionals in the media, the mass public, and political actors across different parts of government. Study major forms of mass media, including television and newspapers, alongside new forms such as digital and social media. Look at specific reporting rituals and practices, as well as issues involving media ownership, regulation, ethics, and press freedom. We will study politicians? efforts to craft messages, advertise strategically, and target select audiences for political gain. The course will focus primarily, but not exclusively, on the United States, and you will be asked to engage with current events and the role of communication technologies in political and civic life.",
    "prereq": []
  },
  {
    "uid": "801697",
    "code": "POL3810",
    "subject": "POL",
    "number": "3810",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Relations/Foreign Policy",
    "fullname": "Topics in International Relations and Foreign Policy",
    "info": "Topics courses delve in-depth into important issues in contemporary international politics. They aim to give students the theoretical, conceptual, and historical understanding, and/or empirical tools needed to understand the complexity of international politics today. Topics courses vary substantially from year to year as specified in the class schedule, but recent topics courses have included: 'Technology and War', International Law', 'Drones, Detention and Torture: The Laws of War', and 'The Consequences of War.'",
    "prereq": []
  },
  {
    "uid": "006588",
    "code": "POL3833",
    "subject": "POL",
    "number": "3833",
    "honors": false,
    "writingIntensive": false,
    "name": "U.S. & the Global Economy",
    "fullname": "The United States and the Global Economy",
    "info": "POL 3833 teaches students about the politics of the global economy with a focus on the role the United States plays within it. The class covers a variety of topics in international political economy, including international trade, international investment, and international finance. Students will learn about the factors that drive politicians' decision-making, interest-group stances, and citizens' preferences over such salient issues as tariffs and other forms of trade protection, trade and investment agreements, central banking, interest rates, international migration, and more. No background in economics is required or assumed.",
    "prereq": []
  },
  {
    "uid": "005472",
    "code": "POL3835",
    "subject": "POL",
    "number": "3835",
    "honors": false,
    "writingIntensive": false,
    "name": "International Relations",
    "fullname": "International Relations",
    "info": "Why do countries go to war? Are individuals, organizations, and states driven by their interests or their ideas? What role does power play in international relations and is there any role for justice in global politics? Do international laws and transnational advocacy groups matter in a world dominated by powerful states? Whose interests are served by a globalizing world economy? These questions are central to the study of international relations, yet different theoretical approaches have been developed in an attempt to answer them. Often these approaches disagree with one another, leading to markedly different policy prescriptions and predictions for future events. This course provides the conceptual and theoretical means for analyzing these issues, processes, and events in international politics. By the end of this class, you will be able to understand the assumptions, the logics, and the implications of major theories and concepts of international relations. These include realism and neorealism, liberalism and liberal institutionalism, constructivism, feminism, Marxism, and critical theory. A special effort is made to relate the course material to world events, developments, or conflicts in the past decade or so.",
    "prereq": []
  },
  {
    "uid": "819582",
    "code": "POL3841",
    "subject": "POL",
    "number": "3841",
    "honors": false,
    "writingIntensive": false,
    "name": "The Consequences of War",
    "fullname": "The Consequences of War",
    "info": "War - both between and within states - is often horrific. With good reason, when the field of international relations emerged in the wake of the world wars, it was centrally preoccupied with shedding light on the causes of war so as thereby to prevent another one. But both interstate and civil wars are remarkably complex affairs. Notwithstanding wars' alarming human costs, their consequences are varied, often cross-cutting, and sometimes contradictory, and they resist our efforts to narrate their consequences in simple and straightforward ways. Wars can increase executive authority and strengthen the state, but they can also undermine inequitable international and domestic political orders, empires, and regimes, and make it possible for more just ones to take their place. Wars can permit repression and exploitation along the lines of race and other categorical identities, but those same experiences can also inspire those groups to demand first-class citizenship. In the name of insecurity and war, governments sometimes trample upon liberties, especially those of the politically weak and unpopular, but those measures may eventually come to seem unwarranted and even provoke a backlash that expands human liberty. War is filled with privation and trauma, but its horrors can also inspire veterans and victims to mobilize and promote more humane norms. We are properly taught to hate war, to avoid it at all costs. Yet social and political good has sometimes, surprisingly, come out of war too. This course explores the consequences of violent conflict in all its dimensions - the threat of conflict, mobilization for conflict, and the experience of warfare - on, among others, international order and norms, the fate of states and empires, population movements, state-building, nationalism, democracy, civil society, the citizenship struggles of racial minorities and other groups, gender roles, economic growth and inequality, the military-industrial complex, public health, and political culture. At this course's end, you will emerge not only with greater substantive understanding of war's consequences, but also with greater appreciation of war's complexity. For better or worse, you will never look at war the same way again.",
    "prereq": []
  },
  {
    "uid": "825377",
    "code": "POL3843W",
    "subject": "POL",
    "number": "3843",
    "honors": false,
    "writingIntensive": true,
    "name": "Methods of War",
    "fullname": "Night Raids, Detention, Torture, and Drones: Methods of War",
    "info": "In this class, we will be examining the use of particular tactics of war-night raids, detention, torture, and drones-as deployed, primarily, but not only, in the US-led war on terror. The purpose of this class is to grapple with the fundamental questions such tactics raise about what is right in war, and the costs and consequences of such tactics on both those who choose to use them and those that are targeted by them.",
    "prereq": []
  },
  {
    "uid": "006580",
    "code": "POL3872W",
    "subject": "POL",
    "number": "3872",
    "honors": false,
    "writingIntensive": true,
    "name": "Pol Econ of Enviro Cooperation",
    "fullname": "Science, Industry, and Social Change: The Political Economy of Global Environmental Cooperation",
    "info": "Emergence of environment as key aspect of global political agenda. Non-governmental/governmental international organizations. Politics of protection of atmosphere, rain forest, seas, other selected issues. International security, environment.",
    "prereq": []
  },
  {
    "uid": "006583",
    "code": "POL3873W",
    "subject": "POL",
    "number": "3873",
    "honors": false,
    "writingIntensive": true,
    "name": "International Ethics",
    "fullname": "Global Citizenship and International Ethics",
    "info": "Case studies of ethics in intervention, war, weapons, foreign aid, environmental practices, and human rights are used to examine the global ethical responsibilities of individual citizens and public officials; effectiveness of transnational social movements in influencing policy at domestic and international levels.",
    "prereq": []
  },
  {
    "uid": "825228",
    "code": "POL3879",
    "subject": "POL",
    "number": "3879",
    "honors": false,
    "writingIntensive": false,
    "name": "Critical Humanitarianism",
    "fullname": "Critical Humanitarianism: Policy and Politics",
    "info": "Over the last two centuries the international community established a set of humanitarian norms, principles, and institutions designed to alleviate the suffering and improve the welfare of vulnerable populations. Humanitarianism—the efforts undertaken to relieve suffering for those displaced by war, human rights violations, climate change, and other disasters— has undergone significant development and transformation, with the expansion and institutionalization of humanitarian action now accepted as a normal part of global politics.Humanitarian organizations, such as the International Committee of the Red Cross or Doctors without Borders, are expected to be on the ground in situations of violence and disaster, with humanitarians leading the emergency responses. Their successes and failures inform not only our sense of what humanitarianism is, or what humanitarians do, but the life and death of those individuals whom they are sent to assist.Thus, this course engages the questions of what does it mean to claim humanitarianism, to do humanitarian work, and to be a humanitarian? We will take a historical approach to the rise of humanitarianism and trace its subjects and actors from the early 19th century to today, as one way of gaining purchase on these questions and to chart the practical, political, and ethical issues intrinsic to the promotion and legitimacy of humanitarianism.Students in this course will develop a better understanding of the current themes and debates in the field of humanitarianism, including the decolonization of aid and aid organizations, the relationship of humanitarian aid and military might, the professionalization of humanitarianism and the attendant issues of accountability to vulnerable populations. This course will also analyze the successes and failures of humanitarianism through both historical and contemporary examples.",
    "prereq": []
  },
  {
    "uid": "818529",
    "code": "POL3896",
    "subject": "POL",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "Internship with government or community organizations arranged by the department and awarded competitively each spring semester.prereq: instr consent, dept consent",
    "prereq": []
  },
  {
    "uid": "005518",
    "code": "POL3994",
    "subject": "POL",
    "number": "3994",
    "honors": false,
    "writingIntensive": false,
    "name": "Distinguished Research Program",
    "fullname": "Directed Research: Distinguished Undergraduate Research Program",
    "info": "Students accepted into the Distinguished Undergraduate Research Program work closely with a faculty mentor on supervised projects related to faculty research. Through these activities, students will deepen research, organizational, and communication skills that will prove useful for further training in political science or for other careers. Students are chosen through a highly competitive online application the semester prior to registration. Students should check with Political Science advising for details about the application process. This course is only open to Political Science majors. ",
    "prereq": []
  },
  {
    "uid": "816276",
    "code": "POL4010",
    "subject": "POL",
    "number": "4010",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Methods",
    "fullname": "Topics in Methods",
    "info": "Advanced undergraduate course is statistical methods for political research.  Topics vary as specified in class search.It is recommended students take POL 3085 or equivalent before enrolling in POL 4010.",
    "prereq": []
  },
  {
    "uid": "817352",
    "code": "POL4085",
    "subject": "POL",
    "number": "4085",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Political Data Analysis",
    "fullname": "Advanced Political Data Analysis",
    "info": "In this course, students learn how to use statistical methods to answer a wide variety of questions in political science. More specifically, students will focus on how to test hypotheses where the dependent variable is dichotomous, ordered categories, unordered categories, counts, and more. The course covers advanced topics in linear regression, including time series data, multilevel modeling, and interaction terms. Assignments focus on how to convey statistical results in many different ways, ranging from technical reports, to blog posts, to personal communication. Students will learn and improve their skills in the R statistical software package. Prior knowledge of R is not required. This class is especially recommended for students completing an undergraduate thesis with a quantitative component as well as students who want to pursue graduate studies in political science.",
    "prereq": []
  },
  {
    "uid": "005376",
    "code": "POL4087",
    "subject": "POL",
    "number": "4087",
    "honors": false,
    "writingIntensive": false,
    "name": "Think Strategically About Pol",
    "fullname": "Thinking Strategically About Politics",
    "info": "The purpose of this class is threefold. First is to introduce students to the use and value of formal models of strategic interaction (game theoretic models) in political science. Second is to impart some basic tools of such modeling to students. And third is to examine the contribution of theoretical models to several common game theoretic problems that appear across a variety of different political applications.In keeping with these three goals, the course is divided into three sections. The first session will be devoted to such questions as, what is a theoretical model?  What are rational choice and game theory? The next portion of the class will introduce students to the basic tools employed in game theoretic analysis. The readings will illustrate the use of the tools introduced in class. Five problem sets will be administered, requiring students to make use of these tools.  The final portion of the class will examine types of game theoretic problems that appear in a variety of political settings. These include retrospective voting and accountability, prospective voting and the role of the median voter, problems of coordination and the role of information, problems of collective action and the problem of free riding, and problems of credible commitment. ",
    "prereq": []
  },
  {
    "uid": "016171",
    "code": "POL4210",
    "subject": "POL",
    "number": "4210",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Political Theory",
    "fullname": "Topics in Political Theory",
    "info": "Topics in political theory, as specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "799185",
    "code": "POL4225",
    "subject": "POL",
    "number": "4225",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics and Education",
    "fullname": "Politics and Education",
    "info": "Politics/education: theoretically, historically, practically. Ancient/modern theories of politics (especially democratic politics) in connection with education. Course usually has a practicum in which students work with each other or coach younger students on problems of public importance to their communities.",
    "prereq": []
  },
  {
    "uid": "007026",
    "code": "POL4253",
    "subject": "POL",
    "number": "4253",
    "honors": false,
    "writingIntensive": false,
    "name": "Late Modern Pol Tht",
    "fullname": "Modernity and Its Discontents: Late Modern Political Thought",
    "info": "Theoretical responses/interpretations of Western economy, society, politics, democratic culture. Theories of history. Class struggle. End of metaphysics, death of God. Technology/bureaucracy. Psychology of culture in Hegel, Marx, Tocqueville, Mill, Nietzsche, Weber, Freud.prereq: Suggested 1201, [3225 or 3235W or 3251 or 3252]",
    "prereq": {
      "and": [
        {
          "code": "POL 1201",
          "subject": "POL",
          "id": "1201"
        },
        {
          "or": [
            {
              "code": "POL 3225",
              "subject": "POL",
              "id": "3225"
            },
            {
              "code": "POL 3235W",
              "subject": "POL",
              "id": "3235W"
            },
            {
              "code": "POL 3251",
              "subject": "POL",
              "id": "3251"
            },
            {
              "code": "POL 3252",
              "subject": "POL",
              "id": "3252"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "818831",
    "code": "POL4255",
    "subject": "POL",
    "number": "4255",
    "honors": false,
    "writingIntensive": false,
    "name": "Marxist vs NonMarxist Analysis",
    "fullname": "Comparative Real Time Political Analysis: Marxist versus Liberal Perspectives",
    "info": "Karl Marx and Frederick Engels had better democratic credentials than Alexis de Tocqueville and John Stuart Mill.  Vladimir Lenin, too, had better democratic credentials than Max Weber and Woodrow Wilson.  That’s the provocative argument of this course.  Performing what it calls “comparative real-time political analysis,” it presents convincing evidence to sustain both claims.  When the two sets of protagonists are compared and contrasted in how they read and responded to big political events in motion, in real-time, the Marxists, it contends, proved to be better democrats than the Liberals.  Real-time analysis argues that responding to and making decisions about events in motion is the real test of political perspective and theory; on Monday morning, we can all look smart.  The writings and actions of all seven protagonists are the primary course materials—reading them in their own words.  The European Spring of 1848, the United States Civil War, the 1905 Russian Revolution and, the 1917 Russian Revolution and end of World War I, all consequential in the democratic quest, are the main scenarios the course employs to test its claims.  The findings, course participants will learn, challenge assumed political wisdom like never before.  Employing the lessons of the comparisons to trying to make sense of current politics—given the unprecedented moment in which we find ourselves—is the other goal of the course.",
    "prereq": []
  },
  {
    "uid": "817074",
    "code": "POL4267",
    "subject": "POL",
    "number": "4267",
    "honors": false,
    "writingIntensive": false,
    "name": "Imperialism & Mod Pol Thought",
    "fullname": "Imperialism and Modern Political Thought",
    "info": "How has political theory been shaped by imperialism? We will investigate this question through a study of such key thinkers as Kant, Mill, Marx, Lenin, Césaire, Fanon, and Gandhi, reading them through the lens of empire. Our goal is to analyze how such thinkers reflected upon, problematized and, at times, justified forms of Western imperialism. We will look at their explicit reflections on empire, as well as more tangential or ostensibly separate themes that may have only been shaped by the imperial context in indirect ways. Finally, we will reflect upon our contemporary location as readers and agents situated in the wake of these political and intellectual developments, analyzed through the question of what it means to engage in anti-colonial, decolonial, and/or postcolonial critique. This course will combine lectures by the professor with student-led seminar discussion.",
    "prereq": []
  },
  {
    "uid": "006903",
    "code": "POL4275",
    "subject": "POL",
    "number": "4275",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Political Thought",
    "fullname": "Domination, Exclusion, and Justice: Contemporary Political Thought",
    "info": "Contemporary Political Theory systematically analyzes the meaning and significance of concepts central to current politics: domination, exclusion, and justice. Starting from basic concerns about the nature of politics, humans, power and justice, this course will explore how these basic starting assumptions organize the norms, practices, and institutions of political and social order. To explore these topics, the field turns to key texts, as well as to political and social events and other media (film, historical documents, etc.). Through this course, students will also be introduced to different interpretive approaches, ranging from democratic theory, feminist, queer and critical race theories, as well as ethics and moral philosophy. Organized around the politics of the twentieth and twenty-first centuries, the course will pursue a range of questions about democratic legitimation, the exclusion of historically marginalized communities, systematic inequalities of different kinds, as well as ideals of democracy and justice. It will range from theoretical inquiry to practical questions of implementing different political projects. Through this course, students will develop skills in critical thinking, careful reading and clear writing, as well as recognizing and constructing arguments. These skills are basic for the critical, lifelong role that all of us play as members of political community.prereq: 1201 recommended",
    "prereq": {
      "code": "POL 1201",
      "subject": "POL",
      "id": "1201"
    }
  },
  {
    "uid": "006904",
    "code": "POL4280",
    "subject": "POL",
    "number": "4280",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Pol Theory",
    "fullname": "Topics in Political Theory",
    "info": "Topics courses provide students with the opportunity to study key concepts, thinkers, and themes in Political Theory not normally covered in the standard slate of course offerings. The specific content of these courses varies considerably from year to year. See the current class schedule for details.",
    "prereq": []
  },
  {
    "uid": "006530",
    "code": "POL4303",
    "subject": "POL",
    "number": "4303",
    "honors": false,
    "writingIntensive": false,
    "name": "American  Democracy",
    "fullname": "American Democracy in Crisis",
    "info": "Compare the performance of the American political system with the promises of democracy. Discuss a range of interpretations of democratic government and the American national governing process. ",
    "prereq": []
  },
  {
    "uid": "006533",
    "code": "POL4308",
    "subject": "POL",
    "number": "4308",
    "honors": false,
    "writingIntensive": false,
    "name": "Congress Pol & Inst",
    "fullname": "Congressional Politics and Institutions",
    "info": "Origin/development of U.S. congressional institutions, parties, committees, leaders, lobbying/elections, and relations between Congress/executive branch. Relationship of campaigning/governing, nature of representation, biases of institutional arrangements.",
    "prereq": []
  },
  {
    "uid": "006534",
    "code": "POL4309",
    "subject": "POL",
    "number": "4309",
    "honors": false,
    "writingIntensive": false,
    "name": "Judicial Process",
    "fullname": "Justice in America",
    "info": "The American judiciary, the selection of judges and how and why these individuals and institutions behave the way they do. What influences judicial decisions? What impact do these decisions have? Why do people comply with them?",
    "prereq": []
  },
  {
    "uid": "006535",
    "code": "POL4310",
    "subject": "POL",
    "number": "4310",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in American Politics",
    "fullname": "Topics in American Politics",
    "info": "See Class Schedule for description.prereq: 1001 or equiv or instr consent",
    "prereq": {
      "code": "POL 1001",
      "subject": "POL",
      "id": "1001"
    }
  },
  {
    "uid": "006536",
    "code": "POL4315W",
    "subject": "POL",
    "number": "4315",
    "honors": false,
    "writingIntensive": true,
    "name": "State Government",
    "fullname": "State Governments: Laboratories of Democracy",
    "info": "State governments are rarely at the forefront of the minds of the American public, but in recent years they have made critical decisions about issues like education, health care, climate change, and same-sex marriage. State governments perform a host of vital services, and they regulate and tax a wide array of business activities. Moreover, the states have adopted a very wide range of approaches in addressing these and other policy issues. This course examines the institutional and political changes that sparked the recent “resurgence of the states,” and it investigates why state policies differ so dramatically from one another.In addition to playing a central and increasingly important role in the U.S. political system, the American states provide an unusually advantageous venue in which to conduct research about political behavior and policymaking. They are broadly similar in many ways, but they also offer significant variation across a range of social, political, economic, and institutional characteristics that are central to theories about politics. As a result, it becomes possible for scholars to evaluate hypotheses about cause-and-effect relationships in a valid way.This course pursues two related objectives. Its first goal is to give students a better understanding of American state governments’ substantive significance. Its second goal is to use the states as an analytical venue in which students can hone their research and writing skills. Students will design and complete an original research paper on an aspect of state politics of their choosing. They will develop a research question, gather and critically evaluate appropriate and relevant evidence, and discuss the implications of their research.prereq: 1001 or equiv, non-pol sci grad major or instr consent",
    "prereq": {
      "code": "POL 1001",
      "subject": "POL",
      "id": "1001"
    }
  },
  {
    "uid": "815947",
    "code": "POL4317",
    "subject": "POL",
    "number": "4317",
    "honors": false,
    "writingIntensive": false,
    "name": "Anti-Science in U.S. Politics",
    "fullname": "Becoming Stupid: Anti-Science in American Politics",
    "info": "(1) Political attacks on basic science, including climatology & global warming, vaccines, the Big Bang, evolution, human reproduction, sexuality, and much more. (2) Pseudoscience and anti-intellectualism in American political culture. (3) Money, political interests, and propaganda that drive attacks on science.",
    "prereq": []
  },
  {
    "uid": "007307",
    "code": "POL4322",
    "subject": "POL",
    "number": "4322",
    "honors": false,
    "writingIntensive": false,
    "name": "Rethinking the Welfare State",
    "fullname": "Rethinking the Welfare State",
    "info": "Discuss competing arguments about welfare states in advanced industrial countries. Are welfare states the result of sectional interests, class relations, or citizenship rights? Compare American social policy with policies in other western countries.",
    "prereq": []
  },
  {
    "uid": "007308",
    "code": "POL4331",
    "subject": "POL",
    "number": "4331",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategy Dom Pol",
    "fullname": "Thinking Strategically in Domestic Politics",
    "info": "A survey of applications of rational-choice and game theories to important features of domestic politics in the United States and elsewhere.",
    "prereq": []
  },
  {
    "uid": "817337",
    "code": "POL4335",
    "subject": "POL",
    "number": "4335",
    "honors": false,
    "writingIntensive": false,
    "name": "African American Politics",
    "fullname": "African American Politics",
    "info": "This course examines the historical and contemporary efforts by African Americans to gain full inclusion as citizens in the US political system. Specifically, the course explores advocacy efforts by civil rights organizations and political parties to obtain and enforce civil and political rights for blacks. An examination of these efforts begins in the Reconstruction Era and concludes with the historic election of the nation's first African American president. The course will cover topics such as the politics of the civil rights movement, black presidential bids and racialized voting in federal and state elections. Finally, the course examines how political parties and organized interests used the Voting Rights Act to increase the number of minorities in Congress. The course focuses on whether the growing number of minorities in Congress increases citizens' trust in government and their involvement in voting and participation in political organizations.",
    "prereq": []
  },
  {
    "uid": "799064",
    "code": "POL4403W",
    "subject": "POL",
    "number": "4403",
    "honors": false,
    "writingIntensive": true,
    "name": "Comparative Constitutionalism",
    "fullname": "Constitutions, Democracy, and Rights: Comparative Perspectives",
    "info": "Around the world, fundamental political questions are often debated and decided in constitutional terms, and in the United States, the constitution is invoked at almost every turn to endorse or condemn different policies. Is adhering to constitutional terms the best way to safeguard rights and to achieve a successful democracy? When and how do constitutions matter to political outcomes? This course centers on these questions as it moves from debates over how constitutional drafting processes should be structured and how detailed constitutions should be, to the risks and benefits of different institutional structures (federal v. unitary, and the distribution of powers between the executive, legislature, and judiciary), to which rights (if any) should be constitutionalized and when and why different rights are protected, closing with a discussion of what rules should guide constitutional amendment and rewrite. For each topic, we compare how these issues have been resolved in the U.S. with alternative approaches in a wide variety of other countries around the globe. The goal is not only to expose students to the variety of ways, successful or unsuccessful, that other political communities have addressed these issues, but also to gain a more contextualized and clearer understanding of the pros and cons of the U.S. model, its relevance for other democratic or democratizing countries, whether and how it might be reformed, and, generally speaking, when/how constitutions matter for democratic quality and stability.",
    "prereq": []
  },
  {
    "uid": "006973",
    "code": "POL4410",
    "subject": "POL",
    "number": "4410",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Comparative Politics",
    "fullname": "Topics in Comparative Politics",
    "info": "Topics of current analytical or policy importance to comparative politics. Topics vary, as specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "006975",
    "code": "POL4461W",
    "subject": "POL",
    "number": "4461",
    "honors": false,
    "writingIntensive": true,
    "name": "European Politics",
    "fullname": "European Government and Politics",
    "info": "This course will introduce you to three major topics that shape European social and political life today: 1) the struggle over what makes for a national/European identity: how contested national identities matter to European democratic politics and to the new populist movements, and the historical role of Islam in shaping European identities 2) the role of institutions in shaping popular representation and citizen agency; 3) European Union policies: dealing with immigration, the single currency and foreign and security policy especially in regard to Eastern/Central Europe and Russia. Each section will conclude with a comparative class debate, led by students, on the way contested historical interpretations and identities, institutions and policies matter also to US political and civic life. This is a writing intensive course and you will be asked to write a 12-15 page research essay on a European country of your choice. Several assignments, preceded by a writing workshop, will help you complete your final essay. The course will consist of lectures with PPTs, class discussions and group work, and at least one guest lecturer working in a local business connected with Europe. Indeed this course aims at preparing you to live and work in a deeply interconnected world, with special attention to the historical, social, political and economic ties between the US and Europe. Small changes will be made to the syllabus if current events or unexpected class needs require it, but the main themes, most readings and the assignments will remain as indicated in the syllabus. prereq: 1054 or 3051 or non-pol sci grad or instr consent",
    "prereq": {
      "or": [
        {
          "code": "POL 1054",
          "subject": "POL",
          "id": "1054"
        },
        {
          "code": "POL 3051",
          "subject": "POL",
          "id": "3051"
        }
      ]
    }
  },
  {
    "uid": "800136",
    "code": "POL4463",
    "subject": "POL",
    "number": "4463",
    "honors": false,
    "writingIntensive": false,
    "name": "The Cuban Revolution",
    "fullname": "The Cuban Revolution Through the Words of Cuban Revolutionaries",
    "info": "Why do policy makers in Washington, D.C. continue to rail against the Cuban Revolution?  Despite their best efforts, both Republican and Democratic administrations, the Revolution is still in place after six decades.  How to explain?  This is the central research question of the course.  A definitive answer would require a thorough examination of the revolution from its initiation until today—which is beyond what can be done in a semester.  The focus, rather, is more limited.  First, how was the revolution made and consolidated—from 1953 until about 1969—and, second, how has it been able to survive and advance since the collapse of the Soviet Union, that is, since 1991?  The emphasis here is on the role of leadership and strategy, how the Cubans and their leaders saw and see what they are doing—in their own words.   This is an attempt to get into their heads, their understandings, through documents, speeches and writings. In keeping with the goals of liberal education, this course helps students to think outside the box of conventional wisdom.  Why, for example, an underdeveloped society lacking many of the characteristics of a liberal democracy can do a better job in meeting the basic needs of its citizens than its far richer neighbor to the north? What the Cubans seek to do is reorganize human relations on the basis of solidarity and not individual self-interest.  How successful they have been in that pursuit is exactly one of the questions to which the course seeks to provide an answer.  These questions are not simply of intellectual interest.  Given the deepening crisis of world capitalism with the accompanying human misery, to know about Cuba's reality can have life and death consequences.  Given, also, that the U.S. government doesn’t make it easy for most of its citizens to travel to the island to make up their own minds about its reality, this course is a unique educational opportunity.",
    "prereq": []
  },
  {
    "uid": "799015",
    "code": "POL4465",
    "subject": "POL",
    "number": "4465",
    "honors": false,
    "writingIntensive": false,
    "name": "Southeast Asian Politics",
    "fullname": "Democracy and Dictatorship in Southeast Asia",
    "info": "A fundamental question of politics is why some regimes endure for many years while others do not. This course examines the \"menu of manipulation\" through which dictators and democrats claim and retain power, and the conditions under which average citizens mobilize to challenge their governments, despite the risks and in the face of what may seem to be insurmountable odds. We will explore these political dynamics in Southeast Asia, one of the most culturally and politically diverse regions of the globe. Composed of eleven countries, Southeast Asia covers a wide geographical region stretching from India to China. With a rich endowment of natural resources, a dynamic manufacturing base, and a strategic location on China's southern flank, the region has come to play an increasingly important role in the political and economic affairs of the globe. Culturally and ethnically diverse, hundreds of languages are spoken, and the religions practiced include Buddhism, Catholicism, Hinduism, and Islam. The region is similarly diverse in its political systems, which range from democratic to semi-democratic to fully authoritarian.",
    "prereq": []
  },
  {
    "uid": "006976",
    "code": "POL4467",
    "subject": "POL",
    "number": "4467",
    "honors": false,
    "writingIntensive": false,
    "name": "Japanese Politics",
    "fullname": "Politics and Market in Contemporary Japan",
    "info": "Study how Japan combined rapid economic development and social stability in the postwar period and  the strengths and the weakness of the Japanese model of capitalism, particularly in today's new \"globalized\" world.",
    "prereq": []
  },
  {
    "uid": "006977",
    "code": "POL4471",
    "subject": "POL",
    "number": "4471",
    "honors": false,
    "writingIntensive": false,
    "name": "Russian Politics",
    "fullname": "After Communism: Russia and the Commonwealth of Independent States",
    "info": "Politics of the newly independent states of the former Soviet Union, particularly Russia. Political transformation, the sources of political stability and instability, economic reform, and the problems of a multinational state.",
    "prereq": []
  },
  {
    "uid": "815639",
    "code": "POL4474W",
    "subject": "POL",
    "number": "4474",
    "honors": false,
    "writingIntensive": true,
    "name": "Russian Politics",
    "fullname": "Russian Politics: From Soviet Empire to Post-Soviet State",
    "info": "Twenty five years ago, Russia appeared to be democratizing and was even on friendly relations with the US and NATO. Now Vladimir Putin runs the state with the FSB (KGB), and US-Russian relations are at their worst point since the 1970s. This course examines major themes and periods in Soviet and Post-Soviet Russian politics. It begins with the Russian Revolution of 1917, and continues with a study of the creation of the USSR and Soviet rule under Lenin, Stalin, and later decades. We look in depth at the economic and political system set up by the Communist Party, and at the causes of its collapse in 1991, which has had profound legacies for the post-Soviet development of Russia. Then in the second half of the course we turn to themes of political, economic, social and civic development under Yeltsin and Putin. We will pose the following questions: Why does democratization begin and why does it fail? How is economic reform undermined? What type of state and regime is Russia now? What caused the Chechen wars and the massive bloodshed in the Caucasus during this period? Is Putin trying to recreate the Soviet Union and retake control of its neighbors? Are US-Russian relations improving as a result of Obama's \"Reset,\" or are we now in an era of a new Cold War? What is Russia's goal in Syria, Iran, or Central Asia? Is Putin rebuilding Russia, or driving it to disaster, and how will this impact the West?",
    "prereq": []
  },
  {
    "uid": "006978",
    "code": "POL4477",
    "subject": "POL",
    "number": "4477",
    "honors": false,
    "writingIntensive": false,
    "name": "Mid East Politics",
    "fullname": "Struggles and Issues in the Middle East",
    "info": "Turkey, Iran, Israel, and selected Arab states.  Domestic politics of religious/secular, ethnic, economic, environmental, and other policy/identity issues. Regional politics of water access, Israeli/Palestinian/Arab world relationships, oil and the Persian/Arabian Gulf, and human rights.prereq: 1054 or 3051 or non-pol sci grad or instr consent",
    "prereq": {
      "or": [
        {
          "code": "POL 1054",
          "subject": "POL",
          "id": "1054"
        },
        {
          "code": "POL 3051",
          "subject": "POL",
          "id": "3051"
        }
      ]
    }
  },
  {
    "uid": "006562",
    "code": "POL4481",
    "subject": "POL",
    "number": "4481",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Political Economy",
    "fullname": "Comparative Political Economy: Governments and Markets",
    "info": "This course analyzes the compatibility of democracy and markets - whether democratic institutions undermine (enhance) the workings of market institutions and vice versa. Competing theoretical perspectives in political economy are critically evaluated. And the experiences of countries with different forms of democratic market systems are studied. Among the topics singled out for in-depth investigation are the economics of voting, producer group politics, the politics of monetary and fiscal policy, political business cycles, and trade politics.",
    "prereq": []
  },
  {
    "uid": "006524",
    "code": "POL4483",
    "subject": "POL",
    "number": "4483",
    "honors": false,
    "writingIntensive": false,
    "name": "Grassroots Politics",
    "fullname": "Grassroots Politics",
    "info": "Politics from the bottom up: politics of daily life, powerlessness, workplace politics, everyday resistance, local organizing, protest, rebellion, and social movements.",
    "prereq": []
  },
  {
    "uid": "007311",
    "code": "POL4485",
    "subject": "POL",
    "number": "4485",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Rights Policy",
    "fullname": "Human Rights Policy: Issues and Actors",
    "info": "Politics of human rights issue emergence; relevant international, regional, and domestic norms; correlates of state repression; measurement of human rights abuse and remedies; human rights promotion by states, political parties, international organizations, NGOs, social movements, faith-based organizations, and providers of international development assistance.",
    "prereq": []
  },
  {
    "uid": "006982",
    "code": "POL4487",
    "subject": "POL",
    "number": "4487",
    "honors": false,
    "writingIntensive": false,
    "name": "The Struggle for Democracy",
    "fullname": "Democracy and the Class Struggle from Athens to the Present",
    "info": "How best to advance democracy—through the ballot box or in the streets?  This question more than any other is what informs the course.  As well as the streets, the barricades and the battlefields, it argues, are decisive in the democratic quest.  If democracy means the rule of the demos, the people, then who gets to be included in “the people\"?  An underlying assumption of the course is that the inclusion of previously disenfranchised layers of society into the category of the people, the citizens, is due to social struggles or the threat of such—an assumption to be examined in the course.  Struggles refer to any kinds of movement for social change, from protests and strikes to revolutions broadly defined. This course seeks to see if there are lessons of struggle. The course traces the history of the democratic movement from its earliest moments in human history and attempts to draw a balance sheet.  In the process, it seeks to answer a number of questions.  Did social inequality always exist?  How do property rights figure in the inclusion process?  What is the relationship between the state, social inequality and democracy?  Which social layers played a decisive role in the democratic breakthrough?  What are the effective strategies and tactics in the democratic struggle?  How crucial is leadership?  And lastly, can the lessons of the past inform current practice?  A particular feature of the course is to read about the thinking and actions of activists on both sides of the democratic struggle in, as much as possible, their own words.",
    "prereq": []
  },
  {
    "uid": "808467",
    "code": "POL4492",
    "subject": "POL",
    "number": "4492",
    "honors": false,
    "writingIntensive": false,
    "name": "Law & (In)Justice in Lat Amer",
    "fullname": "Law and (In)Justice in Latin America",
    "info": "This course examines, from various angles, how law and justice function in contemporary Latin America, highlighting similarities and differences within and between countries and issue areas. Students reflect on and debate the causes behind the varied outcomes, as well as the effectiveness, actual and potential, of the different institutional and social change efforts that have been underway in the region since the 1980s. Specific topics addressed include accountability for past and present mass violence; origins of and responses to crime, from \"mano dura\" policies to criminal justice reform and anti-corruption initiatives; and advances and limitations in equal rights protection. Special attention is paid across the course to issues of indigeneity, race, class, gender, and sexuality. Throughout, students compare situations within Latin America, which is by no means a monolith, as well as consider parallels between Latin America and the United States, where, despite great differences in wealth, history and culture, similar problems of law and justice can be found. The course aims thus not only to teach students about Latin America but also to get students to think about what we might learn from Latin America.",
    "prereq": []
  },
  {
    "uid": "808543",
    "code": "POL4494W",
    "subject": "POL",
    "number": "4494",
    "honors": false,
    "writingIntensive": true,
    "name": "US-Latin American Relations",
    "fullname": "US-Latin American Relations",
    "info": "US foreign policy toward Latin America. Immigration, trade policy, relations with Cuba, drug war, relations with Venezuela.",
    "prereq": []
  },
  {
    "uid": "808466",
    "code": "POL4495",
    "subject": "POL",
    "number": "4495",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol. of Family, Sex & Children",
    "fullname": "Politics of Family, Sex, and Children",
    "info": "Political fights over volatile issues of family, sex, and children.  Diversity of family life in the United States as a source of disharmony and inequality.  Same-sex couples, interracial families, polygamous communities, reproductive equality for people with disabilities, targeting of immigrant children, teen sex & pregnancy, working mothers, â¿¿childfreeâ¿ advocates.  Citizen efforts aimed at reconciling communities with harshly clashing beliefs.",
    "prereq": []
  },
  {
    "uid": "811435",
    "code": "POL4497W",
    "subject": "POL",
    "number": "4497",
    "honors": false,
    "writingIntensive": true,
    "name": "Patronage & Corruption",
    "fullname": "Patronage & Corruption",
    "info": "This course examines dysfunction within the state apparatus -- in the specific forms of patronage, corruption, and clientalism -- and asks why such dysfunction persists and what factors drive it to change. The first half of the course will be primarily devoted to patronage.  It will examine the functioning of the patronage mechanism; ask when and why patronage is abandoned in favor of meritocracy; and will assess the relationship between merit reforms and changes in the quality of governance. The second half of the course will be devoted to corruption. Specific topics to be covered will include: an examination of different forms of corruption, both at the level of political leaders and of bureaucratic officials; the relationship between corruption, democracy, transparency and accountability; governments' manipulation of corruption to provide incentives to bureaucratic and party officials; and different means of combating corruption.  The course will conclude with an examination of the relationship between patronage, corruption, clientalism and party politics, with a particular focus on the mechanisms that cause the correlation between these different forms of mis-governance.",
    "prereq": []
  },
  {
    "uid": "006538",
    "code": "POL4501W",
    "subject": "POL",
    "number": "4501",
    "honors": false,
    "writingIntensive": true,
    "name": "Supr Court & Constit Interp",
    "fullname": "The Supreme Court and Constitutional Interpretation",
    "info": "This Course is designed to introduce students to constitutional law, with an emphasis on the U.S. Supreme Court’s interpretation of Articles I, II, and III. This means that we will discuss how the nation’s Court of last resort has helped shape the powers of and constraints on the three branches of our federal government. We will also discuss and analyze the development of law surrounding the separation of powers, the structure of federalism, congressional power over the commerce clause, and the creation and demise of the concept of substantive due process. Successful completion of this course will satisfy the liberal education requirement of Civic Life and Ethics. Effective citizenship in the 21st century requires an understanding of our how government was created, is structured, and has been interpreted by the Supreme Court over the past two centuries. This course is premised on the notion that such an understanding is best achieved by reading the primary sources that led to these goals – the opinions handed down by the U.S. Supreme Court.",
    "prereq": []
  },
  {
    "uid": "006539",
    "code": "POL4502W",
    "subject": "POL",
    "number": "4502",
    "honors": false,
    "writingIntensive": true,
    "name": "Supreme Court,Civil Lib,Civ Rt",
    "fullname": "The Supreme Court, Civil Liberties, and Civil Rights",
    "info": "Today, more than anytime since the civil rights movement of the 1960s, individual liberties are at the heart of controversial debate in the U.S. Groups, from the far left and far right of the political spectrum have pushed free speech towards the boundaries set by the Supreme Court. At the same time, the religion clauses have become as controversial as ever, with corporations and local governments using them in ways they have not been used before. Finally, the right to privacy is at a crossroads as the U.S. Supreme Court considers cases about reproductive rights and personal privacy. Given these issues, this course allows students to read all the major cases where the U.S. Supreme Court interprets the balance of protecting civil liberties versus allowing government to limit or suppress such liberties. Specifically, the course covers the 14th Amendment, freedom of speech, press, religion, and the limits of the free speech clause of the 1st Amendment. It also covers the 2nd Amendment and the right to privacy found in the 1st, 3rd, 4th, 5th, 9th, and 14th Amendments.",
    "prereq": []
  },
  {
    "uid": "806944",
    "code": "POL4507",
    "subject": "POL",
    "number": "4507",
    "honors": false,
    "writingIntensive": false,
    "name": "Law, Sov'ty, & Treaty Rights",
    "fullname": "Law, Sovereignty, and Treaty Rights",
    "info": "History of American Indian law and the post-contact effects of colonial and U.S. law on American Indians through the 20th century.",
    "prereq": []
  },
  {
    "uid": "006540",
    "code": "POL4523",
    "subject": "POL",
    "number": "4523",
    "honors": false,
    "writingIntensive": false,
    "name": "Regulatory Process",
    "fullname": "The Politics of the Regulatory Process",
    "info": "Operations of regulatory agencies considered in context of political and legal environment.  Principles of federal administrative law, informal procedures, interest group activity; philosophy of regulation; politics and processes of deregulation.",
    "prereq": []
  },
  {
    "uid": "789839",
    "code": "POL4525W",
    "subject": "POL",
    "number": "4525",
    "honors": false,
    "writingIntensive": true,
    "name": "Federal Indian Policy",
    "fullname": "Federal Indian Policy",
    "info": "Formulation, implementation, evolution, comparison of Indian policy from pre-colonial times to self-governance of new millennium. Theoretical approaches to federal Indian policy. Major federal Indian policies.  Views/attitudes of policy-makers, reactions of indigenous nations to policies. Effect of bodies of literature on policies.",
    "prereq": []
  },
  {
    "uid": "006541",
    "code": "POL4561",
    "subject": "POL",
    "number": "4561",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Legal Systems",
    "fullname": "Comparative Legal Systems",
    "info": "Survey of the principal legal systems of the Western world. Examine the role of the legal system in relation to various political and economic systems and the contrast between the common law and civil law traditions.prereq: Jr or sr or non-pol sci grad major",
    "prereq": []
  },
  {
    "uid": "006542",
    "code": "POL4737",
    "subject": "POL",
    "number": "4737",
    "honors": false,
    "writingIntensive": false,
    "name": "American Political Parties",
    "fullname": "American Political Parties",
    "info": "This course focuses on U.S. political parties. We will cover the following themes this term: (1) what parties are and what they do; (2) party factions and coalitions; (3) social and issue cleavages; (4) how Democratic and Republicans view the world; (5) elite and mass polarization; and (6) the future of the Democratic and Republican parties. By the end of the semester you’ll have a broad and deep understanding of the key role parties play in American politics, where they have been, and where they are going. prereq: 1001 or equiv or instr consent",
    "prereq": {
      "code": "POL 1001",
      "subject": "POL",
      "id": "1001"
    }
  },
  {
    "uid": "006543",
    "code": "POL4766",
    "subject": "POL",
    "number": "4766",
    "honors": false,
    "writingIntensive": false,
    "name": "American Political Culture",
    "fullname": "America, the Unusual?: American Political Culture in Comparative Context",
    "info": "Empirical analysis of basic political values. Individualism, freedom, equality. Democratic principles, materialism, capitalism, citizenship, patriotism, heroism.prereq: suggested 1001 or equiv",
    "prereq": {
      "code": "POL 1001",
      "subject": "POL",
      "id": "1001"
    }
  },
  {
    "uid": "792763",
    "code": "POL4771",
    "subject": "POL",
    "number": "4771",
    "honors": false,
    "writingIntensive": false,
    "name": "Race and Politics in America",
    "fullname": "Race and Politics in America: Making Sense of Racial Attitudes in the United States",
    "info": "Race continues to be one of the defining fault lines in American politics. Most obviously, the existence of racial inequality has enormous consequences for any given individual's social and economic standing. However, it also has had an enormous impact on the pattern of attitudes and beliefs which have served as the backdrop for many of society's most pressing political debates and conflicts. The purpose of this course is to provide students with an introduction to how political scientists have studied racial attitudes and the larger problem of inter-ethnic conflict in American society. We will begin with a look at the historical circumstances which have given rise to the major research questions in the area. From there, we'll look at the major research perspectives in the area, and see how well they actually explain public opinion on matters of race. In doing so, we'll also get a look at some of the major controversies in this area of study, particularly the issues of whether the \"old-fashioned racism\" of the pre-civil-rights era has been replaced by new forms of racism; and the degree to which debates over policy matters with no apparent link to race - such as crime and social welfare - may actually have a lot to do with racial attitudes. Finally, we will conclude by taking an informed look at racial attitudes in recent American history, focusing on how racial attitudes and their political consequences of have changed - and not changed - over the course of the Obama presidency and the tumultuous 2016 election.",
    "prereq": []
  },
  {
    "uid": "802108",
    "code": "POL4773W",
    "subject": "POL",
    "number": "4773",
    "honors": false,
    "writingIntensive": true,
    "name": "Advocacy Orgs & Social Mvmts",
    "fullname": "Advocacy Organizations, Social Movements, and the Politics of Identity",
    "info": "This course introduces students to the major theoretical concepts and empirical findings in the study of U.S interest group politics. Students will read books and articles from a wide range of topics that include how interest groups are formed and maintained; various strategies and tactics that groups use to influence Congress, the courts, and executive branch; and whether those strategies result in fair and effective representation for all citizens in society. Throughout the semester students will be exposed to research using a variety of methodologies and intellectual approaches. Further, the class discussions will emphasize general concepts that reoccur in the readings and in other classes. The goal is to assist students in mastering the key concepts in group politics. This is also a writing intensive course. Effective writing is encouraged through several writing assignments that require you to think clearly and express your thoughts concisely.",
    "prereq": []
  },
  {
    "uid": "006584",
    "code": "POL4810",
    "subject": "POL",
    "number": "4810",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: International Politics",
    "fullname": "Topics in International Politics and Foreign Policy",
    "info": "Analysis of selected issues in contemporary international relations. Topics vary, as specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "006586",
    "code": "POL4832",
    "subject": "POL",
    "number": "4832",
    "honors": false,
    "writingIntensive": false,
    "name": "U.S. Security Pol",
    "fullname": "Defending America: U.S. Security Policy",
    "info": "History of U.S. security doctrine. Examination of major issues in present U.S. security policy (e.g., the future of NATO, nuclear strategy in the absence of a clear enemy, nuclear and chemical international arms control). The political and bureaucratic process of making U.S. defense policy.",
    "prereq": []
  },
  {
    "uid": "006589",
    "code": "POL4836",
    "subject": "POL",
    "number": "4836",
    "honors": false,
    "writingIntensive": false,
    "name": "Foreign  Policy",
    "fullname": "Making Foreign Policy: Perceptions and Decisions",
    "info": "Foreign policy decision making beyond the \"to serve the national interest\" cliche. Theoretic understandings from the study of culture, political psychology, organizational theory, democratic theory, bureaucratic politics, game theory, and political economy. Decision making in cross-cultural settings.",
    "prereq": []
  },
  {
    "uid": "825651",
    "code": "POL4845",
    "subject": "POL",
    "number": "4845",
    "honors": false,
    "writingIntensive": false,
    "name": "The Laws of War",
    "fullname": "The Laws of War in International Politics",
    "info": "Is it possible to wage war and to maintain morality? Do the laws of war maintain morality, or do they justify vigorous wars? Do the laws of war even matter? If so, how do they matter? If not, why do they not? These are some of the broader questions that will guide our collaborative exploration and discussion of the laws of war and, importantly, our assessment of the applicability of the laws of war to contemporary topics. We will trace the codification of the laws of war in the 1949 Geneva Conventions and their 1977 Additional Protocols. We will look at their application in practice through the US led war on terror and specific questions such as protection of humanitarian actors, prisoner exchange, destruction of cities in war, protection of medical personnel, and other topics.",
    "prereq": []
  },
  {
    "uid": "799022",
    "code": "POL4867W",
    "subject": "POL",
    "number": "4867",
    "honors": false,
    "writingIntensive": true,
    "name": "U.S. Foreign Pol & Middle East",
    "fullname": "United States Foreign Policy Toward the Middle East",
    "info": "U.S. foreign policy toward Israeli-Palestinian issue in Turkey, Iran, Iraq, etc. Mideast polities, debates, actions. Rationales for U.S. engagement with region. Readings of Middle East authors.prereq: Jr or sr",
    "prereq": []
  },
  {
    "uid": "802109",
    "code": "POL4878W",
    "subject": "POL",
    "number": "4878",
    "honors": false,
    "writingIntensive": true,
    "name": "Israeli-Palestinian Situation",
    "fullname": "Israeli-Palestinian Situation",
    "info": "Situation as clash of two communities. History, politics, respective narratives of each community. Divisions within each community that are consequential for reconciliation. Examples of reconciliation literature from both communities.",
    "prereq": []
  },
  {
    "uid": "006590",
    "code": "POL4881W",
    "subject": "POL",
    "number": "4881",
    "honors": false,
    "writingIntensive": true,
    "name": "Intl Law & Global Governance",
    "fullname": "The Politics of International Law and Global Governance",
    "info": "Why do countries go to war? Are individuals, organizations, and governments driven by their interests or their ideas? What role does power play in international relations and is there any role for justice in global politics? What are the causes and consequences of an increasingly globalized world economy?These questions are central to the study of international relations, yet different theoretical approaches have been developed in an attempt to answer them. Often these approaches disagree with one another, leading to markedly different policy prescriptions and predictions for future events. This course provides the conceptual and theoretical means for analyzing these developments in international politics.By the end of this class, you will be able to understand the assumptions, the logics, and the implications of major theories and concepts of international relations. These include realism, liberalism, institutionalism, constructivism, critical security studies, feminist theory, queer IR theory, post-colonial theory, indigenous approaches to international relations, and neo-Marxism. A special effort is made to relate the course material to world events, developments, or conflicts in the past decade or so.",
    "prereq": []
  },
  {
    "uid": "006592",
    "code": "POL4883W",
    "subject": "POL",
    "number": "4883",
    "honors": false,
    "writingIntensive": true,
    "name": "Global Governance",
    "fullname": "Global Governance",
    "info": "Seminar discussions and class simulations examine the rise and role of inter-governmental organizations such as the United Nations and non-governmental organizations.  Topics include peacekeeping, trade, development, human rights, security and arms control, self-determination, refugees, health, and the environment.prereq: 3835 or non-pol sci grad or instr consent",
    "prereq": {
      "code": "POL 3835",
      "subject": "POL",
      "id": "3835"
    }
  },
  {
    "uid": "006596",
    "code": "POL4885W",
    "subject": "POL",
    "number": "4885",
    "honors": false,
    "writingIntensive": true,
    "name": "Interntl Conflict",
    "fullname": "International Conflict and Security",
    "info": "Why do states turn to military force and for what purposes? What are the causes of war and peace? What renders the threat to use force credible? Can intervention in civil wars stall bloodshed and bring stability? How effective is military force compared to other tools of statecraft? How can states cope with the threat posed by would-be terrorists? What is counterinsurgency doctrine? What is the future of military force in global politics?This course addresses these questions - and others. The course is organized loosely into three sections or themes. The first section explores the causes and consequences of interstate war and peace. We will examine whether and how the international system, domestic institutions and politics, ideas and culture, ethnic and racial prejudice and inequity, and human psychology shape the path to war. Along the way, we debate whether war has become obsolete and why great power rivalry might be raising its ugly head once again. Attention is also devoted to the impact of war on economy and politics as well as the relations between armed forces and civilian government. The second section of the class explores the possibilities, limits, and challenges of more limited uses of force - such as the threat of force (coercion), peacekeeping and humanitarian intervention, and terrorism and counterterrorism. A third theme explores the strategic and ethical implications of the use of force and especially of innovation in military technologies - nuclear weapons, cyber, drones. Across all three sections, we examine how war and society mutually affect each other, including how racial, ethnic, and other categorical identities affect critical dynamics in security, from threat perception to military mobilization.The course is organized around theoretical arguments, historical cases and data, and policy debates. Sessions are deeply interactive, engaged discussion is a must, and the class often divides into smaller groups for more intensive debate. Class time is also devoted to helping students craft an effective final research paper.",
    "prereq": []
  },
  {
    "uid": "006597",
    "code": "POL4889",
    "subject": "POL",
    "number": "4889",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Pol Econ",
    "fullname": "Governments and Global Trade and Money",
    "info": "Study the politics of international trade and monetary affairs including north-south and east-west relations",
    "prereq": []
  },
  {
    "uid": "817746",
    "code": "POL4891",
    "subject": "POL",
    "number": "4891",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics of Nuclear Weapons",
    "fullname": "The Politics of Nuclear Weapons",
    "info": "Nuclear weapons have been a feature of international politics since the development of nuclear weapons by the United States during World War II. But how exactly do nuclear weapons affect international politics? This course tackles this question. In doing so, we examine the history of the nuclear era, the theories we can use to try to understand the ways in which nuclear weapons affect international politics, and key current policy challenges associated with nuclear weapons. For example, we'll ask: how do nuclear weapons work and how are nuclear materials created? Are nuclear weapons a force for peace or for instability and war? How likely is a nuclear war and how close did we come to nuclear war in the Cuban Missile Crisis or other crises? How dangerous is nuclear proliferation and why does the United States go to such lengths to stop other countries acquiring nuclear weapons? Why does the United States have so many nuclear weapons and what drove the nuclear arms race between the United States and the Soviet Union? Why have indigenous populations often borne the brunt of nuclear testing and how have issues of race and gender played into the history of nuclear weapons? What role do nuclear weapons play in India-Pakistan relations and what role will they play in future U.S.-China relations? How likely is nuclear terrorism? Is nuclear disarmament possible? Is it desirable?",
    "prereq": []
  },
  {
    "uid": "016806",
    "code": "POL4900W",
    "subject": "POL",
    "number": "4900",
    "honors": false,
    "writingIntensive": true,
    "name": "Senior Paper",
    "fullname": "Senior Paper",
    "info": "Can be attached to any 3xxx or 4xxx course (with the agreement of that course's instructor). A 10-15 page paper is submitted for evaluation/advice by instructor, then revised for final submission.prereq: Pol sr, instr consent",
    "prereq": []
  },
  {
    "uid": "818931",
    "code": "POL4910",
    "subject": "POL",
    "number": "4910",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Political Science",
    "fullname": "Topics in Political Science",
    "info": "Topics courses provide students the opportunity to study key concepts and themes in political science with an interdisciplinary approach. Subject matter will vary course to course.",
    "prereq": []
  },
  {
    "uid": "817940",
    "code": "POL4991",
    "subject": "POL",
    "number": "4991",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Science Capstone",
    "fullname": "Political Science Capstone",
    "info": "The Political Science Capstone is a required course that provides students with a unique opportunity to reflect on, articulate, share, and build on their individual experiences in the major. It invites students to reflect on what they have learned as political science majors; to demonstrate their knowledge through the preparation of a portfolio of materials; and to think about how the knowledge, skills, and insights of acquired in their major experience can be used and applied outside of the University. Students double majoring in Political Science and another discipline may choose to take this course or complete the capstone in their other major. Political Science majors who are writing an Honors thesis are exempt from this capstone requirement, as the department will recognize the senior thesis as the capstone experience.",
    "prereq": []
  },
  {
    "uid": "789801",
    "code": "POL4993",
    "subject": "POL",
    "number": "4993",
    "honors": false,
    "writingIntensive": false,
    "name": "Honors Thesis",
    "fullname": "Honors Thesis: Directed Studies",
    "info": "Individual research/writing of departmental honors thesis.",
    "prereq": []
  },
  {
    "uid": "007183",
    "code": "POL4994",
    "subject": "POL",
    "number": "4994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research: Individual",
    "fullname": "Directed Research: Individual",
    "info": "Directed individual reading and research between a student and faculty member.Prerequisite instructor and department consent.",
    "prereq": []
  },
  {
    "uid": "815449",
    "code": "POL5005",
    "subject": "POL",
    "number": "5005",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Engagement",
    "fullname": "Political Engagement: Theories and Practice",
    "info": "Theories of political and civic engagement; case studies of challenges and opportunities in public service careers; ethics of political engagement.",
    "prereq": []
  },
  {
    "uid": "816834",
    "code": "POL5065",
    "subject": "POL",
    "number": "5065",
    "honors": false,
    "writingIntensive": false,
    "name": "Mentorship Political Engagemnt",
    "fullname": "Mentorship in Political Engagement",
    "info": "Open only for students admitted to the Master's in Political Engagement program. Individual practical public service research project to fulfill capstone requirement for the BA/MPP program. Design and implement unique and innovative public service project in a professional policymaking or political setting. Weekly direct consultation with faculty adviser and professional mentor. Must perform a minimum of 320 hours of work in a public service setting.",
    "prereq": []
  },
  {
    "uid": "789912",
    "code": "POL5210",
    "subject": "POL",
    "number": "5210",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Pol Theory",
    "fullname": "Topics in Political Theory",
    "info": "Topics specified in the Class Schedule.   ",
    "prereq": []
  },
  {
    "uid": "006906",
    "code": "POL5251",
    "subject": "POL",
    "number": "5251",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Pol Thought",
    "fullname": "Greeks, Romans, and Christians: Ancient and Medieval Political Thought",
    "info": "Politics/ethics in Greece, Rome, Christendom: Thucydides, Socrates, Plato, Aristotle, Cicero, Augustine, Aquinas, Marsilius.",
    "prereq": []
  },
  {
    "uid": "006907",
    "code": "POL5252",
    "subject": "POL",
    "number": "5252",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Modern Pol Th",
    "fullname": "Renaissance, Reformation, and Revolution: Early Modern Political Thought",
    "info": "Thinkers, themes, and discourses from the Renaissance to the French Revolution. Renaissance Humanists; Machiavelli; More; Reformation; Luther; Calvin; Natural Law; Grotius; Divine Right; Common Law; Bacon; English Revolutionaries; Hobbes; Locke; Astell; Enlightenment; Rousseau; French Revolutionaries; Hume; Burke; Wollstonecraft.",
    "prereq": []
  },
  {
    "uid": "006909",
    "code": "POL5253",
    "subject": "POL",
    "number": "5253",
    "honors": false,
    "writingIntensive": false,
    "name": "Late Modern Pol Tht",
    "fullname": "Modernity and its Discontents: Late Modern Political Thought",
    "info": "Theoretical responses to and rival interpretations of Western economy, society, politics, and democratic culture in the modern age; theories of history; class struggle; end of metaphysics and death of God; technology and bureaucracy; psychology of culture in Hegel, Marx, Tocqueville, Mill, Nietzsche, Weber, Freud.",
    "prereq": []
  },
  {
    "uid": "789913",
    "code": "POL5275",
    "subject": "POL",
    "number": "5275",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemp Pol Thght",
    "fullname": "Contemporary Political Thought",
    "info": "20th-century crisis of Western humanism in major works of contemporary political thought from World War II to present. Force and freedom. Ideology and truth. Authority and resistance. Thinkers may include Arendt, Camus, Beauvoir, Fanon, Foucault, Habermas, Rawls, Sartre, Said. Ideas may include communitarianism, feminism, postcolonialism, postmodernism, socialism.",
    "prereq": []
  },
  {
    "uid": "789914",
    "code": "POL5280",
    "subject": "POL",
    "number": "5280",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Pol Theory",
    "fullname": "Topics in Political Theory",
    "info": "Topics in historical, analytical, or normative political theory. Topics vary, see Class Schedule.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "789915",
    "code": "POL5303",
    "subject": "POL",
    "number": "5303",
    "honors": false,
    "writingIntensive": false,
    "name": "American Democracy",
    "fullname": "American Democracy in Crisis",
    "info": "Compares performance of American political system with promises of democracy. Interpretations of democratic government and American national governing process.",
    "prereq": []
  },
  {
    "uid": "789916",
    "code": "POL5306",
    "subject": "POL",
    "number": "5306",
    "honors": false,
    "writingIntensive": false,
    "name": "Presidential Ldrshp",
    "fullname": "Presidential Leadership and American Democracy",
    "info": "Examines whether president's political and constitutional powers are sufficient to satisfy citizens' high expectations and whether president should be expected to dominate American politics.prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "789917",
    "code": "POL5308",
    "subject": "POL",
    "number": "5308",
    "honors": false,
    "writingIntensive": false,
    "name": "Congress Pol & Inst",
    "fullname": "Congressional Politics and Institutions",
    "info": "Origin/development of U.S. congressional institutions, parties, committees, leaders, lobbying/elections, and relations between Congress/executive branch. Relationship of campaigning/governing, nature of representation, biases of institutional arrangements.",
    "prereq": []
  },
  {
    "uid": "789918",
    "code": "POL5309",
    "subject": "POL",
    "number": "5309",
    "honors": false,
    "writingIntensive": false,
    "name": "Judicial Process",
    "fullname": "Justice in America",
    "info": "American judiciary, selection of judges, how/why these individuals/institutions behave the way they do. What influences judicial decisions. What impact decisions have. Why people comply with them.",
    "prereq": []
  },
  {
    "uid": "789919",
    "code": "POL5310",
    "subject": "POL",
    "number": "5310",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in American Politics",
    "fullname": "Topics in American Politics",
    "info": "See Class Schedule for description.",
    "prereq": []
  },
  {
    "uid": "789920",
    "code": "POL5315",
    "subject": "POL",
    "number": "5315",
    "honors": false,
    "writingIntensive": false,
    "name": "State Government",
    "fullname": "State Governments: Laboratories of Democracy",
    "info": "State governments are rarely at the forefront of the minds of the American public, but in recent years they have made critical decisions about issues like education, health care, climate change, and same-sex marriage. State governments perform a host of vital services, and they regulate and tax a wide array of business activities. Moreover, the states have adopted a very wide range of approaches in addressing these and other policy issues. This course examines the institutional and political changes that sparked the recent “resurgence of the states,” and it investigates why state policies differ so dramatically from one another.In addition to playing a central and increasingly important role in the U.S. political system, the American states provide an unusually advantageous venue in which to conduct research about political behavior and policymaking. They are broadly similar in many ways, but they also offer significant variation across a range of social, political, economic, and institutional characteristics that are central to theories about politics. As a result, it becomes possible for scholars to evaluate hypotheses about cause-and-effect relationships in a valid way.This course pursues two related objectives. Its first goal is to give students a better understanding of American state governments’ substantive significance. Its second goal is to use the states as an analytical venue in which students can hone their research and writing skills. Students will design and complete an original research paper on an aspect of state politics of their choosing. They will develop a research question, gather and critically evaluate appropriate and relevant evidence, and discuss the implications of their research.prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "789921",
    "code": "POL5322",
    "subject": "POL",
    "number": "5322",
    "honors": false,
    "writingIntensive": false,
    "name": "Rethinking the Welfare State",
    "fullname": "Rethinking the Welfare State",
    "info": "Competing arguments about welfare states in advanced industrial countries. Whether welfare states result from sectional interests, class relations, or citizenship rights. Compares American social policy with policies in other western countries.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "816813",
    "code": "POL5325",
    "subject": "POL",
    "number": "5325",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Actors in the US",
    "fullname": "Political Actors in the American Policy Process",
    "info": "The role of political actors in the American policy process, focusing on actors within government (Congressional representatives, the President, bureaucrats, federal judges, state and local elected officials) and outside government (the public, interest groups, social movements, and the media). Theories of agenda setting, policymaking, and policy change. Graduate standing.",
    "prereq": []
  },
  {
    "uid": "789922",
    "code": "POL5327",
    "subject": "POL",
    "number": "5327",
    "honors": false,
    "writingIntensive": false,
    "name": "Local Gov and Pol",
    "fullname": "Politics of American Cities and Suburbs",
    "info": "Development/role of American local government. Forms and structures. Relationships with states and federal government. Local politics and patterns of power/influence.prereq: Credit will not be granted if credit has been received for: : 4327; [[1001 or 1002], [non-pol sci grad major or equiv]] or instr consent",
    "prereq": {
      "or": [
        {
          "code": "POL 1001",
          "subject": "POL",
          "id": "1001"
        },
        {
          "code": "POL 1002",
          "subject": "POL",
          "id": "1002"
        }
      ]
    }
  },
  {
    "uid": "789923",
    "code": "POL5331",
    "subject": "POL",
    "number": "5331",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategy Dom Pol",
    "fullname": "Thinking Strategically in Domestic Politics",
    "info": "Applications of rational-choice and game theories to important features of domestic politics in the United States and elsewhere.prereq: Credit will not be granted if credit has been received for: : 4331; grad student",
    "prereq": {
      "code": "POL 4331",
      "subject": "POL",
      "id": "4331"
    }
  },
  {
    "uid": "799065",
    "code": "POL5403",
    "subject": "POL",
    "number": "5403",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Constitutionalism",
    "fullname": "Constitutions, Democracy, and Rights: Comparative Perspectives",
    "info": "Around the world, fundamental political questions are often debated and decided in constitutional terms, and in the United States, the constitution is invoked at almost every turn to endorse or condemn different policies. Is adhering to constitutional terms the best way to safeguard rights and to achieve a successful democracy? When and how do constitutions matter to political outcomes? This course centers on these questions as it moves from debates over how constitutional drafting processes should be structured and how detailed constitutions should be, to the risks and benefits of different institutional structures (federal v. unitary, and the distribution of powers between the executive, legislature, and judiciary), to which rights (if any) should be constitutionalized and when and why different rights are protected, closing with a discussion of what rules should guide constitutional amendment and rewrite. For each topic, we compare how these issues have been resolved in the U.S. with alternative approaches in a wide variety of other countries around the globe. The goal is not only to expose students to the variety of ways, successful or unsuccessful, that other political communities have addressed these issues, but also to gain a more contextualized and clearer understanding of the pros and cons of the U.S. model, its relevance for other democratic or democratizing countries, whether and how it might be reformed, and, generally speaking, when/how constitutions matter for democratic quality and stability.",
    "prereq": []
  },
  {
    "uid": "789924",
    "code": "POL5410",
    "subject": "POL",
    "number": "5410",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Comparative Politics",
    "fullname": "Topics in Comparative Politics",
    "info": "Topics of current analytical or policy importance. Topics vary, see Class Schedule.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "006974",
    "code": "POL5441",
    "subject": "POL",
    "number": "5441",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol/Envir Policy",
    "fullname": "Environmental Policy",
    "info": "How American political system deals with environmental issues. How third world countries deal with environmental protection/economic growth. How international community deals with global environmental problems. ",
    "prereq": []
  },
  {
    "uid": "789925",
    "code": "POL5461",
    "subject": "POL",
    "number": "5461",
    "honors": false,
    "writingIntensive": false,
    "name": "European Politics",
    "fullname": "European Government and Politics",
    "info": "European political institutions in their social settings. Power and responsibility. Governmental stability. Political decision making. Government and economic order.prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "798907",
    "code": "POL5465",
    "subject": "POL",
    "number": "5465",
    "honors": false,
    "writingIntensive": false,
    "name": "Southeast Asian Politics",
    "fullname": "Democracy and Dictatorship in Southeast Asia",
    "info": "A fundamental question of politics is why some regimes endure for many years while others do not. This course examines the \"menu of manipulation\" through which dictators and democrats claim and retain power, and the conditions under which average citizens mobilize to challenge their governments, despite the risks and in the face of what may seem to be insurmountable odds. We will explore these political dynamics in Southeast Asia, one of the most culturally and politically diverse regions of the globe. Composed of eleven countries, Southeast Asia covers a wide geographical region stretching from India to China. With a rich endowment of natural resources, a dynamic manufacturing base, and a strategic location on China's southern flank, the region has come to play an increasingly important role in the political and economic affairs of the globe. Culturally and ethnically diverse, hundreds of languages are spoken, and the religions practiced include Buddhism, Catholicism, Hinduism, and Islam. The region is similarly diverse in its political systems, which range from democratic to semi-democratic to fully authoritarian. ",
    "prereq": []
  },
  {
    "uid": "789926",
    "code": "POL5467",
    "subject": "POL",
    "number": "5467",
    "honors": false,
    "writingIntensive": false,
    "name": "Japanese Politics",
    "fullname": "Politics and Market in Contemporary Japan",
    "info": "How Japan combined rapid economic development and social stability in postwar period. Strengths/weaknesses of Japanese model of capitalism, particularly in today's new \"globalized\" world.",
    "prereq": []
  },
  {
    "uid": "789927",
    "code": "POL5471",
    "subject": "POL",
    "number": "5471",
    "honors": false,
    "writingIntensive": false,
    "name": "Russian Politics",
    "fullname": "After Communism: Russia and the Commonwealth of Independent States",
    "info": "Politics of newly independent states of former Soviet Union, particularly Russia. Political transformation, sources of political stability/instability, economic reform, problems of multinational state.",
    "prereq": []
  },
  {
    "uid": "789928",
    "code": "POL5473",
    "subject": "POL",
    "number": "5473",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Politics",
    "fullname": "Chinese Politics",
    "info": "Fundamental conflicts in Chinese society. Democracy movement, human rights, class divisions, gender struggles, environmental issues, capitalist vs socialist development strategies. Secondary topics include Chinese foreign relations and domestic/foreign political issues in Taiwan.",
    "prereq": []
  },
  {
    "uid": "789929",
    "code": "POL5477",
    "subject": "POL",
    "number": "5477",
    "honors": false,
    "writingIntensive": false,
    "name": "Mid East Politics",
    "fullname": "Struggles and Issues in the Middle East",
    "info": "Turkey, Iran, Israel, and selected Arab states. Domestic politics of religious/secular, ethnic, economic, environmental, and other policy/identity issues. Regional politics of water access, Israeli/Palestinian/Arab world relationships, oil and Persian/Arabian Gulf, human rights.prereq: Credit will not be granted if credit has been received for: : 4477; 1054 or 3051 or non-pol sci grad student or instr consent",
    "prereq": {
      "or": [
        {
          "code": "POL 4477",
          "subject": "POL",
          "id": "4477"
        },
        {
          "code": "POL 1054",
          "subject": "POL",
          "id": "1054"
        },
        {
          "code": "POL 3051",
          "subject": "POL",
          "id": "3051"
        }
      ]
    }
  },
  {
    "uid": "789930",
    "code": "POL5478",
    "subject": "POL",
    "number": "5478",
    "honors": false,
    "writingIntensive": false,
    "name": "African Politics",
    "fullname": "Contemporary Politics in Africa and the Colonial Legacy",
    "info": "How current politics in mainly, though not exclusively, sub-Saharan Africa have been shaped by pre-colonial/colonial processes. Reality of independence, recurrent political/economic crises. Global context and prospects for effective democracy.",
    "prereq": []
  },
  {
    "uid": "789931",
    "code": "POL5479",
    "subject": "POL",
    "number": "5479",
    "honors": false,
    "writingIntensive": false,
    "name": "Latin American Pol",
    "fullname": "Latin American Politics",
    "info": "Overview of Latin American politics and political economy. Authoritarianism, human rights, redemocratization. Development and economic policy. Social movements. Ethnicity/race. Religion. Revolution. U.S.-Latin American relations.",
    "prereq": []
  },
  {
    "uid": "789932",
    "code": "POL5481",
    "subject": "POL",
    "number": "5481",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Pol Economy",
    "fullname": "Governments and Markets",
    "info": "Connection between democracy and markets. Focuses on countries in North America, Europe.",
    "prereq": []
  },
  {
    "uid": "789933",
    "code": "POL5483",
    "subject": "POL",
    "number": "5483",
    "honors": false,
    "writingIntensive": false,
    "name": "Grassroots Politics",
    "fullname": "Grassroots Politics",
    "info": "Politics of daily life, powerlessness, workplace politics, everyday resistance, local organizing, protest, rebellion, and social movements.",
    "prereq": []
  },
  {
    "uid": "789934",
    "code": "POL5485",
    "subject": "POL",
    "number": "5485",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Rights Policy",
    "fullname": "Human Rights Policy: Issues and Actors",
    "info": "Politics of human rights issue emergence; relevant international, regional, and domestic norms; correlates of state repression; measurement of human rights abuse and remedies; human rights promotion by states, political parties, international organizations, NGOs, social movements, faith-based organizations, and providers of international development assistance.",
    "prereq": []
  },
  {
    "uid": "789935",
    "code": "POL5487",
    "subject": "POL",
    "number": "5487",
    "honors": false,
    "writingIntensive": false,
    "name": "Democracy & Citizen",
    "fullname": "Struggle for Democratization and Citizenship",
    "info": "History of democratic movement from its earliest moments in history to present. Attempts to draw balance sheet. Emphasizes how disenfranchised fought to become included.",
    "prereq": []
  },
  {
    "uid": "816304",
    "code": "POL5492",
    "subject": "POL",
    "number": "5492",
    "honors": false,
    "writingIntensive": false,
    "name": "Law & (In)Justice in Lat Amer",
    "fullname": "Law and (In)Justice in Latin America",
    "info": "This course examines, from various angles, how law and justice function in contemporary Latin America, highlighting similarities and differences within and between countries and issue areas. Students reflect on and debate the causes behind the varied outcomes, as well as the effectiveness, actual and potential, of the different institutional and social change efforts that have been underway in the region since the 1980s. Specific topics addressed include accountability for past and present mass violence; origins of and responses to crime, from \"mano dura\" policies to criminal justice reform and anti-corruption initiatives; and advances and limitations in equal rights protection. Special attention is paid across the course to issues of indigeneity, race, class, gender, and sexuality. Throughout, students compare situations within Latin America, which is by no means a monolith, as well as consider parallels between Latin America and the United States, where, despite great differences in wealth, history and culture, similar problems of law and justice can be found. The course aims thus not only to teach students about Latin America but also to get students to think about what we might learn from Latin America.",
    "prereq": []
  },
  {
    "uid": "789936",
    "code": "POL5501",
    "subject": "POL",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Supreme Court&Constit Interp",
    "fullname": "Supreme Court and Constitutional Interpretation",
    "info": "Historical/analytical approaches to Court's landmark decisions. Theory/techniques of judicial review. Court's authority related to wider political/social context of American government.",
    "prereq": []
  },
  {
    "uid": "789937",
    "code": "POL5502",
    "subject": "POL",
    "number": "5502",
    "honors": false,
    "writingIntensive": false,
    "name": "Supreme Court,Civil Lib,Civ Rt",
    "fullname": "Supreme Court, Civil Liberties, and Civil Rights",
    "info": "Supreme Court's interpretation of Bill of Rights, 14th amendment. Freedom of speech, press, religion. Crime/punishment. Segregation/desegregation, affirmative action. Abortion/privacy.prereq: Credit will not be granted if credit has been received for: : 4502; 1001 or 1002 or equiv or non-pol sci grad student or instr consent",
    "prereq": {
      "or": [
        {
          "code": "POL 4502",
          "subject": "POL",
          "id": "4502"
        },
        {
          "code": "POL 1001",
          "subject": "POL",
          "id": "1001"
        },
        {
          "code": "POL 1002",
          "subject": "POL",
          "id": "1002"
        }
      ]
    }
  },
  {
    "uid": "789938",
    "code": "POL5523",
    "subject": "POL",
    "number": "5523",
    "honors": false,
    "writingIntensive": false,
    "name": "Regulatory Process",
    "fullname": "Politics of Regulatory Process",
    "info": "Operations of regulatory agencies in political/legal environment.  Principles of federal administrative law, informal procedures, interest group activity. Philosophy of regulation. Politics/processes of deregulation.",
    "prereq": []
  },
  {
    "uid": "789939",
    "code": "POL5525",
    "subject": "POL",
    "number": "5525",
    "honors": false,
    "writingIntensive": false,
    "name": "Federal Indian Policy",
    "fullname": "Federal Indian Policy",
    "info": "Formulation, implementation, evolution, comparison of Indian policy from pre-colonial times to self-governance of new millennium. Theoretical approaches to federal Indian policy. Major federal Indian policies.  Views/attitudes of policy-makers, reactions of indigenous nations to policies. Effect of bodies of literature on policies.prereq: Credit will not be granted if credit has been received for: : 4525, AmIn 4525; grad student",
    "prereq": {
      "and": [
        {
          "code": "POL 4525",
          "subject": "POL",
          "id": "4525"
        },
        {
          "code": "AMIN 4525",
          "subject": "AMIN",
          "id": "4525"
        }
      ]
    }
  },
  {
    "uid": "789940",
    "code": "POL5561",
    "subject": "POL",
    "number": "5561",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Legal Systems",
    "fullname": "Comparative Legal Systems",
    "info": "Survey of principal legal systems of Western world. Role of legal system in relation to various political/economic systems. Contrast between common law and civil law traditions.prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "789941",
    "code": "POL5737",
    "subject": "POL",
    "number": "5737",
    "honors": false,
    "writingIntensive": false,
    "name": "Amer Polit Parties",
    "fullname": "American Political Parties",
    "info": "American two-party system. Party influence in legislatures/executives. Decline of parties, their future.prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "789942",
    "code": "POL5766",
    "subject": "POL",
    "number": "5766",
    "honors": false,
    "writingIntensive": false,
    "name": "Amer Pol Culture",
    "fullname": "American Political Culture and Values",
    "info": "Individualism, freedom, equality. Dominant beliefs about democratic principles, materialism, capitalism, citizenship, patriotism/heroism.",
    "prereq": []
  },
  {
    "uid": "789943",
    "code": "POL5767",
    "subject": "POL",
    "number": "5767",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Opinion& Voting Behav",
    "fullname": "Public Opinion and Voting Behavior",
    "info": "Major factors influencing electoral decisions. Political attitude formation/change. Data analysis lab required.prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "789944",
    "code": "POL5810",
    "subject": "POL",
    "number": "5810",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Intl Politics",
    "fullname": "Topics in International Politics and Foreign Policy",
    "info": "Selected issues in contemporary international relations. Topics vary, see Class Schedule.",
    "prereq": []
  },
  {
    "uid": "789945",
    "code": "POL5832",
    "subject": "POL",
    "number": "5832",
    "honors": false,
    "writingIntensive": false,
    "name": "U.S. Security Pol",
    "fullname": "Defending America: U.S. Security Policy",
    "info": "History of U.S. security doctrine. Major issues in present U.S. security policy (e.g., future of NATO, nuclear strategy in absence of a clear enemy, nuclear/chemical international arms control). Political/bureaucratic process of making U.S. defense policy.",
    "prereq": []
  },
  {
    "uid": "789946",
    "code": "POL5833",
    "subject": "POL",
    "number": "5833",
    "honors": false,
    "writingIntensive": false,
    "name": "US For Econ Policy",
    "fullname": "The United States in the Global EconomyUS For Econ Policy",
    "info": "Domestic/international politics of United States. Foreign economic policy (trade, aid, investment, monetary, migration policies). Effects of policies and international economic relations on U.S. economy/politics.prereq: Credit will not be granted if credit has been received for: : 4833; grad student; 3835 recommended",
    "prereq": {
      "code": "POL 3835",
      "subject": "POL",
      "id": "3835"
    }
  },
  {
    "uid": "789947",
    "code": "POL5836",
    "subject": "POL",
    "number": "5836",
    "honors": false,
    "writingIntensive": false,
    "name": "Foreign  Policy",
    "fullname": "Making Foreign Policy: Perceptions and Decisions",
    "info": "Foreign policy decision making beyond the \"to serve the national interest\" cliche. Culture, political psychology, organizational theory, democratic theory, bureaucratic politics, game theory, and political economy. Decision making in cross-cultural settings.",
    "prereq": []
  },
  {
    "uid": "006983",
    "code": "POL5872",
    "subject": "POL",
    "number": "5872",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Env Politics",
    "fullname": "Global Environmental Politics",
    "info": "Emergence of the environment as a key aspect of the global political agenda. Non-governmental and governmental international organizations. Politics of protection of the atmosphere, rain forests, seas and other selected issues. International security and the environment.  ",
    "prereq": []
  },
  {
    "uid": "789948",
    "code": "POL5881",
    "subject": "POL",
    "number": "5881",
    "honors": false,
    "writingIntensive": false,
    "name": "International Law",
    "fullname": "International Law",
    "info": "How international law matters for world politics. War crimes, human rights. Law of the sea and of the environment. International crime. Lectures, discussions, simulations of cases.",
    "prereq": []
  },
  {
    "uid": "789949",
    "code": "POL5883",
    "subject": "POL",
    "number": "5883",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Governance",
    "fullname": "Global Governance",
    "info": "Rise/role of inter-governmental organizations such as United Nations, non-governmental organizations. Peacekeeping, trade, development, human rights, security and arms control, self-determination, refugees, health, environment. Seminar discussions, class simulations.",
    "prereq": []
  },
  {
    "uid": "789950",
    "code": "POL5885",
    "subject": "POL",
    "number": "5885",
    "honors": false,
    "writingIntensive": false,
    "name": "Interntl Conflict",
    "fullname": "International Conflict and Security",
    "info": "Alternative theories of sources of militarized international conflict.  Theories applied to past conflicts. Theories' relevance to present.prereq: grad student",
    "prereq": []
  },
  {
    "uid": "789951",
    "code": "POL5887",
    "subject": "POL",
    "number": "5887",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategy Intl Pol",
    "fullname": "Thinking Strategically in International Politics",
    "info": "Applications of game theory to international politics. Conflict/cooperation, global environmental commons, deterrence/reputation.",
    "prereq": []
  },
  {
    "uid": "789965",
    "code": "POL5889",
    "subject": "POL",
    "number": "5889",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Pol Econ",
    "fullname": "Governments and Global Trade and Money",
    "info": "Politics of international trade and monetary affairs, including north-south and east-west relations.",
    "prereq": []
  },
  {
    "uid": "789892",
    "code": "POL5970",
    "subject": "POL",
    "number": "5970",
    "honors": false,
    "writingIntensive": false,
    "name": "Individual Reading/Research",
    "fullname": "Individual Reading and Research",
    "info": "Guided individual reading or study.Prereq instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "800736",
    "code": "POL8060",
    "subject": "POL",
    "number": "8060",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Prosem in Pol Sci",
    "fullname": "Research Proseminar in Political Science",
    "info": "Readings, discussion, guest speakers. Topics vary by semester.",
    "prereq": []
  },
  {
    "uid": "800737",
    "code": "POL8070",
    "subject": "POL",
    "number": "8070",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Res & Writing in Pol Sci",
    "fullname": "Advanced Research and Writing in Political Science",
    "info": "Commentary/guidance at all stages of dissertation research process, from conceptualization of topic/project to editing of nearly final drafts.",
    "prereq": []
  },
  {
    "uid": "008057",
    "code": "POL8101",
    "subject": "POL",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Poli Sci",
    "fullname": "Introduction to Political Science",
    "info": "History, scope, and methods of political science as a discipline; current subfields; major research programs (including statism, pluralism, institutionalism, realism, behavioralism, rational choice, and critical theory); problems of theory, interpretation, concept-formation, comparison, measurement and experimentation; designs for research.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "789952",
    "code": "POL8104",
    "subject": "POL",
    "number": "8104",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development I",
    "fullname": "Professional Development I",
    "info": "The objectives of this course are as follows: (1) to provide students with professional advice that will help them move with dispatch through the graduate program; (2) to learn the formal and informal norms of the discipline; and (3) to help them prepare to do independent research and dissertation research.prereq: 1st year Pol graduate student",
    "prereq": []
  },
  {
    "uid": "789953",
    "code": "POL8105",
    "subject": "POL",
    "number": "8105",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Development II",
    "fullname": "Professional Development II",
    "info": "Research ethics. Skills for teaching undergraduate courses in political science. Completion of dissertation prospecti or early chapters.prereq: Pol sci student, ABD, dept consent",
    "prereq": []
  },
  {
    "uid": "808180",
    "code": "POL8106",
    "subject": "POL",
    "number": "8106",
    "honors": false,
    "writingIntensive": false,
    "name": "Quantitative PolSci I",
    "fullname": "Quantitative Political Science I",
    "info": "This course provides a thorough grounding in the quantitative analysis of political science data. The emphasis is on how to analyze such data, interpret statistical results, and summarize and report the findings. By the end of the term you will (1) know how to describe variables; (2) test hypotheses; (3) use measures of association to quantify the relationship between two variables while holding a third variable constant; (4) understand bivariate regression and the basics of multiple regression; (5) understand reliability and validity and how to assess these properties empirically; and (6) know how to use the STATA statistical software program.prereq: political science grad major or instr consent",
    "prereq": []
  },
  {
    "uid": "808468",
    "code": "POL8107",
    "subject": "POL",
    "number": "8107",
    "honors": false,
    "writingIntensive": false,
    "name": "Quantitative Polsci II",
    "fullname": "Quantitative Political Science II",
    "info": "Multiple linear regression model applied to political science data. How to use regression techniques to analyze data, interpret statistical results, and summarize/report the findings. Estimation of model. Underlying assumptions. Inference. Model diagnostics. Extensions of model.prereq: Political science grad major or instr consent",
    "prereq": []
  },
  {
    "uid": "817653",
    "code": "POL8108",
    "subject": "POL",
    "number": "8108",
    "honors": false,
    "writingIntensive": false,
    "name": "Maximum Likelihood Estimation",
    "fullname": "Maximum Likelihood Estimation",
    "info": "This course presents an overview of the likelihood theory of statistical inference, and its wide range of uses in applied quantitative political science. When dependent variables take the form of ordered or unordered categories, event counts, or otherwise violate the traditional assumptions of the linear regression model, models estimated by maximum likelihood provide an essential alternative. Topics covered include binary, multinomial, and ordered logit/probit, Poisson regression, and multilevel models. We will rely heavily on computational methods of analysis using the R statistical computing environment, and instruction on how to use R for applied research will be provided throughout the length of the course.",
    "prereq": []
  },
  {
    "uid": "797242",
    "code": "POL8120",
    "subject": "POL",
    "number": "8120",
    "honors": false,
    "writingIntensive": false,
    "name": "Modeling Political Processes",
    "fullname": "Core Course in Political Methodology: Modeling Political Processes",
    "info": "Methods used and potential for creating models of political processes. Designing political institutions, discerning/forecasting election outcomes, producing early warnings of international conflicts, increasing turnout in elections. Using mathematics to study political strategy and collective decision making in committees/legislatures. Using statistics to measure political  variables, design experiments with human subjects, and test micro/macro political theories.prereq: Pol sci grad major or instr consent",
    "prereq": []
  },
  {
    "uid": "005449",
    "code": "POL8122",
    "subject": "POL",
    "number": "8122",
    "honors": false,
    "writingIntensive": false,
    "name": "Positive Theory",
    "fullname": "Positive Theory",
    "info": "Survey of positive political theory and rational-choice models. Information and transaction costs; institutions; models of elections, voting, coalitions.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006527",
    "code": "POL8123",
    "subject": "POL",
    "number": "8123",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Quan Political Res",
    "fullname": "Introduction to Quantitative Political Research",
    "info": "Principles of regression analysis, use of regression model in political science.",
    "prereq": []
  },
  {
    "uid": "005451",
    "code": "POL8124",
    "subject": "POL",
    "number": "8124",
    "honors": false,
    "writingIntensive": false,
    "name": "Game Theory",
    "fullname": "Game Theory",
    "info": "Application of noncooperative game theory in political science. Equilibrium concepts, bargaining, repeated games, games of incomplete information, signaling games, reputation, learning in games.",
    "prereq": []
  },
  {
    "uid": "006621",
    "code": "POL8125",
    "subject": "POL",
    "number": "8125",
    "honors": false,
    "writingIntensive": false,
    "name": "Dynamic Analysis",
    "fullname": "Dynamic Analysis",
    "info": "Time series method, its application in political science.prereq: Pol sci grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "006371",
    "code": "POL8126",
    "subject": "POL",
    "number": "8126",
    "honors": false,
    "writingIntensive": false,
    "name": "Qualitative Methods",
    "fullname": "Qualitative Methods",
    "info": "Qualitative methods in social science. Hands-on training through fieldwork projects. Interviewing, participant observation, narrative interpretation, ethical problems. Issues of gender/race in fieldwork.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "797886",
    "code": "POL8127",
    "subject": "POL",
    "number": "8127",
    "honors": false,
    "writingIntensive": false,
    "name": "Survey Research Methods",
    "fullname": "Survey Research Methods: Measuring Public Opinion",
    "info": "Theoretical/empirical issues in survey research methodology aimed at assessing political attitudes/behavior (including questionnaire design, scientific sampling). Skill areas necessary to analyze, design, or conduct surveys to examine political phenomena.prereq: Pol sci grad major",
    "prereq": []
  },
  {
    "uid": "005454",
    "code": "POL8131",
    "subject": "POL",
    "number": "8131",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Methods Models",
    "fullname": "Advanced Methods and Models",
    "info": "Intersection of statistical methodology and deductive modeling; issues in merging inductive and deductive research. Sample topics: parties and elections, probabilistic voting, strategic modeling of international relations.prereq: Grad pol sci major, 6 cr 81xx seminars or instr consent",
    "prereq": []
  },
  {
    "uid": "007312",
    "code": "POL8160",
    "subject": "POL",
    "number": "8160",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Models and Methods",
    "fullname": "Topics in Models and Methods",
    "info": "Seminars on selected topics, as specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "006910",
    "code": "POL8201",
    "subject": "POL",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Theory",
    "fullname": "Understanding Political Theory",
    "info": "Key concepts/major approaches.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "006916",
    "code": "POL8215",
    "subject": "POL",
    "number": "8215",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Inquiry",
    "fullname": "Philosophy of Political Inquiry",
    "info": "Major schools in philosophy of science as applied to political inquiry: pragmatism, positivism, hermeneutics, critical rationalism, critical theory, realism. Themes of political inquiry: explanation, interpretation, theory, criticism. Political issues raised by philosophy of science: liberalism, democracy, control, multiculturalism.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006914",
    "code": "POL8225",
    "subject": "POL",
    "number": "8225",
    "honors": false,
    "writingIntensive": false,
    "name": "American Pol Thght",
    "fullname": "American Political Thought",
    "info": "Colonial era to present: Puritans, American Revolution, Constitution, rise of individualism, pro- and anti-slavery arguments, civil war and reconstruction, industrialism, westward expansion, Native Americans, immigration, populism, socialism, social Darwinism, growth of corporations and unions; Great Depression; growth of American power at home and abroad.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006918",
    "code": "POL8235",
    "subject": "POL",
    "number": "8235",
    "honors": false,
    "writingIntensive": false,
    "name": "Democratic Theory",
    "fullname": "Democratic Theory",
    "info": "Competing models of democracy: classical, republican, liberal, radical, Marxist, neo-Marxist, pragmatist, populist, pluralist, postmodern, participatory. Domestic and international struggles over meaning of \"democracy\"; social science models of and findings on democracy.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006921",
    "code": "POL8251",
    "subject": "POL",
    "number": "8251",
    "honors": false,
    "writingIntensive": false,
    "name": "Ancient Pol Thought",
    "fullname": "Ancient and Medieval Political Thought",
    "info": "Politics and ethics in Greece, Rome, Christendom: Thucydides, Socrates, Plato, Aristotle, Cicero, Augustine, Aquinas, Marsilius.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006923",
    "code": "POL8252",
    "subject": "POL",
    "number": "8252",
    "honors": false,
    "writingIntensive": false,
    "name": "Early Modern Pol Th",
    "fullname": "Early Modern Political Thought",
    "info": "Theorists and texts from Renaissance to French Revolution. Selectively includes Machiavelli, More, Calvin, Luther, Grotius, Bodin, Hobbes, Winstanley, Harrington, Locke, Montesquieu, Rousseau, Hume, Smith, Burke, and Wollstonecraft; key debates over liberty, law, power, and knowledge.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006924",
    "code": "POL8253",
    "subject": "POL",
    "number": "8253",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Pol Thought",
    "fullname": "Late Modern Political Thought",
    "info": "Theoretical responses to and rival interpretations of Western economy, society, politics, and democratic culture in the modern age; theories of history; class struggle; the end of metaphysics and the death of God; technology and bureaucracy; psychology of culture, in Hegel, Marx, Tocqueville, Mill, Nietzsche, Weber, Freud.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006926",
    "code": "POL8260",
    "subject": "POL",
    "number": "8260",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Political Theory",
    "fullname": "Topics in Political Theory",
    "info": "Readings and research in special topics or problems.",
    "prereq": []
  },
  {
    "uid": "006925",
    "code": "POL8275",
    "subject": "POL",
    "number": "8275",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemp Pol Thought",
    "fullname": "Contemporary Political Thought",
    "info": "From approximately World War II to the present. Survey of range of texts or intensive focus on such authors as Adorno, Arendt, Derrida, Foucault, Habermas, Horkheimer, Rawls, Said. Sample topics: feminism, postmodernism, communitarianism, Frankfurt School, postcolonialism.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006545",
    "code": "POL8301",
    "subject": "POL",
    "number": "8301",
    "honors": false,
    "writingIntensive": false,
    "name": "American Politics",
    "fullname": "American Politics",
    "info": "Seminar on main themes of theory and research in American politics, institutions, law, and policy. Major works on individual, mass, elite, and institutional behavior and their relationship to each other. Foundation for advanced seminars in American politics.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006546",
    "code": "POL8302",
    "subject": "POL",
    "number": "8302",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Opinion",
    "fullname": "Public Opinion and Political Behavior",
    "info": "Major theoretical perspectives/research on political participation, voting behavior, public opinion. Voter turnout, importance of party identification, effects of campaigns, long-term change in public opinion, designing/conducting research.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006547",
    "code": "POL8303",
    "subject": "POL",
    "number": "8303",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Parties",
    "fullname": "Political Parties",
    "info": "Party systems and subsystems; party organizational characteristics, goals, and incentives; distribution of power and authority within the party; chief party functions; party as an organizer of governmental power; determinants of party structure and role.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006548",
    "code": "POL8305",
    "subject": "POL",
    "number": "8305",
    "honors": false,
    "writingIntensive": false,
    "name": "Interest Grps & Soc Movements",
    "fullname": "Interest Groups and Social Movements",
    "info": "Theoretical/empirical work on role of interest groups and social/political movements in American politics and policy-making processes. Theories of interest group and social/political movement formation, maintenance, and decline. How interest groups and social/political movements attempt to influence public policy. Impact/effectiveness groups/movements as agents of democratic representation, particularly for marginalized groups.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006549",
    "code": "POL8307",
    "subject": "POL",
    "number": "8307",
    "honors": false,
    "writingIntensive": false,
    "name": "Prosem Pol Psych",
    "fullname": "Proseminar in Political Psychology I",
    "info": "Readings, discussion, and guest speakers. Topics vary by semester.prereq: Grad pol sci major or pol psych minor or instr consent",
    "prereq": []
  },
  {
    "uid": "006550",
    "code": "POL8308",
    "subject": "POL",
    "number": "8308",
    "honors": false,
    "writingIntensive": false,
    "name": "Proseminar Political Psych II",
    "fullname": "Proseminar in Political Psychology II",
    "info": "Readings, discussion, and guest speakers. Topics vary by semester.",
    "prereq": []
  },
  {
    "uid": "006551",
    "code": "POL8311",
    "subject": "POL",
    "number": "8311",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol Psychology",
    "fullname": "Political Psychology and Socialization",
    "info": "Introduction to political psychology. Personality and politics; political cognition, emotion, and political behavior; political expertise; media and politics; aggression, authoritarianism, and political behavior; altruism and politics.prereq: Grad pol sci major or pol psych minor or instr consent",
    "prereq": []
  },
  {
    "uid": "006552",
    "code": "POL8312",
    "subject": "POL",
    "number": "8312",
    "honors": false,
    "writingIntensive": false,
    "name": "Legislative Process",
    "fullname": "Legislative Process",
    "info": "Introduction to study of legislative politics; theories of legislative institutions and individual behavior; congressional elections; congressional committees, parties, and leaders.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006553",
    "code": "POL8313",
    "subject": "POL",
    "number": "8313",
    "honors": false,
    "writingIntensive": false,
    "name": "Executive Process",
    "fullname": "Executive Process",
    "info": "Tension between leadership and democracy in context of American presidency in terms of President's relationship with federal bureaucracy, Congress, and making of diplomatic and military policy.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006554",
    "code": "POL8314",
    "subject": "POL",
    "number": "8314",
    "honors": false,
    "writingIntensive": false,
    "name": "Judicial Process",
    "fullname": "Judicial Process",
    "info": "Judicial systems and roles; selection of judges; organizing and supporting litigation; influences on judicial decisions; impact and enforcement of judicial decisions; courts and other institutions of government.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "792634",
    "code": "POL8320",
    "subject": "POL",
    "number": "8320",
    "honors": false,
    "writingIntensive": false,
    "name": "SocPsy of Prejudice&Intergrp R",
    "fullname": "Social Psychology of Prejudice and Intergroup Relations",
    "info": "Approaches, findings, and controversies in research on social psychology of prejudice, racial attitudes, and intergroup relations. Focuses on approaches based in social psychology and on related work from political science and sociology.",
    "prereq": []
  },
  {
    "uid": "006555",
    "code": "POL8321",
    "subject": "POL",
    "number": "8321",
    "honors": false,
    "writingIntensive": false,
    "name": "Urban Politics",
    "fullname": "Urban Politics",
    "info": "Selection of local leadership; relationship of political system to governmental forms and social institutions; role and impact of political institutions; policymaking at local level; studies in policy problems; the emerging metropolis.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006556",
    "code": "POL8325",
    "subject": "POL",
    "number": "8325",
    "honors": false,
    "writingIntensive": false,
    "name": "State Politics",
    "fullname": "State Politics and Intergovernmental Relations",
    "info": "Theoretical approaches to comparative study of state politics; study of political culture and behavior, governmental institutions, and public policy at state level; federalism.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006557",
    "code": "POL8331",
    "subject": "POL",
    "number": "8331",
    "honors": false,
    "writingIntensive": false,
    "name": "Constitutional Law",
    "fullname": "Constitutional Law",
    "info": "Overview of substantive and theoretical debates in American constitutional law; role of law and constitutional interpretation in shaping American political institutions and American politics.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "788263",
    "code": "POL8333",
    "subject": "POL",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "006558",
    "code": "POL8335",
    "subject": "POL",
    "number": "8335",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Policy",
    "fullname": "Public Policy",
    "info": "Theoretical approaches: incrementalism, innovation and policy learning, comparative policy outputs, policy process models, interest groups, and selected areas of public policy.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "007310",
    "code": "POL8337",
    "subject": "POL",
    "number": "8337",
    "honors": false,
    "writingIntensive": false,
    "name": "The Welfare State",
    "fullname": "Welfare State Theories and American Social Policy",
    "info": "Rival theoretical explanations for cause and nature of welfare state development in context of four American social policies: social security, welfare, education, and healthcare.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006560",
    "code": "POL8360",
    "subject": "POL",
    "number": "8360",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in American Politics",
    "fullname": "Topics in American Politics",
    "info": "Readings and research in special topics or problems.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "uid": "006988",
    "code": "POL8401",
    "subject": "POL",
    "number": "8401",
    "honors": false,
    "writingIntensive": false,
    "name": "International Relat",
    "fullname": "International Relations",
    "info": "Basic theories/approaches to study of international politics. Surveys representative work/central issues of scholarship.prereq: Grad pol sci major or dept consent",
    "prereq": []
  },
  {
    "uid": "006989",
    "code": "POL8402",
    "subject": "POL",
    "number": "8402",
    "honors": false,
    "writingIntensive": false,
    "name": "International Security",
    "fullname": "International Security",
    "info": "Introduction to contending theories of international conflict/security.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006992",
    "code": "POL8403",
    "subject": "POL",
    "number": "8403",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Norms & Instit",
    "fullname": "International Norms and Institutions",
    "info": "Origins, roles, and effectiveness of international norms and institutions; theoretical explanations and debates. Institution of sovereignty; rational choice versus constructivist perspectives; role of international law, international organizations, and non-governmental organizations; and international society and transnational cultural norms.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006994",
    "code": "POL8404",
    "subject": "POL",
    "number": "8404",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Hierarchy",
    "fullname": "International Hierarchy",
    "info": "Asymmetric structures and processes of international relations; systemic conditions and implications of informal empire and structures of hegemony; cultural productions of difference and inequality.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006995",
    "code": "POL8405",
    "subject": "POL",
    "number": "8405",
    "honors": false,
    "writingIntensive": false,
    "name": "Int'l Pol Economy",
    "fullname": "International Political Economy",
    "info": "Theoretical and policy issues in international economic relations. Different approaches for understanding outcomes in international economy. Trade, finance, labor markets, creation and maintenance of international regimes, and \"globalization\" of economic liberalism.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006996",
    "code": "POL8406",
    "subject": "POL",
    "number": "8406",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol of Intl Finance",
    "fullname": "Politics of International Finance",
    "info": "Relationship between workings of the international political system and that of international markets for currency and capital.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006997",
    "code": "POL8407",
    "subject": "POL",
    "number": "8407",
    "honors": false,
    "writingIntensive": false,
    "name": "Morality/World Pol",
    "fullname": "Morality in World Politics",
    "info": "Approaches to normative theorizing and empirical research on moral norms in world politics. Theoretical topics: realism, communitarianism, consequentialism, constructivism, postmodernism, cultural relativism. Substantive issue areas: famine and foreign aid, just war theory, nuclear weapons, moral implications of technology, case study on war (Gulf War).prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006998",
    "code": "POL8408",
    "subject": "POL",
    "number": "8408",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Rel of Environ",
    "fullname": "International Relations of the Environment",
    "info": "Theory and practice of international environmental politics. Emergence of environment as major issue of international relations. Diversities of agendas and politics. Imperatives, templates, resistance in global efforts to forge an applied politics of environmental sustainability. Selected cases.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "825446",
    "code": "POL8409",
    "subject": "POL",
    "number": "8409",
    "honors": false,
    "writingIntensive": false,
    "name": "International Law & Regulation",
    "fullname": "International Law and Regulation",
    "info": "This is a graduate seminar that examines seminal interdisciplinary research on the role of international laws, institutions, and regulations in world politics. Its objective is to enhance your understanding of the ways in which international rules shape international and domestic politics, practices, values, and relations. To what extent does international law help resolve conflicts between countries? What is its relationship with governments’ foreign policies? To what extent has international law helped governments achieve common goals or express important values? How does international law interact with domestic politics, legal systems, or cultures? Throughout the course, we emphasize the relationship between law and politics and seek to understand the nature of international law and transnational regulatory standards.The course is divided into three main parts. First, we will explore a variety of approaches to conceptualizing and analyzing international rules and institutions. This part will consider different reasons for legalizing cooperation, the role of domestic politics in the turn to international law and regulation, institutional design considerations, and the process and politics of delegating authority to a supranational legal body. The second part of the course examines tools and approaches scholars use to evaluate the effectiveness or effects of these efforts. We assess whether and how legal or regulatory institutions engender compliance with rules; explore different ways in which they can have an effect on the behavior, beliefs, and identities of a range of actors; and interrogate the intended and unintended consequences of legal regulation in global politics. Finally, after workshopping our own research, we consider broader implications of the turn to international law in terms of complexity, fragmentation, backlash, and pressing problems for the current political moment.",
    "prereq": []
  },
  {
    "uid": "006999",
    "code": "POL8411",
    "subject": "POL",
    "number": "8411",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol Psy/Forgn Polcy",
    "fullname": "Political Psychology and Foreign Policy",
    "info": "Foreign policy theories about decision makers and audiences. Impact of human nature, formal institutions, cultural and cross-cultural settings, and kinds of issues on foreign policy choice, control, and justification.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "007000",
    "code": "POL8412",
    "subject": "POL",
    "number": "8412",
    "honors": false,
    "writingIntensive": false,
    "name": "Amer Foreign Policy",
    "fullname": "American Foreign Policy",
    "info": "U.S. policy toward foreign states and peoples: heritage, motivations, policy processes, what the public generally knows and wants, specific policies. Rise of intermestic issues and decline of enemy-focused internationalism; implications for process and content of U.S. foreign policy.prereq: 8410 or instr consent",
    "prereq": {
      "code": "POL 8410",
      "subject": "POL",
      "id": "8410"
    }
  },
  {
    "uid": "788403",
    "code": "POL8444",
    "subject": "POL",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and director of graduate studies consent",
    "prereq": []
  },
  {
    "uid": "007001",
    "code": "POL8460",
    "subject": "POL",
    "number": "8460",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Int'l Relations",
    "fullname": "Topics in International Relations",
    "info": "Readings and research in advanced topics or problems. Recent topics: global environmental issues, morality in world politics, and norms and institutions in world politics.",
    "prereq": []
  },
  {
    "uid": "006563",
    "code": "POL8601",
    "subject": "POL",
    "number": "8601",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Pol",
    "fullname": "Introduction to Comparative Politics",
    "info": "Main theoretical approaches and issues: comparative method, the state and class; political culture; development, democratization, rational choice, social movements.prereq: Grad pol sci major",
    "prereq": []
  },
  {
    "uid": "796143",
    "code": "POL8602",
    "subject": "POL",
    "number": "8602",
    "honors": false,
    "writingIntensive": false,
    "name": "Families, Children, & State",
    "fullname": "Families, Children, and the State",
    "info": "Politics of family, sex, and children. Comparative perspective. Family autonomy vs. state authority. Political struggles over the definition of family, sex, and marriage. Crisis in fatherhood. Children.s rights. Globalization of Western ideology of childhood. Political realities of third-world childhood. Theories of political efficacy in family/child advocacy.",
    "prereq": []
  },
  {
    "uid": "006564",
    "code": "POL8603",
    "subject": "POL",
    "number": "8603",
    "honors": false,
    "writingIntensive": false,
    "name": "European Politics",
    "fullname": "European Government and Politics",
    "info": "Main theories and approaches used to interpret European politics. Many of these theories have broad relevance for comparative politics, for example, theories about the state, cleavages and coalitional bases, parties and social movements, and constitutional structures and institutions have broad relevance for the field of comparative politics.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006565",
    "code": "POL8605",
    "subject": "POL",
    "number": "8605",
    "honors": false,
    "writingIntensive": false,
    "name": "African Govt & Pol",
    "fullname": "Government and Politics in Africa",
    "info": "Theoretical and methodological approaches to study of African politics, focusing on pre-colonial and colonial legacies for post-colonial reality. Local politics, social construction of identities, political economy of peasantry and working class, political development and decay, social movements, and prospects for democracy.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006566",
    "code": "POL8608",
    "subject": "POL",
    "number": "8608",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol Fmr Sov Union",
    "fullname": "Government and Politics of Russia and the Commonwealth of Independent States",
    "info": "Framework for understanding politics of change underway in the former Soviet Union. Roots of current transformation, including causes and legacy of the Russian revolution and creation of the Soviet Union. Issues in current transformation, including nationalism, economic reform, and democratization. Prior knowledge of basic Soviet politics is assumed.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006366",
    "code": "POL8611",
    "subject": "POL",
    "number": "8611",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Politics",
    "fullname": "Chinese Politics",
    "info": "Major issues since 1949: democratization, dissent, violence, gender, capitalist and socialist development strategies, inequality, effect of culture on politics, status of Taiwan. Current scholarly debates on Chinese politics. Professional methods for research on contemporary China.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "007313",
    "code": "POL8615",
    "subject": "POL",
    "number": "8615",
    "honors": false,
    "writingIntensive": false,
    "name": "Japanese Politics",
    "fullname": "The Political Economy of Contemporary Japan",
    "info": "Major political and economic issues confronting the Japanese system; situation of Japanese case within comparative politics literature concerning role of the state in formulating economic and social policy making. Review of literature. Deregulation in key industries, welfare reform, tax reforms.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006567",
    "code": "POL8619",
    "subject": "POL",
    "number": "8619",
    "honors": false,
    "writingIntensive": false,
    "name": "Latin Amer Politics",
    "fullname": "Latin American Politics",
    "info": "Major bodies of theory on development, democracy and redemocratization, social movements, civil society, the state, and transnational linkages.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "817631",
    "code": "POL8621",
    "subject": "POL",
    "number": "8621",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative & Case Study Mthds",
    "fullname": "Comparative and Case Study Methods",
    "info": "This course will provide students with a basic introduction to methodological debates surrounding comparative and case study methods in political science. Although the course is designed primarily with an eye to the needs of students in comparative politics, this course will also be useful to students in other subfields who wish to learn more about comparative and/or case study methods. This course is primarily for students in their 2nd year and beyond in the Political Science PhD program.",
    "prereq": []
  },
  {
    "uid": "006570",
    "code": "POL8633",
    "subject": "POL",
    "number": "8633",
    "honors": false,
    "writingIntensive": false,
    "name": "Compar Sociopol Chg",
    "fullname": "Comparative Sociopolitical Change",
    "info": "Critical evaluation of literature and theoretical perspectives; comparative examination of social and political change and interrelationship between both processes; structure/agency nexus.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006571",
    "code": "POL8637",
    "subject": "POL",
    "number": "8637",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Pol Econ",
    "fullname": "Comparative Political Economy",
    "info": "Connections between democracy and markets, emphasizing experiences of countries in North America and Europe.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006573",
    "code": "POL8641",
    "subject": "POL",
    "number": "8641",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Mass Pol Behav",
    "fullname": "Comparative Mass Political Behavior",
    "info": "Examined from a cross-national perspective. Development of political participation, mobilization and its effects, development of political cleavages and political parties as vehicles of conflict, modes of political behavior under varied systems of representation and varied party systems.prereq: Grad pol sci major or instr consent",
    "prereq": []
  },
  {
    "uid": "006574",
    "code": "POL8643",
    "subject": "POL",
    "number": "8643",
    "honors": false,
    "writingIntensive": false,
    "name": "Compar Polit Institutions",
    "fullname": "Comparative Political Institutions",
    "info": "Structure/operation of various political institutions in different settings. Theoretical approaches, comparative frameworks. Introduction to literature on political institutions. Preparation for comparative research on political institutions.prereq: Pol sci grad student or  instr consent",
    "prereq": []
  },
  {
    "uid": "006575",
    "code": "POL8660",
    "subject": "POL",
    "number": "8660",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Comparative Politics",
    "fullname": "Topics in Comparative Politics",
    "info": "Readings in advanced topics or problems. Supervised research/training. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "788516",
    "code": "POL8666",
    "subject": "POL",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral, up to 24 combined cr, permission number required for registration, doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "788644",
    "code": "POL8777",
    "subject": "POL",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "787924",
    "code": "POL8888",
    "subject": "POL",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "007391",
    "code": "POL8990",
    "subject": "POL",
    "number": "8990",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Readings and Research in Political Science",
    "info": "TBDprereq: 16 cr 8xxx pol sci courses, instr consent, dept consent",
    "prereq": []
  }
]