[
  {
    "uid": "825908",
    "code": "PORT1022",
    "subject": "PORT",
    "number": "1022",
    "honors": false,
    "writingIntensive": false,
    "name": "Intensive Beginning Portuguese",
    "fullname": "Intensive Beginning Portuguese",
    "info": " Intensive course for those with no Portuguese background. Develops novice-intermediate low proficiency in listening, speaking, reading, writing. Based on materials from Portugal, Brazil, and Portuguese-speaking Africa. Pair and small-group communicative activities, focused on interpreting and producing audio(visual) and written texts. This class is partially online.   ",
    "prereq": []
  },
  {
    "uid": "010220",
    "code": "PORT1101",
    "subject": "PORT",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Port",
    "fullname": "Beginning Portuguese",
    "info": "Listening, speaking, reading, writing. Cultures of Portugal, Brazil, or Portuguese-speaking Africa. Workbook assignments, paired/small group activities.",
    "prereq": []
  },
  {
    "uid": "010223",
    "code": "PORT1102",
    "subject": "PORT",
    "number": "1102",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Portuguese",
    "fullname": "Beginning Portuguese",
    "info": "Reading, writing, speaking, listening. Cultures of Portugal, Brazil, or Portuguese-speaking Africa. Workbook assignments, paired/small group activities.prereq: 1101 or instr consent",
    "prereq": {
      "code": "PORT 1101",
      "subject": "PORT",
      "id": "1101"
    }
  },
  {
    "uid": "010226",
    "code": "PORT1103",
    "subject": "PORT",
    "number": "1103",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Port",
    "fullname": "Intermediate Portuguese",
    "info": " Advancing listening, speaking, reading, writing skills based on materials from Portugal, Brazil, or Portuguese-speaking Africa. Paired and small-group communicative activities, focused on interpreting and producing audio(visual) and written texts at the intermediate level. This class is partially online.  prereq: 1102 or instr consentMeets concurrently with 4103.",
    "prereq": {
      "or": [
        {
          "code": "PORT 1102",
          "subject": "PORT",
          "id": "1102"
        },
        {
          "code": "PORT 4103",
          "subject": "PORT",
          "id": "4103"
        }
      ]
    }
  },
  {
    "uid": "010227",
    "code": "PORT1104",
    "subject": "PORT",
    "number": "1104",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Port",
    "fullname": "Intermediate Portuguese",
    "info": "Advancing listening, speaking, reading, writing skills based on materials from Portugal, Brazil, or Portuguese-speaking Africa. Paired and small-group communicative activities, focused on interpreting and producing audio(visual) and written texts at the intermediate level. This class is partially online. prereq: 1103 or instr consent",
    "prereq": {
      "code": "PORT 1103",
      "subject": "PORT",
      "id": "1103"
    }
  },
  {
    "uid": "808610",
    "code": "PORT1904",
    "subject": "PORT",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "799213",
    "code": "PORT1905",
    "subject": "PORT",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Topic Freshman Seminar",
    "fullname": "Topic Freshman Seminar",
    "info": "Topics specified in Course Guide.prereq: fr",
    "prereq": []
  },
  {
    "uid": "799012",
    "code": "PORT1909W",
    "subject": "PORT",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Course Guide.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "825596",
    "code": "PORT1911",
    "subject": "PORT",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Black Brazil",
    "fullname": "Black Brazil: The long road to racial justice",
    "info": "Brazil has long been seen as a place where racial mixtures are celebrated and where racism has been non-existent or assumed a \"softer\" expression than in the US.  Due to this myth, known as ?racial democracy,? it has been difficult for Brazilian Blacks to identify themselves as such and mobilize for representation and equality of rights.  This course is an introduction to the cultural history of that struggle since the 1930s to the present.  We will follow the emergence of Black voices denouncing the official racial ideology that aimed to ?whiten,? exclude and ultimately do away with the reminders (and remainders) of the 5 million African slaves who landed in Brazil between the 16th and 19th centuries.  We will study a variety of materials from literature and the arts, including films, pop music, rap, and graffiti; and will also read short texts from journalism, history, and the social sciences. The course will end with the discussion of how the introduction of affirmative action in Brazilian public universities has encouraged a Black/White form of racial identification that many consider foreign to the dominant ethos (i.e. ?we are all mixed?).",
    "prereq": []
  },
  {
    "uid": "007878",
    "code": "PORT3001",
    "subject": "PORT",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Port Span Speakers",
    "fullname": "Portuguese for Spanish Speakers",
    "info": "This intensive, introductory Portuguese course emphasizes speaking and writing, the interpretation of written and audi(visual) Portuguese-language texts, and knowledge of cultural aspects of Portuguese-speaking countries. It uses students' Spanish language skills as a point of departure to develop knowledge of and the ability to apply Portuguese language forms to the interpretation and creation of Portuguese-language texts.Portuguese 3001 is a course developed for students with at least intermediate-level skills in Spanish. It builds on Spanish-language skills to cover the linguistic content of PORT 1101-1104 in one semester. You will use your developing Portuguese language skills to explore the cultures of various Portuguese-speaking communities via a wealth of authentic materials such as news stories, pop culture magazines, literature, film, and tv. The course simultaneously develops your knowledge of different language structures and your ability to use them in real world contexts.This class follows a flipped classroom model, in which the study of grammatical concepts is to be done outside of class. Prior to class, students study the material in the textbook and complete any assigned exercises; in class group exercises are done to practice and apply the new grammatical concepts learned. Since the ultimate goal of the program is for you to communicate in the Portuguese language, actual communication in class will be emphasized. prereq: SPAN LPE Pass",
    "prereq": []
  },
  {
    "uid": "810667",
    "code": "PORT3002",
    "subject": "PORT",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Port for Span Speaker",
    "fullname": "Business Portuguese for Spanish Speakers",
    "info": "Basic communication skills in Portuguese. Cultural knowledge needed to function in business environment in Brazil. Designed for English speakers with proficiency in Spanish, but with no prior knowledge of Brazilian Portuguese or for students with limited knowledge of Portuguese.prereq: SPAN LPE pass, [SPAN 1004 or SPAN 1014 or SPAN 1044 or instr consent]",
    "prereq": {
      "or": [
        {
          "code": "SPAN 1004",
          "subject": "SPAN",
          "id": "1004"
        },
        {
          "code": "SPAN 1014",
          "subject": "SPAN",
          "id": "1014"
        },
        {
          "code": "SPAN 1044",
          "subject": "SPAN",
          "id": "1044"
        }
      ]
    }
  },
  {
    "uid": "007879",
    "code": "PORT3003",
    "subject": "PORT",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Portuguese Conv & Comp",
    "fullname": "Portuguese Conversation and Composition",
    "info": "The goals of this course are twofold. The first goal is to improve your abilities in the four areas of language (speaking, listening, reading, and writing) to the point that you can communicate advanced ideas in written and spoken Portuguese. The second goal is for you to possess a foundational understanding of cultural texts (plays, short stories, poems, films, and essays) from the 1950s onward that will help generate your enthusiasm for Portuguese and help you understand how the arts are entwined in resistance to injustice throughout the communities where Portuguese, among other languages, is spoken. As a course that bridges the language courses and the content courses, PORT3003 includes both advanced grammar and critical analysis to prepare you for content courses, such as PORT 3501w, and the longer writing assignments that you will have in such courses. The course will be taught in Portuguese, and the reading, writing, and speaking will be done in Portuguese. Assessments include, but are not necessarily limited to, writing assignments, oral presentations, and written exams. \n\nprereq: 1104 or 3001 or Port LPE",
    "prereq": {
      "or": [
        {
          "code": "PORT 1104",
          "subject": "PORT",
          "id": "1104"
        },
        {
          "code": "PORT 3001",
          "subject": "PORT",
          "id": "3001"
        }
      ]
    }
  },
  {
    "uid": "007880",
    "code": "PORT3501W",
    "subject": "PORT",
    "number": "3501",
    "honors": false,
    "writingIntensive": true,
    "name": "Global Portuguese: 1300-1900",
    "fullname": "Global Portuguese: 1300-1900",
    "info": "This course is the first half of a two-semester introduction to literatures and cultures in Portuguese taught from historical and nationally specific perspectives, from the 16th through the 19th centuries. Keeping in mind the cultural, social, and racial violence affecting BIPOC people around us, you will learn how cultural common senses of “others” originate in and are perpetuated by representations that are considered icons of nationality. For that end, this first semester of Global Portuguese is taught from a critical race feminist perspective that prompts you to question the colonialist, racist, classist, and sexist implications of certain stories and images. At the same time, you will be introduced to indigenous, black, and female voices of resistance and self-affirmation. All writing assignments and discussions are meant to encourage critical, plural thought about such topics as empire, globalization, slavery, colonialism, exclusion, displacement, and belonging. The course will be taught in Portuguese, and all the reading, writing, and speaking will be done in Portuguese. Assessments include essays and two exams as well as graded homework and class activities. prereq: 3003",
    "prereq": {
      "code": "PORT 3003",
      "subject": "PORT",
      "id": "3003"
    }
  },
  {
    "uid": "007882",
    "code": "PORT3502W",
    "subject": "PORT",
    "number": "3502",
    "honors": false,
    "writingIntensive": true,
    "name": "Global Portuguese/1900-present",
    "fullname": "Global Portuguese: 1900-present",
    "info": "This course is the second half of a two-semester introduction to Global Portuguese literatures and cultures. Beginning where PORT3501w ended, you will examine twentieth-century cultural texts in Portuguese, focusing primarily on Brazil, though also reading texts from other countries where Portuguese, among other languages, is spoken, such as Angola, Mozambique, and Portugal. Much of what you will study is related to different modernist traditions. You will primarily read poetry and short stories, though you may also study other genres, such as songs and essays. PORT3501w is not a prerequisite. PORT3502w is taught in Portuguese, and all of the reading, writing, and speaking will be done in Portuguese. Assessments include essays and may also include other graded assignments, such as oral presentations or written exams. prereq: 3003",
    "prereq": {
      "code": "PORT 3003",
      "subject": "PORT",
      "id": "3003"
    }
  },
  {
    "uid": "015612",
    "code": "PORT3503W",
    "subject": "PORT",
    "number": "3503",
    "honors": false,
    "writingIntensive": true,
    "name": "Lit/Cul Lusophone Africa",
    "fullname": "Literatures and Cultures of Lusophone Africa",
    "info": "Introduction to Lusophone Africa (Angola, Cape-Verde, Guinea-Bissau, Mozambique, Sao Tome/Principe). Literature, cultural/literary criticism, history, anthropology, media (film, art, music).prereq: 3003",
    "prereq": {
      "code": "PORT 3003",
      "subject": "PORT",
      "id": "3003"
    }
  },
  {
    "uid": "007883",
    "code": "PORT3603W",
    "subject": "PORT",
    "number": "3603",
    "honors": false,
    "writingIntensive": true,
    "name": "PortCul: Transl",
    "fullname": "Portuguese-Speaking Cultures in Translation",
    "info": "Portuguese-speaking world. Sociohistorical, geopolitical, and cultural foundations of Lusophone Africa, Brazil, and/or Portugal.",
    "prereq": []
  },
  {
    "uid": "790887",
    "code": "PORT3800",
    "subject": "PORT",
    "number": "3800",
    "honors": false,
    "writingIntensive": false,
    "name": "Film Studies in Portuguese",
    "fullname": "Film Studies in Portuguese",
    "info": "This course offers an introduction to Brazilian film from the 1960s to the present and to postcolonial films from Portugal, Angola, and Mozambique. You will learn about the history of Brazilian film from cinema novo on, with attention to state funding; internationalization; and recurrent themes, such as the sertão or backlands and the favela or shantytown. In the case of Lusophone postcolonial films, you will learn about issues of personal and collective identity, including hybrid, diasporic, and non-heteronormative identities; nation building and post-conflict trauma; memory and healing. The approach is two-fold: cinema as representation of society, history, culture, and the individual subject; and cinema as a complex, multi-layered, and expensive art form. You are expected to critically engage with the form and content of each film as you acquire an understanding of the historical, cultural, (geo)political, and socio-economic forces that have shaped the development of film in the various countries, in addition to the social issues raised by filmmakers. You will also become familiar with philosophical and aesthetic insights from which to critically review a film. The course will be taught in Portuguese and you are expected to use Portuguese orally in class and in all written assignments. Readings will be in Portuguese and occasionally in English.\n\nTopics vary and are specified in the class schedule. \n\nprereq: 3003 or instr consent or dept consent",
    "prereq": {
      "code": "PORT 3003",
      "subject": "PORT",
      "id": "3003"
    }
  },
  {
    "uid": "790846",
    "code": "PORT3830",
    "subject": "PORT",
    "number": "3830",
    "honors": false,
    "writingIntensive": false,
    "name": "Film Studies in Portuguese",
    "fullname": "Film Studies in Portuguese",
    "info": "Films from the Portuguese-speaking world in their historical, (geo)political, and socio-economic contexts. Films from Brazil, Portugal, or Lusophone Africa analyzed under interdisciplinary framework, noting aspects related to cinematography/rhetorics.",
    "prereq": []
  },
  {
    "uid": "007991",
    "code": "PORT3910",
    "subject": "PORT",
    "number": "3910",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Lusophone Lits",
    "fullname": "Topics in Lusophone Literatures",
    "info": "In this course, you will read literature from communities where Portuguese is spoken, such as Angola, Brazil, Cape Verde, Mozambique, and Portugal. The readings will be linked by a common topic, such as gender/sexuality, postcolonialism/globalization, or transatlantic studies. The specific topic will vary from one semester to another, but the goal will always be for you to gain a deeper understanding of the topic and how it connects to literature and to a historical context. You may read a selection of genres of literature, such as short stories, plays, essays, and poems, as well as theoretical texts about the topic of the semester. Assessments will include essays and may also include other graded assignments, such as oral presentations or written exams. PORT3910 may be taken up to three times provided that the topic is different each time.prereq: 3003",
    "prereq": {
      "code": "PORT 3003",
      "subject": "PORT",
      "id": "3003"
    }
  },
  {
    "uid": "795768",
    "code": "PORT3920",
    "subject": "PORT",
    "number": "3920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Lusophone Cultures",
    "fullname": "Topics in Lusophone Cultures",
    "info": "The present course seeks to bring Portugal, Brazil ,and Portuguese-speaking Africa to bear on current, mostly Anglo-American understandings of empire, colonialism, cultural conflicts, mixings, and assimilation; diaspora, postcolonialism, and globalization. To that end, you will study a number of literary, visual, and musical texts from Portugal, Brazil, and Lusophone Africa featuring empire as fantasy to be fulfilled; violent reality to be denounced, exorcized and rejected, or further mythified; and/or ever returning phantoms unsettling the notion of independence and of the so called transnational turn of globalization. The course is divided into three segments within which readings and viewings will follow a chronological order. First you will learn about the Portuguese empire in India and its present-day remnants in Goa; you will then learn about Brazil's postcolonial development and how the former colony \"writes back\" to the former metropolis and decrees itself as \"the country of the future,\" albeit not without the racist heritage of colonialism and the myth of racial democracy; finally, you will learn about decolonization, immigration, and the Africanness of postcolonial Portugal. The course is taught in Portuguese and you will use Portuguese in class and in all written assessments. The latter includes graded written assignments, a research project with class presentations, and may also include partial exams. Topics vary and are specified in the class schedule. prereq: [1101, 1102, 1103, 1104] or [3001, 3003] or equiv",
    "prereq": {
      "or": [
        {
          "and": [
            {
              "code": "PORT 1101",
              "subject": "PORT",
              "id": "1101"
            },
            {
              "code": "PORT 1102",
              "subject": "PORT",
              "id": "1102"
            },
            {
              "code": "PORT 1103",
              "subject": "PORT",
              "id": "1103"
            },
            {
              "code": "PORT 1104",
              "subject": "PORT",
              "id": "1104"
            }
          ]
        },
        {
          "and": [
            {
              "code": "PORT 3001",
              "subject": "PORT",
              "id": "3001"
            },
            {
              "code": "PORT 3003",
              "subject": "PORT",
              "id": "3003"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "007992",
    "code": "PORT3993",
    "subject": "PORT",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study.Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including:- the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project.- the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit)- the faculty mentor is qualified to serve in this role- assessment of student learning and grading criteria are clear and appropriate- the student will be working in a respectful, inclusive environment",
    "prereq": []
  },
  {
    "uid": "807932",
    "code": "PORT4001",
    "subject": "PORT",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Port Span Spkers Grad Research",
    "fullname": "Portuguese for Spanish Speakers and Graduate Student Research",
    "info": "Listening, reading, speaking, writing. Uses communicative approach.prereq: [SPAN 1004 or SPAN 1014 or SPAN 1044, SPAN LPE pass] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "SPAN 1004",
          "subject": "SPAN",
          "id": "1004"
        },
        {
          "code": "SPAN 1014",
          "subject": "SPAN",
          "id": "1014"
        },
        {
          "code": "SPAN 1044",
          "subject": "SPAN",
          "id": "1044"
        }
      ]
    }
  },
  {
    "uid": "825490",
    "code": "PORT4003",
    "subject": "PORT",
    "number": "4003",
    "honors": false,
    "writingIntensive": false,
    "name": "Portuguese Conv & Comp Grad",
    "fullname": "Portuguese Conversation and Composition",
    "info": "The goals of this course are twofold. The first goal is to improve your abilities in the four areas of language (speaking, listening, reading, and writing) to the point that you can communicate advanced ideas in written and spoken Portuguese. The second goal is for you to possess a foundational understanding of cultural texts (plays, short stories, poems, films, and essays) from the 1950s onward that will help generate your enthusiasm for Portuguese and help you understand how the arts are entwined in resistance to injustice throughout the communities where Portuguese, among other languages, is spoken. As a course that bridges the language courses and the content courses, PORT3003 includes both advanced grammar and critical analysis to prepare you for content courses, such as PORT 3501w, and the longer writing assignments that you will have in such courses. The course will be taught in Portuguese, and the reading, writing, and speaking will be done in Portuguese. Assessments include, but are not necessarily limited to, writing assignments, oral presentations, and written exams. \n\nprereq: 1104 or 3001 or Port LPE\n",
    "prereq": {
      "or": [
        {
          "code": "PORT 1104",
          "subject": "PORT",
          "id": "1104"
        },
        {
          "code": "PORT 3001",
          "subject": "PORT",
          "id": "3001"
        }
      ]
    }
  },
  {
    "uid": "826643",
    "code": "PORT4022",
    "subject": "PORT",
    "number": "4022",
    "honors": false,
    "writingIntensive": false,
    "name": "Intensive Beginning Portuguese",
    "fullname": "Intensive Beginning Portuguese",
    "info": "Intensive course for those with no Portuguese background. Students develop novice-intermediate low proficiency in listening, speaking, reading, writing. Based on materials from Portugal, Brazil, and Portuguese-speaking Africa. Pair and small-group communicative activities, focused on interpreting and producing audio(visual) and written texts. This class is partially online.   ",
    "prereq": []
  },
  {
    "uid": "799363",
    "code": "PORT4101",
    "subject": "PORT",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg Portuguese Grad Research",
    "fullname": "Beginning Portuguese for Graduate Student Research",
    "info": "Listening, speaking, reading, writing. Cultures of Portugal, Brazil, or Portuguese-speaking Africa. Workbook assignments, paired/small group activities. Meets concurrently with 1101.",
    "prereq": []
  },
  {
    "uid": "799364",
    "code": "PORT4102",
    "subject": "PORT",
    "number": "4102",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg Portuguese Grad Research",
    "fullname": "Beginning Portuguese for Graduate Student Research",
    "info": "Reading, writing, speaking, listening. Cultures of Portugal, Brazil, or Portuguese-speaking Africa. Workbook assignments, paired/small group activities.",
    "prereq": []
  },
  {
    "uid": "799365",
    "code": "PORT4103",
    "subject": "PORT",
    "number": "4103",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Portuguese Grad Research",
    "fullname": "Intermediate Portuguese for Graduate Student Research",
    "info": "Advancing listening, speaking, reading, writing skills based on materials from Portugal, Brazil, or Portuguese-speaking Africa. Paired and small-group communicative activities, focused on interpreting and producing audio(visual) and written texts at the intermediate level. This class is partially online.  Meets concurrently with 1103.",
    "prereq": []
  },
  {
    "uid": "799366",
    "code": "PORT4104",
    "subject": "PORT",
    "number": "4104",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Portugueuse Grad Research",
    "fullname": "Intermediate Portuguese for Graduate Student Research",
    "info": "Advancing listening, speaking, reading, writing skills based on materials from Portugal, Brazil, or Portuguese-speaking Africa. Paired and small-group communicative activities, focused on interpreting and producing audio(visual) and written texts at the intermediate level. This class is partially online.Meets concurrently with 1104.",
    "prereq": []
  },
  {
    "uid": "009734",
    "code": "PORT5520",
    "subject": "PORT",
    "number": "5520",
    "honors": false,
    "writingIntensive": false,
    "name": "Portuguese Lit/Culture Studies",
    "fullname": "Portuguese Literary and Cultural Studies",
    "info": "Origins/development of modern Portuguese nation (late 15th to 20th century) using literature, cultural and literary criticism, history, sociology, and various media (film, art, music, Internet). Main cultural problematics pertaining to Portugal as well as fundamental literary texts.",
    "prereq": []
  },
  {
    "uid": "009735",
    "code": "PORT5530",
    "subject": "PORT",
    "number": "5530",
    "honors": false,
    "writingIntensive": false,
    "name": "Brazilian Literary and Culture",
    "fullname": "Brazilian Literary and Cultural Studies",
    "info": "Study of origins and development of modern Brazilian nation (late 16th to 20th century) using literature, cultural and literary criticism, history, sociology) and various media (film, art, music, Internet). Main cultural problematics pertaining to Brazil as well as fundamental literary texts.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008231",
    "code": "PORT5540",
    "subject": "PORT",
    "number": "5540",
    "honors": false,
    "writingIntensive": false,
    "name": "Lit/Cul Luso Africa",
    "fullname": "Literatures and Cultures of Lusophone Africa",
    "info": "Origins/development of Lusophone Africa (Angola, Mozambique, Cape-Verde, Guinea-Bissau, Sao Toma, Principe). Literature, cultural/literary criticism, history, sociology, media (film, art, music).prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008001",
    "code": "PORT5910",
    "subject": "PORT",
    "number": "5910",
    "honors": false,
    "writingIntensive": false,
    "name": "Lusophone Cultures & Lit",
    "fullname": "Topics in Lusophone Cultures and Literatures",
    "info": "Cultural manifestations in Portuguese-speaking world (Portugal, Brazil, Lusophone Africa). Literature, history, film, intellectual thought, critical theory, popular culture. Topics may include writers (e.g. Machado de Assis) groups of writers (e.g. Lusophone women writers), or problematics such as (post-)colonialism or Luso-Brazilian modernities.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008003",
    "code": "PORT5920",
    "subject": "PORT",
    "number": "5920",
    "honors": false,
    "writingIntensive": false,
    "name": "Figures Luso Lit",
    "fullname": "Figures in Lusophone Literatures",
    "info": "One Portuguese, Brazilian, or other major Portuguese-speaking writer or group of writers whose work has had impact on thought, literature, or social problems (e.g., Machado de Assis, Fernando Pessoa, Clarice Lispector).  Figures specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "008005",
    "code": "PORT5930",
    "subject": "PORT",
    "number": "5930",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Brazilian Literature",
    "fullname": "Topics in Brazilian Literature",
    "info": "Major issues of Brazilian literature; focuses on important authors, movements, currents, and genres. Problems, socioeconomic questions, and literary techniques related to Brazilian themes. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "008007",
    "code": "PORT5993",
    "subject": "PORT",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Lusophone studies (Portuguese-speaking Africa, Brazil, Portugal). Areas not covered in other courses. Students submit reading plans for particular topics, figures, periods, or issues.Prereq MA or PhD candidate, instr consent.Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including:- the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project.- the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit)- the faculty mentor is qualified to serve in this role- assessment of student learning and grading criteria are clear and appropriate- the student will be working in a respectful, inclusive environment",
    "prereq": []
  },
  {
    "uid": "009122",
    "code": "PORT5994",
    "subject": "PORT",
    "number": "5994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Graduate-level research in literatures and cultures of the Portuguese-speaking world. Topics vary. Prereq Grad student or instr consent. Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including: - the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project. - the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit) - the faculty mentor is qualified to serve in this role - assessment of student learning and grading criteria are clear and appropriate - the student will be working in a respectful, inclusive environment",
    "prereq": []
  },
  {
    "uid": "788264",
    "code": "PORT8333",
    "subject": "PORT",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788645",
    "code": "PORT8777",
    "subject": "PORT",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "825467",
    "code": "PORT8888",
    "subject": "PORT",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "008009",
    "code": "PORT8920",
    "subject": "PORT",
    "number": "8920",
    "honors": false,
    "writingIntensive": false,
    "name": "Lusophone Seminar",
    "fullname": "Seminar: Lusophone Literatures and Cultures",
    "info": "Problems pertaining to Portuguese, Brazilian, and/or Lusophone African cultures and literatures. Topics specified in [Class Schedule].",
    "prereq": []
  }
]