[
  {
    "uid": "803747",
    "code": "PREV8001",
    "subject": "PREV",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Prevention Science",
    "fullname": "Prevention Science: Principles and Practices",
    "info": "Theoretical, empirical, and practical foundations for strategic interventions to prevent behavioral problems and promote healthy development. Multidisciplinary roots of prevention science. Trends/directions. best practices.",
    "prereq": []
  },
  {
    "uid": "816900",
    "code": "PREV8002",
    "subject": "PREV",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Prevention Science Research",
    "fullname": "Prevention Science Research Methodology",
    "info": "This course is intended to provide students with broad exposure to topics in research methodology within the field of prevention science. Prevention science as a discipline focuses on the etiology and prevention of social, physical and mental health problems and the translation of that information to promote health and well-being. This course will emphasize research methodology as it pertains to preventive interventions in youth and family contexts. The course is intended to serve as a survey of a wide range of topics within these areas, with research design, measurement issues, and analytic methods representing the major foci. Topics will be covered with attention to the community contexts within which prevention research often occurs as well as the ethical and human subjects issues that may arise. Students who successfully complete the course are expected to be able to interpret and critically evaluate prevention research methodology as well as identify appropriate methodical strategies to address research questions within prevention science",
    "prereq": []
  },
  {
    "uid": "816901",
    "code": "PREV8003",
    "subject": "PREV",
    "number": "8003",
    "honors": false,
    "writingIntensive": false,
    "name": "Prevention: Implement & Dissem",
    "fullname": "New Topics in Prevention: Implementation and Dissemination",
    "info": "This is an interdisciplinary course focused on the new science of implementation and dissemination of evidence-based/empirically-supported family-focused psychosocial prevention programs. Course content will include an overview of conceptual and theoretical foundations of implementation research, key research questions, methods for evaluating implementation and dissemination efforts, and case examples from the empirical literature. The course will take an ecological perspective to the implementation of family-based prevention programs, addressing questions such as how widespread efforts to install programs in communities can ensure that programs create change in children and families",
    "prereq": []
  },
  {
    "uid": "803748",
    "code": "PREV8005",
    "subject": "PREV",
    "number": "8005",
    "honors": false,
    "writingIntensive": false,
    "name": "Prevention Science Capstone",
    "fullname": "Prevention Science Capstone Course",
    "info": "Topics for preservation research project. Students discuss possible projects with faculty/peers. Students present final proposal for research project.",
    "prereq": []
  }
]