[
  {
    "uid": "011135",
    "code": "PT1002",
    "subject": "PT",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Orientation to PT",
    "fullname": "Orientation to Physical Therapy",
    "info": "Introduction to the profession of physical therapy through lectures, discussions, patient presentations, clinic visit, videotapes, and exposure to treatment equipment.",
    "prereq": []
  },
  {
    "uid": "792940",
    "code": "PT6002",
    "subject": "PT",
    "number": "6002",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethics in Health Care",
    "fullname": "Ethics in Health Care",
    "info": "Moral/ethical analysis. Issues in physical therapy research/practice. Ethical decisions in a practice and in professional training. WebCT lectures, in-class discussions/instruction, exams.",
    "prereq": []
  },
  {
    "uid": "014187",
    "code": "PT6058",
    "subject": "PT",
    "number": "6058",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomy for Physical Therapy",
    "fullname": "Anatomy for Physical Therapy",
    "info": "Study of gross human anatomy, and surface anatomy, for practice of physical therapy. Cadaver dissection of extremities, head, neck, back, abdomen, thoracic, and pelvic regions. Correlation to clinical conditions. Lecture, laboratory.",
    "prereq": []
  },
  {
    "uid": "820551",
    "code": "PT6212",
    "subject": "PT",
    "number": "6212",
    "honors": false,
    "writingIntensive": false,
    "name": "Becoming a PT",
    "fullname": "Becoming a Physical Therapist",
    "info": "This course is designed to orient Doctor of Physical Therapy (DPT) students to the culture and operations of the institution, the Program, and the Physical Therapy profession. Learners engage with their peers, faculty, and staff to explore: 1) the breadth of resources available at the University of Minnesota, 2) the DPT curriculum and inclusive Program culture, 3) student engagement and leadership opportunities for early professional development, 4) strategies for a successful transition to graduate professional education, and 5) the foundations of healthcare and the Physical Therapy profession.  ",
    "prereq": []
  },
  {
    "uid": "790877",
    "code": "PT6213",
    "subject": "PT",
    "number": "6213",
    "honors": false,
    "writingIntensive": false,
    "name": "Developing the PT I",
    "fullname": "Developing the Physical Therapist I",
    "info": "Practical aspects of clinical education and professional behavior. Psychological, sociological, and cultural needs of diverse patient populations. Students complete a three hrs/week clinical affiliation at University Good Samaritan Center. Patient/therapist observations, concurrent didactic coursework. Facilitation of group exercise, restorative ambulation, range of motion programs, and resident assessment instrument.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "791934",
    "code": "PT6214",
    "subject": "PT",
    "number": "6214",
    "honors": false,
    "writingIntensive": false,
    "name": "Developing the PT II",
    "fullname": "Developing the Physical Therapist II",
    "info": "Documentation of physical therapy exams, progress, discharge services. Regulatory agencies responsible for outcomes/accreditation, third party reimbursement, coding, peer review. Complete three hrs/wk clinical affiliation at Good Samaritan Center under supervision of clinical faculty. Observations/documentation, group exercise, restorative ambulation, range of motion programs, resident assessment instrument.prereq: Registered first year PT student",
    "prereq": []
  },
  {
    "uid": "791935",
    "code": "PT6215",
    "subject": "PT",
    "number": "6215",
    "honors": false,
    "writingIntensive": false,
    "name": "Developing the PT III",
    "fullname": "Developing the Physical Therapist III",
    "info": "The purpose of this course is to familiarize the student with the role of a Physical Therapist as a community educator and promoter of population health and wellness, as well as expose the student to health disparity issues encountered by all health professionals within urban, rural and world health settings. This course will contain lectures, small and large group discussions, outside readings, and a data-informed needs assessment of local or global health concerns.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "009755",
    "code": "PT6216",
    "subject": "PT",
    "number": "6216",
    "honors": false,
    "writingIntensive": false,
    "name": "Developing the PT IV",
    "fullname": "Developing the Physical Therapist IV",
    "info": "Role of physical therapist, in acute care or rehabilitation setting, as clinical educator of physical therapy students. Students are assigned to a local hospital or rehabilitation facility. Patient evaluations, treatment, discharge planning. Students prepare for full time clinical experiences and for their role as potential clinical instructors. prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "793761",
    "code": "PT6217",
    "subject": "PT",
    "number": "6217",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrated Clin Ed I",
    "fullname": "Integrated Clinical Education I",
    "info": "This course is designed to promote hands-on engagement in the clinical learning environment throughout Year 1 of the Doctor of Physical Therapy curriculum. Experiential learning opportunities allow students to apply and integrate previous and concurrent course content to develop professional, patient management, and practice management skills. Learning is enhanced through self-assessment, external feedback, and clinically oriented assignments linked to didactic courses. Experiences are structured in consultation with community partner organizations and are conducted under the direct supervision of licensed faculty.",
    "prereq": []
  },
  {
    "uid": "825854",
    "code": "PT6218",
    "subject": "PT",
    "number": "6218",
    "honors": false,
    "writingIntensive": false,
    "name": "Integrated CE II",
    "fullname": "Integrated Clinical Education II",
    "info": "This course builds upon the foundation established in Integrated Clinical Education (ICE) I and promotes continued hands-on engagement in the clinical learning environment throughout Year 2 of the Doctor of Physical Therapy curriculum. Progressively advanced experiential learning opportunities allow students to further develop, apply, and integrate cognitive, psychomotor, and professional behavior skills in the examination, evaluation, and treatment of clients. Learning is enhanced through self-assessment, external feedback, and clinically oriented assignments linked to didactic courses. Experiences are structured in consultation with community partner organizations and are conducted under the direct supervision of licensed clinicians.",
    "prereq": []
  },
  {
    "uid": "816532",
    "code": "PT6219",
    "subject": "PT",
    "number": "6219",
    "honors": false,
    "writingIntensive": false,
    "name": "Found Interprofess Collab",
    "fullname": "Foundations of Interprofessional Collaboration",
    "info": "This course establishes the foundation for interprofessional learning and collaborative practice throughout the Doctor of Physical Therapy curriculum and into the clinical environment. Active interprofessional engagement opportunities with learners from other health professions programs are designed to promote and develop interprofessional competencies in the areas of communication, teamwork, values and ethics, and roles and responsibilities as health care team members.",
    "prereq": []
  },
  {
    "uid": "794219",
    "code": "PT6220",
    "subject": "PT",
    "number": "6220",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinic Volunteer",
    "fullname": "Clinic Volunteer",
    "info": "Functioning evening clinics supervised by licensed physical therapists. Students perform physical therapy exams, provide treatment various conditions, under supervision of a licensed physical therapy clinical instructor.",
    "prereq": []
  },
  {
    "uid": "008204",
    "code": "PT6221",
    "subject": "PT",
    "number": "6221",
    "honors": false,
    "writingIntensive": false,
    "name": "Therapeutic Interventions",
    "fullname": "Therapeutic Interventions",
    "info": "Theory/application of physical agents and therapeutic techniques.  Therapeutic massage, ultraviolet radiation, thermotherapy, hydrotherapy, positive pressure devices, transcutaneous electrical nerve stimulation, neuromuscular electrical stimulation, biofeedback, iontophores, high volt pulsed current. prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "792077",
    "code": "PT6231",
    "subject": "PT",
    "number": "6231",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Biomechanics",
    "fullname": "Clinical Biomechanics",
    "info": "Principles of biomechanics. Forces/structures internal/external to body responsible for normal human movement. Muscle, joint, and tissue mechanics. Joint-specific normal function, whole body posture, gait mechanics. Focuses on normal mechanics as foundation for abnormal mechanics and pathology. Lecture, laboratory. prereq: Intro calculus, physics, registered PT student",
    "prereq": []
  },
  {
    "uid": "818952",
    "code": "PT6241",
    "subject": "PT",
    "number": "6241",
    "honors": false,
    "writingIntensive": false,
    "name": "Move & Patho",
    "fullname": "Movement and Pathokinesiology",
    "info": "Provides an experiential bridge between foundational clinical courses and applied content area courses to aid in the development of comprehensive movement system examination and evaluation skills. Learners will solidify didactic integrative knowledge of the human movement system and its component elements through applied, real-world activities and clinical simulations. Growth in holistic clinical reasoning is fostered through exploratory practice and identification of the connections between 1) qualitative and quantitative movement examination, 2) analysis and diagnosis of movement system dysfunction, and 3) basic hypothesis generation of multi-system physical impairments/pathology and abnormal movement patterns/postures as contributing factors to movement system dysfunction. Oral and written communication of movement system examination and evaluation findings will enhance learner development of education and documentation skills.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "800556",
    "code": "PT6250",
    "subject": "PT",
    "number": "6250",
    "honors": false,
    "writingIntensive": false,
    "name": "Acute Care",
    "fullname": "Acute Care in Physical Therapy",
    "info": "General care of acute and critically ill patient. Disease/disorders common to acute care environment. Integration of evaluation, treatment, and client management skills.prereq: Registered physical therapy student",
    "prereq": []
  },
  {
    "uid": "791936",
    "code": "PT6251",
    "subject": "PT",
    "number": "6251",
    "honors": false,
    "writingIntensive": false,
    "name": "Integument",
    "fullname": "Integument",
    "info": "Response of integument to injury, disease, and aging. Emphasizes wound management, burn care, amputee care, and rehabilitation of persons with acute/chronic integument disorders. Integrating elements of physiology, pathophysiology, and therapeutic procedures to evaluate, treat, and manage clients.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "800557",
    "code": "PT6252",
    "subject": "PT",
    "number": "6252",
    "honors": false,
    "writingIntensive": false,
    "name": "Pathophysiology",
    "fullname": "Pathophysiology",
    "info": "General and organ system pathology. Complicating patholodical factors that affect patients. Implications of pathology on patient’s clinical presentation.prereq: Enrolled PT student",
    "prereq": []
  },
  {
    "uid": "791962",
    "code": "PT6280",
    "subject": "PT",
    "number": "6280",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Assessment",
    "fullname": "Clinical Assessment",
    "info": "Clinical assessment techniques of goniometry, manual muscle testing, range of motion, gait analysis, physical/sensory examination, and antropometrics. Basic intervention approaches, including stretching techniques and resistive exercise. Weekly integration assignments with first clinical clerkship. Lecture, discussion, lab.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "008636",
    "code": "PT6281",
    "subject": "PT",
    "number": "6281",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology for Phys Rehab",
    "fullname": "Physiology for Physical Rehabilitation",
    "info": "An in-depth presentation of fundamental concepts in tissue and organ system physiology as it relate to general health, aging, and physical exercise. Emphasis is on the following systems: muscle, bone & connective tissue, endocrine, immune, renal, GI, and hematology. Influence of aging on these systems will be addressed as well. prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "009481",
    "code": "PT6282",
    "subject": "PT",
    "number": "6282",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardio Physiology & Rehab",
    "fullname": "Cardiopulmonary Physiology and Rehabilitation",
    "info": "Conveys foundational information regarding human basic physiology cardiovascular and pulmonary physiology. In addition, fundamental principles of cardiac and pulmonary systems as it relates to physical therapy and will be known in the clinic to the physical therapist as Cardiac and Pulmonary Rehabilitation will be addressed. A focus of this course is on normal and abnormal responses to exercise and the pathophysiology, assessment, evaluation, and rehabilitation of patients with cardiopulmonary disorders. prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "010658",
    "code": "PT6283",
    "subject": "PT",
    "number": "6283",
    "honors": false,
    "writingIntensive": false,
    "name": "Musculoskeletal I",
    "fullname": "Musculoskeletal Rehabilitation 1",
    "info": "First of a two part series on musculoskeletal rehabilitation.  Evaluation concepts are introduced and methods practiced.  Techniques for the treatment of lower extremity, lumbar and thoracic spine conditions will be covered, including exercise, mobilization/manipulation, traction and orthotics. Surgical interventions, medical imaging and pathology background related to these regions will be provided. Instructional methods include lecture, demonstration, lab practice, readings, problem solving, student presentation, research, and written assignments. Clerkship (PT 6215) clinic experience complements the coursework.\n\nprereq: enrolled PT student",
    "prereq": []
  },
  {
    "uid": "794507",
    "code": "PT6284",
    "subject": "PT",
    "number": "6284",
    "honors": false,
    "writingIntensive": false,
    "name": "Musculoskeletal Rehab. II",
    "fullname": "Musculoskeletal Rehabilitation II",
    "info": "Second of a two part series on musculoskeletal rehabilitation. Techniques for the evaluation and treatment of cervical, shoulder, elbow, wrist, hand and temporomandibular joint conditions will be covered, including exercise, mobilization, orthotics and neurodynamics. Surgical interventions, radiology and pathology background related to these regions will be provided. Screening for non-mechanical pain conditions will be discussed. The rehabilitation needs of specific populations, such as athletes, women, industrial workers, and musicians will be investigated. Joint and disease specific content from fall semester will be used in the patient management sections of the course. Instructional methods include lecture, demonstration, lab practice, readings, problem solving, student research. prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "793757",
    "code": "PT6285",
    "subject": "PT",
    "number": "6285",
    "honors": false,
    "writingIntensive": false,
    "name": "Neuroscience for Rehab",
    "fullname": "Neuroscience for Rehabilitation",
    "info": "This course provides foundational information about cellular and systems neuroscience needed to understand how diseases that affect the nervous system disrupt function and the mechanisms by which treatments restore function for patients. Emphasis is placed on clinical relevance of the material and students learn to apply basic principles of neuroscience, including nervous system disease based on presenting symptoms, and functional neuroanatomy, to support clinical reasoning in small group exercises. ",
    "prereq": []
  },
  {
    "uid": "818953",
    "code": "PT6286",
    "subject": "PT",
    "number": "6286",
    "honors": false,
    "writingIntensive": false,
    "name": "Neurorehab I",
    "fullname": "Neurorehabilitation I",
    "info": "An in depth exploration of fundamental principles of neural plasticity, neurophysiology, motor control, and motor learning as a basis for understanding scientific advancements in pathophysiology and therapeutic intervention in motor dysfunction.Prereq: registered PT student",
    "prereq": []
  },
  {
    "uid": "793758",
    "code": "PT6287",
    "subject": "PT",
    "number": "6287",
    "honors": false,
    "writingIntensive": false,
    "name": "Neurorehabilitation II",
    "fullname": "Neurorehabilitation II",
    "info": "The focus of this course is on comprehensive physical therapy management of adults with neuromuscular dysfunction, including epidemiology, etiology, and pathology, as well as techniques and critical thinking skills used in examination, evaluation, diagnosis, prognosis, intervention, and outcomes assessment. Students will also gain exposure to equipment and use of orthotics as applicable to improve function and prevent, stabilize, or decrease impairment. Conditions addressed include: stroke, cerebellar disorders, traumatic brain injury, concussion, spinal cord injury, Parkinson’s disease, amyotrophic lateral sclerosis (ALS), Huntington’s disease, dystonia, Functional Neurologic Disorders, multiple sclerosis, Guillain-Barré syndrome, Chronic Inflammatory Demyelinating Polyneuropathy (CIDP), post-polio syndrome, and vestibular disorders.\n\nVariability is commonplace in the management of individuals with neuromuscular conditions. This course, therefore, will focus on critical thinking skills, using the ICF model and other frameworks, for determining and prioritizing patient issues in order to design an optimal treatment plan. Exposure to the treatment techniques and equipment used in comprehensive rehabilitation programs will be provided, with emphasis on developing plans of care that focus on optimizing functional outcomes. Discussion, integration of written and video case studies, evidence-based practice, and practice of psychomotor skills will be used to facilitate learning.\n\nprereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "793768",
    "code": "PT6288",
    "subject": "PT",
    "number": "6288",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric Rehab",
    "fullname": "Pediatric Rehabilitation",
    "info": "Provides a study of the etiology, theoretical framework, and techniques used in the examination, evaluation, diagnosis, prognosis, intervention, and assessment of pediatric patients with neurological, orthopedic, cardiac, developmental, systemic, and behavioral conditions. Students will also gain exposure to treatment techniques and equipment used in comprehensive pediatric settings, with additional emphasis on developing plans of care that focus on optimizing functional outcomes for pediatric patients. Discussion, integration of written/video case studies, review of evidence-based practice, practice of psychomotor skills, assessment of children with and without disability, and practice establishing goals and plan of care will be used to facilitate learning. prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "793775",
    "code": "PT6290",
    "subject": "PT",
    "number": "6290",
    "honors": false,
    "writingIntensive": false,
    "name": "Cont PT Practice",
    "fullname": "Contemporary Physical Therapist Practice",
    "info": "This course will include learning experiences and project assignments related to contemporary physical therapy practice. Topics included are legal and regulatory aspects of practice management, the contemporary practice environment, professional development, and the integration of professional practice in the various practice settings. prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "009497",
    "code": "PT6293",
    "subject": "PT",
    "number": "6293",
    "honors": false,
    "writingIntensive": false,
    "name": "Essentials of Rehab Res",
    "fullname": "Essentials of Rehabilitation Research",
    "info": "Develop abilities to obtain, critically evaluate, synthesize and integrate the peer-reviewed literature. It will also enable students to identify and compute appropriate statistical procedures and interpret the meaning of statistical analyses. Finally, it will give students an opportunity to present the aims, methods, intended analyses, and preliminary results of their own research. prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "818955",
    "code": "PT6294",
    "subject": "PT",
    "number": "6294",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Integration",
    "fullname": "Clinical Integration",
    "info": "Integrates content from the entire physical therapy program to address physical therapy assessment and management of complex patient cases.  Focus is on real-world examples of clinical practice, combining psychomotor skills with clinical reasoning, effective communication, professionalism, and affective competence.  Students will deepen critical thinking skills and the ability to facilitate competent, evidence-based, patient-centered physical therapy care for patients with complex presentations.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "009487",
    "code": "PT6295",
    "subject": "PT",
    "number": "6295",
    "honors": false,
    "writingIntensive": false,
    "name": "Clin Internship I",
    "fullname": "Clinical Internship I",
    "info": "Communication skills, team participation, and evaluation/treatment. Predicting outcomes. Managing patient diagnoses/problems. Selected specialty area of physical therapy practice.Prereq Registered 3rd yr PT student.",
    "prereq": []
  },
  {
    "uid": "791937",
    "code": "PT6296",
    "subject": "PT",
    "number": "6296",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Internship II",
    "fullname": "Clinical Internship II",
    "info": "Second of four courses. Students must demonstrate proficiency in communication, team participation, evaluation and treatment, predicting outcomes, and managing patient diagnoses and problems. Selected specialty area of physical therapy practice.",
    "prereq": []
  },
  {
    "uid": "791938",
    "code": "PT6297",
    "subject": "PT",
    "number": "6297",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Internship III",
    "fullname": "Clinical Internship III",
    "info": "Third of four courses. Students must demonstrate proficiency in communication, team participation, evaluation and treatment, predicting outcomes, and managing patient diagnoses and problems. Selected specialty area of physical therapy practice.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "791939",
    "code": "PT6298",
    "subject": "PT",
    "number": "6298",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Internship IV",
    "fullname": "Clinical Internship IV",
    "info": "Fourth of four courses. Students must demonstrate proficiency in communication, team participation, evaluation and treatment, predicting outcomes, and managing patient diagnoses and problems. Selected specialty area of physical therapy practice.",
    "prereq": []
  },
  {
    "uid": "814982",
    "code": "PT6310",
    "subject": "PT",
    "number": "6310",
    "honors": false,
    "writingIntensive": false,
    "name": "Physiology for Physical Rehab",
    "fullname": "Physiology for Physical Rehabilitation",
    "info": "This course is designed to convey foundational information regarding human basic physiology and more advanced integrative physiology to provide the physical therapist a broad range of knowledge on how the human body works at rest, exercise, and as we age.",
    "prereq": []
  },
  {
    "uid": "008646",
    "code": "PT6340",
    "subject": "PT",
    "number": "6340",
    "honors": false,
    "writingIntensive": false,
    "name": "Gro & Dev",
    "fullname": "Human Growth and Development",
    "info": "Developmental process throughout life span. Physical, motor, social, and personality development. Theories of development. Factors that influence a child.s development.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "797922",
    "code": "PT6400",
    "subject": "PT",
    "number": "6400",
    "honors": false,
    "writingIntensive": false,
    "name": "Health Activism",
    "fullname": "Health Activism",
    "info": "Joint Medical School-School of Public Health course. Series of skill-building workshops. Hands-on community project completed by small group of public health and medical students in cooperation with a community organization and a faculty mentor. Projects focus on issues of health disparities, environmental justice, and access to care.prereq: Enrolled DPT student",
    "prereq": []
  },
  {
    "uid": "818956",
    "code": "PT6401",
    "subject": "PT",
    "number": "6401",
    "honors": false,
    "writingIntensive": false,
    "name": "Peds Rehab Elec",
    "fullname": "Pediatric Rehabilitation Elective",
    "info": "This course will expand upon the study of pediatric rehabilitation introduced in PT6288 to a greater variety of pediatric diagnoses and treatment settings.  Pediatric evaluations will be administered in accordance with the Guide to Physical Therapy Practice 3.0 and the International Classification of Functioning, Disability, and Health (ICF) Model.  Pediatric screenings will be practiced in the community.  Students will gain exposure to health and wellness activities for children/adolescents with developmental disabilities to improve community participation and gross motor outcomes.  Selection of adaptive equipment for children with physical and developmental disabilities will be explored, along with communication with a multidisciplinary assistive technology team and medical justification documentation.  Evidence-based child and family-appropriate treatment techniques will be expanded from PT6288.  prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "818784",
    "code": "PT6402",
    "subject": "PT",
    "number": "6402",
    "honors": false,
    "writingIntensive": false,
    "name": "Shoulder in Sports",
    "fullname": "The Shoulder in Sports",
    "info": "A three-credit online course for students who are interested in investigating the biomechanical and epidemiological aspects of the shoulder in athletics. The course will explore the unique demands placed on the shoulder in sports that involve throwing, swimming, swinging, and bodily impacts. The course begins with an investigation into sport-specific biomechanics, pathomechanics, and epidemiology and progresses to applied problem solving for rehabilitation and research scenarios.  Prerequisites: (1) an undergraduate or graduate human anatomy course and (2) an undergraduate or graduate biomechanics course.  It is recommended, but not required, you have an anatomy course including a detailed shoulder anatomy section and a biomechanics course including a detailed shoulder biomechanics section.  Consent from course instructor or Rehabilitation Science graduate program is required.",
    "prereq": []
  },
  {
    "uid": "818957",
    "code": "PT6403",
    "subject": "PT",
    "number": "6403",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Aging",
    "fullname": "Topics in Aging",
    "info": "An elective course covering a variety of topics related to aging. It is intended to enhance the basic aging content students have already acquired. The course will be taught in a seminar format, requiring active engagement and discussion from all students.prereq: Registered PT student",
    "prereq": []
  },
  {
    "uid": "819360",
    "code": "PT6404",
    "subject": "PT",
    "number": "6404",
    "honors": false,
    "writingIntensive": false,
    "name": "Interprofessional Ed Ind Study",
    "fullname": "Interprofessional Education Independent Study",
    "info": "This course is designed to provide guidance and oversight to students engaged in structured interprofessional education experiences offered external to the core Doctor of Physical Therapy curriculum. Experiences vary by term depending on availability. Each approved experience allows an opportunity to engage with learners from other professions and develop interprofessional competencies in the areas of communication, teamwork, values and ethics, and roles and responsibilities as health care team members. ",
    "prereq": []
  },
  {
    "uid": "826360",
    "code": "PT6405",
    "subject": "PT",
    "number": "6405",
    "honors": false,
    "writingIntensive": false,
    "name": "Musculoskeletal",
    "fullname": "Musculoskeletal Elective",
    "info": "The Musculoskeletal Elective course is designed to refine clinical reasoning and intervention skills in tailoring physical therapist treatment for complex presentations with musculoskeletal conditions and functional impairments, including those with chronic pain. Participants will progress skills in efficient and effective selection and application of therapeutic exercise and manual therapy interventions in a case-based format through guided application and expansion of previously learned concepts. Learners will advance adaptive clinical reasoning skills to modify treatment with consideration of patient presentation, demographics, available clinic and patient resources, social determinants of health, and best available evidence. Course sessions include instructor- and peer-led case-based discussions across body regions, individual and group clinical reasoning activities, simulated treatment sessions and hands-on skill development, community clinician guided practice in choosing, implementing, and modifying interventions, and scholarly critique of the literature applied in practice.",
    "prereq": []
  },
  {
    "uid": "008675",
    "code": "PT6813",
    "subject": "PT",
    "number": "6813",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardiopulm",
    "fullname": "Cardiopulmonary Physical Therapy",
    "info": "Theory and techniques of cardiopulmonary evaluation and treatment. Principles of exercise response and adaptations to training.prereq: enrolled PT student",
    "prereq": []
  },
  {
    "uid": "797933",
    "code": "PT7000",
    "subject": "PT",
    "number": "7000",
    "honors": false,
    "writingIntensive": false,
    "name": "Neur Theor & NSci",
    "fullname": "Neurological Theory and Neuroscience in Physical Therapy",
    "info": "Recent/current updates in neurological theory/intervention supported by neuroanatomical science. Students explore evidence supporting clinical decision making process. One-six selected weekends.Prereq Admitted to Transisitional Doctor of Physical Therapy Program.",
    "prereq": []
  },
  {
    "uid": "797985",
    "code": "PT7001",
    "subject": "PT",
    "number": "7001",
    "honors": false,
    "writingIntensive": false,
    "name": "Musculo",
    "fullname": "Topics in Musculoskeletal PT",
    "info": "Evidence base for evaluation/treatment techniques. Manual/exercise treatment skills. Common radiologic assessments for musculoskeletal client. Special requirements of select client populations such as athletes, industrial workers, musicians/dancers. Topics in women's health. Pathologic processes in common musculoskeletal conditions. One-six weekends.Prereq Admitted in transitional doctor of physical therapy program.",
    "prereq": []
  },
  {
    "uid": "797964",
    "code": "PT7002",
    "subject": "PT",
    "number": "7002",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardiopulm",
    "fullname": "Topics in Cardiopulmonary Physical Therapy",
    "info": "Principles of cardiac/pulmonary systems as applied to physical therapy. Principles of normal/abnormal responses to exercise, pathophysiology, and training. Theory/techniques of cardiopulmonary assessment, evaluation, rehabilitation, and clinical decision making of patients with cardiopulmonary disorders. Two selected weekends. Prereq Admitted in transitional doctor of physical therapy program.",
    "prereq": []
  },
  {
    "uid": "797958",
    "code": "PT7003",
    "subject": "PT",
    "number": "7003",
    "honors": false,
    "writingIntensive": false,
    "name": "Integum",
    "fullname": "Topics in Integumentary Physical Therapy",
    "info": "Response of integument to injury, disease, and aging. Advances in wound management, rehabilitation of persons with acute/chronic integument disorders. Physiology, pathophysiology, and therapeutic procedures to evaluate, treat, and manage clients with disorders of integument. Two selected weekends.Prereq Admitted in transitional doctor of physical therapy program.",
    "prereq": []
  },
  {
    "uid": "797959",
    "code": "PT7004",
    "subject": "PT",
    "number": "7004",
    "honors": false,
    "writingIntensive": false,
    "name": "Biomech & Pathokines",
    "fullname": "Topics in Biomechanics and Pathokinesiology in Physical Therapy",
    "info": "Principles of human biomechanics applied to physical therapy. Biomechanics/pathokinesiology of selected joint complexes. Three selected weekends.Prereq Admitted in transitional doctor of physical therapy program.",
    "prereq": []
  },
  {
    "uid": "797960",
    "code": "PT7005",
    "subject": "PT",
    "number": "7005",
    "honors": false,
    "writingIntensive": false,
    "name": "Pediatric",
    "fullname": "Topics in Pediatric Physical Therapy",
    "info": "Common pediatric disease processes. Analysis, clinical decision making of pediatric treatment interventions. Lecture, discussion, literature review. One selected weekend.Prereq Admitted in transitional doctor of physical therapy program.",
    "prereq": []
  },
  {
    "uid": "797961",
    "code": "PT7006",
    "subject": "PT",
    "number": "7006",
    "honors": false,
    "writingIntensive": false,
    "name": "Anatomy",
    "fullname": "Anatomy for Physical Therapy",
    "info": "Dissection of bones, muscles, nerves, vessels, connective tissue, and selected internal organs. Joint structures of limbs, spinal column, head, and pelvis. Histology, embryology. Correlation of content to clincal practice. Lecture, human cadever lab. Two selected weekends. Prereq Admitted in transitional doctor of physical therapy program.",
    "prereq": []
  },
  {
    "uid": "797962",
    "code": "PT7007",
    "subject": "PT",
    "number": "7007",
    "honors": false,
    "writingIntensive": false,
    "name": "Admin & Legal Issues",
    "fullname": "Administration and Legal Issues",
    "info": "Ethical/legal analysis applied to clinical/administrative decision making in contemporary practice environments. Theoretical frameworks, concepts, and case analysis to address challenges in practice. Two selected weekends.Prereq Admitted in transitional doctor of physical therapy program.",
    "prereq": []
  },
  {
    "uid": "797963",
    "code": "PT7008",
    "subject": "PT",
    "number": "7008",
    "honors": false,
    "writingIntensive": false,
    "name": "Scient Basis",
    "fullname": "Scientific Basis of PT Practice",
    "info": "Role of science/research in physical therapy as it relates to critical thinking and decision making in practice. Statistical terminology, research design, hypothesis testing. Two selected weekends.Prereq Admitted in transitional doctor of physical therapy program.",
    "prereq": []
  },
  {
    "uid": "799013",
    "code": "PT7009",
    "subject": "PT",
    "number": "7009",
    "honors": false,
    "writingIntensive": false,
    "name": "Capstone Experience",
    "fullname": "Capstone Experience",
    "info": "How case studies are conducted/written. Importance of case studies to a profession. Basics of case report, literature review. Measurement theory, writing techniques. Student projects are evaluated by instructor or core or adjunct faculty.prereq: Must be a DPT student",
    "prereq": []
  },
  {
    "uid": "804551",
    "code": "PT7010",
    "subject": "PT",
    "number": "7010",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Course",
    "fullname": "Topics in Geriatric Rehabilitation I",
    "info": "Demographics of aging population, psychosocial issues with aging, clinical research in the area of geriatrics. How to write patient case report. Lecture, discussion, literature review.prereq: Licensed physical therapist enrolled in geriatric clinical residency",
    "prereq": []
  },
  {
    "uid": "804552",
    "code": "PT7011",
    "subject": "PT",
    "number": "7011",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Course",
    "fullname": "Topics in Geriatric Rehabilitation II",
    "info": "Providing physical therapy to geriatric clients. Pphysiology, pathophysiology, and therapeutic procedures to evaluate, treat, and manage clients. How clinical issues vary in geriatric population vs. younger patients. Lecture, discussion, literature review.prereq: Licensed physical therapist enrolled in geriatric clinical residency",
    "prereq": []
  },
  {
    "uid": "804553",
    "code": "PT7012",
    "subject": "PT",
    "number": "7012",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Course",
    "fullname": "Topics in Geriatric Rehabilitation III",
    "info": "Management/reimbursement issues in geriatric health care system. Body systems/pathological processes common in geriatric client. How physical therapy is reimbursed through Medicare system. Lecture, discussion, literature review.prereq: Licensed physical therapist enrolled in geriatric clinical residency",
    "prereq": []
  },
  {
    "uid": "015056",
    "code": "PT8131",
    "subject": "PT",
    "number": "8131",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Prob Elec",
    "fullname": "Research Problems Elective",
    "info": "Research elective guided by the research advisor.prereq: Grad PT major",
    "prereq": []
  },
  {
    "uid": "015055",
    "code": "PT8132",
    "subject": "PT",
    "number": "8132",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Seminar",
    "fullname": "Research Seminar",
    "info": "This initial course for the research series provides a foundation for future guided projects on components of the research cycle. Students explore why research is important and how it can be translated to improvements in clinical care. Basic research designs and reporting venues, literature search strategies and tools, critical review of literature, responsible conduct of research, and reference management are discussed.Pre-req: Grad PT major",
    "prereq": []
  },
  {
    "uid": "792468",
    "code": "PT8193",
    "subject": "PT",
    "number": "8193",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Problems",
    "fullname": "Research Problems",
    "info": "Process of developing/completing a scholarly research project or literature review related to rehabilitation science/Physical Therapy education and practice. Students work directly with faculty participating in research in guided small group experience. Type of research experience is determined by adviser.prereq: Grad PT major",
    "prereq": []
  },
  {
    "uid": "788266",
    "code": "PT8333",
    "subject": "PT",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788647",
    "code": "PT8777",
    "subject": "PT",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  }
]