[
  {
    "uid": "814479",
    "code": "PVS5881",
    "subject": "PVS",
    "number": "5881",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Prod. Manuf. & Supply",
    "fullname": "Food Production, Manufacturing/Processing, and Supply Chains",
    "info": "Food commodities and agricultural crops play critical roles relevant to public health, energy and economic vitality, feeding the increasing global human population, and providing multiple outputs from feed for animals to fuel for vehicles, transportation and energy. Each time the course is offered it will focus on a different agricultural commodity which provides critical outputs for the state of MN. Some examples include corn, sugar beets, and soy beans. Individuals working or interested in complex food systems will benefit from the knowledge, networking, and breadth of understanding about agricultural commodities, as a means to think more critically about the interconnection of food, animal feed, fiber and fuel in the economics, culture and health of our society.",
    "prereq": []
  },
  {
    "uid": "815331",
    "code": "PVS5882",
    "subject": "PVS",
    "number": "5882",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Governance, Policy, Reg",
    "fullname": "Food governance, Policy and Regulation",
    "info": "This course provides an overview of food governance, policy, and regulation in the United States. The roles of legislative bodies and regulatory agencies at local, state, and national levels will be reviewed in order to explore the complexity of food policy.  Current issues will be analyzed.",
    "prereq": []
  },
  {
    "uid": "815332",
    "code": "PVS5883",
    "subject": "PVS",
    "number": "5883",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Food Sys: Geo, Pol, Trd",
    "fullname": "Global Food Systems:  Geography, Policitics and Trade",
    "info": "This course explores the global distribution of food production and consumption in order to understand the dynamics of food systems including both domestic production and trade. The course provides students an opportunity to expand their knowledge about the drivers of global food systems and the complexity of the issues such as food security, global economic development and the implications of climate change, and sustainability.",
    "prereq": []
  },
  {
    "uid": "816471",
    "code": "PVS5990",
    "subject": "PVS",
    "number": "5990",
    "honors": false,
    "writingIntensive": false,
    "name": "Vet Public Practice Seminar",
    "fullname": "Veterinary Public Practice Seminar",
    "info": "This is a seminar or rounds course in which students will be exposed to the project and research activities of VPH residents and faculty. Students will prepare and present a seminar on their project and/or research work associated with the residency program.",
    "prereq": []
  },
  {
    "uid": "808752",
    "code": "PVS5991",
    "subject": "PVS",
    "number": "5991",
    "honors": false,
    "writingIntensive": false,
    "name": "An Hlth Fd Sy Policy State Gov",
    "fullname": "Animal Health and Food System Policy and U.S. State government",
    "info": "Policy making process. Animal health, public health, food systems at state/provincial levels. Science, politics, belief in developing/implementing policy.",
    "prereq": []
  },
  {
    "uid": "806629",
    "code": "PVS5992",
    "subject": "PVS",
    "number": "5992",
    "honors": false,
    "writingIntensive": false,
    "name": "Animal Health & Food Sys Pol",
    "fullname": "Animal Health and Food System Policy and U.S. Federal Government",
    "info": "This course is designed to immerse students in the national policy-making arena for animal health and food systems. Participants will interact with officials in relevant Federal government agencies as well as national stakeholder organizations and policy-relevant think tanks. The course will explore the role of scientific evidence in developing and implementing policy as well as the impact of politics and beliefs. The course will provide students an understanding and experience regarding the policy-making process as it pertains to trade, animal health, and food systems at the national levels.",
    "prereq": []
  },
  {
    "uid": "806630",
    "code": "PVS5993",
    "subject": "PVS",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "An Hlth & Fd Sys Pol & Intrgov",
    "fullname": "Animal Health and Food System Policy and Intergovernmental Organizations",
    "info": "Evidence-based policy development. Relevant global animal health and food system issue. Role of scientific evidence in developing/implementing policy. Policy-making process as it pertains to trade, animal health, and food system across intergovernmental organizations. Role of scientific evidence in intergovernmental organization's policy development.prereq: DVM or equiv degree or current DVM student or instr consent",
    "prereq": []
  },
  {
    "uid": "808753",
    "code": "PVS5995",
    "subject": "PVS",
    "number": "5995",
    "honors": false,
    "writingIntensive": false,
    "name": "Engaging Intergovernmental Org",
    "fullname": "Engaging Intergovernmental Organizations",
    "info": "Each enrolled student will be expected prepare for the program prior to traveling to the off-campus site by becoming familiar with the relevant organizations which includes reading the background materials provided online. Prior to the off-campus component of the course, students will be asked to participate in an on-line webinar and work as a member of a virtual team in preparing an executive overview of one of the intergovernmental organizations to share with the entire class at the first meeting. Each student is also expected to participate in directed discussions, interact with key officials, perform group task assignments, and ultimately develop and share a presentation to foster professional networks and public-private-academic partnerships with relevant stakeholders.",
    "prereq": []
  },
  {
    "uid": "808944",
    "code": "PVS5996",
    "subject": "PVS",
    "number": "5996",
    "honors": false,
    "writingIntensive": false,
    "name": "Prof Comm: Policy Issue Briefs",
    "fullname": "Professional Communications:  Policy Issue Briefs",
    "info": "Critical review of scientific and lay literature. Principles of risk communication. Presentation of scientific information. Prepare and critique executive summaries of current topics for CAHFS Daily News. Support media interactions of CAHFS faculty. Generate fact sheets for use on CAHFS website.prereq: Students must have a professional or graduate degree related to human, animal, or ecosystem health or be pursuing a graduate degree (MS/PhD) or professional masters (MPH/MPA) or instr consent",
    "prereq": []
  },
  {
    "uid": "809294",
    "code": "PVS5997",
    "subject": "PVS",
    "number": "5997",
    "honors": false,
    "writingIntensive": false,
    "name": "Farm to Table Study Program",
    "fullname": "Farm to Table Study Program",
    "info": "Explore the food system within a specific country while considering aspects of animal welfare/health, food safety, food protection, public health. Site visits along food supply chain. Discussions with government/private sector leaders. Interactive cross-culture group activities.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "809351",
    "code": "PVS5998",
    "subject": "PVS",
    "number": "5998",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership Global Grand Challe",
    "fullname": "Leadership to Address Global Grand Challenges",
    "info": "Leadership strategies useful in addressing global grand challenges. Practices that foster collective action across diverse groups of people. Mapping polarities/balancing paradox. Inclusive decision-making processes.",
    "prereq": []
  },
  {
    "uid": "810266",
    "code": "PVS5999",
    "subject": "PVS",
    "number": "5999",
    "honors": false,
    "writingIntensive": false,
    "name": "Professional Comm: Daily News",
    "fullname": "Professional Communications:  Daily News",
    "info": "Meetings are commonplace in most organizations yet the effectiveness of these meetings is commonly questioned. Students will learn and practice some proven techniques for enhancing the effectiveness of meetings such as agendas, note-taking and preparation of minutes and meeting summaries.  Most professionals utilize email as one of their most common forms of communication yet theyve never learned how to maximize the likelihood that emails will be effective. Students will write and critique emails to enhance the effectiveness of their email communications.",
    "prereq": []
  }
]