[
  {
    "uid": "797680",
    "code": "RC2011",
    "subject": "RC",
    "number": "2011",
    "honors": false,
    "writingIntensive": false,
    "name": "Found Clin Practice Resp Care",
    "fullname": "Foundations for Clinical Practice of Respiratory Care",
    "info": "Respiratory care profession. Clinical roles, responsibilities, career options. Subspecialties, professional settings. Preparation for clinical practice in respiratory care within a hospital setting. Lab sessions, discussion, simulation, interviews, role-playing.",
    "prereq": []
  },
  {
    "uid": "797681",
    "code": "RC2021",
    "subject": "RC",
    "number": "2021",
    "honors": false,
    "writingIntensive": false,
    "name": "Patient Care Techniques",
    "fullname": "Patient Care Techniques",
    "info": "Fundamental practice, attitudes, and competencies for all health care providers, including respiratory care. Communication skills, infection control, vital signs, patient assessment. General care techniques of respiratory/nursing personnel. Transfer of patients. Specialized care, including immobilized patients (e.g., mechanical ventilation).",
    "prereq": []
  },
  {
    "uid": "798196",
    "code": "RC2999",
    "subject": "RC",
    "number": "2999",
    "honors": false,
    "writingIntensive": false,
    "name": "RespiratoryCareCredit",
    "fullname": "Respiratory Care Credit",
    "info": "Special exam credit for respiratory care. *DO NOT PRINT IN CATALOG*",
    "prereq": []
  },
  {
    "uid": "795736",
    "code": "RC3101",
    "subject": "RC",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "RespCare Modalites&Equipmnt  I",
    "fullname": "Respiratory Care Modalities and Equipment I",
    "info": "Perform non-invasive monitoring and therapeutic procedures. Medical gas therapy, humidity/aerosol therapy, bronchial drainage, volume expansion therapy. Common aerosol medications. Procedures in context of national practice guidelines: rationale, limitations, hazards/complications. Issues of asepsis and of adaptation to patient needs.",
    "prereq": []
  },
  {
    "uid": "796277",
    "code": "RC3102",
    "subject": "RC",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Resp Care Modal & Equip II",
    "fullname": "Respiratory Care Modalities and Equipment II",
    "info": "Implementation/operation of invasive monitoring and life-support technology for the critically ill. Airway management. Hemodynamic/respiratory monitoring. Mechanical ventilation. Completion of American Heart Association course in advanced cardiac life support (ACLS). Simulated patient care in emergency room or intensive care units.",
    "prereq": []
  },
  {
    "uid": "795737",
    "code": "RC3201",
    "subject": "RC",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Cardiopulm Patient Assessment",
    "fullname": "Cardiopulmonary Patient Assessment",
    "info": "Patient assessment skills to interpret patient data. Chart record, interview, physical exam, medical lab data, pulmonary function reports, electrocardiogram, hemodynamic record, ventilator flow sheet, radiographic imaging. Introduction to cardiopulmonary diseases. Lab emphasizes role playing, practice exams, and assessment.",
    "prereq": []
  },
  {
    "uid": "795738",
    "code": "RC3301",
    "subject": "RC",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Practice I",
    "fullname": "Clinical Practice I",
    "info": "Clinical rotations at Mayo Medical Center, Rochester. Nine intensive care units, operating room, emergency room, general floor care areas, pulmonary function labs, sleep disorders center, smoking cessation clinic, pulmonary rehabilitation program, home care, outpatient clinic. Supervised performance of procedures, diagnostic testing.",
    "prereq": []
  },
  {
    "uid": "796278",
    "code": "RC3302",
    "subject": "RC",
    "number": "3302",
    "honors": false,
    "writingIntensive": false,
    "name": "Clinical Practice II",
    "fullname": "Clinical Practice II",
    "info": "Continued clinical rotations at Mayo Medical Center. Nine intensive care units, operating room, emergency room, general floor care areas, pulmonary function labs, sleep disorders center, smoking cessation clinic, pulmonary rehabilitation program, home care, outpatient clinic. Adult, perinatal, and pediatric critical resp care.",
    "prereq": []
  },
  {
    "uid": "795739",
    "code": "RC3401",
    "subject": "RC",
    "number": "3401",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar Resp Care I",
    "fullname": "Seminar in Respiratory Care I: Case reports and Fundamentals of Research",
    "info": "Critical review of professional medical literature re scientific method and clear writing style. Patient cases for problem solving and critical thinking issues. Collaborative class research project leading to abstract submission. Weekly case conference (pulmonary/critical care medicine or combined critical care). Two-hour seminar.",
    "prereq": []
  },
  {
    "uid": "796279",
    "code": "RC3402",
    "subject": "RC",
    "number": "3402",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar Resp Care II",
    "fullname": "Seminar in Respiratory Care II: Case reports and Fundamentals of Research",
    "info": "Weekly conferences and seminar of significant respiratory care cases in professional medical literature. Case reviews from standpoint of scientific method and clear writing style. Problem solving, critical thinking strategies. Collaborative class research project leading to submission of abstract.",
    "prereq": []
  },
  {
    "uid": "796280",
    "code": "RC3501",
    "subject": "RC",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Cardio Resp Phys & Path",
    "fullname": "Advanced Cardiopulmonary Respiratory Physiology and Pathophysiology",
    "info": "Physiology of cardiovascular/pulmonary systems. Adult, pediatric, and perinatal pulmonary and cardiac disorders. Emphasizes presenting assessment, lab evaluation, major pathology, pathophysiologic manifestations, and treatment. Lab observation/measurement of normal and simulated abnormal cardiopulmonary physiology.",
    "prereq": []
  },
  {
    "uid": "800721",
    "code": "RC3601",
    "subject": "RC",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Clin Rsch Concepts & Practice",
    "fullname": "Clinical Research Concepts and Practice",
    "info": "Health science applications. Statistics (descriptive, inferential). Research study design, problem statement, protocol/hypothesis development, feasibility, sampling methods/nstruments, data management, data analysis/interpretation, dissemination of research.",
    "prereq": []
  },
  {
    "uid": "796281",
    "code": "RC4111",
    "subject": "RC",
    "number": "4111",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Resp Crit Care Techniques",
    "fullname": "Advanced Adult Respiratory Critical Care Techniques",
    "info": "Providing respiratory care to critically ill adults. Emphasizes case examples of cardiopulmonary problems and therapeutic procedures using multi-organ system-wide patient approach. Advanced lab competencies in ventilator management. Critical care monitoring procedures, including hemodynamic monitoring.",
    "prereq": []
  },
  {
    "uid": "796282",
    "code": "RC4201",
    "subject": "RC",
    "number": "4201",
    "honors": false,
    "writingIntensive": false,
    "name": "Subspecialties in Resp Care",
    "fullname": "Subspecialization in Respiratory Care: Advanced Perinatal and Pediatric Respiratory Care",
    "info": "Role of perinatal/pediatrics specialist as defined by National Board for Respiratory Care (NBRC). Literature on mechanical ventilation, monitoring applied. Emphasizes evidence-based care. Case studies of strategies for extended mechanical ventilation or other forms of long-term support.",
    "prereq": []
  },
  {
    "uid": "796283",
    "code": "RC4202",
    "subject": "RC",
    "number": "4202",
    "honors": false,
    "writingIntensive": false,
    "name": "Subspec RC Adv Cardio Diagnst",
    "fullname": "Subspecialization in Respiratory Care: Advanced Cardiopulmonary Diagnostics",
    "info": "Preparation for role of advanced pulmonary function technologist and NBRC's CPFT/RPFT board exams. Rationale and methods. Inert gas and body plethysmographic measurement of lung capacity. Diffusion studies. Bronchial provocation. Heart/lung function during maximal exercise. Cases/labs on interpreting results and quality control.",
    "prereq": []
  },
  {
    "uid": "796284",
    "code": "RC4203",
    "subject": "RC",
    "number": "4203",
    "honors": false,
    "writingIntensive": false,
    "name": "Subsp RespCare Cardio Rehab",
    "fullname": "Subspecialization in Respiratory Care: Cardiopulmonary Rehabilitation, Disease Prevention, Case Mgmt",
    "info": "Care for chronically ill patients with lung/heart disorders. Emphasizes respiratory care in the hospital, extended care, and the home. Clinical testing, exercise prescriptions, and practice guidelines for management. Case management and responsibilities unique to respiratory therapist. Preparation for role of certified asthma educator.",
    "prereq": []
  },
  {
    "uid": "796285",
    "code": "RC4301",
    "subject": "RC",
    "number": "4301",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Project & Publication",
    "fullname": "Seminar: Research Project and Publication",
    "info": "Students prepare a research project for submission, including assembling a poster, abstract, or manuscript of original research. Research mentors are assigned to allow guided independent study.",
    "prereq": []
  },
  {
    "uid": "796286",
    "code": "RC4496",
    "subject": "RC",
    "number": "4496",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in Resp Care I",
    "fullname": "Subspecialty Clinical Practicum in Advanced Respiratory Care I",
    "info": "Competencies in areas of advanced-level respiratory care, including clinical subspecialties and related areas important to respiratory care practitioner. A rotation is eight weeks/120 hours of directed clinical experience at facilities within Mayo Health System and UM-affiliated institutions. Maximum two rotations per semester.",
    "prereq": []
  },
  {
    "uid": "796287",
    "code": "RC4596",
    "subject": "RC",
    "number": "4596",
    "honors": false,
    "writingIntensive": false,
    "name": "Practicum in Adv Resp Care II",
    "fullname": "Subspecialty Clinical Practicum in Advanced Respiratory Care II",
    "info": "Continued competencies in areas of advanced-level respiratory care, including clinical subspecialties and related areas important to respiratory care practitioner. A rotations is eight weeks/120 hours of directed clinical experience at facilities within Mayo Health System and UM-affiliated institutions. Maximum two rotations per semester.",
    "prereq": []
  },
  {
    "uid": "800140",
    "code": "RC4611",
    "subject": "RC",
    "number": "4611",
    "honors": false,
    "writingIntensive": false,
    "name": "Grand Rounds",
    "fullname": "Grand Rounds",
    "info": "Capstone course. Respiratory care clinical/professional issues. Caregiver roles. Global views of national health policy, economics, ethical/legal problems. Challenging clinical cases. Multidisciplinary review. Cases relating individual patient and family experiences. Service project.",
    "prereq": []
  },
  {
    "uid": "798994",
    "code": "RC4993",
    "subject": "RC",
    "number": "4993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Independent project. Topic arranged with and supervised by respiratory care faculty.",
    "prereq": []
  }
]