[
  {
    "uid": "789551",
    "code": "RELA1083",
    "subject": "RELA",
    "number": "1083",
    "honors": false,
    "writingIntensive": false,
    "name": "Jesus the Jew",
    "fullname": "Jesus the Jew",
    "info": "Historic figure of Jesus within context of first century Palestinian Judaism. Main groups/institutions of Judaism at time of Jesus. Rabbinic literature/traditions. Works describing Jesus. life/sayings (synoptic gospels). Jesus and the Law, Messianic ideals/expectations, problem of religious authority. Positions regarding Rome, its authority. James and the Jerusalem Church.",
    "prereq": []
  },
  {
    "uid": "797127",
    "code": "RELA3070",
    "subject": "RELA",
    "number": "3070",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics:  Anc. Rel.",
    "fullname": "Topics in Ancient Religion",
    "info": "Study of a specific aspect of religion in antiquity, such as healing cults, magic and divination, Gnosticism, or prophecy and authority. Topics vary by instructor and from year to year. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "801435",
    "code": "RELA3077",
    "subject": "RELA",
    "number": "3077",
    "honors": false,
    "writingIntensive": false,
    "name": "Religious Violence",
    "fullname": "Religious Violence in the Early Roman Empire: Jews, Christians, and Pagans",
    "info": "Methodological strategies for understanding discourses of violence. Ways different religious traditions shaped ethnic identity/practices and views of sacrifice, martyrdom, spectacles of violence, apocalyptic ideologies of violence, state persecution, texts/terror, and holy war.",
    "prereq": []
  },
  {
    "uid": "015731",
    "code": "RELA3173",
    "subject": "RELA",
    "number": "3173",
    "honors": false,
    "writingIntensive": false,
    "name": "Hon: Rom Rel & Early Christian",
    "fullname": "Honors Course: Roman Religion and Early Christianity",
    "info": "Etruscan, Republican religion. Appeal of non-Roman cults. Ruler worship. Christians in Asia Minor, Egypt and the West. Popular piety, Christian and non-Christian. Rabbinic Judaism. Varieties of Christianity in 2nd and 3rd centuries. Influence of Greco-Roman culture on emerging church. Constantine and Julian. Honors recitation meets once a week for an additional recitation section. Meets with RelA 3173.",
    "prereq": []
  },
  {
    "uid": "801443",
    "code": "RELA5077",
    "subject": "RELA",
    "number": "5077",
    "honors": false,
    "writingIntensive": false,
    "name": "Religious Violence",
    "fullname": "Religious Violence in the Early Roman Empire: Jews, Christians, and Pagans",
    "info": "Methodological strategies for understanding discourses of violence. Ways different religious traditions shaped ethnic identity and practices/views of sacrifice, martyrdom, spectacles of violence, apocalyptic ideologies of violence, state persecution, texts/terror, and holy war.",
    "prereq": []
  },
  {
    "uid": "791320",
    "code": "RELA5251",
    "subject": "RELA",
    "number": "5251",
    "honors": false,
    "writingIntensive": false,
    "name": "Archaeology of Herodian Israel",
    "fullname": "Archaeology of Herodian Israel",
    "info": "Archaeological sites in Israel dating to era of Herod the Great (37-4BC). Palaces, religious edifices, and remains from Jewish/gentile settlements throughout the kingdom. Course readings consist of contemporary literary sources and excavation reports.",
    "prereq": []
  },
  {
    "uid": "008604",
    "code": "RELA5993",
    "subject": "RELA",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study.",
    "prereq": []
  }
]