[
  {
    "uid": "792945",
    "code": "SCAN1201",
    "subject": "SCAN",
    "number": "1201",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Scandinavia",
    "fullname": "Introduction to Scandinavia",
    "info": "Five Scandinavian countries introduced through literature, art, and film.  Historical origins, nationalism, European Union, welfare state, environment, contemporary Scandinavian identity.",
    "prereq": []
  },
  {
    "uid": "795867",
    "code": "SCAN1904",
    "subject": "SCAN",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "799042",
    "code": "SCAN1905",
    "subject": "SCAN",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Freshman",
    "prereq": []
  },
  {
    "uid": "788186",
    "code": "SCAN1909W",
    "subject": "SCAN",
    "number": "1909",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: freshman",
    "prereq": []
  },
  {
    "uid": "790143",
    "code": "SCAN3011W",
    "subject": "SCAN",
    "number": "3011",
    "honors": false,
    "writingIntensive": true,
    "name": "Scandinavian Readings",
    "fullname": "Readings in Scandinavian Languages",
    "info": "Reading/composition in Danish, Norwegian, and Swedish for advanced proficiency. Introduction to differences between the three languages.prereq: [Dan or Nor or Swed][1004 or 4004] or instr consent",
    "prereq": {
      "or": [
        {
          "code": "SCAN 1004",
          "subject": "SCAN",
          "id": "1004"
        },
        {
          "code": "SCAN 4004",
          "subject": "SCAN",
          "id": "4004"
        }
      ]
    }
  },
  {
    "uid": "825556",
    "code": "SCAN3013",
    "subject": "SCAN",
    "number": "3013",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Scandinavian Langs",
    "fullname": "Advanced Scandinavian Languages: Contemporary Scandinavia in Prose, Poetry, and Film",
    "info": "Scandinavia of today is a progressive and multi-cultural society as opposed to a hundred years ago. Through prose, poetry, and film, we will explore Scandinavia of today and the changes it has gone through. The purpose of Scan 3013W is to help you gain more advanced knowledge of speaking, reading, and writing skills in your primary Scandinavian language and to build a more advanced reading knowledge of the other Scandinavian languages.  The course build on Scan 3011W, through the reading, screening, and analysis of various texts in Swedish, Norwegian and Danish, both as a whole class and in smaller groups. The class explores multi-ethnic and multicultural identity, childhood, globalization, crime fiction, news events of the moment, culture and society in contemporary Scandinavia through a variety of media. Students will actively take part in discussion and give oral presentations in addition to writing papers.",
    "prereq": []
  },
  {
    "uid": "007985",
    "code": "SCAN3501W",
    "subject": "SCAN",
    "number": "3501",
    "honors": false,
    "writingIntensive": true,
    "name": "Scandinavian Culture",
    "fullname": "Scandinavian Culture Past and Present",
    "info": "Cultural, social, and political developments; principal views and core values; major cultural figures; Scandinavian mentality. Readings in translation for nonmajors. Invited lectures on central topics within selected areas of study.",
    "prereq": []
  },
  {
    "uid": "010206",
    "code": "SCAN3502",
    "subject": "SCAN",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Myths",
    "fullname": "Scandinavian Myths",
    "info": "Literary and cultural investigation of the popular beliefs, myths, and religion of the medieval Scandinavians; the interaction of paganism and Christianity; the reflection of myths in Old Scandinavian literature and art.  All readings in English.",
    "prereq": []
  },
  {
    "uid": "008497",
    "code": "SCAN3503",
    "subject": "SCAN",
    "number": "3503",
    "honors": false,
    "writingIntensive": false,
    "name": "Scand Folklore",
    "fullname": "Scandinavian Folklore",
    "info": "Literary and folkloristic investigation of Scandinavian folktales and legends.  Readings in translation for nonmajors.",
    "prereq": []
  },
  {
    "uid": "007988",
    "code": "SCAN3504",
    "subject": "SCAN",
    "number": "3504",
    "honors": false,
    "writingIntensive": false,
    "name": "Nordic Emigration/Immigration",
    "fullname": "Emigration, Immigration, Integration: The Nordic Experience",
    "info": "Issues of origin/language, immigration/settlement, traditions/values, culture/politics, and transgressions of boundaries from the old to the new studied through photos, diaries, letters, stories, and novels by Moberg, Rolvaag, Ager, and other pioneers. All readings in translation.",
    "prereq": []
  },
  {
    "uid": "008488",
    "code": "SCAN3505",
    "subject": "SCAN",
    "number": "3505",
    "honors": false,
    "writingIntensive": false,
    "name": "Fiction: 1890 to Presnt",
    "fullname": "Scandinavian Fiction From 1890 to Present",
    "info": "Modernity's search for new forms to represent changing historical situations. Ibsen, Strindberg, Hamsun, Selma Lagerlof, Hjalmar Bergman, Paar Lagerkvist, Karen Blixen, Moa Martinson, Tarjei Vesaas, Edith Sodergran, Ingmar Bergman, Lars Gustafsson. All readings in translation.",
    "prereq": []
  },
  {
    "uid": "008412",
    "code": "SCAN3601",
    "subject": "SCAN",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Great Literary Wrks",
    "fullname": "Great Literary Works of Scandinavia",
    "info": "Major literary works from the Middle Ages to the present. Readings in translation.",
    "prereq": []
  },
  {
    "uid": "008448",
    "code": "SCAN3602",
    "subject": "SCAN",
    "number": "3602",
    "honors": false,
    "writingIntensive": false,
    "name": "Fairy Tales in Scandinavia",
    "fullname": "The Literary Fairy Tale in Scandinavia",
    "info": "Literary fairy tales from Scandinavia, especially Hans Christian Andersen. Readings in translation for non-majors.",
    "prereq": []
  },
  {
    "uid": "818492",
    "code": "SCAN3604W",
    "subject": "SCAN",
    "number": "3604",
    "honors": false,
    "writingIntensive": true,
    "name": "Introduction to Nordic Cinema",
    "fullname": "Living Pictures: An Introduction to Nordic Cinema",
    "info": "Since the early days of the twentieth century, debates have proliferated in the Nordic countries about film's nature and function, whether as popular entertainment, high art, or a dynamic cultural artifact important in defining national and regional identities. In this course, History of Nordic Cinema, we will survey discrete moments in Nordic film history (viewing films from Denmark, Finland, Iceland, Norway and Sweden) and contextualize them within broader developments in global cinema. Particularly important in this regard will be Nordic Cinema's love-hate relationship with Hollywood and its complicated status as European Cinema. We will begin in the beginning, with examples of Scandinavia's often-underestimated role as an international, artistic, and popular culture powerhouse in the silent era up through WWI. We'll go on to explore Nordic film productions intended mainly for domestic audiences and juxtapose these with the emergence of a compelling modernist, art-house cinema tradition revolving around the international figure of the auteur director, including Ingmar Bergman and later, Aki Kaurismäki. We'll consider examples of 60s and 70s political, avant-garde cinema (reverberations of the French Nouvelle Vague); talk about the unique development of state-funded structures for film production in these small countries; and end with a survey of recent Nordic films and movements such as Dogme 95 that illustrates ways in which small national cinemas continue to grapple with new iterations of globalization. In this course, students will be exposed to visual cultures from all five Nordic countries and consider the implications of reading film at regional, national and global levels. In short, Nordic Cinema provides a vital and vibrant case study with which to consider a broad range of issues involving the aesthetics and politics of cinema in the world. ",
    "prereq": []
  },
  {
    "uid": "008446",
    "code": "SCAN3605",
    "subject": "SCAN",
    "number": "3605",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Short Story",
    "fullname": "The Scandinavian Short Story",
    "info": "Short stories by important 19th/20th-century authors from five Scandinavian countries. Genre theory/practical criticism.  Readings in English for non-majors.",
    "prereq": []
  },
  {
    "uid": "008386",
    "code": "SCAN3606",
    "subject": "SCAN",
    "number": "3606",
    "honors": false,
    "writingIntensive": false,
    "name": "Scand Express Film",
    "fullname": "The Expressionist Film in Scandinavia",
    "info": "Study of the expressionist film in Scandinavia with emphasis on the work of Carl Dreyer and Ingmar Bergman. Expressionist film is placed in relation to other manifestations of Expressionism in Scandinavia, i.e., theater and painting. Readings in translation.",
    "prereq": []
  },
  {
    "uid": "008638",
    "code": "SCAN3611",
    "subject": "SCAN",
    "number": "3611",
    "honors": false,
    "writingIntensive": false,
    "name": "Scand Expressionism",
    "fullname": "Expressionism in Scandinavia",
    "info": "Expressionism in literature and art, theater and film with emphasis on August Strindberg, Knut Hamsun, Hjalmar Bergman, Edvard Munch, Pdr Lagerkvist, Edith Svdergran, and Ingmar Bergman. All readings in translation.",
    "prereq": []
  },
  {
    "uid": "008441",
    "code": "SCAN3612",
    "subject": "SCAN",
    "number": "3612",
    "honors": false,
    "writingIntensive": false,
    "name": "Images of Scand",
    "fullname": "Images of Scandinavia in Art, Film, and Literature",
    "info": "Images of Scandinavia(ns) in art, film, and literature by both Scandinavians and foreigners. Images of self-knowledge, self-revelation, and otherness. Representative photos and videos of people, locations, and styles. Readings in English.",
    "prereq": []
  },
  {
    "uid": "008629",
    "code": "SCAN3613",
    "subject": "SCAN",
    "number": "3613",
    "honors": false,
    "writingIntensive": false,
    "name": "Scand Childrens Lit",
    "fullname": "Children's Literature in Scandinavia",
    "info": "Analysis and discussion of representative works in Scandinavian children.s literature from picture books to young adult books using a variety of critical methods of interpretation. Taught in English. ",
    "prereq": []
  },
  {
    "uid": "008640",
    "code": "SCAN3614",
    "subject": "SCAN",
    "number": "3614",
    "honors": false,
    "writingIntensive": false,
    "name": "Crime in Scan Fiction/Culture",
    "fullname": "Blood on Snow: Scandinavian Thrillers in Fiction and Film",
    "info": "Scandinavian crime novels/films against background of peaceful welfare states. Readings in translation for non-majors. Scandinavian majors/minors read excerpts in specific languages.",
    "prereq": []
  },
  {
    "uid": "819134",
    "code": "SCAN3617",
    "subject": "SCAN",
    "number": "3617",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Gothic",
    "fullname": "Scandinavian Gothic: Horror and the Uncanny in Nordic Literature and Media",
    "info": "Scandinavia is popularly thought of as a bastion of social democracy, gender equality, and sleek modern design. Despite this well-earned reputation for political and aesthetic progressivism, there has also been a significant undercurrent of anti-rationalism and supernatural horror in Nordic culture. In Gothic fiction, the unwelcome appearance of primitive, irrational, and malevolent forces often takes the form of supernatural or monstrous figures—ghosts, vampires, witches, and trolls. As conventions established abroad mingled with a home-grown tradition of social realism, the Scandinavian Gothic became a vehicle for representing marginalized voices and revealing the shortcomings of Nordic societies. We will examine Gothic works of literature, film, television, popular music, and visual art. Through this examination, we will build an analytical vocabulary to formally analyze works of Gothic art in all of these media, and will practice that through in-class discussions as well as formal and informal writing.",
    "prereq": []
  },
  {
    "uid": "008388",
    "code": "SCAN3618",
    "subject": "SCAN",
    "number": "3618",
    "honors": false,
    "writingIntensive": false,
    "name": "Scand Drama",
    "fullname": "Scandinavian Drama",
    "info": "Study of representative plays from the Scandinavian/Nordic region from the late 19th century to today. In addition to studying themes of politics, society, and the human soul, the course will examine theater texts, stagings, mise-en-scène, promotional material, and other visual culture associated with the plays. All readings in translation.",
    "prereq": []
  },
  {
    "uid": "008418",
    "code": "SCAN3619",
    "subject": "SCAN",
    "number": "3619",
    "honors": false,
    "writingIntensive": false,
    "name": "Travel in Literature",
    "fullname": "Travel in Literature",
    "info": "Experiences in literature of Scandinavians going abroad, foreigners coming to Scandinavia. Culture/travel as self-knowledge, self-revelation, otherness. Slides/videos of travel destinations from literature. Readings in English.",
    "prereq": []
  },
  {
    "uid": "008390",
    "code": "SCAN3634",
    "subject": "SCAN",
    "number": "3634",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Women Writers",
    "fullname": "Scandinavian Women Writers",
    "info": "Investigation of issues important to women as articulated by Scandinavian women writers.  Historical overview of women's writing in Scandinavia and in-depth investigation of texts by contemporary women writers. All readings in translation.",
    "prereq": []
  },
  {
    "uid": "008391",
    "code": "SCAN3670",
    "subject": "SCAN",
    "number": "3670",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Scandinavian Studies",
    "fullname": "Topics in Scandinavian Studies",
    "info": "Topic may focus on a specific author, group of authors, genre, period, or subject matter. Topics specified in Class Schedule. Readings in English for nonmajors. May meet with 5670.",
    "prereq": []
  },
  {
    "uid": "010006",
    "code": "SCAN3993",
    "subject": "SCAN",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading and study.Prereq instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "789760",
    "code": "SCAN3999",
    "subject": "SCAN",
    "number": "3999",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Exam",
    "fullname": "Special Exam",
    "info": "",
    "prereq": []
  },
  {
    "uid": "008643",
    "code": "SCAN4001",
    "subject": "SCAN",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Scand Langs:Reading",
    "fullname": "Scandinavian Languages for Reading",
    "info": "Designed to help undergraduate and graduate students with knowledge of one Scandinavian language to develop reading competence in the other two. Students will get an introduction to the fundamental differences between Danish, Norwegian and Swedish through reading short texts in all three languages.",
    "prereq": []
  },
  {
    "uid": "808586",
    "code": "SCAN4011",
    "subject": "SCAN",
    "number": "4011",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Readings",
    "fullname": "Readings in Scandinavian Languages",
    "info": "Meets with 3011W. See 3011W for description.prereq: Grad student",
    "prereq": []
  },
  {
    "uid": "008648",
    "code": "SCAN4602",
    "subject": "SCAN",
    "number": "4602",
    "honors": false,
    "writingIntensive": false,
    "name": "Fiction and Film",
    "fullname": "Fiction and Film",
    "info": "Examines film adaptations of classical Scandinavian literary texts and explores similarities and differences between the viewer.s and reader.s experiences in the media of film, drama and epic narration.  Includes works by Blixen, Hamsun, Ibsen, Strindberg, Axel, Bergman, Dreyer and Losey.",
    "prereq": []
  },
  {
    "uid": "008439",
    "code": "SCAN4614",
    "subject": "SCAN",
    "number": "4614",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro: Kierkegaard",
    "fullname": "Introduction to Kierkegaard",
    "info": "The literary, philosophical, theological, and psychological dimensions of Kierkegaard.s work. Kierkegaard.s influence on 20th-century culture in general and existentialism in particular. Analysis and discussion of selections from Kierkegaard.s entire oeuvre.  Readings in English.",
    "prereq": []
  },
  {
    "uid": "008413",
    "code": "SCAN4615",
    "subject": "SCAN",
    "number": "4615",
    "honors": false,
    "writingIntensive": false,
    "name": "Family in Scand Lit",
    "fullname": "The Family in Scandinavian Literature",
    "info": "The family as theme in important works of Scandinavian literature from Middle Ages to the present.  What does a family mean to its members and to society, and what is the cultural and critical significance of literature about the family?  Analytical and historical approaches.  Readings in English.",
    "prereq": []
  },
  {
    "uid": "009066",
    "code": "SCAN5202",
    "subject": "SCAN",
    "number": "5202",
    "honors": false,
    "writingIntensive": false,
    "name": "Scand Romanticism",
    "fullname": "Scandinavian Romanticism",
    "info": "Study of Scandinavian literature (poetry, drama, and prose), 1800 -1870.  Texts in the original languages.",
    "prereq": []
  },
  {
    "uid": "008645",
    "code": "SCAN5501",
    "subject": "SCAN",
    "number": "5501",
    "honors": false,
    "writingIntensive": false,
    "name": "Scand Mythology",
    "fullname": "Scandinavian Mythology",
    "info": "Study of Scandinavian mythology based on primary sources represented by Saxo Grammaticus, Snorri Sturluson.s Edda and Ynglinga Saga, and the Poetic Edda.  Myths are analyzed using contemporary critical approaches.  All readings in translation.",
    "prereq": []
  },
  {
    "uid": "008647",
    "code": "SCAN5502",
    "subject": "SCAN",
    "number": "5502",
    "honors": false,
    "writingIntensive": false,
    "name": "Icelandic Saga",
    "fullname": "The Icelandic Saga",
    "info": "Study of the sagas written in 13th-century Iceland.  Discussion includes cultural and historical information about medieval Iceland and analysis of a selection of saga texts using contemporary critical approaches.  All readings in translation.",
    "prereq": []
  },
  {
    "uid": "820216",
    "code": "SCAN5604W",
    "subject": "SCAN",
    "number": "5604",
    "honors": false,
    "writingIntensive": true,
    "name": "Introduction to Nordic Cinema",
    "fullname": "Living Pictures: An Introduction to Nordic Cinema",
    "info": "Since the early days of the twentieth century, debates have proliferated in the Nordic countries about film's nature and function, whether as popular entertainment, high art, or a dynamic cultural artifact important in defining national and regional identities. In this course, History of Nordic Cinema, we will survey discrete moments in Nordic film history (viewing films from Denmark, Finland, Iceland, Norway, and Sweden) and contextualize them within broader developments in global cinema. Particularly important in this regard will be Nordic Cinema's love-hate relationship with Hollywood and its complicated status as European Cinema. We will begin in the beginning, with examples of Scandinavia's often-underestimated role as an international, artistic, and popular culture powerhouse in the silent era up through WWI. We'll go on to explore Nordic film productions intended mainly for domestic audiences and juxtapose these with the emergence of a compelling modernist, art-house cinema tradition revolving around the international figure of the auteur director, including Ingmar Bergman and later, Aki Kaurismäki. We'll consider examples of 60s and 70s political, avant-garde cinema (reverberations of the French Nouvelle Vague); talk about the unique development of state-funded structures for film production in these small countries; and end with a survey of recent Nordic films and movements such as Dogme 95 that illustrates ways in which small national cinemas continue to grapple with new iterations of globalization. In this course, students will be exposed to visual cultures from all five Nordic countries and consider the implications of reading film at regional, national, and global levels. In short, Nordic Cinema provides a vital and vibrant case study with which to consider a broad range of issues involving the aesthetics and politics of cinema in the world. ",
    "prereq": []
  },
  {
    "uid": "809839",
    "code": "SCAN5605",
    "subject": "SCAN",
    "number": "5605",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Short Story",
    "fullname": "The Scandinavian Short Story",
    "info": "Short stories by 19th-20th century authors from all five Scandinavian countries. Genre theory/practical criticism.  Readings in English for non-majors.",
    "prereq": []
  },
  {
    "uid": "008649",
    "code": "SCAN5613",
    "subject": "SCAN",
    "number": "5613",
    "honors": false,
    "writingIntensive": false,
    "name": "Contempry Scand Lit",
    "fullname": "Contemporary Scandinavian Literature",
    "info": "An investigation of issues which emerged as extremely important after 1945 in Scandinavia, as articulated by writers and analyzed by researchers in social sciences.  All readings in translation.",
    "prereq": []
  },
  {
    "uid": "810088",
    "code": "SCAN5614",
    "subject": "SCAN",
    "number": "5614",
    "honors": false,
    "writingIntensive": false,
    "name": "Crime in Scan Fiction/Culture",
    "fullname": "Blood on Snow: Scandinavian Thrillers in Fiction and Film",
    "info": "Scandinavian crime novels/films against background of peaceful welfare states. Readings in translation for non-majors. Scandinavian majors/minors read excerpts in specific languages.",
    "prereq": []
  },
  {
    "uid": "008651",
    "code": "SCAN5615",
    "subject": "SCAN",
    "number": "5615",
    "honors": false,
    "writingIntensive": false,
    "name": "Ibsen&Bgn Mod Drama",
    "fullname": "Ibsen and the Beginnings of Modern Drama",
    "info": "Close reading of Ibsen.s .modern tragedies. from A Doll.s House (1879) to When We Dead Awaken (1899). Focus is on the dialectics between Ibsen and his society, and dramatic structure and staging conventions in the context of modern theater. Readings in English for nonmajors.",
    "prereq": []
  },
  {
    "uid": "008653",
    "code": "SCAN5616",
    "subject": "SCAN",
    "number": "5616",
    "honors": false,
    "writingIntensive": false,
    "name": "Strindberg: Drama",
    "fullname": "Strindberg and the Drama in Revolt and Change",
    "info": "Strindberg as the master of naturalistic drama and the precursor of modernity in European and American theater. Close reading of plays with emphasis on dramatic structure and staging conventions in the context of modern theater. All readings in English for nonmajors.",
    "prereq": []
  },
  {
    "uid": "819135",
    "code": "SCAN5617",
    "subject": "SCAN",
    "number": "5617",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Gothic",
    "fullname": "Scandinavian Gothic: Horror and the Uncanny in Nordic Literature and Media",
    "info": "Scandinavia is popularly thought of as a bastion of social democracy, gender equality, and sleek modern design. Despite this well-earned reputation for political and aesthetic progressivism, there has also been a significant undercurrent of anti-rationalism and supernatural horror in Nordic culture. In Gothic fiction, the unwelcome appearance of primitive, irrational, and malevolent forces often takes the form of supernatural or monstrous figures?ghosts, vampires, witches, and trolls. As conventions established abroad mingled with a home-grown tradition of social realism, the Scandinavian Gothic became a vehicle for representing marginalized voices and revealing the shortcomings of Nordic societies. We will examine Gothic works of literature, film, television, popular music, and visual art. Through this examination, we will build an analytical vocabulary to formally analyze works of Gothic art in all of these media, and will practice that through in-class discussions as well as formal and informal writing.",
    "prereq": []
  },
  {
    "uid": "808947",
    "code": "SCAN5634",
    "subject": "SCAN",
    "number": "5634",
    "honors": false,
    "writingIntensive": false,
    "name": "Scandinavian Women Writers",
    "fullname": "Scandinavian Women Writers",
    "info": "Issues important to women as articulated by Scandinavian women writers. Historical overview of women's writing in Scandinavia. In-depth investigation of texts by contemporary women writers. All readings in translation.",
    "prereq": []
  },
  {
    "uid": "008656",
    "code": "SCAN5670",
    "subject": "SCAN",
    "number": "5670",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Scandinavian Studies",
    "fullname": "Topics in Scandinavian Studies",
    "info": "Topic may focus on a specific author, group of authors, genre, period, or subject matter.  Topics specified in Class Schedule. Readings in English for nonmajors. May meet with 3670.",
    "prereq": []
  },
  {
    "uid": "008658",
    "code": "SCAN5701",
    "subject": "SCAN",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Old Norse Lang, Lit",
    "fullname": "Old Norse Language and Literature",
    "info": "Acquisition of a reading knowledge of Old Norse; linguistic, philological and literary study of Old Norse language and literature.",
    "prereq": []
  },
  {
    "uid": "008661",
    "code": "SCAN5702",
    "subject": "SCAN",
    "number": "5702",
    "honors": false,
    "writingIntensive": false,
    "name": "Old Norse: Saga Rdg",
    "fullname": "Old Norse Saga Reading and Analysis",
    "info": "Reading and analysis of Old Norse prose narratives, including close reading and discussion of the critical literature about the prose narratives and medieval Icelandic culture. All primary texts read in Old Norse.",
    "prereq": []
  },
  {
    "uid": "008669",
    "code": "SCAN5703",
    "subject": "SCAN",
    "number": "5703",
    "honors": false,
    "writingIntensive": false,
    "name": "Old Norse Poetry",
    "fullname": "Old Norse Poetry",
    "info": "Reading and analysis of either eddic poetry from the Poetic Edda or skaldic poetry. Texts read in Old Norse.",
    "prereq": []
  },
  {
    "uid": "009058",
    "code": "SCAN5704",
    "subject": "SCAN",
    "number": "5704",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist of Scand Langs",
    "fullname": "History of the Scandinavian Languages",
    "info": "Investigation of the development of the Scandinavian languages from the earliest periods to the present.",
    "prereq": []
  },
  {
    "uid": "795371",
    "code": "SCAN5710",
    "subject": "SCAN",
    "number": "5710",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Old Norse Literature",
    "fullname": "Topics in Old Norse Literature",
    "info": "Topic may focus on Old Norse prose or poetry. Primary texts read in Old Norse. Critical literature about texts, medieval Icelandic culture in English.  Topics specified in Class Schedule.prereq: 5701 or equiv",
    "prereq": {
      "code": "SCAN 5701",
      "subject": "SCAN",
      "id": "5701"
    }
  },
  {
    "uid": "009060",
    "code": "SCAN5711",
    "subject": "SCAN",
    "number": "5711",
    "honors": false,
    "writingIntensive": false,
    "name": "Struct Scand Langs",
    "fullname": "Structure of the Scandinavian Languages",
    "info": "Investigation of the philological, grammatical, and lexical systems of the Scandinavian languages.",
    "prereq": []
  },
  {
    "uid": "010008",
    "code": "SCAN5993",
    "subject": "SCAN",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading and study.Prereq instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "008676",
    "code": "SCAN8002",
    "subject": "SCAN",
    "number": "8002",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Scand Studies",
    "fullname": "Introduction to Scandinavian Studies",
    "info": "Introduction to history of Scandinavian studies, to field of Scandinavian studies as an integral area with particular disciplines, and to study of Scandinavian languages, literatures, and cultures. Integrated sections on Scandinavian bibliography.",
    "prereq": []
  },
  {
    "uid": "008679",
    "code": "SCAN8500",
    "subject": "SCAN",
    "number": "8500",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Med Lang, Lit",
    "fullname": "Seminar in Medieval Scandinavian Languages and Literature",
    "info": "Sample topics: [Volsunga Saga], studies in Snorri Sturluson's [Edda], dialogue analysis in the Icelandic saga.",
    "prereq": []
  },
  {
    "uid": "009061",
    "code": "SCAN8510",
    "subject": "SCAN",
    "number": "8510",
    "honors": false,
    "writingIntensive": false,
    "name": "SEM: SCAND LING",
    "fullname": "Seminar in Scandinavian Linguistics",
    "info": "Selected problems in synchrony/diachrony of Scandinavian languages (e.g., history or structure of Scandinavian languages).",
    "prereq": []
  },
  {
    "uid": "008684",
    "code": "SCAN8610",
    "subject": "SCAN",
    "number": "8610",
    "honors": false,
    "writingIntensive": false,
    "name": "SEM: SCAND DRAMA",
    "fullname": "Seminar in Scandinavian Drama",
    "info": "Sample topics: dilemma of representation in modern drama, epic theater.",
    "prereq": []
  },
  {
    "uid": "008688",
    "code": "SCAN8630",
    "subject": "SCAN",
    "number": "8630",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem: Scand Crit",
    "fullname": "Seminar in Scandinavian Criticism",
    "info": "Sample topics: feminist theory in Scandinavia, writing literary history in Scandinavia.",
    "prereq": []
  },
  {
    "uid": "009064",
    "code": "SCAN8702",
    "subject": "SCAN",
    "number": "8702",
    "honors": false,
    "writingIntensive": false,
    "name": "Philol Prosem II",
    "fullname": "Philological Proseminar II: History of Germanic Philology",
    "info": "Introduction to history and development of Germanic philology from 1800 to the present. See Ger 8701.",
    "prereq": []
  },
  {
    "uid": "008689",
    "code": "SCAN8975",
    "subject": "SCAN",
    "number": "8975",
    "honors": false,
    "writingIntensive": false,
    "name": "IMMIGRANT LANG LIT",
    "fullname": "Scandinavian Immigrant Languages and Literatures",
    "info": "Introduction to research opportunities in Scandinavian and related fields. Sources, methodology.",
    "prereq": []
  },
  {
    "uid": "010366",
    "code": "SCAN8994",
    "subject": "SCAN",
    "number": "8994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "tbdprereq: instr consent; may be taken as tutorial with instr consent, dept consent",
    "prereq": []
  }
]