[
  {
    "uid": "790844",
    "code": "SCMC1201W",
    "subject": "SCMC",
    "number": "1201",
    "honors": false,
    "writingIntensive": true,
    "name": "Cinema",
    "fullname": "Cinema",
    "info": "Introduction to the critical study of the visual in modernity, presented through sustained analysis of the cinema and cinematic codes. Emphases on formal film analysis and major film movements and conventions in the international history of cinema. Students develop a vocabulary for formal visual analysis and explore major theories of the cinema. *Students will not receive credit for CSCL 1201W if they have already taken SCMC 1201W, ARTH 1921W, CSCL 1921W, CSCL 1201 or SCMC 1201",
    "prereq": []
  },
  {
    "uid": "814257",
    "code": "SCMC1202W",
    "subject": "SCMC",
    "number": "1202",
    "honors": false,
    "writingIntensive": true,
    "name": "Media: Word, Image, Sound",
    "fullname": "Media: Word, Image, Sound",
    "info": "Introduction to the critical and theoretical study of media and technology from Aristotle to the modern world. The first half of the course emphasizes theoretical readings in dialogue with historical apparatuses (printing press, photography, radio, cinema, television) and various expressive objects (the bible, early film, ethnographic sound recordings). The second half turns to the modern culture industry since World War II, and introduces students to the critical study of mass culture, the concept of ideology, and of the relationship between corporate power and media conglomerates.",
    "prereq": []
  },
  {
    "uid": "790845",
    "code": "SCMC3001W",
    "subject": "SCMC",
    "number": "3001",
    "honors": false,
    "writingIntensive": true,
    "name": "Hist of Cinema & Media Culture",
    "fullname": "History of Cinema and Media Culture",
    "info": "Genealogy of cinema in relation to other media, notably photography, radio, television/video, and the Internet. Representative films from decisive moments in global development of cinema. Rise/fall of Hollywood studio system, establishment of different national cinemas, cinematic challenges to cultural imperialism, emergence of post-cinematic technologies.",
    "prereq": []
  },
  {
    "uid": "790869",
    "code": "SCMC3177",
    "subject": "SCMC",
    "number": "3177",
    "honors": false,
    "writingIntensive": false,
    "name": "On Television",
    "fullname": "On Television",
    "info": "Key debates in the history, theory, and criticism of television. Focuses on critical/creative \"readings\" of television's past/present forms. TV's influence on film, music, and digital media.",
    "prereq": []
  },
  {
    "uid": "797306",
    "code": "SCMC3201",
    "subject": "SCMC",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Filmmaking I",
    "fullname": "Fundamentals of Digital Filmmaking",
    "info": "Practice of digital filmmaking. Digital techniques, practical tools required to produce films. Optical/digital devices as artistic tools. Historical/theoretical issues of cinema, its relation to other art forms.",
    "prereq": []
  },
  {
    "uid": "797307",
    "code": "SCMC3202",
    "subject": "SCMC",
    "number": "3202",
    "honors": false,
    "writingIntensive": false,
    "name": "Digital Filmmaking II",
    "fullname": "Intermediate Digital Filmmaking",
    "info": "Students complete a film of any length, 24 frames or feature-length. Emphasizes formal analysis of frames, shots, sequences, and relations of unit (frame or shot) to whole.prereq: 3201 or instr consent",
    "prereq": {
      "code": "SCMC 3201",
      "subject": "SCMC",
      "id": "3201"
    }
  },
  {
    "uid": "817637",
    "code": "SCMC3210",
    "subject": "SCMC",
    "number": "3210",
    "honors": false,
    "writingIntensive": false,
    "name": "Cinema and Ideology",
    "fullname": "Cinema and Ideology",
    "info": "The cinema as a social institution with emphasis on the complex relations it maintains with the ideological practices that define both the form and the content of its products. Specific films used to study how mass culture contributes to the process of shaping beliefs and identities of citizens.",
    "prereq": []
  },
  {
    "uid": "818754",
    "code": "SCMC3211",
    "subject": "SCMC",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Global & Transnational Cinemas",
    "fullname": "Global and Transnational Cinemas",
    "info": "This course explores Global and Transnational Cinemas as alternative traditions to the dominant Hollywood-centered accounts of film history. Students will grapple with the historical, social, and political motivations of cinematic projects that critique traditions of national cinema, or that resist the hegemonic force of neocolonial cultural centers. Italian Neo-realism and the French New Wave will be examined as movements that challenge politics and mass culture. Third Cinema in Latin America and pan-African cinematic movements will be examined through their struggles with both colonialism and the rise of post-colonial dictatorships. Indian and Japanese cinemas of the 50s & 60s will mark out new possibilities of filmmaking and distribution. Finally, counter-hegemonic and experimental movements in U.S.-based film, such as the L.A. Rebellion and Fluxus, will allow students to understand how opposition to Hollywood style could exist within the very centers of cultural power while also reaching out to larger global communities.",
    "prereq": []
  },
  {
    "uid": "818574",
    "code": "SCMC3212W",
    "subject": "SCMC",
    "number": "3212",
    "honors": false,
    "writingIntensive": true,
    "name": "Documentary Cinema",
    "fullname": "Documentary Cinema: History and Politics",
    "info": "This course explores the ethics and aesthetics of documentary cinema, arguably the very first genre of film. We will track the way documentary has widened from largely instructional and experimental uses early in its history to become a distinct genre among today?s familiar feature films. We will screen early documentaries, which may include shocking ethnographies (Nanook of the North, The Mad Masters). Over the course of the term, the syllabus makes its way to recent exemplars of the genre (films may include: Amy, American Teen, I Am Not Your Negro, A Jihad for Love, Generation Wealth, Fetish, Blackfish and so on). One of our aims will be to explore students? relations as viewers and documentarians themselves (via smartphones, Instagram, etc.) to this participatory, revelatory, and always controversial, politically fraught film practice. Documentary Cinema includes both full class lectures and discussions as well as small group discussion of films and readings, and may include the opportunity for students to create their own personal documentary. Intellectually, the course balances out a study of the grammar of documentary as an artistic practice with explorations of the ways the genre reflects broader currents of cinematic and cultural history. By the end of the semester, students should have a stronger understanding of the ways documentary cinema opens our senses to the world around us.",
    "prereq": []
  },
  {
    "uid": "816610",
    "code": "SCMC3220W",
    "subject": "SCMC",
    "number": "3220",
    "honors": false,
    "writingIntensive": true,
    "name": "Screen Cultures",
    "fullname": "Screen Cultures",
    "info": "Screens increasingly define the ways that we communicate with one another and how we encounter the world. This course will offer a critical, historical approach to the emergence of “screen cultures” from the beginning of photography and cinema to our own age of ubiquitous touch screen displays. We will pay a great deal of attention to the ways that such technologies drive our patterns of consumption and production as well as how they create and define our social environments.",
    "prereq": []
  },
  {
    "uid": "818575",
    "code": "SCMC3221",
    "subject": "SCMC",
    "number": "3221",
    "honors": false,
    "writingIntensive": false,
    "name": "On Television",
    "fullname": "On Television",
    "info": "We will study writings on television and specific TV shows from a variety of angles to understand the rise of American broadcast technologies, how race and class are crafted on TV, representations of gender and the home, postmodernity and late capitalism, the rise and demise and of taste, global television and the public sphere, the production of ?reality? in our present historical moment, and changes in televisual technologies. Throughout the course, we will also consider what constitutes television?the technology, the form, and the content?and learn to read these three facets of it concurrently.",
    "prereq": []
  },
  {
    "uid": "818526",
    "code": "SCMC3896",
    "subject": "SCMC",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer.  Typically the students work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": []
  },
  {
    "uid": "816965",
    "code": "SCMC3910",
    "subject": "SCMC",
    "number": "3910",
    "honors": false,
    "writingIntensive": false,
    "name": "Studies Cinema Media Culture",
    "fullname": "Topics in Studies in Cinema and Media Culture",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "797289",
    "code": "SCMC3993",
    "subject": "SCMC",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.",
    "prereq": []
  },
  {
    "uid": "797290",
    "code": "SCMC4993",
    "subject": "SCMC",
    "number": "4993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.",
    "prereq": []
  },
  {
    "uid": "790878",
    "code": "SCMC5001",
    "subject": "SCMC",
    "number": "5001",
    "honors": false,
    "writingIntensive": false,
    "name": "Debates Cinema/Media Culture",
    "fullname": "Critical Debates in the Study of Cinema and Media Culture",
    "info": "This course serves as a capstone within the Studies in Cinema and Media Culture program as well as an advanced seminar in cinema and media theory. It covers such topics as contemporary cinema, transnational television, video games, digital networks, and surveillance technologies. It builds on the knowledge of cinema and media studies that students have developed over their undergraduate education. Students are given the resources and encouragement to construct larger reading and viewing lists that will further develop their knowledge of media and cinema. The final grade is based on participation, critical essays, weekly viewing assignments, and an individualized project that can include creative and professional interests.",
    "prereq": []
  },
  {
    "uid": "802119",
    "code": "SCMC5002",
    "subject": "SCMC",
    "number": "5002",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Film Analysis",
    "fullname": "Advanced Film Analysis",
    "info": "Application of textual analysis to the reading of a film. Students work collaboratively to discern and interpret all component aural/visual elements of what the film says and how it says it. ",
    "prereq": []
  },
  {
    "uid": "825486",
    "code": "SCMC5303",
    "subject": "SCMC",
    "number": "5303",
    "honors": false,
    "writingIntensive": false,
    "name": "Sound Studies",
    "fullname": "Sound Studies",
    "info": "What is sound? Among the various ways of absorbing the world through the senses (looking, reading, watching, touching, tasting), what is unique to the actions of listening and hearing? And over the course of human history, how has sound been variously deployed, framed, and constructed? This course covers a diverse range of topics in the fast-developing interdisciplinary field of Sound Studies from the philosophy of sound to psychoanalytic theories of the voice, the gendered histories of telephones, accounts of radio and decolonization, film sound, sonic expressions of race, the politics of global popular music, mobile media technologies, and cutting-edge approaches to sound art.",
    "prereq": []
  },
  {
    "uid": "797291",
    "code": "SCMC5993",
    "subject": "SCMC",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.",
    "prereq": []
  }
]