[
  {
    "uid": "013131",
    "code": "SCO3001",
    "subject": "SCO",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainable Supply Chain & Ops",
    "fullname": "Sustainable Supply Chain and Operations",
    "info": "Sustainable Supply Chain and Operations Management focuses on the design and management of transformation processes to provide products and services to create value for the people, planet, and firm prosperity. On the one hand, supply chain and operations management involves the integration of activities and processes, to facilitate the flows of materials, services, finances, and information to convert inputs into the firms’ primary products and services. Operational issues include the design of products and processes, the procurement of raw materials, the control of inventories, the maintenance of quality, the planning of human resources and facilities, and the delivery of products or services, so that customer expectations and needs are met. Operations also have significant interactions with other functional areas of the firm (e.g., finance, marketing, strategy, and accounting). Therefore, understanding the role of the operations function and its impact on the competitiveness of the firm from both tactical and strategic aspects is an important part of any manager's training. This course will introduce students to the fundamental concepts, operations practices, and models in both manufacturing- and service-oriented firms. The course will cover both quantitative and qualitative methods.",
    "prereq": []
  },
  {
    "uid": "013808",
    "code": "SCO3041",
    "subject": "SCO",
    "number": "3041",
    "honors": false,
    "writingIntensive": false,
    "name": "Project Mgmt",
    "fullname": "Project Management",
    "info": "Principles and methods useful for planning and controlling a project, including development of project plan, resource planning and scheduling, and project monitoring and control. Selected computerized packages are studied, including PERT and CPM, and examples of different types of projects from manufacturing and service industries are used.prereq: 3000 or instr consent",
    "prereq": {
      "code": "SCO 3000",
      "subject": "SCO",
      "id": "3000"
    }
  },
  {
    "uid": "796697",
    "code": "SCO3045",
    "subject": "SCO",
    "number": "3045",
    "honors": false,
    "writingIntensive": false,
    "name": "Sourcing & Supply Management",
    "fullname": "Sourcing and Supply Management",
    "info": "Strategic/operational role of purchasing/supply. Supply management. Supplier-selection criteria such as quantity, quality, cost/price considerations. Buyer-supplier relationships.prereq: 3001",
    "prereq": {
      "code": "SCO 3001",
      "subject": "SCO",
      "id": "3001"
    }
  },
  {
    "uid": "802462",
    "code": "SCO3048",
    "subject": "SCO",
    "number": "3048",
    "honors": false,
    "writingIntensive": false,
    "name": "Transportation & Logistics Mgm",
    "fullname": "Transportation and Logistics Management",
    "info": "Linkages between logistics/transportation and marketing, operations, and finance. How different industries integrate logistics, warehousing, transportation, and information systems.prereq: 3001",
    "prereq": {
      "code": "SCO 3001",
      "subject": "SCO",
      "id": "3001"
    }
  },
  {
    "uid": "802454",
    "code": "SCO3051",
    "subject": "SCO",
    "number": "3051",
    "honors": false,
    "writingIntensive": false,
    "name": "Service Management",
    "fullname": "Service Management",
    "info": "Issues unique to managing service processes. Identifying service needs, designing services, and managing services.prereq: 3001",
    "prereq": {
      "code": "SCO 3001",
      "subject": "SCO",
      "id": "3001"
    }
  },
  {
    "uid": "013809",
    "code": "SCO3056",
    "subject": "SCO",
    "number": "3056",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain Planning /Control",
    "fullname": "Supply Chain Planning and Control",
    "info": "This course teaches the essential tools and tasks to design an efficient supply chain planning and control system, including ERP, integrated business planning, forecasting, inventory management, capacity/production/material planning, and scheduling. prereq: 3001 or instr consent",
    "prereq": {
      "code": "SCO 3001",
      "subject": "SCO",
      "id": "3001"
    }
  },
  {
    "uid": "013813",
    "code": "SCO3059",
    "subject": "SCO",
    "number": "3059",
    "honors": false,
    "writingIntensive": false,
    "name": "Quality Mgmt & Lean Six Sigma",
    "fullname": "Quality Management and Lean Six Sigma",
    "info": "Concepts and principles of Quality Management and Lean Six Sigma. Process improvement is an important part of every manager’s job. Both the managerial and the technical aspects of quality improvement are considered. Three tiers of the quality field are presented including; quality frameworks, quality methodologies, and quality tools. The foundation starts with learning the overarching quality frameworks such as the Malcolm Baldrige Performance Excellence framework, Six Sigma process improvement, and ISO 9001. Next the course examines quality methodologies such as the six sigma DMAIC methodology, Rummler-Brache process improvement methodology, Lean Thinking, Plan-Do-Check-Act, and the Theory of Constraints. Applications of process improvement are conducted using the many tools of process improvement; SIPOC diagram, Critical-to-Quality Tree, cross-functional process maps, project charter, affinity diagram, quality function deployment, cycle of service, moments of truth, service recovery plan, control plan, statistical process control, control charts, process capability, balanced scorecard, performance metrics matrix, design of experiments. Lean tools such as; Kaizen, Kanban, Five Why, Andon, 5S, Gemba, 8 wastes, Takt time, standardized work, bottleneck analysis, poka-yoke, root causal analysis, and visual control. prereq: 3001 or equiv or instr consent",
    "prereq": {
      "code": "SCO 3001",
      "subject": "SCO",
      "id": "3001"
    }
  },
  {
    "uid": "802455",
    "code": "SCO3061",
    "subject": "SCO",
    "number": "3061",
    "honors": false,
    "writingIntensive": false,
    "name": "Lean Thinking",
    "fullname": "Lean Thinking",
    "info": "Approaches to waste, flow, error proofing, and daily management that simultaneusly improves quality, cost, and delivery, while building worker engagement/skill. Philosophical foundations. Tools to identify, measure, and eliminate non-value-added activities.prereq: 3001",
    "prereq": {
      "code": "SCO 3001",
      "subject": "SCO",
      "id": "3001"
    }
  },
  {
    "uid": "802456",
    "code": "SCO3072",
    "subject": "SCO",
    "number": "3072",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Tech in Supply Chain",
    "fullname": "Managing Technologies in the Supply Chain",
    "info": "Technologies and technological change within/between firms as opportunities for professional leadership. Selecting technologies, nurturing their adoption, and ensuring their exploitation.prereq: 3001",
    "prereq": {
      "code": "SCO 3001",
      "subject": "SCO",
      "id": "3001"
    }
  },
  {
    "uid": "796838",
    "code": "SCO3850",
    "subject": "SCO",
    "number": "3850",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Operations & Mgmt Sci",
    "fullname": "Topics in Operations and Management Science",
    "info": "Discussion/analysis of current topics/developments in operations/management science.prereq: 3001",
    "prereq": {
      "code": "SCO 3001",
      "subject": "SCO",
      "id": "3001"
    }
  },
  {
    "uid": "802463",
    "code": "SCO4065W",
    "subject": "SCO",
    "number": "4065",
    "honors": false,
    "writingIntensive": true,
    "name": "Supply Chain & Ops Strategy",
    "fullname": "Supply Chain and Operations Strategy",
    "info": "Senior capstone. How to achieve/sustain competitive advantage through consistent decisions in manufacturing/service operations. Marketing/business strategy in global context. Vertical integration, capacity, facilities, technology/infrastructure.prereq: 3001, 3056, 3059, 4 [OMS or SCO] elective cr",
    "prereq": {
      "and": [
        {
          "code": "SCO 3001",
          "subject": "SCO",
          "id": "3001"
        },
        {
          "code": "SCO 3056",
          "subject": "SCO",
          "id": "3056"
        },
        {
          "code": "SCO 3059",
          "subject": "SCO",
          "id": "3059"
        }
      ]
    }
  },
  {
    "uid": "013940",
    "code": "SCO6041",
    "subject": "SCO",
    "number": "6041",
    "honors": false,
    "writingIntensive": false,
    "name": "Project Management",
    "fullname": "Project Management",
    "info": "Companies in a wide-range of industries (such as agri-business, aerospace, construction, manufacturing, and medical technology) use Project Management for New Product Development, implementing strategic initiatives, and other business objectives. In the course of your career, those in business, government, and even non-profit organizations will spend a significant amount of their professional career either participating in, or leading projects. While every project is by definition unique in scope, some concepts and tools are considered industry best practices and are internationally recognized via the certification programs of the Project Management Institute. The course will focus on scheduling and critical path analysis, time management, cost estimating, resource utilization, and risk management. Specific tools will include Earned Value Management and the quantitative techniques for estimating schedule risk. The latter will include estimating task durations and the probabilities for project completion by specific time periods. The course will conclude an introduction of Agile Methodologies and Scrum.",
    "prereq": []
  },
  {
    "uid": "815809",
    "code": "SCO6045",
    "subject": "SCO",
    "number": "6045",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Sourcing",
    "fullname": "Strategic Sourcing",
    "info": "Procurement and supply management has become increasingly visible in a world where supply is a major determinant of organizational success. Supply chain performance influences not only operational and financial risks but also reputational risk. Although this course explores cost containment and supply process improvement methods, it also pushes into revenue enhancement. The job of the supply manager today goes way beyond the scope of value and efficiency to the search for competitive advantage through the supply network. In addition to organizing the supply function for strategic advantage, the course explores strategic sourcing, supplier selection and evaluation techniques, supplier development methods, global sourcing techniques, as well as legal and ethical challenges. High-performance supply managers live for the challenges associated with building and maintaining a high-performance supply chain.",
    "prereq": []
  },
  {
    "uid": "815841",
    "code": "SCO6048",
    "subject": "SCO",
    "number": "6048",
    "honors": false,
    "writingIntensive": false,
    "name": "Logistics and Transportation",
    "fullname": "Logistics and Transportation",
    "info": "Manufactured products often travel across multiple countries and multiple states, using multiple modes of transportation, and channels of distribution before reaching final customers. Along the way, these products are processed at a variety of inventory transfer points, and reconfigured and combined with other products with the goal of arriving intact without damage in the right quantity, at the right place and right time. This course provides the knowledge, skills, and tools for understanding these core elements of logistics and transportation systems. Students will gain an understanding of the dynamics of key logistics and transportation decisions, including the design of distribution networks, choice of transportation modes and routes, location and configuration of distribution centers, and management of last mile logistics. Students will explore how these decisions are made by leading companies and what influence these decisions have on the performance dimensions of flexibility, speed, reliability, accessibility, and cost. Operations research techniques will be used to analyze, compare, and optimize these decisions. Throughout the course, students will be exposed to best practices and gain an appreciation for the challenges that typical companies face in managing their logistics and transportation network, including how to innovate in light of competitive pressures and external shocks.",
    "prereq": []
  },
  {
    "uid": "013942",
    "code": "SCO6051",
    "subject": "SCO",
    "number": "6051",
    "honors": false,
    "writingIntensive": false,
    "name": "Service Management",
    "fullname": "Service Management",
    "info": "Both business customers and consumers seek fulfillment of their wants and solutions to their needs – resolving customer problems via one-stop complete service models. This course addresses creating and delivering customer solutions via multi-faceted product-service bundles. The approach uses a structured framework of defining tangible goods and services, intangible service activities, and psychological benefits that customers are seeking. Most course time is spent developing a service delivery system to create and deliver the offering: designing and mapping process flows, applying operations research techniques for analyzing queueing models, determining appropriate applications of automation, and using operations analysis to balance capacity and demand. The course also covers developing systems for managing variability, service quality, queues, and customer psychology in real time during service delivery. prereq: [MBA 6220 or equiv], MBA student",
    "prereq": {
      "code": "MBA 6220",
      "subject": "MBA",
      "id": "6220"
    }
  },
  {
    "uid": "016767",
    "code": "SCO6056",
    "subject": "SCO",
    "number": "6056",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Supply Chain Ops",
    "fullname": "Managing Supply Chain Operations",
    "info": "Decisions/trade-offs managers face when directing operations of supply chain. How supply chain operations are coordinated within manufacturing, distribution, and retail organizations.prereq: [MBA 6220 or equiv], MBA student",
    "prereq": {
      "code": "MBA 6220",
      "subject": "MBA",
      "id": "6220"
    }
  },
  {
    "uid": "013943",
    "code": "SCO6059",
    "subject": "SCO",
    "number": "6059",
    "honors": false,
    "writingIntensive": false,
    "name": "Quality Mgmt & Lean Six Sigma",
    "fullname": "Quality Management and Lean Six Sigma",
    "info": "Management/technical aspects of process improvement. Organizational performance and financial measures as they relate to process improvement. Strategy, improvement tools/methods.prereq: [MBA 6220 or equiv], MBA student",
    "prereq": {
      "code": "MBA 6220",
      "subject": "MBA",
      "id": "6220"
    }
  },
  {
    "uid": "792377",
    "code": "SCO6061",
    "subject": "SCO",
    "number": "6061",
    "honors": false,
    "writingIntensive": false,
    "name": "New Product Design & Bus. Dev",
    "fullname": "New Product Design and Business Development",
    "info": "Nine-month intensive course. Engineering and business students work in teams on actual product development projects sponsored by business organizations to design prototype products and develop business plans for commercialization. Lectures, workshops, guest speakers, team meetings, company visits.",
    "prereq": []
  },
  {
    "uid": "792372",
    "code": "SCO6062",
    "subject": "SCO",
    "number": "6062",
    "honors": false,
    "writingIntensive": false,
    "name": "New Product Design & Bus. Dev.",
    "fullname": "New Product Design and Business Development",
    "info": "Nine-month intensive course. Engineering and business students work in teams on actual product development projects sponsored by business organizations to design prototype products and develop business plans for commercialization. Lectures, workshops, guest speakers, team meetings, company visits.prereq: CSOM student",
    "prereq": []
  },
  {
    "uid": "790920",
    "code": "SCO6065",
    "subject": "SCO",
    "number": "6065",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Supply Chain Mgmt",
    "fullname": "Strategic Supply Chain Management",
    "info": "Internal/inter-organizational design, strategic sourcing, alliances/partnerships, impact of technology on supply chain effectiveness. Managing flows, creating/sharing customer value, measuring competitive impact.prereq: 6056, MKTG 6060, [IDSC 6442 or IDSC 6423], 2nd yr MBA student",
    "prereq": {
      "and": [
        {
          "code": "SCO 6056",
          "subject": "SCO",
          "id": "6056"
        },
        {
          "code": "MKTG 6060",
          "subject": "MKTG",
          "id": "6060"
        },
        {
          "or": [
            {
              "code": "IDSC 6442",
              "subject": "IDSC",
              "id": "6442"
            },
            {
              "code": "IDSC 6423",
              "subject": "IDSC",
              "id": "6423"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "794502",
    "code": "SCO6072",
    "subject": "SCO",
    "number": "6072",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Tech. in Supply Chain",
    "fullname": "Managing Technologies in the Supply Chain",
    "info": "Course prepares students to develop capabilities for (i) making well-informed technology choice decisions; (ii) effectively managing the development and implementation of technologies; and (iii) collaboratively engaging in crisis management and problem solving during technology development and implementation. The central question around which the course is organized is: How can existing and emerging technologies (e.g., IoT, automation, artificial intelligence, 3D printing, block chains) and the related process and people issues be managed to design and sustain reliable, responsive, resilient, and responsible supply chains? Analytic methods covered in the course to inform decisions related to the development and implementation of technologies include statistical methods (e.g., multivariate regression, time-series analysis, hazard models), risk analysis methods (e.g., decision trees) and predictive analytic methods (e.g., random forest). Through a combination of operations analysis case studies and hands-on exercises, students learn to evaluate the potential upside and downside risks of existing and emerging technologies. The final course project involves designing and testing of prototype systems for evaluating the development and implementation in supply chain and operations settings of companies. ",
    "prereq": []
  },
  {
    "uid": "790751",
    "code": "SCO6081",
    "subject": "SCO",
    "number": "6081",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Operations Strategy",
    "fullname": "Global Operations Strategy",
    "info": "An essential element of every business model is the delivery of services or goods.  Some companies astonish customers by a constant stream of new and innovative products.  Other companies can deliver their goods or services rapidly or have the absolute cost leadership in their industry.  Such world-class capabilities are usually the result of a well formulated and executed operations strategy.  Therefore, understanding operations strategy is crucial for business model innovation in a global environment.  Topics covered in the course include the operational implications of strategic decisions, such as global facility location, market strategy, methods of market entry, outsourcing, process standardization, global product expansion, social responsibility, sustainability, and ethics.  Students conduct an in-depth country analysis from a global perspective to fulfill their international experience as well as a comprehensive assessment of the current trends and impacts affecting global industries and organizations.The course uses supply chain and operations management academic theories and applicable case studies to illustrate and explore the concept of global operations strategy.  Students will develop their abilities to:1. Think strategically, analytically, and creatively from a global perspective.2. Develop an understanding of formulating and executing global operations strategy3. Develop a better understanding of the processes underlying various international business models.4. Understand how people, process and technology are integral to executing an effective global strategy.  5. Maximize the benefit of key partnerships (i.e., HR; Finance; IT) in executing the agreed-upon strategy6. Practice effective team strategies to maximize resultsprereq: [MBA 6221 or equiv], MBA student",
    "prereq": {
      "code": "MBA 6221",
      "subject": "MBA",
      "id": "6221"
    }
  },
  {
    "uid": "790752",
    "code": "SCO6082",
    "subject": "SCO",
    "number": "6082",
    "honors": false,
    "writingIntensive": false,
    "name": "International Operations Mgmt",
    "fullname": "International Operations Management",
    "info": "Managing operations in global economy. Coordinating product design, technology transfer, sourcing, supply chains, quality standards, product assignment, facility location, and multicultural workforce management across national boundaries. Cross-functional decision making.prereq: [MBA 6220 or equiv], MBA student",
    "prereq": {
      "code": "MBA 6220",
      "subject": "MBA",
      "id": "6220"
    }
  },
  {
    "uid": "815842",
    "code": "SCO6085",
    "subject": "SCO",
    "number": "6085",
    "honors": false,
    "writingIntensive": false,
    "name": "Sales, Inventory & Op Planning",
    "fullname": "Sales, Inventory, and Operations Planning",
    "info": "Sales, Inventory, and Operations Planning (SI&OP) is an important business process for any firm and can provide significant payoffs through achieving a balance between supply and demand. Using analytical tools and field data, SI&OP links a company’s strategic goals at the high level with its production at the tactical level while coordinating different business elements including manufacturing, finance, operations, sales, marketing, HR, etc. The output of an SI&OP process serves as guidance for various production functions such as the master production schedule (MPS) as well as material requirements planning. SI&OP focuses on getting the big picture right via balancing demand and supply at the product family level. This 2-credit course is designed (1) to provide an overview of the entire SI&OP process, (2) to introduce the crucial inputs (i.e., forecasting and inventory management) to SI&OP, (3) to explain how the output of SI&OP (i.e., aggregate plan) is used as a guidance for planning production and material procurement, and (4) to expose students to several analytical tools used for the SI&OP process. To achieve these goals, the course covers a range of topics including forecasting, inventory management, aggregate planning, master production scheduling, and material requirements planning.",
    "prereq": []
  },
  {
    "uid": "815843",
    "code": "SCO6091",
    "subject": "SCO",
    "number": "6091",
    "honors": false,
    "writingIntensive": false,
    "name": "Process Improvement Methods",
    "fullname": "Process Improvement Methods",
    "info": "This course introduces the tools and problem solving techniques for process improvement. While organized around the DMAIC (Define, Measure, Analyze, Improve, and Control) terms used in Six Sigma, the class will also include concepts from Root Cause Analysis and Lean Thinking.  While our focus is on implementing process improvements from a manager’s perspective, numerous technical tools to identify and implement process improvements, plus the quantitative methods used to identify capacity capabilities, utilization rates, and bottlenecks will be presented through a series of problems and practical exercises.  In addition, the course will consider broader aspects of process improvement that includes an understanding organizational change, the importance of Change Management, and aligning process improvements with strategy.",
    "prereq": []
  },
  {
    "uid": "815844",
    "code": "SCO6092",
    "subject": "SCO",
    "number": "6092",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain Risk and Security",
    "fullname": "Supply Chain Risk and Security",
    "info": "This course covers the organizational and behavioral aspects of managing quality, risk, and security within and across organizations. It covers various frameworks such as ISO 28000 (security) as a starting point. It covers various organizational issues such as managing organizational culture and navigating across national boundaries to address quality, risk, and security issues. It draws on various management theories to understand how to manage quality, risk, security, and disruptions across the supply chain. The course draws on examples from a variety of industries and government.",
    "prereq": []
  },
  {
    "uid": "815845",
    "code": "SCO6093",
    "subject": "SCO",
    "number": "6093",
    "honors": false,
    "writingIntensive": false,
    "name": "Negotiations in Supply Chain",
    "fullname": "Negotiations in Supply Chain",
    "info": "Negotiation is the art and science of securing agreements between two or more interdependent parties. Managing supply chains often requires extensive negotiations related to pricing, joint problem solving and collaboration. This course (i) helps students understand the theory and processes of negotiation as it is practiced in supply chains, (ii) highlight the components of an effective negotiation, and (iii) help students analyze their own behavior in negotiations. The course is largely experiential, providing an opportunity to develop skills by participating in supply chain negotiation exercises and integrating experiences with the principles presented in the assigned readings and class discussions.",
    "prereq": []
  },
  {
    "uid": "815846",
    "code": "SCO6094",
    "subject": "SCO",
    "number": "6094",
    "honors": false,
    "writingIntensive": false,
    "name": "Responsible Supply Chain Mgmt",
    "fullname": "Responsible Supply Chain Management",
    "info": "Companies around the world are facing increasing pressure to perform well on the triple bottom linePeople, Planet, and Profitand responsible supply chain management is often a cornerstone of the CSR strategy for many companies. This course looks at how and why responsible supply chain management could be a powerful strategy to enhance a companys triple bottom line. The course focuses on the social and environmental aspects of managing supply chain operations. Particular emphasis is placed on human rights, health and safety, and environmental issues faced by supply chain managers and the linkage to the firms supply chain strategy.",
    "prereq": []
  },
  {
    "uid": "815847",
    "code": "SCO6095",
    "subject": "SCO",
    "number": "6095",
    "honors": false,
    "writingIntensive": false,
    "name": "Sup Chn Mgt in Food & Agribus.",
    "fullname": "Supply Chain Management in the Food and Agribusiness Sector",
    "info": "The food and agribusiness supply chain is complex. It spans input companies, farmers, traders, food companies, and retailers. The goal of this supply chain is to provide access to affordable food, feed, fiber, and fuel in a sustainable manner. The course covers topics relevant to achieving this goal such as supply management, production management, and demand management to consumers. Issues such as diversity of production and demand, bulkiness of produce, perishability, seasonality, and complexity of supply chains of food and agricultural products will be addressed.",
    "prereq": []
  },
  {
    "uid": "815848",
    "code": "SCO6096",
    "subject": "SCO",
    "number": "6096",
    "honors": false,
    "writingIntensive": false,
    "name": "SCM in Healthcare & Med Device",
    "fullname": "Supply Chain Management in the Health Care and Medical Devices Sector",
    "info": "The motivation for developing this course is the widespread and growing recognition of the need to design and sustain reliable, responsive, resilient, and responsible supply chains to enable the delivery of high quality, high volume, and affordable physical and mental health care equitably in both developed and developing countries.The course advances an end-to-end, supply chain–centric view of the health care and medical devices sector – i.e., linking the development of care to the delivery of care: “from bench to bed.” The course highlights the interdependencies between organizations on the upstream (e.g., medical devices, pharma, and biotech firms) and downstream (e.g., hospitals and clinics) of the healthcare supply chain.Topics addressed include: managing supply chain risks with rapid growth in adverse events and recalls related to medical devices and drugs; and reducing the disparities in health care delivery in underserved communities around the world. Implications of scientific and technological advancements – specifically, precision medicine, surgical robots, mobile & wearable devices, telemedicine and IoT (Internet of Technology) – for designing and sustaining health care supply chains will be a theme that will run through the entire course. We will closely follow the developments related to COVID-19 pandemic throughout the duration of the course. In every class session, we will make a concerted effort to explore the topic of the session and its relevance to understanding and addressing COVID-19 related issues at the local, state, national and global levels -- e.g., understanding the roles of the Minnesota Department of Health (MDH), Center for Disease Control (CDC), Food and Drug Administration (FDA), Federal Emergency Management Agency (FEMA) and the World Health Organization (WHO). ",
    "prereq": []
  },
  {
    "uid": "815849",
    "code": "SCO6097",
    "subject": "SCO",
    "number": "6097",
    "honors": false,
    "writingIntensive": false,
    "name": "SCM in the Retail Sector",
    "fullname": "Supply Chain Management in the Retail Sector",
    "info": "This course reviews how the retail sector has evolved over the years and the significance of supply chain management in the retail sector. The course examines the various functional components of retail supply chain management, and focuses on analysis and metrics required to effectively manage a retail supply chain. The students learn the \"language\" of retailing and acquire the fundamental skills needed to effectively analyze the performance of retail supply chains. Cases are discussed to illustrate how customers are becoming more exacting and demanding ever-increasing levels of service; and how retailers are responding by increasing product variety, becoming more price competitive, striving towards higher service levels, and utilizing advances in computing capabilities, information technologies, and retail analytics to improve their supply chain efficiency.",
    "prereq": []
  },
  {
    "uid": "815850",
    "code": "SCO6098",
    "subject": "SCO",
    "number": "6098",
    "honors": false,
    "writingIntensive": false,
    "name": "Ops Excel. via Lean Thinking",
    "fullname": "Operations Excellence via Lean Thinking",
    "info": "This course introduces the concepts and theory of quality control, philosophical foundations of lean thinking, and technical concepts related to flow and pull, and tools such as value stream mapping, A3, and 5S. Students learn to identify, measure, and eliminate non-value added activities; process capability analysis; statistical process control; and acceptance sampling from extended value chains in manufacturing and service settings through hands-on exercises.",
    "prereq": []
  },
  {
    "uid": "815851",
    "code": "SCO6185",
    "subject": "SCO",
    "number": "6185",
    "honors": false,
    "writingIntensive": false,
    "name": "Statistics",
    "fullname": "Statistics",
    "info": "This course introduces quantitative and business statistics concepts for managerial decision making and problem solving. The course first focuses on the nature of statistical studies and the differences between observational and experimental studies. Methods for producing data, including sampling techniques, process monitoring, and designed experiments will be discussed. Students learn graphical and numerical methods for descriptive statistics. Foundations for statistical inference are covered, including basic probability, discrete and continuous probability distributions, and sampling distributions of statistics. Students then learn how to apply the two basic inferential methods of statistics, statistical estimation, and tests of statistical hypotheses. These methods are used to make inferences about population parameters including means, proportions, and standard deviations. The students also learn to identify sample size requirements.",
    "prereq": []
  },
  {
    "uid": "815856",
    "code": "SCO6191",
    "subject": "SCO",
    "number": "6191",
    "honors": false,
    "writingIntensive": false,
    "name": "Big Data Analytics-Supp Chain",
    "fullname": "Big Data Analytics in Supply Chains",
    "info": "With the advancement of digital technologies and networking capabilities, firms are actively engaged in capturing “big” data related to their supply chains. Firms recognize the immense potential in mining big data for improving the quality and timeliness of decisions, and becoming proactive in sensing and responding to external and internal signals of threats and opportunities. The course develops the capability to analyze and interpret structured and unstructured data that is fundamental to managing supply. The data analytics methods covered in the course include statistical methods (e.g., multivariate regression, logistics regression, GLMM, LASSO), machine learning methods (e.g., support vector machine, ensemble methods – random forest, gradient boosting model) and optimization methods (e.g., deterministic and stochastic methods). Through a combination of operations analysis case studies and hands-on exercises, students learn (i) various facets of data analytics: data access, data aggregation, data analysis and data visualization; (ii) appropriateness and inappropriateness of big data analytic methods; and (iii) big data based predictive analytics. The final course project involves designing and testing of prototype systems in supply chain and operations settings of companies. ",
    "prereq": []
  },
  {
    "uid": "815854",
    "code": "SCO6192",
    "subject": "SCO",
    "number": "6192",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain Finance",
    "fullname": "Supply Chain Finance",
    "info": "Managing the financial flows and capital is just as important as managing the physical flow of goods and services. This course focuses on the underlying link between supply chain performance and the financial systems within an organization. Students learn concepts and tools related to supply chain costing, valuation, and projecting cash flow and capital requirements. The course looks at issues including tax and trade credits, and students develop an understanding of how financial considerations influence and inform a firms supply chain strategy.",
    "prereq": []
  },
  {
    "uid": "815808",
    "code": "SCO6285",
    "subject": "SCO",
    "number": "6285",
    "honors": false,
    "writingIntensive": false,
    "name": "Managing Supply Chain Ops",
    "fullname": "Managing Supply Chain Operations",
    "info": "This course serves as an introduction to the program, providing an overview of the fundamental concepts of supply chain and operations management. The course is taught as a cohort experience with opportunities to interact outside the classroom. Supply chain professionals from a variety of industries are featured throughout to highlight how the concepts apply in different contexts. Students learn methods and models for evaluating and improving end-to-end processes and gain an understanding of the operational challenges inherent in managing global supply chains. The course takes a strategic and cross-functional view of supply chains in both product and service based industries.",
    "prereq": []
  },
  {
    "uid": "815853",
    "code": "SCO6291",
    "subject": "SCO",
    "number": "6291",
    "honors": false,
    "writingIntensive": false,
    "name": "Leadership Development",
    "fullname": "Leadership Development",
    "info": "Carefully designed lectures, exercises and assignments are positioned through the year to assess and develop leadership skills personalized to each student at three levels: (i) how to lead self: leveraging current strengths, (ii) how to lead others: teamwork, collaboration, motivation, and feedback, and (iii) how to lead organizations: operating in complex global work environments. Substantively, the course is committed to creating an intellectual context that is now viewed as central to developing supply chain leaders. Specifically, the course provides opportunities for raising environmental, social and political awareness; learning about social media and related communications technologies and channels; and interacting with non-commercial organizations such as government and NGOs.",
    "prereq": []
  },
  {
    "uid": "815852",
    "code": "SCO6292",
    "subject": "SCO",
    "number": "6292",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Operations Capstone",
    "fullname": "Global Operations Capstone",
    "info": "This course will examine, compare and contrast business models that work globally, and require a careful design of processes and supply chains to deliver the capabilities necessary to create a competitive advantage. This course helps students understand the strategic nature of decision making in operations, and allows them to apply such thinking to the design and improvement of global supply chain networks that span both developed and developing economies. The course contains an essential experiential component. Students will work with companies, either locally in Minnesota or across the world, on real world supply chain applications.",
    "prereq": []
  },
  {
    "uid": "014935",
    "code": "SCO6850",
    "subject": "SCO",
    "number": "6850",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in OMS",
    "fullname": "Topics in Operations and Management Science",
    "info": "Topics seminar. Provides forum for topics in operations/management science.",
    "prereq": []
  },
  {
    "uid": "004686",
    "code": "SCO8651",
    "subject": "SCO",
    "number": "8651",
    "honors": false,
    "writingIntensive": false,
    "name": "Experimental Design",
    "fullname": "Experimental Design",
    "info": "Analysis of variance for one-way, two-way, and multi-way data. Basic concepts of statistical design and analysis of results. Randomized block, Latin square, cross-over, factorial designs, confounding, estimation and comparison of effects, response surfaces, and applications to management.prereq: MBA 6120 or equiv or business admin PhD student or instr consent; offered alt yrs",
    "prereq": {
      "code": "MBA 6120",
      "subject": "MBA",
      "id": "6120"
    }
  },
  {
    "uid": "004685",
    "code": "SCO8652",
    "subject": "SCO",
    "number": "8652",
    "honors": false,
    "writingIntensive": false,
    "name": "Regression Analysis",
    "fullname": "Regression Analysis",
    "info": "Regression and correlation models, inferences in simple and multiple regression, multicolinearity, indicator variables, variable selection techniques, treatment of assumption violations, applications to management problems, basic concepts of experimental design.prereq: MBA 6120 or equiv, business admin PhD student or instr consent; offered alt yrs",
    "prereq": {
      "code": "MBA 6120",
      "subject": "MBA",
      "id": "6120"
    }
  },
  {
    "uid": "004692",
    "code": "SCO8711",
    "subject": "SCO",
    "number": "8711",
    "honors": false,
    "writingIntensive": false,
    "name": "Res in Ops Strategy",
    "fullname": "Research in Operations Strategy",
    "info": "Operations performance; competitive advantage; focused factory, product, and process innovation; and operations strategy implementation. Research results and methods.prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "004694",
    "code": "SCO8721",
    "subject": "SCO",
    "number": "8721",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt of Tech. Ops.",
    "fullname": "Management of Technological Operations",
    "info": "Theories and models used to address problems of managing technological operations and operations in manufacturing and service firms. Technology strategy, economic/organizational perspectives on technology, productivity analysis, technology evaluation, project selection and evaluation, learning, etc.prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "004695",
    "code": "SCO8735",
    "subject": "SCO",
    "number": "8735",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain Management",
    "fullname": "Supply Chain Management",
    "info": "Research on forecasting, inventory control, materials requirements planning, just-in-time manufacturing, aggregate planning, scheduling, routing, sequencing, and dispatching in manufacturing and service industries. Research papers and methods are discussed.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004696",
    "code": "SCO8745",
    "subject": "SCO",
    "number": "8745",
    "honors": false,
    "writingIntensive": false,
    "name": "Quality Mgmt Resrch",
    "fullname": "Research on Quality Management",
    "info": "Research literature, methods, and results. Research on quality strategy, economics of quality, statistical process control, vendor management, off-line quality, and quality practice.prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "806973",
    "code": "SCO8755",
    "subject": "SCO",
    "number": "8755",
    "honors": false,
    "writingIntensive": false,
    "name": "Behavioral Operations",
    "fullname": "Behavioral Operations",
    "info": "Research/review classic behavioral literature in economics and other business disciplines; identify behavioral problems within operations contexts; test/analyze operations phenomenon through experimental study, empirical methods, and analytical modeling. Supply chain problems.prereq: Business admin Ph.D. student or instr consent",
    "prereq": []
  },
  {
    "uid": "794503",
    "code": "SCO8800",
    "subject": "SCO",
    "number": "8800",
    "honors": false,
    "writingIntensive": false,
    "name": "Res Topics in Supply Chain Ops",
    "fullname": "Research Topics in Supply Chain and Operations",
    "info": "Topics selected from contemporary areas of research and/or methods in supply chain and operations. prereq: Business admin Ph.D. student or instr consent",
    "prereq": []
  },
  {
    "uid": "825314",
    "code": "SCO8811",
    "subject": "SCO",
    "number": "8811",
    "honors": false,
    "writingIntensive": false,
    "name": "Operations Strategy",
    "fullname": "Operations Strategy",
    "info": "The course goal is to expose students to the operations strategy area holistically, starting with its origins and historical evolution over time. Students will understand the breadth, develop a sense of the pertinent research questions that have been examined and those that remain unanswered, and begin to develop an informed sense of the emerging/existing research paradigms. The seminar approach is both topical and methodological, using published and working papers as the context and starting point for discussions. Although the focus of the class is not to teach new methods, a significant amount of time will be spent on the theoretical, empirical, and econometric research paradigms used in the papers. Each session is built around a specific theme. The objective is to develop a deep, collective understanding of the various research streams, different empirical methods, and the opportunities for contributions in the areas discussed.  Prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "825315",
    "code": "SCO8821",
    "subject": "SCO",
    "number": "8821",
    "honors": false,
    "writingIntensive": false,
    "name": "Mgmt of Technological Ops",
    "fullname": "Management of Technological Operations",
    "info": "The learning objectives of the seminar are to develop an understanding of the problems in managing technological operations (i) within firms (intra-firm), and (ii) across firms (inter-firm) – i.e., designing and sustaining reliable, responsive, resilient and responsible supply chains. Theories and methodologies that either have been, or can be, applied to address these problems will be reviewed. Emerging and impactful problem areas relevant to managing technological operations within and across firms, and their supply chains, and their potential to serve as topics for new lines of research inquiries will be explored. Prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "825316",
    "code": "SCO8822",
    "subject": "SCO",
    "number": "8822",
    "honors": false,
    "writingIntensive": false,
    "name": "Innovative Operations",
    "fullname": "Innovative Operations",
    "info": "The course will focus on emerging research topics in supply chain and operations with a particular focus on topics that relate to: (i) technology and supply chains in the context of developing economies and the public sector, and (ii) the increased digitization of supply chains through the use of sharing economy platforms. While these topics build upon and extend the core focus areas of supply chain operations (e.g., technology management, operations strategy, and inventory management), they also cross disciplinary boundaries (e.g., information systems, strategy, and public policy) and represent areas of much interest to scholars across disciplines.  Prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "825318",
    "code": "SCO8831",
    "subject": "SCO",
    "number": "8831",
    "honors": false,
    "writingIntensive": false,
    "name": "Supply Chain Management",
    "fullname": "Supply Chain Management",
    "info": "This course is designed to provide students with some foundational tools and techniques to model and analyze business problems in the context of supply chain management. Basic theoretical models as well as related quantitative methods and techniques will be discussed.  In addition, each session will involve detailed discussions of classic and recent research articles that demonstrate how various supply chain topics of interest can be modeled and analyzed using different conceptual and methodological approaches. Prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "825317",
    "code": "SCO8832",
    "subject": "SCO",
    "number": "8832",
    "honors": false,
    "writingIntensive": false,
    "name": "Analytical Models for Ops Mgt",
    "fullname": "Analytical Models for Operations Management",
    "info": "This is a foundational course that introduces PhD students to analytical models widely used in operations management including optimization, game theory, and queueing theory. This course pays particular attention to emerging applications in supply chain, sustainable operations, retail, service, online platforms, and machine learning.  Prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "825319",
    "code": "SCO8841",
    "subject": "SCO",
    "number": "8841",
    "honors": false,
    "writingIntensive": false,
    "name": "Behavioral Research in Ops Mgt",
    "fullname": "Behavioral Research in Operations Management",
    "info": "This course aims to prepare students to conduct rigorous research in the field of behavioral operations.  It focuses on developing skills in three areas (1) knowledge of classic behavioral theories in economics, sociology, psychology, and other social sciences as they apply to an operations context; (2) ability to ascertain and discover novel behavioral issues that arise within operations contexts, particularly those with the potential for major impact on operational outcomes such as profit, demand, operational efficiency, service level, employee retention, and customer satisfaction; and (3) judgement of what research methodologies are most appropriate for studying a given behavioral issue and practice using these methodologies.  Special emphasis is given to  experimental and analytical methodologies, with applications spanning operational decisions in service systems, new product development, supply chain management, and responsible operations.Prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "825320",
    "code": "SCO8842",
    "subject": "SCO",
    "number": "8842",
    "honors": false,
    "writingIntensive": false,
    "name": "Retail Operations",
    "fullname": "Retail Operations",
    "info": "This course is designed to provide an overview of research in the field of retail operations and to help students develop necessary skills to conduct research in retail operations. To achieve these goals, the course covers a range of topics including forecasting and inventory management, assortment planning, store labor, store execution, consumer returns, omnichannel retailing, and innovative retail practices.Prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "825321",
    "code": "SCO8843",
    "subject": "SCO",
    "number": "8843",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainable/Socially Resp Ops",
    "fullname": "Sustainable and Socially-Responsible Operations",
    "info": "With the fast expanding public awareness and aggravating environmental issues witnessed in recent years, the sustainability of business is receiving keen interest from both firms and policy-makers across the globe. Operations play a central role, as the objective of environmentally- and socially-responsible business needs to be realized through implementation and operationalization on the ground. Over the past decades, operations research has made significant contributions to advance our understanding and approaches on the sustainable aspects, examples include studies on the design and management of closed-loop supply chains (to deal with the resell, reuse, recycling or remanufacturing of used items), the development and implementation of evaluation systems to assess the environmental performance of firms (such as incorporation of the industrial ecology tool of Life-Cycle Assessment into the analysis), the formulation of environmental regulations (ranging from waste management, energy, to emissions and pollutions), the innovative business models (such as different new product development strategies, servicing and sharing economy), and those on the broader social and humanitarian issues. In this course, we will dive into the related literature, to have in-depth discussions on papers that use different conceptual and methodological approaches.Prereq: Business admin PhD student or instr consent; offered alt yrs",
    "prereq": []
  },
  {
    "uid": "004697",
    "code": "SCO8892",
    "subject": "SCO",
    "number": "8892",
    "honors": false,
    "writingIntensive": false,
    "name": "Readings in Supply Chain & Ops",
    "fullname": "Readings in Supply Chain and Operations",
    "info": "Readings useful to student's individual program and objectives that are not available in regular courses.prereq: Business admin PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "004698",
    "code": "SCO8894",
    "subject": "SCO",
    "number": "8894",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in Supply Chain & Ops",
    "fullname": "Research in Supply Chain and Operations",
    "info": "Individual research on an approved topic appropriate to student's program and objectives.prereq: Business admin PhD student or instr consent",
    "prereq": []
  }
]