[
  {
    "uid": "819471",
    "code": "SFS2001",
    "subject": "SFS",
    "number": "2001",
    "honors": false,
    "writingIntensive": false,
    "name": "Lang & Culture: Chile",
    "fullname": "Language, Culture and Society of Chile",
    "info": "The Language, Culture, and Society of Chile course is provided in two integrated modules:I. Chile: History, Culture, and Society. Rodrigo Hernandez & Guest LecturersI. SpanishThe Spanish module is designed to provide students with working knowledge of the Spanish language for communication, according to their initial level of competence. The Society and Culture module aims to provide students with an initial national and local historical and cultural context for understanding the cultural and political complexities of contemporary Chile. The Spanish module comprises 20 hours and the Society ad Culture module comprises 10 hours, for a total of 30 instructional hours, equivalent to 2 credits. Instructional parts of the course will be complemented by opportunities for participation in community and cultural activities. The course does not provide cultural immersion, rather it aims to provide students with initial tools they can build on outside class.",
    "prereq": []
  },
  {
    "uid": "815068",
    "code": "SFS2010",
    "subject": "SFS",
    "number": "2010",
    "honors": false,
    "writingIntensive": false,
    "name": "Religion and Culture of Bhutan",
    "fullname": "Religion and Culture of Bhutan",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "811349",
    "code": "SFS2050",
    "subject": "SFS",
    "number": "2050",
    "honors": false,
    "writingIntensive": false,
    "name": "Lang & Culture: Costa Rica",
    "fullname": "Language, Culture, and Society of Costa Rica",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811350",
    "code": "SFS2060",
    "subject": "SFS",
    "number": "2060",
    "honors": false,
    "writingIntensive": false,
    "name": "Swahili Lang & E African Comm.",
    "fullname": "Introduction to Swahili Language and East African Tribal Communities",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811351",
    "code": "SFS2070",
    "subject": "SFS",
    "number": "2070",
    "honors": false,
    "writingIntensive": false,
    "name": "Cultural Competence in Conserv",
    "fullname": "Cultural Competence in Conservation",
    "info": "Spanish Language Module:The Spanish Language Module is taught by certified language instructors in Bocas del Toro. The module offers reading, listening, oral, written, and practical applications of the Spanish language at several levels of proficiency to increase students’ comprehension and communication skills. This module involves 20 contact hours of class time over the course of two weeks with certified Spanish instructors. Levels of instruction follow the Diploma de Español como Lengua Extranjera (DELE) and Common European Framework Reference for Languages (CEFR). Student language aptitude levels will be identified through an oral and written placement assessments administered by the Spanish language instructors at the beginning of the semester.Society and Culture of Panama Module:The Society and Culture Module emphasizes a deep understanding of the current socio-environmental justice challenges local communities encounter in the Bocas del Toro (BDT) archipelago. Throughout the course students will learn to observe and process the reasons behind these challenges within this small, island community, while immersing themselves in the necessary background readings to understand the basic history and cultural expressions of Panamanian society. A combination of lectures, readings, field experiences and classroom discussion will facilitate the understanding of the socio-cultural context of Panamá, helping to prepare students to work more effectively in community-based directed research efforts and community outreach projects. During the course, students can expect to hear from local experts who will provide students with a good understanding of Panamanian history and geopolitical background. Assignments include discussions, presentations, and written reflections.",
    "prereq": []
  },
  {
    "uid": "811352",
    "code": "SFS2080",
    "subject": "SFS",
    "number": "2080",
    "honors": false,
    "writingIntensive": false,
    "name": "Lang & Culture of Cambodia",
    "fullname": "Language and Culture of Cambodia",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811353",
    "code": "SFS2090",
    "subject": "SFS",
    "number": "2090",
    "honors": false,
    "writingIntensive": false,
    "name": "Lang & Culture: Peru",
    "fullname": "Language, Culture and Society of Peru",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "816418",
    "code": "SFS3000",
    "subject": "SFS",
    "number": "3000",
    "honors": false,
    "writingIntensive": false,
    "name": "Tourism & Island Systems",
    "fullname": "Tourism and Island Systems: Assessment of Sustainable Practices",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "811386",
    "code": "SFS3020",
    "subject": "SFS",
    "number": "3020",
    "honors": false,
    "writingIntensive": false,
    "name": "Envtl Gov, Dev & Conservation",
    "fullname": "Environmental Governance, Development and Conservation",
    "info": "This course examines environmental policy and socioeconomic values through the lens of tourism development in Bocas del Toro, Panama (Bocas). After discussing environmental and social challenges historically connected with international tourism development, we will then explore the ideological thrust towards sustainable tourism, as well as critique this concept – always asking:“what are we sustaining and for whom?” The course will then move on to explore and examine the ways that international development (i.e., foreign investment and aid from global financial institutions) manifest locally in Bocas and explore the associated challenges and opportunities. This will require observing tourism in the field to understand the tourism hosts and guests, as well as how they interact, and the environmental and social implications of these interactions. This will be a part of preparing for conducting directed research geared towards better understanding tourism related challenges and potential solutions (policy, private sector, grassroots, etc.) on the archipelago. This discussion will be situated using governance as a theoretical context so that we may better understand the multifaceted and multi-actor way human behavior is controlled and organized, as well as how natural resources are allocated.",
    "prereq": []
  },
  {
    "uid": "826007",
    "code": "SFS3021",
    "subject": "SFS",
    "number": "3021",
    "honors": false,
    "writingIntensive": false,
    "name": "Envt Sustnblty, SocEcon Values",
    "fullname": "Environmental Sustainability and Socioeconomic Values",
    "info": "The Environmental Sustainability and Socio-Economic Values course explores the contemporary environmental and sustainability issues and also touches broadly on the historical, social-cultural, economic and political factors that determine the use of natural resources, with particular emphasis on, but not limited to, the Wet Tropics of Australia. Topics to be covered in this course include; environmentalism, sustainable food production and livelihoods, the impact of human activities on terrestrial and marine biomes, conservation conflicts, resource governance and so on. In addition, students will be introduced to social science research methods, while a visit to a local Aboriginal community will help them gain a better understanding of the first Australian’s enviro-cultural heritage values.",
    "prereq": []
  },
  {
    "uid": "826496",
    "code": "SFS3022",
    "subject": "SFS",
    "number": "3022",
    "honors": false,
    "writingIntensive": false,
    "name": "Marine Conservation Governance",
    "fullname": "Marine Conservation Governance",
    "info": "Studying the use and conservation of marine and coastal natural resources requires scrutiny from manydifferent natural science and social science perspectives. We will focus on human interactions with localnatural systems, and vice versa. Understanding the roles that nature-society interactions such asresource extraction, fishing, tourism, and associated development play in the protection of natural areasfrom human disturbance is crucial to the present and the future of the Turks and Caicos Islands (TCI).Our primary goal is to discover how we may encourage sustainable human-environment relationships.This course will help you comprehend the connections between theory and practice. It will also provide you with the on-the-groundpractical skills and tools necessary to critically analyze management of the human-environmentnexus. Because tourism, development, fishing, and conservation are simultaneously social, cultural,economic, and ecological phenomena, holistic critical thinking can help to create more sustainableprograms that will benefit natural and social worlds.",
    "prereq": []
  },
  {
    "uid": "826802",
    "code": "SFS3023",
    "subject": "SFS",
    "number": "3023",
    "honors": false,
    "writingIntensive": false,
    "name": "Env Policy & Socioecon Values",
    "fullname": "Environmental Policy and Socioeconomic Values",
    "info": "This course explores the social, cultural, economic, and political context of the relationship between people and wildlife. The theoretical underpinnings draw on principles from human ecology, ecologicalanthropology, micro-and macroeconomics, development theory, philosophy, and law. To understand present and future wildlife management in Kenya and Tanzania, this course examines influences of traditional attitudes, national land tenure regimes and policy framework, international influences,economic conditions, natural resource potentials and constraints, and regulation on human-wildlife interactions. Wildlife conservation in Tanzania (specifically in the Tarangire/Manyara Ecosystem) is examined in context of other competing land use alternatives in which its potential economiccontribution to enhancing rural livelihoods is weighed against its constraints (e.g., depressed livelihoods associated with human-wildlife conflicts). ",
    "prereq": []
  },
  {
    "uid": "811387",
    "code": "SFS3030",
    "subject": "SFS",
    "number": "3030",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ & Ethics in Sustain Dev",
    "fullname": "Economic and Ethical Issues in Sustainable Development",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "815069",
    "code": "SFS3040",
    "subject": "SFS",
    "number": "3040",
    "honors": false,
    "writingIntensive": false,
    "name": "Pol & Socioecon Dimen of Envir",
    "fullname": "Political and Socioeconomic Dimensions of Environment",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "815070",
    "code": "SFS3050",
    "subject": "SFS",
    "number": "3050",
    "honors": false,
    "writingIntensive": false,
    "name": "Land Use, Natrl Res & Conserv",
    "fullname": "Land Use, Natural Resources and Conservation",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "815071",
    "code": "SFS3060",
    "subject": "SFS",
    "number": "3060",
    "honors": false,
    "writingIntensive": false,
    "name": "Mountain Ecology",
    "fullname": "Mountain Ecology",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "811388",
    "code": "SFS3070",
    "subject": "SFS",
    "number": "3070",
    "honors": false,
    "writingIntensive": false,
    "name": "Public Health & Environment",
    "fullname": "Field Practicum in Public Health and Environment",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "818576",
    "code": "SFS3071",
    "subject": "SFS",
    "number": "3071",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Dimensions of Conservtn",
    "fullname": "Human Dimentions of Conservation",
    "info": "The concepts of human dimensions in conservation dates back to Aldo Leopold, one of the key pioneers of land ethics and conservation. Conservation is a complex undertaking and partly entails involving humans. It has therefore increasingly become important to address or relate human dimensions to conservation and management of natural resources. This course will examine the relationship between people, the environment and associated natural resources. In the process, it will explore how people’s behavior, values and knowledge, influence and are affected by decisions on management of natural resources and conservation of wildlife. It will use social science knowledge and tools to effectively incorporate societal values into conservation planning and decision-making, and to build stronger and more diverse partnerships. Students will also learn human dimensions concepts, the tools and methods that can be used in conservation outreach and communication.This course will focus on the human dimensions on conservation in the Amboseli Ecosystem in the South-eastern rangelands of Kenya. Students and Faculty will examine the cultural, economic, political and social context of the Maasai people and other ethnic groups in relationship to wildlife and natural resources utilization and conservation. To understand the current and future management and conservation of wildlife and other natural resources in the region, students will also examine the influence of traditional beliefs and attitudes in natural resource use and conservation practices. The influence of modern lifestyle, conservation and management practices, national policies and laws as well as land uses and socio-political and economic changes among the Maasai people will be evaluated. Specifically, human dimensions of conservation issues will focus on the Maasai Group Ranches, national parks, wildlife sanctuaries or conservancies especially those in the former Kimana Group Ranch, and the expansive private land parcels along the Kenya-Tanzania border. At the end of the semester, students will use and apply the human dimensions aspects learned in their directed research work which will be guided the Faculty in-charge of the course. The findings will be presented to diverse stakeholders comprising of community members, local leaders, national and Kajiado County government officials.",
    "prereq": []
  },
  {
    "uid": "826777",
    "code": "SFS3072",
    "subject": "SFS",
    "number": "3072",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Dimen of Endngrd Species",
    "fullname": "Human Dimensions of Endangered Species",
    "info": "Conservation is a deeply human endeavor in multiple dimensions. Humans influence nature that they are part of, and nature also plays a role in shaping humans' social, economic, and political world. Conservation cannot, therefore, be fully understood and practiced from a pure natural science perspective. Exploring human dimensions of conservation, using heuristic tools and concepts from social sciences, is indeed essential in realizing the desired holistic approach needed to restore biodiversity to pre-1970s levels. This course will focus on the human dimensions of conservation of endangered species in Kenya. The course will examine and expand the students’ understanding of the multiplex relationships between people, the endangered species, and their environment, including associated natural resources. In the process, it will explore how people’s behavior, values, and knowledge influence and are affected by decisions on management of endangered species. The overarching question to be addressed is how to achieve a healthy interaction between politics, economics, cultures, and technology so that populations of endangered species are conserved and restored in a manner that values humans wellbeing as well. The course will use a wide range of social sciences knowledge and tools, but mostly Anthropology and Political Ecology, to effectively incorporate societal values into conservation planning, technology, and decision-making around selected endangered species in Kenya, and to build stronger and more diverse partnerships. Students will also learn human dimensions concepts, the tools and methods that can be used in conservation research, outreach, and communication.See \"Course Overview\" on syllabus for full description.",
    "prereq": []
  },
  {
    "uid": "819206",
    "code": "SFS3081",
    "subject": "SFS",
    "number": "3081",
    "honors": false,
    "writingIntensive": false,
    "name": "Political/Social Conservation",
    "fullname": "Political and Social Dimensions of Conservation",
    "info": "This course explores the decision-making apparatus within Chile and Argentina and delves into the complexity of why humans decide to conserve or not; which places/things we choose to conserve or not, what is the cost (in human capital, economic capital, and to ecosystem services) when we choose to conserve or not, and who ultimately are the power brokers of the conservation movement in Patagonia (corporations, government entities, NGOs, foreigners, etc.). And by extension, how do the Chilean conservation management objectives and operations map onto the broader world stage. This is a very transformative time in Chilean conservation management. The ministries are under re-organization; those that hold political influence now may not be the ones in office next year. Many media outlets such as CNN, the New York Times, and The Economist have had recent profiles on the influence of foreign private entities largely shaping the conservation scene in Chile. This course will allow stimulating debate and exploration and send students home with unprecedented insight.While the course will expose students to broad conservation issues that face the entire planet, we will ground these topics in case studies from the diverse locations we visit. Students will learn concepts in conservation both theoretical and practical from lectures and field trips. Throughout the semester, students will be exposed to a wide range of conservation practices, policies and critiques through discussions, direct observations, and assessments of various conservation initiatives that are being implemented and co-managed by diverse stakeholders including: local government agencies, international governments and investors, private companies, local and international organizations, and researchers. The course will provide students with a background to engage in a nuanced discussion of conservation at multiple scales. Students will gain first-hand information about different conservation challenges and approaches from diverse perspectives such as decision makers; park rangers; educators; and conservation activists who are active in the conservation field in both Chile and Argentina.",
    "prereq": []
  },
  {
    "uid": "817963",
    "code": "SFS3111",
    "subject": "SFS",
    "number": "3111",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecol & Cons of SE Asian Elphts",
    "fullname": "Ecology and Conservation of Southeast Asian Elephants",
    "info": "This course will focus on the ecology and conservation of the Asian elephant (Elephas maximus). Due to a drastic decrease in wild elephant populations, the reality of a world without these charismatic megafauna is becoming a likely possibility. In Asia this is primarily due to a booming human population and increased demand for space. Elephants are of great scientific interest due to their complex behaviors associated with intelligence and social interactions, forming deep family bonds and displaying empathy by recognizing and responding to another elephant's pain or problem and showing signs of grief after the loss of a family member. Saving the elephants requires improved scientific understanding of the species and the increasingly complex environment that they inhabit.",
    "prereq": []
  },
  {
    "uid": "826516",
    "code": "SFS3112",
    "subject": "SFS",
    "number": "3112",
    "honors": false,
    "writingIntensive": false,
    "name": "SE Asian Elphts Camb and Thai",
    "fullname": "Ecology and Conservation of Southeast Asian Elephants: Cambodia and Thailand",
    "info": "In addition to ecology and conservation, this summer course will include components on elephant welfare and management as well as the history of elephants in Asia, both in the wild and in captivity, with particular focus on Cambodia and Thailand. In Cambodia, lectures will be followed by related fieldwork exercises on semi-captive elephants. Students will learn to identify elephant behaviours, as well as their foraging patterns and habitat preferences using both quantitative and qualitative methods. Students will contribute to collecting valuable and informative data whilst directly observing elephants, using continuous and interval sampling. Elephant habitat use will be recorded indirectly based on signs such as footprints, dung and feeding signs which can help to distinguish elephant age, group composition and food-plant preferences. Semi-captive elephants provide an ideal opportunity for students to get close enough to observe elephant behaviour and gather data that can contribute to our knowledge of their wild counterparts. Students will learn about elephant physiology and health assessments from an experienced elephant vet during their time at EVP.Using the skills students have started to develop in Cambodia, during the Thailand component, they willdelve into conservation challenges and conflict associated with the human-elephant interface. This willbe explored by interviewing, and staying in the homes of local villagers that are directly affected by wild elephant crop-raiding. This information will be used to inform a research project associated with human-elephant conflict mitigation. Students will spend the three weeks collecting either qualitative or quantitative data, writing up a report that will be shared with our partner BTEH and presenting their results to the local community including those who are directly affected by human-elephant conflict. Students will work in groups of 3-4 for each project.",
    "prereq": []
  },
  {
    "uid": "818857",
    "code": "SFS3121",
    "subject": "SFS",
    "number": "3121",
    "honors": false,
    "writingIntensive": false,
    "name": "Carnivore Ecology Conservation",
    "fullname": "African Large Carnivores: Ecology and Conservation",
    "info": "This course will focus on the behavioral ecology and conservation challenges facing large carnivores in Africa using Northern Tanzania as a case study. SFS center for wildlife management studies in Tanzania is an ideal location to explore the ecological and human aspects of large carnivore conservation. The center is located between the Ngorongoro-Serengeti (NSE) and Tarangire-Manyara (TME) ecosystems in northern Tanzania. Both ecosystems have largely intact carnivore guilds that occur within and outside the protected areas. The large carnivores are one of the main attractions to a vibrant photographic tourism industry. In addition, large carnivores attract high premiums among the trophy hunters in the area. Despite the high economic values, carnivores in northern Tanzania are under immense threats from human-related effects such as habitat loss, and conflicts with pastoralists. In order to address these challenges, large carnivores have attracted high interest among conservationists and scientists in Northern Tanzania. African wild dogs, African lions, spotted hyenas, cheetahs and leopards have received high attention due to their charismatic appeal and the manifold threats facing them. Among those species, lions and leopards are among the big five and are highly sought after by tourists. In order to address the conservation threats and better understand the ecology of these large carnivore species in Northern Tanzania, several conservation and research projects have been initiated. These include: The Tarangire Lion Research Project in Tarangire/Manyara National Parks and the surrounding areas, Kope Lion project in Ngorongoro Conservation Area, and species-specific projects in Serengeti National park focusing on lion, cheetah, spotted hyena and African wild dog.",
    "prereq": []
  },
  {
    "uid": "818858",
    "code": "SFS3131",
    "subject": "SFS",
    "number": "3131",
    "honors": false,
    "writingIntensive": false,
    "name": "Marine Fauna Ecology & Conserv",
    "fullname": "Marine Fauna Ecology and Conservation",
    "info": "In this course, we will explore the ecological importance and conservation status of megafauna that are prominent in the coastal waters of the tropics, namely elasmobranchs (sharks and rays), large oceanic and reef fishes, marine and coastal reptiles (sea turtles, island iguanas), and marine mammals. The course will consist of lectures, workshops, and field-based activities that provide students with an understanding of the diversity and ecological characteristics of these animals. Furthermore, the workshops and field activities will introduce students to the practical techniques that are commonly employed to study and assess megafauna.The course will take place on the island of South Caicos, which is at a pivotal time in its development. Until recently, the island’s economy centered around small-scale local fisheries, but a growing tourism industry and recent devastation from Hurricanes Irma and Maria have meant major changes to the community and marine ecosystem. As climate events continue to perturb the marine environment and the economy and the population grow and diversify, so too do the demands on the marine environment. Marine megafauna play important roles in the TCI, both ecologically and economically, making this the perfect place to take a deep dive into their characteristics, threats, and conservation.",
    "prereq": []
  },
  {
    "uid": "818859",
    "code": "SFS3141",
    "subject": "SFS",
    "number": "3141",
    "honors": false,
    "writingIntensive": false,
    "name": "Coffee/Chocolate Sustainbl Dev",
    "fullname": "Coffee, Chocolate and Sustainable Development",
    "info": "Coffee (Coffea arabica, Coffea canephora) and chocolate / cacao (Theobroma cacao) are iconic food crop species in the Tropics. Their emotionally and physically addictive components have led to $98.2 billion in annual sales of chocolate (International Cacao Organization, Statistics, 2016) and coffee exports totaling $30.6 billion (World’s Top Exporters, Coffee, 2016). These tropical crops are intimately intertwined with the natural and political history, culture, and ecology of Costa Rica.This is an interdisciplinary summer program aiming to explore the deeper social and ecological components that intertwine these crops to our lives and the natural and political history of Costa Rica. We consider how the relations between slavery as part of early cacao production, and the transformation of forested lands to coffee plantations owned by elites, intertwine with current questions of cultural representation, agro-tourism, land use strategies, and agricultural certifications. We will conduct site visits to a variety of coffee and cacao farms and producers to learn how various production methods and policies impact the local flora, fauna, and society. Through field research in small groups, we will focus on data collection to conduct an in-depth exploration of the relations between cacao and coffee production and climate change, social justice movements, and species conservation.",
    "prereq": []
  },
  {
    "uid": "818578",
    "code": "SFS3151",
    "subject": "SFS",
    "number": "3151",
    "honors": false,
    "writingIntensive": false,
    "name": "Primate Behavioral Ecol: E Afr",
    "fullname": "Primate Behavioral Ecology in East Africa",
    "info": "This course focuses on primate behavioral ecology in southern Kenya focusing on Amboseli Tsavo Ecosystem (ATE). In Africa, there are about 94 species of primates, with Kenya having 19 species. These include some of the world’s most endangered and rare species such as the Tana River red colobus, Tana River mangabey, Percival’s black and white colobus, and de Brazza’s monkeys. Globally and across the continent, most primate populations are declining due to habitat loss, and poaching for bush meat and other products. In most regions of Kenya, habitat loss, habitat fragmentation and human primate conflicts are the major challenge to primate conservation. These effects have been amplified by a continuously increasing human population particularly in the rural areas where there most natural areas for wildlife occur. The increased human population is associated with activities such as agriculture, charcoal burning and conversion of land for human settlement which have led to loss and degradation of primate habitats. The loss of habitat has resulted to fragmentation and reduced populations of primates as critical habitats becoming scarce. Today the scenario is that of isolated populations of primates, with more habitat specific species getting confined mostly to within protected areas. However due to their broad habitat and long ranging movement of a number of primates, areas outside protected areas are still very critical to primate conservation.",
    "prereq": []
  },
  {
    "uid": "818860",
    "code": "SFS3161",
    "subject": "SFS",
    "number": "3161",
    "honors": false,
    "writingIntensive": false,
    "name": "Wet Tropics Eco & Conserv",
    "fullname": "Wet Tropics Watershed Ecology and Conservation",
    "info": "The Great Barrier Reef and its catchments (watersheds) are an inter-connected system. In this course we will follow a river’s journey from the World Heritage listed rain forest ranges to the Great Barrier Reef as we explore the connections between land and sea. Students will learn about the ecological processes and socio-economic factors that shape rain forest, watershed, and reef management in Queensland’s tropical north, and the factors needed to maintain healthy ecosystems in the face of climate change, development and increasing urbanization.",
    "prereq": []
  },
  {
    "uid": "820143",
    "code": "SFS3181",
    "subject": "SFS",
    "number": "3181",
    "honors": false,
    "writingIntensive": false,
    "name": "Himalayan Forests & GNH",
    "fullname": "Himalayan Forests & Gross National Happiness",
    "info": "Bhutan is internationally famous for its development concept of Gross National Happiness (GNH). GNH, which has its underpinnings in the Buddhist philosophy of the Middle Path, is the guiding principle of development in Bhutan, and is understood to have four pillars: good governance, cultural protection and preservation, sustainable development, and environmental conservation. GNH and a leadership committed to conservation has led to Bhutan having more than 70% forest cover and about 50% of its land area under formal protection. Bhutan’s forests which fall within the eastern Himalayan region is characterized by extensive and numerous mountains and valleys, hosting some of the world’s highest peaks and a diversity of vegetation and wildlife. Bhutan’s natural landscapes host an estimated 770 species of birds and other diverse fauna, including the takin, snow leopard, golden langur,blue sheep, and tiger. Ecosystems range from subtropical broadleaf forests in the south, to subalpine conifer forests, alpine shrub, and high-mountain meadows. The highest elevations comprise rock and ice.These forests and natural landscapes are integral to Bhutan’s development, and key to ensuring food, water and energy security.Over four weeks, students will learn about the interplay between GNH, resource use and development.Through travel to various parts of the country, students will be exposed to the culture and history, religious traditions, environmental issues, and conservation policies. Students will stay in Bhutanese villages and trek across Himalayan landscapes to experience and understand rural livelihoods and their connection to the natural environment. Academically, students will develop skills in assessing environmental problems, designing socio-economic surveys, conducting resource assessments, and communicating results. Students will be guided to appreciate the complexities and challenges involved in meeting development goals while simultaneously ensuring the adequate conservation of natural resources in a rapidly changing region.SFS partners with the Ugyen Wangchuck Institute for Conservation and Environment Research (UWICER), an international research and training facility in Bumthang, Bhutan and the Bhutan Ecological Society (BES), a Civil Society Organization promoting environmental sustainability in Bhutan. SFS students and faculty will collaborate with UWICER and BES to advance its research agenda in several priority areas, including forest management, community resource assessment, and development policy.",
    "prereq": []
  },
  {
    "uid": "820159",
    "code": "SFS3191",
    "subject": "SFS",
    "number": "3191",
    "honors": false,
    "writingIntensive": false,
    "name": "Tracking & Conserv – Big Cats",
    "fullname": "Tracking and Conservation of Big Cats in the Himalayas",
    "info": "Within the Eastern Himalayas, Bhutan is increasingly seen as the last biodiversity refugia. In particular, Bhutan is home to 10 wild cat species, with the Snow Leopard, Tiger and the Clouded Leopard being the most charismatic big cat species. With 70% of its land under forests, and over 50% conserved under a well networked protected area system, these wild cats and associated species continue to thrive in Bhutan. A deep spiritual and cultural reverence for life and nature has aided in the persistence of biodiversity. However, climate change and human-wildlife conflicts continue to pose serious threats to the long term health of Bhutan’s landscapes and species therein. Tracking the status of important keystone species, such as Tigers and Snow Leopards, and understanding threats and opportunities will be crucial in helping to adequately mitigate threats and implement effective adaptation strategies to ensure the long term survival of species in the wild.The summer course on Tracking and Conservation of Big Cats in the Himalayas will focus on understanding key issues and challenges associated with conservation of wild cats and associated species. Students will be introduced to the socio-political and cultural significance of Himalayanlandscapes and biodiversity, with a special focus on charismatic species such as the Tigers and Snow Leopards. Interactions with stakeholders from the Government, academia, local people and civil society will allow students to understand environmental governance frameworks and better appreciate on-the-ground conservation challenges associated with climate change, human-wildlife conflicts, and limitedfinancing and capacity.The four-week course will be a mix of classroom lectures and field trips to different parts of Bhutan. Traveling through Bhutan, students will learn about conservation challenges, culture and history, religious traditions, and environmental issues. Students will stay in Bhutanese villages and trek across Himalayan landscapes to experience and understand rural livelihoods and their connection to the natural environment. Academically, students will develop skills in assessing environmental problems, designing socio-economic surveys, conducting resource assessments, and communicating results. Students will learn camera trapping techniques and associated data analysis skills to estimate population sizes and map species distribution ranges in a GIS. Students will also be introduced to radio-telemetry and estimation of home ranges. Throughout the course, students will be guided to appreciate the complexities and challenges involved in effective conservation of wildlife.SFS partners with the Ugyen Wangchuck Institute for Conservation and Environment Research (UWICER), an international research and training facility in Bumthang, Bhutan, and the Bhutan Ecological Society (BES), a Civil Society Organization promoting environmental sustainability in Bhutan. SFS students and faculty will collaborate with UWICER and BES to advance its research agenda in several priority areas, including conservation, forest management, community resource assessment, and development policy.",
    "prereq": []
  },
  {
    "uid": "825932",
    "code": "SFS3211",
    "subject": "SFS",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshwater Ecosystems",
    "fullname": "Freshwater Ecosystems",
    "info": "Freshwater ecosystems are amongst the most important and productive ecosystems. They  support tremendous biodiversity and provide food security to millions of people, many of  whom live in some of the world’s poorest nations. Despite this, the millennium development  goals for biodiversity completely neglected freshwater systems, and it is only now emerging on  the global agenda. This lack of attention has resulted in fewer freshwater protected areas  compared to terrestrial biome. In addition, a critical knowledge gap in the conservation of  freshwater ecosystems exists because the majority of research and conservation efforts have  concentrated on terrestrials or marine systems.  Cambodia is home to one of the highest levels of biodiversity and productivity of freshwater  ecosystems in the world. The Cambodian Tonle Sap-Lower Mekong River system is driven by an  annual flood pulse hydrological system which results in rich spawning grounds for fishes and  high nutrient loads for rice production. This system produces one of the world’s largest inland  fisheries and an importance source of food security to the Cambodians: over 70% of the  population’s protein intake derive from fisheries resources from this system.  ",
    "prereq": []
  },
  {
    "uid": "825933",
    "code": "SFS3232",
    "subject": "SFS",
    "number": "3232",
    "honors": false,
    "writingIntensive": false,
    "name": "Envmntl Justice From Ground Up",
    "fullname": "Environmental Justice from the Ground Up",
    "info": "The concept of environmental justice (EJ) refers to equal sustainable access to natural resources that are vital for human groups to achieve a meaningful, fulfilling, and happy life,  such as access to clean water, to nutritious and pesticide-free food, clean air, and to the  benefits of sustainable use of biodiversity. The concept of environmental justice (EJ) combines  notions of environmental sustainability and everyday environments with demands for social  justice (Agyeman 2013, Walker G. 2012). EJ focuses on the unequitable distribution of  environmental risks and governmental protection among people of different economic and  ethnic backgrounds (Schlosberg 2009). This concept has a long history in conservation and  sustainable development. The modern view derived from the US civil rights movement and  advocates’ calls for racial equality with environmental action. Socioeconomically disadvantaged  groups across the world have harnessed social justice action to fight against unequitable  environmental outcomes, although its origin is much older and can be traced back to historical  conflicts for limited natural resources.  ",
    "prereq": []
  },
  {
    "uid": "825934",
    "code": "SFS3252",
    "subject": "SFS",
    "number": "3252",
    "honors": false,
    "writingIntensive": false,
    "name": "Elephant Ecol and Cons",
    "fullname": "Elephant Ecology and Conservation in Kenya",
    "info": "The African elephant (Loxodonta africana) is an important keystone species in Africa and has  profound influence on the structure and dynamics of landscapes where it co-exists with other  species. It’s one of the most charismatic and charming species but its conservation and  population status has continued to attract a lot of concern within and beyond Africa. A key worry  is that it’s conservation is increasingly becoming uncertain across the entire African continent as due illegal poaching, landscape fragmentation, and retaliatory attacks by local communities due  to prevalence of human-elephant conflicts. At the beginning of the 20th century, there were  several millions of elephants roaming across Africa (Douglas-Hamilton 1979), but today, they  have declined rapidly, and are estimated to be nearly 450,000 - 700,000 (Stephenson, 2007).  Illegal poaching has been and remains the biggest threat to the survival of elephants, and this  threat is rampant throughout the entire continent (Douglas-Hamilton et al. 1992). Habitat loss,  associated with anthropogenic effects is the second biggest threat to the future conservation of  the species, and in the last century, large swathes of elephant natural habitats have been  converted into human dominated landscapes (Esikuri 1998). This not only leads to loss, reduction, and degradation of elephant prime habitats, but curtails their free movement, reduces their  home range, blocks their movement corridors and routes but increases conflicts with humans  (Spinage 1990). Collectively, this matrix creates a very inhabitable and hostile environment for elephant survival and conservation programs in all its range in Africa. ",
    "prereq": []
  },
  {
    "uid": "826976",
    "code": "SFS3253",
    "subject": "SFS",
    "number": "3253",
    "honors": false,
    "writingIntensive": false,
    "name": "Giraffe Ecology & Conservation",
    "fullname": "Giraffe Ecology & Conservation",
    "info": "The Giraffe (Giraffa camelopardalis) is an iconic species in the woodlands of Africa. As the world’s tallest land mammal, they have a widespread distribution across Southern and eastern Africa and has profound influence on the structure and dynamics of landscapes where it co‐exists with other species. Historically, giraffes ranged widely across much of the African continent, but they are now confined in national parks and reserves, conservancies, private ranches, and community land. It’s one of the most majestic, charismatic, and charming wildlife species but its conservation and population status has continued to attract a lot of concern since their population decline was noticed in 1999 (Giraffe Conservation Foundation, 2013). Across Sub-Saharan Africa, the total numbers of giraffes have reduced by 30% over the past three decades (Ruppert et al., 2021). A current crisis for wild giraffes is their significant decline by over 40% in the past 15 years, with fewer than 80,000 individuals now surviving in the wild (Fennessy et al., 2019).In this course, students will learn and examine diverse aspects of giraffes in Africa, Kenya, especially Amboseli, Nakuru and Maasai‐mara landscapes. This learning process will be achieved through classroom interactive learning sessions, experiential field activities, class discussions and lectures by Faculty and various guests. (see syllabus for full course description)",
    "prereq": []
  },
  {
    "uid": "825935",
    "code": "SFS3262",
    "subject": "SFS",
    "number": "3262",
    "honors": false,
    "writingIntensive": false,
    "name": "Rainforests of Australia",
    "fullname": "Rainforests of Australia",
    "info": "In Rainforests of Australia, you will obtain a broad appreciation of the diversity and dynamics of  tropical terrestrial biomes and marine life. You will be introduced to the current and past distributions of tropical rainforests, their biodiversity, and their relationships with the abiotic  environment, human use, present threats, and restoration practices. This course aims to bring  together an understanding of the underlying ecological processes that affect rainforests (and other  tropical vegetation) with the role of human society in shaping the present and future rainforests of  the Wet Tropics. The course will take the Australian Wet Tropics as a case study to investigate this  field, yet many of the skills you learn here can be transferred to other systems. Topics covered will  include: biophysical determinants of which vegetation type occurs where; past, present, and future  threats to Wet Tropics rainforests; and the theory and practice of rainforest restoration. The course also has a practical component. You will be taught field techniques for carrying out field  research, data analysis, and communication of results.  The course is a mixture of class lectures, field lectures, field laboratory courses, workshops, field  trips, and readings to complement the material presented in the lectures. A major emphasis is on  field skills, the collection, management and analyses of data, and skills of writing a scientific paper. A  wide range of material will be provided and should be used to study the class topics and to acquire  the desired skills. Be aware that all material covered in class, lectures, field lectures, and field trips will be required.",
    "prereq": []
  },
  {
    "uid": "826517",
    "code": "SFS3263",
    "subject": "SFS",
    "number": "3263",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustainable Food Systems",
    "fullname": "Sustainable Food Systems",
    "info": "Demand for agricultural products is expected to increase by an estimated 1.1% per year until 2050 due to drivers such as population growth, increases in per capita consumption, and diet changes. While the widespread use of monocropping systems in industrialized agriculture has managed to sustain food production, trends in global climate change are leading to increasing unpredictable local climates and posing a challenge to farmers worldwide. Moreover, large scale monocropping systems exert a heavy toll on the environment and on local biodiversity.The Sustainable Food Systems course examines food systems broadly and aims to provide students an experiential learning opportunity while we explore tropical natural, cultural, and agricultural landscapes. The course provides an overview of agroecology, economic botany, and associated cultural, environmental and sustainability issues, and touches broadly on the historical, socialcultural, economic and political factors that shape food systems.Lectures and activities in this course are aimed at addressing the following questions:a) How do agricultural practices differ between Australia and Indonesia?b) What are the current and emerging challenges facing agricultural production, and what aresome sustainable solutions?Throughout the course students will be introduced to and are expected to gain hands-on experience on economic botany and research techniques. ",
    "prereq": []
  },
  {
    "uid": "825936",
    "code": "SFS3272",
    "subject": "SFS",
    "number": "3272",
    "honors": false,
    "writingIntensive": false,
    "name": "Marsupials of Australia",
    "fullname": "Marsupials of Australia",
    "info": "This course will focus on the evolution, biogeography, ecology, behaviour, and conservation  of marsupials of Australia. Australia is one of the most ancient continents on our planet with geological features dating back to  more than 1.7 billon years. Its history was influenced by long periods of isolation from other land  masses while uplifts and erosion of mountains, forming, and disappearance of inland seas and cycles  of fires, drought, cyclones, and flooding shaped this land. This long history resulted in a unique  diversity of plants and animals. Ancient forms of mammals, such as egg-laying monotremes and  some small marsupials lived amongst Australia’s dinosaurs about 110 million years ago and formed  part of the ancient Gondwana fauna. After the extinction of the dinosaurs and when Australia finally  broke away from Gondwana it took with it its unique array of mammals into isolation. Freed from  the past dominating dinosaurs and finding themselves on a vast continent with no competing intruders, Australia’s ancient marsupials could thrive and diversify. Marsupial ‘hippos’, ‘rhinos,’ and  ‘tapirs’ occupied the land while killer-kangaroos targeted the weakest of these herds of grazing marsupials.",
    "prereq": []
  },
  {
    "uid": "825937",
    "code": "SFS3282",
    "subject": "SFS",
    "number": "3282",
    "honors": false,
    "writingIntensive": false,
    "name": "Patagonian Winter",
    "fullname": "Patagonian Winter",
    "info": "The Patagonian winter is a defining aspect of the ecological and social systems of the region. This course will examine the different ways that winter affects human and non-human systems. This course brings you to the world-famous Torres del Paine National Park in the stillness of winter, to observe the camelid  guanacos and flightless ñandús as they get ready for the approaching winter. The shortening days drive  changes in the ranching practices in the estancias in the area as they move their livestock to winter  pastures. The approaching Winter Solstice also connects indigenous communities as they make ready  for the coming New Year. Finally, the winter brings the season when glaciers would normally be  recovering their mass. However, climate change is creating changes in all of these interactions. High-latitude regions, such as Patagonia, are often more prone to the effects of climate change, making changes more apparent and significant. Indeed, climate change in Patagonia is quite clear, and one of  the seasons that have seen the most marked change is the winter. There has been less precipitation, and higher temperatures, meaning that there is less overall precipitation, and that which falls tends  more to be rain. This is leading to changes in ecological and social contexts of the Patagonian winter that  we will explore in this course. This course covers past adaptations to historic winter climates, from plant and animal community distributions and the human settlement patterns driven by climate conditions for the maintenance of communities. We examine how the Patagonian winter drives the ecology and social contexts of the  region. ",
    "prereq": []
  },
  {
    "uid": "811389",
    "code": "SFS3500",
    "subject": "SFS",
    "number": "3500",
    "honors": false,
    "writingIntensive": false,
    "name": "Wildlife Mgmt & Conservation",
    "fullname": "Wildlife Management and Conservation",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "825617",
    "code": "SFS3502",
    "subject": "SFS",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndtns of Wldlfe Mgmt and Cons",
    "fullname": "Foundations of Wildlife Management and Conservation",
    "info": "Conservation is a deeply human endeavor in multiple dimensions. In this regard, this course will examine the relationship between people, the environment and associated natural resources in the Amboseli Ecosystem. It will explore how people’s behavior, values, and knowledge influence and are affected by decisions on management of environmental resources. Overall, the course will provide students with in-depth understanding on the climate, ecology, and dynamics of East Africa Savanna Ecosystems and their linkage to wildlife and natural resources conservation in the predominantly Maasai inhabited Kenya-Tanzania borderland of the Amboseli Ecosystem. It will also use social science knowledge and tools to effectively incorporate societal values into conservation planning and decision-making, and to build stronger and more diverse partnerships. Students will learn and apply in the field multiple approaches and techniques to studying wildlife, natural resources conservation, community socio-economic aspects and ecological sampling techniques. They will also explore application of ecological and wildlife management concepts and principles in sustainable management of wildlife, water, and other natural resources through lectures, field exercises, and experiential hands-on learning. Students will learn about concepts of human dimensions of conservation, the tools and methods that can be used in conservation outreach and communication.The course will be done in the rapidly changing Maasai landscape of the Amboseli Ecosystem situated in the Southeastern sector of Kenya, along the Kenya-Tanzania border. Field lectures, exercises and DR will be done in the Maasai Group Ranches, private and community owned conservancies including private land in the former Kimana Group Ranch. Field trips to protected areas mainly; Amboseli, Chyulu Hills and Tsavo West National Parks will be used to further student’s field experiential learning. Field exercises will be used for acquisition of multiple skills such as; planning and designing fieldwork, field sampling techniques, data management, analysis and synthesis, report writing, and application of research in promoting sustainable management of wildlife and natural resources in general. Overall, the course aims at equipping students with knowledge on wildlife and natural resources conservation, imparting problem-solving scientific/social skills and techniques that are needed to understand the complex interactions affecting wildlife and natural resources. It offers practical, hands-on experiences inside and outside the classroom.",
    "prereq": []
  },
  {
    "uid": "811390",
    "code": "SFS3510",
    "subject": "SFS",
    "number": "3510",
    "honors": false,
    "writingIntensive": false,
    "name": "MPAs Mgmt Technqs & Policies",
    "fullname": "Marine Protected Areas: Management Techniques and Policies",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811391",
    "code": "SFS3520",
    "subject": "SFS",
    "number": "3520",
    "honors": false,
    "writingIntensive": false,
    "name": "Sustaining Trop Ecosystems",
    "fullname": "Sustaining Tropical Ecosystems: Biodiversity, Conservation, and Development",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "815058",
    "code": "SFS3530",
    "subject": "SFS",
    "number": "3530",
    "honors": false,
    "writingIntensive": false,
    "name": "Trop Marine Eco: Mntr & Mgmt",
    "fullname": "Tropical Marine Ecosystems: Monitoring and Management",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "825618",
    "code": "SFS3532",
    "subject": "SFS",
    "number": "3532",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndtns of Trop Marine Ecol",
    "fullname": "Foundations of Tropical Marine Ecosystems",
    "info": "The Turks and Caicos Islands (TCI) advertises itself to tourists as “Beautiful by Nature.” Indeed, the tourism that the country’s economy is heavily dependent on is driven by its stunning marine environment, which is characterized by extensive coral reefs, seagrass meadows and mangrove forests. However, the health of these ecosystems, and therefore the “Beautiful by Nature” motto, is under threat. At the local level, unsustainable and damaging fishing practices, increased water- based recreational activities, and coastal development are potentially major sources of disturbance.Furthermore, the ocean impacts of global climate change will continue to negatively affect marine organisms and ecosystem processes, adding an additional layer of complexity to the problem. Foundations of Tropical Marine Ecosystems: Monitoring and Management is an interdisciplinary three-week winter term course that highlights the ecological characteristics and current threats to coastal ecosystems, in addition to exploring existing and potential environmental managementapproaches that would encourage the sustainable development of small island nations such as the TCI. Course participants will gain knowledge of tropical marine ecosystem function and connectivity and will be introduced to the most pressing threats at the intersection of marine conservation and economic development. The course will take place on the island of South Caicos which is at a pivotal time in itsdevelopment. Until recently, the island’s economy centered around small-scale local fisheries, but tourism is now a growing industry and South Caicos is experiencing major changes to its social and structural fabric. As the economy and the population grow and diversify, so too do the demands on the marine environment, making this the perfect location to study a small, tropical island in transition.",
    "prereq": []
  },
  {
    "uid": "811392",
    "code": "SFS3540",
    "subject": "SFS",
    "number": "3540",
    "honors": false,
    "writingIntensive": false,
    "name": "Rainforest Mgmt Studies",
    "fullname": "Rainforest Management Studies in Australia and New Zealand",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811393",
    "code": "SFS3550",
    "subject": "SFS",
    "number": "3550",
    "honors": false,
    "writingIntensive": false,
    "name": "Rainforest Rsrch Field Technqs",
    "fullname": "Techniques for Rainforest Research in Australia",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "815059",
    "code": "SFS3560",
    "subject": "SFS",
    "number": "3560",
    "honors": false,
    "writingIntensive": false,
    "name": "Applied Marine Rsrch Technqs",
    "fullname": "Applied Marine Research Techniques",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "811394",
    "code": "SFS3570",
    "subject": "SFS",
    "number": "3570",
    "honors": false,
    "writingIntensive": false,
    "name": "Technqs Wildlife Fld Research",
    "fullname": "Techniques for Wildlife Field Research",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811395",
    "code": "SFS3580",
    "subject": "SFS",
    "number": "3580",
    "honors": false,
    "writingIntensive": false,
    "name": "E Himalayan Forests & Biodiv",
    "fullname": "Eastern Himalayan Forests and Biodiversity",
    "info": "The eastern Himalayan region is characterized by extensive and numerous mountains and valleys, hosting the world’s highest peaks and a diversity of vegetation and wildlife. Identified as one of the world’s ten biodiversity hot spots, the Kingdom of Bhutan is home to an estimated 770 species of birds and other diverse fauna, including the takin, snow leopard, golden langur, blue sheep, and tiger. Varied ecosystems are also found in the country, ranging from subtropical broadleaf forests in the south, to subalpine conifer forests, alpine shrub, and high-mountain meadows. The highest elevations comprise rock and ice. While located in the subtropics latitude-wise, Bhutan’s high altitude and mountainous terrain mean that its climate is more influenced by altitude than by latitude. The climate is dominated by summer monsoons which bring the majority of precipitation for the year. The country also has more than 70% forest cover and about 50% of Bhutan is under formal conservation protection.Bhutan is internationally famous for its development concept of Gross National Happiness (GNH). GNH is the guiding principle of development guides Bhutan through its four pillars: good governance, cultural protection and preservation, sustainable development, and environmental conservation. Across the country, people have developed and maintained rich cultural traditions and social and political institutions that reflect the Buddhist principle of ‘The Middle Path’, integrating people and nature as well as traditional knowledge systems and modern science. Sustainable management of natural resources, including soil, water, biodiversity, and minerals, is critical for Bhutan, as these resources are fundamental to the national identity as well as to the economy.In early 2008, Bhutan’s government became a democratic constitutional monarchy, opening the door for devolution of authority to regional governments and communities. Since the majority of the population reside in rural areas, sustainable management of natural resources is critical for achieving the dual goals of poverty alleviation and biodiversity conservation. Defining baselines for biodiversity and ecosystem function is critical and, coupled with training in field research methodologies and communication in science, scientists and environmental authorities are increasingly effective at achieving development and conservation goals.The SFS-Bhutan program is a field-based course where students study a country and region characterized by dramatic mountain landscapes and rich flora and fauna. Traveling through Bhutan, our SFS group will learn about Bhutan’s forests and biodiversity. They will also be exposed to the role which culture and religion plays in forest and biodiversity conservation. Students will stay in Bhutanese villages and trek across Himalayan landscapes to experience and understand local environments and rural livelihoods. Academically, students will develop skills in assessing environmental problems, defining research questions, conducting field research, and communicating results. Students will learn camera trapping, forest measurement techniques, and landscape reading skills. Moreover, SFS students will come to appreciate the complexity of identifying and addressing conservation and development issues in a rapidly changing region.SFS partners with the Royal University of Bhutan (RUB), College of Natural Resources (CNR), and the Bhutan Ecological Society (BES), a Civil Society Organization promoting environmental sustainability in Bhutan. SFS students and faculty will collaborate with RUB, CNR and BES to advance their research agenda in several priority areas, including forest management, biodiversity conservation, community resource assessment, climate change, and development policy.",
    "prereq": []
  },
  {
    "uid": "819207",
    "code": "SFS3601",
    "subject": "SFS",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Earth Systems/Climate Science",
    "fullname": "Earth Systems and Climate Science",
    "info": "This course focuses on the physical nature of landscapes and the geologic and seismic complexity of a region firmly situated along the ‘ring of fire,’ the edge of the Pacific Ocean basin where tectonic activity generates earthquakes and volcanic activity. On a planet whose surface is more than 70% ocean, we will also explore the important role of the oceans in the Earth Systems. We will study the science of climate past and current and the evidence for anthropogenic climate change.As we build our understanding of how the globe functions, we will consistently ground our learning with our location in Patagonia. From the base of Puerto Natales, many national parks are only kilometers away. Glaciers that belong to the Southern Patagonian Ice Field, the world’s second largest contiguous ice field outside the polar regions, will be visited. Chile’s dynamic Andes range – which is still growing – and the active volcanoes of the lakes region of Chile are open to discovery. Fragile forests susceptible to wildfire will be examined.One focus of this course will be the science of climate change, understanding the dynamics of the Quaternary Period (the time when periodic pulses of warm and cold influenced most earth systems; e.g., the ice ages) and the Anthropocene (the period where humans have begun to dominant earth systems). The Chilean Patagonia region, like other high-latitude regions, is hyper-susceptible to changes in climate, and the Southern Patagonian icefield is shown to be more vulnerable to climate change than other glaciers. Unpredictable rain- and snow-fall, glacial melt, temperature shifts, fires and droughts can wreak havoc on slow-growing plant ecosystems. Climatic shifts have effect on the trophic webs, freshwater catchments, and farming and ranching operations.Understanding the geosphere, biosphere, the cryosphere (the frozen environment) and their interactions, we will weave the study of human action and impact throughout Earth Systems: our food systems, energy systems, and the nexus of water/energy/agriculture and climate. Chile is where climate change can be observed and measured in palpable ways.",
    "prereq": []
  },
  {
    "uid": "811396",
    "code": "SFS3690",
    "subject": "SFS",
    "number": "3690",
    "honors": false,
    "writingIntensive": false,
    "name": "Rainforest Ecology",
    "fullname": "Rainforest Ecology",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "826008",
    "code": "SFS3691",
    "subject": "SFS",
    "number": "3691",
    "honors": false,
    "writingIntensive": false,
    "name": "Trop Biome Ecol & Climate Chg",
    "fullname": "Tropical Biome Ecology & Climate Change",
    "info": "In Tropical Biome Ecology & Climate Change, you will obtain a broad appreciation of the diversity and dynamics of tropical terrestrial & marine biomes. You will be introduced to the current and past distributions of tropical rainforests, dry forest, savannas and coastal biomes, their biodiversity, and their relationships with the abiotic environment, human use, present threats, and restoration practices. This course aims to bring together an understanding of the underlying ecological processes that affect different biomes with the role of human society in shaping the present and future rainforests of the Wet Tropics & the coral reefs of the Great Barrier Reef. The course will take the rainforest Australian Wet Tropics & the coral reefs of the Great Barrier Reef (GBR) as case studies to investigate this field, yet many of the skills you learn here can be transferred to other systems. Topics covered will include: biophysical determinants vegetation and coral reef distribution; past, present, and future threats to Wet Tropics rainforests & GBR; and the theory and practice of rainforest and coral restoration.The course also has a practical component. You will be taught field techniques for carrying out field research, data analysis, and communication of results.",
    "prereq": []
  },
  {
    "uid": "811397",
    "code": "SFS3700",
    "subject": "SFS",
    "number": "3700",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles of Forest Mgmt",
    "fullname": "Principles of Forest Management",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "826009",
    "code": "SFS3701",
    "subject": "SFS",
    "number": "3701",
    "honors": false,
    "writingIntensive": false,
    "name": "Wildlife & Conservatn Biology",
    "fullname": "Wildlife and Conservation Biology",
    "info": "This component of the program focuses on identifying threats to wildlife populations, how to obtain data on the impact of these threats on wildlife populations and how to select and apply appropriate conservation methods to mitigate these threats. We will look at these aspects in general and then demonstrate them in case studies of species in the Wet Tropics. To formulate a background understanding of habitats of the Wet Tropic’s wildlife, we will explore the origin of the main landscape formations of this part of Australia by looking at geological and biogeographical factors that shaped the landscape and its biota. You will be introduced to Australia’s flora and fauna and the unique species that inhabit the diverse habitats of the Wet Tropics. We then will deal with some basic ecological concepts of biodiversity and why so many species can co-exist in one place. This will also involve learning skills to obtain data on various parameters of wildlife populations to assess the impact of habitat loss, fragmentation, introduced species and climate change on them. Field trips and field work in various parts of the Atherton Tablelands will help you in learning these skills.Using the obtained data on wildlife populations we will explore various conservation techniques in order to mitigate these threats to the flora and fauna of the Wet Tropics, how to identify partners and resources for conservation work, how to triage conservation needs, and how to best advocate conservation. We will consider the role of corridors or landscape linkages, particularly along riparian areas, and ways in which restoration and landscape rehabilitation can overcome negative effects of human driven landscape modification and climate change on these ecosystems. We will consider options on how to efficiently control pest animals and their impacts on native flora and fauna.",
    "prereq": []
  },
  {
    "uid": "811398",
    "code": "SFS3710",
    "subject": "SFS",
    "number": "3710",
    "honors": false,
    "writingIntensive": false,
    "name": "Techniques Wildlife Mgmt",
    "fullname": "Techniques in Wildlife Management",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811399",
    "code": "SFS3720",
    "subject": "SFS",
    "number": "3720",
    "honors": false,
    "writingIntensive": false,
    "name": "Wildlife Ecology",
    "fullname": "Wildlife Ecology",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "826770",
    "code": "SFS3721",
    "subject": "SFS",
    "number": "3721",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecology of Endangered Wildlife",
    "fullname": "Ecology of Endangered Wildlife",
    "info": "This course will provide students with in-depth understanding on a) key factors which trigger significant decline in populations of wildlife species and how this makes them vulnerable to extinction processes, b) role of ecology or biology in enhancing conservation and management of species that are of conservation concern, c) ecology and behavior of selected species that are of conservation concern such as the savannah elephant, Rothschild giraffe, cheetah, African wild dog, African lion, and black rhino, and d) role of technology in management and conservation of wildlife species that are of conservation concern (e.g. radio telemetry, drones, genetic mapping and analysis, embryology, captive breeding etc.). During the course, students will learn and apply in the field multiple approaches and techniques to studying the ecology and behavior of selected wildlife species which are of conservation concern in Kenya. They will also explore the application of ecological principles and concepts in enhancing conservation and management of wildlife species. Selected field exercises and field-based experiential hands-on learning sessions will be used to impart the expected learning and skills of the course. The course will be done in key wildlife and biodiversity conservation landscapes in Kenya, mainly:1. Amboseli region/ecosystem, situated in Southwest Kenya, along the Kenya-Tanzania borderland is a key African savannah elephant conservation landscape in the country. The population is one of the few elephant populations in the country that has fully recovered from the devastatingeffects of poaching in the 1970s and early 1980s. However, the landscape is rapidly getting transformed into a human-dominated environment posing a huge threat to conservation of wildlife including elephants, lions, cheetah etc. It's noteworthy that rampant poaching exterminated black rhinos in the Amboseli ecosystem, and to date this is still a big concern among conservationists.2. Maasai Mara ecosystem, which lies contiguous to the Serengeti N. Park in the Northern part of Tanzania, and it’s a key tourist destination in Kenya and East Africa. It’s home to endangered and iconic species including the African lion, elephant, cheetah, and black rhino, which frequently move between Maasai-Mara and Serengeti N Park. This presents an opportunity to examine cross-border collaboration and challenges in conservation of endangered species. Unethical tourism in Maasai Mara national reserve has direct ecological and demographic negative impacts on cheetah and lion conservation. However, the region has the best and highest number of community conservancies, and this presents an opportunity to examine the role of communities in conservation of endangered species.3. Lake Nakuru National Park, in Rift Valley is the first protected area in Kenya to be completely fenced due to massive human development and land use changes in its environs. It’s therefore ecologically an “island,” but it’s one of the best performing sanctuaries in the country especially for conservation and breeding of Rothschild giraffe, black and white rhino. This presents an opportunity to examine ecological opportunities and challenges of using sanctuaries to enhance recovery and conservation of these endangered species. Laikipia landscape in Central Kenya is one of the pillars of wildlife conservation in the country and is home to several endangered species like Africa elephant, lion, cheetah, bongo, grevy zebra, and the African wild dog. The largest populations of black and white rhinos in the country are also found in the region, and it has the second largest population of elephants. In addition, the region has numerous private conservancies which play a major role in wildlife conservation, including conservation of several endangered species. Land tenure in Laikipia is embedded in Kenya’s colonial history and therefore adds a different political debate in the conservation of endangered species.",
    "prereq": []
  },
  {
    "uid": "811400",
    "code": "SFS3730",
    "subject": "SFS",
    "number": "3730",
    "honors": false,
    "writingIntensive": false,
    "name": "Tropical Marine Ecology",
    "fullname": "Tropical Marine Ecology",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811401",
    "code": "SFS3740",
    "subject": "SFS",
    "number": "3740",
    "honors": false,
    "writingIntensive": false,
    "name": "Forest Ecology & Resource Mgmt",
    "fullname": "Tropical Forest Ecology and Resource Management",
    "info": "The Principles of Resource Management (PRM) course in the Tropical Island Biodiversity Studies (TIBS) program introduces students to the tools required to understand and manage tropical forestecosystems. The course covers basic principles in forest structure and dynamics, biodiversity patterns, relationships between different organisms, interactions between biotic and abiotic factors, and the importance of neotropical forests worldwide. These concepts will set the fundamentals to understanding the ecological processes in soil productivity, nutrient recycling, tropical biodiversity and climatic cycles. This component of the academic program links some principles of tropical ecology and resource management with the Tropical Coastal Ecology (TCE) course as well. Conceptual materialfocuses on biodiversity, tropical resources, evaluation of water and soil resources, habitat modification, terrestrial protected areas and pollution.Throughout the course, lecture materials, extensive field activities and laboratories will present local issues in resource use, resource exploitation, and resource management, which are important to the environmental and social well-being of the Bocas del Toro region. Gaining an appreciation for the ecology, resource management, and environmental policies of the Bocas del Toro region should provide students with a working knowledge on a broad range of approaches to conservation and research of tropical natural resources. During the semester, discussions and analyses will then be framed by twomajor subjects, each of which will address using specific local examples: 1) Principles of tropical ecology and 2) Principles of resource management.",
    "prereq": []
  },
  {
    "uid": "826800",
    "code": "SFS3741",
    "subject": "SFS",
    "number": "3741",
    "honors": false,
    "writingIntensive": false,
    "name": "Princ. of Marine Resource Mgmt",
    "fullname": "Principles of Marine Resource Management",
    "info": " This course is intended to introduce the disciplines and tools required to understand and manage marine resources. This component of the academic program at the Center for Marine Resources Studies (CMRS) makes the link between Marine Ecology and Marine Conservation Governance. Topical areas include fisheries management, marine conservation, ocean pollution management, marine protectedareas, coastal zone management, and strategies for sustainable development. ",
    "prereq": []
  },
  {
    "uid": "826987",
    "code": "SFS3742",
    "subject": "SFS",
    "number": "3742",
    "honors": false,
    "writingIntensive": false,
    "name": "Prin. of Natural Resource Mgmt",
    "fullname": "Principles of Natural Resource Management",
    "info": "The tropics are globally known for their abundant natural resources. For instance, more than half of the world's biodiversity is found in tropical forests, which are considered biodiversity hotspots among terrestrial ecosystems (Mittermeier et al., 2011; Pillay et al., 2022). However, in this biogeographic region increased land use intensification (e.g. industrial agriculture, urban expansion) has resulted in environmental degradation, forest fragmentation and habitat loss, threatening the long-term functioning of ecosystems and the services they provide (Tabarelli, 2004; Alroy, 2017, de Oliveira et al., 2018). It is critical to implement management strategies that allow for the proper use of natural resources, while also ensuring the equity among the actors involved and maintaining ecosystem functionality.Traditionally, environmental management has assumed that natural resources are static systems, so human intervention must be regulated to maintain their stability. Given the global scale of environmental problems (e.g. climate change) this approach may be unrealistic. As an alternative, natural resource managers have proposed new theories based on the concept of resilience (Benson & Garmestani, 2011). Resilience can be defined as the system’s ability to absorb internal and/or external change and recover while maintaining long-term functionality (Holling 1973; Benson & Garmestani, 2011). Thus, management of natural resources can focus on identifying key aspects of ecosystems that contribute to their resilience, while also acknowledging the possibility for change and providing a framework for developing adaptive capacity in social and ecological systems (Gunderson et al., 2010). While this approach provides new ways of thinking about social and ecological systems, it also implies modifications to the legal framework and management strategies that are already implemented, which can be challenging, especially in tropical countries such as Costa Rica. The relationship between water source protection and conservation of biodiversity has not been explored in Costa Rica, although forest fragments associated with water protection may serve as refuge for a diverse array of organisms, connecting forested areas and contributing to gene flow (Bogoni et al., 2020). Understanding these processes is critical for identifying key aspects of ecosystems that contribute to their resilience, ensuring their long-term functioning, which are specially threatened outside protected areas, where the landscape is dominated by forest patches embedded in agricultural and urban matrices (Morera et al., 2018; Stan and Sánchez-Azofeifa, 2019). It is essential to expand natural resource management to areas that are not legally protected and where wildlife-human interactions are more likely to occur. Proper management of these resources can help preserve species in a changing landscape while also strengthening the adaptive capacity in social and ecological systems.This inter-disciplinary course focuses on principles and applications of natural resources management, exploring alternative ways to ensure equity among the stakeholders involved in the use of these resources while sustaining social and ecological resilience. The course will introduce the challenges faced by managers of natural resources at the global level, with emphasis on Costa Rica, within the context of a fragmented landscape, agriculture, and urban expansion. Based on specific case studies, illustrated during classes and field trips, the course will show concepts and tools used for addressing complex environmental issues such as mammal conservation, solid waste management, and water management problems.",
    "prereq": []
  },
  {
    "uid": "818577",
    "code": "SFS3751",
    "subject": "SFS",
    "number": "3751",
    "honors": false,
    "writingIntensive": false,
    "name": "Wildlife and Nat Res Mgmt",
    "fullname": "Techniques in Wildlife and Natural Resource Management",
    "info": "Globally, most natural resources face enormous pressure from multiple direct and indirect  human activities, with delirious consequences for humans and natural life. Further, most of the  resources are limited, and thus easily prone to any disturbance by humans. In this regard, a lot  of effort has gone to promote sustainable utilization of natural resources with emphasis on  minimizing damaging human activities and overexploitation. Most parts of East Africa, Kenya  included are dominated by Savanna or rangeland environments which are naturally dry for most  of the year due to scanty annual rainfall. However, these are the same landscapes where diverse biota endowments are found but which are currently under siege and near extermination by  rapid human population growth and unregulated land-use changes.  The Amboseli Ecosystem is characterized by a semi-arid environment, and rainfall is received  twice a year but it’s scarce, unpredictable and low (300-800mm per year). This creates a water  deficient landscape, and most of the water is found in scattered rivers, streams, springs, and  wetlands like swamps, all linked to the hydrology of the neighboring Mt. Kilimanjaro. These  conditions tend to favour wildlife conservation and pastoralism, the latter being the historical key land use by the local pastoral Maasai people. However, immigration into the region by  agricultural communities starting in the 1960 through the 1980s saw introduction of farming as  a new land use along the wet and arable slopes of Mt. Kilimanjaro along the Kenya-Tanzania border. Thereafter, irrigated agriculture mostly for commercial purposes was introduced in the  water systems of the Maasai Group Ranches where rain-fed farming is not possible. This lifestyle  shift has seen pastoralism nearly replaced and dominated by agro-pastoralism among the  Maasai.  Today, the dominant human activities, mostly irrigated farming and livestock in the Maasai group  ranches and the former Kimana Group Ranch keeping rely on the springs and rivers emanating  from Mt. Kilimanjaro. The wildlife ecological dynamics in the ecosystem is also entirely  dependent on these wetlands, which are the predominant dry season concentration areas as  water and forage resources elsewhere diminish. Consequently, management of water resources  is a major conservation and livelihood issue. Often there are conflicts associated with water use  among humans and between humans and wildlife, which is attributed to diminished availability  of this vital resource. Resolving these conflicts and promoting wise use of available water  resources is a major preoccupation of wildlife and natural resources managers in the area, Water  Resource Users Associations (WRUAs) and the Water Resources Authority (WRA), the lead Kenya Government agency on water management.  The Amboseli Ecosystem lies contiguous to the Tsavo West and Chyulu Hills National Parks which are part of the Tsavo Conservation Area, the largest wildlife conservation landscape in Kenya. Chyulu Hills was gazetted as a protected area in 1983 to enhance protection of its wildlife  resources and watershed services. It’s recognized as one of the important water catchment areas  situated in the dry lands of the country and provides water to a vast landscape and diverse  beneficiaries including Mombasa County. However, this service is threatened by destruction and general environmental degradation of the hills by livestock grazing, charcoal burning, and accidental fires. Neighboring the Chyulu Hills N. Park is the expansive Tsavo West N. Park, which  covers more than 9,000Km, and it’s one of the important wildlife conservation areas in the  country. Prior to its gazettement as a protected area in 1948, the area was used by pastoral  communities like the Maasai. Over the years, human population and land use changes especially farming, adjust the park boundaries have increased significantly. This has led to escalation of human-wildlife..",
    "prereq": []
  },
  {
    "uid": "826769",
    "code": "SFS3752",
    "subject": "SFS",
    "number": "3752",
    "honors": false,
    "writingIntensive": false,
    "name": "Endangered Species Conservatn",
    "fullname": "Endangered Species Conservation",
    "info": "Conservation and management efforts in resource management dates back in 19th century with utilitarian principles. Utilitarian conservation advocated for renewable resources that were to be managed in a way that they are not to be exhausted. Species diversity in terrestrial and aquatic ecosystem comprise the majority of the living organisms. We are faced with large contemporary extinction of species, degradation of ecosystems, fragmentation of remaining indigenous vegetation and uncertain fates for many species. It is worth noting that resources that are available to conserve biodiversity must be utilized efficiently. Efficient management is particularly important because current utilization is estimated to be insufficient to conserve the world’s biodiversity.Conservation and management decisions are required for many different circumstances, such as decisions about whether species should be listed as threatened, choosing from a set of management strategies for those species, allocating resources such as land, supplemental feeds, or permitting development. Determining search effort for threatened species requires knowledge about the system being managed, the efficacy of actions, and constraints.Management of threatened and endangered species requires decision making in the face of uncertainty. Foremost, understand the decision context of threatened species management and understand how to make decisions when we do not know everything about them. Effective conservation management relies on managers and conservationists specifying the goals, the threats and opportunities, and alternatives set of management actions available and how they influence vulnerable and endangered species conservation. The overall goal of the Endangered species conservation course will be to provide students with in-depth understanding on the landscape dynamics of East Africa Savanna Ecosystems and their contribution on vulnerability of wildlife species. It will develop interest in and bring an understanding ofthe management and conservation efforts regionally and in Kenya, and how Kenya has exerted its conservation efforts in conservation of vulnerable species. Students will have a chance to learn and apply field techniques and approaches to assess and monitor different species that have been classified as vulnerable. A comparative approach to different management systems will be used to determine the effectiveness of species management locally, regionally, and globally. Students will practice the classification criteria for species in the ecosystem. Aspects learned on the course will also be applied to meet the needs and objectives of the Directed Research. ",
    "prereq": []
  },
  {
    "uid": "811402",
    "code": "SFS3770",
    "subject": "SFS",
    "number": "3770",
    "honors": false,
    "writingIntensive": false,
    "name": "Trop Ecol & Sustainable Dev",
    "fullname": "Tropical Ecology and Sustainable Development",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "826803",
    "code": "SFS3771",
    "subject": "SFS",
    "number": "3771",
    "honors": false,
    "writingIntensive": false,
    "name": "Trop Ecol & Ecosyst Resilience",
    "fullname": "Tropical Ecology and Ecosystem Resilience",
    "info": "The clearing of the world’s forests has created habitat fragmentation and caused a considerable number of species extinctions. Increasingly fragmented populations succumb to the demographic and genetic consequences associated with small population sizes. It is estimated that between 3,000 and 30,000 species are going extinct every year based on rates of forest habitat loss and estimates of global biodiversity. This is particularly true for tropical regions where biodiversity is highest. The drivers of forest loss are complex and operate across a variety of geographic and socio-political scales. In addition, the ongoing global climate change is altering the phenology of many species and inducing shifts in species geographic range. These ecological alterations act synergistically with other anthropogenic factors (e.g., hunting, urban development, pollution, etc.) thus accelerating the rate of species extinction. Therefore, it is critical for tropical communities to be resilient to those changes, and adapt to the Anthropocene; we also need to analyze those examples of success or understand what factors facilitate the healing of natural systems. Developing countries have different development models that directly or indirectly affect the environment, biodiversity, and ecosystem services. Costa Rica took a major shift from an agriculture-based economy to a service-based, environmentally-friendly economy. For instance, the ecotourism industry is supported by a network of protected areas that form the national system of conservation areas. However, the downside of ecotourism development brings an increase in infrastructure, such as roads andresorts that cause environmental alteration. In addition, emerging diseases, invasive species, biodiversity loss, and climate change are modifying the communities of organisms in tropical areas as Costa Rica. Our next goal is not just understanding the level of those affectations but to monitor how tropical ecosystems can be resilient to those rapid changes. Many of these negative impacts can be avoided or mitigated, or resilience-regeneration processes can be facilitated, if the necessary knowledge of the interacting ecological processes and human activities is acquired.Modern science, including conservation biology and applied ecology, is a multidisciplinary effort with a significant social impact. The construction of a sustainable future and resilient ecosystems will depend on a multidisciplinary approach to understand and solve conservation problems. This understanding ought to be based on solid ecological information, especially in tropical ecosystems where the diversity of life forms and biological interactions are complex, and where social and economic challenges are daunting. Thus, in order to have an understanding of the current ecological problems and to look for potential solutions to those problems, we will study the main following themes: a) tropical forest dynamics, b) the origin of tropical diversity, c) mechanism of species extinction, d) assessment and use of biodiversity, e) ecosystem dynamics and human-initiated disturbances (ecological consequences of infrastructures and forest fragmentation), f) climate change and tropical forest dynamics, g) the ecology of emerging diseases and invasive species, e) panarchy applied to ecosystem resilience and circular economy. We will do this through lectures, group discussions, field trips, and field research. In this integrated multidisciplinary program, the students will examine the negative impacts of development on the ecosystems in various parts of Costa Rica and Panama and evaluate cases of effective conservation and management practices.",
    "prereq": []
  },
  {
    "uid": "819208",
    "code": "SFS3781",
    "subject": "SFS",
    "number": "3781",
    "honors": false,
    "writingIntensive": false,
    "name": "Patagonian Ecology",
    "fullname": "Patagonian Ecology",
    "info": "This course focuses on ecology as a discipline, biodiversity, and the Patagonian ecoregions and habitats that have evolved with short growing seasons, tenacious southwesterly winds, and fierce winters. We will examine the ecology and evolution of faunal species such as Guanaco (related to the llama), Magellanic and King penguins, and the flightless Rhea, most of them endemic to the region, and the largest animal of them all, the Blue Whale. We will explore ecological succession, including primary succession, which is how life recruits into new environments, such as bare rock after glacial retreat, or new, igneous rock after volcanic eruption. Though flora is not particularly diverse here in southern Patagonia (save for the lichens and bryophytes), the floral structural complexity is fascinating.We will explore a remarkable latitudinal gradient—from Cape Horn in the south to Chiloé Island’s milder, temperate climate—a latitudinal change equivalent to traveling from Massachusetts to Florida. Thematically, we will traverse alpine ecology, exposed terrestrial ecology, coastal ecology, marine ecology, and fire ecology. From the central focus on the theory and practice of ecology, we will expand to investigate relationships between people and nature in conservation, resilience, and environmental challenges. We will explore the role of protected areas in conservation, including private protected areas that have emerged in Chile; invasive species; human history on landscapes; agriculture, plantation forests, and aquaculture; and current and predicted changes due to climate change.The course is constructed so that the lens of climate shifts and perturbations will be central to discussions and observations; it will encompass not only climate threats, but an understanding of the role of nature in climate adaptation and mitigation, and the role of Chilean climate policy and commitments in an international community.",
    "prereq": []
  },
  {
    "uid": "825619",
    "code": "SFS3782",
    "subject": "SFS",
    "number": "3782",
    "honors": false,
    "writingIntensive": false,
    "name": "Fndtns of Patagonian Ecol",
    "fullname": "Foundations of Patagonian Ecology",
    "info": "This course focuses on ecology as a discipline, biodiversity, and the Patagonian ecoregions and habitats that have evolved with short growing seasons, tenacious southwesterly winds, and fierce winters. We will examine the ecology and evolution of faunal species such as guanaco (related to the llama), Magellanic penguins, and the flightless ñandúes, most of them endemic to the region. We will exploreecological succession, including primary succession, which is how life recruits into new environments, such as bare rock after glacial retreat. Thematically, we will traverse alpine ecology, rangeland ecology, coastal ecology, and fire ecology. From the central focus on the theory and practice of ecology, we will expand to investigate relationships between people and nature in conservation, resilience, and environmental challenges. We will explore the role of protected areas in conservation, invasive species,human-landscape interactions, and current and predicted changes due to climate change.",
    "prereq": []
  },
  {
    "uid": "811403",
    "code": "SFS3790",
    "subject": "SFS",
    "number": "3790",
    "honors": false,
    "writingIntensive": false,
    "name": "Tropical Coastal Ecology",
    "fullname": "Tropical Coastal Ecology",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811404",
    "code": "SFS3800",
    "subject": "SFS",
    "number": "3800",
    "honors": false,
    "writingIntensive": false,
    "name": "Conserv Sci & Practice in Peru",
    "fullname": "Conservation Science and Practice in Peru",
    "info": "The overarching goal of this course is to make students aware of the enormous responsibility and challenges humans have as stewards of the natural environment and to provide them with the concepts, tools, and incentives for conservation of natural environment. Dramatic changes are occurring in almost every corner of the world, many of which are a result of anthropogenic disturbances. Human activities release many greenhouse gases that contribute to climate change. Humans are overexploiting natural resources, polluting ecosystems, introducing exotic species into ecosystems, and causing habitat destruction at such a high rate that many scientists think that we have entered the sixth mass extinction of life on Earth. The fate of millions of species is dependent on actions that we take in the next few decades.Adopting an integrative view of the relationship between biodiversity and people, this course explores the concepts and strategies currently used to mitigate, restore, or conserve ecosystems, species, and genetic diversity. Using the Peruvian Amazon and Andean Highlands as our classroom, the course will draw largely from local examples that students will be able to observe first-hand. Furthermore, it will challenge students to integrate and apply their tropical and political ecology knowledge in conservation in order to respond creatively to real-world cases.The focus of the course is based largely on field activities that build on three core questions that will be answered in a series of lectures, videos, and readings:1. What is Conservation Science?2. What are the challenges in conservation science?3. What are the current tools and strategies used in the practice of conservation science?The conservation challenges that students will observe in the Amazonian and Andean regions are highly varied and many are repeated across the globe. Therefore, students will be encouraged to critically examine and document a wide variety of threats and learn to apply their theoretical knowledge to resolve complex real-world issues. Moreover, students will be able to draw parallels between Peruvian conservation strategies and those used globally by international agencies. The diversity of challenges and conservation strategies students observe in Peru will provide insight into the complexity of Conservation Science and the importance of treating these challenges within their own context by considering biological, environmental, social, economic, and political factors.",
    "prereq": []
  },
  {
    "uid": "826988",
    "code": "SFS3801",
    "subject": "SFS",
    "number": "3801",
    "honors": false,
    "writingIntensive": false,
    "name": "Cons. Sci. & Practice Cambodia",
    "fullname": "Conservation Science & Practice in Cambodia",
    "info": "The field of conservation is focused on protecting biological diversity, including ecosystems, species, and genes, through promoting processes, both ecological and social, that support biodiversity. Conservationscience is by nature an interdisciplinary field, where concepts and research in ecology, environmental science, taxonomy, and evolution inform the practical applications of social, economic, and political sciences. Conservation is as much about managing wildlife as it is about managing people. Dramatic changes are occurring in almost every corner of the world; many changes are anthropogenic – caused by \"us.\" Our activities are changing atmospheric gases and contributing to climate change. We are overexploiting natural resources, polluting ecosystems, and causing habitat destruction at such a high rate that many scientists believe that we have entered the sixth mass extinction of life on Earth. The overarching goal of this course is to make students aware of the enormous responsibility humans have as stewards of the natural environment, and to provide them with the concepts, tools, and incentives to affect conservation of the natural environment.While Cambodia is developing rapidly, its biodiversity is being degraded at an alarming rate. Even though this country supports tremendous biodiversity, biological data is very limited. Biodiversity cannot be effectively conserved without understanding current environmental status, fundamental ecological relationships, and the effectiveness of conservation approaches. This kind of knowledge is urgently needed for sustainable biodiversity conservation in this region. There are numerous conservation initiatives and efforts, however, often these are short term and the outcomes have not been evaluated.This course will provide background information on the current status and trends of biodiversity, knowledge on ecological concepts, and tools to assess conservation approaches. While the course will expose students to broad issues that face the entire planet, we will focus on practical aspects of the course on local case studies. Students will learn concepts in conservation science, both theoretical and practical, from lectures and field trips. Throughout the semester, students will be exposed to a wide range of local conservation practices through discussions, direct observations, and assessments of various conservation programs that are being implemented and co-managed by diverse stakeholders including: government agencies, private companies, local and international organizations, and villagers.The course will provide students with a background to engage in the \"conservation conversation.\" By undertaking field trips to various conservation project sites, students gain first-hand information aboutdifferent conservation challenges and approaches from diverse stakeholders such as decision makers, park rangers, educators, and conservation activists who are active in the conservation field in Cambodia. ",
    "prereq": []
  },
  {
    "uid": "811405",
    "code": "SFS3810",
    "subject": "SFS",
    "number": "3810",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecosystems and Livelihoods",
    "fullname": "Ecosystems and Livelihoods",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811406",
    "code": "SFS3820",
    "subject": "SFS",
    "number": "3820",
    "honors": false,
    "writingIntensive": false,
    "name": "Envtl Ethics & Development",
    "fullname": "Environmental Ethics and Development",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "826801",
    "code": "SFS3821",
    "subject": "SFS",
    "number": "3821",
    "honors": false,
    "writingIntensive": false,
    "name": "Justice, Resilience, & Envir.",
    "fullname": "Justice, Resilience, and the Environment",
    "info": "Justice, Resilience, and the Environment (JRE) explores the concepts of justice, conflict, and social change within the Costa Rican context. Costa Rica is renowned for its significant efforts in forest regeneration and biodiversity protection. Tourism campaigns to highlight the tropical wonders often obscure the struggle between human development goals and the rights of nature. We will examine the connection between postcolonial practices and current development strategies to better understand Costa Rica’s efforts to protect people’s rights while honoring the rights of nature.This course assesses community attempts to resist existing structural and institutional arrangements and encourage social change to better meet human needs in balance with the environment. We will see how groups create accountability through grassroots knowledge and power in Costa Rica, locating theory in concrete examples. We will analyze key themes of resilience-building including indigenous land rights struggles, agroecological production, seed sovereignty, and agrotourism.Working with community stakeholders, students will conduct first-hand analysis of social issues. They will develop skills essential to future advocacy, community organization and the insights necessary for social change. Projects will examine the significance of social research in struggles for social justice. Field experiences in this course include working with indigenous communities, regenerative farmers, and communities tackling waste management issues. Students will conduct quantitative and qualitative research to prepare written, oral, and visual presentations that reflect their understanding of justice and social change. This fieldwork will prepare students for a final directed research project on the intersection of social and environmental justice challenges.",
    "prereq": []
  },
  {
    "uid": "811407",
    "code": "SFS3831",
    "subject": "SFS",
    "number": "3831",
    "honors": false,
    "writingIntensive": false,
    "name": "Tropical Ecology of the Amazon",
    "fullname": "Tropical Ecology of the Amazon",
    "info": "The term biodiversity refers to the variety of life on Earth at all its levels, from genes to ecosystems. Ecology is the scientific study of interactions of organisms with one another and with the physical and chemical environment around them. In this course Tropical Ecology of the Amazon we will be looking at the biodiversity of the region and the processes that originate and sustain it at multiple scales: regional, landscape, ecosystem, habitat, communities, and species. The overarching goal of this course is for students to be able to identify and characterize the diversity of non-human life in the Amazon region, and to understand the patterns and processes that support this diversity. Students will learn the fundamental principles of ecology through studying a diverse mosaic of ecosystems, habitats, and species along elevation gradients, succession gradients, and geomorphic features.",
    "prereq": []
  },
  {
    "uid": "811408",
    "code": "SFS3840",
    "subject": "SFS",
    "number": "3840",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Ecology of Peru",
    "fullname": "Political Ecology of Peru",
    "info": "This course aims to provide students with critical thinking tools to examine environmental problems and acknowledge that political circumstances are the foremost driver. This course will identify underlying conditions for many current and previous socio-environmental crises and the leading research-driven approaches in political ecology. Political ecology (PE) is not a discipline per se but an interdisciplinary field that enhances our understanding of complex environmental situations. Thus, PE is as complex as our relationship with nature.Political ecology in recent years has become a relevant strategy to include politics in an apolitical context. Consequently, social and natural environment/conservation issues are brought together in a political context—conservation governance, protected areas, and community-based natural resource management. Moreover, it is a field of critical research. Political ecology research broadens the perspective of an environmental crisis/situation and focuses on the study of interdependence among political units and their environment. Therefore, this course will revisit concepts and debates about power inequality, production systems, knowledge, and discourse. PE focuses on how previous economic/political events influenced contemporary environmental crises. Additionally, this course will provide an overview of the most common methods in anthropology used by political ecologists. These methods will demonstrate the interdisciplinary nature of political ecology and the capacity to draw upon other fields to address its research questions. By the end of this course, the students will be able to provide solid arguments for why the Andes-Amazon region is a political space. They will be able to identify political circumstances shaping the current landscape and internalize that conservation is a dynamic and complex system. Students will recognize that politics, within its distinct scales, is the primary driver of ecological transformations. This course will complement its content and learning objectives from other courses dictated during the semester, such as Tropical Ecology, Conservation Science, and Culture and Language.",
    "prereq": []
  },
  {
    "uid": "819999",
    "code": "SFS3911",
    "subject": "SFS",
    "number": "3911",
    "honors": false,
    "writingIntensive": false,
    "name": "Fundamentals of Env. Inquiry",
    "fullname": "Fundamentals of Environmental Inquiry",
    "info": "Research takes many forms. Though the SFS model emphasizes field-based methodologies, there is much to be learned in those aspects of research that lie beyond the fieldwork: building a robust question, vetting sources of information to produce a high-quality literature review, placing novel inquiry within a theoretical and empirical context and analyzing existing data to create a strong discussion of the research question. The aim of this course is to provide students the opportunity to explore existing Center resources and develop methods of inquiry to analyze environmental issues relevant to the communities in which we operate. We will investigate the ways that various methods and theories distinguish (or not) fact from interpretation, cause from correlation, and advocacy from objectivity. Through their research projects, students will contribute to a growing body of scientific research that informs local conservation and resource management decisions near SFS Centers around the world.Each student will be led by a faculty advisor that will produce research questions and methods, analyze data, and communicate results in one or across several of the following disciplines: ecology, conservation, earth sciences, natural resource management, anthropology, human geography, and environmental policy. All FEI projects are collaborative in process, but individual in outputs. Depending on the project, students may work together on the development and analysis of questions, but individual students must submit final assignments independently. The course is designed to build on the information students have learned in their disciplinary courses at each Center.  In addition, faculty will provide lectures and workshops specifically designed to assist students in understanding the scientific process and presenting results in both written, spoken, and visual formats. ",
    "prereq": []
  },
  {
    "uid": "811409",
    "code": "SFS4910W",
    "subject": "SFS",
    "number": "4910",
    "honors": false,
    "writingIntensive": true,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "811410",
    "code": "SFS4930",
    "subject": "SFS",
    "number": "4930",
    "honors": false,
    "writingIntensive": false,
    "name": "Rsrch Technq Twd Sustnabty",
    "fullname": "Applied Research Techniques and Strategies Toward Sustainability in Costa Rica",
    "info": "Study abroad course.",
    "prereq": []
  }
]