[
  {
    "uid": "812116",
    "code": "SNGL1001",
    "subject": "SNGL",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning French I",
    "fullname": "Beginning French I",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812117",
    "code": "SNGL1002",
    "subject": "SNGL",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning French II",
    "fullname": "Beginning French II",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812120",
    "code": "SNGL1003",
    "subject": "SNGL",
    "number": "1003",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate French I",
    "fullname": "Intermediate French I",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812121",
    "code": "SNGL1004",
    "subject": "SNGL",
    "number": "1004",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate French II",
    "fullname": "Intermediate French II",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812122",
    "code": "SNGL1101",
    "subject": "SNGL",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Wolof",
    "fullname": "Beginning Wolof",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812123",
    "code": "SNGL3001",
    "subject": "SNGL",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Senegal: Culture and Society",
    "fullname": "Senegal: Culture and Society",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812124",
    "code": "SNGL3002",
    "subject": "SNGL",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Entrepreneurship & Marketplace",
    "fullname": "Entrepreneurship & Marketplace",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812125",
    "code": "SNGL3015",
    "subject": "SNGL",
    "number": "3015",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced French I",
    "fullname": "Advanced French I",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812126",
    "code": "SNGL3016",
    "subject": "SNGL",
    "number": "3016",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced French II",
    "fullname": "Advanced French II",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812127",
    "code": "SNGL3101",
    "subject": "SNGL",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Wolof",
    "fullname": "Intermediate Wolof",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "812128",
    "code": "SNGL3102",
    "subject": "SNGL",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Wolof",
    "fullname": "Advanced Wolof",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "uid": "817047",
    "code": "SNGL3201",
    "subject": "SNGL",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Language Current Events",
    "fullname": "Advanced Language Through Current Events",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "817429",
    "code": "SNGL3202",
    "subject": "SNGL",
    "number": "3202",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading Writing Current Events",
    "fullname": "Reading and Writing through Current Events",
    "info": "This course is a continuation of SNGL 3201, Advanced Language through Current Events. Students examine contemporary issues in Senegal through the lens of Senegalese newspapers, journals, films, radio, and TV broadcasts. ",
    "prereq": []
  },
  {
    "uid": "825447",
    "code": "SNGL4001",
    "subject": "SNGL",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev: Human Rights",
    "fullname": "International Development: Human Rights: Policy, & Practice",
    "info": "The Political Economy of International Development (PIED) critically explores the role of the international development agenda, with a specific focus on its impact on the African continent. Students will acquire knowledge on the foundation of this agenda while capturing the complexity and paradoxes of its implementation. Students will also build on this understanding to analyze the power relationships at stake between the various actors (donors, governments, international institutions, development beneficiaries, private sector, etc.). Grounded in a theoretical approach, this course will nevertheless explore practical case studies and experiences to favor in-depth analysis.This course will dedicate particular attention to the social experiences of the populations in developing countries from a political and historical perspective. Furthermore, students will be better inclined to critically appreciate the contribution of institutional mechanisms in the bi-lateral, multilateral, and non-government sectors in the development of Sub-Saharan African nations. Students will examine multidisciplinary ways of thinking that can be used to synthesize and analyze local, national, and global issues, and the connections among these experiences.Students will then examine constructs of human rights and services in developing countries in general and Senegal in particular. As background to the course, we will attempt to create a common understanding of key concepts such as human rights, social justice, human services, social services, social welfare, community development, and social work.  Students will then look at how these ideals are implemented in Senegal and the limitations and challenges of the implementation.",
    "prereq": []
  },
  {
    "uid": "825448",
    "code": "SNGL4002",
    "subject": "SNGL",
    "number": "4002",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev: Entrepreneurship",
    "fullname": "International Development: Entrepreneurship & Inclusive Finance",
    "info": "The Political Economy of International Development (PIED) critically explores the role of the international development agenda, with a specific focus on its impact on the African continent. Students will acquire knowledge on the foundation of this agenda while capturing the complexity and paradoxes of its implementation. Students will also build on this understanding to analyze the power relationships at stake between the various actors (donors, governments, international institutions, development beneficiaries, private sector, etc.). Grounded in a theoretical approach, this course will nevertheless explore practical case studies and experiences to favor in-depth analysis.This course will dedicate particular attention to the social experiences of the populations in developing countries from a political and historical perspective. Furthermore, students will be better inclined to critically appreciate the contribution of institutional mechanisms in the bi-lateral, multilateral, and non-government sectors in the development of Sub-Saharan African nations.  Students will examine multidisciplinary ways of thinking that can be used to synthesize and analyze local, national, and global issues, and the connections among these experiences.This course will then examine constructs of inclusive finance in developing countries in general and Senegal in particular. It will challenge students to understand development policy tools that use microfinance as a strategy for economic growth in the war on poverty. A critical reflection on the limits of microfinance as a durable development approach will allow students to better understand attempts at innovation that respond to specific problems related to microfinance, and the course will introduce them to diverse perspectives on microfinance in the contemporary global economy. Students will engage with topics such as microfinance, social entrepreneurship, access to capital, and financial services.",
    "prereq": []
  },
  {
    "uid": "825449",
    "code": "SNGL4003",
    "subject": "SNGL",
    "number": "4003",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev: Public Health",
    "fullname": "International Development: Public & Community Health",
    "info": "The Political Economy of International Development (PIED) critically explores the role of the international development agenda, with a specific focus on its impact on the African continent. Students will acquire knowledge on the foundation of this agenda while capturing the complexity and paradoxes of its implementation. Students will also build on this understanding to analyze the power relationships at stake between the various actors (donors, governments, international institutions, development beneficiaries, private sector, etc.). Grounded in a theoretical approach, this course will nevertheless explore practical case studies and experiences to favor in-depth analysis.This course will dedicate particular attention to the social experiences of the populations in developing countries from a political and historical perspective. Furthermore, students will be better inclined to critically appreciate the contribution of institutional mechanisms in the bi-lateral, multilateral, and non-government sectors in the development of Sub-Saharan African nations. Students will examine multidisciplinary ways of thinking that can be used to synthesize and analyze local, national, and global issues, and the connections among these experiences.Students will then examine constructs of public and community health in developing countries in general and Senegal in particular. This course will present students with an overview of the social-health system in Senegal and critically discuss the main obstacles that Senegal has had to overcome in the realm of public health. It will highlight health determinants, explain the choice of the Senegalese to prioritize the fight against certain illnesses, and present the organization of its public health services.",
    "prereq": []
  },
  {
    "uid": "825450",
    "code": "SNGL4004",
    "subject": "SNGL",
    "number": "4004",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev: Sust & Climate Chg",
    "fullname": "International Development: Sustainable Development & Climate Change",
    "info": "The Political Economy of International Development (PIED) critically explores the role of the international development agenda, with a specific focus on its impact on the African continent. Students will acquire knowledge on the foundation of this agenda while capturing the complexity and paradoxes of its implementation. Students will also build on this understanding to analyze the power relationships at stake between the various actors (donors, governments, international institutions, development beneficiaries, private sector, etc.). Grounded in a theoretical approach, this course will nevertheless explore practical case studies and experiences to favor in-depth analysis.This course will dedicate particular attention to the social experiences of the populations in developing countries from a political and historical perspective. Furthermore, students will be better inclined to critically appreciate the contribution of institutional mechanisms in the bi-lateral, multilateral, and non-government sectors in the development of Sub-Saharan African nations. Students will examine multidisciplinary ways of thinking that can be used to synthesize and analyze local, national, and global issues, and the connections among these experiences.Students will then examine constructs of sustainable development and climate change in developing countries in general and Senegal in particular. Students will look at the human and natural environments in urban and rural Dakar.  Students will engage with topics such as waste management in urban settings, mangrove swamps, coastal preservation in Senegal (maritime erosion, the loss of biodiversity, difficulties accessing fishing waters), flooding in Dakar neighborhoods, recycling, and the repurposing of waste objects. Students will consider a variety of solutions to these challenges, wrestle with the questions of balance between practical needs and preservation, and propose ways to best implement these solutions in the Senegalese value context. ",
    "prereq": []
  },
  {
    "uid": "825451",
    "code": "SNGL4101",
    "subject": "SNGL",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist & Pol Context of Senegal",
    "fullname": "Historical & Political Context of Senegal",
    "info": "This course provides a broad historical overview of Senegal and in-depth analysis of the cultural underpinnings that have shaped the country. Using this rich history and diverse culture, students will explore and analyze the structure of the political, socio-economic, and social policies that characterize Senegal today. The course will look at Senegalese history and culture from the original Kingdoms and cover more modern periods from the slave trade to colonization through decolonization.  Students will examine the human past, study the beliefs, practices, and relationships that shaped the human experience over time in Senegal.  Students will analyze the place of Senegal in the broader West African sub region; discuss the physical and human resources available for Senegal’s development and the major challenges and constraints it faces; and take a critical look at the country’s economic policy and political system.Students will discuss Senegalese cultures, cultural values, arts, and lifestyles using literature, visuals, and the performing arts. They will consider how literature forges the conscience of a nation and how the encouragement of thriving artistic expression can help the development efforts and the carving of a national identity.",
    "prereq": []
  },
  {
    "uid": "825430",
    "code": "SNGL4201",
    "subject": "SNGL",
    "number": "4201",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in Senegal",
    "fullname": "Research in Senegal",
    "info": "In this course, the MSID student will learn about various research concepts and practices; make decisions involved in research, including selecting a topic and title for their study, developing statements of problems, and choosing research questions and appropriate research design; learn about issues related to research ethics; and develop their skills in choosing data collection instruments and analysis of the data they collect for their research. The course does this by introducing various topics in the research cycle and providing a forum in which students can share with one another their research experience at each stage of the process. Students will learn to develop, defend, and challenge their own values and beliefsResearch projects in this course are ideally projects that fit with the development agency’s goals and activities; therefore, the student’s research interests must blend with what is realistically happening at the development agency. Students must have approved proposals before proceeding onto their research sites to allow them collect necessary data and complete data analysis before heading back to Dakar at the end of the six-week field period. It is likely that students will participate in field activities, meetings, and other forms of engagement that will be indirectly related to and could inform their research projects. Students will be presented with concrete opportunities to identify and apply their knowledge of ethics, both in solving short-term problems and in creating long-term forecasts. As stated on the MSID website, the governments of the United States and MSID countries have laws protecting human subjects of research. Due to the timeline for gaining the necessary permissions for doing research with human subjects, such research cannot be conducted while abroad on LAC programs. However, there are still a wide variety of projects, that include interaction with people, that are available. See more information on options for Undergraduate Research Abroad.The course will also include 15 hours of French or Wolof instruction to prepare students with practical vocabulary for the workplace.",
    "prereq": []
  },
  {
    "uid": "825431",
    "code": "SNGL4896",
    "subject": "SNGL",
    "number": "4896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship in Senegal",
    "fullname": "Internship in Senegal",
    "info": "This course provides a cross-cultural experience of working on various development issues with a regional nonprofit organization. The course focuses on guiding students to understand their own identity as they integrate theory with reality through participation in local development sites. Students are prepared for entering into their community work through discussions on stakeholder and agency analysis, culture specific gender and diversity context, and power and privilege.  Students will learn to develop, defend, and challenge their own values and beliefsThe mentoring continues while students are at their internship placement. They come in contact with social actors, community organizations, and local and national authorities in various regions of Dakar at the marginal urban and rural levels. The students are urged to play an active role in their internships by providing suggestions and solutions, discussing alternatives, and investigating all areas of their internship placement to garner a holistic experience of the realities of development work. Through practical internship experiences as well as readings, discussions, and written assignments, students will deepen their understanding of the host-country cultural context and development work from an international perspective, as well as critically examine their own worldview. Students will be presented with concrete opportunities to identify and apply their knowledge of ethics, both in solving short-term problems and in creating long-term forecasts.The course will also include 15 hours of French or Wolof instruction to give students practical vocabulary for the workplace.",
    "prereq": []
  }
]