[
  {
    "uid": "002943",
    "code": "SOC1001",
    "subject": "SOC",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Sociology",
    "fullname": "Introduction to Sociology",
    "info": "This course is designed to introduce you to the study of society and what sociologists call the \"sociological imagination:\" a way of viewing the events, relationships and social phenomena that shape our individual lives and much of our collective experience. Through the course we will examine some of the central concepts and problems that have preoccupied both classical and contemporary sociologists and gain a sense of how the sociological imagination can illuminate the social forces that have a concrete impact on our everyday lives. Throughout the course you will be asked to consider the ways in which society affects your life, and how you, in turn, affect society. prereq: Soc Majors/Minors must register A-F",
    "prereq": []
  },
  {
    "uid": "789293",
    "code": "SOC1012W",
    "subject": "SOC",
    "number": "1012",
    "honors": false,
    "writingIntensive": true,
    "name": "Introduction to Sociology",
    "fullname": "Introduction to Sociology",
    "info": "This course is designed to introduce you to the study of society and what sociologists call the \"sociological imagination:\" a way of viewing the events, relationships and social phenomena that shape our individual lives and much of our collective experience. Through the course we will examine some of the central concepts and problems that have preoccupied both classical and contemporary sociologists, and gain a sense of how the sociological imagination can illuminate the social forces that have a concrete impact on our everyday lives.  Throughout the course you will be asked to consider the ways in which society affects your life, and how you, in turn, affect society.",
    "prereq": []
  },
  {
    "uid": "009952",
    "code": "SOC1090",
    "subject": "SOC",
    "number": "1090",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Sociology",
    "fullname": "Topics in Sociology",
    "info": "For freshmen.  Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "009955",
    "code": "SOC1091",
    "subject": "SOC",
    "number": "1091",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study of an established 1xxx course.  Available only by request.",
    "prereq": []
  },
  {
    "uid": "811512",
    "code": "SOC1101",
    "subject": "SOC",
    "number": "1101",
    "honors": false,
    "writingIntensive": false,
    "name": "Law, Crime, & Punishment",
    "fullname": "Law, Crime, & Punishment",
    "info": "Introductory course designed to provide students with a general understanding of the main theoretical perspectives and empirical findings that dominate socio-legal studies and contemporary criminology. We examine the connections and relationships between law, crime, and punishment using an interdisciplinary social science approach.",
    "prereq": []
  },
  {
    "uid": "807353",
    "code": "SOC1904",
    "subject": "SOC",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Freshman seminar that meets CLE designation.prereq: Fr or less than 30 cr",
    "prereq": []
  },
  {
    "uid": "797458",
    "code": "SOC1905",
    "subject": "SOC",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "817118",
    "code": "SOC1911",
    "subject": "SOC",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Climate Change and Society",
    "fullname": "Climate Change and Society",
    "info": "Over the past 150 years, the burning of fossil fuels to power industrial expansion has brought many benefits, but has also caused a terrible problem: global climate change (GCC). If humanity continues to emit large amounts of greenhouse gasses like carbon dioxide into the atmosphere, it will get hit with intensifying disasters. From a sociological viewpoint, why has this situation come about and what can we do to solve it? Can we create a sustainable world with prosperity for all? This is the most important long-range question for our age. The course presents and discusses the most important social (including political, economic and cultural) problems involved in solving this huge problem. Work consists of mostly of discussing and writing paragraphs on each topic and reading, plus two class presentations, and a few quizzes and two exams. ",
    "prereq": []
  },
  {
    "uid": "818832",
    "code": "SOC1912",
    "subject": "SOC",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Body, Culture, and Society",
    "fullname": "Body, Culture, and Society",
    "info": "Many of us think about our bodies from a very personal level. We wonder if our body is too thin or too heavy, whether we are too short or too tall, healthy or unhealthy, and whether or not our body is “normal” or “abnormal.” However, questions and answers regarding our bodies are often settled beyond our individual views. In this course, we will take a sociological perspective in thinking about the body. We will use our sociological imaginations to assess how notions of the body have been shaped by broader societal and cultural processes. We will draw from numerous frameworks and theories to explore the intersection of the body and several topics, including: identity, gender, media, race/ethnicity, sports, medicine, technology and public policy. ",
    "prereq": []
  },
  {
    "uid": "818833",
    "code": "SOC1913",
    "subject": "SOC",
    "number": "1913",
    "honors": false,
    "writingIntensive": false,
    "name": "Transition to Adulthood",
    "fullname": "Transition to Adulthood: Perils, Opportunities, and Promise",
    "info": "The paths young people take as they move through adolescence and transition to adulthood have become longer and more uncertain in recent decades.  This course will examine how recent societal trends have influenced this process, including growing inequality, shifts in the labor force, technological advances, and changes in major institutions like higher education and criminal justice.  How these trends affect young people depends on their gender, race/ethnicity, immigration status, and social class.  We will examine youth agency: how young people envision their futures, make decisions and plans, and attempt to achieve their goals in contexts of changing opportunities and constraints.  Trends and disparities in interpersonal competence, physical and mental health, vocational development, and civic engagement will be considered.  This freshman seminar will also consider social policy and interventions designed to enhance this phase of life and ensure successful transitions to adulthood.  ",
    "prereq": []
  },
  {
    "uid": "818899",
    "code": "SOC1930",
    "subject": "SOC",
    "number": "1930",
    "honors": false,
    "writingIntensive": false,
    "name": "Democracy under Threat",
    "fullname": "Democracy under Threat in Times of Populism and Racial Nationalism",
    "info": "Is democracy under threat? The upsurge of populist authoritarianism and racial nationalism around the globe in conjunction with recent assaults on traditional political institutions in the United States have raised concerns about the fate and future of democracy. Political scientists largely agree that the United States has become more democratic over the past two centuries, but results from the Authoritarian Warning Survey, a democratic-monitoring project, highlight the erosion of democratic principles and institutions in the past few years. Concerns about the meaning, nature, promise, stability or instability of democracy are, however, not new. In order to better understand contemporary threats to democracy this course explores how the meanings and understandings of democracy changed over the last few centuries by examining the complicated relationship between democracy, populism and racial nationalism. Is democracy a product of populism or imperilled by populism? What is the contemporary and historical relationship between democracy and racial nationalism? This seminar delves deeply into these questions by exploring a series of moments when the meanings and promise of democracy were contested. It begins with fundamental questions about the racial and gendered origins of American democracy. What is the relationship between the democratic state, the slave state and the settler colonial state? How did racial nationalism constitute and imperil American democracy from its origins? Populists, that is members of mass movements that claim to speak for “the people,” have struggled to both extend and redefine the limits of democracy. In these efforts, “citizens” have frequently been pitted against non-citizens making questions of immigration, naturalization, and detention central to contestations over democracy and its perceived threats. Moreover, in the United States, the relationship between detention and democracy can not be fully explored without paying significant attention to the rise of mass incarceration over the past half century. To what extent is the democratic state today threatened or maintained through the carceral state? Student will engage with these issues through interdisciplinary lectures, course readings and discussions, and conversations with scholars, activists and organizations fostering democratic values and racial justice.This course comes out of the Democracy under Threat Interdisciplinary Collaborative Workshop. Students will be invited to all Democracy under Threat events during the 2019-2020 academic year, including a Spring 2020 Conference, “Democracy under Threat in Times of Populism and Racial Nationalism” that will be held at the University of Minnesota in partnership with Howard University, Morehouse College, and Spelman College.",
    "prereq": []
  },
  {
    "uid": "789603",
    "code": "SOC1999",
    "subject": "SOC",
    "number": "1999",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Exam",
    "fullname": "Special Exam",
    "info": "",
    "prereq": []
  },
  {
    "uid": "003442",
    "code": "SOC3003",
    "subject": "SOC",
    "number": "3003",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Problems",
    "fullname": "Social Problems",
    "info": "In this course, we will engage in a sociological examination of major social problems facing the contemporary US and abroad. We explore the origins and causes of different social problems, seek to understand how they impact individuals, groups, and the society as a whole, and evaluate solutions. We ask how an issue becomes defined as a \"social problem,\" discuss the social construction of reality and deviance, and consider the primary frameworks under which societies have organized their responses to different social problems.prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "825076",
    "code": "SOC3005",
    "subject": "SOC",
    "number": "3005",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Science Fiction",
    "fullname": "Social Science Fiction",
    "info": "This course applies theories, concepts, and principles from social science disciplines such as sociology, political science, and anthropology, to social science fiction novels, stories, and films, to understand how soc-sci-fi contributes to knowledge about current societal conditions. Soc majors/minors must register A-F.",
    "prereq": []
  },
  {
    "uid": "009960",
    "code": "SOC3090",
    "subject": "SOC",
    "number": "3090",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Sociology",
    "fullname": "Topics in Sociology",
    "info": "Topics specified in Class Schedule.\n\nprereq: 1001 recommended; soc majors must register A-F; cr will not be granted if cr has been received for the same topics title",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "009961",
    "code": "SOC3091",
    "subject": "SOC",
    "number": "3091",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study of an established 3xxx course.  Available only by request.",
    "prereq": []
  },
  {
    "uid": "009962",
    "code": "SOC3093",
    "subject": "SOC",
    "number": "3093",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study at sophomore level.Prereq 1001, instr consent, dept consent, college consent; soc majors/minors must register A-F.",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "009963",
    "code": "SOC3094",
    "subject": "SOC",
    "number": "3094",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Guided research experience at sophomore level.prereq: 1001, instr consent; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "790181",
    "code": "SOC3101",
    "subject": "SOC",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Persp on Crim Justice Syst",
    "fullname": "Sociological Perspectives on the Criminal Justice System",
    "info": "This course introduces students to a sociological account of the U.S. criminal justice system. We will critically examine the components, dynamics, and effects of policing, criminal courts, community supervision, jails, and prisons. Throughout the course, we focus on sociological understandings of these processes, with particular attention to ethnic, racial, class, and gender inequalities as well as long-term problems associated with the high rate of criminal justice supervision in the U.S.prereq: [SOC 1001] recommended, Sociology majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "790182",
    "code": "SOC3102",
    "subject": "SOC",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Criminal Behavior Soc Control",
    "fullname": "Criminal Behavior and Social Control",
    "info": "This course will address the social and legal origins of crime and crime control with a focus on general theories of deviance/crime and present an overview of forms of social control. We will critically examine criminological, sociological, and legal theories that explain the causes of crime and other misdeeds.prereq: Soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "002564",
    "code": "SOC3111",
    "subject": "SOC",
    "number": "3111",
    "honors": false,
    "writingIntensive": false,
    "name": "Crime/Criminal Just",
    "fullname": "Introduction to Crime and Criminal Justice",
    "info": "Patterns of crime and victimization by social groups, regions, and over time; classical and contemporary theories explaining crime.  Principles of criminal justice and agencies (police, courtroom working group, correctional institutions).",
    "prereq": []
  },
  {
    "uid": "002711",
    "code": "SOC3201",
    "subject": "SOC",
    "number": "3201",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Stratification",
    "fullname": "Inequality: Introduction to Stratification",
    "info": "Why does inequality exist? How does it work? These are the essential questions examined in this class. Topics range from welfare and poverty to the role of race and gender in getting ahead. We will pay particular attention to social inequities—why some people live longer and happier lives while others are burdened by worry, poverty, and ill health.prereq: soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "819602",
    "code": "SOC3207",
    "subject": "SOC",
    "number": "3207",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Islamophobia",
    "fullname": "Global Islamophobia",
    "info": "Throughout the world, anti-Muslim activists and politicians have been increasingly attacking Muslims and Islam. And, international organizations have reported human rights violations against Muslims worldwide. Recently, in the United States, there have been calls to ban Muslims, as well as register American Muslims. In France, Muslim women are prohibited to wear a headscarf in high school. And in Myanmar, a genocide against Muslim minorities is currently underway. While anti-Islamic discourses have a long history in many societies worldwide (including Muslim-majority countries), the course seeks to explore the global rise of these discourses since September 11, 2001. The course examines the cultural, political, and historical origins of Islamophobic discourses that cast Muslims as \"violent,\" \"hateful,\" and \"uncivilized.\" Class sessions will include some lecture but will be largely discussion based. Assignments will ask students to think and write critically about course concepts, debate and participate in simulation exercises, and reflect on personal thoughts and feelings about course content.",
    "prereq": []
  },
  {
    "uid": "003105",
    "code": "SOC3211W",
    "subject": "SOC",
    "number": "3211",
    "honors": false,
    "writingIntensive": true,
    "name": "Race and Racism in the US",
    "fullname": "Race and Racism in the US",
    "info": "We live in a society steeped in racial understandings that are often invisible—some that are hard to see, and others that we work hard not to see. This course will focus on race relations in today's society with a historical overview of the experiences of various racial and ethnic groups in order to help explain their present-day social status. This course is designed to help students begin to develop their own informed perspectives on American racial “problems” by introducing them to the ways that sociologists deal with race, ethnicity, race relations and racism. We will expand our understanding of racial and ethnic dynamics by exploring the experiences of specific groups in the U.S. and how race/ethnicity intersects with sources of stratification such as class, nationality, and gender. The course will conclude by re-considering ideas about assimilation, pluralism, and multiculturalism. Throughout, our goal will be to consider race both as a source of identity and social differentiation as well as a system of privilege, power, and inequality affecting everyone in the society albeit in different ways. ",
    "prereq": []
  },
  {
    "uid": "816935",
    "code": "SOC3215",
    "subject": "SOC",
    "number": "3215",
    "honors": false,
    "writingIntensive": false,
    "name": "Supercapitalism Global Econ",
    "fullname": "Supercapitalism: Labor, Consumption & the Environment in the New Global Economy",
    "info": "From the jeans you buy online to the place mats you purchase at Target, most of the items we consume are made somewhere else. Global production networks link consumers of fresh green beans in Britain with growers, pickers, and packers in Zambia. And it isn't only products that move around the globe; so do people. Thanks to immense economic inequalities, wealthy families in the global North enjoy the cheap labor of Eastern European, Filipino, and Honduran nannies, house cleaners, and gardeners. How did this global economy come to be, how has it impacted workers, consumers, and ecosystems, and what are its ethical and political implications? This course focuses on the changes that have occurred over the last 70 years in the realms of labor, consumption, and the environment. We'll examine the movement away from regulated national economies to an integrated global economy; changing patterns and organization of production, distribution, consumption, and waste disposal; and new forms of capital-labor-state relations. Some of the topics we explore include the global trade in body parts; the rise of shareholder capitalism; the new \"platform\" economy; the growing insecurity of work; and the environmental changes global capitalism has wrought. We end by considering alternatives to the \"business-as-usual\" (BAU) economy.",
    "prereq": []
  },
  {
    "uid": "003235",
    "code": "SOC3221",
    "subject": "SOC",
    "number": "3221",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Gender",
    "fullname": "Sociology of Gender",
    "info": "Gender is something so fundamental to our lives, to our identities, and how we interact with others that we often take it for granted. However, understandings of gender vary across time and place, and even within cultures, making it clear that our understandings of gender are not universal or timeless. In this class, we will examine how gender intersects with race and sexuality, as well as how it impacts areas of our lives such as child socialization, family structure, the media, intimate relationships, and the workplaceprereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "825667",
    "code": "SOC3225",
    "subject": "SOC",
    "number": "3225",
    "honors": false,
    "writingIntensive": false,
    "name": "The Power of the 1%",
    "fullname": "The Power of the 1%: Global Philanthropy and the Making of a New World",
    "info": "Philanthropy has come to play an increasingly important role in the economy and society, on both a national and global level. Americans gave away $450 billion in 2019, or a little over 2 percent of our country's GDP (Giving USA 2020). A few mega-philanthropists, such as Bill Gates, Warren Buffett, Michael Bloomberg, and others donated mind-boggling sums of money. These individuals and their foundations are having a significant impact around the world, changing the way public education is carried out in many countries, how global health priorities are defined, how public policies are made, and how African agricultural systems are organized. Forbes magazine reports that there are 1,645 billionaires in the world today, 80% more than a decade ago. While some observers look positively on this philanthropic outpouring, others suggest it may be eroding democracy. In this course, we study philanthropy from a variety of perspectives, exploring who gives away money and why, how this \"gift\" impacts givers, receivers, and taxpayers, and what the relationship is between global philanthropy and power. Specific topics include the history of foundations; religion and charity; philanthropy and politics; consumption-based giving (or \"brand aid\"), and philanthropy and social policy. We'll examine case studies such as the Gates Foundation's role in African agriculture. Students will do \"participant observation\" in a local charity, and a research project on the philanthropic foundation or giving practice of their choice.Pre-req: Soc Majors must register A-F.",
    "prereq": []
  },
  {
    "uid": "818255",
    "code": "SOC3241",
    "subject": "SOC",
    "number": "3241",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Women's Health",
    "fullname": "Sociology of Women's Health: Experiences from Around the World",
    "info": "Health care is a fundamental right, but access to it is not shared evenly by all. This course considers women's and men's health needs, and how health systems assign priority to those needs. The course also covers how differences in health policy, national medical systems, levels of wealth, and cultural contexts around the world affect women's health and treatment and their experiences of wellness and illness. Women are taking an active role in shaping healthy societies. The final portion of this course looks at the goals and successes of women's movements in the health sphere. Throughout the course, there will be an emphasis on how sociological approaches to health differ from medical or epidemiological approaches, the advantages of the sociological approaches, and the respective advantages and disadvantages of qualitative versus quantitative approaches to studying women's health.Pre-req:  Soc majors and minors must register A-F; Soc 1001 recommended.",
    "prereq": []
  },
  {
    "uid": "820353",
    "code": "SOC3243W",
    "subject": "SOC",
    "number": "3243",
    "honors": false,
    "writingIntensive": true,
    "name": "On Drugs: Pleasures & Panics",
    "fullname": "On Drugs: Pleasures, Panics & Punishments",
    "info": "In this course we are going to study and reflect on the immense popularity of mood-enhancing drugs, legal and illegal, around the world today. Why do we want to modify our moods, and how do we set about it? Why do some people throw themselves into drug use while others fearfully avoid it? And why do many more of us feel worried about \"addiction\" to shopping, sex, or gambling? Together we will build a comparative analysis of drug cultures and practices – understanding the place of “journey” and “possession” inebriation across time, and how the temporal and ritual boundaries delimiting substance use get broken down by the mass commoditization of alcohol and other drugs by 19th century capitalism. From there we trace the amazingly confused development of addiction and changing forms of intervention, from alarmist educational campaigns and the militarized maneuvers of the drug war to the drug court movement , and from the twelve-step cure to alternative harm reduction approaches. This class will offer you a mixture of accessible and detailed material, together with some theoretical work which will help you grasp the subject on a deeper level. As a writing intensive class you will develop a three-stage paper with feedback at each stage, producing a strong writing sample.Pre-req:  Soc 1001 recommended; Soc majors/minors must register A-F. ",
    "prereq": []
  },
  {
    "uid": "817156",
    "code": "SOC3246",
    "subject": "SOC",
    "number": "3246",
    "honors": false,
    "writingIntensive": false,
    "name": "Disease Disaster & Oth Killers",
    "fullname": "Diseases, Disasters, & Other Killers",
    "info": "This course studies the social pattern of mortality, beginning with demographic transition theory. Students will study specific causes of death or theories of etiology, including theories about suicide, fundamental cause theory, and the role of early life conditions in mortality. Students learn tools for studying mortality, including cause of death classifications and life tables.Soc majors/minors must register A-F.",
    "prereq": []
  },
  {
    "uid": "792045",
    "code": "SOC3251W",
    "subject": "SOC",
    "number": "3251",
    "honors": false,
    "writingIntensive": true,
    "name": "Race, Class, and Gender",
    "fullname": "Sociological Perspectives on Race, Class, and Gender",
    "info": "In the midst of social unrest, it is important for us to understand social inequality. In this course we will analyze the impact of three major forms of inequality in the United States: race, class, and gender. Through taking an intersectional approach at these topics, we will examine the ways these social forces work institutionally, conceptually, and in terms of our everyday realities. We will focus on these inequalities as intertwined and deeply embedded in the history of the country. Along with race, class, and gender we will focus on other axes of inequality including sexuality, citizenship, and dis/ability. We will analyze the meanings and values attached to these social categories, and the ways in which these social constructions help rationalize, justify, and reproduce social inequality.prereq: Soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "008550",
    "code": "SOC3301W",
    "subject": "SOC",
    "number": "3301",
    "honors": false,
    "writingIntensive": true,
    "name": "Politics and Society",
    "fullname": "Politics and Society",
    "info": "Political sociology is concerned with the social bases of power and the social consequences of the organization of power, especially how power operates in relationship to various forms of inequality and different institutions. We will explore political socialization, electoral politics and voting, social movements, the media and framing, and politics of inequality, poverty, and welfare.prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "815326",
    "code": "SOC3309",
    "subject": "SOC",
    "number": "3309",
    "honors": false,
    "writingIntensive": false,
    "name": "Atheists as 'Others'",
    "fullname": "Atheists as “Other”: Religious & Nonreligious Outsiders in the US",
    "info": "What does it mean to be an atheist in the United States today? Atheists comprise a small percentage of the American population, but one with an increasingly visible presence in popular culture, political discourse, & everyday life. How do atheists organize into groups oriented toward identity-formation, social connection, and political action?prereq: 1001 recommended",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "811903",
    "code": "SOC3311W",
    "subject": "SOC",
    "number": "3311",
    "honors": false,
    "writingIntensive": true,
    "name": "Hard Times & Bad Behavior",
    "fullname": "Hard Times & Bad Behavior: Homelessness & Marginality in the United States",
    "info": "As we read about hobos and sailors, opium users and saloon girls, and contemporary experiences on the streets, we trace themes about marginality in the US, such as rootlessness produced by labor market, the love-hate relationship between elites and marginal populations in popular culture, and the complex mixture of freedom and deprivation of people on the edge.prereq: 1001 recommended, soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "791270",
    "code": "SOC3322W",
    "subject": "SOC",
    "number": "3322",
    "honors": false,
    "writingIntensive": true,
    "name": "Social Mvmnts/Protests/Change",
    "fullname": "Social Movements, Protests, and Change",
    "info": "Focusing on the origins, dynamics, and consequences of social movements, this course explores debates about the dilemmas and challenges facing movement organizations, the relationship between social movements and various institutions, and the role of social movements and protest in bringing about change. The course is organized around general theoretical issues concerning why people join movements, why they leave or remain in movements, how movements are organized, the strategies and tactics they use, and their long-term and short-run impact.prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "016295",
    "code": "SOC3351W",
    "subject": "SOC",
    "number": "3351",
    "honors": false,
    "writingIntensive": true,
    "name": "Pol & Soc in Europe",
    "fullname": "Politics and Society in the New Europe",
    "info": "Generational change/values, political parties, welfare state, future of European integration, political stability/democratization.",
    "prereq": []
  },
  {
    "uid": "001150",
    "code": "SOC3411W",
    "subject": "SOC",
    "number": "3411",
    "honors": false,
    "writingIntensive": true,
    "name": "Organizations and Society",
    "fullname": "Organizations and Society",
    "info": "This course introduces undergraduates to contemporary theories and debates about formal organizations in an international context, including such forms as large corporations, small businesses, public bureaucracies, nonprofits, voluntary associations, social movement organizations, terrorist networks and counterterror organizations. prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "811369",
    "code": "SOC3412",
    "subject": "SOC",
    "number": "3412",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Networking",
    "fullname": "Social Networking: Theories and Methods",
    "info": "Network analysis spans a diverse range of phenomena from ego-centric ties, to small work-team sociograms, to organizational relations, to trade and military alliances among nation states. This course introduces undergraduate students to theories and methods for studying social networks, the ties connecting people, groups, and organizations. Topics include friendship, communication, small group, health, sexual and romantic, corporate, social movement, public policy, innovation diffusion, criminal and terrorist, and Internet networks.'prereq: [SOC 1001] recommended, Sociology majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "791271",
    "code": "SOC3415",
    "subject": "SOC",
    "number": "3415",
    "honors": false,
    "writingIntensive": false,
    "name": "Consume This!",
    "fullname": "Consume This! The Sociology and Politics of Consumption",
    "info": "How symbols are created, acquired, diffused, and used for organizing personal identity and maintaining group boundaries. Fashion. Socialization. Structure of retail trade. Role of mass media, advertising, marketing/production strategies. Implications of worldwide markets.prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "813972",
    "code": "SOC3417W",
    "subject": "SOC",
    "number": "3417",
    "honors": false,
    "writingIntensive": true,
    "name": "Global Institutions of Power",
    "fullname": "Global Institutions of Power: World Bank, International Monetary Fund, and World Trade Organization",
    "info": "This course will introduce students to some of the world's most powerful global institutions -- such as the World Bank (IBRD), the International Monetary Fund (IMF), the World Trade Organization (WTO), the United Nations, and affiliated agencies such as UNHCR (for refugee support). We will follow their efforts to promote a style of global development practices -- large-scale capital lending and global expertise building -- that has crystallized into a common understanding of how global north-south dynamics should progress.  Cases pursued in class may include their lending and debt policies, dam building and energy projects, climate resilience and water loans, and the ways they mediate free trade agreements among competing countries. We will also hear from the multitude of voices, theories, and practices that offer alternative visions as to how people strive to produce a more just, socially equitable, and climate-safe world.  We will use books, articles, films, in-class debates, case study exploration, small-group projects, and guest speakers to create a lively discussion-based classroom environment.",
    "prereq": []
  },
  {
    "uid": "796114",
    "code": "SOC3421W",
    "subject": "SOC",
    "number": "3421",
    "honors": false,
    "writingIntensive": true,
    "name": "Sociology of Work",
    "fullname": "Sociology of Work: Good Jobs, Bad Jobs, No Jobs?",
    "info": "Work is central to individuals, economy, and society. This course introduces students to sociological perspectives and analyses of work. We will look at what makes a good job good, a bad job bad, and impacts of joblessness on society. prereq: 1001 recommended, Soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "818148",
    "code": "SOC3446",
    "subject": "SOC",
    "number": "3446",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparing Healthcare Systems",
    "fullname": "Comparing Healthcare Systems",
    "info": "Examination of national health systems from an international comparative perspective, emphasizing social, organizational, political, economic, cultural, and ethical dimensions of healthcare policies and programs to deliver services and their impacts on the health of population groups. The comparative approach will enable students to acquire a better understanding of the problems and potential for reforming and improving US healthcare delivery.Pre-req: Soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "002909",
    "code": "SOC3451W",
    "subject": "SOC",
    "number": "3451",
    "honors": false,
    "writingIntensive": true,
    "name": "Cities & Social Change",
    "fullname": "Cities & Social Change",
    "info": "The core themes of this class will provide an essential toolkit for approaching broad questions about social justice, culture, work, housing and service provision on multiple levels and across the globe. This course will have units on economic development, inequality, the interaction between design and human action, inclusive and exclusive cultural formations, crime and cultures of fear, social control and surveillance.prereq: 1001 recommended, Soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "791272",
    "code": "SOC3452",
    "subject": "SOC",
    "number": "3452",
    "honors": false,
    "writingIntensive": false,
    "name": "Education and Society",
    "fullname": "Education and Society",
    "info": "Everyone thinks they know what \"education\" is. We've all been in schools, and we think we know how they work. We all have opinions about why some people go farther in school than others and why some people learn more than others. We all think we know what role education plays in shaping who gets good jobs, who has a good life, and who has more knowledge. This course is designed to challenge and expand what we think we know about all of these things. Students (and instructor) will critically engage scientific research in sociology, education, economics, public policy, and elsewhere. The goal will be to educate everyone about the current state of knowledge about how \"education\" works: what shapes educational achievement; where sex and racial/ethnic and socioeconomic inequalities in educational achievements come from; what role education plays in economic development; how and why educational accomplishments result in better social and economic outcomes; and how educational institutions might be improved. prereq: Soc majors/minors must register A-F.",
    "prereq": []
  },
  {
    "uid": "825129",
    "code": "SOC3461",
    "subject": "SOC",
    "number": "3461",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Neighborhoods",
    "fullname": "Sociology of Neighborhoods: People, Place, Housing, and Community",
    "info": "This course is an introduction to the sociological study of neighborhoods, exploring how sociologists study people in their local communities. Generally the course focuses on neighborhoods in American society, and may explore broader issues with a research focus on neighborhoods in the Twin Cities area which students can study using a range of sociological research methods. Students will learn about a range of methods for studying neighborhoods including analysis of local area statistics, ethnographies, and interviews, and how to analyze different forms of data to meet the Data Analysis requirements for the BS in Sociology.  Important themes which are addressed in the class include the composition and population structure of communities, racial and ethnic segregation, associational and civic life, municipal government and politics, community folklore and memory, housing, and local environmental issues.Soc 1001 recommended; Soc Majors and Minors must register A-F",
    "prereq": []
  },
  {
    "uid": "002510",
    "code": "SOC3501",
    "subject": "SOC",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Families",
    "fullname": "Sociology of Families",
    "info": "Family has long been a significant experience in human societies; much of what we understand ourselves to be, arises in family life. But family also varies widely in composition across time and place. We will learn how sociologists study and understand families theoretically, as social institutions, as well as sites and sources of social problems. prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "809772",
    "code": "SOC3503",
    "subject": "SOC",
    "number": "3503",
    "honors": false,
    "writingIntensive": false,
    "name": "AsianAmrcn Identities, Commnty",
    "fullname": "Asian American Identities, Families & Communities",
    "info": "This course provides a sociological overview of Asian American identities, families and communities. To place these experiences within a broader historical, structural, and cultural context the course will begin with a brief introduction to the history of Asians and Asian Americans in the United States and sociological theories about incorporation and racial stratification. We will then examine the diversity of Asian American communities and families, highlighting ethnic, gender, and class variations. Other topics of focus include racialization and discrimination, education, ethnic enclaves, family and intergenerational relationships, identity, media, culture, and politics and social action. Throughout the course we will consider the ways in which society affects individuals, and how in turn, individuals affect society. Students will have an option to do community-engaged learning or another course project.prereq: SOC 1001 recommended, Sociology majors/minors must register A/F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "809419",
    "code": "SOC3505",
    "subject": "SOC",
    "number": "3505",
    "honors": false,
    "writingIntensive": false,
    "name": "Migrations: People in Motion",
    "fullname": "Migrations: People in Motion",
    "info": "Students in this course will tackle debates related to migration from a variety of disciplinary perspectives and will compare and connect diverse migration trends around the world (Asia, Africa, Latin America, and North America).  Students will critically engage with various paradigms on the geopolitical, racial, and gender power dynamics that anchor migration processes and outcomes. Why would the movement of individuals from some parts of the world (often from the least developed regions to the highly developed Western nations) create such strong and highly charged debates? How are cross border social and economic relations of individuals and households maintained and perpetuated? What are particular governments doing to either encourage or hinder these movements? How are current migrations different from earlier eras? Is this gendered, and if so, how and why? The objective of this course is to explore the above questions through academic and policy published literature.  prereq: Soph, jr, or sr",
    "prereq": []
  },
  {
    "uid": "818167",
    "code": "SOC3507",
    "subject": "SOC",
    "number": "3507",
    "honors": false,
    "writingIntensive": false,
    "name": "Immigration to the US",
    "fullname": "Immigration to the United States: Beyond Walls",
    "info": "Immigration is one of the most politically and emotionally charged issues in the United States today. It is also poorly understood. Assumptions, myths, and misinformation about US immigration and immigrants are routinely and increasingly manifested in acrimonious political debates, news stories and sound bites, and our daily conversations and interactions with one another in the very communities in which we live and work. At the same time, US immigration and immigrants have been, are, and will continue to be an essential and vibrant part of our lived and shared experiences as individuals and communities, Minnesotans and Americans, and global citizens.",
    "prereq": []
  },
  {
    "uid": "008198",
    "code": "SOC3511",
    "subject": "SOC",
    "number": "3511",
    "honors": false,
    "writingIntensive": false,
    "name": "World Population Problems",
    "fullname": "World Population Problems",
    "info": "This class is an introduction to the contemporary issues that accompany such dramatic population change, including fertility change, disease experiences, migration as opportunity and challenge and human-environment conflict. Further, we will examine the roles of global organizations, national governments, and culture in shaping and reshaping populations.prereq: [SOC 1001] recommended, Sociology majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "798215",
    "code": "SOC3613W",
    "subject": "SOC",
    "number": "3613",
    "honors": false,
    "writingIntensive": true,
    "name": "The Politics of Eating",
    "fullname": "Stuffed and Starved: The Politics of Eating",
    "info": "This course takes a cross-cultural, historical, and transnational perspective to the study of the global food system. Themes explored include: different cultural and social meanings attached to food; social class and consumption; the global food economy; global food chains; work in the food sector; the alternative food movement; food justice; environmental consequences of food production. prereq: Soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "817210",
    "code": "SOC3641",
    "subject": "SOC",
    "number": "3641",
    "honors": false,
    "writingIntensive": false,
    "name": "New Zealand Cltr, Society, Env",
    "fullname": "Understanding New Zealand: Culture, Society, and Environment",
    "info": "This course introduces students to New Zealand society in a 3-week global seminar, covering political structures, indigenous rights, immigration trends, and environmental politics. New Zealand is one of the world's most remote inhabited land-masses, and this remoteness has had a significant impact on its environmental and human history. Like the United States, New Zealand is thought of as a \"settler society\" that is now largely populated by descendants of people who migrated from Europe in the last couple of centuries. Like the United States it is a long-established democracy, with significant levels of immigration from Europe and Asia. Unlike the United States, the indigenous Maori population comprise around 1/6 of the population giving indigenous issues an unusual prominence in politics and society compared to peer countries such as the US, Canada, Australia, or Scandinavia to which NZ is often compared by social scientists. The predominant language spoken in the country is English, giving students the ability to quickly engage with the local population in formal and informal settings, and access local resources for study such as libraries, archives, speakers from universities, civic organizations, and government. Thematically the course has a continuing focus on indigenous rights, immigration, and the environment in a long-established democracy. Methodologically the course gives students an opportunity to engage with several important social research methods including reading comparative social science that puts New Zealand in context with similar countries; archival and biographical research, and social observation of public spaces. Through the instructor's contacts with colleagues in New Zealand, students also have the opportunity to engage in joint discussions with New Zealand university students about shared assigned readings about New Zealand society, and meet community members in a range of informal and formal settings. Assignments have students undertake reflective journaling on their observations of New Zealand, write a biographical profile from archival sources, and complete a short research paper on a topical issue of the students' choice using academic literature, official statistics, and news media.",
    "prereq": []
  },
  {
    "uid": "796199",
    "code": "SOC3651",
    "subject": "SOC",
    "number": "3651",
    "honors": false,
    "writingIntensive": false,
    "name": "Comp Scand Soc",
    "fullname": "Comparative Scandinavian Societies",
    "info": "Comparative analysis of Denmark, Finland, Iceland, Norway, Sweden. Major institutions, values, settlement patterns, regional developments. Recent changes in social welfare systems, demography, including immigration. Questions relating to cultural identities in Norden are critically probed.",
    "prereq": []
  },
  {
    "uid": "008549",
    "code": "SOC3661",
    "subject": "SOC",
    "number": "3661",
    "honors": false,
    "writingIntensive": false,
    "name": "Japan and the U.S.",
    "fullname": "Japan and the United States: Tides of Change in Race, Class, and Gender",
    "info": "Forms of social relations and values, religion, childhood, family, community, education, work, business organization, politics, social classes, crime and deviance, police, popular culture. Status of women/minorities. Social protest movements, international relations.",
    "prereq": []
  },
  {
    "uid": "798449",
    "code": "SOC3671",
    "subject": "SOC",
    "number": "3671",
    "honors": false,
    "writingIntensive": false,
    "name": "Chinese Society",
    "fullname": "Chinese Society: Culture, Networks, & Inequality",
    "info": "Introduces students to sociological perspectives and analyses of cultures, social networks, and socioeconomic inequalities in post-1980 China. In addition to lectures, the instructor will show video clips about various backgrounds of China and group discussions will be organized to exchange opinions about issues of common interest. Students will gain a basic understanding of how Chinese society operates today.prereq: 1001 recommended, soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "803622",
    "code": "SOC3681",
    "subject": "SOC",
    "number": "3681",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender in the Islamic World",
    "fullname": "Gender and the Family in the Islamic World",
    "info": "This course explores the experiences of Muslim women and Muslim families from a historical and comparative perspective. Expanding the discussion on Muslim women's lives and experiences beyond the Middle East, by also centralizing on the experiences of Muslim women and families outside of this geographical area highlights the complex and diverse everyday experiences of Muslim women around the world. This wider lens exposes the limitations intrinsic in the stereotypical representation of Muslims in general and Muslim women in particular. We will explore the intricate web of gender and family power relations, and how these are contested and negotiated in these societies. Some of the themes the course explores include the debates on Muslim women and colonial representations, sexual politics, family, education and health, women and paid work, gender and human rights, and Islamic feminisms debates.prereq: At least soph; 1001 recommended",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "003305",
    "code": "SOC3701",
    "subject": "SOC",
    "number": "3701",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Theory",
    "fullname": "Social Theory",
    "info": "This course provides an introductory overview of major social theories ranging from the foundational sociological theories of Marx, Weber and Durkheim to contemporary theories of postmodernism and globalization. We will examine a range of theories with particular attention to their treatments of core sociological questions and concerns.prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "002688",
    "code": "SOC3711",
    "subject": "SOC",
    "number": "3711",
    "honors": false,
    "writingIntensive": false,
    "name": "Prins: Soc Organ",
    "fullname": "Principles of Social Organization",
    "info": "How/why social organization is possible. Social structure, primary forms of social organization (groups, communities, networks, formal organizations). Social processes (integration, differentiation, regulation, change). How social organization evolves from individual decision making.",
    "prereq": []
  },
  {
    "uid": "008196",
    "code": "SOC3721",
    "subject": "SOC",
    "number": "3721",
    "honors": false,
    "writingIntensive": false,
    "name": "Principles Social Psychology",
    "fullname": "Principles of Social Psychology",
    "info": "Social psychology is at the intersection of macro and micro sociology, linking social structures, interpersonal relationships and interactions, attitudes, values and the self-concept. Principles of social psychology are drawn from multiple theoretical perspectives, including symbolic interactionism, expectation states theory, social structure and personality, and the life course. This course covers a broad range of topics as well as the diverse methods that social psychologists use to study them (for example, experiments, surveys, ethnographic observation).prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "003205",
    "code": "SOC3801",
    "subject": "SOC",
    "number": "3801",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociological Research Methods",
    "fullname": "Sociological Research Methods",
    "info": "This course provides an introduction to the materials and methods of social science research in a comprehensive and critical way. The course begins by introducing social science research, including philosophical and theoretical foundations. The course then covers the primary components of research design, including conceptualization, operationalization and measurement, primary and secondary data collection and sources, sampling, and the logic of comparison(s).prereq: 1001 recommended; soc majors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "001148",
    "code": "SOC3811",
    "subject": "SOC",
    "number": "3811",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Statistics",
    "fullname": "Social Statistics",
    "info": "This course will introduce majors and non-majors to basic statistical measures and procedures that are used to describe and analyze quantitative data in sociological research. The topics include (1) frequency and percentage distributions, (2) central tendency and dispersion, (3) probability theory and statistical inference, (4) models of bivariate analysis, and (5) basics of multivariate analysis. Lectures on these topics will be given in class, and lab exercises are designed to help students learn statistical skills and software needed to analyze quantitative data provided in the class. prereq: Undergraduates with strong math background are encouraged to register for 5811 in lieu of 3811 (Soc 5811 offered Fall terms only). Soc Majors/Minors must register A-F.",
    "prereq": [
      {
        "code": "SOC 5811",
        "subject": "SOC",
        "id": "5811"
      },
      {
        "code": "SOC 5811",
        "subject": "SOC",
        "id": "5811"
      }
    ]
  },
  {
    "uid": "003208",
    "code": "SOC3821",
    "subject": "SOC",
    "number": "3821",
    "honors": false,
    "writingIntensive": false,
    "name": "Computer Use:Stat",
    "fullname": "Computer Use for Social Statistics",
    "info": "Elementary computer use in social statistics applications. Use of  Statistical Package for Social Sciences (SPSS) for preparing and analyzing sociological data.  ",
    "prereq": []
  },
  {
    "uid": "818524",
    "code": "SOC3896",
    "subject": "SOC",
    "number": "3896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": []
  },
  {
    "uid": "009966",
    "code": "SOC4090",
    "subject": "SOC",
    "number": "4090",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Sociology",
    "fullname": "Topics in Sociology",
    "info": "Topics specified in Class Schedule.\n\nprereq: 1001 recommended; soc majors/minors must register A-F; cr will not be granted if cr has been received for the same topics title",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "807382",
    "code": "SOC4090W",
    "subject": "SOC",
    "number": "4090",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics in Sociology",
    "fullname": "Topics in Sociology",
    "info": "Topics specified in Class Scheduleprereq: Soc majors and minors must register A-F; credit not granted if credit has been received for the same topics title.",
    "prereq": []
  },
  {
    "uid": "009967",
    "code": "SOC4091",
    "subject": "SOC",
    "number": "4091",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study of an established 4xxx course.  Available only by request.",
    "prereq": []
  },
  {
    "uid": "009968",
    "code": "SOC4093",
    "subject": "SOC",
    "number": "4093",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study at junior or senior level.Prereq instr consent, dept consent, college consent; soc majors/minors must register A-F.",
    "prereq": []
  },
  {
    "uid": "009969",
    "code": "SOC4094W",
    "subject": "SOC",
    "number": "4094",
    "honors": false,
    "writingIntensive": true,
    "name": "Capstone Exp: Dir Research",
    "fullname": "Capstone Experience: Directed Research (4 cr.)",
    "info": "Faculty guided and self directed research experience at junior/senior level. This is designed to: a) provide students with an opportunity to reflect on what they have learned as a sociology major; b) use that knowledge to write a sociological analyses; and c) think about how the knowledge, skills, and insights of the sociological enterprise can be used and applied outside of the University. Through this one:one capstone experience majors will emphasize the relationship between a sociological perspective and critical thinking, effective communication, and meaningful civil engagement. This Capstone Experience: Directed Research is to include but not limited to: bi-weekly meetings, literature review, multiple drafts and revisions, etc. prereq: 1001, 3701, 3801, 3811, at least 12 cr upper div sociology electives, dept & instructor consent.",
    "prereq": {
      "and": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "code": "SOC 3701",
          "subject": "SOC",
          "id": "3701"
        },
        {
          "code": "SOC 3801",
          "subject": "SOC",
          "id": "3801"
        },
        {
          "code": "SOC 3811",
          "subject": "SOC",
          "id": "3811"
        }
      ]
    }
  },
  {
    "uid": "002541",
    "code": "SOC4101W",
    "subject": "SOC",
    "number": "4101",
    "honors": false,
    "writingIntensive": true,
    "name": "Sociology of Law",
    "fullname": "Sociology of Law",
    "info": "This course will consider the relationship between law and society, analyzing law as an expression of cultural values, a reflection of social and political structure, and an instrument of social control and social change. Emphasizing a comparative perspective, we begin by discussing theories about law and legal institutions. We then turn our attention to the legal process and legal actors, focusing on the impact of law, courts, and lawyers on the rights of individuals.  Although this course focuses on the US legal system, we will explore issues of the relationship between US law and global law and concepts of justice.prereq: [[SOC 1001] and [SOC 1101 or 3101 or 3102]] recommended, Sociology majors/minors must register A-F",
    "prereq": {
      "and": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "or": [
            {
              "code": "SOC 1101",
              "subject": "SOC",
              "id": "1101"
            },
            {
              "code": "SOC 3101",
              "subject": "SOC",
              "id": "3101"
            },
            {
              "code": "SOC 3102",
              "subject": "SOC",
              "id": "3102"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "002545",
    "code": "SOC4102",
    "subject": "SOC",
    "number": "4102",
    "honors": false,
    "writingIntensive": false,
    "name": "Criminology",
    "fullname": "Criminology",
    "info": "This class seeks to develop an understanding of patterns of crime and punishment in the United States (including American particularities in international comparison), their social, political, economic, cultural, and institutional conditions, and how these patterns relate to broader sociological themes. We will examine a cross-section of most outstanding recent and some (by now) classical criminological and sociological books and a few articles that have attracted much attention among scholars and/or the broader public.prereq: [SOC 3101 or SOC 3102 or instr consent], Sociology majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "793006",
    "code": "SOC4103",
    "subject": "SOC",
    "number": "4103",
    "honors": false,
    "writingIntensive": false,
    "name": "Service-Learning/Criminology",
    "fullname": "Service-Learning in Criminology",
    "info": "Community-based work in child/adolescent development. Interventions for \"at-risk\" children and juvenile offenders. Criminal careers, offending over life-course. Direct engagement with criminology and public responses to crime.",
    "prereq": []
  },
  {
    "uid": "806414",
    "code": "SOC4104",
    "subject": "SOC",
    "number": "4104",
    "honors": false,
    "writingIntensive": false,
    "name": "Crime and Human Rights",
    "fullname": "Crime and Human Rights",
    "info": "This course addresses serious violations of humanitarian and human rights law, efforts to criminalize those violations (laws and institutions), and consequences of these efforts. Special attention will be paid to the impact interventions have on representations and memories of atrocities on responses and the future of cycles of violence. Case studies on Holocaust, Balkan wars, Darfur, My Lai massacre, etc. Criminal justice, truth commissions, vetting, compensation programs.prereq: SOC 1001, at least one 3xxx SOC course recommended, Sociology majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "002546",
    "code": "SOC4105",
    "subject": "SOC",
    "number": "4105",
    "honors": false,
    "writingIntensive": false,
    "name": "Punishment",
    "fullname": "Sociology of Punishment",
    "info": "The purpose of this class is to develop a working understanding of the sociology of punishment. To that end, the course focuses on three interrelated questions: How do various social factors (the economy, culture, crime, media, race relations, etc.) shape the development of criminal punishment? Why does punishment differ across time and place? How do penal laws, practices, and institutions affect individuals, groups, and communities? The course combines lectures and small and large group discussions. prereq: 3101 or 3102 recommended; soc majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "813949",
    "code": "SOC4106",
    "subject": "SOC",
    "number": "4106",
    "honors": false,
    "writingIntensive": false,
    "name": "Crime on TV",
    "fullname": "Crime on TV",
    "info": "This course uses television shows to explore sociological perspectives on crime and punishment. We will critically examine how (and to what extent) four television series represent or distort prevailing knowledge about crime and punishment.prereq: recommended [1001 or 1011V, 1101 or 3101 or 3102]; Soph or above or instr consent; soc majors/minors must register A-F.",
    "prereq": {
      "and": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "code": "SOC 1101",
          "subject": "SOC",
          "id": "1101"
        },
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "002543",
    "code": "SOC4107",
    "subject": "SOC",
    "number": "4107",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparative Law",
    "fullname": "Comparative Law and Social Control",
    "info": "Sociological analysis of legal systems in different countries. Relationship between legal systems and society. Cross-national variation in crime rates, criminal justice systems, legal doctrine, litigation, and lawyers.",
    "prereq": []
  },
  {
    "uid": "002607",
    "code": "SOC4108",
    "subject": "SOC",
    "number": "4108",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues:Crime Control",
    "fullname": "Current Issues in Crime Control",
    "info": "Selected current criminal justice policies from perspective of courts, legislature, community, and interest groups. Impact of criminal justice policy changes on society and on social control agencies.prereq: Soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "002614",
    "code": "SOC4109",
    "subject": "SOC",
    "number": "4109",
    "honors": false,
    "writingIntensive": false,
    "name": "Dom. Crim Violence",
    "fullname": "Domestic Criminal Violence",
    "info": "Survey of research on family violence within criminological framework. Definition of domestic violence. Empirical/theoretical approaches. Response of social control agencies.prereq: 3101 or 3102 or 3111 or instr consent; soc majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        },
        {
          "code": "SOC 3111",
          "subject": "SOC",
          "id": "3111"
        }
      ]
    }
  },
  {
    "uid": "002509",
    "code": "SOC4111",
    "subject": "SOC",
    "number": "4111",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Deviance",
    "fullname": "Sociology of Deviance",
    "info": "This course considers why and how certain attributes and behaviors are defined as deviant, the consequences of deviant labels, and how norms, values, and rules are made and enforced. We will discuss basic concepts that cut across deviance theories and research, including social control, subcultures and deviant careers. We will explore theories of and societal reaction to deviant behavior. We will also discuss methodology and how the “social facts” of deviance are determined and disseminated. Finally, we will examine case studies addressing crime, organizational and occupational deviance, substance use, sexuality, body image, and more.prereq: Soc 3101 or 3102 recommended; Sociology majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "819464",
    "code": "SOC4113",
    "subject": "SOC",
    "number": "4113",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Violence",
    "fullname": "Sociology of Violence: Bedrooms, Backyards, and Bars",
    "info": "This course looks at violent behavior across a wide variety of social arenas, bedrooms, backyards, and bars, being some common places where violence occurs. Students will wrestle with definitions of violence and the circumstances in which behavior is or isn't categorized as violent. A major theme will be how violence operates as a property of institutional arrangements, organizational practices, and interpersonal situations. Subtopics intersecting violence include cohorts (race, class, & gender), sport, sex, emotion, the State, and the environment.Soc Majors and Minors must register A/F.  Pre-req of Soc 1001, Soc 1101, 3101 or 3102 is recommended. ",
    "prereq": []
  },
  {
    "uid": "002634",
    "code": "SOC4114",
    "subject": "SOC",
    "number": "4114",
    "honors": false,
    "writingIntensive": false,
    "name": "Women & Criminal Justice",
    "fullname": "Women & the Criminal Justice System",
    "info": "Historical/current explanations for female criminality. Current trends in women's participation in crime, their treatment in the legal system.prereq: recommend 3101 or 3102 or instr consent; soc majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "002560",
    "code": "SOC4125",
    "subject": "SOC",
    "number": "4125",
    "honors": false,
    "writingIntensive": false,
    "name": "Policing America",
    "fullname": "Policing America",
    "info": "This course is an in-depth sociological analysis of the origins, composition, and effects of policing in contemporary U.S. society. Throughout the course, we focus on using a social science lens to understand policing dynamics and how policing shapes social life. We will pay particular attention to the ways in which race, class, and gender inequalities are reflected in and reshaped by policing practices. Throughoutthe course, we will draw on contemporary media stories, podcast, documentaries, and guest visitors to connect scholarship with the world around us.prereq: 3101 or 3102 recommended or instr consent, soc majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "825279",
    "code": "SOC4133",
    "subject": "SOC",
    "number": "4133",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender, Sex, and Crime",
    "fullname": "Sociology of Gender, Sex, and Crime",
    "info": "Crime and criminal justice is a gendered phenomena. In this seminar course, we will examine the contribution of feminist theoretical work to the field of criminology and to our understanding of how gender prescriptives are embedded in and influence criminal behaviors, the operation of the criminal justice system, and our conceptualizations of both. In so doing, we will critically assess the experiences of women, men and transgender persons in the criminal justice system as victims, offenders, and defendants. The readings are drawn from a broad range of interdisciplinary empirical works. Students should critically assess both the strengths and limitations of the research. Lecture will be accompanied by class discussion, film segments (as well as legal proceedings), and small group work.Soc 1001 or Soc 1101 recommended; Soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "002563",
    "code": "SOC4135",
    "subject": "SOC",
    "number": "4135",
    "honors": false,
    "writingIntensive": false,
    "name": "White-Collar Crime",
    "fullname": "Sociology of White-Collar Crime",
    "info": "This course deals with diverse types of white-collar crime (high status, occupational, organizational crimes), their causation, the damage they cause, and their control. We will read some of the outstanding literature on these issues and explore well-known cases in depth. There will be lectures and discussion in the classroom. We will explore what white-collar crime teaches us about the nature and explanation of crime and about the nature of criminal justice and other government social control.prereq: [SOC 3101 or SOC 3102 or instr consent]; soc majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "002507",
    "code": "SOC4141",
    "subject": "SOC",
    "number": "4141",
    "honors": false,
    "writingIntensive": false,
    "name": "Youth Crime & Punishment",
    "fullname": "Youth Crime & Punishment",
    "info": "This course offers an overview of social theory and research on youth crime, punishment,  and delinquency. We start by critically examining the social facts surrounding the measurement, extent, and distribution of delinquency. Next, we study the principal sociological explanations of delinquent behavior. These theories provide conceptual tools for analyzing delinquency and punishment among groups such as gang members. We then trace youth experiences in the juvenile justice system, from policing, to juvenile court, to probation, and institutionalization. Throughout, we analyze the success or failure of key programs implemented in attempts to prevent or reduce delinquency.prereq: Soc 3101 or 3102 recommended; Sociology majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "003014",
    "code": "SOC4142",
    "subject": "SOC",
    "number": "4142",
    "honors": false,
    "writingIntensive": false,
    "name": "Adolescents and Legal System",
    "fullname": "Adolescents and the Legal System",
    "info": "This is a course covers the legal and social statuses of juveniles in our society. A recurrent theme is the power relationships among minors, their families, social institutions, and the legal system. Issues dealing with delinquent behavior are discussed in terms of different behaviors with which a juvenile justice system has to deal, such as the matter of certification to adult courts, the procedures in different jurisdictions for such matters, and death penalty issues which arose with juveniles and the consequences of several recent Supreme Court cases.prereq: soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "809771",
    "code": "SOC4145",
    "subject": "SOC",
    "number": "4145",
    "honors": false,
    "writingIntensive": false,
    "name": "Youth Punishment & Corrections",
    "fullname": "Youth Punishment & Corrections",
    "info": "Development/transformation of juvenile justice system/related institutions. Racial/gender disparities in treatment, transfer of young people from juvenile to criminal court. Incarceration of juvenile offenders in adult prisons, collateral sanctions, crime desistance, re-entry.    ",
    "prereq": []
  },
  {
    "uid": "002511",
    "code": "SOC4147",
    "subject": "SOC",
    "number": "4147",
    "honors": false,
    "writingIntensive": false,
    "name": "Mental Health & Illness",
    "fullname": "Sociology of Mental Health & Illness",
    "info": "This course is designed to give you an overview of the ways a sociological perspective informs our understanding of mental health and illness. While sociologists, psychologists, psychiatrists, social workers, and others all deal with issues of mental illness, they often approach the topic in very different ways. In general, a sociological perspective tends to focus on aspects of the social environment that we often ignore, neglect, or take for granted. It calls attention to how society or groups are organized, who benefits or is hurt by the way things are organized, and what beliefs shape our behaviors. In viewing mental illness, sociologists have primarily challenged dominant views of mental illness, examined how social relationships play a role in mental illness, questioned the goals and implications of mental health policy and researched how mental health services are organized and provided. prereq: Soc 1001 recommended, Soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "003012",
    "code": "SOC4148",
    "subject": "SOC",
    "number": "4148",
    "honors": false,
    "writingIntensive": false,
    "name": "Mental Disorder &  Legal Sys",
    "fullname": "Mental Disorder and the Legal System",
    "info": "Psychiatric/psychological aspects of antisocial/criminal behavior as related to issues faced in courts and criminal justice system.",
    "prereq": []
  },
  {
    "uid": "003011",
    "code": "SOC4149",
    "subject": "SOC",
    "number": "4149",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Killing",
    "fullname": "Sociology of Killing",
    "info": "This course will provide a broad overview of the sociology of murder- the intentional, malicious killing of one human by another. This course will go beyond what we see about murder regularly in the media and on popular TV shows and movies.  Students will be exposed to a scientific study of homicide. Key topics include the history and laws of murder; information and data sources on murder; demographic attributes of victims and offenders; different types of murder, including among others domestic, serial, mass, and gang-related murder; biological, sociological and psychological theories of the causes of murder; and the strategies involved in the criminal investigation of homicide.prereq: jr, or sr, or grad student, or instr consent; soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "003063",
    "code": "SOC4161",
    "subject": "SOC",
    "number": "4161",
    "honors": false,
    "writingIntensive": false,
    "name": "Criminal Law",
    "fullname": "Criminal Law in American Society",
    "info": "Purposes of criminal law and of principles of criminal liability, justification, and excuse. Applications to law of criminal homicide, sexual assault, drugs, and crimes against property, public order, and morals.prereq: Soc 3101 or 3102 recommended; soc majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "003083",
    "code": "SOC4162",
    "subject": "SOC",
    "number": "4162",
    "honors": false,
    "writingIntensive": false,
    "name": "Criminal Procedure",
    "fullname": "Criminal Procedure in American Society",
    "info": "How constitutional democracy balances need to enforce criminal law and rights of individuals to be free of unnecessary government intrusion.prereq: Soc 3101 or 3102 recommended; soc majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "791273",
    "code": "SOC4171",
    "subject": "SOC",
    "number": "4171",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of International Law",
    "fullname": "Sociology of International Law: Human Rights & Trafficking",
    "info": "This course takes a sociological approach to international law, considering how history, institutions, power, and interests shape the phenomenon. What is international law, where does it come from, and how does it work? What does international law tell us about globalization and nation-states? Does it make a difference in the world? Does it have a real impact on the day-to-day lives of individuals? When is it followed; when is it ignored? This course takes a broad sociological view of international law. We analyze the actors and processes that constitute international law and then focus on particular substantive areas, including human rights, economic development,environmental concerns, trafficking, and drug interdiction.prereqs: 1001 or 3101 or 3102 or instr consent; soc majors/minors must register A-F",
    "prereq": {
      "or": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "code": "SOC 3101",
          "subject": "SOC",
          "id": "3101"
        },
        {
          "code": "SOC 3102",
          "subject": "SOC",
          "id": "3102"
        }
      ]
    }
  },
  {
    "uid": "791274",
    "code": "SOC4175",
    "subject": "SOC",
    "number": "4175",
    "honors": false,
    "writingIntensive": false,
    "name": "Law, Politics, and Inequality",
    "fullname": "Law, Politics, and Inequality",
    "info": "Critically evaluates law as a resource that defines, reinforces, and alters social relationships. Connection between law and justice. Law seen from perspective of class, race, or gender.",
    "prereq": []
  },
  {
    "uid": "798477",
    "code": "SOC4190",
    "subject": "SOC",
    "number": "4190",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Topics: Law, Crime, Jus",
    "fullname": "Topics in Sociology With Law, Criminology, and Justice Emphasis",
    "info": "Topics specified in Class Schedule.\n\nprereq: [1001, [3101 or 3102]] recommended; soc majors/minors must register A-F; cr will not be granted if cr has been received for the same topics title",
    "prereq": {
      "and": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "or": [
            {
              "code": "SOC 3101",
              "subject": "SOC",
              "id": "3101"
            },
            {
              "code": "SOC 3102",
              "subject": "SOC",
              "id": "3102"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "820492",
    "code": "SOC4243W",
    "subject": "SOC",
    "number": "4243",
    "honors": false,
    "writingIntensive": true,
    "name": "Brewing Society",
    "fullname": "Brewing Society: Alcohol & Social Life",
    "info": "What does our relationship with drink have to tell us about contemporary society and our own lives? The history of alcoholic drink is entwined with the history of human society itself. We use drinking as a window through which we can better understand roles, relationships, social boundaries, and cultural change. We bring sociological perspectives to bear on alcohol advertising, campus drinking, and more. There are reasons why alcoholic beverages have played a role in almost all human societies. Social barriers can be lowered, new friendships made, and old relationships reestablished when people get together over a drink. Cultural and political battles about alcohol can also be a way to see social divisions, power struggles, and hierarchies. And of course, drinking can be a route to all sorts of bad behavior and social problems too. We look at all of this, first in historical and cross-cultural perspective and then focusing on our own contemporary society.  Pre-req:  Soc 1001 recommended, Soc majors must register A-F",
    "prereq": []
  },
  {
    "uid": "795370",
    "code": "SOC4246",
    "subject": "SOC",
    "number": "4246",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Health & Illness",
    "fullname": "Sociology of Health and Illness",
    "info": "This course is an introduction to the importance of health and illness in peoples lives, how social structures impact who gets sick, how they are treated, and how the delivery of health care is organized. By the end of the course you will be familiar with the major issues in the sociology of health and illness, and understand that health and illness are not just biological processes, but profoundly shaped by the organization of society.prereq: One sociology course recommended; soph or above; soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "008546",
    "code": "SOC4305",
    "subject": "SOC",
    "number": "4305",
    "honors": false,
    "writingIntensive": false,
    "name": "Environment & Society",
    "fullname": "Environment & Society: An Enduring Conflict",
    "info": "Examines the interaction between human society and the natural environment, focusing on the contemporary and global situation. Takes the perspective of environmental sociology concerning the short-range profit-driven and ideological causes of ecological destruction. Investigates how society is reacting to that increasing destruction prereq: 1001 recommended or a course on the environment, soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "797771",
    "code": "SOC4309",
    "subject": "SOC",
    "number": "4309",
    "honors": false,
    "writingIntensive": false,
    "name": "Religion in Public Life",
    "fullname": "Religion in American Public Life: Culture, Politics, & Communities",
    "info": "How diversity/vitality of American religion shape public life. How religious groups engage in political action, foster understandings of democracy/styles of civic participation. Volunteering/service activities. Race, poverty, the family, sexuality.prereq: Soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "798270",
    "code": "SOC4311",
    "subject": "SOC",
    "number": "4311",
    "honors": false,
    "writingIntensive": false,
    "name": "Power, Justice & Environment",
    "fullname": "Power, Justice & the Environment",
    "info": "This course introduces students to the theoretical and historical foundations of environmental racism and environmental inequality more broadly. We will examine and interrogate both the social scientific evidence concerning these phenomena and the efforts by community residents, activists, workers, and governments to combat it. We will consider the social forces that create environmental inequalities so that we may understand their causes, consequences, and the possibilities for achieving environmental justiceprereq: SOC 1001 recommended",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "814463",
    "code": "SOC4315",
    "subject": "SOC",
    "number": "4315",
    "honors": false,
    "writingIntensive": false,
    "name": "Memory Politics after Genocide",
    "fullname": "Never Again! Memory & Politics after Genocide",
    "info": "Course focuses on the social repercussions and political consequences of large-scale political violence, such as genocide, war crimes, and crimes against humanity. Students learn how communities and states balance the demands for justice and memory with the need for peace and reconciliation and addresses cases from around the globe and different historical settings.prereq: SOC 1001 or 1011V recommended, A-F required for Majors/Minors.",
    "prereq": {
      "or": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "code": "SOC 1011",
          "subject": "SOC",
          "id": "1011"
        }
      ]
    }
  },
  {
    "uid": "820180",
    "code": "SOC4319",
    "subject": "SOC",
    "number": "4319",
    "honors": false,
    "writingIntensive": false,
    "name": "Global Antisemitism",
    "fullname": "“Jews will not replace us!” Global Antisemitism from its Origins to the Present",
    "info": "This course will explore the topic of antisemitism, its history and cultural logic, and the relation to other forms of exclusion tied to race, religion, and citizenship in modern times. Starting with the history of Jewish emancipation in Europe and the subsequent debates about the “Jewish Question,” students will learn to identify the key features of political antisemitism and the ways that antisemitism has been explained by different social theories, including Marxism, Functionalism, and Critical theory. The course will examine the differences and continuities between older theological forms of anti-Judaism and modern antisemitism, the connections between antisemitism, nativism, and xenophobia in the US and globally, and engage with current debates regarding the correlation between anti-Zionism and antisemitism. We will also explore Jewish social, political, and ideological responses to antisemitism in Europe and the US, from the Holocaust to the present.Pre-reqs: sophomore or above; Soc 3701 recommended; soc majors/minors must register A-F ",
    "prereq": []
  },
  {
    "uid": "791275",
    "code": "SOC4321",
    "subject": "SOC",
    "number": "4321",
    "honors": false,
    "writingIntensive": false,
    "name": "Globalize This!",
    "fullname": "Globalize This! Understanding Globalization through Sociology",
    "info": "From the city streets of Bangalore to the high plateaus of La Paz to the trading floors of New York City, people from around the world are becoming increasingly interdependent, creating new and revitalizing old forms of power and opportunity, exploitation and politics, social organizing and social justice. This course offers an overview of the processes that are forcing and encouraging people’s lives to intertwine economically, politically, and culturally.SOC majors/minors must register A-F.",
    "prereq": []
  },
  {
    "uid": "803455",
    "code": "SOC4411",
    "subject": "SOC",
    "number": "4411",
    "honors": false,
    "writingIntensive": false,
    "name": "Terrorist Networks",
    "fullname": "Terrorist Networks & Counterterror Organizations",
    "info": "Terror involves using violent actions to achieve political, religious, or social goals. This course examines theories and evidence about the origins, development, and consequences of terrorist networks. It analyzes efforts to prevent, investigate, and punish terrorists by counter-terror organizations, including law enforcement, security, and military forces. Graduate and honors students are expected to demonstrate greater depth of discussion, depth, and, to a degree, length of writing assignments, presentations, and leadership of the students.Prereq: Sociology majors/minors must register A-F ",
    "prereq": []
  },
  {
    "uid": "008197",
    "code": "SOC4441",
    "subject": "SOC",
    "number": "4441",
    "honors": false,
    "writingIntensive": false,
    "name": "Work-Family Links",
    "fullname": "Work-Family Links",
    "info": "Effects of spouses' work experiences on family, organization of household work, adolescent employment, and occupational attainment. Changes in work organizations related to increasing prevalence of female employment and dual-earner families.",
    "prereq": []
  },
  {
    "uid": "801750",
    "code": "SOC4451",
    "subject": "SOC",
    "number": "4451",
    "honors": false,
    "writingIntensive": false,
    "name": "Sport, Culture & Society",
    "fullname": "Sport, Culture & Society",
    "info": "This course is intended to stimulate critical, sociological thinking about sport? how it is socially organized, who participates in what and why, what role (or roles) sport plays in society, and what sporting practices tell us about contemporary social life more generally. It begins from and is grounded in the notion that sport is one of the most powerful and paradoxical institutions in the modern world. The course is intended for a wide range of undergraduates, though some familiarity with basic social scientific thinking and techniques will be helpful. prereq: SOC 1001 recommended, Sociology majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "003444",
    "code": "SOC4461",
    "subject": "SOC",
    "number": "4461",
    "honors": false,
    "writingIntensive": false,
    "name": "Ethnic and Racial Conflict",
    "fullname": "Sociology of Ethnic and Racial Conflict",
    "info": "\"I can't breathe.\" The last words of George Floyd. Words that traumatized a nation, and the world. While the death of George Floyd galvanized peoples worldwide to speak out against discrimination and inequality, well before his death studies suggested that ethnic and racial discrimination and conflict re-occur on an ongoing basis. From the events of the Holocaust - to the genocide against the Rohingya in Myanmar - to the torture of Uighurs in China - to the Atlantic slave trade - we explore how identities are formed - and thereafter - how those same identities are deployed - to exclude and marginalize - with targeted precision. Across the world, we examine how racial bias and racial animus contribute to slavery, torture, mass displacement, economic destitution, and genocide.prereq: 1001 recommended; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "803156",
    "code": "SOC4511",
    "subject": "SOC",
    "number": "4511",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Children & Youth",
    "fullname": "Sociology of Children & Youth",
    "info": "This course examines the lives of youth in today's society. It explores the influence of social contexts, institutions, social structures, and social location (e.g. social class, race, gender) on youth experiences and differential opportunities and outcomes. The course also considers how youth act as agents in their own lives and shape their social worlds and society. Additionally, the course looks at some of the problems or challenges that contemporary children, adolescents, and young adults encounter, and considers social policies and interventions aimed to address these and support young people. prereq: 1001 recommended, soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "793007",
    "code": "SOC4521",
    "subject": "SOC",
    "number": "4521",
    "honors": false,
    "writingIntensive": false,
    "name": "Love, Sex, & Marriage",
    "fullname": "Love, Sex, & Marriage",
    "info": "This course will provide an overview of sociological approaches to intimate human relationships. What can sociology and related disciplines tell us about these seemingly intensely personal subjects? More than you might think! Specific topics we will cover include love and romance, dating and mate selection, sexuality, cohabitation, marriage, and divorce. The focus is on contemporary American society, but current U.S. practices are placed in historical and cross-cultural context.prereq: [1001 or instr consent], soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "796961",
    "code": "SOC4551",
    "subject": "SOC",
    "number": "4551",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Sexualities",
    "fullname": "Sociology of Sexualities",
    "info": "In this course we will examine social theories and sociological research on the topic of sexuality. We will explore the concept of sexuality as it intersects with race, gender, age, and class. This course is designed to give you a basic understanding of sociological implications of sexuality in the United States. This course is intended to help you develop your analytical and critical thinking skills. You will be asked to move beyond your own experience and perspectives to sociologically analyze and evaluate over-simplified explanations of past and contemporary issues as they appear in our course readings. prereq: Sociology majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "003430",
    "code": "SOC4601",
    "subject": "SOC",
    "number": "4601",
    "honors": false,
    "writingIntensive": false,
    "name": "Compar Soc Struct",
    "fullname": "Comparative Social Structure",
    "info": "Comparative analysis of selected societies. Differences/similarities in social structure, development, trends. Social class, status, political economy, policies, social movements, ethic identities, multicultures, demography. Network models, Boolean analysis.",
    "prereq": []
  },
  {
    "uid": "002584",
    "code": "SOC4681",
    "subject": "SOC",
    "number": "4681",
    "honors": false,
    "writingIntensive": false,
    "name": "German Society",
    "fullname": "Sociology of German Society",
    "info": "The making of German society; institutions in cross-national comparison (including family, education, welfare state, social movements, law); and current issues of German society.",
    "prereq": []
  },
  {
    "uid": "003244",
    "code": "SOC4703",
    "subject": "SOC",
    "number": "4703",
    "honors": false,
    "writingIntensive": false,
    "name": "A Nation Divided",
    "fullname": "A Nation Divided: Identity, Precarity, & Polarization",
    "info": "This course explores how individuals and groups experience and understand current economic and political polarization in their daily lives. Our explorations will roam across changes in media and popular culture, work, religion, family, and social movements.prereq: 1001 recommended, soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "003209",
    "code": "SOC4821",
    "subject": "SOC",
    "number": "4821",
    "honors": false,
    "writingIntensive": false,
    "name": "Measuring the Social World",
    "fullname": "Measuring the Social World: Concepts and Analysis",
    "info": "In this course, you will develop practical social science data analysis skills for use in the non-profit or corporate workplace or in a graduate program of research. You will assess the measurement of important social concepts, like race, health, or education, in large social surveys, and the strengths and weaknesses of those different measurement techniques. You will conduct data analysis on large datasets (see, e.g., www.ipums.org) using a statistical software program, such as STATA. You will develop a substantive, empirical final project (poster and paper) based on your analysis.prereq: SOC 3801 or equiv, and SOC 3811 or equivalent",
    "prereq": {
      "and": [
        {
          "code": "SOC 3801",
          "subject": "SOC",
          "id": "3801"
        },
        {
          "code": "SOC 3811",
          "subject": "SOC",
          "id": "3811"
        }
      ]
    }
  },
  {
    "uid": "817941",
    "code": "SOC4881",
    "subject": "SOC",
    "number": "4881",
    "honors": false,
    "writingIntensive": false,
    "name": "Pop Studies Research Practicum",
    "fullname": "Population Studies Research Practicum",
    "info": "Students enrolled in this course will gain hands-on experience with population studies research by (1) working under the mentorship of an individual researcher or a research team at the Minnesota Population Center (MPC) and (2) attending and reflecting in writing on MPC's weekly research seminar. In addition, students in the course will meet weekly with the instructor to discuss their research experiences and to develop and present a final research poster. ",
    "prereq": []
  },
  {
    "uid": "008136",
    "code": "SOC4966W",
    "subject": "SOC",
    "number": "4966",
    "honors": false,
    "writingIntensive": true,
    "name": "Capstone Experience: Seminar",
    "fullname": "Capstone Experience: Seminar",
    "info": "This course is designed to: a) provide students with an opportunity to reflect on what they have learned as a sociology major; b) use that knowledge to write a sociological analyses - often based on community service learning; and c) think about how the knowledge, skills, and insights of the sociological enterprise can be used and applied outside of the University. Through this course sociology majors will emphasize the relationship between a sociological perspective and critical thinking, effective communication, and meaningful civic engagement. This class is the final step in the sociology undergraduate major.prereq: 1001, 3701, 3801, 3811, 12  cr upper div sociology, dept consent",
    "prereq": {
      "and": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "code": "SOC 3701",
          "subject": "SOC",
          "id": "3701"
        },
        {
          "code": "SOC 3801",
          "subject": "SOC",
          "id": "3801"
        },
        {
          "code": "SOC 3811",
          "subject": "SOC",
          "id": "3811"
        }
      ]
    }
  },
  {
    "uid": "014581",
    "code": "SOC4994W",
    "subject": "SOC",
    "number": "4994",
    "honors": false,
    "writingIntensive": true,
    "name": "Capstone Exp: Dir Research",
    "fullname": "Capstone Experience: Directed Research (1 cr.)",
    "info": "Guided individual research for the sociology major's Capstone requirement, conducted in conjunction with enrollment in an upper division sociology elective. This is designed to: a) provide students with an opportunity to reflect on what they have learned as a sociology major; b) use that knowledge to write a sociological analyses; and c) think about how the knowledge, skills, and insights of the sociological enterprise can be used and applied outside of the University. Through this one:one capstone experience, using the structure and foundation of the 6th Sociology elective, majors will emphasize the relationship between a sociological perspective and the emphasis of the course. The final paper created for 4994W is in addition to the other 6th Sociology elective course requirements.    prereq: 1001/1011V, 3701, 3801, 3811, and at least 12 cr upper div sociology electives; dept & instructor consent.  Students are only authorized to register for Soc 4994W in conjunction with a 6th Sociology Elective.",
    "prereq": {
      "and": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "code": "SOC 3701",
          "subject": "SOC",
          "id": "3701"
        },
        {
          "code": "SOC 3801",
          "subject": "SOC",
          "id": "3801"
        },
        {
          "code": "SOC 3811",
          "subject": "SOC",
          "id": "3811"
        }
      ]
    }
  },
  {
    "uid": "014928",
    "code": "SOC5090",
    "subject": "SOC",
    "number": "5090",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Sociology",
    "fullname": "Topics in Sociology",
    "info": "Topics specified in Class Schedule.prereq: Undergrad soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "009769",
    "code": "SOC5091",
    "subject": "SOC",
    "number": "5091",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study of an established 5xxx course.",
    "prereq": []
  },
  {
    "uid": "814947",
    "code": "SOC5101",
    "subject": "SOC",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Law",
    "fullname": "Sociology of Law",
    "info": "This course will consider the relationship between law and society, analyzing law as an expression of cultural values, a reflection of social and political structure, and an instrument of social control and social change. Emphasizing a comparative perspective, we begin by discussing theories about law and legal institutions. We then turn our attention to the legal process and legal actors, focusing on the impact of law, courts, and lawyers on the rights of individuals. Although this course focuses on the U.S. legal system, we will explore issues of the relationship between U.S. law and global law and concepts of justice. prereq: graduate student",
    "prereq": []
  },
  {
    "uid": "816451",
    "code": "SOC5104",
    "subject": "SOC",
    "number": "5104",
    "honors": false,
    "writingIntensive": false,
    "name": "Crime and Human Rights",
    "fullname": "Crime and Human Rights",
    "info": "This course addresses serious violations of humanitarian and human rights law, efforts to criminalize those violations (laws and institutions), and consequences of these efforts. Special attention will be paid to the impact interventions have on representations and memories of atrocities on responses and the future of cycles of violence. Case studies on Holocaust, Balkan wars, Darfur, My Lai massacre, etc. Criminal justice, truth commissions, vetting, compensation programs.prereq: at least one 3xxx SOC course recommended",
    "prereq": []
  },
  {
    "uid": "816467",
    "code": "SOC5171",
    "subject": "SOC",
    "number": "5171",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of International Law",
    "fullname": "Sociology of International Law: Human Rights & Trafficking",
    "info": "This course takes a sociological approach to international law, considering how history, institutions, power, and interests shape the phenomenon. What is international law, where does it come from, and how does it work? What does international law tell us about globalization and nation-states? Does it make a difference in the world? Does it have a real impact on the day-to-day lives of individuals? When is it followed; when is it ignored? This course takes a broad sociological view of international law. We analyze the actors and processes that constitute international law and then focus on particular substantive areas, including human rights, economic development,environmental concerns, trafficking, and drug interdiction.prereqs: Graduate student or instructor consent",
    "prereq": []
  },
  {
    "uid": "818967",
    "code": "SOC5221",
    "subject": "SOC",
    "number": "5221",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Gender",
    "fullname": "Sociology of Gender",
    "info": "Gender is something so fundamental to our lives, to our identities, and how we interact with others that we often take it for granted. However, understandings of gender vary across time and place, and even within cultures, making it clear that our understandings of gender are not universal or timeless. In this class, we will examine how gender intersects with race and sexuality, as well as how it impacts areas of our lives such as child socialization, family structure, the media, intimate relationships, and the workplace.",
    "prereq": []
  },
  {
    "uid": "817276",
    "code": "SOC5246",
    "subject": "SOC",
    "number": "5246",
    "honors": false,
    "writingIntensive": false,
    "name": "Disease Disaster & Oth Killers",
    "fullname": "Disease, Disasters, and Other Killers",
    "info": "This course studies the social pattern of mortality, beginning with demographic transition theory. Students will study specific causes of death or theories of etiology, including theories about suicide, fundamental cause theory, and the role of early life conditions in mortality. Students learn tools for studying mortality, including cause of death classifications and life tables.Grad student or instructor consent.",
    "prereq": []
  },
  {
    "uid": "002500",
    "code": "SOC5301W",
    "subject": "SOC",
    "number": "5301",
    "honors": false,
    "writingIntensive": true,
    "name": "Social Movements",
    "fullname": "Social Movements",
    "info": "Origins, dynamics, and consequences of social movements.  Dilemmas and challenges facing movement organizations.  Relationship among movements, parties, and states and role of movements in bringing about change. Case studies of civil rights, labor, environmental, women's, gay rights, and student movements.",
    "prereq": []
  },
  {
    "uid": "816528",
    "code": "SOC5315",
    "subject": "SOC",
    "number": "5315",
    "honors": false,
    "writingIntensive": false,
    "name": "Memory Politics after Genocide",
    "fullname": "Never Again! Memory & Politics after Genocide",
    "info": "Course focuses on the social repercussions and political consequences of large-scale political violence, such as genocide, war crimes, and crimes against humanity. Students learn how communities and states balance the demands for justice and memory with the need for peace and reconciliation and addresses cases from around the globe and different historical settings.prereq: SOC 1001 or 1011V recommended, A-F required for Majors/Minors.",
    "prereq": {
      "or": [
        {
          "code": "SOC 1001",
          "subject": "SOC",
          "id": "1001"
        },
        {
          "code": "SOC 1011",
          "subject": "SOC",
          "id": "1011"
        }
      ]
    }
  },
  {
    "uid": "815638",
    "code": "SOC5411",
    "subject": "SOC",
    "number": "5411",
    "honors": false,
    "writingIntensive": false,
    "name": "Terrorist Networks",
    "fullname": "Terrorist Networks & Counterterror Organizations",
    "info": "Theories/evidence about origins, development, and consequences of terrorist networks. Efforts to prevent, investigate, and punish terrorists by use of law enforcement, security, and military forces. Terror involves using violent actions to achieve political, religious, or social goals. This course examines theories and evidence about the origins, development, and consequences of terrorist networks. It analyzes efforts to prevent, investigate, and punish terrorists by counterterror organizations, including law enforcement, security, and military forces. Graduate and honors students are expected to demonstrate greater depth of discussion, depth and to a degree length of writing assignments, presentations, and leadership of the students.Prereq:  Sociology Major/Minors must register A-F",
    "prereq": []
  },
  {
    "uid": "818429",
    "code": "SOC5446",
    "subject": "SOC",
    "number": "5446",
    "honors": false,
    "writingIntensive": false,
    "name": "Comparing Healthcare Systems",
    "fullname": "Comparing Healthcare Systems",
    "info": "Examination of national health systems from an international comparative perspective, emphasizing social, organizational, political, economic, cultural, and ethical dimensions of healthcare policies and programs to deliver services and their impacts on the health of population groups. The comparative approach will enable students to acquire a better understanding of the problems and potential for reforming and improving U.S. health care delivery.Students enrolled in Soc 5446 (graduate level) are expected to demonstrate greater depth of discussion, depth and to a degree length of writing assignments, presentations, and leadership of the students.prereq: Soc majors/minors must register A-F",
    "prereq": []
  },
  {
    "uid": "792021",
    "code": "SOC5455",
    "subject": "SOC",
    "number": "5455",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Education",
    "fullname": "Sociology of Education",
    "info": "Structures and processes within educational institutions. Links between educational organizations and their social contexts, particularly as these relate to educational change.prereq: 1001 or equiv or instr consent; soc majors/minors must register A-F",
    "prereq": {
      "code": "SOC 1001",
      "subject": "SOC",
      "id": "1001"
    }
  },
  {
    "uid": "809911",
    "code": "SOC5511",
    "subject": "SOC",
    "number": "5511",
    "honors": false,
    "writingIntensive": false,
    "name": "World Pop Problems",
    "fullname": "World Population Problems",
    "info": "Population growth, natural resources, fertility/mortality in less developed nations, population dynamics/forecasts, policies to reduce fertility.prereq: Soc majors/minors must register A-F, credit will not be granted if credit has been received for PA 5301",
    "prereq": {
      "code": "PA 5301",
      "subject": "PA",
      "id": "5301"
    }
  },
  {
    "uid": "001149",
    "code": "SOC5811",
    "subject": "SOC",
    "number": "5811",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Stats Grad Students",
    "fullname": "Social Statistics for Graduate Students",
    "info": "In this course, students will learn core statistical and computations principles that will allow them to perform quantitative analyses using social data. The course is designed for social science students at the beginning of their graduate school careers. However, advanced undergraduates can take the course, which will involve a few modifications to the assignment schedule. Sociology 5811 will review basic probability, and then move on to univariate inference, the linear regression model, and introductory lessons of causal inference. In doing so, students will explore statistical concepts and methods that provide the foundation sociologists use to most commonly collect and analyze numerical evidence. Sociology 5811 will also provide the foundation for data management and statistical inference using Stata, a statistical computing environment that is popular in the social sciences. prereq: Undergraduate students are expected to have familiarity with the materials taught in the equivalent of 3811. Students who are unsure of the course requirements should contact the instructor. Undergraduates with a strong math background are encouraged to register for 5811 in lieu of 3811. Soc majors must register A-F. 5811 is a good social statistics foundation course for MA students from other programs. 5811 will not count for credits towards the Soc PhD program requirements.",
    "prereq": {
      "code": "SOC 3811",
      "subject": "SOC",
      "id": "3811"
    }
  },
  {
    "uid": "009201",
    "code": "SOC8001",
    "subject": "SOC",
    "number": "8001",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology as a Profession",
    "fullname": "Sociology as a Profession",
    "info": "This 1 credit class fosters adaptation to the Graduate Program in Sociology and preparation for a sociological career. In the Fall, we explore professional careers in this field. We discuss the wide range of opportunities in sociology and help students further explore the next steps to becoming a scholar, educator, and member of various professional, intellectual, and social communities.  We share practical information about being a student in sociology and about sociological careers, discuss presentations in department workshop seminars, and provide a safe place to discuss issues of student concerns. Students are encouraged to bring to the class their thoughts and reactions to experiences during their first semester in the PhD program. The Spring 8001 class is oriented to particular milestones in the Sociology Graduate Program and important student activities (for example, preparing reading lists for the preliminary exam and then writing the preliminary exam, preparing a dissertation prospectus, writing grant proposals, preparing an article for publication, etc.). Pre-req: Soc PhD students ",
    "prereq": []
  },
  {
    "uid": "009203",
    "code": "SOC8011",
    "subject": "SOC",
    "number": "8011",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Sociology",
    "fullname": "Teaching Sociology: Theory & Practice",
    "info": "Social/political context of teaching. Ethical issues, multiculturalism, academic freedom. Teaching skills (e.g., lecturing, leading discussions). Active learning. Evaluating effectiveness of teaching. Opportunity to develop syllabus or teaching plan.prereq: Soc grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "009206",
    "code": "SOC8090",
    "subject": "SOC",
    "number": "8090",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Sociology",
    "fullname": "Topics in Sociology",
    "info": "Topics specified in Class Schedule.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "009427",
    "code": "SOC8091",
    "subject": "SOC",
    "number": "8091",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent study of an established 8xxx course.",
    "prereq": []
  },
  {
    "uid": "009774",
    "code": "SOC8093",
    "subject": "SOC",
    "number": "8093",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed study in sociology.prereq: Grad soc major or instr consent",
    "prereq": []
  },
  {
    "uid": "009778",
    "code": "SOC8094",
    "subject": "SOC",
    "number": "8094",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "May be used to fulfill sociology graduate requirement for advanced methodological training.",
    "prereq": []
  },
  {
    "uid": "008078",
    "code": "SOC8101",
    "subject": "SOC",
    "number": "8101",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc of Law",
    "fullname": "Sociology of Law",
    "info": "Sociological analysis of law and society. In-depth review of research on why people obey the law, of social forces involved in creation of law (both civil and criminal), procedures of enforcement, and impact of law on social change. ",
    "prereq": []
  },
  {
    "uid": "009208",
    "code": "SOC8111",
    "subject": "SOC",
    "number": "8111",
    "honors": false,
    "writingIntensive": false,
    "name": "Criminology",
    "fullname": "Criminology",
    "info": "Overview of theoretical developments and empirical research. Underlying assumptions, empirical generalizations, and current controversies in criminological research.",
    "prereq": []
  },
  {
    "uid": "789047",
    "code": "SOC8148",
    "subject": "SOC",
    "number": "8148",
    "honors": false,
    "writingIntensive": false,
    "name": "Law, Society & Mental Health",
    "fullname": "Law, Society, and the Mental Health System",
    "info": "Intensive survey of psychopathology. Reference to criminal behavior, criminal justice system.prereq: [Grad student, 4148] or instr consent",
    "prereq": {
      "code": "SOC 4148",
      "subject": "SOC",
      "id": "4148"
    }
  },
  {
    "uid": "817114",
    "code": "SOC8171",
    "subject": "SOC",
    "number": "8171",
    "honors": false,
    "writingIntensive": false,
    "name": "Perspectives in Human Rights",
    "fullname": "Cross-Disciplinary Perspectives in Human Rights",
    "info": "This seminar will approach human rights issues from a variety of \"disciplinary\" perspectives, including history, the arts, law, the social sciences, and praxis. Empirical work in the social sciences will receive somewhat greater emphasis. One key focus will be the unique advantages (and disadvantages) of the different perspectives and fruitful ways to combine them to strengthen action that improves human rights situations in countries around the world, including the United States.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "016579",
    "code": "SOC8190",
    "subject": "SOC",
    "number": "8190",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Law, Crime, Deviance",
    "fullname": "Topics in Law, Crime, and Deviance",
    "info": "Advanced topics in law, crime, and deviance. Social underpinnings of legal/illegal behavior and of legal systems.",
    "prereq": []
  },
  {
    "uid": "002728",
    "code": "SOC8201",
    "subject": "SOC",
    "number": "8201",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc. Stratification & Mobility",
    "fullname": "Social Stratification and Mobility",
    "info": "Form and content of hierarchical arrangements. Relationship of hierarchy to  social order and individual behavior. Structures of social stratification. Status attainment. Mobility. Inequality and economic development, social development, and technological change. Economic status in relation to social status, including race, gender.prereq: 3811 or equiv or instr consent",
    "prereq": {
      "code": "SOC 3811",
      "subject": "SOC",
      "id": "3811"
    }
  },
  {
    "uid": "008576",
    "code": "SOC8211",
    "subject": "SOC",
    "number": "8211",
    "honors": false,
    "writingIntensive": false,
    "name": "Race & Racialization",
    "fullname": "The Sociology of Race & Racialization",
    "info": "Major theoretical debates. Classic and contemporary theoretical approaches to studying U.S. race relations; contemporary and historical experiences of specific racial and ethnic groups.",
    "prereq": []
  },
  {
    "uid": "008201",
    "code": "SOC8221",
    "subject": "SOC",
    "number": "8221",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc of Gender",
    "fullname": "Sociology of Gender",
    "info": "Organization, culture, and dynamics of gender relations and gendered social structures. Sample topics: gender, race, and class inequalities in the workplace; women.s movement; social welfare and politics of gender inequality; theoretical and methodological debates in gender studies; sexuality; science; sociology of emotions.",
    "prereq": []
  },
  {
    "uid": "009780",
    "code": "SOC8290",
    "subject": "SOC",
    "number": "8290",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Race, Class, & Gender",
    "fullname": "Topics in Race, Class, Gender and other forms of Durable Inequality",
    "info": "Comparative perspectives on racial inequality; race, class, and gender; quantitative research on gender stratification; stratification in post-communist societies; institutional change and stratification systems; industrialization and stratification. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "002497",
    "code": "SOC8311",
    "subject": "SOC",
    "number": "8311",
    "honors": false,
    "writingIntensive": false,
    "name": "Political Sociology",
    "fullname": "Political Sociology",
    "info": "Social dimensions of political behavior and social origins of different forms of the state. How various theoretical traditions--Marxist, Weberian, and feminist--address key issues in political sociology, including citizenship, revolution, state formation, origins of democracy, welfare state, and fascism.",
    "prereq": []
  },
  {
    "uid": "788277",
    "code": "SOC8333",
    "subject": "SOC",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "009781",
    "code": "SOC8390",
    "subject": "SOC",
    "number": "8390",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Political Sociology",
    "fullname": "Topics in Political Sociology",
    "info": "Topics with common focus on social underpinnings of political behavior/change. Topics specified in Class Schedule. Sample topics: democracy and development, international legal and political systems, power and protest in advanced capitalist states, xenophobia and international migration, and civil society and democracy.",
    "prereq": []
  },
  {
    "uid": "001152",
    "code": "SOC8411",
    "subject": "SOC",
    "number": "8411",
    "honors": false,
    "writingIntensive": false,
    "name": "Formal Organization",
    "fullname": "Research on Formal Organizations",
    "info": "Theories of the structure of and behavior in corporations and bureaucracies. Corporate structure from standpoint of role expectations, transaction costs, and structural responses to organizational failures. Power, conflict, and bargaining in organizational decision making. Course content varies.",
    "prereq": []
  },
  {
    "uid": "796110",
    "code": "SOC8412",
    "subject": "SOC",
    "number": "8412",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Network Analysis",
    "fullname": "Social Network Analysis: Theory and Methods",
    "info": "Introduction to theoretical/methodological foundations of social network analysis. Concepts/principles, measurements, computer techniques. Applications to friendships, communities, workteams, intra-/inter-organizational relations, international systems. Focuses on network visualizations.",
    "prereq": []
  },
  {
    "uid": "008861",
    "code": "SOC8421",
    "subject": "SOC",
    "number": "8421",
    "honors": false,
    "writingIntensive": false,
    "name": "Work and Occupation",
    "fullname": "Work and Occupations",
    "info": "Sociological analysis of work, occupations, and labor markets, including contemporary theory and research. Course emphasis varies with instructor.",
    "prereq": []
  },
  {
    "uid": "788412",
    "code": "SOC8444",
    "subject": "SOC",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "009355",
    "code": "SOC8490",
    "subject": "SOC",
    "number": "8490",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Soc Org",
    "fullname": "Advanced Topics in Social Organization",
    "info": "Content varies with instructor. Sample topics: gender and organizations, interorganizational relations, comparative study of organizations, nonprofit organizations, consumer behavior, industry and technology, social networks, conflict, coercion, and social exchange. Topics specified in [Class Schedule].prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "009761",
    "code": "SOC8501",
    "subject": "SOC",
    "number": "8501",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc of Family",
    "fullname": "Sociology of the Family",
    "info": "Theoretical and empirical works from contemporary family sociology. Content varies with instructor. Sample topics: definitions of the family, family roles, family interactions, marriage and divorce, childbearing, parenthood, and cultural variations in families.",
    "prereq": []
  },
  {
    "uid": "009764",
    "code": "SOC8540",
    "subject": "SOC",
    "number": "8540",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Family Soc",
    "fullname": "Topics in Family Sociology",
    "info": "Families and mental health; families, work, and the labor market; historical/comparative research on the family. Topics specified in [Class Schedule].",
    "prereq": []
  },
  {
    "uid": "008859",
    "code": "SOC8551",
    "subject": "SOC",
    "number": "8551",
    "honors": false,
    "writingIntensive": false,
    "name": "Life Course Inequality Health",
    "fullname": "Life Course Inequality & Health",
    "info": "Seminar examines the changing life course in its social and historical context, including theoretical principles, methodologies, and policy implications. Focus on key societal institutions that offer unequal opportunities and constraints, depending on social class, race/ethnicity, and gender.  Unequal access to age-graded social roles and resources shape the course of development, and in doing so, they have profound impacts on health. We will consider how inequality in the family, education, work, the military, and in the health care & criminal justice systems influence health behaviors and outcomes at different ages and life stages.prereq: grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008980",
    "code": "SOC8590",
    "subject": "SOC",
    "number": "8590",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics Life Course",
    "fullname": "Topics in Life Course Sociology",
    "info": "Sociology of aging, sociology of youth, and mental health and adjustment in early life course. Topics specified in [Class Schedule].",
    "prereq": []
  },
  {
    "uid": "819465",
    "code": "SOC8607",
    "subject": "SOC",
    "number": "8607",
    "honors": false,
    "writingIntensive": false,
    "name": "Migration & Migrants",
    "fullname": "Migration & Migrants in Demographic Perspective",
    "info": "With fertility and mortality, migration is one of three core population processes. This course provides a graduate-level treatment of major theoretical and empirical debates in demographic/population research on migration and migrants. It examines topics like why and how people migrate, who migrates and who does not, and the effects of migration in migrant-receiving and migrant-sending areas. Along the way, it links to a number of related topics, including the impacts of migration on migrants themselves, the role of the state and policies governing migration and incorporation, and transnationalism. A common thread throughout is connecting these topics to issues of population size, composition, and change. While this course contains “demographic” in the title and fulfills requirements for graduate trainees and the population studies minor in the Minnesota Population Center, it is necessarily interdisciplinary in scope and draws from research in economics, demography/population studies, human geography, history, political science, population health, public policy, and sociology.Credit will not be granted if the student has already completed a Soc 8090 topics course with the same title. ",
    "prereq": []
  },
  {
    "uid": "788533",
    "code": "SOC8666",
    "subject": "SOC",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "008202",
    "code": "SOC8701",
    "subject": "SOC",
    "number": "8701",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociological Theory",
    "fullname": "Sociological Theory",
    "info": "Traditions of social theory basic to sociological knowledge, their reflection and expansion in contemporary theory, their applications in selected areas of empirical research. Sample topics: social inequality, social organization and politics, family organization and social reproduction, social order and change, sociology of knowledge and religion.",
    "prereq": []
  },
  {
    "uid": "008853",
    "code": "SOC8711",
    "subject": "SOC",
    "number": "8711",
    "honors": false,
    "writingIntensive": false,
    "name": "Theory Soc Org",
    "fullname": "Theories of Social Organization",
    "info": "Key frameworks and theories, structure and process, micro and macro levels of analysis. Empirical literature on major substantive issues related to work, gender, and race; politics and social movements; and post-industrialization and technological change. World systems theory.",
    "prereq": []
  },
  {
    "uid": "009381",
    "code": "SOC8721",
    "subject": "SOC",
    "number": "8721",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Psychology",
    "fullname": "Social Psychology: Micro-Sociological Approaches to Inequalities and Identities",
    "info": "Social psychology is basic to an understanding of contemporary social life. This subfield of sociology focuses on social phenomena at the micro-level. Small group dynamics, social interactions, and individual experiences are importantly structured by the macro-structural context, e.g., by socioeconomic status, race, gender, sexuality, and other dimensions of social inequality. At the same time, these and other micro-sociological processes reflect individual-level identities, perceptions, motivations and cognitions.  This seminar examines a wide range of social psychological phenomena linked to inequality (e.g., the effects of class, minority status, and gender on disparities in identity, self-concept, and health; the development of status hierarchies in small group interaction; intergroup relations, prejudice, and discrimination).  We begin with a consideration of “personal structure,” emphasizing the cultural and structural variability of self-conceptions and identities, cognitive processes, and motivation, as well as the biosocial bases of action.  These may be considered individual-level “building blocks” of social psychological theories (along with emotions, attitudes, values, and ideologies).  We then address prominent theoretical perspectives in social psychology that illuminate the linkages between micro-social contexts of inequality and identity, including symbolic interactionism, exchange theory, structural social psychology (“social structure and personality”) and the social psychology of the life course. Social psychological theory and research are foundational to many specialty fields in sociology, including the sociology of the family, education, health, deviance, work, social mobility, social movements, emotions, and the sociology of childhood, youth, and aging.  Social psychology is also central to prominent theoretical debates in sociology surrounding the relationship between social structure and agency; individual-level identities, perceptions, motivations, goals, and strategies are both structured by the social context and affect the capacity of individuals to act agentically and to achieve their goals.",
    "prereq": []
  },
  {
    "uid": "016580",
    "code": "SOC8725",
    "subject": "SOC",
    "number": "8725",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Theory Construction",
    "fullname": "Sociological Theory Construction",
    "info": "Structure of social scientific theories, basic tools for developing/critiquing them. Types of theoretical statements, concept formation, operationalization, testability. Contrasts goals/methods of different theoretical perspectives.",
    "prereq": []
  },
  {
    "uid": "797887",
    "code": "SOC8731",
    "subject": "SOC",
    "number": "8731",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Knowledge",
    "fullname": "Sociology of Knowledge",
    "info": "Knowledge and related terms (ideology, stereotype, prejudice, belief, truth). Variation of knowledge across social groups/categories (e.g., gender, race, class, generation, nationality); institutions (e.g., politics, law, science); and societies across time and space. Power, rituals, institution, networks, and knowledge. Genealogy of theories.",
    "prereq": []
  },
  {
    "uid": "799131",
    "code": "SOC8735",
    "subject": "SOC",
    "number": "8735",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociology of Culture",
    "fullname": "Sociology of Culture",
    "info": "Definition/importance of culture as dimension of social life. Structural/Durkheimian approaches, cultural Marxism, practice theory. Cultural creation/reception. Identities as cultural formations. Culture/social inequality. Culture and race. Cultural construction of social problems. Culture and globalization.",
    "prereq": []
  },
  {
    "uid": "788658",
    "code": "SOC8777",
    "subject": "SOC",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "008575",
    "code": "SOC8790",
    "subject": "SOC",
    "number": "8790",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Soc Theory",
    "fullname": "Advanced Topics in Sociological Theory",
    "info": "Sample topics: theories of conflict, theories of purposive action, Marxist theory, and structure-agency debate.  ",
    "prereq": []
  },
  {
    "uid": "008199",
    "code": "SOC8801",
    "subject": "SOC",
    "number": "8801",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Research Meth",
    "fullname": "Sociological Research Methods",
    "info": "Multiple objectives of social research and how they inform research design.  Conceptualization and measurement of complex concepts. Broad issues in research design and quantitative and qualitative approaches to data collection and management.prereq: Grad soc major or instr consent",
    "prereq": []
  },
  {
    "uid": "009384",
    "code": "SOC8811",
    "subject": "SOC",
    "number": "8811",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Social Statistics",
    "fullname": "Advanced Social Statistics",
    "info": "Statistical methods for analyzing social data. Sample topics: advanced multiple regression, logistic regression, limited dependent variable analysis, analysis of variance and covariance, log-linear models, structural equations, and event history analysis. Applications to datasets using computers.prereq: recommend 5811 or equiv; graduate student or instr consent",
    "prereq": {
      "code": "SOC 5811",
      "subject": "SOC",
      "id": "5811"
    }
  },
  {
    "uid": "799132",
    "code": "SOC8821",
    "subject": "SOC",
    "number": "8821",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Practicum I",
    "fullname": "Research Practicum I",
    "info": "Writing a scholarly paper. Framing question within literature(s). Selecting appropriate data/methods. Conducting initial analysis. Writing preliminary draft. Students concentrate on literature review, designing/beginning analysis. Part one of two-course sequence. ",
    "prereq": []
  },
  {
    "uid": "804424",
    "code": "SOC8822",
    "subject": "SOC",
    "number": "8822",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Practicum II",
    "fullname": "Research Practicum II",
    "info": "Continuation of 8821. Writing a scholarly paper. Students will concentrate on finalizing analysis, writing, and revising.",
    "prereq": []
  },
  {
    "uid": "817115",
    "code": "SOC8851",
    "subject": "SOC",
    "number": "8851",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Res Methods: Interviewing",
    "fullname": "Advanced Qualitative Research Methods: In-Depth Interviewing",
    "info": "Interviewers have opened up other worlds to the sociological imagination and taught us much about the way people think, feel, and make sense of the world as well as of their own identities. We will conduct interviews; transcribe, code, and analyze interview data; and write up interview- based research. We will also consider a range of epistemological, practical, and ethical issues related to interviewing as a research method, reading materials drawn from a broad range of substantive sociological subfields as well as from geography. This course is best suited to graduate students who have an interview-based project in mind and want to acquire the skills for carrying out their research, and students who are considering using interviews in their dissertation research and want to try their hand at interviewing before making a decision. Because this is a hands-on, fieldwork-based course, no auditors are permitted.",
    "prereq": []
  },
  {
    "uid": "817942",
    "code": "SOC8852",
    "subject": "SOC",
    "number": "8852",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Res Methods: Ethnography",
    "fullname": "Advanced Qualitative Research Methods: Ethnographic Practicum",
    "info": "Ethnographic practice involves two core activities: engaging people in their own space and time, and separating yourself enough from the fieldwork site to write about observations and experiences with some degree of analytical distance and theoretical sophistication. Ethnographers are always both participant and observer, although some of them -- often those who start off as insiders at a site from the beginning -- will be more practically or emotionally enmeshed in a fieldwork site than others. This seminar emphasizes both these core activities: students develop the practice of shuttling constantly between fieldwork site and writing field notes and analysis. Complementing the field work will be reading and discussion of classic and contemporary ethnographies. Each student will undertake his or her own fieldwork project, learning how to generate field notes that include rich description and coherent, flexible analysis. These projects should generate a useful body of qualitative data, as well as an intensive, hands-on experience of the design, research process, and analysis of ethnography. Prerequisites: graduate student, and completion of SOC 8801, or instructor consent.",
    "prereq": {
      "code": "SOC 8801",
      "subject": "SOC",
      "id": "8801"
    }
  },
  {
    "uid": "816838",
    "code": "SOC8853",
    "subject": "SOC",
    "number": "8853",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Res Methods Hist/Comp Soc",
    "fullname": "Advanced Qualitative Research Methods: Historical & Comparative Sociology",
    "info": "This course is designed to teach graduate students to design and carry out theoretically informed and methodologically sophisticated historical research projects. In the first section of the course, we will explore the meaning of historical sociology, the disciplinary reflexes of sociologists and historians, conceptions of time in historical sociology, the uses of narrative in explanation, the use of case studies and comparisons in historical analysis, and varieties of explanation. The following section will examine the problems and potentials involved in different types of sources used by historically-oriented social scientists and the politics of historical memory. The final section will survey research by sociologists, historians, and political scientists that attempts to develop historically informed theories of various phenomena, such as race relations, nation and state formation, colonialism and imperialism, democratization and citizenship, gender and sexuality, and contentious politics. This course fulfills an advanced qualitative methods requirement for Sociology graduate students. ",
    "prereq": []
  },
  {
    "uid": "016718",
    "code": "SOC8888",
    "subject": "SOC",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credits: Doctoral",
    "info": "(No description)prereq: [Completion of four semesters and all required credits completed], 24 cr required",
    "prereq": []
  },
  {
    "uid": "008200",
    "code": "SOC8890",
    "subject": "SOC",
    "number": "8890",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Topics in Research Methods",
    "fullname": "Advanced Topics in Research Methods",
    "info": "Advanced Research Methods (e.g., multilevel models), historical/comparative, field, survey research. Topics specified in Class Schedule.prereq: 8801, 8811, or instr consent. Cr will not be granted if cr has been received for the same topics title",
    "prereq": {
      "and": [
        {
          "code": "SOC 8801",
          "subject": "SOC",
          "id": "8801"
        },
        {
          "code": "SOC 8811",
          "subject": "SOC",
          "id": "8811"
        }
      ]
    }
  }
]