[
  {
    "uid": "010246",
    "code": "SPAN1001",
    "subject": "SPAN",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Spanish",
    "fullname": "Beginning Spanish",
    "info": "Listening, speaking, reading, writing. Emphasizes development of communicative competence. Cultural readings. \n\nprereq: Less than 2 yrs of high school Spanish and/or three or more years away from Spanish language study; and dept consent",
    "prereq": []
  },
  {
    "uid": "010249",
    "code": "SPAN1002",
    "subject": "SPAN",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Spanish",
    "fullname": "Beginning Spanish",
    "info": "Listening, speaking, reading, writing. Emphasizes development of communicative competence. Cultural readings.prereq: A grade of C- or better in SPAN 1001 completed at UMNTC, and dept consent",
    "prereq": {
      "code": "SPAN 1001",
      "subject": "SPAN",
      "id": "1001"
    }
  },
  {
    "uid": "009750",
    "code": "SPAN1003",
    "subject": "SPAN",
    "number": "1003",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Spanish",
    "fullname": "Intermediate Spanish",
    "info": "Speaking/comprehension. Developing reading/writing skills based on materials from Spain/Spanish America. Grammar review. Compositions, oral presentations. prereq: A grade of C- or better in SPAN 1002 or SPAN 1022 or EPT placement of SPAN 1003",
    "prereq": {
      "or": [
        {
          "code": "SPAN 1002",
          "subject": "SPAN",
          "id": "1002"
        },
        {
          "code": "SPAN 1022",
          "subject": "SPAN",
          "id": "1022"
        }
      ]
    }
  },
  {
    "uid": "009754",
    "code": "SPAN1004",
    "subject": "SPAN",
    "number": "1004",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Span",
    "fullname": "Intermediate Spanish",
    "info": "Speaking/comprehension. Developing reading/writing skills based on materials from Spain/Spanish America. Grammar review. Compositions, oral presentations.prereq: A Grade of C- or better in SPAN 1003 or EPT placement of SPAN 1004",
    "prereq": {
      "code": "SPAN 1003",
      "subject": "SPAN",
      "id": "1003"
    }
  },
  {
    "uid": "010594",
    "code": "SPAN1022",
    "subject": "SPAN",
    "number": "1022",
    "honors": false,
    "writingIntensive": false,
    "name": "Alt Second-Sem Spanish",
    "fullname": "Alternate Second-Semester Spanish",
    "info": "For students who have studied Spanish in high school or at community college, or who are transfer students. Begins with accelerated review of 1001 followed by material covered in 1002. prereq: Placement above 1001 (Span 1022 is designed for students who have had two or more years of high school Spanish, or one semester of college Spanish).",
    "prereq": {
      "code": "SPAN 1001",
      "subject": "SPAN",
      "id": "1001"
    }
  },
  {
    "uid": "010408",
    "code": "SPAN1034",
    "subject": "SPAN",
    "number": "1034",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Span",
    "fullname": "Business Spanish",
    "info": "Vocabulary, report writing skills. Proper format for business communications. Conversational fluency on trade-related topics.Previously offered as Span 1014.prereq: 1003",
    "prereq": {
      "code": "SPAN 1003",
      "subject": "SPAN",
      "id": "1003"
    }
  },
  {
    "uid": "790228",
    "code": "SPAN1041",
    "subject": "SPAN",
    "number": "1041",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Medical Span",
    "fullname": "Beginning Medical Spanish",
    "info": "Practical Spanish terminology, functional grammar, conversational fluency on medical-related topics.",
    "prereq": []
  },
  {
    "uid": "790229",
    "code": "SPAN1044",
    "subject": "SPAN",
    "number": "1044",
    "honors": false,
    "writingIntensive": false,
    "name": "Interm Med Span",
    "fullname": "Intermediate Medical Spanish",
    "info": "Language needed by health-care workers who interact with Spanish-speaking patients. Basic medical vocabulary, questions/answers in common medical situations. Vocabulary/phrases to conduct patient interviews and physical exams. Readings on Latin American view of health and health care.prereq: 1003 or equiv",
    "prereq": {
      "code": "SPAN 1003",
      "subject": "SPAN",
      "id": "1003"
    }
  },
  {
    "uid": "797442",
    "code": "SPAN1054",
    "subject": "SPAN",
    "number": "1054",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish for Heritage Students",
    "fullname": "Spanish for Heritage Students",
    "info": "Development of academic Spanish through reading/writing. Advanced grammar/orthography.",
    "prereq": []
  },
  {
    "uid": "016389",
    "code": "SPAN1102",
    "subject": "SPAN",
    "number": "1102",
    "honors": false,
    "writingIntensive": false,
    "name": "Begin SpanII Trans",
    "fullname": "Beginning Spanish II, Transition",
    "info": "Basic listening, speaking, reading/writing skills. Emphasizes development of communicative competence. Some cultural readings.",
    "prereq": []
  },
  {
    "uid": "016391",
    "code": "SPAN1103",
    "subject": "SPAN",
    "number": "1103",
    "honors": false,
    "writingIntensive": false,
    "name": "Begin Span III, Trans",
    "fullname": "Beginning Spanish III, Transition",
    "info": "Basic listening, speaking, reading, and writing skills. Emphasizes development of communicative competence. Some cultural readings.",
    "prereq": []
  },
  {
    "uid": "016388",
    "code": "SPAN1105",
    "subject": "SPAN",
    "number": "1105",
    "honors": false,
    "writingIntensive": false,
    "name": "Interm Span II, Trans",
    "fullname": "Intermediate Spanish II, Transition",
    "info": "Speaking/comprehension. Development of reading/writing skills based on materials from Spain and Spanish America.  Grammar review. Compositions, oral presentations.",
    "prereq": []
  },
  {
    "uid": "016395",
    "code": "SPAN1106",
    "subject": "SPAN",
    "number": "1106",
    "honors": false,
    "writingIntensive": false,
    "name": "Interm Span III, Trans",
    "fullname": "Intermediate Spanish III, Transition",
    "info": "Speaking/comprehension. Development of reading/writing skills based on materials from Spain and Spanish America. Grammar review. Compositions, oral presentations.",
    "prereq": []
  },
  {
    "uid": "791322",
    "code": "SPAN144",
    "subject": "SPAN",
    "number": "144",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Medical Spanish",
    "fullname": "Intermediate Medical Spanish",
    "info": "Vocabulary of Spanish medical terms, skills in report writing, proper format for medical communications. Developing conversational fluency for medical-related topics.prereq: [1st yr college-level Spanish or equiv], dept consent",
    "prereq": []
  },
  {
    "uid": "788187",
    "code": "SPAN1902",
    "subject": "SPAN",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr with no more than 30 cr",
    "prereq": []
  },
  {
    "uid": "803793",
    "code": "SPAN1904",
    "subject": "SPAN",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in class schedule.",
    "prereq": []
  },
  {
    "uid": "797888",
    "code": "SPAN1905",
    "subject": "SPAN",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topic specified in Class Schedule.prereq: Freshman",
    "prereq": []
  },
  {
    "uid": "788188",
    "code": "SPAN1907W",
    "subject": "SPAN",
    "number": "1907",
    "honors": false,
    "writingIntensive": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr with no more than 29 cr",
    "prereq": []
  },
  {
    "uid": "798995",
    "code": "SPAN1910W",
    "subject": "SPAN",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.prereq: Fr",
    "prereq": []
  },
  {
    "uid": "817901",
    "code": "SPAN1911",
    "subject": "SPAN",
    "number": "1911",
    "honors": false,
    "writingIntensive": false,
    "name": "Latino Theater & Cultural Stud",
    "fullname": "U.S. Latino/Latina American Theaters and Cultural Studies",
    "info": "A wide variety of Latino groups have used the stage to explore identity issues in a public forum and have developed nontraditional approaches which have altered the nature, quality, and substance of recent theater in the United States. These theaters have attempted to break the mainstream theater's hegemony by addressing the audience's desire to see their problems enacted in understandable and creative terms. Through an interdisciplinary approach which will include lectures and visual material, the course will introduce established and works-in-progress of United States Latin(o) playwrights, and the historical, political, and cultural development framework which made it possible. Delivered in English, the course will be of special interest for those in search of a better understanding of the construction of English-Spanish cultural and theatrical discourses within and outside of the United States.",
    "prereq": []
  },
  {
    "uid": "825224",
    "code": "SPAN1912",
    "subject": "SPAN",
    "number": "1912",
    "honors": false,
    "writingIntensive": false,
    "name": "Plague/Pestil./Pandem in Ib an",
    "fullname": "Plague, Pestilence, and Pandemic in Modern Iberian and Latin American Literature",
    "info": "\"Over the course of the 20th and 21st centuries, contagious illness, both fictional and real, has served as a literary vehicle for authors in Spain, Portugal, and Latin America to engage with the ways the human body intersects with political power, technology, the environment, and webs of social contact and exclusion. For the Catalan author Blai Bonet, a tuberculosis ward becomes a place to explore the origins of community; for Gabriel Garca Mrquez, the melancholy of inaccessible love drains the body of vitality like cholera; for the Portuguese writer Jos Saramago, an outbreak of an invented disease causing blindness allows for an exploration of human nature and the 20th-century?s worst excesses of violence, to name three examples studied in the course.This Freshman Seminar will explore the literary treatment of infectious disease across a broad spectrum of geographical and temporal signposts. Given the topicality of the course to the present moment, I plan to incorporate the RATE tool to give students an occasional opportunity to reflect on the utility of the humanities and literary criticism for analytically reflecting on their own pandemic experiences.\"",
    "prereq": []
  },
  {
    "uid": "010589",
    "code": "SPAN221",
    "subject": "SPAN",
    "number": "221",
    "honors": false,
    "writingIntensive": false,
    "name": "Reading Spanish",
    "fullname": "Reading Spanish",
    "info": "Intensive reading of a variety of texts to provide a basic reading knowledge of Spanish.  At the end of the semester students may take the equivalent of the Spanish Graduate Reading Examination. ",
    "prereq": []
  },
  {
    "uid": "010398",
    "code": "SPAN3011W",
    "subject": "SPAN",
    "number": "3011",
    "honors": false,
    "writingIntensive": true,
    "name": "Spanish Grammar & Comp Workshp",
    "fullname": "Spanish Grammar and Composition Workshop",
    "info": "SPAN 3011W will systematically expose students to a wide variety of fascinating literary texts loosely organized around the central theme of contemporary Spain.  These literary source materials offer not only a panorama of the Spanish language but also an internal—sometimes intensely personal—vision of the dynamics of Spain's evolution from monarchy, to fascist dictatorship, to parliamentary democracy, sometimes within the context on continental civilization and culture. \n\nAn equally key function of these texts is to provide a common basis for this course's discussion and conversation component affording each individual the opportunity to practice the oral expression of ideas ranging across a wide spectrum of topics from machismo, gender, and feminism to psychological obsession, transformation, the social construction of identities, and the function of memory.\n\nBesides reviewing and practicing the arts of reading and oral communication, students will be generating a series of original compositions with the goal of learning to write clear, accurate, formal prose in Spanish employing diverse rhetorical strategies.  Students will likewise continue the development of their fundamental skills and perceptions as a critical reader, thinker, and analyst through the weekly equipos de redacción (editing teams) and peer revision sessions that support this process-writing technique.\n\nprereq: [1004 or 1014 or 1044], LPE pass",
    "prereq": {
      "or": [
        {
          "code": "SPAN 1004",
          "subject": "SPAN",
          "id": "1004"
        },
        {
          "code": "SPAN 1014",
          "subject": "SPAN",
          "id": "1014"
        },
        {
          "code": "SPAN 1044",
          "subject": "SPAN",
          "id": "1044"
        }
      ]
    }
  },
  {
    "uid": "010382",
    "code": "SPAN3015W",
    "subject": "SPAN",
    "number": "3015",
    "honors": false,
    "writingIntensive": true,
    "name": "Spanish Comp and Communication",
    "fullname": "Spanish Composition and Communication",
    "info": "Via a wide variety of fascinating contemporary texts, SPAN 3015W provides a lens into Hispanic civilizations and cultures, their past and present, and the global flows of ideologies, technology, media, and peoples that shape society and function as constant drivers of change. Throughout the course we may explore topics such as social and cultural legacies, racial capitalism, power/knowledge, and democracy in crisis. In SPAN 3015W, students will use their Spanish skills to analyze an assortment of authentic texts (literature, films, essays, podcasts, etc.), to talk with each other and native speakers, and to share their own experiences and ideas in writing. Students use their Spanish to delve into the history, cultures, and diversity of the Spanish-speaking world. As they do this, they revisit and refine specific structures known to pose a challenge to learners of Spanish. \n\nThe first in a series of writing-intensive courses in the major and minor programs, Spanish 3015W focuses upon the acquisition of composition skills with an emphasis on the thesis-fronted, expository writing strategies (i.e. statistical report, literary interpretation, academic essay, etc.) essential for success in more advanced coursework in Spanish Studies. 3015W moves in the direction of a more advanced-level discourse by providing crucial critical and analytical writing experiences to students through the careful scrutiny of authentic Hispanic texts, the composition of three original essays, and the production of a writing portfolio prefaced by a self-evaluative essay (autorreflexión). Regular engagement with reading primary sources and writing about these materials is fundamental to the development of the writer's critical “voice” and the attainment of a style and vocabulary usage appropriate to writing analytically about literary and other key sociocultural issues of the Hispanic world. Through the SPAN 3015W process writing program, students work together on a series of peer edits to help each other elegantly formulate ideas and draft coherent arguments, resolving perplexity through collaborative critical thinking. \n\nprereq: SPAN LPE pass",
    "prereq": []
  },
  {
    "uid": "818209",
    "code": "SPAN3019W",
    "subject": "SPAN",
    "number": "3019",
    "honors": false,
    "writingIntensive": true,
    "name": "Comp & Comm Spnsh Spkrs of US",
    "fullname": "Composition and Communication for Spanish Speakers of the U.S",
    "info": "Students in this course will further develop the main linguistic skills taught in the foundational SPAN 1001-1004 sequence, modified appropriately for students born and/or raised in the US and who speak/spoke Spanish in the home. Instruction will target the linguistic forms and rhetorical organization necessary for the genres of narration, exposition, and comparison-contrast while exploring cultural texts. Through guided activities, students will identify their linguistic and communicative strengths and weaknesses and also steps that they can take to advance in their language development.This course may be used as a substitute for SPAN 3015W or SPAN 3011W, but cannot be used for both.prereq: Instructor consent (recommended SPAN 1004 Pass or SPAN LPE Pass)",
    "prereq": {
      "code": "SPAN 1004",
      "subject": "SPAN",
      "id": "1004"
    }
  },
  {
    "uid": "787744",
    "code": "SPAN3034",
    "subject": "SPAN",
    "number": "3034",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Business Spanish",
    "fullname": "Advanced Business Spanish",
    "info": "Spanish 3034 is an advanced course intended for both business majors and those interested in the business world. This course is intended to advance your knowledge of the Spanish-speaking world and the Spanish language in general through the specific context of business and culture. This class examines specific fields of business(Marketing, Finance, Imports/Exports, etc), current events in the Spanish-speaking world, and cultural issues pertinent to doing business in the Spanish-speaking world or with Spanish speakers. Business practices and texts will be examined from both cultural and linguistic perspectives. In Spanish 3034 you will learn about business forms of communication and practice the formal style necessary for business specific writing. Via a semester-long project, you will have a chance to develop a final project related to your own professional interests.  prereq: A C- or better in SPAN 3015W or SPAN 3015V or SPAN 3019W or TLDO 3231 or ECDR 3015W or ARGN 3015W ",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3015W",
          "subject": "SPAN",
          "id": "3015W"
        },
        {
          "code": "SPAN 3019W",
          "subject": "SPAN",
          "id": "3019W"
        },
        {
          "code": "TLDO 3231",
          "subject": "TLDO",
          "id": "3231"
        },
        {
          "code": "ECDR 3015W",
          "subject": "ECDR",
          "id": "3015W"
        },
        {
          "code": "ARGN 3015",
          "subject": "ARGN",
          "id": "3015"
        }
      ]
    }
  },
  {
    "uid": "794970",
    "code": "SPAN3044",
    "subject": "SPAN",
    "number": "3044",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Medical Spanish",
    "fullname": "Advanced Medical Spanish",
    "info": "Span 3044 is designed to further develop and strengthen the language skills and cultural awareness students have learned and acquired in Intermediate Medical Spanish. Students will explore more advanced and specific medical vocabulary to further strengthen their Spanish language skills; understand the Latin American views of health; and examine aspects of health in Latin American countries. Class activities also focus on vocabulary and exploring cultural issues pertaining to future healthcare providers who work with the Spanish-speaking community and the unique opportunity to get perspectives on health-related issues from the Hispanic/Latinx community in the Twin Cities.prereq: a grade of C- or better in SPAN 3015W or 3015V or 3019W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3015W",
          "subject": "SPAN",
          "id": "3015W"
        },
        {
          "code": "SPAN 3019",
          "subject": "SPAN",
          "id": "3019"
        }
      ]
    }
  },
  {
    "uid": "007860",
    "code": "SPAN3104W",
    "subject": "SPAN",
    "number": "3104",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro: Study of Hispanic Lit",
    "fullname": "Introduction to the Study of Hispanic Literatures",
    "info": "SPAN 3104W offers students an introduction to the main literary genres, including prose, poetry, theater, and essay, as well as the critical methods used to analyze literary works produced in Hispanic contexts throughout different historical periods. By actively engaging with Iberian and Spanish American literary traditions through close reading and class discussions, students will develop and sharpen their analytical and critical thinking skills. In addition, in line with the University of Minnesota’s renewed emphasis on and commitment to writing-intensive classes across the curriculum, students will be required to write a series of essays in formal Spanish. Students are expected to be able to read, write, and actively participate in class discussions and activities.Prereq: a grade of C- or better in SPAN 3015W or 3015V or 3019W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3015W",
          "subject": "SPAN",
          "id": "3015W"
        },
        {
          "code": "SPAN 3019",
          "subject": "SPAN",
          "id": "3019"
        }
      ]
    }
  },
  {
    "uid": "008830",
    "code": "SPAN3105W",
    "subject": "SPAN",
    "number": "3105",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro: Hispanic Cultures",
    "fullname": "Introduction to the Study of Hispanic Cultures",
    "info": "Span 3105W is a writing-intensive course centered on major issues of culture in the context of the Spanish-speaking world. It is not a history of civilization, nor is it a survey of either Latin American or Peninsular literature. Rather, our objective here is to familiarize ourselves with the different issues central to the development of the Hispanic world as a cultural entity, and to practice analyzing and questioning received notions of culture in this context. We will examine all sorts of texts--literary, visual, musical, and filmic--from all periods of both Latin American (including Brazil) and Peninsular history, reading them through the lens of a series of topics. These topics are as follows: Mapas del mundo hispánico/Maps of the Hispanic world, Política y legado del encuentro cultural/Politics and legacies of cultural encounter, Discursos de identidad social/Discourses of social identity, Coerción y subversión/Coercion and subversion, Las naciones modernas/Modern nations, and Cultura élite-cultura popular-cultura de masas/High culture-popular culture-mass culture.prereq: a grade of C- or better in SPAN 3015W or 3015V  or 3019W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3015W",
          "subject": "SPAN",
          "id": "3015W"
        },
        {
          "code": "SPAN 3019",
          "subject": "SPAN",
          "id": "3019"
        }
      ]
    }
  },
  {
    "uid": "007877",
    "code": "SPAN3107W",
    "subject": "SPAN",
    "number": "3107",
    "honors": false,
    "writingIntensive": true,
    "name": "Intro: Hispanic Linguistics",
    "fullname": "Introduction to the Study of Hispanic Linguistics",
    "info": "Language is the foundation of human society, but it’s much more than just a code used for communication. Language helps us shape our thoughts. It’s also the material we manipulate to create poetry and that we play with to produce humor. Even more, it is considered to be what truly makes us human. In this class we’ll learn the basics of the scientific study of language, also known as linguistics and answer some of these questions: How is meaning-making achieved through language? How does language work in the human brain? What does it mean to be bilingual Where did Spanish come from? How did it expand across the globe? Why are some aspects of Spanish hard for English speakers to learn? How do we use language to express our identities, and how can language influence how those identities are received and perceived? While we explore these questions, we will also learn the writing style and conventions that linguists use to express themselves. You will use these conventions to write a paper in which you explore a Spanish language related topic in depth.prereq: a grade of C- or better in SPAN 3015W or 3015V ",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3015W",
          "subject": "SPAN",
          "id": "3015W"
        },
        {
          "code": "SPAN 3015",
          "subject": "SPAN",
          "id": "3015"
        }
      ]
    }
  },
  {
    "uid": "008379",
    "code": "SPAN3211",
    "subject": "SPAN",
    "number": "3211",
    "honors": false,
    "writingIntensive": false,
    "name": "Interpreting Imperial Spain",
    "fullname": "Interpreting Imperial Spain, 1492-1800",
    "info": "The term “Siglo de Oro” has been used historically in Spanish to describe the epoch of Spain’s imperial expansion in the sixteenth and seventeenth centuries. Beginning in 1492, the Catholic Monarchs, Isabel, and Fernando consolidated Spanish power over the other kingdoms in Iberia, expelled the Jews, and began the conquest of the so-called “New World.” The following years saw an influx and their kingdom became globally influential, eventually becoming a world empire. But, for whom was this a “Golden Age”? In this class we will explore the historical, political, and social trends that shaped what it meant to be “Spanish” and the territory thought of as “Spain.” The definition of “Spanish” was created in apposition to various Others—the various people and groups that were relegated to the lower echelons of the social hierarchy. Religion played an important role in the shaping of this identity.We will apply contemporary theories—such as those around forms of racism, classism, Othering—from the field of cultural studies to cultural and historical developments within the Spanish Golden Age. For example, being “Spanish” was based in the idea of “Cristianos viejos”/Old Christians (who had no trace of Muslim or Christian blood in their family lines). We will explore other peoples and groups in Spain/Iberia and their contributions to what would become the Spanish nation. Among the themes studied in class:—rhetoric of difference, including the limpieza de sangre or notions of blood purity—gender: what did it mean to be española?—the Spanish colonies in the Americas and the people who lived there—systems of power: Old Christians, nobility and conquerors—the institutionalization of “Spain”—the subversive concept of the Baroque: Miguel de Cervantes against the “State”prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "008621",
    "code": "SPAN3212",
    "subject": "SPAN",
    "number": "3212",
    "honors": false,
    "writingIntensive": false,
    "name": "Mod/Contemp Spain, 1800-Pres",
    "fullname": "Interpreting Modern and Contemporary Spain, 1800-Present",
    "info": "Wide variety of texts. Questions of gender, class, subjectivity, representation, art, and politics.prereq: 3015, [3104W or TLDO 3104 or VENZ 3104 or instr consent]",
    "prereq": {
      "and": [
        {
          "code": "SPAN 3015",
          "subject": "SPAN",
          "id": "3015"
        },
        {
          "or": [
            {
              "code": "SPAN 3104W",
              "subject": "SPAN",
              "id": "3104W"
            },
            {
              "code": "TLDO 3104",
              "subject": "TLDO",
              "id": "3104"
            },
            {
              "code": "VENZ 3104",
              "subject": "VENZ",
              "id": "3104"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "008371",
    "code": "SPAN3221",
    "subject": "SPAN",
    "number": "3221",
    "honors": false,
    "writingIntensive": false,
    "name": "Interpret Colonial Lat America",
    "fullname": "Interpreting Colonial Latin America: Empire and Early Modernity",
    "info": "The conquest and colonization of Latin America is a complex issue, which demands an interdisciplinary approach to achieve a better understanding of this multidimensional social conflict. The course examines the role of colonial discourse as producer of the epistemic colonial difference and explores the legacies of colonialism. Students will be expected to focus on and to think about the organizational mechanisms through which aural and visual practices mediate reality in Colonial Latin America. Furthermore, students will learn to be critical readers by considering how cultural texts may be historically determined and by exploring how individuals may shape a particular cultural theme in a variety of manners. The course will focus on critical readings and discussion of cultural artifacts, literary texts, and documents of Colonial Latin America. Studies will include material pertaining to the aural and visual production of the period, including European and indigenous accounts of the conquest, as well as indigenous, African, criollo, mestizo and women writings during the colony from an interdisciplinary perspective. Concentration will center on the textual strategies, topics, world views, motivations, projects, and expectations explicit or implicit in the texts, their significance at the time, and their importance for understanding the formation of what we know as Latin America today. The course also is devoted to the conquest of Latin America by analyzing the role of colonial discourse and the legacies of colonialism in the region. With cultural artifacts, texts and documents, students will deal with different theoretical approaches deriving from the humanities and the social sciences. Such interdisciplinary method will provide the tools, concepts, and strategic visions to carry on analytical tasks in class. All the work for the course, except for certain supplementary readings, will be in Spanish. Requirements will include preparation of assigned readings, presentation of analytical and comprehensive tasks, class discussions, and a research project. The course provides training in analytical thinking and cultural critique of colonial society in Latin America, bringing a global perspective to our curriculum.Pre-req: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": []
  },
  {
    "uid": "009043",
    "code": "SPAN3222",
    "subject": "SPAN",
    "number": "3222",
    "honors": false,
    "writingIntensive": false,
    "name": "Interpret Mod/Contemp Lat Amer",
    "fullname": "Interpreting Modern and Contemporary Latin America",
    "info": "The aim of this course is to organize a discussion around the issues of nation building and modernization in Latin America through the study of representative 19th- century authors. The selected materials are essential documents of their times, and often influential statements about the history, identity, and culture of the region. Through a close examination of essays, novels, short stories, poems, and other texts students can appreciate their cultural legacy and understand the socio-historical context and the intellectual forces that shaped Modern Latin America. Concentration will center on the textual strategies, topics, world views, motivations, projects, and expectations explicit or implicit in the texts, their significance at the time, and their importance for understanding the formation of what we know as Latin America today. The course also examines Modern Latin America by analyzing the role of political discourse and the legacies of colonialism in the region. With literary texts and documents, students will deal with different theoretical approaches deriving from the humanities and the social sciences. Such interdisciplinary method will provide the tools, concepts, and strategic visions to carry on analytical tasks in class. All the work for the course, except for certain supplementary readings, will be in Spanish. Requirements will include preparation of assigned readings, presentation of analytical and comprehensive tasks, class discussions, and a research project. The course provides training in analytical thinking and cultural critique of Modern Latin America, bringing a global perspective to our curriculum.prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "816896",
    "code": "SPAN3301",
    "subject": "SPAN",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Oral Profic Workshop",
    "fullname": "Advanced Oral Proficiency Workshop",
    "info": "The main goal of this course is to advance students' oral proficiency in Spanish in a variety of genres of spoken discourse, including description, narration, argumentation, explanation, and hypothesizing. In addition, instruction will focus on developing the range of topics about which students can speak and the internal organization of discourse produced by students. These functions are characteristic of speakers at the advanced level of proficiency on the ACTFL scale. Students will engage in a variety of activities, among which are discussions, debates, oral presentations, and analysis of oral speech samples.Prereqs:  Span 3104W, or 3105W, or 3107W AND Span 3211, or 3212, or 3221, or 3222, or 3502, or 3503, or 3510, or 3512, or 3701, or 3702, or 3703, or 3704, or 3706, or 3707, or 3730, or 3800, or 3910, or 3920, and oral interview required.",
    "prereq": {
      "and": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "SPAN 3211",
          "subject": "SPAN",
          "id": "3211"
        },
        {
          "code": "SPAN 3212",
          "subject": "SPAN",
          "id": "3212"
        },
        {
          "code": "SPAN 3221",
          "subject": "SPAN",
          "id": "3221"
        },
        {
          "code": "SPAN 3222",
          "subject": "SPAN",
          "id": "3222"
        },
        {
          "code": "SPAN 3502",
          "subject": "SPAN",
          "id": "3502"
        },
        {
          "code": "SPAN 3503",
          "subject": "SPAN",
          "id": "3503"
        },
        {
          "code": "SPAN 3510",
          "subject": "SPAN",
          "id": "3510"
        },
        {
          "code": "SPAN 3512",
          "subject": "SPAN",
          "id": "3512"
        },
        {
          "code": "SPAN 3701",
          "subject": "SPAN",
          "id": "3701"
        },
        {
          "code": "SPAN 3702",
          "subject": "SPAN",
          "id": "3702"
        },
        {
          "code": "SPAN 3703",
          "subject": "SPAN",
          "id": "3703"
        },
        {
          "code": "SPAN 3704",
          "subject": "SPAN",
          "id": "3704"
        },
        {
          "code": "SPAN 3706",
          "subject": "SPAN",
          "id": "3706"
        },
        {
          "code": "SPAN 3707",
          "subject": "SPAN",
          "id": "3707"
        },
        {
          "code": "SPAN 3730",
          "subject": "SPAN",
          "id": "3730"
        },
        {
          "code": "SPAN 3800",
          "subject": "SPAN",
          "id": "3800"
        },
        {
          "code": "SPAN 3910",
          "subject": "SPAN",
          "id": "3910"
        },
        {
          "code": "SPAN 3920",
          "subject": "SPAN",
          "id": "3920"
        }
      ]
    }
  },
  {
    "uid": "008193",
    "code": "SPAN3401",
    "subject": "SPAN",
    "number": "3401",
    "honors": false,
    "writingIntensive": false,
    "name": "Latino Immigration/Comm Engage",
    "fullname": "Latino Immigration and Community Engagement",
    "info": "In 3401, students work with Latino immigrants in the community. They analyze U.S. power structures and human rights related to emigration, issues on the U.S./Mexican border, laws, and treatment of immigrants in the U.S. They study the economic and cultural contributions of Latines in MN, as well as social changes created by them. There is much interaction with Latine immigrants and activists in the classroom and the community.prereq: C- or better in SPAN 3015W or SPAN 3015V or SPAN 3019W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3015W",
          "subject": "SPAN",
          "id": "3015W"
        },
        {
          "code": "SPAN 3019",
          "subject": "SPAN",
          "id": "3019"
        }
      ]
    }
  },
  {
    "uid": "818259",
    "code": "SPAN3403",
    "subject": "SPAN",
    "number": "3403",
    "honors": false,
    "writingIntensive": false,
    "name": "Latino Immigration on Border",
    "fullname": "Latino Immigration on US/Mexican Border",
    "info": "This course takes place off campus, through an organization called \"Border Links\" that is located in Tucson and works with migrants. Students will experience firsthand many issues that directly affect the migrant journey and meet with many immigrants to hear their personal stories. In addition to learning the history of the situation on the border, students will take a tour of the border wall, visit neighboring communities that work with immigrants, do a legal immigration simulation, walk the migrant trails in the Sonoran Desert and leave water there with Humane Borders, go to a Operation Streamline Deportation Court hearing, visit migrants seeking political asylum in Florence Detention Center, talk with a leader in Southside Workers Center, meet with an author focusing on Border Patrol, and more.Themes explored in this course include the connection between the roots of emigration and the global economy of violence in Central America; human rights on the border; and issues immigrants face in the US such as immigrants living in the US with or without legal documents, detention and deportation and the work they are doing to make a more just immigration system. Students will gather information during their stay and create a presentation to be shown to people in Minnesota upon returning from the border.",
    "prereq": []
  },
  {
    "uid": "797777",
    "code": "SPAN3404",
    "subject": "SPAN",
    "number": "3404",
    "honors": false,
    "writingIntensive": false,
    "name": "Medical Spanish/CommHlthLrnng",
    "fullname": "Medical Spanish and Community Health Learning",
    "info": "Medical Spanish and Community Health Learning is an advanced language and culture course that trains Spanish Studies majors and minors to communicate effectively with Spanish-speaking patients in a healthcare setting. The course includes a service-learning component where students work with community healthcare partners who serve the growing Chicano/Latino population in Minnesota. The course seeks to provide students interested in healthcare professions with a better understanding of the health disparities faced by Latino migrant communities in the United States. SPAN 3404 covers various topics such as challenges and opportunities in achieving equitable health access and preventive medicine in underserved populations, the role of social determinants of health in community healthcare, understanding culture-bound syndromes, comprehensive medical terminology, and basic medical interpretation. It's important to note that while some students may observe medical provider-patient interactions, they are not allowed to be involved in direct patient health care.prereq: SPAN 3015W with grade of at least C- or better and instructor permission.  Recommended one additional upper division Spanish class.",
    "prereq": {
      "code": "SPAN 3015",
      "subject": "SPAN",
      "id": "3015"
    }
  },
  {
    "uid": "794969",
    "code": "SPAN344",
    "subject": "SPAN",
    "number": "344",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Medical Spanish",
    "fullname": "Advanced Medical Spanish",
    "info": "0 cr. course designed to further develop and strengthen the language skills and cultural awareness students have been exposed to and acquired in Interm Med Span 0144, a course designed to help care professionals communicate with patients who speak Spanish.prereq: Span 0144, 2 yrs. Spanish College Level or equiv, dept consent.",
    "prereq": []
  },
  {
    "uid": "008074",
    "code": "SPAN3501",
    "subject": "SPAN",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Roots of Mod Spain/Latin Amer",
    "fullname": "Roots of Modern Spain and Latin America",
    "info": "Historical/cultural events leading to nation building in early modern Spain and Spanish speaking America.prereq: 3015, [3105W or TLDO 3105 or VENZ 3512 or instr consent]",
    "prereq": {
      "and": [
        {
          "code": "SPAN 3015",
          "subject": "SPAN",
          "id": "3015"
        },
        {
          "or": [
            {
              "code": "SPAN 3105W",
              "subject": "SPAN",
              "id": "3105W"
            },
            {
              "code": "TLDO 3105",
              "subject": "TLDO",
              "id": "3105"
            },
            {
              "code": "VENZ 3512",
              "subject": "VENZ",
              "id": "3512"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "008142",
    "code": "SPAN3502",
    "subject": "SPAN",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Spain",
    "fullname": "Modern Spain",
    "info": "This course is an introduction to Spain’s history, culture, and present-day society through a survey of literature, art, film, and political writings. Students will learn about the key moments that have marked Spain’s history from the 19th century to the present, including the end of Spanish Empire; the Civil War; Francoist dictatorship and experience of exile; the Transition to Democracy; nationalist movements in the Basque Country and Catalonia; the financial crisis of 2008 and the anti-austerity 15-M movement; twenty-first-century immigration and Spain’s place in a global context; among others. Through a focus on Spain’s challenging negotiation of its linguistic diversity and social complexity, students will develop a better understanding of the concepts of cultural understanding and difference. Students will also build on their linguistic competence in Spanish while improving their critical thinking and writing skills. The course would appeal especially to students returning from study abroad who wish to deepen their understanding of Spanish cultural history or those preparing to travel who would like to establish a linguistic, historical, and cultural foundation for studying in Spain.  Prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "807157",
    "code": "SPAN3503",
    "subject": "SPAN",
    "number": "3503",
    "honors": false,
    "writingIntensive": false,
    "name": "Pre-mod Span Culture & Thought",
    "fullname": "Pre-modern Spanish Culture and Thought",
    "info": "Notions of nation, empire, and race precipitated by presence of Muslims, Jews, and Christians in Iberia in 12th and 13th centuries. Toledo as center of translation, technology, innovation, design, and philosophical inquiry for all of Europe. How Iberian literary works differed from those produced in the rest of Western Europe. Readings from Saint Isidore, Ibn Hazm, Averroes (Ibn Rushd), and Maimonides. prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "826909",
    "code": "SPAN3504",
    "subject": "SPAN",
    "number": "3504",
    "honors": false,
    "writingIntensive": false,
    "name": "Bioethics in Span-Spkng World",
    "fullname": "Bioethics and Culture in the Spanish-  Speaking World",
    "info": "This course studies how Iberian and Latin American novels, films, graphic narrative, and other forms of cultural production engage primary bioethical concepts and debates that are at the center of the major political and sociological shifts shaping the histories of the nations in which the works emerge. Students can expect to gain an understanding of how bioethical concepts intertwine with Iberian and Latin American cultural production in singular ways that inspire deep philosophical reflection, as well as comprehension of how the emotional and empathic response to a work of art can deepen consideration of bioethical issues.",
    "prereq": []
  },
  {
    "uid": "826969",
    "code": "SPAN3505",
    "subject": "SPAN",
    "number": "3505",
    "honors": false,
    "writingIntensive": false,
    "name": "Health, Environment Humanities",
    "fullname": "Health and Environmental Humanities through Latin American Literature, Art, and Film",
    "info": "This interdisciplinary course serves as an introduction to environmental and health humanities, delving into the intersections between these two fields of study. Our readings will primarily  focus on how the humanities and the arts engage in discussions of the impact that environmental issues and the ecological crisis have on health, illness, and sanitary crisis. Through a collection of Latin American novels, short stories, essays, and films, we will explore the intricate  connections between the human and the non-human, the impacts of environmental changes on individual and community health and well-being, and the exacerbation of social inequalities and violations of human and environmental rights in Latin America. Additionally, we will emphasize the struggles for resistance and transformation, acknowledging the interconnectedness of all forms of life. With a particular emphasis on the interplay between health and social and  environmental justice, we will investigate how literature, documentary film, and art can contribute to these discussions and what we can learn from Latin American thinkers, writers, artists, and social activists. We will explore essential concepts and debates and analyze portrayals of illness, toxicity, degradation, extractivism, as well as various expressions of healing, communities of care, and the struggles and initiatives to interconnect medical and environmental humanities. We will also  explore the role that literature, art, and film currently play (or potentially play) in the education  of health professionals. ",
    "prereq": []
  },
  {
    "uid": "008671",
    "code": "SPAN3510",
    "subject": "SPAN",
    "number": "3510",
    "honors": false,
    "writingIntensive": false,
    "name": "Issues in Hispanic Cultures",
    "fullname": "Issues in Hispanic Cultures",
    "info": "In this course, we will explore specific cultural issues or practices from different time periods and areas of the Spanish or Portuguese-speaking world. The focused study of the class topic will be framed within a broader exploration of the historical, cultural, political, economic, and ideological contexts within which it has arisen. Through the study of the diverse topics explored in different classes, students will gain an appreciation for the diversity of histories and cultures in the Spanish and Portuguese-speaking world and develop the skills to engage in a critical practice of cultural analysis. A wide variety of cultural texts and social practices may be studied, including, but not limited to, literary, philosophical, critical and essayistic texts, films and documentaries, visual art, social movements and various forms of political activism, political treaties, historical documents, etc. Topics vary and are specified in the class schedule. Prerequisite: A grade of C- or better in SPAN 3104W or SPAN 3105W or TLDO 3104 or TLDO 3105 or VENZ 3104 or VENZ 3512 or ARGN 3104W or SPAN 3104v or SPAN 3105v or instructor consent.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3104",
          "subject": "TLDO",
          "id": "3104"
        },
        {
          "code": "TLDO 3105",
          "subject": "TLDO",
          "id": "3105"
        },
        {
          "code": "VENZ 3104",
          "subject": "VENZ",
          "id": "3104"
        },
        {
          "code": "VENZ 3512",
          "subject": "VENZ",
          "id": "3512"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105",
          "subject": "SPAN",
          "id": "3105"
        }
      ]
    }
  },
  {
    "uid": "008678",
    "code": "SPAN3512",
    "subject": "SPAN",
    "number": "3512",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Latin America",
    "fullname": "Modern Latin America",
    "info": "Span 3512, conducted entirely in Spanish, will consider some of the relations between daily life and symbolic production in modern Latin America. We will begin by exploring the emergence of ways of naming and mapping the hemisphere: where/what is Latin America? What is the history of cultures and the movement of peoples that have given rise to what we imagine as Latin America today? What do we mean by such names as America, Hispanic, Latino, etc.? What is the relation between Latin America and Latino? What are different ways to explore cultural manifestations and products? Using film, documentaries, production of soap operas, the web, and other resources, we will go on to examine a series of topics from a historical perspective, including education, modernity, modernization, and identity formation. Prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "008381",
    "code": "SPAN3601",
    "subject": "SPAN",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist'y of Marginals",
    "fullname": "A Social History of Marginals and Social Offenders",
    "info": "Social history of deviance using a series of first-person narratives by Hispanic authors who lived \"marginal\" lives and wrote about them. Taught in English.",
    "prereq": []
  },
  {
    "uid": "807963",
    "code": "SPAN3603",
    "subject": "SPAN",
    "number": "3603",
    "honors": false,
    "writingIntensive": false,
    "name": "Jews/Muslims: Medieval Iberia",
    "fullname": "Jews and Muslims in Medieval Iberia",
    "info": "Medieval Spain was the center of an Islamic caliphate in the eighth to the eleventh centuries, and Muslim kingdoms survived in Spain until the end of the fifteenth century. In this class we will explore how Spain’s Muslim past shaped the ideas and culture into the present and explore notions of race and nation as shaped by the presence of Muslims, Jews and Christians in medieval Spain. We will engage with contemporary debates about how to remember this period, as well as how to use and interpret this past, evident in the lived realities of Spaniards who encounter it everyday in the historic buildings and monuments present across Spain, as well as the international tour groups and scholars who visit. While today Spain is often associated with Catholicism, this class looks back to an earlier cultural moment and invites students to think about other possible ways of imagining religious identity and the nation. This class is in English, with select readings in Spanish for those with Spanish reading ability.",
    "prereq": []
  },
  {
    "uid": "009121",
    "code": "SPAN3606",
    "subject": "SPAN",
    "number": "3606",
    "honors": false,
    "writingIntensive": false,
    "name": "Hum Rights in Americas",
    "fullname": "Human Rights Issues in the Americas",
    "info": "Human rights movement. International law of human rights and the justice system. Focuses on human rights cases in the Americas and on cultural practices related to human rights.",
    "prereq": []
  },
  {
    "uid": "009802",
    "code": "SPAN3609",
    "subject": "SPAN",
    "number": "3609",
    "honors": false,
    "writingIntensive": false,
    "name": "Commodity Myths",
    "fullname": "Commodities and National Myths",
    "info": "Influence on Latin American national identities of selected commodities produced for the world market. Taught in English.",
    "prereq": []
  },
  {
    "uid": "008500",
    "code": "SPAN3612",
    "subject": "SPAN",
    "number": "3612",
    "honors": false,
    "writingIntensive": false,
    "name": "Don Quijote & the Novel",
    "fullname": "Don Quijote and the Novel",
    "info": "How Cervantes' text enters in dialogue with prevalent novelistic and  social discourses of Spain's Renaissance and Baroque periods (sixteenth/seventeenth century). How novel has managed to interest succeeding generations of readers. Taught in English.",
    "prereq": []
  },
  {
    "uid": "008463",
    "code": "SPAN3653",
    "subject": "SPAN",
    "number": "3653",
    "honors": false,
    "writingIntensive": false,
    "name": "Latinx Cultural Narr in US",
    "fullname": "Latinx Cultural Narratives in the US",
    "info": "A wide variety of Latino groups have used the stage to explore identity issues in a public forum and have developed nontraditional approaches which have altered the nature, quality and substance of recent theater in the U.S. Off-Broadway, regional troupes, and groups and have attempted to break the mainstream theater's hegemony by addressing the audience's desire to see their problems enacted in understandable and creative terms. Through an interdisciplinary approach which will include lectures, discussions, performance and visual materials, the course will introduce established and work-in-progress plays of the most active Latin (0) playwrights in the country, along with the historical, political and cultural development framework which made it possible.THIS CLASS IS TAUGHT IN ENGLISH",
    "prereq": []
  },
  {
    "uid": "792946",
    "code": "SPAN3699",
    "subject": "SPAN",
    "number": "3699",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Spanish Abroad",
    "fullname": "Study of Advanced Spanish Language Abroad",
    "info": "Study of advanced Spanish language in a Spanish-speaking country.prereq: Two yrs college-level Spanish, dept consent",
    "prereq": []
  },
  {
    "uid": "007475",
    "code": "SPAN3701",
    "subject": "SPAN",
    "number": "3701",
    "honors": false,
    "writingIntensive": false,
    "name": "Span Phonology & Phonetics",
    "fullname": "Structure of Spanish: Phonology and Phonetics",
    "info": "This course aims to provide you with an understanding of the basic concepts of phonetics and phonology and to teach you to apply these concepts to Spanish. The course will be both conceptual and practical. The practical component will involve using the concepts learned in class to improve your own pronunciation of Spanish. You will acquire skills in recognizing, producing, transcribing and describing in linguistic terms the sounds of Spanish and in understanding and analyzing the Spanish sound system. Consideration will also be given to the Spanish orthographical system as it relates to the sound system, variation in Spanish pronunciation among native speakers, and the challenges of a second language learner in acquiring the phonology of their second language. prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "008135",
    "code": "SPAN3702",
    "subject": "SPAN",
    "number": "3702",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Morphology & Syntax",
    "fullname": "Structure of Spanish: Morphology and Syntax",
    "info": "This course is an introduction to the morphology and syntax of Spanish as a written language. The goal of the course is to improve written Spanish by understanding morphological and syntactic notions and developing the ability to syntactically analyze words and sentences. Consequently, much of the course work will be devoted to practice syntactic analysis of Spanish sentences taken from literary texts. We will first work with morphological analysis. Then we will proceed with syntactic analysis. We will start with the simple sentence. Then we will study morphological notions such as noun, adjective, and verb. After that we will tackle the analysis of complex constructions such as coordinate clauses and subordinate clauses.Prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "008137",
    "code": "SPAN3703",
    "subject": "SPAN",
    "number": "3703",
    "honors": false,
    "writingIntensive": false,
    "name": "History of Spanish &Portuguese",
    "fullname": "Origins and History of Spanish and Portuguese",
    "info": "This course constitutes an introduction to the origins and history of the Spanish language. Spanish (or Castilian) descends from Latin, which is also the ancestor of Portuguese, Italian, French, Romanian, among others. This is why we say bueno in Spanish, bon in French, buono in Italian, bom in Portuguese, and buna in Romanian. Also, Latin belongs to a wider group of languages: the Indo-European family, which also includes Sanskrit, English, German, and Russian, among others. For this reason, the word for the number two in English is similar to dos in Spanish, dvaú in Sanscript, dva in Russian and zwei in German. In the course, we will see how Latin words changed to become Spanish words. These changes did not happen in a void. Therefore, in the first part of the course we will study the historical circumstances that caused the birth and expansion of Spanish. When Romans invaded the Iberian Peninsula there were other groups already there who lent some of their words to Latin. Celts occupied the northwestern portion of Spain, which is known as Galicia. Interestingly, the traditional musical instrument of Galicia is the bagpipe, as in Ireland and Scotland, which also have Celtic ancestors. Some Celtic words passed to the variety of Latin spoken in the Iberian Peninsula, and later to Spanish. Thus, while France and Italy utilize the Germanic word bier to designate beer: French bière, Italian birra, in Spanish we say cerveza, which comes from the Celtic word cerevisia. With the fall of the Roman Empire, Germanic tribes invaded the Iberian Peninsula. This is how some Germanic terms passed to Latin and eventually became Spanish. Since English is a Germanic language, these Spanish terms are similar to the English ones: spy espía, vandalism vandalismo, goose, ganso, etc. At the end of the Germanic rule, Arab groups invaded Iberia. As a result, Spanish has more than four thousand Arabic words, as ojalá from inshallah ‘god willing’. The Arabs brought with them advances in astronomy, mathematics, medicine, agriculture, poetry, etc. For this reason, during the Middle Age, Al-Andalús, which was the name of the territory of the Iberian Peninsula occupied by the Arabs, flourished economically and culturally. It is during this period that Spanish developed. In the second part of the course, we will see how Latin words transformed into Spanish. These changes were not at random, on the contrary most of them changed in predictable ways. For example, the Latin letter p when placed between two vowels became b in Spanish: the word lupus ‘wolf’ became lobo in Spanish, scopa ‘broom’ became escoba. Studying this evolution will help you understand the reason behind some supposed irregularities in the Spanish Grammar: duermo vs. dormimos. Also, you will be able to recognize the relation between some English and Spanish words, since both languages are like lone cousins.prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "008368",
    "code": "SPAN3704",
    "subject": "SPAN",
    "number": "3704",
    "honors": false,
    "writingIntensive": false,
    "name": "Span Sociolinguistics",
    "fullname": "Sociolinguistics of the Spanish-Speaking World",
    "info": "This course focuses on the study of the Spanish language in a variety of geographical and social contexts. We’ll examine the historical, social, and linguistic factors that have shaped the development of different varieties of the Spanish language in Spain, Latin America, Africa, and Asia, including contact with other languages and cultures. In addition, we will explore how social factors such as occupation, education, gender, age, and ethnicity influence the ways that Spanish is spoken. We’ll also examine language ideologies and linguistic attitudes toward different varieties of Spanish and explore the reasons that some varieties of Spanish seem to be valued more highly than others. prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "008245",
    "code": "SPAN3705",
    "subject": "SPAN",
    "number": "3705",
    "honors": false,
    "writingIntensive": false,
    "name": "Span Semantics & Pragmatics",
    "fullname": "Semantics and Pragmatics of Spanish",
    "info": "This pragmatics course deals with the social aspects of sense-making. Here you will learn how members of Spanish culture create meaning in oral and written exchanges. Meaning is not simply transmitted from speaker to audience but negotiated by the participants of the communicative interaction. You will learn how Spanish speakers deal with requests, refusals, compliments, advice, and apologies, and how they accommodate their discourse to their interlocutors. You will also explore how courtesy and discourtesy are expressed and inferred by Spanish speakers and how Spanish is utilized to persuade the audience, thus bringing up issues of language and power. Finally, you will study how members of Hispanic culture express themselves by non-verbal means (gestures, body movements, etc.). In sum, you will be exposed to the sociocultural resources native speakers utilize to infer and convey meaning. In class, after learning the theory, you will work in groups analyzing real cases of oral and written communicative exchanges in Spanish. You will also be asked to work in groups to envision how a native Spanish speaker would linguistically act in a hypothetical communicative situation.prereq:  grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "797446",
    "code": "SPAN3706",
    "subject": "SPAN",
    "number": "3706",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Applied Linguistics",
    "fullname": "Spanish Applied Linguistics",
    "info": "Spanish Applied Linguistics examines the ways in which linguistic research can be applied to the learning and teaching of Spanish. The first part of this course provides an overview of the main theories and processes of second language acquisition as they apply to Spanish second language learners and heritage speakers of Spanish to answer questions such as: How do individuals acquire a second language? In what ways is the process similar to or different from first language acquisition? In what ways are heritage learners similar to or different from second language learners? What level of proficiency do most Spanish majors attain by the time they graduate? What strategies can language learners use to reach higher levels of proficiency? The second part of the course will focus on the aspects of Spanish that are especially challenging for both second language learners and heritage speakers. For example, we’ll analyze why the distinction between the preterite and imperfect past tenses is so difficult for English-speakers to acquire. We’ll also examine pragmatic differences in the way people interact in Spanish and English. For example, is making a request in a restaurant done the same way in Minneapolis as in Madrid, Spain or Quito, Ecuador? How do English speakers learn to make appropriate requests in Spanish? Students will analyze actual native speaker and learner production of Spanish so they can develop a greater awareness of how the language works in context and how it varies across the Spanish-speaking world.prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "795767",
    "code": "SPAN3707",
    "subject": "SPAN",
    "number": "3707",
    "honors": false,
    "writingIntensive": false,
    "name": "Lngstc Accrcy via Translation",
    "fullname": "Linguistic Accuracy Through Translation",
    "info": "In this class, we will use translation as a tool to improve the accuracy with which we communicate in Spanish. Translations will be both from Spanish into English and English into Spanish, as each of these forces you to make use of different aspects of your knowledge of the Spanish language. While we will be learning about translation to some extent, the goal of the course is not to turn you into a translator (though it can be a starting point if you have an interest in pursuing additional coursework in translation). Rather, translation will provide an opportunity to think about the factors we need to take into consideration when making the large number of decisions we need to make when using the Spanish language. Throughout the course a variety of types of texts will be examined that vary in terms of style, audience and lexicon, and these will serve as a framework for learning to make decisions that accurately communicate our intended meaning in Spanish. In doing so, we will review many points of Spanish grammar and learn to think about them in new ways – from the most basic grammar points that students think they understand well but perhaps haven’t realized that there are subtle differences from English to those grammar points that always pose challenges for even the most advanced students. If you come with an open mind to think about the Spanish language in a new way you will put yourself in the best position to be successful. prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "818188",
    "code": "SPAN3708",
    "subject": "SPAN",
    "number": "3708",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish in the United States",
    "fullname": "Spanish in the United States",
    "info": "In this course, students will learn about the various Spanish-speaking communities in the US, including a brief history of their migration and settlement patterns, as well as their current demographic and socioeconomic characteristics, and how these characteristics relate to Spanish language maintenance and shift. They will also explore the linguistic features of Spanish as it is spoken in the US, including dialectal variation across speakers from different countries of origin, the acquisition of Spanish by heritage speakers, codeswitching, and other language contact phenomena. The course will also examine socio-cultural issues related to the presence and vitality of Spanish in the United States, such as the use of Spanish in politics, in educational and medical settings, in courtrooms, as well as on social media, TV, and in movies and music. Students will also gain an understanding of language ideologies and the ways in which they shape understandings of U.S. Spanish. prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "826295",
    "code": "SPAN3709",
    "subject": "SPAN",
    "number": "3709",
    "honors": false,
    "writingIntensive": false,
    "name": "Context of Learning Spanish",
    "fullname": "Context of Learning and the Acquisition of Spanish as a Second Language",
    "info": "What is the best way to learn a second language? Many believe that living in a community in what that language is spoken as a native language is the best option, so many language learners choose to spend weeks, months, and even years studying and living abroad with the goal of improving their proficiency. But is it always better? Are there any aspects of the linguistic system that are learned better in a classroom? And do the results vary according to the status of the first and second languages of the speaker? Approximately 18 million people study or speak Spanish as a second language around the world. The contexts in which they learn Spanish vary from the classroom to natural environments. In this course, you will explore the various contexts and synthesize the results of empirical studies with the goal of identifying the influence of contextual variables on the acquisition of Spanish as a second language. By the end of the course, you will be able to answer the following questions: What does it mean to know a language? In what contexts is Spanish learned as a second language? What are the advantages and disadvantages of each context? How do other variables interact with context to influence language development?",
    "prereq": []
  },
  {
    "uid": "008138",
    "code": "SPAN3730",
    "subject": "SPAN",
    "number": "3730",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Hispanic Linguistics",
    "fullname": "Topics in Hispanic Linguistics",
    "info": "This course explores questions related to the use and/or learning of Spanish and may touch on topics related to the sounds of Spanish (phonetics and phonology), the structure of sentences (syntax) or words (morphology), meaning (semantics), language in context (pragmatics), or language in society (sociolinguistics). Topics vary by semester and instructor. Some topics that have been addressed in this course include: How does study abroad impact the acquisition of Spanish as a second language? How is meaning created in Spanish? What are the features of the Spanish spoken in the US? How does language maintain, question, or challenge power hierarchies? Topics for a specific semester can be found in Class Scheduleprereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W.",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "790843",
    "code": "SPAN3800",
    "subject": "SPAN",
    "number": "3800",
    "honors": false,
    "writingIntensive": false,
    "name": "Film Studies in Spanish",
    "fullname": "Film Studies in Spanish",
    "info": "Films from Spain or Spanish-speaking world in their historical, (geo)political, and socioeconomic contexts. Films analyzed under interdisciplinary frameworks, noting aspects related to cinematography/rhetoric.\n\nprereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "819099",
    "code": "SPAN3807",
    "subject": "SPAN",
    "number": "3807",
    "honors": false,
    "writingIntensive": false,
    "name": "Mdcl Humanities/Latin Am. Film",
    "fullname": "Medical Humanities and Latin American Film: Narratives of Health, Illness & Trauma",
    "info": "In this course, we will study the representations of health, illness, and trauma in Latin American films. We will focus on the different ways in which the moving image account for different stories and perspectives. We will pay particular attention to the use of the camera in relation to the stories told by the different characters of the film, in particular, doctors and health workers, patients and their families. We will focus on the process of storytelling of illness and trauma, and on the essential role that the study of cultural and socio-political frameworks have in the study of narratives. Our objective will be to explore the visual, acoustic and narrative strategies through which pain, illness, trauma, and death are represented, as well as the role of those who listen to these narratives (friends, family, health professionals and, of course, ourselves as spectators) in the process of interpretation (and the cultural aspects of interpretation). In this course, students will reflect on the human condition, and in the use of storytelling to understand and communicate one’s life story, focusing on the moments in which that the experience of illness or trauma interrupts and transforms a life story. Students will work in groups to create narratives based on the films studied in class and to analyze films (and their own narratives) with critical approaches coming from, visual and acoustic studies, philosophy, literary studies, and narrative medicine.prereq: A grade of C- or better in SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or SPAN 3105V or TLDO 3105W or SPAN 3107W or SPAN 3107V or TLDO 3107W",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "TLDO 3107",
          "subject": "TLDO",
          "id": "3107"
        }
      ]
    }
  },
  {
    "uid": "008075",
    "code": "SPAN3910",
    "subject": "SPAN",
    "number": "3910",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Spanish Peninsular Lit",
    "fullname": "Topics in Spanish Peninsular Literature",
    "info": "In this course, we will explore specific themes or issues, from different time periods, as they are reflected in Spanish peninsular literature. The focused study of the class topic will be framed within a broader exploration of larger historical, political and cultural movements and trends. Through the study of the diverse topics explored in different classes, students will gain an appreciation for the diversity of cultures in Spain and the plurality of possible critical approaches to literary texts. Students will develop the skills and vocabulary to engage in a critical practice of textual analysis. \n\nTopics vary and are specified in the class schedule. \n\nPrereq: SPAN 3104W or SPAN 3104V or TLDO 3104W or ARGN 3104W or SPAN 3105W or TLDO 3105W or SPAN 3105V or VENZ 3512 or instructor consent.\n",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104W",
          "subject": "TLDO",
          "id": "3104W"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105W",
          "subject": "TLDO",
          "id": "3105W"
        },
        {
          "code": "VENZ 3512",
          "subject": "VENZ",
          "id": "3512"
        }
      ]
    }
  },
  {
    "uid": "008927",
    "code": "SPAN3920",
    "subject": "SPAN",
    "number": "3920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in Spanish-American Lit",
    "fullname": "Topics in Spanish-American Literature",
    "info": "This course focuses on a wide gamut of  intellectual, literary, and artistic movements in Spanish and Portuguese-speaking countries across eras. Engaging with the most up-to-date trends of critical and methodological tools in cultural, literary, and philosophical analysis, students will examine a variety of issues in conversation with the political and social conditions that have influenced shifts in art, cultural, and intellectual praxis among different groups of peoples, writers, and artists across disciplines and continents. \n\nTopics vary and are specified in the class schedule. \n\nprereq: SPAN 3104W or TLDO 3104 or VENZ 3104 or ARGN 3104W or SPAN 3105W or TLDO 3105 or VENZ 3512 or instructor consent\n",
    "prereq": {
      "or": [
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "TLDO 3104",
          "subject": "TLDO",
          "id": "3104"
        },
        {
          "code": "VENZ 3104",
          "subject": "VENZ",
          "id": "3104"
        },
        {
          "code": "ARGN 3104W",
          "subject": "ARGN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "TLDO 3105",
          "subject": "TLDO",
          "id": "3105"
        },
        {
          "code": "VENZ 3512",
          "subject": "VENZ",
          "id": "3512"
        }
      ]
    }
  },
  {
    "uid": "008144",
    "code": "SPAN3940",
    "subject": "SPAN",
    "number": "3940",
    "honors": false,
    "writingIntensive": false,
    "name": "Figures in Span Lit",
    "fullname": "Figures in Spanish Peninsular Literature",
    "info": "Major writer or group of writers whose work has had an impact on Spanish thought or literature or analysis of social patterns. Figures specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "007622",
    "code": "SPAN3950",
    "subject": "SPAN",
    "number": "3950",
    "honors": false,
    "writingIntensive": false,
    "name": "Figures: SpAm Lit",
    "fullname": "Figures in Spanish American Literature",
    "info": "One major writer or group of writers whose work has had an impact on thought, literature, or social problems. Figures are specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "007634",
    "code": "SPAN3970",
    "subject": "SPAN",
    "number": "3970",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading/study in Hispanic linguistics, cultural studies, or peninsular, Latin American, or U.S. Latino theater or literatures.Prereq instr consent, dept consent, college consent.",
    "prereq": []
  },
  {
    "uid": "007624",
    "code": "SPAN3972W",
    "subject": "SPAN",
    "number": "3972",
    "honors": false,
    "writingIntensive": true,
    "name": "Capstone Seminar",
    "fullname": "Capstone Seminar",
    "info": "Completion of a research paper on cultural, literary, or artistic issue in Spanish or Portuguese speaking worlds or on a topic related to Hispanic linguistics. In-depth research/consultation with instructor.SPAN 3972W needs to be taken during the semester in which student completes major course work.prereq: Spanish Studies Major (for those who declared before Fall 2018): C- or better in SPAN 3015w, 3104w, 3105w, 3107w and 3 SPAN electives with a critical analysis prerequisite. Spanish Studies major (for those who declare Fall 2018 and after): C- or better in Span 3015w, 2 Span 31xx courses, and 4 electives with a Critical Analysis prerequisite. Spanish/Portuguese Studies Majors (for those who declared before Spring 2022): C- or better in SPAN 3015w, PORT 3003, SPAN 3104w, 3107w, 1 PORT 35xx class, 2 upper level SPAN or PORT electives.Spanish/Portuguese Studies Majors (for those who declared Spring 2022 and after): C- or better in SPAN 3015W, PORT 3003, SPAN 3104W or 3105W & 3107W, 1 PORT elective, 2 additional upper level Spanish or Portuguese electives.",
    "prereq": {
      "and": [
        {
          "code": "SPAN 3015W",
          "subject": "SPAN",
          "id": "3015W"
        },
        {
          "code": "SPAN 3104W",
          "subject": "SPAN",
          "id": "3104W"
        },
        {
          "code": "SPAN 3105W",
          "subject": "SPAN",
          "id": "3105W"
        },
        {
          "code": "SPAN 3107W",
          "subject": "SPAN",
          "id": "3107W"
        },
        {
          "code": "PORT 3003",
          "subject": "PORT",
          "id": "3003"
        }
      ]
    }
  },
  {
    "uid": "825988",
    "code": "SPAN3993",
    "subject": "SPAN",
    "number": "3993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study.Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including:- the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project.- the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit)- the faculty mentor is qualified to serve in this role- assessment of student learning and grading criteria are clear and appropriate- the student will be working in a respectful, inclusive environment",
    "prereq": []
  },
  {
    "uid": "825995",
    "code": "SPAN3994",
    "subject": "SPAN",
    "number": "3994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Guided Research.Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including:- the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project.- the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit)- the faculty mentor is qualified to serve in this role- assessment of student learning and grading criteria are clear and appropriate- the student will be working in a respectful, inclusive environment",
    "prereq": []
  },
  {
    "uid": "799359",
    "code": "SPAN4001",
    "subject": "SPAN",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg Spanish Graduate Research",
    "fullname": "Beginning Spanish for Graduate Student Research",
    "info": "Listening, speaking, reading, writing. Emphasizes development of communicative competence. Cultural readings. Prereq: Less than 2 yrs of High School Spanish, and dept consent",
    "prereq": []
  },
  {
    "uid": "799360",
    "code": "SPAN4002",
    "subject": "SPAN",
    "number": "4002",
    "honors": false,
    "writingIntensive": false,
    "name": "Beg Spanish Graduate Research",
    "fullname": "Beginning Spanish for Graduate Student Research",
    "info": "Listening, speaking, reading, writing. Emphasizes development of communicative competence. Cultural readings. Meets concurrently with 1002.Prereqs: A Grade of C- or better in SPAN 1001/4001 completed at UMNTC and department consent ",
    "prereq": {
      "or": [
        {
          "code": "SPAN 1001",
          "subject": "SPAN",
          "id": "1001"
        },
        {
          "code": "SPAN 4001",
          "subject": "SPAN",
          "id": "4001"
        }
      ]
    }
  },
  {
    "uid": "799361",
    "code": "SPAN4003",
    "subject": "SPAN",
    "number": "4003",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Spanish Graduate Research",
    "fullname": "Intermediate Spanish for Graduate Student Research",
    "info": "Speaking/comprehension. Developing reading/writing skills based on materials from Spain/Spanish America. Grammar review. Compositions, oral presentations. Meets concurrently with 1003.Prereq: A Grade of C- or better in SPAN 1002 or SPAN 4002 or SPAN 1022 or SPAN 4022 or EPT placement of SPAN 1003",
    "prereq": {
      "or": [
        {
          "code": "SPAN 1002",
          "subject": "SPAN",
          "id": "1002"
        },
        {
          "code": "SPAN 4002",
          "subject": "SPAN",
          "id": "4002"
        },
        {
          "code": "SPAN 1022",
          "subject": "SPAN",
          "id": "1022"
        },
        {
          "code": "SPAN 4022",
          "subject": "SPAN",
          "id": "4022"
        },
        {
          "code": "SPAN 1003",
          "subject": "SPAN",
          "id": "1003"
        }
      ]
    }
  },
  {
    "uid": "799362",
    "code": "SPAN4004",
    "subject": "SPAN",
    "number": "4004",
    "honors": false,
    "writingIntensive": false,
    "name": "Int Spanish Graduate Research",
    "fullname": "Intermediate Spanish for Graduate Student Research",
    "info": "Speaking/comprehension. Developing reading/writing skills based on materials from Spain/Spanish America. Grammar review. Compositions, oral presentations. Meets concurrently with 1004.",
    "prereq": []
  },
  {
    "uid": "810921",
    "code": "SPAN4014",
    "subject": "SPAN",
    "number": "4014",
    "honors": false,
    "writingIntensive": false,
    "name": "Business Spanish Grad Research",
    "fullname": "Business Spanish for Graduate Student Research",
    "info": "Vocabulary, report writing skills. Proper format for business communications. Conversational fluency on trade-related topics. Meets with SPAN 1014.",
    "prereq": []
  },
  {
    "uid": "800162",
    "code": "SPAN4022",
    "subject": "SPAN",
    "number": "4022",
    "honors": false,
    "writingIntensive": false,
    "name": "Alt 2nd Sem Span Grad Research",
    "fullname": "Alternate Second-Semester Spanish for Graduate Student Research",
    "info": "For students who have studied Spanish in high school or at community college, or who are transfer students. Begins with accelerated review of 1001/4001 followed by material covered in 1002/4002. Meets concurrently with 1022.",
    "prereq": []
  },
  {
    "uid": "789440",
    "code": "SPAN5012",
    "subject": "SPAN",
    "number": "5012",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv. Probs: Span Lang",
    "fullname": "Advanced Problems in the Spanish Language",
    "info": "Development of oral proficiency in Spanish. Participants choose section of course based on their current ACTFL level of Spanish language proficiency. Problematic aspects of Spanish pronunciation, grammar, idiomatic expressions reviewed according to needs of class participants.",
    "prereq": []
  },
  {
    "uid": "008631",
    "code": "SPAN5110",
    "subject": "SPAN",
    "number": "5110",
    "honors": false,
    "writingIntensive": false,
    "name": "Spain: Discur Forms",
    "fullname": "Discursive Formations at the Threshold of 20th-Century Spain",
    "info": "Theory and representative examples of the realist/naturalist novel (Galdas, Pardo Bazan) in the context of its antecedents (\"costumbrismo\"), opposites (the idealist/sentimental novel), and turn-of-the-century innovations of modernism and the \"generation of 1898.\"prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007974",
    "code": "SPAN5150",
    "subject": "SPAN",
    "number": "5150",
    "honors": false,
    "writingIntensive": false,
    "name": "Contemporary Spanish Lit",
    "fullname": "Contemporary Spanish Literature",
    "info": "Major literary works/movements in Spain from 1915 to 2000.  Neomodernism, surrealism, social realism, literatures of dictatorship/exile. Postmodernism. Poetry, novel, drama, essays, film, video/TV. Problems of literary history.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008081",
    "code": "SPAN5160",
    "subject": "SPAN",
    "number": "5160",
    "honors": false,
    "writingIntensive": false,
    "name": "Medieval Iberian Lit & Culture",
    "fullname": "Medieval Iberian Literatures and Cultures",
    "info": "The major literary genres developed in Spain from the Reconquest to 1502, with reference to the crucial transformations of the Middle Ages, including primitive lyric, epic, clerical narrative, storytelling, debates, collections, chronicles, \"exempla,\" and the Celestina (1499-1502).",
    "prereq": []
  },
  {
    "uid": "007970",
    "code": "SPAN5170",
    "subject": "SPAN",
    "number": "5170",
    "honors": false,
    "writingIntensive": false,
    "name": "Lit of the Spanish Empire",
    "fullname": "The Literature of the Spanish Empire and Its Decline",
    "info": "Major Renaissance/Baroque works of Spanish Golden Age (16th-17th-century poetry, nonfiction prose, novel, drama) examined against historical background of internal economic decline, national crisis, ideological apparatus developed by modern state.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007574",
    "code": "SPAN5180",
    "subject": "SPAN",
    "number": "5180",
    "honors": false,
    "writingIntensive": false,
    "name": "Don Quixote",
    "fullname": "Don Quixote",
    "info": "Analysis of Cervantes' [Don Quixote] in its sociohistorical context; focus on the novel's reception from the romantic period to postmodern times.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007972",
    "code": "SPAN5190",
    "subject": "SPAN",
    "number": "5190",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Literature 1680-1845",
    "fullname": "The Crisis of the Old Regime: Spanish Literature of the Enlightenment and Romanticism",
    "info": "Major literary works/intellectual movements/conflicts represented in written culture, of 18th/early 19th centuries (1680-1845), examined as expressions of long crisis of Spain's Old Regime and rise of bourgeois liberalism.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007975",
    "code": "SPAN5221",
    "subject": "SPAN",
    "number": "5221",
    "honors": false,
    "writingIntensive": false,
    "name": "The Spanish Comedia",
    "fullname": "Spanish Drama of the 17th-Century",
    "info": "Polemics surrounding public theater in 1600s. Analyses of texts in light of current approaches to comedia and related theatrical genres (e.g., autosacramentales).",
    "prereq": []
  },
  {
    "uid": "008147",
    "code": "SPAN5234",
    "subject": "SPAN",
    "number": "5234",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Feminism",
    "fullname": "Feminism and Literature in Spain",
    "info": "Spanish feminist thought and practice; literature, cultural discourse, literary and critical theory.",
    "prereq": []
  },
  {
    "uid": "007575",
    "code": "SPAN5272",
    "subject": "SPAN",
    "number": "5272",
    "honors": false,
    "writingIntensive": false,
    "name": "Hispanic Modernism",
    "fullname": "Hispanic Modernism",
    "info": "Critique of artistic and literary production in Hispanic cultures from mid-19th century to present.  Modernity and modernization in Hispanic world.  \"Generation of 1898.\"  Castilian, Catalan, and Latin American practices along interdisciplinary and comparative lines.",
    "prereq": []
  },
  {
    "uid": "007978",
    "code": "SPAN5316",
    "subject": "SPAN",
    "number": "5316",
    "honors": false,
    "writingIntensive": false,
    "name": "Picaresque Novel",
    "fullname": "Spanish Picaresque Narratives",
    "info": "Literary autobiography, residual elements of Erasmian humanism, post-Tridentine repression/censorship. Picaro's critique of imperial Spain's system of values/authority. Cultural critics' challenge to rediscover popular texts of early modern period.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007630",
    "code": "SPAN5531",
    "subject": "SPAN",
    "number": "5531",
    "honors": false,
    "writingIntensive": false,
    "name": "U.S. Hispanic Lit",
    "fullname": "Hispanic Literature of the United States",
    "info": "Interdisciplinary approach providing a framework for deconstructing issues of national identity, marginalization, and gender. U.S. Hispanic theatre/literature and its ethnic diversity, regional variations, cultural links, and scope of its genres.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007609",
    "code": "SPAN5532",
    "subject": "SPAN",
    "number": "5532",
    "honors": false,
    "writingIntensive": false,
    "name": "Lit/Disintegration",
    "fullname": "Literature and National Disintegration",
    "info": "Literary reaction to contemporary structural changes in world economic system (1970 to present).  Effects on literature as institution.  Texts related to revolutionary trends and social movements (feminism, theology of liberation, defense of human rights).",
    "prereq": []
  },
  {
    "uid": "007616",
    "code": "SPAN5536",
    "subject": "SPAN",
    "number": "5536",
    "honors": false,
    "writingIntensive": false,
    "name": "LAmer Feminism&Lit",
    "fullname": "Feminism and Literature in Latin America",
    "info": "Latin American feminism in thought and practice; literature, cultural discourse, literary theory.",
    "prereq": []
  },
  {
    "uid": "007611",
    "code": "SPAN5550",
    "subject": "SPAN",
    "number": "5550",
    "honors": false,
    "writingIntensive": false,
    "name": "Caribbean Literature",
    "fullname": "Caribbean Literature: An Integral Approach",
    "info": "Literature of Spanish-speaking Caribbean. Emphasizes historical legacy of slavery, African culture, independence struggles.\n\nprereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008012",
    "code": "SPAN5560",
    "subject": "SPAN",
    "number": "5560",
    "honors": false,
    "writingIntensive": false,
    "name": "Colonial Studies in Hisp World",
    "fullname": "Global Colonial Studies in the Hispanic World",
    "info": "Discourse production in Spanish America between 1492 and 1700. Conquest/colonial writing/counter writing. Historical origin, evolution, impact of cultural, political, socioeconomic factors.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008013",
    "code": "SPAN5570",
    "subject": "SPAN",
    "number": "5570",
    "honors": false,
    "writingIntensive": false,
    "name": "19th-Century Latin America",
    "fullname": "Nineteenth Century Latin America: Enlightened Thought, Nation Building, Literacy, Cultural Discourse",
    "info": "Political/economic contexts. Capitalism, liberalism, conservatism, their discursive media. Essay, journalism, literature, expression of everyday life. Wheels of commerce, progress, industrialization. Romanticism, realism, positivistic faith.",
    "prereq": []
  },
  {
    "uid": "007614",
    "code": "SPAN5580",
    "subject": "SPAN",
    "number": "5580",
    "honors": false,
    "writingIntensive": false,
    "name": "Lat Amer Cultural Integration",
    "fullname": "Latin American Cultural Integration in the Neocolonial Order",
    "info": "Modernismo, historical vanguard, impact of populist politics in patterns of culture/literature. 1900-50.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008017",
    "code": "SPAN5590",
    "subject": "SPAN",
    "number": "5590",
    "honors": false,
    "writingIntensive": false,
    "name": "Globalization in Lat America",
    "fullname": "The Impact of Globalization in Latin American Discourses",
    "info": "Second half of 20th century critical culture. Neo-indigenism, new novel, poetry/antipoetry, theater/drama. Pragmatic search for past/identity. Globalization, its impact in literature.",
    "prereq": []
  },
  {
    "uid": "007664",
    "code": "SPAN5701",
    "subject": "SPAN",
    "number": "5701",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist: Ibero-Romance",
    "fullname": "History of Ibero-Romance",
    "info": "Origins and developments of Ibero-Romance languages; evolution of Spanish, Portuguese, and Catalan.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007665",
    "code": "SPAN5711",
    "subject": "SPAN",
    "number": "5711",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Phonology",
    "fullname": "The Structure of Modern Spanish: Phonology",
    "info": "Formulating and evaluating a phonological description of Spanish. Approaches to problems in Spanish phonology within metrical, autosegmental, and lexical phonological theories.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007811",
    "code": "SPAN5712",
    "subject": "SPAN",
    "number": "5712",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Morphology",
    "fullname": "The Structure of Modern Spanish: Morphology",
    "info": "Evaluating morphological theories and descriptions of Spanish.  Examining of phonological and syntactic effects on morphology.",
    "prereq": []
  },
  {
    "uid": "007680",
    "code": "SPAN5713",
    "subject": "SPAN",
    "number": "5713",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Syntax",
    "fullname": "The Structure of Modern Spanish: Syntax",
    "info": "Study and analysis of the principal constructions found in the syntax of Spanish.",
    "prereq": []
  },
  {
    "uid": "007693",
    "code": "SPAN5714",
    "subject": "SPAN",
    "number": "5714",
    "honors": false,
    "writingIntensive": false,
    "name": "Foundations: Spanish Syntax",
    "fullname": "Theoretical Foundations of Spanish Syntax",
    "info": "Linguistic types/processes that appear across languages. Grammatical relations, word order, transitivity, subordination, information structure, grammaticalization. How these are present in syntax of Spanish.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008229",
    "code": "SPAN5715",
    "subject": "SPAN",
    "number": "5715",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Semantics",
    "fullname": "The Structure of Modern Spanish: Semantics",
    "info": "Applying semantic theory to Spanish: conceptual organization and the structuring of experience; meaning and cultural values; semantic fields; categorization and prototypes; cognitive model theory; metaphor, metonymy, and mental imagery as source and change of meaning.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007814",
    "code": "SPAN5716",
    "subject": "SPAN",
    "number": "5716",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Pragmatics",
    "fullname": "Structure of Modern Spanish: Pragmatics",
    "info": "Concepts in current literature in Spanish pragmatics. Deixis, presupposition, conversational implicature, speech act theory, conversational structure.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "797443",
    "code": "SPAN5717",
    "subject": "SPAN",
    "number": "5717",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Sociolinguistics",
    "fullname": "Spanish Sociolinguistics",
    "info": "Sociolinguistic variation, cross-dialectal diversity in different varieties of Spanish in Latin America and Spain. Impact of recent cultural, political, and socioeconomic transformations on language.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "797444",
    "code": "SPAN5718",
    "subject": "SPAN",
    "number": "5718",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Language Contact",
    "fullname": "Spanish Language Contact",
    "info": "Analysis of different types/results of Spanish language contact globally, taking into account varying social conditions under which contact occurs.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "791304",
    "code": "SPAN5721",
    "subject": "SPAN",
    "number": "5721",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Laboratory Phonology",
    "fullname": "Spanish Laboratory Phonology",
    "info": "Core literature on Spanish laboratory phonology. Phonology from a laboratory perspective. Students evaluate laboratory research methodologies, perform basic acoustic analyses, and design laboratory phonology studies.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007477",
    "code": "SPAN5731",
    "subject": "SPAN",
    "number": "5731",
    "honors": false,
    "writingIntensive": false,
    "name": "Dialects of Spain",
    "fullname": "Spanish Dialectology: Regional and Social Dialects of Modern Spain",
    "info": "Major dialect areas of Spain, with distinguishing phonological, morphological, lexical, and syntactic variations of each.  Impact of recent cultural, political, and socioeconomic transformations on language.",
    "prereq": []
  },
  {
    "uid": "007489",
    "code": "SPAN5732",
    "subject": "SPAN",
    "number": "5732",
    "honors": false,
    "writingIntensive": false,
    "name": "SpanAmer Dialects",
    "fullname": "Spanish Dialectology: Regional and Social Dialects of Modern Spanish America",
    "info": "Major dialect areas of Spanish America, with distinguishing phonological, morphological, lexical, and syntactic variations of each.  Their historical origin and evolution and the impact of cultural, political, and socioeconomic transformations on the language.",
    "prereq": []
  },
  {
    "uid": "789507",
    "code": "SPAN5800",
    "subject": "SPAN",
    "number": "5800",
    "honors": false,
    "writingIntensive": false,
    "name": "Spain's Image/Cul",
    "fullname": "Spain's Image and the Hispanic Culture (Towards the XXI Century)",
    "info": "Contemporary Spanish society from perspectives of humanities, social sciences. Major sociocultural changes in Spain during 20th century. Emphasizes current situation, developments leading into 21st century. Literature, history, politics, geographical/regional diversity, art, music, cinema.",
    "prereq": []
  },
  {
    "uid": "007979",
    "code": "SPAN5910",
    "subject": "SPAN",
    "number": "5910",
    "honors": false,
    "writingIntensive": false,
    "name": "Span Pen  Discourse Topics",
    "fullname": "Topics in Spanish Peninsular Studies",
    "info": "Crucial moment or characters, works, or events marking beginning of new phase in literary/cultural landscape.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "010143",
    "code": "SPAN5920",
    "subject": "SPAN",
    "number": "5920",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: SpAmer Discourses",
    "fullname": "Topics in Spanish-American Studies",
    "info": "Spanish-American literature analyzed according to important groups, movements, trends, methods, and genres. Specific approaches depend on topic and instructor. Topics specified in Class Schedule.\n\nprereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "008139",
    "code": "SPAN5930",
    "subject": "SPAN",
    "number": "5930",
    "honors": false,
    "writingIntensive": false,
    "name": "Ibero-Romance Linguistics",
    "fullname": "Topics in Ibero-Romance Linguistics",
    "info": "Problems in Hispanic linguistics; a variety of approaches and methods.",
    "prereq": []
  },
  {
    "uid": "007549",
    "code": "SPAN5985",
    "subject": "SPAN",
    "number": "5985",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish in the U.S.",
    "fullname": "Sociolinguistic Perspectives on Spanish in the United States",
    "info": "Sociolinguistic analysis of issues such as language maintenance/shift in U.S. Latino communities, code switching, attitudes of Spanish speakers toward varieties of Spanish and English, language change in bilingual communities, and language policy issues.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "007550",
    "code": "SPAN5991",
    "subject": "SPAN",
    "number": "5991",
    "honors": false,
    "writingIntensive": false,
    "name": "Acquisition of Span",
    "fullname": "The Acquisition of Spanish as a First and Second Language",
    "info": "Analysis of issues such as the acquisition of Spanish and English by bilingual children; Spanish in immersion settings; developmental sequences in Spanish; classroom language learners' attitudes, beliefs, and motivation; development of pragmatic competence.prereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "009045",
    "code": "SPAN5993",
    "subject": "SPAN",
    "number": "5993",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Students must submit reading plans for particular topics, figures, periods, or issues. Readings in Spanish and/or Spanish-American subjects. Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including: - the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project. - the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit) - the faculty mentor is qualified to serve in this role - assessment of student learning and grading criteria are clear and appropriate - the student will be working in a respectful, inclusive environmentprereq Grad student or instr consent.",
    "prereq": []
  },
  {
    "uid": "009047",
    "code": "SPAN5994",
    "subject": "SPAN",
    "number": "5994",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed research.  Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including: - the work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project- the project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit) - the faculty mentor is qualified to serve in this role - assessment of student learning and grading criteria are clear and appropriate - the student will be working in a respectful, inclusive environmentprereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "uid": "010014",
    "code": "SPAN8100",
    "subject": "SPAN",
    "number": "8100",
    "honors": false,
    "writingIntensive": false,
    "name": "Sochis Apprch SpLit",
    "fullname": "Research in Sociohistorical Approaches to Spanish Literature",
    "info": "Sociohistorical functions of Spanish literary works and major theories concerning literary production of texts. Testing modern theories in terms of representative fictional discourses from specific historical periods.prereq: 5xxx courses in Span literature and culture",
    "prereq": []
  },
  {
    "uid": "009999",
    "code": "SPAN8200",
    "subject": "SPAN",
    "number": "8200",
    "honors": false,
    "writingIntensive": false,
    "name": "Formal Struc of Lit",
    "fullname": "Spanish Literary Texts: Theories of Formal Structures",
    "info": "Advanced research in methods of literary analysis of discourse. Emphasizes theoretical and practical frameworks within which representative texts are analyzed and interpreted from differing perspectives.prereq: 5xxx courses in Span literature and culture",
    "prereq": []
  },
  {
    "uid": "008084",
    "code": "SPAN8212",
    "subject": "SPAN",
    "number": "8212",
    "honors": false,
    "writingIntensive": false,
    "name": "Renaissance Theater",
    "fullname": "Spanish Theater of the 16th Century: Drama up to Lope",
    "info": "Medieval origins of drama to [La Celestina] (1499-1502), pastoral dialogues, crossover plays of Spanish and Portuguese dramatists, popular theater up to emerging public and private theaters under Italian influence. Rojas, Encina, Vicente, Naharro, Cervantes, and new tragedians.prereq: 5xxx courses in Span literature and culture",
    "prereq": []
  },
  {
    "uid": "007980",
    "code": "SPAN8223",
    "subject": "SPAN",
    "number": "8223",
    "honors": false,
    "writingIntensive": false,
    "name": "Golden Age Poetry",
    "fullname": "The Poetry of the Spanish Golden Age",
    "info": "New Spanish poetic forms, from Garcilaso de Le[ó]n, mystics, and San Juan to Baroque trends by G[ó]ngora, Lope, and Quevedo. Classic traditions and modern adaptations.  Ideological foundations of lyric genres--eclogue, lira, mystics, satire, conceptismo/culteranismo, and sonnet.prereq: 5xxx courses in Span literature and culture",
    "prereq": []
  },
  {
    "uid": "008151",
    "code": "SPAN8252",
    "subject": "SPAN",
    "number": "8252",
    "honors": false,
    "writingIntensive": false,
    "name": "Span Lit: 19th C",
    "fullname": "Spanish Literature: 19th Century",
    "info": "Critical review of 19th-century Spanish literary movements, their relationships, and recent research.  Romanticism, realism/naturalism; development of the novel, poetry, theater.",
    "prereq": []
  },
  {
    "uid": "008086",
    "code": "SPAN8271",
    "subject": "SPAN",
    "number": "8271",
    "honors": false,
    "writingIntensive": false,
    "name": "Modern Span Theater",
    "fullname": "Spanish Theater: 20th Century",
    "info": "Development and evolution of dramatic genres (experimental, absurd, or vanguard) from 1898 crisis to World War I, Civil War, World War II, and Franco era to the present: Galdss, Valle-Inclan, Unamuno, Grau, Lorca, Vallejo, Arrabal, and \"Subterraneans.\"  Emphasizes \"drama in performance\" and diverging ideologies.",
    "prereq": []
  },
  {
    "uid": "007578",
    "code": "SPAN8300",
    "subject": "SPAN",
    "number": "8300",
    "honors": false,
    "writingIntensive": false,
    "name": "SpanLiteraryHistory",
    "fullname": "The Construction of Spanish Literary History",
    "info": "Origins and development of Hispanic literary canon: sociocultural theories of Spanish literary histories as academic and historiographic disciplines. Critiques of modern literary theories through analysis of literary works by major writers.prereq: Two 5xxx courses in Span literature and culture",
    "prereq": []
  },
  {
    "uid": "008091",
    "code": "SPAN8312",
    "subject": "SPAN",
    "number": "8312",
    "honors": false,
    "writingIntensive": false,
    "name": "Libro & Celestina",
    "fullname": "Two Spanish Masterpieces: [Libro de Buen Amor] and [La Celestina]",
    "info": "Cultural reappraisal of the late Middle Ages by reference to two Spanish masterpieces: the Archpriest's [Book of True Love] and Rojas' [La Celestina] (1499-1502). Emphasizes historical function of varied genres, motifs, and sources adapted by the authors.prereq: 5106, 5107 or 5xxx course in Portuguese",
    "prereq": {
      "and": [
        {
          "code": "SPAN 5106",
          "subject": "SPAN",
          "id": "5106"
        },
        {
          "code": "SPAN 5107",
          "subject": "SPAN",
          "id": "5107"
        }
      ]
    }
  },
  {
    "uid": "788279",
    "code": "SPAN8333",
    "subject": "SPAN",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788414",
    "code": "SPAN8444",
    "subject": "SPAN",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "788535",
    "code": "SPAN8666",
    "subject": "SPAN",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "008141",
    "code": "SPAN8710",
    "subject": "SPAN",
    "number": "8710",
    "honors": false,
    "writingIntensive": false,
    "name": "Seminar: Hispanic Linguistics",
    "fullname": "Seminar in Hispanic Linguistics",
    "info": "Critical examination of readings/research on specific topic.prereq: 5711, [Ling 5302 or instr consent]",
    "prereq": {
      "and": [
        {
          "code": "SPAN 5711",
          "subject": "SPAN",
          "id": "5711"
        },
        {
          "code": "LING 5302",
          "subject": "LING",
          "id": "5302"
        }
      ]
    }
  },
  {
    "uid": "007817",
    "code": "SPAN8730",
    "subject": "SPAN",
    "number": "8730",
    "honors": false,
    "writingIntensive": false,
    "name": "Sem:Hispanic Syntax",
    "fullname": "Seminar in Spanish and Portuguese Syntax",
    "info": "Critical examination of readings and research on specific topic.",
    "prereq": []
  },
  {
    "uid": "007824",
    "code": "SPAN8750",
    "subject": "SPAN",
    "number": "8750",
    "honors": false,
    "writingIntensive": false,
    "name": "Hispanic Pragmatics",
    "fullname": "Seminar in Spanish and Portuguese Pragmatics",
    "info": "Critical examination of readings and research in specific topic.",
    "prereq": []
  },
  {
    "uid": "788660",
    "code": "SPAN8777",
    "subject": "SPAN",
    "number": "8777",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "uid": "007555",
    "code": "SPAN8780",
    "subject": "SPAN",
    "number": "8780",
    "honors": false,
    "writingIntensive": false,
    "name": "Sociolinguistics",
    "fullname": "Seminar in Hispanic Sociolinguistics",
    "info": "Current issues.",
    "prereq": []
  },
  {
    "uid": "787936",
    "code": "SPAN8888",
    "subject": "SPAN",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "010040",
    "code": "SPAN8900",
    "subject": "SPAN",
    "number": "8900",
    "honors": false,
    "writingIntensive": false,
    "name": "Spanish Seminar",
    "fullname": "Spanish Seminar",
    "info": "Projects relying heavily on advanced research in Spanish problems. Investigation of assigned fields, analysis of problems, appraisal of principles. Limited to small group of students. For list of sample seminars, consult department and director of graduate studies.prereq: Span 5xxx series required for MA or instr consent",
    "prereq": []
  },
  {
    "uid": "007618",
    "code": "SPAN8940",
    "subject": "SPAN",
    "number": "8940",
    "honors": false,
    "writingIntensive": false,
    "name": "SpanAm Lit/Histor'y",
    "fullname": "Advanced Research in Spanish-American Literary Historiography",
    "info": "Sources and procedures that have given rise to institutionalizations of Spanish-American literary history. Evaluation and review of epistemological principles and assumptions in theory of literary criticism and histories of literature.",
    "prereq": []
  },
  {
    "uid": "008642",
    "code": "SPAN8960",
    "subject": "SPAN",
    "number": "8960",
    "honors": false,
    "writingIntensive": false,
    "name": "HispCultural Issues",
    "fullname": "Workshop: Research in Hispanic Cultural Issues",
    "info": "Individualized support and advice in framing, theorizing, problematizing, and interpreting areas of cultural research. Taught in Spanish, Portuguese, and English.prereq: Reading knowledge of Spanish and Portuguese",
    "prereq": []
  },
  {
    "uid": "010050",
    "code": "SPAN8990",
    "subject": "SPAN",
    "number": "8990",
    "honors": false,
    "writingIntensive": false,
    "name": "Caribbean Genres",
    "fullname": "Advanced Comparative Research of Caribbean Genres",
    "info": "Major literary works and genres of Caribbean literature studied against the background of sociohistorical vicissitudes of the process leading to the formation and consolidation of the national states.prereq: 5525 or instr consent",
    "prereq": {
      "code": "SPAN 5525",
      "subject": "SPAN",
      "id": "5525"
    }
  }
]