[
  {
    "uid": "010145",
    "code": "SPPT3256",
    "subject": "SPPT",
    "number": "3256",
    "honors": false,
    "writingIntensive": false,
    "name": "LatAmer Cult Dis",
    "fullname": "Latin American Cultural Discourse",
    "info": "Cultural assumptions in current modes of interpreting Latin American reality. Representative texts are analyzed.prereq: SPAN 3015",
    "prereq": {
      "code": "SPAN 3015",
      "subject": "SPAN",
      "id": "3015"
    }
  },
  {
    "uid": "809855",
    "code": "SPPT3600",
    "subject": "SPPT",
    "number": "3600",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Span & Port Studies",
    "fullname": "Topics in Spanish and Portuguese Studies (Taught in English)",
    "info": "Latin American, Iberian, or Lusophone topics related to culture, society, art, or linguistics. Taught in English. ",
    "prereq": []
  },
  {
    "uid": "819578",
    "code": "SPPT3601",
    "subject": "SPPT",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "'Race' in Brazil & Latin Amer",
    "fullname": "'Race' in Brazil & Latin America",
    "info": "As cultural, national and racial mixings have become the celebrated norm in our society, it is instructive to reflect upon the radically historical, contingent role that the idea of racial mixings has played in the construction of national imaginaries. The idea that Latin America is a continent of mestizos looms large in the US as elsewhere, but generally without the contextual understanding of how that racial category came to be, and as imaginaries of national mestiçagem/mestizaje were consolidated, developed and questioned in the twentieth century and, finally, transplanted to other geographical and epistemological sites, as is the case with Chicanx in the USA.  Rather than contributing to the invisibility of Brazil by generalizing from Spanish-speaking Latin America, the present course aims to introduce students to racial thinking in Brazil, from the mid-nineteenth century to the present in a comparative frame with racial thinking elsewhere in Latin America, particularly in Mexico.  Aside from understanding how the Spanish “mestizo” construction is not equivalent to that of “mestiço” or “pardo” or “mulato” in Portuguese, nor to contemporary multicultural US-branded notions of racial mixings, the course aims to query how the imaginaries of nationhood that have prevailed in Latin America contribute not only to the social exclusion of black people, even where they are a majority, but also to the systematic racism that is still dominant and difficult to combat. We will go over the social and anthropological concepts, the literary and artistic representations, and the political uses of racial ascriptions with attention to changing historical contexts and locations. The main topics covered are the idea of the mixed-race nation in romanticism; post-emancipation, modern nation-making and whitening; modernism and the ideals of “la raza cósmica” (José Vasconcelos, in Mexico) and racial democracy (Gilberto Freyre, in Brazil); the problem of forging a black consciousness in an officially mixed-race nation; and the appropriation of a modernist, Mexican notion of “mestizaje” to forge a Chicanx identity in the old one-drop rule USA. Classes will be conducted in English, but students have the option to read some of the originals in Portuguese or Spanish; sometimes we will cite the originals in class to have students listen to – and hopefully appreciate – the sounds and nuances of Portuguese and Spanish. Classes will be interactive, with a combination of lecture and discussion; oral presentations, viewing of art, music and film clips and discussion thereof; and group activities. Depending on students’ language abilities, small group discussions in class can be in Spanish, Portuguese or English. All texts are considered a valid object of study and discussion, in whatever language and from whatever disciplinary perspective they are written. I have deliberately mixed literature, anthropology, sociology, art history and so-called mass culture in order to expose students to a variety of disciplinary perspectives. The point is to see how insistent notions of ‘race’ are integrally related to the way that nations are imagined and controlled but also appropriated and potentially questioned. ",
    "prereq": []
  },
  {
    "uid": "008385",
    "code": "SPPT3605",
    "subject": "SPPT",
    "number": "3605",
    "honors": false,
    "writingIntensive": false,
    "name": "Symbolism/Politics",
    "fullname": "Symbolic Expression in Hispanic Politics",
    "info": "Political upheavals, national liberation movements, and civil wars in Spain, Latin America, Portugal, the Portuguese-speaking countries in Africa, and the Hispanic population in the United States, either individually or in various forms of inter-relations.  Political activity and symbolic expression beyond literature. Taught in English.",
    "prereq": []
  },
  {
    "uid": "008393",
    "code": "SPPT3608",
    "subject": "SPPT",
    "number": "3608",
    "honors": false,
    "writingIntensive": false,
    "name": "Politics:HispTheat",
    "fullname": "The Political Foundations of Hispanic Theatre",
    "info": "Study of drama as reality and metaphor using traditional, modern, and vanguard plays.  Works of Cervantes, Lope de Vega, Caldersn, Unamuno, Valle-Inclan, Triana, and Usigli.  Films, videos, attendance of local and touring theatre groups.",
    "prereq": []
  },
  {
    "uid": "008165",
    "code": "SPPT3611",
    "subject": "SPPT",
    "number": "3611",
    "honors": false,
    "writingIntensive": false,
    "name": "Mod LatAmer Writing",
    "fullname": "Modern Latin American and Latino Writing",
    "info": "A comparative approach to literature of the Spanish- and Portuguese-speaking Americas, including Latino writing in the United States.  Emphasis on women's writing.  All readings in English. Does not count toward Spanish or Spanish-Portuguese major.",
    "prereq": []
  },
  {
    "uid": "008650",
    "code": "SPPT5930",
    "subject": "SPPT",
    "number": "5930",
    "honors": false,
    "writingIntensive": false,
    "name": "Hispanic Cultural Discourse",
    "fullname": "Selected Topics in Hispanic and Lusophone Cultural Discourse",
    "info": "Cultural discourses in Spanish- and Portuguese-speaking areas. Historical intersections/divergences. Taught in Spanish or Portuguese, and in English when cross-listed. Topics specified in Class Schedule.prereq: Reading knowledge of Spanish and Portuguese",
    "prereq": []
  },
  {
    "uid": "810591",
    "code": "SPPT5995",
    "subject": "SPPT",
    "number": "5995",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Teaching",
    "fullname": "Directed Teaching",
    "info": "Taken in conjunction with SPPT 5999. Language acquisition theory as applied to foreign language instruction at college level. How current theory translates into practice through hands-on practical application particular to communicative language instruction practiced in Department of Spanish/Portuguese Studies.prereq: Grad student with concurrent enrollment in 5999",
    "prereq": {
      "code": "SPPT 5999",
      "subject": "SPPT",
      "id": "5999"
    }
  },
  {
    "uid": "007559",
    "code": "SPPT5999",
    "subject": "SPPT",
    "number": "5999",
    "honors": false,
    "writingIntensive": false,
    "name": "Teaching Spanish",
    "fullname": "The Teaching of College-Level Spanish: Theory and Practice",
    "info": "Theoretical grounding in the general principles of second language acquisition and guidance with their practical applications to the teaching of first- and second-year Spanish at the college-level.prereq: Grad or instr consent",
    "prereq": []
  },
  {
    "uid": "013966",
    "code": "SPPT8400",
    "subject": "SPPT",
    "number": "8400",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics: Culture",
    "fullname": "Topics in Modern Hispanic and Lusophone Culture",
    "info": "Advanced research in methods of analysis of cultural products, including but not limited to literature.  Emphasizes historical, ideological, and theoretical frameworks within which representative texts/events may be interpreted.prereq: Three 5xxx SPAN or PORT courses",
    "prereq": []
  },
  {
    "uid": "009741",
    "code": "SPPT8920",
    "subject": "SPPT",
    "number": "8920",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Hisp/Luso Lit/Cult/Langs",
    "fullname": "Introduction to Hispanic and Lusophone Literatures, Cultures, and Languages",
    "info": "This two-credit seminar will familiarize beginning doctoral students in the areas of Hispanic/Lusophone literary and cultural studies and Hispanic linguistics. Course must be taken during spring semester of the first year. Topics to be covered include: expected milestones and progress prior to reaching ABD status; methods for writing conference abstracts and presentations; the basics of academic writing in cultural studies and linguistics; how to transform a seminar paper into a publishable piece of scholarship; best practices for determining appropriate conference and publication venues; how to start formulating a dissertation project in the early stages of the graduate career; tactics for requesting funding and completing scholarship/grant applications; collegiality and professionalism in the disciplineprereq: Graduate Student",
    "prereq": []
  },
  {
    "uid": "803080",
    "code": "SPPT8930",
    "subject": "SPPT",
    "number": "8930",
    "honors": false,
    "writingIntensive": false,
    "name": "Dissertation & Prof Workshop",
    "fullname": "Dissertation & Professionalization Workshop",
    "info": "Critical/supportive forum for issues related to dissertation research/writing. Conceptualizing the dissertation. Shaping one's topic. Audience. Uses of language. Feedback. Producing the dissertation prospectus.prereq: Grad student, instr consent",
    "prereq": []
  }
]