[
  {
    "uid": "003716",
    "code": "SW1001",
    "subject": "SW",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Wrld of SW: Global Persp",
    "fullname": "Introduction to the World of Social Work: A Global Perspective",
    "info": "Varied dimensions of social work, locally, nationally, and internationally. Origins/emergence of social work as a profession. Effects of worldwide economic/social oppression. Human behavior and the social environment. Child/adult social welfare theories. Policies, programs. Health and mental health. Care at end of life cycle.",
    "prereq": []
  },
  {
    "uid": "800738",
    "code": "SW1501",
    "subject": "SW",
    "number": "1501",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Peace Studies",
    "fullname": "Introduction to Peace Studies",
    "info": "Interdisciplinary field that considers questions such as how human conflicts can be resolved in ways that promote justice/peace. Definitions, conditions, and causes of violence, nonviolence, war, and peace between nations, groups, or individuals.",
    "prereq": []
  },
  {
    "uid": "798998",
    "code": "SW1905",
    "subject": "SW",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "High School Memories",
    "fullname": "High School: Moments, Memories, Meanings",
    "info": "Graduating high school and beginning college are major life changes. This seminar uses this transition from high school to the university to focus on the worlds of high school and your experiences there, as seen from the perspective of the university--using your memories, using your reflection and using theories of youth development and of high school--as site, as social organization, as world.",
    "prereq": []
  },
  {
    "uid": "817148",
    "code": "SW1907",
    "subject": "SW",
    "number": "1907",
    "honors": false,
    "writingIntensive": false,
    "name": "High School Memories",
    "fullname": "High School: Moments, Memories, Meanings",
    "info": "Graduating high school and beginning college are major life changes. This seminar uses this transition from high school to the university to focus on the worlds of high school and your experiences there, as seen from the perspective of the University--using your memories, using your reflection and using theories of youth development and of high school--as site, as social organization, as world.",
    "prereq": []
  },
  {
    "uid": "808255",
    "code": "SW1910W",
    "subject": "SW",
    "number": "1910",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshmen Seminar",
    "fullname": "Freshmen Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "804930",
    "code": "SW20",
    "subject": "SW",
    "number": "20",
    "honors": false,
    "writingIntensive": false,
    "name": "Community Engagement",
    "fullname": "Community Engagement",
    "info": "Students volunteer in clinic/agency predetermined by the School of Social Work. Registration for course is officially documented on transcript.prereq: MSW student, academic faculty adviser consent",
    "prereq": []
  },
  {
    "uid": "793869",
    "code": "SW248B",
    "subject": "SW",
    "number": "248",
    "honors": false,
    "writingIntensive": false,
    "name": "Conc Hum Grth",
    "fullname": "Conc Hum Grth",
    "info": "",
    "prereq": []
  },
  {
    "uid": "797731",
    "code": "SW2501W",
    "subject": "SW",
    "number": "2501",
    "honors": false,
    "writingIntensive": true,
    "name": "Introduction to Social Justice",
    "fullname": "Introduction to Social Justice",
    "info": "Meanings of social justice. Ways in which social justice advocates work for social change. Criminal justice, globalization, and social welfare. Students do service learning in a social justice organization.",
    "prereq": []
  },
  {
    "uid": "004247",
    "code": "SW3051",
    "subject": "SW",
    "number": "3051",
    "honors": false,
    "writingIntensive": false,
    "name": "Cult Divers and Help Process",
    "fullname": "Cultural Diversity and the Helping Process",
    "info": "Ethno-cultural concepts relevant to service delivery. Cross-ethnic issues, practice considerations in human services, issues that produce barriers to services for diverse racial/cultural client groups.  ",
    "prereq": []
  },
  {
    "uid": "003971",
    "code": "SW3101",
    "subject": "SW",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Comm & Soc Policy",
    "fullname": "Interventions in Community and Social Policy",
    "info": "Applying social work skills and values to community organization, social action, and social problems using an ecological framework.",
    "prereq": []
  },
  {
    "uid": "003969",
    "code": "SW3203",
    "subject": "SW",
    "number": "3203",
    "honors": false,
    "writingIntensive": false,
    "name": "Interv Indiv Grps",
    "fullname": "Interventions with Individuals and Groups",
    "info": "Using an ecological framework, apply social work skills and values to work with individuals and small groups ",
    "prereq": []
  },
  {
    "uid": "797732",
    "code": "SW3301",
    "subject": "SW",
    "number": "3301",
    "honors": false,
    "writingIntensive": false,
    "name": "GLBT SocMov",
    "fullname": "GLBT Social Movements",
    "info": "Development of gay, lesbian, bisexual, and transgender (GLBT) social movement historically. Current state of GLBT movement. Readings draw on social movement theory, and GLBT Studies. Interdisciplinary course with classroom and community service learning.",
    "prereq": []
  },
  {
    "uid": "797846",
    "code": "SW3501",
    "subject": "SW",
    "number": "3501",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Change Organizing",
    "fullname": "Theories and Practices of Social Change Organizing",
    "info": "Concepts, theories, and practices of social change organizing. U.S. power relations. How people organize. Cross-class, multi-racial, and multi-issue organizing. Students do service learning in social justice organization.",
    "prereq": []
  },
  {
    "uid": "818604",
    "code": "SW3601",
    "subject": "SW",
    "number": "3601",
    "honors": false,
    "writingIntensive": false,
    "name": "Solidarity in South Africa",
    "fullname": "Solidarity & Community-led Transformation in South Africa",
    "info": "Though the magnificence of South Africa's people and landscapes is vast, it is often said that visitors ignore the view by overlooking the juxtaposition between acute poverty in the townships and immensely affluent neighborhoods (built for-and-by the white minority during Apartheid). Mindful visitors often put into question the free market and recognize that Apartheid's history of racism and classism still exists in all fabrics of life; and, many westerners try to assist through service or volunteerism without fostering real change. In Africa, service is a billion-dollar industry. Abuse by western volunteer organizations and other programs has included half-finished work, time and resources drained from communities, and unchanged volunteers. But, do we do nothing?\n\nIn this course, we will explore the dynamics of power, privilege, and repression through social justice advocacy and scholarly analysis of the oppressive savior complex.",
    "prereq": []
  },
  {
    "uid": "790539",
    "code": "SW3701",
    "subject": "SW",
    "number": "3701",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Chld Maltr: Inter & Prev",
    "fullname": "Introduction to Child Maltreatment: Intervention and Prevention",
    "info": "Child abuse/neglect as form of family violence. Prevalence, scope, dynamics, responses, and prevention strategies. Individual, familial, and community analyses using ecological perspective and risk/resilience framework.",
    "prereq": []
  },
  {
    "uid": "788370",
    "code": "SW3702",
    "subject": "SW",
    "number": "3702",
    "honors": false,
    "writingIntensive": false,
    "name": "Adult IPV: Int & Prev",
    "fullname": "Introduction to Adult Intimate Partner Violence: Intervention and Prevention",
    "info": "Theories, research, intervention, and prevention strategies regarding violence against women and the abuse of vulnerable adults in the United States. Issues of gender, race, culture, age, physical ability, SES, and sexual orientation. Includes service learning.",
    "prereq": []
  },
  {
    "uid": "007720",
    "code": "SW3703",
    "subject": "SW",
    "number": "3703",
    "honors": false,
    "writingIntensive": false,
    "name": "Gender Viol Global Persp",
    "fullname": "Gender Violence in Global Perspective",
    "info": "Theories/research on violence in intimate domestic relationships examined through multiple lenses. Overview of interventions in Minnesota, United States, and other societies.",
    "prereq": []
  },
  {
    "uid": "793957",
    "code": "SW3810",
    "subject": "SW",
    "number": "3810",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "791306",
    "code": "SW4001",
    "subject": "SW",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Basic Couns & Interv Skills",
    "fullname": "Basic Counseling and Interviewing Skills in the Social Work Helping Process",
    "info": "Development/maintenance of a social worker-client helping relationship. Professional values and ethics. Interviewing skills of active listening, empathy, and authenticity. Identifying purpose, roles, and responsibilities through asking questions, reflecting, and clarifying.",
    "prereq": []
  },
  {
    "uid": "791307",
    "code": "SW4002",
    "subject": "SW",
    "number": "4002",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Couns & Interv Skills",
    "fullname": "Advanced Counseling and Interviewing Skills in the Social Work Helping Process",
    "info": "Builds on 4001. Focuses on assessment and on developing reasonable, measurable, and attainable goals. Working with involuntary clients, goal attainment strategies, evaluating progress, and ending.",
    "prereq": []
  },
  {
    "uid": "797902",
    "code": "SW4501",
    "subject": "SW",
    "number": "4501",
    "honors": false,
    "writingIntensive": false,
    "name": "SrSemSocJustice",
    "fullname": "Senior Seminar in Social Justice",
    "info": "Capstone course. Students complete a social justice portfolio, do service learning in a social justice organization.prereq: 2501, 3501",
    "prereq": {
      "and": [
        {
          "code": "SW 2501",
          "subject": "SW",
          "id": "2501"
        },
        {
          "code": "SW 3501",
          "subject": "SW",
          "id": "3501"
        }
      ]
    }
  },
  {
    "uid": "003552",
    "code": "SW4693",
    "subject": "SW",
    "number": "4693",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study related to social issues, social work methods, or social work history.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "003553",
    "code": "SW4694",
    "subject": "SW",
    "number": "4694",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Guided research related to social issues, social work methods, or social work history.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "003592",
    "code": "SW5051",
    "subject": "SW",
    "number": "5051",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Bhvr and Social Environ",
    "fullname": "Human Behavior and the Social Environment",
    "info": "Social, psychological, biological, and cultural factors of individual and group development as applied to social work practice. Behavior and life-cycle development focusing on diversity and each stage of life. Discuss development in terms of the individual, and in terms of overlapping social systems such as the multi-generational family, culture, community, and society.",
    "prereq": []
  },
  {
    "uid": "003973",
    "code": "SW5052",
    "subject": "SW",
    "number": "5052",
    "honors": false,
    "writingIntensive": false,
    "name": "Ecol Child Develop",
    "fullname": "Ecologies of Child Development Within Communities of Color",
    "info": "Examine social, affective, and cognitive development of children of color via a life course, ecological systems framework. Family, school, peers, and community are studied as ecological contexts which influence developmental trajectories for these children and youth. Attention is given to poverty, racism, and oppression.",
    "prereq": []
  },
  {
    "uid": "003598",
    "code": "SW5101",
    "subject": "SW",
    "number": "5101",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist and Pol Soc Welf",
    "fullname": "Historical Origins and Contemporary Policies in Social Welfare",
    "info": "Contemporary policies and programs in social welfare are examined in light of their historical origins and evolution. A framework is then developed for analysis of concepts and principles in contemporary social policy for social welfare programs and services. The emergence of the profession of social work also examined.",
    "prereq": []
  },
  {
    "uid": "010874",
    "code": "SW5105",
    "subject": "SW",
    "number": "5105",
    "honors": false,
    "writingIntensive": false,
    "name": "Women  & Publ Pol",
    "fullname": "Women and Public Policy",
    "info": "Study of feminist organizations; issues and conflicts within organizations and movements; methods and sources for studying feminism.",
    "prereq": []
  },
  {
    "uid": "011079",
    "code": "SW5107",
    "subject": "SW",
    "number": "5107",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Welfare Policy",
    "fullname": "Child Welfare Policy",
    "info": "Examine the intersection of conceptual orientations of developmental psychology with policies that affect children and families. Demographic, historic, and social trends underlying the assumptions that drive policies directed at women and children; projections of future policies.",
    "prereq": []
  },
  {
    "uid": "009521",
    "code": "SW5309",
    "subject": "SW",
    "number": "5309",
    "honors": false,
    "writingIntensive": false,
    "name": "Case Mngt Spec Pop",
    "fullname": "Case Management with Special Populations",
    "info": "Examine concepts and principles of case management practice with special populations such as older adults, persons with developmental disabilities, and persons with serious and persistent mental illness. The core functions of case management practice in a range of settings are addressed in relationship to issues of diversity, vulnerability, and empowerment.",
    "prereq": []
  },
  {
    "uid": "803508",
    "code": "SW5312",
    "subject": "SW",
    "number": "5312",
    "honors": false,
    "writingIntensive": false,
    "name": "Children w/Sex Behavior Issues",
    "fullname": "Children With Sexual Behavior Issues",
    "info": "Assessments/interventions with children/families. Age-appropriate sexual experimentation/inquisitiveness, socially inappropriate sexual behaviors. Molestation of other children. Coercion of other children into sexual activity. Interventions.",
    "prereq": []
  },
  {
    "uid": "010845",
    "code": "SW5313",
    "subject": "SW",
    "number": "5313",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Older Adults",
    "fullname": "Social Work with Older Adults",
    "info": "The practice components of social work with older adults including assessment, intervention, and case management. Taught from the perspective of bio-psycho-social strengths and challenges and within the context of current social policy and delivery systems.prereq: Grad or non-degree seeking student or instr consent",
    "prereq": []
  },
  {
    "uid": "010862",
    "code": "SW5315",
    "subject": "SW",
    "number": "5315",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Prac Interdis Teams",
    "fullname": "Social Work Practice in Interdisciplinary Teams",
    "info": "Preparation for work in interdisciplinary teams with students in medicine, nursing, pharmacy, public health, health administration, dentistry, education, social work, and psychology. Group dynamics, use of self, integrated team planning, evaluating team effectiveness. ",
    "prereq": []
  },
  {
    "uid": "010848",
    "code": "SW5316",
    "subject": "SW",
    "number": "5316",
    "honors": false,
    "writingIntensive": false,
    "name": "Brief Treatment &Task Approach",
    "fullname": "Brief Treatment and the Task-Centered Approach",
    "info": "Advent/prominence of brief-treatment models in work with individuals, families, and groups. Theoretical/empirical bases. Practice with diverse populations in managed care. Skill training, supervised practice.prereq: Grad student or non-degree seeking student or instr consent",
    "prereq": []
  },
  {
    "uid": "010863",
    "code": "SW5318",
    "subject": "SW",
    "number": "5318",
    "honors": false,
    "writingIntensive": false,
    "name": "Fam Cntr Home Based",
    "fullname": "Family Centered Home Based Services",
    "info": "Ecological, multisystems approach focusing on the family system. Triadic theory, meta-neutrality, strengths-focus, case management and team treatment. Family-based services evaluated for high-risk, multi-problem families and as an alternative to foster placement.prereq: Credit will not be granted if credit has been received for: : 8314; grad or non-degree seeking student or instr consent",
    "prereq": {
      "code": "SW 8314",
      "subject": "SW",
      "id": "8314"
    }
  },
  {
    "uid": "010864",
    "code": "SW5319",
    "subject": "SW",
    "number": "5319",
    "honors": false,
    "writingIntensive": false,
    "name": "Adol: Norms, Cltr,",
    "fullname": "Adolescents: Norms, Culture, and Health",
    "info": "Relationships among familial, social, societal, political, economic, environmental, psychosocial, and cultural determinants of adolescent behavior that affect health; major public health issues and problems of adolescents.",
    "prereq": []
  },
  {
    "uid": "010083",
    "code": "SW5481",
    "subject": "SW",
    "number": "5481",
    "honors": false,
    "writingIntensive": false,
    "name": "CAP1: Res & Theory",
    "fullname": "Child Abuse Prevention I: Research and Theory",
    "info": "Foundation of research/theory for level I child abuse prevention studies certificate.",
    "prereq": []
  },
  {
    "uid": "010084",
    "code": "SW5482",
    "subject": "SW",
    "number": "5482",
    "honors": false,
    "writingIntensive": false,
    "name": "CAP2: Prog Dev Eval",
    "fullname": "Child Abuse Prevention II: Program Development, Evaluation, and Advocacy",
    "info": "Design and evaluation of policies and programs of interventions to prevent child abuse. This is the second course in the Level I Child Abuse Certificate program.",
    "prereq": []
  },
  {
    "uid": "010082",
    "code": "SW5483",
    "subject": "SW",
    "number": "5483",
    "honors": false,
    "writingIntensive": false,
    "name": "CAP3: Skill Build I",
    "fullname": "Child Abuse Prevention III: Skill Building I-- Cultural and Legal Issues",
    "info": "Risk factors, protective factors, resilience in cultural settings. Identifying/designing strategies appropriate to cultural characteristics. First course for level II child abuse prevention certification.",
    "prereq": []
  },
  {
    "uid": "010080",
    "code": "SW5484",
    "subject": "SW",
    "number": "5484",
    "honors": false,
    "writingIntensive": false,
    "name": "CAP4: Skill Build II",
    "fullname": "Child Abuse Prevention IV: Skill Building II--Risk Assessment and Interviewing",
    "info": "Designing instruments for child abuse risk assessment. Culturally/ethnically competent interviewing. Ethnographic interviewing. Strengths-based ecosystemic assessment. Strategies for evaluating interventions. Second course for level II child abuse prevention certification.",
    "prereq": []
  },
  {
    "uid": "803505",
    "code": "SW5512",
    "subject": "SW",
    "number": "5512",
    "honors": false,
    "writingIntensive": false,
    "name": "Agency Budget Management",
    "fullname": "Developing and Managing an Agency Budget",
    "info": "Preparing/monitoring agency budgets, interpreting/utilizing financial reports. Information systems. Fiduciary responsibilities geared to ethics, organizational mission, and positive client outcomes.prereq: MSW student or instr consent",
    "prereq": []
  },
  {
    "uid": "803506",
    "code": "SW5513",
    "subject": "SW",
    "number": "5513",
    "honors": false,
    "writingIntensive": false,
    "name": "Grant Writing/Fund Raising",
    "fullname": "Grant Writing and Fund-raising",
    "info": "Procuring/managing financial resources ethically in human services settings. Designing a strategic fund-raising plan.  Researching sources of support, developing relationships with grant makers, preparing/submitting grant requests.  ",
    "prereq": []
  },
  {
    "uid": "803507",
    "code": "SW5514",
    "subject": "SW",
    "number": "5514",
    "honors": false,
    "writingIntensive": false,
    "name": "Strategic Risk Management",
    "fullname": "Strategic Risk Management in Agencies",
    "info": "Strategies to minimize risk to agency, its assets, and its resources. Relationship between mission, risk management, and board role. Agency internal systems, controls, and prevention strategies. Liability/insurance. Agency exposure to risk, including volunteer program management.prereq: MSW student or instr consent",
    "prereq": []
  },
  {
    "uid": "010877",
    "code": "SW5525",
    "subject": "SW",
    "number": "5525",
    "honors": false,
    "writingIntensive": false,
    "name": "Glob Pers Soc Welf",
    "fullname": "Global Perspectives on Social Welfare, Peace, and Justice",
    "info": "Role of international social welfare in meeting basic human needs and promoting human rights, social justice, and peace. Theories, models, and social policies in different economic and political systems with emphasis on Third World nations.",
    "prereq": []
  },
  {
    "uid": "808483",
    "code": "SW5562",
    "subject": "SW",
    "number": "5562",
    "honors": false,
    "writingIntensive": false,
    "name": "Global SW and Soc Develop",
    "fullname": "Global Social Work and Social Development",
    "info": "Theories/strategies of social work and social development in industrial/developing countries. Applying international perspective and comparative framework to analyze basic human needs, social problems, and social work and social development strategies in different countries.",
    "prereq": []
  },
  {
    "uid": "010851",
    "code": "SW5706",
    "subject": "SW",
    "number": "5706",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Sexual Abus",
    "fullname": "Issues and Interventions in Child Sexual Abuse",
    "info": "Major issues/interventions in child sexual abuse. Working with sexually abused children and their families. Perceptions of victims, non-offending parents, perpetrators, and other family members. Interviewing. Justice system. Child protection.",
    "prereq": []
  },
  {
    "uid": "010850",
    "code": "SW5707",
    "subject": "SW",
    "number": "5707",
    "honors": false,
    "writingIntensive": false,
    "name": "Battered Women Fam",
    "fullname": "Interventions with Battered Women and Their Families",
    "info": "Current theories, research, and evaluation of interventions with battered women and their families. Focus on practice, e.g., direct work with social institutions, victim-survivors, and assailants and their families.",
    "prereq": []
  },
  {
    "uid": "807971",
    "code": "SW5801",
    "subject": "SW",
    "number": "5801",
    "honors": false,
    "writingIntensive": false,
    "name": "PolProgAmerSocWelf",
    "fullname": "Policies and Programs in American Social Welfare",
    "info": "Major policies and programs of social welfare, distinguishing between programs of social insurance and public assistance. Develops skills for analyzing social problems/policies that respond to those problems. Concepts for defining and measuring poverty and social disparity.",
    "prereq": []
  },
  {
    "uid": "807972",
    "code": "SW5802",
    "subject": "SW",
    "number": "5802",
    "honors": false,
    "writingIntensive": false,
    "name": "Soc Welf Hist",
    "fullname": "Social Welfare History",
    "info": "Policies/programs in social welfare. Historical evolution, along with themes that have shaped development over time. Contributions of population subgroups to the development of the welfare state, and the impact of policies and programs on such groups. History of social work profession.",
    "prereq": []
  },
  {
    "uid": "009804",
    "code": "SW5810",
    "subject": "SW",
    "number": "5810",
    "honors": false,
    "writingIntensive": false,
    "name": "Special Topics",
    "fullname": "Seminar: Special Topics",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "uid": "010866",
    "code": "SW5812",
    "subject": "SW",
    "number": "5812",
    "honors": false,
    "writingIntensive": false,
    "name": "Legal Aspects of SW",
    "fullname": "Legal Aspects of Social Work",
    "info": "Legal regulation of social work; licensing standards; professional liability; ethical issues and sanctions. Social worker involvement in legal processes of preparing for court; testimony and cross examination. Substantive law affecting social work practice in selected areas such as child protection, mental health, family law, and domestic violence.",
    "prereq": []
  },
  {
    "uid": "010835",
    "code": "SW5813",
    "subject": "SW",
    "number": "5813",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Welfare & Law",
    "fullname": "Child Welfare and the Law",
    "info": "Social work practice in juvenile court. Child abuse/neglect reporting laws, risk assessment, reasonable efforts, case plan, custody proceedings, permanency planning, termination of parental rights, child testimony, social worker testimony, adoption laws.prereq: 2nd yr MSW or advanced standing or instr consent",
    "prereq": []
  },
  {
    "uid": "003977",
    "code": "SW5903",
    "subject": "SW",
    "number": "5903",
    "honors": false,
    "writingIntensive": false,
    "name": "Substance Use and SW",
    "fullname": "Substance Use and Social Work",
    "info": "Students gain skills in eliminating the detrimental impact of substance use disorders at multiple levels (families, groups, organizations, and communities) through an ability to identify, assess, intervene, and evaluate those struggling with substance use and dependency throughout the life span.",
    "prereq": []
  },
  {
    "uid": "010876",
    "code": "SW5904",
    "subject": "SW",
    "number": "5904",
    "honors": false,
    "writingIntensive": false,
    "name": "Facilitation and Conflict Mgmt",
    "fullname": "Facilitation and Conflict Management: Humanistic Approach",
    "info": "Humanistic approach to facilitating meetings in small human service organizations and units within large bureaucratic structures. Managing conflict among individuals, groups, and communities in multiple settings.",
    "prereq": []
  },
  {
    "uid": "808056",
    "code": "SW5905",
    "subject": "SW",
    "number": "5905",
    "honors": false,
    "writingIntensive": false,
    "name": "Permanency in Child Welfare",
    "fullname": "Permanency in Child Welfare",
    "info": "Depth/breadth in knowledge/skill acquisition in achieving permanency for children receiving services within public, tribal, and private child welfare systems. Out-of-home/permanency placements, specific permanency interventions, and child/family responses to different permanency options.",
    "prereq": []
  },
  {
    "uid": "010865",
    "code": "SW5906",
    "subject": "SW",
    "number": "5906",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Ethical Decision Making",
    "fullname": "Advanced Ethical Decision Making",
    "info": "Identify ethical issues, resolve ethical dilemmas, make ethical decisions when confronted with conflicting duties/choices that occur within the context of professional social work at all levels of practice.",
    "prereq": []
  },
  {
    "uid": "010847",
    "code": "SW5907",
    "subject": "SW",
    "number": "5907",
    "honors": false,
    "writingIntensive": false,
    "name": "School Social Work",
    "fullname": "School Social Work",
    "info": "Apply social work knowledge/skills in school settings through prevention, assessment, intervention, and evaluation from an ecological multilevel approach focused on students, families, and the school community.",
    "prereq": []
  },
  {
    "uid": "808057",
    "code": "SW5908",
    "subject": "SW",
    "number": "5908",
    "honors": false,
    "writingIntensive": false,
    "name": "Tech and Comm in SW",
    "fullname": "Technology and Communication in Social Work",
    "info": "This course explores the influence of technology in social work practice/society. Appropriate community or direct interventions using new technologies. Introduction to effective communication and public relations.",
    "prereq": []
  },
  {
    "uid": "010849",
    "code": "SW5909",
    "subject": "SW",
    "number": "5909",
    "honors": false,
    "writingIntensive": false,
    "name": "SW with Involuntary Clients",
    "fullname": "Social Work With Involuntary Clients",
    "info": "Includes theory, ethics, effectiveness, and intervention methods for work with client systems that experience involuntary contact with a social worker. Interventions at micro, mezzo, and macro levels are included. Practice in varied settings such as child welfare, mental health, corrections, and public schools as well as practice related to organizational responses to change.",
    "prereq": []
  },
  {
    "uid": "810032",
    "code": "SW5912",
    "subject": "SW",
    "number": "5912",
    "honors": false,
    "writingIntensive": false,
    "name": "Grief and Loss",
    "fullname": "Grief and Loss in Social Work Practice",
    "info": "Review current concepts of grief/loss. Historical/modern views, symptoms of grief, implications of diverse losses, including expected, sudden, or traumatic losses, ambiguous grief.",
    "prereq": []
  },
  {
    "uid": "808484",
    "code": "SW5913",
    "subject": "SW",
    "number": "5913",
    "honors": false,
    "writingIntensive": false,
    "name": "Wrkg Immigrant Populations",
    "fullname": "Working with Immigrant Populations",
    "info": "Trends in immigration to US and public policy responses. Acculturationprocesses, issues, problems. Common social service needs of immigrants/refugees. Skills for engagement/interventions with immigrants and refugees across main fields of social work.",
    "prereq": []
  },
  {
    "uid": "009807",
    "code": "SW5991",
    "subject": "SW",
    "number": "5991",
    "honors": false,
    "writingIntensive": false,
    "name": "Independent Study in SW",
    "fullname": "Independent Study in Social Work",
    "info": "Independent study in areas of special interest to students and faculty. This course is open to graduate students in the School of Social Work with an approved independent study proposal. MSW students may apply a maximum of 4 credits of SW 5991 to their program of study.",
    "prereq": []
  },
  {
    "uid": "003605",
    "code": "SW8010",
    "subject": "SW",
    "number": "8010",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Practicum I",
    "fullname": "Seminar: Field Practicum I",
    "info": "Integrates classroom learning with direct experience of a social work field internship. Professional support/learning groups focus on student-and facilitator-identified issues. Students discuss professional/personal biases, ethical dilemmas, and supervisory issues. Cross-cultural understanding, implications of cross-cultural practice.",
    "prereq": []
  },
  {
    "uid": "003617",
    "code": "SW8020",
    "subject": "SW",
    "number": "8020",
    "honors": false,
    "writingIntensive": false,
    "name": "Field Practicum II",
    "fullname": "Field Practicum II",
    "info": "Integrates classroom learning within a concentration with the direct experience of an internship. Students expand competency in cross-cultural practice.",
    "prereq": []
  },
  {
    "uid": "003619",
    "code": "SW8030",
    "subject": "SW",
    "number": "8030",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Stand Practicum",
    "fullname": "Advanced Standing Social Work Practicum",
    "info": "Integrates classroom learning with direct experience of a social work field internship. Professional support/learning groups discuss issues raised in field placement. Groups focus on professional/personal biases, ethical dilemmas, supervisory issues, cross-cultural sharing, and implications of students' privilege/power in relation to client systems.",
    "prereq": []
  },
  {
    "uid": "791907",
    "code": "SW8041",
    "subject": "SW",
    "number": "8041",
    "honors": false,
    "writingIntensive": false,
    "name": "Specialized Field Placement",
    "fullname": "Specialized Field Placement",
    "info": "Field placement added to required foundation/concentration field placements (or to concentration placement for advanced standing students).prereq: [8020 or 8030], instr consent",
    "prereq": {
      "or": [
        {
          "code": "SW 8020",
          "subject": "SW",
          "id": "8020"
        },
        {
          "code": "SW 8030",
          "subject": "SW",
          "id": "8030"
        }
      ]
    }
  },
  {
    "uid": "003972",
    "code": "SW8051",
    "subject": "SW",
    "number": "8051",
    "honors": false,
    "writingIntensive": false,
    "name": "Psychopath SW Prac",
    "fullname": "Psychopathology and Social Work Practice",
    "info": "Psychopathology from ecosystemic perspective. Biopsychosocial influences on incidence, course, treatment of common mental disorders diagnosed from infancy through adulthood. Differential effects on populations at risk. Diagnostic skills, alternative intervention strategies, social work roles.prereq: All foundation courses for full program or advanced standing or instr consent",
    "prereq": []
  },
  {
    "uid": "804673",
    "code": "SW8052",
    "subject": "SW",
    "number": "8052",
    "honors": false,
    "writingIntensive": false,
    "name": "Resilience & Risk",
    "fullname": "Resilience and Risk",
    "info": "Applying theories of human development to issues confronting children, families, and social workers. Identifying strengths-based resources within ecologies of families. Mobilizing resources to empower clients to cope with, adapt to, and overcome adversities.prereq: [Foundation coursework, adv standing] or instr consent",
    "prereq": []
  },
  {
    "uid": "790822",
    "code": "SW8105",
    "subject": "SW",
    "number": "8105",
    "honors": false,
    "writingIntensive": false,
    "name": "Econ Sec Disad Popula",
    "fullname": "Economic Security of Disadvantaged Populations",
    "info": "Impact of social policy and macro economic trends on economic security of disadvantaged populations. Focuses on antipoverty/welfare programs in the United States, although international perspective is used as well.prereq: [8211, advanced standing] or instr consent",
    "prereq": {
      "code": "SW 8211",
      "subject": "SW",
      "id": "8211"
    }
  },
  {
    "uid": "009641",
    "code": "SW8150",
    "subject": "SW",
    "number": "8150",
    "honors": false,
    "writingIntensive": false,
    "name": "Spec Topics Soc Pol",
    "fullname": "Special Topics in Social Policy",
    "info": "",
    "prereq": []
  },
  {
    "uid": "007238",
    "code": "SW8151",
    "subject": "SW",
    "number": "8151",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Meth: Pract Indiv/Systems",
    "fullname": "Social Work Methods: Practice With Individuals and Systems",
    "info": "Develops foundation knowledge and skills for social workers to work with individuals and systems.",
    "prereq": []
  },
  {
    "uid": "007239",
    "code": "SW8152",
    "subject": "SW",
    "number": "8152",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Pract Meth: Fam & Grps",
    "fullname": "Social Work Practice Methods: Families and Groups",
    "info": "Develop foundational knowledge and skills in relationship building, engagement, interviewing, and assessment with families and groups using the ecological-systems theoretical framework and resiliency-based approach.prereq: MSW student or instr consent",
    "prereq": []
  },
  {
    "uid": "807997",
    "code": "SW8153",
    "subject": "SW",
    "number": "8153",
    "honors": false,
    "writingIntensive": false,
    "name": "Prac Methods:Macro Prac & Orgs",
    "fullname": "Social Work Practice Methods: Macro Practice and Organizations",
    "info": "Models of community intervention, community practice and macro-level interventions as integral to professional social work. Building upon theoretical approaches to human service organizations and their distinct attributes, the course addresses key practice knowledge, skills, and values that promote, develop, and maintain human service organizations that effectively meet community and client needs.",
    "prereq": []
  },
  {
    "uid": "807996",
    "code": "SW8154",
    "subject": "SW",
    "number": "8154",
    "honors": false,
    "writingIntensive": false,
    "name": "Org & Pol Adv",
    "fullname": "Organizations and Policy Advocacy",
    "info": "Community practice as it relates to human service agencies and organizations. Builds upon theoretical approaches to human service organizations/agencies and theirdistinct attributes. Key practice knowledge, skills, and values that promote, develop, and maintain human service organizations that effectively meet community/client needs.prereq: MSW student or instr consent",
    "prereq": []
  },
  {
    "uid": "003589",
    "code": "SW8211",
    "subject": "SW",
    "number": "8211",
    "honors": false,
    "writingIntensive": false,
    "name": "Macro SW Pract & Pol Advocacy",
    "fullname": "Macro Social Work Practice and Policy Advocacy",
    "info": "Policy analysis, development, implementation, community development, social action, social planning. Ecological, problem-solving, empowerment perspectives, policy/methods. Theories of organizational/community development/change.prereq: 5101 or instr consent",
    "prereq": {
      "code": "SW 5101",
      "subject": "SW",
      "id": "5101"
    }
  },
  {
    "uid": "807760",
    "code": "SW8251",
    "subject": "SW",
    "number": "8251",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Practice in HDA",
    "fullname": "Social Work Practice in Health, Disabilities, and Aging",
    "info": "Social work practice in health/disabilities/aging. History in social work, practice contexts/settings, service delivery systems. Practice/population overlaps, distinctions, co-operations.",
    "prereq": []
  },
  {
    "uid": "807772",
    "code": "SW8252",
    "subject": "SW",
    "number": "8252",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Interven & Issues in HDA",
    "fullname": "Advanced Interventions and Issues in Health, Disabilities, and Aging",
    "info": "Advanced assessment/intervention. Critical issues/current developments related to health, disabilities, aging. Individual, family, organizational, community social work.",
    "prereq": []
  },
  {
    "uid": "808758",
    "code": "SW8261",
    "subject": "SW",
    "number": "8261",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvSWPractHlthCare",
    "fullname": "Advanced Social Work Practice in Health Care",
    "info": "Advanced social work practice in health care. Theoretical models/evidence-based interventions. Psychosocial assessment, treatment interventions, interdisciplinary teamwork, ethics, leadership",
    "prereq": []
  },
  {
    "uid": "807773",
    "code": "SW8262",
    "subject": "SW",
    "number": "8262",
    "honors": false,
    "writingIntensive": false,
    "name": "Empower Practice-Disabilities",
    "fullname": "Empowerment Practice With Persons With Disabilities",
    "info": "Models of disability, types of disability, common social work practices. Knowledge/skills for use across lifespan/ cultures/various settings.",
    "prereq": []
  },
  {
    "uid": "808058",
    "code": "SW8263",
    "subject": "SW",
    "number": "8263",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Working with Older Adults",
    "fullname": "Essential Skills and Perspectives for Working with Older Adults",
    "info": "Intervention skills that are tailored for older adults in individual, family, group, residential, and community settings. Focus on bio-psycho-social-cultural-spiritual perspectives and evidence-based approaches.",
    "prereq": []
  },
  {
    "uid": "794224",
    "code": "SW8312",
    "subject": "SW",
    "number": "8312",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv SW Pract Grps",
    "fullname": "Advanced Social Work Practice With Groups",
    "info": "Advanced clinical social work practice with groups. How to differentiate among available models of group work and select an appropriate model based on needs of client population and on context in which they are served.prereq: [8201, 8202, adv standing] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "SW 8201",
          "subject": "SW",
          "id": "8201"
        },
        {
          "code": "SW 8202",
          "subject": "SW",
          "id": "8202"
        }
      ]
    }
  },
  {
    "uid": "009645",
    "code": "SW8313",
    "subject": "SW",
    "number": "8313",
    "honors": false,
    "writingIntensive": false,
    "name": "Prof Prac Interdiscip Tms",
    "fullname": "Professional Practice in Interdisciplinary Teams and Collaboratives",
    "info": "Principles of interdisciplinary/interorganizational collaboration in human services, health, and educational settings. Team building, decision-making models, engaging  value differences, managing conflict on team, role/status disparities, relational communications. Emerging approaches to interorganizational collaboration.prereq: [Foundation curriculum, [advanced standing or grad student in health and human service or in educational professional program]] or instr consent",
    "prereq": []
  },
  {
    "uid": "804285",
    "code": "SW8315",
    "subject": "SW",
    "number": "8315",
    "honors": false,
    "writingIntensive": false,
    "name": "Mood Disorders",
    "fullname": "Mood Disorders: New Directions in Clinical Care",
    "info": "Depression. Current research from biochemical, genetic, familial, and sociocultural perspectives. Gender, racial, ethnic, class, and sexual preference issues concerning prevalence, assessment and treatment.prereq: [Foundation coursework, advanced standing] or instr consent",
    "prereq": []
  },
  {
    "uid": "788283",
    "code": "SW8333",
    "subject": "SW",
    "number": "8333",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)prereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "807828",
    "code": "SW8351",
    "subject": "SW",
    "number": "8351",
    "honors": false,
    "writingIntensive": false,
    "name": "Assess & Engage: Fam & Child",
    "fullname": "Assessment and Engagement with Families and Children",
    "info": "Utilizing evidence-informed, culturally respectful assessments/engagement models with families/children. Factors internal/external to families. Work with families/children around broad scope of stressors. Resiliency.",
    "prereq": []
  },
  {
    "uid": "807863",
    "code": "SW8352",
    "subject": "SW",
    "number": "8352",
    "honors": false,
    "writingIntensive": false,
    "name": "Intervention Methods: Families",
    "fullname": "Intervention Methods with Families",
    "info": "Work with families/children in family-centered, community, preventive practice. Engagement, assessment, intervention, evaluation.",
    "prereq": []
  },
  {
    "uid": "009652",
    "code": "SW8361",
    "subject": "SW",
    "number": "8361",
    "honors": false,
    "writingIntensive": false,
    "name": "Identifi & Assess Fam Viol",
    "fullname": "Identification and Assessment of Family Violence",
    "info": "Identification/assessment of family violence. Contextual knowledge of behaviors of perpetrators, victims, survivors. Gender, race, culture, age, ability, SES, sexual orientation.",
    "prereq": []
  },
  {
    "uid": "009643",
    "code": "SW8362",
    "subject": "SW",
    "number": "8362",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Intervent Fams",
    "fullname": "Social Work Interventions With Families",
    "info": "Theory/models of social work intervention with families. Theoretical constructs of traditional/emerging models of social work practice with families. Develop assessment/ intervention skills.prereq: [8451 or concurrent registration is required (or allowed) in 8451], [8351 or concurrent registration is required (or allowed) in 8351], [5051, 5801, 8151, 8152, 8153, 8841] or MSW Adv Standing or instr consent",
    "prereq": {
      "and": [
        {
          "code": "SW 8451",
          "subject": "SW",
          "id": "8451"
        },
        {
          "code": "SW 8351",
          "subject": "SW",
          "id": "8351"
        },
        {
          "and": [
            {
              "code": "SW 5051",
              "subject": "SW",
              "id": "5051"
            },
            {
              "code": "SW 5801",
              "subject": "SW",
              "id": "5801"
            },
            {
              "code": "SW 8151",
              "subject": "SW",
              "id": "8151"
            },
            {
              "code": "SW 8152",
              "subject": "SW",
              "id": "8152"
            },
            {
              "code": "SW 8153",
              "subject": "SW",
              "id": "8153"
            },
            {
              "code": "SW 8841",
              "subject": "SW",
              "id": "8841"
            }
          ]
        }
      ]
    }
  },
  {
    "uid": "009642",
    "code": "SW8363",
    "subject": "SW",
    "number": "8363",
    "honors": false,
    "writingIntensive": false,
    "name": "SW in Child Welf",
    "fullname": "Social Work in Child Welfare",
    "info": "Public, private, tribal child welfare related to assessment of strengths/risks. Develop appropriate plans that secure child safety/well-being.",
    "prereq": []
  },
  {
    "uid": "010760",
    "code": "SW8411",
    "subject": "SW",
    "number": "8411",
    "honors": false,
    "writingIntensive": false,
    "name": "Life-Cycle Therapy",
    "fullname": "Life-Cycle Therapy",
    "info": "Life-cycle therapy is a strength-based approach to client treatment grounded in Erik H. Erikson's theory of the life cycle. Model explicitly considers differences in environmental supports and in \"healthy\" outcomes, based on culture, race, gender, sexual orientation, spiritual belief, and age. It focuses on maximizing health and remediating disorders.",
    "prereq": []
  },
  {
    "uid": "788418",
    "code": "SW8444",
    "subject": "SW",
    "number": "8444",
    "honors": false,
    "writingIntensive": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)prereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "uid": "807864",
    "code": "SW8451",
    "subject": "SW",
    "number": "8451",
    "honors": false,
    "writingIntensive": false,
    "name": "Assess Engage Clin SW Pract",
    "fullname": "Assessment and Engagement in Clinical Social Work Practice",
    "info": "Mental health diagnostic codes/classifications. Interviewing skills, assessment writing skills/techniques. Biopsychosocial perspective/engagement strategies.",
    "prereq": []
  },
  {
    "uid": "807865",
    "code": "SW8452",
    "subject": "SW",
    "number": "8452",
    "honors": false,
    "writingIntensive": false,
    "name": "CoreConceptClinSWPract",
    "fullname": "Core Concepts in Clinical Social Work Practice",
    "info": "Interpersonal process skills. Developing/maintaining effective therapeutic alliances/positive intervention outcomes with diverse populations.",
    "prereq": []
  },
  {
    "uid": "009800",
    "code": "SW8460",
    "subject": "SW",
    "number": "8460",
    "honors": false,
    "writingIntensive": false,
    "name": "Sp Topic: Practice",
    "fullname": "Special Topics: Practice With Individuals, Families, and Groups",
    "info": "Advanced practice courses.",
    "prereq": []
  },
  {
    "uid": "009644",
    "code": "SW8461",
    "subject": "SW",
    "number": "8461",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvClinSWPractAdults",
    "fullname": "Advanced Clinical Social Work Practice with Adults",
    "info": "Research-informed clinical interventions for adults with mental health distress. Application of cognitive behavioral/psychodynamic psychotherapies through brief/long-term models across diverse populations.",
    "prereq": []
  },
  {
    "uid": "007025",
    "code": "SW8462",
    "subject": "SW",
    "number": "8462",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Clin Prac Child & Adolscnt",
    "fullname": "Advanced Clinical Practice With Children and Adolescents",
    "info": "Social work interventions using normative developmental supports/mental health case planning. Develop advanced clinical social work practice knowledge/skills for working with children/adolescents with mental health risks. Provide knowledge for community social workers serving children exposed to stress.",
    "prereq": []
  },
  {
    "uid": "807866",
    "code": "SW8463",
    "subject": "SW",
    "number": "8463",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Practice with Ment. Illness",
    "fullname": "Practice Interventions with Persons Who Experience Serious Mental Illness",
    "info": "An overview of SW practice in community mental health services to improve the lives of persons (adults and children) who experience serious mental illness. Topics: context of mental health care and recovery, stigma, needs and strengths assessment, service planning, and current evidence-based interventions. ",
    "prereq": []
  },
  {
    "uid": "005429",
    "code": "SW8501",
    "subject": "SW",
    "number": "8501",
    "honors": false,
    "writingIntensive": false,
    "name": "Plan Market Prog Dv",
    "fullname": "Planning, Marketing, and Program Development",
    "info": "Principles, applied practice of management concepts in human service settings. Management theories, organizational planning, program development, marketing/communications. Management practice that is client/community-focused, results-oriented, and seeks to achieve positive social change.prereq: [Foundation curriculum, advanced standing] or instr consent",
    "prereq": []
  },
  {
    "uid": "005431",
    "code": "SW8502",
    "subject": "SW",
    "number": "8502",
    "honors": false,
    "writingIntensive": false,
    "name": "Resource Dev & Mgmt",
    "fullname": "Resource Development and Management",
    "info": "Procuring/managing financial resources in social work settings. Principles of philanthropy. Fund raising, grant writing, preparing/monitoring budgets, interpreting basic financial reports. Management information systems, accountability requirements.prereq: [Foundation curriculum, advanced standing] or instr consent",
    "prereq": []
  },
  {
    "uid": "005432",
    "code": "SW8503",
    "subject": "SW",
    "number": "8503",
    "honors": false,
    "writingIntensive": false,
    "name": "Pers Leader & Mgmt",
    "fullname": "Personnel Leadership and Management",
    "info": "Skills/principles in effective leadership. Legal/strategic considerations in personnel management. Workplace diversity. Selection, hiring, and development of paid/unpaid staff. Evaluation, compensation, and benefits. Promotions and staff termination. Management of work groups and collaboratives.prereq: [Foundation curriculum, advanced standing] or instr consent",
    "prereq": []
  },
  {
    "uid": "009647",
    "code": "SW8505",
    "subject": "SW",
    "number": "8505",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv Com Org & Advoc",
    "fullname": "Advanced Community Organization and Advocacy",
    "info": "Methods for stimulating/supporting joint action for constructive change to fulfill community needs. Principles of working with local organizations. Social action to accomplish specific changes.prereq: [Foundation curriculum, advanced standing] or instr consent",
    "prereq": []
  },
  {
    "uid": "790823",
    "code": "SW8507",
    "subject": "SW",
    "number": "8507",
    "honors": false,
    "writingIntensive": false,
    "name": "Com Pract Sem",
    "fullname": "Community Practice Seminar",
    "info": "Links content from human services management and from community organization and advocacy. Integrating framework that draws upon knowledge/skills used in agency/organizational management and in community organization/change.prereq: [Foundation curriculum, advanced standing] or instr consent",
    "prereq": []
  },
  {
    "uid": "009649",
    "code": "SW8519",
    "subject": "SW",
    "number": "8519",
    "honors": false,
    "writingIntensive": false,
    "name": "Med & Conf Res SW",
    "fullname": "Mediation and Conflict Resolution for Social Workers",
    "info": "Advanced mediator skills for social workers; appropriateness of mediation for conflicts that frequently confront social work practitioners, such as divorce, neighborhood disputes, and conflicts between parents and adolescents, between spouses, and between crime victims and offenders.prereq: Credit will not be granted if credit has been received for: : 5519; MSW student or grad conflict mgmt minor or instr consent",
    "prereq": {
      "code": "SW 5519",
      "subject": "SW",
      "id": "5519"
    }
  },
  {
    "uid": "009650",
    "code": "SW8525",
    "subject": "SW",
    "number": "8525",
    "honors": false,
    "writingIntensive": false,
    "name": "Glob Pers Soc Welf",
    "fullname": "Global Perspectives on Social Welfare, Peace, and Justice",
    "info": "Role of international social welfare in meeting basic human needs and promoting human rights, social justice, and peace. Theories, models, and strategies of social welfare in different economic/political systems. Emphasizes Third World nations. Skills for social workers and other professionals in the helping professions.prereq: [8211, advanced standing] or instr consent",
    "prereq": {
      "code": "SW 8211",
      "subject": "SW",
      "id": "8211"
    }
  },
  {
    "uid": "807774",
    "code": "SW8551",
    "subject": "SW",
    "number": "8551",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvCommPract: Asses Org Advoc",
    "fullname": "Advanced Community Practice: Assessment, Organizing, and Advocacy",
    "info": "Community practice, including community organizing, policy advocacy, social service/change leadership.prereq: [5051, 5101, 8151, 8152, 8153, 8154] or MSW Adv Standing or instr consent",
    "prereq": {
      "and": [
        {
          "code": "SW 5051",
          "subject": "SW",
          "id": "5051"
        },
        {
          "code": "SW 5101",
          "subject": "SW",
          "id": "5101"
        },
        {
          "code": "SW 8151",
          "subject": "SW",
          "id": "8151"
        },
        {
          "code": "SW 8152",
          "subject": "SW",
          "id": "8152"
        },
        {
          "code": "SW 8153",
          "subject": "SW",
          "id": "8153"
        },
        {
          "code": "SW 8154",
          "subject": "SW",
          "id": "8154"
        }
      ]
    }
  },
  {
    "uid": "807775",
    "code": "SW8552",
    "subject": "SW",
    "number": "8552",
    "honors": false,
    "writingIntensive": false,
    "name": "AdvComPrac:LdrPlanProgDevel",
    "fullname": "Advanced Community Practice: Leadership, Planning, and Program Development",
    "info": "Advanced community practice knowledge/skills. Strategic planning, program design, organizational leadership/management, work groups.",
    "prereq": []
  },
  {
    "uid": "807776",
    "code": "SW8561",
    "subject": "SW",
    "number": "8561",
    "honors": false,
    "writingIntensive": false,
    "name": "HRM in Human Services Agencies",
    "fullname": "Human Resources Management in Human Services Agencies",
    "info": "Processes/components of strategic human resources management in social services. Environmental scanning, job analysis, recruitment/selection, training/development, motivation, performance evaluation, compensation/benefits, termination. Human resources law. Promotion of inclusive workplace.prereq: [5051, 5101, 8151, 8152, 8153, 8841] or MSW Adv Standing or instr consent",
    "prereq": {
      "and": [
        {
          "code": "SW 5051",
          "subject": "SW",
          "id": "5051"
        },
        {
          "code": "SW 5101",
          "subject": "SW",
          "id": "5101"
        },
        {
          "code": "SW 8151",
          "subject": "SW",
          "id": "8151"
        },
        {
          "code": "SW 8152",
          "subject": "SW",
          "id": "8152"
        },
        {
          "code": "SW 8153",
          "subject": "SW",
          "id": "8153"
        },
        {
          "code": "SW 8841",
          "subject": "SW",
          "id": "8841"
        }
      ]
    }
  },
  {
    "uid": "808059",
    "code": "SW8562",
    "subject": "SW",
    "number": "8562",
    "honors": false,
    "writingIntensive": false,
    "name": "Human Services Finances",
    "fullname": "Human Services Finances",
    "info": "Contexts, purposes, principles, strategies associated with human services financing. Acquiring, allocating, managing, reporting public/private funding. Financial policy, mission. Short/long term agency sustainability.prereq: [5051, 5801, 8151, 8152, 8153, 8841] or MSW Adv Standing or instr consent",
    "prereq": {
      "and": [
        {
          "code": "SW 5051",
          "subject": "SW",
          "id": "5051"
        },
        {
          "code": "SW 5801",
          "subject": "SW",
          "id": "5801"
        },
        {
          "code": "SW 8151",
          "subject": "SW",
          "id": "8151"
        },
        {
          "code": "SW 8152",
          "subject": "SW",
          "id": "8152"
        },
        {
          "code": "SW 8153",
          "subject": "SW",
          "id": "8153"
        },
        {
          "code": "SW 8841",
          "subject": "SW",
          "id": "8841"
        }
      ]
    }
  },
  {
    "uid": "807777",
    "code": "SW8563",
    "subject": "SW",
    "number": "8563",
    "honors": false,
    "writingIntensive": false,
    "name": "Advanced Policy Advocacy",
    "fullname": "Advanced Policy Advocacy",
    "info": "Students paired with social service, social policy, social justice agencies, coalitions. Agenda setting, legislative research, legislative advocacy in relation to specific legislation proposed in Minnesota state legislature. Tie policy theory to real-world practice.",
    "prereq": []
  },
  {
    "uid": "003554",
    "code": "SW8602",
    "subject": "SW",
    "number": "8602",
    "honors": false,
    "writingIntensive": false,
    "name": "Direct Pract Eval",
    "fullname": "Direct Practice Evaluation",
    "info": "Students design evaluations that incorporate current evaluation methods and principles derived from research, theory, practice wisdom, their own experience. Evaluation methods include single-system designs, client- focused evaluations, practitioner-focused evaluations, and use of event analyses, standardized instruments, self-constructed instruments.prereq: 8601 or equiv or instr consent",
    "prereq": {
      "code": "SW 8601",
      "subject": "SW",
      "id": "8601"
    }
  },
  {
    "uid": "009648",
    "code": "SW8603",
    "subject": "SW",
    "number": "8603",
    "honors": false,
    "writingIntensive": false,
    "name": "Program Evaluation",
    "fullname": "Program Evaluation",
    "info": "Conceptual, methodological, political, psychological, and administrative factors related to conduct and consequences of social work program evaluation. Social programs as cause and effect; models, types, and strategies of evaluation; appraisal of selected research literature.prereq: 8601 or equiv or instr consent",
    "prereq": {
      "code": "SW 8601",
      "subject": "SW",
      "id": "8601"
    }
  },
  {
    "uid": "788539",
    "code": "SW8666",
    "subject": "SW",
    "number": "8666",
    "honors": false,
    "writingIntensive": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBDprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "uid": "009791",
    "code": "SW8693",
    "subject": "SW",
    "number": "8693",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Independent study under tutorial guidance.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "009798",
    "code": "SW8694",
    "subject": "SW",
    "number": "8694",
    "honors": false,
    "writingIntensive": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Individual or small group research inquiry translating introductory course content into research design and study. Projects may be conducted in conjunction with field learning experiences or other coursework.prereq: instr consent",
    "prereq": []
  },
  {
    "uid": "003976",
    "code": "SW8801",
    "subject": "SW",
    "number": "8801",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Ethic & Legl Iss",
    "fullname": "Social Work Ethics and Legal Issues",
    "info": "Develops knowledge base and skills required to identify and understand legal and ethical issues, resolve ethical dilemmas, and make ethical decisions within social work. Values base, ethical standards, ethical decision-making models, and laws and legal procedures related to social work. Legal aspects of child welfare practice.prereq: Credit will not be granted if credit has been received for: : 5811; foundation courses or adv standing or instr consent",
    "prereq": {
      "code": "SW 5811",
      "subject": "SW",
      "id": "5811"
    }
  },
  {
    "uid": "003974",
    "code": "SW8804",
    "subject": "SW",
    "number": "8804",
    "honors": false,
    "writingIntensive": false,
    "name": "Child Welf Pol",
    "fullname": "Child Welfare Policy",
    "info": "Develops advanced policy knowledge/skills for social workers practicing in or collaborating with public or private child welfare services.",
    "prereq": []
  },
  {
    "uid": "807998",
    "code": "SW8805",
    "subject": "SW",
    "number": "8805",
    "honors": false,
    "writingIntensive": false,
    "name": "Aging & Disability Policy",
    "fullname": "Aging and Disability Policy",
    "info": "Social policy related to disability/aging. Major policy areas of income support, health, education, caregiving, employment, housing, retirement.",
    "prereq": []
  },
  {
    "uid": "003975",
    "code": "SW8806",
    "subject": "SW",
    "number": "8806",
    "honors": false,
    "writingIntensive": false,
    "name": "Hlth Ment Hlth Pol",
    "fullname": "Health and Mental Health Policy",
    "info": "Critically engage in health/mental health policy debate, analysis, development, implementation.",
    "prereq": []
  },
  {
    "uid": "807999",
    "code": "SW8807",
    "subject": "SW",
    "number": "8807",
    "honors": false,
    "writingIntensive": false,
    "name": "Internl&CompSocWelfPol",
    "fullname": "International and Comparative Social Welfare Policy",
    "info": "Cross-national comparisons of social welfare policies, major international conventions, treaties. Social welfare, social development theories/policies. In-depth analyses of selected countries' policies, international agreements, social development strategies.",
    "prereq": []
  },
  {
    "uid": "005433",
    "code": "SW8821",
    "subject": "SW",
    "number": "8821",
    "honors": false,
    "writingIntensive": false,
    "name": "SW & Differ, Divers  & Privil",
    "fullname": "Social Work and Difference, Diversity and Privilege",
    "info": "Essential knowledge/awareness/skills to support culturally competent social work practice.",
    "prereq": []
  },
  {
    "uid": "005112",
    "code": "SW8841",
    "subject": "SW",
    "number": "8841",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Research Methods",
    "fullname": "Social Work Research Methods",
    "info": "Develops foundational research methods knowledge/skills fundamental to evidence-based social work practice.",
    "prereq": []
  },
  {
    "uid": "808126",
    "code": "SW8842",
    "subject": "SW",
    "number": "8842",
    "honors": false,
    "writingIntensive": false,
    "name": "Adv SW Eval",
    "fullname": "Advanced Social Work Evaluation",
    "info": "Students design/carry out evaluation of program or own direct practice. Purposes/types of evaluations. Instrument design, data analysis, ethical issues. Organizational, political, social, cultural factors affecting evaluation in diverse human contexts.",
    "prereq": []
  },
  {
    "uid": "818210",
    "code": "SW8843",
    "subject": "SW",
    "number": "8843",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Work Program Evaluation",
    "fullname": "Social Work Program Evaluation",
    "info": "Students design, implement, and present an evaluation of a program either in their field practicum or of particular interest to them. Class topics include the purpose and types of evaluations; instrument design; data collection techniques and management; data analysis; ethical issues; and organizational, political, social, and cultural factors influencing evaluation in diverse human contexts.",
    "prereq": []
  },
  {
    "uid": "006987",
    "code": "SW8851",
    "subject": "SW",
    "number": "8851",
    "honors": false,
    "writingIntensive": false,
    "name": "SocWelfHist&HistoricalResMeth",
    "fullname": "Social Welfare History and Historical Research Methods",
    "info": "Methods of historical research in, and survey of, history/evolution of social welfare/work, using primary/secondary source materials.prereq: Completed research courses for soc work PhD student or [equiv research methods courses, grad student]",
    "prereq": []
  },
  {
    "uid": "006766",
    "code": "SW8855",
    "subject": "SW",
    "number": "8855",
    "honors": false,
    "writingIntensive": false,
    "name": "Social Policy Form & Analysis",
    "fullname": "Social Policy Formulation and Analysis",
    "info": "Application of theoretical perspectives, conceptual frameworks, and research methodologies to analysis of social issues and analysis/formulation of social welfare policy.prereq: Soc wk PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "003550",
    "code": "SW8861",
    "subject": "SW",
    "number": "8861",
    "honors": false,
    "writingIntensive": false,
    "name": "Theory&Model Development in SW",
    "fullname": "Theory and Model Development in Social Work",
    "info": "Intervention research methods, contemporary social work practice models. Direct intervention in systems, from individual to community. Theoretical, value, empirical foundations of practice models for intervention research.prereq: Soc wk PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "006911",
    "code": "SW8863",
    "subject": "SW",
    "number": "8863",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Teaching  Methods&Ed Issues",
    "fullname": "Social Work Teaching Methods and Educational Issues",
    "info": "Teaching methods, skills, strategies, and issues related to Teaching, scholarship, and service roles in social work education. Issues, including curriculum development. Teaching experience in a social work class.prereq: Soc wk PhD student or 2nd-yr MSW student or instr consent",
    "prereq": []
  },
  {
    "uid": "006915",
    "code": "SW8871",
    "subject": "SW",
    "number": "8871",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Research Seminar I",
    "fullname": "Social Work Research Seminar I",
    "info": "Concepts/methods of social research. Issues in social science, social work research, and knowledge development. Development of research questions. Sampling, measurement, data collection in qualitative/quantitative research.prereq: Soc wk PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "006919",
    "code": "SW8872",
    "subject": "SW",
    "number": "8872",
    "honors": false,
    "writingIntensive": false,
    "name": "SW Research Seminar II",
    "fullname": "Social Work Research Seminar II",
    "info": "Methods/design of quasi-experiments, surveys, descriptive research. Grounded theory. Analysis of quantitative/qualitative data.prereq: 8871 or instr consent",
    "prereq": {
      "code": "SW 8871",
      "subject": "SW",
      "id": "8871"
    }
  },
  {
    "uid": "009653",
    "code": "SW8875",
    "subject": "SW",
    "number": "8875",
    "honors": false,
    "writingIntensive": false,
    "name": "Research Practicum",
    "fullname": "Research Practicum",
    "info": "Experience in conduct of research, following completion of 8871 and 8872. Students work under faculty direction.prereq: Soc wk PhD student or instr consent",
    "prereq": []
  },
  {
    "uid": "787939",
    "code": "SW8888",
    "subject": "SW",
    "number": "8888",
    "honors": false,
    "writingIntensive": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "uid": "804674",
    "code": "SW8901",
    "subject": "SW",
    "number": "8901",
    "honors": false,
    "writingIntensive": false,
    "name": "Assess&TreatTrauma",
    "fullname": "Assessment and Treatment of Trauma",
    "info": "Sociopolitical context of trauma. Impact on diverse populations of individuals, families, communities. Evidence-based approaches for addressing trauma on multiple system levels. Applications to case conceptualization, treatment planning.",
    "prereq": []
  },
  {
    "uid": "005425",
    "code": "SW8902",
    "subject": "SW",
    "number": "8902",
    "honors": false,
    "writingIntensive": false,
    "name": "Supv Consult Leader",
    "fullname": "Social Work Supervision, Consultation, and Leadership",
    "info": "Principles, practice skills, models of supervision: administration, education, support. Power/authority, leadership, use of self in supervising. Ethics, risk management, legal obligations. Simulated skills practice, experiential learning.",
    "prereq": []
  }
]