[
  {
    "uid": "814336",
    "code": "THAI1001",
    "subject": "THAI",
    "number": "1001",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Thai I",
    "fullname": "Beginning Thai I",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "814335",
    "code": "THAI1002",
    "subject": "THAI",
    "number": "1002",
    "honors": false,
    "writingIntensive": false,
    "name": "Beginning Thai II",
    "fullname": "Beginning Thai II",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "814334",
    "code": "THAI3001",
    "subject": "THAI",
    "number": "3001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Thai I",
    "fullname": "Intermediate Thai I",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "814333",
    "code": "THAI3002",
    "subject": "THAI",
    "number": "3002",
    "honors": false,
    "writingIntensive": false,
    "name": "Intermediate Thai II",
    "fullname": "Intermediate Thai II",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "uid": "825407",
    "code": "THAI4001",
    "subject": "THAI",
    "number": "4001",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev: Human Rights",
    "fullname": "International Development: Human Rights & Marginalized Communities",
    "info": "This course will focus on human rights broadly defined, including social work as well as other efforts to educate and work with vulnerable populations. The course will look at the roles of local people, nonprofits, government agencies, and intergovernmental entities in determining how to best work with and serve vulnerable populations and how these different stakeholders collaborate while addressing complex, often sensitive situations. Course content will focus on citizenship and orphan/vulnerable children, as well as human trafficking, disabilities, migrant workers, and LGBT issues in the Thai context, as well as minority issues, especially with the hill tribes of Northern Thailand. Students in this course will utilize the content learned in this collaborative classroom setting and apply it individually toward a specific internship placement or research topic during the second half of the semester.This course encourages students to think critically about development theories and practices. For the majority of examples and reading, the course will draw on case studies from Thailand and links to global development issues. We will explore “development” as a contested value and process on multiple scales—local, national, and global. We will place special emphasis on the practice of development: What does it mean to actually “do” development in a cross-cultural international setting? We will examine the roles of outsiders and facilitators and how local communities and organizations can be empowered through the development process.",
    "prereq": []
  },
  {
    "uid": "825408",
    "code": "THAI4002",
    "subject": "THAI",
    "number": "4002",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev: Entrepreneurship",
    "fullname": "International Development: Entrepreneurship & Sustainable Food Systems",
    "info": "Food systems and sustainability are critical environmental and economic issues in understanding development. This course focuses on two connected issues: food production and agriculturally based entrepreneurship, including but not limited to coffee growing and production, sustainable and organic food production, and related topics. A key part of the course will be understanding the natural interconnectedness between the environment, where crops are cultivated, and the business of selling these crops on a local and/or international scale. The course will examine agricultural commodity production (coffee) from bean to cup, examining the growing, production, selling, and business of coffee as both a local production process, international commodity, and local consumption. We will further explore spaces for innovation in sustainable food production, in particular around community-supported sustainable and organic agriculture, and the role of small-scale production in ensuring the resilience and sustainability of the global food supply.This course encourages students to think critically about development theories and practices.A majority of examples and reading will be drawn on case studies from Thailand and their links to global development issues. “Development” as a contested value and process will be explored in multiple scales—local, national, and global. Special emphasis will be on the practice of development: What does it mean to actually “do” development in a cross-cultural international setting? We will examine the roles of outsiders and facilitators and how local communities and organizations can be empowered through the development process.",
    "prereq": []
  },
  {
    "uid": "825409",
    "code": "THAI4003",
    "subject": "THAI",
    "number": "4003",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev: OneHealth",
    "fullname": "International Development: OneHealth: Humans, Animals, & Environment",
    "info": "This course will focus on the concept of “One Health”—integrating the health sciences so that health is understood as a broader concept rather than a narrow disciplinary focus. Issues related to this topic will include public health, community education about health, veterinary, and animal care issues and organizations (and how human and animal health are linked), clinics, local hospitals, and traditional medicine. Special emphasis will be placed on contemporary issues in Thailand, especially success with public health and family planning, as well as issues around HIV/AIDS education and prevention, zoonotic disease such as COVID-19, and related issues. Students in this course will utilize the content learned in this collaborative classroom setting and apply it individually toward a specific internship placement or research topic during that second half of the semester.This course encourages students to think critically about development theories and practices. A majority of examples and reading will be drawn on case studies from Thailand and their links to global development issues. “Development” as a contested value and process will be explored in multiple scales—local, national, and global. Special emphasis will be on the practice of development: What does it mean to actually “do” development in a cross-cultural international setting? We will examine the roles of outsiders and facilitators and how local communities and organizations can be empowered through the development process.",
    "prereq": []
  },
  {
    "uid": "825452",
    "code": "THAI4004",
    "subject": "THAI",
    "number": "4004",
    "honors": false,
    "writingIntensive": false,
    "name": "Intl Dev: Sust Arch & Design",
    "fullname": "International Development: Sustainable Architecture & Design",
    "info": "This course will examine sustainable design, including vernacular architecture, sustainable product design, urban planning, alternative (green) power (wind/solar/hydro), sustainable engineering, and sustainable and alternative architecture. It will focus on how design can be used in development to support sustainability, especially in the built and manufactured environment, drawing on culturally and ecologically appropriate design principles.This course encourages students to think critically about development theories and practices. A majority of examples and reading will be drawn on case studies from Thailand and their links to global development issues. “Development” as a contested value and process will be explored in multiple scales—local, national, and global. Special emphasis will be one the practice of development: What does it mean to actually “do” development in a cross-cultural international setting? We will examine the roles of outsiders and facilitators and how local communities and organizations can be empowered through the development process.",
    "prereq": []
  },
  {
    "uid": "825432",
    "code": "THAI4101",
    "subject": "THAI",
    "number": "4101",
    "honors": false,
    "writingIntensive": false,
    "name": "Hist & Pol Context of Thailand",
    "fullname": "Historical & Political Context of Thailand",
    "info": "This course explores the history of modernization, conditions of social transition, and current issues that characterize Thailand and influence relationships among various social groups. Students will enhance their understanding of the process of modernization and multi-level adjustment of Thai society in different historical contexts. Cultural diversity, political transition, and economic development are integral in analyzing and understanding these topics.Thailand is unique in southeast Asia for its lack of colonization. It also has a long history of development in southeast Asia, serving as a regional hub for international development. This course will examine the development process in Thailand, its political and social history, and especially the current struggles of modernity and as an emerging economy in southeast Asia.While many of the basic issues of development have been successfully dealt with (literacy is high, clean water and basic needs are met, etc.), Thailand is now dealing with growing inequality, challenges of post-modernity, and increasing demand for popular participation in politics within a patron-client-based society.",
    "prereq": []
  },
  {
    "uid": "825410",
    "code": "THAI4201",
    "subject": "THAI",
    "number": "4201",
    "honors": false,
    "writingIntensive": false,
    "name": "Research in Thailand",
    "fullname": "Research in Thailand",
    "info": "In this course, the MSID student will learn about various research concepts and practices; make decisions involved in research, including selecting a topic and title for their study, developing statements of problems, and choosing ethical research questions and appropriate research design; learn about issues related to research ethics; and develop their skills in choosing data collection instruments and analysis of the data they collect for their research. The course does this by introducing various topics in the research cycle and providing a forum in which students can share with one another their research experience at each stage of the process. Through the course students will develop, defend, and challenge their own values and beliefs.Research projects in this course are ideally projects that fit with the development agency’s goals and activities; therefore, the student’s research interests must blend with what is realistically happening at the development agency. Students must have approved proposals before proceeding onto their research sites to allow them to collect necessary data and complete data analysis before heading back to Chiang Mai at the end of the six-week field period. It is likely that students will participate in field activities, meetings, and other forms of engagement that will be indirectly related to and could inform their research projects.This course also includes an optional 10 hours of Thai language instruction as needed.",
    "prereq": []
  },
  {
    "uid": "825411",
    "code": "THAI4896",
    "subject": "THAI",
    "number": "4896",
    "honors": false,
    "writingIntensive": false,
    "name": "Internship in Thailand",
    "fullname": "Internship in Thailand",
    "info": "This course provides a cross-cultural experience of working on various development issues with a regional nonprofit organization. The course focuses on guiding students to understand their own identity as they integrate theory with reality by participating in local development sites. Students are prepared for entering into their community work through discussions on stakeholder and agency analysis, culture-specific gender and diversity context, ethics, and power and privilege. Through the course students will develop, defend, and challenge their own values and beliefs.The mentoring continues while students are at their internship placement as they come in contact with social actors, community organizations, and local and national authorities in various regions of Chiang Mai province at the marginal urban and rural levels. The students are urged to play an active role in their internships by providing suggestions and solutions, discussing alternatives, and investigating all areas of their internship placement to garner a holistic view of the realities of development work. Through practical internship experiences as well as readings, discussions, and written assignments, students will deepen their understanding of the host-country cultural context and development work from an international perspective, as well as critically examine their own worldview.This course also includes an optional 10 hours of Thai language instruction as needed.",
    "prereq": []
  }
]