[
  {
    "uid": "818584",
    "code": "VCS2101",
    "subject": "VCS",
    "number": "2101",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics",
    "fullname": "Topics",
    "info": "Topics class ",
    "prereq": []
  },
  {
    "uid": "819740",
    "code": "VCS2201",
    "subject": "VCS",
    "number": "2201",
    "honors": false,
    "writingIntensive": false,
    "name": "Cancer in Society & Technology",
    "fullname": "The Intersection of Cancer in Society and Technology",
    "info": "The course objectives are to discuss why cancer happens, the impact that cancer has on our society, and how we can use science and technology to defeat it.For most people, cancer is a mysterious and fearsome condition. This emotional response means that social stigmas are often tied to a cancer diagnosis. However, at its core cancer is a disease caused by mutations in a cell’s DNA. In fact, the same mechanisms of mutations in DNA that lead cells to become cancerous are the drivers of evolution, so cancer risk can be considered as part of our evolutionary legacy. Moreover, few people realize that advances in cancer research and treatment are allowing millions of people (and pets) to lead healthy and fulfilling lives as cancer survivors. We will discuss the biological and evolutionary foundations for why cancer happens and advances in how we detect it, treat, and prevent it. The course is designed for students from all majors, and non-scientists are encouraged to enroll and participate. A better understanding by scientists and non-scientists alike of the risks for cancer, of its possible occurrence in virtually all animals, and of advances in diagnosis and treatment, will help demystify this condition and allow students to converse about it in an objective fashion. We have the tools to create a world where we no longer fear cancer, and our goal is to enroll motivated students from the University of Minnesota who will help us achieve this vision.",
    "prereq": []
  },
  {
    "uid": "794587",
    "code": "VCS3050",
    "subject": "VCS",
    "number": "3050",
    "honors": false,
    "writingIntensive": false,
    "name": "People and Animals in Society",
    "fullname": "Perspectives: Interrelationships of People and Animals in Society",
    "info": "Interrelationships of people/animals. Social, economic, health consequences. Pets/people sharing urban environment, animal rights, influence of cultural differences on animal-human relationships.",
    "prereq": []
  },
  {
    "uid": "796171",
    "code": "VCS4600",
    "subject": "VCS",
    "number": "4600",
    "honors": false,
    "writingIntensive": false,
    "name": "SA & Equine Behavior",
    "fullname": "Small Animal and Equine Behavior",
    "info": "Basics of normal animal behavior, ethology, and welfare in cats, dogs, and horses. Common behavioral problems. Approaches to prevent/treat them, including pre-purchase considerations, management, and housing. Principles of behavior modification.",
    "prereq": []
  },
  {
    "uid": "795223",
    "code": "VCS4606",
    "subject": "VCS",
    "number": "4606",
    "honors": false,
    "writingIntensive": false,
    "name": "Small Animal Management",
    "fullname": "Small Animal Management",
    "info": "This online course provides an overview of small animal management. Species covered include dogs, cats, small mammals, reptiles, and birds. Course content covers public health, community education, general wellness care, and recognizing common diseases in small animals. Student learning is assessed through online quizzes, discussion participation, and group projects.",
    "prereq": []
  },
  {
    "uid": "804279",
    "code": "VCS4992",
    "subject": "VCS",
    "number": "4992",
    "honors": false,
    "writingIntensive": false,
    "name": "DirReadings: Vet Clinical Scie",
    "fullname": "Directed Readings in Veterinary Clinical Sciences",
    "info": "Students read seminal works in veterinary medicine and literature pertaining to their area of interest. Final project evaluated by faculty member.prereq: [One-page proposal, bibliography of works to be read] submitted to faculty",
    "prereq": []
  },
  {
    "uid": "804280",
    "code": "VCS4993",
    "subject": "VCS",
    "number": "4993",
    "honors": false,
    "writingIntensive": false,
    "name": "DirStudy: Vet Clinical Science",
    "fullname": "Directed Study in Veterinary Clinical Sciences",
    "info": "Students expand their knowledge of a specific area. Final project evaluated by faculty member.prereq: One-page proposal submitted to faculty member",
    "prereq": []
  },
  {
    "uid": "804281",
    "code": "VCS4994",
    "subject": "VCS",
    "number": "4994",
    "honors": false,
    "writingIntensive": false,
    "name": "DirResearch: Vet Clin Sciences",
    "fullname": "Directed Research in Veterinary Clinical Sciences",
    "info": "Students perform research in lab setting.prereq: One-page proposal submitted to faculty member",
    "prereq": []
  }
]