[
  {
    "uid": "816620",
    "code": "VIRO5030",
    "subject": "VIRO",
    "number": "5030",
    "honors": false,
    "writingIntensive": false,
    "name": "Virology Research Presentation",
    "fullname": "Virology Research Presentations",
    "info": "This course is designed to enhance knowledge in virology through research presentations as well as the critical evaluation of presentations of other students and researchers. Presentation will includes current virology research, both individual research projects and critical reading, and presentation of current literature. Previously OBIO 5030",
    "prereq": []
  },
  {
    "uid": "825645",
    "code": "VIRO8010",
    "subject": "VIRO",
    "number": "8010",
    "honors": false,
    "writingIntensive": false,
    "name": "Molecular Virology",
    "fullname": "Molecular Virology",
    "info": "This course provides graduate students with a knowledge base for understanding the molecular aspects of replication strategies utilized in virus replication. Topics for the course will focus on the molecular aspects of virus replication for the major virus families (e.g., arenaviruses, bacteriophages, flaviviruses, herpesviruses, orthomyxoviruses, picornaviruses, and retroviruses) as well as virus evolution, structure, and taxonomy.",
    "prereq": []
  },
  {
    "uid": "826035",
    "code": "VIRO8020",
    "subject": "VIRO",
    "number": "8020",
    "honors": false,
    "writingIntensive": false,
    "name": "Virus Pathogenesis",
    "fullname": "Virus Pathogenesis and Host Interactions",
    "info": "This course provides graduate students  with a knowledge base for understanding virus pathogenesis and host interactions. Topics for the course will focus on the molecular, cellular, and organismal aspects of virus pathogenesis and host interactions. The concepts of cellular pathogenesis, tissue tropism, portals of entry, local replication and virus spread, virus dissemination, and congenital infections will be covered. A particular emphasis will be placed on virus pathogenesis of the major virus families (e.g., arenaviruses, bacteriophages, flaviviruses, herpesviruses, orthomyxoviruses, picornaviruses, and retroviruses) and virus-host cell interactions that can restrict virus replication and are responsible for immunity will be discussed.",
    "prereq": []
  },
  {
    "uid": "826036",
    "code": "VIRO8050",
    "subject": "VIRO",
    "number": "8050",
    "honors": false,
    "writingIntensive": false,
    "name": "Evolution of Emerging Viruses",
    "fullname": "Evolution of Emerging Viruses",
    "info": "This course is designed to provide PhD-level graduate students a knowledge base for understanding how HIV and other emerging viruses (e.g., Ebola, influenza, SARS, West Nile virus, hantavirus, hepatitis C) evolve and become public health threats. Topics for the course will focus on the biochemical, molecular, cellular, clinical, and epidemiological aspects of emerging viruses, with an emphasis on how each plays arole in virus evolution and emergence. This course will emphasize HIV as a key example of an emerging virus disease that has had a profound impact on human health. MS-level and advanced undergraduate students should register for OBIO 5050.",
    "prereq": []
  }
]