[
  {
    "uid": "808514",
    "code": "VPM1551",
    "subject": "VPM",
    "number": "1551",
    "honors": false,
    "writingIntensive": false,
    "name": "Introduction to Horsemanship",
    "fullname": "Introduction to the horse including care, handling, and recognizing behaviors",
    "info": "An introduction to the basics of horse management and ownership with modules on topics including: nutrition, health, breeds and colors, anatomy, handling, behavior, tack and riding disciplines. ",
    "prereq": []
  },
  {
    "uid": "810332",
    "code": "VPM1560",
    "subject": "VPM",
    "number": "1560",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro Horseback Riding",
    "fullname": "Introduction to Horseback Riding and Horse Health",
    "info": "Basic motor skills/commands necessary to ride horse. Focus on interaction of human body with horse's body to create movement. Basic horse care skills, grooming, taking temperature, using hoof tester, etc.",
    "prereq": []
  },
  {
    "uid": "817048",
    "code": "VPM1901",
    "subject": "VPM",
    "number": "1901",
    "honors": false,
    "writingIntensive": false,
    "name": "Aquatic Toxicology",
    "fullname": "Aquatic Toxicology, Water Safety, and the Society",
    "info": "Our planet Earth is dominated (>70%) by water. The hydrosphere contains about 1.36 billion cubic kilometers of water mostly in the form of a liquid (water) that occupies topographic depressions on the Earth. The second most common form of the water molecule on our planet is ice. If all our planet's ice melted, sea-level would rise by about 70 meters.Water is also essential for life. Most animals and plants contain more than 60% water by volume. Without water, life would probably never have developed on our planet. Water contains nutrients that are essential for life. Nutrients are extracted from rocks and sediments. At present, human activity is dumping harmful pollutants (poisons) in surface and ground water. Poisons distribute between water and sediments, depending on the properties of the toxin, soil characteristics and water chemistry. Therefore, poisons present in water may contaminate both the aquatic and the soil dwellers, and plants, thus contaminating the food chain for humans as well as animals. The overall aim of this course is to discuss (i) effects of water pollution on aquatic and terrestrial organism including humans, (ii) water quality issues and (iii) water safety. After completing this course, participants will be able to:-Understand physicochemical and solubility properties of water.-Compare and contrast toxins? behavior in water, soil, air and organisms.-Understand the concept of clean and polluted water.-Understand modes of action of toxic chemicals, types of effects from the molecular to the ecosystem level, and detoxification processes.-Understand food-chain contamination and ensuing toxicity.",
    "prereq": []
  },
  {
    "uid": "817049",
    "code": "VPM1902",
    "subject": "VPM",
    "number": "1902",
    "honors": false,
    "writingIntensive": false,
    "name": "Garbage, Government, the Globe",
    "fullname": "Garbage, Government, and the Globe",
    "info": "Garbage, in a broad sense, can be defined as anything (solids, liquid or gas) carelessly discarded because it is perceived to be worthless in our homes, businesses, institutions and factories. When humans were hunters and gatherers, they consumed what was needed, discarded what could not be used and moved on. Being part of nature, the discarded items degraded into reusable nutrients. The humans' interaction with the environment was well balanced and humans' footprints on the Earth were very minute, if at all. However, as the industrial revolution led to the development of large industries, humans began to invent things that were not part of nature, thus the natural balance began to misbalance. This results in accumulation of garbage into the environment, resulting in pollution of the atmosphere, land and water sources. Recently, economic globalization has further increased the magnitude of environmental pollution and ensuing deterioration of public health. If the current trend is not reversed, planet Earth may eventually become uninhabitable. Therefore, the students registering in this course will:(1) learn the processes that facilitate generation and accumulation of garbage, (2) understand the mechanisms responsible for pollution of the Earth?s environment,(3) characterize the health effects of the polluted environment,(4) strategize remediation steps that may halt or repair the damage and (5) interpret data in writing and verbally. ",
    "prereq": []
  },
  {
    "uid": "817055",
    "code": "VPM1903",
    "subject": "VPM",
    "number": "1903",
    "honors": false,
    "writingIntensive": false,
    "name": "Poison, Poisoning and Society",
    "fullname": "Poison, Poisoning and Society",
    "info": "In the United States, approximately 50,000 people die each year as a result of unintentional poisoning, and another 800,000 are treated in emergency departments. The human-caused pollution of the environment (such as oil spill, poisonous gas leak, water pollution, global warming gas release, etc.) seriously impacts the health of millions of people and animals around the world. Despite such serious health consequences, people do not fully understand poisons or poisoning. In this course, students will learn some important aspects regarding poisons including, but not limited to the following.-What are poisons and what is poisoning? -Where do poisons come from?-What are the adverse effects of different types of poisons?-How to prevent poisoning?-What are the impacts of poisoning to the society?Chemicals encountered in everyday life will be used as examples to evaluate the hazards and risk of exposure and put them into perspective. Students will learn the basic principles of toxicology, tools for assessing the toxicology of chemicals, effects of chemicals on the body, and why some people are more sensitive to chemicals than others.",
    "prereq": []
  },
  {
    "uid": "817050",
    "code": "VPM1904",
    "subject": "VPM",
    "number": "1904",
    "honors": false,
    "writingIntensive": false,
    "name": "Science, Technology & Society",
    "fullname": "Science (Politics), Technology (Greed) & the Society (Polarized)",
    "info": "Have you seen the movie \"Dawn of the Planet of the Apes?\" A world where primates, not Homo sapiens, are at the top of the food chain. It takes place ten years after a lab's race to develop a cure for the Alzheimer disease resulted in genetically altered apes with heightened intelligence and a plague for the planet's humans. The \"Simian Flu,\" as it was called, reduced humanity to a meager million. Science or a fiction? Well! Twenty-five million people died just under five years between 1347 and 1352 due to plague. An estimated 400 million of Europe's population died of plague between 1000 and 1352. For perspective, in 1300 AD Earth's total population was 300 to 500 million and Europe's total population was 87 million. Today, our planet's and Europe's populations have fostered to 8 billion and 450 million, respectively. What if the plague returns in this interconnected planet with more than eight billion people where heightened conflict and denial of scientific theories persists? Science, technology, and society may hold the fate of humanity. The overall aim of this course is to examine the science-technology-society axis through the ages: a complex interplay among science, society, culture, religion and politics.The aim of this course is to use the historical information to understand how science and technology affect social relations, and conversely how the culture of a society shapes the science and technologies it produces. Some of the questions this course will address are:-Do different technologies produce or result from different economic systems like feudalism, capitalism, and communism? -Can specific technologies promote democratic or authoritarian politics? -Do they suggest or enforce different patterns of race, class or gender relations? -How have the fields of science and technology evolved over time, and what does the future hold?  -How should societies manage those fields to achieve just and sustainable communities?",
    "prereq": []
  },
  {
    "uid": "807726",
    "code": "VPM1905",
    "subject": "VPM",
    "number": "1905",
    "honors": false,
    "writingIntensive": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Freshman seminar.",
    "prereq": []
  },
  {
    "uid": "809707",
    "code": "VPM1906W",
    "subject": "VPM",
    "number": "1906",
    "honors": false,
    "writingIntensive": true,
    "name": "Freshman Seminar",
    "fullname": "Garbage, Government and the Globe",
    "info": "Freshman Seminar",
    "prereq": []
  },
  {
    "uid": "817051",
    "code": "VPM1907",
    "subject": "VPM",
    "number": "1907",
    "honors": false,
    "writingIntensive": false,
    "name": "Contaminated Drinking Water",
    "fullname": "Chemical Contamination of Drinking Water - Scope, Exposure & Toxicity",
    "info": "The devastating lead contamination of the tap water in Flint, MI, a majority African-American city with a poverty rate above 40%, has drawn the nation's attention towards drinking water safety in the USA. Recently, the Natural Resources Defense Council (NRDC), an international nonprofit environmental organization, reported that in 2015 alone, over 18 million people were served by 5,363 community water systems that violated the Lead and Copper Rule set by the USEPA. Some of the violations cited were (i) failures to properly test the water for lead or conditions that could result in lead contamination, (ii) failures to report contamination to state officials or the public, and (iii) failures to treat the water appropriately to reduce corrosion. Additionally, 1,110 community water systems serving 3.9 million people showed lead levels in excess of 15 parts per billion (ppb) in at least 10 percent of the homes tested, the action level established for lead under the Lead and Copper Rule. Guardian launched an investigation in the wake of the toxic water crisis in Flint and found that at least 33 cities across 17 US states have used water testing \"cheats\" that potentially conceal dangerous levels of lead. As people, especially children, drink contaminated water, lead begins to build up in the body, often over a period of months or years. Even small amounts of lead can cause serious health problems. Children under the age of 6 are especially vulnerable to lead poisoning, which can severely affect mental and physical development. Therefore, lead contamination that was once considered an issue resolved has reappeared or been rediscovered. The overall goal of this course is to discuss the lead contamination issues in the American water supply and its health consequences. After completing this course, students will be able to:1. Explain physicochemical properties of lead in relation to other heavy metals.2. Describe the sources of lead in drinking water.3. Understand health consequences and possible treatment strategies of lead exposure in children and adults.4. The existing governmental and non-governmental regulation to detect and reduce lead contamination of drinking water.",
    "prereq": []
  },
  {
    "uid": "825077",
    "code": "VPM1908",
    "subject": "VPM",
    "number": "1908",
    "honors": false,
    "writingIntensive": false,
    "name": "Deep Ocean Mining & Ecosystems",
    "fullname": "Deep Ocean Mining: Novel Economic Opportunity or Ecological Catastrophe of Common Heritage",
    "info": "The environmental and ecosystem consequences of deep ocean floor mining (OFM) for resources will be discussed. OFM is unsustainable and threatens the deep ocean topology and ecosystems, resulting in local and global climate change and biodiversity loss.",
    "prereq": []
  },
  {
    "uid": "825787",
    "code": "VPM1909",
    "subject": "VPM",
    "number": "1909",
    "honors": false,
    "writingIntensive": false,
    "name": "Inequality and Sustainability",
    "fullname": "Systemic Racism, Injustice, and Inequality: Hurdles for a Unified and Sustainable Society",
    "info": "The United States of America, in its Declaration of Independence, granted ?freedom, life, liberty, and pursuit for happiness? to its citizens. The phrase ?all men are created equal? refers to systemic gender inequality. The US constitution also is far from equal, suffering from systemic inequality, injustice, and racism, which, if not resolved, may present a serious hurdle in the path of building a unified sustainable society as defined by the UN?s SDGs. The aim of this course is to explore whether the US can attain unity and sustainable development with constitutional inequality, injustice, and racism intact. We hypothesize that it will not.",
    "prereq": []
  },
  {
    "uid": "820197",
    "code": "VPM2020",
    "subject": "VPM",
    "number": "2020",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in VPM",
    "fullname": "Topics in Veterinary Population Medicine",
    "info": "Topics shell. See title descriptions.",
    "prereq": []
  },
  {
    "uid": "807727",
    "code": "VPM2102",
    "subject": "VPM",
    "number": "2102",
    "honors": false,
    "writingIntensive": false,
    "name": "Garbage and the Society",
    "fullname": "Garbage, Government, and Globe--An Undergraduate Seminar",
    "info": "Significance of garbage, garbage through the ages, humans quest for energy and ensuing adverse effects, effects of globalization on the Earth's environment and inter-governmental response to garbage and the environment. ",
    "prereq": []
  },
  {
    "uid": "816414",
    "code": "VPM2400",
    "subject": "VPM",
    "number": "2400",
    "honors": false,
    "writingIntensive": false,
    "name": "Managed Captive Wildlife",
    "fullname": "Managed Captive Wildlife",
    "info": "This course is an introduction to key issues at the interface of humans and managed captive wildlife. Topics include: the role of managed captive wildlife species in conservation, education, exhibition, agriculture, and research; biodiversity, urban wildlife, biosentinel science, ethics, and animal welfare; and an introduction to the principles and techniques of the care and management of wildlife species in captive settings.",
    "prereq": []
  },
  {
    "uid": "819387",
    "code": "VPM2451",
    "subject": "VPM",
    "number": "2451",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Raptor Rehab",
    "fullname": "Introductory Concepts in Raptor Rehabilitation",
    "info": "This online course will provide a basic understanding of raptor rehabilitation. Topics include: goals of wildlife rehabilitation; regulatory policies and permits; ethical decision making; anatomy and physiology; diet and nutrition; housing; restraint and handling; physical exam; and, emergency care.",
    "prereq": []
  },
  {
    "uid": "825070",
    "code": "VPM2455",
    "subject": "VPM",
    "number": "2455",
    "honors": false,
    "writingIntensive": false,
    "name": "Intro to Raptor Reconditioning",
    "fullname": "Introduction to Raptor Reconditioning and Release",
    "info": "This 1 credit online course will provide a basic understanding of raptor reconditioning and release, renesting of juveniles, and related management. Topics include: management in captivity; natural and captive behavior; principles of flight and exercise; flight evaluation; creance reconditioning technique; pre-release preparations, transport and release; renesting and release techniques for young raptors; and post-release monitoring.",
    "prereq": []
  },
  {
    "uid": "815413",
    "code": "VPM2500",
    "subject": "VPM",
    "number": "2500",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Breeding and Genetics",
    "fullname": "Equine Breeding and Genetics",
    "info": "This course is designed to improve knowledge of principles and concepts underlying genetic improvement of horses, and develop applied skill in breeding stock selection and mating decisions.",
    "prereq": []
  },
  {
    "uid": "825433",
    "code": "VPM2551",
    "subject": "VPM",
    "number": "2551",
    "honors": false,
    "writingIntensive": false,
    "name": "Biosecurity for Horse Farms",
    "fullname": "Biosecurity for Horse Farms",
    "info": "In the era of COVID-19, a need for a better understanding of general biosecurity principles has become clear. This online course provides a general introduction to principles of biosecurity as they pertain to the horse farm with a focus on small farms, boarding facilities, and hobby farm owners. The principles taught in this course also apply to larger enterprises. The information presented will apply to all disciplines of horse riding and horse businesses, and include biosecurity measures that protect horses as well as their humans. The student will obtain practical knowledge and tools that can be immediately applied. The course is taught by College of Veterinary Medicine faculty veterinarians with current, real-world experience in the management and prevention of equine infectious disease and horse husbandry. ",
    "prereq": []
  },
  {
    "uid": "820195",
    "code": "VPM3020",
    "subject": "VPM",
    "number": "3020",
    "honors": false,
    "writingIntensive": false,
    "name": "Topics in VPM",
    "fullname": "Topics in Veterinary Population Medicine",
    "info": "Topics shell - see title descriptions",
    "prereq": []
  },
  {
    "uid": "820567",
    "code": "VPM3021",
    "subject": "VPM",
    "number": "3021",
    "honors": false,
    "writingIntensive": false,
    "name": "Food Defense Awareness",
    "fullname": "Protecting your Lunch: Food Defense Awareness",
    "info": "Protecting your Lunch: Food Defense Awareness presents current issues, challenges, concerns, and activities impacting global food defense. \"Food Defense\" is the sum of actions and activities related to prevention, protection, mitigation, response, and recovery of the food system from intentional acts of adulteration and disruption. This includes intentional acts from both terrorism and criminal activities. This topics course incorporates case studies as well as current events that directly relate to food system disruption, cause food supply chain interruption, or may provoke intentional adulteration or food fraud.",
    "prereq": []
  },
  {
    "uid": "809817",
    "code": "VPM3101",
    "subject": "VPM",
    "number": "3101",
    "honors": false,
    "writingIntensive": false,
    "name": "Animal Toxicology",
    "fullname": "Animal Toxicology and the Environment",
    "info": "Different aspects of Animal Toxicology/its relationship to  environment.",
    "prereq": []
  },
  {
    "uid": "813132",
    "code": "VPM3102",
    "subject": "VPM",
    "number": "3102",
    "honors": false,
    "writingIntensive": false,
    "name": "Aquatic Toxicology",
    "fullname": "Aquatic-Sediment Ecological Toxicology",
    "info": "The fate, toxicity and risk assessment will be discussed for aquatic and terrestrial organisms exposed to various toxins. Students will devise strategies for toxicity testing and environmental bioremediation.  ",
    "prereq": []
  },
  {
    "uid": "788927",
    "code": "VPM3502",
    "subject": "VPM",
    "number": "3502",
    "honors": false,
    "writingIntensive": false,
    "name": "Animal Health & Disease",
    "fullname": "Animal Health & Disease",
    "info": "Common diseases that affect farm animals (especially dairy cattle, swine). Host-agent-environment interactions that cause disease (microbiology, immunology, environmental factors). Incorporating preventive management practices in animal production systems, monitoring health/productivity, recognizing disease. Treatment considerations. Major exotic/zoonotic diseases. In-house labs or field trips.",
    "prereq": []
  },
  {
    "uid": "813545",
    "code": "VPM3550",
    "subject": "VPM",
    "number": "3550",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Exercise Physiology",
    "fullname": "Introduction to Equine Exercise Physiology",
    "info": "VPM 3550 is an introduction to equine exercise physiology. Students must have successfully completed a physiology or anatomy course prior to taking this course. The course will include lecture, in class work, and work with live horses. All class materials will be found on the Moodle course website. Work assignments and tests will be either in class or through the Moodle site. Grades will be based on assignment completion, tests and demonstration of active participation in class assignments. Students must demonstrate an understanding of equine physiology as it relates to the horse as an athlete and the effect of exercise on the cardiovascular system, the respiratory system and the musculoskeletal system.",
    "prereq": []
  },
  {
    "uid": "796615",
    "code": "VPM3700",
    "subject": "VPM",
    "number": "3700",
    "honors": false,
    "writingIntensive": false,
    "name": "Equine Reproductive Management",
    "fullname": "Equine Reproduction and Breeding Management",
    "info": "Equine stud farm management/procedures. Reproductive physiology of mares/stallions. Manipulation of estrus, breeding stallion management. Breeding systems. Semen collection, evaluation, and extension for on-farm use and cooled shipping. Speculum exam and artificial insemination of mares. Management of pregnant mares, foaling management, exam/diseases of foals. Stud farm design, preventive medicine programs, raising youngstock. Lectures, labs, field trips.prereq: AnSc 3305 recommended",
    "prereq": {
      "code": "ANSC 3305",
      "subject": "ANSC",
      "id": "3305"
    }
  },
  {
    "uid": "803160",
    "code": "VPM4131",
    "subject": "VPM",
    "number": "4131",
    "honors": false,
    "writingIntensive": false,
    "name": "Immunology",
    "fullname": "Immunology",
    "info": "Molecular, genetic, and cellular bases for humoral/cell-mediated immunity. Innage immunity. Antigen recognition by B and T lymphocytes. Interactions between lymphocytes and other cells of immune system. Cytokines. Immunoregulation. Key aspects of clinical immunology.",
    "prereq": []
  },
  {
    "uid": "816323",
    "code": "VPM4400",
    "subject": "VPM",
    "number": "4400",
    "honors": false,
    "writingIntensive": false,
    "name": "Wildlife Diseases",
    "fullname": "Diseases in free-ranging and captive wildlife",
    "info": "This course will provide a basic understanding of animal health and disease in free-ranging and managed captive wildlife. Topics include: epidemiology of disease, infectious and non-infectious diseases, and potentials impacts of disease on human health, managed agriculture and wildlife for both individuals and populations.",
    "prereq": []
  },
  {
    "uid": "826695",
    "code": "VPM5131",
    "subject": "VPM",
    "number": "5131",
    "honors": false,
    "writingIntensive": false,
    "name": "Immunology",
    "fullname": "Immunology",
    "info": "Molecular, genetic, and cellular bases for humoral/cell-mediated immunity. Innage immunity. Antigen recognition by B and T lymphocytes. Interactions between lymphocytes and other cells of immune system. Cytokines. Immunoregulation. Key aspects of clinical immunology.",
    "prereq": []
  }
]