[
  {
    "uid": "819938",
    "code": "ARCH1621V",
    "subject": "ARCH",
    "number": "1621",
    "honors": true,
    "writing": true,
    "name": "Intro to Critical Inquiry",
    "fullname": "Introduction to Critical Inquiry in Practice",
    "info": "This course introduces beginning architecture and landscape architecture students to critical inquiry in disciplinary research and professional practice through guest lectures, readings, and discussions. Weekly exercises help develop a beginning-level understanding of the depth and breadth of architectural inquiry in its contemporary context, i.e., as a complex, multi-dimensional, multidisciplinary endeavor with myriad ethical implications. For the final project, students will extend individual curiosity from course materials and presentations into a meaningful proposal for basic or applied research. Students who are engaged in course materials will begin to understand: architecture, landscape architecture, and design more broadly as an ecology of practices; the historical, contemporary, and projective framework for architecture education; the historical, contemporary, and projective framework for architecture as a profession; and specifically how these relate especially in this region.",
    "prereq": {}
  },
  {
    "uid": "788797",
    "code": "ARCH1701H",
    "subject": "ARCH",
    "number": "1701",
    "honors": true,
    "writing": false,
    "name": "Honors: Designed Env.",
    "fullname": "Honors: The Designed Environment",
    "info": "Seminal issues in the designed environment. Relationships between place/space, ideal/real, public/private. How architecture, landscape architecture, and urban design have explored those issues.\n\nprereq: [Fr or soph] honors",
    "prereq": {}
  },
  {
    "uid": "805534",
    "code": "ARCH3411V",
    "subject": "ARCH",
    "number": "3411",
    "honors": true,
    "writing": true,
    "name": "Architectural History to 1750",
    "fullname": "Architectural History to 1750",
    "info": "This course will begin to situate us, and our work, in the context of the much larger, much longer human story. Architecture, both in practice and in its historical study, is fundamentally about people. In studying the human past through the built environment, from prehistory to 1750, we will see how architecture, both the ordinary and the extraordinary, is the product of its cultural, political, and social context. People make buildings and spaces, and buildings and spaces shape the ideas and behaviors of people. By studying architectural history we will learn about trends of style and form, but our primary emphasis is to learn about the relationships, practices, narratives, and beliefs that have constituted human culture around the world and across time. \n\nprereq: first year writing requirement; Soph or above",
    "prereq": {}
  },
  {
    "uid": "788798",
    "code": "ARCH3412H",
    "subject": "ARCH",
    "number": "3412",
    "honors": true,
    "writing": false,
    "name": "Honors: Arch Hist since 1750",
    "fullname": "Honors: Architectural History Since 1750",
    "info": "Built environment from the Enlightenment to the present in a broad social, cultural, and political context. Major architectural movements and associated forms/designs. Ideas/philosophies that have emerged over time. Lecture, textbooks, discussion, writing, drawing, looking, and researching.\n\nprereq: Soph, honors",
    "prereq": {}
  },
  {
    "uid": "820533",
    "code": "ARCH3412V",
    "subject": "ARCH",
    "number": "3412",
    "honors": true,
    "writing": true,
    "name": "Honors: Arch Hist since 1750",
    "fullname": "Honors: Architectural History Since 1750",
    "info": "Examples of the built environment from the Enlightenment to the present are studied within a broad social, cultural, and political context. Major architectural movements and their associated forms and designs.\n\nprereq: Soph or above",
    "prereq": {}
  },
  {
    "uid": "014368",
    "code": "ARCH3490H",
    "subject": "ARCH",
    "number": "3490",
    "honors": true,
    "writing": false,
    "name": "Honors Theory Sem",
    "fullname": "Honors Theory Seminar",
    "info": "Topics selected by faculty, from their area of scholarship, in contemporary issues from literature of architecture. Specific buildings or building types, or areas of architectural thought, history, representation, design, technology. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "789903",
    "code": "ARCH3711V",
    "subject": "ARCH",
    "number": "3711",
    "honors": true,
    "writing": true,
    "name": "H: Env Design Soc-Cltrl Cntxt",
    "fullname": "Honors: Environmental Design and the Sociocultural Context",
    "info": "Designed environment as cultural medium and as product of a sociocultural process and expression of values, ideas, and behavioral patterns. Design/construction as complex political process.\n\nprereq: Honors, [soph or above]",
    "prereq": {}
  },
  {
    "uid": "807007",
    "code": "ARCH4194H",
    "subject": "ARCH",
    "number": "4194",
    "honors": true,
    "writing": false,
    "name": "Thesis/Capstone Project",
    "fullname": "Thesis/Capstone Project",
    "info": "Individualizes honors experience by connecting aspects of major program with special academic interests.\n\nprereq: Arch major, sr, honors",
    "prereq": {}
  }
]