[
  {
    "uid": "816562",
    "code": "ARTS1001H",
    "subject": "ARTS",
    "number": "1001",
    "honors": true,
    "writing": false,
    "name": "HonorsIntro Contemp Art Theory",
    "fullname": "Honors Introduction to Contemporary Art and Theory",
    "info": "This course introduces you to contemporary perspectives on art through the lens of race, power, and justice. How has art allowed marginalized people to protest oppression, express joy and defiance, and serve as a cultural space for healing? In what ways does the symbolic, open-ended language of art allow artists to imagine otherwise, conjure different futures, and connect to ancestral pasts that co-mingle with present lived experiences? Course readings center BIPOC voices and focus on issues of representation, cultural appropriation, and decolonization. We look at the emergence of ‘fine art,’ a cultural category steeped in race, power, and the politics of exclusion; the history of the Black art movement and its commitment to political purpose in art; the challenges that arise from the insistence that the political align with the aesthetic. The course explores Indigenous organizing and resurgence as well as the politics of opacity and refusal. We will study socially engaged art forms, Afro- and indigenous futurisms, creative practices that explode distinctions between “traditional” and “modern,” art and craft, and engage with art as a field of cultural expression deeply involved in imagining and demanding social justice.\n\nprereq: Honors student",
    "prereq": {}
  },
  {
    "uid": "799392",
    "code": "ARTS1902H",
    "subject": "ARTS",
    "number": "1902",
    "honors": true,
    "writing": false,
    "name": "Honors Freshman Seminar",
    "fullname": "Honors Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "816606",
    "code": "ARTS3401V",
    "subject": "ARTS",
    "number": "3401",
    "honors": true,
    "writing": true,
    "name": "Honors: Critical Theories",
    "fullname": "Honors: Critical Theories and Their Construction From a Studio Perspective",
    "info": "How do artists read and write theory? What roles can ideas play in the creative process? This honors course investigates practices and theories that inform the work of contemporary artists. Through a combination of readings, lectures, asynchronous discussions, writing assignments, and experiments in practice and prose, we will explore some significant questions that lie at the crossroads of ethics and aesthetics. We will also dig into our own practices as artists, writers, and thinkers to understand more fully how ethics and aesthetics intersect in what we do. Readings include texts by visual artists and poets, articles from art journals, as well as essays by art historians and critics of visual culture. This course utilizes writing and critical thinking to deepen each student's connection to contemporary art and to reflect on their own aesthetic experiences. As a writing intensive course, Critical Theories emphasizes writing as a multi-purpose tool for making sense of—and with—art.  \n\nWhile not required, it is recommended that students take ARTS 1001 prior to 3401V.\n\nprereq: Honors Student and Junior or Instructor Consent",
    "prereq": {}
  },
  {
    "uid": "013550",
    "code": "ARTS3410H",
    "subject": "ARTS",
    "number": "3410",
    "honors": true,
    "writing": false,
    "name": "Honors Tutorial in Visual Arts",
    "fullname": "Honors Tutorial in Visual Arts",
    "info": "Individual consultation with a faculty member on visual work, research project, presentation, paper, or bibliography.\n\nprereq: Honors, instr consent",
    "prereq": {}
  },
  {
    "uid": "013681",
    "code": "ARTS3415H",
    "subject": "ARTS",
    "number": "3415",
    "honors": true,
    "writing": false,
    "name": "Honors Thesis: Exhibition",
    "fullname": "Honors Exhibition",
    "info": "Advanced problems in studio and research, leading to a magna or summa exhibition.\n\nprereq: [Magna or summa honors candidate], instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "013682",
    "code": "ARTS3416H",
    "subject": "ARTS",
    "number": "3416",
    "honors": true,
    "writing": false,
    "name": "Honors Thesis: Support Paper",
    "fullname": "Honors Thesis: Supporting Paper",
    "info": "Summa thesis paper written in support of honors exhibition or in relation to candidate's visual/conceptual interests.prereq: Summa level honors candidate, instr consent",
    "prereq": {}
  },
  {
    "uid": "826833",
    "code": "ARTS5404H",
    "subject": "ARTS",
    "number": "5404",
    "honors": true,
    "writing": false,
    "name": "Honors BA Capstone+Exhibition",
    "fullname": "Honors BA Capstone and Exhibition",
    "info": "The BA Capstone and Exhibition will focus on building professional skills, developing a strong studio practice, and preparing for an exhibition in Regis Center Public Spaces.",
    "prereq": {}
  },
  {
    "uid": "826832",
    "code": "ARTS5407H",
    "subject": "ARTS",
    "number": "5407",
    "honors": true,
    "writing": false,
    "name": "Honors BFA Capstone2: Critique",
    "fullname": "Honors BFA Capstone 2: Critique and Exhibition",
    "info": "This honors section of critique-based seminar will provide a structured critical forum for the discussion of your work, help you to verbally articulate and defend your work and prepare you in the presentation of your work. This is a self-motivated and self-directed class. It is expected that you will produce a substantial amount of work to show in this course. Your work is self-directed. Artwork created from assignments (in other classes) will not be critiqued. Each artist will have two one-hour critiques of their work over the course of the semester. Critiques may include members from the arts community such as local artists, MIA, Midway Contemporary Art, Walker Art Center, The Soap Factory and Franklin Artworks. Grades are based on critique participation, attendance and your artist presentation. This class culminates in the BFA Exhibition in the Nash Gallery. Throughout the semester, we will meet with Nash Gallery staff to develop this final show.",
    "prereq": {}
  }
]