[
  {
    "uid": "803177",
    "code": "BIOL1001H",
    "subject": "BIOL",
    "number": "1001",
    "honors": true,
    "writing": false,
    "name": "Evolution & Ecology",
    "fullname": "Introductory Biology I: Evolutionary and Ecological Perspectives",
    "info": "A one-semester exploration of the genetic, evolutionary, and ecological processes that govern biological diversity from populations to ecosystems. We explore how these processes influence human evolution, health, population growth, and conservation. We also consider how the scientific method informs our understanding of biological processes. Lab. This course is oriented towards non-majors and does not fulfill prerequisites for allied health grad programs.",
    "prereq": {}
  },
  {
    "uid": "796059",
    "code": "BIOL1002V",
    "subject": "BIOL",
    "number": "1002",
    "honors": true,
    "writing": true,
    "name": "Molecular, Cell & Development",
    "fullname": "Introductory Biology II: Molecular, Cellular, and Developmental Perspectives",
    "info": "Chemistry of living things, cell structure/transport, energy processing in cells, introduction to primary metabolism, molecular genetics, cell physiology, cell cycles, principles of animal/plant development, regulation of development. Lab focuses on molecular scientific techniques, investigative designs.  Discussion session focuses on scientific problem solving, experimental design, analysis of recent research.",
    "prereq": {}
  },
  {
    "uid": "790816",
    "code": "BIOL1009H",
    "subject": "BIOL",
    "number": "1009",
    "honors": true,
    "writing": false,
    "name": "Honors: General Biology",
    "fullname": "Honors: General Biology",
    "info": "A comprehensive introduction to biology - includes molecular structure of living things, cell processes, energy utilization, genetic information and inheritance, mechanisms of evolution, biological diversity, and ecology. Includes lab. This comprehensive course serves as a prerequisite and requirement in many majors.",
    "prereq": {}
  },
  {
    "uid": "800467",
    "code": "BIOL1905H",
    "subject": "BIOL",
    "number": "1905",
    "honors": true,
    "writing": false,
    "name": "Biology Freshman Seminar",
    "fullname": "Biology Freshman Seminar",
    "info": "Orientation to University environment. Special topics illustrate importance of biological topics/issues in modern society.",
    "prereq": {}
  },
  {
    "uid": "817188",
    "code": "BIOL1951H",
    "subject": "BIOL",
    "number": "1951",
    "honors": true,
    "writing": false,
    "name": "Foundations of Biology I",
    "fullname": "Foundations of Biology Lecture I for Biological Sciences Majors",
    "info": "Core biological concepts, from biomolecules to ecosystems. Emphasizes evolution, organismal diversity, and genetics within context of problem solving/applications. Students must take both BIOL 1951H and BIOL 1961 to be awarded the Biological Sciences LE. This course is required for all CBS honors students",
    "prereq": {}
  },
  {
    "uid": "817199",
    "code": "BIOL1961H",
    "subject": "BIOL",
    "number": "1961",
    "honors": true,
    "writing": false,
    "name": "Foundations of Biology Lab I",
    "fullname": "Foundations of Biology Lab I for Biological Sciences Majors",
    "info": "Core biological concepts, from biomolecules to ecosystems. Emphasizes evolution, organismal diversity, and genetics within context of problem solving/applications.\n\nprereq: [[CHEM 1021 or 1061 or 1081 or equiv], CBS major] or dept consent; prereq or coreq: [Biol 1951 or Biol 1951H]; calculus I or equiv recommended",
    "prereq": {
      "or": [
        {
          "or": [
            "817188"
          ]
        }
      ]
    }
  },
  {
    "uid": "800900",
    "code": "BIOL2002H",
    "subject": "BIOL",
    "number": "2002",
    "honors": true,
    "writing": false,
    "name": "Foundations of Biology I",
    "fullname": "Foundations of Biology for Biological Sciences Majors, Part I",
    "info": "Core biological concepts, from biomolecules to ecosystems. Evolution, organismal diversity, and genetics within context of problem solving/applications.\n\nprereq: [[CHEM 1021 or 1061 or equiv], CBS major, honors student] or dept consent; calculus I or equiv recommended",
    "prereq": {}
  },
  {
    "uid": "801426",
    "code": "BIOL2003H",
    "subject": "BIOL",
    "number": "2003",
    "honors": true,
    "writing": false,
    "name": "Foundations of Biology II",
    "fullname": "Foundations of Biology for Biological Sciences Majors, Part II",
    "info": "Second of two courses. Biological concepts, from biomolecules to ecosystems. Ecology/biochemistry concepts within problem solving/application.",
    "prereq": {}
  },
  {
    "uid": "790966",
    "code": "BIOL2961H",
    "subject": "BIOL",
    "number": "2961",
    "honors": true,
    "writing": false,
    "name": "Exploring Research in Biol Sci",
    "fullname": "Exploring Research in the Biological Sciences",
    "info": "Explore areas of biological research. Learn where/how to access research papers. Prepare in-depth review paper.\n\nprereq: CBS, Honors program, soph, dept consent",
    "prereq": {}
  },
  {
    "uid": "802141",
    "code": "BIOL3004H",
    "subject": "BIOL",
    "number": "3004",
    "honors": true,
    "writing": false,
    "name": "Foundations of Biology II Lab",
    "fullname": "Foundations of Biology for Biological Sciences Majors, Part II Laboratory",
    "info": "Accompanies 2003H. Students design and perform research projects that will require an additional 4-6 hours of lab work per week; times to be arranged. Each section is devoted to either Pseudomonas adaptive radiation, zebrafish environmental toxicology, or microbiome/bioinformatics research. If you have taken BIOL 2002 before Fall 2015 you should register for a Pseudomonas or zebrafish research project; only students with previous command line coding experience should apply for a bioinformatics research project. All projects involve relationships between biology and other sciences, and applying quantitative skills, scientific method, and modern biological tools to real-world questions. BIOL 2002, BIOL 2002H, BIOL 1961 or BIOL 1961H",
    "prereq": {}
  },
  {
    "uid": "817674",
    "code": "BIOL3272H",
    "subject": "BIOL",
    "number": "3272",
    "honors": true,
    "writing": false,
    "name": "Applied Biostatistics",
    "fullname": "Applied Biostatistics",
    "info": "Conceptual basis of statistical analysis. Statistical analysis of biological data. Data visualization, descriptive statistics, significance tests, experimental design, linear model, simple/multiple regression, general linear model. Lectures, computer lab.\n\nprereq: High school algebra; BIOL 2003 recommended.",
    "prereq": {
      "and": [
        "801426"
      ]
    }
  },
  {
    "uid": "005422",
    "code": "BIOL3961H",
    "subject": "BIOL",
    "number": "3961",
    "honors": true,
    "writing": false,
    "name": "Communicating in Biol Sci",
    "fullname": "Communicating in the Biological Sciences",
    "info": "Oral reports on topics of current interest to biologists. Progress reports on lab and field research by students.",
    "prereq": {}
  },
  {
    "uid": "804606",
    "code": "BIOL4951H",
    "subject": "BIOL",
    "number": "4951",
    "honors": true,
    "writing": false,
    "name": "Biol Thesis: Lit Review",
    "fullname": "Thesis Writing in the Biological Sciences: Developing the Literature Review",
    "info": "In the Fall semester of the two-semester capstone thesis support course, CBS honors students will develop and refine the literature review introduction component of the honors thesis. The course will focus on conceptualizing the gap in knowledge, drafting the literature review, and revising in response to peer and outside reader feedback. We will use the literature to unpack the conventions of authentic scientific writing so that students can begin to draft other sections of their thesis (methods, results narrative, publication ready figures, legends) By the end of the term, students will have developed and peer-workshopped at least one draft module of each data-related thesis section and they will have a revised version of the thesis introduction/literature review to deliver to their faculty research mentor for feedback before the start of the Spring term. \n\nStudents should be in a research lab and have started their research project before the start of the semester. Students who have not yet fulfilled an upper division WI course in the biological sciences should wait until the Spring (final) semester to register for their major's version of WI directed research or WI directed studies (for example, MicB 4794W or 4793W). The completed and approved thesis will count for the WI. ",
    "prereq": {}
  },
  {
    "uid": "808897",
    "code": "BIOL4961H",
    "subject": "BIOL",
    "number": "4961",
    "honors": true,
    "writing": false,
    "name": "Biol Thesis: Conveying Results",
    "fullname": "Thesis Writing in the Biological Sciences: Conveying and Contextualizing Results",
    "info": "In this second semester of the CBS thesis support course, honors students will continue work initiated Biol 4960H to develop/draft/revise results/methods/discussion sections of thier honors thesis. In addition, they will prepare and present a professional research poster at the University of Minnesota Undergraduate Research Symposium in April. The complete thesis will be assessed by two or three faculty readers against standards outlined in CBS Thesis Assessment Rubric.\n\nStudents who have not yet fulfilled an upper division WI course in the biological sciences should concurrently register for their major's version of WI directed research or WI directed studies (for example, MicB 4794W or 4793W). The completed and approved thesis will count for the WI. ",
    "prereq": {}
  }
]