[
  {
    "uid": "825343",
    "code": "CPSY3301H",
    "subject": "CPSY",
    "number": "3301",
    "honors": true,
    "writing": false,
    "name": "Honors Intro to Develop Psych",
    "fullname": "Honors Introduction to Developmental Psychology",
    "info": "Developmental psychology explores change and/ or stability as a function of age, with a focus on how early experiences affect later development across people's lives. This course examines development through the lenses of social, cultural, cognitive, biological, and learning theories by providing students with an overview of classic as well as current research and methodologies in developmental psychology. Students will gain an understanding of the usefulness of a developmental approach to psychological issues. The course focuses on conceptual understanding of different perspectives on healthy development across their life. This knowledge informs practical applications of how to help children, adolescents, and adults progress through developmental periods. \n\nThis course is intended for University Honors Program students both within and outside of the Developmental Psych/Early Childhood programs.",
    "prereq": {}
  },
  {
    "uid": "013724",
    "code": "CPSY3360H",
    "subject": "CPSY",
    "number": "3360",
    "honors": true,
    "writing": false,
    "name": "CPsy Hon Sem",
    "fullname": "Child Psychology Honors Seminar",
    "info": "Acquaints students with the various research projects and activities in the Institute for Child Development and in related departments. Faculty are invited to discuss their research projects with seminar participants.\n\nprereq: CPsy honors student",
    "prereq": {}
  },
  {
    "uid": "788759",
    "code": "CPSY4994V",
    "subject": "CPSY",
    "number": "4994",
    "honors": true,
    "writing": true,
    "name": "Dir Res in Child Psych(Honors)",
    "fullname": "Directed Research in Child Psychology (Honors Thesis)",
    "info": "Individual empirical investigation. Students help plan/implement scientific studies while gaining experience/expertise in research methodology.\n\nprereq: 4 cr in CPsy, CPsy honors, instr consent, dept consent",
    "prereq": {}
  }
]