[
  {
    "uid": "811072",
    "code": "CSCI1133H",
    "subject": "CSCI",
    "number": "1133",
    "honors": true,
    "writing": false,
    "name": "Honors Intro to Progr Concepts",
    "fullname": "Honors Introduction to Computing and Programming Concepts",
    "info": "Programming concepts using Python language. Real world problem solving, recursion, object-oriented programming. Algorithm development techniques. Abstractions/modularity. Optional honors topics: programming robots, programming paradigms, artificial intelligence.\n\nprereq: [concurrent registration is required (or allowed) in MATH 1271 or concurrent registration is required (or allowed) in MATH 1371 or concurrent registration is required (or allowed) in MATH 1571H], CSci majors, pre-majors in CSE/CLA, honors student",
    "prereq": {
      "or": [
        "003696"
      ]
    }
  },
  {
    "uid": "806618",
    "code": "CSCI1901H",
    "subject": "CSCI",
    "number": "1901",
    "honors": true,
    "writing": false,
    "name": "Honors Computer Programming",
    "fullname": "Honors Structure of Computer Programming",
    "info": "Key concepts in computer science: recursion, abstraction, modularity, data structures, algorithms, problem solving strategies. Programming languages Scheme and Python. More advanced computer topics as time permits.",
    "prereq": {}
  },
  {
    "uid": "816663",
    "code": "CSCI1933H",
    "subject": "CSCI",
    "number": "1933",
    "honors": true,
    "writing": false,
    "name": "HonorsIntro Algorithm Data Str",
    "fullname": "Honors Introduction to Algorithms and Data Structures",
    "info": "Advanced object oriented programming to implement abstract data types (stacks, queues, linked lists, hash tables, binary trees) using Java language. Inheritance. Searching/sorting algorithms. Basic algorithmic analysis. Use of software development tools. Weekly lab. Optional honors topics: Advanced Java topics, GUI programming, CS research examples.\n\nco-requisite: Calc I (Math 1271 or Math 1371 or Math 1571H)  \nprerequisite: CSCI 1133 OR CSCI 1133H and honors student",
    "prereq": {
      "or": [
        "811072"
      ]
    }
  },
  {
    "uid": "809449",
    "code": "CSCI2011H",
    "subject": "CSCI",
    "number": "2011",
    "honors": true,
    "writing": false,
    "name": "Honors Discrete Structures",
    "fullname": "Honors Discrete Structures of Computer Science",
    "info": "Foundations of discrete mathematics. Sets, sequences, functions, big-O, propositional/predicate logic, proof\nmethods, counting methods, recursion/recurrences, relations, trees/graph fundamentals.  Advanced topics in discrete structures as time permits.\n\nprereq: [MATH 1271 or MATH 1371 or MATH 1571H], honors student.",
    "prereq": {
      "or": [
        "003696"
      ]
    }
  },
  {
    "uid": "826281",
    "code": "CSCI3901H",
    "subject": "CSCI",
    "number": "3901",
    "honors": true,
    "writing": false,
    "name": "Intro Undergrad Research in CS",
    "fullname": "Introduction to Undergraduate Research in Computer Science",
    "info": "This seminar will prepare students to engage in undergraduate research in computer science by introducing and exploring the cycle involved in academic research. Students will learn how to access, read and evaluate credible literature, develop a research problem and hypothesis, select an appropriate methodology, and how to write a short research proposal. Students will engage with departmental research faculty through research talks and will explore and apply for research programs that are available (e.g. URGO, McNair, DREU.) Students will know what research entails, how it is performed, and why it can enhance an undergraduate experience.",
    "prereq": {}
  },
  {
    "uid": "809647",
    "code": "CSCI4041H",
    "subject": "CSCI",
    "number": "4041",
    "honors": true,
    "writing": false,
    "name": "Algs. & Data Str.",
    "fullname": "Algorithms and Data Structures",
    "info": "Rigorous analysis of algorithms/implementation. Algorithm analysis, sorting algorithms, binary trees, heaps, priority queues, heapsort, balanced binary search trees, AVL trees, hash tables/hashing, graphs, graph traversal, single source shortest path, minimum cost spanning trees.\n\nprereq: [(1913 or 1933) and 2011, honors student] or instr consent. Cannot be taken for Grad CSci cr",
    "prereq": {
      "or": [
        {
          "or": [
            "816663"
          ]
        },
        "809449"
      ]
    }
  },
  {
    "uid": "805148",
    "code": "CSCI4994H",
    "subject": "CSCI",
    "number": "4994",
    "honors": true,
    "writing": false,
    "name": "Honors Thesis",
    "fullname": "Honors Thesis",
    "info": "Research work for an honors thesis arranged with a CS faculty member who is the adviser or coadviser.\n\nprereq: Honors student, instr consent",
    "prereq": {}
  }
]