[
  {
    "uid": "016309",
    "code": "ENGL1001V",
    "subject": "ENGL",
    "number": "1001",
    "honors": true,
    "writing": true,
    "name": "Honors: Intro to Literature",
    "fullname": "Introduction to Literature: Poetry, Drama, Narrative",
    "info": "Techniques for analyzing/understanding literature. Readings of novels, short stories, poems, plays.\n\nprereq: Honors or instr consent",
    "prereq": {}
  },
  {
    "uid": "800686",
    "code": "ENGL1021V",
    "subject": "ENGL",
    "number": "1021",
    "honors": true,
    "writing": true,
    "name": "Introduction to the Essay",
    "fullname": "Introduction to the Essay",
    "info": "Choices academic writers make based on audience, purpose, and context. Emphasizes effective use of University Libraries, including locating, evaluating, and using scholarly sources. Reading/writing assignments to extend/clarify arguments and improve control over writing. Selecting/limiting topics. Revision.",
    "prereq": {}
  },
  {
    "uid": "016310",
    "code": "ENGL1181V",
    "subject": "ENGL",
    "number": "1181",
    "honors": true,
    "writing": true,
    "name": "H: Intr to Shakespeare",
    "fullname": "Honors: Introduction to Shakespeare",
    "info": "Survey of Shakespeare's work, treating approximately 10 plays. Lecture.",
    "prereq": {}
  },
  {
    "uid": "016311",
    "code": "ENGL1201V",
    "subject": "ENGL",
    "number": "1201",
    "honors": true,
    "writing": true,
    "name": "Honors: Contemp Amer Lit",
    "fullname": "Honors: Contemporary American Literature",
    "info": "Chronologically/thematically based readings from American literature. Approaches to literary analysis/criticism. Social/historical contexts of authorship/reading, literary artistry/conventions. Discussion, writing.",
    "prereq": {}
  },
  {
    "uid": "016312",
    "code": "ENGL1301V",
    "subject": "ENGL",
    "number": "1301",
    "honors": true,
    "writing": true,
    "name": "H: Mlticltural Lits of the US",
    "fullname": "Honors: Introduction to Multicultural Literatures of the United States",
    "info": "Representative works by African American, American Indian, Asian American, and Chicano/Chicana writers, chiefly from 20th century. Social/cultural factors in America's literary past/present.",
    "prereq": {}
  },
  {
    "uid": "016321",
    "code": "ENGL1401V",
    "subject": "ENGL",
    "number": "1401",
    "honors": true,
    "writing": true,
    "name": "Honors: Intro to World Lit",
    "fullname": "Honors: Introduction to World Literatures in English",
    "info": "Diverse works produced in English outside the United States and Britain. Works represent different cultures, but treat concerns derived from common post-colonial legacy.",
    "prereq": {}
  },
  {
    "uid": "795913",
    "code": "ENGL1701H",
    "subject": "ENGL",
    "number": "1701",
    "honors": true,
    "writing": false,
    "name": "Honors: Modern Fiction",
    "fullname": "Honors: Modern Fiction",
    "info": "In Modern Fiction, we will study a selection of novels and short stories by some of the most compelling and original writers of our time. We will read work by contemporary authors and classic modernists whose stylistic innovations influenced a generation. Because literature is a continuum in which the present responds to the past, we'll note evolutions and developments in the genre over time. We will identify and analyze such elements of fiction as theme, genre, structure, form, language, and context.\n\nprereq: Honors or instr consent",
    "prereq": {}
  },
  {
    "uid": "016322",
    "code": "ENGL3001V",
    "subject": "ENGL",
    "number": "3001",
    "honors": true,
    "writing": true,
    "name": "Honors: Text Analysis: Methods",
    "fullname": "Honors: Textual Analysis: Methods",
    "info": "This course is designed for English majors and minors, as well any students interested in and attracted to literature and reading.  Our concern will be to develop the intellectual foundations to move past our base, instinctive reactions to literature to deeper modes of reading, interpretation, and written analysis/argument.  Our goal will be to develop the skills of slow-motion, skeptical reading: to savor the crafting of literary form and to explore how literary rhetoric engages our intellect and emotions; to read not simply for superficial content, but to engage and question the multi-faceted operation of literary texts.\n\nIn terms of foundational writing skills for the English major, we will work on the development of compelling written literary arguments by breaking the writing process down into various phases.   We will work with the basics of argumentation: developing a strong, coherent thesis, drafting, the logic of argument, revision, proper citation and effective use of primary and secondary sources, and more. \n\nprereq: Honors, [English major or minor or approved BIS or IDIM program with English area]",
    "prereq": {}
  },
  {
    "uid": "016542",
    "code": "ENGL3002H",
    "subject": "ENGL",
    "number": "3002",
    "honors": true,
    "writing": false,
    "name": "Honors: Mod Lit Crit & Theory",
    "fullname": "Honors: Modern Literary Criticism and Theory",
    "info": "Problems of interpretation/criticism. Questions of meaning, form, authority, literary history, social significance.\n\nprereq: Honors or instr consent",
    "prereq": {}
  },
  {
    "uid": "800461",
    "code": "ENGL3005V",
    "subject": "ENGL",
    "number": "3005",
    "honors": true,
    "writing": true,
    "name": "Honors: Survey Am Lit I",
    "fullname": "Honors: Survey of American Literature I",
    "info": "Readings in American literature, from first European contact, through colonial times, to mid-19th century. Texts in several genres by diverse authors. Classics, less familiar works. Historical, social, and aesthetic contexts.",
    "prereq": {}
  },
  {
    "uid": "813640",
    "code": "ENGL3006V",
    "subject": "ENGL",
    "number": "3006",
    "honors": true,
    "writing": true,
    "name": "Honors: Survey American Lit II",
    "fullname": "Honors: Survey of American Literatures and Cultures II",
    "info": "This course will survey some of the major literary figures, aesthetic movements, and thematic concerns of US literature from the Civil War to the present. Our investigation will identify common traits in the literature that causes it to fit within three very broad literary historical categories: realism, modernism, and postmodernism. We will explore what makes literature created by the people of the United States distinctly \"American\" during a period that extends from the Civil War and the outlawing of slavery to women's suffrage, workers' movements, the Great Depression, the First and Second World Wars, and the civil rights movement. In addition to reading and analyzing the literature itself in terms of style, form, genre, and language, we will study it in historical context: the complex interplay between the political, the social, the cultural, and the literary in the United States. This approach rests upon the notion that literature is not created in a vacuum; it is influenced by and influences the world in which it is created.",
    "prereq": {}
  },
  {
    "uid": "016543",
    "code": "ENGL3007H",
    "subject": "ENGL",
    "number": "3007",
    "honors": true,
    "writing": false,
    "name": "Honors: Shakespeare",
    "fullname": "Honors: Shakespeare",
    "info": "From Taylor Swift to Greta Gerwig, from Toni Morrison to Nelson Mandela, Shakespeare's works have continued to influence and inspire authors, artists, and audiences around the globe. In this upper division course, you will study representative works of Shakespeare from a variety of cultural perspectives, as texts that have had a long and enduring vitality well beyond their historical context. This course tracks the history of Shakespeare’s plays across time, in various artistic forms including art, music, film, and social media, looking at the ways these literary works have responded to issues of gender, race, sexuality, religion, disability, and class.\n\nEnglish majors/minors must take this course A-F only grading basis.",
    "prereq": {}
  },
  {
    "uid": "804913",
    "code": "ENGL3008H",
    "subject": "ENGL",
    "number": "3008",
    "honors": true,
    "writing": false,
    "name": "In and Out of the Archives",
    "fullname": "Research in English: In and Out of the Archives",
    "info": "Social/textual relationships. How to craft revealing questions and assess information. Modes of inquiry. Collections/communities. Written assignments, discussion. Archival materials in print, oral, digital, and visual forms.\n\nprereq: [CLA honors, [English major or English minor or BIS/IDIM English]] or instr consent",
    "prereq": {}
  },
  {
    "uid": "791277",
    "code": "ENGL3010H",
    "subject": "ENGL",
    "number": "3010",
    "honors": true,
    "writing": false,
    "name": "Honors: Studies In Poetry",
    "fullname": "Honors: Studies in Poetry",
    "info": "Special topics related to reading poetry in various interpretive contexts.\n\nprereq: Honors or instr consent",
    "prereq": {}
  },
  {
    "uid": "016166",
    "code": "ENGL3020H",
    "subject": "ENGL",
    "number": "3020",
    "honors": true,
    "writing": false,
    "name": "Honors: Narrative",
    "fullname": "Honors: Studies in Narrative",
    "info": "Issues related to reading/understanding narrative in various interpretive contexts. Topics may include nineteenth-century English (American, Anglophone) novel, narrative, or techniques of the novel. Topics specified in Class Schedule.\n\nprereq: honors student",
    "prereq": {}
  },
  {
    "uid": "808524",
    "code": "ENGL3023H",
    "subject": "ENGL",
    "number": "3023",
    "honors": true,
    "writing": false,
    "name": "Honors: Children's Literature",
    "fullname": "Honors: Children's Literature",
    "info": "Range of children's literature, from classic fairy tales such as Little Red Riding Hood to contemporary texts such as Harry Potter and the Sorcerer's Stone.\n\nprereq: Honors",
    "prereq": {}
  },
  {
    "uid": "791266",
    "code": "ENGL3030H",
    "subject": "ENGL",
    "number": "3030",
    "honors": true,
    "writing": false,
    "name": "Honors: Studies in Drama",
    "fullname": "Honors: Studies in Drama",
    "info": "Topics may include English Renaissance tragedy, English\nRestoration, and 18th century American drama by writers of color. Single-author courses focus on writers such as Tennessee Williams and Eugene O'Neill, issues/themes such as gender, and performance.",
    "prereq": {}
  },
  {
    "uid": "795914",
    "code": "ENGL3040H",
    "subject": "ENGL",
    "number": "3040",
    "honors": true,
    "writing": false,
    "name": "Honors: Studies in Film",
    "fullname": "Honors: Studies in Film",
    "info": "Topics regarding film in various interpretive contexts. Range and historic development of American, English, and Anglophone film.",
    "prereq": {}
  },
  {
    "uid": "797978",
    "code": "ENGL3090H",
    "subject": "ENGL",
    "number": "3090",
    "honors": true,
    "writing": false,
    "name": "Honors: General Topics",
    "fullname": "Honors: General Topics",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "789872",
    "code": "ENGL3121H",
    "subject": "ENGL",
    "number": "3121",
    "honors": true,
    "writing": false,
    "name": "Honors: Tudor England",
    "fullname": "Tudor England: 16th-Century Literature and Culture",
    "info": "Major/representative works of Renaissance (1485-1660). Typical authors: More, Sidney, Spenser, Donne, Milton.",
    "prereq": {}
  },
  {
    "uid": "801332",
    "code": "ENGL3133H",
    "subject": "ENGL",
    "number": "3133",
    "honors": true,
    "writing": false,
    "name": "Honors: Stuart England",
    "fullname": "Honors: Stuart England: 17th-Century Literature and Culture",
    "info": "Major/representative works of Restoration and 18th Century (1660-1798). Typical authors: Dryden, Pope, Swift, Johnson, Boswell, Fielding.",
    "prereq": {}
  },
  {
    "uid": "802247",
    "code": "ENGL3134H",
    "subject": "ENGL",
    "number": "3134",
    "honors": true,
    "writing": false,
    "name": "Honors: Milton & Revolution",
    "fullname": "Honors: Milton and the Century of Revolution",
    "info": "Milton's prose/minor poems from the Revolution (1641-60). Post-revolutionary works (Paradise Lost, Samson Agonistes).  Emphasizes Milton's lifelong effort to bring about reform (\"change\").\n\nprereq: Honors or instr consent",
    "prereq": {}
  },
  {
    "uid": "791380",
    "code": "ENGL3161H",
    "subject": "ENGL",
    "number": "3161",
    "honors": true,
    "writing": false,
    "name": "Honors: Victorian Literatures",
    "fullname": "Honors: Victorian Literatures and Cultures",
    "info": "The literature of the British Victorian period (1832-1901) in relation to its cultural and historical contexts. Typical authors include Tennyson, the Brownings, Dickens, Arnold, Hopkins, and the Brontes.",
    "prereq": {}
  },
  {
    "uid": "816336",
    "code": "ENGL3171H",
    "subject": "ENGL",
    "number": "3171",
    "honors": true,
    "writing": false,
    "name": "Honors: Modern British Lit",
    "fullname": "Honors: Modern British Literatures and Cultures",
    "info": "Survey of principal writers, intellectual currents, conventions, genres and themes in Britain from 1950 to the present. Typically included are Beckett, Golding, Kingsley and Martin Amis, Murdoch, Larkin, Hughes, Heaney, Lessing, Shaffer, Stoppard, Fowles, and Drabble.",
    "prereq": {}
  },
  {
    "uid": "794368",
    "code": "ENGL3180H",
    "subject": "ENGL",
    "number": "3180",
    "honors": true,
    "writing": false,
    "name": "Honors: Contemp Lit",
    "fullname": "Honors: Contemporary Literatures and Cultures",
    "info": "Issues related to reading/understanding British, American, and Anglophone fiction/poetry in various interpretive contexts.",
    "prereq": {}
  },
  {
    "uid": "802912",
    "code": "ENGL3222H",
    "subject": "ENGL",
    "number": "3222",
    "honors": true,
    "writing": false,
    "name": "Honors: American Novel 1900",
    "fullname": "Honors: American Novel from 1900",
    "info": "Novels from early 1900s realism through Modernists (e.g., Faulkner, Hemingway, Fitzgerald) to recent writers (e.g., Ellison, Bellow, Erdrich, Pynchon). Stylistic experiments, emergence of voices from under-represented groups. Novelists' responses to a technologically changing society.",
    "prereq": {}
  },
  {
    "uid": "794036",
    "code": "ENGL3231H",
    "subject": "ENGL",
    "number": "3231",
    "honors": true,
    "writing": false,
    "name": "Honors: American Drama",
    "fullname": "Honors: American Drama",
    "info": "Representative dramas, from 18th through 20th centuries. Staging of national identities, aesthetics of modern/contemporary drama. Production concerns of mainstream, regional, and community theaters.",
    "prereq": {}
  },
  {
    "uid": "800462",
    "code": "ENGL3300H",
    "subject": "ENGL",
    "number": "3300",
    "honors": true,
    "writing": false,
    "name": "Honors: Multi Am Lits",
    "fullname": "Honors: Multicultural American Literatures and Cultures",
    "info": "Writings of specific ethnic groups. Emphasizes historical or cultural context. Topics may include American minority drama, Harlem Renaissance, Asian-American literature/film, African-American women writers. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "016544",
    "code": "ENGL3350H",
    "subject": "ENGL",
    "number": "3350",
    "honors": true,
    "writing": false,
    "name": "Honors: Women Writers",
    "fullname": "Honors: Women Writers",
    "info": "Women writers in the 19th and/or 20th centuries. Will focus either on writers from a single country or be comparative in nature. The course will be organized thematically or according to topics of contemporary and theoretical interest.",
    "prereq": {}
  },
  {
    "uid": "808523",
    "code": "ENGL3352H",
    "subject": "ENGL",
    "number": "3352",
    "honors": true,
    "writing": false,
    "name": "Honors: Weird Books by Women",
    "fullname": "Honors: Weird Books by Women",
    "info": "Weirdness as non-normativity that creates discomfort. Weirdness as incestuous creepiness, dissociation, hysteria, paranoia. Weirdness as identifying, but not wanting to, with a twisted reality. Weirdness created through experimental text, form, and narrative.",
    "prereq": {}
  },
  {
    "uid": "802913",
    "code": "ENGL3400H",
    "subject": "ENGL",
    "number": "3400",
    "honors": true,
    "writing": false,
    "name": "Honors: Post-Colonial Lit",
    "fullname": "Honors: Post-Colonial Literatures",
    "info": "Varied topics in post-Colonial literatures. Typical figures include novelists Chinua Achebe, Tsitsi Dangaremba, Fadia Faqir, and Salman Rushdie; filmmaker Kidlat Tahimik; and \"dub\" poets Mutabaruka and Jean Binta Breeze.",
    "prereq": {}
  },
  {
    "uid": "016396",
    "code": "ENGL3882V",
    "subject": "ENGL",
    "number": "3882",
    "honors": true,
    "writing": true,
    "name": "Honors: Senior Paper",
    "fullname": "Honors: Senior Paper",
    "info": "Senior paper.",
    "prereq": {}
  },
  {
    "uid": "014213",
    "code": "ENGL3883V",
    "subject": "ENGL",
    "number": "3883",
    "honors": true,
    "writing": true,
    "name": "Honors Thesis",
    "fullname": "Honors Thesis",
    "info": "See guidelines available from English honors adviser.\nPrereq-Honors candidacy in English, consent of English honors advisor.",
    "prereq": {}
  },
  {
    "uid": "825342",
    "code": "ENGL3885V",
    "subject": "ENGL",
    "number": "3885",
    "honors": true,
    "writing": true,
    "name": "Honors Capstone Sem in English",
    "fullname": "Honors Capstone Seminar in English",
    "info": "Honors students who wish to graduate magna cum laude or cum laude write an Honors thesis, 13-17 pages in length, in ENGL or ENGW 3885V that contains substantive and original analytical insights. Students must discuss their plans with their instructor by the end of the second week of the term. Student and instructor must decide together what additional or enriched work will be required to have the capstone paper count as an honors thesis. Examples of such work include covering the topic in greater depth, using primary sources more robustly, or incorporating more creativity, more synthesis, and/or advanced analysis. Consult with your honors adviser for more details. \n\nThis course also functions as a capstone experience that fulfills many of the Student Learning Outcomes for the English major. In this rigorous and intensive seminar, students receive instruction on writing this paper from tenured and tenure-track faculty in English. Students learn how to choose a topic and formulate a research question, conduct primary and secondary research, and produce a written document that incorporates research and analysis. Faculty teach students to produce an extended, scholarly essay though discussions of method, research, and development; instruction in specific writing techniques; workshopping and revising drafts; solving problems; and creating a coherent and elegant final product. While the subjects about which students write vary depending on student interest and faculty expertise, at least 50% of the course grade is determined by students? writing performance. Most students fulfill the senior paper requirement with a traditional seminar paper, but students sometimes complete alternative projects, such as blogs, analytic projects that incorporate creative or personal elements, collaborative projects, or projects that involve the creation of a podcast, video, web site, or some other means of documenting student learning and writing skills. \n\nPrerequisites for Admission: Honors, Admission to ENGL 3885V also requires English major status and completion of a Critical Theories and Methods course (ENGL 3001W, ENGL 3002, ENGL 4003) or approved transfer course with a minimum grade of C-minus. Priority will be given to students with senior status who have completed the majority of the major requirements, as well as to students who plan to graduate in the term they are requesting to take the senior seminar.",
    "prereq": {}
  }
]