[
  {
    "uid": "825162",
    "code": "ENGW1101V",
    "subject": "ENGW",
    "number": "1101",
    "honors": true,
    "writing": true,
    "name": "Honors Intro to Creative Writ",
    "fullname": "Honors Introduction to Creative Writing",
    "info": "In this course, we will explore the fundamentals of creative writing. We will start by looking at the building blocks of good imaginative writing: image, voice, character, setting, story, and revision. We will then move on to a more in-depth examination of three forms: literary nonfiction, fiction, and poetry. Students will learn how to read as writers, obtain an understanding and appreciation for imaginative writing, and gain a sense of themselves as creative writers. We will be trying many exercises and assignments, from brainstorming experiments to final drafts, so come ready to write.\n\nSince this is an Honors course, it is designed to be challenging and to immerse students in the literary landscape. The literary citizenship requirement will take students beyond the normal classroom environment and into the community to attend and respond to readings. We will also supplement the textbook with classroom visits and additional readings by the most exciting and innovative poets, fiction writers, and creative nonfiction writers working today. Students will also contribute to the course readings by presenting a poem of their choosing to the class, explaining its techniques and importance. This will tie in with larger discussions of what works gain popular and academic attention and how this happens, including investigations of the role of anthologies and social media.\n",
    "prereq": {}
  },
  {
    "uid": "788918",
    "code": "ENGW3110H",
    "subject": "ENGW",
    "number": "3110",
    "honors": true,
    "writing": false,
    "name": "Topics in Creative Writing",
    "fullname": "Topics in Creative Writing",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "825341",
    "code": "ENGW3885V",
    "subject": "ENGW",
    "number": "3885",
    "honors": true,
    "writing": true,
    "name": "Honors Capstone Creative Writ",
    "fullname": "Honors Capstone Seminar in Creative Writing",
    "info": "Honors students who wish to graduate magna cum laude or cum laude write an Honors thesis, 13-17 pages in length, in ENGL or ENGW 3885V that contains substantive and original analytical insights. Students must discuss their plans with their instructor by the end of the second week of the term. Student and instructor must decide together what additional or enriched work will be required to have the capstone paper count as an honors thesis. Examples of such work include covering the topic in greater depth, using primary sources more robustly, or incorporating more creativity, more synthesis, and/or advanced analysis. Consult with your honors adviser for more details. \n\nThis course also functions as a capstone experience for the English major and the Creative Writing minor. To graduate with a BA in English, students with an interest in creative writing may choose to produce a substantial manuscript of poetry, literary fiction, or literary nonfiction rather than an extended, scholarly essay. In this advanced creative writing workshop, students receive instruction on writing this manuscript from tenured and tenure-track faculty in English. Class sessions typically include in-class writing exercises, which are then expanded into more finished works of poetry or prose reviewed by the faculty and discussed in workshops by the students themselves. Writing exercises and assignments lead, at the end of the semester, to a finished, thoroughly revised manuscript. Faculty teach students to produce a significant body of poetry, fiction, or creative nonfiction though discussions of method, craft, and development; instruction in specific writing techniques; workshopping and revising drafts; solving problems; and creating a coherent and elegant final product. While the subjects about which students write vary depending on student interest and faculty expertise, at least 50 percent of the course grade is determined by students' writing performance. \n\nPrerequisites for Admission: (1) Honors candidacy in English, (2) English major status and completion of a Critical Theories and Methods course (ENGL 3001W, ENGL 3002, ENGL 4003) or approved transfer course with a minimum grade of C-minus, (3) completion of at least six credits of creative writing courses, including one intermediate (ENGW 3xxx-level) or advanced creative writing workshop, preferably in the genre of the ENGW 3885V workshop to which you are applying; and (4) submission of a creative writing sample. Admission is by permission of the instructor. Priority will be given to students with senior status who have completed the majority of the major requirements, as well as to students who plan to graduate in the term they are requesting to take the senior seminar.",
    "prereq": {}
  }
]