[
  {
    "uid": "801648",
    "code": "MGMT1001H",
    "subject": "MGMT",
    "number": "1001",
    "honors": true,
    "writing": false,
    "name": "Honors:Contemporary Management",
    "fullname": "Honors: Contemporary Management",
    "info": "How/why organizations differ in their forms/purposes in relation to complex/changing environments/technologies. Challenges related to international management and social responsibility. Models of effective leadership/teamwork.\n\nprereq: [Fr or soph] honors",
    "prereq": {}
  },
  {
    "uid": "792612",
    "code": "MGMT3033V",
    "subject": "MGMT",
    "number": "3033",
    "honors": true,
    "writing": true,
    "name": "Honors: Business Communication",
    "fullname": "Honors: Business Communication",
    "info": "Written/oral communication skills for organizations. Communication technology. Cases, simulations of real-world situations. Small groups meet with instructor three times for presentation coaching. Recitation times are arranged.",
    "prereq": {}
  },
  {
    "uid": "793666",
    "code": "MGMT3040H",
    "subject": "MGMT",
    "number": "3040",
    "honors": true,
    "writing": false,
    "name": "Honors:  Int'l Env. of Firms",
    "fullname": "Honors: Understanding the International Environment of Firms, International Business",
    "info": "Theories, frameworks, tools, and facts for understanding the environment of firms in international competition. Main world-level economic flows (trade, investment, finance). How country-/industry-level economic, political, and socio-cultural factors influence behavior/functions of firms in international competition.",
    "prereq": {}
  },
  {
    "uid": "792633",
    "code": "MGMT4004V",
    "subject": "MGMT",
    "number": "4004",
    "honors": true,
    "writing": true,
    "name": "Honors:  Business Policy",
    "fullname": "Honors: Business Policy: Strategy Formulation and Implementation",
    "info": "Integrative perspective on overall direction of enterprise. Choice of products/markets, selection of organizaton structures and management styles. Case analysis: identifying key issues, evaluating options, and making recommendations, under conditions of uncertainty and incomplete information.",
    "prereq": {}
  }
]