[
  {
    "uid": "005517",
    "code": "POL1001H",
    "subject": "POL",
    "number": "1001",
    "honors": true,
    "writing": false,
    "name": "Hon: Amer Govt & Politics",
    "fullname": "Honors Course: American Democracy in a Changing World",
    "info": "This course is intended to introduce students to the expressed hopes of the American people for their government and to the institutions and processes that have been created and recreated to achieve these hopes. The course is designed to help students understand what liberal education is by engaging in the study of American politics as a fundamentally critical and creative enterprise, and by grappling with the most complex and challenging problems of political life, such as the sources of political equality and inequality, and the tension between individual aspirations and political control.  Questions of power and choice, opportunity and discrimination, freedom and restrictions on freedom are fundamental to the historical development of and current controversies within the American political system, and we will attend to all of these. \n\nWe will explore topics including the ideas underlying the nation’s founding and its constitutional foundations; civil rights and civil liberties; the role of the United States in an increasingly globalized world; the structure and function of American political institutions; and the behavior of American citizens in the political process. \n\nIn addition, we will learn to think and communicate like political scientists.  We will read primary documents, such as the Federalist papers, engage with scholarly arguments about the way the American political system works, and critically evaluate critiques of the American political system that have been offered from a variety of perspectives. \n\nBy the end of the semester students should have a basic understanding of the structure and function of American government as well as an increased ability to critically reflect on the degree to which our institutions, processes, and citizens live up to the expectations placed on them.  Students will be able to identify, define, and solve problems and to locate and critically evaluate information.  Students will have mastered a body of knowledge and a mode of inquiry.  This course fulfills the liberal education requirements for the Social Sciences Core.\n",
    "prereq": {}
  },
  {
    "uid": "811503",
    "code": "POL1025H",
    "subject": "POL",
    "number": "1025",
    "honors": true,
    "writing": false,
    "name": "Honors: Global Politics",
    "fullname": "Honors: Global Politics",
    "info": "Introduction to international relations/issues in contemporary world affairs. War, peace, nuclear proliferation. Politics of humanitarian intervention. Global monetary/trading systems. Activities of international institutions/non-governmental organizations.\n\nprereq: Honors student",
    "prereq": {}
  },
  {
    "uid": "798738",
    "code": "POL1054H",
    "subject": "POL",
    "number": "1054",
    "honors": true,
    "writing": false,
    "name": "Honors: Puzzles in World Pol.",
    "fullname": "Honors: Puzzles in World Politics",
    "info": "Political life. Repression, democracy, rights, corruption, gender, political change. Guest lectures by political science professors who are experts on different parts of world.\n\nprereq: Honors student",
    "prereq": {}
  },
  {
    "uid": "788184",
    "code": "POL1902H",
    "subject": "POL",
    "number": "1902",
    "honors": true,
    "writing": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "800851",
    "code": "POL1903H",
    "subject": "POL",
    "number": "1903",
    "honors": true,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "798739",
    "code": "POL3085H",
    "subject": "POL",
    "number": "3085",
    "honors": true,
    "writing": false,
    "name": "Honors: Quantitative Analysis",
    "fullname": "Honors Course: Quantitative Analysis in Political Science",
    "info": "POL 3085 teaches students how to study politics scientifically and introduces them to how to use quantitative analysis to answer political questions. The first part of the class covers how to formulate a theory (a possible answer to a question), specify testable hypotheses (what you would see if the theory is correct or incorrect), and set up a research design to test those hypotheses. In the second part of the class, we cover quantitative data analysis, beginning from preliminary statistical analysis to multivariate linear regression. There is no mathematical or statistical background required for this course. By the end of the class, students should be able to ask and answer political questions using quantitative data and fluently evaluate statistical analyses of political phenomena in the media and many academic articles. prereq: Honors student",
    "prereq": {}
  },
  {
    "uid": "807642",
    "code": "POL3108H",
    "subject": "POL",
    "number": "3108",
    "honors": true,
    "writing": false,
    "name": "Thesis Prep & PolSci Inquiry",
    "fullname": "Honors Tutorial: Thesis Preparation and Political Science Inquiry",
    "info": "In this course, students will improve their research skills in preparation to write their senior theses.  Students will enter with a few ideas for topics about which they might like to write their theses. They will leave the class with a clear and tractable research question, a literature review that describes how this question fits in with the existing scholarly literature, and a research design that will enable them to answer the question. Along the way, they will advance their understanding of what constitutes political science research and how to conduct political science research.\n\nStudents will be graded on the basis of drafts of their annotated bibliography, literature review and research design, a class presentation of the “front half” of their senior thesis, and class participation including short weekly assignments.  Students are expected to keep up with the reading and, most importantly, to begin to conduct their own independent research.\n\nprereq: Pol sci major, honors",
    "prereq": {}
  },
  {
    "uid": "007461",
    "code": "POL3109H",
    "subject": "POL",
    "number": "3109",
    "honors": true,
    "writing": false,
    "name": "Honors Seminar",
    "fullname": "Honors Course: Researching Politics",
    "info": "Give students a start on their honor theses. Research design, methods of data collection/analysis, strategies for scholarly writing. Meets each spring.",
    "prereq": {}
  },
  {
    "uid": "007462",
    "code": "POL3110H",
    "subject": "POL",
    "number": "3110",
    "honors": true,
    "writing": false,
    "name": "Honors Thesis",
    "fullname": "Honors Thesis Credits",
    "info": "Individual research/writing of departmental honors thesis.\n\nprereq: 3109, pol sci, honors, dept consent",
    "prereq": {
      "or": [
        "007461"
      ]
    }
  },
  {
    "uid": "804133",
    "code": "POL3310H",
    "subject": "POL",
    "number": "3310",
    "honors": true,
    "writing": false,
    "name": "Topics in American Politics",
    "fullname": "Topics in American Politics",
    "info": "Topics in American politics.",
    "prereq": {}
  },
  {
    "uid": "813766",
    "code": "POL3481H",
    "subject": "POL",
    "number": "3481",
    "honors": true,
    "writing": false,
    "name": "Comparative Political Economy",
    "fullname": "Comparative Political Economy: Governments and Markets",
    "info": "This course analyzes the compatibility of democracy and markets-whether democratic institutions undermine (enhance) the workings of market institutions and vice versa. Competing theoretical perspectives in political economy are critically evaluated. And the experiences of countries with different forms of democratic market systems are studied. Among the topics singled out for in-depth investigation are the economics of voting, producer group politics, the politics of monetary and fiscal policy, political business cycles, and trade politics.",
    "prereq": {}
  },
  {
    "uid": "808172",
    "code": "POL3785H",
    "subject": "POL",
    "number": "3785",
    "honors": true,
    "writing": false,
    "name": "Political Propaganda",
    "fullname": "Persuasion and Political Propaganda",
    "info": "Persuasion theories relevant to designing effective political propaganda. Applying theories to analyze WWI/WWII propaganda posters, films, and political campaign commercials. Use of fiction as propaganda tool.",
    "prereq": {}
  },
  {
    "uid": "800661",
    "code": "POL3873V",
    "subject": "POL",
    "number": "3873",
    "honors": true,
    "writing": true,
    "name": "Global Citizen&Internatl Ethic",
    "fullname": "Global Citizenship and International Ethics",
    "info": "Case studies of ethics in intervention, war, weapons, foreign aid, environmental practices, and human rights are used to examine global ethical responsibilities of individual citizens and public officials. Effectiveness of transnational social movements in influencing policy at domestic/international levels.",
    "prereq": {}
  }
]