[
  {
    "uid": "003009",
    "code": "SOC1011V",
    "subject": "SOC",
    "number": "1011",
    "honors": true,
    "writing": true,
    "name": "Honors: Intro to Sociology",
    "fullname": "Honors: Introduction to Sociology",
    "info": "This course is designed to introduce you to the study of society and what sociologists call the \"sociological imagination:\" a way of viewing the events, relationships, and social phenomena that shape our individual lives and much of our collective experience. Through the course we will examine some of the central concepts and problems that have preoccupied both classical and contemporary sociologists and gain a sense of how the sociological imagination can illuminate the social forces that have a concrete impact on our everyday lives. Throughout the course you will be asked to consider the ways in which society affects your life and how you, in turn, affect society.",
    "prereq": {}
  },
  {
    "uid": "800698",
    "code": "SOC1902H",
    "subject": "SOC",
    "number": "1902",
    "honors": true,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "810720",
    "code": "SOC3101H",
    "subject": "SOC",
    "number": "3101",
    "honors": true,
    "writing": false,
    "name": "Honors: Persp Crim Justice Sys",
    "fullname": "Honors: Sociological Perspectives on the Criminal Justice System",
    "info": "This course introduces students to a sociological account of the U.S. criminal justice system. We will critically examine the components, dynamics, and effects of policing, criminal courts, community supervision, jails, and prisons. Throughout the course, we focus on sociological understandings of these processes, with particular attention to ethnic, racial, class, and gender inequalities as well as long-term problems associated with the high rate of criminal justice supervision in the U.S.\n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session. Examples of additional requirements may include:\n·   Honor students will be expected to interview a current Sociology graduate student working on a LCD topic. Following this, each student will individually be expected to do an in-class power-point presentation explaining how the interviewees? research relates with themes presented in the course. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2 page maximum reflective paper.\n\nprereq: [SOC 1001] recommended, Sociology majors/minors must register A-F, honors",
    "prereq": {}
  },
  {
    "uid": "812791",
    "code": "SOC3412H",
    "subject": "SOC",
    "number": "3412",
    "honors": true,
    "writing": false,
    "name": "Honors: Social Networking",
    "fullname": "Honors: Social Networking: Theories and Methods",
    "info": "Network analysis spans a diverse range of phenomena from ego-centric ties, to small work-team sociograms, to organizational relations, to trade and military alliances among nation states. This course introduces undergraduate students to theories and methods for studying social networks, the ties connecting people, groups, and organizations. Topics include friendship, communication, small group, health, sexual and romantic, corporate, social movement, public policy, innovation diffusion, criminal and terrorist, and Internet networks. Honors students are expected to demonstrate greater depth of discussion, depth and to a degree length of writing assignments, presentations, and leadership of the students.\n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \nExamples of additional requirements may include:\n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper \n    exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a \n    class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2 \n    page maximum reflective paper.\n·   Interview a current Sociology graduate student and present briefly in class or write a \n    reflective piece, not more than 2 pages in length, to be submitted to the Professor. \n\nprereq: [SOC 1001] recommended, Sociology majors/minors must register A-F, honors",
    "prereq": {}
  },
  {
    "uid": "810628",
    "code": "SOC3451V",
    "subject": "SOC",
    "number": "3451",
    "honors": true,
    "writing": true,
    "name": "Honors: Cities & Social Change",
    "fullname": "Honors: Cities & Social Change",
    "info": "The core themes of this class will provide an essential toolkit for approaching broad questions about social justice, culture, work, housing and service provision on multiple levels and across the globe. This course will have units on economic development, inequality, the interaction between design and human action, inclusive and exclusive cultural formations, crime and cultures of fear, social control and surveillance.\n\nprereq: 1001 recommended, Soc majors/minors must register A-F",
    "prereq": {}
  },
  {
    "uid": "811599",
    "code": "SOC3503H",
    "subject": "SOC",
    "number": "3503",
    "honors": true,
    "writing": false,
    "name": "Honors: Asian Am Identities",
    "fullname": "Honors: Asian American Identities, Families & Communities",
    "info": "This course provides a sociological overview of Asian American identities, families, and communities. To place these experiences within a broader historical, structural, and cultural context the course will begin with a brief introduction to the history of Asians and Asian Americans in the United States and sociological theories about incorporation and racial stratification. We will then examine the diversity of Asian American communities and families, highlighting ethnic, gender, and class variations. Other topics of focus include racialization and discrimination, education, ethnic enclaves, family and intergenerational relationships, identity, media, culture, and politics and social action. Throughout the course, we will consider the ways in which society affects individuals, and how in turn, individuals affect society. Students will have an option to do community-engaged learning or another course project.\n\nHonors students are expected to demonstrate a greater depth of discussion, depth and to a degree length of writing assignments, presentations, and leadership of the students.\n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \nExamples of additional requirements may include:\n- Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n- Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n- Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n- Attend a presentation, workshop, or seminar on a related topic for this class and write a 2-page maximum reflective paper.\n- Interview a current Sociology graduate student and present briefly in class or write a reflective piece, not more than 2 pages in length, to be submitted to the Professor. \n\nprereq: [SOC 1001] recommended, honors",
    "prereq": {}
  },
  {
    "uid": "811411",
    "code": "SOC3511H",
    "subject": "SOC",
    "number": "3511",
    "honors": true,
    "writing": false,
    "name": "Honors: World Pop Problems",
    "fullname": "Honors: World Population Problems",
    "info": "This class is an introduction to the contemporary issues that accompany such dramatic population change, including fertility change, disease experiences, migration as opportunity and challenge and human-environment conflict. Further, we will examine the roles of global organizations, national governments, and culture in shaping and reshaping populations. \n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session.   Students will also be expected to meet as a group and individually with the professor four times during the course semester. \nExamples of additional requirements may include:\n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2-page maximum reflective paper.\n·   Interview a current Sociology graduate student and present briefly in class or write a reflective piece, not more than 2 pages in length, to be submitted to the Professor. \n\nprereq: [SOC 1001] recommended, Sociology majors/minors must register A-F",
    "prereq": {}
  },
  {
    "uid": "811450",
    "code": "SOC3613V",
    "subject": "SOC",
    "number": "3613",
    "honors": true,
    "writing": true,
    "name": "Honors: The Politics of Eating",
    "fullname": "Honors: Stuffed and Starved: The Politics of Eating",
    "info": "The course takes a cross-cultural, historical, and transnational perspective to the study of the global food system. Themes explored include: different cultural and social meanings attached to food; social class and consumption; the global food economy; global food chains; work in the food sector; the alternative food movement; food justice; environmental consequences of food production. \n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \nExamples of additional requirements may include:\n\n - Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n - Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n - Write two brief (1-page) reflection papers on current news or a two-page critique of a class reading\n - Attend a presentation, workshop, or seminar on a related topic for this class and write a 2-page maximum reflective paper.\n - Interview a current sociology/Global Studies graduate student and present briefly in class or write a reflective piece, not more than 2 pages in length, to be submitted to the professor. ",
    "prereq": {}
  },
  {
    "uid": "788745",
    "code": "SOC3801H",
    "subject": "SOC",
    "number": "3801",
    "honors": true,
    "writing": false,
    "name": "Hon: Soc Research Method",
    "fullname": "Honors: Sociological Research Methods",
    "info": "Principles/practice of research design, sampling, data collection. Field observation, surveys. Data management, analysis. Reporting of quantitative/nonquantitative data. Ethics/administration in sociological research. Required lab.",
    "prereq": {}
  },
  {
    "uid": "001151",
    "code": "SOC3991H",
    "subject": "SOC",
    "number": "3991",
    "honors": true,
    "writing": false,
    "name": "Jr Honors Seminar",
    "fullname": "Junior Honors Seminar",
    "info": "Read and discuss sociological research literature; explore research funding opportunities; design individual research projects.",
    "prereq": {}
  },
  {
    "uid": "810577",
    "code": "SOC4101V",
    "subject": "SOC",
    "number": "4101",
    "honors": true,
    "writing": true,
    "name": "Honors: Sociology of Law",
    "fullname": "Honors: Sociology of Law",
    "info": "This course will consider the relationship between law and society, analyzing law as an expression of cultural values, a reflection of social and political structure, and an instrument of social control and social change. Emphasizing a comparative perspective, we begin by discussing theories about law and legal institutions. We then turn our attention to the legal process and legal actors, focusing on the impact of law, courts, and lawyers on the rights of individuals. Although this course focuses on the US legal system, we will explore issues of the relationship between US law and global law and concepts of justice. \n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session. Examples of additional requirements may include:\n- Honors students will be expected to interview a current Sociology graduate student working on a LCD topic. Following this, each student will individually be expected to do an in-class power point presentation explaining how the interviewees? research relates with themes presented in the course. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \n- Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n- Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n- Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n- Attend a presentation, workshop, or seminar on a related topic for this class and write a 2-page maximum reflective paper.\n\nprereq: honors student, [[SOC 1001] and [SOC 1101 or 3101 or 3102]] recommended, Sociology majors/minors must register A-F",
    "prereq": {
      "and": [
        {
          "or": [
            "810720"
          ]
        }
      ]
    }
  },
  {
    "uid": "811547",
    "code": "SOC4102H",
    "subject": "SOC",
    "number": "4102",
    "honors": true,
    "writing": false,
    "name": "Honors: Criminology",
    "fullname": "Honors: Criminology",
    "info": "This class seeks to develop an understanding of patterns of crime and punishment in the United States (including American particularities in international comparison), their social, political, economic, cultural, and institutional conditions, and how these patterns relate to broader sociological themes. We will examine a cross-section of most outstanding recent and some (by now) classical criminological and sociological books and a few articles that have attracted much attention among scholars and/or the broader public.\n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session.  Examples of additional requirements may include:\n·   Honors students will be expected to interview a current Sociology graduate student working on a LCD topic. Following this, each student will individually be expected to do an in-class power point presentation explaining how the interviewees\u0092 research relates with themes presented in the course. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2 page maximum reflective paper.\n\nprereq: Honors student, [SOC 3101 or SOC 3102 or instr consent], Sociology majors/minors must register A-F",
    "prereq": {
      "or": [
        "810720"
      ]
    }
  },
  {
    "uid": "811495",
    "code": "SOC4104H",
    "subject": "SOC",
    "number": "4104",
    "honors": true,
    "writing": false,
    "name": "Honors: Crime and Human Rights",
    "fullname": "Honors: Crime and Human Rights",
    "info": "This course addresses serious violations of humanitarian and human rights law, efforts to criminalize those violations (laws and institutions), and consequences of these efforts. Special attention will be paid to the impact interventions have on representations and memories of atrocities on responses and the future of cycles of violence. Case studies on Holocaust, Balkan wars, Darfur, My Lai massacre, etc. Criminal justice, truth commissions, vetting, compensation programs.\n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session. Examples of additional requirements may include:\n· Honors students will be expected to interview a current Sociology graduate student working on an LCD topic. Following this, each student will individually be expected to do an in-class PowerPoint presentation explaining how the interviewees? research relates to themes presented in the course. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \n· Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n· Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n· Write two brief (1-page) reflection papers on current news or a two-page critique of a class reading\n· Attend a presentation, workshop, or seminar on a related topic for this class and write a 2-page maximum reflective paper.\n\nprereq: SOC 1001, at least one 3xxx SOC course recommended, Sociology majors/minors must register A-F",
    "prereq": {}
  },
  {
    "uid": "813882",
    "code": "SOC4135H",
    "subject": "SOC",
    "number": "4135",
    "honors": true,
    "writing": false,
    "name": "Honors: White-Collar Crime",
    "fullname": "Honors: Sociology of White-Collar Crime",
    "info": "This course deals with diverse types of white-collar crime (high status, occupational, organizational crimes), their causation, the damage they cause, and their control. We will read some of the outstanding literature on these issues and explore well-known cases in depth. There will be lectures and discussion in the classroom. We will explore what white-collar crime teaches us about the nature and explanation of crime and about the nature of criminal justice and other government social control.\n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session.  Examples of additional requirements may include:\n·   Honors students will be expected to interview a current Sociology graduate student working on a LCD topic. Following this, each student will individually be expected to do an in-class power point presentation explaining how the interviewees? research relates with themes presented in the course. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2 page maximum reflective paper.\n\nprereq: Honors, [SOC 3101 or SOC 3102 or instr consent]",
    "prereq": {
      "or": [
        "810720"
      ]
    }
  },
  {
    "uid": "809982",
    "code": "SOC4141H",
    "subject": "SOC",
    "number": "4141",
    "honors": true,
    "writing": false,
    "name": "Honors: Youth Crime",
    "fullname": "Honors: Youth Crime & Punishment",
    "info": "This course offers an overview of social theory and research on youth crime, punishment, and delinquency. We start by critically examining the social facts surrounding the measurement, extent, and distribution of delinquency. Next, we study the principal sociological explanations of delinquent behavior. These theories provide conceptual tools for analyzing delinquency and punishment among groups such as gang members. We then trace youth experiences in the juvenile justice system, from policing, to juvenile court, to probation, and institutionalization. Throughout, we analyze the success or failure of key programs implemented in attempts to prevent or reduce delinquency. \n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session.  Examples of additional requirements may include:\n·   Honors students will be expected to interview a current Sociology graduate student working on a LCD topic. Following this, each student will individually be expected to do an in-class power-point presentation explaining how the interviewees? research relates with themes presented in the course. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2-page maximum reflective paper.\n\nprereq:  honors student, Soc 3101 or 3102 recommended; Sociology majors/minors must register A-F",
    "prereq": {
      "or": [
        "810720"
      ]
    }
  },
  {
    "uid": "809999",
    "code": "SOC4309H",
    "subject": "SOC",
    "number": "4309",
    "honors": true,
    "writing": false,
    "name": "Honors:Religion in Public Life",
    "fullname": "Honors: Religion in American Public Life - Culture, Politics, & Communities",
    "info": "How diversity/vitality of American religion shape public life. How religious groups engage in political action, foster understandings of democracy/styles of civic participation. Volunteering/service activities. Race, poverty, family, sexuality.\n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session.  Students will also be expected to meet as a group and individually with the professor four times during the course semester.\n \nExamples of additional requirements may include:\n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2 page maximum reflective paper.\n·   Interview a current Sociology graduate student and present briefly in class or write a reflective piece, not more than 2 pages in length, to be submitted to the Professor.",
    "prereq": {}
  },
  {
    "uid": "811412",
    "code": "SOC4411H",
    "subject": "SOC",
    "number": "4411",
    "honors": true,
    "writing": false,
    "name": "Honors: Terrorist Networks",
    "fullname": "Honors: Terrorist Networks & Counterterror Organizations",
    "info": "Terror involves using violent actions to achieve political, religious, or social goals. This course examines theories and evidence about the origins, development, and consequences of terrorist networks. It analyzes efforts to prevent, investigate, and punish terrorists by counter-terror organizations, including law enforcement, security, and military forces. Graduate and honors students are expected to demonstrate greater depth of discussion, depth and, to a degree, length of writing assignments, presentations, and leadership of the students.\n\nHonors students registering for Soc 4411H:\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session.   Students will also be expected to meet as a group and individually with the professor four times during the course semester. \n\nExamples of additional requirements may include:\n-Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n-Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n-Write two brief (1-page) reflection papers on current news or a two-page critique of a class reading\n-Attend a presentation, workshop, or seminar on a related topic for this class and write a 2-page maximum reflective paper.\n-Interview a current Sociology graduate student and present briefly in class or write a reflective piece, not more than 2 pages in length, to be submitted to the Professor. \n\nPrereq: Honors",
    "prereq": {}
  },
  {
    "uid": "810578",
    "code": "SOC4451H",
    "subject": "SOC",
    "number": "4451",
    "honors": true,
    "writing": false,
    "name": "Hon: Sport, Culture & Society",
    "fullname": "Honors: Sport, Culture & Society",
    "info": "This course is intended to stimulate critical, sociological thinking about sport? How it is socially organized, who participates in what and why, what role (or roles) sport plays in society, and what sporting practices tell us about contemporary social life more generally. It begins from and is grounded in the notion that sport is one of the most powerful and paradoxical institutions in the modern world. The course is intended for a wide range of undergraduates, though some familiarity with basic social scientific thinking and techniques will be helpful. \n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session.  Examples of additional requirements may include:\n·   Honors students will be expected to interview a current Sociology graduate student working on a topic of interest. Following this, each student will individually be expected to do an in-class power point presentation explaining how the interviewees? research relates with themes presented in the course. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2 page maximum reflective paper.\n\nprereq: Honors; SOC 1001 recommended\n",
    "prereq": {}
  },
  {
    "uid": "809976",
    "code": "SOC4521H",
    "subject": "SOC",
    "number": "4521",
    "honors": true,
    "writing": false,
    "name": "Honors: Love, Sex, & Marriage",
    "fullname": "Honors: Love, Sex, & Marriage",
    "info": "This course will provide an overview of sociological approaches to intimate human relationships. What can sociology and related disciplines tell us about these seemingly intensely personal subjects? More than you might think! Specific topics we will cover include love and romance, dating and mate selection, sexuality, cohabitation, marriage, and divorce. The focus is on contemporary American society, but current U.S. practices are placed in historical and cross-cultural context.\n\nHonors students registering for Soc 4521H: \nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session. Students will also be expected to meet as a group and individually with the professor four times during the course semester. \nExamples of additional requirements may include: \n- Sign up and prepare 3-4 discussion questions in advance of at least one class session. \n- Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour). \n- Write two brief (1-page) reflection papers on current news or a two-page critique of a class reading \n- Attend a presentation, workshop, or seminar on a related topic for this class and write a 2-page maximum reflective paper. \n- Interview a current sociology graduate student and present briefly in class or write a reflective piece, not more than 2 pages in length, to be submitted to the professor. \n\nprereq: Honors\n\n",
    "prereq": {}
  },
  {
    "uid": "810627",
    "code": "SOC4551H",
    "subject": "SOC",
    "number": "4551",
    "honors": true,
    "writing": false,
    "name": "Honors: Soc of Sexualities",
    "fullname": "Honors: Sociology of Sexualities",
    "info": "In this course we will examine social theories and sociological research on the topic of sexuality. We will explore the concept of sexuality as it intersects with race, gender, age, and class. This course is designed to give you a basic understanding of sociological implications of sexuality in the United States. This course is intended to help you develop your analytical and critical thinking skills. You will be asked to move beyond your own experience and perspectives to sociologically analyze and evaluate over-simplified explanations of past and contemporary issues as they appear in our course readings. \n\nAdditional special assignments will be discussed with honors participants who seek to earn honors credit toward the end of our first class session. Students will also be expected to meet as a group and individually with the professor four times during the course semester.\n \nExamples of additional requirements may include:\n·   Sign up and prepare 3-4 discussion questions in advance of at least one class session.\n·   Work with professor and TA on other small leadership tasks (class discussion, paper exchange, tour).\n·   Write two brief (1-page) reflection papers on current news, or a two-page critique of a class reading\n·   Attend a presentation, workshop, or seminar on a related topic for this class and write a 2 page maximum reflective paper.\n·   Interview a current Sociology graduate student and present briefly in class or write a reflective piece, not more than 2 pages in length, to be submitted to the Professor.\n\nprereq: Honors",
    "prereq": {}
  },
  {
    "uid": "008176",
    "code": "SOC4977V",
    "subject": "SOC",
    "number": "4977",
    "honors": true,
    "writing": true,
    "name": "Sr Honors Prosem I",
    "fullname": "Senior Honors Proseminar I",
    "info": "Exploring contemporary research for senior thesis. Guidance in defining a problem and reviewing prior theory/research. Presentation/discussion with faculty researchers.\n\nprereq: 3701, 3801, 3811, 9 additional upper div sociology cr, sr soc honors major, dept consent",
    "prereq": {
      "or": [
        "788745"
      ]
    }
  },
  {
    "uid": "008203",
    "code": "SOC4978V",
    "subject": "SOC",
    "number": "4978",
    "honors": true,
    "writing": true,
    "name": "Honors Capstone Experience II",
    "fullname": "Honors Capstone Experience: Proseminar II",
    "info": "This is the second course in the two-course Honors Capstone Experience. In Soc 4978V, students will complete their data collection and analysis while the focus of the seminar turns to scholarly writing, and particularly to drafting and refining arguments.  \n\nThe Department of Sociology does not make any initial distinction between Honors students who are seeking cum laude, magna cum laude, or summa cum laude levels of Latin Honors. Instead, our focus is on helping students to develop ambitious and high-quality original research papers of which they can be justifiably proud and which can serve as testaments to their abilities.\n\nThe Department of Sociologys approach is to support every Honors student as they plan and conduct summa-level work. The ultimate recommendation for level of latin honors is made by the committee at the time of the thesis defense. In addition to the Honors thesis requirements, the recommendation for summa-level honors is reserved for the papers that demonstrate the following criteria:\n\n- Tight integration between a clearly defined question or thesis and the research presented;\n- Ambitious original research design, with research completed on time and analyzed appropriately;\n- Integration of ongoing conversations in the research literature into the design and analysis of the data gathered;\n- Powerful and precise prose which weaves together evidence and argument and which is attentive to both the lessons and limits of the data.\n\nStudents will do an Oral Defense and participate in a panel presentation at the spring Sociological Research Institute (SRI). \n\nThe Sociology Department requires completion of Soc 4977V/4978V to graduate with Latin Honors. \n\nprereq: 1001/1011V, 3701, 3801, 3811, 4977V, and at least 12 upper-division SOC credits; Sociology honors major & department consent",
    "prereq": {
      "or": [
        "003009",
        "788745",
        "008176"
      ]
    }
  }
]