[
  {
    "code": "TLDO 1401",
    "subject": "TLDO",
    "id": "1401",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program in Toledo, Spain, to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 1402",
    "subject": "TLDO",
    "id": "1402",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program in Toledo, Spain, to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 1403",
    "subject": "TLDO",
    "id": "1403",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program in Toledo, Spain, to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 1404",
    "subject": "TLDO",
    "id": "1404",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program in Toledo, Spain, to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 1405",
    "subject": "TLDO",
    "id": "1405",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program in Toledo, Spain, to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 3001",
    "subject": "TLDO",
    "id": "3001",
    "title": "20th Century Spanish Lit",
    "info": "Spanish literature.",
    "prereq": []
  },
  {
    "code": "TLDO 3002",
    "subject": "TLDO",
    "id": "3002",
    "title": "Survey Span Am Colonial Lit",
    "info": "Spanish American literature.",
    "prereq": []
  },
  {
    "code": "TLDO 3003",
    "subject": "TLDO",
    "id": "3003",
    "title": "Modern World Visual Rep",
    "info": "Major influential world events from Spanish perspective through visual images in art, film, and media. Students break apart images to do historical analysis of events/figures such as Franco to Rodriguez Zapatero, Berlin Wall, and Spain since death of Franco.",
    "prereq": []
  },
  {
    "code": "TLDO 3004",
    "subject": "TLDO",
    "id": "3004",
    "title": "Marketing in European Business",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "code": "TLDO 3005",
    "subject": "TLDO",
    "id": "3005",
    "title": "Intro to Interpretation",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "code": "TLDO 3006",
    "subject": "TLDO",
    "id": "3006",
    "title": "Camino de Santiago: Then & Now",
    "info": "Study abroad course",
    "prereq": []
  },
  {
    "code": "TLDO 3007",
    "subject": "TLDO",
    "id": "3007",
    "title": "Comparative Public Health",
    "info": "Public health systems are facing an increasing number of challenges: the pressures of globalization, aging populations, and the increase in patient lawsuits, as well as the high costs of medical research and treatments. With these issues in mind, we must critically analyze the manner in which medical care is provided in different systems so that we can design and adapt systems that provide high quality, effective, and efficient health care. Changes made to health care systems are frequently based on economic and political considerations, and many countries are currently experiencing significant challenges in health care that depart from the way their health care has been financed and provided in the past.\n\nThis course will introduce students to the Spanish health care system and the context in which it is developing, studying the key changes that have taken place up to the present day. Based on a series of case studies, students will be able to compare the Spanish health care model with other models like those of the United States, the United Kingdom, France, Sweden, and/or developing nations.\n\nYou will compare health care systems and performance on a variety of topics including morbidity and mortality, disease ranking, health system cost, quality, and safety to name a few. You will also develop your critical evaluation skills to analyze the quality of the evidence used to support the policies and practice of health care. This will enable you to critically observe the role governmental and non-governmental organizations play with regard to health care and health status.\n\nThroughout the course, special attention will be paid to comparisons between Spain and the United States with a focus on identifying and understanding health disparities and how each country and their health system are addressing elimination of health disparities. Health disparities exist for a variety of reasons, and this course will help you understand what those factors are, and how each country is attempting to improve the social determinants that directly contribute to health disparities.",
    "prereq": []
  },
  {
    "code": "TLDO 3008",
    "subject": "TLDO",
    "id": "3008",
    "title": "Healthcare Marketing & Comm",
    "info": "This course centers around the knowledge, analysis, and management of communication and marketing in the healthcare setting, and how it is applied to different audiences—from specialized groups, such as healthcare professionals, to more general audiences, such as the society at large—to communicate the importance of healthcare policies in an increasingly global atmosphere that requires patient-centered care, incorporation of innovation and efficiency, as well as a goal of sustainability. \n\nIn Europe, in general, and in Spain, in particular, the healthcare systems are primarily public, and the communication objectives created by institutions are primarily directed toward spreading information, creating awareness, and managing reputation, in contrast with other healthcare systems, such as the American system, which are based on a system of private insurance. \n\nThus, European healthcare institutions, in addition to their large responsibility to manage healthcare, place great importance on communication and marketing policy, on issues of managing and maintaining resources, communicating results, prevention campaigns, and campaigns to create awareness of public expense. At the same time, there is a component of policy-related and institutional communication with regards to advancing the healthcare system, which includes topics that are difficult to transmit to the citizen such as the system’s short-term and long-term sustainability and equality within the system. \n\nComplementing the public European healthcare systems, private or civil organizations such as private health centers, the pharmaceutical industry, and patient and professional associations play an important role. Among the primary parties with which they interact to maintain functioning and protect their interests is the government administration. For this reason, their efforts in institutional relationships, reputation management, and communication with the society at large plays an important role in their daily workings and their place in the healthcare system. \n\nIn addition, all these organizations have an ongoing relationship with the media, both general media as well as those specialized in healthcare correspondence, and, at this time, are facing the same business model changes in the area of communication. Those changes are leading them to develop and expand in the realm of digital communication.",
    "prereq": []
  },
  {
    "code": "TLDO 3009",
    "subject": "TLDO",
    "id": "3009",
    "title": "Diversity in Global Health",
    "info": "This course  will dive into sociological diversity and existing culture in order to reflect on the  influence of global and local dynamics on the health of different populations.\n\nBeginning with a historical overview that will bring us to the paradigm of social determinants of health and its successive reformulations (Dahlgren & Whitehead, 1991; Acheson, 1998; OMS, 2005), we will begin to study the topic of equity in health, defined as “the absence of potentially remediable, systematic differences in one or more aspects of health across socially, economically, demographically, or geographically defined population groups or subgroups.” (Maconko & Starfield, 2002). At the same time, we will study the topic of health inequities, which consist of “health differences between different populations that are important, systematic, avoidable, and unjust” (Whitehead, 1992).1 \n\nWe will learn about the ecological and sociological dimensions using models like Sustainable Development Goals or questioning supposedly universal constructs like the Human Development Index, while remembering to reflect on concrete social situations and the cultural setting in which they develop.\n\nThe concept of health will be approached from its widest and most holistic dimension to introduce the contribution of the social sciences, from a global perspective on health to more specific contexts, and the differentiation between disease, discomfort, and illness. We will debate on the importance of terms like health care systems, pluralism, and alternative therapies and, finally, we will be introduced to a socio-cultural perspective to help us rethink concepts like health, hygiene, or care.\n\nThe health care mechanism, the institutionalization of care, and the functioning of these institutions will be another focus of our attention, analyzing the characteristics of teamwork, leadership or the formation of stereotypes. In this sense, we will try to bring together a dual perspective which includes a reflection on society and patients, and the continual questioning of our function as professionals in the area of health care and research.\n\nIn a more practical sense, we will analyze perspectives on determinants of health in groups made vulnerable by their condition or stigmatization in a determined society (we will focus on the local situation but also extend the comparison and reflection to other places), also questioning the acceptance of terms which we hear often as health care professionals and in coordination with other disciplines such as “dependency” or “normality.”\n\n—————————\n1 Quotation translated from Spanish by translator. Original English quotation could not be found and may differ somewhat from translation above.\n\n",
    "prereq": []
  },
  {
    "code": "TLDO 3011",
    "subject": "TLDO",
    "id": "3011",
    "title": "Anth:Archeological Methods",
    "info": "Excavation and laboratory techniques. Carbon dating, photography, floral/fauna analysis, artifact analysis.",
    "prereq": []
  },
  {
    "code": "TLDO 3012",
    "subject": "TLDO",
    "id": "3012",
    "title": "Global Bioethics",
    "info": "Bioethics was initially projected with very wide objectives. V.R. Potter understood it as a dialogue between scientists and humanists to preserve humanity from its self-destruction and promote quality of life. In his words, “Mankind is urgently in need of a new wisdom that will provide the ‘knowledge of how to use knowledge’ for man’s survival and for improvement in the quality of life….I therefore propose the term bioethics in order to emphasize the two most important ingredients in achieving the new wisdom that is so desperately needed: biological knowledge and human values.” The Encyclopedia of Bioethics, edited by Warren Reich in 1978, suggests the following definition of bioethics: “systematic study of human conduct in the area of the life sciences and health care, insofar as this conduct is examined in the light of moral, values, and principles.”\n\nThe complex, multi-disciplinary model of modern healthcare creates numerous ethical conflicts. When the values of all the actors are taken into account when making decisions, there is inevitably disparity of criteria. The conflicts generated are not merely technical; they are also ethical, because the values of the people or institutions involved can be in conflict. In these instances, it is important that the medical professional knows to consider technical issues (the medical facts) and the values at play (the preferences of those involved, principles, norms, etc.), in order to make a good decision. At present, bioethics is considered a practical or applied ethics (to biomedicine), that attempts to resolve ethical dilemmas present in biomedicine. There are various fields within bioethics. The most relevant are foundational bioethics (which deals with the philosophical foundations of bioethics), environmental bioethics, clinical bioethics, and the bioethics of research. Bioethical issues tend to be complex problems that extend beyond the limits of a sole profession, for which reason it is essential to consider the input of healthcare professionals, philosophers, lawyers, psychologists, social workers, sociologists, and any other profession involved in the most hot-button ethical issues relating to the life sciences.\n\nAll the fields mentioned have great relevance due to the importance and prevalence of the issues taken on by bioethics. There are a great number of publications that indicate how numerous professionals confront common, difficult-to-regulate bioethical dilemmas in the clinical sphere as well as the in the area of research or in relation to the environment, but the formation needed to tackle these problems is insufficient. In a significant number of these articles, it is concluded that it is necessary to improve the bioethical formation of future professionals to be able to better address these issues. For this reason, education in bioethics has become a priority both in the United States and in Europe, as well as the rest of the world, as these issues are not limited to a specific area, but rather are global.",
    "prereq": []
  },
  {
    "code": "TLDO 3015",
    "subject": "TLDO",
    "id": "3015",
    "title": "Advanced Grammar & Comp",
    "info": "Classroom discussions on contemporary issues in Spain and other subjects of interest. Periodic error evaluation. Systematic review of most frequent structural/grammatical problems.",
    "prereq": []
  },
  {
    "code": "TLDO 3016",
    "subject": "TLDO",
    "id": "3016",
    "title": "Advanced Spanish Conversation",
    "info": "Difficult aspects of Spanish grammar/structures mastered through composition writing. Problems of style/language.  Several compositions written outside class each week, common errors reviewed.",
    "prereq": []
  },
  {
    "code": "TLDO 3022",
    "subject": "TLDO",
    "id": "3022",
    "title": "Spanish for Business",
    "info": "Vocabulary/usage of interest in business, economics, international relations, or tourism.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3023",
    "subject": "TLDO",
    "id": "3023",
    "title": "Cross Cultural Business",
    "info": "Contemporary business environment of Spain. Social, economic, and political context. Labor market, financial markets, legal framework. Impact of European single market.",
    "prereq": []
  },
  {
    "code": "TLDO 3024",
    "subject": "TLDO",
    "id": "3024",
    "title": "Tracing Three Cultures",
    "info": "Three-week intensive course. Lectures, discussions, field trips, including Madrid's 'Museo del Prado', 'El Escorial' Palace, Guided Tours of Judaic Toledo and Mozarabic Segovia. Christian, Muslim, and Jewish culture in literature/art, how they conform to identity of modern Spain. Sephardic heritage in literature/architecture in Toledo. Interaction between Islamic/Hispano-Mozarabic artists. Role of Epic/Reconquest in medieval Spanish literature. Religious painting, Christian iconography during Baroque/Counter-reformation periods.",
    "prereq": []
  },
  {
    "code": "TLDO 3025",
    "subject": "TLDO",
    "id": "3025",
    "title": "Spanish Culture:  Digital Tech",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "code": "TLDO 3044",
    "subject": "TLDO",
    "id": "3044",
    "title": "Medical Spanish",
    "info": "This class is designed for students at the advanced Spanish level who want to learn specific medical vocabulary, concepts, and expressions used in Spanish language health systems. An additional goal of the course is to improve students’ knowledge about Spanish society and culture because of the key role this plays in working effectively as a health professional in such a context.",
    "prereq": []
  },
  {
    "code": "TLDO 3053",
    "subject": "TLDO",
    "id": "3053",
    "title": "Hist:Spain & Classical World",
    "info": "Role of Spain in the development of Greek, Phoenician, and Roman civilizations.  Impact of these three cultures on the Iberian Peninsula.",
    "prereq": []
  },
  {
    "code": "TLDO 3104W",
    "subject": "TLDO",
    "id": "3104W",
    "title": "Art of Reading Lit Texts",
    "info": "Critical reading of Spanish and Spanish-American texts. Novels, dramas, poetry, essays. Diverse approaches. Terminology of criticism, literary problems, techniques.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3105W",
    "subject": "TLDO",
    "id": "3105W",
    "title": "Cultural Heritage of Spain",
    "info": "Main periods of Spanish history. Political, social, anthropological, and economic characteristics of each. Spanish culture/society, from beginning of Franco regime in 1939 to present. Cultural trends in literature/arts in relation to social phenomena.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3107W",
    "subject": "TLDO",
    "id": "3107W",
    "title": "Intro: Hispanic Linguistics",
    "info": "Phonology, morphology, syntax, semantics, lexicology, pragmatics, discourse analysis, sociolinguistics. History of Spanish language. Introduction to Hispanic linguistics as a discipline in relation to social, cultural, and literary studies.",
    "prereq": []
  },
  {
    "code": "TLDO 3211",
    "subject": "TLDO",
    "id": "3211",
    "title": "Writers: Empire's Rise & Fall",
    "info": "Masterpieces of Spain's most significant renaissance and golden age writers, including Lope de Vega, Calderon, Cervantes, Garcilaso, Gongora, Quevedo, and authors of picaresque novels and mystic poetry.",
    "prereq": []
  },
  {
    "code": "TLDO 3213",
    "subject": "TLDO",
    "id": "3213",
    "title": "Span Feudal Society & Lit",
    "info": "Major works of medieval Spain in connection with its social background, from Auto de los Reyes Magos and Cantar del Mio Cid to Celestina and other pre-Renaissance literature.",
    "prereq": []
  },
  {
    "code": "TLDO 3214",
    "subject": "TLDO",
    "id": "3214",
    "title": "Age of Don Quijote",
    "info": "Major works of Cervantes, Don Quijote de la Mancha, and Novelas Ejemplares as stepping stones to understanding 16th/17th century Spain.",
    "prereq": []
  },
  {
    "code": "TLDO 3215",
    "subject": "TLDO",
    "id": "3215",
    "title": "Spanish Golden Age Theatre",
    "info": "Spanish Baroque theater. Plays by Lope De Vega, Cervantes, Tirso de Molina, Calderon de la Barca, or Luis Velez de Guevara are read/discussed. Students attend theater in Toledo or Madrid.",
    "prereq": []
  },
  {
    "code": "TLDO 3216",
    "subject": "TLDO",
    "id": "3216",
    "title": "Contemporary Spanish Women",
    "info": "Literary works by women writers of last three decades. Spanish history of 20th century. Women’s participation across political spectrum. Feminist movement. Sociopolitical/cultural changes since Franco’s death in 1975. Role of Spanish women writers in transition to democracy and social change.",
    "prereq": []
  },
  {
    "code": "TLDO 3217",
    "subject": "TLDO",
    "id": "3217",
    "title": "Directed Studies in Literature",
    "info": "Individual research projects or readings in literature, under faculty direction, to meet objectives not covered by regular curriculum.",
    "prereq": []
  },
  {
    "code": "TLDO 3218",
    "subject": "TLDO",
    "id": "3218",
    "title": "Discovering the Hispanic World",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "code": "TLDO 3221",
    "subject": "TLDO",
    "id": "3221",
    "title": "Spanish Am Lit to Ruben Dario",
    "info": "Development of Spanish American literature, from \\\"cronicas\\\" of conquistadors through modernism. Characteristics that make the literature unique and not a mere reflection of Spanish/European literary currents.",
    "prereq": []
  },
  {
    "code": "TLDO 3222",
    "subject": "TLDO",
    "id": "3222",
    "title": "Narrative in Spanish America",
    "info": "Narrative currents in Spanish America, from Carpentier and emergence of magical realism to present day. Authors studied include Garcia Marquez, Borges, Fuentes, Vargas Llosa, and Cortazar.",
    "prereq": []
  },
  {
    "code": "TLDO 3230",
    "subject": "TLDO",
    "id": "3230",
    "title": "Advanced Spanish Conversation",
    "info": "Contemporary issues in Spain, other subjects of interest. Error evaluation. Review of frequent structural/grammatical problems.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3231",
    "subject": "TLDO",
    "id": "3231",
    "title": "Spanish Comp and Communication",
    "info": "Difficult aspects of Spanish grammar/structures mastered through composition writing. Problems of style/language.  Several compositions written outside class. Common errors.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3232",
    "subject": "TLDO",
    "id": "3232",
    "title": "Art & Architecture in Spain",
    "info": "Characteristics of major periods in Spanish art/architecture. Greek, Roman, Romanesque, Gothic, Baroque, Neo-Classical, Romanticism, Modernism, 20th century avant-garde.",
    "prereq": []
  },
  {
    "code": "TLDO 3233",
    "subject": "TLDO",
    "id": "3233",
    "title": "Christian, Muslim, Jewish Art",
    "info": "Art of three cultures are studied in/around Toledo.",
    "prereq": []
  },
  {
    "code": "TLDO 3234",
    "subject": "TLDO",
    "id": "3234",
    "title": "Master Painters of Spain",
    "info": "Development of Spanish painting studied in works of El Greco, Velázquez, Goya, Picasso, and Dali. Visits to Madrid's Museo del Prado and Centro de Arte Reina Sofia.",
    "prereq": []
  },
  {
    "code": "TLDO 3235",
    "subject": "TLDO",
    "id": "3235",
    "title": "Politics and Society",
    "info": "Contrasts in political/social structures of various Spanish-American nations in 20th century. Their diversity, common problems.",
    "prereq": []
  },
  {
    "code": "TLDO 3236",
    "subject": "TLDO",
    "id": "3236",
    "title": "Span Phonology & Phonetics",
    "info": "Practical/theoretical aspects of Spanish phonetics. Correcting specific pronunciation problems of non-native speaker. Small practice groups divided according to native languages.",
    "prereq": []
  },
  {
    "code": "TLDO 3237",
    "subject": "TLDO",
    "id": "3237",
    "title": "Transition Toward Democracy",
    "info": "Changes in Spain from Franco's death in 1975 to Law for Political Reform and Constitution of 1978. Role of Monarchy, Army, political parties, and trade unions in shaping Constitution and defining Spain as semi-federal state.",
    "prereq": []
  },
  {
    "code": "TLDO 3238",
    "subject": "TLDO",
    "id": "3238",
    "title": "Spain and the EU",
    "info": "Formation of EU. Impact of building a single European market on Spanish and greater European economies. Readings from daily press.",
    "prereq": []
  },
  {
    "code": "TLDO 3239",
    "subject": "TLDO",
    "id": "3239",
    "title": "Mgmt of Cultural Heritage",
    "info": "Theoretical/practical approach to managing Spain's cultural heritage. Historical, artisitc, social, and economic aspects of life in a patrimonial city.",
    "prereq": []
  },
  {
    "code": "TLDO 3240",
    "subject": "TLDO",
    "id": "3240",
    "title": "Adv Problems in Span Grammar",
    "info": "Aspects of Spanish syntax in context of written language.  Different methods in teaching Spanish grammar.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3241",
    "subject": "TLDO",
    "id": "3241",
    "title": "Directed Studies in Art Hist",
    "info": "Individual research projects or readings in art or archeology, under faculty direction, to meet objectives not covered by regular curriculum.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3242",
    "subject": "TLDO",
    "id": "3242",
    "title": "History and Memory",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "code": "TLDO 3301",
    "subject": "TLDO",
    "id": "3301",
    "title": "Archeology: Iberian Peninsula",
    "info": "Diverse cultures of Iberia as seen through an analysis of most important archaeological sites of the peninsula.\n\nprereq: Two yrs of college level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3302",
    "subject": "TLDO",
    "id": "3302",
    "title": "Ethn & Folklore of Iberian Pen",
    "info": "Traditional forms of life in Iberian Peninsula in terms of social/economic features. Literary, artisitic, and religious aspects.\n\nprereq: Two yrs of college level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3303",
    "subject": "TLDO",
    "id": "3303",
    "title": "Directed Studies - Anth & Arch",
    "info": "Individual research projects or readings in anthropology or archeology, under faculty direction, to meet objectives not covered by regular curriculum.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3312",
    "subject": "TLDO",
    "id": "3312",
    "title": "Geog: Geography of Spain",
    "info": "Physical and human geography of Spain and its influence on social structure, population growth, economic development, and international relations.",
    "prereq": []
  },
  {
    "code": "TLDO 3313",
    "subject": "TLDO",
    "id": "3313",
    "title": "Span:Spanish Lit 1700-1900",
    "info": "Major literary movements of 18th and 19th century Spain, from neoclassicism and romanticism to realism and naturalism. Representative authors such as Feijoo, Jovellanos, Cadalso, Larra, Espronceda, Zorrilla, Becquer, Valera, Galdos, and Pardo Bazan.",
    "prereq": []
  },
  {
    "code": "TLDO 3314",
    "subject": "TLDO",
    "id": "3314",
    "title": "20th Century Spanish Art",
    "info": "Spanish artists who were most affected by European avant-garde movements and have greatly affected art in/outside Spain (e.g., Pablo Picasso, Salvador Dali, Juan Miro, Juan Gris).",
    "prereq": []
  },
  {
    "code": "TLDO 3319",
    "subject": "TLDO",
    "id": "3319",
    "title": "ArtH:Span Art,Arch,Eras,Styles",
    "info": "Characteristics of major periods in Spanish art and architecture including Greek and Roman, Romanesque, Gothic, Baroque, and Neo-Classical.  Also Romanticism, Modernism, and 20th century avant-garde styles.",
    "prereq": []
  },
  {
    "code": "TLDO 3322",
    "subject": "TLDO",
    "id": "3322",
    "title": "Hist:Jew-Arab-Chrst Mdvl Spain",
    "info": "Influence of Jewish and Arabic cultures on medieval Christian thinking.  Repercussions in Europe.  Includes study of School of Translators in Toledo and its role in the diffusion of Aristotelian naturalism.",
    "prereq": []
  },
  {
    "code": "TLDO 3323",
    "subject": "TLDO",
    "id": "3323",
    "title": "Hist:Rise&Fall Imperial Spain",
    "info": "Spain's role in European politics from 15th century unification of Castile and Aragon to end of Hapsburg Dynasty in 1700.  Problems arising from Spain's presence in Flanders, Central Europe, Italian terrirories, and the Americas.",
    "prereq": []
  },
  {
    "code": "TLDO 3324",
    "subject": "TLDO",
    "id": "3324",
    "title": "Hist: Bourbon Spain",
    "info": "Political, social, and economic development of Spain from the War of Succession to thew Napoleonic invasion.",
    "prereq": []
  },
  {
    "code": "TLDO 3331",
    "subject": "TLDO",
    "id": "3331",
    "title": "Hist:Span/Euro:Ideas,Pol Inst",
    "info": "Development of Spanish and European political institutions and ideas, 1700-1936.  Evolution of idea of absolute monarchy, decline of representation by estates, revolutionary crises of late 18th and early 19th centuries, and social conflicts of 20th.",
    "prereq": []
  },
  {
    "code": "TLDO 3332",
    "subject": "TLDO",
    "id": "3332",
    "title": "Hist: Spanish Enlightenment",
    "info": "The Spanish Enlightenment and its idiosyncrasies in economic, political, and social thought compared with the rest of Europe, especially France and England, as studied in writings of major 18th century Spanish thinkers:Feijoo, Jovellanos and others.",
    "prereq": []
  },
  {
    "code": "TLDO 3334",
    "subject": "TLDO",
    "id": "3334",
    "title": "ArtH:Hist of Medieval Span Art",
    "info": "The various currents of medieval European art as they developed in the Iberian Peninsula.",
    "prereq": []
  },
  {
    "code": "TLDO 3336",
    "subject": "TLDO",
    "id": "3336",
    "title": "ArtH:History of Moorish Art",
    "info": "Art and architecture of the Islamic period in Spain as viewed through such representative monuments at the Alhambra palace in Granada and the mosque at Cordoba.",
    "prereq": []
  },
  {
    "code": "TLDO 3351",
    "subject": "TLDO",
    "id": "3351",
    "title": "ArtH:Chrst,Musl,Jewish Art:Tol",
    "info": "The art of the three cultures which determined the national character of Spain today are studied in and around Toledo, which represented the maximum synthesis of this unique heritage.",
    "prereq": []
  },
  {
    "code": "TLDO 3355",
    "subject": "TLDO",
    "id": "3355",
    "title": "ArtH:Master Painters of Spain",
    "info": "Development of Spanish painting studied in works of five of Spain's greatest artists: El Greco, Velazquez, Goya, Picasso, and Dali.  Visits to Madrid's Museo del Prado and Centro de Arte Reina Sofia.",
    "prereq": []
  },
  {
    "code": "TLDO 3401",
    "subject": "TLDO",
    "id": "3401",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 3402",
    "subject": "TLDO",
    "id": "3402",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 3403",
    "subject": "TLDO",
    "id": "3403",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 3404",
    "subject": "TLDO",
    "id": "3404",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 3405",
    "subject": "TLDO",
    "id": "3405",
    "title": "U of Castilla La Mancha Course",
    "info": "This is a course shell that will be used on the Study & Intern in Toledo study abroad program to represent a course taken at the University of Castilla La Mancha. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": []
  },
  {
    "code": "TLDO 3484",
    "subject": "TLDO",
    "id": "3484",
    "title": "ArtH:Hist Span Art Since 1700",
    "info": "Artistic movements from the 18th century to surrealism and beyond.  Visits to the Prado, Picasso's \\\"Guernica\\\", and Museo de Arte Contemproaneo supplement classroom activities.",
    "prereq": []
  },
  {
    "code": "TLDO 3491",
    "subject": "TLDO",
    "id": "3491",
    "title": "Pol:Politics,Society Latin Am",
    "info": "Contrasts in political and social structures of various Spanish- American nations in 20th century to show their diversity, but also to provide insight into common problems they share. ",
    "prereq": []
  },
  {
    "code": "TLDO 3501",
    "subject": "TLDO",
    "id": "3501",
    "title": "Chic:Hispanic Heritage in USA",
    "info": "Cultural and social heritage of centuries of Spanish presence in what is not the USA.  Influences on language and culture and on political, legal, and agricultural practices of the American Southwest.  Impact of new immigration from Mexico, Puerto Rico, and Cuba in the 21st century.",
    "prereq": []
  },
  {
    "code": "TLDO 3502",
    "subject": "TLDO",
    "id": "3502",
    "title": "Spain Since 1936",
    "info": "Main features and social significance of General Franco's authoritarian regime as opposed to German/Italian models.  Origins of the Civil War. Later social/economic development  Problems in political/constitutional transition since Franco.\n\nprereq: Two yrs of college level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3503",
    "subject": "TLDO",
    "id": "3503",
    "title": "Directed Studies in History",
    "info": "Individual research projects or readings in history, under faculty direction, to meet objectives not covered by regular curriculum.",
    "prereq": []
  },
  {
    "code": "TLDO 3512",
    "subject": "TLDO",
    "id": "3512",
    "title": "Geog:Geography of Latin Amer",
    "info": "Physical and human geography of Latin America and its influence on social structure, population growth, economic development, and international relations.",
    "prereq": []
  },
  {
    "code": "TLDO 3513",
    "subject": "TLDO",
    "id": "3513",
    "title": "Span:Sem:Buen Amor & Celestina",
    "info": "Two classics of early Spanish literature studied as synthesis of various contrasting literary traditions and as reflection of diverse customs/institutions that existed when Spanish society was strongly influenced by Jewish, Muslim, and Christian cultures.",
    "prereq": []
  },
  {
    "code": "TLDO 3514",
    "subject": "TLDO",
    "id": "3514",
    "title": "Span:Lit:Latin Am & Span Women",
    "info": "Poetry, short stories, and novels from Latin American and Spanish female authors. Emphasizes contemporary writers such as Claribel Alegria, Rosario Ferre, Carmen Martin Gaite, Adelaide Garcia Morales, and Rosa Montero.",
    "prereq": []
  },
  {
    "code": "TLDO 3515",
    "subject": "TLDO",
    "id": "3515",
    "title": "Theology of Span Mysticism",
    "info": "Historical, social, cultural, and theological basis of Spanish mysticism. Carmelites, Franciscans, Jesuits.\n\nprereq: Two yrs of college level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3516",
    "subject": "TLDO",
    "id": "3516",
    "title": "Spanish Philosophical Thought",
    "info": "Characteristics of Spanish Renaissance (16th century), influence of Erasmus, mysticism, philosophy of Juan Luis Vives. Overview of philosophical development from 17th to 20th centuries. Contemporary Spanish philosophy, focusing on Unamuno, Ortega y Gasset, and Zubiri.\n\nprereq: Two yrs of college level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3517",
    "subject": "TLDO",
    "id": "3517",
    "title": "Spanish Women: Past & Present",
    "info": "Theoretical/practical approach to fundamental transformations that have conditioned lives of Spanish women, from Golden Age to present. Aspects of women's participation in economic world and in culture.",
    "prereq": []
  },
  {
    "code": "TLDO 3520",
    "subject": "TLDO",
    "id": "3520",
    "title": "Econ:Econ Struc Contemp Spain",
    "info": "Current problems affecting the domestic and foreign economic policies of Sapin.",
    "prereq": []
  },
  {
    "code": "TLDO 3521",
    "subject": "TLDO",
    "id": "3521",
    "title": "Econ:Econ Struc Contemp Lat Am",
    "info": "Current problems affecting domestic and foreign economic policies of Latin America.",
    "prereq": []
  },
  {
    "code": "TLDO 3699",
    "subject": "TLDO",
    "id": "3699",
    "title": "Adv Individualized Span",
    "info": "Directed study with individual tutoring to improve specific language skills identified by student and supervising professor.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3703",
    "subject": "TLDO",
    "id": "3703",
    "title": "History of Spanish Language",
    "info": "Trends in historical development of Spanish. Emphasizes grammar and Spanish sound system.",
    "prereq": []
  },
  {
    "code": "TLDO 3704",
    "subject": "TLDO",
    "id": "3704",
    "title": "Span: Modern Spanish",
    "info": "Syntax, semantics, and phonology of modern Spanish. Emphasizes current research into theory of grammar as applied to Spanish language.",
    "prereq": []
  },
  {
    "code": "TLDO 3705",
    "subject": "TLDO",
    "id": "3705",
    "title": "Span:Sem:Devel of Spanish Lang",
    "info": "Modern approaches to historical linguistics, in context of generative grammar, as applied to history/structure of Spanish. Major syntactic, semantic, and phonological processes.",
    "prereq": []
  },
  {
    "code": "TLDO 3706",
    "subject": "TLDO",
    "id": "3706",
    "title": "Colloquial Spanish",
    "info": "Characteristic phenomena of Spanish in its colloquial spoken form. Variations based on age, social, and regional background. New lexical, morphological, and syntactical coinages.",
    "prereq": []
  },
  {
    "code": "TLDO 3707",
    "subject": "TLDO",
    "id": "3707",
    "title": "Hist: Spain 1808-1936",
    "info": "Political, social and economic development of Spain's liberal past.  Major philosophical and political works and documents illustrate a basically historical and sociological approach.",
    "prereq": []
  },
  {
    "code": "TLDO 3714",
    "subject": "TLDO",
    "id": "3714",
    "title": "Hist: Ancient & Medieval Spain",
    "info": "History of Spain from the unification of diverse Iberian cultures under Roman rule to the Middle Ages.",
    "prereq": []
  },
  {
    "code": "TLDO 3730",
    "subject": "TLDO",
    "id": "3730",
    "title": "Span: Spanish Phonetics",
    "info": "Practical as well as theoretical aspects of Spanish phonetics geared to correcting specific pronunciation problems of the non-native speaker.  Students are divided into small practice groups according to their mother tongues.",
    "prereq": []
  },
  {
    "code": "TLDO 3800",
    "subject": "TLDO",
    "id": "3800",
    "title": "Society in Span & LA Film",
    "info": "Contemporary Spanish and Latin American societies explored through films with Spanish and Latin American artists.  Approximately 10 films are analyzed from historic-sociological point of view.\n\nprereq: Two yrs of college level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3810",
    "subject": "TLDO",
    "id": "3810",
    "title": "Seminar: Spanish Language Film",
    "info": "Contemporary cultural/aesthetic trends in Spanish film industry. Viewing/analysis of most significant films of Saura, Bardem, Gurierrez, Aragon, and other directors.",
    "prereq": []
  },
  {
    "code": "TLDO 3895",
    "subject": "TLDO",
    "id": "3895",
    "title": "Health Internship",
    "info": "The Cross-Cultural Health internship course is designed to provide students with the opportunity to become more knowledgeable regarding the local work culture and professional environment in Spain with a focus on cross-cultural health. Through practical internship experiences as well as a literature search, critical reading, data charting, discussions, and written assignments, students will deepen their understanding of the host country’s cultural and health context and critically examine their own worldview.\n\nThe course is guided by the Core Competencies for Entering Medical Students (CCEMS) endorsed by the Association of American Medical Colleges. These competencies fall into four categories: interpersonal, intrapersonal, thinking and reasoning, and Science. Students will focus on these competencies as they reflect, research, write, articulate, and interact at their internship placements. A strong comprehension of these skills along with the knowledge they provide is necessary to successfully interact in a health care setting; in particular, a cross-cultural health care scenario with people from diverse backgrounds.\n\nThe course is designed to guide and support students in their internship experience and to create a foundation for a successful professional career in the field of health care. In addition to gaining a cross-cultural comparative view on health care work, the topics and assignments will deepen students’ insights about themselves, their professional expectations, and how to be successful in the health care workplace. Students are expected to make a valuable contribution to the internship site through the completion of major projects or tasks, as well as to understand the work dynamic of their Spanish health care setting, including hierarchy, communication, local management strategy, and differences between Spain and the US.",
    "prereq": []
  },
  {
    "code": "TLDO 3896",
    "subject": "TLDO",
    "id": "3896",
    "title": "Internship in Toledo",
    "info": "This course grants students the opportunity to reflect on the Spanish work environment in an international context. Through the internship, proposed readings, participation in classroom debates, and written assignments, students will increase their knowledge of Spanish culture and improve their ability to critically examine the worldview that surrounds them. This course is designed to guide students through their internship and build a foundation for a successful professional career. Through assignments and class discussions, students will gain a comparative multicultural perspective on the world labor force, deepening their self-knowledge, their understanding of the work environment, and their perception of success in the workplace. \n\nWith its multidisciplinary focus, the course seeks to give students the tools they need to analyze the modern Spanish society in which they will find themselves immersed through their internship. With an introduction to modern history, students will analyze different economic, political, and cultural elements that influence society at large and the workplace in particular. In this course, students will discuss many topics involving Spanish society, including the changing role of women, the role of civil servants, immigration, and the solidity of the family structure. In addition, students will analyze potential intercultural communication problems that may arise during their internship, and they will discuss strategies for adapting to their work experience in order to take full advantage of it.",
    "prereq": []
  },
  {
    "code": "TLDO 3900",
    "subject": "TLDO",
    "id": "3900",
    "title": "Topics in Toledo",
    "info": "Study abroad course.",
    "prereq": []
  },
  {
    "code": "TLDO 3910",
    "subject": "TLDO",
    "id": "3910",
    "title": "Span:20th C Spanish Literature",
    "info": "Contemporary Spanish literature, from generation of 1898 to postwar era. Major literary current, political, and social events that have shaped literature. Representative authors/works.",
    "prereq": []
  },
  {
    "code": "TLDO 3911",
    "subject": "TLDO",
    "id": "3911",
    "title": "Span:Sem:Politics & Literature",
    "info": "Models of politics available in literature, literature as political activity, sociopolitical aspects of literary criticism. Draws from English and other literature in translation.",
    "prereq": []
  },
  {
    "code": "TLDO 3920",
    "subject": "TLDO",
    "id": "3920",
    "title": "Span:Contemp Spanish Amer Lit",
    "info": "Poetry, narrative, and theater of Spanish America, from post-modernism to present, as seen through works of representative authors.",
    "prereq": []
  },
  {
    "code": "TLDO 3940",
    "subject": "TLDO",
    "id": "3940",
    "title": "GloS:Jew-Arab Relations Today",
    "info": "Toledo, with its multi-cultural heritage, offers an appropriate backdrop for this continuing dialogue on Jewish-Arab relations in the contemporary world.  Team-taught by Arab and Israeli specialists.  Guest lectures by notable experts on Middle East problems. ",
    "prereq": []
  },
  {
    "code": "TLDO 3970",
    "subject": "TLDO",
    "id": "3970",
    "title": "Internships in Spain",
    "info": "Experiential learning in many fields. Classroom component on meaning of work in Spain and social organizational structure/culture of workplace.\n\nprereq: Two yrs of college-level Spanish",
    "prereq": []
  },
  {
    "code": "TLDO 3975",
    "subject": "TLDO",
    "id": "3975",
    "title": "Service-Learning in Spain",
    "info": "Students volunteer at one of several Toledo institutions and collaborate with immigrant population or with Spaniards who work with the immigrant community. Weekly seminar, readings, discussion, reflection, presentations.",
    "prereq": []
  },
  {
    "code": "TLDO 4479",
    "subject": "TLDO",
    "id": "4479",
    "title": "Pol:Sem:Revolution in Latin Am",
    "info": "Continuity and change in a series of case studies of Latin American revolutions, including Mexico since 1910, Peron's Argentina, Castro's Cuba, Allende's Chile, and Sandinista Nicaragua.  Topics include economic development, the military in politics, and revolutionary ideologies. ",
    "prereq": []
  },
  {
    "code": "TLDO 5313",
    "subject": "TLDO",
    "id": "5313",
    "title": "Hist:Span Army/Politics 1808-",
    "info": "Politics of pronunciamento, role of Army in origins of Spanish Civil War, military's attitude toward recent political developments in Spain, parallels and contrasts to similar problems in Latin America",
    "prereq": []
  },
  {
    "code": "TLDO 5315",
    "subject": "TLDO",
    "id": "5315",
    "title": "Hist:Sem:Span 2nd Rep& Civ War",
    "info": "Conflicts/tensions that characterized Second Republic and culminated in civil war. Students consult original documents of era to supplement class presentations.",
    "prereq": []
  },
  {
    "code": "TLDO 5321",
    "subject": "TLDO",
    "id": "5321",
    "title": "Pol:Sem:Span Democratization",
    "info": "Changes in Spain from Franco's death in 1975 to the Law for Political Reform and the Constitution of 1978.  Role of the Monarchy, Army, political parties, and trade unions in shaping the Constitution and defining Spain as a semi-federal state. ",
    "prereq": []
  },
  {
    "code": "TLDO 5331",
    "subject": "TLDO",
    "id": "5331",
    "title": "Span:Sem:Span & Euro Narrative",
    "info": "Reciprocal literary influences between Spain and rest of Europe as these apply to narrative genre, from Cervantes and picaresque works to contemporary novels of postwar Spain.",
    "prereq": []
  },
  {
    "code": "TLDO 5343",
    "subject": "TLDO",
    "id": "5343",
    "title": "Span:Seminar:Crisis of 1898",
    "info": "Impact of Spanish-American war on Spanish consciousness. Major literary works illustrate significant/far-reaching changes in attitudes, philosophy, and literature of Spanish people, induced by disaster.",
    "prereq": []
  },
  {
    "code": "TLDO 5344",
    "subject": "TLDO",
    "id": "5344",
    "title": "Span:Sem:Impact Generatn 1914",
    "info": "Intellectual currents evolving at turn of century in Spain. Major intellectual figures of several countries studied through novels, poems, autobiographies, memoirs, sociological treatises, philosophical essays, political speeches. Particular attention to Ortega and Gasset's impact on Spain, Europe, and the Americas.",
    "prereq": []
  },
  {
    "code": "TLDO 5345",
    "subject": "TLDO",
    "id": "5345",
    "title": "Span:Sem:Span Generation 1927",
    "info": "Poetic evolution, from surrealism and other \\\"isms\\\" to social poetry and later divergence brought on by civil war and, in many cases, exile. Poets studied include Lorca, Aleixandre, Guillen, Cernuda, Alberti, Altoaguirre, and Prados.",
    "prereq": []
  },
  {
    "code": "TLDO 5346",
    "subject": "TLDO",
    "id": "5346",
    "title": "Span:Sem:Lit & Span Civil War",
    "info": "Literary works of political/social nature resulting from impact of Spanish Civil War on European and American intellectuals and on Spanish exiles.",
    "prereq": []
  },
  {
    "code": "TLDO 5347",
    "subject": "TLDO",
    "id": "5347",
    "title": "Span:Sem:Poetry Postwar Spain",
    "info": "Spanish poetry in postwar period (1939-present) as seen through its most representative poets, and through groups or \\\"generations\\\" that have characterized the period.",
    "prereq": []
  },
  {
    "code": "TLDO 5380",
    "subject": "TLDO",
    "id": "5380",
    "title": "Topics",
    "info": "Major themes in the study of Spanish language and culture.",
    "prereq": []
  },
  {
    "code": "TLDO 5511",
    "subject": "TLDO",
    "id": "5511",
    "title": "LAS:Sem:Latin Am Dev Problems",
    "info": "Latin America in light of contrasting theories of Third World development and dependency.  Economic and technological dependence, possible solutions to problems of underdevelopment.  Various case studies of development strategies since nineteenth century. ",
    "prereq": []
  },
  {
    "code": "TLDO 5531",
    "subject": "TLDO",
    "id": "5531",
    "title": "Hist:Sem:Spain in L Am Insitit",
    "info": "Economic and legal structures in present day Latin America as traced from Spanish colonial practices.  Problems associated with these structures.",
    "prereq": []
  },
  {
    "code": "TLDO 5613",
    "subject": "TLDO",
    "id": "5613",
    "title": "Econ:Seminar:Spain, Port & EEC",
    "info": "The postwar movement towards European unity in light of Spain and Portugal's recent incorporation into the EEC.  Problems EEC membership may create, especially concerning agricultural policies, trade barriers, and emigration.",
    "prereq": []
  },
  {
    "code": "TLDO 5623",
    "subject": "TLDO",
    "id": "5623",
    "title": "Hist:Sem:Toward a United Europ",
    "info": "Efforts to create a united Europe, from Charlemagne to founding of European Community. Emphasizes attempts to unite Europe after World War II.",
    "prereq": []
  },
  {
    "code": "TLDO 5711",
    "subject": "TLDO",
    "id": "5711",
    "title": "Span:Topics:Span Linguistics",
    "info": "Selected problems in evolution/structure of Spanish.",
    "prereq": []
  }
]