[
    {
        "code": "ADDS 4001",
        "subject": "ADDS",
        "id": "4001",
        "title": "Prof. Pract. Add. Couns.",
        "info": "Core addictions counseling functions including clinical assessment, case management, documentation treatment planning, and ethical issues. Students begin process of securing internship.",
        "prereq": []
    },
    {
        "code": "ADDS 4002",
        "subject": "ADDS",
        "id": "4002",
        "title": "Intern. Subst. Couns. I",
        "info": "Supervised field work experience. Practical application of substance abuse counseling skills such as assessment, treatment planning, and case management.",
        "prereq": []
    },
    {
        "code": "ADDS 5001",
        "subject": "ADDS",
        "id": "5001",
        "title": "Found. in Addiction Studies",
        "info": "Theoretical perspectives/concepts related to etiology of alcohol/drug dependency/abuse. Emphasizes bio-psycho-social models of addiction/disease: psychodynamics, social learning, contingency, family systems. Connection of theory to empirical research.",
        "prereq": []
    },
    {
        "code": "ADDS 5002",
        "subject": "ADDS",
        "id": "5002",
        "title": "Intro to Evidence Based Pract.",
        "info": "Knowledge, techniques, skills, and processes for initiating, conducting, and terminating a counseling relationship. Nature/process of helping. Evidence-based practices. Reading, discussion, written exercises, role-play, observation, feedback, out-of-class experiences.",
        "prereq": []
    },
    {
        "code": "ADDS 5003",
        "subject": "ADDS",
        "id": "5003",
        "title": "Appl Psychopharm Hum Serv Prof",
        "info": "Categories of psychoactive drugs. Medications to treat mental disorders. Legal drugs such as alcohol, nicotine, cocaine, and marijuana. What is occurring physiologically when someone takes a psychoactive drug.",
        "prereq": []
    },
    {
        "code": "ADDS 5004",
        "subject": "ADDS",
        "id": "5004",
        "title": "Co-Occur Addict Mntl Hlth Dis",
        "info": "Mentally ill, chemically abusive, or dependent clients. Intervention, advocacy, education, and support for client and those who are part of his or her environment. Social, environmental, and multicultural factors. Meets partial state requirements for becoming licensed as an alcohol/drug counselor.",
        "prereq": []
    },
    {
        "code": "ADDS 5005",
        "subject": "ADDS",
        "id": "5005",
        "title": "Group Therapy: Theory & Pract.",
        "info": "Designing/facilitating therapy groups. Intra-/inter-personal dynamics, leadership skills, developmental aspects, ethical issues. Application to therapy of chemically addicted individuals. Lectures, discussion, experiential exercises, small groups, readings.",
        "prereq": []
    },
    {
        "code": "ADDS 5006",
        "subject": "ADDS",
        "id": "5006",
        "title": "Intro Resilience/Health Realiz",
        "info": "Resilience, health realization, and the link between them. Applications in students' personal, professional, and organizational lives. Relevant literature, theory, and research. ",
        "prereq": []
    },
    {
        "code": "ADDS 5007",
        "subject": "ADDS",
        "id": "5007",
        "title": "Adolescence & Substance Abuse",
        "info": "Screening, assessing, and treating adolescents. How to involve family and others. Interventions, approaches, best practices. Legal/ethical issues. Lectures, discussion, readings, exercises.",
        "prereq": []
    },
    {
        "code": "ADDS 5009",
        "subject": "ADDS",
        "id": "5009",
        "title": "Multicult Aspects of Addiction",
        "info": "What is culture? How might culture, cultural practices, and history be significant in the use/abuse of substances? How is culture relevant to the attitudes/practices in the prevention/treatment of substance use/abuse? Multicultural counseling and cultural competence in addiction counseling. People as individuals; clinician's own cultural worldview/other cultural worldviews.",
        "prereq": []
    },
    {
        "code": "ADDS 5010",
        "subject": "ADDS",
        "id": "5010",
        "title": "Special Topics",
        "info": "Topics specified in Class Schedule.",
        "prereq": []
    },
    {
        "code": "ADDS 5011",
        "subject": "ADDS",
        "id": "5011",
        "title": "Found. in Addiction Studies",
        "info": "Theoretical perspectives/concepts related to etiology of alcohol/drug dependency/abuse. Emphasizes bio-psycho-social models of addiction/disease: psychodynamics, social learning, contingency, family systems. Connection of theory to empirical research.",
        "prereq": []
    },
    {
        "code": "ADDS 5021",
        "subject": "ADDS",
        "id": "5021",
        "title": "Intro to Evidence Based Pract.",
        "info": "Initiating, conducting, and terminating a counseling relationship. Use of self in counseling process. Nature/process of helping. Evidence-based practices/theories.  Reading, discussion, written exercises, role-play, observation, feedback, out-of-class practice.",
        "prereq": []
    },
    {
        "code": "ADDS 5031",
        "subject": "ADDS",
        "id": "5031",
        "title": "Applied Psychopharmacology",
        "info": "This course provides a comprehensive survey of the basic concepts of psychopharmacology and psychiatric conditions for which psychoactive medication presents an appropriate intervention strategy. It is intended to be an introduction into the field and is designed to provide a working knowledge base to enable students to more competently address the experiences of their clients taking prescribed psychotropic medications.\n",
        "prereq": []
    },
    {
        "code": "ADDS 5041",
        "subject": "ADDS",
        "id": "5041",
        "title": "Motivational Counseling",
        "info": "Concepts of motivational interviewing. Spirit of MI. Primary counseling skills. Working with resistance. Identifying/eliciting change talk. Transitioning into change, negotiating treatment plan. Strengths/shortcoming of MI.\n",
        "prereq": []
    },
    {
        "code": "ADDS 5051",
        "subject": "ADDS",
        "id": "5051",
        "title": "Cognitive Behavioral Therapy",
        "info": "Components of cognitive model. Assessment, case formulation, automatic thoughts, core beliefs, cognitive restructuring, behavior change elements, therapeutic relationship. Learn, practice, master key concepts.",
        "prereq": []
    },
    {
        "code": "ADDS 5061",
        "subject": "ADDS",
        "id": "5061",
        "title": "Foundations of Group Work",
        "info": "Designing/facilitating therapy groups. Intra-/inter-personal dynamics, leadership skills, developmental aspects, ethical issues. Application to therapy of chemically addicted individuals. Lectures, discussion, experiential exercises, small groups, readings.",
        "prereq": []
    },
    {
        "code": "ADDS 5071",
        "subject": "ADDS",
        "id": "5071",
        "title": "Found. Co-occurring Disorders",
        "info": "Understanding mentally ill/chemically abusive or dependent client. Intervention, advocacy, education, support for client/those part of his/her environment. Social, environmental, multicultural factors that contribute resources for these clients.",
        "prereq": []
    },
    {
        "code": "ADDS 5081",
        "subject": "ADDS",
        "id": "5081",
        "title": "Multicultural Foundations",
        "info": "What is culture? How might culture, cultural practices, and history be significant in the use/abuse of substances? How is culture relevant to the attitudes/practices in the prevention/treatment of substance use/abuse? Multicultural counseling and cultural competence in addiction counseling. People as individuals. Clinician's own cultural worldview/ other cultural worldviews.",
        "prereq": []
    },
    {
        "code": "ADDS 5091",
        "subject": "ADDS",
        "id": "5091",
        "title": "Assessment & Treatment Plan I",
        "info": "Core addictions counseling. Clinical assessment, case management, documentation treatment planning, ethical issues. Students begin process of securing internship.",
        "prereq": []
    },
    {
        "code": "ADDS 5101",
        "subject": "ADDS",
        "id": "5101",
        "title": "Adolescents Co-occurring",
        "info": "Adolescents/co-occurring substance use/mental health disorders.",
        "prereq": []
    },
    {
        "code": "ADDS 5121",
        "subject": "ADDS",
        "id": "5121",
        "title": "Internship Prep",
        "info": "Prepares students for successful entry into field of substance use disorder counseling by focusing on facets that are critical to their professional development. Through discussions, experiential learning activities, guest lectures and site visits, students gain further understanding of the internship placement process and requirements, settings that fit their individual training and career goals, requirements for initial licensing and renewal, the testing process, models of professional development, the importance of professional advocacy and associations, self-care and requirements and benefits of clinical supervision. Professional ethics, including state rules, statutes, codes of conduct and regulations for practitioners and agencies are also addressed. Students will also develop their job search skills and apply them to secure a field placement for the internship seminar.",
        "prereq": []
    },
    {
        "code": "ADDS 5224",
        "subject": "ADDS",
        "id": "5224",
        "title": "Spirituality in Practice",
        "info": "Knowledge/skills of counseling students/practitioners in professional competencies for addressing spiritual/religious issues. Lecture, discussion, experiential exercises/readings to advance cognitive, interpersonal/practical skills. Treatment of persons with co-occurring disorders.",
        "prereq": []
    },
    {
        "code": "ADDS 5950",
        "subject": "ADDS",
        "id": "5950",
        "title": "Special Topics",
        "info": "Special topics in addiction studies.\n\nprereq: dept consent",
        "prereq": []
    },
    {
        "code": "ADDS 5993",
        "subject": "ADDS",
        "id": "5993",
        "title": "Directed Study",
        "info": "Directed study.\n\nprereq: dept consent",
        "prereq": []
    },
    {
        "code": "ADDS 5994",
        "subject": "ADDS",
        "id": "5994",
        "title": "Directed Research",
        "info": "Directed research.\n\nprereq: dept consent",
        "prereq": []
    },
    {
        "code": "ADDS 5996",
        "subject": "ADDS",
        "id": "5996",
        "title": "Intern. Behavioral Health",
        "info": "Internship provides Addiction Studies students with practical experience in settings where substance abuse and/or co-ocurring mental health treatment services are offered. The internship experience allows students to relate academic and theoretical learning to settings outside the classroom. General counseling skills, awareness and influence of self in the counseling process and competency in the 12 Core Functions are enhanced through clinical experience, on-site individual supervision and peer group supervision.",
        "prereq": []
    }
]