[
  {
    "code": "ADES 1170",
    "subject": "ADES",
    "id": "1170",
    "title": "Topics in Apparel Design",
    "info": "In-depth investigation of specific topic, announced in advance.",
    "prereq": []
  },
  {
    "code": "ADES 1221",
    "subject": "ADES",
    "id": "1221",
    "title": "Soft Goods Fabrication",
    "info": "This course introduces fundamental methods, tools, and techniques for\nassembling products made of soft goods (textiles). Course material covers the basics of cutting,\nsewing, pressing, and finishing textile products, with an emphasis on industrial fabrication\nmethods.\n\n",
    "prereq": []
  },
  {
    "code": "ADES 2196",
    "subject": "ADES",
    "id": "2196",
    "title": "Work Experience",
    "info": "Supervised work experience in business, industry, or government, related to student's area of study. Integrative paper or project.\n\nprereq: Plan submitted/approved by [adviser, internship supervisor], written approval of supervisor, instr consent",
    "prereq": []
  },
  {
    "code": "ADES 2211",
    "subject": "ADES",
    "id": "2211",
    "title": "Fashion Illust & Portfolio Dev",
    "info": "Illustration skills specific to garments/textiles. Traditional media/CAD applications. Critique/analysis of visual communication of apparel design concepts.",
    "prereq": []
  },
  {
    "code": "ADES 2213",
    "subject": "ADES",
    "id": "2213",
    "title": "Textile Product Analysis",
    "info": "Physical, chemical, and biological characteristics of fibers, yarns, textile structures, and finishes. Their effect on performance/appearance of textile products, including apparel, interior, and industrial textiles.",
    "prereq": []
  },
  {
    "code": "ADES 2214",
    "subject": "ADES",
    "id": "2214",
    "title": "Softlines Analysis",
    "info": "Physical characteristics of softline products related to function for target market. Class experiences based on methods of analysis, including visual inspection, quality, construction, costing, and fit/sizing.\n\nprereq: DHA major or minor or instr consent",
    "prereq": []
  },
  {
    "code": "ADES 2221",
    "subject": "ADES",
    "id": "2221",
    "title": "Design in 3 Dimensions",
    "info": "This class is an introduction to designing in 3 dimensions, with consideration of how 3D shapes are used and how they are formed. Course content explores the relationship between 2-dimensional and 3-dimensional shapes (flattening), as well as additive and subtractive methods of creating shapes. Software tools for modeling in 3 dimensions will be introduced.",
    "prereq": []
  },
  {
    "code": "ADES 2222",
    "subject": "ADES",
    "id": "2222",
    "title": "Apparel Studio II",
    "info": "Design process in developing apparel for specific user group. Advanced principles/methods of developing patterns for body, including flat pattern, draping, fitting. Computer-aided design tools for illustration, pattern making.\n\nprereq: [2221 or DHA 2221] with a grade of at least C-, Apparel Design major, pass portfolio review",
    "prereq": {
      "or": [
        {
          "code": "ADES 2221",
          "subject": "ADES",
          "id": "2221"
        },
        {
          "code": "DHA 2221",
          "subject": "DHA",
          "id": "2221"
        }
      ]
    }
  },
  {
    "code": "ADES 3121",
    "subject": "ADES",
    "id": "3121",
    "title": "History of Fashion",
    "info": "Survey of apparel and appearances in Western cultures, from the 18th century to the present. Role of gender, race, and class with respect to the change in dress within historical moments and social contexts will be addressed. Students will learn and apply research approaches and methods in the study and interpretation of dress using objects from the Goldstein Museum of Design.",
    "prereq": []
  },
  {
    "code": "ADES 3170",
    "subject": "ADES",
    "id": "3170",
    "title": "Topics",
    "info": "In-depth investigation of specific topic.",
    "prereq": []
  },
  {
    "code": "ADES 3196",
    "subject": "ADES",
    "id": "3196",
    "title": "Field Study: Natl/Intl",
    "info": "Faculty-directed field study in a national or international setting.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "ADES 3217",
    "subject": "ADES",
    "id": "3217",
    "title": "Fashion: Trends & Comm",
    "info": "Relation of fashion trends to visual analysis of apparel. Application to design/retail. Study of techniques and processes of identifying socio-cultural indicators, past and present trends, and methods for determining future trends in fashion and related industries. Communication skills are developed through assignments, in-class activities, lecture/discussion, guest-speaker presentations, and a trend forecasting project.",
    "prereq": []
  },
  {
    "code": "ADES 3223",
    "subject": "ADES",
    "id": "3223",
    "title": "Apparel Studio III",
    "info": "Study tailored/non-tailored apparel structures. Experiment with various materials/structures using traditional/innovative methods. Principles of manipulating materials/structures applied to series of garments.\n\nprereq: [2222 or DHA 2222] with grade of at least C-, Apparel Design major, pass portfolio review",
    "prereq": {
      "or": [
        {
          "code": "ADES 2222",
          "subject": "ADES",
          "id": "2222"
        },
        {
          "code": "DHA 2222",
          "subject": "DHA",
          "id": "2222"
        }
      ]
    }
  },
  {
    "code": "ADES 3224W",
    "subject": "ADES",
    "id": "3224W",
    "title": "Functional Clothing Design",
    "info": "Principles and theory of functional apparel design. Conduct and apply research in designing apparel for situations requiring thermal or impact protection, accommodation for mobility, or facilitation for bodily function.",
    "prereq": []
  },
  {
    "code": "ADES 3225",
    "subject": "ADES",
    "id": "3225",
    "title": "Apparel Design Research",
    "info": "Market/visual research to support development of apparel line directed at specific audience.\n\nprereq: 3324 or concurrent registration is required (or allowed) in DHA 3224",
    "prereq": {
      "or": [
        {
          "code": "ADES 3324",
          "subject": "ADES",
          "id": "3324"
        },
        {
          "code": "DHA 3224",
          "subject": "DHA",
          "id": "3224"
        }
      ]
    }
  },
  {
    "code": "ADES 3226",
    "subject": "ADES",
    "id": "3226",
    "title": "Collection Development",
    "info": "Development of apparel and sewn product concepts for specific consumer contexts. Focus on iterative design of an assortment of product concepts that form a cohesive whole. Assortment strategy, consumer profile, price point, and product context are considered. Product concepts are developed using a research-based design process, and rendered in 2 and 3 dimensions.",
    "prereq": []
  },
  {
    "code": "ADES 3227",
    "subject": "ADES",
    "id": "3227",
    "title": "Design for Manufacturing",
    "info": "Technical development of sewn products for production and manufacture, with an emphasis on effective communication in a team environment. Sample assessment for geometry, aesthetics, and quality. Iterative development of technical specifications and the technical package, garment patterns, and samples. Materials sourcing and supply chain. Production design and assessment.",
    "prereq": []
  },
  {
    "code": "ADES 3228",
    "subject": "ADES",
    "id": "3228",
    "title": "Portfolio Development",
    "info": "Students expand/refine a body of design work to develop a professional apparel design portfolio. Critique current work, develop new portfolio pieces, and plan a strategy to present their work and themselves in a professional context.",
    "prereq": []
  },
  {
    "code": "ADES 4193",
    "subject": "ADES",
    "id": "4193",
    "title": "Dir Study in Apparel Design",
    "info": "Independent study in Design, Housing, and Apparel under tutorial guidance.\n\nprereq: Undergrad, instr consent",
    "prereq": []
  },
  {
    "code": "ADES 4196",
    "subject": "ADES",
    "id": "4196",
    "title": "Internship",
    "info": "Supervised work experience relating activity in business, industry, or government to student's area of study. Integrative paper or project may be required.\n\nprereq: Completion of at least one-half of professional sequence, plan submitted and approved in advance by adviser and internship supervisor, written consent of faculty supervisor, instr consent",
    "prereq": []
  },
  {
    "code": "ADES 4215",
    "subject": "ADES",
    "id": "4215",
    "title": "Product Development",
    "info": "Product development for apparel and other sewn products. Developing products in a lab studio for effectiveness, reliability, and marketability. Team approach using merchandising/design principles to develop products for specific markets.\n\nprereq: 2213 or DHA 2213 or apparel design major or clothing design major or retail merchandising major or instr consent",
    "prereq": {
      "or": [
        {
          "code": "ADES 2213",
          "subject": "ADES",
          "id": "2213"
        },
        {
          "code": "DHA 2213",
          "subject": "DHA",
          "id": "2213"
        }
      ]
    }
  },
  {
    "code": "ADES 4218W",
    "subject": "ADES",
    "id": "4218W",
    "title": "Fashion, Dsgn, Global Industry",
    "info": "Relationship of fashion, dress, and culture to fashion industry. Globalization, fashion centers, design, time/place. Focuses on Chinese fashion industry.\n\nprereq: Upper level undergraduate or grad student",
    "prereq": []
  },
  {
    "code": "ADES 4225",
    "subject": "ADES",
    "id": "4225",
    "title": "Apparel Design Studio V",
    "info": "Market research information/implementation. Designing for specific audience, market, user group. Applying market research to design line of apparel. Research of promotional methods for design project.\n\nprereq: [[3224 or DHA 3224], [3225 or DHA 3225]] with grade of at least C-, apparel design major",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "ADES 3224",
              "subject": "ADES",
              "id": "3224"
            },
            {
              "code": "DHA 3224",
              "subject": "DHA",
              "id": "3224"
            }
          ]
        },
        {
          "or": [
            {
              "code": "ADES 3225",
              "subject": "ADES",
              "id": "3225"
            },
            {
              "code": "DHA 3225",
              "subject": "DHA",
              "id": "3225"
            }
          ]
        }
      ]
    }
  },
  {
    "code": "ADES 4226",
    "subject": "ADES",
    "id": "4226",
    "title": "Apparel Studio VI",
    "info": "Synthesis of apparel design work based on concepts in previous studio classes. Principles of mass production applied to design projects completed in 4225. Implementation of public promotion of a apparel line. Individual strategies for promoting career goals. Exhibition/portfolio presentations.",
    "prereq": []
  }
]