[
  {
    "code": "AEM 1301",
    "subject": "AEM",
    "id": "1301",
    "title": "Ballooning: Design, Build, Fly",
    "info": "Outer space, sometimes called the “Final Frontier,” has always been difficult to reach due to the tremendous expense of rocket launches and the limited number of launch opportunities. In this hands-on course, we will hone “amateur-spacecraft”-building skills including light-weight-but-rugged structural assembly, microcontroller programming, soldering, wiring, and CAD. Then we will design and build miniature spacecraft and use relatively-inexpensive helium-filled weather balloons to carry them into the stratosphere (AKA “near-space”), which has many of the same physical properties (and view!) as outer space. The overarching theme for Fall 2022 payloads will be “Preparing for eclipse ballooning missions\n(to be conducted during solar eclipses in October 2023 and April 2024).”\n\nThe balloon launch and recovery will be a required day-long class activity on a weekend date in late October or early November. This activity is weather dependent, so the flight date will need to be flexible. A “primary” date and several back-up dates will be announced at the start of the semester. After the balloon flight, the remainder of the semester will involve data analysis as well as discussions and activities relating to full-fledged (i.e. outer space) spaceflight, including scientific accomplishments and engineering challenges of past, current, and future space missions.",
    "prereq": []
  },
  {
    "code": "AEM 1303",
    "subject": "AEM",
    "id": "1303",
    "title": "Aircraft: design, build, fly",
    "info": "Now ubiquitous, powered aircraft flight is little more than a century old. In this hands-on seminar, we will explore the fundamentals of flight through the design, flight test, and analysis of small, UAV (uninhabited aerial vehicle) aircraft. Initially, we will cover the history and fundamentals of flight through lectures and discussion, answering questions such as, \\\"how do aircraft fly?\\\" and \\\"why do aircraft look so similar?\\\" Then, working in small teams, students will design, build, and flight test an electric remote-control aircraft. Students will analyze the flight tests to see if the aircraft performed as expected, write reports, and present on the results. Additional elements of the seminar may include lectures, discussions, and activities associated with aircraft, including the engineering challenges of past, current, and future aircraft.",
    "prereq": []
  },
  {
    "code": "AEM 1305",
    "subject": "AEM",
    "id": "1305",
    "title": "Rocketry: Design, Build, Fly",
    "info": "This hands-on course will take students beyond (Estes-type) \\\"model rocketry\\\" into the realm of \\\"high-power rocketry,\\\" building rockets with H-size (or larger) motors, some capable of reaching altitudes of several thousand feet! The class will begin by building a \\\"kit\\\" rocket (in teams) then attending a day-long \\\"Round 1\\\" launch event with will be a required class activity for a weekend date mid-semester. This will be followed by designing then building a \\\"Round 2\\\" custom \\\"scratch\\\" rocket (in teams) then sending representatives of the team to launch it late in the semester. In addition to learning basic rocketry physics, using rocketry computer simulations, constructing high-power rockets, and flying them, this class will include lectures, discussions, and activities associated with the past, present, and future of \\\"real-spaceflight rocketry\\\" for manned and unmanned rocket-powered missions to low-Earth-orbit and beyond.  \n\nRequired all-day class flight activities, often on a Saturday mid-semester. High-power rocketry classes will have a second class flight date to which every team will need to send attendees.  Specific launch date(s) will be announced at the beginning of the semester. Transportation to rocket launches will be provided.\n\nprereq: Freshman, able to attend all-day flight activities",
    "prereq": []
  },
  {
    "code": "AEM 1805",
    "subject": "AEM",
    "id": "1805",
    "title": "First Year Projects Air Space",
    "info": "Topics related to air and space travel with an emphasis on hands-on projects and activities.",
    "prereq": []
  },
  {
    "code": "AEM 1905",
    "subject": "AEM",
    "id": "1905",
    "title": "Aircraft and Spacecraft",
    "info": "Topics related to air and space travel with an emphasis on hands-on projects and activities.",
    "prereq": []
  },
  {
    "code": "AEM 2011",
    "subject": "AEM",
    "id": "2011",
    "title": "Statics",
    "info": "Force/moment vectors, resultants. Principles of statics and free-body diagrams. Applications to simple trusses, frames, and machines. Distributed loads. Internal forces in beams. Properties of areas, second moments. Laws of friction.\n\nprereq: PHYS 1301W, [concurrent registration is required (or allowed) in Math 2374 or equiv], CSE",
    "prereq": {
      "and": [
        {
          "code": "PHYS 1301W",
          "subject": "PHYS",
          "id": "1301W"
        },
        {
          "code": "MATH 2374",
          "subject": "MATH",
          "id": "2374"
        }
      ]
    }
  },
  {
    "code": "AEM 2012",
    "subject": "AEM",
    "id": "2012",
    "title": "Dynamics",
    "info": "Kinematics/kinetics of particles. Newton's laws. Energy/momentum methods. Systems of particles. Kinematics/kinetics of planar motions of rigid bodies. Plane motion of rigid bodies. Mechanical vibrations.\n\nprereq: 2011, [concurrent registration is required (or allowed) in  Math 2373 or equiv], CSE student",
    "prereq": {
      "and": [
        {
          "code": "AEM 2011",
          "subject": "AEM",
          "id": "2011"
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        }
      ]
    }
  },
  {
    "code": "AEM 2021",
    "subject": "AEM",
    "id": "2021",
    "title": "Statics & Dynamics",
    "info": "Force/moment vectors, resultants. Principles of statics and free-body diagrams. Applications to simple trusses, frames, and machines. Properties of areas, second moments. Internal forces in beams. Laws of friction. Principles of particle dynamics. Mechanical systems and rigid-body dynamics. Kinematics/dynamics of plane systems. Energy/momentum of 2-D bodies/systems.\n\nprereq: Phys 1301W, [concurrent registration is required (or allowed) in Math 2374 or equiv], CSE",
    "prereq": {
      "and": [
        {
          "code": "PHYS 1301W",
          "subject": "PHYS",
          "id": "1301W"
        },
        {
          "code": "MATH 2374",
          "subject": "MATH",
          "id": "2374"
        }
      ]
    }
  },
  {
    "code": "AEM 2031",
    "subject": "AEM",
    "id": "2031",
    "title": "Mechanics for Materials Engrs.",
    "info": "This course covers the basics of equilibrium of rigid and deformable bodies for Materials Engineers. The course begins with the principles of statics, including a review of vector operations and analysis of moments and resultant forces from multiple loads, including distributed loads, equilibrium and free body diagrams, center of gravity and moments of inertia.   The course then moves on to explore stress and strain, including normal and shear stresses, and stress and strain transformations. Then the materials properties of interest to the mechanical response and testing procedures used to determine these properties are discussed. Lastly, the stresses and strains associated with common loading modes (e.g., axial, torsion, shear and bending) are covered. Modes of failure, including yielding and buckling, are also introduced.\n\nprereq: Math 2374, Math 2373 (concurrent allowed), Phys 1301W, CSE Student, Materials Engineering Major or premajor",
    "prereq": {
      "and": [
        {
          "code": "MATH 2374",
          "subject": "MATH",
          "id": "2374"
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        },
        {
          "code": "PHYS 1301",
          "subject": "PHYS",
          "id": "1301"
        }
      ]
    }
  },
  {
    "code": "AEM 2301",
    "subject": "AEM",
    "id": "2301",
    "title": "Mechanics of Flight",
    "info": "Standard atmospheric properties, basic aerodynamics, generation of lift/drag. Airfoils, finite wings. Elements of aircraft performance and atmospheric flight mechanics.  Introduction to MatLab and simulations for aircraft design.\n\nprereq: PHYS 1301W, [concurrent registration is required (or allowed) in MATH 2373 or equiv], CSE",
    "prereq": {
      "and": [
        {
          "code": "PHYS 1301W",
          "subject": "PHYS",
          "id": "1301W"
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        }
      ]
    }
  },
  {
    "code": "AEM 3031",
    "subject": "AEM",
    "id": "3031",
    "title": "Deform. Body Mech.",
    "info": "Uniaxial loading/deformation. Stress/strain at point, Mohr's circle. Internal forces in beams. Material behavior, linear elasticity. Torsion of circular shafts. Bending of beams of symmetrical section. Column buckling. Statically indeterminate structures.\n\nprereq: [2011 or 2021 or [BMEN 3011, BMEN major]], [Math 2374 or equiv], [concurrent registration is required (or allowed) in Math 2373 or equiv], CSE",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "AEM 2011",
              "subject": "AEM",
              "id": "2011"
            },
            {
              "code": "AEM 2021",
              "subject": "AEM",
              "id": "2021"
            },
            {
              "code": "BMEN 3011",
              "subject": "BMEN",
              "id": "3011"
            }
          ]
        },
        {
          "code": "MATH 2374",
          "subject": "MATH",
          "id": "2374"
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        }
      ]
    }
  },
  {
    "code": "AEM 3100",
    "subject": "AEM",
    "id": "3100",
    "title": "Software Applications in AEM",
    "info": "Topics covering software applications for problems of interest.\n\nprereq: [CSCI 1113 or equiv]",
    "prereq": {
      "code": "CSCI 1113",
      "subject": "CSCI",
      "id": "1113"
    }
  },
  {
    "code": "AEM 3103",
    "subject": "AEM",
    "id": "3103",
    "title": "Computer Methods",
    "info": "Mathematical modeling of engineering systems/numerical methods for their solution. Use of MATLAB. Focus on systems found in aerospace engineering/mechanics.\n\nprereq: [MATH 2373 or equiv], AEM major",
    "prereq": {
      "code": "MATH 2373",
      "subject": "MATH",
      "id": "2373"
    }
  },
  {
    "code": "AEM 3391",
    "subject": "AEM",
    "id": "3391",
    "title": "Independent Design Project",
    "info": "Independent design project construction/testing under guidance of faculty member. Group projects allowed. Students responsible for finding faculty adviser for project. Final project report (written or oral).\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 4001",
    "subject": "AEM",
    "id": "4001",
    "title": "Teacher Workshop",
    "info": "Lectures, film reviews, construction and demonstration of classroom aids, involvement with the NASA spacemobile, flight experience, field trips covering topics such as satellites and probes, model rocketry including a launch, astronaut in space, principles of flight, conventional aircraft, space age education tools. Visits to local aerospace facility and to major aerospace installation (subject to availability of airlift).",
    "prereq": []
  },
  {
    "code": "AEM 4002",
    "subject": "AEM",
    "id": "4002",
    "title": "Advanced Workshop",
    "info": "Advanced workshop for secondary math, science, and aerospace teachers. Uses contemporary NASA design projects to provide new teaching tools to stimulate student interest in math and physics.",
    "prereq": []
  },
  {
    "code": "AEM 4201",
    "subject": "AEM",
    "id": "4201",
    "title": "Fluid Mechanics",
    "info": "First course in fluid mechanics. Stress/strain rate descriptions, fluid statics. Use of differential and finite control volume analysis with continuity. Momentum/energy equations, Bernoulli/Euler equations, vorticity, potential flow, incompressible viscous flow using Navier-Stokes equations, dimensional analysis, pipe flow, boundary layers, separation, introduction to turbulence.\n\nprereq: 2012, [Math 2373 or equiv], [Math 2374 or equiv], [CSE upper div or grad student]",
    "prereq": {
      "and": [
        {
          "code": "AEM 2012",
          "subject": "AEM",
          "id": "2012"
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        },
        {
          "code": "MATH 2374",
          "subject": "MATH",
          "id": "2374"
        }
      ]
    }
  },
  {
    "code": "AEM 4202",
    "subject": "AEM",
    "id": "4202",
    "title": "Aerodynamics",
    "info": "Inviscid aerodynamics. Subsonic, transonic, and supersonic airfoil theory; wing theory. Introduction to compressible flow, normal and oblique shock waves, Prandtl-Meyer expansions. Linearized compressible flow. Wing-body combinations. Computational aerodynamics methods.\n\nprereq: upper div CSE or grad, 4201",
    "prereq": {
      "code": "AEM 4201",
      "subject": "AEM",
      "id": "4201"
    }
  },
  {
    "code": "AEM 4203",
    "subject": "AEM",
    "id": "4203",
    "title": "Aero. Propulsion",
    "info": "Basic one-dimensional flows: isentropic, area change, heat addition. Overall performance characteristics of propellers, ramjets, turbojets, turbofans, rockets. Performance analysis of inlets, exhaust nozzles, compressors, burners, and turbines. Rocket flight performance, single-/multi-stage chemical rockets, liquid/solid propellants.\n\nprereq: 4202, [CSE upper div or grad student]",
    "prereq": {
      "code": "AEM 4202",
      "subject": "AEM",
      "id": "4202"
    }
  },
  {
    "code": "AEM 4243",
    "subject": "AEM",
    "id": "4243",
    "title": "Adv Aerodynamics",
    "info": "Interaction between pressure distribution and boundary-layer growth on air foils of arbitrary shape.  Inviscid flow past non-planar wings of specified planform.",
    "prereq": []
  },
  {
    "code": "AEM 4247",
    "subject": "AEM",
    "id": "4247",
    "title": "Hypersonic Aerodynamics",
    "info": "Importance/properties of hypersonic flow. Hypersonic shock and expansion-wave relations. Local surface inclination methods. Approximate/exact methods for hypersonic inviscid flow fields. Viscous flow: boundary layers, aerodynamic heating, hypersonic viscous interactions, computational methods. Hypersonic propulsion and vehicle design.\n\nprereq: 4202, CSE upper division",
    "prereq": {
      "code": "AEM 4202",
      "subject": "AEM",
      "id": "4202"
    }
  },
  {
    "code": "AEM 4253",
    "subject": "AEM",
    "id": "4253",
    "title": "Computational Fluid Mechanics",
    "info": "Introductory concepts in finite difference and finite volume methods as applied to various ordinary/partial differential model equations in fluid mechanics. Fundamentals of spatial discretization and numerical integration. Numerical linear algebra. Introduction to engineering and scientific computing environment. Advanced topics may include finite element methods, spectral methods, grid generation, turbulence modeling.\n\nprereq: 4201, CSCI 1113, CSE upper division",
    "prereq": {
      "and": [
        {
          "code": "AEM 4201",
          "subject": "AEM",
          "id": "4201"
        },
        {
          "code": "CSCI 1113",
          "subject": "CSCI",
          "id": "1113"
        }
      ]
    }
  },
  {
    "code": "AEM 4290",
    "subject": "AEM",
    "id": "4290",
    "title": "Topics in Fluid Mechanics",
    "info": "Topics vary each semester within the field of Fluid Mechanics\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 4293",
    "subject": "AEM",
    "id": "4293",
    "title": "Directed Studies - Fluid Mech",
    "info": "Topics of current interest. Individual projects with consent of faculty sponsor.\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 4301",
    "subject": "AEM",
    "id": "4301",
    "title": "Orbital Mechanics",
    "info": "The two-body problem. Earth-satellite operations, rocket performance, reentry dynamics, space environments, interplanetary trajectories. Numerical simulations. Design project.\n\nprereq: [2012 or equiv], [MATH 2373 or equiv], [CSE upper div or grad student]",
    "prereq": {
      "and": [
        {
          "code": "AEM 2012",
          "subject": "AEM",
          "id": "2012"
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        }
      ]
    }
  },
  {
    "code": "AEM 4303W",
    "subject": "AEM",
    "id": "4303W",
    "title": "Flight Dynamics",
    "info": "Forces/moments, trim, linearization, transfer functions, dynamic response characteristics for aircraft. Aircraft stability/control derivatives, static longitudinal/lateral stability. Phugoid, short period, spiral, roll subsidence, dutch roll modes. Handling qualities. Design project.\n\nprereq: [2012, 2301, 3101, [WRIT 1301 or equiv], [CSE upper div or grad student]] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "AEM 2012",
          "subject": "AEM",
          "id": "2012"
        },
        {
          "code": "AEM 2301",
          "subject": "AEM",
          "id": "2301"
        },
        {
          "code": "AEM 3101",
          "subject": "AEM",
          "id": "3101"
        },
        {
          "code": "WRIT 1301",
          "subject": "WRIT",
          "id": "1301"
        }
      ]
    }
  },
  {
    "code": "AEM 4305",
    "subject": "AEM",
    "id": "4305",
    "title": "Spacecraft Dynamics",
    "info": "Kinematics/dynamics for six-degree of freedom rigid body motions. Euler's angles/equations. Torque free motion, spin stabilization, dual-spin spacecraft, nutation damping, gyroscopic attitude control, gravity gradient stabilization. Linear systems analysis, Laplace transforms, transfer functions. Linear control theory. PID controllers.\n\nprereq: [4301, [3101 or ME 3281 or EE 3015], CSE upper div] or grad student",
    "prereq": {
      "and": [
        {
          "code": "AEM 4301",
          "subject": "AEM",
          "id": "4301"
        },
        {
          "or": [
            {
              "code": "AEM 3101",
              "subject": "AEM",
              "id": "3101"
            },
            {
              "code": "ME 3281",
              "subject": "ME",
              "id": "3281"
            },
            {
              "code": "EE 3015",
              "subject": "EE",
              "id": "3015"
            }
          ]
        }
      ]
    }
  },
  {
    "code": "AEM 4311",
    "subject": "AEM",
    "id": "4311",
    "title": "Flight Control",
    "info": "Analysis and synthesis of automatic control systems. Transfer functions.  Root locus, Nyquist and Bode techniques.  Introduction to state space formulation.  Applications, design project, lab.",
    "prereq": []
  },
  {
    "code": "AEM 4321",
    "subject": "AEM",
    "id": "4321",
    "title": "Automatic Control Systems",
    "info": "Modeling, characteristics, and performance of feedback control systems. Stability, root locus, and frequency response methods. Nyquist and Bode diagrams. Lead-lag and PID compensators. Digital implementation and hardware considerations.\n\nprereq: CSE upper div or grad student",
    "prereq": []
  },
  {
    "code": "AEM 4331",
    "subject": "AEM",
    "id": "4331",
    "title": "Aerospace Vehicle Design",
    "info": "Multidisciplinary student teams perform conceptual designs of aerospace vehicles, components, missions, or systems that incorporate realistic constraints/applicable engineering standards. Papers on professional ethics/contemporary aerospace issues. Oral preliminary/critical design reviews.\n\nprereq: [2301, 4202, AEM sr] or instr consent",
    "prereq": {
      "and": [
        {
          "code": "AEM 2301",
          "subject": "AEM",
          "id": "2301"
        },
        {
          "code": "AEM 4202",
          "subject": "AEM",
          "id": "4202"
        }
      ]
    }
  },
  {
    "code": "AEM 4332W",
    "subject": "AEM",
    "id": "4332W",
    "title": "Aerospace Design II",
    "info": "Student teams design space vehicle, system, or mission with realistic design constraints, detailed design proposals, schedules/milestones, CAD/CAM, space environments, atmosphere entry, attitude determination/control, configuration/structure, thermal environment, power propulsion, and telecommunications. Students keep design log/notebook, prepare status reports, written report, and oral presentation.",
    "prereq": []
  },
  {
    "code": "AEM 4333",
    "subject": "AEM",
    "id": "4333",
    "title": "Aerospace Design Projects",
    "info": "Student groups design, build, and test aerospace projects. Projects include designs from AEM4331 or projects such as microgravity experiments. Students create and maintain an electronic project data repository, prepare weekly status reports, build and test their design, and prepare a final report. prereq: 4331 or instr consent",
    "prereq": {
      "code": "AEM 4331",
      "subject": "AEM",
      "id": "4331"
    }
  },
  {
    "code": "AEM 4351",
    "subject": "AEM",
    "id": "4351",
    "title": "Decelerator Systems",
    "info": "Parachutes, other aerodynamic decelerators. Types, applications. Drag coefficients and steady descent. Stability. Deployment and opening forces. Apparent mass effects, trajectory analysis, engineering properties of textile materials, design projects.",
    "prereq": []
  },
  {
    "code": "AEM 4371",
    "subject": "AEM",
    "id": "4371",
    "title": "Helicopter Aerodynamics",
    "info": "Review of basic aerodynamics, unique features of helicopters, momentum theory in axial flight/rotor flow states, momentum theory in non-axial flight, blade-element theory, vortex theory, helicopter equations of motion. Design project.",
    "prereq": []
  },
  {
    "code": "AEM 4391",
    "subject": "AEM",
    "id": "4391",
    "title": "Independent Design Project",
    "info": "Independent design project construction and testing under the guidance of a faculty member. Projects may include designs from 4331 and group projects are allowed. Students are responsible for finding a faculty adviser for their project. Final project report (written or oral).\n\nprereq: 4331, dept consent",
    "prereq": {
      "code": "AEM 4331",
      "subject": "AEM",
      "id": "4331"
    }
  },
  {
    "code": "AEM 4490",
    "subject": "AEM",
    "id": "4490",
    "title": "Topics in Aerospace Systems",
    "info": "Topics vary each semester within the field of Aerospace Systems",
    "prereq": []
  },
  {
    "code": "AEM 4493",
    "subject": "AEM",
    "id": "4493",
    "title": "Dirctd Stdy Aerospace Systems",
    "info": "Topics of current interest. Individual projects with consent of faculty sponsor. prereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 4501",
    "subject": "AEM",
    "id": "4501",
    "title": "Aero Structures",
    "info": "Advanced strength of materials analysis of elastic structures with aerospace applications; failure modes and criteria, buckling, matrix methods for analysis, plane truss design; energy and Castigliano methods for statically determinate and indeterminate structures; torsion and bending of asymmetrical thin-walled sections. Design project.\n\nprereq: CSE upper div or grad, 3031 or equiv",
    "prereq": {
      "code": "AEM 3031",
      "subject": "AEM",
      "id": "3031"
    }
  },
  {
    "code": "AEM 4502",
    "subject": "AEM",
    "id": "4502",
    "title": "Comp. Structures",
    "info": "Application of finite element methods to problems in structural analysis. Emphasizes properly posing problems and interpreting calculation results. Use of commercial FEA packages. Introduction to theory of finite elements.\n\nprereq: [Grade of at least C in 4501, [CSE upper div or grad student]] or instr consent",
    "prereq": {
      "code": "AEM 4501",
      "subject": "AEM",
      "id": "4501"
    }
  },
  {
    "code": "AEM 4511",
    "subject": "AEM",
    "id": "4511",
    "title": "Composite Materials",
    "info": "Analysis, design, and applications of laminated and chopped fiber reinforced composites. Micro-/macro-mechanical analysis of elastic constants, failure, and environmental degradation. Design project. prereq: 3031 (or 2031 if MatSci), [CSE upper div or grad student]",
    "prereq": [
      {
        "code": "AEM 3031",
        "subject": "AEM",
        "id": "3031"
      },
      {
        "code": "AEM 2031",
        "subject": "AEM",
        "id": "2031"
      }
    ]
  },
  {
    "code": "AEM 4581",
    "subject": "AEM",
    "id": "4581",
    "title": "Mechanics of Solids",
    "info": "Continuum mechanics in one dimension: kinematics; mass, momentum/energy, constitutive theory. Wave propagation, heat conduction. Strings. Euler-Bernoulli theory. 3-D deformations/stress. Topics from fracture mechanics, structural stability, vibrations, thin films, layered media, smart materials, phase transformations, 3-D elastic wave propagation. Elasticity, viscoelasticity, plasticity.\n\nprereq: 3031, [Math 2373 or equiv], [Math 2374 or equiv], CSE upper div",
    "prereq": {
      "and": [
        {
          "code": "AEM 3031",
          "subject": "AEM",
          "id": "3031"
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        },
        {
          "code": "MATH 2374",
          "subject": "MATH",
          "id": "2374"
        }
      ]
    }
  },
  {
    "code": "AEM 4590",
    "subject": "AEM",
    "id": "4590",
    "title": "Topics in Solids",
    "info": "Topics vary each semester within the field of Solid Mechanics and Materials\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 4593",
    "subject": "AEM",
    "id": "4593",
    "title": "Directed Stdy Solid Mechanics",
    "info": "Topics of current interest. Individual projects with consent of faculty sponsor. prereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 4601",
    "subject": "AEM",
    "id": "4601",
    "title": "Instrumentation Laboratory",
    "info": "Introduction to lab instrumentation. Computerized data acquisition. Statistical analysis of data. Time series data, spectral analysis. Transducers for measurement of solid, fluid, and dynamical quantities. Design of experiments.\n\nprereq: CSci 1113, EE 3005, EE 3006, [upper div BAEM]",
    "prereq": {
      "and": [
        {
          "code": "CSCI 1113",
          "subject": "CSCI",
          "id": "1113"
        },
        {
          "code": "EE 3005",
          "subject": "EE",
          "id": "3005"
        },
        {
          "code": "EE 3006",
          "subject": "EE",
          "id": "3006"
        }
      ]
    }
  },
  {
    "code": "AEM 4602W",
    "subject": "AEM",
    "id": "4602W",
    "title": "Aeromechanics Lab",
    "info": "Experimental methods/design in fluid/solid mechanics. Wind tunnel/water channel experiments with flow visualization, pressure, velocity, force measurements. Measurement of stresses/strains/displacements in solids/ structures: stress concentrations, materials behavior, structural dynamics. Computerized data acquisition/analysis, error analysis, data reduction. Experiment design. Written/oral reports. Lab ethics. Writing intensive.\n\nprereq: 4201, 4501, 4601, [WRIT 1301 or equiv], [CSE upper div or grad]",
    "prereq": {
      "and": [
        {
          "code": "AEM 4201",
          "subject": "AEM",
          "id": "4201"
        },
        {
          "code": "AEM 4501",
          "subject": "AEM",
          "id": "4501"
        },
        {
          "code": "AEM 4601",
          "subject": "AEM",
          "id": "4601"
        },
        {
          "code": "WRIT 1301",
          "subject": "WRIT",
          "id": "1301"
        }
      ]
    }
  },
  {
    "code": "AEM 4681",
    "subject": "AEM",
    "id": "4681",
    "title": "Acoustics",
    "info": "Derivation of the wave equation, plane wave solution, transmission and reflection at boundaries, resonators and mufflers, three dimensional wave propagation, properties of environmental noise sources, hearing and perception of sound, acoustic properties of rooms, lab experience in sound and noise measurements, noise control techniques.",
    "prereq": []
  },
  {
    "code": "AEM 4796",
    "subject": "AEM",
    "id": "4796",
    "title": "Professional Experience",
    "info": "Work experience with substantive engineering component. Written report.\n\nprereq: CSE upper div, AEM major, dept consent",
    "prereq": []
  },
  {
    "code": "AEM 4821",
    "subject": "AEM",
    "id": "4821",
    "title": "Honors Thesis I",
    "info": "Individual projects under direction of AEM faculty member.",
    "prereq": []
  },
  {
    "code": "AEM 4822W",
    "subject": "AEM",
    "id": "4822W",
    "title": "Honors Thesis II",
    "info": "Individual projects under the direction of AEM faculty member.  ",
    "prereq": []
  },
  {
    "code": "AEM 4894",
    "subject": "AEM",
    "id": "4894",
    "title": "Directed Study: Honors Thesis",
    "info": "Writing thesis under direction of AEM faculty member.\n\nprereq: Honors student, permission of University Honors Program, AEM major",
    "prereq": []
  },
  {
    "code": "AEM 4896",
    "subject": "AEM",
    "id": "4896",
    "title": "International Experience",
    "info": "International work experience with substantive engineering component. Written report.\n\nprereq: CSE upper div, AEM major, dept consent",
    "prereq": []
  },
  {
    "code": "AEM 5245",
    "subject": "AEM",
    "id": "5245",
    "title": "Hypersonic Aerodyn",
    "info": "Importance/properties of hypersonic flow.  Hypersonic shock and expansion-wave relations. Local surface inclination methods. Approximate/exact methods for hypersonic inviscid flow fields. Viscous flow: boundary layers, aerodynamic heating, hypersonic viscous interactions, computational methods. Hypersonic propulsion and vehicle design.",
    "prereq": []
  },
  {
    "code": "AEM 5247",
    "subject": "AEM",
    "id": "5247",
    "title": "Hypersonic Aerodynamics",
    "info": "Importance/properties of hypersonic flow. Hypersonic shock and expansion-wave relations. Local surface inclination methods. Approximate/exact methods for hypersonic inviscid flow fields. Viscous flow: boundary layers, aerodynamic heating, hypersonic viscous interactions, computational methods. Hypersonic propulsion and vehicle design.\n\nprereq: 4202 or equiv, CSE grad student",
    "prereq": {
      "code": "AEM 4202",
      "subject": "AEM",
      "id": "4202"
    }
  },
  {
    "code": "AEM 5251",
    "subject": "AEM",
    "id": "5251",
    "title": "Comp Fluids",
    "info": "Introductory concepts in finite difference and finite volume methods as applied to various ordinary/partial differential model equations in fluid mechanics. Fundamentals of spatial discretization and numerical integration. Numerical linear algebra. Introduction to engineering and scientific computing environment. Advanced topics may include finite element methods, spectral methods, grid generation, turbulence modeling.",
    "prereq": []
  },
  {
    "code": "AEM 5253",
    "subject": "AEM",
    "id": "5253",
    "title": "Comp Fluids",
    "info": "Introductory concepts in finite difference and finite volume methods as applied to various ordinary/partial differential model equations in fluid mechanics. Fundamentals of spatial discretization and numerical integration. Numerical linear algebra. Introduction to engineering and scientific computing environment. Advanced topics may include finite element methods, spectral methods, grid generation, turbulence modeling.\n\nprereq: [4201 or equiv], [CSci 1113 or equiv], CSE grad student",
    "prereq": {
      "and": [
        {
          "code": "AEM 4201",
          "subject": "AEM",
          "id": "4201"
        },
        {
          "code": "CSCI 1113",
          "subject": "CSCI",
          "id": "1113"
        }
      ]
    }
  },
  {
    "code": "AEM 5321",
    "subject": "AEM",
    "id": "5321",
    "title": "Feedback Control",
    "info": "State space theory for multiple-input-multiple-output aerospace systems. Singular value decomposition technique, applications to performance/robustness. Linear quadratic gaussian and eigenstructure assignment design methods. Topics in H[infinity symbol]. Applications.\n\nprereq: 4321 or EE 4231 or ME 5281 or equiv",
    "prereq": {
      "or": [
        {
          "code": "AEM 4321",
          "subject": "AEM",
          "id": "4321"
        },
        {
          "code": "EE 4231",
          "subject": "EE",
          "id": "4231"
        },
        {
          "code": "ME 5281",
          "subject": "ME",
          "id": "5281"
        }
      ]
    }
  },
  {
    "code": "AEM 5333",
    "subject": "AEM",
    "id": "5333",
    "title": "Design-to-Flight: UAVs",
    "info": "Designing, assembling, modeling, simulating, testing/flying of uninhabited aerial vehicles. Rapid prototyping software tools for vehicle modeling. Guidance, navigation, flight control, real-time implementations, hardware-in-the-loop simulations, flight tests.\n\nprereq: [[4202, concurrent registration is required (or allowed) in 4303W, 4601] or equiv], instr consent",
    "prereq": {
      "and": [
        {
          "code": "AEM 4202",
          "subject": "AEM",
          "id": "4202"
        },
        {
          "code": "AEM 4303W",
          "subject": "AEM",
          "id": "4303W"
        },
        {
          "code": "AEM 4601",
          "subject": "AEM",
          "id": "4601"
        }
      ]
    }
  },
  {
    "code": "AEM 5401",
    "subject": "AEM",
    "id": "5401",
    "title": "Interm. Dynamics",
    "info": "Three-dimensional Newtonian mechanics, kinematics of rigid bodies, dynamics of rigid bodies, generalized coordinates, holonomic constraints, Lagrange equations, applications.\n\nprereq: CSE upper div or grad, 2012, Math 2243",
    "prereq": {
      "and": [
        {
          "code": "AEM 2012",
          "subject": "AEM",
          "id": "2012"
        },
        {
          "code": "MATH 2243",
          "subject": "MATH",
          "id": "2243"
        }
      ]
    }
  },
  {
    "code": "AEM 5431",
    "subject": "AEM",
    "id": "5431",
    "title": "Optimization",
    "info": "Parameter optimization problems. Calculus of variations. Nonlinear optimal control problems. Trajectory optimization algorithms. Steady-state aircraft flight. Minimum-time climb aircraft trajectory. Aero-assisted orbital transfer trajectories. Optimal space trajectories.\n\nprereq: 4321 or EE 4231 or ME 5281 or equiv",
    "prereq": {
      "or": [
        {
          "code": "AEM 4321",
          "subject": "AEM",
          "id": "4321"
        },
        {
          "code": "EE 4231",
          "subject": "EE",
          "id": "4231"
        },
        {
          "code": "ME 5281",
          "subject": "ME",
          "id": "5281"
        }
      ]
    }
  },
  {
    "code": "AEM 5441",
    "subject": "AEM",
    "id": "5441",
    "title": "Structural Dynamics",
    "info": "Frequency, time domain analysis of multi-degree of freedom mechanical systems. Natural frequencies, normal modes of vibration. Free/forced vibrations of strings, rods, and shafts beams. Introduction to finite elements in structural dynamics.",
    "prereq": []
  },
  {
    "code": "AEM 5451",
    "subject": "AEM",
    "id": "5451",
    "title": "Optimal Estimation",
    "info": "Basic probability theory. Batch/recursive least squares estimation. Filtering of linear/non-linear systems using Kalman and extended Kalman filters. Applications to sensor fusion, fault detection, and system identification.\n\nprereq: [[MATH 2243 or STAT 3021 or equiv], [4321 or EE 4231 or ME 5281 or equiv]] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "MATH 2243",
              "subject": "MATH",
              "id": "2243"
            },
            {
              "code": "STAT 3021",
              "subject": "STAT",
              "id": "3021"
            }
          ]
        },
        {
          "or": [
            {
              "code": "AEM 4321",
              "subject": "AEM",
              "id": "4321"
            },
            {
              "code": "EE 4231",
              "subject": "EE",
              "id": "4231"
            },
            {
              "code": "ME 5281",
              "subject": "ME",
              "id": "5281"
            }
          ]
        }
      ]
    }
  },
  {
    "code": "AEM 5495",
    "subject": "AEM",
    "id": "5495",
    "title": "Topics: Aerospace Systems",
    "info": "Topics of current interest. Individual projects with faculty sponsor.\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 5501",
    "subject": "AEM",
    "id": "5501",
    "title": "Continuum Mechanics",
    "info": "Concepts common to all continuous media; elements of tensor analysis; motion, deformation, vorticity; material derivatives; mass, continuity equation; balance of linear, angular momentum; geometric characterization of stress; constitutive equations.\n\nprereq: CSE upper div or grad, 3031, Math 2243 or equiv or instr consent",
    "prereq": {
      "and": [
        {
          "code": "AEM 3031",
          "subject": "AEM",
          "id": "3031"
        },
        {
          "code": "MATH 2243",
          "subject": "MATH",
          "id": "2243"
        }
      ]
    }
  },
  {
    "code": "AEM 5503",
    "subject": "AEM",
    "id": "5503",
    "title": "Elasticity",
    "info": "Introduction to the theory of elasticity, with emphasis on linear elasticity.  Linear and nonlinear strain measures, boundary-value problem for linear elasticity, plane problems in linear elasticity, three dimensional problems in linear elasticity.  Topics from nonlinear elasticity, micromechanics, contact problems, fracture mechanics.\n\nprereq: 4501 or equiv, Math 2263 or equiv or instr consent",
    "prereq": {
      "and": [
        {
          "code": "AEM 4501",
          "subject": "AEM",
          "id": "4501"
        },
        {
          "code": "MATH 2263",
          "subject": "MATH",
          "id": "2263"
        }
      ]
    }
  },
  {
    "code": "AEM 5581",
    "subject": "AEM",
    "id": "5581",
    "title": "Mechanics of Solids",
    "info": "Continuum mechanics in one dimension: kinematics; mass, momentum/energy, constitutive theory. Wave propagation, heat conduction. Strings. Euler-Bernoulli theory. 3-D deformations/stress. Topics from fracture mechanics, structural stability, vibrations, thin films, layered media, smart materials, phase transformations, 3-D elastic wave propagation. Elasticity, viscoelasticity, plasticity.\n\nprereq: 3031 or equiv, [Math 2373 or equiv], [Math 2374 or equiv], [CSE grad student]",
    "prereq": {
      "and": [
        {
          "code": "AEM 3031",
          "subject": "AEM",
          "id": "3031"
        },
        {
          "code": "MATH 2373",
          "subject": "MATH",
          "id": "2373"
        },
        {
          "code": "MATH 2374",
          "subject": "MATH",
          "id": "2374"
        }
      ]
    }
  },
  {
    "code": "AEM 5651",
    "subject": "AEM",
    "id": "5651",
    "title": "Aeroelasticity",
    "info": "Static aeroelastic phenomena, torsional divergence of a lifting surface, control surface reversal. Aeroelastic flutter, unsteady aerodynamics. Problems of gust response, buffeting.  Design project.\n\nprereq: 4202, 4301, [grad student or CSE upper div]",
    "prereq": {
      "and": [
        {
          "code": "AEM 4202",
          "subject": "AEM",
          "id": "4202"
        },
        {
          "code": "AEM 4301",
          "subject": "AEM",
          "id": "4301"
        }
      ]
    }
  },
  {
    "code": "AEM 8000",
    "subject": "AEM",
    "id": "8000",
    "title": "Grad Seminar",
    "info": "To be determined\n\nprereq: DGS consent",
    "prereq": []
  },
  {
    "code": "AEM 8201",
    "subject": "AEM",
    "id": "8201",
    "title": "Fluids I",
    "info": "Mathematical and physical principles governing the motion of fluids. Kinematic, dynamic, and thermodynamic properties of fluids; stress and \ndeformation; equations of motion; analysis of rotational and irrotational inviscid incompressible flow; two-dimensional and three-dimensional potential flow.\n\nprereq: 4201 or equiv, Math 2263 or equiv",
    "prereq": {
      "and": [
        {
          "code": "AEM 4201",
          "subject": "AEM",
          "id": "4201"
        },
        {
          "code": "MATH 2263",
          "subject": "MATH",
          "id": "2263"
        }
      ]
    }
  },
  {
    "code": "AEM 8202",
    "subject": "AEM",
    "id": "8202",
    "title": "Fluids II",
    "info": "Analysis of incompressible viscous flow; creeping flows; boundary layer flow.\n\nprereq: 8201",
    "prereq": {
      "code": "AEM 8201",
      "subject": "AEM",
      "id": "8201"
    }
  },
  {
    "code": "AEM 8203",
    "subject": "AEM",
    "id": "8203",
    "title": "Fluids III",
    "info": "Analysis of compressible flow and shock waves; method of characteristics for one-dimensional unsteady flow and for two-dimensional steady flow.\n\nprereq: 8202",
    "prereq": {
      "code": "AEM 8202",
      "subject": "AEM",
      "id": "8202"
    }
  },
  {
    "code": "AEM 8207",
    "subject": "AEM",
    "id": "8207",
    "title": "Stability",
    "info": "Theory of hydrodynamic stability. Stability of shear flows, rotating flows, boundary layer, two fluid flows, fingering flows, Rayleigh-Taylor instability, Kelvin Helmholtz instability, capillary instability, convective/absolute stability. Methods of linear stability, normal modes, energy theory of stability, nonlinear perturbation, bifurcation theory, transition to turbulence.\n\nprereq: 8201",
    "prereq": {
      "code": "AEM 8201",
      "subject": "AEM",
      "id": "8201"
    }
  },
  {
    "code": "AEM 8211",
    "subject": "AEM",
    "id": "8211",
    "title": "Turb I",
    "info": "Reynolds equations, methods of averaging, elements of stability theory and vortex dynamics; description of large vortical structures in mixing layers and boundary layers; horseshoe vortices; flow visualization.\n\nprereq: 8202",
    "prereq": {
      "code": "AEM 8202",
      "subject": "AEM",
      "id": "8202"
    }
  },
  {
    "code": "AEM 8212",
    "subject": "AEM",
    "id": "8212",
    "title": "Turb II",
    "info": "Prandtl's mixing length theory applied to classical boundary layer, pipe, jet, and wake flows; prediction methods used at Stanford Conference; law of wall; law of wake; K-epsilon method.\n\nprereq: 8211",
    "prereq": {
      "code": "AEM 8211",
      "subject": "AEM",
      "id": "8211"
    }
  },
  {
    "code": "AEM 8213",
    "subject": "AEM",
    "id": "8213",
    "title": "Turbulent Shear Flows",
    "info": "Equations of motion for turbulent flow. Isotropic/homogeneous\nturbulence. Free shear flows. Wall turbulence, elements of vortex\ndynamics.\n\nprereq: 8201, 8202",
    "prereq": {
      "and": [
        {
          "code": "AEM 8201",
          "subject": "AEM",
          "id": "8201"
        },
        {
          "code": "AEM 8202",
          "subject": "AEM",
          "id": "8202"
        }
      ]
    }
  },
  {
    "code": "AEM 8221",
    "subject": "AEM",
    "id": "8221",
    "title": "Rheology",
    "info": "Methods of solution for flows of simple fluids with general constitutive equations. Topics from viscometric flow, extensional flow, perturbations of the rest state with steady and unsteady flow, secondary flow.\n\nprereq: 8201 or 5501 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "AEM 8201",
          "subject": "AEM",
          "id": "8201"
        },
        {
          "code": "AEM 5501",
          "subject": "AEM",
          "id": "5501"
        }
      ]
    }
  },
  {
    "code": "AEM 8231",
    "subject": "AEM",
    "id": "8231",
    "title": "Gas Dynamics",
    "info": "Kinetic theory of gases, Boltzmann equation, Maxwell-Boltzmann distribution, collisions, transport properties. Introduction to quantum mechanics.  Statistical thermodynamics, classical/quantum statistics. Partition functions and thermodynamic properties. Irreversible thermodynamics.\n\nprereq: [4201 or equiv], [4203 or equiv], [ME 3324 or equiv]",
    "prereq": {
      "and": [
        {
          "code": "AEM 4201",
          "subject": "AEM",
          "id": "4201"
        },
        {
          "code": "AEM 4203",
          "subject": "AEM",
          "id": "4203"
        },
        {
          "code": "ME 3324",
          "subject": "ME",
          "id": "3324"
        }
      ]
    }
  },
  {
    "code": "AEM 8232",
    "subject": "AEM",
    "id": "8232",
    "title": "Molecular Gas Dynamics II",
    "info": "Molecular description of gas dynamics. Kinetic theory, transport theory, quantum mechanics for internal energy partitions, statistical thermodynamics. Finite rate chemical kinetics. Emphasis on link to continuum fluid dynamics. Overview of numerical simulation techniques for the Boltzmann equation with emphasis on direct simulation Monte Carlo. \n\nprereq: AEM 8231",
    "prereq": {
      "code": "AEM 8231",
      "subject": "AEM",
      "id": "8231"
    }
  },
  {
    "code": "AEM 8233",
    "subject": "AEM",
    "id": "8233",
    "title": "Multi Flows",
    "info": "Introduction to fluid flows with multiple interacting phases, with emphasis on cases in which a dispersed phase is carried by a continuous one. Droplet dynamics, bubbly flows and bubble-induced fluctuations, particle-turbulence interaction. Fundamentals of measurement techniques and modeling approaches. Elements of rheology for complex and active fluids.\n",
    "prereq": []
  },
  {
    "code": "AEM 8241",
    "subject": "AEM",
    "id": "8241",
    "title": "Perturbation Method",
    "info": "Method of matched asymptotic expansions presented through simple examples and applied to viscous flows at high and low Reynolds numbers and other problems in fluid mechanics and applied mathematics.\n\nprereq: 8202 or instr consent",
    "prereq": {
      "code": "AEM 8202",
      "subject": "AEM",
      "id": "8202"
    }
  },
  {
    "code": "AEM 8251",
    "subject": "AEM",
    "id": "8251",
    "title": "Volume Methods",
    "info": "Development of finite-volume computational methods for solution of compressible Navier-Stokes equations. Accuracy, consistency, and stability of numerical methods; high-resolution upwind shock-capturing schemes; treatment of boundary conditions; explicit and implicit formulations; considerations for high performance computers; recent developments and advanced topics.\n\nprereq: 4201 or 8201 or equiv, CSci 1107 or equiv",
    "prereq": {
      "and": [
        {
          "code": "AEM 4201",
          "subject": "AEM",
          "id": "4201"
        },
        {
          "code": "AEM 8201",
          "subject": "AEM",
          "id": "8201"
        },
        {
          "code": "CSCI 1107",
          "subject": "CSCI",
          "id": "1107"
        }
      ]
    }
  },
  {
    "code": "AEM 8253",
    "subject": "AEM",
    "id": "8253",
    "title": "Comp. Methods in Fluid Mech.",
    "info": "Spatial discretization. Spectral methods. Temporal discretization. Nonlinear sources of error. Incompressible Navier-Stokes equations. Compressible Navier-Stokes equations.\n\nprereq: 4201",
    "prereq": {
      "code": "AEM 4201",
      "subject": "AEM",
      "id": "4201"
    }
  },
  {
    "code": "AEM 8261",
    "subject": "AEM",
    "id": "8261",
    "title": "Nonlinear Waves",
    "info": "Theory of kinematic, hyperbolic, and dispersive waves, with application to traffic flow, gas dynamics, and water waves.\n\nprereq: 5501 or instr consent",
    "prereq": {
      "code": "AEM 5501",
      "subject": "AEM",
      "id": "5501"
    }
  },
  {
    "code": "AEM 8271",
    "subject": "AEM",
    "id": "8271",
    "title": "Exp. Fluids",
    "info": "Overview of computer organization, including external communications and A/D, D/A conversion. Measurement techniques, such as pressure measurements and hot-wire and laser Doppler anemometry. Signal processing and uncertainty; computer control of experiments.\n\nprereq: 4201, instr consent",
    "prereq": {
      "code": "AEM 4201",
      "subject": "AEM",
      "id": "4201"
    }
  },
  {
    "code": "AEM 8290",
    "subject": "AEM",
    "id": "8290",
    "title": "Topics in Fluid Mechanics",
    "info": "Topics vary each semester within the field of Fluid Mechanics\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8293",
    "subject": "AEM",
    "id": "8293",
    "title": "Directed Studies - Fluid Mech",
    "info": "Topics of current interest. Individual projects with consent of faculty sponsor.\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8295",
    "subject": "AEM",
    "id": "8295",
    "title": "Topics in Fluid Mechanics",
    "info": "Includes individual student projects completed under guidance of a faculty sponsor.\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8333",
    "subject": "AEM",
    "id": "8333",
    "title": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "code": "AEM 8400",
    "subject": "AEM",
    "id": "8400",
    "title": "Sem: Aero Syst",
    "info": "Developing program of research in aerospace Systems. Discussions of current research/topics of interest.\n\nprereq: Aerosp Eng grad student",
    "prereq": []
  },
  {
    "code": "AEM 8411",
    "subject": "AEM",
    "id": "8411",
    "title": "Advanced Dynamics",
    "info": "Advanced analytical mechanics and non-linear dynamical systems. Review of Lagrangian mechanics. Hamilton's equations of motion. Canonical transformations and Hamilton-Jacobi theory. Kane's equations. Analysis of differential equations and numerical methods. Phase plane, averaging, and perturbation methods. Stability/bifurcations of equilibria.\n\nprereq: 5401 or equiv",
    "prereq": {
      "code": "AEM 5401",
      "subject": "AEM",
      "id": "5401"
    }
  },
  {
    "code": "AEM 8412",
    "subject": "AEM",
    "id": "8412",
    "title": "Nonlinear Systems",
    "info": "Introduction to nonlinear dynamical systems. Method of averaging and its applications; Liapunov stability, center manifold, and normal form theories; bifurcation analysis; introduction to chaotic phenomena.",
    "prereq": []
  },
  {
    "code": "AEM 8413",
    "subject": "AEM",
    "id": "8413",
    "title": "Advanced Nonlinear",
    "info": "Dynamical systems with emphasis on higher dimensional (more than three) systems and global and chaotic phenomena. Bifurcation analysis with codimension greater than one, Melnikov method, and Silnikov phenomena. Concepts of symmetry. Application to problems modeled by partial differential equations.",
    "prereq": []
  },
  {
    "code": "AEM 8415",
    "subject": "AEM",
    "id": "8415",
    "title": "Formal Methods",
    "info": "Modern complex systems consist of physical elements and software which closely interact with each other. In the\nabsence of software, a closed loop system can be rigorously designed via control theory. In the absence of dynamical\nmodels, complex specifications of software or hardware can be verified via formal methods. Over the last two decades,\nthere has been a great interest in using formal methods to verify complex control systems. An essential thing in formal\nmethods is specifying the desired complex requirement in a rigorous and compositional way. To this end, a suitable\ntemporal logic is used to describe such specifications (which are more than classical stability or controllability). In\nthis course, we will learn various temporal logics with different expressiveness, representations of these temporal\nlogics, abstractions of dynamical systems, and algorithms that will synthesize controllers ensuring the satisfaction of\nthe desired temporal logic specification.",
    "prereq": []
  },
  {
    "code": "AEM 8421",
    "subject": "AEM",
    "id": "8421",
    "title": "Robust Control",
    "info": "Application of robust control theory to aerospace systems. Role of model uncertainty/modeling errors in design process. Control analysis and synthesis, including H[sub2] and H[infinity symbol] optimal control design and structural singular value [Greek letter mu] techniques.\n\nprereq: 5321 or equiv",
    "prereq": {
      "code": "AEM 5321",
      "subject": "AEM",
      "id": "5321"
    }
  },
  {
    "code": "AEM 8423",
    "subject": "AEM",
    "id": "8423",
    "title": "Convex Optimization in Control",
    "info": "Practical aspects of convex optimization methods applied to solve design/analysis problems in control theory.\n\nprereq: 5321 or EE 5231 or equiv",
    "prereq": {
      "or": [
        {
          "code": "AEM 5321",
          "subject": "AEM",
          "id": "5321"
        },
        {
          "code": "EE 5231",
          "subject": "EE",
          "id": "5231"
        }
      ]
    }
  },
  {
    "code": "AEM 8426",
    "subject": "AEM",
    "id": "8426",
    "title": "Optimization",
    "info": "Review of probability concepts and random variables, nonlinear stochastic differential equations and their numerical solutions, Monte-Carlo simulations, Gauss-Markov process, stochastic dynamic programming, and optimal control of practical uncertain dynamic systems.\n\nprereq: 5321 or 5431, CSE grad student",
    "prereq": {
      "or": [
        {
          "code": "AEM 5321",
          "subject": "AEM",
          "id": "5321"
        },
        {
          "code": "AEM 5431",
          "subject": "AEM",
          "id": "5431"
        }
      ]
    }
  },
  {
    "code": "AEM 8442",
    "subject": "AEM",
    "id": "8442",
    "title": "Aerospace PNT",
    "info": "Fundamental principles of navigation. Algorithms, performance analysis of navigational systems. Radio-navigation systems (DME,VOR,ILS). Satellite navigation ysstems (GPS,GLDNASS). Inertial navigation systems mechanization, error analysis.\n\nprereq: Exposure to [linear algebra, differential equations, probability, statistics]",
    "prereq": []
  },
  {
    "code": "AEM 8444",
    "subject": "AEM",
    "id": "8444",
    "title": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "code": "AEM 8451",
    "subject": "AEM",
    "id": "8451",
    "title": "System Identification",
    "info": "Modeling methods for dynamic systems using measurement data, or in combination with first principles, based on theory of systems/signals. Primary emphasis on linear systems for control system design/simulation applications. Examples from aerospace applications.\n\nprereq: 4321 or equiv",
    "prereq": {
      "code": "AEM 4321",
      "subject": "AEM",
      "id": "4321"
    }
  },
  {
    "code": "AEM 8453",
    "subject": "AEM",
    "id": "8453",
    "title": "Model Reduction",
    "info": "In this course, we will study analytical and data-driven methods for model reduction and approximation of\ndynamical systems. The focus will be on learning the relevant mathematics and tools for obtaining “lean”\nlow-dimensional representations of dynamical systems, which can be used to facilitate analysis and design.\nRoughly half of the course will be devoted to the problem of model reduction: i.e., given a mathematical\ndescription of a system, reduce the number of degrees of freedom required to faithfully represent that system.\nThe other half of the course will be devoted to data-driven approximation of dynamical systems: i.e., given\nempirical data generated by a dynamical system, determine a mathematical representation for the underlying\nsystem dynamics. Although these two general problems are distinct, they are closely related and will be\nstudied in parallel throughout the term.",
    "prereq": []
  },
  {
    "code": "AEM 8490",
    "subject": "AEM",
    "id": "8490",
    "title": "Topics in Aerospace Systems",
    "info": "Topics vary each semester within the field of Aerospace Systems\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8493",
    "subject": "AEM",
    "id": "8493",
    "title": "Directed Studies - Aero System",
    "info": "Topics of current interest. Individual projects with consent of faculty sponsor.\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8495",
    "subject": "AEM",
    "id": "8495",
    "title": "Adv Topics Aerospace Systems",
    "info": "Individual student projects completed under guidance of a faculty sponsor.\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8500",
    "subject": "AEM",
    "id": "8500",
    "title": "Solids Seminar",
    "info": "Seminars given by students, faculty, and visitors on topics drawn from current research.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "AEM 8511",
    "subject": "AEM",
    "id": "8511",
    "title": "Adv Cont Mechanics",
    "info": "Constitutive equations; invariance and thermodynamic restrictions. Nonlinear elasticity theory; exact solutions, minimization, stability. Non-Newtonian fluids; viscometric flows, viscometric functions, normal stress. Other topics may include reactive and/or nonreactive mixtures, nonlinear plasticity, and deformable electromagnetic continua.\n\nprereq: 5501 or instr consent",
    "prereq": {
      "code": "AEM 5501",
      "subject": "AEM",
      "id": "5501"
    }
  },
  {
    "code": "AEM 8521",
    "subject": "AEM",
    "id": "8521",
    "title": "Adv Elasticity",
    "info": "Contact stresses, finite deformations, and other topics.\n\nprereq: 5503",
    "prereq": {
      "code": "AEM 5503",
      "subject": "AEM",
      "id": "5503"
    }
  },
  {
    "code": "AEM 8523",
    "subject": "AEM",
    "id": "8523",
    "title": "Elastodynamics",
    "info": "Waves and vibrations in rods, beams, and plates; dispersion; volume and surface waves; reflection; energy theorems; vibrations of bounded media and relation to technical theories; elements of nonlinear waves, inelastic waves, and stability of motion of elastic systems.\n\nprereq: 4581 or 5501 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "AEM 4581",
          "subject": "AEM",
          "id": "4581"
        },
        {
          "code": "AEM 5501",
          "subject": "AEM",
          "id": "5501"
        }
      ]
    }
  },
  {
    "code": "AEM 8525",
    "subject": "AEM",
    "id": "8525",
    "title": "Material Stability",
    "info": "Stability/bifurcation problems. Poincare stability, Lyapunov stability, asymptotic stability. Lyapunov's general methods. Minimum potential energy criterion for elastic conservative systems. Numerical methods for continuation/branch switching. Material phase transformation, crystalline material stability, soft-phonon theory of phase transitions. Material instability problems in finite-strain elasticity. Stability of discrete/continuous structures.\n\nprereq: CSE grad student, familiarity with theory of linear algebra",
    "prereq": []
  },
  {
    "code": "AEM 8527",
    "subject": "AEM",
    "id": "8527",
    "title": "Pattern Formation in Materials",
    "info": "This course provides an in-depth discussion of bifurcation and stability problems and pattern formation in physics, chemistry, and mechanics (Fluids, Solids, Materials Science) with an emphasis on the application of symmetry theory to such problems. This theory applies to essentially all nonlinear equilibrium problems in science and engineering, but this class has a particular focus on structural mechanics and materials applications, including buckling of: beams, honeycombs, lattice structures, and phase transforming crystals.\n\nprereq: CSE grad student or instructor consent, familiarity with linear algebra.",
    "prereq": []
  },
  {
    "code": "AEM 8531",
    "subject": "AEM",
    "id": "8531",
    "title": "Fracture Mechanics",
    "info": "Theories of mechanical breakdown. Kinetic rate theories and instability considerations; formation of equilibrium cracks and circular crack propagation under pulses; statistical aspects of strength and fracture of micromolecular systems; time and temperature dependency in fracture problems and instability of compressed material systems.\n\nprereq: 5503 or instr consent",
    "prereq": {
      "code": "AEM 5503",
      "subject": "AEM",
      "id": "5503"
    }
  },
  {
    "code": "AEM 8533",
    "subject": "AEM",
    "id": "8533",
    "title": "Plasticity",
    "info": "Theory of permanent deformation of ductile metals; bi-linear material models, Drucker's three bar truss, and other examples; 3-D continuum formulation, yield surfaces, hardening rules, and material stability; slip line theory, Prandtl punch solution; single crystal plasticity.\n\nprereq: 5203 or instr consent",
    "prereq": {
      "code": "AEM 5203",
      "subject": "AEM",
      "id": "5203"
    }
  },
  {
    "code": "AEM 8541",
    "subject": "AEM",
    "id": "8541",
    "title": "Crystalline Solids",
    "info": "Atomic theory of crystals and origins of stress in crystals. Relation between atomic and continuum description; phase transformations and analysis of microstructure; effects of shear stress, pressure, temperature, electromagnetic fields, and composition on transformation temperatures and microstructure; interfacial energy in solids.\n\nprereq: 5501 or instr consent",
    "prereq": {
      "code": "AEM 5501",
      "subject": "AEM",
      "id": "5501"
    }
  },
  {
    "code": "AEM 8551",
    "subject": "AEM",
    "id": "8551",
    "title": "Multiscale Methods",
    "info": "Classical/emerging techniques for bridging length/time scales. Nonlinear thermoelasticity, viscous fluids, and micromagnetics from macro/atomic viewpoints. Statistical mechanics, kinetic theory of gases, weak convergence methods, quasicontinuum, effective Hamiltonians, MD, new methods for bridging time scales.\n\nprereq: Basic knowledge of [continuum mechanics, atomic forces], familiarity with partial differential equations, grad student in [engineering or mathematics or physics]",
    "prereq": []
  },
  {
    "code": "AEM 8590",
    "subject": "AEM",
    "id": "8590",
    "title": "Topics in Mechanics and Mats",
    "info": "Topics vary each semester within the field of Solid Mechanics and Materials\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8593",
    "subject": "AEM",
    "id": "8593",
    "title": "Directed Studies - Solids",
    "info": "Topics of current interest. Individual projects with consent of faculty sponsor.\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8595",
    "subject": "AEM",
    "id": "8595",
    "title": "Mechanics & Materials Topics",
    "info": "Includes individual student projects completed under guidance of a faculty sponsor.\n\nprereq: dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8601",
    "subject": "AEM",
    "id": "8601",
    "title": "FEM in Comp. Mech.",
    "info": "Fundamental concepts and techniques of finite element analysis. Variational equations and Galerkin's method; weak formulations for problems with nonsymmetric differential operators; Petrov-Galerkin methods; examples from solid and fluid mechanics; properties of standard finite element families, implementation.",
    "prereq": []
  },
  {
    "code": "AEM 8602",
    "subject": "AEM",
    "id": "8602",
    "title": "FEM in CFD",
    "info": "Finite element methods for time-dependent problems. Stability, convergence, and accuracy concepts; analysis and applications of Petrov-Galerkin formulations for convection-diffusion equations; incompressible Navier-Stokes equations; vorticity-stream function formulation and velocity-pressure formulation; hyperbolic systems, compressible Euler equations.",
    "prereq": []
  },
  {
    "code": "AEM 8666",
    "subject": "AEM",
    "id": "8666",
    "title": "Doct Pre-Thesis Cr*",
    "info": "To be determined\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "code": "AEM 8777",
    "subject": "AEM",
    "id": "8777",
    "title": "Thesis Credit:Mast*",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "code": "AEM 8880",
    "subject": "AEM",
    "id": "8880",
    "title": "Plan B Project",
    "info": "Satisfies project requirement for Plan B Master's degree. May appear on M.S. program but does not count toward 20-credit minimum in the major field. Topic arranged by student and advisor; written report required.\n\nprereq: Grad aerospace engineering or mechanics major, dept consent",
    "prereq": []
  },
  {
    "code": "AEM 8888",
    "subject": "AEM",
    "id": "8888",
    "title": "Thesis Credit:Doct*",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  }
]