[{"code":"APSC 8123","subject":"APSC","id":"8123","title":"Resrch Ethics in Plant/Env Sci","info":"Ethics training to graduate students enrolled in plant/environmental graduate research programs and fulfill requirement for training in responsible conduct of research.","prereq":[]},{"code":"APSC 8201","subject":"APSC","id":"8201","title":"Advanced Plant Breeding","info":"This course covers the principles underlying the application of genetics and statistics to cultivar development; evaluation of breeding methods; and methods to enhance genetic progress and efficiency through the application of statistical genetics, genomics, and molecular markers. In terms of format, this course is combination of lecture, discussion, and computer lab, varying according to the topic. An emphasis will be placed on classical and current literature to teach concepts, as well as hands-on experience with data analysis.  \n\nIntroductory courses in plant breeding/genetics and statistics. Knowledge of population and quantitative genetics would be useful but not required.","prereq":[]},{"code":"APSC 8270","subject":"APSC","id":"8270","title":"Graduate Seminar","info":"Examine qualities of effective scientific presentations. Develop skills in presenting scientific information effectively. Practice public speaking skills. Presenting scientific information to the general public. Organize a seminar series. \n\nprereq: Graduate major in Applied Plant Sciences","prereq":[]},{"code":"APSC 8280","subject":"APSC","id":"8280","title":"Topics Applied Plant Sciences","info":"This variable-credit course is a forum for learning and discussing contemporary topics in applied plant sciences. The topics covered differ according to the instructor and term that the class is taught.","prereq":[]},{"code":"APSC 8333","subject":"APSC","id":"8333","title":"FTE: Master's","info":"(No description)\n\nprereq: Master's student, adviser and DGS consent","prereq":[]},{"code":"APSC 8444","subject":"APSC","id":"8444","title":"FTE: Doctoral","info":"(No description)\n\nprereq: Doctoral student, adviser and DGS consent","prereq":[]},{"code":"APSC 8666","subject":"APSC","id":"8666","title":"Doct Pre-Thesis Cr*","info":"TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr","prereq":[]},{"code":"APSC 8777","subject":"APSC","id":"8777","title":"Thesis Credit:Mast*","info":"(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]","prereq":[]},{"code":"APSC 8888","subject":"APSC","id":"8888","title":"Thesis Credit:Doct*","info":"(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required","prereq":[]},{"code":"APSC 8901","subject":"APSC","id":"8901","title":"Thesis Proposal Preparation","info":"The overall mission of this course is to provide a forum and timeline for first-year Applied Plant Sciences (APS) students to learn about their projects, develop writing and reviewing skills, and get to know the other students in their cohort. The course has four specific purposes: (1) Increase student understanding of their research projects; (2) Encourage planning and research discussions between APS graduate students with their advisors and committee members; (3) Provide experience and guidance to students with the proposal writing, editing, and peer-review process; and (4) Facilitate the preparation of student thesis proposals, in accordance with the APS program requirements. The final product of this effort will be a drafted thesis proposal that each student will submit to their committee members and the program. Submission of a complete proposal to the student?s committee and the APS program is required to complete this course.\n\nprereq: APS Graduate Student","prereq":[]}]