[{"code":"ARGN 1000","subject":"ARGN","id":"1000","title":"Lang & Cul in Buenos Aires","info":" TBD","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 1001","subject":"ARGN","id":"1001","title":"Beginning Spanish I","info":"Listening, speaking, reading, writing. Some cultural readings.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 1002","subject":"ARGN","id":"1002","title":"Beginning Spanish","info":"Listening, speaking, reading, writing. Some cultural readings.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 1003","subject":"ARGN","id":"1003","title":"Intermediate Spanish III","info":"Conversation, comprehension proficiency. Reading/writing through literary analysis and grammar review.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 1004","subject":"ARGN","id":"1004","title":"Intermediate Spanish IV","info":"Conversation, comprehension proficiency. Reading/writing through literary analysis and grammar review.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 1022","subject":"ARGN","id":"1022","title":"Alt Second-Sem Spanish","info":"Study abroad.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3000","subject":"ARGN","id":"3000","title":"Lang & Cul in Buenos Aires","info":" TBD","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3001","subject":"ARGN","id":"3001","title":"Colloquial Spanish","info":"Spanish language in its spoken colloquial form. Variations based on age, social status, and regional background. Vocabulary, grammar, language characteristics.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3002","subject":"ARGN","id":"3002","title":"Spanish Phonetics","info":"Analysis of practical/theoretical aspects of Spanish phonetics geared to correcting specific pronunciation problems of the non-native speaker. Students are divided into small practice groups according to their native languages.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3003","subject":"ARGN","id":"3003","title":"Politics & Society in Lat Amer","info":"Comparative analysis of social/political structures of Argentina and Latin America in 20th century. Taught in English.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3004","subject":"ARGN","id":"3004","title":"Latin American Economy","info":"Privatization, industrialization, and economic reforms in Latin America and Argentina. Inflation, structural change, poverty, changes in the external/rural sector. Taught in English.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3005","subject":"ARGN","id":"3005","title":"Buenos Aires: City of the Arts","info":"Unique artistic side of Buenos Aires. Theory classes, art/literature workshops. Excursions to museums, theaters, tango clubs, and opera houses. European and Latin American influences that make the city unique. Taught in English.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3006","subject":"ARGN","id":"3006","title":"Topics in Argentine History","info":"Study Argentina's history. Main topics include the legacy of Peron, the army in politics and government, the return of democracy, and current events. Taught in English.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3008","subject":"ARGN","id":"3008","title":"Latin American Lit and Cinema","info":"Offered jointly by Fundación Jose Ortega y Gasset and Learning Abroad Center. Located in downtown Buenos Aires. Spanish language. Global/cultural issues. Sampling food, reading literature, experiencing music/dance. Argentine culture.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3009","subject":"ARGN","id":"3009","title":"Argnta: Stereotypes & Identity","info":"Intercultural perspectives on Argentina. How others perceive Argentines and how Argentines perceive themselves, through literature, humor, art, music, and history.","prereqInfo":"prereq: 1004","prereq":{"course":[{"code":"ARGN 1004","subject":"ARGN","id":"1004"}]}},{"code":"ARGN 3011","subject":"ARGN","id":"3011","title":"City of Arts: Buenos Aires-SP","info":"This course focuses on the art and architecture of Argentina. Learn about the different artistic movements in the country and visit museums, private art collections, and public monuments. The city becomes your classroom. At the same time, get a broader perspective of world art that serves as a background for a better understanding of the art and architectural scene in Argentina throughout the past 300 years.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3012","subject":"ARGN","id":"3012","title":"Paradox of Mental Health","info":"This course looks at the biological basis for mental health, applying basic concepts of neurobiology.  It explores the causal mechanisms of various mental health issues from autism to anxiety. The course will compare Argentina's and the United States' approaches to mental health, exploring the relationship between culture and mental health (e.g., culture-bound syndromes) over time. In addition, the course will compare the use of therapy versus pharmacological approaches in treating mental illness, looking at the medicalization of mental health in Argentina as compared to the United States.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3015W","subject":"ARGN","id":"3015W","title":"Spanish Comp & Communication","info":"Writing, speaking, reading, and understanding modern Spanish at level of majors/minors. Students generate compositions and read texts from Spain and Latin America. Grammar review, audio tape exercises, paired work, small group work, discussion, oral presentations, peer editing, process writing.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3104W","subject":"ARGN","id":"3104W","title":"Intro to Hispanic Literature","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3301","subject":"ARGN","id":"3301","title":"Cross-Cultural Psychology","info":"This course’s aim is to understand how cultural factors influence human behavior and development. Additionally, the \ncourse may discuss interaction between different cultures and how to solve the difficulties that may arise during the acculturation process. The course studies the vision and treatment of mental disorders in different cultures, especially the differences and similarities between Argentinian and North American cultures. It will also analyze and compare mental health systems of both countries.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3302","subject":"ARGN","id":"3302","title":"Understanding Argentina","info":"This course seeks to provide students with an intercultural understanding of contemporary Argentina through classes, site visits, and critical analysis, all of which will allow them to draw comparisons to their own home country. The syllabus also focuses on the different spheres where the individual and the social intersect in Argentina: the private space, the public space, the political space (which may differ from the students’ home country).","prereqInfo":"The departing point of this course will be a synchronic overview of Argentina nowadays. The fact that students will be culturally immersed in the host country for a whole semester will strengthen their self-awareness and global perspective.","prereq":{"course":[]}},{"code":"ARGN 3640","subject":"ARGN","id":"3640","title":"Service Lrng-Buenos Aires: ENG","info":"Students work with non-governmental and community service organizations devoted to helping children/adults in impoverished urban areas, immigrants from border countries, and groups at high risk (women, children, seniors).","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3641","subject":"ARGN","id":"3641","title":"Service Lrng-Buenos Aires: SP","info":"Students work with non-governmental organizations and community service organizations to help children/adults in impoverished urban, immigrants from border countries, and groups at high risk (women, children, seniors).","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3752","subject":"ARGN","id":"3752","title":"International Marketing","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"ARGN 3896","subject":"ARGN","id":"3896","title":"Internship in Buenos Aires","info":"The Buenos Aires internship course is designed to provide students with the opportunity to become more knowledgeable regarding the local culture, organizational cultures, and the professional environment. Through practical internship experiences as well as readings, discussions, and written assignments, students will deepen their understanding of the host country’s cultural context and critically examine their own worldview.  ","prereqInfo":"The course is designed to guide students in the internship experience and create a foundation for a successful professional career. In addition to gaining a cross-cultural comparative view on work, the topics and assignments will deepen students’ insights about themselves, professional expectations, and being successful in the workplace. Students are expected to make a valuable contribution to the internship site through the completion of major projects or tasks.","prereq":{"course":[]}},{"code":"ARGN 4621","subject":"ARGN","id":"4621","title":"The Global Economy","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}}]