[
  {
    "code": "BA 1000",
    "subject": "BA",
    "id": "1000",
    "title": "Career Exploration",
    "info": "Experiential based course. Develop a plan for choosing an academic major and career path through the process of self exploration and career planning. Assignments/activities to help students learn more about themselves, their major choices, career options, campus resources, decision making and goal setting. ",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 1011",
    "subject": "BA",
    "id": "1011",
    "title": "Leading Self & Teams",
    "info": "This course guides Carlson students through a self-reflective journey as they learn about interpersonal competencies and the role of these competencies in their own leadership style and when leading teams. As leadership and teamwork are an essential component in the Carlson education and more broadly in the business community, this class provides the foundational skills necessary for future success. The course is structured into two parts: understanding individual perspectives and understanding team dynamics. The course begins by providing students with a theoretical foundation on interpersonal differences that influence how people lead and interact in teams. Specifically, we explore differences in personality, identity, values, opinions, and cultures and the role they play when interacting with others. The focus of the course is providing students with essential skills to uncover, appreciate and navigate differences to create a solid foundation upon which to develop their own leadership skills and work together as a team. The second half of the course will focus on understanding team dynamics. This class provides students with a unique learning opportunity to learn how teams work while simultaneously working in their teams. In doing so, they will witness the direct application of course material to their own learning teams while completing their team project. Students will learn the science behind how teams are structured, team roles, processes within teams and what leads to effective teams. Specifically, the topics examined will include team decision making, conflict resolution, power, influence, analyzing team dynamics, and providing team feedback. At the end of this course, students will have a deeper understanding of themselves and will master skills for working in and leading teams. ",
    "prereqInfo": "prereq: Carlson School of Management student",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 1021",
    "subject": "BA",
    "id": "1021",
    "title": "Design Your Life",
    "info": "Design Your Life is a class about customizing your college experience to get the most out of it. Using a process rooted in Design Thinking, the course equips students with tools to design and prototype a college experience that best aligns with who they are and what they hope to get from college. Students will explore the purpose of college, reflect on personal values and strengths, learn about educational and career opportunities, and create a prototype of their college experience. Through in-class activities and out of class assignments, students will also learn and practice professional and personal leadership skills\nPrerequisite: Carlson School student",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 1905",
    "subject": "BA",
    "id": "1905",
    "title": "Freshman Seminar",
    "info": "Topics vary.",
    "prereqInfo": "prereq: Fr",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 1910W",
    "subject": "BA",
    "id": "1910W",
    "title": "Freshman Seminar, WI",
    "info": "Topics vary. See Class Schedule.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 1919",
    "subject": "BA",
    "id": "1919",
    "title": "Thriving IncreasedExpectations",
    "info": "We all want to thrive. But many of us are also feeling anxious and stressed out. Whether it’s dealing with difficult people or facing pressure to be successful and extraordinary, life today is not easy. This course offers the space to be yourself and investigates timeless guidance for creating a life that is meaningful, joyful and fulfilling. ",
    "prereqInfo": "Instead of relying on life hacks and shortcuts to answer “How do I succeed?” we will first ask “Why am I doing this?” By better understanding ourselves, our lives and the minds of others, we will build skills for increasing our self-awareness, emotional agility, resilience, perspective-taking, and communicating with others. Following Friedrich Nietzsche’s wisdom that those who have a “why” can overcome any “how,” this class will prepare you to chart your path with purpose and overcome the inevitable obstacles that lay ahead. \n",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 1990",
    "subject": "BA",
    "id": "1990",
    "title": "Topics in Business",
    "info": "Topics vary.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 1998",
    "subject": "BA",
    "id": "1998",
    "title": "Ind Study",
    "info": "Special project or independent study.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 2005",
    "subject": "BA",
    "id": "2005",
    "title": "Ethics and Sustainability",
    "info": "This course seeks to give you the vocabulary necessary to describe and explain the ethical issues you will learn to identify through lectures, readings, and case studies. It will provide you with a decision-making framework that you can use to disentangle the most complicated scenarios, which will then allow you to use critical thinking and analysis to arrive at a decision on how you would respond as an individual in an ethically-defensible manner. This course will also anticipate your future career growth into positions of management and leadership, and will help give you the tools to manage people, money, and business affairs both effectively and ethically. \nBA 2005 was previously offered as Mgmt 1005",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 2005H",
    "subject": "BA",
    "id": "2005H",
    "title": "Ethics and Sustainability",
    "info": "This course seeks to give you the vocabulary necessary to describe and explain the ethical issues you will learn to identify through lectures, readings, and case studies. You will be provided with a decision-making framework that you can use to disentangle the most complicated scenarios, which will then allow you to use critical thinking and analysis to arrive at a decision on how you would respond as an individual in an ethically-defensible manner. This course will also anticipate your future career growth into positions of management and leadership, and will help give you the tools to manage people, money, and business affairs both effectively and ethically. BA2005H was previously offered as MGMT1005H ",
    "prereqInfo": "prereq: Honors student",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 2021",
    "subject": "BA",
    "id": "2021",
    "title": "Design Your Career",
    "info": "The focus of this course is to increase your awareness, knowledge, and skills associated with the career and job search process. The course includes major/career exploration and discovery, as well as the tactical pieces of a job search. You will learn how to write a professional resume and cover letter and will learn how to navigate the interview process. You will be exposed to a variety of individuals who will give you different perspectives on the process, including recruiters from local organizations, alumni, and other business professionals. This development will increase your ability to undertake a successful career and job search in your succeeding years. (Credit will not be granted if credit was received for BA 3000. )",
    "prereqInfo": "prereq: Carlson School undergraduate student",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 2051",
    "subject": "BA",
    "id": "2051",
    "title": "Business Scenarios in Excel",
    "info": "The title of the course says it all. You will build and use Excel-models to analyze real-world business problems. You are introduced to basic skills for analyzing data and presenting recommendations to management. In this class you will work extensively with Microsoft Excel and will be better prepared to use it in internships and upper division classes. Excel is a critical business tool. As business students, your familiarity and proficiency in Excel will aid you in upper-level classes and ultimately greatly improve your career prospects. We will learn the tension between parsimony and relevance. You will use models to answer many what-ifs. Most importantly, we hope to instill a disciplined method of structured and rigorous thinking.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 2062",
    "subject": "BA",
    "id": "2062",
    "title": "Impact Lab Problem Solving",
    "info": "One of the key distinguishing characteristics of effective leaders is the ability to parse through the overwhelming number of inputs we all receive to understand what needs to be done. “What problem are we trying to solve?” is a crucial question that too often goes unaddressed in the rush to “just fix it”. Powerful Problem Solving will expose students to a clear problem solving framework and process, a variety of perspectives on how to approach problems, as well as individual and group activities and assignments to inform and sharpen skills.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 2551",
    "subject": "BA",
    "id": "2551",
    "title": "Business Statistics in R",
    "info": "The purpose of the course is to develop skills for improving data-driven decision-making using statistical techniques in the powerful statistical software environment R. As an introductory statistics course, the content will include three main areas of statistics: Descriptive Statistics, Statistical Inference, and Analysis of Relationships with Scatterplots, Correlation and Linear Regression. Developing statistical literacy is increasingly important in understanding data and engaging in the complex business world. BA 2551 focuses on statistical reasoning and how to implement statistical methods in a business context using R. Topics include (but are not limited to) descriptive statistics, statistical inference, variability, sampling, distributions, correlation analysis, confidence intervals, hypothesis testing, graphical summaries of data, and introduction to linear regression. Through weekly in-class lab sessions and critical thinking assignments related to statistics in business, the course will train students to become informed consumers of numerical information and provide foundational skills in R to compute statistical procedures in future courses. We use existing packages in R as a tool to enable us to solve business problems that can leverage mathematical and statistical thinking. ",
    "prereqInfo": "prereq: [Math 1031 or equiv]",
    "prereq": {
      "course": [
        {
          "code": "MATH 1031",
          "subject": "MATH",
          "id": "1031"
        }
      ]
    }
  },
  {
    "code": "BA 2990",
    "subject": "BA",
    "id": "2990",
    "title": "Topics in Business",
    "info": "Topics vary.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3001",
    "subject": "BA",
    "id": "3001",
    "title": "Race Power Justice in Business",
    "info": "The United States is a diverse nation founded on the principle of equality, and yet has roots in slavery, indigenous genocide, colonialism, and dispossession. These roots shaped economic relations and business practices that continue today. Rather than seeing business as ahistorical organizations in which bundles of functional practices seek economic efficiency and respond to idealized market conditions, this course considers the socially-embedded nature of business in which racial and other structural inequalities are inherent in the development and contemporary practice of business. This includes questioning standard assumptions of free markets, meritocracy, and equal opportunity by considering alternative models of social relations and discrimination, and evidence on systemic economic injustice that reflect power differences, the contested nature of race, and the intersection of race, class, and other marginalized identities. This course also reveals ways in which business practices reflect hidden power dynamics and stereotypes.",
    "prereqInfo": "This deeper understanding of how race, power, and justice issues are fundamental to business and management is intended to provide students with a richer lens to more critically examine business practices while considering ways to address power hierarchies and promote social justice in the context of business. This includes a consideration of alternative business practices as well as how corporations can advance diversity, equity, and inclusion (DEI). To complete the progression from macro-level structural and historical issues and then mid-level organization practices, the course concludes with an individual-level focus that considers how individuals navigate social identity differences at work, the impact of personal bias, and how to be an ally to advance justice and DEI. The course culminates with personal development plans in which students will demonstrate their belief in their own agency by devising plans for addressing their own biases and for identifying specific actions they can use to address power hierarchies and promote social justice.  ",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3033W",
    "subject": "BA",
    "id": "3033W",
    "title": "Bus Communication",
    "info": "This course teaches strategies and skills to communicate with confidence, clarity, and impact in business settings. Students develop their abilities in critical thinking (analyzing data, audience, purpose, and context) and craft (honing skills in storytelling, persuasion, writing, diction, tone, presence, data visualization, and visual design). They learn to navigate ambiguity, evaluate the needs of internal and external stakeholders, and communicate solutions to complex business problems. The course is performance- and project-based. Students produce professional-level memos, emails, and research-based proposal decks. They deliver multiple presentations (individual and team) and learn to communicate effectively with data. Students will meet with the instructor in small groups outside of class time for one scheduled lab session. The course culminates in the Case Study Competition where student teams apply their knowledge to address a real challenge from one of our industry partners.",
    "prereqInfo": "prereq: First Year Writing, Carlson School junior or senior.",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3051",
    "subject": "BA",
    "id": "3051",
    "title": "Data-Driven Business Decisions",
    "info": "This course focuses on applying statistical techniques to make evidence-based recommendations for business decisions. Topics include (but are not limited to) linear regression, logistic regression, multiple regression, A/B testing, time-series data, and optimization. Students will work with data sets and practice applying these skills to make data-based recommendations across different areas of business. This course explicitly builds on the Business Statistics in R and the Modeling Business Decisions in Excel courses. The Data-Driven Business Decisions course uses both Excel and R. ",
    "prereqInfo": "Prereqs: Modeling Business Scenarios in Excel and Business Statistics in R",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3062",
    "subject": "BA",
    "id": "3062",
    "title": "Impact Lab in Action",
    "info": "This research project course centers on working with an organization to solve a real business\nchallenge with an impact. The purpose of the Impact Lab Project is to apply the skills learned in the BA 2062 Powerful Problem Solving course to a real business problem. Students will be provided with a business problem faced by an organization that is partnering with the class. Using the skills learned in the powerful problem solving course, along with the knowledge gained in the business fundamentals courses, students will define the problem, disaggregate the issues, conduct appropriate research, generate data-driven solutions, critically evaluate alternatives, and present their final recommendations to the client partner. Faculty in the class will serve as coaches as students work on the projects.",
    "prereqInfo": "prereq: Carlson School of Management student, BA 2062",
    "prereq": {
      "course": [
        {
          "code": "BA 2062",
          "subject": "BA",
          "id": "2062"
        }
      ]
    }
  },
  {
    "code": "BA 3100",
    "subject": "BA",
    "id": "3100",
    "title": "Global Seminar",
    "info": "Three-week, faculty-led program. Students spend May session or January session examining international business topics first-hand. Topics/locations vary. For current offerings, contact Learning Abroad Center.",
    "prereqInfo": "prereq: Approved application",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3101W",
    "subject": "BA",
    "id": "3101W",
    "title": "Global Sem: Suppl Writing",
    "info": "Projects developed by instructor of Global Seminar. Students analyze/process intercultural experience of studying abroad. Individualized feedback/coaching in writing skills. Taught during intersession. Writing intensive, if concurrently enrolled in 3100.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3200H",
    "subject": "BA",
    "id": "3200H",
    "title": "Leadership Colloquium",
    "info": "How to cultivate, evaluate, and apply leadership concepts in all phases of life. Emphasizes real leadership experiences. Ethical leadership, leadership communication, management vs leadership, motivation/empowerment, leading in a diverse environment, leading during change.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3551",
    "subject": "BA",
    "id": "3551",
    "title": "Business Analyics",
    "info": "In a world of ever growing information sources, any student of business should be equipped with the ability to prepare and analyze data to produce actionable insights. Equally important is the capacity to understand such analysis and to present it to key stakeholders. This course offers an introduction to data processing and data mining for business applications.",
    "prereqInfo": "Prereqs: Modeling Business Scenarios in Excel (BA 2051) and Business Statistics in R (BA 2551)",
    "prereq": {
      "course": [
        {
          "code": "BA 2051",
          "subject": "BA",
          "id": "2051"
        },
        {
          "code": "BA 2551",
          "subject": "BA",
          "id": "2551"
        }
      ]
    }
  },
  {
    "code": "BA 3701H",
    "subject": "BA",
    "id": "3701H",
    "title": "Hlthcare Market:  Prcpls/Agts",
    "info": "Introduction to healthcare sector markets for goods/services. Physician services, hospital services, insurance, long-term care, pharmaceuticals, medical devices, information technology. Lectures, recitations, presentations from healthcare business leaders.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3900",
    "subject": "BA",
    "id": "3900",
    "title": "Topics",
    "info": "Topics in business vary.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3990H",
    "subject": "BA",
    "id": "3990H",
    "title": "Honors Topics",
    "info": "Topics vary.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3993",
    "subject": "BA",
    "id": "3993",
    "title": "Directed Study",
    "info": "Student-initiated project or directed study to be completed with a faculty member.",
    "prereqInfo": "prereq: Instrutor consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 3996",
    "subject": "BA",
    "id": "3996",
    "title": "Internship Seminar",
    "info": "This course helps students integrate internship experiences with relevant assignments to create helpful next steps toward their career learning and development.",
    "prereqInfo": "prereq: Approved internship, instructor consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4000",
    "subject": "BA",
    "id": "4000",
    "title": "Issues in Nonprofit Management",
    "info": "Capstone course. Students choose project with nonprofit organization in local community. Readings/discussions tie managerial theory to actual experiences.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4000H",
    "subject": "BA",
    "id": "4000H",
    "title": "Honors Seminar",
    "info": "Capstone course for Carlson honors program. Organizational or cross-functional topics.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4501",
    "subject": "BA",
    "id": "4501",
    "title": "Carlson Growth Equity Fund",
    "info": "Students integrate finance skills by managing an institutional equity portfolio. Sustainable finance, financial modeling, portfolio management, and  presentations to clients / investment professionals  are all critical skills developed in this course.  The course meets concurrently with MBA 6501.",
    "prereqInfo": "prereq: approved application",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4502",
    "subject": "BA",
    "id": "4502",
    "title": "Carlson Fixed Income Fund",
    "info": "Students integrate finance skills by managing an institutional bond portfolio. Sustainable finance, financial modeling, portfolio management, and presentations to clients / investment professionals are all critical skills developed in this course.  The course meets concurrently with MBA 6502.",
    "prereqInfo": "prereq: approved application",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4503",
    "subject": "BA",
    "id": "4503",
    "title": "Carlson Ventures Enterprise",
    "info": "Carlson Ventures Enterprise (CVE) is intended for highly-motivated entrepreneurially minded graduate and undergraduate students who seek opportunities to develop creative problem solving and critical analysis skills to aid in better identifying, creating, and evaluating any new business opportunity, whether a start-up, social venture or innovation initiative inside a Fortune 500 company. CVE’s comprehensive curriculum includes the best practices, frameworks, and tools used in entrepreneurial and innovative pursuits. In a teach-then-apply environment, students manage client based projects solving real-world problems in real time, whether helping an entrepreneur develop their new business or an established organization evaluate opportunities for growth. CVE fits with multiple degree plans, in multiple schools at the University, as either a requirement, an elective or a capstone. This course will meet with MBA 6503. Registration for this course is by permission only. ",
    "prereqInfo": "prereq: approved application",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4504",
    "subject": "BA",
    "id": "4504",
    "title": "Carlson Consulting Enterprise",
    "info": "Connects cutting-edge ideas/technologies from classroom to real problems presented by clients. Students work collaboratively with clients to integrate strategy/technology. How to lead complex change initiatives.  The class will meet concurrently with MBA 6504.",
    "prereqInfo": "prereq: approved application",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4505",
    "subject": "BA",
    "id": "4505",
    "title": "Brand Enterprise",
    "info": "Experiential learning program combining academic classroom sessions and \\\"real world\\\" projects where students assist client companies/organizations with strategic marketing/brand challenges. Projects are team based and focused on strategic and analytical\ncomponents, applying theory, and industry best practices. Working collaboratively in real world environment. Critical thinking, problem\nsolving, applied marketing skills, project management, strategic communication, and presentation skills. This course meets concurrently with MBA 6505.",
    "prereqInfo": "prereq:  approved application",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4991H",
    "subject": "BA",
    "id": "4991H",
    "title": "Honors Thesis Seminar II",
    "info": "Students refine research methodology, develop results, and derive preliminary conclusions. Draft of honors thesis, with preliminary results and clear agenda for final analysis.",
    "prereqInfo": "prereq: 4990H, CSOM honors, sr",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4992V",
    "subject": "BA",
    "id": "4992V",
    "title": "Honors Thesis Seminar",
    "info": "This course provides a foundation for how to conduct individually-pursed research with a focus on writing and methods. While it is designed to support Carlson School students writing their honors thesis, students do not need to continue with a thesis to successfully complete the course. In order to both develop your individual thesis as well as learn research methods and writing techniques over the course of a single semester, there will be parallel sets of assignments: one for your thesis (individual) and one for a practice thesis (group). During the first part of the course, your individual thesis project will be emphasized, focusing on finding a thesis topic related to the research of Carlson School faculty who will be supervisors for this academic year. Starting partway through the course, you will be paired with a group of students to work on a practice thesis in which methods, statistical analysis, and writing results are emphasized using pre-specified datasets. Writing is integrated fully into the course. You will be instructed in writing pertinent to research proposals and scholarship, including problem statements, annotated bibliographies, literature reviews, methodology, and reference lists. prereq: Senior honors student",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 4994H",
    "subject": "BA",
    "id": "4994H",
    "title": "Directed Research",
    "info": "Honors directed research.",
    "prereqInfo": "prereq: Honors",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 8444",
    "subject": "BA",
    "id": "8444",
    "title": "FTE: Doctoral",
    "info": "(No description)",
    "prereqInfo": "prereq: Doctoral student, adviser and DGS consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 8666",
    "subject": "BA",
    "id": "8666",
    "title": "Doct Pre-Thesis Cr*",
    "info": "TBD",
    "prereqInfo": "prereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 8888",
    "subject": "BA",
    "id": "8888",
    "title": "Thesis Credit:Doct*",
    "info": "(No description)",
    "prereqInfo": "prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BA 999",
    "subject": "BA",
    "id": "999",
    "title": "Immersion Core",
    "info": "Includes FINA 3001, MKTG 3001, SCO 3001, and MGMT 3004. Students enroll as a cohort during their sophomore or junior year, completing the four courses with same group of students. This is a signature experience for all Carlson School undergraduate students.",
    "prereqInfo": "prereq: Microecon, macroecon, calculus, accounting, statistics, Carlson School [soph or jr]",
    "prereq": {
      "course": []
    }
  }
]