[
  {
    "code": "BIE 5012",
    "subject": "BIE",
    "id": "5012",
    "title": "Adv Word Proc",
    "info": "Develop/apply solution methods for office problems using word processing software including advanced editing, printing, and desktop publishing capabilities.",
    "prereq": []
  },
  {
    "code": "BIE 5016",
    "subject": "BIE",
    "id": "5016",
    "title": "Web Development in Business",
    "info": "Introduction to developing interactive informational, instructional, and e-commerce sites. Basic Web development tools, including scripting languages.",
    "prereq": []
  },
  {
    "code": "BIE 5597",
    "subject": "BIE",
    "id": "5597",
    "title": "Internship: BIE",
    "info": "Practical experience in business or industry. Focuses on marketing or sales. Requires integrative paper.",
    "prereq": []
  },
  {
    "code": "BIE 5624",
    "subject": "BIE",
    "id": "5624",
    "title": "Sales Training",
    "info": "Training competent customer service employees as part of a marketing strategy. Explore training strategies using the appropriate instructional methods for different settings and situations.",
    "prereq": []
  },
  {
    "code": "BIE 5625",
    "subject": "BIE",
    "id": "5625",
    "title": "Technical Skills Training",
    "info": "Analyze technical skills and training practices in business and industry; systems and process analysis; trouble-shooting of work behavior; design methods and developing training materials.",
    "prereq": []
  },
  {
    "code": "BIE 5626",
    "subject": "BIE",
    "id": "5626",
    "title": "Cust Serv Trng",
    "info": "Overview of customer service strategies used by successful organizations and training practices used to develop customer-oriented personnel.",
    "prereq": []
  },
  {
    "code": "BIE 5627",
    "subject": "BIE",
    "id": "5627",
    "title": "Mgmt/Super T&D",
    "info": "Problems, practices, programs, and methodologies relating to the training and development of managers and supervisors, including needed competencies, needs assessment, delivery modes, and evaluation.",
    "prereq": []
  },
  {
    "code": "BIE 5662",
    "subject": "BIE",
    "id": "5662",
    "title": "Comptr Trng in Sch & Ind",
    "info": "Alternative teaching practices for business applications software: word processors, spreadsheets, graphics, desktop publishing, databases, and communications; public school and industry settings.  ",
    "prereq": []
  }
]