[
  {
    "code": "BIOC 1001",
    "subject": "BIOC",
    "id": "1001",
    "title": "Elem Biochemistry",
    "info": "Chemistry and biochemistry as they apply to the organization, function, and regulation of living systems, especially humans. Suitable for undergraduates who desire an introduction to biochemistry including students in health science programs such as dental hygiene or occupational therapy.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 1010",
    "subject": "BIOC",
    "id": "1010",
    "title": "Human Health and Disease",
    "info": "Introduction to molecular basis of common human diseases.  Human genome, cellular/molecular biology, biochemical reactions, organ relationships, whole body physiology.\nInherited Diseases, metabolic diseases.\nAging. Methods to diagnose, treat, and\nprevent disease. Gene therapy, regenerative medicine, drug-based interventions.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 1012",
    "subject": "BIOC",
    "id": "1012",
    "title": "Gen Prin Biochem",
    "info": "Continuation of Chem 1011. Elementary survey of biochemistry beginning with a review of organic chemistry.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 2011",
    "subject": "BIOC",
    "id": "2011",
    "title": "Biochem for Ag/Health Sciences",
    "info": "Survey of organic chemistry and biochemistry outlining structure and metabolism of biomolecules, metabolic regulation, principles of molecular biology.",
    "prereqInfo": "prereq: Chem 1015, Bio 1009",
    "prereq": {
      "course": [
        {
          "code": "CHEM 1015",
          "subject": "CHEM",
          "id": "1015"
        },
        {
          "code": "BIOC 1009",
          "subject": "BIOC",
          "id": "1009"
        }
      ]
    }
  },
  {
    "code": "BIOC 2331",
    "subject": "BIOC",
    "id": "2331",
    "title": "Chemical Mechanisms in Biology",
    "info": "Organic structure, properties, chemical mechanisms as they apply to biological systems. Theoretical approach. Metabolic conversions, biodegradation, other biology-specific aspects of chemistry.",
    "prereqInfo": "prereq: [CHEM 1062 or equiv], one semester of general biology recommended",
    "prereq": {
      "course": [
        {
          "code": "CHEM 1062",
          "subject": "CHEM",
          "id": "1062"
        }
      ]
    }
  },
  {
    "code": "BIOC 3001",
    "subject": "BIOC",
    "id": "3001",
    "title": "Biochem for Health Sciences",
    "info": "Survey of organic chemistry/biochemistry.  Structure/metabolism of biomolecules, basic principles of molecular biology, regulation of physiological processes.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 3021",
    "subject": "BIOC",
    "id": "3021",
    "title": "Biochemistry",
    "info": "Fundamentals of biochemistry. Structure/function of nucleic acids, proteins, lipids, carbohydrates. Enzymes. Metabolism. DNA replication and repair, transcription, protein synthesis. ",
    "prereqInfo": "Recommended prerequisites: Introductory biology (BIOL 1009 or BIOL 2003 or equivalent), organic chemistry (CHEM 2301 or CHEM 2081/2085 or equivalent). Note: CBS students should take BIOC 3022 not 3021.",
    "prereq": {
      "course": [
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "BIOL 2003",
          "subject": "BIOL",
          "id": "2003"
        },
        {
          "code": "CHEM 2301",
          "subject": "CHEM",
          "id": "2301"
        },
        {
          "code": "CHEM 2081",
          "subject": "CHEM",
          "id": "2081"
        },
        {
          "code": "BIOC 2085",
          "subject": "BIOC",
          "id": "2085"
        },
        {
          "code": "BIOC 3022",
          "subject": "BIOC",
          "id": "3022"
        },
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        }
      ]
    }
  },
  {
    "code": "BIOC 3022",
    "subject": "BIOC",
    "id": "3022",
    "title": "Biochem for Life Scientists",
    "info": "This course provides an introduction to biochemistry including discussion of the structure and functions of biomolecules (proteins, carbohydrates, lipids, and nucleic acids), central metabolic pathways, and the mechanisms of enzyme action.",
    "prereqInfo": "This course is intended for students in the College of Biological Sciences. Students from other colleges should register for BIOC 3021.",
    "prereq": {
      "course": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        }
      ]
    }
  },
  {
    "code": "BIOC 3600",
    "subject": "BIOC",
    "id": "3600",
    "title": "Special Topics in Biochemistry",
    "info": "Topics course in Biochemistry",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 3960",
    "subject": "BIOC",
    "id": "3960",
    "title": "Biochem Research Topics",
    "info": "Lectures and discussion on current research in the department.",
    "prereqInfo": "prereq: BIOC 3021 or BIOC 3022 or concurrent registration is required (or allowed) in 4331 or instr consent",
    "prereq": {
      "course": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOC 3022",
          "subject": "BIOC",
          "id": "3022"
        },
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        }
      ]
    }
  },
  {
    "code": "BIOC 4001",
    "subject": "BIOC",
    "id": "4001",
    "title": "Biochemistry for Med Tech",
    "info": "Chemical properties, biosynthesis, catabolism, structure/function of biomolecules. Fundamental aspects of molecular biology/metabolic regulation.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 4002",
    "subject": "BIOC",
    "id": "4002",
    "title": "Physiol Biochem Human Systems",
    "info": "Physiological biochemistry. Emphasizes processes occurring in humans.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 4025W",
    "subject": "BIOC",
    "id": "4025W",
    "title": "Laboratory in Biochemistry",
    "info": "Theory, principles, and use of fundamental techniques in modern biochemistry labs. ",
    "prereqInfo": "prereq: 3021, 3022, or 4331 or equiv",
    "prereq": {
      "course": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOC 3022",
          "subject": "BIOC",
          "id": "3022"
        },
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        }
      ]
    }
  },
  {
    "code": "BIOC 4125",
    "subject": "BIOC",
    "id": "4125",
    "title": "Molecular Bio & Biotech Lab",
    "info": "This molecular biology laboratory course is designed to give students hands-on experience performing common techniques used in modern molecular biology, as well as the background information needed to understand what kind of information can be obtained by using them. Because of the dual nature of this course, a portion of the laboratory time will be spent on lectures explaining the theory behind the techniques being used as well as practical aspects of experimental design. In addition, readings will be assigned that explain the history and principles behind some of the techniques used. Basic recombinant DNA techniques: methods for growing, isolating, and purifying recombinant DNA and cloning vectors, DNA sequencing and sequence analysis, gene expression, Polymerase Chain Reaction (PCR), other current techniques.",
    "prereqInfo": "prereq: Biol 3015 or Biol 3020 or Biol 3025 or Bioc 3021 or Bioc 3022 or Bioc 4331 or Biol 4003 or instructor consent",
    "prereq": {
      "course": [
        {
          "code": "BIOL 3015",
          "subject": "BIOL",
          "id": "3015"
        },
        {
          "code": "BIOL 3020",
          "subject": "BIOL",
          "id": "3020"
        },
        {
          "code": "BIOL 3025",
          "subject": "BIOL",
          "id": "3025"
        },
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOC 3022",
          "subject": "BIOC",
          "id": "3022"
        },
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        },
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        }
      ]
    }
  },
  {
    "code": "BIOC 4185",
    "subject": "BIOC",
    "id": "4185",
    "title": "Molecular Genetics",
    "info": "Basic recombinant DNA techniques. Methods for growing, isolating, and purifying recombinant DNA and cloning vectors. DNA sequencing, sequence analysis. Gene expression, Polymerase Chain Reaction (PCR). Current techniques.",
    "prereqInfo": "prereq: Enrollment in Life Sciences Summer Undergraduate Research Program",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 4225",
    "subject": "BIOC",
    "id": "4225",
    "title": "Laboratory In NMR Techniques",
    "info": "Practical aspects of nuclear magnetic resonance (NMR) spectrometry. Hands-on experience with 500/600 MHz instruments. Sample preparation/handling, contamination sources, tube/probe options, experiment selection, experimental procedures, software, data processing.",
    "prereqInfo": "prereq: 4331; 4521 recommended; intended for biochemistry majors",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        }
      ]
    }
  },
  {
    "code": "BIOC 4325",
    "subject": "BIOC",
    "id": "4325",
    "title": "Mass Spectrometry Laboratory",
    "info": "Hands-on experience with techniques/instruments. Sample preparation/handling, 2-dimenstioal gels, MS-MS, MALDI-TOF, electrospray/LC-MS, experiment selection/procedures, software, data processing.",
    "prereqInfo": "prereq: 4332, 4521",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4332",
          "subject": "BIOC",
          "id": "4332"
        },
        {
          "code": "BIOC 4521",
          "subject": "BIOC",
          "id": "4521"
        }
      ]
    }
  },
  {
    "code": "BIOC 4331",
    "subject": "BIOC",
    "id": "4331",
    "title": "Structure/Catalysis/Metabolism",
    "info": "Advanced survey of structure/catalysis, metabolism/bioenergetics.",
    "prereqInfo": "prereq: (BIOL 1009 or 2003 or equiv) AND (Chem 2302 or CHEM 2081/2085 or equiv)",
    "prereq": {
      "course": [
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "BIOC 2003",
          "subject": "BIOC",
          "id": "2003"
        },
        {
          "code": "CHEM 2302",
          "subject": "CHEM",
          "id": "2302"
        },
        {
          "code": "CHEM 2081",
          "subject": "CHEM",
          "id": "2081"
        },
        {
          "code": "BIOC 2085",
          "subject": "BIOC",
          "id": "2085"
        }
      ]
    }
  },
  {
    "code": "BIOC 4332",
    "subject": "BIOC",
    "id": "4332",
    "title": "Signal Trans/Gene Expression",
    "info": "Advanced survey of molecular biology. Mechanisms of gene action/biological regulation. ",
    "prereqInfo": "prereq: BioC 4331 or Bioc 3201 or BioC 3022",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        },
        {
          "code": "BIOC 3201",
          "subject": "BIOC",
          "id": "3201"
        },
        {
          "code": "BIOC 3022",
          "subject": "BIOC",
          "id": "3022"
        }
      ]
    }
  },
  {
    "code": "BIOC 4351",
    "subject": "BIOC",
    "id": "4351",
    "title": "Protein Engineering",
    "info": "Key properties of enzymes/molecular basis, computer modeling strategies, mutagenesis strategies to create protein variants, expression/screening of protein variants. Evaluate research papers, identify unsolved practical/theoretical problems, plan protein engineering experiment.",
    "prereqInfo": "prereq: 4331 or instr consent",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        }
      ]
    }
  },
  {
    "code": "BIOC 4418",
    "subject": "BIOC",
    "id": "4418",
    "title": "Molecular Immunol",
    "info": "Molecular interactions occurring among proteins and peptides involved in immune recognition.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 4521",
    "subject": "BIOC",
    "id": "4521",
    "title": "Intro to Physical Biochemistry",
    "info": "Physical chemical principles, their applications in biochemistry. Thermodynamics, kinetics, spectroscopy, solution dynamics as applied to biochemical reactions/ biopolymers. ",
    "prereqInfo": "prereq: 4331 recommended, (Chem 1081 or 1061 and 1065) AND (Physics 1221 or 1201W or 1301W) required",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        },
        {
          "code": "CHEM 1081",
          "subject": "CHEM",
          "id": "1081"
        },
        {
          "code": "BIOC 1061",
          "subject": "BIOC",
          "id": "1061"
        },
        {
          "code": "BIOC 1065",
          "subject": "BIOC",
          "id": "1065"
        },
        {
          "code": "BIOC 1221",
          "subject": "BIOC",
          "id": "1221"
        },
        {
          "code": "BIOC 1201W",
          "subject": "BIOC",
          "id": "1201W"
        },
        {
          "code": "BIOC 1301W",
          "subject": "BIOC",
          "id": "1301W"
        }
      ]
    }
  },
  {
    "code": "BIOC 4793W",
    "subject": "BIOC",
    "id": "4793W",
    "title": "Directed Studies: WI",
    "info": "Writing Intensive Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. One main feature of this course is that the student will receive writing instruction and the written output of the course will be revised during the semester. The project needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, how writing instruction will take place, a timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. This course is graded S/N and approval of the DUGS is required before a grade of S can be given by the faculty mentor. ",
    "prereqInfo": "prereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4793W",
          "subject": "BIOC",
          "id": "4793W"
        },
        {
          "code": "BIOC 4993",
          "subject": "BIOC",
          "id": "4993"
        },
        {
          "code": "BIOC 4994",
          "subject": "BIOC",
          "id": "4994"
        }
      ]
    }
  },
  {
    "code": "BIOC 4794W",
    "subject": "BIOC",
    "id": "4794W",
    "title": "Directed Research: WI",
    "info": "Writing Intensive Directed Research is an individual-study, laboratory or field research experience in which the student is mentored directly by a faculty member. This course is not for students starting out in research. It is intended for students who already have been working in the research group of the mentor and have developed an independent research project. In this course, the student will receive writing instruction through a writing support course (corresponding to 1 credit in addition to the credits of directed research time) that will meet weekly throughout the semester. The written output usually is in the form of a scientific paper describing the results of the student's project. Written output of the course must be revised during the semester and a schedule for writing, assessment, and revision needs to be in place at the beginning of the semester. The project needs to be explained in the campus Directed Research contract and the project and participation in the writing support course agreed on by both the student and faculty mentor. The contract must be approved by the Director of Undergraduate Studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, agreement about how writing instruction will take place, confirmation of understanding of the timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course - near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. The DUGS can call for a final revision before a grade is given. This course is graded S/N by the writing support course instructor, and approval of both the DUGS and the research mentor is required before a grade of S can be given by the writing support course instructor.",
    "prereqInfo": "This course is for non-Honors students. Students should register for the number of research credits they intend to pursue plus 1 cr for the writing support component (for example: 2-4 cr of research + 1 cr writing support = 3-5 cr).",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 4950",
    "subject": "BIOC",
    "id": "4950",
    "title": "Biochem Computer Simulation",
    "info": "Introduction to computer simulation and data analysis. How to use readily available computer tools to formulate quantitative models and analyze experiments with free/open source software program R.",
    "prereqInfo": "prereq: 4331, 4332, MATH 1272",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        },
        {
          "code": "BIOC 4332",
          "subject": "BIOC",
          "id": "4332"
        },
        {
          "code": "MATH 1272",
          "subject": "MATH",
          "id": "1272"
        }
      ]
    }
  },
  {
    "code": "BIOC 4960",
    "subject": "BIOC",
    "id": "4960",
    "title": "Special Topics in Biochemistry",
    "info": "In-depth study of a topic in biochemistry.",
    "prereqInfo": "prereq: [[3021 or equiv], CHEM 2301]] or instr consent",
    "prereq": {
      "course": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "CHEM 2301",
          "subject": "CHEM",
          "id": "2301"
        }
      ]
    }
  },
  {
    "code": "BIOC 4993",
    "subject": "BIOC",
    "id": "4993",
    "title": "Directed Studies",
    "info": "Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. The topic for the course needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. ",
    "prereqInfo": "prereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4793W",
          "subject": "BIOC",
          "id": "4793W"
        },
        {
          "code": "BIOC 4993",
          "subject": "BIOC",
          "id": "4993"
        },
        {
          "code": "BIOC 4994",
          "subject": "BIOC",
          "id": "4994"
        }
      ]
    }
  },
  {
    "code": "BIOC 4994",
    "subject": "BIOC",
    "id": "4994",
    "title": "Directed Research",
    "info": "Directed Research is an individual-study, laboratory or field investigation course. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a Research/Directed Studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. ",
    "prereqInfo": "prereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.\n",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4793W",
          "subject": "BIOC",
          "id": "4793W"
        },
        {
          "code": "BIOC 4993",
          "subject": "BIOC",
          "id": "4993"
        },
        {
          "code": "BIOC 4994",
          "subject": "BIOC",
          "id": "4994"
        }
      ]
    }
  },
  {
    "code": "BIOC 5001",
    "subject": "BIOC",
    "id": "5001",
    "title": "Biochem Molecular/Cell Biol",
    "info": "Integrated course in biochemistry, molecular biology, cell biology, and developmental biology.",
    "prereqInfo": "prereq: undergrad course in biochemistry, instr consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5002",
    "subject": "BIOC",
    "id": "5002",
    "title": "Evaluation of Biochem Research",
    "info": "BioC 5002 guides advanced undergraduates and new graduate students as they learn how to design experiments and to critically evaluate a wide variety of cutting-edge research projects, both as readers and as researchers. Introductory lectures include peer review, experimental design, critical thinking and the psychology of judgment and decision-making. This is followed by a series of guest speakers who will guide students as they develop their skills in evaluation of current research papers.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5213",
    "subject": "BIOC",
    "id": "5213",
    "title": "Topics in Molecular Biology",
    "info": "Cutting edge areas in molecular biology. Topics focus on the \\\"3 R's\\\" of DNA: repair, replication, and recombination. Faculty who are experts in these areas teach modules on specific topics, including discussion of their research interests.",
    "prereqInfo": "prereq: 4332 or 8002 or [3021, BIOL 4003] or instr consent",
    "prereq": {
      "course": [
        {
          "code": "BIOC 4332",
          "subject": "BIOC",
          "id": "4332"
        },
        {
          "code": "BIOC 8002",
          "subject": "BIOC",
          "id": "8002"
        },
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        }
      ]
    }
  },
  {
    "code": "BIOC 5216",
    "subject": "BIOC",
    "id": "5216",
    "title": "Signal Transduction",
    "info": "Mechanisms by which biological signals evoke biochemical responses.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5225",
    "subject": "BIOC",
    "id": "5225",
    "title": "Graduate NMR Laboratory",
    "info": "Practical aspects of nuclear magnetic resonance (NMR) spectrometry. Hands-on experience with 500/600 MHz instruments. Sample preparation/handling, contamination sources, tube/probe options, experiment selection, experimental procedures, software, data processing.",
    "prereqInfo": "prereq: 8001 or instr consent",
    "prereq": {
      "course": [
        {
          "code": "BIOC 8001",
          "subject": "BIOC",
          "id": "8001"
        }
      ]
    }
  },
  {
    "code": "BIOC 5309",
    "subject": "BIOC",
    "id": "5309",
    "title": "Biocat & Biodegrad",
    "info": "Fundamentals of microbial enzymes/metabolism as pertaining to biodegradation of environmental pollutants/biosynthesis for making commodity chemicals. Practical examples. Guest speakers from industry.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5351",
    "subject": "BIOC",
    "id": "5351",
    "title": "Protein Engineering",
    "info": "Key properties of enzymes/molecular basis, computer modeling strategies, mutagenesis strategies to create protein variants, expression/screening of protein variants. Evaluate research papers, identify unsolved practical/theoretical problems, plan protein engineering experiment.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5352",
    "subject": "BIOC",
    "id": "5352",
    "title": "Biotech and Bioengineering",
    "info": "Protein biotechnology. Microorganisms used as hosts for protein expression, protein expression, and engineering methods. Production of enzymes of industrial interest. Applications of protein biotechnology in bioelectronics. Formulation of therapeutic biopharmaceuticals.",
    "prereqInfo": "Recommended prerequisites: Biochemistry (BiOC 3021 or 3022 or 4331) and Microbiology MICB 3301\n",
    "prereq": {
      "course": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOC 3022",
          "subject": "BIOC",
          "id": "3022"
        },
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        },
        {
          "code": "MICB 3301",
          "subject": "MICB",
          "id": "3301"
        }
      ]
    }
  },
  {
    "code": "BIOC 5353",
    "subject": "BIOC",
    "id": "5353",
    "title": "Biotechnology-Small Molecules",
    "info": "Small molecule biotechnology. Screening strategies for drug discovery. Secondary metabolite and antibiotic biosynthesis. Combinatorial methods for generating new pharmaceutically active natural products. Production of organic acids and vitamins. Introduction to metabolic engineering.",
    "prereqInfo": "prereq: [[3021 or 4331 or Biol 3021 or MicB 4111], [Biol 3301 or MicB 3301]] or instr consent",
    "prereq": {
      "course": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        },
        {
          "code": "BIOL 3021",
          "subject": "BIOL",
          "id": "3021"
        },
        {
          "code": "MICB 4111",
          "subject": "MICB",
          "id": "4111"
        },
        {
          "code": "BIOL 3301",
          "subject": "BIOL",
          "id": "3301"
        },
        {
          "code": "MICB 3301",
          "subject": "MICB",
          "id": "3301"
        }
      ]
    }
  },
  {
    "code": "BIOC 5361",
    "subject": "BIOC",
    "id": "5361",
    "title": "Microbial Genomics",
    "info": "Introduction to genomics. Emphasizes microbial genomics. Sequencing methods, sequence analysis, genomics databases, genome mapping, prokaryotic horizontal gene transfer, genomics in biotechnology, intellectual property issues. Hands-on introduction to UNIX shell scripting, genomic data analysis using R and Excel in a computer lab setting. ",
    "prereqInfo": "prereq: College-level courses in [organic chemistry, biochemistry, microbiology]",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5401W",
    "subject": "BIOC",
    "id": "5401W",
    "title": "Advanced Metabolism",
    "info": "Underlying principles that determine metabolism of common/unusual compounds in plants, animals, microorganisms. Regulation of carbon, energy flow in whole organisms.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5444",
    "subject": "BIOC",
    "id": "5444",
    "title": "Muscle",
    "info": "Muscle molecular structure/function and disease. Muscle regulation, ion transport, and force generation. Muscular dystrophy and heart disease.",
    "prereqInfo": "prereq: 3021 or BIOL 3021 or 4331 or BIOL 4331 or PHSL 3061 or instr consent",
    "prereq": {
      "course": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOL 3021",
          "subject": "BIOL",
          "id": "3021"
        },
        {
          "code": "BIOC 4331",
          "subject": "BIOC",
          "id": "4331"
        },
        {
          "code": "BIOL 4331",
          "subject": "BIOL",
          "id": "4331"
        },
        {
          "code": "PHSL 3061",
          "subject": "PHSL",
          "id": "3061"
        }
      ]
    }
  },
  {
    "code": "BIOC 5446",
    "subject": "BIOC",
    "id": "5446",
    "title": "Membrane Biochemistry",
    "info": "Membrane structure. Mechanisms and physiological roles of channels, pumps, and membrane enzymes.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5527",
    "subject": "BIOC",
    "id": "5527",
    "title": "Intro Structural Biology",
    "info": "Methods employed in modern structural biology to elucidate macromolecular structures. Primary focus on X-ray diffraction, nuclear magnetic resonance (NMR) spectroscopy and mass spectrometry. Principles underlying structural biology and structure/function relationships.",
    "prereqInfo": "prereq: [intro biochemistry, intro physics] or physical chemistry or instr consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5528",
    "subject": "BIOC",
    "id": "5528",
    "title": "Spectroscopy & Kinetics",
    "info": "Biochemical dynamics from perspectives of kinetics and spectroscopy.  Influence of structure, molecular interactions, and chemical transformations on biochemical reactions. Focuses on computational, spectroscopic, and physical methods. Steady-state and transient kinetics. Optical and magnetic resonance spectroscopies.",
    "prereqInfo": "prereq: Intro physical chemistry or equiv; intro biochemistry recommended",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5530",
    "subject": "BIOC",
    "id": "5530",
    "title": "Topics Molecular Biophysics",
    "info": "Topics from current literature on biophysics of proteins, nucleic acids, muscle, membranes. Content/instructors vary from one offering to another, on an approximately every other year rotation.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5531",
    "subject": "BIOC",
    "id": "5531",
    "title": "Macro Crystallography I",
    "info": "Macromolecular crystallography for protein structure determination/engineering. Determining macromolecule structure by diffraction.",
    "prereqInfo": "prereq: [[One organic chemistry or biochemistry course], [two calculus or college physics courses]] or instr approval",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5532",
    "subject": "BIOC",
    "id": "5532",
    "title": "Macro Crystallography II",
    "info": "Determining structure of macromolecule by diffraction. Using software in macromolecular crystallography.",
    "prereqInfo": "prereq: 5531",
    "prereq": {
      "course": [
        {
          "code": "BIOC 5531",
          "subject": "BIOC",
          "id": "5531"
        }
      ]
    }
  },
  {
    "code": "BIOC 5535",
    "subject": "BIOC",
    "id": "5535",
    "title": "Intro Structrl Bio-Diffraction",
    "info": "Theory and practice in the determination of three-dimensional structures of macromolecules using x-ray and neutron diffraction and electron microscopy. ",
    "prereqInfo": "prereq: (Introductory biochemistry, introductory physics, college calculus] or physical chemistry or instr consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5536",
    "subject": "BIOC",
    "id": "5536",
    "title": "Intro Structural Biology - NMR",
    "info": "Theory and practice in the determination of three-dimensional structures of macromolecules using NMR. ",
    "prereqInfo": "Recommended prerequisite courses: (Introductory biochemistry, introductory physics, college calculus) or physical chemistry",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 5960",
    "subject": "BIOC",
    "id": "5960",
    "title": "Biophysical Spectroscopy",
    "info": "In-depth study of topics in biochemistry.",
    "prereqInfo": "prereq: [[3021 or equiv], CHEM 2301]] or instr consent or grad",
    "prereq": {
      "course": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "CHEM 2301",
          "subject": "CHEM",
          "id": "2301"
        }
      ]
    }
  },
  {
    "code": "BIOC 6001",
    "subject": "BIOC",
    "id": "6001",
    "title": "Biochem Molecular/Cell Biol",
    "info": "Integrated view of biochemistry, molecular biology, cell biology, and genetics. Clinical correlation sessions deal with specific diseases relevant to lecture topics.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 6002",
    "subject": "BIOC",
    "id": "6002",
    "title": "MedBiochem Nutrition",
    "info": "Introduction to principles/concepts of nutrition. Importance for medicine. Nine hours.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 6011",
    "subject": "BIOC",
    "id": "6011",
    "title": "Dental Biochemistry",
    "info": "Survey of chemical properties, biosynthesis, catabolism, structure/function of biomolecules. Fundamentals of molecular biology/metabolic regulation.",
    "prereqInfo": "prereq: Dental student",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 6012",
    "subject": "BIOC",
    "id": "6012",
    "title": "Biochem for Dental Students II",
    "info": "Survey of physiological biochemistry.  Emphasizes processes that occur in humans and are related to dentistry.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 6021",
    "subject": "BIOC",
    "id": "6021",
    "title": "Biochemistry",
    "info": "Fundamentals of biochemistry. Structure/function of proteins, nucleic acids, lipids and carbohydrates. Metabolism, regulation of metabolism. Quantitative treatments of chemical equilibria, enzyme catalysis, and bioenergetics. Chemical basis of genetic information flow.",
    "prereqInfo": "prereq: general biology, organic chemistry, instr consent; intended for MBS students",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8001",
    "subject": "BIOC",
    "id": "8001",
    "title": "Biochemistry",
    "info": "Protein structure, methods to determine structure, protein folding, forces stabilizing macromolecular structure, protein engineering, design. Dynamic properties of proteins/enzymes, enzyme substrate complexes, mechanism of enzyme catalysis. Enzymology of metabolic regulation and cell signaling.",
    "prereqInfo": "prereq: BMBB or MCDBconcurrent registration is required (or allowed) in G grad student or instr consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8002",
    "subject": "BIOC",
    "id": "8002",
    "title": "Molecular Biology",
    "info": "Classical to current topics in molecular biology. Aspects of DNA, RNA, and protein biology. DNA replication, repair, and recombination. RNA transcription, editing, and regulation. Protein translation/modification. Technologies such as deep-sequencing micro-RNA and prions.",
    "prereqInfo": "prereq: [BMBB or MCDBG] grad student or instr consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8005",
    "subject": "BIOC",
    "id": "8005",
    "title": "Biochem: Structure & Catalysis",
    "info": "Protein structure, methods to determine structure, protein folding, forces stabilizing macromolecular structure, protein engineering, design. Dynamic properties of proteins/enzymes, enzyme substrate complexes, mechanism of enzyme catalysis.  ",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8006",
    "subject": "BIOC",
    "id": "8006",
    "title": "Biochem: Metabolism & Control",
    "info": "Enzymology of metabolism, metabolic regulation, metabolic control and cell signaling.  ",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8007",
    "subject": "BIOC",
    "id": "8007",
    "title": "Molecular Biology of Genome",
    "info": "This course explores the molecular biology of the eukaryotic genome and transcriptome, focusing on fundamental genetic processes, molecular mechanisms, and their relationships to biology and disease. Students gain a firm understanding of the key concepts and techniques through lectures, reading, and discussions. Students learn to critically analyze scientific papers through student-led presentations and discussions. They gain experience in articulating scientific questions, formulating testable hypotheses, and designing experiments. This course promotes development of science writing skills.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8008",
    "subject": "BIOC",
    "id": "8008",
    "title": "Molecular Bio of Transcriptome",
    "info": "This course explores the molecular biology of the eukaryotic genome and transcriptome, focusing on fundamental genetic processes, molecular mechanisms, and their relationships to biology and disease. Students gain a firm understanding of the key concepts and techniques through lectures, reading, and discussions. Students learn to critically analyze scientific papers through student-led presentations and discussions. They gain experience in articulating scientific questions, formulating testable hypotheses, and designing experiments. This course promotes development of science writing skills.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8084",
    "subject": "BIOC",
    "id": "8084",
    "title": "Research & Literature Reports",
    "info": "Current developments.",
    "prereqInfo": "prereq: Grad BMBB major or instr consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8101",
    "subject": "BIOC",
    "id": "8101",
    "title": "Milestones in Biology of Aging",
    "info": "This course introduces the participant to historical perspectives and emerging topics on the biology of aging.  The course utilizes original literature, including both seminal, historical background papers and the most recent advances in the field of biogerontology. The participants use these resources to advance in-depth discussions on each of the topics.  This course is directed to graduate students and post-doctoral fellows currently engaged in conducting research in the area of biological aging. ",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8102",
    "subject": "BIOC",
    "id": "8102",
    "title": "Topics in the Biology of Aging",
    "info": "This course is intended to provide a platform of understanding about the major issues surrounding biological research in aging. This course will include a combination of student- and faculty-led discussions on select research topics that are highly relevant to the field of biogerontology research, along with instruction/discussions on scientific integrity. Student participants will lead discussions focused on their area of research expertise, utilizing a combination of review articles and research articles. Discussion of scientific misconduct will include case studies.  ",
    "prereqInfo": "This course is open to graduate students and post-doctoral fellows involved in the National Institutes on Aging (NIA) training grant “Functional Proteomics of Aging”. This course is also open to other graduate students or post-doctoral fellows who are conducting biological research in aging with instructor’s permission.\t",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8103",
    "subject": "BIOC",
    "id": "8103",
    "title": "Study of Biology of Aging",
    "info": "This course is intended to provide a platform of understanding about the use of proteomic and other large-scale \\\"omics\\\" technologies in aging research. This course will include a combination of faculty- and student-led discussions on select topics that are highly relevant to the field of mass spectrometry and proteomic research. This course also includes an introduction to the NIH/NRSA fellowship applications. This course is directed to graduate students and post-doctoral fellows currently engaged in conducting research in the area of biological aging.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8104",
    "subject": "BIOC",
    "id": "8104",
    "title": "Career in Aging Research",
    "info": "This course is intended to provide a platform for preparing pre-doctoral students and post-doctoral fellows for the next step in their academic career.  The course will include a combination of student- and faculty-led discussions on topics such as preparing for the job interview, composing a CV and cover letter, and developing a course syllabus based on the biology of aging. Trainees will also participate in a one-day symposium conducted by the MN Gerontological Society to raise their awareness of broad issues within the local aging community. This course is directed to graduate students and post-doctoral fellows currently engaged in conducting research in the area of biological aging.",
    "prereqInfo": "prereq: Graduate students and post-doctoral fellows on the NIA Training Grant \\\"Functional Proteomics of Aging\\\" and those who are interested in biological research in aging with instructor permission.",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8184",
    "subject": "BIOC",
    "id": "8184",
    "title": "Grad Sem",
    "info": "Reports on recent developments in the field and on research projects in the department.",
    "prereqInfo": "prereq: grad BMBB major or DGS consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8213",
    "subject": "BIOC",
    "id": "8213",
    "title": "Topics in Molecular Biology",
    "info": "Current topics such as DNA replication, recombination and gene conversion, regulation of gene expression, chromatin structure and transcription, developmental gene regulation, organellar gene expression, RNA splicing, initiation/control of translation, animal viruses, transposable elements, somatic recombination, oncogenes.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8216",
    "subject": "BIOC",
    "id": "8216",
    "title": "Signal Transduction/Gene Expr",
    "info": "Cell signaling, metabolic regulation in development. Procaryotic/eucaryotic systems used as models for discussion. Literature-based course.",
    "prereqInfo": "prereq: 8002 or instr consent",
    "prereq": {
      "course": [
        {
          "code": "BIOC 8002",
          "subject": "BIOC",
          "id": "8002"
        }
      ]
    }
  },
  {
    "code": "BIOC 8290",
    "subject": "BIOC",
    "id": "8290",
    "title": "Current Research Techniques",
    "info": "Research project carried out in laboratory of a staff member.",
    "prereqInfo": "prereq: Grad BMBB major",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8333",
    "subject": "BIOC",
    "id": "8333",
    "title": "FTE: Master's",
    "info": "(No description)",
    "prereqInfo": "prereq: Master's student, adviser and DGS consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8401",
    "subject": "BIOC",
    "id": "8401",
    "title": "Ethics Molec Cell Biology",
    "info": "Ethics of scientific investigation from viewpoint of western scientific enterprise. Relationship between science, culture, and public policies. Careers in molecular/cellular biology. Nontraditional career tracks. Invited speakers, case studies, small-group discussions, lectures.",
    "prereqInfo": "prereq: Grad student in [BMBB or MCDBconcurrent registration is required (or allowed) in G]",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8444",
    "subject": "BIOC",
    "id": "8444",
    "title": "FTE: Doctoral",
    "info": "(No description)",
    "prereqInfo": "prereq: Doctoral student, adviser and DGS consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8666",
    "subject": "BIOC",
    "id": "8666",
    "title": "Doct Pre-Thesis Cr*",
    "info": "TBD",
    "prereqInfo": "prereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8777",
    "subject": "BIOC",
    "id": "8777",
    "title": "Thesis Credit:Mast*",
    "info": "(No description)",
    "prereqInfo": "prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "BIOC 8888",
    "subject": "BIOC",
    "id": "8888",
    "title": "Thesis Credit:Doct*",
    "info": "(No description)",
    "prereqInfo": "prereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {
      "course": []
    }
  }
]