[
    {
        "code": "CHIC 1102",
        "subject": "CHIC",
        "id": "1102",
        "title": "Latinos in the United States",
        "info": "Historical/cultural knowledge on the complex/multi-layered relationship that Latinos have to the U.S., their country of origin. Influence of social, cultural, and political dynamics on Latino identity, politics, and sense of belonging in the U.S. Cultural citizenship.",
        "prereq": []
    },
    {
        "code": "CHIC 1105",
        "subject": "CHIC",
        "id": "1105",
        "title": "Maya-Aztec-Spanish",
        "info": "Convergence of Europe and America in Mesoamerica and the formation of Mexican society. Literary, social, cultural, and historical perspectives. Pre-Columbian period to 1875.",
        "prereq": []
    },
    {
        "code": "CHIC 1112",
        "subject": "CHIC",
        "id": "1112",
        "title": "Paradigms in Chicana/o Studies",
        "info": "Prevailing paradigms of analysis, methodologies of research, and guiding theoretical concepts that have shaped Chicana/o studies. The paradigms introduced in this course are foundational to the study of Chicanas, Chicanos, and Chicanx, and it provides the necessary tools for success in upper division courses in the department. Topics include decolonial imaginaries, indigeneity, intersectionality, experiential knowledge, hegemony and counter-hegemony, oppositional consciousness, queer theory, racialization, transnationalism, and globalization.\n\n",
        "prereq": []
    },
    {
        "code": "CHIC 1201",
        "subject": "CHIC",
        "id": "1201",
        "title": "Racial Formation/Transform US",
        "info": "How aggrieved racialized groups struggle over identity, culture, place, and meaning. Histories of racialization. Strategies toward rectification of historical injustices from dispossession, slavery, exploitation, and exclusion.",
        "prereq": []
    },
    {
        "code": "CHIC 1275",
        "subject": "CHIC",
        "id": "1275",
        "title": "Engaged Community Learning",
        "info": "Normative/applied ethics used to reflect on personal/societal responsibilities and to analyze U.S. educational systems. Institutional/social constraints on equitable educational opportunities for Chicano/Latino students. Models of inclusive/just education. Students tutor/mentor Chicanos/Latinos, dialogue with Chicano/Latino educators. This course covers race, ethnicity, gender, sexuality, immigration, migration.",
        "prereq": []
    },
    {
        "code": "CHIC 1401",
        "subject": "CHIC",
        "id": "1401",
        "title": "Intro to Dance",
        "info": "Modern dance, ballet, and world dance, primarily in the 20th century. Dance forms, choreographers, and dance issues. Lecture, discussion, viewing of live/taped performance.",
        "prereq": []
    },
    {
        "code": "CHIC 1901",
        "subject": "CHIC",
        "id": "1901",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
        "prereq": []
    },
    {
        "code": "CHIC 1902",
        "subject": "CHIC",
        "id": "1902",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.",
        "prereq": []
    },
    {
        "code": "CHIC 1905",
        "subject": "CHIC",
        "id": "1905",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.\n\nprereq: Freshman",
        "prereq": []
    },
    {
        "code": "CHIC 1907W",
        "subject": "CHIC",
        "id": "1907W",
        "title": "Freshman Seminar",
        "info": "Topic specified in Class Schedule.\n\nprereq: Fr",
        "prereq": []
    },
    {
        "code": "CHIC 1908W",
        "subject": "CHIC",
        "id": "1908W",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
        "prereq": []
    },
    {
        "code": "CHIC 1911",
        "subject": "CHIC",
        "id": "1911",
        "title": "Latina/o Revolutionaries",
        "info": "This seminar will examine the history of Latinas/os in the United States who created solidarities and relationships with activists, collectives, and revolutionary leaders in Latin America and across the globe. Highlighting how Latinas/os reacted to local struggles against systems of racism, labor exploitation, and patriarchy in a diversity of ways, the class will concentrate on how some of these movements made connections with Leftists in other parts of the world including Mexico, Cuba, Puerto Rico, Central America, Vietnam, and Palestine. Reflective of the historical context of US society and the global political-economy, these Latina/o revolutionaries put forth important visions, actions, and changes. Highlighting the diversity of these revolutionaries' perspectives and the debates between them and with others, the class will critically evaluate the ways their analyses, strategies, and practices sought to create a better world in their own neighborhoods, regions, and societies and tied them to key sites of radical change in other parts of the world.  ",
        "prereq": []
    },
    {
        "code": "CHIC 1912",
        "subject": "CHIC",
        "id": "1912",
        "title": "Performing Latinx Identities",
        "info": "What are the most popular representations of Latinos in mainstream media? How are stereotypes about Latinos perpetuated by the media? How do scholars in various fields, such as Communications and Latina/o Studies, critique one-dimensional images of Latinos in the media and in popular culture? How do Latinos challenge stereotypical portrayals and represent themselves when they create their own art or media? How does the intersection of ethnicity, gender, sexuality and class inform media representations and Latina/o/x-created art-forms? With these questions in mind, this course explores the representation of Latinos and Latinas in the media and how Latinas and Latinos represent themselves in mainstream, independent, and social media when they have creative control. \n\nStudents learn how Latina/o identity has been portrayed in popular and in independent media, in politics, in activism and social movements. By engaging with scholarship on media representation, students learn to identify the major stereotypes of Latinos in television, film, and news media. Students learn to differentiate between stereotypes and efforts towards self-representation produced by Latinos. The course will incorporate performances and workshops led by locally and nationally-renowned Latina/o artists.\n",
        "prereq": []
    },
    {
        "code": "CHIC 1913W",
        "subject": "CHIC",
        "id": "1913W",
        "title": "Food & Culture: Latinidad",
        "info": "There are few things more basic and bonding between humans than making and sharing food together. To offer food and drink is a gesture of hospitality throughout the world. When we cook and eat, we can traverse our family’s generations and migrations through and across regional and national boundaries. By understanding the practices surrounding someone’s food, we can come to understand a great deal about their culture. Indeed, food is often a site of cultural fusion and hybridity, indicating the human ability to share, adapt, and change. Food, cooking, eating, and the rituals surrounding them reflect and are informed by ethnicity, race, gender, sexuality, nationality, migration, and class. For these reasons, food is an excellent topic through which to explore intersectionality, empowerment, and cultural memory—three major topics in Chicana/o and Latinx studies. \n\nThis course is a study of food as an integral part of human experience, but particularly the experiences with food across latinidades, social groups of Latin America living in the United States. We study food as a form of cultural expression but also as a mechanism of power and inequality. As such, we examine topics such as the food service industry, farm worker organizing, food insecurity, cultural appropriation, and agri-business and food production). Each of these topics focus our attention on inequality and injustices, such as racism, sexism, hunger, and other difficult subjects. However, these topics also reveal resistance and agency among Latinos and Latinas, as well as Latinx people, the gender neutral term intended to include the wide range of gender identities among people of Latin American heritage living in the U.S. By understanding the labor and politics of the food industry, uneven access to food, and society’s expectations about Latinx cuisines, we come to understand the structural forces that generate notions of race, gender, sexuality, nationality, human migration, and material inequity. Through our sharing of food, recipes, and the stories behind them, particularly the foods prepared for días de los muertos (trans: days of the dead) we will gain understanding of our diverse experiences, looking at our past as well as our present, and the memories and structural conditions that shape our experiences. To deepen our knowledge, we learn from and engage with Latinx urban farmers and come to appreciate the Indigenous Mexican cultural values for the environment and sustainability.",
        "prereq": []
    },
    {
        "code": "CHIC 1914",
        "subject": "CHIC",
        "id": "1914",
        "title": "Latina/o/x Comics & Adult Lit.",
        "info": "In 2011, Marvel Comics created, Miles Morales, a Black and Puerto Rican character to replace Peter Parker as Spider-Man. Additional Latina/o/x characters emerged in mainstream and underground venues indicating an important shift in the comic book landscape. This course focuses on comic books and young adult (YA) literature to investigate race, class, gender, sexuality, and nationhood. Despite Latina/o/x population growth, Latina/o/xs remain highly underrepresented in publishing. This course draws from scholarship such as Frederick Luis Aldama and Christopher González’s Graphic Borders (2016) to discursively analyze comic book and YA texts. We will unpack the political implications comics and YA have on our culture. For example, comic book character La Borinqueña’s get out the vote campaign in Georgia for the 2020 senate elections. We will read a variety of texts including Elizabeth Acevedo’s Poet X, Gabby Rivera’s Juliet Takes a Breath, and Marvel Comics Miss America series featuring America Chavez. ",
        "prereq": []
    },
    {
        "code": "CHIC 1915",
        "subject": "CHIC",
        "id": "1915",
        "title": "What Is Ethnic Studies?",
        "info": "This course seeks to act as a site in which open honest dialogue can take place regarding our shared stake in a multiracial society. This course will study race and ethnicity in order to rethink foundational ideas, histories, and movements in United States society and beyond.  An overriding theme of the course will be an examination of how power relations are constructed through racism and its tie to colonialism; and conversely, how racialized communities--particularly African American, Latin@/e, Asian American, and American Indian--are sites of survival and resistance. Therefore, a guiding question that we will explore and discuss collectively will be what role has/does race play in re-creating unequal and hierarchical social arrangements in U.S. society?\n\nUnderstanding that the practice of race is not a series of isolated events, but an institutional phenomenon that works on a societal level, we will ask further, what purposes has/is race used for? To what ends has race been applied to ascertain who has access to resources, who works where, and who is a legitimate member of U.S. society?\n\nIndeed, a number of scholars agree that race has been and continues to be used to maintain or reconstruct an unequal society, for the benefit of particular interests, in the form of systematic oppression, but Ethnic Studies scholars have also ascertained that Black, Indigenous, and brown communities have also responded to racial oppression in a myriad of ways and a diversity of peoples have challenged institutional and everyday racism.  In light of this we will also ask, how have colonized people and their allies challenged, resisted, and accommodated racial oppression in U.S. society?\n\nIn particular, the class will close out considering the movement for Ethnic Studies in the K-12 school system across the U.S. and the ways in which it does not only seek to add new voices and perspectives, but to rethink the approach to education generally as a transformative process. \n\nAll in all, this course will analyze race and ethnicity to question and collectively address the limits and possibilities of a democratic society and seek to propose alternative practices that might make our society more democratic and egalitarian. Indeed, another emphasis of this course in regards to the larger inquire of democratic practice will be how racial and ethnic identities and social forces intersect with other categories such as class, gender, sexuality, and nationality. In these ways it is in the hope that students use these themes as a window into thinking critically about our society so that we might determine our own position in order to contribute to on-going struggles for a better world.",
        "prereq": []
    },
    {
        "code": "CHIC 3114",
        "subject": "CHIC",
        "id": "3114",
        "title": "US-Mex.Perspectives",
        "info": "The relations of Mexico and the United States from an international perspective with central focus on the cultural interchange in the borderlands between them; using both literary and historical materials.",
        "prereq": []
    },
    {
        "code": "CHIC 3208",
        "subject": "CHIC",
        "id": "3208",
        "title": "Mexico On My Mind",
        "info": "Images/issues across time and over a vast geographic territory--from art of Pre-Columbian cultures of Mesoamerica to colonial, post-Independence, and modern Mexico to modern Chicano art in the United States. How Mexico and its people have represented themselves and been represented by others. Identify, define, and solve some of the intricate problems that arise when representing and viewing images of oneself and others. Interpret/make more informed choices. Role images play in community, national, and international politics through history. How these images have come to shape modern perceptions and how these perceptions affect people in Mexico and the United States today.",
        "prereq": []
    },
    {
        "code": "CHIC 3212",
        "subject": "CHIC",
        "id": "3212",
        "title": "Chicana Feminism",
        "info": "Scholarly/creative work of Chicanas or politically defined women of Mexican American community. Interdisciplinary. Historical context, cultural process, and autoethnography.\n",
        "prereq": []
    },
    {
        "code": "CHIC 3213",
        "subject": "CHIC",
        "id": "3213",
        "title": "Chicano Music and Art",
        "info": "Survey of diverse forms of cultural expressiveness in Mexican American music/art. History of various types of artistic production and musical forms in their regional specificity. Social/economic implications of several genres, styles, and traditions.",
        "prereq": []
    },
    {
        "code": "CHIC 3216W",
        "subject": "CHIC",
        "id": "3216W",
        "title": "Chicana and Chicano Art",
        "info": "A Chicana/o has been described as a Mexican-American with a political sense of identity that emerges from a desire for social justice. One journalist bluntly stated, \\\"A Chicano is a Mexican-American with a non-Anglo image of himself\\\" (Ruben Salazar, Los Angeles Times, 1970). This identity emerged through the Chicano Movement, a social and political mobilization that began in the 1960s and 1970s. The Chicano Movement witnessed the rise of community-based political organizing to improve the working conditions, education, housing opportunities, health, and civil rights for Mexican-Americans. For its inception, the Chicano Movement attracted artists who created a new aesthetic and framework for producing art. A major focus of Chicana/o artists of the 1960s and 1970s was representation, the right to self-determination, and the role of art in fostering civic and public engagement. This focus continues to inform Chicana/o cultural production. Social intervention, empowerment, and institutional critique remain some of the most important innovations of American art of the last several decades, and Chicana/o artists played a significant role in this trend.",
        "prereq": []
    },
    {
        "code": "CHIC 3221",
        "subject": "CHIC",
        "id": "3221",
        "title": "Chicana/o Cultural Studies",
        "info": "Cultural studies approach to investigating aesthetic dimensions of experience that inform and are informed by dynamic relationship between culture, class, ethnicity, and power.",
        "prereq": []
    },
    {
        "code": "CHIC 3223",
        "subject": "CHIC",
        "id": "3223",
        "title": "Chicano Representation in Film",
        "info": "Introduction to Chicana/o and Latina/o visual representation. Depiction of Latina/o experience, history, and culture in film. Analyzing independent/commercial films as texts that illuminate deeply held beliefs around race, class, ethnicity, gender, and national origin.",
        "prereq": []
    },
    {
        "code": "CHIC 3275",
        "subject": "CHIC",
        "id": "3275",
        "title": "Engaged Community Learning",
        "info": "Normative/applied ethics used to reflect on personal/societal responsibilities and to analyze U.S. educational systems. Institutional/social constraints on equitable educational opportunities for Chicano/Latino students. Models of inclusive/just education. Students tutor/mentor Chicanos/Latinos, dialogue with Chicano/Latino educators. This course covers race, ethnicity, gender, sexuality, immigration, migration.",
        "prereq": []
    },
    {
        "code": "CHIC 3310",
        "subject": "CHIC",
        "id": "3310",
        "title": "Chicanas/os and the Law",
        "info": "Surveys the status of Chicanas and Chicanos in the law.  A wide realm of case law and articles introduce key issues.  Examines history, inequality, education, employment, affirmative action, criminal law, immigration, housing, and environmental racism.",
        "prereq": []
    },
    {
        "code": "CHIC 3352",
        "subject": "CHIC",
        "id": "3352",
        "title": "Transborder Theory",
        "info": "Demographic realities, political/economic shifts, cultural exchanges that characterize U.S.-Mexico borderland spaces in global economy. Historically contextualized, transnational approach to cultures, politics, and economics of U.S.-Mexico Borderlands. Dynamics of borderland spaces.",
        "prereq": []
    },
    {
        "code": "CHIC 3374",
        "subject": "CHIC",
        "id": "3374",
        "title": "Migrant Farmworkers in the US",
        "info": "Socioeconomic/political forces that impact migrant farmworkers. Effects of the laws and policies on everyday life. Theoretical assumptions/strategies of unions and advocacy groups. Role/power of consumer. How consuming cheap food occurs at expense of farmworkers.",
        "prereq": []
    },
    {
        "code": "CHIC 3375",
        "subject": "CHIC",
        "id": "3375",
        "title": "Folklore of Mexico",
        "info": "Scholarly survey and exploration of the sociocultural  function of various types of folklore in Greater Mexico. Ways in which folklore constructs and maintains community, as well as resists and engenders cultural shifts.",
        "prereq": []
    },
    {
        "code": "CHIC 3402",
        "subject": "CHIC",
        "id": "3402",
        "title": "Las Mujeres",
        "info": "Focus on Chicanas; women of the Mexican American community. Exploration of racial, economic, political, and gender issues of concern to all Mexican Americans and diverse Latino cultures. ",
        "prereq": []
    },
    {
        "code": "CHIC 3412",
        "subject": "CHIC",
        "id": "3412",
        "title": "Cmparativ Indigenous Feminisms",
        "info": "The course will examine the relationship between Western feminism and indigenous feminism as well as the interconnections between women of color feminism and indigenous feminism. In addition to exploring how indigenous feminists have theorized from 'the flesh' of their embodied experience of colonialism, the course will also consider how indigenous women are articulating decolonization and the embodiment of autonomy through scholarship, cultural revitalization, and activism. ",
        "prereq": []
    },
    {
        "code": "CHIC 3423",
        "subject": "CHIC",
        "id": "3423",
        "title": "Central American Revolutions",
        "info": "Social, political, and economic issues that have shaped Central American history for nearly two centuries. Colonial histories, capitalist development, ethnic/racial conflict, foreign intervention, Catholic Church, civil war throughout region. Readings/discussions cover events in Guatemala, Honduras, El Salvador, Nicaragua, Costa Rica, and Panama.\n",
        "prereq": []
    },
    {
        "code": "CHIC 3425",
        "subject": "CHIC",
        "id": "3425",
        "title": "History of Modern Mexico",
        "info": "Mexico from independence to the present: struggles for land, liberty, and equality; ethnicity, gender, and class; economic growth, nationalism, and globalization; urbanization, immigration, demographic transition. Issues of race, religion, and national identity; the US-Mexico War, the 1910 Mexican Revolution, urbanization, migration, free trade agreements, and the War on Drugs.",
        "prereq": []
    },
    {
        "code": "CHIC 3427",
        "subject": "CHIC",
        "id": "3427",
        "title": "Cuba & Puerto Rico",
        "info": "Historical development of Cuba and Puerto Rico from pre-Columbian times through the Spanish conquest to the present. Conquest and colonization, slavery, Hispanic Caribbean society and culture, Operation Bootstrap, Cuban Revolution.",
        "prereq": []
    },
    {
        "code": "CHIC 3442",
        "subject": "CHIC",
        "id": "3442",
        "title": "History 1900-Prsnt",
        "info": "Migration, repatriation, the Bracero program, politics, the Chicana/o movement, work, society, and culture.  ",
        "prereq": []
    },
    {
        "code": "CHIC 3444",
        "subject": "CHIC",
        "id": "3444",
        "title": "Chicana and Chicano History I",
        "info": "Experiences of people of Mexican descent in the United States. Important eras in histories of Mexico, the United States, and Mexican Americans. Central role of Chicana/os in U.S. history, culture, and politics. Topics include race, ethnicity, gender, sexuality, immigration, migration.",
        "prereq": []
    },
    {
        "code": "CHIC 3446",
        "subject": "CHIC",
        "id": "3446",
        "title": "Chicana and Chicano History II",
        "info": "Experiences of people of Mexican descent in the U.S. Notions of citizenship from WWII. Chicano civil rights movement. Impact of immigration patterns/legislation. Cultural wars, changing demographics. Social, economic, and political changes that influenced day-to-day life of Mexican Americans. Meaning of racialized \\\"Mexican\\\" identity. How different groups of Mexicans have understood their relationships to other Americans and other Latino groups.",
        "prereq": []
    },
    {
        "code": "CHIC 3452",
        "subject": "CHIC",
        "id": "3452",
        "title": "Chicanx/Latinx Indigeneity",
        "info": "Historical, cultural, and political processes impacting  Chicanas/os and their understanding of being\nindigenous to the North American continent. History, culture, and identity formation as dynamic processes intimately related to present and future constructions of Mexican American identities and sociopolitical perspectives.",
        "prereq": []
    },
    {
        "code": "CHIC 3507W",
        "subject": "CHIC",
        "id": "3507W",
        "title": "Intro to Chicana/o literature",
        "info": "Cultural, intellectual, and sociopolitical traditions of Mexican Americans as they are represented in creative literature. Genres/forms of creative cultural expression and their significance as representations of social, cultural, and political life in the United States. Novels, short stories, creative non-fiction, drama, essay, poetry, and hybrid forms of literature.",
        "prereq": []
    },
    {
        "code": "CHIC 3672",
        "subject": "CHIC",
        "id": "3672",
        "title": "Chicano Experience in Midwest",
        "info": "Experiences of people generally defined as Chicano or Latino, living in the Midwest. Individual/group identity. Focuses on construction of Chicano-Latino experience. How identity affirmation, migration stories, immigration status, historical memory, and cultural traditions are impacted by being in the Midwest.\n",
        "prereq": []
    },
    {
        "code": "CHIC 3712",
        "subject": "CHIC",
        "id": "3712",
        "title": "Psych. Perspectives",
        "info": "Textual analysis of Chicana/Latina writings with special emphasis on the psychological motivations of the subjects pertaining to race, class, and gender relationships. ",
        "prereq": []
    },
    {
        "code": "CHIC 3752",
        "subject": "CHIC",
        "id": "3752",
        "title": "Chicanos Contemporary Society",
        "info": "Introduction to sociological analysis of theoretical/methodological approaches to Chicano/a and Latina/o communities. Socioeconomic conditions, education, cultural change, the family, gender relations, political experiences. Theories, issues, methods of sociological research. Debates regarding qualitative/quantitative research methods.",
        "prereq": []
    },
    {
        "code": "CHIC 3771",
        "subject": "CHIC",
        "id": "3771",
        "title": "Latino Social  Movements",
        "info": "How Latinos have collectively resisted social domination. Theories of social power/movements. Resistance by Latinos during 60s/70s. Current organized efforts to curb immigration, establish English as official language, and limit immigrant rights. ",
        "prereq": []
    },
    {
        "code": "CHIC 3838",
        "subject": "CHIC",
        "id": "3838",
        "title": "Policing in 20th Century U.S.",
        "info": "This course explores how policing and surveillance changed, evolved, and adapted throughout the twentieth century in the United States. We will trace the trajectory of police power & legitimacy as well as examine how the institution of policing responded to ongoing racial justice movements. ",
        "prereq": []
    },
    {
        "code": "CHIC 3852",
        "subject": "CHIC",
        "id": "3852",
        "title": "Chicano Politics",
        "info": "Theory/practice of Chicana/o politics through an analysis of Mexican American experience, social agency, and response to larger political systems and behaviors using social science methods of inquiry. Unequal power relations, social justice, and the political economy.",
        "prereq": []
    },
    {
        "code": "CHIC 3862",
        "subject": "CHIC",
        "id": "3862",
        "title": "American Immigration Hist",
        "info": "Global migrations to U.S. from Europe, Asia, Latin American, and Africa, from early 19th century to present. Causes/cultures of migration. Migrant communities, work, and families. Xenophobia, assimilation/integration, citizenship, ethnicity, race relations. Debates over immigration. Place of immigration in America's national identity.",
        "prereq": []
    },
    {
        "code": "CHIC 3888",
        "subject": "CHIC",
        "id": "3888",
        "title": "Immigration & US Latina/o Exp",
        "info": "Experiences of migrants from Latin America to the United States in 20th/21st century. Migrant engagements with US society. Pre-existing Latina/o and other ethnic communities. experiences within political, economic, and social aspects of life at local/global level. ",
        "prereq": []
    },
    {
        "code": "CHIC 3896",
        "subject": "CHIC",
        "id": "3896",
        "title": "Internship for Academic Credit",
        "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer.  Typically the student's work is supervised and evaluated by a site coordinator or instructor.",
        "prereq": []
    },
    {
        "code": "CHIC 3900",
        "subject": "CHIC",
        "id": "3900",
        "title": "Topics in Chicano Studies",
        "info": "Topic: Health in Indig chicx/Latinx",
        "prereq": []
    },
    {
        "code": "CHIC 3920",
        "subject": "CHIC",
        "id": "3920",
        "title": "Topics in Spanish-American Lit",
        "info": "n/a",
        "prereq": []
    },
    {
        "code": "CHIC 3993",
        "subject": "CHIC",
        "id": "3993",
        "title": "Directed Studies",
        "info": "Guided individual reading, research, and study. Students often do preliminary readings and research in conjunction with plans for education abroad programs.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "CHIC 4231",
        "subject": "CHIC",
        "id": "4231",
        "title": "Color of Public Policy in US",
        "info": "Examination of the structural or institutional conditions through which people of color have been marginalized in public policy. Critical evaluation of social theory in addressing the problem of contemporary communities of color in the United States.\n",
        "prereq": []
    },
    {
        "code": "CHIC 4232",
        "subject": "CHIC",
        "id": "4232",
        "title": "Chicana Gender and Sexuality",
        "info": "Critical thinking of Chicanas/os and Latinas/os around construction of gender. Politics of sexual identity. How the self is gendered in relationship to sexual, racial, class, and national identities under different social structural conditions. Way in which the \\\"borders\\\" that define/confine sexual norms shift over time.",
        "prereq": []
    },
    {
        "code": "CHIC 4275",
        "subject": "CHIC",
        "id": "4275",
        "title": "Theory in Action",
        "info": "Theoretical frameworks of social justice and community engagement for work outside classroom with/in Latina/o community. Worker issues/organizing. Placements in unions, worker organizations. Policy initiatives on labor issues. Students reflect on their own identity development, social location, and position of power/privilege. ",
        "prereq": []
    },
    {
        "code": "CHIC 4401",
        "subject": "CHIC",
        "id": "4401",
        "title": "Chicana/Latina CS",
        "info": "Readings in Chicana/Latina cultural studies. TV, film, art, music, dance, theatre, literature. Identity/sexuality. Production of culture/theory. ",
        "prereq": []
    },
    {
        "code": "CHIC 4900W",
        "subject": "CHIC",
        "id": "4900W",
        "title": "Proseminar",
        "info": "Students work closely with a faculty member to complete their senior project.",
        "prereq": []
    },
    {
        "code": "CHIC 4901W",
        "subject": "CHIC",
        "id": "4901W",
        "title": "Senior Paper",
        "info": "Capstone experience. Students produce original research paper or creative project on a topic determined in consultation with a faculty adviser.",
        "prereq": []
    },
    {
        "code": "CHIC 4993W",
        "subject": "CHIC",
        "id": "4993W",
        "title": "Senior Capstone",
        "info": "This course accompanies any 3xxx, 4xxx, or 5xxx level course from Chicano and Latino Studies taught by a tenure-line faculty in the department and serves as the capstone requirement in addition to the existing host course requirements. Therefore, the student is co-currently enrolled in the appropriate 3xxx, 4xxx, or 5xxx level host course that matches their research interests and this capstone writing intensive class.",
        "prereq": []
    },
    {
        "code": "CHIC 5114",
        "subject": "CHIC",
        "id": "5114",
        "title": "US-Mex.Perspectives",
        "info": "The relations of Mexico and the United States from an international perspective with central focus on the cultural interchange in the borderlands between them; using both literary and historical materials.",
        "prereq": []
    },
    {
        "code": "CHIC 5216W",
        "subject": "CHIC",
        "id": "5216W",
        "title": "Chicana and Chicano Art",
        "info": "A Chicana/o has been described as a Mexican-American with a political sense of identity that emerges from a desire for social justice. One journalist bluntly stated, \\\"A Chicano is a Mexican-American with a non-Anglo image of himself\\\" (Ruben Salazar, Los Angeles Times, 1970). This identity emerged through the Chicano Movement, a social and political mobilization that began in the 1960s and 1970s. The Chicano Movement witnessed the rise of community-based political organizing to improve the working conditions, education, housing opportunities, health, and civil rights for Mexican-Americans. For its inception, the Chicano Movement attracted artists who created a new aesthetic and framework for producing art. A major focus of Chicana/o artists of the 1960s and 1970s was representation, the right to self-determination, and the role of art in fostering civic and public engagement. This focus continues to inform Chicana/o cultural production. Social intervention, empowerment, and institutional critique remain some of the most important innovations of American art of the last several decades, and Chicana/o artists played a significant role in this trend.",
        "prereq": []
    },
    {
        "code": "CHIC 5374",
        "subject": "CHIC",
        "id": "5374",
        "title": "Migrant Farmworkers in the US",
        "info": "Socioeconomic/political forces that impact migrant farmworkers. Effects of the laws and policies on everyday life. Theoretical assumptions/strategies of unions and advocacy groups. Role/power of consumer. How consuming cheap food occurs at expense of farmworkers.",
        "prereq": []
    },
    {
        "code": "CHIC 5412",
        "subject": "CHIC",
        "id": "5412",
        "title": "Cmparativ Indigenous Feminisms",
        "info": "The course will examine the relationship between Western feminism and indigenous feminism as well as the interconnections between women of color feminism and indigenous feminism. In addition to exploring how indigenous feminists have theorized from 'the flesh' of their embodied experience of colonialism, the course will also consider how indigenous women are articulating decolonization and the embodiment of autonomy through scholarship, cultural revitalization, and activism.   ",
        "prereq": []
    },
    {
        "code": "CHIC 5505",
        "subject": "CHIC",
        "id": "5505",
        "title": "Indigenous Women and Land",
        "info": "Examines the legal experience of Indigenous Women defending their land and property interests.  Encompasses a social ecology approach to their land struggles, including cultural and legal histories of Native Americans, Mexicanas and Chicanas.",
        "prereq": []
    },
    {
        "code": "CHIC 5601",
        "subject": "CHIC",
        "id": "5601",
        "title": "Migrant and Seasonal Labor",
        "info": "Surveys the agricultural workforce with a focus on legal theory.  While its approach is interdisciplinary, its emphasis is on the legal construct.  A wide realm of case law and articles address several key issues confronting agricultural laborers.",
        "prereq": []
    },
    {
        "code": "CHIC 5701",
        "subject": "CHIC",
        "id": "5701",
        "title": "History of Ancient Mexico",
        "info": "",
        "prereq": []
    },
    {
        "code": "CHIC 5702",
        "subject": "CHIC",
        "id": "5702",
        "title": "Colonial Mex. Lit.",
        "info": "Analysis and contextualization of Ancient and Colonial Mexican Literature such as Popol Vuh, Rabinal Achi, Chilam Balam, Codex Mendoza, Juan Ruiz de Alarcon, and Sor Juana Ines de la Cruz.",
        "prereq": []
    },
    {
        "code": "CHIC 5901",
        "subject": "CHIC",
        "id": "5901",
        "title": "Theory and Method",
        "info": "Focus on theory and methodology of Chicano Studies scholarship in social sciences and humanity.",
        "prereq": []
    },
    {
        "code": "CHIC 5920",
        "subject": "CHIC",
        "id": "5920",
        "title": "Topics in Chicana(o) Studies",
        "info": "Multidisciplinary themes in Chicana(o) studies. Issues of current interest.",
        "prereq": []
    },
    {
        "code": "CHIC 5921",
        "subject": "CHIC",
        "id": "5921",
        "title": "Women and the Law",
        "info": "Surveys the status of women in the law.  Examines a wide realm of legal issues impacting women, with primary focus on Chicanas and Native American women.  Examines historical, political, economic, social, and legal issues affecting women.",
        "prereq": []
    },
    {
        "code": "CHIC 5993",
        "subject": "CHIC",
        "id": "5993",
        "title": "Directed Studies",
        "info": "Guided individual reading, research, and study for completion of the requirements for a senior paper or honors thesis.\n\nprereq: instr consent",
        "prereq": []
    }
]