[{"code":"CNRC 1002","subject":"CNRC","id":"1002","title":"World of Greece","info":"Ancient Greek civilization, from second millenium BCE to Roman period. Art/archaeology, philosophy, science, literature, social/political institutions. Focuses on connections with contemporary cultures corresponding to Ancient Near East.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 1003","subject":"CNRC","id":"1003","title":"World of Rome","info":"In this course we will ask ourselves: why does ancient Rome refuse to go away? What is it\nabout ancient Rome that has captured the imaginations of Shakespeare and the framers of\nthe U.S. Constitution as well as HBO, Hollywood, and the video game industry? The course\nexamines the world of ancient Rome from early Etruscan and eastern origins to the\nemergent Christian Rome of later antiquity. We will study the diverse mix of cultures in\nthis vast multi-ethnic empire that spanned from the Near East and Africa to Europe. As we\nchart the rise of this ancient superpower, we will examine Roman imperialism, colonialism,\nand the dynamics of cultural identity. Through art, literature, and archeology we will\nexplore politics, religions, slavery and social structures, gender and sexuality, sports and\nentertainment, economics and trade, as well as the rhythms of daily life.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 1042","subject":"CNRC","id":"1042","title":"Grk/Roman Mythology","info":"Introduction to stories/study of Greek/Roman mythology.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 1042H","subject":"CNRC","id":"1042H","title":"H: Greek and Roman Mythology","info":"Introduction to stories/study of Greek/Roman mythology.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 1082","subject":"CNRC","id":"1082","title":"Jesus in History","info":"Does time, place, and culture affect our picture of Jesus? We'll start by constructing our own Jesus story and then go backwards in time to examine modern times (film, music, and modern art), pre-Civil War America (views of Jesus from enslaved people and their enslavers), Renaissance and Medieval Europe and North Africa (art and architecture), and finally end with the ancient world (art and writings about Jesus, including the biblical gospels). No background in religious studies required, and students of any, all, or no religious background are welcome.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 1201","subject":"CNRC","id":"1201","title":"Contxt & Interp, Hebrew Bible","info":"The Hebrew Bible and Old Testament are literary collections that modern Jewish and Christian traditions maintain as important, but these collections were initially produced by ancient Israelite scribes who composed and/or compiled the biblical texts at particular time periods in the ancient Near East. This course will introduce the academic study of biblical texts, which demands critical analysis of the literature and an openness to reading the literature from the perspective of ancient Israelite writers (who lived in a world far different from today). The course will spend considerable time on the literary (and scribal) composition of biblical prose texts; time will also be spent on the historical circumstances of biblical prophets and other writers of the biblical texts. This course will only address the ancient setting of the biblical texts and not re-interpretations in Jewish or Christian traditions. Given the scope of the course, modern interpretations of the biblical literature will not be discussed; we will only focus on this literature in its ancient setting.","prereqInfo":"prereq: Knowledge of Hebrew not required","prereq":{"course":[]}},{"code":"CNRC 1203","subject":"CNRC","id":"1203","title":"Bible: New Testament","info":"Religious or not, Christian or not, hundreds of millions of people around the world utilize the New Testament for everything from personal belief (“Jesus is my personal Lord and Savior”) to mass entertainment (documentaries, art house films, and blockbusters); from religious gatherings (most forms of Christianity) to “secular” spiritual teachings (“Turn the other cheek”); from fine art (Salvador Dali’s “Christ of Saint John of the Cross”) to matters of law (Good Samaritan laws); and from politics (Christian nationalism) to literature (the quotes Harry Potter finds on the gravestones in Godric’s Hollow). The New Testament deeply influences modern cultural contexts all around the world, but especially in the Western world. This course will explore the New Testament from a different context, that of its first century birthplace. We will build students’ understanding of the writings of the New Testament in the Roman Empire of the first century by gaining basic cultural knowledge of first century Greece, Rome, and Israel/Palestine and then reading the Gospels, the letters of Paul, and the Book of Revelation from the perspective of these intersecting worlds. The New Testament is grounded in this context, and deeper exploration of New Testament writings from a first-century perspective will help students enrich their understanding of modern references like the ones mentioned above.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 1205","subject":"CNRC","id":"1205","title":"The Bible and Film","info":"The Bible has been a star of Hollywood and the silver screen since the birth of cinema. This\ncourse tells that story. The Bible has deep roots in American society—in communities of faith, in\npolitics, in art and literature, and in popular culture. It is no surprise, then, that filmmakers have\nfrequently drawn on the Bible as source text and as inspiration. This course explores the ways in\nwhich the Bible has been interpreted and reimagined in film over the past century. We will\nexamine the relationships between the biblical texts and the films they inspired, considering\nquestions such as: How do the filmmakers rework their sources to make them relevant to\ncontemporary audiences? How beholden are the filmmakers to the interpretations of\ncommunities that view biblical texts as authoritative, and where are they free to depart from their\nsources? Is it possible to “translate” biblical narratives into film without losing something in the\ntranslation?","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 1911","subject":"CNRC","id":"1911","title":"Divine & Human in Hebrew Bible","info":"Discover a new world of meaning! Have your assumptions challenged! Where do the ideas of freedom and of universal human rights come from? The course attempts to ‚Äúget behind‚Äù the overlay imposed by modern culture upon the Old Testament/Hebrew Bible and to read it on its own terms. In order to do so, students will explore the fascinating literature and religion of the ancient Near East.  We will read texts from ancient Mesopotamia, Canaan (Ugarit), and Israel, and discuss both the ideas found in them and their literary artistry.  After investigating the literature of Israel‚Äôs neighbors, we will read biblical literature in dialogue with these stories, intellectually analyzing the narratives of the creation of the world, the origin of life, the great flood story, the idea of divine revelation, and the significance of law.  Specific topics to be dealt with include: God, creation, fate, the point of human life, and the meaning of history.  ","prereqInfo":"The assumptions of the course are academic and secular, as required by the First Amendment.  All texts and all religious traditions will be examined analytically.  Students are expected to understand and master this approach, which includes questioning conventional cultural assumptions about the composition and authorship of the Bible.  Willingness to ask such questions and openness to new ways of thinking and reading are essential to successful participation in the course.","prereq":{"course":[]}},{"code":"CNRC 1913","subject":"CNRC","id":"1913","title":"Homer's Odyssey & Mod Politics","info":"Homer's Odyssey is the story of a man who returns from war to find a world much different from the one he left ten years earlier - and one that seems to have no place for him. On his way home, he lies to some, robs and murders others, and, arguably through his own negligence, loses all his men. Once back on his native island of Ithaca, he re-establishes his authority as local strong-man through a mass killing of rivals. He is nonetheless emphatically a \\\"hero\\\" and the moral and political center of the story: what Odysseus does is (in the storyteller's eyes, and those of most readers ever since) right and just. This seminar will use a close reading of the Odyssey, a study of Season One of the Netflix series House of Cards and of selections from Robert Caro's biography of Lyndon Johnson, and extensive discussion of contemporary political and social events, to ask what sort of political and social world Homer's poem imagines; how it formulates and discusses power and justice; how it encourages its audience to accept judgments about human behavior and \\\"what is right\\\" that may, upon reflection, seem horrifying; and what we are to make of this today.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3016W","subject":"CNRC","id":"3016W","title":"Biblical Law & Jewish Ethics","info":"This course introduces students to the original meaning and significance of religious law and ethics within Judaism. Law is the single most important part of Jewish history and identity. At the same time, law is also the least understood part of Judaism and has often been the source of criticism and hatred. We shall therefore confront one of the most important parts of Jewish civilization and seek to understand it on its own terms. In demonstrating how law becomes a fundamental religious and ethical ideal, the course will focus on the biblical and Rabbinic periods but spans the entire history of Judaism. Consistent with the First Amendment, the approach taken is secular. There are no prerequisites: the course is open to all qualified students.","prereqInfo":"The course begins with ideas of law in ancient Babylon and then studies the ongoing history of those ideas. The biblical idea that a covenant binds Israel to God, along with its implications for human worth - including the view of woman as person - will be examined. Comparative cultural issues include the reinterpretations of covenant within Christianity and Islam. The course investigates the rabbinic concept of oral law, the use of law to maintain the civil and religious stability of the Jewish people, and the kabbalistic transformation of law. The course concludes with contemporary Jewish thinkers who return to the Bible while seeking to establish a modern system of universal ethics.","prereq":{"course":[]}},{"code":"CNRC 3042","subject":"CNRC","id":"3042","title":"Myth & Lit of Anc. Near East","info":"Literature begins in Sumer and Egypt, the lands where writing was first invented and where it was first used to record poems and stories. The cuneiform script was initially developed to write Sumerian, then adapted to write Akkadian, the principal Semitic language of ancient Mesopotamia, and later to write other languages, including Hurrian and Hittite. In this course we shall read legends, myths, dialogues, satires, and other literary works from the “cuneiform world” in translation. We shall analyze these ancient works of literature on their own terms, within their cultural and historical contexts, and in light of other literary traditions.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3054","subject":"CNRC","id":"3054","title":"Ancient Egypt and Neighbors","info":"Ancient Egypt exerts fascination upon modern societies, as it did upon its ancient\ncontemporaries. The decipherment of the hieroglyphic script, in the early 19th century CE,\nopened the way to recovering its history all the way back to the invention of the writing system\nmore than 5,000 years ago. Ancient Egypt has meanwhile been a special focus of racialized\ninterpretations of civilization, from the birth of modern Egyptology onward. Europeans of the\ncolonial age saw Egyptian civilization as an anomaly in Africa, measured excavated skulls to\nprove its extraneous origins, and segregated it from its geographic context.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3061","subject":"CNRC","id":"3061","title":"Spectacles in Antiquity","info":"Development of large-scale public entertainments in ancient Mediterranean world, from athletic contests of Olympia and dramatic festivals of Athens to chariot races and gladiatorial games of Roman Empire. Wider significance of these spectacles in their impact on political, social, and economic life of the societies that supported them.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3071","subject":"CNRC","id":"3071","title":"Greek & Hellenistic Religions","info":"Greek religion from the Bronze Age to Hellenistic times. Sources include literature, art, and archaeology. Homer and Olympian deities, ritual performance, prayer/sacrifice, temple architecture, death and the afterlife, mystery cults, philosophical religion. Near Eastern salvation religions.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3072","subject":"CNRC","id":"3072","title":"The Birth of Christianity","info":"Early Jesus movement in cultural/historical setting. Origins in Judaism. Traditions about Jesus. Apostle Paul, controversies/interpreters. Authority, religious practice, structure. Emergence of canon. Contemporary methods of New Testament study. Biblical writings as history/narrative. CNES 3072/CNES 5072/RELS 3072/RELS 5072 meet together.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3074","subject":"CNRC","id":"3074","title":"Exploring the Quran","info":"This course explores the contents of the Quran and probes its place in the history of human civilization. Students will learn about, and critically reflect on, the following subjects: 1) the Quran's core ideas, stories, laws, parables, and arguments, 2) the historical context in which the Quran was first promulgated and codified, 3) the relationship between the Quran and the preceding literary traditions of the ancient world, in particular, the Bible and post-biblical Jewish and Christian writings, 4) Muslim utilization of the Quran towards intellectual, social, religious, cultural, and political ends, and 5) the pre-modern and modern scholarly traditions of interpreting the Quran.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3076","subject":"CNRC","id":"3076","title":"The Apostle Paul","info":"How/what can we know about Paul. What his message was. What he was fighting. How he was later understood by friends/foes.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3081W","subject":"CNRC","id":"3081W","title":"Classical Epic","info":"Homer's Iliad and Odyssey, Virgil's Aeneid. Cultural context of epic. Development of the hero. Epic style. Poetics of epic.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3082W","subject":"CNRC","id":"3082W","title":"Greek Tragedy","info":"Origins of tragedy. Ancient theatres. Selected plays of Aeschylus, Sophocles, Euripides.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3092","subject":"CNRC","id":"3092","title":"Jesus in History","info":"Does time, place, and culture affect our picture of Jesus? We'll start by constructing our own Jesus story and then go backwards in time to examine modern times (film, music, and modern art), pre-Civil War America (views of Jesus from enslaved people and their enslavers), Renaissance and Medieval Europe and North Africa (art and architecture), and finally end with the ancient world (art and writings about Jesus, including the biblical gospels). No background in religious studies required, and students of any, all, or no religious background are welcome.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3103","subject":"CNRC","id":"3103","title":"Ancient Greece: Alexander","info":"Achievements of Alexander the Great, their effect on Greek-speaking world. Greek colonization of Egypt. Hellenistic art, literature, philosophy.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3105","subject":"CNRC","id":"3105","title":"Ancient Rome: Augustus","info":"This course explores ancient Rome’s transformation from a democratic republic to an\nautocratic empire and the considerable implications this crucial shift has had for world\nhistory. It examines the fall of the Roman republic and the rise of Rome’s first emperor\nAugustus along with the vast cultural transformations in this age of revolution. Major\nissues include: Augustan art, architecture, and literature; political ideologies, propaganda,\nand resistance; gender, sexuality, and the family; Rome and Egypt, colonialism and cultural\nidentity.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3106","subject":"CNRC","id":"3106","title":"Ancient Rome: Age of Nero","info":"The Roman Empire. \\\"Silver Age\\\" of Latin literature, rise of Christianity. Art/architecture.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3115","subject":"CNRC","id":"3115","title":"Midrash: Reading and Retelling","info":"How did the Jews of the first seven centuries of the common era read and understand the Hebrew Bible? What were the problems they faced -- interpretive, historical, theological -- in trying to apply their holy scriptures? This course explores key issues that led to the development of a new form of Judaism in late antiquity, rabbinic Judaism, and its methods of scriptural interpretation. The course?s study will focus on the forms and practices of rabbinic scriptural interpretation (midrash) as it developed in Roman Palestine and Sasanian Babylonia, focusing on key narrative and legal passages in the Five Books of Moses (Torah). A main focus of the course will be on the ways the rabbis adapted the Hebrew Bible to express their own core concerns.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3121","subject":"CNRC","id":"3121","title":"Gender in Early Christianity","info":"Ancient Christians, like any other social group in the ancient world, represented themselves through images, stories, and discourses using the cultural tools available to them in their own contexts. In this course, we will explore two key texts of early Christianity (1 Corinthians and the Gospel of Mark) with special attention to how representations of the body and gender served to communicate the nature of what it meant to be Christian for these authors.  The study of ancient material offers a space to acquire the skills of critical analysis of body and gender dynamics so that we can better understand the roles that the body and gender play in shaping our self-identity, social interaction, and societal structures.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3152","subject":"CNRC","id":"3152","title":"Anc Greek Art & Archaeology","info":"This course will provide an introduction to the history of Greek art, architecture and archaeology from the formation of the Greek city states in the ninth century BCE, through the expansion of Greek culture across the Mediterranean and Asia in the Hellenistic period, to the coming of Rome in the first century BCE. While this survey concentrates on the main developments of Greek art, an important sub-theme of this course this is the changes Classical visual culture underwent as it served non-Greek peoples, including the role it played for Alexander and his successors in forging multiethnic, globally minded empires in Western, Central and South Asia. No background in the time period or discipline is expected and therefore this class will also serve as an introduction to interdisciplinary study of art history and the classical world. A number of art historical methodologies will be introduced in order to not only give students a useful background in art history but to give them the tools to think as art historians and incorporate related visual and textual evidence meaningfully into their writing. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3162","subject":"CNRC","id":"3162","title":"Roman Art and Archaeology","info":"Introduction to art and material culture of Roman world: origin, change, continuity. Progress/decay in later empire, its legacy to modern world.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3182","subject":"CNRC","id":"3182","title":"Art & Arch Egypt, Western Asia","info":"This course will provide students with foundational knowledge in the art, architecture, and archaeology of Egypt, East Africa, Asia Minor, Mesopotamia, Iran and Central Asia from the Neolithic through Late Antiquity (ca. 7,000 B.C.E. - 650 C.E.). Students will gain an understanding of the relationship between the visual material and the social, intellectual, political, and religious contexts in which it developed and functioned. In this regard, students will also gain an understanding of the evolution of, and exchanges and differences among, the visual cultures of these time periods and regions. It will also expose them to the preconditions for contemporary geopolitics in the region.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3201","subject":"CNRC","id":"3201","title":"Contxt & Interp, Hebrew Bible","info":"The Hebrew Bible and Old Testament are literary collections that modern Jewish and Christian traditions maintain as important, but these collections were initially produced by ancient Israelite scribes who composed and/or compiled the biblical texts at particular time periods in the ancient Near East. This course will introduce the academic study of biblical texts, which demands critical analysis of the literature and an openness to reading the literature from the perspective of ancient Israelite writers (who lived in a world far different from today). The course will spend considerable time on the literary (and scribal) composition of biblical prose texts; time will also be spent on the historical circumstances of biblical prophets and other writers of the biblical texts. This course will only address the ancient setting of the biblical texts and not re-interpretations in Jewish or Christian traditions. Given the scope of the course, modern interpretations of the biblical literature will not be discussed; we will only focus on this literature in its ancient setting.","prereqInfo":"prereq: Knowledge of Hebrew not required","prereq":{"course":[]}},{"code":"CNRC 3202","subject":"CNRC","id":"3202","title":"Bible: Prophecy in Anc Israel","info":"Survey of Israelite prophets. Emphasizes Amos, Hosea, Isaiah, Jeremiah, Ezekiel, Second Isaiah. Prophetic contributions to Israelite religion. Personality of prophets. Politics, prophetic reaction. Textual analysis, biblical scholarship. Prophecy viewed cross-culturally.","prereqInfo":"prereq: [RelS 1001] or [CNES 1201 or JWST 1201 or RELS 1201 or CNES 3201 or JWST 3201 or RELS 3201]","prereq":{"course":[{"code":"RELS 1001","subject":"RELS","id":"1001"},{"code":"CNES 1201","subject":"CNES","id":"1201"},{"code":"JWST 1201","subject":"JWST","id":"1201"},{"code":"RELS 1201","subject":"RELS","id":"1201"},{"code":"CNES 3201","subject":"CNES","id":"3201"},{"code":"JWST 3201","subject":"JWST","id":"3201"},{"code":"RELS 3201","subject":"RELS","id":"3201"}]}},{"code":"CNRC 3205","subject":"CNRC","id":"3205","title":"Women, Gender, & Hebrew Bible","info":"How men, woman, gender, sexuality is portrayed in Hebrew Bible. Social/religious roles/status of women in ancient Israel. Reading biblical texts from academic point of view. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3206","subject":"CNRC","id":"3206","title":"Purity and Pollution","info":"\\\"Dirt is dangerous\\\" wrote Mary Douglas more than 50 years ago in her groundbreaking study, Purity and Danger: An Analysis of Concept of Pollution and Taboo. Her work has been influential in ancient Near Eastern and Mediterranean studies when dealing with issues of sacred/profane, purity/pollution, and ritual sacrifice and purification. Douglas' work provides a framework within which to understand ancients' thinking about these concepts that range from the sacredness of space and of bodies to perceived pollutions caused by bodily leakage or liminal stages of life and death. In this course, we will examine Douglas' theory in light of ancient evidence, with special attention to ancient Israelite literature (the Tanakh or Old Testament) and ancient Jewish literature (the Dead Sea Scrolls), but we will also analyze other ancient Near Eastern and Mediterranean examples of purity and pollution (from epigraphical and documentary evidence).","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3213","subject":"CNRC","id":"3213","title":"Bible: New Testament","info":"Religious or not, Christian or not, hundreds of millions of people around the world utilize the New Testament for everything from personal belief (“Jesus is my personal Lord and Savior”) to mass entertainment (documentaries, art house films, and blockbusters); from religious gatherings (most forms of Christianity) to “secular” spiritual teachings (“Turn the other cheek”); from fine art (Salvador Dali’s “Christ of Saint John of the Cross”) to matters of law (Good Samaritan laws); and from politics (Christian nationalism) to literature (the quotes Harry Potter finds on the gravestones in Godric’s Hollow). The New Testament deeply influences modern cultural contexts all around the world, but especially in the Western world. This course will explore the New Testament from a different context, that of its first century birthplace. We will build students’ understanding of the writings of the New Testament in the Roman Empire of the first century by gaining basic cultural knowledge of first century Greece, Rome, and Israel/Palestine and then reading the Gospels, the letters of Paul, and the Book of Revelation from the perspective of these intersecting worlds. The New Testament is grounded in this context, and deeper exploration of New Testament writings from a first-century perspective will help students enrich their understanding of modern references like the ones mentioned above.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3502W","subject":"CNRC","id":"3502W","title":"Anc Israel: Conquest to Exile","info":"Israel and Judah were not states of great importance in the ancient Near East.  Their population and territory were small, and they could not resist conquest by larger, more powerful states like Assyria and Rome.  Yet their ancient history matters greatly today, out of proportion to its insignificance during the periods in which it transpired.  The historical experiences of the people of Israel and Judah were accorded religious meaning and literary articulation in the Hebrew Bible (the Old Testament), which became a foundational text for Judaism, Christianity, and Islam.  ","prereqInfo":"Essential features of Western as well as Islamic civilization are predicated on some element of Israel’s ancient past, as mediated through the Bible; therefore it behooves us to understand that past.  But the Bible is a religious work, not a transcript of events, and the history of ancient Israel is not derived merely from reading the biblical accounts of it.  Archaeological excavations have revealed the physical remains of the cultures of Israel and neighboring lands, as well as bringing to light inscriptions, documents, and literary works produced by those cultures.  These sources, which complement and sometimes contradict the accounts conveyed in the Bible, provide the basis for reconstructing a comprehensive history of ancient Israel.","prereq":{"course":[]}},{"code":"CNRC 3504","subject":"CNRC","id":"3504","title":"Jewish Resistance in Antiquity","info":"The rise of Hellenistic kingdoms in the ancient Mediterranean and Near East created a variety of responses from local, subjugated peoples, and some of the most documented cases are those of Jewish populations in Koele-Syria/Palestine. The main objective of this course is to analyze Jewish responses to imperial rule and military conflict during the Hellenistic and early Roman periods (c. 300 B.C.E. ? 150 C.E.), but we will also spend time examining the broader picture of how local, ancestral groups fared under foreign rule. Along with discussing pertinent archaeological evidence, we will discuss Jewish literature and documentary material from this period, including, the sectarian documents of the Dead Sea Scrolls, the Book of Judith (a Jewish \\\"novel\\\"), the Books of Daniel and the Maccabees (all of which provide historical information about the Maccabean revolt and rise of the Hasmoneans), and the writings of Josephus (a Jewish writer who witnessed the Roman takeover of Palestine in the first century C.E.). This course will stay within the confines of the ancient evidence and not examine later interpretations when analyzing each historical period; it will begin with Ptolemaic control of the region and conclude with the Bar Kokhba revolt, its aftermath, and the resilience of Jewish populations in northern Palestine. Topics that will be examined in depth are messianism and apocalypticism, the Jerusalem Temple, Jewish ancestral traditions (which include biblical literature), and theoretical models used by scholars to analyze power relationships in antiquity.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3506","subject":"CNRC","id":"3506","title":"The Israeli Mossad","info":"This course will look at Mossad’s activities and their perceptions in Israeli culture through lenses of collective memory and national identity. Students will examine primary and secondary sources to understand the historic background and the various narratives, shaping the Israeli culture. Students will conduct discussions pertaining to the place of Mossad in Israeli culture expressing opinions about the ethical component of Mossad’s activities.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3515","subject":"CNRC","id":"3515","title":"Multiculturalism in Israel","info":"This course focuses on the way various cultural groups in Israel attempt to achieve cultural recognition. Students will learn how various ethnic and religious groups shape their identities through process of acculturation and struggle. Students will learn about several Israeli cultures by reading literature, book chapters and case-studies, and watching movies, all of which center on these debates.","prereqInfo":"Students will examine various case studies centered on these multicultural issues in Israel and will discuss and reflect on the implications of the issues raised by the course material for the international community, the United States, and for their own lives.","prereq":{"course":[]}},{"code":"CNRC 3518","subject":"CNRC","id":"3518","title":"Jewish Humor","info":"In the U.S. the comic world has been so dominated by Jewish writers and performers that the \\\"People of the Book\\\" have come to be known as the \\\"People of the Joke.\\\" A 2013 Pew Research poll showed that for American Jews, a sense of humor is essential to their Jewish identity—more important than ritual or the observance of traditional religious commandments. While surveying a broad range of humor in print, on stage, and in films along with classical Jewish texts including the Torah and Talmud, students will learn about the historical and cultural contexts that make such humor not only possible, but existentially necessary—a serious business indeed. And we'll accomplish all this while laughing hysterically. \nNo prior knowledge of Jewish history and culture is required or assumed.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3535","subject":"CNRC","id":"3535","title":"Death and Afterlife","info":"Beliefs, attitudes, and behaviors related to death and the afterlife found in the cultures of the ancient Mediterranean and Near East. Literature, funerary art/epitaphs. Archaeological evidence for burial practices and care of dead.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3601W","subject":"CNRC","id":"3601W","title":"Sex/Gender in Greece and Rome","info":"Evidence for Ancient Greek and Roman ideas about sexuality and gender roles. The methodologies by which it is analyzed. Norms of writing about ancient culture, gender, and sexuality. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3617","subject":"CNRC","id":"3617","title":"Pagans, Christians, Barbarians","info":"Between classical and medieval, pagan and Christian, Roman and barbarian, the late antique world was a dynamic age. This course will focus on the Mediterranean region from the 2nd to the mid-7th century exploring such topics as the conversion of Constantine, the fall of Rome, barbarian invasions, the spread of Christianity, and the rise of Islam.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3787","subject":"CNRC","id":"3787","title":"Visual Cultures in Contact","info":"What happens when two cultures meet? How do different cultures shape and influence each other? In this course we'll examine how the diverse cultures of the Ancient Eurasian world  became entangled with one another through the material remains they left behind. We'll use a variety of tools and techniques to analyze and interpret material objects, spaces and art— from the Egyptians and Sassanians, to the Romans and Qin and Han dynasties. Uncover a more nuanced and inclusive understanding of how these ancient cultures changed their ideologies, iconographies, and modes of representation through trade networks, political alliances, and colonial enterprise.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3896","subject":"CNRC","id":"3896","title":"Internship for Academic Credit","info":"An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments in conjunction with museum or gallery internships; archaeological field experience; language teaching practicum, etc. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3950","subject":"CNRC","id":"3950","title":"Topics: Ancient Culture","info":"Selected topics in the cultural history of antiquity (e.g., women in antiquity, Roman diplomacy, slavery, education). Topics specified in Class Schedule.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 3951W","subject":"CNRC","id":"3951W","title":"Capstone","info":"Research project pertaining to ancient world, using documents or primary sources along with secondary sources. Students select project in consultation with faculty member.","prereqInfo":"prereq: course is open to second semester juniors and seniors, major in CNES or RelS], instr consentonsent","prereq":{"course":[]}},{"code":"CNRC 3993","subject":"CNRC","id":"3993","title":"Directed Studies","info":"Guided individual reading or study.","prereqInfo":"prereq: instr consent","prereq":{"course":[]}},{"code":"CNRC 3994","subject":"CNRC","id":"3994","title":"Directed Research: Capstone","info":"Research project pertaining to ancient world, using documents or primary sources along with secondary sources. Students select project in consultation with faculty member.","prereqInfo":"Prereq: Course is open to second semester juniors and seniors, major in CNRC, or RelS ","prereq":{"course":[]}},{"code":"CNRC 5016W","subject":"CNRC","id":"5016W","title":"Biblical Law & Jewish Ethics","info":"This course introduces students to the original meaning and significance of religious law and ethics within Judaism. Law is the single most important part of Jewish history and identity. At the same time, law is also the least understood part of Judaism and has often been the source of criticism and hatred. We shall therefore confront one of the most important parts of Jewish civilization and seek to understand it on its own terms. In demonstrating how law becomes a fundamental religious and ethical ideal, the course will focus on the biblical and Rabbinic periods but spans the entire history of Judaism. Consistent with the First Amendment, the approach taken is secular. There are no prerequisites: the course is open to all qualified students.","prereqInfo":"The course begins with ideas of law in ancient Babylon and then studies the ongoing history of those ideas. The biblical idea that a covenant binds Israel to God, along with its implications for human worth - including the view of woman as person - will be examined. Comparative cultural issues include the reinterpretations of covenant within Christianity and Islam. The course investigates the rabbinic concept of oral law, the use of law to maintain the civil and religious stability of the Jewish people, and the kabbalistic transformation of law. The course concludes with contemporary Jewish thinkers who return to the Bible while seeking to establish a modern system of universal ethics.","prereq":{"course":[]}},{"code":"CNRC 5051","subject":"CNRC","id":"5051","title":"Mesopotamian Historiography","info":"Seminar. Historical method/sources for Ancient Near Eastern history. Historical tradition and historiographic texts of Mesopotamia and neighboring regions of Ancient Near East/their relationship to the works of classical historians such as Herodotus. Use of these sources in modern historiography of Ancient Near East.","prereqInfo":"prereq: Previous coursework in Ancient Near Eastern history recommended","prereq":{"course":[]}},{"code":"CNRC 5071","subject":"CNRC","id":"5071","title":"Greek & Hellenistic Religions","info":"Greek religion from Bronze Age to Hellenistic times. Literature, art, archaeology. Homer/Olympian deities. Ritual performance, prayer, sacrifice. Temple architecture. Death/afterlife. Mystery cults. Philosophical religion. Near Eastern salvation religions. Meets with 3071.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 5072","subject":"CNRC","id":"5072","title":"The Birth of Christianity","info":"Early Jesus movement in cultural/historical setting. Origins in Judaism. Traditions about Jesus. Apostle Paul, controversies/interpreters. Authority, religious practice, structure. Emergence of canon. Contemporary methods of New Testament study. Biblical writings as history/narrative. CNES 3072/CNES 5072/RELS 3072/RELS 5072 meet together.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 5115","subject":"CNRC","id":"5115","title":"Midrash: Jewish Biblical Inter","info":"How did the Jews of the first seven centuries of the common era read and understand the Hebrew Bible? What were the problems they faced -- interpretive, historical, theological -- in trying to apply their holy scriptures? This course explores key issues that led to the development of a new form of Judaism in late antiquity, rabbinic Judaism, and its methods of scriptural interpretation. The course's study will focus on the forms and practices of rabbinic scriptural interpretation (midrash) as it developed in Roman Palestine and Sasanian Babylonia, focusing on key narrative and legal passages in the Five Books of Moses (Torah). A main focus of the course will be on the ways the rabbis adapted the Hebrew Bible to express their own core concerns.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 5121","subject":"CNRC","id":"5121","title":"Gender in Early Christianity","info":"Ancient Christians, like any other social group in the ancient world, represented themselves through images, stories, and discourses using the cultural tools available to them in their own contexts. In this course, we will explore two key texts of early Christianity (1 Corinthians and the Gospel of Mark) with special attention to how representations of the body and gender served to communicate the nature of what it meant to be Christian for these authors.  The study of ancient material offers a space to acquire the skills of critical analysis of body and gender dynamics so that we can better understand the roles that the body and gender play in shaping our self-identity, social interaction, and societal structures.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 5204","subject":"CNRC","id":"5204","title":"The Dead Sea Scrolls","info":"Introduction to Dead Sea Scrolls and Qumran. Contents of Dead Sea Scrolls, significance for development of Bible. Background of Judaism and Christianity. Archaeological site of Qumran. ","prereqInfo":"Open to graduate students across the college; knowledge of classical Hebrew will not be required. The course is open to upper level undergraduate students with permission of the instructor.","prereq":{"course":[]}},{"code":"CNRC 5502W","subject":"CNRC","id":"5502W","title":"Anc Israel: Conquest to Exile","info":"Israel and Judah were not states of great importance in the ancient Near East.  Their population and territory were small, and they could not resist conquest by larger, more powerful states like Assyria and Rome.  Yet their ancient history matters greatly today, out of proportion to its insignificance during the periods in which it transpired.  The historical experiences of the people of Israel and Judah were accorded religious meaning and literary articulation in the Hebrew Bible (the Old Testament), which became a foundational text for Judaism, Christianity, and Islam.  ","prereqInfo":"Essential features of Western as well as Islamic civilization are predicated on some element of Israel’s ancient past, as mediated through the Bible; therefore it behooves us to understand that past.  But the Bible is a religious work, not a transcript of events, and the history of ancient Israel is not derived merely from reading the biblical accounts of it.  Archaeological excavations have revealed the physical remains of the cultures of Israel and neighboring lands, as well as bringing to light inscriptions, documents, and literary works produced by those cultures.  These sources, which complement and sometimes contradict the accounts conveyed in the Bible, provide the basis for reconstructing a comprehensive history of ancient Israel.","prereq":{"course":[]}},{"code":"CNRC 5713","subject":"CNRC","id":"5713","title":"Intro: Ugaritic","info":"Ugaritic alphabetic cuneiform script, morphology, and syntax. Reading of representative samples of Ugaritic literature. Attention to linguistic and cultural issues and links to biblical and other Ancient Near Eastern texts.","prereqInfo":"prereq: Adv Hebrew, previous study of biblical texts or instr consent","prereq":{"course":[]}},{"code":"CNRC 5787","subject":"CNRC","id":"5787","title":"Visual Cultures in Contact","info":"What happens when two cultures meet? How do different cultures shape and influence each other? In this course we'll examine how the diverse cultures of the Ancient Eurasian world  became entangled with one another through the material remains they left behind. We'll use a variety of tools and techniques to analyze and interpret material objects, spaces and art— from the Egyptians and Sassanians, to the Romans and Qin and Han dynasties. Uncover a more nuanced and inclusive understanding of how these ancient cultures changed their ideologies, iconographies, and modes of representation through trade networks, political alliances, and colonial enterprise.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 5794","subject":"CNRC","id":"5794","title":"Intro to CNES","info":"Introduction to core research materials and reference materials in the various disciplines which make up classical studies.","prereqInfo":"prereq: grad major or minor or instr consent","prereq":{"course":[]}},{"code":"CNRC 5993","subject":"CNRC","id":"5993","title":"Directed Studies","info":"Guided individual reading or study.\nPrereq-instr consent, dept consent, college consent.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 5994","subject":"CNRC","id":"5994","title":"Directed Research","info":"Guided individual research.\nPrereq-instr consent, dept consent, college consent.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 5996","subject":"CNRC","id":"5996","title":"Dir Instruction","info":"Guided individual research.\nPrereq-instr consent, dept consent, college consent.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 8190","subject":"CNRC","id":"8190","title":"Anc. Art and Arch.","info":"Selected issues, with special attention to current scholarly disputes.  Topics specified in [Class Schedule].","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 8333","subject":"CNRC","id":"8333","title":"FTE: Master's","info":"(No description)","prereqInfo":"prereq: Master's student, adviser and DGS consent","prereq":{"course":[]}},{"code":"CNRC 8444","subject":"CNRC","id":"8444","title":"FTE: Doctoral","info":"(No description)","prereqInfo":"prereq: Doctoral student, adviser and DGS consent","prereq":{"course":[]}},{"code":"CNRC 8513","subject":"CNRC","id":"8513","title":"Scripture and Interpretation","info":"Ideas of divine revelation. Impact upon religion/literature. How history of Bible's creation, transmission, interpretation helps us think critically about role of revelation in history of religious traditions.","prereqInfo":"prereq: Grad student","prereq":{"course":[]}},{"code":"CNRC 8530","subject":"CNRC","id":"8530","title":"Ancient Mediterranean Religion","info":"Intensive study of particular aspects of religious practice in the ancient Mediterranean world, often from a comparative perspective. Focus on scrutiny of primary sources and discussion of contemporary trends in scholarship. Topics specified in the Class Schedule.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 8550","subject":"CNRC","id":"8550","title":"Gender & Body Ancient Religion","info":"This topics course will offer a theoretically sophisticated and in-depth examination of conceptualizations of gender and the body in ancient culture, specifically instantiated in religious writings, activity, and thought. Students will gain a thorough working knowledge of current theoretical discussions of gender and the body, while at the same time exploring the role gender played in narratives, religious practice, and philosophical writings of the ancient world. Opportunities will be available to study various time frames (beginning of the first millennium BCE to 500 CE), specific local cultures (determined by geographical regions), and ethnic/religious groups (Israelites, Jews, Romans, Greeks, Christians, Egyptians, etc.). Students will be heavily involved in the weekly presentation of topics and discussion, and PhD students will be expected to produce research that will be headed toward use in their dissertations or a suitable for future publication. Topics specified in class schedule.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 8570","subject":"CNRC","id":"8570","title":"Readings in Religious Texts","info":"Close reading of selected literary or epigraphical texts of importance for the history of ancient Mediterranean religions, along with critical discussion of trends in recent scholarship. The texts may be read in the original languages (such as Greek, Latin, Hebrew, etc.) but may also be accessed in translation where appropriate.","prereqInfo":null,"prereq":{"course":[]}},{"code":"CNRC 8666","subject":"CNRC","id":"8666","title":"Doct Pre-Thesis Cr*","info":"To be determined","prereqInfo":"prereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr","prereq":{"course":[]}},{"code":"CNRC 8777","subject":"CNRC","id":"8777","title":"Thesis Credit:Mast*","info":"(No description)","prereqInfo":"prereq: Max 18 cr per semester or summer; 10 cr total required (Plan A only)","prereq":{"course":[]}},{"code":"CNRC 8794","subject":"CNRC","id":"8794","title":"Practicum for Future Faculty","info":"Workshop in professional development. Developing the dissertation. Preparing a portfolio to document/reflect on teaching the ancient world and its languages. Readings, workshops, peer teaching, reflective writing.","prereqInfo":"prereq: Doctoral [major or minor] in Classical/Near Eastern studies","prereq":{"course":[]}},{"code":"CNRC 8888","subject":"CNRC","id":"8888","title":"Thesis Credit:Doct*","info":"(No description)","prereqInfo":"prereq: Max 18 cr per semester or summer; 24 cr required","prereq":{"course":[]}},{"code":"CNRC 8950","subject":"CNRC","id":"8950","title":"Topics:Clas & NearEast Studies","info":"Topics such as slavery, women in antiquity, pagans and Jews, the taboo, and modern study of myth.","prereqInfo":null,"prereq":{"course":[]}}]