[{"code":"DDS 3111","subject":"DDS","id":"3111","title":"Intro Oral Health & Disparity","info":"Role of oral health in achieving general health, common oral diseases, oral health disparities, and dentistry as a career option.\nPrereq-Students must be part of the SEAM program.","prereq":[]},{"code":"DDS 6111","subject":"DDS","id":"6111","title":"Perio I","info":"Periodontal anatomy, physiology/etiology of periodontal diseases. Clinical, histopathological, and pathogenesis of gingivitis and periodontitis. Role of genetics, tobacco use, and systemic disorders.","prereq":[]},{"code":"DDS 6112","subject":"DDS","id":"6112","title":"Perio II A - Perio Technique","info":"Presurgical procedures in periodontics. Clinical skills to examine, diagnose, prevent, and treat periodontal patients.\nPrereq-In DDS program.","prereq":[]},{"code":"DDS 6113","subject":"DDS","id":"6113","title":"Perio III","info":"Clinical procedures associated with surgical phase of periodontal therapy, including implants. Evaluation of periodontal treatment, maintenance phase, relationship between periodontics and other disciplines in dentistry.  Clinical research. Integrating periodontics into general practice.","prereq":[]},{"code":"DDS 6114","subject":"DDS","id":"6114","title":"Clinical Pharmacology Correlat","info":"Pharmacologic therapeutic areas with potential clinical relevance in dentistry. Application to therapeutic prescribing decisions. Mechanisms of action. Indications, dosing drug interactions, prescribing concerns. Discussion of published literature.","prereq":[]},{"code":"DDS 6121","subject":"DDS","id":"6121","title":"Perio Clinic","info":"Nonsurgical and surgical treatment of periodontal diseases, evaluation of periodontal therapy, implementation of maintenance programs.","prereq":[]},{"code":"DDS 6122","subject":"DDS","id":"6122","title":"Periodontology Clinic DDS3","info":"Nonsurgical and surgical treatment of periodontal diseases, evaluation of periodontal therapy, and implementation of maintenance programs.","prereq":[]},{"code":"DDS 6123","subject":"DDS","id":"6123","title":"Periodontology Clinic DDS3 Sum","info":"Nonsurgical and surgical treatment of periodontal diseases, evaluation of periodontal therapy, and implementation of maintenance programs. \nCOURSE PURPOSE\nThese courses are designed to enable the dental student to gain expertise, knowledge, and confidence in the clinical skills needed to examine, diagnose, and treat the periodontal patient.","prereq":[]},{"code":"DDS 6124","subject":"DDS","id":"6124","title":"Periodontology Clinic D4","info":"This course is designed to enable the dental student to gain expertise, knowledge and confidence in the clinical skills needed to examine, diagnose and treat the periodontal patient.  Students are expected to complete 3-4 competencies and a Patient Case presentation.","prereq":[]},{"code":"DDS 6125","subject":"DDS","id":"6125","title":"Periodontology Clinic D3 Fall","info":"Third year dental student nonsurgical and surgical treatment of periodontal diseases, evaluation of periodontal therapy, and implementation of maintenance programs. \nCOURSE PURPOSE\nThese courses are designed to enable the third year dental student to gain expertise, knowledge, and confidence in the clinical skills needed to examine, diagnose, and treat the periodontal patient.","prereq":[]},{"code":"DDS 6126","subject":"DDS","id":"6126","title":"Perio Clinic D3 Spring","info":"Third-year dental student nonsurgical and surgical treatment of periodontal diseases, evaluation of periodontal therapy, and implementation of maintenance programs. \n\nThese courses are designed to enable the third-year dental student to gain expertise, knowledge, and confidence in the clinical skills needed to examine, diagnose, and treat the periodontal patient.","prereq":[]},{"code":"DDS 6127","subject":"DDS","id":"6127","title":"Periodontology Clinic D4 Sum","info":"This course is designed to enable the dental student to gain expertise, knowledge and confidence in the clinical skills needed to examine, diagnose, and treat the periodontal patient. Students are expected to complete skills assessments and a patient case presentation during the year. ","prereq":[]},{"code":"DDS 6128","subject":"DDS","id":"6128","title":"Periodontology Clinic D4 Fall","info":"This course is designed to enable the fourth year dental student to gain expertise, knowledge and confidence in the clinical skills needed to examine, diagnose, and treat the periodontal patient. Students are expected to complete skills assessments and a patient case presentation during the year. ","prereq":[]},{"code":"DDS 6129","subject":"DDS","id":"6129","title":"Perio Clinic D4 Spring","info":"This course is designed to enable the fourth year dental student to gain expertise, knowledge and confidence in the clinical skills needed to examine, diagnose, and treat the periodontal patient. Students are expected to complete skills assessments and a patient case presentation during the year. ","prereq":[]},{"code":"DDS 6130","subject":"DDS","id":"6130","title":"Intro to Clinical Dentistry","info":"Methods/procedures consistent with preclinical teaching in traditional predoctoral program.\n\nprereq: Enrolled in PASS","prereq":[]},{"code":"DDS 6131","subject":"DDS","id":"6131","title":"Pediatric Dent Pre-Clinic","info":"Physical, emotional, dental, and language development. Diagnosis, prevention, and management of oral diseases in children.","prereq":[]},{"code":"DDS 6141","subject":"DDS","id":"6141","title":"Pediatric Dent Clinic","info":"Preventive/clinical topics/techniques. Diagnosis, treatment planning, and clinical treatment of pediatric patients.\nPrereq-3rd yr DDS student.","prereq":[]},{"code":"DDS 6142","subject":"DDS","id":"6142","title":"Pediatric Dent Clinic","info":"Preventive/clinical topics/techniques. Diagnosis, treatment planning, and clinical treatment of pediatric patients.","prereq":[]},{"code":"DDS 6151","subject":"DDS","id":"6151","title":"Pain/Anxiety Contr","info":"Didactic/clinical aspects of pain/anxiety control as pertains to dentistry. Emphasizes use of local anesthetics, conscious sedation (nitrous oxide inhalation). Acute/chronic pain mechanisms, neuropathic pain, issues pertaining to narcotic/other drug abuse.","prereq":[]},{"code":"DDS 6152","subject":"DDS","id":"6152","title":"Oral & Maxillofacial Surgery I","info":"Introduction to concepts of oral/maxillofacial surgery. Emphasizes fundamental skills of oral surgery that apply to practice of general dentistry.","prereq":[]},{"code":"DDS 6153","subject":"DDS","id":"6153","title":"Oral Surgery II","info":"Fundamental clinical/diagnostic skills that apply to practice of general dentistry. Surgical procedures, complications, facial fractures, congenital abnormalities.\nPrereq-Oral Surgery I.","prereq":[]},{"code":"DDS 6161","subject":"DDS","id":"6161","title":"OMFS Clinic Rotation","info":"Oral Surgery Clinic experience.","prereq":[]},{"code":"DDS 6169","subject":"DDS","id":"6169","title":"Occlusal Management I","info":"This courses offers the first year dental student an interdisciplinary introduction to clinical occlusion.  There will be didactic lectures and an opportunity for a clinical experience of intra-oral scanning demo, hands-on clinical scanning and visualization of digital records and occlusion.  Students are required to be admitted to the DDS program prior to taking this course.  ","prereq":[]},{"code":"DDS 6171","subject":"DDS","id":"6171","title":"Orthodontics I","info":"Supervision, guidance, and correction of growing or mature dentofacial structures. Growth/development of craniofacial structures. Diagnostic methods, biology of tooth movement and biomechanics. Clinical diagnosis, treatment planning.","prereq":[]},{"code":"DDS 6172","subject":"DDS","id":"6172","title":"Orthodontics II","info":"Lectures examine clinical management of specific orthodontic problems; and principles and procedures in preventative, interceptive, and corrective orthodontics examined through case analysis and treatment planning.\nLab covers practical applications of developing occlusion analysis; and  fundamentals of orthodontic appliances.","prereq":[]},{"code":"DDS 6181","subject":"DDS","id":"6181","title":"Ortho Clin Rotn","info":"Diagnosis, treatment timing, and treatment objectives; skills required to perform orthodontic procedures.","prereq":[]},{"code":"DDS 6211","subject":"DDS","id":"6211","title":"Intro to Oral Biology","info":"Biology of the mouth. Broad overview of current information on the following topics: plaque microbiology, bone growth and remodeling, oral diseases, bad breath, and amalgam fillings.\nPrereq-1st yr [DDS or DT student].","prereq":[]},{"code":"DDS 6212","subject":"DDS","id":"6212","title":"Topics in Dental Biochem","info":"Biological, chemical, and biochemical phenomena in oral cavity and their interrelationships. Biological/chemical basis of dental caries. How saliva, dental plaque, and plaque fluid interact with and impact caries process.  Metabolic handling, anticaries mechanisms of fluoride.\n\nprereq: 1st yr [DDS or DT student]","prereq":[]},{"code":"DDS 6213","subject":"DDS","id":"6213","title":"Dent MicB","info":"General microbiology, bacterial pathogenesis, virology. Oral microbial ecology, dental caries, periodontal diseases. Evaluation of current literature through student essays. Discussions on methodology.  \nPrereq-In DDS program.","prereq":[]},{"code":"DDS 6214","subject":"DDS","id":"6214","title":"General Histology","info":"Structure/function of cells, tissues, and organs.\nPrereq-Accepted into DDS program.","prereq":[]},{"code":"DDS 6215","subject":"DDS","id":"6215","title":"Dental Pharmacology","info":"Concepts of drug action/tools for lifelong learning.  Principles of drug action. Drugs that act on various bodily systems.\n\nprereq: Must be in DDS program","prereq":[]},{"code":"DDS 6216","subject":"DDS","id":"6216","title":"Int Case Based Seminars","info":"Seminars for second year dental students to discuss various dental cases and prepare them for entering clinic earlier in the curriculum.","prereq":[]},{"code":"DDS 6231","subject":"DDS","id":"6231","title":"Phys Evaluation I","info":"Concepts of diagnosis and patient evaluation for exam of patients in various adult clinical programs in School of Dentistry.\n\nprereq: 1st yr [DDS or DT student]","prereq":[]},{"code":"DDS 6232","subject":"DDS","id":"6232","title":"Phys Eval II","info":"Lecture and case-based series designed to review physical evaluation of common medical-systemic problems of patient management and care based on principles of medical management, thorough evaluation, and recognition of the medically compromised patient. Includes acute management of medical emergencies in dental practice. ","prereq":[]},{"code":"DDS 6233","subject":"DDS","id":"6233","title":"Oral Maxfac Rad","info":"General principles of radiology, radiation physics, dosimetry, biology, radiation protection, regulations and recent concepts of imaging.\n\n","prereq":[]},{"code":"DDS 6234","subject":"DDS","id":"6234","title":"Radiographic Interp","info":"Dental record keeping. Documentation/analysis of medical/clinical findings. Patient's rights, informed consent. Radiographic interpretation of deviations from normal.\nPrereq-In DDS program.","prereq":[]},{"code":"DDS 6235","subject":"DDS","id":"6235","title":"ORAD PreClin Lab I","info":"Preclinical demonstration-participation phases in radiographic technique, using mounted human skulls.\nPrereq-In DDS program.","prereq":[]},{"code":"DDS 6241","subject":"DDS","id":"6241","title":"OM/D Clinic I","info":"Comprehensive patient evaluation. Medical history/interview, general physical exam/evaluation, head/neck exam, intraoral exam, occlusion-TMJ exam. Periodontal, dental, and radiological exams.\nPrereq-3rd yr DDS student.","prereq":[]},{"code":"DDS 6242","subject":"DDS","id":"6242","title":"OM/D II","info":"Comprehensive patient evaluation. Medical history/interview, general physical exam/evaluation, head/neck exam, intraoral exam, occlusion-TMJ exam. Periodontal, dental, and radiological exams.\nPrereq-DDS student.","prereq":[]},{"code":"DDS 6243","subject":"DDS","id":"6243","title":"Oral Rad Clinic I","info":"Radiographing dental school patients, radiographic interpretations, panoramic/extraoral technique seminars, quality assurance procedures.\nPrereq-3rd yr DDS student.","prereq":[]},{"code":"DDS 6244","subject":"DDS","id":"6244","title":"Oral Rad Clin II","info":"This course consists of radiographing dental school patients, radiographic interpretations, panoramic and extraoral technique seminars and quality assurance procedures.  ","prereq":[]},{"code":"DDS 6245","subject":"DDS","id":"6245","title":"Oral Radiology Clinic D3 Sum","info":"Radiographing dental school patients, radiographic interpretations, panoramic/extraoral technique seminars, quality assurance procedures.\nprereq:3rd yr DDS student.","prereq":[]},{"code":"DDS 6246","subject":"DDS","id":"6246","title":"Oral Radiology Clinic D3 Fall","info":"Radiographing dental school patients, radiographic interpretations, panoramic/extraoral technique seminars, quality assurance procedures.\n\nprereq:3rd yr DDS student.","prereq":[]},{"code":"DDS 6247","subject":"DDS","id":"6247","title":"Oral Radiology Clinic D3 Sprng","info":"Radiographing dental school patients, radiographic interpretations, panoramic/extraoral technique seminars, quality assurance procedures.\n\nprereq: 3rd yr DDS student","prereq":[]},{"code":"DDS 6251","subject":"DDS","id":"6251","title":"OHist/Embry/Med Gen","info":"Embryologic development and histologic structure of tissues in the head, face, and mouth with emphasis on clinical correlations, principles of medical genetics, complex traits of the orofacial region, and genetic contributions to oral diseases.\n","prereq":[]},{"code":"DDS 6252","subject":"DDS","id":"6252","title":"OMF Pathology","info":"Recognizing, diagnosing, and managing diseases with maxillofacial, oral, or dental manifestations. Deductive approaches to identifying associated diseases.","prereq":[]},{"code":"DDS 6253","subject":"DDS","id":"6253","title":"General Pathology","info":"General Pathology provides students with a basic understanding of the foundational aspects of pathology, such as inflammation, tissue injury and repair, and neoplasia. After finishing this course, students will understand in general how disease impacts body tissues and organ systems, and will recognize common abnormal patterns produced by oral and systemic diseases. This course precedes the Systemic Pathology course (DDS 6254) given in the DDS2 fall semester, and provides the foundational knowledge necessary for understanding systems-based pathology. ","prereq":[]},{"code":"DDS 6254","subject":"DDS","id":"6254","title":"Systemic Pathology","info":"Systemic Pathology provides students with a basic understanding of the causes, mechanisms, and effects of human disease in all organ systems. After finishing this course, students will understand how diseases impact patients, and will be able to modify treatment and care accordingly. Students will also be able to recognize common oral manifestations of systemic diseases in order to provide more complete patient care. This course is preceded by the General Pathology course (DDS 6253) given in the DDS2 summer semester.","prereq":[]},{"code":"DDS 6271","subject":"DDS","id":"6271","title":"TMD & Orofacial Pain","info":"Evaluation and differential diagnosis of temporomandibular and orofacial pain disorders. Rehabilitation treatment strategies for the most common TM disorders, including splints, physical therapy, behavioral therapy, and medications.","prereq":[]},{"code":"DDS 6310","subject":"DDS","id":"6310","title":"Intro to Dental Clinics","info":"This course is designed to expose the first year doctor of dental surgery students to clinical activities early in their dental training. It will allow students to become oriented to the clinics, dispensary personnel, clinic supplies and patient communication. Students will be trained in infection control and the care of standard dental equipment and instruments. It will also provide modeling of appropriate professional demeanor, attire and interactions with other dentists, student operators and patients. Each student will be assigned to 10 - 3 hours assisting sessions.","prereq":[]},{"code":"DDS 6312","subject":"DDS","id":"6312","title":"Comprehensive Care Clinic I","info":"Application of clinical knowledge, skills, and the principles of care to the comprehensive assessment, diagnosis, treatment planning, treatment, and management of patients.  ","prereq":[]},{"code":"DDS 6313","subject":"DDS","id":"6313","title":"Comp Care Clinic II","info":"Patient management skills. Diagnosis, treatment planning, delivery of comprehensive care, efficient use of clinic time.\nPrereq-6050.","prereq":{"code":"DDS 6050","subject":"DDS","id":"6050"}},{"code":"DDS 6314","subject":"DDS","id":"6314","title":"Treatment Planning","info":"Management of dental patients. Process/development of comprehensive treatment plans. Treatment planning in private-practice setting.","prereq":[]},{"code":"DDS 6315","subject":"DDS","id":"6315","title":"Hosp Geriatric Spcl Needs Rotn","info":"The purpose of this rotation is to reinforce the information provided in prior coursework in special needs, hospital, and geriatric care (e.g., DDS 6338) and enable dental students to increase their skill and comfort in managing adults with more complex underlying health and/or functional issues and difficulty accessing oral health care via usual strategies.","prereq":[]},{"code":"DDS 6316","subject":"DDS","id":"6316","title":"Comp Care Clinic D3 Summer","info":"Application of clinical knowledge, skills, and the principles of care to the comprehensive assessment, diagnosis, treatment planning, treatment, and management of patients. ","prereq":[]},{"code":"DDS 6317","subject":"DDS","id":"6317","title":"Comp Care Clinic D3 Fall","info":"Application of clinical knowledge, skills, and the principles of care to the comprehensive assessment, diagnosis, treatment planning, treatment, and management of patients. ","prereq":[]},{"code":"DDS 6318","subject":"DDS","id":"6318","title":"Comp Care Clinic D3 Spring","info":"Application of clinical knowledge, skills, and the principles of care to the comprehensive assessment, diagnosis, treatment planning, treatment, and management of patients. ","prereq":[]},{"code":"DDS 6319","subject":"DDS","id":"6319","title":"Comp Care Clinic D4 Summer","info":"Patient management skills, Diagnosis, treatment planning, delivery of comprehensive care, efficient use of clinic time. ","prereq":[]},{"code":"DDS 6320","subject":"DDS","id":"6320","title":"Comp Care Clinic D4 Fall","info":"Patient management skills, diagnosis, treatment planning, delivery of comprehensive care, efficient use of clinic time.","prereq":[]},{"code":"DDS 6321","subject":"DDS","id":"6321","title":"Comp Care Clinic D4 Spring","info":"Patient management skills, diagnosis, treatment planning, delivery of comprehensive care, efficient use of clinic time. ","prereq":[]},{"code":"DDS 6322","subject":"DDS","id":"6322","title":"Treatment Plng Clin","info":"Devise initial plan from established database; make case presentation; develop final treatment plan, informed consent and appointment plan; and make financial arrangements.\n\nprereq: Patient Management II Resource  Workbook","prereq":[]},{"code":"DDS 6323","subject":"DDS","id":"6323","title":"Treatment Plng Clin","info":"Devise initial plan from established database; make case presentation; develop final treatment plan, informed consent and appointment plan; and make financial arrangements.","prereq":[]},{"code":"DDS 6325","subject":"DDS","id":"6325","title":"Dental Professional Dev I","info":"First of a series that prepares the student in professionalism and practice management. Uses self-assessment and strategic planning to lead students to identify personal and professional aspirations. Four sequential levels of learning creating progressively higher levels of competence using a blended-learning format including online education, simulations and self-directed learning.","prereq":[]},{"code":"DDS 6326","subject":"DDS","id":"6326","title":"Dent Professional Dev II","info":"Focuses on Career Planning, Personal Strategic Planning, Personal Finance and Debt Management. Students apply principles and tools learned to their future professional practice and career. ","prereq":[]},{"code":"DDS 6327","subject":"DDS","id":"6327","title":"Dental Professional Dev III","info":"This course focuses on preparing the student in professionalism, critical thinking, problem solving and practice management. It uses a blended-learning format that includes on-line education, simulations and self-directed learning. It lays the groundwork for students to develop day-to-day leadership skills needed to operate a successful dental practice. ","prereq":[]},{"code":"DDS 6328","subject":"DDS","id":"6328","title":"Dent Professional Dev IV","info":"Fourth and final course sequence in Dental Professional Development. Focuses on completing business plans and refining personal and professional strategic plans applying skills learned in the previous three courses. ","prereq":[]},{"code":"DDS 6331","subject":"DDS","id":"6331","title":"Dental Public Health I","info":"Public health approach to disease. Tools to address public oral health needs. Oral health care in United States. Factors impacting supply/demand for dental services. Critical thinking regarding dental care delivery.\nPrereq-1st yr in DDS Program.","prereq":[]},{"code":"DDS 6332","subject":"DDS","id":"6332","title":"Dental Public Health II","info":"Aspects/principles of prevention. Risk assessment, screening, dietary analysis. Models of health education, health promotion. How dental profession influences public. Student groups research/present materials about oral health topic.","prereq":[]},{"code":"DDS 6333","subject":"DDS","id":"6333","title":"Understanding Health Systems","info":"Understanding Health Systems is a third year Doctor of Dental Surgery course, under the division of Primary Care.  ","prereq":[]},{"code":"DDS 6334","subject":"DDS","id":"6334","title":"Professional Prob Solving","info":"Forum for discussion of clinical dental cases in context of ethics/professionalism. Five workshops based on ADA principles of ethics and code of professional conduct.\nPrereq-DDS 3rd yr.","prereq":[]},{"code":"DDS 6335","subject":"DDS","id":"6335","title":"Prof Prob Solving","info":"Forum for discussion of clinical dental cases in context of ethics/professionalism. Given over fall/spring semester of 4th year. Three workshops on dental cases/ethics.","prereq":[]},{"code":"DDS 6336","subject":"DDS","id":"6336","title":"Dental Practice Management","info":"Skills in planning, organizing, leading, and controlling the clinical, business, and human aspects of dental practice.","prereq":[]},{"code":"DDS 6337","subject":"DDS","id":"6337","title":"Legal Issues:  New Dent","info":"Legal issues: regulation of the profession, associateships, purchasing a dental practice, starting a practice, dental risk management, contract law considerations.\nPrereq-In DDS program.","prereq":[]},{"code":"DDS 6338","subject":"DDS","id":"6338","title":"Special Issues in Oral Health","info":"Delivering optimal oral health care to older adults and patients with special needs. Clinical management of patients with social, psychological, physiological, and dental characteristics. Dentistry in hospital setting.\nPrereq-4th yr DDS program student.","prereq":[]},{"code":"DDS 6339","subject":"DDS","id":"6339","title":"Emergency Preparedness","info":"Emergency preparedness for the dental office with emphasis on teamwork skills. Online module, lectures, and participation in simulated realistic disaster scenarios with interprofessional teams. \nPrereq-Must be enrolled in a School of Dentistry program.","prereq":[]},{"code":"DDS 6340","subject":"DDS","id":"6340","title":"Med Emergencies & Pat Safety","info":"Hands-on/didactic training in recognizing/managing medical emergencies. Patient safety/reduction of risks for accidental patient injury in dental clinical environment.","prereq":[]},{"code":"DDS 6341","subject":"DDS","id":"6341","title":"Oral Hlth Adv, Deliv & Policy","info":"This course uses examples and issues in dentistry and dental public health as a strategy for understanding health policy and public health program development at the local, state, and national levels.  This is a multi-institutional elective about health policy and advocacy ? delivered remotely for Harvard, UNC, ECU, and UMN students. ","prereq":[]},{"code":"DDS 6343","subject":"DDS","id":"6343","title":"Dent Service-Learning D2Spring","info":"DDS2 Students will have the option to go to Hope Dental Clinic to practice local anesthesia injections on patients and to assist.  This is an opportunity for students in DDS 6151 after they complete and pass their local anesthesia lab in November.  Dental Service-Learning is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  All experiences will be provided under the supervision of University of Minnesota School of Dentistry Faculty.","prereq":[]},{"code":"DDS 6344","subject":"DDS","id":"6344","title":"Dent Service-Learning D3Summer","info":"This is an elective clinical experience course for DDS and ADT students only.  Dental Service-Learning is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.","prereq":[]},{"code":"DDS 6345","subject":"DDS","id":"6345","title":"Dent Service-Learning D3Fall","info":"This is an elective clinical experience course for DDS and ADT students only.  Dental Service-Learning is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.","prereq":[]},{"code":"DDS 6346","subject":"DDS","id":"6346","title":"Dent Service-Learning D3Spring","info":"This is an elective clinical experience course for DDS and ADT students only.  Dental Service-Learning is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.","prereq":[]},{"code":"DDS 6347","subject":"DDS","id":"6347","title":"Dent Service-Learning D4Summer","info":"This is an elective clinical experience course for DDS and ADT students only.  Dental Service-Learning is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.","prereq":[]},{"code":"DDS 6348","subject":"DDS","id":"6348","title":"Dent Service-Learning D4Fall","info":"This is an elective clinical experience course for DDS and ADT students only.  Dental Service-Learning is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.","prereq":[]},{"code":"DDS 6349","subject":"DDS","id":"6349","title":"Dent Service-Learning D4Spring","info":"This is an elective clinical experience course for DDS and ADT students only.  Dental Service-Learning is designed to enable students to experience providing oral health care to patient populations who do not have regular access to such care.  Clinical experiences in restorative dentistry, emergency dental care, and oral and maxillofacial surgery will be provided under the supervision of University of Minnesota School of Dentistry Faculty.","prereq":[]},{"code":"DDS 6360","subject":"DDS","id":"6360","title":"Intro to Outreach Experiences","info":"Provide dental care to underserved populations in various clinical settings throughout Minnesota.","prereq":[]},{"code":"DDS 6361","subject":"DDS","id":"6361","title":"Outreach Experiences D4 Summer","info":"Dental care/involvement in community health promotion/service events to under-served populations throughout Minnesota.","prereq":[]},{"code":"DDS 6362","subject":"DDS","id":"6362","title":"Outreach Experiences D4 Fall","info":"Provide dental care/involvement in community health promotion/service events to underserved populations in various clinical settings throughout Minnesota. \nPrereq-Doctor of Dental Surgery Program.","prereq":[]},{"code":"DDS 6363","subject":"DDS","id":"6363","title":"Outreach Experiences D4 Spring","info":"Dental care/involvement in community health promotion/service events to under-served populations throughout Minnesota.","prereq":[]},{"code":"DDS 6411","subject":"DDS","id":"6411","title":"Biomaterials Science I","info":"Prosthodontics, operative dentistry. Students apply scientific principles to selection/utilization of biomaterials, and evaluate a recent research publication. prereq: in DDS program.","prereq":[]},{"code":"DDS 6412","subject":"DDS","id":"6412","title":"Biomaterials Science II","info":"This course continues where Biomaterials Science I leaves off instructing students on additional applications of scientific principles in the selection and utilization of dental biomaterials.  ","prereq":[]},{"code":"DDS 6431","subject":"DDS","id":"6431","title":"Oral Anat I","info":"Morphological characteristics of human dentition and associated contiguous structures. Foundational knowledge applied to situations in general clinical practice. Lectures, lab. \nPrereq-1st yr DDS student.","prereq":[]},{"code":"DDS 6432","subject":"DDS","id":"6432","title":"Oral Anat Lab I","info":"Application of oral anatomy. Fixed prosthodontic lab techniques. Fundamentals of tooth preparation.\nPrereq-1st yr DDS student.","prereq":[]},{"code":"DDS 6433","subject":"DDS","id":"6433","title":"Intro to Psychomotor Skill Dev","info":"Virtual-reality-based training for psychomotor skills. Mirror skills, proper ergonomics. Preparation of intra-coronal activity.\nPrereq-1st yr DDS student.","prereq":[]},{"code":"DDS 6434","subject":"DDS","id":"6434","title":"Oper Dent I","info":"Restoration of small caries lesions, cervical abrasion lesions, and attrition defects. Practical aspects of caries risk assessment, lesion identification, and comprehensive caries management. Emphasizes indications for surgical intervention, principles of restoration design, and rationale for various design features.\nPrereq-Dental Anatomy, Biomaterials.","prereq":[]},{"code":"DDS 6435","subject":"DDS","id":"6435","title":"Oper Dent I Lab","info":"Restoration of small caries lesions, cervical abrasion lesions, and attrition defects in clinical simulation setting. Emphasizes designing/executing retentive/resistant restorations, conserving tooth structure, and operating in clinically relevant orientations. Self-evaluation techniques, discriminatory skills.\nPrereq-Dental Anatomy, Biomaterials.","prereq":[]},{"code":"DDS 6436","subject":"DDS","id":"6436","title":"Oper Dent II","info":"Diagnosis, treatment planning, and treatment of moderate to severe phase of dental caries. Use of dental amalgam, cast gold, composite resin, and cast porcelain. Aesthetic modification to teeth.\nPrereq-In DDS program.","prereq":[]},{"code":"DDS 6437","subject":"DDS","id":"6437","title":"Oper Dent II Lab","info":"Exercises in treatment of moderate to severe phase of dental caries utilizing dental amalgam, cast gold, composite resin, and cast porcelain. Aesthetic modifications to teeth.\nPrereq-In DDS program.","prereq":[]},{"code":"DDS 6438","subject":"DDS","id":"6438","title":"Oper Dent III","info":"Integration/application of skills/knowledge in diagnosis, treatment planning, and treatment. Clinical setting.\nPrereq-Operative Dentistry [I, II], Operative Dentistry [I, II] Lab.","prereq":[]},{"code":"DDS 6439","subject":"DDS","id":"6439","title":"Evidence Based Restorative","info":"Contemporary aspects of operative Dentistry. Students, working in groups, answer clinical questions. Evidence-based approach.\nPrereq-3rd yr DDS student.","prereq":[]},{"code":"DDS 6441","subject":"DDS","id":"6441","title":"Oper Dent Clin II","info":"Students, under direction of instructor, place single tooth restorations on patients, perform dental exams, and prepare treatment plans for patients with consultation from Operative Dentistry Division faculty.\n\nprereq: Operative Dentistry [I, II, III], Operative Dentistry [I, II] lab","prereq":[]},{"code":"DDS 6442","subject":"DDS","id":"6442","title":"Oper Dent Clin V","info":"Clinical application of operative dentistry diagnosis, treatment planning, clinical judgment, and technical skills.\nPrereq-Operative Dentistry I, II, III, Operative Dentistry I and II Lab.","prereq":[]},{"code":"DDS 6443","subject":"DDS","id":"6443","title":"Oper Dent Clinic D3 Summer","info":"Third year dental students, under direction of instructor, place single tooth restorations on patients, perform dental exams, and prepare treatment plans for patients with consultation from Operative Dentistry Division faculty. \nprereq: Operative Dentistry [I, II, III], Operative Dentistry [I, II] lab","prereq":[]},{"code":"DDS 6444","subject":"DDS","id":"6444","title":"Oper Dent Clinic D3 Fall","info":"Third year dental students, under direction of instructor, place single tooth restorations on patients, perform dental exams, and prepare treatment plans for patients with consultation from Operative Dentistry Division faculty. \nprereq: Operative Dentistry [I, II, III], Operative Dentistry [I, II] lab","prereq":[]},{"code":"DDS 6445","subject":"DDS","id":"6445","title":"Oper Dent Clinic D3 Spring","info":"Third year dental students, under direction of instructor, place single tooth restorations on patients, perform dental exams, and prepare treatment plans for patients with consultation from Operative Dentistry Division faculty. \nprereq: Operative Dentistry [I, II, III], Operative Dentistry [I, II] lab","prereq":[]},{"code":"DDS 6446","subject":"DDS","id":"6446","title":"Oper Dent Clinic D4 Summer","info":"4th year dental student clinical application of operative dentistry diagnosis, treatment planning, clinical judgment, and technical skills. \n\nPrereq: Operative Dentistry I, II, III, Operative Dentistry I and II Lab.","prereq":[]},{"code":"DDS 6447","subject":"DDS","id":"6447","title":"Oper Dent Clinic D4 Fall","info":"4th year dental student clinical application of operative dentistry diagnosis, treatment planning, clinical judgment, and technical skills. \nPrereq: Operative Dentistry I, II, III, Operative Dentistry I and II Lab.","prereq":[]},{"code":"DDS 6448","subject":"DDS","id":"6448","title":"Oper Dent Clinic D4 Spring","info":"4th year dental student clinical application of operative dentistry diagnosis, treatment planning, clinical judgment, and technical skills. \nPrereq: Operative Dentistry I, II, III, Operative Dentistry I and II Lab.","prereq":[]},{"code":"DDS 6451","subject":"DDS","id":"6451","title":"Intro to Endo","info":"Study of morphology, physiology, and pathology of the human dental pulp and periradicular tissues.","prereq":[]},{"code":"DDS 6455","subject":"DDS","id":"6455","title":"Endo Dent Clinic D3 Summer","info":"Endodontic dentistry clinic practice for third year dental students.","prereq":[]},{"code":"DDS 6456","subject":"DDS","id":"6456","title":"Endo Dent Clinic D3 Fall","info":"Endodontic clinical practice for third year dental students. ","prereq":[]},{"code":"DDS 6457","subject":"DDS","id":"6457","title":"Endo Dent Clinic D3 Spring","info":"Endodontic clinical practice for third year dental students.","prereq":[]},{"code":"DDS 6458","subject":"DDS","id":"6458","title":"Endo Dent Clinic D4 Summer","info":"Endodontic clinical practice for fourth year dentistry students.","prereq":[]},{"code":"DDS 6459","subject":"DDS","id":"6459","title":"Endo Dent Clinic D4 Fall","info":"Endodontic clinical practice for fourth year dental students.","prereq":[]},{"code":"DDS 6460","subject":"DDS","id":"6460","title":"Endo Dent Clinic D4 Spring","info":"Endodontic clinical practice for fourth year dentistry students. ","prereq":[]},{"code":"DDS 6461","subject":"DDS","id":"6461","title":"Endo Clin D3","info":"Clinical practice for endodontics.","prereq":[]},{"code":"DDS 6462","subject":"DDS","id":"6462","title":"Endo Clin","info":"Clinical practice for endodontics.","prereq":[]},{"code":"DDS 6468","subject":"DDS","id":"6468","title":"Preclncl Prosthodontics Tchnq","info":"This course will provide students with fundamental knowledge and procedural skills necessary of managing simulated patient cases that require full crown restoration.  ","prereq":[]},{"code":"DDS 6469","subject":"DDS","id":"6469","title":"Preclin Prsthdntcs Tchnq Lab I","info":"This course will provide students with fundamental knowledge and procedural skills necessary of managing simulated patient cases that require full crown restoration. Lab sessions will allow students time to practice skills on typodonts. ","prereq":[]},{"code":"DDS 6471","subject":"DDS","id":"6471","title":"PC Pros Tech Lec II","info":"Provides fundament knowledge/procedural skills necessary for managing simulated patient cases that require full crown restoration.","prereq":[]},{"code":"DDS 6472","subject":"DDS","id":"6472","title":"PC Pros Lab II","info":"Lab techniques, fundamentals of tooth preparation.","prereq":[]},{"code":"DDS 6473","subject":"DDS","id":"6473","title":"PC Pros Tec Lec III","info":"Fixed, removable, occlusion topics.","prereq":[]},{"code":"DDS 6474","subject":"DDS","id":"6474","title":"PC Pros Tec Lab III","info":"Fixed, removable, occlusion topics.","prereq":[]},{"code":"DDS 6475","subject":"DDS","id":"6475","title":"Pros Techniques Lec IV","info":"Theory/practice in complete denture construction. Diagnosis, treatment planning/sequencing for edentulous patient. Instruments, terminology, principles, technical/clinical procedures. \nPrereq-DDS program.","prereq":[]},{"code":"DDS 6476","subject":"DDS","id":"6476","title":"Pros Tech Lab I V","info":"Technical/clinical laboratory procedures used for  fabrication/replacement of teeth with complete dentures.\nPrereq-DDS program.","prereq":[]},{"code":"DDS 6477","subject":"DDS","id":"6477","title":"PC Pros Tech Lec V","info":"Principles/philosophies of removable partial denture prosthodontics. Design/fabrication of removable prosthesis to replace teeth for partially edentulous patient. Lecture format, plus an interactive seminar. ","prereq":[]},{"code":"DDS 6478","subject":"DDS","id":"6478","title":"PC Pros Tech Lab V","info":"Technical/clinical laboratory procedures used for  fabrication/replacement of teeth with partial dentures.","prereq":[]},{"code":"DDS 6479","subject":"DDS","id":"6479","title":"Clinical Occlusion","info":"Clinical variation in occlusion encountered in a typical clinical setting. Guidelines to manage this variation.\n\nprereq: Enrolled in dentistry program","prereq":[]},{"code":"DDS 6481","subject":"DDS","id":"6481","title":"Fix Pros Cl II","info":"Diagnosis, design, construction of fixed prosthodontic cases.","prereq":[]},{"code":"DDS 6482","subject":"DDS","id":"6482","title":"Rem Pros Cl II","info":"Clinical practice in partial and complete removable denture prosthodontics for DDS third-year students","prereq":[]},{"code":"DDS 6483","subject":"DDS","id":"6483","title":"Fix. Pros. Cl. IV","info":"Diagnosis, design, construction of fixed prosthodontic cases.","prereq":[]},{"code":"DDS 6484","subject":"DDS","id":"6484","title":"Rem Pros Cl IV","info":"Clinic practice in complete/partial removable denture prosthodontics.","prereq":[]},{"code":"DDS 6485","subject":"DDS","id":"6485","title":"PASS Prosthodontic Tech I","info":"Principles and philosophies of removable partial denture prosthodontics. Design and fabrication of removable prosthesis to replace teeth for partially edentulous patient. Lecture and interactive seminar.","prereq":[]},{"code":"DDS 6486","subject":"DDS","id":"6486","title":"Removable Pros Lab for PASS","info":"Technical/clinical laboratory procedures used for fabrication/replacement of teeth with partial dentures.","prereq":[]},{"code":"DDS 6487","subject":"DDS","id":"6487","title":"PASS Prosthodontic Technique 2","info":"Pre-clinical didactic and laboratory course designed to provide students with the knowledge and procedural skills necessary for managing simulated patient cases requiring full crown restoration.","prereq":[]},{"code":"DDS 6489","subject":"DDS","id":"6489","title":"Pros: Early Clinical Exp","info":"The purpose of the course is to provide the second-year dental student with early clinical experiences, specifically in dentures fabrication, that is performed under the supervision of clinical faculty who will provide instruction, assistance, and immediate feedback.","prereq":[]},{"code":"DDS 6491","subject":"DDS","id":"6491","title":"PC Pros Tech Lec VI","info":"Implanting fixed/removable protocols. Principles of restoring damaged teeth.\n\nprereq: 5901 through 5910.","prereq":[{"code":"DDS 5901","subject":"DDS","id":"5901"},{"code":"DDS 5910","subject":"DDS","id":"5910"}]},{"code":"DDS 6492","subject":"DDS","id":"6492","title":"PC Pros Tech Lab VI","info":"Implanting fixed/removable protocols. Principles of restoring damaged teeth.\nPrereq-5901 through 5910.","prereq":[{"code":"DDS 5901","subject":"DDS","id":"5901"},{"code":"DDS 5910","subject":"DDS","id":"5910"}]},{"code":"DDS 6493","subject":"DDS","id":"6493","title":"Pros. I","info":"Links preclinical/clinical areas. Treatment planning for abutments, retainers, and pontics. Design principles for porcelain fused to metal restorations, pontic designs, occlusion.\nPrereq-Fundamentals of prosthodontics shape/color, aesthetics of anterior prosthodontics.","prereq":[]},{"code":"DDS 6494","subject":"DDS","id":"6494","title":"Global & Integrated Comp Asses","info":"Global/integrated assessment of didactic/clinical competency for 4th year DDS students. Results of assessment shall be used to establish/maintain standards/competency of University of Minnesota, School of Dentistry.","prereq":[]},{"code":"DDS 6495","subject":"DDS","id":"6495","title":"OMS Honors Elective Course","info":"This course provides Doctor of Dental Surgery students the opportunity to participate in a week long externship experience in the Oral & Maxillofacial clinic at the University of MN, School of Dentistry. Students will be shadowing the OMS Residents as they care for patients. This includes evaluation and management of a surgical patient, pre- & post- operative care, and treatment planning.","prereq":[]},{"code":"DDS 6496","subject":"DDS","id":"6496","title":"Predoctoral Pros Honors Course","info":"Clinical, laboratory, and seminar based course for senior dental honors students. Theory and practice in complete denture construction and implant restoration.  ","prereq":[]},{"code":"DDS 6497","subject":"DDS","id":"6497","title":"Fix Pros Clinic D3 Summer","info":"Third year dental students diagnosis, design, construction of fixed prosthodontic cases.","prereq":[]},{"code":"DDS 6498","subject":"DDS","id":"6498","title":"Rem Pros Clinic D3 Summer","info":"Clinical practice in partial and complete removable denture prosthodontics for third year DDS students.","prereq":[]},{"code":"DDS 6499","subject":"DDS","id":"6499","title":"Fixed Pros Clinic D3 Fall","info":"Third year dental students diagnosis, design, construction of fixed prosthodontic cases during Fall semester.","prereq":[]},{"code":"DDS 6501","subject":"DDS","id":"6501","title":"Rem Pros Clinic D3 Fall","info":"Clinical practice in partial and complete removable denture prosthodontics for third year DDS students fall semester.","prereq":[]},{"code":"DDS 6502","subject":"DDS","id":"6502","title":"Fixed Pros Clinic D3 Spring","info":"Third year dental students diagnosis, design, construction of fixed prosthodontic cases in clinic Spring semester.","prereq":[]},{"code":"DDS 6503","subject":"DDS","id":"6503","title":"Rem Pros Clinic D3 Spring","info":"Clinical practice in partial and complete removable denture prosthodontics for third year DDS students, spring semester.","prereq":[]},{"code":"DDS 6504","subject":"DDS","id":"6504","title":"Fixed Pros Clinic D4 Summer","info":"D4 summer term of diagnosis, design, construction of fixed prosthodontic clinic cases. ","prereq":[]},{"code":"DDS 6505","subject":"DDS","id":"6505","title":"Rem Pros Clinic D4 Summer","info":"D4 summer term of complete and partial removable denture prosthodontic clinic cases. ","prereq":[]},{"code":"DDS 6506","subject":"DDS","id":"6506","title":"Fixed Pros Clinic D4 Fall","info":"D4 fall term of diagnosis, design, construction of fixed prosthodontic clinic cases. ","prereq":[]},{"code":"DDS 6507","subject":"DDS","id":"6507","title":"Rem Pros Clinic D4 Fall","info":"D4 fall term of complete and partial removable denture prosthodontic clinic cases. ","prereq":[]},{"code":"DDS 6508","subject":"DDS","id":"6508","title":"Fixed Pros Clinic D4 Spring","info":"D4 spring term of diagnosis, design, construction of fixed prosthodontic clinic cases. ","prereq":[]},{"code":"DDS 6509","subject":"DDS","id":"6509","title":"Rem Pros Clinic D4 Spring","info":"D4 spring term of complete and partial removable denture prosthodontic clinic cases. ","prereq":[]},{"code":"DDS 6511","subject":"DDS","id":"6511","title":"FIPCC","info":"First of three phases of Center for Interprofessional Education's health curriculum. Online work, face-to-face sessions. Professional identity, integrity. Relationships between professionals and those they serve. Social networking, tools for self/peer assessment. ","prereq":[]},{"code":"DDS 6570","subject":"DDS","id":"6570","title":"Mission of Mercy Vol Exp","info":"Short term volunteer experience to learn public health aspects of oral health. Must be approved by School of Dentistry. Must have faculty supervision.","prereq":[]},{"code":"DDS 6571","subject":"DDS","id":"6571","title":"Spec Smiles Vol Elective Exp","info":"Short term volunteer experience with Special Smiles event. Public health initiatives of oral health. Must be approved by School of Dentistry. Must have faculty supervision. ","prereq":[]},{"code":"DDS 6572","subject":"DDS","id":"6572","title":"Team Smiles Vol Elective Exp","info":"Short term volunteer experience for Team Smiles event.  Students experience public health initiative in oral health. Must be approved by School of Dentistry, have faculty supervision.  ","prereq":[]},{"code":"DDS 6588","subject":"DDS","id":"6588","title":"DentClinical Exp in Guatemala","info":"Students spend up to two weeks working with Common Hope in Guatemala providing oral health care in cities of Antiqua/San Rafael. Clinical care given under direct supervision of School of Dentistry faculty licensed dentist.","prereq":[]},{"code":"DDS 6601","subject":"DDS","id":"6601","title":"Phillips Neighborhood Vol","info":"Opportunity to observe/assist in provision of health care services to populations diverse in age, ethnicity, social environment. Experience unique clinical settings.","prereq":[]},{"code":"DDS 6602","subject":"DDS","id":"6602","title":"Harbor Lights Volunteer Exprnc","info":"Short term volunteer experience to learn about particular aspect of oral health. Must be approved by School of Dentistry/have faculty supervision.\n\nprereq: Must be in DDS program","prereq":[]},{"code":"DDS 6603","subject":"DDS","id":"6603","title":"Elective Regional Volunteer","info":"Short term volunteer experience to learn particular aspect of oral health. Must be approved by School of Dentistry. Must have faculty supervision.","prereq":[]},{"code":"DDS 6604","subject":"DDS","id":"6604","title":"Elective Regional Volunteer","info":"Short term volunteer experience to learn particular aspect of oral health. Must be approved by School of Dentistry. Must have faculty supervision.","prereq":[]},{"code":"DDS 6605","subject":"DDS","id":"6605","title":"Advanced Practice Management","info":"Fundamentals of business management related to maintaining dental practice. Components include economics, planning practice philosphy, operational decisions, financial decisions, finanacial analysis, business taxation, evaluation.","prereq":[]},{"code":"DDS 6606","subject":"DDS","id":"6606","title":"Rural Dentistry Scholars Elect","info":"The Rural Dentistry Scholars Elective course (RDSP) is for second and third year DDS students and Dental Therapy students selected to participate in the MN Collaborative Rural Oral Health Project (MN-CROHP) to address the rural dental workforce issues.  Students spend 3.5 weeks in a rural dental practice in selected counties in MN under the mentorship of a rural dentist. During the same period they participate in community activities for oral health promotion and disease prevention instruction during community events and in K-12 schools and network with other health care providers in the community. Through a grant, students receive stipend and receive reimbursement for housing and travel costs.","prereq":[]},{"code":"DDS 6607","subject":"DDS","id":"6607","title":"Interprofessional Facilitation","info":"Instruction on Kotter's 8-Step Process for leading change.  Attend facilitator training associated with AHC course Foundations of Interprofessional Communication/Collaboration. Facilitate six small group sessions of first year students within AHC.\n\nprereq: Four-year DDS student","prereq":[]},{"code":"DDS 6608","subject":"DDS","id":"6608","title":"Elective Externship I","info":"Short-term externship to become familiar with a particular aspect of oral health or participate in international exchange program.","prereq":[]},{"code":"DDS 6609","subject":"DDS","id":"6609","title":"Elective Externship II","info":"Short-term externship to become familiar with a particular aspect of oral health or participate in international exchange program.","prereq":[]},{"code":"DDS 6610","subject":"DDS","id":"6610","title":"Elective Externship III","info":"Short-term externship to become familiar with a particular aspect of oral health or participate in international exchange program.","prereq":[]},{"code":"DDS 6611","subject":"DDS","id":"6611","title":"Study Abroad Externship","info":"Short-term externship to become familiar with particular aspect of oral health or participate in international exchange program.","prereq":[]},{"code":"DDS 6612","subject":"DDS","id":"6612","title":"Union Gospel Mission Volunteer","info":"Volunteer at Union Gospel Mission in St. Paul, Minnesota under guidance of School of Dentistry faculty. ","prereq":[]},{"code":"DDS 6613","subject":"DDS","id":"6613","title":"Endo Topics for Gen Dentist","info":"Presentations on scientific/biologic basis for root canal therapy. ","prereq":[]},{"code":"DDS 6614","subject":"DDS","id":"6614","title":"Predoctoral Perio Honors","info":"Surgical periodontics. Lab exercises, gingivectomy, modified widman flap, apically positioned flap with osseous recontouring, free gingival graft procedures. Surgically placed dental implants in aplastic madible. Students assist senior perio residents in surgery, perform surgery on their own patient.","prereq":[]},{"code":"DDS 6615","subject":"DDS","id":"6615","title":"OMF Path Ind Study","info":"Independent projects in oral and maxillofacial pathology designed by student and faculty. This elective covers primarily retrospective surgical pathology studies although active laboratory research may be possible.","prereq":[]},{"code":"DDS 6616","subject":"DDS","id":"6616","title":"Adv Sim Clinic Elective I","info":"Operative dental procedures. Psycho-motor skills for performing basic operative preparations according to specifications of DentSim software. \nPrereq-DDS program.","prereq":[]},{"code":"DDS 6617","subject":"DDS","id":"6617","title":"Adv Sim Clinic Elective II","info":"Additional operative dental procedures. Psycho-motor skills for performing basic operative preparations according to specifications of DentSim software.\nPrereq-DDS program.","prereq":[]},{"code":"DDS 6619","subject":"DDS","id":"6619","title":"Moderate Sedation Techniques","info":"Planning/administration of moderate sedation via parenteral access (intravenous).","prereq":[]},{"code":"DDS 6621","subject":"DDS","id":"6621","title":"Intro to CAD/CAM Restorations","info":"CAD/CAM in restorative dentistry. Emphasizes clinical aspects. Students deliver CAD/CAM restorations to patients. ","prereq":[]},{"code":"DDS 6622","subject":"DDS","id":"6622","title":"EBD: Adv Dental Materials","info":"Advanced evidence-based aesthetic restorative materials/digital clinical modalities. Rationale of prescribing different esthetic/adhesive/digital treatment modalities. Selection of various dental materials based on scientific rationale.\n\nprereq: DDS program","prereq":[]},{"code":"DDS 6623","subject":"DDS","id":"6623","title":"Oral Disease Clinic Elective","info":"Students experience clinical oral pathology diseases not normally seen during dental clinic rotations. Students observe operator protocol, management, and referrals.","prereq":[]},{"code":"DDS 6624","subject":"DDS","id":"6624","title":"Disaster 101","info":"Disaster preparedness. Timeliness/quality of response. Students participate in simulated disaster scenarios in interprofessional teams.\nPrereq-In DDS program.","prereq":[]},{"code":"DDS 6625","subject":"DDS","id":"6625","title":"Pediatric Dent Honors Elective","info":"Didactic discussions/clinical sessions with pediatric patients requiring advanced dental treatment and/or advanced behavioral management skills. ","prereq":[]},{"code":"DDS 6626","subject":"DDS","id":"6626","title":"Orofacial Pain Clinic Elective","info":"Two days of observation in the Orofacial Pain Clinic while residents and faculty evaluate and manage patients with orofacial pain conditions.  Students will gain working knowledge of patient interviewing skills, musculoskeletal exam of the head and jaw, jaw range of motion and function.  They will also gain knowledge of how to prescribe and deliver dental appliances.  ","prereq":[]},{"code":"DDS 6627","subject":"DDS","id":"6627","title":"Oral Path Clinical Correlation","info":"This oral pathology elective has two parts, every week one clinical oral path case will be uploaded in the course website for students to review. Students will meet as a group once a month for discussion of the four cases. One student will introduce one case involving discussion of the history, clinical presentation, establishing a clinical differential diagnosis, discuss of next steps in diagnosis and treatment planning.  ","prereq":[]},{"code":"DDS 6629","subject":"DDS","id":"6629","title":"Pre-Dental Summer Research","info":"Summer Research Opportunity for newly admitted DDS students. ","prereq":[]},{"code":"DDS 6630","subject":"DDS","id":"6630","title":"Dental Research Training","info":"Research project, written report.","prereq":[]},{"code":"DDS 6631","subject":"DDS","id":"6631","title":"DDS/PhD Research Elective I","info":"Integrate research education with dental education. Attend labs one-half day per week, MNCrest seminar monthly, and  oral biology student seminar weekly. Additional research time/credits may be permitted with approval of associate dean for academic affairs.  \nPrereq-Students must be part of the MinnCResT program.","prereq":[]},{"code":"DDS 6632","subject":"DDS","id":"6632","title":"DDS/PhD Research Elective II","info":"Integrate research education with dental education. Attend lab one-half day per week, MinnCResT seminar monthly, and oral biology student seminar weekly. Additional research time/credits may be permitted with approval of associate dean for academic affairs.  \nPrereq-Students must be part of the MinnCResT Program.","prereq":[]},{"code":"DDS 6640","subject":"DDS","id":"6640","title":"Curricular Prac Train Elective","info":"This course is an elective internship or employment to gain practical work experience, advance professional skills and explore career interests.  ","prereq":[]},{"code":"DDS 6900","subject":"DDS","id":"6900","title":"Dent Clin","info":"Elective clinical course for students and adult special students who want additional clinical training in comprehensive dental care.","prereq":[]},{"code":"DDS 6901","subject":"DDS","id":"6901","title":"Essentials of Clinical Care D2","info":"This course will introduce sophomore doctor of dental surgery students to the clinical care of patients. Students will assist in care provision in multiple care environments under the direction and supervision of experienced clinical faculty. This course will encompass clinical training over two semesters and a final grade is given at the end of the last semester.  This course will also allow students to volunteer to assist at the Union Gospel Mission Dental Clinic in St. Paul.\n\nprereq: Must be enrolled in the Doctor of Dental Surgery Program.","prereq":[]},{"code":"DDS 6911","subject":"DDS","id":"6911","title":"Essentials of Clinical Care D3","info":"Students provide comprehensive care under direction of clinical faculty. May include periodontics, operative, prosthodontics/endodontics, and health promotion. Limited care may be given on rotations to oral surgery/endodontics clinics.\nPrereq-DDS 3rd yr.","prereq":[]},{"code":"DDS 6912","subject":"DDS","id":"6912","title":"DDS3 Alternate Clinic Summer","info":"Due to the COVID-19 pandemic, the DDS3 students will augment the clinical curriculum with an alternative clinical course that introduces them into clinic using distance learning format. This course will require students to attend daily sessions provided by the clinical disciplines. Each student will be required to complete assignments for each alternative clinical based activity. ","prereq":[]},{"code":"DDS 6915","subject":"DDS","id":"6915","title":"DDS4 Alternate Clinic Summer","info":"Due to COVID-10 pandemic, the DDS4 students will augment the clinical curriculum with an alternative clinical course using distance learning format. This course will require students to attend daily sessions provided by the clinical disciplines. Each student will be required to complete a daily assignment for each alternative clinical based activity. ","prereq":[]},{"code":"DDS 6918","subject":"DDS","id":"6918","title":"Evidence-based Dentistry","info":"Background knowledge and skills to integrate the best research evidence with clinical expertise and patient preferences in making clinical decisions. Principles of evidence-based dentistry are discussed as well as their clinical application. \nPrereq-Must be in DDS program.","prereq":[]},{"code":"DDS 6921","subject":"DDS","id":"6921","title":"Essentials of Clinical Care D4","info":"Students provide comprehensive care under direction of clinical faculty. May include periodontics, operative, prosthodontics/endodontics, and health promotion. Limited care may be given on rotations to oral surgery and endodontics clinics. \nPrereq-DDS 4th yr.","prereq":[]},{"code":"DDS 6922","subject":"DDS","id":"6922","title":"DDS4 Alternative Clinic","info":"Starting on April 6, 2020, the DDS4 will augment the clinical curriculum with an alternative clinical course using distance learning format. This course will require students to attend daily sessions provided by the clinical disciplines. Each student will be required to complete a daily assignment for each alternative clinical based activity. ","prereq":[]},{"code":"DDS 6931","subject":"DDS","id":"6931","title":"Dental Clinic","info":"Elective clinical course. Clinical training in comprehensive dental care. ","prereq":[]},{"code":"DDS 7103","subject":"DDS","id":"7103","title":"Biochem & Cell Bio","info":"This course covers four main classes of biomolecules (nucleic acids, proteins, carbohydrates, and lipids) and how they interact at the cellular and organismal levels. Dental students will learn about the building blocks that comprise these biomolecules and how they are produced and degraded as part of normal cellular growth processes. These basic biochemical concepts will then be transferred to cellular processes including enzyme kinetics, roles of salivary enzymes in health and disease, metabolic pathways, and regulation of cellular processes such as cell cycle progression and the blood-clotting cascade. Upon completion of the course, students will be able to explain the role of these biomolecules in health and disease, with an emphasis on oral health, as well as being capable of diagnosing diseases based on biochemical characterization of patient samples.  ","prereq":[]},{"code":"DDS 7112","subject":"DDS","id":"7112","title":"Periodontology II-B: Technique","info":"Periodontology II-B: Technique (DDS 7112) is a one-credit course that is designed to introduce first-year dental students to the fundamentals of periodontal instrumentation and techniques.  This course utilizes periodontal curriculum content introduced in Periodontology I (DDS 6111) and Periodontology II: Technique (DDS 6112).  Periodontology II-B: Technique curriculum will continue to expand on the topics of DDS 6112, of teaching practical lab and clinical experiences to allow the student to attain beginner skills in evaluation, prevention, and non-surgical treatment of gingival and periodontal disease as well as practical experience in infection control protocol and in the electronic health record.","prereq":[]},{"code":"DDS 7113","subject":"DDS","id":"7113","title":"D2 Perio Clinic I","info":"DDS 7113 is a one-credit course that is designed to build on periodontal curriculum content introduced in Periodontology I (DDS 6111) and Periodontology II and IIb (DDS 6112 and DDS 7112). DDS 7113 Fall curriculum will provide a one-time clinical rotation experience (previously part of DDS 6112).\nThe clinical rotation will provide the second-year dental student the opportunity to provide preventive/maintenance periodontal care for a School of Dentistry patient. This opportunity will also provide the dental student an experience in OSHA procedures, HIPPA protocol, infection control protocol, Axium charting, patient management, clinical dispensing procedures, and financial management of the appointment.","prereq":[]},{"code":"DDS 7114","subject":"DDS","id":"7114","title":"D2 Perio Clinic II","info":"The DDS 7114 is a one credit course that is designed to build on periodontal curriculum content introduced in Periodontology I (DDS 6111) and Periodontology II A, B, and fall clinic (DDS 6112, DDS 7112 and DDS 7113). DDS 7114 will provide a one-time clinical rotation experience. The clinical rotation in the 7th floor Periodontology Clinic will provide the dental student the opportunity to provide scaling and root planing/maintenance periodontal care for a School of Dentistry patient. This opportunity will also provide the dental student an experience in OSHA procedures, HIPPA protocol, infection control protocol, Axium charting, patient management, clinical dispensing procedures and financial management of the appointment.","prereq":[]},{"code":"DDS 7311","subject":"DDS","id":"7311","title":"Clinic Preparation","info":"Clinic preparatory course for pre-clinical dental students to prepare them for delivering patient care in a clinical setting.  ","prereq":[]},{"code":"DDS 7327","subject":"DDS","id":"7327","title":"Dental Professional Dev III B","info":"This course continues from DDS 6327 (DDS3 Fall semester) and focuses on preparing the student in professionalism, critical thinking, problem solving and practice management. It uses a blended-learning format that includes on-line education, simulations and self-directed learning. It lays the groundwork for students to develop day-to-day leadership skills needed to operate a successful dental practice. ","prereq":[]},{"code":"DDS 7328","subject":"DDS","id":"7328","title":"Dental Profssnl Dvlpmnt IVb","info":"This course is the last in a series of courses (DPD 1  4b) taught throughout the dental education curriculum to prepare students for dental practice and incorporates ethics and professionalism in practice. The course provides a forum for the discussion of clinical scenarios in the context of ethics and professionalism using simulation, self- and peer assessment, active discourse, and reflection. Inquiry and reflective practice are essential to professional practice and the foundation of life-long learning. ","prereq":[]}]