[{"code":"DESI 3010","subject":"DESI","id":"3010","title":"Travels in Typography","info":"Using collection in James Ford Bell Library, students study rare book/map collections and undertake hands-on exercises on history of type, including developments in typesetting, calligraphy, and letterpress printing.","prereq":[]},{"code":"DESI 3040","subject":"DESI","id":"3040","title":"Intro to Furniture Design","info":"Furniture design as discipline, not as method. Material, sensual, and aesthetic, both sublime and mundane. Objects that mediate our environment. History, design criteria, technology, craft. Group case-study, research presentation, individual making/presenting of a concept-prototype.","prereq":[]},{"code":"DESI 3050","subject":"DESI","id":"3050","title":"Streetlife","info":"The street as part of network of urban systems/fragments: sidewalks, private interiors, curbs, terraces, boulevards, parking lots, bus stops, public institutions, urban architectures, utility lines, storm/sewer systems, groundwater, satellite communication systems, gardens, and lighting. Readings in urban studies, geography, design, economics and art history. Students review case studies, envision possible transformations of streets/streetlife.","prereq":[]},{"code":"DESI 3061","subject":"DESI","id":"3061","title":"(un)wrapping it up","info":"New high-tech fabrics, foils, electrotextiles, and ?intelligent textiles? that respond to environmental stimuli. Hands-on materials research, testing of prototypes. Cross-disciplinary student teams explore appropriate-use modeling/applications. Several one-week projects lead to larger/integrated project.","prereq":[]},{"code":"DESI 3120","subject":"DESI","id":"3120","title":"Topics in Interdis Design","info":"Topics in interdisciplinary design theory, history, technology, and practice.","prereq":[]},{"code":"DESI 4001","subject":"DESI","id":"4001","title":"Design Minor Seminar","info":"Students share ideas/conclusions with one another and create a summary statement (eg., document, multimedia display, designed object) of a significant learning insight.","prereq":[]},{"code":"DESI 4002","subject":"DESI","id":"4002","title":"DI Seminar: Topics","info":"Offerings vary. See Design Institute for descriptions.","prereq":[]},{"code":"DESI 4041","subject":"DESI","id":"4041","title":"Innovating","info":"Discourse of innovation. Methods for enhancing the creative\nprocess. Students use online patent databases as a starting point for innovative propositions. Exercises from all design\ndisciplines trace innovative ideas across disciplinary borders.","prereq":[]},{"code":"DESI 4050","subject":"DESI","id":"4050","title":"Design Institute Seminar","info":"Develops alternative cartography that reveals the city in ways conventional maps do not. Classic texts explore urban representation and more recent material in cartographic criticism. Student mapmaking projects include producing a map of Twin Cities, alternative city atlas, and (as part of competition in conjunction with Twin Cities Design Celebration) wearable cartography. Readings, quizzes, projects presented in class.\n","prereq":[]},{"code":"DESI 4120","subject":"DESI","id":"4120","title":"Topics in Interdis Design","info":"Topics in interdisciplinary Design theory, history, technology, and practice.","prereq":[]},{"code":"DESI 5100","subject":"DESI","id":"5100","title":"DI Directed Study","info":"Guided independent study in design.","prereq":[]}]