[
    {
        "code": "DHA 1171",
        "subject": "DHA",
        "id": "1171",
        "title": "Freshman Seminar in DHA",
        "info": "Topic in design, housing, or apparel. Small-group seminar. ",
        "prereq": []
    },
    {
        "code": "DHA 1905",
        "subject": "DHA",
        "id": "1905",
        "title": "Freshman Seminar",
        "info": "Special topics. Topics vary by term. See Class Schedule.",
        "prereq": []
    },
    {
        "code": "DHA 1907W",
        "subject": "DHA",
        "id": "1907W",
        "title": "Freshman Seminar: WI and CD",
        "info": "Issues related to design disciplines and cultural diversity.  Topics announced in advance. Small group seminar.",
        "prereq": []
    },
    {
        "code": "DHA 2402",
        "subject": "DHA",
        "id": "2402",
        "title": "Residential Tech",
        "info": "Survey of technological systems in housing. Emphasizes consumption/conservation of natural resources and energy sources. Human factor considerations in kitchen design.",
        "prereq": []
    },
    {
        "code": "DHA 3196",
        "subject": "DHA",
        "id": "3196",
        "title": "Field Study",
        "info": "Faculty-directed field study in a national or international setting.",
        "prereq": []
    },
    {
        "code": "DHA 4001",
        "subject": "DHA",
        "id": "4001",
        "title": "Design Minor Seminar",
        "info": "Students share ideas/conclusions with one another, create a summary statement (e.g., document, multi-media display, designed object) of a significant learning insight.",
        "prereq": []
    },
    {
        "code": "DHA 4241",
        "subject": "DHA",
        "id": "4241",
        "title": "Retail Promotion",
        "info": "Integration of communication/consumer behavior theories with elements of retail promotion. Advertising, sales promotions, point-of-purchase communications, personal selling.",
        "prereq": []
    },
    {
        "code": "DHA 4340",
        "subject": "DHA",
        "id": "4340",
        "title": "Fiber Dsgn Workshop",
        "info": "Studio experiences in the development and production of woven, knit, and non-woven fiber projects. Explore several design methods and complete a major project using one of the structure techniques.",
        "prereq": []
    },
    {
        "code": "DHA 4350",
        "subject": "DHA",
        "id": "4350",
        "title": "Materials",
        "info": "Focus on the relationship between the material of production and the design problem, and its most effective solution. Develop production skills in the specified medium while gaining a sensitivity to the material's expressive potential.",
        "prereq": []
    },
    {
        "code": "DHA 4384",
        "subject": "DHA",
        "id": "4384",
        "title": "Interactive Media",
        "info": "Design of interactive multi-media projects. Experience developing interactive presentations and electronic publishing. Software includes hypermedia, scripting, video/sound editing, animation, digital output.",
        "prereq": []
    },
    {
        "code": "DHA 5111",
        "subject": "DHA",
        "id": "5111",
        "title": "Hist of Dec Arts",
        "info": "In depth study of textiles, ceramics, metal, and glass from selected historical periods. Focus on the Goldstein Gallery collections.",
        "prereq": []
    },
    {
        "code": "DHA 5381",
        "subject": "DHA",
        "id": "5381",
        "title": "Digital Illustr",
        "info": "Integration of design with computer applications. Use of raster-/vector-based programs for illustration.",
        "prereq": []
    },
    {
        "code": "DHA 5382",
        "subject": "DHA",
        "id": "5382",
        "title": "Sound & Video",
        "info": "Design solutions involving time-based media. Emphasizes sound/video. Electronic publishing via Internet.",
        "prereq": []
    },
    {
        "code": "DHA 5385",
        "subject": "DHA",
        "id": "5385",
        "title": "Internet Media",
        "info": "Designing interactive presentations (using various operating systems) for Internet/Web. Electronic publishing. Development of internet-based communication.",
        "prereq": []
    },
    {
        "code": "DHA 621",
        "subject": "DHA",
        "id": "621",
        "title": "Intro to Drafting",
        "info": "Architectural drafting practice and the use of drafting instruments. Line conventions, lettering, orthographic drawings, paraline drawing, architectural symbols, and vocabulary as related to interior design.  (Independent and distance learning only.)",
        "prereq": []
    },
    {
        "code": "DHA 8111",
        "subject": "DHA",
        "id": "8111",
        "title": "Analysis Dsgn Lit",
        "info": "Classic and contemporary literature; visualization, creativity, and design methods literature.",
        "prereq": []
    },
    {
        "code": "DHA 8262",
        "subject": "DHA",
        "id": "8262",
        "title": "Historical Perspect",
        "info": "Dress as a significant factor in human interaction prior to 1940. Early social science and philosophical writing, beginning with Montaigne in 1537.  These perspectives appraised for relevance to current research and theory.",
        "prereq": []
    },
    {
        "code": "DHA 8263",
        "subject": "DHA",
        "id": "8263",
        "title": "Contemporary Themes",
        "info": "Current conceptualizations and thematic areas in literature of textiles and apparel.",
        "prereq": []
    },
    {
        "code": "DHA 8265",
        "subject": "DHA",
        "id": "8265",
        "title": "Dr Race Class Gend",
        "info": "Dressing the body as a sociocultural and personal expression of an individual's identity. Gender, race, and class differences in apparel explored to understand the global market, international and niche retailing, as related to clothing practices.",
        "prereq": []
    }
]