[{"code":"ECP 5220","subject":"ECP","id":"5220","title":"Reg Issues in Drug Research","info":"Regulatory issues encountered in conducting drug research trials. Performing different aspects of clinical trials.  Lectures, readings, small group discussions, homework assignments.\n\nprereq: ECP grad student or Pharm.D. professional student or instr consent","prereq":[]},{"code":"ECP 5290","subject":"ECP","id":"5290","title":"Clinical Clerkship","info":"Supervised study of pharmaceutical services at University of Minnesota Medical Center, Fairview or affiliated institutions.\n\nprereq: Grad experimental and clinical pharmacology","prereq":[]},{"code":"ECP 5620","subject":"ECP","id":"5620","title":"Drug Metabolism and Disp","info":"Oxidatative/conjugative enzymes systems involved in human drug metabolism/disposition. Various in vitro models used to evaluate drug metabolism or chemical entity, pros/cons of each. Factors involved in conducting in vivo studies. Components used to predict in vivo drug disposition from in vivo studies.\n\nprereq: Grad student or instr consent","prereq":[]},{"code":"ECP 5982","subject":"ECP","id":"5982","title":"Journal Club Transltnl Rsrch","info":"This course is structured as an inter-institutional journal club between universities of Minnesota, Pittsburgh, and Kentucky that is focused on translational research in clinical pharmacology. Articles will be discussed on topics such as precision medicine, pharmacokinetics, pharmacometrics, pharmacogenomics, and clinical biomarkers.","prereq":[]},{"code":"ECP 5983","subject":"ECP","id":"5983","title":"Sci Comm Exprmntl Clncl Pharm","info":"Introduction of professional development concepts in written and oral scientific communication through lectures, literature readings, and class participation.","prereq":[]},{"code":"ECP 5984","subject":"ECP","id":"5984","title":"Sci Comm Exp Clncl Pharm II","info":"Dissemination of advanced professional development concepts in written and oral scientific communication through lectures, literature readings, and class participation.","prereq":[]},{"code":"ECP 5993","subject":"ECP","id":"5993","title":"Directed Study: ECP","info":"Student working with faculty member designs a directed study course, including a complete syllabus, appropriate time commitment, and workload for number of credits.","prereq":[]},{"code":"ECP 5994","subject":"ECP","id":"5994","title":"Directed Research: ECP","info":"Student works with faculty adviser to design a scientific research project.  ","prereq":[]},{"code":"ECP 8100","subject":"ECP","id":"8100","title":"Seminar","info":"Selected topics in experimental/clinical pharmacology.\n\nprereq: ECP grad student or instr consent","prereq":[]},{"code":"ECP 8200","subject":"ECP","id":"8200","title":"Research Problems","info":"Individually designed research experience directed at contemporary problems related to drug use.\n\nprereq: Grad SACP major (ECP Track) or instr consent","prereq":[]},{"code":"ECP 8210","subject":"ECP","id":"8210","title":"Clin Ther","info":"Topics in clinical pharmacology that illustrate continuum of pathophysiology of a disease state, its contemporary treatment, problems or controversial issues with treatment approaches, strategies to advance therapy. Lectures, readings.\n\nprereq: SACP grad major in ECP track or instr consent","prereq":[]},{"code":"ECP 8220","subject":"ECP","id":"8220","title":"Exper Clin Pcol","info":"Theory of advanced methodologies, applications, and evaluation techniques used to determine efficacy/toxicity of new drug therapies. Techniques for collecting/evaluating data.\n\nprereq: SACP grad major (ECP track) or instr consent","prereq":[]},{"code":"ECP 8230","subject":"ECP","id":"8230","title":"Principles of Clin Pharm","info":"Factors determining drug exposure, drug-receptor pharmacology, drug response. Personalized medicine including drug interactions, obesity, age (geriatrics/pediatrics), critical illness, therapeutic evaluation, drug development.\n\nprereq: Grad student in Experimental and Clinical Pharmacology or instr consent","prereq":[]},{"code":"ECP 8290","subject":"ECP","id":"8290","title":"Clinical Clerkship","info":"Supervised study of pharmaceutical services at Fairview-University Medical Center or affiliated institutions.\n\nprereq: Grad SACP major in ECP track or instr consent","prereq":[]},{"code":"ECP 8333","subject":"ECP","id":"8333","title":"FTE: Master's","info":"FTE: master's.\nPrereq-Master's student, adviser and DGS consent.","prereq":[]},{"code":"ECP 8444","subject":"ECP","id":"8444","title":"FTE: Doctoral","info":"FTE: doctoral.\nPrereq-Doctoral student, adviser and DGS consent.","prereq":[]},{"code":"ECP 8500","subject":"ECP","id":"8500","title":"Advanced Pharmacometrics","info":"Modeling/simulation at interface between physiological/pharmacological processes. Current literature, discussion groups. Computer applications using relevant software programs.\n\nprereq: Grad student in ECP or PHM or instr consent","prereq":[]},{"code":"ECP 8501","subject":"ECP","id":"8501","title":"Pharmacometrics","info":"Theory/application of contemporary methods for analysis of concentration-time data and exposure-response relationships.\n\nprereq: ECP grad major or PHM grad major or instr consent","prereq":[]},{"code":"ECP 8502","subject":"ECP","id":"8502","title":"Population Pharmacokinetics","info":"Theoretical background for using mixed effects model in population analysis. Building fixed/random effects into a pharmacostatistical model.  Project allows students to become familiar with a contemporary population pharmacokinetic analysis program.","prereq":[]},{"code":"ECP 8503","subject":"ECP","id":"8503","title":"Intermediate Pop PK/PD","info":"This course will present the theory and hands-on application of intermediate population methods using nonlinear mixed-effects model applied to pharmacologic systems.","prereq":[]},{"code":"ECP 8504","subject":"ECP","id":"8504","title":"Modeling Biologics","info":"This course will develop computer skills to apply nonlinear regression models to describe the pharmacokinetics and pharmacodynamics of biologics.  \n\nprereq: A course in basic pharmacokinetics; enrollment in the Experimental & Clinical Pharmacology or Pharmaceutics graduate program, or instructor consent\n","prereq":[]},{"code":"ECP 8505","subject":"ECP","id":"8505","title":"Applied PBPK modeling","info":"Theory/implementation of contemporary methods for analysis and simulation of PBPK to support model-informed drug development.\n\n","prereq":[]},{"code":"ECP 8506","subject":"ECP","id":"8506","title":"Clinical Trial Simulation","info":"Theory/application of contemporary methods of using simulations to design more efficient/informative clinical trials.\n\nprereq: ECP grad or instr consent","prereq":[]},{"code":"ECP 8610","subject":"ECP","id":"8610","title":"Pharmacoepidemiology","info":"Application of epidemiologic principles to study use of and beneficial/adverse outcomes of drugs in human populations.","prereq":[]},{"code":"ECP 8666","subject":"ECP","id":"8666","title":"Doct Pre-Thesis Cr*","info":"Doctoral pre-thesis credits.\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr","prereq":[]},{"code":"ECP 8776","subject":"ECP","id":"8776","title":"Project Credit: Mast. Plan B","info":"Project credits: master's Plan B\n\nprereq: Max 18 cr per semester or summer; 10 cr total required (Plan B only)","prereq":[]},{"code":"ECP 8777","subject":"ECP","id":"8777","title":"Thesis Credit:Mast*","info":"Thesis credits: master's.\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]","prereq":[]},{"code":"ECP 8888","subject":"ECP","id":"8888","title":"Thesis Credit:Doct*","info":"Thesis credit: doctoral.\n\nprereq: Max 18 cr per semester or summer; 24 cr required","prereq":[]},{"code":"ECP 8900","subject":"ECP","id":"8900","title":"Advanced Topics: ECP","info":"Topic varies depending on faculty teaching course.\n\nprereq: ECP grad program or instr consent","prereq":[]},{"code":"ECP 8940","subject":"ECP","id":"8940","title":"Adv Topics: Regulatory Science","info":"This course will introduce students to the roles and responsibilities of key partners in ensuring regulatory compliance in a variety of settings. It will cover animal and human research as well as drug development. Speakers will delve into how research and development regulations are communicated, applied, and enforced in both academic Institutions and in Industry settings. The goal of this course is to provide an overview of how regulations shape key roles and enlighten students as to potential career paths in the field of regulatory science.","prereq":[]},{"code":"ECP 8982","subject":"ECP","id":"8982","title":"Journal Club Transltnl Rsrch","info":"This course is structured as an inter-institutional journal club between universities of Minnesota, Pittsburgh, and Kentucky that is focused on translational research in clinical pharmacology. Articles will be discussed on topics such as precision medicine, pharmacokinetics, pharmacometrics, pharmacogenomics, and clinical biomarkers.","prereq":[]},{"code":"ECP 8983","subject":"ECP","id":"8983","title":"Sci Comm Exprmntl Clncl Pharm","info":"Introduction of professional development concepts in written and oral scientific communication through lectures, literature readings, and class participation.","prereq":[]},{"code":"ECP 8984","subject":"ECP","id":"8984","title":"Interpersonal Communications","info":"The course emphasizes on developing basic skills for critical evaluation of scientific communication and provides opportunities for practicing these principles. The objectives of the course are to 1) Provide a systematic review of the principles and practice of the various modes and forms of scientific communication including scientific papers, technical reports, presentations, and proposal writing and 2) Identify the different objectives of these communication modes, and understand key steps and ingredients for effective scientific communication.","prereq":[]},{"code":"ECP 8992","subject":"ECP","id":"8992","title":"Directed Readings: ECP","info":"tbd ","prereq":[]},{"code":"ECP 8993","subject":"ECP","id":"8993","title":"Directed Study: ECP","info":"","prereq":[]},{"code":"ECP 8994","subject":"ECP","id":"8994","title":"Directed Research: ECP","info":"Directed research in experimental and clinical pharmacology.\n\nprereq: [Grad ECP, adviser, DGS] consent","prereq":[]}]