[
  {
    "code": "EDHD 1051",
    "subject": "EDHD",
    "id": "1051",
    "title": "Editing for Writers",
    "info": "Editing one's own writing. Linguistic features of standard written English. Styles/language utilized in academic writing.  Small-group activities, individual/peer conferencing.",
    "prereq": []
  },
  {
    "code": "EDHD 1525W",
    "subject": "EDHD",
    "id": "1525W",
    "title": "CEHD First Year Experience",
    "info": "Writing intensive multidisciplinary approach to addressing the common question, \\\"How can one person make a difference?\\\" Students read a common book/work collaboratively to produce a final project. Active learning strategies to develop students' skills in critical reading, thinking, and writing.",
    "prereq": []
  },
  {
    "code": "EDHD 1620",
    "subject": "EDHD",
    "id": "1620",
    "title": "Current Topics",
    "info": "For topics see Class Schedule.\n",
    "prereq": []
  },
  {
    "code": "EDHD 1701",
    "subject": "EDHD",
    "id": "1701",
    "title": "Identity, Culture, and Success",
    "info": "How culture/identity play role in educational experience. Self-authorship skills to create educational/personal path that aligns with values/beliefs. Lecture, discussion, readings, activities.\n\nprereq: TRIO or PES student",
    "prereq": []
  },
  {
    "code": "EDHD 1901",
    "subject": "EDHD",
    "id": "1901",
    "title": "Freshman Seminar, Environment",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1902",
    "subject": "EDHD",
    "id": "1902",
    "title": "Freshmn Sem,Cultural Diversity",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1903",
    "subject": "EDHD",
    "id": "1903",
    "title": "FreshmanSeminar,Ctznshp/PubEth",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1904",
    "subject": "EDHD",
    "id": "1904",
    "title": "Globalizing Curriculum",
    "info": "EDHD 1904 is designed to engage domestic and international students in the multiple ways of thinking and doing for the expressed purpose of infusing a global perspective in their undergraduate education. Students will virtually engage with undergraduate students in Russia and China exploring what it means to be a student and adult participant on the world stage. Student will have exposure and experiences with international students, international student organizations, service learning, Collaborative Online International Learning (COIL), Massive Open Online Courses (MOOCs), Internationalization at Home (IaH), Study Abroad, and other  international-based research, learning, or extracurricular processes and opportunities. This course will prepare students to embrace intercultural competency and its impact on self-awareness, social settings, course work, research projects, and career choices. \n\n",
    "prereq": []
  },
  {
    "code": "EDHD 1905",
    "subject": "EDHD",
    "id": "1905",
    "title": "Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1906W",
    "subject": "EDHD",
    "id": "1906W",
    "title": "FreshmanSeminar, Environmnt/WI",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1907W",
    "subject": "EDHD",
    "id": "1907W",
    "title": "FreshmanSem,CulturalDivrsty/WI",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1908W",
    "subject": "EDHD",
    "id": "1908W",
    "title": "FreshmanSem,Citznshp/PubEth/WI",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1909W",
    "subject": "EDHD",
    "id": "1909W",
    "title": "Galileo on Trial in Italy",
    "info": "Galileo risked his career, his freedom, and even his life for science. In this Freshman Seminar Abroad, we will learn about Galileo, the conflicts he faced, and how his discoveries forever changed the world. Over spring break, we will travel to Italy. We'll visit Pisa, home of Galileo, and climb the Leaning Tower of Pisa. We'll explore the city of Florence and see one of Galileo's first telescopes. In Rome, we will visit such places as the Vatican and the Church of Santa Maria sopra Minerva, which provided the backdrop to the end of Galileo's brilliant career. While on campus, we will learn about 17th century Italy and re-enact the Trial of Galileo through debate and discussion.  ",
    "prereq": []
  },
  {
    "code": "EDHD 1910W",
    "subject": "EDHD",
    "id": "1910W",
    "title": "Freshman Sem, Writing Intensiv",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1920",
    "subject": "EDHD",
    "id": "1920",
    "title": "CEHD Special Topics",
    "info": "For topics, see Class Schedule.",
    "prereq": []
  },
  {
    "code": "EDHD 1921",
    "subject": "EDHD",
    "id": "1921",
    "title": "America Reads",
    "info": "America Reads: Literacy Support, Mentorship & Academic Achievement is a service-learning course specifically designed for UMN undergraduates that tutor and mentor children in literacy skill development. Literacy mentors will add dozens of research based literacy strategies to their tutoring repertoire through study, observation, application and reflection that can be referenced and implemented to support their current and future mentees in reading, writing, speaking & listening. Students are required to meet for 6 2.5 -hour class sessions and complete corresponding assignments that reflect the course concepts and how they apply to tutoring children in our communities.",
    "prereq": []
  },
  {
    "code": "EDHD 2701",
    "subject": "EDHD",
    "id": "2701",
    "title": "Identity, Culture, & Career",
    "info": "One of the biggest challenges for any college student is choosing a major and career! Making decisions about your major and future career can be overwhelming, confusing, and intimidating. Students often wonder, \\\"What is the right major/career for me? How do I know my options? What steps do I need to take to reach my career goals? Who can I go to for help?\\\"\n\nIn this course you'll develop a clearer sense of self and create greater awareness of your multiple identities and how they influence your career decision-making and future success. You'll also learn the importance of social and cultural capital and how to build the capital needed to move forward in your career journey.\n\nThrough community building, storytelling, reflection, readings, lecture, discussion, in-class activities and projects, you'll be empowered to define career success through your own lived experiences and cultural lenses, gain confidence in your career decision-making abilities, and author your own career journey.",
    "prereq": []
  },
  {
    "code": "EDHD 3100",
    "subject": "EDHD",
    "id": "3100",
    "title": "International Topics-Undergrad",
    "info": "Off-campus course. Topics from research exploration to academic/engagement activities. Delivered in international setting. Course requirements are determined by instructor(s) and reflect advanced undergraduate rigor.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "EDHD 3161",
    "subject": "EDHD",
    "id": "3161",
    "title": "Great Minds of the Renaissance",
    "info": "The Great Minds of the Renaissance course focuses on the development of scientific thought and the great minds behind those ideas; it delves into the intersection of scientific ideas with art, culture, religion, politics, etc. In doing so, it also covers a wide range of general or liberal education objectives.",
    "prereq": []
  },
  {
    "code": "EDHD 3300",
    "subject": "EDHD",
    "id": "3300",
    "title": "Special Topics: Ed & Human Dev",
    "info": "Special topics in education/human development.",
    "prereq": []
  },
  {
    "code": "EDHD 3301",
    "subject": "EDHD",
    "id": "3301",
    "title": "SupPersDevRelatDisaCommHumSvc",
    "info": "Provision of community, residential, employment, recreational, and other support services to adults with disabilities and their families. What developmental disabilities are, how they daily affect the lives of people with disabilities and their families. Types of services/support available.",
    "prereq": []
  },
  {
    "code": "EDHD 4093",
    "subject": "EDHD",
    "id": "4093",
    "title": "Directed Study",
    "info": "Student-initiated project in consultation with faculty member. Student determines topic, sets goals, designs a course of study, and finds an appropriate faculty member to work with collaboratively.\n\nprereq: Instructor consent.",
    "prereq": []
  },
  {
    "code": "EDHD 4301",
    "subject": "EDHD",
    "id": "4301",
    "title": "PerSupervMgmtCommHumSvc",
    "info": "Effective recruitment, retention, and training interventions to use with personnel in community human service settings. Students assess recruitment/retention challenges in an existing organization, experience realistic community human-service scenarios, and develop an organizational intervention plan.",
    "prereq": []
  },
  {
    "code": "EDHD 5003",
    "subject": "EDHD",
    "id": "5003",
    "title": "Devel & Indiv Diff",
    "info": "Overview of developmental/individual differences of children/adolescents in educational contexts. Emphasizes behavioral biology, dynamic systems, and ecological perception.",
    "prereq": []
  },
  {
    "code": "EDHD 5004",
    "subject": "EDHD",
    "id": "5004",
    "title": "Teach Special Needs Students",
    "info": "Exceptionalities in educational settings as defined in federal/state rules/regulations. Historical perspectives, definitions, etiology, needs, characteristics. Service delivery systems for each exceptionality.\n\nprereq: Teacher preparation program in [CEHD or music education or agriculture education or DirecTrack] or instr consent; licensure students must take this course for a grade",
    "prereq": []
  },
  {
    "code": "EDHD 5100",
    "subject": "EDHD",
    "id": "5100",
    "title": "International Topics-Grad",
    "info": "Off-campus course. Topics from research exploration to academic/engagement activities. Delivered in international setting.Course requirements are determined by instructor(s) and reflect graduate-level rigor.",
    "prereq": []
  },
  {
    "code": "EDHD 5200",
    "subject": "EDHD",
    "id": "5200",
    "title": "Prof Dev for Educators",
    "info": "Special topics course that permits offering a variety of research-based and scholarly content to meet the needs of educators from P-12 settings.",
    "prereq": []
  },
  {
    "code": "EDHD 5300",
    "subject": "EDHD",
    "id": "5300",
    "title": "Special Topics: Ed & Human Dev",
    "info": "Special topics in education and human development. \n\n",
    "prereq": []
  },
  {
    "code": "EDHD 8300",
    "subject": "EDHD",
    "id": "8300",
    "title": "Special Topics: Ed & Human Dev",
    "info": "Special topics in education and human development.",
    "prereq": []
  }
]