[
  {
    "code": "EDPA 5064",
    "subject": "EDPA",
    "id": "5064",
    "title": "Divergent Prspectvs-EdPol&Prac",
    "info": "Examines fundamental and current issues in the field of education.  Participants learn how to approach an issue from multiple perspectives, develop skills to identify and analyze its component parts, and examine personal belief systems to place a given issue within a personal context.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "EDPA 5070",
    "subject": "EDPA",
    "id": "5070",
    "title": "Special Topics: Sch Leadership",
    "info": "Skills/knowledge necessary to respond to multiple challenges of reduced budgets, increased accountability requirements, and growing concerns about impact of technology investments in education.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "EDPA 5101",
    "subject": "EDPA",
    "id": "5101",
    "title": "International Educ & Develpmnt",
    "info": "Introduction to comparative and international development education, contemporary theories regarding the role of education in the economic, political, and sociocultural development of nations; examination of central topics and critical issues in the field. \n",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "EDPA 5305",
    "subject": "EDPA",
    "id": "5305",
    "title": "Ldrshp & Vision in School Tech",
    "info": "How to create a shared vision for comprehensive integration of technology into educational environments. Ways to foster environment/culture conducive to realizing that vision.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "EDPA 5309",
    "subject": "EDPA",
    "id": "5309",
    "title": "Elec Comm Tools Envron Schools",
    "info": "Various electronic communication channels, information environments to facilitate educational organizations' operations/communication. Focuses on networked environments, integration with handheld computers, and outreach to internal/external stakeholders.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "EDPA 5352",
    "subject": "EDPA",
    "id": "5352",
    "title": "ProjectiveLdrshp-StratLrngComm",
    "info": "Explores many trends and changes facing society, culture, and education from a strategic learning community perspective; helps students \\\"futurize the present.\\\"",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "EDPA 5376",
    "subject": "EDPA",
    "id": "5376",
    "title": "Org Approaches to Youth Dev",
    "info": "Defining youth development within framework of formal and informal organizations; organizational systems responsible for youth development in the community; policy issues surrounding these systems.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "EDPA 5378",
    "subject": "EDPA",
    "id": "5378",
    "title": "Experiential Lrning:Theory&Pra",
    "info": "Theory/practice of learning by doing. Educator's personal engagement in process. Technical, motivational, and evaluative aspects.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "EDPA 5384",
    "subject": "EDPA",
    "id": "5384",
    "title": "Collab Heterogeneous Schools",
    "info": "Policy, research, practice base for addressing range of student abilities/backgrounds in diverse schools. Collaborative approaches to curricular, instructional, social support.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  }
]