[
    {
        "code": "EHS 2999",
        "subject": "EHS",
        "id": "2999",
        "title": "Certification Credit",
        "info": "Evaluation of credits earned for certification",
        "prereq": []
    },
    {
        "code": "EHS 3112",
        "subject": "EHS",
        "id": "3112",
        "title": "First Responder: Coach/Trainer",
        "info": "Critical thinking skills in emergency settings. Patient assessment, airway management, CPR, splinting, spinal immobilization. Certifications: AHA-BLS, First Responder.",
        "prereq": []
    },
    {
        "code": "EHS 3312",
        "subject": "EHS",
        "id": "3312",
        "title": "Emergency Medical Technician",
        "info": "Foundation for basic life support treatment of medical/trauma patients. Patient assessment, airway management, AHA BLS, mass casualty/bioterrorism response, critical thinking, decision making. Meets USDOT standards for Emergency Medical Technician (EMT).",
        "prereq": []
    },
    {
        "code": "EHS 3999",
        "subject": "EHS",
        "id": "3999",
        "title": "Special Exam",
        "info": "Special exam.",
        "prereq": []
    },
    {
        "code": "EHS 4011",
        "subject": "EHS",
        "id": "4011",
        "title": "Concepts Emergency Health Svc",
        "info": "Emergency medical system (EMS). Its impact on all aspects of U.S. culture. Basic practices generalized across systems. Comprehensive review of components required for effective EMS. Historical perspective, medical-legal concerns, medical oversight, accountability, scope of practice, communications/transportation, rural vs. urban issues, disaster management.",
        "prereq": []
    },
    {
        "code": "EHS 4021",
        "subject": "EHS",
        "id": "4021",
        "title": "EMS Planning/Fiscal Mgmt",
        "info": "Fundamentals of planning, fiscal, and process management as related to emergency medical systems (EMS). Regulatory requirements, EMS delivery models, contract negotiations, budgeting, scenario planning.",
        "prereq": []
    },
    {
        "code": "EHS 4999",
        "subject": "EHS",
        "id": "4999",
        "title": "Practicum",
        "info": "Project in student's employing organization or project in organization providing internship or integration of projects from previous coursework or development of program-related project.",
        "prereq": []
    },
    {
        "code": "EHS 5031",
        "subject": "EHS",
        "id": "5031",
        "title": "Basic Prin of Research",
        "info": "Basic principles of research in emergency health services.",
        "prereq": []
    }
]