[{"code":"FM 5001","subject":"FM","id":"5001","title":"Preparation Financial  Math I","info":"Mathematics needed for MFM program.\n\nprereq: Grad MFM major or MFM program director approval","prereq":[]},{"code":"FM 5002","subject":"FM","id":"5002","title":"Preparation Financial Math II","info":"Mathematics needed for MFM program.\n\nprereq: 5001, program director approval","prereq":{"code":"FM 5001","subject":"FM","id":"5001"}},{"code":"FM 5011","subject":"FM","id":"5011","title":"Math background for Finance I","info":"Mathematics needed for MFM program. Focuses on finance.\n\nprereq: [5001, 5002] with grade of at least B or [MFM program director approval, grad MFM major]","prereq":[]},{"code":"FM 5012","subject":"FM","id":"5012","title":"Math Background for Finance II","info":"Mathematics needed for MFM program. Focuses on finance.\n\nprereq: 5011, grad MFM major, program director approval","prereq":{"code":"FM 5011","subject":"FM","id":"5011"}},{"code":"FM 5021","subject":"FM","id":"5021","title":"Math Theory Applied Finance I","info":"Bridge between theory and application.\n\nprereq: [5011 or concurrent registration is required (or allowed) in 5011], grad MFM major, program director approval","prereq":{"or":[{"code":"FM 5011","subject":"FM","id":"5011"},{"code":"FM 5011","subject":"FM","id":"5011"}]}},{"code":"FM 5022","subject":"FM","id":"5022","title":"Math Theory Applied Finance II","info":"Bridge between theory and application.\n\nprereq: 5021, [5012 or concurrent registration is required (or allowed) in 5012], grad MFM major, program director approval","prereq":{"and":[{"code":"FM 5021","subject":"FM","id":"5021"},{"code":"FM 5012","subject":"FM","id":"5012"},{"code":"FM 5012","subject":"FM","id":"5012"}]}},{"code":"FM 5031","subject":"FM","id":"5031","title":"Practitioner's Finance I","info":"Practical course taught by industry professionals. Focuses on hands-on real-world problem solving.\n\nprereq: [5021 or concurrent registration is required (or allowed) in 5021], grad MFM major, program director approval","prereq":{"or":[{"code":"FM 5021","subject":"FM","id":"5021"},{"code":"FM 5021","subject":"FM","id":"5021"}]}},{"code":"FM 5032","subject":"FM","id":"5032","title":"Practitioner's Finance II","info":"Taught by industry professionals. Focuses on hands-on real-world problem solving.\n\nprereq: 5031, [5022 or concurrent registration is required (or allowed) in 5022], grad MFM major, program director approval","prereq":{"and":[{"code":"FM 5031","subject":"FM","id":"5031"},{"code":"FM 5022","subject":"FM","id":"5022"},{"code":"FM 5022","subject":"FM","id":"5022"}]}},{"code":"FM 5091","subject":"FM","id":"5091","title":"Computation in Finance I","info":"Implements popular finance models and numerical techniques using mainstream computational tools/languages.\n\nprereq: Grad MFM major, program director approval","prereq":[]},{"code":"FM 5092","subject":"FM","id":"5092","title":"Computation in Finance II","info":"Implements popular finance models and numerical techniques using mainstream computational tools/languages.\n\nprereq: 5091, grad MFM major, program director approval","prereq":{"code":"FM 5091","subject":"FM","id":"5091"}},{"code":"FM 5101","subject":"FM","id":"5101","title":"Current Events in Finance","info":"This seminar course focuses on gathering current information and analyzing the effect of local and global happenings on the behavior of the financial markets. Students will use concepts from other courses to interpret weekly market events and present to the class. ","prereq":[]},{"code":"FM 5111","subject":"FM","id":"5111","title":"Intro to Financial Markets","info":"This course is a survey of important elements of financial markets and setting the context to the program. Topics include Complete vs incomplete markets, financial institutions, traded instruments, elements of accounting, arbitrage, Fundamental Theorem of Asset Pricing, Credit, Investment and Risk Management.","prereq":[]},{"code":"FM 5121","subject":"FM","id":"5121","title":"Mathematics for Finance","info":"This course establishes the mathematical foundation needed for modeling in finance, with focus on probability and statistics, stochastic processes, linear algebra, and more.","prereq":[]},{"code":"FM 5151","subject":"FM","id":"5151","title":"Financial Modeling I: Python","info":"This course establishes the basic principles of Financial Modeling.  Topics include different kinds of models (e.g. descriptive vs explanatory, statistical vs structural, etc.), foundational models used in finance (binomial, lognormal, Gaussian, etc.) and their applications (stocks, interest rates, commodities, etc.).  Python will be used extensively to illustrate the models,  therefore this course also serves as an introduction to the use of Python in finance.","prereq":[]},{"code":"FM 5202","subject":"FM","id":"5202","title":"Ethics in Finance","info":"This Seminar is formatted as a case study, focusing on financial law, regulation and ethics. Students will analyze various financial decision and discuss cases that exhibit ethical challenges, such as conflict of interests. Discussion will be conducted in small groups and summarized as a presentation to the whole group.","prereq":[]},{"code":"FM 5212","subject":"FM","id":"5212","title":"Continuous Time Finance","info":"A course on Stochastic Calculus - based modeling in finance, focusing on the Black-Scholes model and its extensions.","prereq":[]},{"code":"FM 5222","subject":"FM","id":"5222","title":"Statistical Methods in Finance","info":"A course on Statistical methods used in the analysis of financial markets data. It will cover topics such as, Bayesian Statistics, Linear and Non-Linear Regression, Markov Chain Monte Carlo, Copulas and Time-series Analysis, and their applications to financial data.","prereq":[]},{"code":"FM 5252","subject":"FM","id":"5252","title":"Financial Modeling II","info":"This course focuses on Monte Carlo simulations and elements of scientific computing as tools in modeling. These methods will be used as a key technique to develop and assess models, and considerable time will be spent on the interpretation of model outputs.","prereq":[]},{"code":"FM 5323","subject":"FM","id":"5323","title":"DS and ML in Finance","info":"This course introduces the basic principles underlying Data Science and Machine Learning, focusing on their applications in finance. Topics include: understanding data, EDA, various types of Machine Learning problems (e.g. classification, regression, recommendation, etc.), various algorithmic approaches (GLMs, Trees, Neural Networks, etc.), model selection, limitations of ML models, and issues in their implementations.","prereq":[]},{"code":"FM 5343","subject":"FM","id":"5343","title":"Quantitative Risk Management","info":"Topics include: Taxonomies of Risk, Measures of Risk, Risk Modeling and Risk Mitigation strategies. Additionally, the role and purpose of Risk Management will be discussed.","prereq":[]},{"code":"FM 5353","subject":"FM","id":"5353","title":"Software Dvlp in Finance","info":"This class introduces the toolset of a compiled language and principles of object-oriented programming.  Databases are introduced and data models related to finance applications are explored.  Projects are sourced from applied finance problems and are implemented with a focus on performance and common practices in professional software development.","prereq":[]},{"code":"FM 5411","subject":"FM","id":"5411","title":"Fixed Income","info":"This elective on fixed income markets expands on the basic concepts in the core  curriculum and provides students a deeper understanding of this market through a hands-on approach.","prereq":[]},{"code":"FM 5422","subject":"FM","id":"5422","title":"Quant Hedge Fund Strategies","info":"A practical course exposing students to a variety of trading strategies used in Hedge Funds. ","prereq":[]},{"code":"FM 5432","subject":"FM","id":"5432","title":"Portfolio Optimization","info":"This elective’s focus is on optimization techniques through the development of an appropriate mathematical framework as well as their applications in portfolio management. The course will have a particular emphasis in convex optimization and practical pitfalls in application.  Students will solve both mathematical problems in the area as well as implement solutions with real market data.  The elective will conclude with a group project where students will work with market data and analyze implementations of drawdown and conditional value-at-risk optimizations with equity returns under turnover constraints.","prereq":[]},{"code":"FM 5443","subject":"FM","id":"5443","title":"Credit Risk Models","info":"This course focuses on basic kinds of credit models (structural, intensity, etc.), and their applications. Both individual credit and portfolio level approaches will be considered.","prereq":[]},{"code":"FM 5462","subject":"FM","id":"5462","title":"Market Microstructure","info":"This course focuses on the stylized facts in market microstructure and its application in algorithmic trading. In order to deal with the vast amount of real time streaming data in algorithmic trading, students will learn how to use KDB+ (a time series database) and its language q (a vectorized functional language).","prereq":[]},{"code":"FM 5990","subject":"FM","id":"5990","title":"Topics in Financial Math","info":"The course will focus on a special topic in quantitative finance that supplements the regular curriculum of the Master of Financial Mathematics program. The course features experts, often finance industry practitioners, who share their experience and knowledge.\n\nprereq: enrolled in the Master of Financial Mathematics program or instr consent","prereq":[]},{"code":"FM 5993","subject":"FM","id":"5993","title":"Directed Study (Fin. Math)","info":"A course in which a student is conducting a directed study or a research project under the direction of a faculty member / program instructor. Can be repeated.","prereq":[]},{"code":"FM 5996","subject":"FM","id":"5996","title":"Internship","info":"Financial Mathematics curriculum related Internship. Can be repeated.","prereq":[]}]