[
  {
    "code": "FR 3105",
    "subject": "FR",
    "id": "3105",
    "title": "Forest EcoSyst Health & Mgmt",
    "info": "Agents/processes affecting tree/forest health. Insects, diseases, wildlife, wildfire, windstorms, invasive species, atmospheric change, soil/water pollution, human development.  Principles of forest ecosystem health/management applied to areas ranging from wilderness to urban forest and from local to global in scope.",
    "prereq": []
  },
  {
    "code": "FR 3550",
    "subject": "FR",
    "id": "3550",
    "title": "Off-Campus Study",
    "info": "",
    "prereq": []
  },
  {
    "code": "FR 3601",
    "subject": "FR",
    "id": "3601",
    "title": "Elements of Surveying",
    "info": "Basic concepts of elementary plane surveying for use in natural resource assessment. Includes measurements of distance, elevation, angle, and direction using transits, levels, total stations, and GPS equipment. Elements of coordinate systems, datum planes, maps.",
    "prereq": []
  },
  {
    "code": "FR 3612",
    "subject": "FR",
    "id": "3612",
    "title": "Silvi&Timbr Hrvstg Pracs in MN",
    "info": "Silviculture practices as driven by landowner objectives. Compares/contrasts silvicultural practices employed by county, state, federal, and industrial foresters in Minnesota.",
    "prereq": []
  },
  {
    "code": "FR 4118",
    "subject": "FR",
    "id": "4118",
    "title": "Trees: structure and function",
    "info": "Plant-water relations. Relations of biology to ecology/management. How physiological factors affect ecological processes and management decisions.",
    "prereq": []
  },
  {
    "code": "FR 4461",
    "subject": "FR",
    "id": "4461",
    "title": "Int'l Water Quality",
    "info": "Active learning approaches are used to understand how culture drives water quality management and how and why that management varies among countries. Become familiar with multinational river basin compacts and policies for international management.",
    "prereq": []
  },
  {
    "code": "FR 4894",
    "subject": "FR",
    "id": "4894",
    "title": "Directed Research",
    "info": "Research project on topic of personal intrest under guidance of faculty mentor.  Initial proposal.  Reports.",
    "prereq": []
  },
  {
    "code": "FR 5105",
    "subject": "FR",
    "id": "5105",
    "title": "Forest EcoSyst Health & Mgmt",
    "info": "Principles of forest ecosystem health and its management applied to areas ranging from wilderness to urban forest, and from local to global.",
    "prereq": []
  },
  {
    "code": "FR 5118",
    "subject": "FR",
    "id": "5118",
    "title": "Trees: structure and function",
    "info": "Plant-water relations. Relations of biology to ecology and management. How physiological factors affect ecological processes and management decisions.",
    "prereq": []
  },
  {
    "code": "FR 5142",
    "subject": "FR",
    "id": "5142",
    "title": "Tropical Forest Ecology",
    "info": "Ecological principles related to form, function, and development of wet/dry tropical forests at organismal, community, and ecosystem scales.  Ecophysiology, succession, productivity, biodiversity, sustainability, agroforestry, social forestry, and management alternatives. Natural distribution of forest types. Causes, consequences, and extent of deforestation.",
    "prereq": []
  },
  {
    "code": "FR 5259",
    "subject": "FR",
    "id": "5259",
    "title": "Visitor Behavior Analysis",
    "info": "Application of social science theory/methods to recreation and resource-based tourism visitor behavior. Culture and cultural identity. Influences on behavior. Mitigating environmental impacts. Theory/analysis of surveys, observation, and content. Implications for sustainable resource management.",
    "prereq": []
  },
  {
    "code": "FR 5403",
    "subject": "FR",
    "id": "5403",
    "title": "Teaching About Natural Resourc",
    "info": "Forest community, tools used by natural resource managers, management practices. Natural-resource-related indoor/outdoor activities that can be translated for classroom use. One intensive weekend required.",
    "prereq": []
  },
  {
    "code": "FR 5612",
    "subject": "FR",
    "id": "5612",
    "title": "Silvi&Timbr Hrvstg Pracs in MN",
    "info": "Silviculture practices as driven by landowner objectives. Compares/contrasts silvicultural practices employed by county, state, federal, and industrial foresters in Minnesota.",
    "prereq": []
  },
  {
    "code": "FR 5700",
    "subject": "FR",
    "id": "5700",
    "title": "Colloquium in Natural Resource",
    "info": "Colloquium in specialized topics in natural resources.",
    "prereq": []
  },
  {
    "code": "FR 8112",
    "subject": "FR",
    "id": "8112",
    "title": "Res Prob:Physiological Ecology",
    "info": "Interaction between plants and their environment. Focuses on mechanisms that affect whole plant, community, and ecosystem processes.",
    "prereq": []
  }
]