[
  {
    "code": "FW 1001",
    "subject": "FW",
    "id": "1001",
    "title": "Orientation in FWCB",
    "info": "Survey of technical requirements and education needed for careers in fisheries, wildlife, and conservation biology. Introduction to fields of work, problems, career opportunities. \n\nPrerequisite: FWCB major or instructor permission.",
    "prereq": []
  },
  {
    "code": "FW 1002",
    "subject": "FW",
    "id": "1002",
    "title": "Wldlf:Ecol,Values,Human Impact",
    "info": "Controversial issues involving specific wildlife management principles/techniques.",
    "prereq": []
  },
  {
    "code": "FW 1901",
    "subject": "FW",
    "id": "1901",
    "title": "Coral Reef Management: Belize",
    "info": "In this seminar, we will examine the management of reef environments through experiential education and field work and learn about the importance of reefs, the influences that endanger reef ecosystems, and community action plans that are working to manage reef health. Over spring break, we will travel as a class to to the Mesoamerican Reef in Belize to snorkel and experience the reef and conservation planning first-hand. An ability to swim is required.",
    "prereq": []
  },
  {
    "code": "FW 1902",
    "subject": "FW",
    "id": "1902",
    "title": "Machu Picchu & the Inca Trail",
    "info": "Our investigation of heritage begins with broad conversations like natural versus cultural and how we approach big societal decisions like designating and managing heritage. We discuss the roles of science and human dimensions, as well as the roles of Traditional Ecological knowledge and local knowledge in our approaches to heritage. The overall goal of our class is to help you integrate a scientific, managerial, and cross-cultural experience into one synthetic whole. We will learn about societal goals for heritage locations, ways we put those goals into policies and practices, and ways we protect and manage heritage sites. The class blends an active learning, classroom experience with fieldwork on the Inca Trail and in Machu Picchu itself.All aspects of our discussion are grounded in the Peruvian Andes. When we discuss natural and cultural heritage, we use examples from Andean biodiversity and Incan water management. Every class session will have portions devoted to experiences you will have in Peru and ways to prepare you for those experiences. Our field work in Peru will allow you to walk trails developed nearly 1,000 years ago, climb through Incan ruins and question how they built such amazing structures, and meditate quietly in the sacred landscape of Machu Picchu. You will work with three peers to dive more deeply into some aspect of Incan heritage that you find interesting, discuss and learn about that on campus, explore it along thetrails and at Machu Picchu, and finally amaze everyone else with this small magical thing you have discovered.You will participate in panel discussions in class. That means you will read an assigned paper and post your reactions and questions. In class, you will join others who read that same paper, and develop common talking points. The whole class will discuss our thoughts and questions. We will have six panel discussions and will synthesize each of them into a series of questions we hope to address when we are in Peru. During our field work in Peru, we will meet local scientists, heritage site managers, local tourist operators, and other key stakeholders. You will bring your questions and will explore both the landscapeand the people of the region. When we return to campus, we will continue our discussion, reflecting on the international experience and examining how that experience influenced each person?s academic, personal, and professional goals.Caution: Note that this is a high-altitude experience. We begin in Cusco, which is nearly 12,000? ASL, and we walk trails near Machu Picchu that are between 9,000? and 11,000? ASL. You will want altitude medication, available through your travel clinic. Our trails are mostly well maintained and on gentle slopes but this is intended to be a class in which we learn through walking, examining, discussing, and reflecting on what we have experienced.",
    "prereq": []
  },
  {
    "code": "FW 1905",
    "subject": "FW",
    "id": "1905",
    "title": "Freshman Seminar",
    "info": "Issues/topics related to natural resources and the environment. Topics vary.",
    "prereq": []
  },
  {
    "code": "FW 2001W",
    "subject": "FW",
    "id": "2001W",
    "title": "Intro to Fish, Wldlf & Con Bio",
    "info": "Fish, wildlife, and other forms of biodiversity. Single species, populations, ecosystem, and landscape approaches. Experiential/interactive course. Decision-case studies.\n\nprereq: BIOL 1001 or BIOL 1009",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        }
      ]
    }
  },
  {
    "code": "FW 2002",
    "subject": "FW",
    "id": "2002",
    "title": "Threatened & Endangered Wldlf",
    "info": "Introduction to extinction as a process both natural and human caused. Illustrates differences in extinction events and why we should be concerned about rate of extinction. Definitions of current jargon used to describe imperiled species due to their legal/biological connotations. Case history examples of wildlife species that are threatened or endangered.\n\nprereq: Intro biology course",
    "prereq": []
  },
  {
    "code": "FW 2003",
    "subject": "FW",
    "id": "2003",
    "title": "Introduction to Marine Biology",
    "info": "Nature of oceans, their role sustaining life on planet. Diversity/ecology of organisms that live in coastal, deep, open seas. Effects of humans on marine life. Resilience of marine life, its importance to human society. Cultures of oceanic peoples. Selected topics.\n\nprereq: BIOL 1001 or BIOL 1009 or BIOL 2002 or ESCI 1006 or ESCI 1106 or instr consent",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "BIOL 2002",
          "subject": "BIOL",
          "id": "2002"
        },
        {
          "code": "ESCI 1006",
          "subject": "ESCI",
          "id": "1006"
        },
        {
          "code": "ESCI 1106",
          "subject": "ESCI",
          "id": "1106"
        }
      ]
    }
  },
  {
    "code": "FW 3003",
    "subject": "FW",
    "id": "3003",
    "title": "Wildlife in Agricultural Land",
    "info": "Ecology/management of fish/wildlife in areas of intensive agriculture. Conservation/management practices for fish/wildlife on land used for agriculture.",
    "prereq": []
  },
  {
    "code": "FW 3104",
    "subject": "FW",
    "id": "3104",
    "title": "Skills for Field Techniques",
    "info": "In this field-preparation and application class, students develop skills required for the field session (FW 3106 + FW 3108) and future professional positions in fisheries, wildlife, and conservation biology. Students complete a series of online activities that prepare them to use analytical tools (e.g., tools for statistical analysis, GIS/GPS, spatial methodology, advanced lab- and field-based skills). Students build knowledge about Minnesota species including identification and natural history information of plants, amphibians and reptiles, birds, fish, and mammals. Students demonstrate readiness for fieldwork by conducting an independent, field-focused project.\n\nprereq: [soph, jr, sr], FW major",
    "prereq": []
  },
  {
    "code": "FW 3106",
    "subject": "FW",
    "id": "3106",
    "title": "Vegetation Sampling",
    "info": "Common vegetation sampling methods used for habitat assessments. Identify approximately 75 vascular plant species typical of Minnesota terrestrial and aquatic ecosystems using taxonomic keys and readily observable traits. Importance of plants for providing food, cover, and nesting habitat. prereq: [soph, jr, sr], FW major, must be taken concurrently with FW 3108",
    "prereq": {
      "code": "FW 3108",
      "subject": "FW",
      "id": "3108"
    }
  },
  {
    "code": "FW 3108",
    "subject": "FW",
    "id": "3108",
    "title": "Field Methods in Conservation",
    "info": "FW3108 is a survey of the techniques and methodologies that fisheries and wildlife biologists use to conduct research and make management decisions. This class is part of the FWCB core curriculum, taken by all FWCB undergraduate students. It covers overarching concepts and methods related to science-based fisheries and wildlife resource management that are important for all FWCB degree options. Biologists have many techniques in their ‘toolbox,’ and we will discuss current techniques we think you are likely to use early in your career. Keep in mind that we will be unable to cover the full set of ‘tools’ available in the fisheries and wildlife management ‘toolbox.’ Rather, our goal is to expose you to the applications, assumptions, and limitations of many common techniques you may encounter as a fisheries and wildlife professional. This class will also cover a variety of ecosystems (from prairies to woodlands to waters) and ecological scales (from individual organisms to ecosystems), and we will employ a variety of data collection techniques that are used to investigate ecological systems and monitor and manage natural resources. The course highlights both traditional and “cutting-edge” techniques used to study free-ranging animal populations and their habitats. A highlight of the course is the emphasis on pairing hands-on activities in the field with data organization and summary. Multiple full-day field trips or a multi-day field session is required for this course.\n\nprereq: [soph, jr, sr], FW major",
    "prereq": []
  },
  {
    "code": "FW 3136",
    "subject": "FW",
    "id": "3136",
    "title": "Biology of Fishes",
    "info": "Fish biology, adaptations to different environments, modes of living, and environmental relationships. Lab emphasizes anatomy/identification of Minnesota fishes.",
    "prereq": []
  },
  {
    "code": "FW 3293",
    "subject": "FW",
    "id": "3293",
    "title": "Directed Study Fisheries",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. \n\nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements. ",
    "prereq": []
  },
  {
    "code": "FW 3294",
    "subject": "FW",
    "id": "3294",
    "title": "Directed Research Fisheries",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research course will be required to use the University-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "code": "FW 3393",
    "subject": "FW",
    "id": "3393",
    "title": "Directed Study Wildlife",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. \n\nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements. ",
    "prereq": []
  },
  {
    "code": "FW 3394",
    "subject": "FW",
    "id": "3394",
    "title": "Directed Research Wildlife",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research course will be required to use the University-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "code": "FW 3480",
    "subject": "FW",
    "id": "3480",
    "title": "Topics in Fisheries & Wildlife",
    "info": "Lectures by visiting scholar or regular staff member. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "FW 3493",
    "subject": "FW",
    "id": "3493",
    "title": "Directed Study Cons Bio",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. \n\nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements. ",
    "prereq": []
  },
  {
    "code": "FW 3494",
    "subject": "FW",
    "id": "3494",
    "title": "Directed Research Cons Bio",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research course will be required to use the University-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "code": "FW 3565",
    "subject": "FW",
    "id": "3565",
    "title": "FW Ecology/Mgmt: Field Trip",
    "info": "Eight-day field trip to Wyoming and points en route during spring break. Emphasizes broad range of fisheries and wildlife management, including big game, waterfowl, endangered species.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "FW 3840",
    "subject": "FW",
    "id": "3840",
    "title": "Nepal: Ind. or Group Project",
    "info": "Culmination project for students in Nepal semester program. Research project undertaken individually or in small teams on topic of interest generated from experience. Study abroad program. No on-campus component.",
    "prereq": []
  },
  {
    "code": "FW 3925",
    "subject": "FW",
    "id": "3925",
    "title": "Human Dimensions of Wildlife",
    "info": "Human dimensions of fish and wildlife concerns. Theory and methods from social sciences to address challenges and issues of managing fish and wildlife resources. Integrating social science information into fish and wildlife decision-making. Guest lecturers.",
    "prereq": []
  },
  {
    "code": "FW 4001",
    "subject": "FW",
    "id": "4001",
    "title": "Biometry",
    "info": "This course covers the basic foundations of statistical methods. In contrast to traditional methods of teaching statistics based on analytical formulas and hand-calculations, we will initially emphasize simulation-based methods (randomization tests, bootstrapping) for analyzing data. Students will learn how to implement common statistical methods (e.g., one and two sample tests, interval estimation techniques, linear regression) in the R programming language, and gain experience analyzing real data from a variety of fields, with particular emphasis on biological examples and applications.",
    "prereq": []
  },
  {
    "code": "FW 4009",
    "subject": "FW",
    "id": "4009",
    "title": "Biodiversity Assess & Monitor",
    "info": "Part of 4-course sequence in spring 2013 Nepal Semester Abroad Program. Techniques in assessing status/monitoring vertebrate population in Chitwan National Park. Current statistical methods to estimate abundance/habitat occupancy. Human/natural factors that explain population numbers.",
    "prereq": []
  },
  {
    "code": "FW 4101",
    "subject": "FW",
    "id": "4101",
    "title": "Herpetology",
    "info": "Reptiles/amphibians, their systematics, behavior, ecology, physiology, development, and morphology. Diversity of reptiles/amphibians. Focuses on Minnesota fauna. Lab.\n\nprereq: BIOL 1001 or BIOL 2012",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 2012",
          "subject": "BIOL",
          "id": "2012"
        }
      ]
    }
  },
  {
    "code": "FW 4102",
    "subject": "FW",
    "id": "4102",
    "title": "Principles of Conservation Bio",
    "info": "Introduction to themes/concepts of diverse, dynamic, and interdisciplinary field. Biological/social underpinnings of conservation problems/solutions.\n\nprereq: introductory biology course",
    "prereq": []
  },
  {
    "code": "FW 4103",
    "subject": "FW",
    "id": "4103",
    "title": "Principles of Wildlife Mgmt",
    "info": "This course covers the ecological basis for management of wildlife, including biological and sociological factors that influence management. Goals include: understanding the ecological mechanisms influencing the distribution and abundance of wildlife, learning the ecological and historical foundations of wildlife management and the ecological and social ramifications of management actions, thinking critically and logically about current wildlife issues, honing writing skills, and developing technical skills in key areas.\n\nprereq: Intro biology course, [jr or sr]",
    "prereq": []
  },
  {
    "code": "FW 4104",
    "subject": "FW",
    "id": "4104",
    "title": "Hunting and Fishing Traditions",
    "info": "History, traditions, and importance of field sports in North America. Making/using sport fishing equipment. Safe handling/operation of firearms, leading to State of Minnesota Firearms Safety Certificate. Lectures, readings.",
    "prereq": []
  },
  {
    "code": "FW 4105",
    "subject": "FW",
    "id": "4105",
    "title": "Hunting and Fishing Traditions",
    "info": "Philosophical foundations, history, traditions, and current importance of field sports in North American society. Laboratory sessions introduce making/using modern sport fishing equipment. Optional experiential learning laboratory introduces safe handling/operation of firearms, leading to State of Minnesota Firearms Safety Certificate. Lectures, invited guests, readings.",
    "prereq": []
  },
  {
    "code": "FW 4107",
    "subject": "FW",
    "id": "4107",
    "title": "Principles of Fisheries",
    "info": "Principles of Fisheries Management is an engaging and dynamic exploration to the principles and practices of fisheries management. The course is designed as a major requirement for Fisheries subplan majors in Fisheries, Wildlife, and Conservation Biology. It is also appropriate as an elective course for other majors and minors in FWCB, ESPM, or related biological disciplines. We cover the basics of fisheries science (habitats, ecology, and population dynamics) and management (e.g., goals, tools, implementation, and assessment) with an emphasis on human intervention and regulation. We first cover management approaches and planning, the development of an information base, and the identification of problems. We then provide a brief overview of applied limnology, fish ecology, and population dynamics, followed by approaches to manage fishery populations and habitats in freshwater and marine systems along with methods to assess management outcomes. Throughout, we demonstrate applications to specific fisheries and habitats. This is primarily a lecture-based course that also integrates field trips, group discussions, and activities. We use exams to measure comprehension, and case studies and assignments to encourage practical application. Prerequisite: Intro biology course, [jr or sr]",
    "prereq": []
  },
  {
    "code": "FW 4129",
    "subject": "FW",
    "id": "4129",
    "title": "Mammalogy",
    "info": "Evolutionary and biogeographic history of mammalia. Recognize, identify, and study natural history of mammals at the ordinal level,  North American mammals at familial level, and mammals north of Mexico at generic level.  Minnesota mammals at specific level.",
    "prereq": []
  },
  {
    "code": "FW 4132",
    "subject": "FW",
    "id": "4132",
    "title": "Invertebrate Diversity",
    "info": "Survey of major invertebrate phyla from standpoints of structure, function, development, and their environmental/evolutionary relationships. Focuses on major groups of multicelled invertebrates. Special unit dedicated to invertebrates of Minnesota.",
    "prereq": []
  },
  {
    "code": "FW 4136",
    "subject": "FW",
    "id": "4136",
    "title": "Ichthyology",
    "info": "Fish biology, adaptations to different environments and modes of living, and environmental relationships. Lab emphasizes anatomy and identification of Minnesota fishes.\n\nprereq: Biol 1001 or Biol 2012",
    "prereq": {
      "or": [
        {
          "code": "BIOL 1001",
          "subject": "BIOL",
          "id": "1001"
        },
        {
          "code": "BIOL 2012",
          "subject": "BIOL",
          "id": "2012"
        }
      ]
    }
  },
  {
    "code": "FW 4191",
    "subject": "FW",
    "id": "4191",
    "title": "Independent Study: Cons Bio",
    "info": "Individual field, library, and lab research in conservation biology.",
    "prereq": []
  },
  {
    "code": "FW 4291",
    "subject": "FW",
    "id": "4291",
    "title": "Independent Study: Fisheries",
    "info": "Individual field, library, and lab research in fisheries.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "FW 4292",
    "subject": "FW",
    "id": "4292",
    "title": "Special Lectures: Fisheries",
    "info": "Lectures in special fields of fisheries given by visiting scholar or regular staff member.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "FW 4301",
    "subject": "FW",
    "id": "4301",
    "title": "Conservation Genetics",
    "info": "This course introduces students to fundamental principles of population genetics and molecular phylogenetics and explores their applications to problems in the conservation, management, and restoration of biodiversity.",
    "prereq": []
  },
  {
    "code": "FW 4391",
    "subject": "FW",
    "id": "4391",
    "title": "Independent Study: Wildlife",
    "info": "Individual field, library, and lab research in wildlife.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "FW 4392",
    "subject": "FW",
    "id": "4392",
    "title": "Special Lectures: Wildlife",
    "info": "Lectures on special topics of wildlife given by visiting scholar or staff member.",
    "prereq": []
  },
  {
    "code": "FW 4401",
    "subject": "FW",
    "id": "4401",
    "title": "Fish Physiology and Behavior",
    "info": "Fish mechanisms/behavior. Links between fish biology, fisheries ecology, management, aquaculture. Homeostasis, neurobiology, bioenergetics, reproduction, movement.\n\nprereq: 4136, BIOL 2012, CHEM 1021(may be taken concurrently)",
    "prereq": {
      "and": [
        {
          "code": "FW 4136",
          "subject": "FW",
          "id": "4136"
        },
        {
          "code": "BIOL 2012",
          "subject": "BIOL",
          "id": "2012"
        },
        {
          "code": "CHEM 1021",
          "subject": "CHEM",
          "id": "1021"
        }
      ]
    }
  },
  {
    "code": "FW 4603",
    "subject": "FW",
    "id": "4603",
    "title": "Preparing Research Proposals",
    "info": "This course will give students experience developing research proposals and presentations. The course material will focus primarily on how to identify research questions, develop a budget, construct a written proposal, and present the proposal verbally. Students will work in small groups throughout the semester to develop their proposal and will gain skills in peer review and reference management.\n\nPrerequisites: EEB 3407 OR 3408 OR 3807, FW 4102 OR 4103, or permission from instructor, concurrent with FW 5603W.",
    "prereq": {
      "and": [
        {
          "code": "EEB 3407",
          "subject": "EEB",
          "id": "3407"
        },
        {
          "code": "FW 3408",
          "subject": "FW",
          "id": "3408"
        },
        {
          "code": "FW 3807",
          "subject": "FW",
          "id": "3807"
        },
        {
          "code": "FW 4102",
          "subject": "FW",
          "id": "4102"
        },
        {
          "code": "FW 4103",
          "subject": "FW",
          "id": "4103"
        },
        {
          "code": "FW 5603",
          "subject": "FW",
          "id": "5603"
        }
      ]
    }
  },
  {
    "code": "FW 4629",
    "subject": "FW",
    "id": "4629",
    "title": "Wildlife Care Externship",
    "info": "This externship class is the capstone experience of the wildlife care and handling minor curriculum. The class synthesizes the practical skills and experience you have developed in earlier classes in the minor. The capstone is a guided, supervised, hands-on, on-site experience in a wildlife handling setting, complemented by pre-, during- and post-experience reflection and analysis.",
    "prereq": []
  },
  {
    "code": "FW 4701",
    "subject": "FW",
    "id": "4701",
    "title": "Fshrs/Wldlf Problem Solving",
    "info": "Management problem identification/analysis, information gathering/analysis, oral/written reporting. Selected management issues.\n\nprereq: FW sr or grad student or instr consent",
    "prereq": []
  },
  {
    "code": "FW 5003",
    "subject": "FW",
    "id": "5003",
    "title": "Human Dimensions of Bio/Cons",
    "info": "Survey of social, psychological, economic, policy aspects of managing/conserving wildlife, fisheries, and related resources.\n\nprereq: [Biol 1001 or Biol 1009], Biol 3407",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "BIOL 1001",
              "subject": "BIOL",
              "id": "1001"
            },
            {
              "code": "BIOL 1009",
              "subject": "BIOL",
              "id": "1009"
            }
          ]
        },
        {
          "code": "BIOL 3407",
          "subject": "BIOL",
          "id": "3407"
        }
      ]
    }
  },
  {
    "code": "FW 5051",
    "subject": "FW",
    "id": "5051",
    "title": "Analysis of Populations",
    "info": "Regulation, growth, general dynamics of populations. Data needed to describe populations, population growth, population models, regulatory mechanisms. \n\nprereq: [4001 or STAT 3011 or ESPM 3012], [EEB 3407 or EEB 3408W or EEB 3807], Senior or grad student",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "FW 4001",
              "subject": "FW",
              "id": "4001"
            },
            {
              "code": "STAT 3011",
              "subject": "STAT",
              "id": "3011"
            },
            {
              "code": "ESPM 3012",
              "subject": "ESPM",
              "id": "3012"
            }
          ]
        },
        {
          "or": [
            {
              "code": "EEB 3407",
              "subject": "EEB",
              "id": "3407"
            },
            {
              "code": "EEB 3408W",
              "subject": "EEB",
              "id": "3408W"
            },
            {
              "code": "EEB 3807",
              "subject": "EEB",
              "id": "3807"
            }
          ]
        }
      ]
    }
  },
  {
    "code": "FW 5121",
    "subject": "FW",
    "id": "5121",
    "title": "Conservation Planning",
    "info": "We are impacting our planet and the species and ecosystems on it at an unprecedented rate. This creates key policy challenges to conserve species, ecosystems, and the benefits they provide to people. But, how do we decide what is the best way to tackle these challenges? How do we do this in a world with limited resources (time, money) for conservation and multiple stakeholders with different objectives? How can we make systematic decisions to get the biggest bang for our conservation buck? To address these questions, this course will cover key topics and concepts in conservation planning and provide exposure and hands-on experience with techniques for conservation plans and decisions. We will cover topics ranging from protected areas, restoration, ecosystem services, and climate change to structured decision-making, adaptive management, and return on investment. The course has a lecture and in-class computer lab component. This course will present structured approaches to problem-solving and decision-making from a conservation perspective, and students will leave with tools for structuring and solving complex environmental problems. Therefore, this is a foundational course in conservation planning but will also provide students will a tool-box to formulate and solve complex problems in environmental management more broadly and in life. Prerequisites: Senior or graduate standing, or permission of instructor. Recommended: One course in ecology, environmental science or permission of instructor.",
    "prereq": []
  },
  {
    "code": "FW 5136",
    "subject": "FW",
    "id": "5136",
    "title": "Ichthyology",
    "info": "Fish biology, adaptations to different environments and modes of living, and evolutionary relationships. Laboratory emphasizes anatomy and identification of Minnesota fishes.",
    "prereq": []
  },
  {
    "code": "FW 5292",
    "subject": "FW",
    "id": "5292",
    "title": "Special Lectures: Fisheries",
    "info": "Lectures in special fields of fisheries given by visiting scholar or regular staff member.\n\nprereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "code": "FW 5293",
    "subject": "FW",
    "id": "5293",
    "title": "Directed Study Fisheries",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. \n\nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements. ",
    "prereq": []
  },
  {
    "code": "FW 5294",
    "subject": "FW",
    "id": "5294",
    "title": "Directed Research Fisheries",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research course will be required to use the University-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "code": "FW 5392",
    "subject": "FW",
    "id": "5392",
    "title": "Special Lectures: Wildlife",
    "info": "Lectures given by visiting scholar or staff member.",
    "prereq": []
  },
  {
    "code": "FW 5393",
    "subject": "FW",
    "id": "5393",
    "title": "Directed Study Wildlife",
    "info": "A course in which a student designs and carries out an independent project under the direction of a faculty member. Directed study courses may be taken for variable credit and special permission is needed for enrollment.",
    "prereq": []
  },
  {
    "code": "FW 5394",
    "subject": "FW",
    "id": "5394",
    "title": "Directed Research Wildlife",
    "info": "Directed Research: An opportunity in which a student designs and carries\nout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use the\nUniversity-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "code": "FW 5401",
    "subject": "FW",
    "id": "5401",
    "title": "Fish Physiology and Behavior",
    "info": "Fish mechanisms/behavior. Links between fish biology, fisheries ecology, management, aquaculture. Homeostasis, neurobiology, bioenergetics, reproduction, movement.",
    "prereq": []
  },
  {
    "code": "FW 5411",
    "subject": "FW",
    "id": "5411",
    "title": "Aquatic Toxicology",
    "info": "Pollution assessment approaches, biological effects, fate/flow of contaminants in aquatic systems, major types of pollutants.",
    "prereq": []
  },
  {
    "code": "FW 5455",
    "subject": "FW",
    "id": "5455",
    "title": "Sustainable Aquaculture",
    "info": "How aquaculture affects environment/human well-being. Role of aquaculture as world's fastest growing food sector. Organic aquaculture/innovations.",
    "prereq": []
  },
  {
    "code": "FW 5459",
    "subject": "FW",
    "id": "5459",
    "title": "Stream and River Ecology",
    "info": "Structure/dynamics of running waters from ecosystem perspective. Historical perspective, basic hydrology/fluvial geomorphology, terrestrial-aquatic interactions, detrital dynamics, metabolism, drift, trophic relations, biotic/abiotic interactions, ecosystem experiments and natural alterations, stability/succession, ecosystem dynamics in a watershed.\n\nprereq: Limnology course or instr consent",
    "prereq": []
  },
  {
    "code": "FW 5493",
    "subject": "FW",
    "id": "5493",
    "title": "Directed Study Cons Bio",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. \n\nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements. ",
    "prereq": []
  },
  {
    "code": "FW 5494",
    "subject": "FW",
    "id": "5494",
    "title": "Directed Research Cons Bio",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research course will be required to use the University-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": []
  },
  {
    "code": "FW 5571",
    "subject": "FW",
    "id": "5571",
    "title": "Avian Conservation/Management",
    "info": "Current problems in avian conservation/management. Nongame, wetland, game birds.",
    "prereq": []
  },
  {
    "code": "FW 5601",
    "subject": "FW",
    "id": "5601",
    "title": "Fisheries Population Analysis",
    "info": "Introduction to theory/methods for estimating vital statistics of fish populations. Using microcomputers/statistical software to describe, analyze, model attributes of fish populations. Case studies from literature of marine/freshwater fisheries management.\n\nprereq: [4001 or Stat 5021], Biol 3407, [Math 1142 or Math 1271]",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "FW 4001",
              "subject": "FW",
              "id": "4001"
            },
            {
              "code": "STAT 5021",
              "subject": "STAT",
              "id": "5021"
            }
          ]
        },
        {
          "code": "BIOL 3407",
          "subject": "BIOL",
          "id": "3407"
        },
        {
          "or": [
            {
              "code": "MATH 1142",
              "subject": "MATH",
              "id": "1142"
            },
            {
              "code": "MATH 1271",
              "subject": "MATH",
              "id": "1271"
            }
          ]
        }
      ]
    }
  },
  {
    "code": "FW 5603",
    "subject": "FW",
    "id": "5603",
    "title": "Habitat/Regulation of Wildlife",
    "info": "Environmental interactions of wildlife at population/community levels. Environmental threats from human activities. Habitat management practices. Objectives, policies, regulations in population management.\n\nprereq: [FW 4102 or FW 4103], [EEB 3407 or EEB 3408 or EEB 3807]",
    "prereq": {
      "and": [
        {
          "or": [
            {
              "code": "FW 4102",
              "subject": "FW",
              "id": "4102"
            },
            {
              "code": "FW 4103",
              "subject": "FW",
              "id": "4103"
            }
          ]
        },
        {
          "or": [
            {
              "code": "EEB 3407",
              "subject": "EEB",
              "id": "3407"
            },
            {
              "code": "EEB 3408",
              "subject": "EEB",
              "id": "3408"
            },
            {
              "code": "EEB 3807",
              "subject": "EEB",
              "id": "3807"
            }
          ]
        }
      ]
    }
  },
  {
    "code": "FW 5604W",
    "subject": "FW",
    "id": "5604W",
    "title": "Fisheries Ecology/Management",
    "info": "Managed species/systems. Applied aquatic/fish ecology related to fisheries. Role of planning in fisheries management. Application of management tools, assessment of their efficacy.",
    "prereq": []
  },
  {
    "code": "FW 5621",
    "subject": "FW",
    "id": "5621",
    "title": "GIS for Fshrs,Wldlf & Bio Cons",
    "info": "Hands-on experience with GIS as tool for understanding, analyzing, managing ecological systems. ARC-INFO; how to apply it to problems in fisheries, wildlife, and biological conservation.",
    "prereq": []
  },
  {
    "code": "FW 5625",
    "subject": "FW",
    "id": "5625",
    "title": "Wldlf Hndlng/Immobilization",
    "info": "Practical techniques to maximize human/animal safety and encourage effective operations. Preparation procedures, legal responsibilities, capture drugs/delivery systems, safety measures, ethical issues, basic veterinary procedures for handling wildlife. Field course. Uses live animals.\n\nprereq: General biology, [grad student or vet med student or FW sr]",
    "prereq": []
  },
  {
    "code": "FW 8051",
    "subject": "FW",
    "id": "8051",
    "title": "Statistics for Ecologists",
    "info": "Regression methods for modeling ecological data. Real world examples from ecology, as well as environmental/natural resource sciences/management. Computer-based solutions using R/Bayesian modeling software.\n\nprereq: Graduate-level statistics class, [working knowledge of program R or instr consent]",
    "prereq": []
  },
  {
    "code": "FW 8200",
    "subject": "FW",
    "id": "8200",
    "title": "Seminar",
    "info": "Oral and written student reports on selected topics from current literature in fisheries biology and management and wildlife.  Lectures by and discussions with faculty and visiting specialists.",
    "prereq": []
  },
  {
    "code": "FW 8333",
    "subject": "FW",
    "id": "8333",
    "title": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "code": "FW 8394",
    "subject": "FW",
    "id": "8394",
    "title": "Research in Fisheries",
    "info": "Directed research. ",
    "prereq": []
  },
  {
    "code": "FW 8444",
    "subject": "FW",
    "id": "8444",
    "title": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "code": "FW 8448",
    "subject": "FW",
    "id": "8448",
    "title": "Fishery Science",
    "info": "Applying ecological theory to study/manipulation of fish populations. Dynamics of growth, mortality, and yield of fish stocks. Field assessment methodology. Simulation applied to management problems. Web-assisted course. Students produce a publishable (print or electronic) project.\n\nprereq: Grad student [in fisheries or wildlife conserv or conserv biol or ecology] or instr consent",
    "prereq": []
  },
  {
    "code": "FW 8450",
    "subject": "FW",
    "id": "8450",
    "title": "Data Analysis",
    "info": "Advanced statistical methods are used to teach exploration/analysis of univariate/multivariate data. Descriptive statistics, estimation and inference, regression and smoothing, multivariate techniques, resampling.\n\nprereq: 5xxx statistics course",
    "prereq": []
  },
  {
    "code": "FW 8452",
    "subject": "FW",
    "id": "8452",
    "title": "Cons. Bio.",
    "info": "Seminar examining population- to system-level biological issues (genetics; demographic processes; community, ecosystem, and landscape scale interaction; restoration ecology; ex situ strategies for restoration and recovery) and societal issues (social, economic, cultural perspectives; sustainable development strategies; roles of institutions; international and U.S. policies).",
    "prereq": []
  },
  {
    "code": "FW 8459",
    "subject": "FW",
    "id": "8459",
    "title": "Stream and River Ecology",
    "info": "Structure/dynamics of running waters from ecosystem perspective.  Historical perspective, basic hydrology/fluvial geomorphology, terrestrial-aquatic interactions, detrital dynamics, metabolism, drift, trophic relations, biotic/abiotic interactions, ecosystem experiments and natural alterations, stability/succession, ecosystem dynamics in a watershed.\n\nprereq: Limnology course or instr consent",
    "prereq": []
  },
  {
    "code": "FW 8461",
    "subject": "FW",
    "id": "8461",
    "title": "Advncd Topics Fish Physiology",
    "info": "Lectures, discussion, current literature. Complements 5459.\n\nprereq: Vertebrate physiology course or instr consent",
    "prereq": []
  },
  {
    "code": "FW 8462",
    "subject": "FW",
    "id": "8462",
    "title": "Advncd Topics in Fish Behavior",
    "info": "Current literature. Complements 5459.\n\nprereq: 5459 or behavior course or instr consent",
    "prereq": {
      "code": "FW 5459",
      "subject": "FW",
      "id": "5459"
    }
  },
  {
    "code": "FW 8465",
    "subject": "FW",
    "id": "8465",
    "title": "Fish Habitats & Restoration",
    "info": "Mechanisms underlying physiology/behavior that shape fish community structure in specific north temperate habitats. Techniques and planning procedures for restoring lakes/streams.\n\nprereq: Intro ecology course or instr consent",
    "prereq": []
  },
  {
    "code": "FW 8494",
    "subject": "FW",
    "id": "8494",
    "title": "Research in Wildlife",
    "info": "Directed research.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "FW 8576",
    "subject": "FW",
    "id": "8576",
    "title": "Biol/Mgmt of Large Mammals",
    "info": "Ungulates. Ecology, population dynamics, energy, nutrition, predation, disease/parasites, social behavior. Research approaches, management implications/practices. Key information on North American species.\n\nprereq: [Ecology course, [wildlife, forestry, and ecology grad student]] or instr consent",
    "prereq": []
  },
  {
    "code": "FW 8666",
    "subject": "FW",
    "id": "8666",
    "title": "Doct Pre-Thesis Cr*",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": []
  },
  {
    "code": "FW 8777",
    "subject": "FW",
    "id": "8777",
    "title": "Thesis Credit:Mast*",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": []
  },
  {
    "code": "FW 8888",
    "subject": "FW",
    "id": "8888",
    "title": "Thesis Credit:Doct*",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  }
]