[{"code":"GC 1077","subject":"GC","id":"1077","title":"Career Plan: Action","info":"How to turn career goals into action. How transitions and life changes affect career decisions. Strategies for information interviewing, cover letter and resume writing, and job interviewing. Prepare for the world of work through active classroom participation.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1111","subject":"GC","id":"1111","title":"Weather and Climate","info":"Scientific principles/concepts applied in context of the atmosphere and its weather/climate. How familiar types of weather happen. Forecasting weather. Predicting regional climates. Lecture, lab.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1132","subject":"GC","id":"1132","title":"Human Anat/Phys","info":"Health/disease examined by organ system (e.g., urinary, reproductive).  Access to lecture material/activities via the Internet. No lab.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1137","subject":"GC","id":"1137","title":"Bio Sci:  Human Body Lab","info":"Lab experience - Form and function of gross mammalian anatomy through dissection of preserved materials (skeletal, muscular, digestive, circulatory, nervous, urinary, and reproductive systems).  Microscopic examination of tissues and organs.  Exploration of mammalian physiology, with emphasis on experiments, analyzing, and interpreting data.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1161","subject":"GC","id":"1161","title":"Solar System Ast.","info":"Planets, satellites, asteroids, comets, and meteorites. The celestial sphere, coordinate systems, time intervals, motions, and physical attributes of planets and of their satellites. Instruments used by astronomers and by space probes.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1162","subject":"GC","id":"1162","title":"Stellar Astronomy","info":"Large-scale structure of universe. Definition of magnitude, luminosity, brightness, distance, temperature, size. Sun, spectral classification of stars, white dwarfs, neutron stars, black holes, clusters, nebulae, galaxies, quasars, cosmology, and cosmogony.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1221","subject":"GC","id":"1221","title":"Minnesota History","info":"Minnesota geography, resources, exploration, settlement, ethnicity, economics, and politics related to the Upper Midwest, the United States, and Canada. Researching/writing family or local history as part of larger history of region and nation.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1294","subject":"GC","id":"1294","title":"Econ. in Cont. Society","info":"Economic concepts used to understand current events and government policies. Supply/demand, GDP, federal budget, fiscal/monetary policies, taxation, poverty, inflation, economic growth, unemployment, international trade.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1331","subject":"GC","id":"1331","title":"Musical Heritage","info":"Examines music concepts that may vary when dealing with the musical heritage of different cultures. African, Asian, European, North American, and South American music. Indigenous musical cultures and their values in the United States.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1483","subject":"GC","id":"1483","title":"Music Laboratory","info":"Students read, write, perform, and compose music. Fundamentals of music literacy, including note names, rhythmic and metric symbols, key signatures, scales, musical textures, formal structure, and basic harmony. Open to students with or without music training.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1573","subject":"GC","id":"1573","title":"Intro Word Proc","info":"Hands-on lab course. Instructor helps students individually during class. No lectures. Basic concepts. Editing/formatting text. Tables, footnotes, headers, footers, mail merge, styles.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1574","subject":"GC","id":"1574","title":"Intro to Spreadsheets","info":"Hands-on lab course. Instructor helps students individually during class. No lectures. Basic concepts. Entering data, formatting cells/worksheets. Formulas, decision making using IF/THEN/ELSE, lookup tables, graphs.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1575","subject":"GC","id":"1575","title":"Intro Comp/Internet","info":"Hands-on training in computer literacy. Hardware (microprocessor, memory, storage). Software (operating systems/applications). Internet (Web, e-mail, Telnet, FTP). Multimedia.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1721","subject":"GC","id":"1721","title":"Mrge/Fam FulFlmt","info":"Psychological, social, and biological aspects of marriage and family living. Helping students gain understanding of, and self-awareness concerning, such areas as dating, mate selection, getting married, having children, and sexuality. Adjustments outside of traditional marriage and family.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1814","subject":"GC","id":"1814","title":"American Indian Law","info":"Federal Indian law. History of native legal issues from pre-European contact to present times in conjunction with applicable cultural norms practiced by various tribes.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 1999","subject":"GC","id":"1999","title":"General College","info":"","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 201","subject":"GC","id":"201","title":"English for College Readiness","info":"Advanced-intermediate ESL. Academic writing/reading. Srategies for language learning. Specific college information: financial aid, majors, application essays, testing, expectations.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 623","subject":"GC","id":"623","title":"Geom: Prog Study","info":"Basic geometric concepts/logic. Measurement, angles, polygons, plane geometric figures, three-dimensional figures, relationships among angles, constructions. Programmed study: students complete course requirements in time frame established by instructor.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 643","subject":"GC","id":"643","title":"Math:  Prog Study","info":"Basic mathematics, elementary algebra, or intermediate algebra for students who need to learn math at their own pace. Instructor assigns topics for each student based on first-day pretest.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 711","subject":"GC","id":"711","title":"Basic Math","info":"Problem-solving.  Concepts/procedures of basic math.  Whole numbers, fractions, decimals, ratios, percents, geometric concepts, signed nembers, variables, simple algebratic equations, word problems.","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 716","subject":"GC","id":"716","title":"Intro Algebra, Part I (Cmptr.)","info":"Students learn via multimedia software. Instructor helps students individually during class. No lectures. Covers first half of content of a first course in algebra at level of difficulty geared for students at a research university. Arithmetic review, real number operations, expressions, equations, inequalities, rectangular (x-y) graphs.  ","prereqInfo":null,"prereq":{"course":[]}},{"code":"GC 717","subject":"GC","id":"717","title":"Intro Algebra, Part II, Cmptr.","info":"Students learn via multimedia software. Instructor helps students individually during class. No lectures. Covers second half of content of a first course in algebra at level of difficulty geared for students at a research university. Graphing review, linear systems, word problems, exponents, polynomials, factoring.  ","prereqInfo":null,"prereq":{"course":[]}}]