[
  {
    "code": "GEO 1004",
    "subject": "GEO",
    "id": "1004",
    "title": "Geology/Minnesota",
    "info": "Fundamentals of geology emphasizing Minnesota's geological setting. Minnesota examples and local field trips illustrate geologic principles. Geologic components of environmental, resource-management, and economic issues.",
    "prereq": []
  },
  {
    "code": "GEO 1008",
    "subject": "GEO",
    "id": "1008",
    "title": "Faces of the Earth",
    "info": "History of pre-17th century ideas of geology in China, Middle East and Europe. Evolution of modern geology from travelers' tales, cosmology, mapmaking, minerals, volcanoes, and earthquakes. Plate tectonic hypothesis and current explanations of geological phenomena. Relations between humans and nature.",
    "prereq": []
  },
  {
    "code": "GEO 1009",
    "subject": "GEO",
    "id": "1009",
    "title": "Global Changes",
    "info": "Solid Earth, hydrosphere, atmosphere, and biosphere and their interconnections in some natural cycles of material and energy.  Consequences of the natural cycles for land-water-atmosphere-life environments and Earth's habitability. Extent of human impact on natural cycles and evidence for global environmental changes.",
    "prereq": []
  },
  {
    "code": "GEO 1904",
    "subject": "GEO",
    "id": "1904",
    "title": "Fresh Sem: Int'l Persp",
    "info": "Topics vary. See Class Schedule.",
    "prereq": []
  },
  {
    "code": "GEO 1909W",
    "subject": "GEO",
    "id": "1909W",
    "title": "Freshman Seminar: WI/IP",
    "info": "Topics vary: see freshman seminar topics.",
    "prereq": []
  },
  {
    "code": "GEO 1910W",
    "subject": "GEO",
    "id": "1910W",
    "title": "Freshman Seminar: WI",
    "info": "Topics vary: see freshman seminar topics.",
    "prereq": []
  },
  {
    "code": "GEO 1999",
    "subject": "GEO",
    "id": "1999",
    "title": "Geology Special Exam",
    "info": "",
    "prereq": []
  },
  {
    "code": "GEO 4601",
    "subject": "GEO",
    "id": "4601",
    "title": "Limnology",
    "info": "Description and analysis of lakes and other aquatic environments, beginning with lake origins and progressing through lake physics, chemistry, and biology. Interrelationships among these topics and effects of human activities.",
    "prereq": []
  },
  {
    "code": "GEO 4605",
    "subject": "GEO",
    "id": "4605",
    "title": "Limnology Laboratory",
    "info": "Field and lab methods used to obtain information about environmental conditions in aquatic environments and to measure the abundance of aquatic organisms, especially plankton. Field and lab instruments, sampling devices, microscopy, water chemistry, and data analysis.",
    "prereq": []
  },
  {
    "code": "GEO 4921",
    "subject": "GEO",
    "id": "4921",
    "title": "Geophys Field Camp",
    "info": "Gravity, magnetics, seismic refraction/reflection, electrical resistivity, electromagnetic methods. Near-surface/upper-crustal problems, concentrating on proper field design/methods. Interpretational methods: preliminary \"rule of thumb\" methods, quantitative computer modeling.",
    "prereq": []
  },
  {
    "code": "GEO 5002",
    "subject": "GEO",
    "id": "5002",
    "title": "Earth History/Edu",
    "info": "Evolution of life on Earth.  Interrelationships of plate tectonism, climate change, and organic evolution leading to present ecosystem.  Impact of hominid evolution on Earth systems and geological processes on human society. Required project designed to enhance ability to teach Earth history to K-12 students. ",
    "prereq": []
  },
  {
    "code": "GEO 5003",
    "subject": "GEO",
    "id": "5003",
    "title": "Dinosaur Evol/Edu",
    "info": "Dinosaurs and Mesozoic Earth used to introduce evolution, plate tectonics, climate change, and Earth systems. History of theories about dinosaurs illustrates principles and social aspects of scientific investigation. Required project designed to enhance ability to teach dinosaur evolution to K-12 students.",
    "prereq": []
  },
  {
    "code": "GEO 5006",
    "subject": "GEO",
    "id": "5006",
    "title": "Oceanography/Teach",
    "info": "How various processes in the ocean interact.  Marine biology, waves, tides, chemical oceanography, marine geology, and human interaction with the sea. Labs include study of live marine invertebrates, manipulation of oceanographic data, and discussion using videos showing unique aspects of ocean research.  Required design of modules for presenting course material to elementary or secondary school students.",
    "prereq": []
  },
  {
    "code": "GEO 5202",
    "subject": "GEO",
    "id": "5202",
    "title": "Thermomech Model",
    "info": "Concept of heat and mass transfer processes in Earth's crust and mantle.  Quantitative study of thermomechanical phenomena.  Emphasis on analytical and modern numerical techniques.",
    "prereq": []
  },
  {
    "code": "GEO 5703",
    "subject": "GEO",
    "id": "5703",
    "title": "Regional Geomorph",
    "info": "Geology of a particular region of the country, emphasizing its geomorphology.  One-week field trip to the area is taken during spring break.  May be taken for credit more than once if regions are different.",
    "prereq": []
  },
  {
    "code": "GEO 5704",
    "subject": "GEO",
    "id": "5704",
    "title": "Glaciology",
    "info": "Theories of glacier flow.  Internal structures and heat flow in glaciers and ice sheets.  Geomorphic features produced by glaciers.  Reading assignments and problems.",
    "prereq": []
  },
  {
    "code": "GEO 8351",
    "subject": "GEO",
    "id": "8351",
    "title": "Geochem Modeling",
    "info": "Using mass transfer reaction path models to assess chemical evolution of natural fluids, hydrothermal alteration processes, and formation of hydrothermal ore deposits.",
    "prereq": []
  }
]