[
    {
        "code": "GEOE 3111",
        "subject": "GEOE",
        "id": "3111",
        "title": "How to Model It",
        "info": "Problem formulation design and construction of models, and drawing conclusions from modeling results.  Students learn how to use computer-based modeling tools working in small groups on a number of problems from various engineering contexts.",
        "prereq": []
    },
    {
        "code": "GEOE 3301",
        "subject": "GEOE",
        "id": "3301",
        "title": "Soil Mechanics I",
        "info": "Index properties and soil classification. Effective stress. Permeability and seepage. Elasticity theory.  One-dimensional compression/consolidation, settlements.  Compaction, cut/fill problems.\n\nprereq: AEM 3031, CSE student",
        "prereq": {
            "code": "AEM 3031",
            "subject": "AEM",
            "id": "3031"
        }
    },
    {
        "code": "GEOE 3311",
        "subject": "GEOE",
        "id": "3311",
        "title": "Rock Mechanics I",
        "info": "Classifications and index properties.  Behavior of intact rock and rock masses.  Failure criteria.  Stereographic projections; kinematic analysis of rock slopes.  Reinforcement.  Foundations on rock.",
        "prereq": []
    },
    {
        "code": "GEOE 4011",
        "subject": "GEOE",
        "id": "4011",
        "title": "Special Topics",
        "info": "Topics, credits vary.",
        "prereq": []
    },
    {
        "code": "GEOE 4111",
        "subject": "GEOE",
        "id": "4111",
        "title": "Systems Analysis",
        "info": "Systems Analysis focuses on a broader \\\"systems\\\" approach of viewing problems.  The techniques of operations research--decision engineering, network analysis, simulation, linear programming, and expert systems--are used to represent systems, and especially to assess trade-offs.",
        "prereq": []
    },
    {
        "code": "GEOE 4121",
        "subject": "GEOE",
        "id": "4121",
        "title": "Computer Appl II",
        "info": "Application of computer tools/methods in solving ordinary and partial differential equations from civil engineering problems. Spreadsheet, MatLab programming. Methods may include finite differences, boundary element, finite element, and control volume finite element.",
        "prereq": []
    },
    {
        "code": "GEOE 4301",
        "subject": "GEOE",
        "id": "4301",
        "title": "Soil Mechanics II",
        "info": "Traction/stress. Mohr-Coulomb failure criterion. Experiments on soil strength. Earth pressure theories, rigid/flexible retaining walls. Stability of slopes. Bearing capacity of foundations.\n\nprereq: [[3301 or CE 3301], upper div CSE] or instr consent",
        "prereq": {
            "or": [
                {
                    "code": "GEOE 3301",
                    "subject": "GEOE",
                    "id": "3301"
                },
                {
                    "code": "CE 3301",
                    "subject": "CE",
                    "id": "3301"
                }
            ]
        }
    },
    {
        "code": "GEOE 4311",
        "subject": "GEOE",
        "id": "4311",
        "title": "Rock Mechanics",
        "info": "Lab testing of rock. Index properties/classification schemes. In-situ stresses. Mechanical behavior of rock masses. Mohr-coulomb failure criterion. Stereographic projections. Kinematic analysis of rock slopes. Block size, three-dimensional slope stability. Stress analysis of tunnels: Lame/Kirsch solutions. Elasto-plastic response. Rock-support interaction. Numerical modeling of slopes/tunnels.",
        "prereq": []
    },
    {
        "code": "GEOE 4341",
        "subject": "GEOE",
        "id": "4341",
        "title": "Eng Geostatistics",
        "info": "Problem solving and decision making in civil and geological engineering using applied statistics. Emphasis on spatially correlated data, e.g. geologic site characterization, and spatial sampling design.",
        "prereq": []
    },
    {
        "code": "GEOE 4351",
        "subject": "GEOE",
        "id": "4351",
        "title": "Groundwater Mech",
        "info": "Shallow confined, unconfined, and sem-confined flows. Flow in two coupled aquifers separated by leaky layers. Transient flow. Flow toward wells. Streamlines/pathlines in two/three dimensions. Contaminant transport. Elementary computer modeling.",
        "prereq": []
    },
    {
        "code": "GEOE 4352",
        "subject": "GEOE",
        "id": "4352",
        "title": "Groundwater Modeling",
        "info": "Analytic element method. Mathematical/computer modeling of single/multiple aquifer systems. Groundwater recovery. Field problems. Theory/application of simple contaminant transport models, including capture zone analysis.",
        "prereq": []
    },
    {
        "code": "GEOE 5311",
        "subject": "GEOE",
        "id": "5311",
        "title": "Experimental Geomechanics",
        "info": "Machine stiffness; closed-loop testing.  Small-strain theory.  Measurement of deformation; strain gages, LVDTs, accelerometers, and associated circuits.  Direct and indirect testing.  Material behavior: experiments on anisotropic, damaged, and fluid-filled solids.",
        "prereq": []
    },
    {
        "code": "GEOE 5321",
        "subject": "GEOE",
        "id": "5321",
        "title": "Geomechanics",
        "info": "Review of elasticity theory and solution of some elastic boundary value problems relevant to geomechanics.  Wave propagation in unbounded elastic media.  Elements of fracture mechanics and applications.  Elements of poroelasticity and applications.",
        "prereq": []
    },
    {
        "code": "GEOE 5331",
        "subject": "GEOE",
        "id": "5331",
        "title": "Geomech Modeling",
        "info": "Soil and rock response in triaxial testing; drained and undrained behavior; elastic and plastic properties.  Modeling stresses, strains, and failure in geomechanics problems.",
        "prereq": []
    },
    {
        "code": "GEOE 5341",
        "subject": "GEOE",
        "id": "5341",
        "title": "Wave Methods for NDT",
        "info": "Introduction to contemporary methods for nondestructive characterization of objects of civil infrastructure (e.g., highways, bridges, geotechnical sites). Imaging technologies based on propagation of elastic waves: ultrasonic and resonant frequency methods, seismic surveys, acoustic emission monitoring. Lecture, lab.",
        "prereq": []
    },
    {
        "code": "GEOE 8300",
        "subject": "GEOE",
        "id": "8300",
        "title": "Geomech Seminar",
        "info": "Presentations on various topics.",
        "prereq": []
    },
    {
        "code": "GEOE 8301",
        "subject": "GEOE",
        "id": "8301",
        "title": "Fracture Geomatls",
        "info": "Crack tip stress and displacement fields; stress intensity factors. Energy \nprinciples of fracture; compliance method. Process zone models. J integral. Mixed-mode fracture. Behavior of cracked solids. Numerical and experimental approaches.",
        "prereq": []
    },
    {
        "code": "GEOE 8302",
        "subject": "GEOE",
        "id": "8302",
        "title": "Soil Plasticity",
        "info": "Plasticity of soils and rocks. Yield conditions, flow rules. Theorems of limit analysis. Static solutions, method of characteristics. Kinematic solutions, hodograph. Energy balance. Applications to soil/rock engineering problems.",
        "prereq": []
    },
    {
        "code": "GEOE 8311",
        "subject": "GEOE",
        "id": "8311",
        "title": "Adv Rock Mechanics",
        "info": "Stress transformations; principal stresses and directions. Friction and behavior of rock joints; stability of frictional sliding. Elastic waves; acoustic emission and seismic measurements. Fragmentation and rock breakage.",
        "prereq": []
    },
    {
        "code": "GEOE 8321",
        "subject": "GEOE",
        "id": "8321",
        "title": "Thermoporoelasticit",
        "info": "Micro-mechanical description of porous media. Thermodynamics foundations. Linear theory of thermoporoelasticity: constitutive, transport, and balance laws; field equations. Determination of material constants. Singular solutions. Methods of solution: integral transform, method of singularities, finite and boundary element method.",
        "prereq": []
    },
    {
        "code": "GEOE 8322",
        "subject": "GEOE",
        "id": "8322",
        "title": "Granular Materials",
        "info": "Plasticity of soils and rocks.  Yield conditions, flow rules.  Theorems of limit analysis.  Static solutions, method of characteristics.  Kinematic solutions, hodograph.  Energy balance.  Applications to soil/rock engineering problems.",
        "prereq": []
    },
    {
        "code": "GEOE 8331",
        "subject": "GEOE",
        "id": "8331",
        "title": "Model Geomech Proc",
        "info": "Data-limited nature of problems in geomechanics. Dimensional analysis.  Regimes of solution. Similarity solutions. Elements of fracture mechanics, elastoplasticity, poroelasticity. Geomechanical applications to stability of underground excavations, fluid flow in fracture, tool-rock interaction, hydraulic fracturing.",
        "prereq": []
    },
    {
        "code": "GEOE 8333",
        "subject": "GEOE",
        "id": "8333",
        "title": "FTE: Master's",
        "info": "(No description)",
        "prereq": []
    },
    {
        "code": "GEOE 8336",
        "subject": "GEOE",
        "id": "8336",
        "title": "Boundary Elements I",
        "info": "Introduction to boundary element methods for elastostatics; stress discontinuity method; displacement discontinuity method; direct boundary integral method.  Derivation of basic mathematical solutions from the theory of elasticity.  Applications of boundary element methods in geomechanics.",
        "prereq": []
    },
    {
        "code": "GEOE 8337",
        "subject": "GEOE",
        "id": "8337",
        "title": "Boundary Element II",
        "info": "Transient and nonlinear problems.",
        "prereq": []
    },
    {
        "code": "GEOE 8341",
        "subject": "GEOE",
        "id": "8341",
        "title": "Dynamics of Soils",
        "info": "Vibration of single- and multi-degree-of-freedom systems. Dynamic Soil Properties. Wave propagation in continuous media. Foundation dynamics.  Liquefaction. Introduction to seismology/earthquakes.",
        "prereq": []
    },
    {
        "code": "GEOE 8351",
        "subject": "GEOE",
        "id": "8351",
        "title": "Analytical modeling in Civil",
        "info": "Two-dimensional problems. Boundary integrals. Theorems of Gauss, Stokes, Green. Superposition of solutions. Boundary integral equation method. Analytic element method. Laplace's equation. Biharmonic equation. Linear elasticity. Modified Helmholtz equation. Diffusion equation.",
        "prereq": []
    },
    {
        "code": "GEOE 8352",
        "subject": "GEOE",
        "id": "8352",
        "title": "Adv Grndwtr Mech II",
        "info": "Applying complex methods, including conformal mapping, in groundwater mechanics; solving problems with free boundaries using the hodograph method; drains in aquifers with free boundaries; superposition of solutions with drains; singular Cauchy integrals; boundary elements.",
        "prereq": []
    },
    {
        "code": "GEOE 8361",
        "subject": "GEOE",
        "id": "8361",
        "title": "Eng Model Fitting",
        "info": "Parameter estimation and inverse modeling for civil and geological engineering. Formulating engineering model fitting problems; comparing and selecting various fit criteria; implementing numerical algorithms; analyzing and interpreting results using both statistical and qualitative tools; designing future measurement plans.",
        "prereq": []
    },
    {
        "code": "GEOE 8444",
        "subject": "GEOE",
        "id": "8444",
        "title": "FTE: Doctoral",
        "info": "(No description)",
        "prereq": []
    },
    {
        "code": "GEOE 8666",
        "subject": "GEOE",
        "id": "8666",
        "title": "Doct Pre-Thesis Cr*",
        "info": "tbd ",
        "prereq": []
    },
    {
        "code": "GEOE 8777",
        "subject": "GEOE",
        "id": "8777",
        "title": "Thesis Credit:Mast*",
        "info": "(No description)",
        "prereq": []
    },
    {
        "code": "GEOE 8888",
        "subject": "GEOE",
        "id": "8888",
        "title": "Thesis Credit:Doct*",
        "info": "(No description)",
        "prereq": []
    }
]