[
    {
        "code": "HIST 1000",
        "subject": "HIST",
        "id": "1000",
        "title": "New Topics in History",
        "info": "Courses on new topics in history, historical topics related to current events, and other special subjects. Contact the History department for current listings.",
        "prereq": []
    },
    {
        "code": "HIST 1011W",
        "subject": "HIST",
        "id": "1011W",
        "title": "Civilization & the Environment",
        "info": "Sweep of history, from first prehistoric societies to dawn of modern world circa 1500. Forces that pushed humans to continually explore new environments and develop higher levels of social organization and cross-cultural interaction.\n\nprereq: Fr or soph or non-hist major",
        "prereq": []
    },
    {
        "code": "HIST 1012W",
        "subject": "HIST",
        "id": "1012W",
        "title": "The Age of Global Contact",
        "info": "Five centuries of globalization. How the modern, interconnected world came into being. Changing material life (food, clothes, petroleum) and ideologies/beliefs. Analysis of primary documents to show how historical knowledge is produced.\n\nprereq: Fr or soph or non-hist major",
        "prereq": []
    },
    {
        "code": "HIST 1015W",
        "subject": "HIST",
        "id": "1015W",
        "title": "Globalization",
        "info": "Increased global interconnections over past 50 years. Impact of information revolution on human rights, economic inequality, ecological challenges, and decolonization. Cases in Asia, Africa, Latin America, or Middle East.\n\nprereq: Fr or soph or non-hist major",
        "prereq": []
    },
    {
        "code": "HIST 1017",
        "subject": "HIST",
        "id": "1017",
        "title": "Origins: Global Societies",
        "info": "Sweep of history from first prehistoric societies to dawn of modern world circa 1500. Forces that pushed humans to continually explore new environments and develop higher levels of social organization and cross-cultural interaction.",
        "prereq": []
    },
    {
        "code": "HIST 1018",
        "subject": "HIST",
        "id": "1018",
        "title": "The Age of Global Contact",
        "info": "Five centuries of globalization. How the modern, interconnected world came into being. Changing material life (food, clothes, petroleum) and ideologies/beliefs. Analysis of primary documents to show how historical knowledge is produced.",
        "prereq": []
    },
    {
        "code": "HIST 1019",
        "subject": "HIST",
        "id": "1019",
        "title": "Globalization",
        "info": "Increased global interconnections over past 50 years. Impact of information revolution on human rights, economic inequality, ecological challenges, and decolonization. Cases in Asia, Africa, Latin America, or Middle East.",
        "prereq": []
    },
    {
        "code": "HIST 1026",
        "subject": "HIST",
        "id": "1026",
        "title": "Europe and the World, I",
        "info": "Europe in the making, from Hammurabi to Columbus. Heyday of ancient Near East, Late Middle Ages. Culture, European interactions with wider world through religion, conquest, and trade. Beginning of the age of discoveries.",
        "prereq": []
    },
    {
        "code": "HIST 1027",
        "subject": "HIST",
        "id": "1027",
        "title": "Europe and the World, II",
        "info": "Emergence of a Europe of nations/empires. Transformations through revolutions, wars, and encounters with world regions.",
        "prereq": []
    },
    {
        "code": "HIST 1031W",
        "subject": "HIST",
        "id": "1031W",
        "title": "Europe and the World, I",
        "info": "Europe, from Hammurabi to Columbus. Heyday of ancient Near East, Late Middle Ages. Culture, European interactions with wider world through religion, conquest, and trade. Beginning of the age of discoveries.\n\nprereq: Fr or soph or non-hist major",
        "prereq": []
    },
    {
        "code": "HIST 1032W",
        "subject": "HIST",
        "id": "1032W",
        "title": "Europe and the World, II",
        "info": "Emergence of a Europe of nations/empires. Transformations through revolutions, wars, and encounters with world regions.\n\nprereq: Fr or soph or non-hist major",
        "prereq": []
    },
    {
        "code": "HIST 1081W",
        "subject": "HIST",
        "id": "1081W",
        "title": "World Christianity: 100-1400",
        "info": "This course surveys the history of Christianity from its status as a persecuted minority religion of the Roman Empire to its dominant role in medieval Europe and Byzantium. We study Christian traditions in Asia and Africa as well as Europe with special attention to the relationship between Christianity and culture in the ancient and medieval world.",
        "prereq": []
    },
    {
        "code": "HIST 1082",
        "subject": "HIST",
        "id": "1082",
        "title": "Jesus in History",
        "info": "Does time, place, and culture affect our picture of Jesus? We'll start by constructing our own Jesus story and then go backwards in time to examine modern times (film, music, and modern art), pre-Civil War America (views of Jesus from enslaved people and their enslavers), Renaissance and Medieval Europe and North Africa (art and architecture), and finally end with the ancient world (art and writings about Jesus, including the biblical gospels). No background in religious studies required, and students of any, all, or no religious background are welcome.",
        "prereq": []
    },
    {
        "code": "HIST 1102",
        "subject": "HIST",
        "id": "1102",
        "title": "Medieval Tales/Modern Echoes",
        "info": "Knights of Round Table, dragon-slayers, magic djinn, pilgrims in Hell. How stories have been retold in modern fiction, film, arts. Texts from Europe/other regions of globe.",
        "prereq": []
    },
    {
        "code": "HIST 1301W",
        "subject": "HIST",
        "id": "1301W",
        "title": "American Hist to 1865",
        "info": "Conflict/change, from colonial era through Civil War. colonization/resistance, slavery, nation-building, westward expansion, gender roles, religion, reform, race/ethnicity, immigration, industrialization, class relations. Students use primary sources, historical scholarship.\n\nprereq: Fr or soph or non-hist major",
        "prereq": []
    },
    {
        "code": "HIST 1302W",
        "subject": "HIST",
        "id": "1302W",
        "title": "U.S. History Since 1865",
        "info": "U.S. history since Civil War, in global context. Emancipation. Forms of labor. Immigration. Citizenship. Conceptions of race/gender. Hot/cold wars. Reform/rights movements. Globalization. State power. Students use primary sources, historical scholarship.\n\nprereq: Fr or soph or non-hist major",
        "prereq": []
    },
    {
        "code": "HIST 1307",
        "subject": "HIST",
        "id": "1307",
        "title": "American Hist to 1865",
        "info": "Conflict/change, from colonial era through Civil War. Colonization/resistance, slavery, nation-building, westward expansion, gender roles, religion, reform, race/ethnicity, immigration, industrialization, class relations. Students use primary sources, historical scholarship.",
        "prereq": []
    },
    {
        "code": "HIST 1308",
        "subject": "HIST",
        "id": "1308",
        "title": "U.S. History Since 1865",
        "info": "U.S. history since Civil War, in global context. Emancipation. Forms of labor. Immigration. Citizenship. Changing conceptions of race/gender. Hot/cold wars. Reform/rights movements. Globalization. State power. Students use primary sources, historical scholarship.",
        "prereq": []
    },
    {
        "code": "HIST 1361W",
        "subject": "HIST",
        "id": "1361W",
        "title": "World War I: A Global History",
        "info": "This class takes a global approach to the examination of World War One's causes and consequences. We will look at how the war unfolded in Europe, Africa, and the Middle East. We will also explore the war's impact on North America and Australasia, areas drawn into the conflict because of their unique relationships with Britain and France. We will consider the special role played by the U.S. in restoring world peace and analyze the lasting social and political cleavages occasioned by the war. We will get at the heart of how the war was fought and how it is remembered for all of its triumphs and tragedies.",
        "prereq": []
    },
    {
        "code": "HIST 1362",
        "subject": "HIST",
        "id": "1362",
        "title": "Global History of World War II",
        "info": "This course examines 1) how different countries remember WWII and how memories of the war have been shaped by domestic and international contexts of each country and 2) how WWII changed the world in areas of human rights, the government-society relations, and ethical use of science and technology.  Various faculty members with different geographical and thematic expertise come to the class as guest lecturers throughout the semester.",
        "prereq": []
    },
    {
        "code": "HIST 1364",
        "subject": "HIST",
        "id": "1364",
        "title": "Global Environmental History",
        "info": "This introductory course focuses on human environment interaction and the role of environmental factors in shaping of world history from the early medieval period, roughly 1000 C.E, to the present day. Beginning with the idea of environmental history and its broad themes, including climate, volcanic eruptions, landscape, plants, crops, animals, insects, disease, pestilence, energy, and technology, the course will enable students not only to understand the complex relationship between human societies and non-human species but also the changing nature and structure of this relationship throughout history. ",
        "prereq": []
    },
    {
        "code": "HIST 1365",
        "subject": "HIST",
        "id": "1365",
        "title": "Global Tourism & Environment",
        "info": "This course focuses on tourism and travel. Spanning the period from the late 18th century to the present, it examines the ways in which these phenomena impact how we live, work, interact with our natural environment and other people, and conceive of the world and global forces",
        "prereq": []
    },
    {
        "code": "HIST 1366W",
        "subject": "HIST",
        "id": "1366W",
        "title": "US Radical Environmentalism",
        "info": "Course examines responses to environmental degradation in North America from the l8th century through the 21st.  We analyze forms of protests, organizations, and frameworks that preceded current forms of environmentalism.  Topics include legal and extra-legal protests against ecological damage and loss, the call for wilderness preservation, environmental racism, and the environmental justice movement.  ",
        "prereq": []
    },
    {
        "code": "HIST 1411W",
        "subject": "HIST",
        "id": "1411W",
        "title": "Family History",
        "info": "How family life, has played and continues to play a major role in world history. Lectures, labs, assignments.\n\nprereq: Fr or soph or fewer than 60 cr",
        "prereq": {
            "code": "HIST 60",
            "subject": "HIST",
            "id": "60"
        }
    },
    {
        "code": "HIST 1462",
        "subject": "HIST",
        "id": "1462",
        "title": "East Asia 1600-2000",
        "info": "Formation and decline of early modern Asian empires; Western imperialism and Asian nationalism; social revolution, economic modernization, and cultural change in China, Japan, Korea, and Vietnam between 1600-2000.",
        "prereq": []
    },
    {
        "code": "HIST 1463",
        "subject": "HIST",
        "id": "1463",
        "title": "Intro to Imperialism in Asia",
        "info": "Organized around a series of themes, this course will begin with a broad overview of imperialism in Asia before diving into economics of empire, technologies of imperialism, race and gender, nationalism and the end of empire, and neocolonialism. Throughout, the class will center the history of present-day China, India, Southeast Asia, and Japan, emphasizing whenever possible the perspectives of those impacted by empire rather than those perpetuating it. As such, assigned readings focus on primary sources supplemented by relevant secondary research, with optional readings providing significant breadth and depth for interested students seeking to delve further into their own interests or find new avenues of scholarly inquiry. All told, the histories included here represent some of the most significant events in recent centuries, but ones that often go overlooked in an academic context, covered only as a footnote in the histories of the West. Instead, this course will center the history of Asia and the voices of those impacted by imperialism, offering new perspectives on some of the most significant moments that shaped-and continue to shape-our contemporary world. \n\nDesigned as an introductory course for those unfamiliar with the history of Asia, this class approaches a broad geographic and temporal range through case studies, diving deeply into crucial historical moments rather than providing an exhaustive overview of more than two centuries of Western imperialism. Simultaneously, this class will introduce students to the process of historical analysis itself using a substantial focus on primary sources, instructional time spent in libraries and archives, and a well-supported, intensive research essay process as a way to encourage them to think critically about the historical project while also honing their own historiographical skills. Overall, students will leave this course with a strong foundation in the history of Asia and the history of Western imperialism along with real practice “doing” history, preparing them for their future within the Department of History, at the University of Minnesota, and beyond. \n",
        "prereq": []
    },
    {
        "code": "HIST 1534",
        "subject": "HIST",
        "id": "1534",
        "title": "Intro Jewish History & Culture",
        "info": "This course traces the development of Judaism and Jewish civilizations from their beginnings to the present. With over three millennia as its subject, the course must of necessity be a general survey. Together we will explore the mythic structures, significant documents, historical experiences, narratives, practices, beliefs, and worldviews of the Jewish people. The course begins by examining the roots of Judaism in the Hebrew Bible and the history of ancient Israel but quickly focuses on the creative forces that developed within Judaism as a national narrative confronted the forces of history, especially in the forms of the Persian, Greek, and Roman empires. Rabbinic Judaism becomes the most dominant creative force and will receive our greatest attention, both in its formative years and as it encounters the rise of Christianity and Islam. After studying the Jewish experience in the medieval world, we will turn to Judaism’s encounter with the enlightenment and modernity. The historical survey concludes by attending to the transformations within Judaism and Jewish life of the last 150 years, including a confrontation with the experience of the Holocaust. Woven throughout this historical survey will be repeated engagements with core questions: “Who is a Jew?” “What do Jews believe?” “What do Jews do?” “What do we mean by ‘religion’?”   “How do Jews read texts within their tradition?” And perhaps most importantly, “How many answers are there to a Jewish question?” Students in this course can expect to come away with some knowledge of the Bible in Judaism, rabbinic literature and law, Jewish mysticism and philosophy, Jewish nationalism and Zionism, Jewish culture, ritual, and worship in the synagogue, the home, and the community, and Jewish celebrations of life cycle events and the festivals.",
        "prereq": []
    },
    {
        "code": "HIST 1807",
        "subject": "HIST",
        "id": "1807",
        "title": "U.S. Constitutional History",
        "info": "This course examines struggles over the U.S. Constitution from the founding to the present. It foregrounds the experience of diverse communities and their efforts to change, preserve, or realize constitutional meaning. Through a history of rights and citizenship, powers of government, and social movements' pursuits of justice, it conveys the centrality of constitutional history to American life.",
        "prereq": []
    },
    {
        "code": "HIST 1809",
        "subject": "HIST",
        "id": "1809",
        "title": "The Presidency in the US",
        "info": "This course explores the emergence, meaning, and evolution of the American presidency. We will examine the nature of presidential power and ask how and why those powers have changed over time. We will explore the impact of politics and political parties on the American presidency. We will consider how presidents shape policy and analyze the relationship between power, politics, and policy.",
        "prereq": []
    },
    {
        "code": "HIST 1811",
        "subject": "HIST",
        "id": "1811",
        "title": "The Sixties: History & Memory",
        "info": "The Sixties was an incredibly dynamic decade in the United States and around the world. It was a decade of powerful social movements from the Civil Rights and Black, Brown, Yellow and Red Power movements to the countercultural, student/campus, anti-war, feminist, and environmental movements. It was also marked by the rise of a series of New Right movements from the rise of the Barry Goldwater to the election of Richard Nixon and the transformation of both the Democratic and Republican parties. Major immigration reform, transformations in the nation's educational and health care systems, along side new patterns of consumption and new forms of media were also products of the Sixties. From the Cold War to the Vietnam War, from anti-imperialism and anti-colonialism to third world revolutions, Americans transformed the world and the US was transformed by the world in the sixties.\n\nFifty years removed from the sixties, the idea of the sixties remains alive in the American imagination. It remains alive and in tension with the new movements, like Black Lives Matters, and in political thought, as, for example, in Donald Trump's repeated invocation of the \\\"silent majority.\\\" \n\nStudents will explore a wealth of primary sources and be introduced to the dynamic historiography of the 1960s. As a class, we will also consider how the sixties continues to serve as a powerful trope that organizes political and social thought in the 21st century.",
        "prereq": []
    },
    {
        "code": "HIST 1842",
        "subject": "HIST",
        "id": "1842",
        "title": "The Digital Revolution",
        "info": "Historical examination of birth of computer. Global transformations after 1945. History of technology/how technology transforms cultural life. United States history integrated with global history to show how technology, capitalism, politics, culture, environment, conspired to make computer an agent of revolutionary change.",
        "prereq": []
    },
    {
        "code": "HIST 1902",
        "subject": "HIST",
        "id": "1902",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
        "prereq": []
    },
    {
        "code": "HIST 1903",
        "subject": "HIST",
        "id": "1903",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.",
        "prereq": []
    },
    {
        "code": "HIST 1904",
        "subject": "HIST",
        "id": "1904",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
        "prereq": []
    },
    {
        "code": "HIST 1905",
        "subject": "HIST",
        "id": "1905",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.",
        "prereq": []
    },
    {
        "code": "HIST 1907W",
        "subject": "HIST",
        "id": "1907W",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
        "prereq": []
    },
    {
        "code": "HIST 1908W",
        "subject": "HIST",
        "id": "1908W",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
        "prereq": []
    },
    {
        "code": "HIST 1909W",
        "subject": "HIST",
        "id": "1909W",
        "title": "Freshman Seminar",
        "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
        "prereq": []
    },
    {
        "code": "HIST 1910W",
        "subject": "HIST",
        "id": "1910W",
        "title": "Freshman Seminar",
        "info": "Topics specified in Course Guide.",
        "prereq": []
    },
    {
        "code": "HIST 1911",
        "subject": "HIST",
        "id": "1911",
        "title": "A History of the Drug Wars",
        "info": "When and how did some drugs become a social problem? Why is cocaine illegal in the United States? Who is winning the war on drugs? These questions and others are at the heart of this seminar. We will examine the longer history of controlled substances throughout the Western Hemisphere, focusing in particular on the scope of the so-called war on drugs of the past 30 years. We will read books, articles, and websites dealing with illegal drugs, and we will watch documentary and full-length films dealing with drug use, drug markets, and the violence surrounding drugs. Our study of the past is intended to help us understand the present context and to allow us to imagine a different future regarding these complicated issues.",
        "prereq": []
    },
    {
        "code": "HIST 1912W",
        "subject": "HIST",
        "id": "1912W",
        "title": "Masculinities in the Americas",
        "info": "What has it meant to be a man in the Americas? What did it mean to be a \\\"man\\\" before the term \\\"masculine\\\" was popularized?  Do \\\"manhood\\\" and \\\"masculinity\\\" still matter today? Exploring changing meanings of manhood and the complicated constructions of masculinity from the colonial era to the present, this course argues that understanding \\\"men,\\\" \\\"manhood,\\\" and \\\"masculinity\\\" is central to understanding United States history. At this nation's founding, family manhood was central to maintaining social order in the colonies and citizenship rights were the sole possession of those who could claim to be free, white, and male. Up through the 20th century, manhood has frequently been associated with specific sets of political, economic, social, and familial rights and responsibilities. At the same time, the denial of rights to large portions of the nation can be traced to their purported lack of manhood. Students in this class will debate and explore how questions of manhood and masculinity shaped and continue to shape the nation. ",
        "prereq": []
    },
    {
        "code": "HIST 1913",
        "subject": "HIST",
        "id": "1913",
        "title": "Goin' to the U: History",
        "info": "You are the 146th group of freshmen to matriculate at the University of Minnesota. How has the university changed since the first class of freshmen arrived in 1871, and how has the pursuit of a college education evolved? This seminar will examine the history of the University of Minnesota as a case study of the changing nature of college education in America overall. Topics to be studied include the changing structure of college education as a mode of learning, its organization, expectations, and intended outcomes; the nature of college life as a subset of American life as a whole, including issues of gender, race, class, and the question of inclusion; student life as a subset of American life overall, including institutions like fraternities and sororities, college athletics, and the relation between the collegiate campus and the wider world (i.e. student protest, activism, and politics). Students will pursue original research in university archives to create their own understanding of the history of the university. ",
        "prereq": []
    },
    {
        "code": "HIST 1914",
        "subject": "HIST",
        "id": "1914",
        "title": "French Food, Wine & Sport",
        "info": "This course will examine the specific way in which food, wine, and sport have helped to create the French cultural, social, and economic identity. The course is divided into three sections, each dealing with one of these topics. Throughout the course, we will explore what it is about French attitudes to these three essential elements of national identity that stamp them with \\\"Frenchness.\\\" We will look beyond the national implications to consider the international ramifications of each element. The themes of gender and politics will also be introduced. Texts will include scholarly works of history as well as clips from films, with emphasis on understanding the concepts and methodologies of the scholarly works and discussing and analyzing the other material as sociological and historical sources.",
        "prereq": []
    },
    {
        "code": "HIST 1915",
        "subject": "HIST",
        "id": "1915",
        "title": "Black Death: Plague in History",
        "info": "In 1348, the disease that would be called the Black Death (the second pandemic) swept west from Central Asia to Europe, where it quickly annihilated up to 60% of Europe's population in the years 1347-1352. This was neither the first nor the last occurrence of this dreaded disease in world history. The Justinianic Plague of the 6th century (the first pandemic) was devastating as well. Plague recurred again and again, with the third pandemic coming at the end of the 19th century. The effects of the plague on the social fabric of the societies with which it came into contact were considerable, but so were the psychic effects, and the religious, intellectual, medical, and artistic worlds felt compelled to attempt to understand what the plague was, as well as its grander philosophical and moral implications. This course will consider the modern scientific advances in understanding the disease and the medieval sources that document its devastation.",
        "prereq": []
    },
    {
        "code": "HIST 1916",
        "subject": "HIST",
        "id": "1916",
        "title": "Herders and History",
        "info": "This seminar explores herding societies found throughout the premodern and modern world, from the Andes to the Sahara to North America, the Middle East, and Inner Asia. In this course, students will learn the key approaches to thinking about herding peoples and their forms of subsistence as well as the ways in which they interacted with their natural environment and sedentary societies. By focusing on herders' adaptation strategies to different climatic and environmental conditions, the we will explore how these conditions determined the level of their interaction/relationship with domesticated and non-domesticated animals. We will also examine the cultural identities emerging as a result of interdependency between people and their animals.",
        "prereq": []
    },
    {
        "code": "HIST 1917",
        "subject": "HIST",
        "id": "1917",
        "title": "Racism, Anti-Racism & America",
        "info": "Is racism integral, or antithetical, to the American dream? To what degree has its promise of freedom and prosperity rested on the exclusion of Indigenous, Black and other People of Color from those opportunities? Have white Americans achieved its promise of freedom and prosperity at the expense of others? Or, has the dream been perverted by the exclusion of Black, Indigenous, and People of Color to what Martin Luther King described as \\\"a lonely island of poverty in the midst of a vast ocean of material prosperity\\\"? Moreover, to what extent have Americans resisted their exclusion or the exclusion of others from the promise of the Dream? Given that in the contemporary moment, inequality in the US has surpassed that of the Great Depression, what do these fractures and contestations in the American Dream mean for a larger society experiencing rampant precarity writ large? \n\nThis pair of seminars (ANTH 1917 and HIST 1917) explores these questions in dialogue, occasionally meeting together and with a larger group of seminars connected to the College of Liberal Arts's Living and Learning in the Land of 10,000 Perspectives? Civic Readiness Initiative. We believe that this cross-fertilization is critical because the fault-lines of inequality have precisely cohered to these structural formations and categories of analysis, i.e. race and racism. Moreover, an interdisciplinary approach (through anthropology and history) is crucial for examining the contested nature, historical contexts, and contemporary investments of the American Dream.",
        "prereq": []
    },
    {
        "code": "HIST 1919W",
        "subject": "HIST",
        "id": "1919W",
        "title": "Autobiography through History",
        "info": "What do French Enlightenment philosopher Jean-Jacques Rousseau, anti-slavery activist Frederick Douglass , and comic artist Alison Bechdel all have in common? They all wrote autobiographies, but they told very different life stories and had different motives for telling them. Historians tend to be skeptical of autobiographies because their authors are bound to be less than completely truthful in writing them. Still, they offer us a take on the past that is unique … and not just from the perspective of the famous or powerful. We can also find life stories written or told orally by ordinary people as well. This seminar will explore stories that people tell about their lives in different eras and cultures. We will address questions about how to read life stories for the historical truths they reveal (and conceal).",
        "prereq": []
    },
    {
        "code": "HIST 1921",
        "subject": "HIST",
        "id": "1921",
        "title": "Brexit and Decolonization",
        "info": "Among recent political moments, Brexit stands as one of the most confusing. From the shock vote in 2016 through the fall of two Prime Ministers and two general elections, Brexit has proven to be a paralyzing development in Britain, and a car-crash spectacle for the rest of the world.\n\nIn this seminar, we will work to understand Brexit not as a single event but as a part of the century-long process of decolonization. In 1900 Britain was the most powerful and important global force, claiming a quarter of the world’s land and population. By 2016, Britain was again reduced to a small island nation, more defined by its relationship to the US and Europe than its own power and importance. We will read through the history and theory of decolonization. This will lead to an understanding of how the breakup of the empire came to define contemporary Britain, and how Brexit is the culmination of that process. We will learn how to use empire, race, and nation as ways to critically read current events.",
        "prereq": []
    },
    {
        "code": "HIST 1922",
        "subject": "HIST",
        "id": "1922",
        "title": "From Crusaders to Communists",
        "info": "This interdisciplinary Freshman Seminar has two major goals. At the specific level, it will introduce freshmen to a particular region of Europe—Central Europe with a focus on the Czech lands and the city of Prague. The course will culminate with a trip to the Czech Republic over spring break where students will visit many of the sites they have examined in class. More broadly, though, the course will raise fundamental questions concerning social ideals, themes, and issues that are important in any cultural context: How does one create and sustain a thriving and equitable society? How does injustice manifest itself, and what are its remedies? What is the impact of war and violence? What specific challenges do migrants, refugees, and other outsider groups face? The course will run chronologically from the medieval past and early days of legend to the rise and ultimate collapse of Communism in the late twentieth century.  We will examine a wide range of topics from Hussite Crusaders, Renaissance Monsters and Nazi War Criminals.  ",
        "prereq": []
    },
    {
        "code": "HIST 1923",
        "subject": "HIST",
        "id": "1923",
        "title": "The Politics of Hunger",
        "info": "Food is a basic part of our everyday life, but it is difficult to see macro-level political economy behind food and hunger. This seminar gives a basic understanding of how “hunger” came to be understood and dealt with globally after WWII, how Cold-War geopolitics affected food shortage and surplus, how the global food system has gotten us where we are, and what new options are being pursued now. In all these stages, the US has played a central role in shaping the politics of food and hunger. The first part of the course exposes you to important concepts and issues related to politics around world hunger, American food aid, and multi-national agribusiness; students learn how to read texts closely and how to connect American food aid to global politics. The second part of the course helps you acquire research and communication skills; students learn how to conduct independent research and how to use a digital humanities tool called StoryMap. The course is composed of lectures, discussions, documentary film viewing, and research/StoryMap creation.",
        "prereq": []
    },
    {
        "code": "HIST 1924",
        "subject": "HIST",
        "id": "1924",
        "title": "Life, Liberty, and the Pursuit",
        "info": "In 1776, when Thomas Jefferson announced the goal of the new United States of America to be securing for all people the rights of \\\"Life, Liberty, and the Pursuit of Happiness,\\\" he was implicitly echoing the ideals of the new and modernizing culture that historians have come to call \\\"the Enlightenment.\\\" The eighteenth-century Enlightenment gave birth to a new sense of the human being and his and her place in the new naturalized understanding of society and government that was also articulated at this time. Jefferson's stress upon happiness as a human right also pointed to the new importance placed upon material pleasure and the permission to go after it (read: liberty even as it leads to libertinism and licentiousness). A time of profound philosophizing and scientific breakthroughs, the Enlightenment was just as often found in its wit, humor, and snarky take downs of traditional authorities and the pompous pretensions of the establishment. Jefferson illustrates well the serious side of Enlightenment, but just as emblematic was the freethinking Ben Franklin and the John Oliver style news-a-comedy circulated by the self-styled French philosophers Denis Diderot and Voltaire. This course will survey the highlights of Enlightenment conceived as that historical moment when our own free and pleasure-driven modernity was born, along with the science and philosophy that grounds it. Readings will focus on original Enlightenment texts, including philosophy and science, but also novels, bawdy dialogues, satirical poems and essays, paintings and engravings, plays, the autobiography of an emancipated slave, and an opera. Class sessions will be devoted to discussing the texts in light of their contemporary and historical resonances, and student work will focus on writing reflective and interpretive essays and commentaries asking and answering the questions \\\"what is Enlightenment?\\\" and \\\"how do we make ours really good!\\\" ",
        "prereq": []
    },
    {
        "code": "HIST 1925",
        "subject": "HIST",
        "id": "1925",
        "title": "Non-compliant Women",
        "info": "This course is a globally diverse study of “non-compliant” women through history starting in the 5th century BCE with the mathematician Hypatia through to modern works by Beyoncé and Warsan Shire and comic books by G. Willow Wilson and Kelly Sue DeConnick. Through primary sources and scholarly works, students will examine different women and groups of women from around the globe, who defied the norms or resisted the rules of the societies in which they lived. In the world of #metoo and with our first female vice president, it is particularly important to study how women have challenged the status quo and how history can inform our future efforts. The course will provide an introduction to feminist theory, and throughout the semester we will grapple with the relationship of feminist studies to issues of race, ethnicity, and trans-identity. Through the history of compliance and non-compliance, students will learn to interrogate the idea of history as progress, and how ideas about gender have been historically constructed.",
        "prereq": []
    },
    {
        "code": "HIST 1926",
        "subject": "HIST",
        "id": "1926",
        "title": "A History of Greater Minnesota",
        "info": "This freshman seminar will develop the topic of “Inequality, Polarization, and Social Change” as suggested by the CLA.  The course will cover the history of rural Minnesota from the 17th to the 21st century, and it will focus on how identities of ethnicity, race, and class were produced historically and then leveraged by social movements.  While many think of the state in terms of “Minnesota nice”, fewer are used to considering the history of rural Minnesota as radical - questioning and challenging the fundamental structures of society.  There are a number of topics this course will cover--from the rise and fall of the Farm-Labor movement to the emigration of Hmong people to the state.  As bookends, the course will begin with the many changes in the indigenous societies of Minnesota in the 18th and 19th century, and it will end with the events of 2020.  This seminar will utilize collections at the Minnesota Historical Society, the Mill City Museum, the American Swedish Institute, the Hmong Museum as well as collections held by the University of Minnesota library system. The UMN RATE system could be easily incorporated into the course assignments as the freshmen learn how to “do college” as so many of them describe it. The course will focus on rural Minnesota specifically to ask how the region participated in and then abandoned various social movements from Radical Republicanism to the Farm-Labor movement to present day Trumpism. In this process, the class will ask what a more just Minnesota could have and should look like.  We will also investigate the role of respectful disagreement in public discourse and whether direct or violent action can be justified in a democracy.    ",
        "prereq": []
    },
    {
        "code": "HIST 1927",
        "subject": "HIST",
        "id": "1927",
        "title": "Radical Ecology in Early US",
        "info": "Our current climate crisis calls for a rethinking of the way humans interact with the environment, but such efforts are not new: already in the nineteenth century, people warned about ecological destruction and called for a change in behavior toward the natural world.  This first-year seminar explores how different groups of people have understood and responded to environmental degradation in North America.  The focus will be on those who made urgent calls for a change in human behavior toward nature, from Indigenous peoples past and present to ecocentrist groups like Greenpeace and Earth First!  Topics include protests against ecological damage and loss, experiments in minimalism, the call for preservation and national parks, environmental racism and the environmental justice movement, and various forms of environmental activism.  Students will develop historically informed positions about an array of ecological options, experiments, viewpoints that preceded and shaped current forms of environmentalism.",
        "prereq": []
    },
    {
        "code": "HIST 1928",
        "subject": "HIST",
        "id": "1928",
        "title": "The Bright Ages",
        "info": "There is no such thing as the Dark Ages. Medieval European history is a thousand years long and contains all the complexity, the mess, and the human capacity for good and evil as any other place and time. And yet this period of history remains haunted by the ghosts of the Renaissance, the age of Imperialism, and even today’s TV shows like Vikings or Game of Thrones. How do historians craft new and more persuasive narratives about the past? How do we shape what people remember? In this class, students will work on how we tell stories about big periods in the past, focusing first on the battle against the so-called Dark Ages, but then looking at the ways ongoing battles about how to tell our stories from antiquity to now play out in the classroom, our political arenas, in our entertainments, and beyond.",
        "prereq": []
    },
    {
        "code": "HIST 1929",
        "subject": "HIST",
        "id": "1929",
        "title": "History Through Board Games",
        "info": "When pandemic lockdowns and restrictions forced people to stay at home beginning in 2020, sales of board games soared in the United States; they are still having something of a “moment” in our zeitgeist. This course uses board games—from the medieval game of chess, beloved by shahs and emperors alike, to the “family game night” classics like Monopoly, to complex and intricate strategy games of the 21st century—as tools to view and study the past and to reflect on the present. The first third of the course engages with global and social history with a grounding in historical methods and theory. The second third plunges students directly into practical gameplaying and analysis, where they will learn the salient aspects of modern board gaming. They will also connect with a local board game company, one of the nation’s leading game makers, to understand the burgeoning business and make connections with industry innovators. In the final part of class, students will culminate their learning by designing, testing, producing, a game of their own, based on a careful reading and understanding of primary and secondary source material.",
        "prereq": []
    },
    {
        "code": "HIST 1930",
        "subject": "HIST",
        "id": "1930",
        "title": "Democracy under Threat",
        "info": "Is democracy under threat? The upsurge of populist authoritarianism and racial nationalism around the globe in conjunction with recent assaults on traditional political institutions in the United States have raised concerns about the fate and future of democracy. Political scientists largely agree that the United States has become more democratic over the past two centuries, but results from the Authoritarian Warning Survey, a democratic-monitoring project, highlight the erosion of democratic principles and institutions in the past few years. Concerns about the meaning, nature, promise, stability or instability of democracy are, however, not new. In order to better understand contemporary threats to democracy this course explores how the meanings and understandings of democracy changed over the last few centuries by examining the complicated relationship between democracy, populism and racial nationalism. Is democracy a product of populism or imperiled by populism? What is the contemporary and historical relationship between democracy and racial nationalism? This seminar delves deeply into these questions by exploring a series of moments when the meanings and promise of democracy were contested. It begins with fundamental questions about the racial and gendered origins of American democracy. What is the relationship between the democratic state, the slave state and the settler colonial state? How did racial nationalism constitute and imperil American democracy from its origins? Populists, that is members of mass movements that claim to speak for \\\"the people,\\\" have struggled to both extend and redefine the limits of democracy. In these efforts, \\\"citizens\\\" have frequently been pitted against non-citizens making questions of immigration, naturalization, and detention central to contestations over democracy and its perceived threats. Moreover, in the United States, the relationship between detention and democracy can not be fully explored without paying significant attention to the rise of mass incarceration over the past half century. To what extent is the democratic state today threatened or maintained through the carceral state? \n\nStudent will engage with these issues through interdisciplinary lectures, course readings and discussions, and conversations with scholars, activists and organizations fostering democratic values and racial justice.\n\nThis course comes out of the Democracy under Threat Interdisciplinary Collaborative Workshop. Students will be invited to all Democracy under Threat events during the 2019-2020 academic year, including a Spring 2020 Conference, \\\"Democracy under Threat in Times of Populism and Racial Nationalism\\\" that will be held at the University of Minnesota in partnership with Howard University, Morehouse College, and Spelman College. ",
        "prereq": []
    },
    {
        "code": "HIST 1931",
        "subject": "HIST",
        "id": "1931",
        "title": "Monkey King: The Novel",
        "info": "In this course, we will look at both the sources for and the afterlives of the great Chinese novel, Xiyouji, sometimes translated into English as Journey to the West, and sometimes as Monkey or The Monkey King. The novel traces the journey of four pilgrims--a hapless monk, a mischievious monkey, a gluttonous pig, and a sand spirt--from China to India to gain Buddhist scriptures. They have many humorous adventures. (There is nothing quite like humor to demonstrate the impermanence of things.) The story of the Monkey King has been beloved by Chinese readers, theater goers, movie patrons, and television audiences for centuries.  We will begin by reading a modern abridgement of the novel. We will look at questions such as: What is the nature of the humor in the novel? Why has the Monkey King been such a beloved figure in Chinese popular culture? What can we learn about Chinese society from this novel and its adaptations? All reading will be in English; no prior knowledge of Chinese culture is assumed.",
        "prereq": []
    },
    {
        "code": "HIST 1932",
        "subject": "HIST",
        "id": "1932",
        "title": "Memory & Monuments in the US",
        "info": "The murder of George Floyd sparked intense activism in solidarity with the Black Lives Matter movement around monuments to white supremacy and colonialism. Protesters targeted statues glorifying Confederate generals, the Lost Cause, and racist oppression in dozens of communities. Protesters in Richmond and St. Paul toppled statues of Christopher Columbus, and several other cities, including Columbus, Ohio, removed their statues preemptively. These other anti-racism protests mark dramatic struggles over historical memory that spiked in the wake of the rally in Charlottesville in 2017.\n\nHow do people arrive at their understandings of what happened in the past?  This seminar focuses on how historical interpretations are negotiated through commemorations, monuments, museums, reenactment, film, and other access points to history.  Foregrounding issues of race, class, ethnicity, and gender, we will explore debates surrounding the production of historical interpretation memory.  Public contests over historical meaning in relation to colonialism, events such as the Civil War, World War II, and 9/11 and even over the naming of places such as battlefields highlight the contested nature of history as well as the powerful hold of historical interpretation.",
        "prereq": []
    },
    {
        "code": "HIST 3000",
        "subject": "HIST",
        "id": "3000",
        "title": "New Topics in History",
        "info": "Courses on new topics in history, historical topics related to current events, and other special subjects. Contact the History department for current listings.",
        "prereq": []
    },
    {
        "code": "HIST 3001",
        "subject": "HIST",
        "id": "3001",
        "title": "Public History",
        "info": "Interpretations of collective past as produced in public venues, including museum exhibitions, films, theme parks, websites. Intellectual and political issues in history produced for public audiences. Career opportunities.",
        "prereq": []
    },
    {
        "code": "HIST 3011",
        "subject": "HIST",
        "id": "3011",
        "title": "Quantitative Methods",
        "info": "Basics of quantitative historical data collection, measurement, analysis.",
        "prereq": []
    },
    {
        "code": "HIST 3013",
        "subject": "HIST",
        "id": "3013",
        "title": "Intro World History",
        "info": "The world today and its recent past. Cold War; expansion of the American and Soviet economic, political, and cultural systems, dominant culture and minority questions; contemporaneous developments in the Third World; global order; movements for peace, ecology, and human rights.",
        "prereq": []
    },
    {
        "code": "HIST 3020",
        "subject": "HIST",
        "id": "3020",
        "title": "Hands-On History Topics",
        "info": "Selected topics for the practice of Methods and Practices in History not covered in regular courses. ",
        "prereq": []
    },
    {
        "code": "HIST 3021",
        "subject": "HIST",
        "id": "3021",
        "title": "Global Apartheid",
        "info": "The years 1989 and 1990 saw the fall of the Berlin Wall and the release of Nelson Mandela from prison, respectively. These events are emblematic of a changing world order which saw the dismantling of apartheid even as racialized separation, oppression, and exploitation went global. In a world increasingly characterized by separations and divisions (made visible in the proliferation of physical walls and the hardening of borders) between rich and poor, between the privileged and the disenfranchised, between those whose lives matter and those who are understood to be entirely expendable, this course asks students to think about historical constructions of difference (such as race and gender), and about the past and History in relationship to the challenges of the present and towards a future yet to come.\n\nThis course will introduce history majors to the methods and practices of historical knowledge production and to the philosophy of history. While attending to the work of history, and historiography, this course will also ask what history is for and what the historian does in research (as the detective and the archivist), in writing (as the storyteller and the analyst), and in (critical) thought (as the teacher and the philosopher).",
        "prereq": []
    },
    {
        "code": "HIST 3022",
        "subject": "HIST",
        "id": "3022",
        "title": "The 1960s: A Decade of Change",
        "info": "The 1960s was a decade of hope, fear and incredible change. These years witnessed the rise of race, youth, gender, and anti-war movements in the wake of a hot Cold War and a series of anticolonial revolutions. The course offers students a deep introduction to this fascinating decade in US history. This methods and skills course also fulfills a departmental requirement for all History majors. Through the study of the 1960s, students will be introduced to the methods and skills historians have used to write this history. This course also offers students an opportunity to think deeply about the purpose, meaning, significance, and work of history. Students will leave this course with a deeper understanding of a significant moment in US history and a fuller understanding of the exciting and powerful work of history.",
        "prereq": []
    },
    {
        "code": "HIST 3023",
        "subject": "HIST",
        "id": "3023",
        "title": "Hands-On History: Seminar",
        "info": "HIST 3023 introduces history majors to the methods and practices of historical knowledge production and to a critical engagement with the philosophy/theory of history.  Students will explore a range of the methods by which historians go about the work of producing historical knowledge: how they identify and analyze primary sources, engage with existing scholarship (secondary sources) on a particular line of inquiry, convey their findings, and argue for an original contribution to the historiography (the scholarly conversation about a topic).  Students will learn about critical and philosophical assessments of history as a discipline and its epistemologies (or ways of knowing). \n\nWhat does it mean to study and teach history in particular social and political contexts?  What are the possibilities and limits of the study of history?  What is the historian’s task? How do historians know what they know? What methods and skills do historians use? This course introduces history majors (and non-majors) to the methods and practices of historical knowledge production and to the philosophy/theory of history. Put slightly differently, the course will introduce students to the work/craft of history as thought and methodology. It will also encourage students to think about history (as discipline, method) critically, to address questions such as: What is history for and what does the student of history/the historian do in research (as the detective and the archivist), in writing (as the storyteller and the analyst), and in (critical) thought (as the teacher and the philosopher)? What does it mean to teach/study history in a time of struggle? What are the possibilities and limits of history? In short, the course explores what historians do, and what history is for.\n",
        "prereq": []
    },
    {
        "code": "HIST 3051",
        "subject": "HIST",
        "id": "3051",
        "title": "Ancient Civ: Near East & Egypt",
        "info": "A broad survey of ancient Near Eastern and Egyptian history and culture from the prehistoric to the rise of Persia around 550 B.C.",
        "prereq": []
    },
    {
        "code": "HIST 3052",
        "subject": "HIST",
        "id": "3052",
        "title": "Anc. Civ.: Greece",
        "info": "A broad survey of ancient Greek culture and history from the third millennium B.C. to the death of Alexander the Great in 323 B.C.",
        "prereq": []
    },
    {
        "code": "HIST 3053",
        "subject": "HIST",
        "id": "3053",
        "title": "Anc.Civ.:Rome",
        "info": "A broad survey of the culture and history of Rome from its origins to the decline and fall of the Roman Empire in the third and fourth centuries A.D.",
        "prereq": []
    },
    {
        "code": "HIST 3054",
        "subject": "HIST",
        "id": "3054",
        "title": "Ancient Egypt and Neighbors",
        "info": "Ancient Egypt exerts fascination upon modern societies, as it did upon its ancient contemporaries. The decipherment of the hieroglyphic script, in the early 19th century CE, opened the way to recovering its history all the way back to the invention of the writing system more than 5,000 years ago. Ancient Egypt has meanwhile been a special focus of racialized interpretations of civilization, from the birth of modern Egyptology onward. Europeans of the colonial age saw Egyptian civilization as an anomaly in Africa, measured excavated skulls in an effort to prove its extraneous origins and segregated it from its geographic context. But Egyptian civilization did not develop in isolation. Rather it developed in concert with its neighbors upstream along the Nile, across adjacent deserts and seas, and over the land bridge to southwestern Asia. Its most important neighbor in northeastern Africa was the land of Kush (Nubia), where a series of cultures and states co-evolved with those of Egypt. Archaeological exploration continues to add to our knowledge of these interconnected pasts. This course will examine the history of Egypt, Kush, and adjacent regions from the late 4th millennium BCE, when the first states formed in the Nile Valley, to the late first millennium BCE, when Egypt fell under Roman rule while the kingdom of Meroe ruled the upper Nile. While the civilizations of northeastern Africa are the focus, the course will also examine their interactions with cultures of the Near East and Eastern Mediterranean. Since knowledge of ancient societies is derived from the texts and artifacts they produced, complete with their original context so far as possible, this course will emphasize primary sources, including texts (in translation), images, and archaeological remains.\nThere are no prerequisites for the course; the only preparation necessary consists in college-level writing skills, and readiness to learn new information. Be advised that the study of ancient history requires learning a great number of foreign names and terms, as well as a lot of dates. One cannot understand relations between events and phenomena, in particular relations of cause and effect, without knowing their chronology, the participants involved, and their locations. Students must therefore learn the geography of the regions under discussion, the dates of events and periods during the three millennia the course covers, the names of populations and individual persons, and terms pertaining to the subjects of study. These kinds of information form the basis for knowledge and meaningful inquiry.",
        "prereq": []
    },
    {
        "code": "HIST 3061",
        "subject": "HIST",
        "id": "3061",
        "title": "Spectacles in Antiquity",
        "info": "Development of large-scale public entertainments in ancient Mediterranean world, from athletic contests of Olympia and dramatic festivals of Athens to chariot races and gladiatorial games of Roman Empire. Wider significance of these spectacles in their impact on political, social, and economic life of the societies that supported them.",
        "prereq": []
    },
    {
        "code": "HIST 3066",
        "subject": "HIST",
        "id": "3066",
        "title": "Pathways to Civilization",
        "info": "How did complex urban societies first develop? This course addresses this question in ten regions of the world, including Maya Mesoamerica, Inca South America, Sumerian Near East, Shang Civilization in East Asia and early Greece and Rome.",
        "prereq": []
    },
    {
        "code": "HIST 3067W",
        "subject": "HIST",
        "id": "3067W",
        "title": "Arch. of Prehistoric Europe",
        "info": "How archaeologists analyze/interpret artifacts to develop knowledge about formation of European society, from earliest evidence of human occupation to Roman period.",
        "prereq": []
    },
    {
        "code": "HIST 3081W",
        "subject": "HIST",
        "id": "3081W",
        "title": "World Christianity: 100-1400",
        "info": "This course surveys the history of Christianity from its status as a persecuted minority religion of the Roman Empire to its dominant role in medieval Europe and Byzantium. We study Christian traditions in Asia and Africa as well as Europe with special attention to the relationship between Christianity and culture in the ancient and medieval world.",
        "prereq": []
    },
    {
        "code": "HIST 3082W",
        "subject": "HIST",
        "id": "3082W",
        "title": "World Christianity, 1300-1800",
        "info": "This course, which requires no prerequisite, examines developments in the history of Christianity from the beginning of the fourteenth century to the end of the eighteenth. We will start our investigation by considering the Latin church with its headquarters in Rome at the height of its power and influence. We will then trace its development through the crises of the fourteenth century and its subsequent transformation during the Reformation and the Confessional era. We will close by considering new challenges facing the church in an age of Enlightenment and Revolution. Though our geographic center of gravity will be in Europe, we will follow the expansion of Christianity into the Asian, African and American worlds and how developments here changed the nature of the church back in Europe. We will study religion as a phenomenon that affects human activity in a broad spectrum of area and activities. Though we will investigate formal matters of belief, significant attention will be given to Christianity as a “lived experience,” how faith affected the everyday life of men and women in the premodern world.",
        "prereq": []
    },
    {
        "code": "HIST 3092",
        "subject": "HIST",
        "id": "3092",
        "title": "Jesus in History",
        "info": "Does time, place, and culture affect our picture of Jesus? We'll start by constructing our own Jesus story and then go backwards in time to examine modern times (film, music, and modern art), pre-Civil War America (views of Jesus from enslaved people and their enslavers), Renaissance and Medieval Europe and North Africa (art and architecture), and finally end with the ancient world (art and writings about Jesus, including the biblical gospels). No background in religious studies required, and students of any, all, or no religious background are welcome.",
        "prereq": []
    },
    {
        "code": "HIST 3101",
        "subject": "HIST",
        "id": "3101",
        "title": "Intro to Med Hist",
        "info": "Europe from decline of Rome to early Renaissance. Politics, institutions, society, economy, and culture of Middle Ages.",
        "prereq": []
    },
    {
        "code": "HIST 3102",
        "subject": "HIST",
        "id": "3102",
        "title": "Medieval Tales/Modern Echoes",
        "info": "Knights of Round Table, dragon-slayers, magic djinn, pilgrims in Hell. How stories have been retold in modern fiction, film, arts. Texts from Europe/other regions of globe.",
        "prereq": []
    },
    {
        "code": "HIST 3151W",
        "subject": "HIST",
        "id": "3151W",
        "title": "British History I",
        "info": "The making of the English nation: Anglo-Saxons and Normans; development of English law and Parliament; Reformation and constitutional crisis; early Wales, Scotland, and Ireland.",
        "prereq": []
    },
    {
        "code": "HIST 3152",
        "subject": "HIST",
        "id": "3152",
        "title": "British History II",
        "info": "Civil War, Revolution, and constitutional settlement. Industrialization and growth of democracy. Rise/decline of British Empire.",
        "prereq": []
    },
    {
        "code": "HIST 3211",
        "subject": "HIST",
        "id": "3211",
        "title": "History of Sexuality in Europe",
        "info": "History of sexuality in Europe, from ancient Greece to present. Plato's philosophy of love, St. Augustine's conception of sin, prostitution in 15th century, sexual science of Enlightenment. Industrial revolution and homosexual subcultures. Rape scares and imperialism. Eugenics and Nazi Germany.",
        "prereq": []
    },
    {
        "code": "HIST 3212",
        "subject": "HIST",
        "id": "3212",
        "title": "Dissident Sexualities in U.S.",
        "info": "History of sexuality in United States. Emphasizes sexualities that have challenged dominant social/cultural norms. Development of transgender, bisexual, lesbian, gay identities/communities. Politics of sex across lines of race/ethnicity. Historical debates over controversial practices, including sex work.",
        "prereq": []
    },
    {
        "code": "HIST 3244",
        "subject": "HIST",
        "id": "3244",
        "title": "Eastern Europe",
        "info": "History of the peoples of the region from their origins to modern times, culture and society in the Middle Ages; Golden Age of Eastern Europe; loss of independence; nationalism and formation of national states; fascism and World War II, Jews in Eastern Europe; communist and post-communist periods.",
        "prereq": []
    },
    {
        "code": "HIST 3251",
        "subject": "HIST",
        "id": "3251",
        "title": "Europe and American Challenge",
        "info": "European response to social, political, cultural influence of the United States in Europe in 20th century. Historical studies, diplomatic memoirs, literature, films, film criticism.",
        "prereq": []
    },
    {
        "code": "HIST 3264",
        "subject": "HIST",
        "id": "3264",
        "title": "Imperial Russia",
        "info": "Interaction with Europe/Asia. Attempts at modernization/ reform. Emancipation of serfs/rise of revolutionary movements.",
        "prereq": []
    },
    {
        "code": "HIST 3265",
        "subject": "HIST",
        "id": "3265",
        "title": "20th Century Russia",
        "info": "Analysis of factors that led to collapse of tsarist regime. 1917 revolution. Evolution of Soviet regime/collapse of Soviet communism. Emphasis on role of nationalities/rise of Commonwealth of independent states.",
        "prereq": []
    },
    {
        "code": "HIST 3271",
        "subject": "HIST",
        "id": "3271",
        "title": "The Viking World",
        "info": "Viking society and expansion of Viking influence abroad. Viking impact on Western Europe; interactions with Slavic lands; settlement of North Atlantic islands; and Western Europe's impact on Scandinavian lands. Analyzes archaeological, historical, linguistic, and numismatic evidence.",
        "prereq": []
    },
    {
        "code": "HIST 3281",
        "subject": "HIST",
        "id": "3281",
        "title": "European Intellectual Hist I",
        "info": "First of a two-semester course. European thought in its historical/cultural context. Emphasizes development of philosophical/scientific thought, its relation to thinking about the individual and the community. Readings from original sources.",
        "prereq": []
    },
    {
        "code": "HIST 3282",
        "subject": "HIST",
        "id": "3282",
        "title": "European Intellectual Hist II",
        "info": "Second of a two-semester course. European thought in its historical/cultural context. Emphasizes development of philosophical/scientific thought, its relation to thinking about the individual and the community. Readings are from original sources.\n",
        "prereq": []
    },
    {
        "code": "HIST 3283",
        "subject": "HIST",
        "id": "3283",
        "title": "Marx, Capital, and History",
        "info": "Explore Marx's understanding of capitalism/its history. Marx's argument regarding historical specificity of capitalism as economic/social condition.",
        "prereq": []
    },
    {
        "code": "HIST 3284W",
        "subject": "HIST",
        "id": "3284W",
        "title": "History through Memoir",
        "info": "Memoirs--non-fictional life stories--offer an intriguing lens into the past. Memoirs vividly portray a person's experiences, but they also raise questions about the reliability of the narrator. What kinds of histories are memoirs? We will read memoirs about experiences of race, class, gender in America. Students write their own short memoir.  ",
        "prereq": []
    },
    {
        "code": "HIST 3285",
        "subject": "HIST",
        "id": "3285",
        "title": "Magic and Medicine",
        "info": "Course examines how the line between magic and medicine has changed over time. From accusations of witchcraft to proclamations of scientific breakthrough, we will examine the relationship between the supernatural and the natural from the early modern period to today. Specific topics include the practice of exorcism, the concept of the \\\"four humors,\\\" the persecution of witches, the development of \\\"voodoo,\\\" the effectiveness of placebos, and the professionalization of medicine. Throughout, we will ask how gender, class, and race have affected the construction of \\\"magic\\\" and \\\"medicine.\\\"",
        "prereq": []
    },
    {
        "code": "HIST 3286",
        "subject": "HIST",
        "id": "3286",
        "title": "Galileo and Modern Science",
        "info": "The life and work of Galileo Galilei (1564-1642), often called the \\\"founder of modern science.\\\" Topics: the Renaissance Italian context for Galileo's work; the arrangements of authoritative knowledge that prevailed in 16th-century Tuscany and Venice, the role that universities, the Catholic church, learned academies, and the state played in disciplining knowledge. We consider the episodes of Galileo's career and read his seminal texts with secondary commentaries upon them. Topics: his telescopic observations of 1609-10; his battles with Aristotelian natural philosophy; his experiments and arguments on behalf of experimental and mathematical physics; his defense of Copernican \\\"heliocentric\\\" cosmology and his trial and condemnation by the Roman Catholic Church for heresy; and his work in mathematics and mathematical physics that paved the way for Newton and Einstein. The goal will be to understand the achievements of Galileo in their specific historical and cultural context and to use these reflections for thinking about the nature of the modern science that he helped to initiate.",
        "prereq": []
    },
    {
        "code": "HIST 3287",
        "subject": "HIST",
        "id": "3287",
        "title": "Seeing History through Comics",
        "info": "Comic-form histories offer new perspectives on the past. Focusing on cases of contentious history, this course will examine how varying perspectives (shaped by class, gender, race, or geo-political position) appear in comic histories. We will compare comic accounts with more traditional forms of historical analysis of select contentious events of modern U.S., European, African and East Asian history.",
        "prereq": []
    },
    {
        "code": "HIST 3347",
        "subject": "HIST",
        "id": "3347",
        "title": "Women in Early America",
        "info": "Varied experiences of American women 1600-1900. Topics include women's involvement in dispossession of native peoples, westward expansion, slavery, industrialization, reform, revolution, transformations in family life/sexuality.",
        "prereq": []
    },
    {
        "code": "HIST 3348",
        "subject": "HIST",
        "id": "3348",
        "title": "Women and Gender in Modern US",
        "info": "This course covers how gender and gender inequality have mattered to the US economy, politics, and cultural life. Themes include: femininity and masculinity as disciplining people, the intersection of gender with whiteness and race, the significance of paid and unpaid labor in women’s lives, and diversity within the category of women.  ",
        "prereq": []
    },
    {
        "code": "HIST 3349",
        "subject": "HIST",
        "id": "3349",
        "title": "U.S. Women's Legal History",
        "info": "Women's legal status, from colonial era through 20th century. Women's citizenship, civil rights. Marriage, divorce, and child custody. Reproductive/physical autonomy/integrity. Economic/educational equality.\n\nprereq: Soph or jr or sr",
        "prereq": []
    },
    {
        "code": "HIST 3351",
        "subject": "HIST",
        "id": "3351",
        "title": "Women and Diasporas",
        "info": "Persistence of racial and ethnic identities as markers of diasporic consciousness. Comparing diasporas across time using social/cultural analysis. Gendering of lives/identities of people whose identities have been shaped by forced/free migrations of past 500 years.",
        "prereq": []
    },
    {
        "code": "HIST 3361W",
        "subject": "HIST",
        "id": "3361W",
        "title": "World War I: A Global History",
        "info": "This class takes a global approach to the examination of the causes and consequences of World War I. We will look at how the war unfolded in Europe, Africa, and the Middle East. We will also explore the war's impact on North America and Australasia, areas drawn into the conflict because of their unique relationships with Britain and France. We will consider the special role played by the U.S. in restoring world peace and analyze the lasting social and political cleavages occasioned by the war. We will get at the heart of how the war was fought and how it is remembered for all of its triumphs and tragedies.",
        "prereq": []
    },
    {
        "code": "HIST 3362",
        "subject": "HIST",
        "id": "3362",
        "title": "Global History of World War II",
        "info": "This course examines 1) how different countries remember World War II and how memories of the war have been shaped by domestic and international contexts of each country, and 2) how WWII changed the world in areas of human rights, the government-society relations, and ethical use of science and technology. Various faculty members with different geographical and thematic expertise come to the class as guest lecturers throughout the semester.",
        "prereq": []
    },
    {
        "code": "HIST 3363",
        "subject": "HIST",
        "id": "3363",
        "title": "Global History of the Cold War",
        "info": "This course examines the origins, unfolding, and end of the Cold War, with emphasis on both geopolitical conflict and its social and cultural expressions. It begins with an examination of the ideological tensions between the USSR and USA and then turns to the end of European hegemony and de-colonization across Asia and Africa. It examines the expansion of the American empire and the appearance of new communist nations in Asia, Africa, and Latin America. While we will spend time on wars, insurgencies, and alliances, we will also examine how competing blocs and their members bound themselves through trade and economic interdependencies and how they represented themselves, their ideals, and the cold war itself in the sports, music, literature and film. The course ends with the collapse of the Soviet Union and a survey of Cold War traces in the fields of geopolitics and culture.",
        "prereq": []
    },
    {
        "code": "HIST 3401W",
        "subject": "HIST",
        "id": "3401W",
        "title": "Early Latin America to 1825",
        "info": "Societies of Americas, Spain, and Portugal before contact. Interactions among Native Americans, African slaves, and Europeans, from colonization through independence. Religion, resistance, labor, gender, race. Primary sources, historical scholarship.",
        "prereq": []
    },
    {
        "code": "HIST 3402W",
        "subject": "HIST",
        "id": "3402W",
        "title": "Latin Am 1825-Pres",
        "info": "National and contemporary period 1825 to present, with emphasis on social, cultural, political, and economic change.",
        "prereq": []
    },
    {
        "code": "HIST 3411W",
        "subject": "HIST",
        "id": "3411W",
        "title": "Family History",
        "info": "How family life has played and continues to play a major role in world history. Lectures, labs, assignments.\n\nprereq: Jr or sr or at least 60 cr",
        "prereq": {
            "code": "HIST 60",
            "subject": "HIST",
            "id": "60"
        }
    },
    {
        "code": "HIST 3412",
        "subject": "HIST",
        "id": "3412",
        "title": "Soccer: Around the World",
        "info": "How did a kicking game played in a few English schools in the mid-nineteenth century go on to become the most popular organized pastime the world has ever known? In this class, we chart soccer's unlikely rise to global prominence and explore what it can tell us about people, games, and ethics all around the world today.",
        "prereq": []
    },
    {
        "code": "HIST 3413",
        "subject": "HIST",
        "id": "3413",
        "title": "War in History",
        "info": "War has been a standard tool for organizing societies, settling disputes, and securing resources. The means and meaning of war have changed in important ways over time and we see very different historical outcomes across different societies. This course exams differences in war making across many societies in Europe, Asia, the Americas, and Africa from 10,000 BC to now.",
        "prereq": []
    },
    {
        "code": "HIST 3414",
        "subject": "HIST",
        "id": "3414",
        "title": "Religion & Empire 1500-1900",
        "info": "Christian evangelism functioned as major justification for European expansion/imperialism. How interactions between missionaries/non-European \\\"converts\\\" wrought social, political, religious transformations in early modern world.",
        "prereq": []
    },
    {
        "code": "HIST 3415",
        "subject": "HIST",
        "id": "3415",
        "title": "Global Migrations",
        "info": "This is a liberal education course that emphasizes particular learning outcomes while developing students’ historical and global perspectives. The purpose of HIST 3415 is dispel the impression, common among students, that North America is in some sense unique in its long history of international migrations. The course examines a history of human mobility that stretches from the earliest days of human life on earth down to the present and that begins in Africa before extending to case studies of migrants living and adapting to new social, cultural, and physical environments in every part of the world. Along the way, it introduces students to the intersection of history, humanities and social sciences as ways of knowing about the past and analyzing the present and encourages students to encounter, evaluate, and interpret the past through the use of primary sources.  ",
        "prereq": []
    },
    {
        "code": "HIST 3416",
        "subject": "HIST",
        "id": "3416",
        "title": "Imperialism and its Critics",
        "info": "Significant episodes of several imperial nations to underscore themes of ethics/literature.",
        "prereq": []
    },
    {
        "code": "HIST 3417W",
        "subject": "HIST",
        "id": "3417W",
        "title": "Food in History",
        "info": "Significance of food in society, from earliest times to present. Why we eat what we eat. How foods have been \\\"globalized.\\\" Dietary effects of industrial modernity. Material culture, social beliefs. Examples from around world.",
        "prereq": []
    },
    {
        "code": "HIST 3418",
        "subject": "HIST",
        "id": "3418",
        "title": "Drink in History",
        "info": "Significance of alcohol and stimulating beverages. Interdisciplinary study of alcohol/prohibition regimes throughout history.",
        "prereq": []
    },
    {
        "code": "HIST 3419",
        "subject": "HIST",
        "id": "3419",
        "title": "History of Capitalism",
        "info": "Causes of economic inequities in contemporary world. Long-term economic developments in cases taken from Africa, Asia, Europe, and North/South America. Various theoretical approaches to study of economic development. Introduction to key concepts.",
        "prereq": []
    },
    {
        "code": "HIST 3421",
        "subject": "HIST",
        "id": "3421",
        "title": "World & the West",
        "info": "Survey of the political, economic, religious, and cultural interaction between the peoples of Europe and the peoples of Africa, the Americas, and Asia, with reference to perceptions of alien cultures by both sides.",
        "prereq": []
    },
    {
        "code": "HIST 3422",
        "subject": "HIST",
        "id": "3422",
        "title": "World Hist 20th Cen",
        "info": "Analyzes the major events in 20th-century global history in comparative or cross-cultural context. The decline of Western imperialism, the rise of total war and totalitarianism, nationalism and nation-building are among the key topics.",
        "prereq": []
    },
    {
        "code": "HIST 3423",
        "subject": "HIST",
        "id": "3423",
        "title": "Central American Revolutions",
        "info": "Social, political and economic issues that have shaped Central American history for nearly two centuries. Focuses on influences of colonial histories, capitalist development, ethnic/racial conflict, foreign intervention, Catholic Church, civil war throughout region. Readings cover events in Guatemala, Honduras, El Salvador, Nicaragua, Costa Rica, Panama.",
        "prereq": []
    },
    {
        "code": "HIST 3424",
        "subject": "HIST",
        "id": "3424",
        "title": "Wom/Gen Lat Am Hist",
        "info": "Changing gender norms in Latin America over time as compared with lives of women and men of diverse classes and ethnic groups. How women responded to their position in society, on a continuum from accommodation to resistance.",
        "prereq": []
    },
    {
        "code": "HIST 3425",
        "subject": "HIST",
        "id": "3425",
        "title": "Modern Mexico",
        "info": "Mexico from independence to the present: struggles for land, liberty, and equality; ethnicity, gender, and class; economic growth, nationalism, and globalization; urbanization, immigration, demographic transition. Issues of race, religion, and national identity; the US-Mexico War, the 1910 Mexican Revolution, urbanization, migration, free trade agreements, and the War on Drugs.",
        "prereq": []
    },
    {
        "code": "HIST 3426",
        "subject": "HIST",
        "id": "3426",
        "title": "Piracy in the Mediterranean",
        "info": "This course will use the vehicle of piracy and privateering in the Mediterranean world to explore issues of cross-cultural interaction, global connections, and identity from earliest times when people took to the sea to the Middle Ages through the early modern era, 500-1800. Wherever there was trade, wherever there was movement on the seas, there was piracy. Recent scholarship on the Mediterranean has focused on connectivities, micro-environments, the uniqueness of islands, and various climatic spheres in a geographic tradition that follows the path-breaking work of Fernand Braudel. This course will consider the urban and rural dimensions of the Mediterranean region as they relate to the history of merchants and pirates. Finally, the political and military aspects of Mediterranean history will be examined. There was a continuum from piracy to privateering to war. Students should gain a deeper understanding of a region that continues to fascinate us today.",
        "prereq": []
    },
    {
        "code": "HIST 3427",
        "subject": "HIST",
        "id": "3427",
        "title": "Cuba & Puerto Rico",
        "info": "Historical development of Cuba and Puerto Rico from pre-Columbian times through Spanish conquest to the present. Conquest and colonization, slavery, Hispanic Caribbean society and culture, Operation Bootstrap, Cuban\nRevolution.",
        "prereq": []
    },
    {
        "code": "HIST 3428",
        "subject": "HIST",
        "id": "3428",
        "title": "US-Mexico Relations",
        "info": "U.S.-Mexico relations in the 19th and 20th centuries. Examines histories as they intersect in the late 1820s through the loss of Texas, the Mexican-American War, and economic relations between the two countries including NAFTA and the Chiapas rebellion of 1994.",
        "prereq": []
    },
    {
        "code": "HIST 3429",
        "subject": "HIST",
        "id": "3429",
        "title": "Lat Am History in Film & Text",
        "info": "Cinematic representations of Latin America in context of other historical/literary narratives. Experiences of Latinos in Hollywood. U.S. films compared with those produced in Latin America. Themes vary (e.g., women, revolution, colonialism).",
        "prereq": []
    },
    {
        "code": "HIST 3431",
        "subject": "HIST",
        "id": "3431",
        "title": "Early Africa",
        "info": "Survey of African history from earliest times to 1800. Focuses on socioeconomic, political, and cultural development in pre-colonial Africa from ancient Egypt through the era of the trans-Atlantic slave trade.",
        "prereq": []
    },
    {
        "code": "HIST 3432",
        "subject": "HIST",
        "id": "3432",
        "title": "Modern Africa",
        "info": "Survey of modern African history from early 19th century to present. Focuses on socioeconomic, political, and cultural development in Africa, from abolition of trans-Atlantic slave trade through postcolonial era.",
        "prereq": []
    },
    {
        "code": "HIST 3433",
        "subject": "HIST",
        "id": "3433",
        "title": "Images of Africa",
        "info": "Major themes in African history, from early human development to present.  History of western \\\"knowledge\\\" about Africa. Assumptions that have influenced production of African history. Extent to which African history is \\\"packaged\\\" for public consumption inside/outside Africa. How history is used to support modern political agendas.",
        "prereq": []
    },
    {
        "code": "HIST 3434",
        "subject": "HIST",
        "id": "3434",
        "title": "South Africa to 1910",
        "info": "Introduction to history of South Africa from early humans to arrival of first Dutch settlers at Cape of Good Hope in 1652 to formation of Union of South Africa in 1910.",
        "prereq": []
    },
    {
        "code": "HIST 3435",
        "subject": "HIST",
        "id": "3435",
        "title": "Hist of South Africa from 1910",
        "info": "We are all living in extraordinary times. But what does that mean? In South Africa, we have seen the COVID-19 pandemic and the measures implemented to control it causing massive social upheaval and personal distress. It has forced the people in the country to confront issues that life prior to the pandemic had made easy to turn away from. Misogyny, gender based violence and sexual violence – a long-standing emergency in the south of Africa – have been forced into our vision once again. It was not the pandemic that created this violence. Nor was it the first time people had been outraged by a lack of action to address it. In the years approaching 2020, calls, protests and demonstrations were increasingly demanding the culture of impunity in gender based violence be ended; sometime with violent outcomes against the protestors themselves. Over those same years, nationwide protests have rocked South Africa’s university campuses. The student movements known as #RhodesMustFall, #FeesMustFall and #RUReferenceList highlight the contrasts and disappointments of the recent past in South Africa, confront the legacy of racism and misogyny in its institutions and knowledge systems, and resonate with a history of anti-racism and struggle that now, in turn, similarly fuel the on-going Black Lives Matter and #MeToo movements worldwide.",
        "prereq": []
    },
    {
        "code": "HIST 3436",
        "subject": "HIST",
        "id": "3436",
        "title": "Fighting for African History",
        "info": "Open any newspaper and there is almost certain to be one or more articles about crises or chaos in Africa.  Journalistic accounts highlight famines, “tribalism,” failed states, ethnic cleansing, the plight of refugees and the AIDS pandemic.  There rarely, if ever, is a serious discussion of the underlying causes of this instability.  Instead, it is implicitly assumed that this is the natural order of events in the “Dark Continent.”  This course challenges the racially inspired cultural arrogance which underlies assumptions about Africa and explores it with the long-term structural and historical roots of the crises which confront many parts of Africa.  It is a course about Africans and how they responded to the challenges and legacies that date back to the colonial period and before.  Throughout this course we will be concerned with African initiatives in a rapidly changing political, economic, social, and ideological context and the changing ways that the Global North has represented Africa. In doing so we will be fight for a more accurate history of Africa.",
        "prereq": []
    },
    {
        "code": "HIST 3437",
        "subject": "HIST",
        "id": "3437",
        "title": "History of East Africa",
        "info": "Major themes in history of East Africa, from era of early human cultural development to present. Methods that historians use to reconstruct history. Varying interpretations/constructions of history over time.",
        "prereq": []
    },
    {
        "code": "HIST 3438",
        "subject": "HIST",
        "id": "3438",
        "title": "Hist of Women in South Africa",
        "info": "Changing role/status of women in South Africa from pre-colonial era to present. Relationships to political, social, economic development.",
        "prereq": []
    },
    {
        "code": "HIST 3439",
        "subject": "HIST",
        "id": "3439",
        "title": "African Past-Popular Narrative",
        "info": "Diverse ways that ordinary Africans have interpreted/portrayed particular events in African history. Different popular depictions of African past, their relationships with academic histories.",
        "prereq": []
    },
    {
        "code": "HIST 3441",
        "subject": "HIST",
        "id": "3441",
        "title": "History to 1900",
        "info": "History of the Mexican people from the 16th through the 19th centuries. Historical theories of colonialism, expansion, economy, assimilation, migration, and settlement; race, class and gender, political, social, and cultural interaction and conflict. ",
        "prereq": []
    },
    {
        "code": "HIST 3442",
        "subject": "HIST",
        "id": "3442",
        "title": "History 1900-Prsnt",
        "info": "Migration, repatriation, the Bracero program, contemporary Chicana/o politics, the Chicana/o movement, work, society, and culture. Lecture format with 2-3 videos/movies on selected topics. A wide range of reading from texts and articles.",
        "prereq": []
    },
    {
        "code": "HIST 3444",
        "subject": "HIST",
        "id": "3444",
        "title": "Chicana and Chicano History I",
        "info": "Experiences of people of Mexican descent in the United States. Important eras in histories of Mexico, the United States, and Mexican Americans. Central role of Chicana/os in U.S. history, culture, and politics. Topics include race, ethnicity, gender, sexuality, immigration, migration.",
        "prereq": []
    },
    {
        "code": "HIST 3445",
        "subject": "HIST",
        "id": "3445",
        "title": "Immigration & US Latina/o Exp",
        "info": "Experiences of migrants from Latin America to United States in 20th/21st century. Migrant engagements with US society. Pre-existing Latina/o/other ethnic communities' experiences within political, economic, social aspects of life at local/global level.",
        "prereq": []
    },
    {
        "code": "HIST 3446",
        "subject": "HIST",
        "id": "3446",
        "title": "Chicana and Chicano History II",
        "info": "Experiences of people of Mexican descent in U.S. Notions of citizenship from WWII. Chicano civil rights movement. Impact of immigration patterns/legislation. Cultural wars, demographics. Social, economic, political changes. Meaning of racialized \\\"Mexican\\\" identity. How different groups of Mexicans have understood their relationships to other Americans/other Latino groups.",
        "prereq": []
    },
    {
        "code": "HIST 3451",
        "subject": "HIST",
        "id": "3451",
        "title": "Asian Civilization",
        "info": "Comparative approach to the birth of civilization in Asia; rise of ancient wars, imperialism and genocide, ethical protest against violence; rise of the universal empires; culmination, decline, and fall of classical Asian civilizations.",
        "prereq": []
    },
    {
        "code": "HIST 3452",
        "subject": "HIST",
        "id": "3452",
        "title": "African Conservation Histories",
        "info": "Historical roots of conservation in Africa in 19th/20th centuries. Historical context of contemporary laments about Africa's environmental degradation, older efforts to exploit/control African people/resources. Focuses on how Africans have interacted with and managed their lands/resources.",
        "prereq": []
    },
    {
        "code": "HIST 3453",
        "subject": "HIST",
        "id": "3453",
        "title": "African Rural Social History",
        "info": "Change in lives of African rural people. Focuses on changing livelihood strategies, labor, households, and families. Competition for resources among African farmers/herders in 19th/20th centuries.",
        "prereq": []
    },
    {
        "code": "HIST 3454",
        "subject": "HIST",
        "id": "3454",
        "title": "West Africa to 1800",
        "info": "West Africa from late early times to establishment/histories of states. Relations with North African, Mediterranean, Asian, American worlds. Non-centralized political authority.",
        "prereq": []
    },
    {
        "code": "HIST 3455",
        "subject": "HIST",
        "id": "3455",
        "title": "West Africa from 1800",
        "info": "West African history from late-18th century to present. Themes include study of continuities with past. Profound changes including new 19th century state formation, European colonialism, post-colonial issues.",
        "prereq": []
    },
    {
        "code": "HIST 3456",
        "subject": "HIST",
        "id": "3456",
        "title": "Soc Mvts in African Diaspora",
        "info": "Political, cultural, historical linkages between Africans, African-Americans, African-Caribbeans. Socio-political movements/radical intellectual trends in late 19th/20th centuries within African Diaspora. Resistance in Suriname, Guyana, Caribbean. Protest organizations, intellectual discourses, radical movements in United States/Europe.",
        "prereq": []
    },
    {
        "code": "HIST 3461",
        "subject": "HIST",
        "id": "3461",
        "title": "Intro to E. Asia I",
        "info": "Comparative survey of early history of China, Japan, Korea, and Vietnam. Early Chinese thought. Diffusion of Confucianism, Buddhism, and other values throughout East Asia. Political and social history of region to 1600.",
        "prereq": []
    },
    {
        "code": "HIST 3462",
        "subject": "HIST",
        "id": "3462",
        "title": "East Asia from 1500-Present",
        "info": "How Asian states, societies, economies, and cultures linked with one another and with European powers. How period's historical effects still resonate. Covers India, China, Japan, Korea, and Indochina.",
        "prereq": []
    },
    {
        "code": "HIST 3464",
        "subject": "HIST",
        "id": "3464",
        "title": "China: Song -Ming",
        "info": "China during the Song (976-1279), Yuan (1279-1368), and Ming (1368-1644) dynasties; political institutions and social structures. Attention to primary sources and how historians ask and answer questions about the past.",
        "prereq": []
    },
    {
        "code": "HIST 3465W",
        "subject": "HIST",
        "id": "3465W",
        "title": "China in Ming&Qing",
        "info": "The political and social history of China from about 1600 until the end of the Qing dynasty in 1911. Topics include ethnicity, daily life, legal structures, city life, and peasantry.",
        "prereq": []
    },
    {
        "code": "HIST 3466",
        "subject": "HIST",
        "id": "3466",
        "title": "Religion in Imperial China",
        "info": "Varieties of religious experience in imperial China. Religion as lived practices. Textual traditions. Buddhism, Daoism, Confucianism, relations among them. Western missionary enterprise in China.",
        "prereq": []
    },
    {
        "code": "HIST 3467W",
        "subject": "HIST",
        "id": "3467W",
        "title": "State & Rev in Chin",
        "info": "Modern China's political evolution, including the Taiping Rebellion, Republican Revolution, Rise of Nationalist and Communist Parties, Maoist era; reform under Deng Xiaping and the emergence of democracy in Taiwan.",
        "prereq": []
    },
    {
        "code": "HIST 3468",
        "subject": "HIST",
        "id": "3468",
        "title": "Soc Change in China",
        "info": "Opium War and opening of Treaty Ports in 19th century. Missionary activity and cultural influence. Changes in education system. Women's movement. Early industrialization. Socialism/collectivization after 1949. Industrialization of Taiwan. PRC's entry into world trading system.",
        "prereq": []
    },
    {
        "code": "HIST 3469",
        "subject": "HIST",
        "id": "3469",
        "title": "Women and Family in China",
        "info": "Marriage/family life, foot binding, cult of women's chastity. Women in nationalist/communist revolutions. Gender relations in post-socialist China. Effect of ideologies (Confucianism, nationalism, socialism) on women/family life. Differences between ideology/social practice.",
        "prereq": []
    },
    {
        "code": "HIST 3471",
        "subject": "HIST",
        "id": "3471",
        "title": "Modern Japan, Meiji-Present",
        "info": "Japan's early development as industrial/imperial power after Meiji Restoration of 1868. Political developments in Taisho years: social, cultural, economic trends that supported them. Militarization/mobilization for war in 1930s. Japan's war with China, Pacific War with the United States. American Occupation. Postwar economic recovery, high growth. Changing political/popular culture of 1980s, '90s.",
        "prereq": []
    },
    {
        "code": "HIST 3472",
        "subject": "HIST",
        "id": "3472",
        "title": "Early Modern Japan",
        "info": "Tradition/change in society/culture under Tokugawa shoguns (1600-1867). Growth of cities. Decline of samurai class. Response to Western intrusion. ",
        "prereq": []
    },
    {
        "code": "HIST 3474",
        "subject": "HIST",
        "id": "3474",
        "title": "Rise of Mod Japan",
        "info": "The Meiji Revolution from Commodore Perry to the eve of World War I; origins of constitutional monarchy, industrial economy, Western influences, and modern cultural change.",
        "prereq": []
    },
    {
        "code": "HIST 3475",
        "subject": "HIST",
        "id": "3475",
        "title": "Japan and WWII",
        "info": "From origins of war in China through Pearl Harbor decision, conquest of Southeast Asia, defeat in the Pacific, impact of atomic bomb, American occupation, and creation of United States-Japanese alliance.",
        "prereq": []
    },
    {
        "code": "HIST 3476",
        "subject": "HIST",
        "id": "3476",
        "title": "War and Japanese Culture",
        "info": "War-related issues in Japan. Animation films, comics from 1940s to 1990s.  Mobilization of culture for WWII. Conflict between constitutional pacifism and national security. Japan's role in cold war and post-cold war worlds.\n",
        "prereq": []
    },
    {
        "code": "HIST 3477",
        "subject": "HIST",
        "id": "3477",
        "title": "Japanese Samurai & Geisha",
        "info": "How samurai, geisha, and Zen Buddhism came to be considered as the quintessential Japanese tradition in 20th century.  Modernity, nationalism, orientalism, international politics, globalization.",
        "prereq": []
    },
    {
        "code": "HIST 3478",
        "subject": "HIST",
        "id": "3478",
        "title": "Tigers and Dragons",
        "info": "Rise of East Asian Economies, 1930-Present.",
        "prereq": []
    },
    {
        "code": "HIST 3479",
        "subject": "HIST",
        "id": "3479",
        "title": "Chinese Cities and Urban Life",
        "info": "Introduction to traditional Chinese cities, their modern transformation. Ideal city plan in Confucian classics compared with physical layout of some major cities. Models about Chinese cities, influence of the models on our understanding of Chinese history/society.",
        "prereq": []
    },
    {
        "code": "HIST 3481",
        "subject": "HIST",
        "id": "3481",
        "title": "Ancient & Med India",
        "info": "The history of India; origins of civilization along the Indus River, Indo-European intrusion, rise of an Indo-Gangetic civilization, response of Buddha to violence, Mauryan empire, classical civilization of India, rise of medieval Hinduism.",
        "prereq": []
    },
    {
        "code": "HIST 3483",
        "subject": "HIST",
        "id": "3483",
        "title": "Hmong History Across the Globe",
        "info": "Hmong interaction with lowland Southeast Asian states (Laos, Vietnam) and Western colonial powers (French, American) since 19th century. Changes to religious, social, political, and gender institutions. Aspirations for political autonomy.",
        "prereq": []
    },
    {
        "code": "HIST 3485",
        "subject": "HIST",
        "id": "3485",
        "title": "Hist of SE Asia",
        "info": "Origins of civilization/indigenous states. impact of world religions and Western colonialism on gender, social, political, and economic structures. Nationalism. Establishment of Vietnam, Thailand, Indonesia, and the Philippines.",
        "prereq": []
    },
    {
        "code": "HIST 3486",
        "subject": "HIST",
        "id": "3486",
        "title": "Hmong Refugees",
        "info": "Socio-economic, political, gender, cultural/religious changes in Hmong American community during last three decades. How Hmong are racialized in American society. Impact to first/second generations.",
        "prereq": []
    },
    {
        "code": "HIST 3487",
        "subject": "HIST",
        "id": "3487",
        "title": "Vietnam Wars",
        "info": "French conquest. Colonial bureaucratic/economic transformations. Nationalist responses. First Indochina War. Emergence of nation-state. U.S. intervention. Impact of Vietnam War on current politics of Laos, Cambodia, and Thailand, and on Southeast Asia.",
        "prereq": []
    },
    {
        "code": "HIST 3488",
        "subject": "HIST",
        "id": "3488",
        "title": "Early Modern  India",
        "info": "Spans the rise of the Mughal empire in the 1520's to the demise of the British empire in 1947, including present day India, Pakistan, and Bangladesh.",
        "prereq": []
    },
    {
        "code": "HIST 3489",
        "subject": "HIST",
        "id": "3489",
        "title": "Democracy & politics in India",
        "info": "Democracy is not only a political order; it is also a popular culture and politics. This course explores three tumultuous moments of this politics and culture in India: the pluralist nationalism which characterized Gandhian nonviolence and the Indian constitution, the majoritarianism that was often this pluralism’s undertow, and Hindutva or Hindu supremacism, the now dominant populist ideology.",
        "prereq": []
    },
    {
        "code": "HIST 3491",
        "subject": "HIST",
        "id": "3491",
        "title": "Islam Civilization",
        "info": "Islamic legacy in the classical age (800-1400) in the sciences - natural and medical - mathematics, philosophy, and literature, and their transmission to Europe.",
        "prereq": []
    },
    {
        "code": "HIST 3492",
        "subject": "HIST",
        "id": "3492",
        "title": "Hinduism",
        "info": "Development of Hinduism focusing on sectarian trends, modern religious practices, myths/rituals, pilgrimage patterns/ religious festivals. Interrelationship between Indian social structure/Hinduism.",
        "prereq": []
    },
    {
        "code": "HIST 3493",
        "subject": "HIST",
        "id": "3493",
        "title": "Islam: Religion and Culture",
        "info": "This course is a brief survey of the religion and civilization of Islam. It introduces students to 1) Islamic history from its inception in the seventh century CE to the present, with emphasis on the life of the Prophet Muhammad and the early Caliphate; 2) The authoritative texts of Islam, i.e. the Quran and Prophetic traditions (Hadith); 3) The institutions and discourses characteristic of Islamic civilization; and 4) The transformation of Muslim life and thought in the modern period. By taking this course, students become familiar with the chief ideas, characters, narratives, rites, localities, and movements associated with Islam.\n\nprereq: Soph or jr or sr",
        "prereq": []
    },
    {
        "code": "HIST 3494W",
        "subject": "HIST",
        "id": "3494W",
        "title": "Christ in Islamic Thought",
        "info": "Course examines the history of the figure of Christ in Islamic thought, from the beginnings of Islam in the Qur'an and the Hadith to the recent 2013 book by Reza Aslan, Zealot. The course is based on close reading of primary sources from regions extending from Spain to Iran, and in various languages (in translation): Arabic, Greek, French, Farsi, and Italian. Course demonstrates how much the interpretation of the figure of Christ in Islamic thought belonged to specific historical contexts.\n\nprereq: None",
        "prereq": []
    },
    {
        "code": "HIST 3502W",
        "subject": "HIST",
        "id": "3502W",
        "title": "Anc Israel: Conquest to Exile",
        "info": "Israel and Judah were not states of great importance in the ancient Near East.  Their population and territory were small, and they could not resist conquest by larger, more powerful states like Assyria and Rome.  Yet their ancient history matters greatly today, out of proportion to its insignificance during the periods in which it transpired.  The historical experiences of the people of Israel and Judah were accorded religious meaning and literary articulation in the Hebrew Bible (the Old Testament), which became a foundational text for Judaism, Christianity, and Islam.  \n\nEssential features of Western as well as Islamic civilization are predicated on some element of Israel’s ancient past, as mediated through the Bible; therefore it behooves us to understand that past.  But the Bible is a religious work, not a transcript of events, and the history of ancient Israel is not derived merely from reading the biblical accounts of it.  Archaeological excavations have revealed the physical remains of the cultures of Israel and neighboring lands, as well as bringing to light inscriptions, documents, and literary works produced by those cultures.  These sources, which complement and sometimes contradict the accounts conveyed in the Bible, provide the basis for reconstructing a comprehensive history of ancient Israel.\n\nThis course covers the history of Israel and Judah from the Late Bronze Age (c. 1550-1200 BCE), by the end of which Israel had emerged as a distinct ethnic entity, to the period of Roman rule (63 BCE-330 CE), which saw the final extinction of ancient Israel, represented by the kingdom of Judea, as a political entity.  Knowledge of this history is based on archaeological, epigraphic, and literary sources, including the Hebrew Bible.\n\nN.B.: Students should be aware that the study of history, like all the human and natural sciences, is predicated on inquiry, not a priori judgments.  Accordingly, the Bible is not privileged as an intrinsically true or authoritative record.  No text is presumed inerrant, and all sources are subject to scrutiny, in the context of scholarly discourse.  Biblical texts are treated just like all other texts, as the products of human beings embedded in a historical context, and as the subject of analysis and interpretation.  Persons of all faiths and of no faith are equally welcome to participate in such scholarly discourse.  However, students who feel that their own religious beliefs require an understanding of the Bible that is antithetical to the foregoing statements are cautioned that they may find themselves uncomfortable with this course.",
        "prereq": []
    },
    {
        "code": "HIST 3503",
        "subject": "HIST",
        "id": "3503",
        "title": "Ancient Iran",
        "info": "Development of ancient Iranian culture under Achaemenians and Sassanians. Impact of Zoroastrian religion on Iranians, on Hellenism, and on domains such as Bactria. Iran's contribution to cultures of Silk Road.",
        "prereq": []
    },
    {
        "code": "HIST 3504",
        "subject": "HIST",
        "id": "3504",
        "title": "The Cultures of the Silk Road",
        "info": "Past/present state of the cultures that flourished in Central Asia (present-day CA republics, Iran, Afghanistan) after Alexander the Great and declined with opening of sea routes.",
        "prereq": []
    },
    {
        "code": "HIST 3505",
        "subject": "HIST",
        "id": "3505",
        "title": "Modern Middle East",
        "info": "Political history of Middle East in modern era. Socio-economic/intellectual issues. Decline of Ottoman Empire. Imperialism. Nationalism, rise/development of states. Political Islam.",
        "prereq": []
    },
    {
        "code": "HIST 3506",
        "subject": "HIST",
        "id": "3506",
        "title": "The History of Modern Iran",
        "info": "Iranian history from the fall of the Sassanids (7th C. CE) to the present. Shi'ite Islam in a world context. Iranian dynasties. Iran's entrance into modern world politics.",
        "prereq": []
    },
    {
        "code": "HIST 3507",
        "subject": "HIST",
        "id": "3507",
        "title": "History of Modern Egypt",
        "info": "Main political events. Underlying social, economic, and intellectual issues. Impact of Egypt on region. Developments in Egypt compared with those of other leading Arab states.",
        "prereq": []
    },
    {
        "code": "HIST 3508W",
        "subject": "HIST",
        "id": "3508W",
        "title": "Mod Turkey: Empire to Republic",
        "info": "History of modern Turkey, from 1774 to the present day. Teaches students about major historical events and notable political actors that shaped the late Ottoman Empire and modern Turkey. Helps students develop analytical skills in understanding and contrasting different primary and secondary source perspectives on and methodological approaches to the past. ",
        "prereq": []
    },
    {
        "code": "HIST 3509",
        "subject": "HIST",
        "id": "3509",
        "title": "Studying the Middle East",
        "info": "Intensive reading/discussion course. Ways in which historians/social scientists have studied Middle East. Problems they have encountered. Paradigms, issues, and debates in Middle Eastern Studies.",
        "prereq": []
    },
    {
        "code": "HIST 3511",
        "subject": "HIST",
        "id": "3511",
        "title": "Muslims and Jews",
        "info": "Diversity of social/cultural interactions between Muslims and Jews and between Islam and Judaism since 1700. What enabled the two religious communities to peacefully coexist? What were causes of conflict? Why is history of Muslim-Jewish relations such a contested issue? ",
        "prereq": []
    },
    {
        "code": "HIST 3512",
        "subject": "HIST",
        "id": "3512",
        "title": "Hist of Mod Israel/Palestine",
        "info": "History of Zionism/Israel. Arab-Jewish conflict, tensions between religious/secular Jews. Relationships between Mizrahi, Ashkenazi, Russian, Ethiopian, Arab citizens. Israeli cultural imagery. Newsreels, political posters, television shows, films, popular music.",
        "prereq": []
    },
    {
        "code": "HIST 3513",
        "subject": "HIST",
        "id": "3513",
        "title": "North Africa since 1500",
        "info": "History of Maghrib (Morocco, Algeria, Tunisia, Libya, disputed territories of Western Sahara) from time of Ottoman expansion/Sharifian dynasties (Sa'dian/'Alawid) in 16th/17th Centuries to end of 20th century. Focus on encounter of Islamic cultures/societies of Maghrib with Africa/Europe.",
        "prereq": []
    },
    {
        "code": "HIST 3514W",
        "subject": "HIST",
        "id": "3514W",
        "title": "Env History of the Mid East",
        "info": "Water and Oil focuses on the far‑reaching impacts of environmental change upon Middle Eastern societies, culture, politics, economic development or underdevelopment, and violence. It offers a narrative of the Middle Eastern past that is not framed by a specific place, ethnic group, religion, or intellectual tradition. The course is designed to enable students to think deeply about technology and the environment across the Middle East, and the region’s development as shaped by local practices, global politics, economic interests, and the struggle for resource management.",
        "prereq": []
    },
    {
        "code": "HIST 3518",
        "subject": "HIST",
        "id": "3518",
        "title": "Jewish Humor",
        "info": " In the U.S. the comic world has been so dominated by Jewish writers and performers that the \\\"People of the Book\\\" have come to be known as the \\\"People of the Joke.\\\" A 2013 Pew Research poll showed that for American Jews, a sense of humor is essential to their Jewish identity, more important than ritual or the observance of traditional religious commandments. While surveying a broad range of humor in print, on stage, and in films along with classical Jewish texts including the Torah and Talmud, students will learn about the historical and cultural contexts that make such humor not only possible, but existentially necessary, a serious business indeed. And we'll accomplish all this while laughing hysterically. \nNo prior knowledge of Jewish history and culture is required or assumed.",
        "prereq": []
    },
    {
        "code": "HIST 3534",
        "subject": "HIST",
        "id": "3534",
        "title": "Intro Jewish History & Culture",
        "info": "This course traces the development of Judaism and Jewish civilizations from their beginnings to the present. With over three millennia as its subject, the course must of necessity be a general survey. Together we will explore the mythic structures, significant documents, historical experiences, narratives, practices, beliefs, and worldviews of the Jewish people. The course begins by examining the roots of Judaism in the Hebrew Bible and the history of ancient Israel but quickly focuses on the creative forces that developed within Judaism as a national narrative confronted the forces of history, especially in the forms of the Persian, Greek, and Roman empires.  Rabbinic Judaism becomes the most dominant creative force and will receive our greatest attention, both in its formative years and as it encounters the rise of Christianity and Islam. After studying the Jewish experience in the medieval world, we will turn to Judaism’s encounter with the enlightenment and modernity. The historical survey concludes by attending to the transformations within Judaism and Jewish life of the last 150 years, including a confrontation with the experience of the Holocaust. Woven throughout this historical survey will be repeated engagements with core questions: “Who is a Jew?” “What do Jews believe?” “What do Jews do?” “What do we mean by ‘religion’?”   “How do Jews read texts within their tradition?” And perhaps most importantly, “How many answers are there to a Jewish question?” Students in this course can expect to come away with some knowledge of the Bible in Judaism, rabbinic literature and law, Jewish mysticism and philosophy, Jewish nationalism and Zionism, Jewish culture, ritual, and worship in the synagogue, the home, and the community, and Jewish celebrations of life cycle events and the festivals.",
        "prereq": []
    },
    {
        "code": "HIST 3541",
        "subject": "HIST",
        "id": "3541",
        "title": "Islam in World History",
        "info": "Islam as force of global integration. Ways it has accomplished this. Early military/technological innovation. Activities of merchants, pilgrims, and missionaries.",
        "prereq": []
    },
    {
        "code": "HIST 3542",
        "subject": "HIST",
        "id": "3542",
        "title": "Medieval Islam",
        "info": "Islamic dynasties, Umayyads of Spain, Shiites, assassins, Abbasid Caliphate's disintegration and rise of Selguk Turks. Sunnism re-emerges. IlKhanids.",
        "prereq": []
    },
    {
        "code": "HIST 3543",
        "subject": "HIST",
        "id": "3543",
        "title": "Arabs under Ottoman",
        "info": "Arabs under Mamluk rule. Ottomans conquer Mamluk territory. Ottoman rule. Disintegration and re-emergence under Muhammad Ali of Egypt, dynastic struggles in Syria, rise of Young Turks and Arab revolt.",
        "prereq": []
    },
    {
        "code": "HIST 3544",
        "subject": "HIST",
        "id": "3544",
        "title": "Recent Arab World",
        "info": "Arab world since independence; the struggle for liberation, political stability, development and unification; political structure and conflicts; impact of Arab-Israeli conflict.",
        "prereq": []
    },
    {
        "code": "HIST 3546",
        "subject": "HIST",
        "id": "3546",
        "title": "Islam and the West",
        "info": "Cultural/intellectual trends that have defined fundamental differences between Islam and the West. Development of historical, philosophical, and intellectual mindset of both spheres. Factors in tension, anxiety, and hatred between Muslim world and Europe and the United States.",
        "prereq": []
    },
    {
        "code": "HIST 3547",
        "subject": "HIST",
        "id": "3547",
        "title": "The Ottoman Empire",
        "info": "Survey of Islam's most successful empire, from its founding circa 1300 to its demise in 1923. Lands, institutions, peoples, historical legacy.",
        "prereq": []
    },
    {
        "code": "HIST 3600",
        "subject": "HIST",
        "id": "3600",
        "title": "The Renaissance",
        "info": "Relationships between the visual arts, literature, science, philosophy, and politics in Europe from about 1300-1600. Works of artists, writers, and intellectuals (e.g., Michelangelo Buonarotti, Niccolo Machiavelli, Michel de Montaigne), different artistic and literary forms (e.g., portrait, sonnet, essay), and broad thematic issues that include the individual, antiquity, state, and discovery. Team taught.",
        "prereq": []
    },
    {
        "code": "HIST 3606",
        "subject": "HIST",
        "id": "3606",
        "title": "Christians, Muslims, and Jews",
        "info": "A Pew Research survey of the global religious landscape in 2010 found 2.2 billion Christians (31.5% of the world?s population), 1.6 billion Muslims (23.2%), and 14 million Jews (.2%). In this class, we explore how the histories of these religious communities became deeply entangled in an age of diplomacy, trade, jihad, and crusade.",
        "prereq": []
    },
    {
        "code": "HIST 3608W",
        "subject": "HIST",
        "id": "3608W",
        "title": "The Medieval Church",
        "info": "Religious beliefs of Latin Christianity as officially taught and as received by ordinary folk; organization of the church and its implantation in lay society; relations between Latin Christendom and its neighbors, Orthodoxy and Islamdom.\n\nprereq: Intro course in European history before 1500 recommended",
        "prereq": {
            "code": "HIST 1500",
            "subject": "HIST",
            "id": "1500"
        }
    },
    {
        "code": "HIST 3609",
        "subject": "HIST",
        "id": "3609",
        "title": "Military Hist: Premod Europe",
        "info": "How changes in European warfare shaped society from the late Roman Empire to the Military Revolution and rise of the nation-state, 300-1800 CE. Topics include styles of warfare and perceptions of war; the relationship between war and society; the roles of religious belief and technology in the practice of war. What produces a military revolution?",
        "prereq": []
    },
    {
        "code": "HIST 3611",
        "subject": "HIST",
        "id": "3611",
        "title": "Medieval Cities of Europe",
        "info": "European cities changed from Roman times through the urban nadir of the Early Middle Ages to the flowering of cities in the High and Late Middle Ages.�We explore planned towns, ad hoc developments, revived Roman sites, and economic, political, cultural, and sensory elements of city life.�Students design a medieval city using Arc.GIS and StoryMap. Contact the instructor for more information.",
        "prereq": []
    },
    {
        "code": "HIST 3613",
        "subject": "HIST",
        "id": "3613",
        "title": "History of the Crusades",
        "info": "Crusading spirit in Europe. Results of classic medieval crusades ca 1095-1285. States established by crusaders in Near East. Internal European crusades. Chronological prolongation of crusading phenomenon.",
        "prereq": []
    },
    {
        "code": "HIST 3614",
        "subject": "HIST",
        "id": "3614",
        "title": "Women in Medieval Europe",
        "info": "Women's role in family, politics, religion, work, and social movements. Representations of women in religious texts, art, literature, scientific studies, and law. Methods/approaches to study of women's history.",
        "prereq": []
    },
    {
        "code": "HIST 3615W",
        "subject": "HIST",
        "id": "3615W",
        "title": "Women in European History",
        "info": "History of women in Western Europe from early modern period to present. Changes crucial to women's lives. Family/kinship structure, control over property, organization of work, religious ideas/practices, education, politics, beliefs/attitudes about female body.",
        "prereq": []
    },
    {
        "code": "HIST 3616",
        "subject": "HIST",
        "id": "3616",
        "title": "The Hundred Years War",
        "info": "Politics, society, and culture in medieval France from the end of the Carolingians to the end of the Hundred Years War.",
        "prereq": []
    },
    {
        "code": "HIST 3617",
        "subject": "HIST",
        "id": "3617",
        "title": "Pagans, Christians, Barbarians",
        "info": "Between classical and medieval, pagan and Christian, Roman and barbarian, the late antique world was a dynamic age. This course will focus on the Mediterranean region from the 2nd to the mid-7th century exploring such topics as the conversion of Constantine, the fall of Rome, barbarian invasions, the spread of Christianity, and the rise of Islam.",
        "prereq": []
    },
    {
        "code": "HIST 3618",
        "subject": "HIST",
        "id": "3618",
        "title": "Dark Ages Illumined",
        "info": "Origins of medieval Europe, Germanic and Viking invasions, feudalism, manorialism, Islam, the papacy, monarchies, intellectual developments.",
        "prereq": []
    },
    {
        "code": "HIST 3619",
        "subject": "HIST",
        "id": "3619",
        "title": "Medieval History 1050-1500",
        "info": "Chivalry and courtly love, crusades, revival of towns and trade, monarchies, religious developments, Black Death, famine, and wars",
        "prereq": []
    },
    {
        "code": "HIST 3621",
        "subject": "HIST",
        "id": "3621",
        "title": "The Renaissance, 1200-1600",
        "info": "Political/cultural history of city-states of northern/central Italy, 1200-1550. Emphasizes Florence/Venice. Readings include Dante, Machiavelli.\n\nprereq: Intro course in European history before 1500 recommended",
        "prereq": {
            "code": "HIST 1500",
            "subject": "HIST",
            "id": "1500"
        }
    },
    {
        "code": "HIST 3623W",
        "subject": "HIST",
        "id": "3623W",
        "title": "The Age of Reformation",
        "info": "This course will examine the great religious convulsion that gripped Europe in the sixteenth and seventeenth centuries. Chronologically, however, we will begin in the late medieval period as we consider important changes that were occurring in European culture and society culminating with Europe's first Reformation, not in Germany but in Bohemia. Geographically, we begin with Europe but our scope eventually widens out to consider developments also in Asia and the Americas. We conclude by considering the relaxation of religious tensions in the late seventeenth century and concurrent growth of toleration and skepticism. Throughout the course we will consider religion as a dynamic that has had a broad impact on society affecting not only personal belief but also the politics, social patterns, and intellectual and cultural production of the early modern world.",
        "prereq": []
    },
    {
        "code": "HIST 3626",
        "subject": "HIST",
        "id": "3626",
        "title": "Early Modern France",
        "info": "The evolution of French political culture and society in thematic context: Louis XIV's Old Regime, the Enlightenment, the French Revolution, the Republic, and Napoleon's Empire. Topics include urban and rural life, public opinion and polite culture, religious conflict, sex and gender, consumerism and material culture, and slavery and colonialism.",
        "prereq": []
    },
    {
        "code": "HIST 3632",
        "subject": "HIST",
        "id": "3632",
        "title": "Germany, 1500-1871",
        "info": "The Reformation era; warfare and demographic catastrophe of the early 1600s; life in town and country; absolutism; Baroque culture; family life and its transformation; economic crisis; Revolution of 1848; the military path to unification.",
        "prereq": []
    },
    {
        "code": "HIST 3633",
        "subject": "HIST",
        "id": "3633",
        "title": "Modern Germany, 1870-Present",
        "info": "Unifying the nation. Industrial development and political instability. Bourgeois culture, growth of socialism. World War I and revolution. Weimar Era, depression, Nazi seizure of power, Hitler's state. World War II and the Holocaust. Cold War and two Germanies. Reunification.",
        "prereq": []
    },
    {
        "code": "HIST 3634",
        "subject": "HIST",
        "id": "3634",
        "title": "E Eur & Byzantium",
        "info": "Byzantine and Eastern European history from the 6th century to ca. 1500. Major topics include Byzantium, the medieval Balkans, the rise of the Ottoman empire in Europe, and the West Slavic-Hungarian lands till the Renaissance.",
        "prereq": []
    },
    {
        "code": "HIST 3636",
        "subject": "HIST",
        "id": "3636",
        "title": "European Russia",
        "info": "Major topics include the Khazar, Rus', and Bulghar states, Mongol conquest and rule, Muscovite Russia, Ukraine in the 16th-17th centuries, and the Crimean Khanate.",
        "prereq": []
    },
    {
        "code": "HIST 3637",
        "subject": "HIST",
        "id": "3637",
        "title": "Modern Russia",
        "info": "Political, social, and cultural forces which have shaped modern Russia. Emphasis will be on modernization, attempts at reforms in the imperial and Soviet period, and the dissolution of empires.",
        "prereq": []
    },
    {
        "code": "HIST 3641",
        "subject": "HIST",
        "id": "3641",
        "title": "Anglo-Saxon England",
        "info": "History of medieval England from the end of Roman rule to the Norman Conquest. All aspects of society examined to provide a broad picture of the creation of Anglo-Saxon England and the Celtic Frontiers.",
        "prereq": []
    },
    {
        "code": "HIST 3642",
        "subject": "HIST",
        "id": "3642",
        "title": "Med Knight/Peasants",
        "info": "Social history of medieval England from 1066 to 1500. Peasants, nobility, and bourgeoisie, including their economic institutions, living conditions, and entertainments. Legal and illegal ways of coping with economic and social change resulting from plague and wars.",
        "prereq": []
    },
    {
        "code": "HIST 3651",
        "subject": "HIST",
        "id": "3651",
        "title": "Tudor England",
        "info": "Henry VIII and the English Reformation. The early Tudor period, 1485-1547; the reign of Henry VIII and his break with the papacy.",
        "prereq": []
    },
    {
        "code": "HIST 3652",
        "subject": "HIST",
        "id": "3652",
        "title": "Early Modern Britain",
        "info": "British society/culture during early modern era, especially 16th and 17th centuries. May include themes related to political developments, economy/social structure, gender, religion, literature, or interaction with other world regions.",
        "prereq": []
    },
    {
        "code": "HIST 3671",
        "subject": "HIST",
        "id": "3671",
        "title": "Modern Britain I",
        "info": "Britain from the end of the American Revolution to the mid-Victorian age;  industrialization and reform.",
        "prereq": []
    },
    {
        "code": "HIST 3672",
        "subject": "HIST",
        "id": "3672",
        "title": "Modern Britain I",
        "info": "Britain from the mid-Victorian age to the near-present; the growth of democracy, the height and depth of world power.",
        "prereq": []
    },
    {
        "code": "HIST 3681",
        "subject": "HIST",
        "id": "3681",
        "title": "Irish History",
        "info": "History of Ireland, primarily modern, with emphasis on politics and Anglo-Irish relations.",
        "prereq": []
    },
    {
        "code": "HIST 3691W",
        "subject": "HIST",
        "id": "3691W",
        "title": "The British Empire",
        "info": "Gain/loss of colonies in Ireland, America, India, Africa. Development of racism, multicultural composition of British society, debates about economic motives for empire, resistance of colonized peoples to conquest/domination.",
        "prereq": []
    },
    {
        "code": "HIST 3703W",
        "subject": "HIST",
        "id": "3703W",
        "title": "European Cities",
        "info": "The historical experience of selected cities in early modern Europe set within the context of ideas about urban formation and development. Key cities are Venice, Florence, Antwerp, Madrid, Seville, Amsterdam, Paris, and London.",
        "prereq": []
    },
    {
        "code": "HIST 3704W",
        "subject": "HIST",
        "id": "3704W",
        "title": "Daily Life, Europe",
        "info": "Living conditions and daily life in Europe before the Industrial Revolution. Topics include marriage and family, life at court, nobles, peasants, disease, farming, livestock-raising, urban life, the middle classes, manufacturing, trade, piracy, witchcraft, war, crime, and social deviance.",
        "prereq": []
    },
    {
        "code": "HIST 3705",
        "subject": "HIST",
        "id": "3705",
        "title": "History of the Premodern Book",
        "info": "The fifteenth-century European transformations wrought by Gutenberg's moveable type printing and the new systems of knowledge which printed books sustained in subsequent centuries. Precise focus on the technological transformations of print itself, including the mechanical reproduction of images, along with the new institutions created by print like libraries and the print public sphere. Our own 21st century digital multimedia transformations will continually serve as a comparative context for thinking about the premodern past. \n",
        "prereq": []
    },
    {
        "code": "HIST 3706",
        "subject": "HIST",
        "id": "3706",
        "title": "Baroque Rome: Art and Politics",
        "info": "This course explores the center of Baroque culture, Rome, as a city of spectacle and pageantry. The urban development of the city, as well as major works in painting, sculpture, and architecture, are considered within their political and religious context, with special emphasis on the ecclesiastical and private patrons who transformed the Eternal City into one of the world's great capitals. ",
        "prereq": []
    },
    {
        "code": "HIST 3707",
        "subject": "HIST",
        "id": "3707",
        "title": "Soc Hist of Mod Eur",
        "info": "Transformation from traditional agrarian to modern society, 18th to 20th centuries. Social change; history of the family, marriage and sexuality; the roots of nationalism and racism.",
        "prereq": []
    },
    {
        "code": "HIST 3708",
        "subject": "HIST",
        "id": "3708",
        "title": "The Age of Curiosity",
        "info": "Diverse ways in which making of art and scientific knowledge intersected in early modern Europe. Connections between scientific curiosity and visual arts in major artists (e.g., da Vinci, Durer, Vermeer, Rembrandt). Artfulness of scientific imagery/diagrams, geographical maps, cabinets of curiosities, and new visual technologies, such as the telescope and microscope.\n",
        "prereq": []
    },
    {
        "code": "HIST 3709",
        "subject": "HIST",
        "id": "3709",
        "title": "Science and Enlightenment",
        "info": "History of scientific revolution and its relationship to Enlightenment, 1650-1800. Copernicus, Galileo, Newton, Voltaire. Science and politics, culture, and religion. Civil society, expertise, objectivity, publicity.",
        "prereq": []
    },
    {
        "code": "HIST 3711",
        "subject": "HIST",
        "id": "3711",
        "title": "Cognitive History",
        "info": "\tCognitive History will examine how research in cognitive neuroscience provides historians with new knowledge and methods for asking questions about the past. It is not a course on the history of the cognitive sciences. Instead, it is about practicing history in the cognitive age, a period that began more than fifty years ago, and an approach to explaining how humans think and act that has been adopted within fields across our universities. The course will combine broad readings and discussions in “Big History” and the shift from behaviorism to cognition with more specific studies about memory, narrative, aesthetics, the body, and violence.\nStudents will have an opportunity to apply a cognitive history approach to a specific topic that emphasizes one of the following topics: Evolution, Behaviorism, Cognitive Cultural Studies, Memory, Narrative, Aesthetics, the Body, and Violence. Students will help guide discussions for the relevant class sessions on these topics and write an essay on the selected theme. ",
        "prereq": []
    },
    {
        "code": "HIST 3712",
        "subject": "HIST",
        "id": "3712",
        "title": "Econ Hist Mod Eur",
        "info": "Long-term rise/transformation of European economy. Emergence of capitalism and spread of economic growth up to WWI. Political economy of growth, instability, and structural change in 20th century.",
        "prereq": []
    },
    {
        "code": "HIST 3714",
        "subject": "HIST",
        "id": "3714",
        "title": "Medieval Spain",
        "info": "Development of the medieval kingdoms of Spain from Roman times to ca. 1500. Major social, economic, and cultural developments. Christians, Jewish, and Muslim interaction. Role of Spain in the beginning of European expansion.",
        "prereq": []
    },
    {
        "code": "HIST 3715",
        "subject": "HIST",
        "id": "3715",
        "title": "Modern Spain",
        "info": "Ferdinand and Isabella, the Habsburg and Bourbon dynasties, the 20th-century Civil War and Franco regime, and into the present. Readings, lectures, films, slides, and music will provide a comprehensive view of a vibrant people and their modern history.",
        "prereq": []
    },
    {
        "code": "HIST 3719",
        "subject": "HIST",
        "id": "3719",
        "title": "Making Europe",
        "info": "History 3719 has two explicit goals. The first is to explain how the institutions of the European Union are a direct response to the multiple catastrophes of the first half of the 20th century. It focuses on the ways that statesmen and intellectuals framed practical dilemmas in an ethical manner, and examines the ways that building institutions has been seen as the most just response towards the end of building peace on the continent. This has led to a sprawling, at times contradictory, but also surprisingly nimble and new kind of government. The second goal is to examine the ways the EU understands and is responding to the three major dilemmas facing it in the first decades of the 21st century: the sometimes fragile state of democracy in the member states, the migration/identity crisis, and the state of Ukraine and European security. Students will examine the institutions in play concerning each of these dilemmas, will dissect policy debates that are influencing decision-making, and will come to their own conclusions and formulate their own policies as if they were leaders of institutions.",
        "prereq": []
    },
    {
        "code": "HIST 3721",
        "subject": "HIST",
        "id": "3721",
        "title": "Studies in 20th C Eur 1900-45",
        "info": "Social, political, and cultural changes/conflicts. Background to WWI, its impact. Revolution, failure of interwar stability. Fascism. WWII, its consequences.",
        "prereq": []
    },
    {
        "code": "HIST 3722",
        "subject": "HIST",
        "id": "3722",
        "title": "Studies in 20th C Eur 1945-91",
        "info": "Social, economic, political, and cultural impacts of WWII upon Europe. Division of Europe. Communist regimes in Eastern Europe, cooperation in Western Europe. Impacts of modernization. End of Cold War.",
        "prereq": []
    },
    {
        "code": "HIST 3724",
        "subject": "HIST",
        "id": "3724",
        "title": "Gender, War & Revolution",
        "info": "From WWI through break-up of Yugoslavia, involvement/reactions of European women to situations of war/revolution. Ways in which women contributed, resisted, or submitted. Impact of conflicts on women's lives. Gender, ideological gendering. Lecture, but emphasizes readings, presentations, and discussions. ",
        "prereq": []
    },
    {
        "code": "HIST 3726W",
        "subject": "HIST",
        "id": "3726W",
        "title": "The Century of Refugees",
        "info": "This course examines the world-historical events that structured global flows of refugees in the Twentieth Century (and beyond), the evolution of refugee protection systems that emerged in response, and the rise of the “refugee” as a legal/political/cultural subject and as an agent of historical change. ",
        "prereq": []
    },
    {
        "code": "HIST 3727",
        "subject": "HIST",
        "id": "3727",
        "title": "History of the Holocaust",
        "info": "Study of 1933-1945 extermination of six million Jews and others by Nazi Germany on basis of race. European anti-Semitism. Implications of social Darwinism and race theory. Perpetrators, victims, onlookers, resistance. Theological responses of Jews and Christians.",
        "prereq": []
    },
    {
        "code": "HIST 3727W",
        "subject": "HIST",
        "id": "3727W",
        "title": "History of the Holocaust",
        "info": "Study of 1933-1945 extermination of six million Jews and others by Nazi Germany on basis of race. European anti-Semitism. Implications of social Darwinism and race theory. Perpetrators, victims, onlookers, resistance. Theological responses of Jews and Christians.",
        "prereq": []
    },
    {
        "code": "HIST 3728",
        "subject": "HIST",
        "id": "3728",
        "title": "The History of Human Rights",
        "info": "What are human rights? How and when did they originate? How were such rights promoted, protected, and contested at different historical junctures, and by whom? In this course, we will examine the historical processes through which human rights have been conceptualized, codified, violated, and vindicated. Throughout the semester, we will travel across the globe and trace events that span from the eighteenth century to the present day. Our search will take us through the multiple histories that have shaped what we nowadays recognize as the human rights framework ? its institutions, products, and norms. Integrating perspectives and readings from the humanities, social sciences and legal studies, this course explores how meanings of human rights have fluctuated in response to historical developments, and how human rights have come to gain their prominent role in contemporary politics, law, and culture.",
        "prereq": []
    },
    {
        "code": "HIST 3729",
        "subject": "HIST",
        "id": "3729",
        "title": "Nazi Germany/Hitler's Europe",
        "info": "Comprehensive exploration of Third Reich. Students will examine How the Nazis came to power, transformations of 1930s, imposition of racial politics against Jews/others, nature of total war. Students read historical accounts, memoirs, state documents, view films.",
        "prereq": []
    },
    {
        "code": "HIST 3731",
        "subject": "HIST",
        "id": "3731",
        "title": "Mod France 1780-Present",
        "info": "History of citizen/state in France from French Revolution to present.",
        "prereq": []
    },
    {
        "code": "HIST 3732",
        "subject": "HIST",
        "id": "3732",
        "title": "French Revolutn & Human Rights",
        "info": "What role did the French Revolution play in shaping how we think about the possibility of massive social change, justice, and rights today? How especially did 18th-century philosophy, culture, politics, and economics influence the development of what we call universal individual \\\"human rights\\\" We also ask: could we have done better?  To do so, we will play \\\"Rousseau, Burke, and Revolution in France, 1791,\\\" a Reacting to the Past flipped-classroom role-playing game. Working individually and in teams, students will prepare speeches, produce pamphlets and newspapers, not only to learn about the stakes of this historical turning point and the philosophical debates surrounding it, but also to imagine changing it. We will also seek out and document the legacy of this Revolution in our lives and around the world today.  This class offers students the knowledge and skills to participate in substantive debate aimed at solving problems collectively, to effect change aligning with their beliefs and philosophies, and to reflect critically on historical legacy\n\nNo prerequisites. All materials for Fren 3732 are in English, and students in all programs are welcome! ",
        "prereq": {
            "code": "FREN 3732",
            "subject": "FREN",
            "id": "3732"
        }
    },
    {
        "code": "HIST 3735",
        "subject": "HIST",
        "id": "3735",
        "title": "Politics of Ideas in Europe",
        "info": "Development of political ideas/ideologies in 20th century. How to understand ideas in various contexts of their production, dissemination, and appropriation. Students read primarily original political/social philosophical texts that have shaped social, cultural, and political landscape.",
        "prereq": []
    },
    {
        "code": "HIST 3746",
        "subject": "HIST",
        "id": "3746",
        "title": "Game of Thrones",
        "info": "This course traces the rise and fortunes of the Habsburg family from their emergence in the late 13th century to the end of the Holy Roman Empire in 1806. We use the family to explore key themes of the period including the Black Death, Hussite wars and peasant revolts, the new print culture, developments of the Reformation, European expansion and Enlightenment culture.\n\nprereq: None",
        "prereq": []
    },
    {
        "code": "HIST 3747",
        "subject": "HIST",
        "id": "3747",
        "title": "HabsburgCentral Europe",
        "info": "Evolution of Habsburg rule in Central Europe, from reforms of Maria Theresa to imperial collapse in 1918. Economic/social transformation. Revolutions of 1848. Political modernization. Rise of nationalism/anti-Semitism. Fin-de-siecle culture. WWI.",
        "prereq": []
    },
    {
        "code": "HIST 3748",
        "subject": "HIST",
        "id": "3748",
        "title": "Austria in 20th C",
        "info": "Austria from Paris Peace Treaties to present. Political instability, social conflict, and economic stagnation between the World Wars. Nazi rule and WWII. Economic miracle, consensus politics, and neutrality after 1945. Austria after Cold War.",
        "prereq": []
    },
    {
        "code": "HIST 3749",
        "subject": "HIST",
        "id": "3749",
        "title": "European Migrants in MN",
        "info": "In this class, we will use Minnesota, particularly the Twin Cities, as a lens through which to examine the history of Central and Eastern European migration to the United States (U.S.) from the late 19th century to the present. Moving chronologically and from the global to the local, this class will first examine the complex and intertwined reasons that prompted people to settle (either temporally or permanently) in the U.S. in the late 19th and early 20th centuries. We will explore the communalities and differences between the Poles, Ukrainians, Germans, Czechs, Slovaks, Jews, Hungarians, Slovenes, Croats, and Serbs who made up this initial wave of migration, and assess how these migrants shaped the urban and social fabric both in the United States, and in St. Paul and Minneapolis. Second, the class will examine how these communities evolved over the course in the 20th century by a) exploring topics such as ethnic identity maintenance, inter-generational relations, return migration, xenophobia and antisemitism, the relationship between migrants and the host society, and institutions (churches and synagogues, fraternal organizations, learned societies, archives, museums and libraries, etc.) established by migrants in the U.S., and b) assessing the impacts of later migration waves from Europe to the U.S., caused by the Holocaust and the Second World War, the 1956 Hungarian uprising, the 1968 Prague Spring, Soviet emigration policies, the fall of the Berlin Wall, and the civil wars in Yugoslavia. \n\nKeeping in mind the pressing ethical questions that subtend migration (both historical and contemporary), this class will also ask what it means to be a descendant of Central and Eastern European migrants in present-day Minnesota—not just of those who arrived over a century ago, but also more recent migrants, e.g., Russians, or Muslims from Bosnia-Hercegovina. To this end, we will enrich our classroom by extending it into the metro area with visits to relevant sites and meetings with representatives of some of these communities in order to understand their current lives, work, and challenges. This class will thus draw on numerous local resources: archives, buildings such as religious sites and community centers, museums, etc.",
        "prereq": []
    },
    {
        "code": "HIST 3767",
        "subject": "HIST",
        "id": "3767",
        "title": "Eastern Orthodoxy",
        "info": "Development of the orthodox church in Byzantium, the Islamic Near East, the Slavic world and in the diaspora; impact of orthodoxy on political and cultural institutions, interaction with other Christian and non-Christian communities; orthodox spirituality and aesthetics.",
        "prereq": []
    },
    {
        "code": "HIST 3775",
        "subject": "HIST",
        "id": "3775",
        "title": "Hist of Jews in Europe",
        "info": "Social, cultural, and political experience of Jews in Europe and the Americas. Emancipation, social/economic development, assimilation, migration, political anti-Semitism, Zionism, the holocaust, transformations after 1945.",
        "prereq": []
    },
    {
        "code": "HIST 3778",
        "subject": "HIST",
        "id": "3778",
        "title": "Jews of the Mediterranean",
        "info": "Experience of Jews, their interactions with Christian Europe and Muslim Mediterranean. Social, cultural, and intellectual life of Jews. Migration, trade. Relationship of Jews to governments and non-Jewish religious/secular authorities. ",
        "prereq": []
    },
    {
        "code": "HIST 3797",
        "subject": "HIST",
        "id": "3797",
        "title": "History of Population",
        "info": "History of births, deaths, migration, population size, and population characteristics. Evidence from Europe, the United States, and Latin America with comparative material from Africa and Asia. Methods of historical population analysis and research of historical population data.",
        "prereq": []
    },
    {
        "code": "HIST 3800",
        "subject": "HIST",
        "id": "3800",
        "title": "Topics:Colonial Am",
        "info": "For advanced undergraduate majors and non-majors. Focus on intensive exploration of particular topics in early American history such as economic history, demographic regimes, social history, intellectual history, regions, slavery, religion, and witchcraft in colonial America.",
        "prereq": []
    },
    {
        "code": "HIST 3801",
        "subject": "HIST",
        "id": "3801",
        "title": "The People of Early America",
        "info": "Multicultural approach to early American history focusing on the interactions of Africans, Europeans, and American Indians who came together to create a new world in North America during the 16th, 17th, and 18th centuries.",
        "prereq": []
    },
    {
        "code": "HIST 3802",
        "subject": "HIST",
        "id": "3802",
        "title": "Early US Religious Encounters",
        "info": "The United States is home to an astonishing array of religious beliefs and institutions, yet mutual toleration has historically been harder to achieve.  This upper-level course, which is run as a discussion seminar, uses case studies to investigates how people of differing faiths perceived, reacted to, and changed each other, between the arrival of Jesuits and Puritans in the early 17th century and the US-Dakota War of 1862.  People who hailed from North America, Europe, and Africa had divergent ideas about the divine and its presence on Earth, about life and life after death, about religious rituals and relations of authority.  Their struggles with one another were partly struggles over religiously inflected ways of being in the world.  The course explores how religion shaped people’s responses to European colonization, the growing slave-labor system, industrialization, immigration, and westward expansion.  A religious lens onto American history reveals religion as an element of struggle and shows that freedom of conscience has been continually contested rather than easily assured.   \nprereq: Non-fr or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 3803",
        "subject": "HIST",
        "id": "3803",
        "title": "Radicalism in Early America",
        "info": "Radicalism to 1850s. Challenge to traditional structures of family/property; relations of gender, race, and class; notions of self/self-governance; and ideas about the divine. Visionaries, reformers. Radicalism and violence.\n\nprereq: Soph or jr or sr or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 3804",
        "subject": "HIST",
        "id": "3804",
        "title": "Religion and US Culture Wars",
        "info": "Thomas Jefferson, Benjamin Franklin, James Madison, Thomas Paine, George Washington, and John Adams on religion, faith, and religion in politics. Deism. Enlightenment-era discussions about rational religion. Rise of evangelicalism. Separation of church/state, framers' original intent for first amendment. Religious Right.",
        "prereq": []
    },
    {
        "code": "HIST 3809",
        "subject": "HIST",
        "id": "3809",
        "title": "Peoples of Revolution America",
        "info": "Culture/structure of late colonial politics. Regionalism. Connections between society and politics. Imperial crisis and independence. Military history of the Revolution. Origins of national politics and the constitution.",
        "prereq": []
    },
    {
        "code": "HIST 3811",
        "subject": "HIST",
        "id": "3811",
        "title": "Antebellum America",
        "info": "This course examines the history of the U.S. between the War of 1812 and the outbreak of the Civil War in 1861. We will examine the dramatic expansion in population and territory; violent growth of slavery; onset of transportation, communications, and industrial revolutions; forced removal of Native Americans; movements for social reform; transformations in popular culture, family life, and religious experience; maturation of political parties; and the coming of the Civil War.\n",
        "prereq": []
    },
    {
        "code": "HIST 3812",
        "subject": "HIST",
        "id": "3812",
        "title": "Civil War & Reconst",
        "info": "United States from 1848 to 1877. Causes of sectional crisis; Southern secession; Lincoln and emancipation; military history; impact of war North and South; Reconstruction efforts to change the Southern life and transform the status of African Americans.",
        "prereq": []
    },
    {
        "code": "HIST 3813W",
        "subject": "HIST",
        "id": "3813W",
        "title": "Slavery & Making of America",
        "info": "This course examines American racial slavery and its centrality to U.S. history. The course teaches students to consider the experiences of enslaved people, observe how the institution of slavery operated, and understand its far-reaching influence across social, political, cultural, economic, legal, environmental, and intellectual domains.",
        "prereq": []
    },
    {
        "code": "HIST 3821",
        "subject": "HIST",
        "id": "3821",
        "title": "US 20th C  to 1945",
        "info": "American politics and society in the progressive era, the 1920's, the Great Depression and World War II. Economic reform at home, the challenges of world war abroad, and social change affecting the status of women and racial minorities.",
        "prereq": []
    },
    {
        "code": "HIST 3822",
        "subject": "HIST",
        "id": "3822",
        "title": "Making America Modern",
        "info": "American politics and society in the postwar era, the diplomacy of the Cold War, the civil rights movement, the Vietnam War, cultural clashes in the 1960's, Watergate, the conservative resurgence, and the end of the Cold War.",
        "prereq": []
    },
    {
        "code": "HIST 3834",
        "subject": "HIST",
        "id": "3834",
        "title": "Law in American Life",
        "info": "Understandings of law/property held by colonists, Indians. Conceptions of relationships among family, community, state held in colonial America; conceptions held today. Law of slavery in colonial era. American Revolution/Constitution. Law, industrialization. Legal legitimacy, federalism, Civil War as constitutional crisis.",
        "prereq": []
    },
    {
        "code": "HIST 3835",
        "subject": "HIST",
        "id": "3835",
        "title": "Law in Am: 1865 - Present",
        "info": "Centralization of state power, rise of individual rights. Constitutionalization of American law. Passage, promise, abrogation, rediscovery of 13th, 14th, 15th Amendments. Expansion of federal administrative state. Origins of civil liberties. Law and the welfare state. Civil Rights Revolution of 1950s, '60s, '70s. Product liability law.\nSecond half of two-semester survey. May be taken independently.",
        "prereq": []
    },
    {
        "code": "HIST 3837",
        "subject": "HIST",
        "id": "3837",
        "title": "Minnesota History",
        "info": "Topics in political/social history of Minnesota and its region in nineteenth/twentieth centuries. ",
        "prereq": []
    },
    {
        "code": "HIST 3838",
        "subject": "HIST",
        "id": "3838",
        "title": "Family History in America",
        "info": "Why has genealogy been a popular pastime in the United States at certain times?  The desire to trace your family history might seem like a natural impulse to many of us, but it really is not.  We know this because we know that genealogy has been a much more powerful force in society at some times than at others, and because it has mattered to some groups of people more than to others.  This is a way of saying that family history has its own history.  This course helps you to think about that history, and in doing so, to learn a lot about how Americans (and other people, too) have used history for their own purposes.",
        "prereq": []
    },
    {
        "code": "HIST 3841",
        "subject": "HIST",
        "id": "3841",
        "title": "Amer Business Hist",
        "info": "Development of the modern corporation and its managerial structure.\nContributions of Eli Whitney, Edison, Ford, Carnegie, Rockefeller, J.P. \nMorgan, Alfred Sloan, others. History of relation of business to economic\ndevelopment, social change, and government policies.",
        "prereq": []
    },
    {
        "code": "HIST 3842",
        "subject": "HIST",
        "id": "3842",
        "title": "The Digital Revolution",
        "info": "Historical examination of birth of computer. Global transformations after 1945. History of technology/how culture shapes technological change. United States history integrated with global history to show how technology, capitalism, politics, culture, environment conspired to make computer agent of revolutionary change.",
        "prereq": []
    },
    {
        "code": "HIST 3844",
        "subject": "HIST",
        "id": "3844",
        "title": "US Econ His to 1870",
        "info": "Economic development, regional specialization and early industrialization.\nSlavery and southern development. The role of railroads and government policies. Economic impact of the Civil War.",
        "prereq": []
    },
    {
        "code": "HIST 3845",
        "subject": "HIST",
        "id": "3845",
        "title": "US Econ His fr 1870",
        "info": "Farm problems in the 19th century. Rise of big business and finance capitalism. The 1920s economy and the Great Depression. Corporate capitalism, government policies and the modern economy.",
        "prereq": []
    },
    {
        "code": "HIST 3851",
        "subject": "HIST",
        "id": "3851",
        "title": "US Labor to 1900",
        "info": "The development of U.S. labor in and after the Age of Industry. Industrial unionism and radicalism's challenge to the AFL; organized labor's uneasy integration into American society. Management theories and workers actions. Race, gender, and the changing working class.",
        "prereq": []
    },
    {
        "code": "HIST 3852",
        "subject": "HIST",
        "id": "3852",
        "title": "Work and Workers in the US",
        "info": "Why do Americans work, and what do we expect in exchange? This course explores how the answers to those questions have changed overtime, from the colonial era to the present, and how the past shapes our approach to work today.",
        "prereq": []
    },
    {
        "code": "HIST 3853",
        "subject": "HIST",
        "id": "3853",
        "title": "Black Protest in 20-C America",
        "info": "This course gets at the heart of why/how African Americans have been fighting for social and political equality throughout the 20th Century. We explore various ways that African Americans have articulated their political demands and affirmed their citizenship rights using youth and grassroots organizations, workers' rights, feminism, education, the courts and laws as tools for political advancement.",
        "prereq": []
    },
    {
        "code": "HIST 3854",
        "subject": "HIST",
        "id": "3854",
        "title": "Race and Sport",
        "info": "This class examines how race, gender, and sport intersect as sites of resistance and reform in twentieth century American life. With the intensification of Jim Crow coinciding with the professionalization and commercialization of sports, athletes of color became central to American debates about science, citizenship, class, ethnicity, sexuality, social mobility, belonging, culture, and entitlement. This seminar will be particularly interested in how athletes of color forced a place for themselves in sports like baseball, boxing, football, golf, and basketball by exercising different models of political protest, citing an urgent need for social justice reforms that spread beyond the realm of sport.",
        "prereq": []
    },
    {
        "code": "HIST 3855",
        "subject": "HIST",
        "id": "3855",
        "title": "History of U.S. Higher Ed",
        "info": "U.S. higher education, from ancient/medieval roots to present. Major issues. Student access, equality of opportunity, faculty autonomy, role/influence of organized religion, business, and corporate leadership on curriculum and institutional management.",
        "prereq": []
    },
    {
        "code": "HIST 3856",
        "subject": "HIST",
        "id": "3856",
        "title": "Civil Rights & Black Power Mvt",
        "info": "Modern black civil rights struggle in U.S. Second reconstruction. Failure of reconstruction, abdication of black civil rights in 19th century. Assault on white supremacy via courts, state, grassroots southern movement in 1950s/1960s. Black struggle in north/west.",
        "prereq": []
    },
    {
        "code": "HIST 3857",
        "subject": "HIST",
        "id": "3857",
        "title": "Race: The History of An Idea",
        "info": "This seminar explores the roots and rationales presented when constructing and upholding the idea of race. This class examines processes of racial formation in science, law, history, immigration policy, education, leisure, adoption, marriage, and medicine. We will look at how race has been used to pathologize, eroticize, criminalize, vilify, and medicalize purported ‘problem people,’ like immigrants, the poor, and the sick. Using memoirs, legal cases, history of medicine, laws, photographs, oral histories, and secondary source readings, this class traces the history of America’s fascination with race and how race came to define so many aspects of American life during the twentieth century.",
        "prereq": []
    },
    {
        "code": "HIST 3858",
        "subject": "HIST",
        "id": "3858",
        "title": "Policing in 20th Century U.S.",
        "info": "This course explores how policing and surveillance changed, evolved, and adapted throughout the twentieth century in the United States. We will trace the trajectory of police power & legitimacy as well as examine how the institution of policing responded to ongoing racial justice movements. ",
        "prereq": []
    },
    {
        "code": "HIST 3861",
        "subject": "HIST",
        "id": "3861",
        "title": "European Americans",
        "info": "Conditions which contributed to the mass exodus from northern/western Europe during this century as well as the attraction of the United States. Major theme will be how immigrants shaped and in turn were shaped by America.",
        "prereq": []
    },
    {
        "code": "HIST 3862",
        "subject": "HIST",
        "id": "3862",
        "title": "American Immigration Hist",
        "info": "Global migrations to U.S. from Europe, Asia, Latin America, and Africa, from early 19nth century to present. Causes/cultures of migration. Migrant communities, work, and families. Xenophobia, assimilation/integration, citizenship, ethnicity, race relations. Debates over immigration. Place of immigration in America's national identity.",
        "prereq": []
    },
    {
        "code": "HIST 3863",
        "subject": "HIST",
        "id": "3863",
        "title": "Black Diaspora in Hist Perspec",
        "info": "Seminar. How African Americans established lives that defied borders and transformed national/local politics in the Americas, Europe, and Asia. How race/blackness emerged/functioned in global context after 1860.",
        "prereq": []
    },
    {
        "code": "HIST 3864",
        "subject": "HIST",
        "id": "3864",
        "title": "Afro-Am History: 1619 to 1865",
        "info": "Importance of dynamics of class, gender, region, and political ideology. Changing nature of race/racism.",
        "prereq": []
    },
    {
        "code": "HIST 3865",
        "subject": "HIST",
        "id": "3865",
        "title": "African Am Hist 1865-Present",
        "info": "History of African American men and women from the beginning of the 20th century to the present. Discussion of internal migrations, industrialization and unionization, The Great Depression, world wars, and large scale movements for social and political change.",
        "prereq": []
    },
    {
        "code": "HIST 3866",
        "subject": "HIST",
        "id": "3866",
        "title": "African American Gender Hist",
        "info": "Relationship between race, gender, and the struggle for equality. Focuses on African-Americans. Changing definitions of manhood/womanhood over the past 130 years. Critical role race and racial thought have played in these changes. How ethnicity, class, and sexuality have transformed black gender experiences.",
        "prereq": []
    },
    {
        "code": "HIST 3867",
        "subject": "HIST",
        "id": "3867",
        "title": "Black Women?s History",
        "info": "Introduction to black women?s histories in America and \nAtlantic World. How black women on two continents defined \nthemselves in context of migration, slavery, colonialism, post-colonialism, and social movements. Meanings, \nproblems, and possibilities of black womanhood in global era.",
        "prereq": []
    },
    {
        "code": "HIST 3868W",
        "subject": "HIST",
        "id": "3868W",
        "title": "Race and War in America",
        "info": "Role that race has played in American war history. Impact that wars have had on race and race relations in the United States and the world. Literature, film.",
        "prereq": []
    },
    {
        "code": "HIST 3869",
        "subject": "HIST",
        "id": "3869",
        "title": "Urban American History",
        "info": "History/formation of American metropolis. Roots of \\\"urban problem.\\\" Framework for understanding life in contemporary urban spaces. How ideas about race, class, gender, and sexuality created/permeated urban infrastructures and stratified urban populations/economies.",
        "prereq": []
    },
    {
        "code": "HIST 3870",
        "subject": "HIST",
        "id": "3870",
        "title": "Topics -Am Ind Hist",
        "info": "Designed for advanced undergraduates. Topics may include social history, oral history, history of particular regions, political systems, education, and policy.",
        "prereq": []
    },
    {
        "code": "HIST 3871",
        "subject": "HIST",
        "id": "3871",
        "title": "Amer Indians to 1830",
        "info": "Introduction to American Indian history from ancient native America to the removal era. Focuses on the social, cultural, political, and economic diversity of Native American peoples and Native American experiences with European colonialism.",
        "prereq": []
    },
    {
        "code": "HIST 3872",
        "subject": "HIST",
        "id": "3872",
        "title": "Indians since 1830",
        "info": "Focus on the impact of federal Indian policy on American Indian cultures and societies, and on American Indian culture change.",
        "prereq": []
    },
    {
        "code": "HIST 3875W",
        "subject": "HIST",
        "id": "3875W",
        "title": "US Race/Ethnicity",
        "info": "This writing-intensive course examines the racial history of modern America to learn from and engage with what historians enmeshed in ethnic studies do. These historians examine the systematic and coordinated exercises of power called race in the American past and make legible how racially aggrieved groups responded to this shaping power. Thus, throughout, we ask, \\\"What did racial subjects do with what was done to them by the American system forged out of settler colonialism, slavery, racism, and other forms of injustice, exclusion, and violence?\\\" This question issues an intellectual challenge to do all that needs to be done to capture community life, the politics of difference, and the dynamism of social identities in all their richness, fullness, and complexity. In other words, we study and write about the racial history of modern America, including its ugly past and arc of justice, to consider what it would take to transcend this racial past.",
        "prereq": []
    },
    {
        "code": "HIST 3877",
        "subject": "HIST",
        "id": "3877",
        "title": "Asian Amer. History",
        "info": "Asian American history and contemporary issues, from 1850 to the present. Immigration, labor, anti-Asian movements, women/families, impact of World War Two, new immigrant/refugee communities, civil rights, Asian American identity/culture.",
        "prereq": []
    },
    {
        "code": "HIST 3878",
        "subject": "HIST",
        "id": "3878",
        "title": "American West",
        "info": "American West from Mexican-American War to present. U.S. expansion, Native-Anglo conflict, migration/immigration. Race, ethnicity, labor, class, and gender in the West. Business/politics of \\\"settling\\\" the region.",
        "prereq": []
    },
    {
        "code": "HIST 3881",
        "subject": "HIST",
        "id": "3881",
        "title": "US ForRel to 1914",
        "info": "American involvement in world affairs from 1760-1914 including political, economic, social, and cultural relations by individuals, groups, governmental, and non-governmental agencies focusing on nation building, creation of continental and commercial empires, hemispheric hegemony, cultural expansion, and wartime diplomacy.",
        "prereq": []
    },
    {
        "code": "HIST 3882",
        "subject": "HIST",
        "id": "3882",
        "title": "U.S. and the World",
        "info": "History of U.S. involvement in world affairs. Political, economic, social, cultural relations by individuals, groups, governmental, non-governmental agencies. Nation building, imperialism, hemispheric hegemony, cultural expansion, national security, wars.",
        "prereq": []
    },
    {
        "code": "HIST 3886",
        "subject": "HIST",
        "id": "3886",
        "title": "Atlantic Revolutions",
        "info": "Thinking about the rebellions that rocked the Atlantic world during the late eighteenth and early nineteenth centuries, we will compare and contrast the diverse political, economic, and social elements surrounding the following conflicts: the American Revolution, the French Revolution, the Haitian Revolution, and the Latin American Wars of Independence.",
        "prereq": []
    },
    {
        "code": "HIST 3891",
        "subject": "HIST",
        "id": "3891",
        "title": "Am Military Hist",
        "info": "Interaction of geography, politics, society, and technology in military growth. Influence of military on American national development 17th-20th centuries. Expansion/effect of land, sea, and air forces in 20th century.",
        "prereq": []
    },
    {
        "code": "HIST 3896",
        "subject": "HIST",
        "id": "3896",
        "title": "Internship for Academic Credit",
        "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor.",
        "prereq": []
    },
    {
        "code": "HIST 3900",
        "subject": "HIST",
        "id": "3900",
        "title": "Top in Med/Mod Eur",
        "info": "Selected topics in medieval and modern European history not covered in regular courses. To be taught as staffing and demand exist.\n\nprereq: Jr or sr or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 3910",
        "subject": "HIST",
        "id": "3910",
        "title": "Topics in US Hist",
        "info": "Selected topics in U.S. history not covered in regular courses. To be taught as staffing and demand exist.",
        "prereq": []
    },
    {
        "code": "HIST 3920",
        "subject": "HIST",
        "id": "3920",
        "title": "Topics:African Hist",
        "info": "Selected topics in African History not covered in regular courses. To be taught as staffing and demand exist.",
        "prereq": []
    },
    {
        "code": "HIST 3930",
        "subject": "HIST",
        "id": "3930",
        "title": "Top. Anc. Hist",
        "info": "Selected topics in Near Eastern, Egyptian, Greek, and Roman History.",
        "prereq": []
    },
    {
        "code": "HIST 3940",
        "subject": "HIST",
        "id": "3940",
        "title": "Topics-Asian Hist",
        "info": "Selected topics in Asian history not covered in regular courses. To be taught as staffing and demand exist.",
        "prereq": []
    },
    {
        "code": "HIST 3950",
        "subject": "HIST",
        "id": "3950",
        "title": "Topics LA History",
        "info": "Selected topics in Latin American history not covered in regular courses. To be taught as staffing and demand exist.",
        "prereq": []
    },
    {
        "code": "HIST 3959",
        "subject": "HIST",
        "id": "3959",
        "title": "How to Do History",
        "info": "Skills/research experience to complete senior paper. How to answer questions such as, \\\"What is history?\\\" How to locate/use historical sources, develop a thesis, and turn rough idea into full research proposal.\n\nprereq: History major or dept consent",
        "prereq": []
    },
    {
        "code": "HIST 3960",
        "subject": "HIST",
        "id": "3960",
        "title": "Topics in History",
        "info": "Selected history topics not covered in regular courses.",
        "prereq": []
    },
    {
        "code": "HIST 3970",
        "subject": "HIST",
        "id": "3970",
        "title": "Suppl. Discussion in History",
        "info": "Extra discussion section with T.A. Attached to concurrent 3xxx course.",
        "prereq": []
    },
    {
        "code": "HIST 3980W",
        "subject": "HIST",
        "id": "3980W",
        "title": "Suppl. Writing",
        "info": "May be attached, by agreement of instructor and students, to any 3xxx or 5xxx course to make a writing-intensive experience.\n\nprereq: instr consent; must take a 3-cr 3xxx or 5xxx course taken concurrently",
        "prereq": []
    },
    {
        "code": "HIST 3990",
        "subject": "HIST",
        "id": "3990",
        "title": "Hist Internship",
        "info": "Internship with a historical society, government, or community historical organization. Arranged through and supervised by department.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 3993",
        "subject": "HIST",
        "id": "3993",
        "title": "Directed Study",
        "info": "Guided individual reading or study. Open to qualified students for one or more semesters.\nPrereq instr consent, dept consent, college consent.",
        "prereq": []
    },
    {
        "code": "HIST 3994",
        "subject": "HIST",
        "id": "3994",
        "title": "Directed Research",
        "info": "Qualified students work on a tutorial basis.\nPrereq instr consent, dept consent, college consent.\n\nprereq: instr consent, dept consent, college consent",
        "prereq": []
    },
    {
        "code": "HIST 4011W",
        "subject": "HIST",
        "id": "4011W",
        "title": "Capstone Research",
        "info": "The capstone research course helps students prepare and complete their writing intensive research paper that satisfies the capstone requirement of the History Major. Class readings and exercises help students define a research question that fits within the thematic frame of the course, conceptualize the project, identify and analyze primary sources, craft a paper outline, revise drafts, and produce a final version of the Major Paper in History. Topics in 4011W/V will vary by semester and will be printed in the class schedule. \n\nprereq: Jr or Sr history major or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 4051",
        "subject": "HIST",
        "id": "4051",
        "title": "Ancient Near East and Egypt",
        "info": "Lands of Western Asia and Northeast Africa from Neolithic through Middle Bronze Age. Interdependent technological/political developments, such as agriculture, state formation, and writing. Use of literature/art as vehicles for articulating concepts. Changing relationships among culture/polities of ancient Near East and regions beyond.",
        "prereq": []
    },
    {
        "code": "HIST 4052",
        "subject": "HIST",
        "id": "4052",
        "title": "Ancient Near East and Egypt",
        "info": "Lands of Western Asia and Northeast Africa from Late Bronze Age to death of Alexander in 323 BCE. Growth/decline of empires. Diplomatic relations and sociopolitic transformations among Late Bronze and Iron Age states. New military technologies. Developments in religion/theology.",
        "prereq": []
    },
    {
        "code": "HIST 4061",
        "subject": "HIST",
        "id": "4061",
        "title": "Greek Hist to 400",
        "info": "Trace the history of the Greeks from their initial appearance in Greece in the Bronze Age to the close of the 5th century B.C. Special attention will be devoted to the polis, military development, and intellectual change.",
        "prereq": []
    },
    {
        "code": "HIST 4062",
        "subject": "HIST",
        "id": "4062",
        "title": "Greek Hist 400-30BC",
        "info": "Trace the history of the Greeks from the end of the Peloponnesian War through the decline of the polis, the rise of Macedon and Alexander the Great, the fragmentation of Alexander's empire in the Hellenistic World and the eventual Roman take over of that world.",
        "prereq": []
    },
    {
        "code": "HIST 4071",
        "subject": "HIST",
        "id": "4071",
        "title": "Rome to 78 BC",
        "info": "Intensively examine the political, institutional, and socioeconomic history of Rome from its origins to the death of Sulla in 78 B.C. The institutional strengths and weaknesses that led to the rise and fall of the Republic are the primary theme.\n\nprereq: An appropriate introductory course is recommended",
        "prereq": []
    },
    {
        "code": "HIST 4072",
        "subject": "HIST",
        "id": "4072",
        "title": "Rome, 78 BC-AD 117",
        "info": "Intensively examine the political, institutional, and socioeconomic history of Rome from the death of Sulla in 78 B.C. to the death of Trajan in A.D. 117.",
        "prereq": []
    },
    {
        "code": "HIST 4073",
        "subject": "HIST",
        "id": "4073",
        "title": "Rome, AD 117-641",
        "info": "Intensively examine the political, institutional, and socioeconomic history of Rome from the death of Trajan in A.D. 117 to the death of Theodosius in A.D. 395. Explores one historical question--the decline and fall of the Roman Empire.\n\nprereq: An appropriate introductory course is recommended",
        "prereq": []
    },
    {
        "code": "HIST 4135",
        "subject": "HIST",
        "id": "4135",
        "title": "Early Med Eur Russ",
        "info": "An analysis of the Turkic nomads, East Slavic agriculturalists, and Finnic foragers who inhabited early medieval European Russia and the Khazar, Bulghar, and Rus'/Viking states which came to rule them.",
        "prereq": []
    },
    {
        "code": "HIST 4136",
        "subject": "HIST",
        "id": "4136",
        "title": "Ivan the Terrible",
        "info": "Does Tsar Ivan IV (1530-1584) deserve his epithet of Terrible? Examine the various interpretations of Ivan and critically examine the primary sources for his reign. Attempt to determine Ivan's guilt in a simulated trial.",
        "prereq": []
    },
    {
        "code": "HIST 4272",
        "subject": "HIST",
        "id": "4272",
        "title": "Medieval Scandinavi",
        "info": "Examination of the economic, mental, political, and social landscapes and structures of Scandinavia in the 12th through 15th centuries, as well as of the principal events.",
        "prereq": []
    },
    {
        "code": "HIST 4273",
        "subject": "HIST",
        "id": "4273",
        "title": "Early Mod Scand",
        "info": "Economic, mental, political, and social landscapes and structures of Scandinavia in the 16th through 18th centuries. Constitutional and institutional developments in the process of state formation. Competition between Denmark and Sweden for hegemony in Scandinavia and the Baltic.",
        "prereq": []
    },
    {
        "code": "HIST 4274",
        "subject": "HIST",
        "id": "4274",
        "title": "Mod Scandinavia",
        "info": "Economic, political, and social landscapes and structures of Scandinavia in the 19th and 20th centuries with emphasis on migration, industrialization, democratization, domestic politics, international relations, the Scandinavian welfare state, and European integration.",
        "prereq": []
    },
    {
        "code": "HIST 4337",
        "subject": "HIST",
        "id": "4337",
        "title": "Bill of Rights/Supreme Court",
        "info": "Constitutional, political, philosophical, social context of leading U.S. Supreme Court cases on Bill of Rights. Emphasizes property rights, free speech, freedom of religion, right to bear arms, criminal defendants' rights, death penalty.",
        "prereq": []
    },
    {
        "code": "HIST 4521",
        "subject": "HIST",
        "id": "4521",
        "title": "Nat'lism in Japan",
        "info": "",
        "prereq": []
    },
    {
        "code": "HIST 4522",
        "subject": "HIST",
        "id": "4522",
        "title": "The Pacific War",
        "info": "Controversies over evidence and interpretation regarding Japanese aggression and war guilt in the Pacific War, including such issues as the responsibility of the Emperor and the American use of atomic weapons.",
        "prereq": []
    },
    {
        "code": "HIST 4900",
        "subject": "HIST",
        "id": "4900",
        "title": "Topics Med/Mod Eur",
        "info": "Selected topics in medieval and modern European history not covered in regular courses. Taught as staffing permits.",
        "prereq": []
    },
    {
        "code": "HIST 4910",
        "subject": "HIST",
        "id": "4910",
        "title": "Topics - US History",
        "info": "Selected topics in U.S. history not covered in regular courses. Taught as staffing permits.",
        "prereq": []
    },
    {
        "code": "HIST 4920",
        "subject": "HIST",
        "id": "4920",
        "title": "Topics-African Hist",
        "info": "Selected topics in African history not covered in regular courses. Taught as staffing permits.",
        "prereq": []
    },
    {
        "code": "HIST 4930",
        "subject": "HIST",
        "id": "4930",
        "title": "Topics Ancient Hist",
        "info": "Selected topics in Ancient history not covered in regular courses. Taught as staffing permits.",
        "prereq": []
    },
    {
        "code": "HIST 4940",
        "subject": "HIST",
        "id": "4940",
        "title": "Topics -Asian Hist",
        "info": "Selected topics in Asian history not covered in regular courses. Taught as staffing permits.",
        "prereq": []
    },
    {
        "code": "HIST 4950",
        "subject": "HIST",
        "id": "4950",
        "title": "Topics-Latin Amer",
        "info": "Selected topics in Latin American history not covered in regular courses. Taught as staffing permits.",
        "prereq": []
    },
    {
        "code": "HIST 4960",
        "subject": "HIST",
        "id": "4960",
        "title": "Topics in History",
        "info": "Selected topics in history not covered in regular courses. Taught as staffing permits.",
        "prereq": []
    },
    {
        "code": "HIST 4961W",
        "subject": "HIST",
        "id": "4961W",
        "title": "Major Paper",
        "info": "Research paper on topic of student's choice. Work largely with primary sources. Faculty guidance.\n\nprereq: Department Consent Required",
        "prereq": []
    },
    {
        "code": "HIST 4962",
        "subject": "HIST",
        "id": "4962",
        "title": "Undergraduate Proseminar",
        "info": "Themes vary by instructor. Reading/discussion of historiography/methodology. Research component.",
        "prereq": []
    },
    {
        "code": "HIST 4970",
        "subject": "HIST",
        "id": "4970",
        "title": "History Day Mentorship",
        "info": "HIST 4970 is a course designed to engage students in local grades 6-12 education through the National History Day in Minnesota program. This class requires that students complete at least 100 hours of mentoring work in History Day schools in the Twin Cities. While the focus of these hours will be in the classroom, some hours may be fulfilled through participation in other History Day support services and/or assistance with events. In addition to their commitments to their assigned school, students must participate in regular seminar meetings, complete assigned course work, and fulfill final project requirements. Following the start of the class, students will have been assigned to a school, received preliminary History Day training, meet participating teacher(s), and develop a schedule for school visits.\nMost of all, this course is about connections. The University is looking for civic engagement opportunities through its “Grand Challenges” curriculum that demonstrate the relevance of the institution and the contributions of its students to the citizens of the state. The College of Liberal Arts “roadmap” also places specific emphasis on connecting its majors to the structures of education in Minnesota. Furthermore, the connections you make in applied learning situations (internships and/or service learning) can be a determining factor in shaping future career paths or graduate education. The History Day mentor program is a unique opportunity to apply your academic skills in a real-world educational environment. Your efforts will assist teachers on the frontlines of education, and you will help build pathways to higher education for inner-city students. The instructors appreciate the interest in service learning that has brought you to this course, and it is our hope that this opportunity proves to be a highlight of your undergraduate experience.",
        "prereq": []
    },
    {
        "code": "HIST 5011",
        "subject": "HIST",
        "id": "5011",
        "title": "Quantitative Methods",
        "info": "The proliferation of public use datasets, computer-based information technologies, and the growing utilization of quantitative methods in social research?including research in history, demography, public health, and economics?have made it increasingly necessary for students to become familiar with quantitative methods. \n\nThis course has several specific and complementary goals. The first is to familiarize students?particularly graduate students in history and the population training program in the Minnesota Population Center?with the use of descriptive and inferential statistics in social research. Associated with this objective is a stress on basic numeracy and learning to read and evaluate newspaper articles, journal articles and monographs that employ a variety of statistical techniques and measures. We will devote about one hour a week to discussion of quantitative articles, focusing on the demographic history of the United States from the eighteenth century to the present. The readings for most of the semester are not set in stone; however, we will tailor them to the substantive interests of the class. \n\nThis is also a ?hands on? course, where you will be trained in the practice of quantitative methods. Our primary data source will be IPUMS census datasets for U.S. census years between 1850-2020, although we will also examine our public use data sources including IPUMS international and datasets available at ICPSR at the University of Michigan. Members of the class are expected to plan and carry out quantitative research projects of their own. A series of short exercises will prepare you for a research project utilizing skills learned over the course of the semester. The final quantitative research project, presented in the form of a poster, is an important component of the course. \n\nA final goal of History 5011 is to acquaint students with computers and computer applications useful in quantitative analysis, notably STATA (a syllabic abbreviation of the words statistics and data and a leading provider of statistical software for the social sciences).",
        "prereq": []
    },
    {
        "code": "HIST 5051",
        "subject": "HIST",
        "id": "5051",
        "title": "Mesopotamian Historiography",
        "info": "Historical method/sources for ancient Near Eastern history. Historical traditions. Historiographic texts of Mesopotamia and neighboring regions of the ancient Near East, secondary emphasis on their relationship to works of classical historians such as Herodotus. Use of these sources in modern historiography of ancient Near East.\n\nprereq: Prev coursework in ancient Near Eastern history recommended",
        "prereq": []
    },
    {
        "code": "HIST 5053",
        "subject": "HIST",
        "id": "5053",
        "title": "Proseminar in Roman History",
        "info": "Survey of major scholarship in field of Roman history since Mommsen. Political, cultural, social, military, and economic history. Focuses on methodological problems posed by evidence. Ways in which these issues shape research.\n\nprereq: Grad student or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5111",
        "subject": "HIST",
        "id": "5111",
        "title": "Med Europe Seminar",
        "info": "Examination of basic scholarly bibliography for medieval Western European history. Aim is to help students to prepare for M.A. and Ph.D. examinations.\n\nprereq: Advanced undergrads of exceptional ability or grads, instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5115",
        "subject": "HIST",
        "id": "5115",
        "title": "Med Latin Historian",
        "info": "Writing of history in Western Europe during the Middle Ages. Focus on idea of history, philosophy of various historians, techniques of research by medieval historians and chroniclers, history as literature, and value of medieval histories to modern research scholars. Latin texts only.\n\nprereq: Reading knowledge of Latin",
        "prereq": []
    },
    {
        "code": "HIST 5251",
        "subject": "HIST",
        "id": "5251",
        "title": "Postsocialist Transformations",
        "info": "Transformations underway in post-socialist societies of Eastern Europe, former Soviet Union. Ramifications of abandonment of state socialism, introduction of market relations. Effect of former system, new market system on cultural institutions/identities.",
        "prereq": []
    },
    {
        "code": "HIST 5264",
        "subject": "HIST",
        "id": "5264",
        "title": "Imperial Russia",
        "info": "Interaction with Europe and Asia; attempts at modernization and reform; emancipation of the serfs and rise of revolutionary movements.",
        "prereq": []
    },
    {
        "code": "HIST 5265",
        "subject": "HIST",
        "id": "5265",
        "title": "20th Century Russia",
        "info": "Analysis of the factors that led to the collapse of the tsarist regime; discussion of the 1917 revolution, the evolution of the Soviet regime and the collapse of Soviet communism. Emphasis on the role of nationalities and the rise of the Commonwealth of independent states.",
        "prereq": []
    },
    {
        "code": "HIST 5271",
        "subject": "HIST",
        "id": "5271",
        "title": "The Viking World",
        "info": "Viking society and expansion of Viking influence abroad. Viking impact on Western Europe, interactions with Slavic lands, settlement of North Atlantic islands, Western Europe's impact on Scandinavian lands. Analyzes archaeological, historical, linguistic, and numismatic evidence.",
        "prereq": []
    },
    {
        "code": "HIST 5274",
        "subject": "HIST",
        "id": "5274",
        "title": "South East Europe",
        "info": "The legacy of empires; 18th-century background; rise of Balkan nationalism; the Eastern Questions in the 18th and 19th centuries; the Balkans in the 20th century; population movements or exchanges; ethnic conflict in the Communist and Post-Communist periods.",
        "prereq": []
    },
    {
        "code": "HIST 5276",
        "subject": "HIST",
        "id": "5276",
        "title": "Modern Greece",
        "info": "Literary and cultural contributions of modern Greece. The modern Greek experience seen through Greek historical and cultural monuments. An attempt at self-definition.",
        "prereq": []
    },
    {
        "code": "HIST 5281",
        "subject": "HIST",
        "id": "5281",
        "title": "European Intellectual Hist I",
        "info": "First of a two-semester course. European thought in its historical/cultural context. Emphasizes development of philosophical/scientific thought, its relation to thinking about the individual and the community. Readings from original sources.\n\nprereq: Grad student or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5282",
        "subject": "HIST",
        "id": "5282",
        "title": "European Intellectual Hist II",
        "info": "Second of a two-semester course. European thought in its\nhistorical/cultural context. Emphasizes development of\nphilosophical/scientific thought, its relation to thinking about the individual and the community. Readings are from original sources.\n\nprereq: Grad student or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5283",
        "subject": "HIST",
        "id": "5283",
        "title": "Marx. Capital, and History",
        "info": "Explore Marx's understanding of capitalism and its history. Marx's argument regarding historical specificity of capitalism as economic/social condition",
        "prereq": []
    },
    {
        "code": "HIST 5285",
        "subject": "HIST",
        "id": "5285",
        "title": "Histor/Rep of the Holocaust",
        "info": "Relationship of paintings, memorials, and other art forms to the question of understanding the Holocaust. Issues of sources, especially use of the Survivors of the Shoah project in U libraries.",
        "prereq": []
    },
    {
        "code": "HIST 5286",
        "subject": "HIST",
        "id": "5286",
        "title": "Galileo and Modern Science",
        "info": "The life and work of Galileo Galilei (1564-1642), often called the founder of modern science. Topics: the Renaissance Italian context for Galileos work; the arrangements of authoritative knowledge that prevailed in 16th-century Tuscany and Venice; the role that universities, the Catholic church, learned academies, and the state played in disciplining knowledge. We consider the episodes of Galileos career and read his seminal texts with secondary commentaries upon them. His telescopic observations of 1609-10; his battles with Aristotelian natural philosophy; his experiments and arguments on behalf of experimental and mathematical physics; his defense of Copernican heliocentric cosmology and his trial and condemnation by the Roman Catholic Church for heresy; and his work in mathematics and mathematical physics that paved the way for Newton and Einstein. The goal will be to understand the achievements of Galileo in their specific historical and cultural context and to use these reflections for thinking about the nature of the modern science that he helped to initiate.",
        "prereq": []
    },
    {
        "code": "HIST 5294",
        "subject": "HIST",
        "id": "5294",
        "title": "Soc Hist Russia/East Europe",
        "info": "Lives of peasants and workers, nobles and merchants. Topics include family, marriage, sexuality; culture and tradition; transformation from an agricultural to a modern society.",
        "prereq": []
    },
    {
        "code": "HIST 5295",
        "subject": "HIST",
        "id": "5295",
        "title": "Russia & East Eur",
        "info": "Social movements (revolutionary, nationalist, women's); communist and post-communist societies.",
        "prereq": []
    },
    {
        "code": "HIST 5379",
        "subject": "HIST",
        "id": "5379",
        "title": "Early American Hist",
        "info": "Intensive consideration of topics in early American history. Topics may include readings in race, class, and gender; comparative colonialism; slavery; demography; economic history; religion; and regions in the colonial world.",
        "prereq": []
    },
    {
        "code": "HIST 5381",
        "subject": "HIST",
        "id": "5381",
        "title": "MN Hist Workshop",
        "info": "A case study and seminar approach to historical research and interpretation. It offers teachers and other scholars a chance to survey a particular topic in Minnesota history and to write their own historical narrative based on primary source research.\n\nprereq: 1301, 1302",
        "prereq": {
            "and": [
                {
                    "code": "HIST 1301",
                    "subject": "HIST",
                    "id": "1301"
                },
                {
                    "code": "HIST 1302",
                    "subject": "HIST",
                    "id": "1302"
                }
            ]
        }
    },
    {
        "code": "HIST 5421",
        "subject": "HIST",
        "id": "5421",
        "title": "Gender Lat Am Hist",
        "info": "Women's history/masculinity. Gender/colonialism, marriage, sexuality, nationalism, labor, political movements, feminism.",
        "prereq": []
    },
    {
        "code": "HIST 5436",
        "subject": "HIST",
        "id": "5436",
        "title": "African Women",
        "info": "Explore the historical forces which have shaped African women's everyday lives and the ways in which these women have been active agents in the making of their own histories.",
        "prereq": []
    },
    {
        "code": "HIST 5437",
        "subject": "HIST",
        "id": "5437",
        "title": "History of East Africa",
        "info": "Major themes in history of East Africa, from era of early human cultural development to present. Methods that historians use to reconstruct history. Varying interpretations/constructions of history over time.",
        "prereq": []
    },
    {
        "code": "HIST 5438",
        "subject": "HIST",
        "id": "5438",
        "title": "AfrAm Experience in So Africa",
        "info": "Ideological, political, religious, and cultural ties that have informed African American and black South African relations from late 18th century to present.",
        "prereq": []
    },
    {
        "code": "HIST 5439",
        "subject": "HIST",
        "id": "5439",
        "title": "Environment/Society in Africa",
        "info": "Major historiographical, theoretical, and methodological debates concerning people-environment relations in Africa, from rise of human societies to present. Environment and the rise of civilizations. Demography, colonial environmental policies, conservation, disease, indigenous knowledge, water management, food.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5441",
        "subject": "HIST",
        "id": "5441",
        "title": "Pre-Colonial Africa",
        "info": "African internal/external processes before 1600. Framework by which early African history is understood, tools for reconstructing it, themes/debates that have shaped it, new directions in which it is moving. \n",
        "prereq": []
    },
    {
        "code": "HIST 5446",
        "subject": "HIST",
        "id": "5446",
        "title": "Problems W. Africa",
        "info": "This problem-centered course explores several of the major historiographical, methodological, and theoretical debates in West African history. Core topics include state formation, trade, slavery, Islam, gender, and colonialism.",
        "prereq": []
    },
    {
        "code": "HIST 5461",
        "subject": "HIST",
        "id": "5461",
        "title": "Intro to E. Asia I",
        "info": "Comparative survey of early history of China, Japan, Korea, and Vietnam. Early Chinese thought. Diffusion of Confucianism, Buddhism, and other values throughout East Asia. Political and social history of region to 1600.\n",
        "prereq": []
    },
    {
        "code": "HIST 5462",
        "subject": "HIST",
        "id": "5462",
        "title": "East Asia from 1500-Present",
        "info": "How Asian states, societies, economies, and cultures linked with one another and with European powers. How period's historical effects still resonate. Covers India, China, Japan, Korea, and Indochina.\n",
        "prereq": []
    },
    {
        "code": "HIST 5464",
        "subject": "HIST",
        "id": "5464",
        "title": "China: Song -Ming",
        "info": "China during the Song (976-1279), Yuan (1279-1368) and Ming (1368-1644) dynasties, political institutions, and social structures. Attention to primary sources and how historians ask and answer questions about the past.",
        "prereq": []
    },
    {
        "code": "HIST 5465",
        "subject": "HIST",
        "id": "5465",
        "title": "China in Ming&Qing",
        "info": "Political/social history of China from 1600 until end of Qing dynasty in 1911. Ethnicity, daily life, legal structures, city life, peasantry.",
        "prereq": []
    },
    {
        "code": "HIST 5467",
        "subject": "HIST",
        "id": "5467",
        "title": "State & Rev in Chin",
        "info": "Modern China's political evolution including the Taiping Rebellion, Republican Revolution, rise of Nationalist and Communist parties, Maoist era; reform under Deng Xiaoping, and the emergence of democracy in Taiwan.",
        "prereq": []
    },
    {
        "code": "HIST 5468",
        "subject": "HIST",
        "id": "5468",
        "title": "Soc Change in China",
        "info": "Opium War and opening of Treaty Ports in 19th century; missionary activity and cultural influence; changes in education system; women's movement; early industrialization; socialism and collectivization after 1949; industrialization of Taiwan; PRC's entry into the world trading system.",
        "prereq": []
    },
    {
        "code": "HIST 5469",
        "subject": "HIST",
        "id": "5469",
        "title": "Historiographies of China",
        "info": "Important recent English-language work on Chinese culture during the Song, Yuan, and Ming dynasties. Topics include religion, gender, family structures, ethnic identity, commerce/economics, and political structures/events.\n\nprereq: Grad student or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5472",
        "subject": "HIST",
        "id": "5472",
        "title": "Early Modern Japan",
        "info": "Tradition/change in society/culture under Tokugawa shoguns (1600-1867). Growth of cities. Decline of samurai class. Response to Western intrusion.",
        "prereq": []
    },
    {
        "code": "HIST 5473",
        "subject": "HIST",
        "id": "5473",
        "title": "Japan's Modernities",
        "info": "Historiography on modern Japan in English language scholarship. Major trends since 1950s, latest scholarship. Issues concerning Japan's modernity. Definitions of modernity, modernization, and modernism. Relationship between knowledge-making and nation building. Japan's place in world.",
        "prereq": []
    },
    {
        "code": "HIST 5474",
        "subject": "HIST",
        "id": "5474",
        "title": "Sex and Politics, Japan",
        "info": "History of gender/sexuality in modern Japan and Korea. Geography of Japan. Theoretical/methodological literature not specific to Japan. Sexology, eugenics, feminism, nationalism, colonialism, cyber sexuality.",
        "prereq": []
    },
    {
        "code": "HIST 5478",
        "subject": "HIST",
        "id": "5478",
        "title": "Tigers and Dragons",
        "info": "Rise of East Asian Economies, 1930-Present.\n\nprereq: Grad student",
        "prereq": []
    },
    {
        "code": "HIST 5479",
        "subject": "HIST",
        "id": "5479",
        "title": "Chinese Cities and Urban Life",
        "info": "Introduction to traditional Chinese cities, their modern transformation. Ideal city plan in Confucian classics compared with physical layout of some major cities. Models about Chinese cities, influence of the models on our understanding of Chinese history/society.",
        "prereq": []
    },
    {
        "code": "HIST 5501",
        "subject": "HIST",
        "id": "5501",
        "title": "Med Eur & the World",
        "info": "Place of medieval Europe in the world. Relations of Europe with Asia, Africa, and the Americas. European knowledge of the world's other great cultures. European travelers/explorers. Assessment of other cultures' knowledge of Europe in the period.",
        "prereq": []
    },
    {
        "code": "HIST 5505",
        "subject": "HIST",
        "id": "5505",
        "title": "Survey of the Middle East",
        "info": "Peoples, lands, cultures of the Middle East, from earliest civilizations to present.",
        "prereq": []
    },
    {
        "code": "HIST 5513",
        "subject": "HIST",
        "id": "5513",
        "title": "North Africa since 1500",
        "info": "History of the Maghrib (Morocco, Algeria, Tunisia, Libya and disputed territories of Western Sahara from time of Ottoman expansion/Sharifian dynasties [Sa'dian/'Alawid]) in 16th/17th Centuries to end of 20th century.  Focus on encounter of Islamic cultures/societies of Maghrib and Africa/Europe",
        "prereq": []
    },
    {
        "code": "HIST 5520",
        "subject": "HIST",
        "id": "5520",
        "title": "Topics in Chinese History",
        "info": "Selected topics not covered in regular courses. Taught as staffing permits. ",
        "prereq": []
    },
    {
        "code": "HIST 5540",
        "subject": "HIST",
        "id": "5540",
        "title": "Topics Mediterranean Studies",
        "info": "Mediterranean history, from Middle Ages to present. Taught as staffing permits.\n\nprereq: Grad student or advanced undergrad with instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5541",
        "subject": "HIST",
        "id": "5541",
        "title": "Islam-Catholic Age",
        "info": "Rise of Islam in its Arabian setting. Roles of prophet, orthodox/Umayyad caliphs. Development of Islamic state/empire, organizations, institutions, status of Muslims/non-Muslims.",
        "prereq": []
    },
    {
        "code": "HIST 5547",
        "subject": "HIST",
        "id": "5547",
        "title": "Empire & Nations Middle East",
        "info": "Modernity in non-Western imperial context. Identity, ideology, economy, environment, language.\n\nprereq: Grad student or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5611",
        "subject": "HIST",
        "id": "5611",
        "title": "Middle Ages, ca. 300-1100",
        "info": "Basic scholarly bibliography for medieval Western European history during early Middle Ages. Foundation for teaching courses in medieval history, preparing for general doctoral exam.\n\nprereq: Grad student or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5612",
        "subject": "HIST",
        "id": "5612",
        "title": "Middle Ages: ca. 1100-1500",
        "info": "Basic scholarly bibliography for medieval Western European history during central/later Middle Ages. Foundation for teaching courses in medieval history, preparing for general doctoral exam.\n\nprereq: [5611, grad student] or instr consent",
        "prereq": {
            "code": "HIST 5611",
            "subject": "HIST",
            "id": "5611"
        }
    },
    {
        "code": "HIST 5614",
        "subject": "HIST",
        "id": "5614",
        "title": "The Medieval Church",
        "info": "Introduction to history of western church in Middle Ages. Emphasizes church teachings and institutional structures, beliefs/practices of lay people, medieval Christian encounter with non-Christian world.\n\nprereq: Grad student or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5616",
        "subject": "HIST",
        "id": "5616",
        "title": "Pros Medieval Spain",
        "info": "Graduate research on the development of the medieval kingdoms of Spain from Roman times to ca. 1500. Emphasis on major social, economic, and cultural developments. Christian, Jewish, and Muslim interaction. Spain and the beginnings of European expansion. ",
        "prereq": []
    },
    {
        "code": "HIST 5617",
        "subject": "HIST",
        "id": "5617",
        "title": "Spain,1492-1814",
        "info": "Historiography, documents, and archives of early modern Spain analyzed. Includes reading in modern English and Spanish and practical experience with Spanish manuscript documents from the period.",
        "prereq": []
    },
    {
        "code": "HIST 5621",
        "subject": "HIST",
        "id": "5621",
        "title": "Proseminar: French Revolution",
        "info": "Historical literature about French Revolution of 1789. Old Regime political culture, Enlightenment, origins of the revolution, revolutionary transformations in society, politics/culture both in France and abroad, the Terror, Napoleon, revolutionary legacy.",
        "prereq": []
    },
    {
        "code": "HIST 5631",
        "subject": "HIST",
        "id": "5631",
        "title": "Comp Early Mod Hist",
        "info": "Critical reading of historical literature dealing with integration of the globe during the early modern period, ca. 1350-1750; book reports, class discussion.",
        "prereq": []
    },
    {
        "code": "HIST 5632",
        "subject": "HIST",
        "id": "5632",
        "title": "World History Proseminar",
        "info": "Theoretical approaches to world/global history. Review of major theories, controversies, chronologies, pedagogical approaches.",
        "prereq": []
    },
    {
        "code": "HIST 5633",
        "subject": "HIST",
        "id": "5633",
        "title": "Socioeconomic History of China",
        "info": "Nature of Chinese socio-political formations and economic development in Qing and Republican eras, 1644-1937. Establishment/methods of state rule, merchants, agrarian social structure, domestic industry, demographic regimes, capitalism, and imperialism. Comparisons using theoretical and case studies of economic development.\n\nprereq: Grad student or [adv undergrad, instr consent]",
        "prereq": []
    },
    {
        "code": "HIST 5634",
        "subject": "HIST",
        "id": "5634",
        "title": "Med Russ Proseminar",
        "info": "Selected readings covering the major studies, key primary sources, and basic interpretations of the peoples of medieval and early modern European Russia as well as an analysis of the new approaches and interpretations in the field.",
        "prereq": []
    },
    {
        "code": "HIST 5640",
        "subject": "HIST",
        "id": "5640",
        "title": "Topics in Legal History",
        "info": "Cmparative approaches to, methodologies of, and theoretical debates in legal history. Topics from ancient world to present, such as citizenship/statebuilding, religion and the law, women?s legal history.",
        "prereq": []
    },
    {
        "code": "HIST 5642",
        "subject": "HIST",
        "id": "5642",
        "title": "U.S. Legal History",
        "info": "Topics in history of American law, legal thought, legal institutions, and legal profession. Proceeds thematically. Primary/secondary sources.",
        "prereq": []
    },
    {
        "code": "HIST 5646",
        "subject": "HIST",
        "id": "5646",
        "title": "U.S. Women's Legal History",
        "info": "Women's legal status in U.S. history, 1648 to present. Changes in women's legal status in marriage, divorce, and child custody; reproductive/sexual autonomy; and economic/educational equality. Differences among women based on race, class, and ethnicity.",
        "prereq": []
    },
    {
        "code": "HIST 5648",
        "subject": "HIST",
        "id": "5648",
        "title": "West. European Legal Tradition",
        "info": "Evolution of and interaction among Roman and civil law, customary/feudal law, canon law, and English common law. Primary/secondary sources in English.  ",
        "prereq": []
    },
    {
        "code": "HIST 5649",
        "subject": "HIST",
        "id": "5649",
        "title": "Early Modern Ideas in Context",
        "info": "Role of institutions/locale in development of early-modern European thought/culture. University, academy, learned society, princely court, museum, printing house, workshop, trading company, armies/navies, state bureaucracies, salons, other independent associations of nascent civil society.",
        "prereq": []
    },
    {
        "code": "HIST 5650",
        "subject": "HIST",
        "id": "5650",
        "title": "Early Modern Europe",
        "info": "Critical reading of historical literature for early modern Europe, ca. 1450-1700., dealing with France, Germany, Italy, the Low Countries, and Spain. Each student chooses a country to focus on; book reports, class discussion.",
        "prereq": []
    },
    {
        "code": "HIST 5651",
        "subject": "HIST",
        "id": "5651",
        "title": "Tudor Proseminar",
        "info": "A critical study of principal writings about English history during the Tudor and Stuart periods.",
        "prereq": []
    },
    {
        "code": "HIST 5652",
        "subject": "HIST",
        "id": "5652",
        "title": "Stuart Proseminar",
        "info": "Critical study of principal writings about English history.",
        "prereq": []
    },
    {
        "code": "HIST 5671",
        "subject": "HIST",
        "id": "5671",
        "title": "British Empire",
        "info": "Critical study of major writings in British history, 1760-1945, and preparation for research in field.",
        "prereq": []
    },
    {
        "code": "HIST 5708",
        "subject": "HIST",
        "id": "5708",
        "title": "The Age of Curiosity",
        "info": "Diverse ways in which making of art and scientific knowledge intersected in early modern Europe. Connections between scientific curiosity and visual arts in major artists (e.g., da Vinci, Durer, Vermeer, Rembrandt). Artfulness of scientific imagery/diagrams, geographical maps, cabinets of curiosities, and new visual technologies, such as the telescope and microscope.",
        "prereq": []
    },
    {
        "code": "HIST 5711",
        "subject": "HIST",
        "id": "5711",
        "title": "Cognitive History",
        "info": "Cognitive History will examine how research in cognitive neuroscience provides historians with new knowledge and methods for asking questions about the past. It is not a course on the history of the cognitive sciences. Instead, it is about practicing history in the cognitive age, a period that began more than fifty years ago, and an approach to explaining how humans think and act that has been adopted within fields across our universities. The course will combine broad readings and discussions in \\\"Big History\\\" and the shift from behaviorism to cognition with more specific studies about memory, narrative, aesthetics, the body, and violence.\nStudents will have an opportunity to apply a cognitive history approach to a specific topic that emphasizes one of the following topics: Evolution, Behaviorism, Cognitive Cultural Studies, Memory, Narrative, Aesthetics, the Body, and Violence. Students will help guide discussions for the relevant class sessions on these topics and write an essay on the selected theme",
        "prereq": []
    },
    {
        "code": "HIST 5715",
        "subject": "HIST",
        "id": "5715",
        "title": "Eur Womens Hist",
        "info": "Introduction to current historical research on European women's history, 1450-1750. Topics include gender roles and form of family structure, women's participation in religious movements, legal status of women.",
        "prereq": []
    },
    {
        "code": "HIST 5720",
        "subject": "HIST",
        "id": "5720",
        "title": "Society/Politics:Modern Europe",
        "info": "Introduction to literature in English on problems of modern European social, cultural, political history. Thematic/geographic focus varies year to year. Topics include historical approaches to class/gender relations, state formation as social/political process, family history, evolution of public life, popular culture.",
        "prereq": []
    },
    {
        "code": "HIST 5721",
        "subject": "HIST",
        "id": "5721",
        "title": "20th Century Europe",
        "info": "The historical literature and debates surrounding major issues in the social, political, cultural, and economic development of Europe from the turn of the century through the impact of WWII. Topics include the development of imperialism, national rivalries, social and political conflict, the rise of fascism and communism, and the origins of war.",
        "prereq": []
    },
    {
        "code": "HIST 5728",
        "subject": "HIST",
        "id": "5728",
        "title": "The History of Human Rights",
        "info": "What are human rights? How and when did they originate? How were such rights promoted, protected and contested at different historical junctures, and by whom? In this course, we will examine the historical processes through which human rights have been conceptualized, codified, violated, and vindicated. Throughout the semester, we will travel across the globe and trace events that span from the eighteenth century to the present day. Our search will take us through the multiple histories that have shaped what we nowadays recognize as the human rights framework – its institutions, products and norms. Integrating perspectives and readings from the humanities, social sciences and legal studies, this course explores how meanings of human rights have fluctuated in response to historical developments, and how human rights have come to gain their prominent role in contemporary politics, law and culture.",
        "prereq": []
    },
    {
        "code": "HIST 5735",
        "subject": "HIST",
        "id": "5735",
        "title": "Eur Wom Since 1750",
        "info": "Selected themes in modern European women's history. Forms of patriarchy. Women in the Enlightenment. Women and revolution. Gender, class, and family life. Women in the labor force. Sexuality and reproduction. Female education. Women's political movements. Women and imperialism. Gender and fascism.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5740",
        "subject": "HIST",
        "id": "5740",
        "title": "Modern Germany",
        "info": "Readings and discussions on some central questions concerning the history of Germany during the modern period with a particular emphasis on the relationship between social change and political development. Offerings vary in thematic and chronological focus.",
        "prereq": []
    },
    {
        "code": "HIST 5756",
        "subject": "HIST",
        "id": "5756",
        "title": "Mod Greek Studies",
        "info": "Evolution of modern Greece from mid-18th century to the present. Political, cultural, and socioeconomic factors that contributed to Greek nationalism. Establishment of independent Greece and its role in the European community of nations.",
        "prereq": []
    },
    {
        "code": "HIST 5761",
        "subject": "HIST",
        "id": "5761",
        "title": "Imperial Russia",
        "info": "Western and Russian historiography on crucial issues of imperial Russia. Political institutions; culture and society; modernization and reforms; new interpretations.",
        "prereq": []
    },
    {
        "code": "HIST 5762",
        "subject": "HIST",
        "id": "5762",
        "title": "20th Century Russia",
        "info": "Western and Russian historiography on crucial issues of 20th-century Russia. The nature of revolutions, debate over the evolution of the Soviet regime, the collapse of empires, new interpretations.",
        "prereq": []
    },
    {
        "code": "HIST 5777",
        "subject": "HIST",
        "id": "5777",
        "title": "Habsburg Proseminar",
        "info": "Central Europe under Habsburg rule from the reforms of Maria Theresa to imperial collapse. Continuity and change in society; economic and political modernization; the rise of national consciousness and anti-Semitism; politics and culture in the Fin de Siecle; the Empire and World War I.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5794",
        "subject": "HIST",
        "id": "5794",
        "title": "Eur Eco Hist Prosem",
        "info": "Europe's rise in the world economy; England's industrial revolution and uneven development in Europe; imperialism and World War I; the Great Depression; the post-1945 economic miracle; continuity and change in Eastern Europe.",
        "prereq": []
    },
    {
        "code": "HIST 5797",
        "subject": "HIST",
        "id": "5797",
        "title": "Methods of Population History",
        "info": "Standard methods of population analysis. Focuses on methods widely used for historical population research.",
        "prereq": []
    },
    {
        "code": "HIST 5801",
        "subject": "HIST",
        "id": "5801",
        "title": "Seminar in American History",
        "info": "This intensive reading seminar offers an introduction to recent and innovative scholarship in American history. Students' main project in the course is to research and write a ?state of the field? essay on a subfield of their choice (in consultation with the instructor) that assesses the literature produced in the last decade or so. The essay will identify the key questions recently and currently animating the subfield, and it will discuss the descriptive and explanatory power of various approaches and modes of analysis.  \nThe course is required for Americanist graduate students, and for graduate students with an American History minor or a comparative field in American History.  The course is taught in alternating years.",
        "prereq": []
    },
    {
        "code": "HIST 5802",
        "subject": "HIST",
        "id": "5802",
        "title": "Readings in US Hist, 1848-Pres",
        "info": "Readings-intensive course. U.S. history from Mexican-American War to present.",
        "prereq": []
    },
    {
        "code": "HIST 5811",
        "subject": "HIST",
        "id": "5811",
        "title": "19th Century U.S. History",
        "info": "Proseminar. Central themes/debates in historiography of 19th-century United States. Market revolution, antebellum party politics. Slavery, the Civil War, Reconstruction. Immigration and nationalism. Transformations in ideologies/experiences of race/gender. Industrialization, labor, and urbanization. Western expansion. Emergence of populism/progressivism.",
        "prereq": []
    },
    {
        "code": "HIST 5821",
        "subject": "HIST",
        "id": "5821",
        "title": "20th century America",
        "info": "Intensive readings seminar.",
        "prereq": []
    },
    {
        "code": "HIST 5831",
        "subject": "HIST",
        "id": "5831",
        "title": "Legacy of the Cold War:Reading",
        "info": "Culture of the Cold War, its legacy. How it affected/reflected domestic politics, public policies, civic life, gender expectations, sexuality, class relations, racial justice, and civil rights.  Impact of domestic anti-communism and of American cultural politics abroad.",
        "prereq": []
    },
    {
        "code": "HIST 5841",
        "subject": "HIST",
        "id": "5841",
        "title": "Am. Economic Hist",
        "info": "Historical literature on American economic and business history from American Revolution to the modern economy.",
        "prereq": []
    },
    {
        "code": "HIST 5844",
        "subject": "HIST",
        "id": "5844",
        "title": "US Labor History",
        "info": "Readings in classic and recent approaches to the history of the working class in the United States. Central topics include slavery and free labor, women's paid and unpaid labor, management strategy, labor protest, and trade union organization.",
        "prereq": []
    },
    {
        "code": "HIST 5845",
        "subject": "HIST",
        "id": "5845",
        "title": "History of American Capitalism",
        "info": "Historiography/history of American capitalism. Crucial events (e.g., market \\\"revolution,\\\" development of industrial cities) focus weekly discussions of new literature. Students analyze theoretical models of capitalism and new work in social, political, and economic history.",
        "prereq": []
    },
    {
        "code": "HIST 5857",
        "subject": "HIST",
        "id": "5857",
        "title": "Hist of Amer Women",
        "info": "An intensive graduate-level readings course. Survey selected significant topics in historical literature, conceptual frameworks, and methodological problems in the history of American women from 1600 to the present.",
        "prereq": []
    },
    {
        "code": "HIST 5861",
        "subject": "HIST",
        "id": "5861",
        "title": "Amer Immigration",
        "info": "Readings in historical literature on immigration to the United States. Emphasis on recent works distinguished by new research methodologies and interpretations.",
        "prereq": []
    },
    {
        "code": "HIST 5862",
        "subject": "HIST",
        "id": "5862",
        "title": "American Immigration",
        "info": "Readings in historical literature on immigration to the United States. Emphasis on recent works distinguished by new research methodologies and interpretations. Each student undertakes an independent reading and/or research project.",
        "prereq": []
    },
    {
        "code": "HIST 5863",
        "subject": "HIST",
        "id": "5863",
        "title": "U.S.-Mexico Border Proseminar",
        "info": "Part of a two-semester sequence. Historiographical approaches to region. Vision of a unified border.",
        "prereq": []
    },
    {
        "code": "HIST 5871",
        "subject": "HIST",
        "id": "5871",
        "title": "US Intellectual His",
        "info": "Definitions of American national identity from 1789 to the present as\nexpressed in politics, religion, literature, painting, music, architecture, and history.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5877",
        "subject": "HIST",
        "id": "5877",
        "title": "Asian American History",
        "info": "Introduction to key issues, theoretical frameworks, research, and methodologies of Asian American history. Seminal texts that defined the field. Recent scholarship in history and in related disciplines. Emphasis field's comparative/transnational linkages to ethnic studies, Asian studies, and the Americas.",
        "prereq": []
    },
    {
        "code": "HIST 5881",
        "subject": "HIST",
        "id": "5881",
        "title": "Amer ForRel to 1895",
        "info": "Intensive readings in the historiography of American foreign relations with emphasis on American imperialism, domestic courses of foreign policy, and international political, economic, and cultural relations.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5882",
        "subject": "HIST",
        "id": "5882",
        "title": "Amer ForRel Since..",
        "info": "Intensive readings in the historiography of American foreign relations with emphasis on American imperialism, domestic courses of foreign policy, and international political, economic, and cultural relations.",
        "prereq": []
    },
    {
        "code": "HIST 5890",
        "subject": "HIST",
        "id": "5890",
        "title": "Readings in Amer Indian Hist",
        "info": "Students in this course will read recently published scholarship in American Indian and Indigenous history that takes up pressing research questions, promises to push inquiry in new directions, and that theorizes important interventions in our thinking to understand where the field is situated and moving. Reflecting the instinctively interdisciplinary nature of American Indian and Indigenous history, readings will be drawn not just from the discipline of history but across other disciplines such as Anthropology, American Studies, Geography, Literature, Political Science, and Legal Studies. As well, readings will include scholarship that reaches out to embrace the Global Indigenous studies turn.\nprereq: Advanced undergrad with instr consent or grad student",
        "prereq": []
    },
    {
        "code": "HIST 5891",
        "subject": "HIST",
        "id": "5891",
        "title": "American Indian Workshop",
        "info": "The American Indian and Indigenous Studies Workshop brings graduate and advanced undergraduate students and faculty together to read and provide intensive feedback (written and oral) on their works in progress. As an interdisciplinary field, AIIS students stand to benefit from ongoing and engaged conversations about that work that will deepen and enhance their professionalization in the field. The readings for the workshop are submissions from the membership of the workshop (which will include participants who are not formally enrolled in the workshop). We read and consider two submissions per week (sometimes more if the submissions are shorter) that are pre-circulated to all participants via the workshop’s listserv. Readings under consideration include research papers, dissertation chapters, article manuscripts, research proposals, conference papers, and other submissions that will benefit from intensive engagement with the members and will deepen the knowledge of all of the participants. Students will gain experience with the research, writing, and revision process as well as scholarly conversations about original research and writing. The overarching aim of the workshop is to develop research, writing, revision, and scholarly discussion skills as well as community-building in American Indian and Indigenous Studies and professionalization in an increasingly interdisciplinary and global field of study",
        "prereq": []
    },
    {
        "code": "HIST 5900",
        "subject": "HIST",
        "id": "5900",
        "title": "Topics Eur/Med Hist",
        "info": "Selected topics in European or medieval history not covered in regular courses; taught as staffing permits.\n\nprereq: Grad or [advanced undergrad with instr consent]",
        "prereq": []
    },
    {
        "code": "HIST 5901",
        "subject": "HIST",
        "id": "5901",
        "title": "Colonial Latin America",
        "info": "Introduces beginning graduate and advanced undergraduate students to major historical writings on various Latin American themes.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5902",
        "subject": "HIST",
        "id": "5902",
        "title": "Modern Latin America",
        "info": "Introduces beginning graduate and advanced undergraduate students to major historical writings on various Latin American themes.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5905",
        "subject": "HIST",
        "id": "5905",
        "title": "Topics Eur Med Hist",
        "info": "Selected topics in Medieval European history, up to 1500ce.\n\nprereq: Grad or [advanced undergrad with instr consent]",
        "prereq": []
    },
    {
        "code": "HIST 5910",
        "subject": "HIST",
        "id": "5910",
        "title": "Topics: U.S. History",
        "info": "Selected topics in U.S. history not covered in regular courses. Taught as staffing permits.\n\nprereq: Grad or advanced undergrad student with instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5920",
        "subject": "HIST",
        "id": "5920",
        "title": "Topics in African History",
        "info": "Topics not covered in regular courses.",
        "prereq": []
    },
    {
        "code": "HIST 5930",
        "subject": "HIST",
        "id": "5930",
        "title": "Topics Ancient Hist",
        "info": "Selected topics in ancient history not covered in regular courses. To be taught as staffing permits and as enrollment warrants.\n\nprereq: Grad or instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5931",
        "subject": "HIST",
        "id": "5931",
        "title": "Third World History",
        "info": "Topics specified in Class Schedule.",
        "prereq": []
    },
    {
        "code": "HIST 5932",
        "subject": "HIST",
        "id": "5932",
        "title": "Africa Production of Knowledge",
        "info": "Recent scholarship on social history of Africa. Focuses on new literature on daily lives of ordinary people in their workplaces, communities, households.",
        "prereq": []
    },
    {
        "code": "HIST 5933",
        "subject": "HIST",
        "id": "5933",
        "title": "Sem in Anc. Hist",
        "info": "Seminar on a selected topic in ancient history.",
        "prereq": []
    },
    {
        "code": "HIST 5934",
        "subject": "HIST",
        "id": "5934",
        "title": "Comp Hist and Social Theory",
        "info": "Works of history/sociology that are broadly comparative/theoretical. Issues of state formation, social movements, social structure, and economic development.",
        "prereq": []
    },
    {
        "code": "HIST 5935",
        "subject": "HIST",
        "id": "5935",
        "title": "Methods/Pedagogy in Afr Hist",
        "info": "Current historical methods/sources of African history. Pedagogical issues. Students design their own courses.\n",
        "prereq": []
    },
    {
        "code": "HIST 5940",
        "subject": "HIST",
        "id": "5940",
        "title": "Topics in Asian History",
        "info": "Topics not covered in regular courses.\n\nprereq: Grad student or [advanced undergrad, instr consent]",
        "prereq": []
    },
    {
        "code": "HIST 5941",
        "subject": "HIST",
        "id": "5941",
        "title": "Chinese Documents",
        "info": "Readings in Chinese on a topic to be selected by the instructor. Depending on the topic and the time period, readings may involve a mixture of modern and classical Chinese or may be entirely in modern Chinese. Consult instructor for more information.\n\nprereq: Reading knowledge of Chinese",
        "prereq": []
    },
    {
        "code": "HIST 5942",
        "subject": "HIST",
        "id": "5942",
        "title": "Topics: History of Medicine",
        "info": "An exploration of topics central to the history of medicine. Emphasis on mid-18th century to the present. Topics vary yearly.",
        "prereq": []
    },
    {
        "code": "HIST 5950",
        "subject": "HIST",
        "id": "5950",
        "title": "Topics Lat Amer Hist",
        "info": "Selected topics in Latin American history not covered in regular courses. Taught as staffing permits.\n\nprereq: Grad or advanced undergrad with instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5960",
        "subject": "HIST",
        "id": "5960",
        "title": "Topics: History",
        "info": "Selected topics in history not covered in regular courses. Taught as staffing permits.\n\nprereq: [advanced undergrad with instr consent]",
        "prereq": []
    },
    {
        "code": "HIST 5962",
        "subject": "HIST",
        "id": "5962",
        "title": "Comparative World History",
        "info": "Research proseminar on actions of Europeans in wider world, 1000-1800. Based on documents in James Ford Bell Library.\n\nprereq: Grad student, instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5964",
        "subject": "HIST",
        "id": "5964",
        "title": "Comp Economic Hist",
        "info": "Theoretical approaches guide cross-cultural examinations of major issues in the economic history of East Asia, Europe, and the New World. Agrarian structures in economic development, markets, the state and economic development, and the industrial revolution.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5970",
        "subject": "HIST",
        "id": "5970",
        "title": "Adv Res Quant Hist",
        "info": "Students will carry out publishable-quality research on a quantitative historical topic.",
        "prereq": []
    },
    {
        "code": "HIST 5971",
        "subject": "HIST",
        "id": "5971",
        "title": "Proseminar: Editing/Publishing",
        "info": "Evolution of modern scholarly publication as system of knowledge. Survey of history of printing/manufacture of books. Recent changes in information technology. Contemporary academic publishing. Basics of editing/editorial policy. Journals/presses.",
        "prereq": []
    },
    {
        "code": "HIST 5990",
        "subject": "HIST",
        "id": "5990",
        "title": "Readings in Comparative Hist",
        "info": "Students read/discuss historical works that focus on common theme or employ similar methods in different geographic areas. Issues of cross-area comparison. Topics vary (e.g., peasant societies, race/ethnicity, states/nationalism).\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 5993",
        "subject": "HIST",
        "id": "5993",
        "title": "Directed study",
        "info": "Guided individual reading or study.\nPrereq [Grad student or sr], instr consent, dept consent, college consent.",
        "prereq": []
    },
    {
        "code": "HIST 5994",
        "subject": "HIST",
        "id": "5994",
        "title": "Directed Research",
        "info": "Work on a tutorial basis.\nPrereq [Grad student or sr], instr consent, dept consent, college consent.",
        "prereq": []
    },
    {
        "code": "HIST 8015",
        "subject": "HIST",
        "id": "8015",
        "title": "Scope & Methods",
        "info": "Development of historical studies over time (especially in 19th and 20th centuries). Methodologies currently shaping historical research. Theoretical developments within the discipline during 19th and 20th centuries.",
        "prereq": []
    },
    {
        "code": "HIST 8016",
        "subject": "HIST",
        "id": "8016",
        "title": "Practicum in Hist Writing",
        "info": "Facilitate transition from writing seminar papers to writing individual research projects part of dissertation. Practice of making historical arguments in common genres of academic profession, such as grant proposals, prospectus, dissertation chapters.",
        "prereq": []
    },
    {
        "code": "HIST 8021",
        "subject": "HIST",
        "id": "8021",
        "title": "History Research Seminar",
        "info": "The History Research Seminar will help History PhD students to conceptualize and articulate a significant research proposal and to become more effective writers. The course will prioritize the format and expectations of the dissertation prospectus, but with permission of the instructor students may develop a different research project (e.g. a seminar paper to become part of their portfolio, or a chapter of an MA thesis or dissertation).  In either case, students will focus on the process of rigorously conceptualizing their research by writing a proposal using a format that is suggested by the Graduate School's Doctoral Dissertation Fellowship application's \\\"Statement of Research\\\" as a model. ",
        "prereq": []
    },
    {
        "code": "HIST 8025",
        "subject": "HIST",
        "id": "8025",
        "title": "Politics of Historical Memory",
        "info": "Issues surrounding interaction of memory/history. Genealogy of historical memory. Individual narratives and circulation of historical memory. Sites/forms of collective memory. Justice and historical memory. Case studies, discussions, research projects.",
        "prereq": []
    },
    {
        "code": "HIST 8031",
        "subject": "HIST",
        "id": "8031",
        "title": "Doing Digital History",
        "info": "Digital technologies are significantly altering the speed and scale of the foundational methodologies of archeology, history, and preservation. Moreover, they are shifting the way the public engages with the past in cultural institutions and across the myriad screens that pervade their daily life. In this course, students will not only learn how emerging digital technologies can enhance their research, but also how those technologies are fundamentally transforming the possibilities for the public presentation of that research.\n\nThis course privileges hands-on learning and balances deepening essential methodological skills with exposure to a breadth of field-altering technologies. It is structured around five core methodologies--excavation, documentation, reconstruction, interpretation, and exhibition. In each unit, students will be first be tasked with identifying the underlying principles of these methodological approaches. They will then use class time to explore technologies that extend those methods such as high-resolution imaging, relational databases, text mining programs, virtual environments, and content management systems for website building. Bookending the course is a focus on effective collaboration--the foundation of successful digital projects--and public engagement in an increasingly connected yet fractured society.",
        "prereq": []
    },
    {
        "code": "HIST 8032",
        "subject": "HIST",
        "id": "8032",
        "title": "Archives",
        "info": "Working in close collaboration with the archivists of the Department of Archives and Special Collections at the University Libraries, this hands-on course will explore how archivists do their work and how a deeper understanding of that work can help scholars in any field grasp the practice of historical research.  Rooted in the theory and tradition of archival science, the course will cover the core practices of archivists as well as the emerging issues and technologies changing the way archives are built, maintained, and accessed.  In this course, students will gain experience with archival theory, archival ethics, selection, appraisal, arrangement, description, reference, access, preservation, exhibits, and outreach.  Through engaging with those topics, students will be prepared to situate archives and archival material within the socio-historical contexts in which they were produced and in which they are maintained, affording them a critical perspective on the historical sources they contain.  \n\nEach week's course will be co-taught with an archivist from the Department of Archives and Special Collections at the University Libraries.",
        "prereq": []
    },
    {
        "code": "HIST 8110",
        "subject": "HIST",
        "id": "8110",
        "title": "Med Hist Res Sem",
        "info": "Research in medieval European history, using primary source material.\n\nprereq: instr consent, good reading knowledge of Latin, French, one other European language",
        "prereq": []
    },
    {
        "code": "HIST 8122",
        "subject": "HIST",
        "id": "8122",
        "title": "Public Histories",
        "info": "This seminar examines the variety of ways that \\\"public history\\\" is produced both within and outside the academy and explores interdisciplinary approaches to the making and critical analysis of public histories. Students will discuss recent scholarship by historians as well as scholars and practitioners in allied fields. Through discussion and collaborative project work, the seminar will also provide a hands-on introduction to the theory, methods, practice and politics of public history.",
        "prereq": []
    },
    {
        "code": "HIST 8232",
        "subject": "HIST",
        "id": "8232",
        "title": "Legacy of the Cold War: Res",
        "info": "Student produce research paper on history/culture of Cold War era as it developed in United States after World War II.  Research project builds upon readings from 8231.",
        "prereq": []
    },
    {
        "code": "HIST 8239",
        "subject": "HIST",
        "id": "8239",
        "title": "Race in the U.S.",
        "info": "Dynamics of gender, racial, class, and ethnic relations in U.S. history; intersections of these forces.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 8240",
        "subject": "HIST",
        "id": "8240",
        "title": "Race in the U.S.",
        "info": "Dynamics of gender, racial, class, and ethnic relations in U.S. history. Intersections of these forces. Topis vary by instructor.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 8245",
        "subject": "HIST",
        "id": "8245",
        "title": "Human Rights: A Global Hist",
        "info": "This course will focus on debates and social movements concerning human rights in the broadest sense, beginning with the seventeenth century and ending in the 1950s. Topics include colonization, slavery, torture, war crimes, rights to land, women's rights, sexual rights, and indigenous self-determination. The seminar will require a research or historiographical paper.",
        "prereq": []
    },
    {
        "code": "HIST 8333",
        "subject": "HIST",
        "id": "8333",
        "title": "FTE: Master's",
        "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
        "prereq": []
    },
    {
        "code": "HIST 8390",
        "subject": "HIST",
        "id": "8390",
        "title": "Research in Amer Indian Hist",
        "info": "Research/writing skills in American Indian history. Identify research questions, locate sources, conduct original research, produce substantial research paper.",
        "prereq": []
    },
    {
        "code": "HIST 8400",
        "subject": "HIST",
        "id": "8400",
        "title": "Edit & Pub Seminar",
        "info": "Evolution of modern scholarly publication as a system of knowledge; survey of history of printing and manufacture of books; recent changes in information technology; contemporary academic publishing; basics of editing and editorial policy; journals and presses.",
        "prereq": []
    },
    {
        "code": "HIST 8434",
        "subject": "HIST",
        "id": "8434",
        "title": "Health and Healing in Africa",
        "info": "Historiographical, theoretical, and methodological debates concerning health, illness, and healing in African history. Disease ecology, African conceptions of health/healing. Imperialism and origins of tropical medicine. Scientific racism. Colonial conquest and African health. Sexuality, gender, and  colonial control. Urbanization. AIDS.",
        "prereq": []
    },
    {
        "code": "HIST 8444",
        "subject": "HIST",
        "id": "8444",
        "title": "FTE: Doctoral",
        "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
        "prereq": []
    },
    {
        "code": "HIST 8464",
        "subject": "HIST",
        "id": "8464",
        "title": "Yuan, Ming, Qing",
        "info": "Basic skills and resources for doing research in history of late imperial China. Bibliographic exercises; reading and translating primary documents.\n\nprereq: Good working knowledge of classical Chinese, background in history of late imperial China",
        "prereq": []
    },
    {
        "code": "HIST 8465",
        "subject": "HIST",
        "id": "8465",
        "title": "Yuan, Ming, Qing",
        "info": "Basic skills and resources for doing research in history of late imperial China. Students select, translate, and annotate texts appropriate to their research interests and write a research paper centering on these texts.\n\nprereq: Good working knowledge of classical Chinese, background in history of late imperial China",
        "prereq": []
    },
    {
        "code": "HIST 8540",
        "subject": "HIST",
        "id": "8540",
        "title": "Topics: Mediterranean Studies",
        "info": "Mediterranean history from Middle Ages to present. Taught as staffing permits.\n\nprereq: Grad student or advanced undergrad with instr consent",
        "prereq": []
    },
    {
        "code": "HIST 8630",
        "subject": "HIST",
        "id": "8630",
        "title": "World History Sem",
        "info": "Critical examination of historical literature dealing with theoretical approaches to world history and teaching of world history.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 8640",
        "subject": "HIST",
        "id": "8640",
        "title": "Topics in Legal Hist Research",
        "info": "Comparative, methodological, theoretical, and topical courses in legal historical research, from ancient world to present.  Offerings rotate.\n",
        "prereq": []
    },
    {
        "code": "HIST 8644",
        "subject": "HIST",
        "id": "8644",
        "title": "Legal History Workshop",
        "info": "Introduction to legal history and professional socialization. Work-in-progress of leading scholars working in field of legal history. Students can undertake original research.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 8645",
        "subject": "HIST",
        "id": "8645",
        "title": "American Legal History",
        "info": "This course explores the interaction between law, politics, and culture in American society, concentrating on the period from the Revolution through the New Deal. Topics include: democracy and the rule of law; slavery; the public-private distinction; Civil War and Reconstruction; industrialization; expansion of the federal administrative state; law and the human sciences; crime and punishment; legal education and the role of the lawyer in the American polity. Readings will include primary legal sources, such as treatises, statutes, constitutions, and landmark cases, as well as contemporary religious, scientific, and literary works, which will help to situate the legal materials in broader cultural context. Several secondary sources will also be considered, both for insights into the topics covered, and to illustrate various approaches to legal-historical analysis. The course will encourage critical examination of these sources with the aim of clarifying how law has figured in the history and historiography of the United States. No previous background in American history is assumed.",
        "prereq": []
    },
    {
        "code": "HIST 8666",
        "subject": "HIST",
        "id": "8666",
        "title": "Doct Pre-Thesis Cr*",
        "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
        "prereq": {
            "code": "HIST 60",
            "subject": "HIST",
            "id": "60"
        }
    },
    {
        "code": "HIST 8709",
        "subject": "HIST",
        "id": "8709",
        "title": "History of Sexuality",
        "info": "Theories of sexuality (by, e.g., Foucault, Butler, deLauretis), their application in history. Topics may include: feminist critique of Foucault and the classics, psycoanalytic approaches to religious transformations such as the Reformation, varying forms of gender transgression, sexuality in colonial encounters, operation of sexual metaphors in political conflict, and AIDS and the writing of history.",
        "prereq": []
    },
    {
        "code": "HIST 8715",
        "subject": "HIST",
        "id": "8715",
        "title": "Res Eur Women Hist",
        "info": "Research techniques for completing a major research paper based on primary sources.\n\nprereq: 5715",
        "prereq": {
            "code": "HIST 5715",
            "subject": "HIST",
            "id": "5715"
        }
    },
    {
        "code": "HIST 8720",
        "subject": "HIST",
        "id": "8720",
        "title": "Res Sem: Central European Hist",
        "info": "Broad research theme/problem: in most cases preparation for dissertation. Students identify primary/secondary sources, conduct research, write paper, and read/comment upon each other's drafts. Geographic focus varies with instructor, may include Germany or lands of former Habsburg Austrian empire.",
        "prereq": []
    },
    {
        "code": "HIST 8777",
        "subject": "HIST",
        "id": "8777",
        "title": "Thesis Credit:Mast*",
        "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
        "prereq": {
            "code": "HIST 10",
            "subject": "HIST",
            "id": "10"
        }
    },
    {
        "code": "HIST 8801",
        "subject": "HIST",
        "id": "8801",
        "title": "Seminar in American History",
        "info": "This intensive reading seminar offers an introduction to recent and innovative scholarship in American history. Students' main project in the course is to research and write a ?state of the field? essay on a subfield of their choice (in consultation with the instructor) that assesses the literature produced in the last decade or so. The essay will identify the key questions recently and currently animating the subfield, and it will discuss the descriptive and explanatory power of various approaches and modes of analysis.  \nThe course is required for Americanist graduate students and for graduate students with an American History minor or a comparative field in American History. The course is taught in alternating years.",
        "prereq": []
    },
    {
        "code": "HIST 8802",
        "subject": "HIST",
        "id": "8802",
        "title": "Readings in US HIST, 1848-Pres",
        "info": "Readings-intensive course. U.S. history from Mexican-American War to present.",
        "prereq": []
    },
    {
        "code": "HIST 8832",
        "subject": "HIST",
        "id": "8832",
        "title": "Legacy of the Cold War:  Resch",
        "info": "Student produces research paper on history/culture of Cold War era in the United States after World War II. Research projects build upon readings from 5831.\n\nprereq: 5831",
        "prereq": {
            "code": "HIST 5831",
            "subject": "HIST",
            "id": "5831"
        }
    },
    {
        "code": "HIST 8857",
        "subject": "HIST",
        "id": "8857",
        "title": "Res. Amer. Women",
        "info": "Students define a historical problem or area of research on a topic in American women's history they would like to pursue in depth, identify appropriate sources and accomplish research in primary and secondary sources, write a 25 to 35-page scholarly article, and read and comment upon each other's drafts.\n\nprereq: 5857, instr consent",
        "prereq": {
            "code": "HIST 5857",
            "subject": "HIST",
            "id": "5857"
        }
    },
    {
        "code": "HIST 8858",
        "subject": "HIST",
        "id": "8858",
        "title": "Res in Early Am His",
        "info": "Research and writing skills. With instructor and other participants, students identify their research questions, locate the sources with which to answer these questions, conduct original research, and produce a substantial research paper.\n\nprereq: 5801 or instr consent",
        "prereq": {
            "code": "HIST 5801",
            "subject": "HIST",
            "id": "5801"
        }
    },
    {
        "code": "HIST 8865",
        "subject": "HIST",
        "id": "8865",
        "title": "Race and Class in the US",
        "info": "This graduate reading seminar examines the intersections of race and class in the United States, starting with the establishment of chattel slavery in the colonial era, continuing through westward expansion and the development of industrial capitalism, and ending with the rise and fall of the New Deal order.  Reading established classics and important recent scholarship; students will seek to understand how race and class interacted to shape the economic and political development of the United States.",
        "prereq": []
    },
    {
        "code": "HIST 8888",
        "subject": "HIST",
        "id": "8888",
        "title": "Thesis Credit:Doct*",
        "info": "(No description)\n\nprereq: Max 14 cr per semester or summer, 24 cr required",
        "prereq": []
    },
    {
        "code": "HIST 8900",
        "subject": "HIST",
        "id": "8900",
        "title": "Topics Eur/Med Hist",
        "info": "Topics not covered in regular courses.",
        "prereq": []
    },
    {
        "code": "HIST 8905",
        "subject": "HIST",
        "id": "8905",
        "title": "Topics Eur Med Hist",
        "info": "Selected topics in Medieval European history, up to 1500ce.",
        "prereq": []
    },
    {
        "code": "HIST 8910",
        "subject": "HIST",
        "id": "8910",
        "title": "Topics in U.S. History",
        "info": "Topics not covered in regular courses.",
        "prereq": []
    },
    {
        "code": "HIST 8920",
        "subject": "HIST",
        "id": "8920",
        "title": "Topics: African History",
        "info": "Topics not covered in regular courses.",
        "prereq": []
    },
    {
        "code": "HIST 8930",
        "subject": "HIST",
        "id": "8930",
        "title": "Topics Ancient Hist",
        "info": "Topics not covered in regular courses.  ",
        "prereq": []
    },
    {
        "code": "HIST 8940",
        "subject": "HIST",
        "id": "8940",
        "title": "Topics: Asian History",
        "info": "Topics not covered in regular courses.",
        "prereq": []
    },
    {
        "code": "HIST 8944",
        "subject": "HIST",
        "id": "8944",
        "title": "African Social Hist, Part 1",
        "info": "First of two-part course. Rradical transformation in field of African social history during past two decades. Students select major research topic and begin preliminary investigation.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 8945",
        "subject": "HIST",
        "id": "8945",
        "title": "African Social Hist, Part II",
        "info": "Second of two-part course. Students conceptualize and write major research paper.\n\nprereq: 8944, instr consent",
        "prereq": {
            "code": "HIST 8944",
            "subject": "HIST",
            "id": "8944"
        }
    },
    {
        "code": "HIST 8950",
        "subject": "HIST",
        "id": "8950",
        "title": "Topics Latin American History",
        "info": "Topics not covered in regular courses. ",
        "prereq": []
    },
    {
        "code": "HIST 8960",
        "subject": "HIST",
        "id": "8960",
        "title": "Topics in History",
        "info": "Topics not covered in regular courses.",
        "prereq": []
    },
    {
        "code": "HIST 8961",
        "subject": "HIST",
        "id": "8961",
        "title": "Res Sem:  Intellectual History",
        "info": "Approaches/methods. Readings on or exemplifying intellectual history. Intellectual history as something broader than history of philosophical thought: a set of approaches of broad cross-disciplinary applicability. Each student prepares a research paper on a topic of intellectual history and present it to class for critique.",
        "prereq": []
    },
    {
        "code": "HIST 8970",
        "subject": "HIST",
        "id": "8970",
        "title": "Adv Res Quant Hist",
        "info": "Students carry out publishable-quality research on quantitative history topic.prereq: Grad student",
        "prereq": []
    },
    {
        "code": "HIST 8980",
        "subject": "HIST",
        "id": "8980",
        "title": "Comparative Women's History",
        "info": "Cross-cultural/thematic explorations in history of women. Gender/colonialism. Women/class formation. Women/religion. Sexuality. Medical construction of gender. Women's narratives as historical sources. Gender/politics.\n\nprereq: [advanced undergrad, instr consent]",
        "prereq": []
    },
    {
        "code": "HIST 8990",
        "subject": "HIST",
        "id": "8990",
        "title": "Topics in Comparative History",
        "info": "Topics vary. Students read/discuss historical works from different geographic areas, develop proposals for comparative research, or pursue comparative research projects.\n\nprereq: instr consent",
        "prereq": []
    },
    {
        "code": "HIST 8993",
        "subject": "HIST",
        "id": "8993",
        "title": "Directed Study",
        "info": "Students work on tutorial basis. Guided individual reading or study.\n\nprereq: Grad student, instr consent",
        "prereq": []
    },
    {
        "code": "HIST 8994",
        "subject": "HIST",
        "id": "8994",
        "title": "Directed Research",
        "info": "Work on a tutorial basis.\n\nprereq: instr consent",
        "prereq": []
    }
]