[
  {
    "code": "HRD 3601",
    "subject": "HRD",
    "id": "3601",
    "title": "Student and Trainee Assessment",
    "info": "Development of tests of knowledge, affect, and processes for programs focused on instruction of skills associated with business/industry. Development of learning progress reporting systems. Evaluation of instructional effectiveness. Application of tests and other evaluation instruments to assess/report learning in business/industry and career/technical education fields.",
    "prereq": []
  },
  {
    "code": "HRD 5302",
    "subject": "HRD",
    "id": "5302",
    "title": "Managing Wk Teams",
    "info": "Frameworks and strategies for developing effective work teams. Skill development in facilitating resolution of conflicts in organizations. Provides foundational information as well as practical applications for participants (upper-level and graduate students) to become small team leaders.",
    "prereq": []
  },
  {
    "code": "HRD 5405",
    "subject": "HRD",
    "id": "5405",
    "title": "Quality Improvement through HR",
    "info": "Quality management, productivity improvement theory/practice from a human resource perspective. Organization development/training as integral components of quality improvement. HR role within quality standards. History of quality improvement, contributions of major leaders.",
    "prereq": []
  },
  {
    "code": "HRD 5601",
    "subject": "HRD",
    "id": "5601",
    "title": "Stud/Trainee Assessment",
    "info": "Developing learning progress reporting systems and tests of knowledge, affect, and processes for programs focused on instruction of skills associated with business/industry. Evaluating instructional effectiveness. Applying tests and other evaluation instruments to assess/report learning in business/industry and career/technical education fields. Students develop each type of test and an overall edvaluation plan for a course.",
    "prereq": []
  },
  {
    "code": "HRD 5611",
    "subject": "HRD",
    "id": "5611",
    "title": "Futurism in HRD & Adult Educ",
    "info": "Implications of future developments in areas of theory/practice in human resource development and adult education.",
    "prereq": []
  },
  {
    "code": "HRD 5624",
    "subject": "HRD",
    "id": "5624",
    "title": "Sales Training",
    "info": "Strategies and techniques for developing effective sales people.",
    "prereq": []
  },
  {
    "code": "HRD 5626",
    "subject": "HRD",
    "id": "5626",
    "title": "Cust Serv Trng",
    "info": "Overview of customer service strategies used by successful organizations and training practices used to develop customer-oriented personnel.",
    "prereq": []
  },
  {
    "code": "HRD 5627",
    "subject": "HRD",
    "id": "5627",
    "title": "Mgmt/Super T&D",
    "info": "Problems, practices, programs, and methodologies relating to the training and development of managers and supervisors, including needed competencies, needs assessment, delivery modes, and evaluation.",
    "prereq": []
  },
  {
    "code": "HRD 5628",
    "subject": "HRD",
    "id": "5628",
    "title": "Multi Media Pres in Bus",
    "info": "Designing, creating, and presenting information using multimedia resources in business settings.",
    "prereq": []
  },
  {
    "code": "HRD 5629",
    "subject": "HRD",
    "id": "5629",
    "title": "Course Development",
    "info": "Designing instructional programs/courses that help learners develop desired competence. Designing instruction for performance-based training and vocational/technical education. Developing course syllabus components that clarify course expectations. Developing academic/community-based elements that complement course goals. Students reflect on and compare performance-based instruction with other curriculum models for the field.",
    "prereq": []
  },
  {
    "code": "HRD 5661",
    "subject": "HRD",
    "id": "5661",
    "title": "Instr. Methods for Bus. & Ind.",
    "info": "Theory/practice in instructional methods for career/technical education (CTE) instructors and human resources/development (HRD) professionals. How to select various teaching methods and plan for their delivery. Preparing an instructional methods plan to clarify course content, teaching methods selected, rationale for their selection, and how a student organization might facilitate student learning.",
    "prereq": []
  },
  {
    "code": "HRD 5662",
    "subject": "HRD",
    "id": "5662",
    "title": "Comptr Trng in Sch & Ind",
    "info": "Alternative practices for teaching business applications software use--such as word processors, spreadsheets, graphics software, desktop publishing software, databases, and communications software--in both public school and industry settings.  ",
    "prereq": []
  },
  {
    "code": "HRD 5802",
    "subject": "HRD",
    "id": "5802",
    "title": "Ed & HRD through Tourism",
    "info": "Policies/practices of education and human resource development in tourism industry.",
    "prereq": []
  },
  {
    "code": "HRD 5821",
    "subject": "HRD",
    "id": "5821",
    "title": "Div Issues & Prac",
    "info": "Nature of diverse populations and their unique learning and training needs, exemplary programs, and collaborative efforts among persons representing work, community, and family settings.\t\t\t\t",
    "prereq": []
  },
  {
    "code": "HRD 5822",
    "subject": "HRD",
    "id": "5822",
    "title": "Div & Org Transform",
    "info": "Develop models for understanding the impact of diversity on individual, organizational, and community outcomes. Discuss organizational change in relation to diversity.",
    "prereq": []
  }
]