[{"code":"HUMF 5001","subject":"HUMF","id":"5001","title":"Found HF/E","info":"Variability in human performance influenced by interaction with designs of machines/tools, computers/software, complex technological systems, jobs/working conditions, organizations, sociotechnical institutions. Conceptual, empirical, practical aspects of human factors/ergonomics.\n\nprereq: Grad HumF major or minor or instr consent","prereq":[]},{"code":"HUMF 5124","subject":"HUMF","id":"5124","title":"Human Factors Physiology","info":"Concepts, problems, and issues associated with ergonomic applications to improving design/operation of human work spaces.","prereq":[]},{"code":"HUMF 5193","subject":"HUMF","id":"5193","title":"Directed Study","info":"Independent study in human factors/ergonomics under tutorial guidance.\n\nprereq: instr consent","prereq":[]},{"code":"HUMF 5211","subject":"HUMF","id":"5211","title":"Human Fact Work Ana","info":"Human factors engineering (ergonomics), methods engineering, work measurement. Displays, controls, instrument layout, supervisory control. Anthropometry, work physiology, biomechanics. Noise, illumination, toxicology. Operations analysis, motion study, time standards.","prereq":[]},{"code":"HUMF 5722","subject":"HUMF","id":"5722","title":"Human Factors Psychology","info":"Psychological principles that underlie human interactions with technological systems. Techniques/methodologies to assess faulty/incorrect system design. Emphasizes human-centered approaches. Rigorous evaluation of human-machine interaction.","prereq":[]},{"code":"HUMF 5874","subject":"HUMF","id":"5874","title":"Human Centered Design","info":"Class participants will work together using design thinking frameworks to discover, define, develop, and propose solutions to help solve complex system problems. The class will use cognitive design methods and research to guide in developing prototypes that foster improved experiences in information delivery, processes of systems, and technology.\n\nTeams, will tackle complex real-world problems. Projects may focus on a variety of areas ranging from retail to health care. Coursework will primarily focus on team-based projects. Participants will immerse themselves the following activities while working towards remediating their chosen problems. \n•\tinsights gathering/research methods\n•\tcognitive design methods and principles\n•\tidentifying strengths/weaknesses in actual vs. proposed systems\n•\timplementation (prototyping) considerations/strategies \n\nThe course will be highly interactive with little lecture. It will strive to foster critical thinking and will offer an environment where creativity can thrive. Students are expected to come to class fully prepared to interact during class time with the readings and research consumed outside class. Material from course readings will focus on cognitive design, systems thinking principles and will be interwoven during the discussions and class activities.\n\nThis course is designed for students from a variety of backgrounds and programs, including students from Human Factors, the Academic Health Center, Graphic Design, Product Design, Retail, Interior Design, Landscape Architecture, Architecture, Biomedical Engineering, Mechanical Engineering, Industrial Engineering, and the Carlson School.\n\nHuman Factors students working toward a Plan C Master’s degree may use this course as one of the two\ncourses required to be 50% project-based.","prereq":[]},{"code":"HUMF 8001","subject":"HUMF","id":"8001","title":"Topics HF/E","info":"Survey course in human factors/ergonomics. Interaction of performance/behavior with design factors in performance environment. Concepts, methods, empirical findings, different systems applications, current research. Topics vary.\n\nprereq: Grad HumF major or minor or instr consent","prereq":[]},{"code":"HUMF 8002","subject":"HUMF","id":"8002","title":"Prosem HF/E","info":"Issues/concerns tailored to interests of faculty/students regarding human factors/ergonomics. Interdisciplinary science concerned with interaction of performance/behavior with design factors in performance environment.\n\nprereq: Grad HumF major or minor or instr consent","prereq":[]},{"code":"HUMF 8333","subject":"HUMF","id":"8333","title":"FTE: Master's","info":"FTE: master's.\n\nprereq: Master's student, adviser consent, DGS consent","prereq":[]},{"code":"HUMF 8444","subject":"HUMF","id":"8444","title":"FTE: Doctoral","info":"FTE: doctoral.\n\nprereq: Doctoral student, adviser consent, DGS consent","prereq":[]},{"code":"HUMF 8541","subject":"HUMF","id":"8541","title":"Dec Support Systems","info":"Students build a decision support system for a problem of their choice. How to identify appropriate problems. Styles of DSSs, evaluating their effectiveness.\n\nprereq: Undergrad-level computer programming course or instr consent; programming skills recommended","prereq":[]},{"code":"HUMF 8666","subject":"HUMF","id":"8666","title":"Doct Pre-Thesis Cr*","info":"Doctoral pre-thesis credits.\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr","prereq":[]},{"code":"HUMF 8777","subject":"HUMF","id":"8777","title":"Thesis Credit:Mast*","info":"Thesis credits: master's.\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]","prereq":[]},{"code":"HUMF 8794","subject":"HUMF","id":"8794","title":"Human Factors Research","info":"Human factors research.","prereq":[]},{"code":"HUMF 8888","subject":"HUMF","id":"8888","title":"Thesis Credit: Doctoral","info":"Thesis credit: doctoral.\n\nprereq: Max 18 cr per semester or summer; 24 cr required","prereq":[]},{"code":"HUMF 8901","subject":"HUMF","id":"8901","title":"Graduate Seminar","info":"Exploration of current topics, methods, and findings related to the field of Human Factors and Ergonomics (HFE).","prereq":[]}]