[
  {
    "code": "INS 4101",
    "subject": "INS",
    "id": "4101",
    "title": "Employee Benefits",
    "info": "Design/administration of employee benefit plans/pension. Health insurance, disability plans. Salary reduction/deferred compensation programs. Multiple employer trusts. Alternative funding methods, including self-insurance. Ethical issues, legal liability, compliance.",
    "prereq": []
  },
  {
    "code": "INS 4105",
    "subject": "INS",
    "id": "4105",
    "title": "Corporate Risk Management",
    "info": "Theory applied to corporate risk management and insurance practices. Identification, measurement, and treatment of an organization's financial risks integrated with its property, liability, workers compensation, and human resource risks. Selection and application of risk control and risk financing tools: risk retention, reduction, and transfer, including insurance. ",
    "prereq": []
  },
  {
    "code": "INS 4201",
    "subject": "INS",
    "id": "4201",
    "title": "Personal Financial Management",
    "info": "Students identify and evaluate financial issues to achieve personal goals, and develop their own plan using computer software. Practicing professionals offer guidance on investing, insurance (disability, health, and liability), tax reduction, employee benefits and estate planning. Students create their own dynamic plan to present to potential employers, rather than just assessing employer?s offers. Students meet and dialogue with distinguished presenters in-person and virtually at each class. The professionals explain employment opportunities.",
    "prereq": []
  },
  {
    "code": "INS 4202",
    "subject": "INS",
    "id": "4202",
    "title": "Tax & Estate Plannning",
    "info": "Estate planning, tax management techniques. Charitiable giving, probate process, use of health care directives, durable powers of attorney, revocable/irrevocable trusts, wills, asset distribution.",
    "prereq": []
  },
  {
    "code": "INS 4205",
    "subject": "INS",
    "id": "4205",
    "title": "Insurance Theory and Practice",
    "info": "Risk theory is applied to practices in health, liability, life, property, and workers compensation insurance. Insurance marketing, pricing, underwriting, and claims administration with adverse selection and moral hazard effects. Policy issues of tort versus no-fault compensation systems. Self-insurance and integrated risk financing methods.",
    "prereq": []
  },
  {
    "code": "INS 5000",
    "subject": "INS",
    "id": "5000",
    "title": "Tax & Estate Plannning",
    "info": "In-depth treatment of estate planning and tax management techniques introduced in 5201. Charitiable giving, probate process, use of health care directives, durable powers of attorney, revocable/irrevocable trusts, wills, asset distribution.",
    "prereq": []
  },
  {
    "code": "INS 6101",
    "subject": "INS",
    "id": "6101",
    "title": "Employee Benefits",
    "info": "Design/administration of employee benefit plans/pension. Health insurance, disability plans. Salary reduction/deferred compensation programs. Multiple employer trusts. Alternative funding methods, including self-insurance. Ethical issues, legal liability, compliance.\n",
    "prereq": []
  },
  {
    "code": "INS 6105",
    "subject": "INS",
    "id": "6105",
    "title": "Corporate Risk Management",
    "info": "Theory applied to corporate risk management and insurance practices.  Identification, measurement, and treatment of an organization.s financial risks integrated with its property, liability, workers compensation, and human resource risks. Selection and application of risk control and risk financing tools: risk retention, reduction and transfer, including insurance. \n",
    "prereq": []
  },
  {
    "code": "INS 6201",
    "subject": "INS",
    "id": "6201",
    "title": "Personal Financial Management",
    "info": "Personal financial planning. Financial statements, cash flow/debt analysis, time value of money. Management of liability, disability, life, medical, and property risks. Investments, portfolio management. Tax reduction, employee benefits, retirement/estate planning. Ethical issues, regulation of financial planners.\n",
    "prereq": []
  },
  {
    "code": "INS 6202",
    "subject": "INS",
    "id": "6202",
    "title": "Tax & Estate Planning",
    "info": "Estate planning, tax management techniques. Charitiable giving, probate process, use of health care directives, durable powers of attorney, revocable/irrevocable trusts, wills, asset distribution.\n",
    "prereq": []
  },
  {
    "code": "INS 6205",
    "subject": "INS",
    "id": "6205",
    "title": "Insurance Theory and Practice",
    "info": "Risk theory is applied to practices in health, liability, life, property, and workers compensation insurance. Insurance marketing, pricing, underwriting, and claims administration, with adverse selection and moral hazard effects. Policy issues of tort versus no-fault compensation systems. Self-insurance and integrated risk financing methods.\n",
    "prereq": []
  }
]