[
  {
    "code": "LAS 3017",
    "subject": "LAS",
    "id": "3017",
    "title": "Ppls/Cultrs- Mid Am",
    "info": "Surveys the Indian and Mestizo (Hispanic) cultures of Mexico and Guatemala and parts of Belize, Honduras, and Nicaragua. Describes both pre-Hispanic and Hispanic influences, with attention to area-wide patterns and local traditions.",
    "prereq": []
  },
  {
    "code": "LAS 3019",
    "subject": "LAS",
    "id": "3019",
    "title": "Hisp Cult of Lat Am",
    "info": "Overview of Hispanic cultures from Mexico to South America. Economy, underdevelopment. Family, ritual kinship. Gender, religion, values, ideology, change. Several concepts are introduced to explore continuity/change. ",
    "prereq": []
  },
  {
    "code": "LAS 3114",
    "subject": "LAS",
    "id": "3114",
    "title": "US-Mex.Perspectives",
    "info": "Examines the relations of Mexico and the United States from an international perspective, with an central focus on the cultural interchange in the border lands between the United States and Mexico, using both literary and historical materials.",
    "prereq": []
  },
  {
    "code": "LAS 3251",
    "subject": "LAS",
    "id": "3251",
    "title": "Renew Res DC",
    "info": "International perspectives on resource use in developing countries. Integration of natural resource issues with social, economic, and policy considerations. Overviews of agriculture, forestry, agroforestry, non-timber forest products, water resources, certification, and development issues. Latin American case studies.",
    "prereq": []
  },
  {
    "code": "LAS 3401W",
    "subject": "LAS",
    "id": "3401W",
    "title": "Early Latin America to 1825",
    "info": "Societies of Americas, Spain, and Portugal before contact. Interactions among Native Americans, African slaves, and Europeans, from colonization through independence. Religion, resistance, labor, gender, race. Primary sources, historical scholarship.",
    "prereq": []
  },
  {
    "code": "LAS 3402W",
    "subject": "LAS",
    "id": "3402W",
    "title": "Latin Am 1825-Present",
    "info": "National and contemporary period 1825 to present. Social, cultural, political, and economic change.",
    "prereq": []
  },
  {
    "code": "LAS 3405",
    "subject": "LAS",
    "id": "3405",
    "title": "Lat Am Women's Live",
    "info": "An interdisciplinary approach to understanding women's lives in Latin America. Use of ethnography, history, poetry, fiction, and \\\"testimonio\\\" to understand the conditions of women's lives in Latin America. ",
    "prereq": []
  },
  {
    "code": "LAS 3427",
    "subject": "LAS",
    "id": "3427",
    "title": "Cuba & Puerto Rico",
    "info": "Historical development of Cuba and Puerto Rico from pre-Columbian times through Spanish conquest to the present. Conquest and colonization, slavery, Hispanic Caribbean society and culture, Operation Bootstrap, Cuban Revolution.\n",
    "prereq": []
  },
  {
    "code": "LAS 3429",
    "subject": "LAS",
    "id": "3429",
    "title": "Lat Am History in Film & Text",
    "info": "Cinematic representations of Latin America in the context of other historical and literary narratives. Experiences of Latinos in Hollywood. Compare U.S. films with those produced in Latin America. Specific themes vary by term (e.g., women, revolution, colonialism).",
    "prereq": []
  },
  {
    "code": "LAS 3442",
    "subject": "LAS",
    "id": "3442",
    "title": "History 1900-Prsnt",
    "info": "The 20th-century Chicana/o experience:  migration, repatriation, the Bracero program, politics, the Chicana/o movement, work, society, and culture. ",
    "prereq": []
  },
  {
    "code": "LAS 3502W",
    "subject": "LAS",
    "id": "3502W",
    "title": "Brazilian Culture",
    "info": "Emphasis on Brazilian modern society. History, culture (music, art, cinema, literature, intellectual thought, popular culture, media), and social problems (ethnicity, tropical deforestation). Discussions and readings are in Portuguese.",
    "prereq": []
  },
  {
    "code": "LAS 4121W",
    "subject": "LAS",
    "id": "4121W",
    "title": "Latin America",
    "info": "Interplay of natural environment and history in shaping contemporary Latin America. Political ecology of natural resources, food supply and distribution, urbanization and the informal economy, migration, ethnicity, and the role of the state and international agencies in domestic economies.",
    "prereq": []
  },
  {
    "code": "LAS 4465",
    "subject": "LAS",
    "id": "4465",
    "title": "Hsg World Perspect",
    "info": "Evaluation of theories and concepts that allow an understanding of housing policies and housing choices of individuals, families, and households in developed and developing countries.",
    "prereq": []
  },
  {
    "code": "LAS 4479",
    "subject": "LAS",
    "id": "4479",
    "title": "Latin American Pol",
    "info": "An overview of Latin American politics and political economy focused on authoritarianism, human rights, and redemocratization; development and economic policy; social movements; ethnicity and race; religion; revolution; U.S.-Latin American relations. ",
    "prereq": []
  }
]