[
  {
    "code": "MICB 2032",
    "subject": "MICB",
    "id": "2032",
    "title": "General Microbiology w/Lab",
    "info": "Fundamental principles of microbiology. Bacterial metabolism, growth, and genetics. Biology of viruses/fungi. Control of microorganisms. Host-microbe interactions. Microorganisms and disease. Applied microbiology. Lab.",
    "prereq": []
  },
  {
    "code": "MICB 3301",
    "subject": "MICB",
    "id": "3301",
    "title": "Biology of Microorganisms",
    "info": "Taxonomy, anatomy, physiology, biochemistry, pathogenesis, immunology, ecology of microbes. Molecular structure in relation to bacterial function/disease. Includes lab.\n\nprereq: [Biol 1961 and Biol 2003] or Biol 1009 or instructor permission",
    "prereq": {
      "or": [
        {
          "and": [
            {
              "code": "BIOL 1961",
              "subject": "BIOL",
              "id": "1961"
            },
            {
              "code": "BIOL 2003",
              "subject": "BIOL",
              "id": "2003"
            }
          ]
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        }
      ]
    }
  },
  {
    "code": "MICB 3302",
    "subject": "MICB",
    "id": "3302",
    "title": "Biology of Micro Laboratory",
    "info": "This is a hands-on laboratory that together with MICB 3303 will provide an extensive overview of the microbial world highlighting the structure, function, and diversity of microorganisms including bacteria, fungi, protists, and viruses. In laboratory, students will get hands-on experience with the techniques, methods, protocols, and instrumentation for the study of microorganisms that will coincide with what is taught in the lecture component.  The combination of MicB 3303 (lecture only) and MicB 3302 (lab only) is equivalent to MicB 3301. No credit if credit already received for MicB 3301. MicB 3303 (lecture) is a prerequisite for MicB 3302 (lab only). Students who desire both should register for MicB 3301.\n\n\n \n",
    "prereq": {
      "code": "MICB 3301",
      "subject": "MICB",
      "id": "3301"
    }
  },
  {
    "code": "MICB 3303",
    "subject": "MICB",
    "id": "3303",
    "title": "Biology of Microorg (w/o lab)",
    "info": "This course is intended to provide a broad overview of the microbial\nworld highlighting the structure, function, and diversity of microorganisms including bacteria, fungi, protists, and viruses. Topics include microbial anatomy, physiology, biochemistry, molecular biology and ecology. Microbial pathogenesis, immunology and infectious disease will also be presented and discussed.\n\nprereq: Biol 1961 and Biol 2003 or Biol 1009 or instructor permission.\nCredit will not be granted if credit has been received for: BIOL 2032, MICB 3303, VBS 2032.",
    "prereq": {
      "and": [
        {
          "code": "BIOL 1961",
          "subject": "BIOL",
          "id": "1961"
        },
        {
          "code": "BIOL 2003",
          "subject": "BIOL",
          "id": "2003"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        },
        {
          "code": "BIOL 2032",
          "subject": "BIOL",
          "id": "2032"
        },
        {
          "code": "VBS 2032",
          "subject": "VBS",
          "id": "2032"
        }
      ]
    }
  },
  {
    "code": "MICB 4001",
    "subject": "MICB",
    "id": "4001",
    "title": "Microorg & Disease",
    "info": "Pathogenic microorganisms, host-parasite interactions, disease treatment/prevention.",
    "prereq": []
  },
  {
    "code": "MICB 4131",
    "subject": "MICB",
    "id": "4131",
    "title": "Immunology",
    "info": "Molecular, genetic, and cellular basis for innate and adaptive immune responses. The immune system's role in: transplantation, autoimmune disease, cancer, vaccines, acquired and genetic immunodeficiencies.\n\nprereq: Biol 2003 or Biol 1009 and [Junior or senior]",
    "prereq": {
      "or": [
        {
          "code": "BIOL 2003",
          "subject": "BIOL",
          "id": "2003"
        },
        {
          "code": "BIOL 1009",
          "subject": "BIOL",
          "id": "1009"
        }
      ]
    }
  },
  {
    "code": "MICB 4141W",
    "subject": "MICB",
    "id": "4141W",
    "title": "Bio, Genetics, Path of Viruses",
    "info": "Structure, attachment, entry. Genome replication/mRNA production. Reverse transcription. Transcription from DNA virus templates. Replication of DNA virus genomes. Viral pre-mRNA. Translational control. Assembly, host defense, tumor viruses, pathogenesis, HIV, antivirals/vaccines.\n\nprereq: BIOC 3021, BIOL 4003, [MicB 3301 or BIOL 4004] or instr consent; enrollment limited to Microbiology majors by permission from waitlist (graduating seniors only, small enrollment)",
    "prereq": {
      "and": [
        {
          "code": "BIOC 3021",
          "subject": "BIOC",
          "id": "3021"
        },
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        },
        {
          "or": [
            {
              "code": "MICB 3301",
              "subject": "MICB",
              "id": "3301"
            },
            {
              "code": "BIOL 4004",
              "subject": "BIOL",
              "id": "4004"
            }
          ]
        }
      ]
    }
  },
  {
    "code": "MICB 4151",
    "subject": "MICB",
    "id": "4151",
    "title": "Mol & Gen Bases for Micro Dis",
    "info": "Genetic basis of microbial pathogenesis. Effect of gene transfer and regulation on evolution of microbial pathogens and capacity to colonize, induce disease. Biochemical and cellular interactions between bacteria and human hosts. \n\nprereq: MICB 3301 AND [BIOL4003 OR PMB4131 OR Molecular Biology (BIOL 3020 or BIOL 3025 or BIOL 3015)]",
    "prereq": {
      "and": [
        {
          "code": "MICB 3301",
          "subject": "MICB",
          "id": "3301"
        },
        {
          "or": [
            {
              "code": "BIOL 4003",
              "subject": "BIOL",
              "id": "4003"
            },
            {
              "code": "PMB 4131",
              "subject": "PMB",
              "id": "4131"
            },
            {
              "or": [
                {
                  "code": "BIOL 3020",
                  "subject": "BIOL",
                  "id": "3020"
                },
                {
                  "code": "BIOL 3025",
                  "subject": "BIOL",
                  "id": "3025"
                },
                {
                  "code": "BIOL 3015",
                  "subject": "BIOL",
                  "id": "3015"
                }
              ]
            }
          ]
        }
      ]
    }
  },
  {
    "code": "MICB 4161W",
    "subject": "MICB",
    "id": "4161W",
    "title": "Eukaryotic Microbiology",
    "info": "Cell biology of higher eukaryotes, animal/plant pathogenesis, evolution, industrial microbiology. Tetrahymena/Chlamydomons/Paramecium/Toxoplasma/Aspergillus/ Neurospora. \n\nprereq: Biol 4003",
    "prereq": {
      "code": "BIOL 4003",
      "subject": "BIOL",
      "id": "4003"
    }
  },
  {
    "code": "MICB 4171",
    "subject": "MICB",
    "id": "4171",
    "title": "Bio, Genetics, Path of Viruses",
    "info": "Structure, attachment, entry. Genome replication/mRNA production by RNA viruses. Reverse transcription. DNA virus templates. Replication of DNA virus genomes. Processing of viral pre-mRNA. Translational control. Assembly, host defense, tumor viruses, pathogenesis, HIV, antivirals.\n\nprereq: Biol 2003 and Biol 4003 and [MicB 4131 or instructor permission] and Bioc 3022",
    "prereq": {
      "and": [
        {
          "code": "BIOL 2003",
          "subject": "BIOL",
          "id": "2003"
        },
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        },
        {
          "code": "MICB 4131",
          "subject": "MICB",
          "id": "4131"
        },
        {
          "code": "BIOC 3022",
          "subject": "BIOC",
          "id": "3022"
        }
      ]
    }
  },
  {
    "code": "MICB 4215",
    "subject": "MICB",
    "id": "4215",
    "title": "Physiology and Diversity Lab",
    "info": "Isolation/cultivation of wide variety of bacteria. Physiological experiments illustrate characteristic features of microorganisms.\n\nprereq: MICB 3301 AND Microbiology  major or minor; priority for seats from waitlist to graduating Microbiology majors",
    "prereq": {
      "code": "MICB 3301",
      "subject": "MICB",
      "id": "3301"
    }
  },
  {
    "code": "MICB 4225W",
    "subject": "MICB",
    "id": "4225W",
    "title": "Microbial Genetics Laboratory",
    "info": "Yeast is used as a model organism for microbial molecular genetic principles and methods such as ultraviolet mutagenesis, isolation and creation of mutant strains, plasmid design and construction, PCR, Sanger sequencing, gene replacement, and bioinformatics. Students will design and execute their own independent research project using hands-on experimentation with advanced molecular methods \n\nprereq: MicB 3301 and [Biol 4003 or permission]; priority for seats from waitlist to graduating Microbiology majors",
    "prereq": {
      "and": [
        {
          "code": "MICB 3301",
          "subject": "MICB",
          "id": "3301"
        },
        {
          "code": "BIOL 4003",
          "subject": "BIOL",
          "id": "4003"
        }
      ]
    }
  },
  {
    "code": "MICB 4235",
    "subject": "MICB",
    "id": "4235",
    "title": "Adv Lab: Viro/Immuno/Micro Gen",
    "info": "Techniques, experimental methods in microbial genetics, immunology. Virology used to study microbes/interactions with host. \n\nprereq: Micb 3301 and [Bioc 3022 or Bioc 4331] and [MicB 4171 prereq or concurrent registration or permission]",
    "prereq": {
      "and": [
        {
          "code": "MICB 3301",
          "subject": "MICB",
          "id": "3301"
        },
        {
          "or": [
            {
              "code": "BIOC 3022",
              "subject": "BIOC",
              "id": "3022"
            },
            {
              "code": "BIOC 4331",
              "subject": "BIOC",
              "id": "4331"
            }
          ]
        },
        {
          "code": "MICB 4171",
          "subject": "MICB",
          "id": "4171"
        }
      ]
    }
  },
  {
    "code": "MICB 4793W",
    "subject": "MICB",
    "id": "4793W",
    "title": "Directed Studies:  WI",
    "info": "Writing Intensive Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. One main feature of this course is that the student will receive writing instruction and the written output of the course will be revised during the semester. The project needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, how writing instruction will take place, a timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. This course is graded S/N and approval of the DUGS is required before a grade of S can be given by the faculty mentor. \n\nprereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.\n",
    "prereq": {
      "and": [
        {
          "code": "MICB 4793",
          "subject": "MICB",
          "id": "4793"
        },
        {
          "code": "MICB 4794",
          "subject": "MICB",
          "id": "4794"
        },
        {
          "code": "MICB 4993W",
          "subject": "MICB",
          "id": "4993W"
        },
        {
          "code": "MICB 4994",
          "subject": "MICB",
          "id": "4994"
        }
      ]
    }
  },
  {
    "code": "MICB 4794W",
    "subject": "MICB",
    "id": "4794W",
    "title": "Directed Research:  WI",
    "info": "Writing Intensive Directed Research is an individual-study, laboratory or field research experience in which the student is mentored directly by a faculty member. This course is not for students starting out in research. It is intended for students who already have been working in the research group of the mentor and have developed an independent research project. In this course the student will receive writing instruction through a writing support course (corresponding to 1 credit in addition to the credits of directed research time) that will meet weekly throughout the semester. The written output usually is in the form of a scientific paper describing the results of the student's project. Written output of the course must be revised during the semester and a schedule for writing, assessment, and revision needs to be in place at the beginning of the semester. The project needs to be explained in the campus Directed Research contract and the project and participation in the writing support course agreed on by both the student and faculty mentor. The contract must be approved by the Director of Undergraduate Studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, agreement about how writing instruction will take place, confirmation of understanding of the timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course - near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. The DUGS can call for a final revision before a grade is given. This course is graded S/N by the writing support course instructor, and approval of both the DUGS and the research mentor is required before a grade of S can be given by the writing support course instructor.\n\nThis course is for non-Honors students. Students should register for the number of research credits they intend to pursue plus 1 cr for the writing support component (for example: 2-4 cr of research + 1 cr writing support = 3-5 cr).\n\nprereq: department consent, instructor consent, no more than a total of 7 credits of 4793W, 4794W, 4993, 4994 combined can count towards CBS major requirements.\n\nprereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.\n\n",
    "prereq": {
      "and": [
        {
          "code": "MICB 4793W",
          "subject": "MICB",
          "id": "4793W"
        },
        {
          "code": "MICB 4993",
          "subject": "MICB",
          "id": "4993"
        },
        {
          "code": "MICB 4994",
          "subject": "MICB",
          "id": "4994"
        }
      ]
    }
  },
  {
    "code": "MICB 4993",
    "subject": "MICB",
    "id": "4993",
    "title": "Directed Studies",
    "info": "Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. The topic for the course needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. prereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.",
    "prereq": {
      "and": [
        {
          "code": "MICB 4793",
          "subject": "MICB",
          "id": "4793"
        },
        {
          "code": "MICB 4794",
          "subject": "MICB",
          "id": "4794"
        },
        {
          "code": "MICB 4993W",
          "subject": "MICB",
          "id": "4993W"
        },
        {
          "code": "MICB 4994",
          "subject": "MICB",
          "id": "4994"
        }
      ]
    }
  },
  {
    "code": "MICB 4994",
    "subject": "MICB",
    "id": "4994",
    "title": "Directed Research",
    "info": "Directed Research is an individual-study, laboratory or field investigation course. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a Research/Directed Studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. \nprereq: department consent, instructor consent, no more than 7 credits of 4793, 4794, 4993W, 4994W counts towards CBS major requirements.\n",
    "prereq": {
      "and": [
        {
          "code": "MICB 4793",
          "subject": "MICB",
          "id": "4793"
        },
        {
          "code": "MICB 4794",
          "subject": "MICB",
          "id": "4794"
        },
        {
          "code": "MICB 4993W",
          "subject": "MICB",
          "id": "4993W"
        }
      ]
    }
  },
  {
    "code": "MICB 5205",
    "subject": "MICB",
    "id": "5205",
    "title": "Micro-Med Students",
    "info": "Basic/clinical human immunology, medical microbiology. Molecular/cellular basis of immune responses, tolerance. Immunologic disease, serology, antimicrobial agents, chemotherapy. Basic/medical bacteriology, parasitology, mycology, virology. Unifying principles governing pathogenesis. Diseases are grouped with organisms important in differential diagnosis.",
    "prereq": []
  },
  {
    "code": "MICB 5352",
    "subject": "MICB",
    "id": "5352",
    "title": "Appl Microb Biochem",
    "info": "Biochemistry of microorganisms and enzymes of industrial interest. Heterologous peptide overproduction by microorganisms and yeasts; polymer, antibiotic, organic acid, and amino acid production; genetics of industrially useful microorganisms; biological systems useful for biotransformation and environmental remediation; introduction to fermentation technology.",
    "prereq": []
  },
  {
    "code": "MICB 6205",
    "subject": "MICB",
    "id": "6205",
    "title": "Micro-Med Students",
    "info": "Basic/clinical human immunology, medical microbiology. Molecular/cellular basis of immune responses, tolerance. Immunologic disease, serology, antimicrobial agents, chemotherapy. Basic/medical bacteriology, parasitology, mycology, virology. Unifying principles governing pathogenesis. Diseases are grouped with organisms important in differential diagnosis.",
    "prereq": []
  }
]