[
  {
    "code": "MNMD 6000",
    "subject": "MNMD",
    "id": "6000",
    "title": "Becoming a Doctor FoundationsI",
    "info": "The Becoming a Doctor series is an integrated, longitudinal, required educational activity focused on empowering students to transition successfully and resiliently into the role of physician. Through plenary, seminar and workshop sessions, students will develop knowledge and skills in reflective practice and advanced clinical skills, and also participate in activities that foster professional identity formation.",
    "prereq": []
  },
  {
    "code": "MNMD 6010",
    "subject": "MNMD",
    "id": "6010",
    "title": "Becoming a Dr Foundations II",
    "info": "The Becoming a Doctor series is an integrated, longitudinal, required educational activity focused on empowering students to transition successfully and resiliently into the role of physician. Through plenary, seminar, and workshop sessions, students will develop knowledge and skills in reflective practice and advanced clinical skills, and also participate in activities that foster professional identity formation.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6100",
    "subject": "MNMD",
    "id": "6100",
    "title": "Fundamentals of Medicine",
    "info": "In this course, students will explore the fundamentals of medicine by learning about the human body starting with its smallest chemical elements and moving out in scope to people and their communities. These sessions will start exploring cellular components and structure as students move through basic sciences to understand energy, metabolism, genetics, pharmacology, and infectious disease with emphasis on how they relate to the homeostasis of the human body. Along this journey, students will integrate vital tenets of medicine including pathology, physiology, and public health. Students will develop skills of critical thinking, clinical reasoning, and incorporation of basic science into medical practice. Students will also develop a framework for health care systems and will explore their identity within these intersectional communities. The course also provides the necessary background to learn and appreciate the function of organ systems that will be explored in later courses.",
    "prereq": []
  },
  {
    "code": "MNMD 6110",
    "subject": "MNMD",
    "id": "6110",
    "title": "Skin",
    "info": "This course outlines pathophysiology, clinical features, and presentation of common and rare conditions in Dermatology. The layout of the course specifically weaves key concepts from multiple other domains including but not limited to biochemistry, immunology, microbiology, genetics as it highlights the skin’s important roles in our lives. This course aims to demonstrate not only the structure but also the function of the cells and layers and how the skin demonstrates different disease states. Ultimately this course also aims to emphasize and explore the role skin has for each human as a whole and the skin’s important part, not just for one human but also within culture and society.\n",
    "prereq": []
  },
  {
    "code": "MNMD 6120",
    "subject": "MNMD",
    "id": "6120",
    "title": "Musculoskeletal",
    "info": "The Musculoskeletal course is designed to introduce the future physician to the epidemiology, pathophysiology, clinical, and laboratory features of common conditions within the musculoskeletal system. Utilizing multiple modalities of learning, students will complete an interdisciplinary study of each region of the body that includes a foundational science background coupled with a focus on clinical application of the course concepts. Throughout this 5 week course students will gain practice in team-based learning, navigating complex clinical scenarios, and relating anatomy and basic science concepts central to the foundational musculoskeletal knowledge of a well-trained future physician.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6200",
    "subject": "MNMD",
    "id": "6200",
    "title": "Nervous System & Human Behavio",
    "info": "The Nervous System and Human Behavior course begins with a week of introductory neuroscience education called ‘Brain Camp’, in which students build foundational knowledge of the nervous system structure and neural systems, brain cell structure and function, as well as an introduction to nervous system function its relationship to Human Behavior. Students will then participate in eight weeks of educational sessions organized by common presenting clinical problems impacting the nervous system and human behavior. These themed weeks include Altered Mental Status, Sensation and Pain, Special Senses, Movement, Affective Disorders, Cognitive Disorders, Neurodevelopmental Disorders, and Multi-system Disorders. Each week includes a ‘Base Camp’ element delivering foundational concepts in neuroscience for the week’s case-based learning, problem-based learning and large group active learning sessions. \n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6210",
    "subject": "MNMD",
    "id": "6210",
    "title": "Cardiovascular",
    "info": "This interdisciplinary course provides the student with an introduction to the cardiovascular system, particularly the key aspects of normal and abnormal physiology, disease, and race based medicine. Students will hone their critical thinking skills as they engage in small group discussions, problem-based learning, and case-based learning to solve real-world medical dilemmas. Additionally, students will be expected to attend and actively participate in the concurrent anatomy lab and clinical skills course to obtain an in-depth knowledge of structures of the heart and practice skills such as performing physical exams and procedures that are relevant to the field. \n",
    "prereq": []
  },
  {
    "code": "MNMD 6300",
    "subject": "MNMD",
    "id": "6300",
    "title": "Respiratory",
    "info": "This interdisciplinary course provides the student with an introduction to the pulmonary system, particularly the key aspects of normal and abnormal physiology, and disease, The course focuses on anatomy, histology, physiology, pathology, pathophysiology, pharmacology, infectious diseases, and public health relevant to pulmonary medicine. The course will include didactic lectures to provide key concepts while the case-based learning formats provide context and application. The emphasis for pulmonary medicine is on mechanisms of disease, global (non-linear) thinking, and application of knowledge to prepare students for their future clinical experiences. \n",
    "prereq": []
  },
  {
    "code": "MNMD 6310",
    "subject": "MNMD",
    "id": "6310",
    "title": "Renal",
    "info": "The Renal and Urinary System course focuses on the anatomy, physiology, and pathophysiology of the kidneys and their related structures. Our course provides students with a thorough understanding of the renal and urinary system's role in maintaining fluid and electrolyte balance, filtering waste products, and regulating blood pressure.\n",
    "prereq": []
  },
  {
    "code": "MNMD 6400",
    "subject": "MNMD",
    "id": "6400",
    "title": "Endocrine and Reproduction",
    "info": "This course focuses on understanding the endocrine and reproductive organs in the body- the hormones they produce, the feedback mechanisms that control them, and disease processes which can affect these systems. Specific subtopics include pituitary, thyroid, adrenal, calcium/bone, diabetes, reproduction, and transgender care. Students will engage in the course with pre-recorded lectures, in-person case-based active learning workshops, and week-long Problem-Based Learning (PBL) sessions.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6410",
    "subject": "MNMD",
    "id": "6410",
    "title": "Hematological",
    "info": "This  course focuses on histology, physiology, pathology, pathophysiology, pharmacology, and infectious diseases of the hematologic (blood) system. The course will give students a basic understanding of blood and bone marrow function and disease states, thereby providing a foundation  for students to build upon as they encounter patients in their clinical training and future careers. Students will hone their critical thinking skills as they engage in small group discussions, problem-based learning, and simulated learning environments to solve real-world medical dilemmas. Additionally, students will be expected to actively participate in the concurrent clinical skills course to obtain hands-on practice with critical skills such as performing physical exams and procedures relevant to the field. \n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6420",
    "subject": "MNMD",
    "id": "6420",
    "title": "Gastrointestinal",
    "info": "The gastrointestinal system provides a large surface area to move nutrient material from the external environment into the bloodstream for distribution to the cells of the body. In this process, simple and complex molecules are ingested, digested, transported and finally either absorbed or excreted. In this course, we will travel through the gastro-intestinal tract from the mouth to the anus, learning first normal physiology followed by abnormal pathology and clinical problems. The role of various infectious agents will be examined and the therapeutic effects of pharmacological interventions will be presented. The course will end with study of normal and abnormal aspects of pancreatic, hepatic and biliary function. Since the major point of all this processing of ingested materials is to provide good cellular nutrition, a substantial portion of this course is directed toward understanding basic nutritional principles and requirements.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6501",
    "subject": "MNMD",
    "id": "6501",
    "title": "Clinical Skills I",
    "info": "Clinical Skills is a comprehensive exploration of the direct care components of medical education. The course begins with the basic skills of a physician and builds layers of increasingly advanced techniques. This will be integrated with the organ systems courses running concurrently and prepare students for success in their clerkships.\nEach section of Clinical Skills will incorporate knowledge acquisition and skill building in the following activities: History and Physical Exam, Patient Centered Care, Differential Diagnosis, Diagnostic and Screening Tests, Orders and Treatments,Documenting a Patient Encounter, Oral Presentation, Forming Clinical Questions and Retrieving Evidence, Transition of Care, Urgent/Emergent Care, Informed Consent, General Procedures of a Physician, and the Culture of Safety.\nStudents will engage in clinical skill development through facilitated small group work, simulated clinical experiences, immersion in clinical settings, and other active learning modalities.\n",
    "prereq": []
  },
  {
    "code": "MNMD 6502",
    "subject": "MNMD",
    "id": "6502",
    "title": "Clinical Skills II",
    "info": "Clinical Skills is a comprehensive exploration of the direct care components of medical education. The course begins with the basic skills of a physician and builds layers of increasingly advanced techniques. This will be integrated with the organ systems courses running concurrently and prepare students for success in their clerkships.\n\nEach section of Clinical Skills will incorporate knowledge acquisition and skill building in the following activities: History and Physical Exam, Patient Centered Care, Differential Diagnosis, Diagnostic and Screening Tests, Orders and Treatments, Documenting a Patient Encounter, Oral Presentation, Forming Clinical Questions and Retrieving Evidence, Transition of Care, Urgent/Emergent Care, Informed Consent, General Procedures of a Physician, and the Culture of Safety.\n\nStudents will engage in clinical skill development through facilitated small group work, simulated clinical experiences, immersion in clinical settings, and other active learning modalities.",
    "prereq": []
  },
  {
    "code": "MNMD 6503",
    "subject": "MNMD",
    "id": "6503",
    "title": "Clinical Skills III",
    "info": "Clinical Skills is a comprehensive exploration of the direct care components of medical education. The course begins with the basic skills of a physician and builds layers of increasingly advanced techniques. This will be integrated with the organ systems courses running concurrently and prepare students for success in their clerkships.\n\nEach section of Clinical Skills will incorporate knowledge acquisition and skill building in the following activities: History and Physical Exam, Patient Centered Care, Differential Diagnosis, Diagnostic and Screening Tests, Orders and Treatments, Documenting a Patient Encounter, Oral Presentation, Forming Clinical Questions and Retrieving Evidence, Transition of Care, Urgent/Emergent Care, Informed Consent, General Procedures of a Physician, and the Culture of Safety.\n\nStudents will engage in clinical skill development through facilitated small group work, simulated clinical experiences, immersion in clinical settings, and other active learning modalities.",
    "prereq": []
  },
  {
    "code": "MNMD 6504",
    "subject": "MNMD",
    "id": "6504",
    "title": "Clinical Skills IV",
    "info": "Clinical Skills is a comprehensive exploration of the direct care components of medical education. The course begins with the basic skills of a physician and builds layers of increasingly advanced techniques. This will be integrated with the organ systems courses running concurrently and prepare students for success in their clerkships.\n\nEach section of Clinical Skills will incorporate knowledge acquisition and skill building in the following activities: History and Physical Exam, Patient Centered Care, Differential Diagnosis, Diagnostic and Screening Tests, Orders and Treatments, Documenting a Patient Encounter, Oral Presentation, Forming Clinical Questions and Retrieving Evidence, Transition of Care, Urgent/Emergent Care, Informed Consent, General Procedures of a Physician, and the Culture of Safety.\n\nStudents will engage in clinical skill development through facilitated small group work, simulated clinical experiences, immersion in clinical settings, and other active learning modalities.",
    "prereq": []
  },
  {
    "code": "MNMD 6601",
    "subject": "MNMD",
    "id": "6601",
    "title": "2SLGBTQIA+ Health I",
    "info": "2SLGBTQIA+ course is a longitudinal educational experience for students dedicated to serve patients within the 2SLGBTQIA+ communities. Students articulate their self-identities and engage in introspection to understand their positionality in medical care. Students develop a strong knowledge base in the biopsychosociocultural contexts which impact the communities and a strong knowledge base in the clinical care of the communities. Students develop an empowered and effective leadership role in advocating for 2SLGBTQIA+ communities within medicine and the broader community. This course encourages and develops teamwork and boundaries as lifelong skills which enhance self-efficacy in the medical workplace. Students will engage in a scholarly project in the area of 2SLGBTQIA+ health.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6602",
    "subject": "MNMD",
    "id": "6602",
    "title": "2SLGBTQIA+ Health II",
    "info": "2SLGBTQIA+ course is a longitudinal educational experience for students dedicated to serve patients within the 2SLGBTQIA+ communities. Students articulate their self-identities and engage in introspection to understand their positionality in medical care. Students develop a strong knowledge base in the biopsychosociocultural contexts which impact the communities and a strong knowledge base in the clinical care of the communities. Students develop an empowered and effective leadership role in advocating for 2SLGBTQIA+ communities within medicine and the broader community. This course encourages and develops teamwork and boundaries as lifelong skills which enhance self-efficacy in the medical workplace. Students will engage in a scholarly project in the area of 2SLGBTQIA+ health.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6603",
    "subject": "MNMD",
    "id": "6603",
    "title": "2SLGBTQIA+ Health III",
    "info": "2SLGBTQIA+ course is a longitudinal educational experience for students dedicated to serve patients within the 2SLGBTQIA+ communities. Students articulate their self-identities and engage in introspection to understand their positionality in medical care. Students develop a strong knowledge base in the biopsychosociocultural contexts which impact the communities and a strong knowledge base in the clinical care of the communities. Students develop an empowered and effective leadership role in advocating for 2SLGBTQIA+ communities within medicine and the broader community. This course encourages and develops teamwork and boundaries as lifelong skills which enhance self-efficacy in the medical workplace. Students will engage in a scholarly project in the area of 2SLGBTQIA+ health.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6604",
    "subject": "MNMD",
    "id": "6604",
    "title": "2SLGBTQIA+ Health IV",
    "info": "2SLGBTQIA+ course is a longitudinal educational experience for students dedicated to serve patients within the 2SLGBTQIA+ communities. Students articulate their self-identities and engage in introspection to understand their positionality in medical care. Students develop a strong knowledge base in the biopsychosociocultural contexts which impact the communities and a strong knowledge base in the clinical care of the communities. Students develop an empowered and effective leadership role in advocating for 2SLGBTQIA+ communities within medicine and the broader community. This course encourages and develops teamwork and boundaries as lifelong skills which enhance self-efficacy in the medical workplace. Students will engage in a scholarly project in the area of 2SLGBTQIA+ health.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6611",
    "subject": "MNMD",
    "id": "6611",
    "title": "Immigrant Refugee Global I",
    "info": "The Immigrant, Rural, and Global Health (IRG) course is a four-semester, longitudinal experiential learning course that invites the student to understand how various facets of the healthcare system, healthcare laws, structural determinants of health, and their own personal journeys may shape how they provide care to people from IRG communities. Students will begin by understanding their personal and family migration story (semester 1), the assets and disparities in the local (TC and DU) and state IRG communities; (semester 2), the IRG community in the United States (semester 3), and lastly the connections to global health equity issues (semester 4). Students will engage in small group discussions, group projects, reflective exercises and gain first-hand experience working with and learning from community partners. This course will complement and inform the students' longitudinal community capstone projects.\n",
    "prereq": []
  },
  {
    "code": "MNMD 6612",
    "subject": "MNMD",
    "id": "6612",
    "title": "Immigrant Refugee Global II",
    "info": "The Immigrant, Rural, and Global Health (IRG) course is a four-semester, longitudinal experiential learning course that invites the student to understand how various facets of the healthcare system, healthcare laws, structural determinants of health, and their own personal journeys may shape how they provide care to people from IRG communities. Students will begin by understanding their personal and family migration story (semester 1), the assets and disparities in the local (TC and DU) and state IRG communities; (semester 2), the IRG community in the United States (semester 3), and lastly the connections to global health equity issues (semester 4). Students will engage in small group discussions, group projects, reflective exercises and gain first-hand experience working with and learning from community partners. This course will complement and inform the students' longitudinal community capstone projects.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6613",
    "subject": "MNMD",
    "id": "6613",
    "title": "Immigrant Refugee Global III",
    "info": "The Immigrant, Rural, and Global Health (IRG) course is a four-semester, longitudinal experiential learning course that invites the student to understand how various facets of the healthcare system, healthcare laws, structural determinants of health, and their own personal journeys may shape how they provide care to people from IRG communities. Students will begin by understanding their personal and family migration story (semester 1), the assets and disparities in the local (TC and DU) and state IRG communities; (semester 2), the IRG community in the United States (semester 3), and lastly the connections to global health equity issues (semester 4). Students will engage in small group discussions, group projects, reflective exercises and gain first-hand experience working with and learning from community partners. This course will complement and inform the students' longitudinal community capstone projects.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6614",
    "subject": "MNMD",
    "id": "6614",
    "title": "Immigrant Refugee Global IV",
    "info": "The Immigrant, Rural, and Global Health (IRG) course is a four-semester, longitudinal experiential learning course that invites the student to understand how various facets of the healthcare system, healthcare laws, structural determinants of health, and their own personal journeys may shape how they provide care to people from IRG communities. Students will begin by understanding their personal and family migration story (semester 1), the assets and disparities in the local (TC and DU) and state IRG communities; (semester 2), the IRG community in the United States (semester 3), and lastly the connections to global health equity issues (semester 4). Students will engage in small group discussions, group projects, reflective exercises and gain first-hand experience working with and learning from community partners. This course will complement and inform the students' longitudinal community capstone projects.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6621",
    "subject": "MNMD",
    "id": "6621",
    "title": "Indigenous Health I",
    "info": "The Impact Indigenous Health course will allow students the opportunity to learn about the historical and current status of indigenous people in Minnesota and recognize the parallels with indigenous people across the United States.  The focus of the course will be on healthcare and will include many topics that intersect with other MPact Minnesota Health courses.  The learning goals and objectives will be presented as a progression, with each semester cascading into the next.  Key themes that guide the course are Identity, Native Health Systems & Structures, Trauma Informed Care, and Policy & Advocacy.  Students will participate in activities which require self-reflection, and will learn best practices about patient advocacy, critical conversations, and community partnerships.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6622",
    "subject": "MNMD",
    "id": "6622",
    "title": "Indigenous Health II",
    "info": "The Impact Indigenous Health course will allow students the opportunity to learn about the historical and current status of indigenous people in Minnesota and recognize the parallels with indigenous people across the United States.  The focus of the course will be on healthcare and will include many topics that intersect with other MPact Minnesota Health courses.  The learning goals and objectives will be presented as a progression, with each semester cascading into the next.  Key themes that guide the course are Identity, Native Health Systems & Structures, Trauma Informed Care, and Policy & Advocacy.  Students will participate in activities which require self-reflection, and will learn best practices about patient advocacy, critical conversations, and community partnerships.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6623",
    "subject": "MNMD",
    "id": "6623",
    "title": "Indigenous Health III",
    "info": "The Impact Indigenous Health course will allow students the opportunity to learn about the historical and current status of indigenous people in Minnesota and recognize the parallels with indigenous people across the United States.  The focus of the course will be on healthcare and will include many topics that intersect with other MPact Minnesota Health courses.  The learning goals and objectives will be presented as a progression, with each semester cascading into the next.  Key themes that guide the course are Identity, Native Health Systems & Structures, Trauma Informed Care, and Policy & Advocacy.  Students will participate in activities which require self-reflection, and will learn best practices about patient advocacy, critical conversations, and community partnerships.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6624",
    "subject": "MNMD",
    "id": "6624",
    "title": "Indigenous Health IV",
    "info": "The Impact Indigenous Health course will allow students the opportunity to learn about the historical and current status of indigenous people in Minnesota and recognize the parallels with indigenous people across the United States.  The focus of the course will be on healthcare and will include many topics that intersect with other Impact Minnesota Health courses.  The learning goals and objectives will be presented as a progression, with each semester cascading into the next.  Key themes that guide the course are Identity, Native Health Systems & Structures, Trauma Informed Care, and Policy & Advocacy.  Students will participate in activities which require self-reflection, and will learn best practices about patient advocacy, critical conversations, and community partnerships.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6631",
    "subject": "MNMD",
    "id": "6631",
    "title": "Rural Health I",
    "info": "Respect for each person is central to medicine. In the context of rural health, that respect is fostered through a critical understanding of how rurality shapes diverse individuals’ access to health and health care. To that end, the Rural course will focus on rural socio-spatiality; uniquely rural social determinants of health; barriers to and opportunities for care in rural areas; challenges related to seeking care in more urban spaces; and structural aspects of rural health, including the legacy of state- and federal-level policy making in rural areas. Throughout, we will rigorously consider how we know these things, i.e., what ethical, robust research looks like in rural spaces, including via Critical Indigenous Methodologies.\n",
    "prereq": []
  },
  {
    "code": "MNMD 6632",
    "subject": "MNMD",
    "id": "6632",
    "title": "Rural Health II",
    "info": "Respect for each person is central to medicine. In the context of rural health, that respect is fostered through a critical understanding of how rurality shapes diverse individuals’ access to health and health care. To that end, the Rural course will focus on rural socio-spatiality; uniquely rural social determinants of health; barriers to and opportunities for care in rural areas; challenges related to seeking care in more urban spaces; and structural aspects of rural health, including the legacy of state- and federal-level policy making in rural areas. Throughout, we will rigorously consider how we know these things, i.e., what ethical, robust research looks like in rural spaces, including via Critical Indigenous Methodologies.\n\nAcross this and other courses, students will devote respectful consideration to what it might look and feel like to practice in rural areas and engage in interprofessional collaborations with valued health partners (i.e., community champions, other social and legal services, etc.). They will also explore alternative rural structures and systems and the role of advocacy, activism, and mutual aid in accessing and providing local and international health care.\n",
    "prereq": []
  },
  {
    "code": "MNMD 6633",
    "subject": "MNMD",
    "id": "6633",
    "title": "Rural Health III",
    "info": "Respect for each person is central to medicine. In the context of rural health, that respect is fostered through a critical understanding of how rurality shapes diverse individuals’ access to health and health care. To that end, the Rural Pathway will focus on rural socio-spatiality; uniquely rural social determinants of health; barriers to and opportunities for care in rural areas; challenges related to seeking care in more urban spaces; and structural aspects of rural health, including the legacy of state- and federal-level policy making in rural areas. Throughout, we will rigorously consider how we know these things, i.e., what ethical, robust research looks like in rural spaces, including via Critical Indigenous Methodologies.\n",
    "prereq": []
  },
  {
    "code": "MNMD 6634",
    "subject": "MNMD",
    "id": "6634",
    "title": "Rural Health IV",
    "info": "Respect for each person is central to medicine. In the context of rural health, that respect is fostered through a critical understanding of how rurality shapes diverse individuals’ access to health and health care. To that end, the Rural course will focus on rural socio-spatiality; uniquely rural social determinants of health; barriers to and opportunities for care in rural areas; challenges related to seeking care in more urban spaces; and structural aspects of rural health, including the legacy of state- and federal-level policy making in rural areas. Throughout, we will rigorously consider how we know these things, i.e., what ethical, robust research looks like in rural spaces, including via Critical Indigenous Methodologies.\n\nAcross this and other courses, students will devote respectful consideration to what it might look and feel like to practice in rural areas and engage in interprofessional collaborations with valued health partners (i.e., community champions, other social and legal services, etc.). They will also explore alternative rural structures and systems and the role of advocacy, activism, and mutual aid in accessing and providing local and international health care.\n",
    "prereq": []
  },
  {
    "code": "MNMD 6641",
    "subject": "MNMD",
    "id": "6641",
    "title": "Urban Community Health I",
    "info": "The Urban and Community Health MPact Course is a longitudinal course in which students will examine causes of and potential solutions to health inequities impacting urban communities in Minnesota. Urbanization can bring social and economic benefits, but structural inequities in these areas are the key contributors to health inequities which most often harm Black and brown communities in Minnesota. In this course, students will develop a strong understanding of the historical events and contemporary power dynamics, as well as the urban socio-economic and physical structures that inform community members’ lived experiences of care. The course will invite deep self-reflection of students’ own lived experiences and identities, as well as cultivation of qualitative skills to engage in mutually beneficial, authentic collaborations with urban communities in Minnesota impacted by health inequities to understand their lived experiences. Anti-racism, trauma-informed care, and structural competency form the pillars of the course, and will be the lenses through which students will be asked to conduct their analysis. Students will learn through small-group discussion, guest lectures, reflective activities, workshops, and independent study. Throughout all four semesters of the course, students will be working towards a capstone project for which they will iteratively examine their own experiences, integrate the perspectives of community members, and synthesize a vision for care that supports health and healing in the urban context.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6642",
    "subject": "MNMD",
    "id": "6642",
    "title": "Urban Community Health II",
    "info": "The Urban and Community Health MPact Course is a longitudinal course in which students will examine causes of and potential solutions to health inequities impacting urban communities in Minnesota. Urbanization can bring social and economic benefits, but structural inequities in these areas are the key contributors to health inequities which most often harm Black and brown communities in Minnesota. In this course, students will develop a strong understanding of the historical events and contemporary power dynamics, as well as the urban socio-economic and physical structures that inform community members’ lived experiences of care. The course will invite deep self-reflection of students’ own lived experiences and identities, as well as cultivation of qualitative skills to engage in mutually beneficial, authentic collaborations with urban communities in Minnesota impacted by health inequities to understand their lived experiences. Anti-racism, trauma-informed care, and structural competency form the pillars of the course, and will be the lenses through which students will be asked to conduct their analysis. Students will learn through small-group discussion, guest lectures, reflective activities, workshops, and independent study. Throughout all four semesters of the course, students will be working towards a capstone project for which they will iteratively examine their own experiences, integrate the perspectives of community members, and synthesize a vision for care that supports health and healing in the urban context.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6643",
    "subject": "MNMD",
    "id": "6643",
    "title": "Urban Community Health III",
    "info": "The Urban and Community Health MPact Course is a longitudinal course in which students will examine causes of and potential solutions to health inequities impacting urban communities in Minnesota. Urbanization can bring social and economic benefits, but structural inequities in these areas are the key contributors to health inequities which most often harm Black and brown communities in Minnesota. In this course, students will develop a strong understanding of the historical events and contemporary power dynamics, as well as the urban socio-economic and physical structures that inform community members’ lived experiences of care. The course will invite deep self-reflection of students’ own lived experiences and identities, as well as cultivation of qualitative skills to engage in mutually beneficial, authentic collaborations with urban communities in Minnesota impacted by health inequities to understand their lived experiences. Anti-racism, trauma-informed care, and structural competency form the pillars of the course, and will be the lenses through which students will be asked to conduct their analysis. Students will learn through small-group discussion, guest lectures, reflective activities, workshops, and independent study. Throughout all four semesters of the course, students will be working towards a capstone project for which they will iteratively examine their own experiences, integrate the perspectives of community members, and synthesize a vision for care that supports health and healing in the urban context.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6644",
    "subject": "MNMD",
    "id": "6644",
    "title": "Urban Community Health IV",
    "info": "The Urban and Community Health MPact Course is a longitudinal course in which students will examine causes of and potential solutions to health inequities impacting urban communities in Minnesota. Urbanization can bring social and economic benefits, but structural inequities in these areas are the key contributors to health inequities which most often harm Black and brown communities in Minnesota. In this course, students will develop a strong understanding of the historical events and contemporary power dynamics, as well as the urban socio-economic and physical structures that inform community members’ lived experiences of care. The course will invite deep self-reflection of students’ own lived experiences and identities, as well as cultivation of qualitative skills to engage in mutually beneficial, authentic collaborations with urban communities in Minnesota impacted by health inequities to understand their lived experiences. Anti-racism, trauma-informed care, and structural competency form the pillars of the course, and will be the lenses through which students will be asked to conduct their analysis. Students will learn through small-group discussion, guest lectures, reflective activities, workshops, and independent study. Throughout all four semesters of the course, students will be working towards a capstone project for which they will iteratively examine their own experiences, integrate the perspectives of community members, and synthesize a vision for care that supports health and healing in the urban context.\n\n",
    "prereq": []
  },
  {
    "code": "MNMD 6651",
    "subject": "MNMD",
    "id": "6651",
    "title": "MPact Communities I",
    "info": "Nurture and promote engagement with communities that have been economically and socially marginalized, are underserved by the healthcare system, and experience health inequities in the state of Minnesota, i.e., 2SLGBTQIA+, Immigrant/Refugee/Global, Indigenous, Rural, and Urban Communities. Provide an opportunity to investigate and engage with marginalizing and stigmatizing health conditions that interact with community/population/identity categories, e.g., disabilities, emotional and behavioral concerns, neurodiversity, addiction, obesity, incarceration, experiencing poverty/food/housing insecurity.",
    "prereq": []
  },
  {
    "code": "MNMD 6654",
    "subject": "MNMD",
    "id": "6654",
    "title": "MPact Communities IV",
    "info": "Nurture and promote engagement with communities that have been economically and socially marginalized, are underserved by the healthcare system, and experience health inequities in the state of Minnesota, i.e., 2SLGBTQIA+, Immigrant/Refugee/Global, Indigenous, Rural, and Urban Communities. Provide an opportunity to investigate and engage with marginalizing and stigmatizing health conditions that interact with community/population/identity categories, e.g., disabilities, emotional and behavioral concerns, neurodiversity, addiction, obesity, incarceration, experiencing poverty/food/housing insecurity.",
    "prereq": []
  },
  {
    "code": "MNMD 6900",
    "subject": "MNMD",
    "id": "6900",
    "title": "Summer Internship in Medicine",
    "info": "The SIM Program occurs between years one and two (typically July and August). Students are placed in rural communities to gain exposure to rural medicine and to experience life as a rural health professional. Urban sites are also available typically with an underserved/minority opportunities.",
    "prereq": []
  }
]