[{"code":"MTHE 3101","subject":"MTHE","id":"3101","title":"Mathematics & Pedagogy I","info":"Math content knowledge of K-6 in an environment modeling pedagogy for future implementation. Integrated content/methods. Problem solving, connections, communication, reasoning, representation. Functions, proportionality, number, numeration. prereq: [College algebra, elementary FOE or Early Childhood student, jr status or above] or instr consent","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 3102","subject":"MTHE","id":"3102","title":"Mathematics & Pedagogy II","info":"Math content knowledge of K-6 in an environment modeling pedagogy for future implementation. Integrated content/methods. Problem solving, connections, communication, reasoning, representation. Geometry, measurement, probability, statistics.","prereqInfo":"prereq: 3101, college algebra","prereq":{"course":[{"code":"MTHE 3101","subject":"MTHE","id":"3101"}]}},{"code":"MTHE 5011","subject":"MTHE","id":"5011","title":"Arithmetic Structures in Math","info":"Pedagogy, content, and instructional strategies for teaching arithmetic. Content and issues relevant to the K-8 mathematics curriculum. Instructional materials and technology appropriate for elementary or middle school arithmetic. Credit hours and targeted level vary with particular classes.","prereqInfo":"prereq: Enrollment in math initial licensure program or tchg exper","prereq":{"course":[]}},{"code":"MTHE 5021","subject":"MTHE","id":"5021","title":"Algebraic Structures in Math","info":"Pedagogy, content, and instructional strategies for teaching arithmetic. Content and issues relevant to the algebra curriculum. Instructional materials and technology appropriate for arithmetic. Each offering of the course will focus on either elementary/middle or middle/secondary grade levels.","prereqInfo":"prereq: Tchg exper or isntr consent","prereq":{"course":[]}},{"code":"MTHE 5031","subject":"MTHE","id":"5031","title":"Geometric Structures in Math","info":"Pedagogy, content, and instructional strategies for teaching school geometry. Content and issues relevant to the geometry curriculum. Instructional materials and technology appropriate for geometry. Each offering will focus on either elementary/middle or middle/secondary grade levels.","prereqInfo":"prereq: Enrollment in math initial licensure program","prereq":{"course":[]}},{"code":"MTHE 5100","subject":"MTHE","id":"5100","title":"Topics in Mathematics Educ","info":"Issues, materials, and instructional techniques focusing on a single current topic of particular relevance to secondary school and college mathematics teachers.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 5101","subject":"MTHE","id":"5101","title":"Wkshp: Elem School Math","info":"Modern trends, methods, and materials used to convey mathematical ideas.","prereqInfo":"prereq: Tchg license or student elem ed MEd or special ed or instr consent","prereq":{"course":[]}},{"code":"MTHE 5115","subject":"MTHE","id":"5115","title":"Applications of Teaching Math","info":"The purpose of this course is to examine mathematics teaching in diverse school settings and help you inquire and reflect about your own teaching practice and its impact on you, and the students you will meet. Throughout this course we will collaboratively inquire about teaching and learning, observe and analyze instruction, and reflect on your own and each other?s teaching. We will develop and integrate technological knowledge that works together with pedagogical and content knowledge to make math teaching more effective. ","prereqInfo":"prereq: You must be enrolled in the Mathematics initial licensure program to take this course.","prereq":{"course":[]}},{"code":"MTHE 5155","subject":"MTHE","id":"5155","title":"Rational Numbers/Proportional","info":"The relationship between the development of rational number concepts and proportional reasoning skills. Examination of how newer school curricula treat these concepts. Application of materials in the classroom and analysis of results. Reading and responding to current research.","prereqInfo":"prereq: Educ student or instr consent","prereq":{"course":[]}},{"code":"MTHE 5161","subject":"MTHE","id":"5161","title":"Dev Leadership in School Math","info":"Current developments in the psychology and pedagogy of mathematics education as related to the evolving nature of mathematics education objectives. Emerging use of technology in the mathematics classroom. Techniques for the development of supervisory abilities. Characteristics of effective staff development.","prereqInfo":"prereq: Teaching experience or instr consent","prereq":{"course":[]}},{"code":"MTHE 5170","subject":"MTHE","id":"5170","title":"Hist Topics in Math Classroom","info":"Historical underpinnings of school mathematics content and methodology.  Cross-cultural contributions in the development of mathematical ideas. Development of lessons, activities, and materials for school use.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 5171","subject":"MTHE","id":"5171","title":"Teaching Problem Solving","info":"Investigation of fundamental concepts and principles of problem solving, reasoning, and proof. Emphasis on activities and applications appropriate for junior and senior high classes. Pedagogical experiences to prepare teachers to teach problem solving, reasoning, and proof in classrooms.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 5172","subject":"MTHE","id":"5172","title":"Teaching Probability/Statistic","info":"Investigation of fundamental concepts and principles of probability and statistics. Emphasis on activities and applications appropriate for junior and senior high school classes. Pedagogical experiences to prepare teachers to integrate quantitative literacy accurately and effectively in classrooms.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 5174","subject":"MTHE","id":"5174","title":"Ethics,Psy Human Dev,Internet","info":"Investigation of concepts and themes common to ethics, mathematics, physical science, human development, and the Internet. Emphasis on developing understanding of fundamental concepts and principles, on problem solving in a distributed intelligence environment (WWW) and on activities appropriate for K-12 classes.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 5305","subject":"MTHE","id":"5305","title":"Mid Schl Mathematics Methods","info":"The unique needs of middle school students in the mathematics classroom. Mathematics content and pedagogical skills. Adolescent development/psychology. Field placement in a middle school mathematics classroom.","prereqInfo":"prereq: Elem ed licensure student","prereq":{"course":[]}},{"code":"MTHE 5313","subject":"MTHE","id":"5313","title":"Teach/learn Middle Sch Math","info":"Mathematics learning, instruction methods, mathematical topics, and assessment procedures appropriate for the middle grades. Examination of newer curricular materials. Illustration of successful instructional techniques. Discussion of the relationship between the nature of the learner and effective instruction.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 5314","subject":"MTHE","id":"5314","title":"Teaching & Learning Math","info":"Methods, materials, and curriculum development. Principles of learning. Review of research. Preparation/evaluation of tests, units, and materials of instruction. Recent developments in mathematics curriculum and in instructional alternatives. Issues in teaching/learning. Program planning/evaluation.","prereqInfo":"prereq: Math Ed or MEd or CI MEd or grad student or instr consent","prereq":{"course":[]}},{"code":"MTHE 5345","subject":"MTHE","id":"5345","title":"Teach/Learn in Dev. Math.","info":"Research related to developmental education and mathematics education. Principles of learning. Students? mathematical development. Assessment/evaluation of teaching/learning. Instructional technology. Strategies for students.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 5355","subject":"MTHE","id":"5355","title":"Math for Diverse Learners","info":"Mathematical concepts and methods for exceptional students, both low achieving and gifted. Experimental materials and methods designed for underachieving students.","prereqInfo":"prereq: Teaching license or student in elem ed or special ed or instr consent","prereq":{"course":[]}},{"code":"MTHE 5366","subject":"MTHE","id":"5366","title":"Tech-Assist Math Instruction","info":"Technology--including computers, programmable and graphing calculators, and video--as instructional tools in mathematics; design and evaluation of technology-based mathematics lessons; the effect of technology on the mathematics curriculum; managing the technology-enriched classroom.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 5696","subject":"MTHE","id":"5696","title":"Student Teaching in Math","info":"Student teaching in secondary school mathematics classes.","prereqInfo":"prereq: MEd/initial licensure student or instr consent","prereq":{"course":[]}},{"code":"MTHE 5993","subject":"MTHE","id":"5993","title":"Directed Studies in Math Educ","info":"Secondary school classroom teaching project to improve specific teaching skills, planned by student, approved/directed by student's adviser.","prereqInfo":"prereq: Math ed MEd student, instr consent","prereq":{"course":[]}},{"code":"MTHE 8561","subject":"MTHE","id":"8561","title":"School Mathematics Curricula","info":"Historical antecedents of present day school mathematics curricula. Examine primary source materials by reviewing  early mathematics texts from curriculum library.","prereqInfo":null,"prereq":{"course":[]}},{"code":"MTHE 8571","subject":"MTHE","id":"8571","title":"Res in Math Ed","info":"Designed for advanced graduate students in mathematics education. Presentation and discussion of Ph.D. thesis proposals and other contemporary research.","prereqInfo":"prereq: 5313, 8501","prereq":{"course":[{"code":"MTHE 5313","subject":"MTHE","id":"5313"},{"code":"MTHE 8501","subject":"MTHE","id":"8501"}]}},{"code":"MTHE 8591","subject":"MTHE","id":"8591","title":"Sem MthE","info":"Problems of mathematics instruction from kindergarten through junior college; opportunity to develop proposals and design models for empirical research.","prereqInfo":"prereq: Math educ PhD student","prereq":{"course":[]}},{"code":"MTHE 8995","subject":"MTHE","id":"8995","title":"Problems in Mathematics Educ","info":"Students survey most recent literature and design and prepare research reports on special topics.","prereqInfo":null,"prereq":{"course":[]}}]