[
  {
    "code": "NR 5021",
    "subject": "NR",
    "id": "5021",
    "title": "Stats-Ag Nat Res Professionals",
    "info": "This course is designed for graduate students in the agricultural, environmental, natural resources, and other related programs that require an understanding of statistics and applied quantitative research. Course content focuses on data analysis approaches using common statistical methods, e.g., probability and distributions, simple linear, multiple, and logistic regression, linear models, and analysis of variance. This course is completely online and asynchronous.\nprereq: College algebra or instructor consent",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "NR 8100",
    "subject": "NR",
    "id": "8100",
    "title": "Topics in NRSM",
    "info": "Topics course for NRSM",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "NR 8101",
    "subject": "NR",
    "id": "8101",
    "title": "NRSM Orientation",
    "info": "All incoming Natural Resources Science and Management (NRSM) graduate students are required to complete a one-credit orientation course. Students will become acquainted with the NRSM program and resources available at the graduate program, College, and University level. In addition, students will learn about the motivations and development of the research process and receive grounding in the ethical conduct of research.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "NR 8107",
    "subject": "NR",
    "id": "8107",
    "title": "Seminar: NRSM",
    "info": "A required seminar designed for M.S. and Ph.D. candidates nearing the end of their degree programs. Topics include science communication, presentation design concepts, and related content. Expect assignments focused on data visualization and communication, student presentations, and presentation reviews.",
    "prereqInfo": null,
    "prereq": {
      "course": []
    }
  },
  {
    "code": "NR 8333",
    "subject": "NR",
    "id": "8333",
    "title": "FTE: Master's",
    "info": "(No description)",
    "prereqInfo": "prereq: Master's student, adviser and DGS consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "NR 8444",
    "subject": "NR",
    "id": "8444",
    "title": "FTE: Doctoral",
    "info": "(No description)",
    "prereqInfo": "prereq: Doctoral student, adviser and DGS consent",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "NR 8666",
    "subject": "NR",
    "id": "8666",
    "title": "Doct Pre-Thesis Cr*",
    "info": "tbd",
    "prereqInfo": "prereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "NR 8777",
    "subject": "NR",
    "id": "8777",
    "title": "Thesis Credit:Mast*",
    "info": "(No description)",
    "prereqInfo": "prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {
      "course": []
    }
  },
  {
    "code": "NR 8888",
    "subject": "NR",
    "id": "8888",
    "title": "Thesis Credit:Doct*",
    "info": "(no description)",
    "prereqInfo": "prereq: Max 18 cr per semester or summer; 24 cr required. Must be doctoral student with advisor's consent to register.",
    "prereq": {
      "course": []
    }
  }
]