[
    {
        "code": "OSUR 5257",
        "subject": "OSUR",
        "id": "5257",
        "title": "Amb Gen Anes",
        "info": "Clinical rotation involving experience in outpatient management and using intravenous sedation and general anesthesia.\n\nprereq: Participation in oral and maxillofacial surgery training program.",
        "prereq": []
    },
    {
        "code": "OSUR 5276",
        "subject": "OSUR",
        "id": "5276",
        "title": "Medicine Rotn",
        "info": "Clinical rotation at Fairview-University Medical Center under the direction of the Internal Medicine Department.  Involves workup, admission, and daily management of patients on medical service, specifically cardiology and pulmonary.\n\nprereq: Participation in oral and maxillofacial surgery training program.",
        "prereq": []
    },
    {
        "code": "OSUR 5277",
        "subject": "OSUR",
        "id": "5277",
        "title": "Physical Dx",
        "info": "Six-week didactic course coupled with evaluation of patients.\n\nprereq: Participation in oral and maxillofacial surgery training program.",
        "prereq": []
    },
    {
        "code": "OSUR 8250",
        "subject": "OSUR",
        "id": "8250",
        "title": "OMS Rotation",
        "info": "Rotations at assigned oral and maxillofacial surgery clinics and operating rooms at Fairview-University Medical Center, Hennepin County Medical Center, Veterans Administration Medical Center.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8251",
        "subject": "OSUR",
        "id": "8251",
        "title": "OMS Core Curric",
        "info": "Standardized curriculum of fundamental concepts of surgery and medicine.  Fourteen core curriculum topics covered in a two-year cycle.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8253",
        "subject": "OSUR",
        "id": "8253",
        "title": "Case Pres Chf Conf",
        "info": "Topic-oriented journal reviews. Guest oral surgeons, specialists, or chief resident present topics in case-based format.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8254",
        "subject": "OSUR",
        "id": "8254",
        "title": "OMS Res Presents",
        "info": "Contemporary subjects researched and presented by current residents.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8255",
        "subject": "OSUR",
        "id": "8255",
        "title": "Gen Surg Rotn",
        "info": "Clinical rotation on general surgery, neurosurgery, and surgical intensive care unit at Hennepin County Medical Center. Seminars, clinics, and operating room experience.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8256",
        "subject": "OSUR",
        "id": "8256",
        "title": "Contemp Anes Lit Rv",
        "info": "Seminar presentation format of current publications that address anesthesia management for the oral and maxillofacial surgery patient.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8258",
        "subject": "OSUR",
        "id": "8258",
        "title": "Off- Site Hospital Rotation",
        "info": "Clinical rotation at North Memorial Medical Center under instruction of Oral and Maxillofacial surgeons to receive new or additional training/experience in the areas of management of traumatic head and neck injuries, pathology of the head and neck to include malignant and non-malignant disease, reconstruction of major facial defects, infections of the head and neck, and management complex facial deformities.\n\nprereq: Participation in Oral and Maxillofacial Surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8260",
        "subject": "OSUR",
        "id": "8260",
        "title": "Surg Rounds for OMS",
        "info": "Pre- and post-operative case discussions of patients currently being managed for surgery at all affiliated institutions. As they relate to individual patients, discussions involve medical, anesthesia, surgical, and management of post-surgical and sequela complications.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8262",
        "subject": "OSUR",
        "id": "8262",
        "title": "Plastic Surg Rotn",
        "info": "Clinical rotation at HealthPartners St. Paul Ramsey Medical Center under direction of plastic and reconstructive surgery faculty. Elective or trauma cosmetic and esthetic surgery experience.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    },
    {
        "code": "OSUR 8267",
        "subject": "OSUR",
        "id": "8267",
        "title": "Anes Rot for OMS",
        "info": "Clinical rotation at Fairview University Medical Center under direction of anesthesia faculty. After a suitable period of supervision determined by anesthesia faculty, residents are assigned their own anesthesia room and are given responsibility for pre-operative patient evaluation and inter-operative management of patient's general anesthetic.\n\nprereq: Participation in oral and maxillofacial surgery training program",
        "prereq": []
    }
]