[{"code":"OUE 1001","subject":"OUE","id":"1001","title":"Mastering Skills for College","info":"Practical assistance to students in developing efficient and effective learning and academic performance skills, improving reading speed and comprehension, increasing memorization and test-taking skills, managing test anxiety, identifying academic and career goals, and using advanced technology in university learning. Students identify individual academic strengths and weaknesses and formulate a plan for skill development through individualized learning projects. Addresses student learning styles, attitudes, and motivations and their relation to successful academic performance. Class focuses on transition to college, a good option for first year, transfer, international, and returning students.","prereqInfo":null,"prereq":{"course":[]}},{"code":"OUE 1086","subject":"OUE","id":"1086","title":"The First Year Experience","info":"Awareness of roles, identity, needs, and interactions with diverse groups. Expectations, resources, and challenges associated with transition into college. Speakers, journals/portfolios, technology, reading/writing assignments, classroom exercises/experiences..","prereqInfo":"prereq: 1st-yr student athletes","prereq":{"course":[]}},{"code":"OUE 1087","subject":"OUE","id":"1087","title":"The First Year Experience","info":"Awareness of roles, identity, needs, and interactions with diverse groups. Expectations, resources, and challenges associated with transition into college. Speakers, journals/portfolios, technology, reading/writing assignments, classroom exercises/experiences.","prereqInfo":"Prereq: 1st-yr student athletes","prereq":{"course":[]}},{"code":"OUE 1101","subject":"OUE","id":"1101","title":"Academic Refresher","info":"Identifying factors interfering with academic performance, selecting strategies, and establishing a plan to promote academic success. Learning-style, educational goals, life management skills, motivation, attitude. ","prereqInfo":"Class intended to support students who are experiencing academic barriers during the first half of the semester.","prereq":{"course":[]}},{"code":"OUE 1102","subject":"OUE","id":"1102","title":"Academic Success","info":"Assistance in identifying barriers in academic performance and developing plans for effective scholarship. Skill development, performance enhancement. Objectives achieved through didactic instruction, assignments, behavioral monitoring.","prereqInfo":"Course designed for students who are on academic probation, returning from suspension, or have experienced significant academic barriers.","prereq":{"course":[]}},{"code":"OUE 1830","subject":"OUE","id":"1830","title":"Undergraduate Topics Course","info":"Topics courses offered by the Office of Undergraduate Education. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"OUE 1909W","subject":"OUE","id":"1909W","title":"Freshman Seminar","info":"Freshman seminar.","prereqInfo":null,"prereq":{"course":[]}},{"code":"OUE 1910W","subject":"OUE","id":"1910W","title":"Freshman Seminar","info":"Freshman seminar. Topics vary by semester.","prereqInfo":null,"prereq":{"course":[]}},{"code":"OUE 2001","subject":"OUE","id":"2001","title":"Acad Planning and Exploration","info":"Undecided and competitive-major students engage in academic and career decision-making process. Students develop an exploratory action plan to help them discover/declare a best-fit major matching their interests, values, and academic skills. Customized course assignments include self-assessment, reflective essays, and an action plan project.","prereqInfo":null,"prereq":{"course":[]}},{"code":"OUE 3000","subject":"OUE","id":"3000","title":"Special Topics","info":"See topics course for course-specific description. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"OUE 3050","subject":"OUE","id":"3050","title":"Peer Education","info":"Peer cooperative learning. Factors that enhance effectiveness of group learning, including facilitating learning process, integrating learning skill development/content knowledge acquisition, application of appropriate theories of learning.","prereqInfo":null,"prereq":{"course":[]}},{"code":"OUE 3051","subject":"OUE","id":"3051","title":"Introduction to Peer Tutoring","info":"Introduces Peer Learning Consultants to field of peer tutoring. Educational, theories, research, informed practice, social/political tensions. Enhance understanding of academic field of peer education.","prereqInfo":null,"prereq":{"course":[]}},{"code":"OUE 3205","subject":"OUE","id":"3205","title":"Law School Exploration","info":"This is a course for those interested in law school. It offers an overview of applying to and attending law school, as well as exploration of careers and specialties within the field of law. Discover how your strengths, values, and interests prepare you for and make you competitive in the field of law.","prereqInfo":"Assignments include informational interviews and research into law school and the legal field that allow you to examine the reality of attending law school and becoming a lawyer.","prereq":{"course":[]}},{"code":"OUE 3311","subject":"OUE","id":"3311","title":"Leadership Development","info":"This course will provide an opportunity for student orientation leaders to translate theory to practice, using the University of Minnesota Orientation and Welcome Week experience as a learning laboratory. Students will build upon existing self-awareness to further examine their identity, biases, and strengths through the use of critical reflective models and leadership theory concepts. Guest lecturers will share expertise on the topics of leadership, communication, and diversity. Course participants will gain an advanced level of leadership self-awareness and responsibility vital to creating an inclusive and welcoming environment for incoming students and their families.","prereqInfo":null,"prereq":{"course":[]}}]