[{"code":"PLSC 3002","subject":"PLSC","id":"3002","title":"Seed Sci, Technology, Society","info":"Cultivate an understanding of seed and appreciation for seed with respect to agriculture. Focus of this course will be on agronomic crop seeds produced in the upper Midwest.","prereqInfo":"prereq: HORT 1001 or BIOL 1009 or BIOL 2002 or consent of the instructor","prereq":{"course":[{"code":"HORT 1001","subject":"HORT","id":"1001"},{"code":"BIOL 1009","subject":"BIOL","id":"1009"},{"code":"BIOL 2002","subject":"BIOL","id":"2002"}]}},{"code":"PLSC 3005W","subject":"PLSC","id":"3005W","title":"Intro to Plant Physiology","info":"Introduction to physiological basis for effects of environment on plant growth/development. How to produce optimal plant growth. Experimental technique, data analysis, scientific writing. Lecture, readings, lab. Prerequisites: Biol 1009 or Hort 1001 and BioC 3021 or Hort 2100 or BioC 2011","prereqInfo":null,"prereq":{"course":[]}},{"code":"PLSC 3093","subject":"PLSC","id":"3093","title":"Directed Study","info":"A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"PLSC 3094","subject":"PLSC","id":"3094","title":"Directed Research","info":"An opportunity in which a student designs and carries\nout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use the\nUniversity-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"PLSC 3401","subject":"PLSC","id":"3401","title":"Plant Genetics and Breeding","info":"Principles of plant genetics and environmental variation. Applications of genetics to crop evolution and breeding of self-pollinated, cross-pollinated, and asexually propagated crops. Investigation of hybridization, variation, and selection. Course is offered with two alternating instructors: Spring Odd its with Eric Watkins. Spring Even is with Aaron Lorenz. ","prereqInfo":"Prerequisites: BIOL 1009 or 1009H","prereq":{"course":[{"code":"BIOL 1009","subject":"BIOL","id":"1009"},{"code":"PLSC 1009H","subject":"PLSC","id":"1009H"}]}}]