[
  {
    "code": "PMED 1005",
    "subject": "PMED",
    "id": "1005",
    "title": "Orientation to Health Sciences",
    "info": "Health sciences majors/professions. Students assess their own interests, values, and abilities as they integrate/process information to move toward a decision regarding major/career.",
    "prereq": []
  },
  {
    "code": "PMED 5100",
    "subject": "PMED",
    "id": "5100",
    "title": "Overview Rehab Sci",
    "info": "History and future of physical rehabilitation, health-care models, epidemiology of physical disorders, research on treatment outcomes, measurement issues, clinical evaluation of traditional vs. non-traditional rehabilitation strategies.",
    "prereq": []
  },
  {
    "code": "PMED 5214",
    "subject": "PMED",
    "id": "5214",
    "title": "Clin Practice of PT",
    "info": "Clinical visitation.",
    "prereq": []
  },
  {
    "code": "PMED 5215",
    "subject": "PMED",
    "id": "5215",
    "title": "Clin Ed",
    "info": "First of three-course sequence. Emphasizes sensitivity to needs of patients, families, and health-care coworkers. Patient handling techniques, communication skills, awareness of cultural differences, psychological aspect of disability, and use of community resources.",
    "prereq": []
  },
  {
    "code": "PMED 5217",
    "subject": "PMED",
    "id": "5217",
    "title": "Clin Ed III",
    "info": "Third of three-course sequence. Sensitivity to needs of patients, families, and health-care coworkers. Patient handling techniques, communication skills, awareness of cultural differences, psychological aspects of disability, use of community resources. Offered summer session.",
    "prereq": []
  },
  {
    "code": "PMED 5223",
    "subject": "PMED",
    "id": "5223",
    "title": "Electrother",
    "info": "Theory and technique of movement analysis and treatment using electrophysiological testing and therapeutic devices.",
    "prereq": []
  },
  {
    "code": "PMED 5231",
    "subject": "PMED",
    "id": "5231",
    "title": "Clinical Biomechanics",
    "info": "Forces/structures internal/external to body responsible for normal/abnormal human movement. Analysis techniques, independent assignments. Muscle function, palpation, posture. Gait of normal individuals, analysis to detect deviation from norm.",
    "prereq": []
  },
  {
    "code": "PMED 5255",
    "subject": "PMED",
    "id": "5255",
    "title": "Clin Ed",
    "info": "Five-week, full-time internship. Select and perform physical therapy evaluation techniques, interpret results, define rationale for physical therapy service, develop a care plan, implement treatment program, and communicate patient/client care process as a physcial therapy professional.",
    "prereq": []
  },
  {
    "code": "PMED 5260",
    "subject": "PMED",
    "id": "5260",
    "title": "Prof Issues in PT",
    "info": "Current professional issues, dilemmas, and trends in health care.  Evaluation and treatment skills in physical therapy specialty areas.",
    "prereq": []
  },
  {
    "code": "PMED 5284",
    "subject": "PMED",
    "id": "5284",
    "title": "Musculoskeletal II",
    "info": "Problem-solving approach to evaluating, treating, and preventing selected musculoskeletal conditions across life span. Chart review, history taking, strength testing, functional testing, gait/posture examination, special orthopedic tests. Therapeutic exercises, orthopedic ambulation, joint mobilization, splinting, patient education. Second of two-course sequence.",
    "prereq": []
  },
  {
    "code": "PMED 5287",
    "subject": "PMED",
    "id": "5287",
    "title": "Neurorehab I",
    "info": "Assessment/rehabilitation of patients with neurological conditions (e.g., cerebral vascular disease traumatic brain injury, multiple sclerosis, Parkinson's disease, spinal cord injury). Using treatment procedures, orthotics, and equipment to improve function and prevent, stabilize, or decrease impairments. Integrative evaluation assignments with clinical clerkship.",
    "prereq": []
  },
  {
    "code": "PMED 5288",
    "subject": "PMED",
    "id": "5288",
    "title": "Neurorehab II",
    "info": "Pediatric assessment/rehabilitation for neurological, orthopedic, cardiac, prematurity, transplant, and behavioral conditions. Preparation for adult assessment/treatment with neurological, general medical, and vascular disease. Students use etiologic knowledge to assess patients in clinic and establish treatment plans and goals.",
    "prereq": []
  },
  {
    "code": "PMED 5290",
    "subject": "PMED",
    "id": "5290",
    "title": "Admin Teach Prac",
    "info": "Learning experiences and special assignments related to physical therapy administration.",
    "prereq": []
  },
  {
    "code": "PMED 6000",
    "subject": "PMED",
    "id": "6000",
    "title": "Special Topics Transition DPT",
    "info": "Selected pathology, assessment, and rehabilitation of musculoskeletal conditions. Industrial consultation, post fracture management, imaging, surgical options for selected conditions of spine/extremities. Required musculoskeletal case study from clinical internships.\n\nprereq: Enrolled in Physical Therapy MS program",
    "prereq": []
  },
  {
    "code": "PMED 6001",
    "subject": "PMED",
    "id": "6001",
    "title": "Clin Intern V",
    "info": "Students must demonstrate proficiency in communication skills, team participation, and evaluation and treatment skills; predict outcomes and  manage a variety of patient diagnoses/problems consistently with good and safe judgment; and have successfully completed all previous clinical education experiences.",
    "prereq": []
  },
  {
    "code": "PMED 7410",
    "subject": "PMED",
    "id": "7410",
    "title": "Rehabilitation Med for Adults",
    "info": "The student learns to evaluate a patient with chronic illness and/or a disability and then helps plan a rehabilitation team's problem-oriented approach to total patient management. Medical student responsibility includes inpatient work-ups and management as well as the opportunity to participate in a variety of specialty clinics.",
    "prereq": []
  },
  {
    "code": "PMED 7411",
    "subject": "PMED",
    "id": "7411",
    "title": "PhysicalMed Elec",
    "info": "Acquaints the fourth-year student with the outpatient evaluation and management of both children and adults with disabilities. Medical student responsibilities include inpatient work-ups and management as well as the opportunity to participate in a variety of specialty clinics.\n\nprereq: enrolled med sr",
    "prereq": []
  },
  {
    "code": "PMED 7412",
    "subject": "PMED",
    "id": "7412",
    "title": "Rehab Medicine: Ortho, Neuro",
    "info": "This course is designed for students who are interested in pursuing residency in Physical Medicine and Rehabilitation, Orthopedics, Neurology. Student-physicians will be responsible for inpatient work-ups and management as well as having the opportunity to participate in a variety of specialty clinics (EMG and Botox, traumatic brain injury, spinal cord injury, amputee, musculoskeletal pain, cardiac rehab) and inpatient consults.",
    "prereq": []
  },
  {
    "code": "PMED 7413",
    "subject": "PMED",
    "id": "7413",
    "title": "Rehab Med for Adults - Virtual",
    "info": "This Physical Medicine and Rehabilitation virtual clinical rotation was developed in response to the COVID-19 pandemic to ensure medical students an opportunity to learn about the field of Physical Medicine and Rehabilitation while unable to participate in hands-on clincial education.  This innovative elective is centered on learner engagement, simulation of clinical experiences, and the importance of building relationships with faculty and residents.  Medical students will participate in telehealth appointments with faculty and virtually follow standardized patients from consultation to discharge building their own plan of care and walking through that plan with senior residents that have a distinct set of learning objectives in place.  Medical students will participate in interactive journal clubs, lectures, and didactic education with faculty and residents via Zoom on a daily basis.  Virtual office hours with faculty and residents will provide students an opportunity to learn more about the field, the varied education and career paths taken, and to build meaningful relationships within the Department.  To supplement the live education, an entire library of video presentations was built by Department faculty and affiliate faculty across the Twin Cities. This ensures students always have access to foundational material as well as the opportunity to delve deeper into their unique areas of interest. This virtual curriculum provides students a quality, robust, learning experience that serves as a great introduction to the field of Physical Medicine and Rehabilitation. ",
    "prereq": []
  },
  {
    "code": "PMED 7415",
    "subject": "PMED",
    "id": "7415",
    "title": "Phys Med and Rehab for Gen",
    "info": "Provide patient management in rehabilitation. Evaluate/plan management for disease processes. Plan for continuing care of chronically ill. Work on interdisciplinary team of health care professionals. Write Rx for PT/OT. Develop an accurate exam of joints/muscles. Concept of holistic medicine. Students evaluated by faculty based on participation, clinical skills, attitude. Case presentation, participation in weekly conferences.",
    "prereq": []
  },
  {
    "code": "PMED 7416",
    "subject": "PMED",
    "id": "7416",
    "title": "Pediatric Rehab Medicine",
    "info": "Student works on inpatient service, outpatient clinics working with pediatric patients with traumatic brain injury, cerebral palsy, ventilatory dependent children, spinal cord injury, and developmental disabilities.",
    "prereq": []
  },
  {
    "code": "PMED 7417",
    "subject": "PMED",
    "id": "7417",
    "title": "PhysicalRehab Res",
    "info": "This elective provides an opportunity for the interested student to pursue a clinical or laboratory problem related to physical medicine and rehabilitation. ",
    "prereq": []
  },
  {
    "code": "PMED 7418",
    "subject": "PMED",
    "id": "7418",
    "title": "Rehab Med: Trauma, Med-Spine",
    "info": "Adult rehabilitation management emphasizing traumatic brain injury, major multiple trauma, acute and chronic burns, musculoskeletal ultrasound, stroke, ALS, and EMG.",
    "prereq": []
  },
  {
    "code": "PMED 7420",
    "subject": "PMED",
    "id": "7420",
    "title": "Rehabilitation Med Research",
    "info": "PM&R is an underrepresented field in terms of academic contribution to clinical research.  ",
    "prereq": []
  },
  {
    "code": "PMED 7421",
    "subject": "PMED",
    "id": "7421",
    "title": "Acting Intern Rehab Medicine",
    "info": "This course is designed for students who plan to pursue their residency training in physical medicine and rehabilitation that already have prior experience (clinical, shadowing, research) and would like to dive deeper into the field of PM&R to prepare themselves for residency. Student-physicians will be responsible for inpatient work-ups and management as well as having the opportunity to participate in a variety of specialty clinics (amputee, Botox, EMG, general rehab, musculoskeletal, pain, spinal cord injury, traumatic brain injury) and inpatient consults. As part of this advanced rotation, students will take an active role in designing a rotation to fit their individualized needs. They will also be expected to perform at the level of an intern in addition to preparing and giving a 20-minute mini-grand rounds presentation on a rehabilitation topic to the PM&R staff & residents at the end of the rotation. At the conclusion of the four weeks, students will be able to: take a PM&R oriented history; perform a physical examination with an emphasis on functional status and disability; formulate rehabilitation goals and treatment plan; more fully understand the full breadth of PM&R; effectively communicate with an interdisciplinary team; facilitate complex discharge plans; prepare and provide sign out for on-call physicians; be prepared to take on leadership roles during their residency training and advocate for people with cognitive and/or physical impairments.  \n\nprereq: Prior PMED rotation or special approval from course director",
    "prereq": []
  },
  {
    "code": "PMED 7910",
    "subject": "PMED",
    "id": "7910",
    "title": "Phys Med Rehab Med Residency",
    "info": "Physical medicine and rehabilitation medical residency.",
    "prereq": []
  },
  {
    "code": "PMED 7930",
    "subject": "PMED",
    "id": "7930",
    "title": "Phys Med Rehab Med Fellowship",
    "info": "Physical medicine and rehabilitation medical fellowship.",
    "prereq": []
  },
  {
    "code": "PMED 8101",
    "subject": "PMED",
    "id": "8101",
    "title": "SemII Musc Rehab",
    "info": "Science of musculoskeletal rehabilitation; associated research methodologies.",
    "prereq": []
  },
  {
    "code": "PMED 8102",
    "subject": "PMED",
    "id": "8102",
    "title": "SemIII - NeuroRehab",
    "info": "Problems in neurorehabilitation; associated research methodologies.",
    "prereq": []
  },
  {
    "code": "PMED 8103",
    "subject": "PMED",
    "id": "8103",
    "title": "PT Clinic",
    "info": "Adult and pediatric rehabilitation.",
    "prereq": []
  },
  {
    "code": "PMED 8193",
    "subject": "PMED",
    "id": "8193",
    "title": "Research Problems",
    "info": "Designing a research project to answer scientific question in physical therapy, collecting data, analyzing data, interpreting results, and defending the work to an examining committee.",
    "prereq": []
  },
  {
    "code": "PMED 8200",
    "subject": "PMED",
    "id": "8200",
    "title": "Phys Med/Rehabil Service",
    "info": "N/A\n\nprereq: enrolled in PMed residency training program",
    "prereq": []
  },
  {
    "code": "PMED 8207",
    "subject": "PMED",
    "id": "8207",
    "title": "Basic and Applied Psychiatry",
    "info": "N/A\n\nprereq: enrolled in PMed residency training program",
    "prereq": []
  },
  {
    "code": "PMED 8210",
    "subject": "PMED",
    "id": "8210",
    "title": "Research in Physical Med",
    "info": "N/A\n\nprereq: enrolled in PMed residency training program",
    "prereq": []
  },
  {
    "code": "PMED 8212",
    "subject": "PMED",
    "id": "8212",
    "title": "Electromyography",
    "info": "N/A\n\nprereq: enrolled in PMed residency training program",
    "prereq": []
  },
  {
    "code": "PMED 8214",
    "subject": "PMED",
    "id": "8214",
    "title": "Readings in Electromyography",
    "info": "N/A\n\nprereq: enrolled in PMed residency training program",
    "prereq": []
  },
  {
    "code": "PMED 8220",
    "subject": "PMED",
    "id": "8220",
    "title": "Sem: Physical Med/Rehab",
    "info": "TBD\n\nprereq: enrolled in PMed residency training program",
    "prereq": []
  }
]