[
  {
    "code": "RHET 1385",
    "subject": "RHET",
    "id": "1385",
    "title": "Contemporary Arts",
    "info": "Visual and performing arts in the Twin Cites: art museums and galleries, theaters, and concert halls. One weekly lecture with a lab for contemporary arts events. Optional practicum--a trip to New York City.",
    "prereq": []
  },
  {
    "code": "RHET 3101",
    "subject": "RHET",
    "id": "3101",
    "title": "Functional Photography",
    "info": "Basic photographic communication. Emphasizes techniques of producing 35mm color transparencies for use in presentations/publications. Students provide their own camera/film.",
    "prereq": []
  },
  {
    "code": "RHET 3102",
    "subject": "RHET",
    "id": "3102",
    "title": "Digital Photography",
    "info": "Introduction to digital photography. Selecting/using a digital camera. Going digital with a film camera. Editing digital images. Printing/publishing digital images.",
    "prereq": []
  },
  {
    "code": "RHET 3335",
    "subject": "RHET",
    "id": "3335",
    "title": "Rural & Urban Images In Film",
    "info": "Country and city life as described in motion pictures, American and international. The \\\"country mouse/city mouse\\\" conflict from ancient literature to the present. Examine the rhetoric of film as an art form with its own criteria of excellence.",
    "prereq": []
  },
  {
    "code": "RHET 5533",
    "subject": "RHET",
    "id": "5533",
    "title": "STC Teaching Seminar",
    "info": "Mentor with faculty, usually concurrently with student's first teaching assignment. Students shares observations, solves teaching problems in seminar setting. Issues facing new teachers, developing a philosophy of teaching. Focuses on evaluating work in classroom.",
    "prereq": []
  },
  {
    "code": "RHET 5562",
    "subject": "RHET",
    "id": "5562",
    "title": "Theo&Prac:Intern'l Bus Comm",
    "info": "Theories and practice in international and intercultural scientific, technical, and business communication. Examine cultural differences by studying cultural metaphors and research studies, by interviewing people from other cultures including international business managers, and through case studies.",
    "prereq": []
  }
]