[
  {
    "code": "RHUM 1001",
    "subject": "RHUM",
    "id": "1001",
    "title": "Intro to Sci/Tech Comm Major",
    "info": "History of technical communication, its connection to rhetoric. Technical writing, speaking, multimedia, and their applications in science/technology fields (e.g., health science, computer science, agriculture). Portfolios, professional organizations, publications. Guest speakers, discussion, activities.",
    "prereq": []
  },
  {
    "code": "RHUM 3108W",
    "subject": "RHUM",
    "id": "3108W",
    "title": "Gender/Rhetoric of Sci/Tech",
    "info": "How cultural gender roles are affected by science/technology. Influence of gender roles on scientific/technological thinking (e.g., communication strategies, language, image). Values/goals of past/present scientific technological communities.",
    "prereq": []
  },
  {
    "code": "RHUM 3221W",
    "subject": "RHUM",
    "id": "3221W",
    "title": "Theories: Human Communication",
    "info": "Through lecture, discussion, simulations, and small group work students become familiar with theories and practices of interpersonal, small group, organizational, and scientific, and technical communication.",
    "prereq": []
  },
  {
    "code": "RHUM 3257",
    "subject": "RHUM",
    "id": "3257",
    "title": "Scientific/Tech Presentation",
    "info": "Oral presentation skills for scientific or technical topics. Visual communication, audience analysis, organizing a presentation, presenting complex material. Emphasizes use of computers. ",
    "prereq": []
  },
  {
    "code": "RHUM 3266",
    "subject": "RHUM",
    "id": "3266",
    "title": "Group Process: Team Leadership",
    "info": "Group processes, team building from perspective of managers/leaders. Communication techniques in small group decision making process. Theories of team/small-group communication. Case studies. Group project for each student.",
    "prereq": []
  },
  {
    "code": "RHUM 3270",
    "subject": "RHUM",
    "id": "3270",
    "title": "Special Topics",
    "info": "Special Topics in Rhetoric.",
    "prereq": []
  },
  {
    "code": "RHUM 3371",
    "subject": "RHUM",
    "id": "3371",
    "title": "Technology, Self, and Society",
    "info": "Culture of technology. Social/personal meanings technology holds. Issues of power, work, identity, and our relation to nature. Mass production/consumption, industrialization of agriculture, changes in art/design, effects of modern transportation/communication technologies.",
    "prereq": []
  },
  {
    "code": "RHUM 3401",
    "subject": "RHUM",
    "id": "3401",
    "title": "Internet Comm:Tools and Issues",
    "info": "Current/developing tools of internet-based communication. Concepts of e-mail, usenet news, mailing lists, Web-based chats, MOOs, and internet relay chat. Emphasizes technology examination, assessment of information delivered, and criteria development for information dissemination.",
    "prereq": []
  },
  {
    "code": "RHUM 3562W",
    "subject": "RHUM",
    "id": "3562W",
    "title": "Tech & Professional Writing",
    "info": "Written/oral communication in professional settings. Gathering information, analyzing audience, assessing conventional formats. Drafting, testing, revising documents. Oral presentation of final reports.",
    "prereq": []
  },
  {
    "code": "RHUM 3671",
    "subject": "RHUM",
    "id": "3671",
    "title": "Project Design and Dev I",
    "info": "Introduction to design principles, visual display of data, and management of publications (e.g., newsletters, brochures, scientific posters). Computer software to aid in design and in project management. Two-semester sequence.",
    "prereq": []
  },
  {
    "code": "RHUM 3672",
    "subject": "RHUM",
    "id": "3672",
    "title": "Project Management & Design II",
    "info": "Second course in sequence, following 3671.  Students study, plan, research, design, and develop technical communication print documents, including documentation, brochures, and newsletters. Introduction to workplace project processes. Emphasizes developing production-quality documents.",
    "prereq": []
  },
  {
    "code": "RHUM 3701",
    "subject": "RHUM",
    "id": "3701",
    "title": "Rhet Theory & Sci & Tech Comm",
    "info": "Principles/history of rhetorical theory/criticism. Emphasizes classical theories, especially \\\"Aristotle's Rhetoric.\\\" Applying Aristotelian concepts to examples of contemporary communication. Relationship of classical theory to scientific discourse and to technical communication.",
    "prereq": []
  },
  {
    "code": "RHUM 4105",
    "subject": "RHUM",
    "id": "4105",
    "title": "Corporate Video for Tech Comm",
    "info": "Introduction to products, professionals, and processes of corporate video.  Students analyze corporate video; submit a proposal, treatment and script; maintain a journal; complete an interactive unit on production; and conduct research on a video-related topic of their choice.",
    "prereq": []
  },
  {
    "code": "RHUM 4165",
    "subject": "RHUM",
    "id": "4165",
    "title": "Managerial & Organization Comm",
    "info": "Emphasizes action research in scientific or technical settings. Organization/management theory for consultative tasks.",
    "prereq": []
  },
  {
    "code": "RHUM 4196",
    "subject": "RHUM",
    "id": "4196",
    "title": "Internship in Sci & Tech Comm",
    "info": "Internship sites may include the University, industry, or government agencies.  An internship proposal, progress report, internship journal (optional), and final report with letter from the internship supervisor is required.",
    "prereq": []
  },
  {
    "code": "RHUM 4501",
    "subject": "RHUM",
    "id": "4501",
    "title": "Usability Testing",
    "info": "Principles/concepts of human factors/usability testing. Text-based, expert-based, reader-based, and prototype-based user testing. Developing objectives, criteria, and measures. Conducting tests in lab, field, and virtual environments. Using software programs to analyze qualitative/quantitative data.",
    "prereq": []
  },
  {
    "code": "RHUM 4561",
    "subject": "RHUM",
    "id": "4561",
    "title": "Editing/Style for Tech Comm",
    "info": "Editorial process, levels of style, ethical considerations. Cohesion, clarity, coherence, organization, audience. Writer-editor relationship. Editor's marks. Copyright issues. ",
    "prereq": []
  },
  {
    "code": "RHUM 4573",
    "subject": "RHUM",
    "id": "4573",
    "title": "Writing Prop and Grant Mgmt",
    "info": "Research funding sources. Interpreting an RFP or program announcement. Letters of intent. Grant preparation following guidelines of an RFP or program announcement. Proposals for nonprofits or research or business proposals. Uses Microft Project.",
    "prereq": []
  },
  {
    "code": "RHUM 4662",
    "subject": "RHUM",
    "id": "4662",
    "title": "Emerging Tech in Communication",
    "info": "Focus on creating multimedia, hypertext, online help, and Internet documents.  Learn linear & nonliner design; linking; reading and editing online.  Principles of technical communication taught through projetcs; scripts, online support, and using mark-up language.",
    "prereq": []
  },
  {
    "code": "RHUM 5111",
    "subject": "RHUM",
    "id": "5111",
    "title": "Message Design:Theory & Prac I",
    "info": "Audience analysis, media selection, message design through various theoretical perspectives, including cognitive/schema, social construction, feminist, intercultural theories. Usability testing, contextual inquiry as means to study effectiveness of messages.",
    "prereq": []
  },
  {
    "code": "RHUM 5112",
    "subject": "RHUM",
    "id": "5112",
    "title": "Message Design II",
    "info": "Political, economic, social, and technical dimensions of media selection and message design.  Apply theories of message design and media selection to an online design project.  Media analyses, scripts, budgets, treatments, project design plans, and various interactive screens.",
    "prereq": []
  },
  {
    "code": "RHUM 5258",
    "subject": "RHUM",
    "id": "5258",
    "title": "Info Gathering Tech: STC",
    "info": "Questionnaire development, informational interviewing, focus group interviewing. Guides, schedules, questioning techniques, communication theories in employment cycle interviews. Descriptive statistics used to analyze data.",
    "prereq": []
  },
  {
    "code": "RHUM 5511",
    "subject": "RHUM",
    "id": "5511",
    "title": "Research in Sci & Tech Comm",
    "info": "Experimental and survey research techniques for both quantitative and qualitative methodolgies in Scientific and Technical Communication.  Face-to-face, telephone and focus group interviewing; questionnaire development; contextual inquiry; using rating, ranking and q-sort methods.  Ethics, experiemental bias, and inferential statistical analysis will be discussed.",
    "prereq": []
  },
  {
    "code": "RHUM 5562",
    "subject": "RHUM",
    "id": "5562",
    "title": "Theo & Prac:Intern'l Bus Comm",
    "info": "International, intercultural scientific, technical, and business communication. Cultural differences studied through metaphors/research, interviews of people from other cultures (e.g., international business managers), and case studies.",
    "prereq": []
  }
]