[
  {
    "code": "RM 1170",
    "subject": "RM",
    "id": "1170",
    "title": "Topics in Retail Merchandising",
    "info": "In-depth investigation of specific topic, announced in advance.",
    "prereq": []
  },
  {
    "code": "RM 1201",
    "subject": "RM",
    "id": "1201",
    "title": "Fashion, Ethics, & Consumption",
    "info": "Apparel business. Overview of steps in the process of creating, merchandising, selling, and consuming apparel. Various ethical positions reflected in manufacturer, retailer, and consumer decision making are considered.",
    "prereq": []
  },
  {
    "code": "RM 1203",
    "subject": "RM",
    "id": "1203",
    "title": "Computer Literacy",
    "info": "Concepts/competencies in computer applications used to solve problems in social sciences and business.",
    "prereq": []
  },
  {
    "code": "RM 2196",
    "subject": "RM",
    "id": "2196",
    "title": "Work Experience",
    "info": "Supervised work experience in business, industry, or government, related to student's area of study. Integrative paper or project.\n\nprereq: Plan submitted/approved by [adviser, internship supervisor], written approval of supervisor, instr consent",
    "prereq": []
  },
  {
    "code": "RM 2215",
    "subject": "RM",
    "id": "2215",
    "title": "Intro to Retail Merchandising",
    "info": "This course is designed to introduce concepts involved in the retail business and provide a high-level overview into all aspects of managing, planning and executing within this environment. Concepts include omni channel/multichannel retailing, digital retailing, consumer behavior, buying, inventory planning, supply chain, pricing, financial planning, human resources, store locations, store layout, and visual merchandising.",
    "prereq": []
  },
  {
    "code": "RM 2234",
    "subject": "RM",
    "id": "2234",
    "title": "Retailing in a Digital Age",
    "info": "Students will explore and evaluate the impact of emergence of retail technology on the retail industry and consumers as well as on the society at large. Changes in the retail business and consumer behaviors will be examined in relation to emerging technologies. Both benefits and concerns related to digital retailing will be discussed.",
    "prereq": []
  },
  {
    "code": "RM 3124",
    "subject": "RM",
    "id": "3124",
    "title": "Consumers of Design",
    "info": "Contemporary approaches to consumer behavior. Focus is on understanding why people buy certain products/services by reviewing the examples found in the design-related industry, including apparel. This course discusses various psychology related theories to understand internal and external influences shaping consumer decisions.",
    "prereq": []
  },
  {
    "code": "RM 3170",
    "subject": "RM",
    "id": "3170",
    "title": "Topics in Retail Merchandising",
    "info": "In-depth investigation of specific topic.",
    "prereq": []
  },
  {
    "code": "RM 3196",
    "subject": "RM",
    "id": "3196",
    "title": "Field Study: Natl/Intl",
    "info": "Faculty-directed field study in national or international setting.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "RM 3201",
    "subject": "RM",
    "id": "3201",
    "title": "Career & Internship Prep",
    "info": "Research career opportunities related to retail industry, set career objectives based on an assessment of individual skills/interests, and identify job search skills to implement a transition from college to employment.\n\nprereq: Retail merchandising major",
    "prereq": []
  },
  {
    "code": "RM 3242",
    "subject": "RM",
    "id": "3242",
    "title": "Retail Buying",
    "info": "Principles/mathematics of merchandise inventory control, merchandise selection.\n\nprereq: [2215 or DHA 2215]; [MATH 1031 or MATH 1051 or MATH 1142 or MATH 1151 or MATH 1155 or MATH 1271 or CALG student group]; [jr or sr]; retail merchandising [major or minor] or instr consent",
    "prereq": [
      {
        "or": [
          {
            "code": "RM 2215",
            "subject": "RM",
            "id": "2215"
          },
          {
            "code": "DHA 2215",
            "subject": "DHA",
            "id": "2215"
          }
        ]
      },
      {
        "or": [
          {
            "code": "MATH 1031",
            "subject": "MATH",
            "id": "1031"
          },
          {
            "code": "MATH 1051",
            "subject": "MATH",
            "id": "1051"
          },
          {
            "code": "MATH 1142",
            "subject": "MATH",
            "id": "1142"
          },
          {
            "code": "MATH 1151",
            "subject": "MATH",
            "id": "1151"
          },
          {
            "code": "MATH 1155",
            "subject": "MATH",
            "id": "1155"
          },
          {
            "code": "MATH 1271",
            "subject": "MATH",
            "id": "1271"
          }
        ]
      }
    ]
  },
  {
    "code": "RM 3243",
    "subject": "RM",
    "id": "3243",
    "title": "Visual Merchandising",
    "info": "Retail store environment. Physical/psychological effects that initiate/motivate consumer behavior. Merchandise display: creativity, department layout, fixturing, lighting, cross merchandising, visual resources, signing, maintenance.\n\nprereq: 2215 or instructor consent",
    "prereq": {
      "code": "RM 2215",
      "subject": "RM",
      "id": "2215"
    }
  },
  {
    "code": "RM 3244",
    "subject": "RM",
    "id": "3244",
    "title": "Virtual Reality Retailing",
    "info": "Students will use a virtual 3D store modeling software package, to conceptualize and design store interior, layout, fixtures, lighting, signs, merchandising planograms based on an understanding of visual merchandising foundational knowledge.",
    "prereq": []
  },
  {
    "code": "RM 4117W",
    "subject": "RM",
    "id": "4117W",
    "title": "Omnichannel Environments",
    "info": "Theory and research related to shopper behavior in omnichannel retail environments.",
    "prereq": []
  },
  {
    "code": "RM 4123",
    "subject": "RM",
    "id": "4123",
    "title": "Consumer Society",
    "info": "Consumerism within U.S. society. Commodification of health care, education, and production of news. Commercialization of public space/culture. What drives consumer society. How meaning is manufactured. What the lived experiences are of consumers today. Postmodern market. Alternatives to consumer society.\n\nprereq: Sr, retail merchandising major or minor",
    "prereq": []
  },
  {
    "code": "RM 4193",
    "subject": "RM",
    "id": "4193",
    "title": "Dir Study in Retail",
    "info": "Independent study in retail merchandising under tutorial guidance.\n\nprereq: Undergrad, instr consent",
    "prereq": []
  },
  {
    "code": "RM 4196",
    "subject": "RM",
    "id": "4196",
    "title": "Internship",
    "info": "Supervised work experience in the retail industry, business, or related field of study, plus related assignments.",
    "prereq": []
  },
  {
    "code": "RM 4212W",
    "subject": "RM",
    "id": "4212W",
    "title": "Dress, Society, and Culture",
    "info": "Contemporary dress from diverse cultures within/outside USA analyzed using social science concepts. Dress as nonverbal communication system.\n\nprereq: [Jr or sr or grad student], [design major or minor or instr consent]",
    "prereq": []
  },
  {
    "code": "RM 4216",
    "subject": "RM",
    "id": "4216",
    "title": "Retail Promotions",
    "info": "Role of integrated marketing communications in retail businesses. Promotion techniques/media characteristics. Application of theories behind consumer decision making.\n\nprereq: 2215, [jr or sr or grad student], [DHA major or minor or instr consent]",
    "prereq": {
      "code": "RM 2215",
      "subject": "RM",
      "id": "2215"
    }
  },
  {
    "code": "RM 4217",
    "subject": "RM",
    "id": "4217",
    "title": "International Retail Markets",
    "info": "Operating a retail business in foreign countries. How international markets differ from U.S. market. Effects of sociocultural systems within foreign countries. Theories of international trade. Interface between countries and firms. Strategic alternatives for global retail operations.\n",
    "prereq": []
  },
  {
    "code": "RM 4218",
    "subject": "RM",
    "id": "4218",
    "title": "Fashion and Culture",
    "info": "Relationship of fashion/dress/culture to time/place. Design. Fashion centers, fashion industry, globalization. Chinese fashion industry as case study.\n\nprereq: Upper division undergraduate or grad student.",
    "prereq": []
  },
  {
    "code": "RM 4234",
    "subject": "RM",
    "id": "4234",
    "title": "Dig. Retail Analytics & Soc. M",
    "info": "In this digital era, a large volume of digital footprints of users is being generated. The characteristics of users and their behaviors are tracked through various digital media such as websites, social media, and mobile platforms. Using quantitative methods to measure and analyze this “big data” has become crucial as it allows retailers and marketers to make informed decisions concerning consumer behavior. This course is designed to prepare students to become leaders in the digital retail world by leveraging various digital metrics and insights related to sales, reach, customers, to make strategic business decisions.\n",
    "prereq": []
  },
  {
    "code": "RM 4235",
    "subject": "RM",
    "id": "4235",
    "title": "Data Driven Retail",
    "info": "This hands-on course is designed to introduce basic concepts and techniques for big data text analysis and apply them in retail context. Students learn the theoretical basis for natural language processing and text analysis and understand how various analysis methods are used to draw insights from unstructred text data. Students also learn the basics of Python and practice using the Python codes to analyze data such as word frequency analysis, sentiment analysis, semantic network analysis, topic modeling, and Concor",
    "prereq": []
  },
  {
    "code": "RM 4247",
    "subject": "RM",
    "id": "4247",
    "title": "Advanced Buying and Sourcing",
    "info": "This course is designed to familiarize students with the decisions involved in running a retail business and the concepts and principles for making those decisions. Major topics covered include sourcing, factory production and operations, supply chain management, translating trends into designs, managing merchandise assortments, merchandise planning systems, buying and sourcing, retail pricing and building a six month financial plan. MS-Excel for solving strategic problems in retail buying.\n",
    "prereq": []
  },
  {
    "code": "RM 4248",
    "subject": "RM",
    "id": "4248",
    "title": "Creative Leadership",
    "info": "Theory/research on creative leadership. Opportunities to apply knowledge to contemporary issues facing practicing retail leaders.",
    "prereq": []
  },
  {
    "code": "RM 5170",
    "subject": "RM",
    "id": "5170",
    "title": "Topics in Retail",
    "info": "In-depth investigation of single specific topic, announced in advance.",
    "prereq": []
  }
]