[
    {
        "code": "SACS 7474",
        "subject": "SACS",
        "id": "7474",
        "title": "Urinary System Disease",
        "info": "Expands on disorders of small animal urinary system. Introduction to core and additional disorders.",
        "prereq": []
    },
    {
        "code": "SACS 7505",
        "subject": "SACS",
        "id": "7505",
        "title": "Directed Studies",
        "info": "Students conduct a special project addressing a specific issue in veterinary medicine under the guidance of a faculty member.",
        "prereq": []
    },
    {
        "code": "SACS 7638",
        "subject": "SACS",
        "id": "7638",
        "title": "Sm. An. Cardiol.",
        "info": "Students actively participate in the clinical evaluation and management of cardiopulmonary disease.  Students perform physical examinations, electrocardiograms, and echocardiograms in addition to interpreting radiographs and participating in group case discussions.",
        "prereq": []
    },
    {
        "code": "SACS 7648",
        "subject": "SACS",
        "id": "7648",
        "title": "Sm. An. Clin. Oncol",
        "info": "Students will have an integral, hands-on role in the Clinical Oncology Service of the VTH, admitting new cases, and participating in diagnostic and staging work-ups.  Students will have the opportunity to perform routine diagnostic procedures, such as, ultrasound-guided aspirations and core biopsies, bone marrow biopsies, and lymph node biopsies.  In addition, students will participate in the monitoring and treatment of ongoing chemotherapy and radiation therapy patients.  Students will be expected to prepare short presentations on selected topics relating to important issues in clinical and comparative oncology.  Faculty will lead discussions relating to cancer biology, immunology, epidemiology, pathology, and principles of chemotherapy and radiation therapy.  Rounds will be held daily, Monday thru Friday.  Students will have evening, weekend and/or holiday case responsibility, as needed.",
        "prereq": []
    },
    {
        "code": "SACS 7705",
        "subject": "SACS",
        "id": "7705",
        "title": "Indep Study Vet Med",
        "info": "Independent study, by arrangement, in a clinical area of veterinary medicine.",
        "prereq": []
    },
    {
        "code": "SACS 7710",
        "subject": "SACS",
        "id": "7710",
        "title": "Analysis of Urinalysis",
        "info": "Improving one's ability to properly interpret various abnormalities detected by routine urinalysis will be the focal point of this course.  Key concepts will be illustrated with clinical case material.",
        "prereq": []
    },
    {
        "code": "SACS 7715",
        "subject": "SACS",
        "id": "7715",
        "title": "Ind Res Vet Anes",
        "info": "",
        "prereq": []
    },
    {
        "code": "SACS 7720",
        "subject": "SACS",
        "id": "7720",
        "title": "Sm Anim Ortho Rad",
        "info": "Roetgen signs of common bone diseases of small animals.",
        "prereq": []
    },
    {
        "code": "SACS 7722",
        "subject": "SACS",
        "id": "7722",
        "title": "Lag Anim Ortho Rad",
        "info": "Roentgen signs of common bone diseases of large animals.  Emphasizes the horse.",
        "prereq": []
    },
    {
        "code": "SACS 7730",
        "subject": "SACS",
        "id": "7730",
        "title": "Comp An Onc",
        "info": "The principles of veterinary oncology will be reviewed and the biologic behaviors, treatments, and prognosis of various neoplastic disorders will be discussed.",
        "prereq": []
    },
    {
        "code": "SACS 7732",
        "subject": "SACS",
        "id": "7732",
        "title": "Clin Vet Derm Path",
        "info": "Microscopic pathology of basic dermatologic reactions and of variable disease states.",
        "prereq": []
    },
    {
        "code": "SACS 7740",
        "subject": "SACS",
        "id": "7740",
        "title": "Vet Derm Residency",
        "info": "Rotations in Veterinary Dermatology Clinics, and review of dermatopathology slides.  Rotations through Veterinary Internal Medicine and Human Dermatology Service (Medical School) and dermatology journal club.",
        "prereq": []
    },
    {
        "code": "SACS 7748",
        "subject": "SACS",
        "id": "7748",
        "title": "Comp An Oncology",
        "info": "",
        "prereq": []
    },
    {
        "code": "SACS 7770",
        "subject": "SACS",
        "id": "7770",
        "title": "Sm. An. Roentgenol.",
        "info": "Roentgeneology signs of common bone diseases of small animals.",
        "prereq": []
    }
]