[{"code":"SDNY 1101","subject":"SDNY","id":"1101","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 1102","subject":"SDNY","id":"1102","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 1103","subject":"SDNY","id":"1103","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 1104","subject":"SDNY","id":"1104","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 1105","subject":"SDNY","id":"1105","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 1201","subject":"SDNY","id":"1201","title":"Integrated Course","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 1202","subject":"SDNY","id":"1202","title":"Integrated Course","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 1203","subject":"SDNY","id":"1203","title":"Integrated Course","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 1204","subject":"SDNY","id":"1204","title":"Integrated Course","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3001","subject":"SDNY","id":"3001","title":"Contemporary Australia","info":"Australia's identity, how it has evolved from \\\"whites only\\\" immigration policy after WWII to embracing its position in Pacific Rim. Role of Native Australians, Government's relationship with that community. Australia's role in new global reality.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3002","subject":"SDNY","id":"3002","title":"Art Down Under","info":"Works of art produced during the last centur. Controversial contemporary Aboriginal art. Major 20th century art movements in relation to advances in technology, historical events, and sociological changes.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3003","subject":"SDNY","id":"3003","title":"Australian Cinema","info":"Personal/collective identity via film narratives. Extent to which Australian films reflected/determined Australian identities. What it means to be Australian. Concepts of national identity, imagined community.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3004","subject":"SDNY","id":"3004","title":"International Business & Trade","info":"Establishment/growth of Australia's contemporary economic structure. How it relates to history of Australia's relationship with Asia. Dynamic of Australian economy, policies it faces. Changing context of Australia's identity and its political/economic policies toward Asia. Role of wars. Labor market. Immigration.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3005","subject":"SDNY","id":"3005","title":"Native Aust Impact on Envirmnt","info":"Physical impact Native Australians have had on Australia's environment, past/present. Cultural relationship between Native Australians and natural world. Origins of Native Australian people. Fire and its impact on Australian vegetation. Contemporary Native Australian strategies for conservation and population increase. Paleoenvironmental reconstruction.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3006","subject":"SDNY","id":"3006","title":"Learning Through Internships","info":"Internship course for Sydney program.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3007","subject":"SDNY","id":"3007","title":"The Aboriginal Experience","info":"Trends in contemporary Australian society. Emphasizes struggles of indigenous peoples.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3008","subject":"SDNY","id":"3008","title":"Understanding Australia","info":"Sociological analysis of peoples, movements, and contemporary issues. Perspectives between culture and society. Constructions of Australian identity. Notions of ethnicity, gender, migration, crime, and the media.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3009","subject":"SDNY","id":"3009","title":"Human Resource Management","info":"How Australian and Pacific Rim companies are attempting to achieve competitive advantage in domestic/international markets through HRM. Structural changes HRM is undergoing in Singapore, Hong Kong, and Japan. Increased responsibility of line managers for HRM. Talent/performance/industrial relations management.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3010","subject":"SDNY","id":"3010","title":"International Marketing","info":"Why organizations expand activities across national boundaries. Which markets to enter, methods of entry, management/control implications. Australian case studies.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3011","subject":"SDNY","id":"3011","title":"Gov & Politics- Pac Rim Contxt","info":"History, concepts, and structures of politics/government in Australia. Debates, problems, and changes in relation to Pacific Rim. Discussing these issues critically.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3012","subject":"SDNY","id":"3012","title":"Intercultural Communication","info":"Communication between people from different racial, ethnic, and cultural backgrounds within Australia, including Aboriginal, and immigrant populations. Theory/research in intercultural communication. Improving human interaction in study-abroad environment and international contexts.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3013","subject":"SDNY","id":"3013","title":"The Global City: Sydney","info":"This course is designed to encourage students to engage in a critical analysis of the development of modern cities, Sydney in particular. It will trace Sydney’s development from a \\\"colonial outpost\\\" into the \\\"thriving metropolis\\\" it is today. The course will examine how the forces of colonization, migration, modernization, and globalization have affected the city and its inhabitants. Students will gain insights into the changing dynamics and identities of its inhabitants, and will also look at the forces, which have shaped Sydney’s relationship with the rest of the world. The course is organized thematically, with each theme examining different aspects of the city. It begins with an introduction to the city, then a discussion of Sydney as a colonial city, moving into an analysis of its identities, impact of migration and finally its commerce, cityscape and urban future. The course ultimately intends to help students contextualize their travels and encounters in the city, and will help them develop informed interpretations of Sydney while they are here.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3014","subject":"SDNY","id":"3014","title":"Aboriginal Hist - Colonization","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3015","subject":"SDNY","id":"3015","title":"International Marketing","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3016","subject":"SDNY","id":"3016","title":"Australian, Asian, Pacific Lit","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3017W","subject":"SDNY","id":"3017W","title":"Writing the City - Sydney","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3018","subject":"SDNY","id":"3018","title":"Advertising and Promotions","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3019","subject":"SDNY","id":"3019","title":"Advertising and Society","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3020","subject":"SDNY","id":"3020","title":"Indigenous Peoples & Modernity","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3021","subject":"SDNY","id":"3021","title":"International Finance","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3022","subject":"SDNY","id":"3022","title":"International Economics","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3023","subject":"SDNY","id":"3023","title":"Int'l Organizational Behavior","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3024","subject":"SDNY","id":"3024","title":"Global Workforce Management","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3025","subject":"SDNY","id":"3025","title":"Managing Global Supply Chains","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3026","subject":"SDNY","id":"3026","title":"People, Place and Culture","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3027","subject":"SDNY","id":"3027","title":"Investment Management","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3028","subject":"SDNY","id":"3028","title":"Gender, Culture and Society","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3029","subject":"SDNY","id":"3029","title":"Campaigning for Change","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3030","subject":"SDNY","id":"3030","title":"Project Management Practicum","info":"The Project Management Practicum enables students to apply the principles and practices of project management learned in the Project Management course to a project conducted in an organization by working through the design, implementation, monitoring, completion and evaluation stages of project management for the project. This practicum will run in a primarily concurrent fashion with the Project Management coursethe two combine for a total of 90 hours during the intensive program. The two courses ( Project management course/Project Management Practicum) plus an internship form a track, however each course can be separately taken.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3031","subject":"SDNY","id":"3031","title":"Skills & Challenges Proj Mgmt","info":"The project management course is designed as an introductory program specifically targeting students who intend to pursue careers in which the management of projects and/or programs is an area of responsibility. The course is designed to provide potential project managers with a systematic, structured framework and processes for the management of projects through the design, implementation, monitoring, completion and evaluation stages of project management.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3032","subject":"SDNY","id":"3032","title":"Sports in Australian Society","info":"Sports hold a central role in the development of the Australian character and identity, through the interaction with the expanse of the new environment of the early settlers, evolving during the colonial era of the nineteenth century. Sports helped forge and provide a focus for Australian nationalism whether that be individual achievements or as a team, projecting Australians internationally on the global sporting stage. This course studies sports in Australian culture; the historical context through to its importance in todays Australian society; sports as a reflection of the masculine mono culture; Australian identity of 19th Century and early 20th Century through to diversity of modern Australia multi-culturalism; and indigenous recognition and social structures will be studied. Themes covered in this course include volunteerism, gender, race, ethnicity, sexuality, amateurism and professionalism, globalization, integrity in sports (drugs in sports, influence of gambling on results, gene manipulation, and bio medical enhancements), trends and challenges of the future of sports, including doping in sports, rise of corporatization of sports, innovation and technology impact on sports, and the impact on Australian sports of the current Asian Century.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3033","subject":"SDNY","id":"3033","title":"Sports Management","info":"This course provides undergraduate students with the critical understanding of the theories, concepts, knowledge and skills for mangers in commercialized and community-based sports in the Australian context. The course considers the ranges of challenges facing the 21st-Century sports manager including a complex sociocultural environment, competitive business markets, managing a range of key stakeholders, the future of sports management, and strategic planning to meet future sporting organizations objectives. The course also evaluates how public policy, sports governance, and legislative requirements impact the management of sporting organizations. Finally, the course examines the wider social utility of sport in Australia, such as its role in community and the forming of national identity, as an opportunity for social improvement and general community well-being.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3034","subject":"SDNY","id":"3034","title":"Sports Marketing","info":"This course examines in detail the various techniques and strategies of sports marketing. The issue of professionalism and the corporatization of sport will be addressed. The focus on the necessity of securing various revenue streams including sponsorships, investment opportunities, government grants and fundraising potential of individuals, teams, clubs and facilities in the broad arena of sport. Students will examine the promotion of sports through various channels, including traditional media and the rise of digital marketing in its various forms. The ability to develop and implement marketing strategies and plans to present to individuals or organizations will be based around practical application using Australian case studies.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3035","subject":"SDNY","id":"3035","title":"Australasia Films Imagination","info":"The classic American horror film is derived from a gothic heritage, an inheritor of a European context and its tropes: the disintegration of civilization through wars, disease, economic collapse, and associated social traumas. The horror that the current, post-9/11 generation has produced is notably different; it plays upon central themes that derive from an Australasian context, driven by the recent horror films of Australia, Japan, and Korea. These influential films have been made and distributed outside of an American context but then repackaged for the West in remakes and variations that awaken an American audience to themes of horror that are decidedly non-European in substance. This course will examine these films, comparing and contrasting European and Australasian tropes for horror as well as their reflection of and impact on society.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3036","subject":"SDNY","id":"3036","title":"Race & Ethnicity in Sydney, US","info":"This course examines and compares race and ethnicity in Australia and the U.S. Similarities and differences in racial/ethnic historic and current conditions, causes, consequences, and policies in the two countries will be identified. By the end of the course, students will have greater understanding of the role of race and ethnicity in determining group and individual opportunities, restrictions, and life experiences. Students will become aware of the continuing importance of cultural and political factors in the salience of race/ethnicity in the two societies. Solutions for racial problems will also be emphasized.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3037","subject":"SDNY","id":"3037","title":"Australia in Glob/Pol Context","info":"This course examines the government and politics of Australia and Australian engagement in the Asia-Pacific region. It does so by surveying similarities with and differences from the North American democratic model and by examining Australia’s substantial and abiding interests in the Asia-Pacific region. By the end of the course, students will be aware of the importance of geographical distance and location in the Australian story. Students will also be aware of the continuing importance of cultural and political inheritance in the development of Australian public and foreign policy. Students will be encouraged to make comparisons with the US system of government and politics.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3038W","subject":"SDNY","id":"3038W","title":"Immigration: People Moving","info":"This course will explore the causes and consequences of migration for communities, personal identities, national identities, politics, ethics, and the environment. The various reasons for people-moving and moving people across borders will be examined, as will the myths and controversies involved. How notions of belonging, citizenship, nationality, nationhood, and ‘the other’ are constructed, proliferated, and manipulated will be key themes throughout the course. Case studies will be drawn from both Australian and international examples, which field trips will supplement. Grades will be based on class and online participation, evidence of reading and independent research, and assessments both written and oral. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3039","subject":"SDNY","id":"3039","title":"Abnormal Psychology","info":"This course provides a contemporary overview of the psychological, biological, and experiential factors thought to influence human mental disorders. It will address questions such as What is “abnormal”? What causes mental illness and how do we treat them? Each week students will explore a different disorder (for example, depression, anxiety, eating disorders, schizophrenia) and discuss the symptoms, causes, and empirically supported treatments.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3041","subject":"SDNY","id":"3041","title":"Resilient Cities","info":"This course is an introductory course on urban resilience and concepts in sustainability and its principles and the sustainable development of cities in the global, regional, and local contexts. The course will cover the environmental, socio-economic, and structural problems of contemporary cities and their consequences on natural systems and built communities. It provides a framework to examine the challenges of urbanism, issues facing cities, and an opportunity to evaluate and explore “solutions.”","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3042W","subject":"SDNY","id":"3042W","title":"Writing for the Environment","info":"This course focuses on writing in response to the natural environment, primarily as a tool to raise awareness of environmental challenges and to advocate for ways to meet those challenges. We’ll read a variety of voices and styles of advocacy writing, always with a strong focus on the craft of language: How does the writing reach its target and accomplish its goal? What makes the writing persuasive?","prereqInfo":"Students will practice several modes of advocacy writing, via several shorter assignments, and the writing will be a central text of the course; that is, we will investigate and critique student writing in much the same we do the assigned published pieces. Students will devote much of the second half of the term to researching and writing a first-person article and presentation focusing on a specific environmental problem and advocating for a potential solution/s. \n","prereq":{"course":[]}},{"code":"SDNY 3043W","subject":"SDNY","id":"3043W","title":"Sports as Soft Power","info":"This course examines sports as soft power (persuasion, influence, and attraction) in the attempt to bridge communities and cultures and on the local, national, and global stages. Case studies demonstrate the attraction and effectiveness of sports as a communication strategy utilized by local, national, and international governments and NGOs as part of a strategic communication plan, as well as its role in spontaneous grassroots movements. Critical to our studies is the appreciation that sport may challenge/reinforce social and cultural values at the local, national, and international levels. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3044","subject":"SDNY","id":"3044","title":"Innovation & Entrepreneurship","info":"This unit introduces you to the nature and characteristics of entrepreneurship and innovation and explores the interrelationship between the two within global and contemporary economies. The nature of enterprise behavior and the characteristics of entrepreneurs in both large and small organizations in Asia-Pacific and Western-based organizations are examined, as are the policy issues associated with encouraging enterprise and innovation within the wider community. The fundamentals of opportunity recognition and screening of new venture ideas are examined from both a local and global perspective.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3045","subject":"SDNY","id":"3045","title":"New Prod. & Service Innovation","info":"In increasingly competitive global markets, innovation in new product and service development has become a key success factor in delivering growth for the firm. However, despite a global push by organizations to foster innovation in new product development, many new products and services continue to fail. This highlights the need for managing the creative and commercialization process in new product and service development to optimize in-market success, across global markets.\nThe focus of this unit is to inspire creativity in reframing problems that open disruptive opportunities and inspire novel product and service ideas that cross geographic boundaries. It also explores how to measure purchase intent amongst the desired target audience, identify predictive models of sales forecasting, develop prototyping, and prepare for a successful commercial launch.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3046","subject":"SDNY","id":"3046","title":"Australia & World: Pol. & IR","info":"This course examines the government and politics of Australia and Australian engagement in the Asia-Pacific region. It does so by surveying similarities with and differences from the North American democratic model and by examining Australia’s substantial and abiding interests in the Asia-Pacific region. By the end of the course, you will be aware of the importance of geographical distance and location in the Australian story. You will also be aware of the continuing importance of cultural and political inheritance in the development of Australian public and foreign policy. You will be encouraged to make comparisons with the US system of government and politics.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3047","subject":"SDNY","id":"3047","title":"Global Health Post Cov-19","info":"COVID-19 has been described as a “once-in-a-generation’ global emergency that has reverberated all aspects of global health practice. This course is designed to increase your awareness and appreciation for the deep and emerging ways in which individual countries and the global community have responded. We will examine the impact of the virus and its management on communications, communities, and health and development systems. Comparisons between the US, Australia, Italy, and China will be made to directly relate learning to your local setting as well as contrasting responses internationally. This will be a Globally Networked Learning experience with experts drawn from Australia, Italy, and China. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3048","subject":"SDNY","id":"3048","title":"Locating Social Inequality","info":"This course focuses on the experiences of cultural and socio-economic difference in Sydney, and through global comparative analyses. This includes applied social science approaches to inequality, diversity, community, sense of place, and environmental sustainability in the urban setting. There is an emphasis upon spatial literacy for social scientists (fieldwork, mapping, data analysis, and place description). ","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3101","subject":"SDNY","id":"3101","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3102","subject":"SDNY","id":"3102","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3103","subject":"SDNY","id":"3103","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3104","subject":"SDNY","id":"3104","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3105","subject":"SDNY","id":"3105","title":"Univ. of Tech. Sydney Course","info":"This is a course shell that will be used on the Study & Intern in Sydney study abroad program to represent a course taken at the University of Technology Sydney. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3201","subject":"SDNY","id":"3201","title":"Integrated Course","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3202","subject":"SDNY","id":"3202","title":"Integrated Course","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3203","subject":"SDNY","id":"3203","title":"Integrated Course","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3204","subject":"SDNY","id":"3204","title":"Integrated Course","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3375","subject":"SDNY","id":"3375","title":"Global Internship: Sydney","info":"3 Credit Course Option:\nThe Global Internship Course (GIC) provides a unique and innovative opportunity for students to engage in an internship (and living abroad experience) while supported by academic in-class and online educational sessions to further develop their personal and professional skills while earning academic credit. GIC students also partake in out-of-class guided and self-guided activities and excursions that have been devised to enable students to become more comfortable with, and knowledgeable of, their internship locations/neighbourhoods. Field studies vary depending on location and may also include a focus on, for example, corporate social responsibility and sustainability.\nThe GIC fits in with CAPA’s philosophy and practice of enabling students to learn about the social and cultural context of their internship placement and the host region and country, as well as other GIC themes, through comparative global analysis. At times, this analysis will be facilitated through a small selection of CAPA Masterclasses given by leading professionals from a diverse range of fields. The in-class active learning approach gives students the opportunity to discuss and analyze theories and models of work, organizational behavior, and management in a cross-cultural context.\nA variety of teaching and learning activities will be used, for example: lecture, workshop, discussion, informal and formal presentations, self-guided and guided research, and mock (recorded) interviews. The assessment mechanisms are all designed to support learning, using the internship and living abroad experience as a vehicle. Above all, the in-class CAPA sessions give students the opportunity to listen to individual experiences, compare and contrast activities ","prereqInfo":"6 Credit Course Option\nThe Global Internship Course (GIC) provides a unique and innovative opportunity for students to engage in an internship (and living abroad experience) while supported by academic in-class and on-line educational sessions to further develop their personal and professional skills while earning academic credit.  GIC students also partake in out-of-class guided and self-guided activities and excursions that have been devised to enable students to become more comfortable with, and knowledgeable of, their internship locations / neighbourhoods. Field studies vary depending on location and may also include a focus on, for example, corporate social responsibility and sustainability. \nThe GIC fits in with CAPA's philosophy and practice of enabling students to learn about the social and cultural context of their internship placement and the host region and country, as well as other GIC themes, through comparative global analysis. At times, this analysis might be facilitated through a small selection of CAPA Masterclasses given by leading professionals from a diverse range of fields. The in-class active learning approach gives students the opportunity to discuss and analyze theories and models of work, organizational behavior and management in a cross-cultural context such as Australia's historical place within a pan Asian market.\nA variety of teaching and learning activities will be used, for example: lecture, workshop, discussion, informal and formal presentations, self-guided and guided individual and team research, and mock (recorded) interviews. The assessment mechanisms are all designed to support learning, using the internship and living abroad experience as a vehicle.  Above all, the in-class and supplementary on-line CAPA sessions give students the opportunity to listen to individual experiences, compare and contrast activities with others, and consider the experience in terms of their personal and professional development – at the beginning we focus on self-reflection, and at the end of this process we challenge each student to focus on self-projection. At its core, GIC provides an opportunity for students to unpack, synthesis and articulate (the value of) their learning.\n","prereq":{"course":[]}},{"code":"SDNY 3500","subject":"SDNY","id":"3500","title":"CAPA Seminar in Sydney","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3501","subject":"SDNY","id":"3501","title":"Telling the Story - Sydney","info":"Study abroad course","prereqInfo":null,"prereq":{"course":[]}},{"code":"SDNY 3895","subject":"SDNY","id":"3895","title":"Directed Research Project","info":"Study abroad course.","prereqInfo":null,"prereq":{"course":[]}}]