[{"code":"SLHS 1301V","subject":"SLHS","id":"1301V","title":"Phys/Biol of Voice Honors","info":"The goal of this course is to provide students with a background of the core physical, linguistic, and perceptual concepts related to speech. This course talks about the acoustics of speech as well as the main principles that are used to describe articulation and phonetics. We will examine the aerodynamic and acoustic principles that underlie sound production. The course also covers basics of auditory perception and how computers can be used to analyze and manipulate speech. Through an emphasis on physical analysis grounded in scientific principles, this course satisfies the university's physical sciences with laboratory liberal education requirement.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1301W","subject":"SLHS","id":"1301W","title":"Physics and Biology of Voice","info":"The goal of this course is to provide students with a background of the core physical, linguistic, and perceptual concepts related to speech. This course talks about the acoustics of speech as well as the main principles that are used to describe articulation and phonetics. We will examine the aerodynamic and acoustic principles that underlie sound production. The course also covers basics of auditory perception and how computers can be used to analyze and manipulate speech. Through an emphasis on physical analysis grounded in scientific principles, this course satisfies the university's physical sciences with laboratory liberal education requirement.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1302","subject":"SLHS","id":"1302","title":"Judgments of Human Behavior","info":"This 3-credit course meets the UMN liberal education requirements in the area of mathematical thinking. As specified on the university web site, the courses that were approved to fulfill the liberal education requirements aim to “guide you through the ‘why’ and ‘how’ of different academic disciplines” and to “equip you with a broad range of tools that you can use to approach problems in your everyday life and work, and ultimately to make a positive difference in your communities, your society, your state, and your world.” This course was initially developed by Professors Peggy Nelson and Leslie Glaze, and its contents have been substantially revised by Professor Yang Zhang to meet the requirements of the college curriculum review committee. Current materials for the course are based in part on a course at another Big Ten University, Ohio State, which was originally developed by Professor Mary EBeckman.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1401","subject":"SLHS","id":"1401","title":"Intro to SLP and Audiology","info":"In this course students will be provided an introduction to the diverse field of speech-language pathology and audiology. Case studies, documentaries, and patient testimonials will be used to orient students to the clinical significance of impairments that contribute to deficits in cognition, communication, and deglutition. Students will gain an understanding of associated assessments and interventions to mitigate these deficits from experts practicing in the field. Lastly, students will be introduced to career paths in speech language pathology and audiology, as well as their associated practice setting and remuneration specifications.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1402","subject":"SLHS","id":"1402","title":"Talking Brain","info":"How the brain produces/understands speech/language, including various aspects of the nervous system involved in producing/understanding speech/language. Differences in brain structure/function among individuals with and without brain injury, based on scientific versus historical, mass media and literature portrayals.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1902","subject":"SLHS","id":"1902","title":"Freshman Seminar","info":"Topics vary. See class schedule.","prereqInfo":"prereq: freshman","prereq":{"course":[]}},{"code":"SLHS 1905","subject":"SLHS","id":"1905","title":"Freshman Seminar","info":"Freshman seminar.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1911","subject":"SLHS","id":"1911","title":"Diversity Social Communication","info":"Social communication is the process of interacting with others to send a message. It includes speech, language, and nonverbal communication such as eye contact and gestures. Social communication develops from infancy and changes over the lifespan. There are differences in social communication across cultures, generations, genders, and communication disorders. This course will provide students with an understanding of what social communication is and how it develops, how it relates to speech and language, how it differs from person to person, and how speech-language pathologists and other professionals evaluate and treat social communication impairments. The course will focus on neurodiversity related to autism as well as on cultural self-awareness and building cultural competence.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1912","subject":"SLHS","id":"1912","title":"Music and Language","info":"Music and language are fascinating products of the human brain, which most uniquely define us as human beings. Every human culture has its own form of music and language with historical roots dated as early as about 40,000 years ago. Understanding music and language involves complex processes converting sound sequences into meaningful units and structures. This seminar compares music and language in all aspects of structure and use. We will highlight modern brain research studies on the associations and disassociations between music and language. We will also study how infants acquire their linguistic and emotional expressive power and how the early learning experience alters the brain, thereby affecting an individual’s future perceptions and actions. Both historical perspectives and current research including musical therapy for speech and language intervention will be introduced and discussed.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1913","subject":"SLHS","id":"1913","title":"Language & Communication Techn","info":"The interdisciplinary field of speech-language - hearing sciences has been at the forefront of driving technological changes in our modern society.  In this seminar, we will study the history of language technology and the relationship between language and technology that have shaped and continue to shape our day-to-day lives. We will discuss the social impact of technological developments from the invention of writing systems to the cutting-edge applications of brain-computer interface. We will also examine the ethical implications of advances in language and communication technologies. Topics include signs and symbols, script decipherment, automatic speech recognition and synthesis, text-to-speech systems,  human-machine dialog systems,  machine translation,  hearing aid and cochlear implant as well as assistive technologies that support users with language and communication disabilities. Students will have opportunities to watch in-class short videos and demos, conduct speech analysis and synthesis labs, evaluate online text-to-speech systems and machine translation systems, an observe brain imaging experiments in small groups. This is an introductory level course that does not require an engineering background or computer programming skills. \n","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1914","subject":"SLHS","id":"1914","title":"Comm Disorder & Neurodiversity","info":"This discussion-based Freshman seminar examines societal perceptions of communication disorders resulting from developmental and acquired causes, including Autism, Aphasia, Motor Speech Disorders, Stuttering, Traumatic Brain Injury, Hearing Impairments, and Voice disorders through group discussions and lectures. Topics for discussion include the evolution and utility of frameworks to understand disabilities and barriers, ableism, neurodiversity, intersectionality, disability policies and accommodations, role of stakeholders. Through each topics, students will gain perspective on the lived experiences of individuals with disabilities and identify characteristics of responsible stakeholders. Instructor-based lectures will be augmented by discussions facilitated by students, guest lectures from topic experts, written assignments, and group projects.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1915","subject":"SLHS","id":"1915","title":"Healthcare through Zoom","info":"For several years, numerous forms of service delivery have been devised and implemented using electronic distance techniques, from the telephone to the internet in managing . Since the pandemic, the number and kind of Allied Health Services has expanded dramatically. However, after pandemic the use of these services will be used in cases where there is a shortage of providers and where large distances exist between clients and clinic.  This seminar will assess the suitable models of technology, evaluate the proper application of these technologies, for different allied health professionals, such as speech-language pathologists, counselors/psychologists, physical therapists, occupational therapists, and nurses.  We will assess the suitable models of technology, evaluate the proper application of these technologies, cultural competencies in the use of this technology, assess the appropriate selection of clients, determine the best modes for delivery of services, recognize the issues related to security, and recognize the legal and ethical issues related to Telehealth.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1916","subject":"SLHS","id":"1916","title":"Singing Through the Centuries","info":"Have you ever wondered how ancient singing voices may have sounded, and what influenced that sound?  From the temple and palace to the auditorium and stadium, how has the singing voice changed over the centuries? We will survey how the singing voice has been influenced by culture, artistic preferences, religious preferences, and technology.  For example, we will explore the chanting of priestesses in ancient Egypt, Tuvan throat singing, grand opera to metal screamers and growlers. The course will begin with a nontechnical description of how the voice is produced.  We will examine literature that describes the singing style of ancient civilizations and imagine how the voice may have sounded and the motivation for that sound. In addition, with available audio recordings we will examine more directly current singing styles and their relationship to culture and technology.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 1942","subject":"SLHS","id":"1942","title":"Freshman Seminar","info":"Topics specified in Class Schedule.","prereqInfo":"prereq: Freshman","prereq":{"course":[]}},{"code":"SLHS 3301","subject":"SLHS","id":"3301","title":"Intro to Acoustics","info":"Elements of acoustics necessary to understand quantitative aspects of speech and hearing science, speech-language pathology, and audiology. Nature of sound, sound transmission, simple harmonic motion, sound  intensity and pressure, complex waves, resonance and filtering, and distortion.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3302","subject":"SLHS","id":"3302","title":"Anat Physio of Speech Hearing","info":"Survey of anatomy and physiology of the auditory and speech production systems, including the nervous, respiratory, laryngeal, velopharyngeal and orofacial subsystems. Emphasis on normal processes and functions.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3303","subject":"SLHS","id":"3303","title":"Language Acquisition & Science","info":"Survey of typical language development, major theoretical perspectives about development, and analyses of children's language.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3304","subject":"SLHS","id":"3304","title":"Phonetics","info":"What is a click sound? Why is it that people who learned to speak English in New York City are more likely to produce the words Mary, merry, and marry differently than people who learned English in Minneapolis? Why does the name 'Beto' produced by a native speaker of English sound so much like the word 'pero' produced by a native speaker of Spanish? How is English-accented Japanese different from Japanese produced by a native speaker? How does one write the sounds of speech using the international phonetic alphabet? Phonetics is the science of speech production. In this course in phonetics, you will develop skills in phonetic transcription, and you will apply those new skills to understanding differences across languages, speech development, dialects, and individual speech styles. By the end of the course, you will be a skilled phonetic transcriber, and you will have used those skills to understand aspects of speech that can't be understood without a knowledge of phonetics. Your new knowledge of the sound structure of human languages will make you a more flexible listener when you encounter new languages, or new varieties of languages you already know. The skills in this course will be taught with a variety of in-person and on-line tools, including lectures, small group work, on-line self-paced modules, and interactive transcription practice.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3305W","subject":"SLHS","id":"3305W","title":"Speech Science","info":"Because speech is the acoustic representation of language, we will examine the time varying acoustic signal –speech production - and the reception, separation and decoding of this signal into language– speech perception.  For this class you will be presented with: (a) the basic principles of acoustics; (2) the physiology that produces the acoustic features that comprise speech; (3) basic theories of speech-motor control; (4) basic principles of speech perception; and (5) overview of current theories of speech perception, especially as they pertain to development of language in the first year of life.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3306","subject":"SLHS","id":"3306","title":"The Sense of Hearing","info":"Have you ever wondered how the sense of hearing works? This course will give you a deep look at the science behind the sense of hearing. You will learn about how sound is created, and transmitted from the air to our ears. Once sound enters our ears, it makes an impressive journey through many stations along the auditory pathway... all the way up to our brains. In addition to the physiological process of sound transmission through the auditory system, this course also covers psychoacoustics measures that provide non-invasive techniques and methods to evaluate the transmission of sound through the auditory system. ","prereqInfo":"prereq: [3302, 3305W] or instr consent","prereq":{"course":[{"code":"SLHS 3302","subject":"SLHS","id":"3302"}]}},{"code":"SLHS 3401","subject":"SLHS","id":"3401","title":"Intro to SLP and Audiology","info":"In this course, students will be provided an introduction to the diverse field of speech-language pathology and audiology. Case studies, documentaries, and patient testimonials will be used to orient students to the clinical significance of impairments that contribute to deficits in cognition, communication, and deglutition. Students will gain an understanding of associated assessments and interventions to mitigate these deficits from experts practicing in the field. Lastly, students will be introduced to career paths in speech language pathology and audiology, as well as their associated practice setting and remuneration specifications.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3402V","subject":"SLHS","id":"3402V","title":"Capstone Proj in SLHS Honors","info":"This final year writing intensive course provides students foundational knowledge on evidence-based practice in the fields of Speech Language Pathology and Audiology. The course has a research and a service learning module. The research module includes lectures and group activities designed to promote critical thinking in evaluating research evidence and will enable students to generate evidence maps to support clinical decision making. The service learning module requires students to complete 20 hours of volunteering with an organization of choice. Reflective writing and research writing activities are designed to enable students to make connections between classroom learning and field work. Students will participate in a final capstone presentation day involving group and individual presentations to showcase their work throughout the semester.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3402W","subject":"SLHS","id":"3402W","title":"Capstone Project in SLHS","info":"This final year writing intensive course provides students foundational knowledge on evidence-based practice in the fields of Speech Language Pathology and Audiology. The course has a research and a service learning module. The research module includes lectures and group activities designed to promote critical thinking in evaluating research evidence and will enable students to generate evidence maps to support clinical decision making. The service learning module requires students to complete 20 hours of volunteering with an organization of choice. Reflective writing and research writing activities are designed to enable students to make connections between classroom learning and field work. Students will participate in a final capstone presentation day involving group and individual presentations to showcase their work throughout the semester.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3555H","subject":"SLHS","id":"3555H","title":"Honors Thesis","info":"Research/writing under direction of faculty member. Details of work are determined in consultation with faculty thesis adviser selected based on availability/topic.","prereqInfo":"prereq: See dir of undergrad studies for [thesis adviser, forms]","prereq":{"course":[]}},{"code":"SLHS 3896","subject":"SLHS","id":"3896","title":"Internship for Academic Credit","info":"An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer.  Typically the students work is supervised and evaluated by a site coordinator or instructor.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3900","subject":"SLHS","id":"3900","title":"Topics:  SLHS","info":"Topics in the discipline of Speech-Language-Hearing Sciences.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 3994","subject":"SLHS","id":"3994","title":"Directed Research","info":"tbd","prereqInfo":"prereq: Undergrad doing research","prereq":{"course":[]}},{"code":"SLHS 3994H","subject":"SLHS","id":"3994H","title":"Honors Directed Research","info":"Honors section of directed research.","prereqInfo":"prereq: Honors undergrad doing research","prereq":{"course":[]}},{"code":"SLHS 4301","subject":"SLHS","id":"4301","title":"Intro Neuro of Human Comm","info":" Basic neuroanatomy and neurophysiology, especially as they relate to normal speech, language, and hearing processes.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 4402","subject":"SLHS","id":"4402","title":"Clinical Methods in SLP","info":"This course illustrates assessment and treatment methods in speech-language pathology. Students will gain a solid foundation for clinical practice with clients across the lifespan and across a range of communication impairments. The course is designed to prepare advanced undergraduate majors in SLHS and entry-level graduate students for entry into clinical settings in speech-language pathology.","prereqInfo":"prereq: [1401 OR 3401, 3302, 3303, 3304, 4301 (either before registration for 4402 or concurrent registration is required (or allowed) in 4402)], or grad student, or instr consent","prereq":{"course":[{"code":"SLHS 1401","subject":"SLHS","id":"1401"},{"code":"SLHS 3401","subject":"SLHS","id":"3401"},{"code":"SLHS 3302","subject":"SLHS","id":"3302"},{"code":"SLHS 3303","subject":"SLHS","id":"3303"},{"code":"SLHS 3304","subject":"SLHS","id":"3304"},{"code":"SLHS 4301","subject":"SLHS","id":"4301"},{"code":"SLHS 4402","subject":"SLHS","id":"4402"},{"code":"SLHS 4402","subject":"SLHS","id":"4402"}]}},{"code":"SLHS 4502","subject":"SLHS","id":"4502","title":"Atypical Speech and Language","info":"Language conveyed through speech.  Normal variation in speech/language that guides understanding of individual differences among speakers will be studied. Breakdowns in speech/language across lifespan in context of cultural/linguistic diversity.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 4602","subject":"SLHS","id":"4602","title":"Comm & Problem Behavior","info":"Social/environmental variables on young children's propensity for problem behavior. Communication strategies that have been validated as a component in reducing problem behavior.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 4603","subject":"SLHS","id":"4603","title":"Communication and Autism","info":"Communication patterns of persons with autism spectrum disorders. Language acquisition, social development. Early identification/intervention strategies. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 4801","subject":"SLHS","id":"4801","title":"Clinical Methods: Auditory","info":"Have you ever wondered why some people have normal hearing and others do not? This course will cover different methods (i.e. visual, behavioral, and physiological measures) that are used to assess auditory function in the outer, middle, inner ear, and beyond. Students will gain a solid introductory foundation on clinical methods that are used and how information gained from different assessment methods are combined to assess overall auditory function. In additional, students will also learn about genetic and non-genetic disorders that impact auditory function.","prereqInfo":"prereq: [3302, 3305W] or instr consent","prereq":{"course":[{"code":"SLHS 3302","subject":"SLHS","id":"3302"}]}},{"code":"SLHS 4802","subject":"SLHS","id":"4802","title":"Clinical Method Hearing Disord","info":"Ever wondered how hearing loss is treated? This course will present an introductory foundation on treatment options for individuals with different types of hearing loss. The three Ts of rehabilitating hearing loss are covered. The first T includes how diagnostic visual, behavioral, and physiological tests results are interpreted and used in the design of treatment plans for individuals with hearing loss. The second T will cover technology that is used to treat hearing loss. This section will provide details on how hearing aids, cochlear implants, and other implantable hearing devices work and how clinical decisions are made with regards to who gets a hearing aid vs. a cochlear implant. Hearing assistive technology and wireless devices such as FM, loop and infrared systems will all be covered. The third T will cover treatment options for adults and children with hearing loss. This section will provide details on informational and personal-adjustment counseling, non-technology treatment options, and person-centered and family-centered intervention and training plans for adults as well as children with hearing loss.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 4803","subject":"SLHS","id":"4803","title":"Hrg Loss,Chil:Rehab","info":"Oral language, listening, and speech production skills in infants and children with hearing losses. The normal developmental processes of speech perception and production, specific methodologies of auditory and speech production training, oral language intervention, and discussion of existing curricula.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5304","subject":"SLHS","id":"5304","title":"Phonetics","info":"Phonetic analysis, transcription of speech. Articulatory correlates of speech sounds. Extensive practice transcribing. Emphasizes narrow transcription of normal adult English, special populations in Speech-Language Pathology. Non-English IPA sounds needed for special populations.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5401","subject":"SLHS","id":"5401","title":"Counseling/Professional Issues","info":"Basic counseling principles and current professional issues related to practice in a dynamic multicultural environment. Application of counseling theory to clinical practice. Analysis of regulation, practice, and future direction of communication disorders.","prereqInfo":"prereq: [[concurrent registration is required (or allowed) in 8720 or concurrent registration is required (or allowed) in 8820], grad student] recommended","prereq":{"course":[{"code":"SLHS 8720","subject":"SLHS","id":"8720"},{"code":"SLHS 8820","subject":"SLHS","id":"8820"}]}},{"code":"SLHS 5501","subject":"SLHS","id":"5501","title":"Fluency & Phono Disorders","info":"Description, nature, and treatment of fluency disorders in children/adults. Involvement in therapeutic/research activities.\n","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5502","subject":"SLHS","id":"5502","title":"Voice & Cleft Palate","info":"Disordered voice and resonance. Presentation and discussion of the nature of etiologies, assessment and management of organic/functional voice disorders and cleft palate to meet clinical competencies for speech-language pathology.","prereqInfo":"prereq: [3305, 4301] or [CDis 3305, CDis 4301] or instr consent","prereq":{"course":[{"code":"SLHS 3305","subject":"SLHS","id":"3305"},{"code":"SLHS 4301","subject":"SLHS","id":"4301"},{"code":"CDIS 3305","subject":"CDIS","id":"3305"},{"code":"CDIS 4301","subject":"CDIS","id":"4301"}]}},{"code":"SLHS 5503","subject":"SLHS","id":"5503","title":"Stuttering Motor Speech Disord","info":"SLHS 5503 is designed for graduate students who wish to increase their understanding of stuttering and motor speech disorders. Its goal is to provide students with a strong foundation on the basics of the physiology, diagnosis, assessment, and treatment of these communication disorders and to provide working knowledge of current trends in related fields.","prereqInfo":"prereq: graduate SLHS student or department permission, [3305, 4301] or instr consent","prereq":{"course":[{"code":"SLHS 3305","subject":"SLHS","id":"3305"},{"code":"SLHS 4301","subject":"SLHS","id":"4301"}]}},{"code":"SLHS 5504","subject":"SLHS","id":"5504","title":"Eval. and Mgmt. of Dysphagia","info":"Normal/disordered aspects of swallowing. Nature, etiologies, evaluation, management of swallowing disorders.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5602","subject":"SLHS","id":"5602","title":"Speech Sound Disorders","info":"Nature, assessment, and treatment of speech sound disorders in children. Assessment and treatment of phonological awareness and pre-literacy skills. This course covers cross-linguistic issues in speech sound disorders, including characteristics of speech sound disorders in a variety of languages, and the differential diagnosis of speech sound disorder from the effects of normal second-language acquisition. Emphasis on functional speech sound disorders, with some coverage given to disorders of a clear organic origin, like cerebral palsy, hearing impairment, and cleft palate.  ","prereqInfo":"prereq: [3303, 3304, 4601] or instr consent","prereq":{"course":[{"code":"SLHS 3303","subject":"SLHS","id":"3303"},{"code":"SLHS 3304","subject":"SLHS","id":"3304"},{"code":"SLHS 4601","subject":"SLHS","id":"4601"}]}},{"code":"SLHS 5603","subject":"SLHS","id":"5603","title":"Assess Child Lang Disorders","info":"Assessment and intervention techniques approaches for treating language impairment in children with disabilities, such as specific language impairment, developmental delays, and autism spectrum disorder.","prereqInfo":"prereq: 3303 or CDis 3303 or equiv or grad student or instr consent","prereq":{"course":[{"code":"SLHS 3303","subject":"SLHS","id":"3303"},{"code":"CDIS 3303","subject":"CDIS","id":"3303"}]}},{"code":"SLHS 5605","subject":"SLHS","id":"5605","title":"Lang/Cog Disorders in Adults","info":"Acquired cognitive and communicative disorders in the adult population specifically including: stroke/aphasia, right hemisphere dysfunction, traumatic brain injury, and dementia. Consideration of neurological substrates, disorder symptomology, assessment, clinical intervention, and functional impact across the lifespan and amongst diverse populations. ","prereqInfo":"prereq: [3302, 4301] or [CDis 3302, CDis 4301] or instr consent","prereq":{"course":[{"code":"SLHS 3302","subject":"SLHS","id":"3302"},{"code":"SLHS 4301","subject":"SLHS","id":"4301"},{"code":"CDIS 3302","subject":"CDIS","id":"3302"},{"code":"CDIS 4301","subject":"CDIS","id":"4301"}]}},{"code":"SLHS 5606","subject":"SLHS","id":"5606","title":"Intro Augm/Alt Communication","info":"Description of the range of augmentative and alternative communication applications for persons with developmental and acquired disabilities. Topics include assessment, intervention strategies, progress monitoring, generalization, and maintenance; collateral behavior resulting from AAC applications.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5607","subject":"SLHS","id":"5607","title":"Electron Comm Aids","info":"Electronic communication aids.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5608","subject":"SLHS","id":"5608","title":"Diversity and Clinical Issues","info":"Topics in cultural diversity, bilingualism, and second language learning needed for clinical competency in speech-language pathology. Basic/applied issues across a broad range of culturally/linguistically diverse populations.","prereqInfo":"prereq: 3303 or equiv or instr consent","prereq":{"course":[{"code":"SLHS 3303","subject":"SLHS","id":"3303"}]}},{"code":"SLHS 5609","subject":"SLHS","id":"5609","title":"Chld Lang Disord Diverse Popul","info":"This course covers topics across three broad areas of child language: cultural and linguistic diversity, early intervention, and social communication. The first section will address multicultural issues and bilingualism. The second section will focus on assessment and treatment of language disorders from birth through preschool. Finally, we will address the assessment and treatment of social communication and pragmatic language deficits across disorders and developmental levels, including early prelinguistic communication The course will include both theoretically and clinically motivated content.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5801","subject":"SLHS","id":"5801","title":"Advanced Audiologic Assessment","info":"Basic audiometric battery, including pure tone thresholds, measures of speech understanding, masking and immittance in adults. Topics include video ostoscopy, ototoxicity, functional hearing loss, and identification of middle-ear fluid. Students enrolled in this course concurrently enroll in SLHS 5810.","prereqInfo":"prereq: 4801 or CDis 4801 or instr consent","prereq":{"course":[{"code":"SLHS 4801","subject":"SLHS","id":"4801"},{"code":"CDIS 4801","subject":"CDIS","id":"4801"}]}},{"code":"SLHS 5802","subject":"SLHS","id":"5802","title":"Hearing Aids I","info":"Survey of modern hearing aids including history of development, electroacoustic functions, clinic and laboratory measurement techniques, sound field acoustics, techniques for selection.","prereqInfo":"prereq: [[3305, 4801] or [CDIS 3305, CDIS 4801], SLHS grad] or instr consent","prereq":{"course":[{"code":"SLHS 3305","subject":"SLHS","id":"3305"},{"code":"SLHS 4801","subject":"SLHS","id":"4801"},{"code":"CDIS 3305","subject":"CDIS","id":"3305"},{"code":"CDIS 4801","subject":"CDIS","id":"4801"}]}},{"code":"SLHS 5803","subject":"SLHS","id":"5803","title":"Pediatric Audiology","info":"Behavioral, physiological approaches to assessment and identification, development of the auditory mechanism, etiologies of hearing losses in infants, children, principles of case management with children and families. ","prereqInfo":"prereq: [[4801 or CDIS 4801], SLHS grad] or instr consent","prereq":{"course":[{"code":"SLHS 4801","subject":"SLHS","id":"4801"},{"code":"CDIS 4801","subject":"CDIS","id":"4801"}]}},{"code":"SLHS 5804","subject":"SLHS","id":"5804","title":"Cochlear Implants","info":"Implantable auditory prostheses. History of device development, including cochlear implants and auditory brainstem implants. Signal processing. Techniques for selection, fitting, and rehabilitation. Behavioral/physiological changes across life span.","prereqInfo":"prereq: [[4802, 5801, 5802] or [CDIS 4802, CDIS 5801, CDIS 5802],  SLHS grad] or instr consent","prereq":{"course":[{"code":"SLHS 4802","subject":"SLHS","id":"4802"},{"code":"SLHS 5801","subject":"SLHS","id":"5801"},{"code":"SLHS 5802","subject":"SLHS","id":"5802"},{"code":"CDIS 4802","subject":"CDIS","id":"4802"},{"code":"CDIS 5801","subject":"CDIS","id":"5801"},{"code":"CDIS 5802","subject":"CDIS","id":"5802"}]}},{"code":"SLHS 5805","subject":"SLHS","id":"5805","title":"Advanced Rehab Audiology","info":"Analysis of speech perception/production. Communication skills/strategies. Sensory modalities. Rehabilitative techniques in adults, children, and infants with hearing losses. Tinnitus management. Audiology telepractice.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5806","subject":"SLHS","id":"5806","title":"Auditory Disorders in Children","info":"In this course students learn about assessing hearing and listening difficulties in children “beyond the audiogram”, as well as the pediatric-specific considerations for intervention and management of identified hearing difficulties. This course covers the anatomy and physiology of the central auditory pathway, assessments to evaluate auditory disorders and processing skills, and techniques to address auditory processing weaknesses and disorders in children. Additional topics include normal and disordered auditory processing abilities, current and historical theories and controversies surrounding auditory assessment beyond the audiogram, and advances in the assessment and management of childhood hearing disorders.\nprereq: [4802 or CDIS 4802, SLHS grad] or instr consent","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 5807","subject":"SLHS","id":"5807","title":"Noise and Hearing Conservation","info":"Students in this course will learn to: Describe the auditory and nonauditory effects of noise on humans, Design a successful hearing conservation program, Measure noise levels in a variety of settings, Monitor hearing, Measure hearing protection devices, Develop educational materials, and Describe federal and state regulations as they relate to hearing conservation.","prereqInfo":"prereq: [8801, 8802] or [CDis 8801, CDis 8802]","prereq":{"course":[{"code":"SLHS 8801","subject":"SLHS","id":"8801"},{"code":"SLHS 8802","subject":"SLHS","id":"8802"},{"code":"CDIS 8801","subject":"CDIS","id":"8801"},{"code":"CDIS 8802","subject":"CDIS","id":"8802"}]}},{"code":"SLHS 5808","subject":"SLHS","id":"5808","title":"Pathophys of Hearing Disorders","info":"Disorders of auditory system, including anatomical, physiological, perceptual, and audiological manifestations of pathologies affecting hearing. Focus will be on understanding current data on physiology, pharmacology, and novel treatment alternatives","prereqInfo":"prereq: [[8801, 8802] or [CDIS 8801, CDIS 8802], SLHS grad] or instr consent","prereq":{"course":[{"code":"SLHS 8801","subject":"SLHS","id":"8801"},{"code":"SLHS 8802","subject":"SLHS","id":"8802"},{"code":"CDIS 8801","subject":"CDIS","id":"8801"},{"code":"CDIS 8802","subject":"CDIS","id":"8802"}]}},{"code":"SLHS 5810","subject":"SLHS","id":"5810","title":"Laboratory Module in Audiology","info":"Intensive study of clinical methods in audiology. Supplements didactic courses in audiology curriculum. Laboratory study, individually or in small groups. Students enroll in this course concurrently with SLHS 5801, 5802, 8801, 8802.","prereqInfo":"prereq: [4801 or CDIS 4801, SLHS grad] or instr consent","prereq":{"course":[{"code":"SLHS 4801","subject":"SLHS","id":"4801"},{"code":"CDIS 4801","subject":"CDIS","id":"4801"}]}},{"code":"SLHS 5820","subject":"SLHS","id":"5820","title":"Grand Rounds","info":"Group discussions of current professional issues in audiology. Case presentations, guest presentations on current technology, clinical/research ethics. Group meets for an hour weekly with faculty coordinator who leads discussion. Integrates academic/clinical education.","prereqInfo":"prereq: [[4801 or CDIS 4801 or equiv], SLHS grad] or instr consent","prereq":{"course":[{"code":"SLHS 4801","subject":"SLHS","id":"4801"},{"code":"CDIS 4801","subject":"CDIS","id":"4801"}]}},{"code":"SLHS 5830","subject":"SLHS","id":"5830","title":"Clin Fnd: Audiology","info":"Clinical foundations in audiology for first year AuD graduate students.","prereqInfo":"prereq: Grad SLHS major","prereq":{"course":[]}},{"code":"SLHS 5900","subject":"SLHS","id":"5900","title":"Topics in SLHS","info":"Topics listed in Speech-Language-Hearing Sciences office.","prereqInfo":"prereq: SLHS grad student or instr consent","prereq":{"course":[]}},{"code":"SLHS 5993","subject":"SLHS","id":"5993","title":"Directed Study","info":"Directed readings and preparation of reports on selected topics.","prereqInfo":"prereq: SLHS grad or instr consent","prereq":{"course":[]}},{"code":"SLHS 8111","subject":"SLHS","id":"8111","title":"Readings in SLHS","info":"Readings appropriate to an individual student's program or objectives that are not available in regular courses.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8112","subject":"SLHS","id":"8112","title":"SLHS Lab Experience","info":"Training/experience conducting lab activities in Speech-Language-Hearing Sciences. Students select a faculty member to serve as their sponsor and prepare/conduct lab research/presentations. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8113","subject":"SLHS","id":"8113","title":"SLHS Teaching Experience","info":"Training/experience conducting educational activities in Speech-Language-Hearing Sciences. Students select a faculty member to serve as their sponsor and prepare/execute educational presentations. ","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8333","subject":"SLHS","id":"8333","title":"FTE: Masters","info":"(No description)","prereqInfo":"prereq: Master's student, adviser and DGS consent","prereq":{"course":[]}},{"code":"SLHS 8410","subject":"SLHS","id":"8410","title":"Seminar: Research","info":"Advanced study exploring application of experimental and quasi-experimental research designs used in single-subject and group research.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8420","subject":"SLHS","id":"8420","title":"Seminar: Teaching","info":"Advanced study to prepare doctoral students for careers in undergraduate and graduate teaching.","prereqInfo":"prereq: Grad com dis major","prereq":{"course":[]}},{"code":"SLHS 8430","subject":"SLHS","id":"8430","title":"Proseminar in SLHS","info":"Presentations/discussions led by faculty and PhD students in the department, based on research or issues in the discipline.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8444","subject":"SLHS","id":"8444","title":"FTE: Doctoral","info":"(No description)","prereqInfo":"prereq: Doctoral student, adviser and DGS consent","prereq":{"course":[]}},{"code":"SLHS 8500","subject":"SLHS","id":"8500","title":"Providing SLHS in Diverse Pops","info":"This course equips students to recognize relevant aspects of diversity across clinical populations and prepares them to provide culturally responsive services to those populations. All students will develop knowledge and skills across multiple dimensions of diversity, learning to recognize and manage their biases in each area. Students will also document the impact of this learning on their clinical practice. Students may opt to develop deeper knowledge in a single area of specialization.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8501","subject":"SLHS","id":"8501","title":"Interdis Mgmt in Cleft Palate","info":"Communication problems associated with cleft palate and craniofacial disorders within interdisciplinary context; structural bases for speech problems, and physical and behavioral approaches to speech treatment; interdisciplinary medical and dental concerns and management.","prereqInfo":"prereq: 3305 or CDis 3305 or instr consent","prereq":{"course":[{"code":"SLHS 3305","subject":"SLHS","id":"3305"},{"code":"CDIS 3305","subject":"CDIS","id":"3305"}]}},{"code":"SLHS 8530","subject":"SLHS","id":"8530","title":"Seminar: Speech","info":"Advanced study and analysis of research in speech science and speech pathology.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8602","subject":"SLHS","id":"8602","title":"Traumatic Brain Injury","info":"Survey of communicative and cognitive disorders in adults who have traumatic brain injuries. Demographics, neuropathologic substrates, assessment and diagnosis, clinical applications.","prereqInfo":"prereq: [3302, 4301] or [CDis 3302, CDis 4301] or instr consent","prereq":{"course":[{"code":"SLHS 3302","subject":"SLHS","id":"3302"},{"code":"SLHS 4301","subject":"SLHS","id":"4301"},{"code":"CDIS 3302","subject":"CDIS","id":"3302"},{"code":"CDIS 4301","subject":"CDIS","id":"4301"}]}},{"code":"SLHS 8630","subject":"SLHS","id":"8630","title":"Seminar: Language","info":"Research in language acquisition, language science, and language disorders.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8666","subject":"SLHS","id":"8666","title":"Doct Pre-Thesis Cr*","info":"tbd","prereqInfo":"prereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr","prereq":{"course":[]}},{"code":"SLHS 8720","subject":"SLHS","id":"8720","title":"Clin Educ:Spch Path","info":"Clinical experience.\nPrereq Grad CDis major, adviser, DGS consent.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8777","subject":"SLHS","id":"8777","title":"Thesis Credit:Mast*","info":"(No description)","prereqInfo":"prereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]","prereq":{"course":[]}},{"code":"SLHS 8801","subject":"SLHS","id":"8801","title":"Electro Assess Auditory Func","info":"Basic terminology and theoretical aspects of the auditory evoked potentials, electrocochleography, acoustic reflectance, and otoacoustic emissions. Topics include case studies with clinical application of short-latency responses such as the auditory brainstem response and otoacoustic emissions in adults. Students enrolled in this course concurrently enroll in SLHS 5810.","prereqInfo":"prereq: 5801 or CDis 5801 or instr consent","prereq":{"course":[{"code":"SLHS 5801","subject":"SLHS","id":"5801"},{"code":"CDIS 5801","subject":"CDIS","id":"5801"}]}},{"code":"SLHS 8802","subject":"SLHS","id":"8802","title":"Hearing Aids II","info":"Instrumentation and methods for fitting and evaluating personal hearing aids; ear impression techniques and materials; repair and modification of hearing aids.","prereqInfo":"prereq: 5802 or Cdis 5802 or instr consent","prereq":{"course":[{"code":"SLHS 5802","subject":"SLHS","id":"5802"},{"code":"CDIS 5802","subject":"CDIS","id":"5802"}]}},{"code":"SLHS 8803","subject":"SLHS","id":"8803","title":"Signals & Systems in Audiology","info":"This mostly laboratory class includes familiarization and application of test equipment and methods for calibrating audiometric equipment. Sessions will include topics such as sound-field calibration, earphone calibration, filters, spectra of transient signals, and use of an artificial mastoid.","prereqInfo":"prereq: [3305, 3306, 4801] or [CDis 3305, CDis 3306, CDis 4801] or instr consent","prereq":{"course":[{"code":"SLHS 3305","subject":"SLHS","id":"3305"},{"code":"SLHS 3306","subject":"SLHS","id":"3306"},{"code":"SLHS 4801","subject":"SLHS","id":"4801"},{"code":"CDIS 3305","subject":"CDIS","id":"3305"},{"code":"CDIS 3306","subject":"CDIS","id":"3306"},{"code":"CDIS 4801","subject":"CDIS","id":"4801"}]}},{"code":"SLHS 8804","subject":"SLHS","id":"8804","title":"Evoked Potentials","info":"Research and methods used in measurement and application of evoked potentials.  Early, middle, and late auditory evoked potentials and electroneurography.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8805","subject":"SLHS","id":"8805","title":"Hearing Sci Found of Audiology","info":"Physiological/psychological acoustics. Emphasizes hearing loss. Acoustics of the middle and external ear, cochlear mechanics, neural codes for perception, frequency selectivity, loudness, temporal resolution, clear speech, attention, prediction of speech understanding ability using stimulus measures, and binaural hearing. ","prereqInfo":"prereq: Knowledge of acoustics, basic anatomy/physiology of ear, intro coursework in hearing/speech science","prereq":{"course":[]}},{"code":"SLHS 8806","subject":"SLHS","id":"8806","title":"Audiology Capstone","info":"Students research a case history of patient with an auditory disorder, write paper that summarizes the literature on the disorder, and recommend assessment tools and treatment plans.","prereqInfo":"prereq: 8802, 8807","prereq":{"course":[{"code":"SLHS 8802","subject":"SLHS","id":"8802"},{"code":"SLHS 8807","subject":"SLHS","id":"8807"}]}},{"code":"SLHS 8807","subject":"SLHS","id":"8807","title":"Balance Assessment","info":"Anatomy/physiology of vestibular mechanism. Assessment techniques to evaluate balance function. Treatment options available for persons with balance disorders.","prereqInfo":"prereq: 5801, 8801","prereq":{"course":[{"code":"SLHS 5801","subject":"SLHS","id":"5801"},{"code":"SLHS 8801","subject":"SLHS","id":"8801"}]}},{"code":"SLHS 8820","subject":"SLHS","id":"8820","title":"Clin Educ: Audiol","info":"Clinical experience.","prereqInfo":"prereq: Grad CDis major","prereq":{"course":[]}},{"code":"SLHS 8830","subject":"SLHS","id":"8830","title":"Seminar: Hearing","info":"Advanced study/analysis of research in hearing science and audiology.","prereqInfo":null,"prereq":{"course":[]}},{"code":"SLHS 8840","subject":"SLHS","id":"8840","title":"Audiology Externship","info":"Students intern at external clinical setting under supervision of certified audiologist. Entry-level knowledge and skills required for professional practice as clinical audiologist. External internship settings may include hospitals, schools, private otolaryngology practices, hearing aid dispensing practices, industrial settings, or community clinics.","prereqInfo":"prereq: [8802, 8807] or [CDIS 8802, CDIS 8807]","prereq":{"course":[{"code":"SLHS 8802","subject":"SLHS","id":"8802"},{"code":"SLHS 8807","subject":"SLHS","id":"8807"},{"code":"CDIS 8802","subject":"CDIS","id":"8802"},{"code":"CDIS 8807","subject":"CDIS","id":"8807"}]}},{"code":"SLHS 8888","subject":"SLHS","id":"8888","title":"Thesis Credit:Doct*","info":"(No description)","prereqInfo":"prereq: Max 18 cr per semester or summer; 24 cr required.","prereq":{"course":[]}},{"code":"SLHS 8994","subject":"SLHS","id":"8994","title":"Directed Research","info":"Directed research","prereqInfo":"prereq: instr consent","prereq":{"course":[]}}]