[
  {
    "code": "SLS 1904",
    "subject": "SLS",
    "id": "1904",
    "title": "Freshman Seminar",
    "info": "Topics vary. See Class Schedule.",
    "prereq": []
  },
  {
    "code": "SLS 1905",
    "subject": "SLS",
    "id": "1905",
    "title": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "SLS 3001",
    "subject": "SLS",
    "id": "3001",
    "title": "Basics in Teaching ESL",
    "info": "Current theories/methods of English as second language (ESL) instruction. Methodologies for teaching/assessing listening, speaking, pronunciation, reading, writing skills. Contexts of teaching English to adults in United States/abroad. Internship at school or agency teaching ESL.",
    "prereq": []
  },
  {
    "code": "SLS 3401",
    "subject": "SLS",
    "id": "3401",
    "title": "Pronun/Grammar,  ESL Teachers",
    "info": "Concepts/theories regarding English pronunciation/grammar.  ESL textbooks, teaching activities, lesson plans, curriculum materials.  ",
    "prereq": []
  },
  {
    "code": "SLS 3501",
    "subject": "SLS",
    "id": "3501",
    "title": "Practical Language Lrng.",
    "info": "Getting a handle on language learning. Having a sense of one's learning/language strategy preferences. Motivation to learn languages in general and a given language in particular. Motivation to do specific language tasks.",
    "prereq": []
  },
  {
    "code": "SLS 5101",
    "subject": "SLS",
    "id": "5101",
    "title": "Academic Writing in TESOL",
    "info": "Research writing conventions in the profession. University rules on ethical use of human subjects, research paper rhetorical structure, literature sources/searches, literature review coherence, hedging markers, basic research methods, research result reporting, APA-formatted bibliographies, writing strategies. ",
    "prereq": []
  },
  {
    "code": "SLS 5401",
    "subject": "SLS",
    "id": "5401",
    "title": "Lang Anal for TESL",
    "info": "Overview of the structure of the English language geared to the needs of teachers of English to speakers of other languages. Study the structures of English from the point of view of second-language speakers as well as native speakers. Phonetics, phonology, morphology, and some aspects of the syntax of the English language. Part of a two-course sequence. ",
    "prereq": []
  },
  {
    "code": "SLS 5402",
    "subject": "SLS",
    "id": "5402",
    "title": "Lang Anal for TESL",
    "info": "Overview of the structure of the English language geared to the needs of teachers of English to speakers of other languages. Study the structures of English from the point of view of second-language speakers as well as native speakers. More complex structures of English syntax, as well as English semantics, pragmatics, and discourse structures. Second in a two-course sequence. ",
    "prereq": []
  },
  {
    "code": "SLS 5610",
    "subject": "SLS",
    "id": "5610",
    "title": "Res Meth in Applied Lang Study",
    "info": "Key issues in second language acquisition/learning research. Focuses on learning a second or foreign language in the classroom.",
    "prereq": []
  },
  {
    "code": "SLS 5721",
    "subject": "SLS",
    "id": "5721",
    "title": "TESL: Methods",
    "info": "Introduction to methods for teaching English as a second language to adults.",
    "prereq": []
  },
  {
    "code": "SLS 5722",
    "subject": "SLS",
    "id": "5722",
    "title": "TESL: Practicum",
    "info": "Observation of, and practice in, teaching English as a second language to adults at college or university level.",
    "prereq": []
  },
  {
    "code": "SLS 5723",
    "subject": "SLS",
    "id": "5723",
    "title": "TESL: Materials",
    "info": "Principles for evaluating/preparing  materials for teaching second languages as applied especially to English as a second language.",
    "prereq": []
  },
  {
    "code": "SLS 5724",
    "subject": "SLS",
    "id": "5724",
    "title": "Intro to Language Assessment",
    "info": "How to engage in meaningful, appropriate, and fair second-language assessment practices; interpret test results; and construct new forms of assessment.",
    "prereq": []
  },
  {
    "code": "SLS 5805",
    "subject": "SLS",
    "id": "5805",
    "title": "Basics Second Lang. Acquis.",
    "info": "Structure of a specific language. Overview of published research on psychology of secondary language learning. Extensive practice analyzing learner language.",
    "prereq": []
  },
  {
    "code": "SLS 5900",
    "subject": "SLS",
    "id": "5900",
    "title": "Topics: L2 Learn & Teach",
    "info": "Topics vary. See Class Schedule.",
    "prereq": []
  },
  {
    "code": "SLS 5910",
    "subject": "SLS",
    "id": "5910",
    "title": "TESL Seminar",
    "info": "Topics related to second language learning/teaching. Focuses on learning/teaching English as a second language. Topics specified in Class Schedule.",
    "prereq": []
  },
  {
    "code": "SLS 5993",
    "subject": "SLS",
    "id": "5993",
    "title": "Directed Studies",
    "info": "Directed study for teaching English as a second language.\nPrereq instr consent, dept consent, college consent. ",
    "prereq": []
  },
  {
    "code": "SLS 8333",
    "subject": "SLS",
    "id": "8333",
    "title": "FTE: Master's",
    "info": "(No description)",
    "prereq": []
  },
  {
    "code": "SLS 8751",
    "subject": "SLS",
    "id": "8751",
    "title": "Genre Analysis/Sec Lang Lrng",
    "info": "Critical review of literature on genre analysis. Languages for specific purposes. Focuses on English. Registers used in fields such as engineering, nursing, and business. Students gather data, write research reports.",
    "prereq": []
  },
  {
    "code": "SLS 8777",
    "subject": "SLS",
    "id": "8777",
    "title": "Thesis Credit:Mast*",
    "info": "(No description)",
    "prereq": []
  }
]