[
  {
    "code": "SSM 1004",
    "subject": "SSM",
    "id": "1004",
    "title": "Sust Syst Mgmt Orientation",
    "info": "Students will receive an introduction to the Sustainable Systems Management Major. They will learn about internships in the field and about career paths that they may follow. There will also be presentations and assignments on preparing resumes and finding jobs in this area. Graduates and professionals in the related fields of sustainable systems will present for the class. Combining course work and field trips, this class will provide students with the opportunity to meet their fellow students and to form a cohort of students with similar interests and career aspirations.\n\nprereq: None",
    "prereq": []
  },
  {
    "code": "SSM 2003",
    "subject": "SSM",
    "id": "2003",
    "title": "Systems Thinking and Analysis",
    "info": "This course will provide introduction to basic systems thinking fundamentals: defining a systems perspective about any situation or problem, solving problems with that perspective, describing and modeling problems, and designing and improving upon system solutions.",
    "prereq": []
  },
  {
    "code": "SSM 3093",
    "subject": "SSM",
    "id": "3093",
    "title": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.\n",
    "prereq": []
  },
  {
    "code": "SSM 3094",
    "subject": "SSM",
    "id": "3094",
    "title": "Directed Research",
    "info": "An opportunity in which a student designs and carries\nout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use the\nUniversity-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.\n\n",
    "prereq": []
  },
  {
    "code": "SSM 3301",
    "subject": "SSM",
    "id": "3301",
    "title": "Global Water Sustainability",
    "info": "What is the value of clean water? Explore the many facets of water, earth's most abundant resource. Ponder the value water for you, society, a region or nation; the complexities of ownership and protection; the influence of culture and traditions; and potential impacts of climate change. Consider realistic and holistic solutions to water issues.",
    "prereq": []
  },
  {
    "code": "SSM 3503",
    "subject": "SSM",
    "id": "3503",
    "title": "Marketing of Bio-based Product",
    "info": "Intro to marketing function as it relates to current/emerging bio-based products industries (building materials, paper, fuels, etc.). Product positioning, pricing, promotion, and channel management within strategic planning and environmental marketing management.",
    "prereq": []
  },
  {
    "code": "SSM 3612",
    "subject": "SSM",
    "id": "3612",
    "title": "Sys Approach Bldg Sci & Const",
    "info": "Dynamic/interrelated issues of energy, moisture control, indoor air quality in residential bldgs. Design, construction, and operational aspects for energy efficient, durable structure/healthy living environment. Interaction between moisture and wood products within building system.",
    "prereq": []
  },
  {
    "code": "SSM 4407W",
    "subject": "SSM",
    "id": "4407W",
    "title": "Sustainable Mfg Princ & Pract",
    "info": "In this course, students will learn about ways in which companies are embracing sustainability in their strategy and operations to increase growth and global competitiveness, including manufacturing processes for major sustainable products and biobased products. This includes processes and approaches for environmental mitigation and \\\"green\\\" manufacturing, reducing industrial waste and emissions, environmental footprint, and associated costs through more efficient manufacturing practices and incorporated bio-based product formulation. Students will acquire a working knowledge of management policies, tools, and techniques to improve operational and environmental performance.",
    "prereq": []
  },
  {
    "code": "SSM 4504W",
    "subject": "SSM",
    "id": "4504W",
    "title": "Sustainable Products Mgmt.",
    "info": "Concepts of new-product development and product management, their application to biobased products.",
    "prereq": []
  },
  {
    "code": "SSM 4506W",
    "subject": "SSM",
    "id": "4506W",
    "title": "Sust. Syst. Mgmt. Capstone",
    "info": "This course provides students with an opportunity to conduct solutions-driven research in sustainable systems management. Students will work in groups on real-world problems that will require them to integrate the knowledge and skills they have developed in their previous coursework and internship experiences. Project topics will be solicited annually from industrial, corporate, governmental, and other external partners. All projects will require that students take an interdisciplinary systems thinking approach. Strong analytical and communicative skills will be emphasized and developed through iterative assignments. The course will be run by faculty teaching in the Sustainable Systems Management major.\n\nprereq: ESPM 3603 concurrent registration is required (or allowed) in  Major seniors within two semesters of graduation.",
    "prereq": {
      "code": "ESPM 3603",
      "subject": "ESPM",
      "id": "3603"
    }
  },
  {
    "code": "SSM 4614",
    "subject": "SSM",
    "id": "4614",
    "title": "Bldg Sys Perform: Test & Diag",
    "info": "Theoretical basis for performance testing. Diagnostics applications for residential structures. Existing structures, retrofit/remedial applications. Digital differential pressure gauges, blower doors, airflow hoods/grids, duct pressure testing, infrared thermography. Hands-on equipment use, problem solving. \n\nprereq: SSM 3612",
    "prereq": {
      "code": "SSM 3612",
      "subject": "SSM",
      "id": "3612"
    }
  },
  {
    "code": "SSM 4616",
    "subject": "SSM",
    "id": "4616",
    "title": "Bldg Science I: Fundamentals",
    "info": "Theory, advanced applications for residential buildings. Focuses on heat/mass transfer.\n\nPrereq:  SSM 3612/5612 & SSM 4614/5614 ",
    "prereq": {
      "and": [
        {
          "code": "SSM 3612",
          "subject": "SSM",
          "id": "3612"
        },
        {
          "code": "SSM 5612",
          "subject": "SSM",
          "id": "5612"
        },
        {
          "code": "SSM 4614",
          "subject": "SSM",
          "id": "4614"
        },
        {
          "code": "SSM 5614",
          "subject": "SSM",
          "id": "5614"
        }
      ]
    }
  },
  {
    "code": "SSM 4618",
    "subject": "SSM",
    "id": "4618",
    "title": "Bldg Science II: Applications",
    "info": "A capstone applications course, where students will learn how to apply key building science principles (from SSM 4616/5616 Building Science I: Fundamentals) to common building enclosure and mechanical system problems. Students will be guided to develop both qualitative and quantitative solutions for many common energy, moisture, and indoor air quality problems facing contemporary buildings. \n\nprereq: SSM 4616/SSM 5616\n\n\n",
    "prereq": {
      "or": [
        {
          "code": "SSM 4616",
          "subject": "SSM",
          "id": "4616"
        },
        {
          "code": "SSM 5616",
          "subject": "SSM",
          "id": "5616"
        }
      ]
    }
  },
  {
    "code": "SSM 5093",
    "subject": "SSM",
    "id": "5093",
    "title": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.\n\n",
    "prereq": []
  },
  {
    "code": "SSM 5094",
    "subject": "SSM",
    "id": "5094",
    "title": "Directed Research",
    "info": "An opportunity in which a student designs and carries\nout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use the\nUniversity-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.\n\n\n",
    "prereq": []
  },
  {
    "code": "SSM 5407",
    "subject": "SSM",
    "id": "5407",
    "title": "Sustainable Mfg. Practices",
    "info": "In this course, students will learn about ways in which companies are embracing sustainability in their strategy and operations to increase growth and global competitiveness, including manufacturing processes for major sustainable products and biobased products. This includes processes and approaches for environmental mitigation and \\\"green\\\" manufacturing, reducing industrial waste and emissions, environmental footprint, and associated costs through more efficient manufacturing practices and incorporating bio-based product formulation. Students will acquire a working knowledge of management policies, tools, and techniques to improve operational and environmental performance.",
    "prereq": []
  },
  {
    "code": "SSM 5503",
    "subject": "SSM",
    "id": "5503",
    "title": "Marketing of Bio-based Product",
    "info": "Introduction to marketing function as it relates to current/emerging bio-based products industries (building materials, paper, fuels, etc.). Product positioning, pricing, promotion, and channel management within strategic planning and environmental marketing management.",
    "prereq": []
  },
  {
    "code": "SSM 5504",
    "subject": "SSM",
    "id": "5504",
    "title": "Sustainable Products Sys Mgmt",
    "info": "Concepts of new product development and product management and their application to bio-based products.",
    "prereq": []
  },
  {
    "code": "SSM 5612",
    "subject": "SSM",
    "id": "5612",
    "title": "Sys Approach Bldg Sci & Const",
    "info": "Dynamic/interrelated issues of energy, moisture control, indoor air quality in residential bldgs. Emphasizes design, construction, and operational aspects to provide an energy efficient, durable structure, and healthy living environment. Interaction between moisture and wood products within building system.\n\nprereq:  Graduate Student",
    "prereq": []
  },
  {
    "code": "SSM 5614",
    "subject": "SSM",
    "id": "5614",
    "title": "Bldg Sys Perform: Test & Diag",
    "info": "Theoretical basis for performance testing. Diagnostics applications for residential structures. Focuses on existing structures and retrofit/remedial applications. Digital differential pressure gauges, blower doors, airflow hoods/grids, duct pressure testing, infrared thermography. Hands-on sessions for equipment use, problem solving.\n\nprereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "code": "SSM 5616",
    "subject": "SSM",
    "id": "5616",
    "title": "Bldg Science I: Fundamentals",
    "info": "Building science theory, advanced applications for residential buildings. Focuses on heat/mass transfer.\n\nprereq: Grad student or instr consent",
    "prereq": []
  },
  {
    "code": "SSM 5618",
    "subject": "SSM",
    "id": "5618",
    "title": "Bldg Science II: Applications",
    "info": "This course is intended to be a capstone applications course, where students will learn how to apply key building science principles (from SSM 4616/5616 Building Science I: Fundamentals) to common building enclosure and mechanical system problems. Students will be guided to develop both qualitative and quantitative solutions for many common energy, moisture, and indoor air quality problems facing contemporary buildings.\n\nprereq: Graduate Student",
    "prereq": []
  }
]