[{"code":"SURG 7500","subject":"SURG","id":"7500","title":"General Surgery Externship","info":"The student attends clinical departmental conferences, laboratory exercises, team discussions and group seminars.","prereq":[]},{"code":"SURG 7501","subject":"SURG","id":"7501","title":"PrepSurgResidency","info":"Four-week rotation. Students work with University surgery faculty/residents. Interactive didactics, simulation, technical skills practice. Managing emergencies in surgical ward, discharging patients, dosing common medications. Wound care, suturing, use of radiologic tests. Placement of chest tubes and central lines.\n\nprereq: 7500 Surgery Clerkship, or equiv; designed for student entering general surgery categorical resident or beginning a surgical subspecialty or preliminary candidate for surgery","prereq":{"code":"SURG 7500","subject":"SURG","id":"7500"}},{"code":"SURG 7502","subject":"SURG","id":"7502","title":"Surg ICU Elective","info":"This service provides the student with direct bedside experience and opportunities to apply the principles of physiology, biochemistry, and metabolism to critically ill and injured patients.\n\nRequired reading: Abrams and Cerra, Essentials of Surgical Critical Care, Quality Medical Publishers, 1993.\n\nprereq: 7500","prereq":{"code":"SURG 7500","subject":"SURG","id":"7500"}},{"code":"SURG 7503","subject":"SURG","id":"7503","title":"Surgery Research","info":"The student will participate in a research experience designed around a specific topic, arranged on an individual basis by the Course Instructor with staff members in the Department of Surgery.","prereq":[]},{"code":"SURG 7504","subject":"SURG","id":"7504","title":"Surg Nutrition Elec","info":"This multidisciplinary patient care service is designed to provide one student with direct experience in hospital-based parenteral\nand enteral nutrition.","prereq":[]},{"code":"SURG 7505","subject":"SURG","id":"7505","title":"Acting Intern Transplant Surg","info":"Deceased and live donor kidney, liver, and pancreas transplantation. Pre-operative evaluation and management and post-operative care (including immune monitoring). Intra-operative management (donor and recipient) of transplant patients and back-table work. Clinical rounds/teaching conferences/seminars. Complete abstract in area of interest. Scrub in organ donor operations as well as kidney, liver, and pancreas transplant.","prereq":[]},{"code":"SURG 7509","subject":"SURG","id":"7509","title":"Acting Intern Burn Surgery","info":"The student is exposed to all aspects of burn care including small outpatient burns as well as massive life-threatening burns.","prereq":[]},{"code":"SURG 7510","subject":"SURG","id":"7510","title":"Acting Intern Surgery","info":"Instruction and advanced experience in surgery and its components. Students participate in patient care at level similar to first-year intern. Students work with a team in general/vascular surgery, surgical oncology/colorectal, or MIS/thoracic/foregut under faculty supervision and participate in the care of patients, in the operating room, and in clinics. Students take call on assigned service.","prereq":[]},{"code":"SURG 7511","subject":"SURG","id":"7511","title":"Surgery Elective","info":"Instruction/experience in surgery and its components. Students participate directly in patient care at a level of responsibility exceeding that given to beginning students. Students work under direct supervision of faculty and participate fully with surgical team on assigned service in care of hospitalized patients, in operating room, and in clinics.\n\nprereq: 7500, dept consent","prereq":{"code":"SURG 7500","subject":"SURG","id":"7500"}},{"code":"SURG 7512","subject":"SURG","id":"7512","title":"Surgery Elective","info":"Instruction/experience in surgery and its components. Students participate directly in patient care at a level of responsibility exceeding that given to beginning students. Students work under direct supervision of faculty and participate with surgical team in care of hospitalized patients, in operating room, and in clinics. Experience in general surgery, vascular surgery, trauma, or burn center.\n\nprereq: 7500, dept consent","prereq":{"code":"SURG 7500","subject":"SURG","id":"7500"}},{"code":"SURG 7513","subject":"SURG","id":"7513","title":"Surgery Elective","info":"Instruction and advanced experience in surgery/trauma. Students participate directly in patient care at a level of responsibility similar to first year intern. Students work with assigned surgery/trauma team under supervision of faculty and participate fully in care of hospitalized patients, in operating room, and in clinics. Students take call on assigned service.\n\nprereq: 7500, dept consent","prereq":{"code":"SURG 7500","subject":"SURG","id":"7500"}},{"code":"SURG 7515","subject":"SURG","id":"7515","title":"Acting Intern Vascular Surgery","info":"This course will provide instruction and advanced experience in vascular surgery for the student who has completed a basic internship or clerkship in surgery. Students taking this course can expect to participate directly in patient care at a level of responsibility that is similar to a first year intern. The student will work with their assigned team under the supervision of the faculty and will participate fully in the care of patients on the hospital wards and in the ICUs, operating room, and clinics. ","prereq":[]},{"code":"SURG 7520","subject":"SURG","id":"7520","title":"Surgery Externship A","info":"Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. \n\nCatalog Description: In addition to competence in the course objectives, it is expected that the students will attend clinical departmental conferences, laboratory exercises, team discussions and group seminars. Recommended textbooks for the rotation: Way: Current Surgical Diagnosis and Treatment, 11th edition, 1996, Sabiston and Lyerly; Essentials of Surgery, 2nd edition, 1994. A handbook of core topics, readings, and oral exam questions is provided at the beginning of each period.","prereq":[]},{"code":"SURG 7521","subject":"SURG","id":"7521","title":"Surgery Externship B","info":"Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. \n\nCatalog Description: In addition to competence in the course objectives, it is expected that the students will attend clinical departmental conferences, laboratory exercises, team discussions, and group seminars. Recommended textbooks for the rotation: Way: Current Surgical Diagnosis and Treatment, 11th edition, 1996, Sabiston and Lyerly; Essentials of Surgery, 2nd edition, 1994. A handbook of core topics, readings, and oral exam questions is provided at the beginning of each period.","prereq":[]},{"code":"SURG 7522","subject":"SURG","id":"7522","title":"Acting Intern Plastic Surgery","info":"The student is exposed to the full spectrum of plastic and reconstructive problems while on the rotation. ","prereq":[]},{"code":"SURG 7523","subject":"SURG","id":"7523","title":"Acting Intern Colorectal Surg","info":"Each student has the opportunity to become adept in the use of the sigmoidoscope as well as performing various outpatient anorectal procedures.","prereq":[]},{"code":"SURG 7524","subject":"SURG","id":"7524","title":"Outpatient/Ambul Externship","info":"Surgery clinic. Operating room experience. Surgical pathology review.\n\nprereq: instr consent","prereq":[]},{"code":"SURG 7525","subject":"SURG","id":"7525","title":"Acting Intern CV/Thoracic Surg","info":"Students will have the opportunity to become involved in the evaluation and management of patients with cardiac and thoracic surgical diseases. They will be incorporated at the level of a sub-intern on very busy clinical services. They will attend teaching conferences in addition to clinical duties. They may first or second-assist on routine thoracic cases and second assist on some cardiac surgeries.","prereq":[]},{"code":"SURG 7526","subject":"SURG","id":"7526","title":"Acting Intern Peds Surgery","info":"Students participate in all aspects of patient care. Initial evaluation, detailed history, physical exams, initiation/evaluation of diagnostic laboratory/radiologic testing. Formulating plans of resuscitation and patient care. Students also participate in outpatient clinics.","prereq":[]},{"code":"SURG 7550","subject":"SURG","id":"7550","title":"Essentials of Surg Clerkship","info":"Required 4- week clinical Clerkship. Designed to provide the learner with a multidisciplinary experience in approaching surgical disease and surgical decision making. \n\n\n\n","prereq":[]},{"code":"SURG 7551","subject":"SURG","id":"7551","title":"Gen Surgery Subspecialty Elect","info":"Students interested in general surgery subspecialties will have the opportunity to care for patients with surgical disease processes and aid in both discernment and preparation for surgical acting internships","prereq":[]},{"code":"SURG 7552","subject":"SURG","id":"7552","title":"Surgical Subspecialty Elect","info":"Students will spend 4 weeks on surgical subspecialty services. This may be a 4 week experience on 1 subspecialty or two 2 week experiences, depending on the site. Clinic, consultation service and OR experiences will be available.","prereq":[]},{"code":"SURG 7560","subject":"SURG","id":"7560","title":"Intro to CV & Thoracic Surgery","info":"Students will spend 4 weeks on cardiovascular surgery services. Clinic, consultation service, and OR experiences will be available.","prereq":[]},{"code":"SURG 7561","subject":"SURG","id":"7561","title":"Intro to Plastic Surgery","info":"By the completion of the rotation, students will be able to evaluate plastic surgery patients, participate in the operative procedure, and recognize post operative complications.\n\n\n\n","prereq":[]},{"code":"SURG 7562","subject":"SURG","id":"7562","title":"Intro to Vascular Surgery","info":"Students will spend 4 weeks on vascular surgery services. Clinic, consultation service, and OR experiences will be available.\n\n\n\n","prereq":[]},{"code":"SURG 7910","subject":"SURG","id":"7910","title":"Surgery Medical Residency","info":"Surgery medical residency.","prereq":[]},{"code":"SURG 7930","subject":"SURG","id":"7930","title":"Surgery Medical Fellowship","info":"Surgery medical fellowship.","prereq":[]},{"code":"SURG 8200","subject":"SURG","id":"8200","title":"SURG 8200","info":"Diagnostic and management instruction in all phases of clinical surgery, inpatient and outpatient.\n\nprereq: Grad surg major","prereq":[]},{"code":"SURG 8201","subject":"SURG","id":"8201","title":"SURG 8201","info":"Weekly review of surgical patients presenting interesting roentgen and pathological findings. Staff from the Departments of Surgery, Radiology, and Laboratory Medicine and Pathology. Basic science and management principles of the surgical patient.\n\nprereq: Grad surg major","prereq":[]},{"code":"SURG 8202","subject":"SURG","id":"8202","title":"SURG 8202","info":"Graduate students undertake original investigation of problems in either experimental or clinical surgery.\n\nprereq: Grad surg major","prereq":[]},{"code":"SURG 8203","subject":"SURG","id":"8203","title":"SURG 8203","info":"Evaluation of surgical patients, including postoperative course. Discussion and critical evaluation of current research problems.\n\nprereq: Grad surg major","prereq":[]},{"code":"SURG 8207","subject":"SURG","id":"8207","title":"SURG 8207","info":"Interdepartmental discussion and evaluation of current clinical and research problems.\n\nprereq: Grad surg major","prereq":[]},{"code":"SURG 8293","subject":"SURG","id":"8293","title":"Applied Statistics","info":"Interactive computer course. Concepts of applied statistics. Examples, problem sets based on surgical research. How to independently set up appropriate experiments and perform basic descriptive/inferential analysis.\n\nprereq: Grad student in [surgery or experimental surgery or health sciences] or","prereq":[]},{"code":"SURG 8333","subject":"SURG","id":"8333","title":"FTE: Master's","info":"(No description)\n\nprereq: Master's student, adviser and DGS consent","prereq":[]},{"code":"SURG 8444","subject":"SURG","id":"8444","title":"FTE: Doctoral","info":"(No description)\n\nprereq: Doctoral student, adviser and DGS consent","prereq":[]},{"code":"SURG 8666","subject":"SURG","id":"8666","title":"Doct Pre-Thesis Cr","info":"TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr","prereq":[]},{"code":"SURG 8777","subject":"SURG","id":"8777","title":"Thesis Credit:Mast*","info":"(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]","prereq":[]},{"code":"SURG 8888","subject":"SURG","id":"8888","title":"Thesis Credit:Doct*","info":"(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required","prereq":[]},{"code":"SURG 8990","subject":"SURG","id":"8990","title":"Topics in Pancreatology","info":"Presentations and discussion of translation of bench to bedside research in Pancreatology.","prereq":[]},{"code":"SURG 8992","subject":"SURG","id":"8992","title":"Directed Research","info":"Students will conduct basic or clinical research under the guidance of a faculty member in the Department of Surgery.","prereq":[]},{"code":"SURG 8994","subject":"SURG","id":"8994","title":"Directed Readings","info":"Students will read and discuss publications related to their research projects and in their specialty areas.","prereq":[]}]