[{"code":"SWED 1001","subject":"SWED","id":"1001","title":"Beginning Swedish","info":"Emphasis on working toward novice-intermediate low proficiency in all four language modalities (listening, reading, speaking, writing).  Topics include everyday subjects (shopping, directions, family, food, housing, etc.).","prereq":[]},{"code":"SWED 1002","subject":"SWED","id":"1002","title":"Beginning Swedish","info":"Continues the presentation of all four language modalities (listening, reading, speaking, writing), with a proficiency emphasis. Topics include free-time activities, careers, and Swedish culture.\n\nprereq: 1001","prereq":{"code":"SWED 1001","subject":"SWED","id":"1001"}},{"code":"SWED 1003","subject":"SWED","id":"1003","title":"Intermediate Swedish","info":"Emphasis on intermediate proficiency in listening, reading, speaking, and writing. Contextualized work on grammar and vocabulary is combined with authentic readings and essay assignments.\n\nprereq: 1002","prereq":{"code":"SWED 1002","subject":"SWED","id":"1002"}},{"code":"SWED 1004","subject":"SWED","id":"1004","title":"Intermediate Swedish","info":"Emphasis on developing intermediate mid-high proficiency in listening, reading, speaking, and writing. Contextualized work on grammar and vocabulary is supported by work with authentic readings and essay assignments.\n\nprereq: 1003","prereq":{"code":"SWED 1003","subject":"SWED","id":"1003"}},{"code":"SWED 3011","subject":"SWED","id":"3011","title":"Advanced Swedish","info":"Achieving advanced proficiency in Swedish. Fiction, film, journalistic, and professional prose. Grammar, vocabulary building exercises, review of oral/written modes of communication.","prereq":[]},{"code":"SWED 3012","subject":"SWED","id":"3012","title":"Advanced Swedish","info":"Novels, short stories, plays, articles. Structural, stylistic, vocabulary-building exercises.","prereq":[]},{"code":"SWED 4001","subject":"SWED","id":"4001","title":"Beg Swedish Grad Research","info":"Emphasis on working toward novice-intermediate low proficiency in all four language modalities (listening, reading, speaking, writing). Topics include everyday subjects (shopping, directions, family, food, housing, etc.). Meets concurrently with 1001.","prereq":[]},{"code":"SWED 4002","subject":"SWED","id":"4002","title":"Beg Swedish Grad Research","info":"Continues the presentation of all four language modalities (listening, reading, speaking, writing), with a proficiency emphasis. Topics include free-time activities, careers, and Swedish culture. Meets concurrently with 1002.","prereq":[]},{"code":"SWED 4003","subject":"SWED","id":"4003","title":"Int Swedish Grad Research","info":"Emphasis on intermediate proficiency in listening, reading, speaking, and writing. Contextualized work on grammar and vocabulary is combined with authentic readings and essay assignments. Meets concurrently with 1003.","prereq":[]},{"code":"SWED 4004","subject":"SWED","id":"4004","title":"Int Swedish Grad Research","info":"Emphasis on developing intermediate mid-high proficiency in listening, reading, speaking, and writing. Contextualized work on grammar and vocabulary is supported by work with authentic readings and essay assignments. Meets concurrently with 1004.","prereq":[]}]