[{"code":"TRIN 1201","subject":"TRIN","id":"1201","title":"Health Care for Interpreters","info":"Technical vocabulary, oral discourse patterns used by health\ncare providers in talking to patients, family members. Language of American health care interview.","prereq":[]},{"code":"TRIN 1301","subject":"TRIN","id":"1301","title":"American Law for Interpreters","info":"American legal system. Technical vocabulary used in courts and other legal settings. Oral legal discourse. Presentations by specialists, discussion, exercises for review/practice.","prereq":[]},{"code":"TRIN 1901","subject":"TRIN","id":"1901","title":"Special Ed Terms & Concepts","info":"This course is designed to introduce students to the terminology, processes, concepts, and legalities involved in interpreting in special education settings.","prereq":[]},{"code":"TRIN 3001","subject":"TRIN","id":"3001","title":"Intro: Translation","info":"Theory of and supervised practice in translation. Re-expressing meaning in a second language. Translation primarily of English language texts concerning public health/safety, legal/voting rights, regulations, and procedures.\n\nprereq: Bilingual proficiency in [English, second language of instruction]","prereq":[]},{"code":"TRIN 3002","subject":"TRIN","id":"3002","title":"Intermediate Translation","info":"Additional instruction and supervised practice in translation.\n\nprereq: 3001","prereq":{"code":"TRIN 3001","subject":"TRIN","id":"3001"}},{"code":"TRIN 3005","subject":"TRIN","id":"3005","title":"Principles of Translation","info":"Key linguistic principles that help us understand how language makes meaning. Applying principles to translation.\n\nprereq: Fluent in English, proficient in a second language; basic knowledge of English grammar recommended","prereq":[]},{"code":"TRIN 3101","subject":"TRIN","id":"3101","title":"Intro Interpreting","info":"Practical and theoretical introduction to interpreting in health, human service, and legal settings. Emphasis on understanding the unique role of the interpreter, current models and modes of interpreting, ethical issues and professional standards of practice, and developing pre-interpreting skills.\n\nprereq: high level of proficiency in spoken English and another language; 3001 recommended","prereq":{"code":"TRIN 3001","subject":"TRIN","id":"3001"}},{"code":"TRIN 3102","subject":"TRIN","id":"3102","title":"Consecutive Interpreting","info":"\t\nPractice/theory at professional level in interpreting in health, human service, legal settings. Emphasizes professional/client dialogues. Consecutive interpreting skills, vocabulary research/storage, intercultural issues. Analyzing interpretive process. Performance assessment through audio/videotaping. Subject languages (e.g., Spanish, Russian, Somali) specified for each section. prereq: 3101, high level of proficiency in [spoken English, another language]","prereq":{"code":"TRIN 3101","subject":"TRIN","id":"3101"}},{"code":"TRIN 3103","subject":"TRIN","id":"3103","title":"Interpreting II","info":"Practical and theoretical course aimed at achieving professional levels of proficiency with emphasis on interpreting professional/client dialogues. Analysis of the interpreting process, consecutive and simultaneous interpreting, intercultural issues, and situational ethics. Subject language specified in Class Schedule.","prereq":[]},{"code":"TRIN 3900","subject":"TRIN","id":"3900","title":"Topics Trans Interp","info":"Topics specified in Class Schedule.","prereq":[]},{"code":"TRIN 4201","subject":"TRIN","id":"4201","title":"Interpreting in Health Care","info":"Practice in interpreting simulated clinical encounters and monologues. Fluency/accuracy in consecutive/simultaneous modes. Sight translation, medical vocabulary in two languages, ethical/situational considerations in health care interpreting. Coursework mainly in bilingual sections (English, another language).\n\nprereq: 1201, 3102","prereq":{"and":[{"code":"TRIN 1201","subject":"TRIN","id":"1201"},{"code":"TRIN 3102","subject":"TRIN","id":"3102"}]}},{"code":"TRIN 4301","subject":"TRIN","id":"4301","title":"Interpreting in Legal Settings","info":"Principles/practice of interpreting in legal settings. Skill-building for fluency/accuracy in simultaneous/consecutive modes. Sight translation. Legal register in two languages. Ethical considerations, courtroom conduct. Observation of actual court proceedings. Coursework mainly in bilingual sections (English, another language).\n\nprereq: 1301, 3102","prereq":{"and":[{"code":"TRIN 1301","subject":"TRIN","id":"1301"},{"code":"TRIN 3102","subject":"TRIN","id":"3102"}]}},{"code":"TRIN 4901","subject":"TRIN","id":"4901","title":"Interpreting in Special Ed","info":"This course is designed to build interpreting capacity and competency in the specialized field of educational interpreting. It is also designed to give students simulated opportunities to employ the terminology, processes, concepts, and legalities studied in TRIN 1901.\n","prereq":[]},{"code":"TRIN 5900","subject":"TRIN","id":"5900","title":"Topics Trans Interp","info":"Topics specified in Class Schedule.","prereq":[]},{"code":"TRIN 5993","subject":"TRIN","id":"5993","title":"Directed Study","info":"Directed study in translation/interpretation.","prereq":[]},{"code":"TRIN 900","subject":"TRIN","id":"900","title":"Special Ed for Interpreters","info":"Terminology, processes, concepts, and legalities involved in interpreting in special education settings.","prereq":[]},{"code":"TRIN 990","subject":"TRIN","id":"990","title":"Interpreting in Special Ed","info":"Advanced skills to apply special education protocols/concepts to simulated interpreting encounters. Self-assessment, glossary compilation, critical analysis, review of ethical procedures.","prereq":[]}]