[{"code":"UC 1000","subject":"UC","id":"1000","title":"Exploring Educational Options","info":"Clarifying expectations, resources, and challenges for transition into (back to) college. Students assess their interests and learning style as they relate to a college major. Internet as means of gaining options for education. Individualized degrees at the University, how to prepare an application for them. Campbell Skills and Interest Survey, Learning Styles Inventory, written assignments. Materials fee: $25.","prereqInfo":null,"prereq":{"course":[]}},{"code":"UC 1005","subject":"UC","id":"1005","title":"Global Perspectives on High Ed","info":"This course provides international students with the skills to understand and think critically about the academic norms, culture, and resources of the U.S. and other higher education systems. Students will analyze how core values, beliefs, and thought patterns inform cultural norms and behaviors, and they will compare and contrast their experience at a U.S. university with their previous educational experiences.  Students will investigate university resources and conduct field research in order to find ways to be successful in their current and future intercultural environments. The instructor will support students as they develop their ability to communicate clearly in academic writing, presentations, and small group projects.","prereqInfo":"prereq: International student","prereq":{"course":[]}},{"code":"UC 1485","subject":"UC","id":"1485","title":"Photography","info":"Conceptual, technical, and historical aspects of photography as art. Hands-on experience with camera control, film development, enlarging, and printing in black-and-white. Individual/group critiques of student portfolios. Lab.","prereqInfo":"prereq: Own camera [35 mm w/adjustable controls preferred], UC; $50 lab fee","prereq":{"course":[]}},{"code":"UC 3201","subject":"UC","id":"3201","title":"Web Designer Introduction","info":"Web design process: plan, design, launch, and publish using industry standard Web design software. Adobe Photoshop and Dreamweaver are used to build and publish a personal Web site using HTML5 and CSS. Design principles, business practices, site analysis, Bootstrap, jQuery and Animate are also covered. Lectures, exercises, lab. No previous experience necessary.","prereqInfo":null,"prereq":{"course":[]}},{"code":"UC 3202","subject":"UC","id":"3202","title":"Web Designer Introduction II","info":"Designing with Adobe Photoshop vector tools, using batch processing. Macromedia Flash as an animation tool. Developing an environment through ActionScripts. DHTML Layers, HTML frames, form processing. Internet service providers, hosting, search engines, website marketing.","prereqInfo":"prereq: 3201 or instr consent","prereq":{"course":[{"code":"UC 3201","subject":"UC","id":"3201"}]}},{"code":"UC 3293","subject":"UC","id":"3293","title":"Graduation Prep","info":"Additional semester to complete graduation preparation.","prereqInfo":null,"prereq":{"course":[]}},{"code":"UC 3950","subject":"UC","id":"3950","title":"Special Topics","info":"Special topics course.","prereqInfo":null,"prereq":{"course":[]}},{"code":"UC 4003","subject":"UC","id":"4003","title":"Intern. Subst. Couns. II","info":"Students' knowledge, internship site functioning, and counseling skills are advanced through clinical experience/supervision.","prereqInfo":null,"prereq":{"course":[]}},{"code":"UC 4301","subject":"UC","id":"4301","title":"People and Animals","info":"Interrelationships of people and animals from several viewpoints. Social, economic, and health consequences of these relationships, including issues such as pets and people sharing an urban environment, animal rights, and the influence of differences in cultures on animal-human relationships.","prereqInfo":null,"prereq":{"course":[]}},{"code":"UC 4525","subject":"UC","id":"4525","title":"Garbage & Human Environment","info":"Human development, use of natural resources, waste production, pollution of environment, waste management. Comparative look at issues/problems associated with rapid technological development. Laws to control waste production and manage accumulated waste.","prereqInfo":null,"prereq":{"course":[]}},{"code":"UC 5075","subject":"UC","id":"5075","title":"Directed Study","info":"Directed study.","prereqInfo":null,"prereq":{"course":[]}},{"code":"UC 5950","subject":"UC","id":"5950","title":"Special Topics","info":"Special topics.","prereqInfo":null,"prereq":{"course":[]}}]