[{"code":"VMBA 5700","subject":"VMBA","id":"5700","title":"Managerial Accounting","info":"How to analyze accounting for use in management decisions. Planning/control. Transfer pricing, performance meansurements, cost behavior, cost allocation, activity based costing, standard costs.","prereq":[]},{"code":"VMBA 5701","subject":"VMBA","id":"5701","title":"Data Anl & Dec","info":"Exploratory data analysis, basic inferential procedures, statistical process control, regression analysis, decision models.","prereq":[]},{"code":"VMBA 5702","subject":"VMBA","id":"5702","title":"Fin Mgmt","info":"Theory/practice of finance from an analytical approach. Students apply concepts of risk, return, valuation to decisions that a corporate financial officer or person engaged in small business must make about sources/uses of funds during changing financial markets.","prereq":[]},{"code":"VMBA 5703","subject":"VMBA","id":"5703","title":"Mktg Mgmt","info":"Developing/implementing most appropriate combination of variables to carry out a firm's strategy in its target markets. Analytic perspectives, concepts, decision tools of marketing for product offering decisions, distribution channel decisions, pricing decisions, communication program decisions.","prereq":[]},{"code":"VMBA 5704","subject":"VMBA","id":"5704","title":"Mgn Ppl & Orgs","info":"Theories/frameworks for analyzing behavior of individuals, groups, organization itself. Emphasizes making decisions, developing action plans. Concepts/principles associated with function of human resource management (e.g., personnel selection, reward/compensation, collective bargaining).","prereq":[]},{"code":"VMBA 5705","subject":"VMBA","id":"5705","title":"Operations Management","info":"Operations management function in different types of organizations. Emphasizes productive, innovative, competitive operations. Concepts/principles related to management of quality/innovation within service/manufacturing organizations.","prereq":[]},{"code":"VMBA 5706","subject":"VMBA","id":"5706","title":"Bus, Gov & Macroecon","info":"Roles of government/business in society. Alternative systems of economics, political values. Social, political, economic, cultural conflicts affecting business sector.","prereq":[]},{"code":"VMBA 5707","subject":"VMBA","id":"5707","title":"Economies in Transition","info":"Technological, political, and ethical forces that are shaping the competitive environment. Theoretical considerations. Business responses to specific issues. Projects/cases for companies in East Central Europe.","prereq":[]},{"code":"VMBA 5708","subject":"VMBA","id":"5708","title":"Comp Analy & Strat","info":"Competitive analysis, shaping of mission, objectives, product-making choices, organizational character. Allocation of resources to achieve organizational goals, resolve conflicting shareholder interests. Situational analysis, strategy development.","prereq":[]},{"code":"VMBA 5709","subject":"VMBA","id":"5709","title":"Info Tech Mgmt","info":"Various information technologies, their applications. Competitive advantages associated with information technology, organizational/managerial implications.","prereq":[]},{"code":"VMBA 5710","subject":"VMBA","id":"5710","title":"Adv Fin Mgmt, Glb Mkts","info":"Advanced financial concepts for corporate financial decisions at executive level. Investment, firm financing, global markets.","prereq":[]},{"code":"VMBA 5711","subject":"VMBA","id":"5711","title":"Managing Globalization","info":"Developing international strategies for firms wishing to expand into global markets. Emphasizes analyzing opportunities/constraints posed by international environment. Putting global strategies into operation. Managing strategic alliances/networks.","prereq":[]},{"code":"VMBA 5712","subject":"VMBA","id":"5712","title":"Strat, Glob, Intreg Persp","info":"Multi-disciplinary perspectives from strategic marketing, corporate strategy, operations management. Involvement of faculty/corporate executives. Site visits to global companies, student projects. Capstone course.","prereq":[]},{"code":"VMBA 5713","subject":"VMBA","id":"5713","title":"Negotiations & Conflict Mgmt","info":"Typical challenges faced when negotiating. Strategies for managing challenges and improving skills as a negotiator and conflict manager.","prereq":[]},{"code":"VMBA 5714","subject":"VMBA","id":"5714","title":"Financial Accounting","info":"External accounting system used by firms to measure economic performance/financial position. Students analyze corporate financial reports. Impact of economic events.  Discussions, cases. Role of financial reporting standards/intermediaries.","prereq":[]},{"code":"VMBA 5715","subject":"VMBA","id":"5715","title":"Corp & Entrepreneurial Strat","info":"The objective of the course is to help develop analytic skills in the identification of key issues and in the formulation of appropriate strategies for firms, both established and entrepreneurial, facing complex business situations. We also examine the process through which strategic decisions are made and implemented and discuss how strategy is different in the age of the internet.","prereq":[]}]