[
  {
    "code": "VMED 5060",
    "subject": "VMED",
    "id": "5060",
    "title": "Financial Planning",
    "info": "Principles/practice of farm/personal finance, interpreting financial statements, calculating financial return, setting goals, budgeting, analysis of decision making, time value of money, comparisons on investments, portfolio diversification, analysis of risk, impact of asset allocation.",
    "prereq": []
  },
  {
    "code": "VMED 5073",
    "subject": "VMED",
    "id": "5073",
    "title": "Prob Dis Cont Erad",
    "info": "Past and present disease control and eradication programs; factors influencing success and failure. Development of models for programs in the United States or a foreign country for group evaluation and analysis.",
    "prereq": []
  },
  {
    "code": "VMED 5080",
    "subject": "VMED",
    "id": "5080",
    "title": "Prob Vet Epi PHlth",
    "info": "Individual study on problem of interest to epidemiology or public health student.",
    "prereq": []
  },
  {
    "code": "VMED 5082",
    "subject": "VMED",
    "id": "5082",
    "title": "Diag Epi of Infectious Disease",
    "info": "Theoretical principles, practical applications of diagnostic testing in populations. Examples related to infectious diseases in veterinary/human health. Basis of test performance, limitations, interpretations.\n\nprereq: Statistics course or instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5090",
    "subject": "VMED",
    "id": "5090",
    "title": "Seminar: Vet Epi",
    "info": "Each student leads at least one seminar. Reviews of current research, literature reviews, and technique development. Students and participating faculty participate in presentation, discussion, and administration of the seminars.\n\nprereq: Veterinary Medicine grad student",
    "prereq": []
  },
  {
    "code": "VMED 5093",
    "subject": "VMED",
    "id": "5093",
    "title": "Dir Studies - Pop Med",
    "info": "Directed studies arranged between student and instructor.",
    "prereq": []
  },
  {
    "code": "VMED 5101",
    "subject": "VMED",
    "id": "5101",
    "title": "Basis of Nanoparticle Toxicity",
    "info": "Use of nanotechnology in scientific research. Impact of nanomaterials on biological systems.",
    "prereq": []
  },
  {
    "code": "VMED 5165",
    "subject": "VMED",
    "id": "5165",
    "title": "Surveillance Foodborne Disease",
    "info": "Principles/methods for surveillance of foodborne diseases.  Investigation of outbreaks. Assessment of food safety hazards. Focuses on integration of epidemiologic/lab methods.\n\nprereq: [PUBH 5330, [professional school or grad student]] or instr consent",
    "prereq": {
      "code": "PUBH 5330",
      "subject": "PUBH",
      "id": "5330"
    }
  },
  {
    "code": "VMED 5180",
    "subject": "VMED",
    "id": "5180",
    "title": "Ecology of Infectious Disease",
    "info": "How host, agent, environmental interactions influence transmission of infectious agents. Environmental dissemination, eradication/control, evolution of virulence. Use of analytical/molecular tools.",
    "prereq": []
  },
  {
    "code": "VMED 5181",
    "subject": "VMED",
    "id": "5181",
    "title": "Spatial Analysis Infec Dis Epi",
    "info": "Spatial distribution of disease events. Exposures/outcomes. Factors that determine where diseases occur. Analyzing spatial disease data in public health, geography, epidemiology. Focuses on human/animal health related examples.\n\nprereq: Intro to epidemiology, statistics,",
    "prereq": []
  },
  {
    "code": "VMED 5182",
    "subject": "VMED",
    "id": "5182",
    "title": "Molecular Bio Pub Health Prof",
    "info": "This course focuses on introducing students to molecular biology lab tools that are used to investigate infectious diseases in public health settings.  The course combines laboratory sessions during which students will learn and run molecular assays with computer lab sessions during which students will analyze molecular data.",
    "prereq": []
  },
  {
    "code": "VMED 5190",
    "subject": "VMED",
    "id": "5190",
    "title": "Effective Science Comm",
    "info": "Skills needed to research, organize, develop, and deliver an oral scientific presentation or to assist in finding, compiling, and organizing information for presentations, theses, or papers suitable for publication.\n\nprereq: Grad student",
    "prereq": []
  },
  {
    "code": "VMED 5193",
    "subject": "VMED",
    "id": "5193",
    "title": "Dairy Financial Decisions",
    "info": "Concepts/tools of economic analysis needed to support decision making on dairy farms, particularly as those decisions relate to health, disease impact, nutrition, general farm management.\nPrereq Earned DVM, instr consent.",
    "prereq": []
  },
  {
    "code": "VMED 5196",
    "subject": "VMED",
    "id": "5196",
    "title": "Dairy Production Medicine",
    "info": "Intense eight week course designed to develop advanced knowledge/skills in dairy production medicine. Mixture of lectures, wetlabs, farm investipations, presentations. Held at Dairy Education Center at New Sweden Dairy.\n\nprereq: DVM degree, instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5210",
    "subject": "VMED",
    "id": "5210",
    "title": "Large Animal Physiology I",
    "info": "Review of large animal physiology at level needed for specialty board certification or beginning research. Students present topics in physiology and supplement reading with clinical case material or journal articles.",
    "prereq": []
  },
  {
    "code": "VMED 5211",
    "subject": "VMED",
    "id": "5211",
    "title": "Large Animal Physiology II",
    "info": "Large animal physiology for specialty board certification or beginning research. Students present topics in physiology and supplement reading with clinical case material or journal articles.\n\nprereq: instr consent; 5210 recommended",
    "prereq": {
      "code": "VMED 5210",
      "subject": "VMED",
      "id": "5210"
    }
  },
  {
    "code": "VMED 5212",
    "subject": "VMED",
    "id": "5212",
    "title": "Large Animal Diagn Ultras",
    "info": "Fundamentals of diagnostic ultrasound in large animal patient. Ultrasonography of the equine limbs/joints, large animal abdomen/thorax. Lectures, lab.",
    "prereq": []
  },
  {
    "code": "VMED 5232",
    "subject": "VMED",
    "id": "5232",
    "title": "Clin Vet Derm Path",
    "info": "Microscopic pathology of basic dermatologic reactions and of variable disease states.\n\nprereq: DVM degree or foreign equiv",
    "prereq": []
  },
  {
    "code": "VMED 5240",
    "subject": "VMED",
    "id": "5240",
    "title": "Adv Small Animal Patho I",
    "info": "Biology, physiology, pathophysiology, and medicine of disciplines relevant to companion animals. Pathogenesis/treatment of diseases. Developing hypotheses that can be translated into clinical research.\nPrereq CVM grad student, [DVM or foreign equiv] degree.",
    "prereq": []
  },
  {
    "code": "VMED 5241",
    "subject": "VMED",
    "id": "5241",
    "title": "Adv Small Animal Patho II",
    "info": "Overview of biology, physiology, pathophysiology, and medicine of disciplines. Underlying pathogenesis/treatment of diseases of companion animals. Developing hypotheses that could be translated into clinical research.\nPrereq CVM grad student, [DVM or foreign equiv] degree.",
    "prereq": []
  },
  {
    "code": "VMED 5242",
    "subject": "VMED",
    "id": "5242",
    "title": "Adv Small Animal Patho III",
    "info": "Overview of biology, physiology, pathophysiology, and medicine. Underlying pathogenesis/treatment of diseases of companion animals. Developing hypotheses that could be translated into clinical research.\nPrereq CVM grad student, [DVM or foreign equivalent] degree.",
    "prereq": []
  },
  {
    "code": "VMED 5243",
    "subject": "VMED",
    "id": "5243",
    "title": "Adv Small Animal Patho IV",
    "info": "Overview of biology, physiology, pathophysiology, and medicine. Underlying pathogenesis/treatment of diseases of companion animals. Developing hypotheses that could be translated into clinical research.\nPrereq CVM grad student, [DVM or foreign equiv] degree.",
    "prereq": []
  },
  {
    "code": "VMED 5274",
    "subject": "VMED",
    "id": "5274",
    "title": "Urinary System Disease",
    "info": "Expands on disorders of small animal urinary system. Introduction to core and to additional disorders. ",
    "prereq": []
  },
  {
    "code": "VMED 5291",
    "subject": "VMED",
    "id": "5291",
    "title": "Indep Study Vet Med",
    "info": "Arranged independent study in a clinical area of veterinary medicine. ",
    "prereq": []
  },
  {
    "code": "VMED 5293",
    "subject": "VMED",
    "id": "5293",
    "title": "Dir Studies - Comp Med & Patho",
    "info": "Directed studies arranged between student and instructor.",
    "prereq": []
  },
  {
    "code": "VMED 5295",
    "subject": "VMED",
    "id": "5295",
    "title": "LA Clinical Medicine/Surgery",
    "info": "Hospital cases using standardized format, audiovisual aids. Review literature pertaining to case. One or two cases presented by enrolled participants per month.\n\nprereq: VMed grad student, possess DVM",
    "prereq": []
  },
  {
    "code": "VMED 5310",
    "subject": "VMED",
    "id": "5310",
    "title": "Topics in Vet Clinical Patho",
    "info": "Modified rounds format. Cases from VMC used to explore cytology with associated chemistry/hematology data. Attendees/clinicians can request lab topics for dicussion. Past topics have included lab measurement of chemical analytes, test sensitivity or specificity (e.g., ethylene glycol test, FELV test), lab testing for infectious agents.\n\nprereq: Grad student in CVM",
    "prereq": []
  },
  {
    "code": "VMED 5319",
    "subject": "VMED",
    "id": "5319",
    "title": "Veterinary Gross Pathology",
    "info": "Diagnosing gross lesions of tissues. Evaluating images from wide variety of animals submitted to lab. Mock exams. Students prepare two in-depth reviews on topics covered during in course.\nPrereq Grad student in CMB or [VMED, [DVM degree or foreign equivalent], college consent]",
    "prereq": []
  },
  {
    "code": "VMED 5320",
    "subject": "VMED",
    "id": "5320",
    "title": "Adv. Vet. Systemic Path I",
    "info": "Students review/summarize topics in systemic pathology using veterinary pathology textbooks and relevant updates from pathology and veterinary medical journals. Diagnostic cases in alimentary, respiratory, urinary, cardiovascular, and hematopoietic system pathology. Students give 10-15 presentations with handouts for other students.\n\nprereq: Grad student in VMED or [CMB, [DVM degree or foreign equiv]] or instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5321",
    "subject": "VMED",
    "id": "5321",
    "title": "Adv. Vet. Systemic Path. II",
    "info": "Students review/summarize topics in systemic pathology using veterinary pathology textbooks and relevant updates from pathology and veterinary medical journals. Representative diagnostic cases in endocrine, reproductive, musculoskeletal, nervous, special senses, and integumentary system pathology. Student give 10-15 presentations with handouts for other students.  ",
    "prereq": []
  },
  {
    "code": "VMED 5330",
    "subject": "VMED",
    "id": "5330",
    "title": "Veterinary Descript. Histopath",
    "info": "Weekly, one-hour microscopic slide prsentations, reviews on wide variety of diseases in domestic/non-domestic animals.  Students present microscopic slide cases and prepare discussions about disease entities, differential diagnoses, and ancillary tests.\n\nprereq: Grad student in VMED or [CMB, [DVM degree or foreign equiv]] or instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5380",
    "subject": "VMED",
    "id": "5380",
    "title": "Vet Diagnostic & Comp Patho",
    "info": "Diagnostic skills in gross/microscopic pathology. Students participate in necropsy services of veterinary diagnostic lab, examine carcasses from variety of animals. Case write-ups, interpretation of gross/microscopic lesions done under supervision of faculty pathologists. Students assist in supervision of veterinary students on senior necropsy rotation.",
    "prereq": []
  },
  {
    "code": "VMED 5395",
    "subject": "VMED",
    "id": "5395",
    "title": "Prob in Vet and Comp Pathology",
    "info": "Case material in Veterinary Diagnostic Lab. Students investigate pathogenesis/epidemiology of selected disease condition or case-related problem agreed upon with faculty pathologist.",
    "prereq": []
  },
  {
    "code": "VMED 5410",
    "subject": "VMED",
    "id": "5410",
    "title": "Scientific Writing & Speaking",
    "info": "Techniques of writing/publishing papers/theses. Manuscript preparation. Submission/review process. Proofreading. Publishing processes. Grant Writing. Oral/poster presentations at sceintific meetings.\n\nprereq: Grad student in health sciences",
    "prereq": []
  },
  {
    "code": "VMED 5420",
    "subject": "VMED",
    "id": "5420",
    "title": "Molecular Epidem Infec Dis",
    "info": "Impact, application, and interpretation of molecular techniques in understanding etiology, transmission, and control of infectious diseases important to animal and public health. Theoretical/practical aspects of molecular biology methods in context of epidemiological studies of infectious diseases, including bacterial/viral infections of veterinary/zoonotic significance. Population and evolutionary genetics of pathogenic microorganisms. Data analysis/interpretation. Design of descriptive/hypothesis-driven epidemiological studies involving molecular techniques.\n\nprereq: Basic course in microbiology",
    "prereq": []
  },
  {
    "code": "VMED 5430",
    "subject": "VMED",
    "id": "5430",
    "title": "HIV/AIDS: Patho, Treatm, Preve",
    "info": "Exposure to pathogenesis, treatment, and prevention of HIV/AIDS from clinical faculty who are dealing with AIDS patients. Developing new questions and design experiments that have greatest chance of translating to clinical setting.\n\nprereq: Grad student",
    "prereq": []
  },
  {
    "code": "VMED 5440",
    "subject": "VMED",
    "id": "5440",
    "title": "Using Risk Analysis Tools",
    "info": "This applications-based course will provide the necessary risk-based tools to evaluate and mitigate the microbial and chemical risks in a food production chain-from the farm until consumption.  Students will follow the risk analysis process as an integral part of  science-based decision-making to estimate and manage food safety risks. Students will apply different qualitative and quantitative tools by using a computer.",
    "prereq": []
  },
  {
    "code": "VMED 5442",
    "subject": "VMED",
    "id": "5442",
    "title": "Quant Mthds Popltn Health",
    "info": "This course reviews the principles and application of advanced methods for analysis of population health data, with a focus on animal health and infectious diseases. Analytical techniques that will be taught and applied during the course include risk assessment, spatial analysis, disease modeling, and disease economics.\n\n",
    "prereq": []
  },
  {
    "code": "VMED 5492",
    "subject": "VMED",
    "id": "5492",
    "title": "One Hlth & Infec Dis Wildlife",
    "info": "The course will explore the applied concept of One Health and infectious diseases of wildlife in weekly case studies. In each case study, students will gain an understanding of system dynamics, infer the interplay between humans, animals and the environment in the context of a given wildlife disease, and confront current disease management practices and challenges for successfully mediating transmission and spread. ",
    "prereq": []
  },
  {
    "code": "VMED 5493",
    "subject": "VMED",
    "id": "5493",
    "title": "Dir Studies - Inf Dis",
    "info": "Directed studies arranged between student and instructor.",
    "prereq": []
  },
  {
    "code": "VMED 5496",
    "subject": "VMED",
    "id": "5496",
    "title": "Training in Swine Prod. Mngmt.",
    "info": "Production module introduces techniques/protocols for swine production system operation. Research module covers applied research trials for viral/bacterial pathogens in pigs.\n\nprereq: VMED grad student or instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5571",
    "subject": "VMED",
    "id": "5571",
    "title": "Biohazard Vet Med",
    "info": "For veterinary medicine graduate students who expect to assume supervisory responsibility for design and safe operation of laboratories in veterinary research, teaching, regulatory, or commercial institutions.",
    "prereq": []
  },
  {
    "code": "VMED 5594",
    "subject": "VMED",
    "id": "5594",
    "title": "Research Veterinary Medicine",
    "info": "Independent study as determined by instructor. Usual activity includes conducting research in instructor's lab, though research in field may also be included.\n\nprereq: Jr, instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5596",
    "subject": "VMED",
    "id": "5596",
    "title": "Swine Dis Diagn",
    "info": "Review of recent advances in swine diseases; farm visits for on-farm disease diagnostics and control programs.",
    "prereq": []
  },
  {
    "code": "VMED 5610",
    "subject": "VMED",
    "id": "5610",
    "title": "Companion Animal Oncology",
    "info": "Principles of veterinary oncology. Biologic behaviors, treatments, and prognosis of neoplastic disorders.",
    "prereq": []
  },
  {
    "code": "VMED 5621",
    "subject": "VMED",
    "id": "5621",
    "title": "Prin Veterinary Anesthesiology",
    "info": "In-depth training in principles of veterinary anesthesiology. Lectures, anesthesia labs, presentations by students.\n\nprereq: VMed grad student, [DVM degree or foreign equiv], instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5670",
    "subject": "VMED",
    "id": "5670",
    "title": "Bovine Surgery Practicum",
    "info": "Intensive training in ruminant surgery. Evaluation of food animal surgery principles, hands-on laboratory components.\n\nprereq: [VMed grad student, [DVM or equiv foreign degree]] or instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5691",
    "subject": "VMED",
    "id": "5691",
    "title": "Ind Res Vet  Anesthesiology",
    "info": "Independent research supervised by faculty member.",
    "prereq": []
  },
  {
    "code": "VMED 5693",
    "subject": "VMED",
    "id": "5693",
    "title": "Dir Studies - SRA",
    "info": "Directed studies arranged between student and instructor.",
    "prereq": []
  },
  {
    "code": "VMED 5720",
    "subject": "VMED",
    "id": "5720",
    "title": "SA Orthopedic Radiology",
    "info": "Roentgen signs of common bone diseases of small animals. ",
    "prereq": []
  },
  {
    "code": "VMED 5722",
    "subject": "VMED",
    "id": "5722",
    "title": "Lag Anim Ortho Rad",
    "info": "Roentgen signs of common bone diseases of large animals. Emphasizes the horse.",
    "prereq": []
  },
  {
    "code": "VMED 5881",
    "subject": "VMED",
    "id": "5881",
    "title": "Food Prod, Proc, Sply Chain",
    "info": "Food commodities and agricultural crops play critical roles relevant to public health, energy and economic vitality, feeding the increasing global human population, and providing multiple outputs from feed for animals, to fuel for vehicles, transportation and energy. This course focuses on agricultural commodities. For 2019 we will focus on corn and dairy production systems in Minnesota. The commodity of interest will change from year-to-year to other commodities like pork and sugar beets – which provide critical outputs for the state of Minnesota. ",
    "prereq": []
  },
  {
    "code": "VMED 5893",
    "subject": "VMED",
    "id": "5893",
    "title": "Dir Studies - Therio",
    "info": "Directed studies arranged between student and instructor.",
    "prereq": []
  },
  {
    "code": "VMED 5895",
    "subject": "VMED",
    "id": "5895",
    "title": "Vet Pub Hlth Learning Exper",
    "info": "Part of the curriculum for the master's degree includes an opportunity for students to develop a written document detailing applications of public health practice. Completion of the ILE allows students to synthesize aspects of public health into a document that can be utilized by public health professionals.   ",
    "prereq": []
  },
  {
    "code": "VMED 5896",
    "subject": "VMED",
    "id": "5896",
    "title": "Application of Vet Pub Hlth",
    "info": "The APEx, applied practice experience provides students an opportunity to learn first-hand about the organization, operations, and special activities of selected agencies, institutions and industries concerned with public health practice. This is a means of gaining additional insight into public health programs, personnel management, governmental relations, public relations, legislative support and, particularly, knowledge of special investigations or responses conducted by these organizations. Participation in the activities of public health practice programs external to the University adds a dimension of experience to the curriculum that enriches the student's training and may be beneficial in seeking employment.",
    "prereq": []
  },
  {
    "code": "VMED 5910",
    "subject": "VMED",
    "id": "5910",
    "title": "Grantwriting",
    "info": "Components of a strong proposal. Grant submission process. What reviewers look for. How to locate grant announcements that match research interests.",
    "prereq": []
  },
  {
    "code": "VMED 5915",
    "subject": "VMED",
    "id": "5915",
    "title": "Essential Stats for Life Sci",
    "info": "This course is a broad overview of the principles and methods of statistical analysis used in life sciences research, including biological, veterinary, and translational research, and provides the background a new researcher needs to understand and apply commonly used statistical methods and the preparation needed for more advanced coursework.\n\nClasses will include general instruction and background information, detailed examples of how to perform the analyses, with actual data sets, and discussion on how the topic has been applied in biological research, including reading and assessing papers in the field. Computing will be performed using the R software environment, though students may use alternate software with permission.\n\nTopics will include:\n\n Descriptive statistics and exploratory graphics\n Understanding statistical inference and interpreting P-values and confidence intervals.\n One and two sample inference, including t-tests, proportion tests, and non-parametric alternatives\n Linear regression, including the effects of confounders\n ANOVA methods, including pairwise comparisons and multiple comparisons",
    "prereq": []
  },
  {
    "code": "VMED 5920",
    "subject": "VMED",
    "id": "5920",
    "title": "Food Defense: Prep, Rspd, Rcvr",
    "info": "Basic principles of preparedness/emergency response. Instructor may substitute topics if timelier topic arises.\n\nprereq: Grad or professional student or instr consent",
    "prereq": []
  },
  {
    "code": "VMED 5921",
    "subject": "VMED",
    "id": "5921",
    "title": "Food Defense Awareness",
    "info": "Protecting your Lunch: Food Defense Awareness presents current issues, challenges, concerns, and activities impacting global food defense. \\\"Food Defense\\\" is the sum of actions and activities related to prevention, protection, mitigation, response, and recovery of the food system from intentional acts of adulteration and disruption. This includes intentional acts from both terrorism and criminal activities. This topics course incorporates case studies as well as current events that directly relate to food system disruption, cause food supply chain interruption, or may provoke intentional adulteration or food fraud.",
    "prereq": []
  },
  {
    "code": "VMED 5930",
    "subject": "VMED",
    "id": "5930",
    "title": "AMR: One Health Perspective",
    "info": "Fundamentals of antimicrobial resistance (AMR) development, transmission, and risks to humans, animals, and the environment delivered by experts in the One Health concept (interconnection between people, animals, plants, and their shared environment). Review and development of research-based resources and methods for communicating scientific information to non-academic audiences. Multi-institution collaboration with online engagement during class meetings.",
    "prereq": []
  },
  {
    "code": "VMED 5989",
    "subject": "VMED",
    "id": "5989",
    "title": "Intro to Applied Health Policy",
    "info": "This course introduces students to policy analysis and leadership tools to navigate the complexities of policy-making and foster policy dialogue and action. We will apply a health lens to discuss contemporary policy issues, explore the different stages of the policy cycle, map the polarities of complex challenges, and apply implementation science techniques to guide policies from theory to impact. May be of particular interest to graduate students in the academic health sciences or HHH/OLPD.\n\nprereq: Graduate or professional degree in-progress or completed.",
    "prereq": []
  },
  {
    "code": "VMED 5990",
    "subject": "VMED",
    "id": "5990",
    "title": "Vet Public Practice Seminar",
    "info": "Interactive review of current public practice topics in \nenvironmental health/toxicology, infectious/parasitic diseases, public health administration/education, epidemiology and biostatistics, and food safety.",
    "prereq": []
  },
  {
    "code": "VMED 5994",
    "subject": "VMED",
    "id": "5994",
    "title": "Adv Clinical Epi",
    "info": "An in-depth focus on infectious disease epidemiology, with opportunities to apply epidemiologic principles to control infectious diseases in animal populations.",
    "prereq": []
  },
  {
    "code": "VMED 5998",
    "subject": "VMED",
    "id": "5998",
    "title": "Ldrshp to Addr Global Grand Ch",
    "info": "In this 5-day skills-based course, participants will learn and apply integrative leadership (also known as shared or facilitative leadership) strategies for addressing global grand challenges. Using global food system challenges as a basis for exploration, we will focus on leadership practices that foster collective action across diverse groups of people.",
    "prereq": []
  },
  {
    "code": "VMED 6008",
    "subject": "VMED",
    "id": "6008",
    "title": "Intro to Teaching Skills",
    "info": "This is a hybrid series of modules and face-to-face course sessions, and experiential learning guiding veterinary students through best practices to enhance efficacy as an instructor in a veterinary curriculum. Specific topics include learning theory, building a course session, teaching presentations, and individual student assessment.",
    "prereq": []
  },
  {
    "code": "VMED 7000",
    "subject": "VMED",
    "id": "7000",
    "title": "Veterinary Public Prac Seminar",
    "info": "Interactive review of current public practice topics in infectious and parasitic diseases, epidemiology and stats, food safety, environmental health, and toxicology.  ",
    "prereq": []
  },
  {
    "code": "VMED 7842",
    "subject": "VMED",
    "id": "7842",
    "title": "Adv Sw Dis",
    "info": "Lectures and discussion on advances in diseases of swine.",
    "prereq": []
  },
  {
    "code": "VMED 7844",
    "subject": "VMED",
    "id": "7844",
    "title": "Swine Production Systems",
    "info": "Swine production systems.  Design, construction, staffing, pig flow, and financial aspects.",
    "prereq": []
  },
  {
    "code": "VMED 7846",
    "subject": "VMED",
    "id": "7846",
    "title": "Swine Nutrition",
    "info": "Nutritional principles and concepts in swine nutrition.",
    "prereq": []
  },
  {
    "code": "VMED 7850",
    "subject": "VMED",
    "id": "7850",
    "title": "Swine Records",
    "info": "How to interpret data from computer health management program.",
    "prereq": []
  },
  {
    "code": "VMED 7991",
    "subject": "VMED",
    "id": "7991",
    "title": "An Hlth Fd Sys Policy Intergov",
    "info": "Evidence-based policy development. Relevant global animal health and food system issue. Role of scientific evidence in developing/implementing policy and in intergovernmental organization's policy development. Policy-making process as it pertains to trade, animal health, and food system across intergovernmental organizations. ",
    "prereq": []
  },
  {
    "code": "VMED 7992",
    "subject": "VMED",
    "id": "7992",
    "title": "An Hlth Fd Sys Policy Ntnl Gov",
    "info": "Evidence-based policy development for a global animal health and food system issue. Visits to Washington, DC. Interactions with key leaders from various organizations/agencies. Integrating skills in animal health, public health, communication, and food security with national/international animal health policy.",
    "prereq": []
  },
  {
    "code": "VMED 7993",
    "subject": "VMED",
    "id": "7993",
    "title": "An Hlth Fd Sy Policy State Gov",
    "info": "Policy-making process as it pertains to animal health, public health, and food systems at the state and provincial levels. Global animal health, public health, and food system issue with a particular emphasis on the interplay of science, politics and belief in developing and implementing policy associated. ",
    "prereq": []
  },
  {
    "code": "VMED 7994",
    "subject": "VMED",
    "id": "7994",
    "title": "Engaging Intergovernmental Org",
    "info": "How to engage intergovernmental organizations in global policy development for trade, capacity building, and development. Students develop a network of contacts in organizations to access additional reference materials, understand who to contact for specific issues. Intergovernmental organizations: World Trade Organization, World Health Organization, World Organization for Animal Health and Food and Agriculture Organization of the United Nations. Impacting veterinary public health domestically/globally.",
    "prereq": []
  },
  {
    "code": "VMED 8090",
    "subject": "VMED",
    "id": "8090",
    "title": "Epi Zoonoses",
    "info": "Major human zoonotic diseases, methods of transmission, diagnosis, control, and prevention.\n\nprereq: Epidemiology and infectious disease course or instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8134",
    "subject": "VMED",
    "id": "8134",
    "title": "Ethical Conduct/An Research",
    "info": "Ethical considerations in use of animal subjects in agricultural, veterinary, and biomedical research. Federal, state, and University guidelines relating to proper conduct for acquisition/use of animals for laboratory, observational, epidemiological, and clinical research. Regulatory requirements. Bases for proper conduct. Societal impact on scientific investigations utilizing animal subjects.",
    "prereq": []
  },
  {
    "code": "VMED 8192",
    "subject": "VMED",
    "id": "8192",
    "title": "Dairy Hlth Mngmnt: Crit Think",
    "info": "Group discussions surrounding critical evaluations of scientific journal articles and dairy-related scientific presentations. Facilitated by both students and faculty.",
    "prereq": []
  },
  {
    "code": "VMED 8193",
    "subject": "VMED",
    "id": "8193",
    "title": "Welfare of Farmed Animals",
    "info": "This course covers topics on the evaluation and assessment of the welfare of farmed animals. Literature review, discussions, and analyses are used to increase skills needed to evaluate methods for improving the welfare of farmed animals in various situations.",
    "prereq": []
  },
  {
    "code": "VMED 8195",
    "subject": "VMED",
    "id": "8195",
    "title": "Food Safety, VPH",
    "info": "Includes presentations and discussions on on-farm HACCP principles and prudent use of antibiotics.",
    "prereq": []
  },
  {
    "code": "VMED 8201",
    "subject": "VMED",
    "id": "8201",
    "title": "Adv Sm An Vet Med",
    "info": "Discussions of diseases of organs or systems in animals, including degenerative, psychological, anomolous, metabolic, nutritional, neoplastic, immune, inflammatory, toxic, and traumatic disorders. ",
    "prereq": []
  },
  {
    "code": "VMED 8202",
    "subject": "VMED",
    "id": "8202",
    "title": "Int Med Sm Anim",
    "info": "Lectures, assigned readings, and discussions on internal medical problems of dogs and cats.",
    "prereq": []
  },
  {
    "code": "VMED 8203",
    "subject": "VMED",
    "id": "8203",
    "title": "Adv Dx Rx Anim Dis",
    "info": "Detailed examination, treatment, and discussion of naturally occurring disease in patients admitted to Veterinary Medical Center.",
    "prereq": []
  },
  {
    "code": "VMED 8210",
    "subject": "VMED",
    "id": "8210",
    "title": "Seminar Vet Med",
    "info": "Participation and presentations of regularly scheduled seminars about internal medicine.",
    "prereq": []
  },
  {
    "code": "VMED 8220",
    "subject": "VMED",
    "id": "8220",
    "title": "Adv Nephr/Uro Clin",
    "info": "Clinical investigation of naturally occurring urinary diseases in patients admitted to Veterinary Medical Center.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8230",
    "subject": "VMED",
    "id": "8230",
    "title": "Med Conf",
    "info": "Participation in weekly conference about internal medical disorders.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8250",
    "subject": "VMED",
    "id": "8250",
    "title": "Acid-Base, Lytes",
    "info": "Clinical problems and physiology of acid-base, electrolyte, and fluid disorders of dogs and cats.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8292",
    "subject": "VMED",
    "id": "8292",
    "title": "Journ Club: Lrg Anim Int Med",
    "info": "Students/faculty keep abreast of current literature in large animal internal medicine. Students critically evaluate the literature.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8293",
    "subject": "VMED",
    "id": "8293",
    "title": "Adv Stu Neph/Uro",
    "info": "Studies of urinary tract disease with goal of generating new knowledge.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8294",
    "subject": "VMED",
    "id": "8294",
    "title": "Res Nephrol/Urology",
    "info": "Individual research on selected problems",
    "prereq": []
  },
  {
    "code": "VMED 8296",
    "subject": "VMED",
    "id": "8296",
    "title": "Adv Lg An Vet Med",
    "info": "Discussions of diseases of organs or systems in animals in a clinical setting.",
    "prereq": []
  },
  {
    "code": "VMED 8333",
    "subject": "VMED",
    "id": "8333",
    "title": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": []
  },
  {
    "code": "VMED 8360",
    "subject": "VMED",
    "id": "8360",
    "title": "Evidence Based Med",
    "info": "Concepts of evidence-based medicine with emphasis on veterinary clinical evidence will be presented. Clinical questions, development of study designs, identification of literature and assessment of the impact of the literature on clinical decisions.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8385",
    "subject": "VMED",
    "id": "8385",
    "title": "Vet Clin Skills Teach & Pract",
    "info": "This course involves directed work in the best practices for general veterinary clinical teaching and specific veterinary clinical skills teaching, and applying those practices in teaching laboratories for 1st, 2nd and 3rd year veterinary students. It is intended for U of MN graduate students who have a DVM or equivalent degree and  will potentially  be involved in clinical teaching of DVM students in their future career plans.",
    "prereq": []
  },
  {
    "code": "VMED 8386",
    "subject": "VMED",
    "id": "8386",
    "title": "Vet Clin Skills Lab Teaching",
    "info": "This course involves directed work in the best practices for general veterinary clinical teaching and specific veterinary clinical skills teaching, and applying those practices in teaching laboratories for 1st, 2nd, and 3rd year veterinary students. It is intended for U of MN graduate students who have a DVM or equivalent degree and  will potentially  be involved in clinical teaching of DVM students in their future career plans. There are 9 required laboratory teaching sessions as assigned by the laboratory instructor in the spring and for any semesters as determined in consultation with the student about their areas of knowledge and interest for teaching clinical skills.",
    "prereq": []
  },
  {
    "code": "VMED 8393",
    "subject": "VMED",
    "id": "8393",
    "title": "Med Conf",
    "info": "Medical, surgical, or obstetrical cases supported by anatomic, bacteriologic, pathologic, physiologic, pharmacologic, and radiologic evaluations whenever applicable.",
    "prereq": []
  },
  {
    "code": "VMED 8394",
    "subject": "VMED",
    "id": "8394",
    "title": "Research Vet Med",
    "info": "Research problems relating to any aspect of internal medicine or to the various systems in animals.\n\nprereq: instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8396",
    "subject": "VMED",
    "id": "8396",
    "title": "Diag An Dis",
    "info": "Detailed examination, discussions, and treatments of cases of animal diseases in a clinical setting.",
    "prereq": []
  },
  {
    "code": "VMED 8444",
    "subject": "VMED",
    "id": "8444",
    "title": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": []
  },
  {
    "code": "VMED 8492",
    "subject": "VMED",
    "id": "8492",
    "title": "Sem: Inf Dis SwMed",
    "info": "Students, faculty, and guest speakers present seminars on current research in diagnosis, control, and treatment of infectious diseases.",
    "prereq": []
  },
  {
    "code": "VMED 8494",
    "subject": "VMED",
    "id": "8494",
    "title": "Res Infect Dis",
    "info": "Directed research.",
    "prereq": []
  },
  {
    "code": "VMED 8495",
    "subject": "VMED",
    "id": "8495",
    "title": "Prob Infect Dis",
    "info": "In-depth discussion on specific problems for various infectious diseases of farm animals.",
    "prereq": []
  },
  {
    "code": "VMED 8504",
    "subject": "VMED",
    "id": "8504",
    "title": "Translational Animal Models",
    "info": "This course will be taught by experts who have successfully developed or utilized translational animal\nmodels of human diseases. An overview of comparative and translational research will be presented and\ndiscussed including a comparison of naturally occurring vs experimental models of diseases. We will\nreview 12 animal models and use them as examples to discuss the challenges faced during model\ndevelopment, relevance of the selected models to other animal species and humans, and the\nadvantages/disadvantages of each animal model. Strategies to determine when an animal model is\nappropriate for a given application will be discussed. During this course each participant will develop and\npresent their own idea of a translational animal model (naturally occurring or experimental) in their area\nof research interest.\nThe class will be alternate each week between the participating institutions. It will be held in person by\nthe hosting institution and participants from other institutions and will participate via Zoom or another\nonline platform. The instructor will generally be located at the host institution and will participate in\nperson at that school, but occasionally instructors will participate remotely via Zoom.",
    "prereq": []
  },
  {
    "code": "VMED 8520",
    "subject": "VMED",
    "id": "8520",
    "title": "Adv Immunol",
    "info": "Lectures and case presentations.",
    "prereq": []
  },
  {
    "code": "VMED 8530",
    "subject": "VMED",
    "id": "8530",
    "title": "Adv Sw Dis",
    "info": "Lectures and discussion on advances.",
    "prereq": []
  },
  {
    "code": "VMED 8550",
    "subject": "VMED",
    "id": "8550",
    "title": "VMED Seminar",
    "info": "Seminar. Exposure to research activities of CMB and VMED students and faculty. Students prepare/present a 20 minute seminar on their original research.\n\nprereq: Grad student",
    "prereq": []
  },
  {
    "code": "VMED 8560",
    "subject": "VMED",
    "id": "8560",
    "title": "Research & Literature Vet Med",
    "info": "A combination of literature review, group discussions and analyses are utilized to improve participants' capacity to critically evaluate scientific journal articles. Scientific research presentations will be led by students or faculty.  ",
    "prereq": []
  },
  {
    "code": "VMED 8592",
    "subject": "VMED",
    "id": "8592",
    "title": "InfDisJnlsCritRead",
    "info": "This course is intended to discuss published papers, experimental methods, approaches, diseases and animal health problems with the goal of promoting critical thinking. Students will be responsible for identifying, reviewing and sharing relevant material as well as leading discussion of their assigned class meeting.  ",
    "prereq": []
  },
  {
    "code": "VMED 8593",
    "subject": "VMED",
    "id": "8593",
    "title": "AdvVet Virol/Serol",
    "info": "Discussion and laboratory practice.",
    "prereq": []
  },
  {
    "code": "VMED 8666",
    "subject": "VMED",
    "id": "8666",
    "title": "Doct Pre-Thesis Cr",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {
      "code": "VMED 60",
      "subject": "VMED",
      "id": "60"
    }
  },
  {
    "code": "VMED 8679",
    "subject": "VMED",
    "id": "8679",
    "title": "Prob VetCritCare",
    "info": "",
    "prereq": []
  },
  {
    "code": "VMED 8680",
    "subject": "VMED",
    "id": "8680",
    "title": "AdvVetCritCareEmer",
    "info": "Discussions of current topics, focusing on literature and research results in periodicals, proceedings, texts.",
    "prereq": []
  },
  {
    "code": "VMED 8681",
    "subject": "VMED",
    "id": "8681",
    "title": "Adv Sm An Surg",
    "info": "Advanced techniques and procedures.",
    "prereq": []
  },
  {
    "code": "VMED 8682",
    "subject": "VMED",
    "id": "8682",
    "title": "Adv Lg An Surg",
    "info": "Surgery of various systems in large animals, with preoperative and postoperative evaluation and management.\n\nprereq: DVM or equiv degree, instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8683",
    "subject": "VMED",
    "id": "8683",
    "title": "G.I. Surg",
    "info": "Advanced techniques and problems.",
    "prereq": []
  },
  {
    "code": "VMED 8684",
    "subject": "VMED",
    "id": "8684",
    "title": "Surg Phys",
    "info": "Discussions on pathophysiology of surgical diseases in dogs and cats.",
    "prereq": []
  },
  {
    "code": "VMED 8685",
    "subject": "VMED",
    "id": "8685",
    "title": "NeuroSurg",
    "info": "Advanced neurosurgical diseases of small animals amenable to surgical treatment.",
    "prereq": []
  },
  {
    "code": "VMED 8686",
    "subject": "VMED",
    "id": "8686",
    "title": "Thor & CV Surg",
    "info": "Advanced thoracic and cardiovascular diseases of small animals amenable to surgical treatment.",
    "prereq": []
  },
  {
    "code": "VMED 8687",
    "subject": "VMED",
    "id": "8687",
    "title": "Plast & Recon Surg",
    "info": "Advanced techniques in conditions of small animals.",
    "prereq": []
  },
  {
    "code": "VMED 8688",
    "subject": "VMED",
    "id": "8688",
    "title": "New Tech Lg An Sx",
    "info": "New techniques in large animal surgery.",
    "prereq": []
  },
  {
    "code": "VMED 8689",
    "subject": "VMED",
    "id": "8689",
    "title": "Urogen Surg",
    "info": "Advanced techniques in treatment of small animals.",
    "prereq": []
  },
  {
    "code": "VMED 8691",
    "subject": "VMED",
    "id": "8691",
    "title": "Res: Lg An Surg",
    "info": "Independent research projects.",
    "prereq": []
  },
  {
    "code": "VMED 8692",
    "subject": "VMED",
    "id": "8692",
    "title": "Sem Sm An Surg",
    "info": "Discussions of problems and case analysis.",
    "prereq": []
  },
  {
    "code": "VMED 8693",
    "subject": "VMED",
    "id": "8693",
    "title": "Sem: Lg An Vet Sx",
    "info": "Discussion of current literature and surgery board preparation.\n\nprereq: DVM or equiv degree, instr consent",
    "prereq": []
  },
  {
    "code": "VMED 8694",
    "subject": "VMED",
    "id": "8694",
    "title": "Res Vet Surg",
    "info": "Research in small animal surgery.",
    "prereq": []
  },
  {
    "code": "VMED 8695",
    "subject": "VMED",
    "id": "8695",
    "title": "Prob in Lg An Surg",
    "info": "New techniques and procedures in large animal orthopedic surgery.",
    "prereq": []
  },
  {
    "code": "VMED 8696",
    "subject": "VMED",
    "id": "8696",
    "title": "ResCritCare/EmerMed",
    "info": "Special problems course. Controlled study; prospective and retrospective models of evaluation are defined, critiqued, and used for experimental design and data collection to validate research methods.\n\nprereq: DVM or equiv degree",
    "prereq": []
  },
  {
    "code": "VMED 8777",
    "subject": "VMED",
    "id": "8777",
    "title": "Thesis Credit:Mast*",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {
      "code": "VMED 10",
      "subject": "VMED",
      "id": "10"
    }
  },
  {
    "code": "VMED 8780",
    "subject": "VMED",
    "id": "8780",
    "title": "Av Crit Care",
    "info": "Procedures and protocols for managing avian medical emergencies such as starvation, toxicities, respiratory failure, and massive trauma.\n\nprereq: Course each in vet pathology, physiology, pharmacology, anatomy, small animal anesthesiology and critical care",
    "prereq": []
  },
  {
    "code": "VMED 8781",
    "subject": "VMED",
    "id": "8781",
    "title": "SEM: Adv Vet Anes",
    "info": "Active interaction around topics of advanced anesthesiology in veterinary species.\n\nprereq: [[CVM 6321, CVM 6322] or equiv], grad student",
    "prereq": {
      "and": [
        {
          "code": "CVM 6321",
          "subject": "CVM",
          "id": "6321"
        },
        {
          "code": "CVM 6322",
          "subject": "CVM",
          "id": "6322"
        }
      ]
    }
  },
  {
    "code": "VMED 8782",
    "subject": "VMED",
    "id": "8782",
    "title": "Adv Vet Abd Imag",
    "info": "Applications and discussion of basic principles through emerging techniques.",
    "prereq": []
  },
  {
    "code": "VMED 8783",
    "subject": "VMED",
    "id": "8783",
    "title": "Adv Vet Thorac Imag",
    "info": "Application and discussion of basic principles through emerging techniques.",
    "prereq": []
  },
  {
    "code": "VMED 8784",
    "subject": "VMED",
    "id": "8784",
    "title": "Vet Thera Rad",
    "info": "In-depth discussion of principles, practice, techniques, and complications.",
    "prereq": []
  },
  {
    "code": "VMED 8785",
    "subject": "VMED",
    "id": "8785",
    "title": "Vet Nuc Med",
    "info": "In-depth discussion of principles, practice, techniques, and complications. ",
    "prereq": []
  },
  {
    "code": "VMED 8788",
    "subject": "VMED",
    "id": "8788",
    "title": "SemVetCritCare/Emer",
    "info": "Current topics.\n\nprereq: DVM or equiv degree",
    "prereq": []
  },
  {
    "code": "VMED 8789",
    "subject": "VMED",
    "id": "8789",
    "title": "Res Av C PP",
    "info": "Students conduct medical and surgical procedures involved in management of avian trauma and critical care patients.",
    "prereq": []
  },
  {
    "code": "VMED 8791",
    "subject": "VMED",
    "id": "8791",
    "title": "Res Vet Anes",
    "info": "Research methodology; controlled prospective and retrospective research studies. Collection and analysis of scientific data.",
    "prereq": []
  },
  {
    "code": "VMED 8792",
    "subject": "VMED",
    "id": "8792",
    "title": "Sem Vet Radiol",
    "info": "Current topics in veterinary imaging, veterinary radiation therapy, or specific applications.",
    "prereq": []
  },
  {
    "code": "VMED 8793",
    "subject": "VMED",
    "id": "8793",
    "title": "Sem: Vet Anes",
    "info": "Discussion and presentations; for veterinary anesthesiology and surgery residents and graduate students.\n\nprereq: [CVM 6321 or equiv], DVM degree",
    "prereq": {
      "code": "CVM 6321",
      "subject": "CVM",
      "id": "6321"
    }
  },
  {
    "code": "VMED 8794",
    "subject": "VMED",
    "id": "8794",
    "title": "Res Vet Radiol",
    "info": "Research into an application, development of an application, or prospective/retrospective study of any aspect of veterinary imaging or veterinary radiotherapy.",
    "prereq": []
  },
  {
    "code": "VMED 8795",
    "subject": "VMED",
    "id": "8795",
    "title": "Prob Vet Radiol",
    "info": "Discussion of problems associated with veterinary imaging or radiation therapy.",
    "prereq": []
  },
  {
    "code": "VMED 8796",
    "subject": "VMED",
    "id": "8796",
    "title": "Av An Surg",
    "info": "Current methods for anesthetizing raptors, psittacine birds, and waterfowl. Lecture and lab on current methods for avian fracture bone fixation.\n\nprereq: courses in vet anesthesia, vet small animal orthopedics",
    "prereq": []
  },
  {
    "code": "VMED 8882",
    "subject": "VMED",
    "id": "8882",
    "title": "ThJnls: Crit Eval",
    "info": "Reading and presentation of selected current research journal articles; critical evaluation of experimental design, methods, and results.",
    "prereq": []
  },
  {
    "code": "VMED 8888",
    "subject": "VMED",
    "id": "8888",
    "title": "Thesis Credit:Doct*",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": []
  },
  {
    "code": "VMED 8891",
    "subject": "VMED",
    "id": "8891",
    "title": "Seminar Therio",
    "info": "",
    "prereq": []
  },
  {
    "code": "VMED 8893",
    "subject": "VMED",
    "id": "8893",
    "title": "Adv Diag Meth Ther",
    "info": "Directed research in methods for studying fertility factors affecting female and male animal reproduction.",
    "prereq": []
  },
  {
    "code": "VMED 8894",
    "subject": "VMED",
    "id": "8894",
    "title": "Sp Prob in Therio",
    "info": "Specialized and directed scientific readings and discussion; allows for individualizing students' graduate programs.",
    "prereq": []
  },
  {
    "code": "VMED 8910",
    "subject": "VMED",
    "id": "8910",
    "title": "Statistical Principles Rsrch",
    "info": "This course is a broad overview of the principles and techniques of research design and methods used in veterinary and translational research, and provides the background a new researcher needs to understand the literature and make good decisions about what is appropriate for their research.\n\nprereq: entry level graduate stats course or equivalent",
    "prereq": []
  }
]