[
  {
    "code": "WMBA 5600",
    "subject": "WMBA",
    "id": "5600",
    "title": "Mgmt Challenges & Org Behav",
    "info": "Overview of ideas, theories, and concepts of organizational/management systems. Perspectives on organizations.",
    "prereq": []
  },
  {
    "code": "WMBA 5601",
    "subject": "WMBA",
    "id": "5601",
    "title": "Data Analysis",
    "info": "Exploratory data analysis, basic inferential procedures, statistical process control, regression analysis.",
    "prereq": []
  },
  {
    "code": "WMBA 5602",
    "subject": "WMBA",
    "id": "5602",
    "title": "Business Law",
    "info": "Origin of law; its place in, effect upon society. History/development of law. System of courts, legal procedure. Extensive study of law of contracts as basic law affecting business transactions. Law affecting sales of goods contracts.",
    "prereq": []
  },
  {
    "code": "WMBA 5603",
    "subject": "WMBA",
    "id": "5603",
    "title": "Fin Acct",
    "info": "Introduction to accounting system used by firms to measure/report their economic performance, financial position, to external constituents such as stock holders, debt holders, potential investors. Basic accounting model, its strengths/shortcomings.",
    "prereq": []
  },
  {
    "code": "WMBA 5604",
    "subject": "WMBA",
    "id": "5604",
    "title": "Mgr Econ",
    "info": "Basic economics principals that provide overall view of competition/cooperation in different environments. Emphasizes practical implications (i.e., ways principles can be incorporated to improve decision-making process of managers).",
    "prereq": []
  },
  {
    "code": "WMBA 5605",
    "subject": "WMBA",
    "id": "5605",
    "title": "Business Ethics",
    "info": "Ethical dimension of business decision making in a market economy. Does behaving ethically mean more than behaving legally? Do managers have responsibilities to parties other than stockholders? How can managers balance potentially conflicting obligations? Is there a logical/empirical relationship between ethical behavior and profitability? Ethical dilemmas in a variety of business settings.",
    "prereq": []
  },
  {
    "code": "WMBA 5606",
    "subject": "WMBA",
    "id": "5606",
    "title": "Econ Essentials for Business",
    "info": "Managerial economics, economics of public sector. Tools of economists. The market, the state.",
    "prereq": []
  },
  {
    "code": "WMBA 5607",
    "subject": "WMBA",
    "id": "5607",
    "title": "Pln in Pub Sect",
    "info": "Concepts/issues in planning as a profession. Historical development of planning as a public activity, linkages to design professions and to politics. Organization/role of planning in public agencies, private organizations.",
    "prereq": []
  },
  {
    "code": "WMBA 5608",
    "subject": "WMBA",
    "id": "5608",
    "title": "Mgr Acct",
    "info": "Introduction to costing systems used by firms. How cost accounting data is used by managers to make decisions about resource allocation, performance evaluation. Cost information systems for planning, decision making, control.",
    "prereq": []
  },
  {
    "code": "WMBA 5609",
    "subject": "WMBA",
    "id": "5609",
    "title": "Mktg Mgmt",
    "info": "Marketing management process/activities. Marketing concepts/techniques. Implications (e.g., strategic, organizational) for business problems. Analytic/managerial processes that lead to effective marketing under various conditions.",
    "prereq": []
  },
  {
    "code": "WMBA 5610",
    "subject": "WMBA",
    "id": "5610",
    "title": "Ops Mgmt",
    "info": "Operations management as a critical element of manufacturing/service organizations in global marketplace. Theory behind operation management. Current/emerging perspectives, state of the art practice. Literature, cases, video excerpts.",
    "prereq": []
  },
  {
    "code": "WMBA 5611",
    "subject": "WMBA",
    "id": "5611",
    "title": "Fin Mgmt",
    "info": "Introduction to theory/practice of financial management. Valuation of securities, risk/return trade-off, capital budgeting, optimal investment decisions, cost of capital, debt/equity choices, financial planning, valuation of operating plans.",
    "prereq": []
  },
  {
    "code": "WMBA 5612",
    "subject": "WMBA",
    "id": "5612",
    "title": "Logistics Mgmt",
    "info": "Business logistics as field of managerial responsibility. Linkages between logistics and marketing/operations/finance. Complexities associated with physical movement of goods. How complexities affect marketing/operations management activities, financial missions, of firm.",
    "prereq": []
  },
  {
    "code": "WMBA 5613",
    "subject": "WMBA",
    "id": "5613",
    "title": "HR Mgmt",
    "info": "Role/dimensions of human resource management (HRM) in contemporary business organizations. Enhancing the contributions of employees toward the effectiveness of an organization. HRM strategies, activities, policies.",
    "prereq": []
  },
  {
    "code": "WMBA 5614",
    "subject": "WMBA",
    "id": "5614",
    "title": "Strat Mgmt",
    "info": "Integrated top executive viewpoint on successful managing of business companies in a challenging environment. Frameworks for search. Analytical skills for working on projects/teams. Strategic decision-making.",
    "prereq": []
  },
  {
    "code": "WMBA 5615",
    "subject": "WMBA",
    "id": "5615",
    "title": "Intl Mgmt",
    "info": "Introduction to managing international business. Multinational corporations' search for optimum solutions in adapting their strategy. Organizational/managerial arrangements to cross-border, cross-cultural, environmentally diversified activities.",
    "prereq": []
  },
  {
    "code": "WMBA 5616",
    "subject": "WMBA",
    "id": "5616",
    "title": "Bus, Govt and Society",
    "info": "Applying several methods of policy analysis in a variety of real situations drawn from experience of developed market economies. Working alone or in groups, students examine case study on competition policy, trade policy, implementation of cost-benefit analysis, efficient contractor design in business. Applying analytical techniques, presentation skills. Cases, student presentations, class discussion. Seminar.",
    "prereq": []
  },
  {
    "code": "WMBA 5617",
    "subject": "WMBA",
    "id": "5617",
    "title": "Mgmt Info Sys",
    "info": "How information management operates. How a new information system is designed/delivered. Issues connected with Information technology/systems use in the organization.",
    "prereq": []
  },
  {
    "code": "WMBA 5618",
    "subject": "WMBA",
    "id": "5618",
    "title": "Decision Sci",
    "info": "Barriers in business-type decision making processes. Emphasizes different forms of decision making, different methods of overcoming barriers. Managing practical difficulties. Concepts of decision making theory, mechanisms underlying decision making processes. Techniques, computerized tools for supporting decision making. Students participate in group decision making.",
    "prereq": []
  },
  {
    "code": "WMBA 5619",
    "subject": "WMBA",
    "id": "5619",
    "title": "Intl Envir",
    "info": "Introduction to international trade/finance theory, political economy of international trade policy, institutional governance of international trade/monetary policy. Differences in countries' political-economic, sociocultural systems. Implications for managerial decision making.",
    "prereq": []
  },
  {
    "code": "WMBA 5620",
    "subject": "WMBA",
    "id": "5620",
    "title": "Cost Ben Analysis",
    "info": "Methods/techniques of cost-benefit analysis in real situations drawn from experience of post-communist economies. Presentation in two parts: developing economies, developed economies.",
    "prereq": []
  },
  {
    "code": "WMBA 5621",
    "subject": "WMBA",
    "id": "5621",
    "title": "Field Prj",
    "info": "Personal involvement, practical teamwork. Students define problem; gather, analyze, evaluate data; develop managerial recommendations; prepare/present report.",
    "prereq": []
  },
  {
    "code": "WMBA 5623",
    "subject": "WMBA",
    "id": "5623",
    "title": "Strat Chgs in Global Context",
    "info": "Processes for introducing major strategic changes. Focuses on restructuring, realignment, and redirection driven by globalization, formation of EU, and transition from planned economy to market.",
    "prereq": []
  },
  {
    "code": "WMBA 5624",
    "subject": "WMBA",
    "id": "5624",
    "title": "Macro Environment of Bus",
    "info": "Determinants of national income or GDP, national income accounting, money market equilibrium, trade off between inflation/unemployment, roots of income disparities between nations.",
    "prereq": []
  },
  {
    "code": "WMBA 5625",
    "subject": "WMBA",
    "id": "5625",
    "title": "Mgmt Skills",
    "info": "Frameworks from social sciences that are useful for understanding organizational processes. Applying frameworks to particular situations.",
    "prereq": []
  },
  {
    "code": "WMBA 5626",
    "subject": "WMBA",
    "id": "5626",
    "title": "Project Finance",
    "info": "Financing large investment projects such as infrastructure investments. Evaluating project, preparing feasibility study, analyzing project sensitivity to variables. Determining capital structure and management form.",
    "prereq": []
  },
  {
    "code": "WMBA 5627",
    "subject": "WMBA",
    "id": "5627",
    "title": "Business Ethics",
    "info": "Ethical dimension of business decision making in a market economy. Does behaving ethically mean more than behaving legally? Do managers have responsibilities to parties other than stockholders? How can managers balance potentially conflicting obligations? Is there a logical/empirical relationship between ethical behavior and profitability? Ethical dilemmas in a variety of business settings.",
    "prereq": []
  },
  {
    "code": "WMBA 5628",
    "subject": "WMBA",
    "id": "5628",
    "title": "Policy Analysis",
    "info": "Students apply several methods of policy analysis in real situations drawn from experience of developed market economies. Students examine case studies on competition policy, trade policy, implementation of cost-benefit analysis, and efficient contract design in business. Analysis in context, strengths/weaknesses of various analytical techniques/approaches. Seminar. Cases form basis for student presentations/discussion.",
    "prereq": []
  },
  {
    "code": "WMBA 5629",
    "subject": "WMBA",
    "id": "5629",
    "title": "Mgmt Challenges",
    "info": "Overview of ideas, theories, and concepts of complex/hybrid organizational/management systems. Perspectives on organizations.",
    "prereq": []
  },
  {
    "code": "WMBA 5630",
    "subject": "WMBA",
    "id": "5630",
    "title": "Change Management",
    "info": "Overview of theories in managing change.",
    "prereq": []
  },
  {
    "code": "WMBA 5631",
    "subject": "WMBA",
    "id": "5631",
    "title": "Web 2.0: Blogs, Wikis, Soc Net",
    "info": "Business of using social computing technologies. Readings, discussion, and case analysis.\n\nprereq: Warsaw Executive MBA students only",
    "prereq": []
  },
  {
    "code": "WMBA 5650",
    "subject": "WMBA",
    "id": "5650",
    "title": "Mgmt Challenges & Org Behavior",
    "info": "Ideas, theories, and concepts for organizations and management systems in global/networked economy. Comtemporary mega-trends, their business consequences. Complexity/change, crisis in principles of industrial revolution, management for connected economy, virtual organizations, human side of virtual enterprises.",
    "prereq": []
  },
  {
    "code": "WMBA 5651",
    "subject": "WMBA",
    "id": "5651",
    "title": "Human Resources Mgmt",
    "info": "Human resources issues from managerial perspective. External environment in which firm operates, characteristics of its workforce. The firm's developed culture. Strategy of the organization, technology of production, organization of work. Framework for managing human resources strategically.",
    "prereq": []
  },
  {
    "code": "WMBA 5652",
    "subject": "WMBA",
    "id": "5652",
    "title": "Economic Essentials for Bus",
    "info": "Managerial economics, economics of public sector. Some concepts of economics. Tools of an economist, the market, the state.",
    "prereq": []
  },
  {
    "code": "WMBA 5653",
    "subject": "WMBA",
    "id": "5653",
    "title": "Managerial Economics",
    "info": "Tools, economics principles that provide overview of competition/cooperation in different environments. Emphasizes practical implications of principles.",
    "prereq": []
  },
  {
    "code": "WMBA 5654",
    "subject": "WMBA",
    "id": "5654",
    "title": "Business Law",
    "info": "Terms/conditions of commencing/conducting business in Poland. Concepts for entrepreneurs: national court register, enterprise, business name, commercial power of attorney. Corpoarte law, problems regarding bankruptcy/arrangement Law. Concepts of banking/insurance law.",
    "prereq": []
  },
  {
    "code": "WMBA 5655",
    "subject": "WMBA",
    "id": "5655",
    "title": "Data Analysis & Reasoning",
    "info": "Exploratory data analysis, inferential procedures, regression analysis, and time series analysis in a business setting. Overview of graphical/numerical methods for summarizing data. Use of inferential statistics. Focuses on sampling distribution of a statistic.",
    "prereq": []
  },
  {
    "code": "WMBA 5656",
    "subject": "WMBA",
    "id": "5656",
    "title": "Financial Accounting",
    "info": "Introduction to accounting system used by firms to measure/report their economic performance and financial position to external constituents, such as stockholders, creditors, and potential investors. Basic accounting model, its strengths/shortcomings.",
    "prereq": []
  },
  {
    "code": "WMBA 5657",
    "subject": "WMBA",
    "id": "5657",
    "title": "Managerial Accounting",
    "info": "Management accounting information system that produces outputs, using inputs. Processes to satisy specific management objectives. How accounting can help managers identify/solve problems and evaluate performance.",
    "prereq": []
  },
  {
    "code": "WMBA 5658",
    "subject": "WMBA",
    "id": "5658",
    "title": "Financial Management",
    "info": "Essentials of financial management theory/practice. Time value of money, valuation of bonds/stocks, risk/return turn-off, capital budgeting, optimal investment decisions, financial analysis/planning, cost of capital, debt/equity choices, firm valuation, mergers/acquisitions.",
    "prereq": []
  },
  {
    "code": "WMBA 5659",
    "subject": "WMBA",
    "id": "5659",
    "title": "Strat Marketing Mgmt",
    "info": "Marketing concepts/analysis, strategy/planning in different market conditions. Lectures, readings, case discussions, computer simulation.",
    "prereq": []
  },
  {
    "code": "WMBA 5660",
    "subject": "WMBA",
    "id": "5660",
    "title": "Ops & Logistics Mgmt",
    "info": "Operations/business logistics as field of managerial responsibility. Linkages between logistics, operations, and other managerial disciplines, such as marketing and finance.",
    "prereq": []
  },
  {
    "code": "WMBA 5661",
    "subject": "WMBA",
    "id": "5661",
    "title": "Managing in Intl Environ",
    "info": "Policies to balance constraints produced by globalization and regional economic integration, in order to reduce transaction costs for business/public.",
    "prereq": []
  },
  {
    "code": "WMBA 5662",
    "subject": "WMBA",
    "id": "5662",
    "title": "Macroeconomic Business Environ",
    "info": "Students apply methods of decision-making, and of business/public policy analysis, in various real situations drawn from experience of developed market economies.",
    "prereq": []
  },
  {
    "code": "WMBA 5663",
    "subject": "WMBA",
    "id": "5663",
    "title": "Business Ethics",
    "info": "Ethical dimension of business decision-making in a market economy. Does behaving ethically mean more than behaving legally? Do managers have responsibilities to parties other than stockholders? How can managers balance potentially conflicting obligations? Is there a logical relationship between ethical behavior and profitability? Ethical dilemmas in various business settings.",
    "prereq": []
  },
  {
    "code": "WMBA 5664",
    "subject": "WMBA",
    "id": "5664",
    "title": "Strategic Management",
    "info": "Integrated top-executive point of view on successful managing of diverse businesses in a challenging game with competitors. Analytical skills, creative synthesis of diverse factors, individual/team work, informatin search, problems formulation. Decision making under conditions of time presssure, uncertainty, ambiguity, and risk.",
    "prereq": []
  },
  {
    "code": "WMBA 5665",
    "subject": "WMBA",
    "id": "5665",
    "title": "Management Info Systems",
    "info": "Information techonology/systems. Data flow diagrams, data modeling, electronic commerce, HTML, Web design, ERP systems, database management systems, business process re-engineering.",
    "prereq": []
  },
  {
    "code": "WMBA 5666",
    "subject": "WMBA",
    "id": "5666",
    "title": "Effective Decisions",
    "info": "Identifying barriers to effective decision making in business. Different forms of decision making. Methods of overcoming barriers and managing practical difficulties.",
    "prereq": []
  },
  {
    "code": "WMBA 5667",
    "subject": "WMBA",
    "id": "5667",
    "title": "Concentration",
    "info": "Students take at least three electives: one of limited choice and two of free choice. List of options changes yearly.",
    "prereq": []
  },
  {
    "code": "WMBA 5668",
    "subject": "WMBA",
    "id": "5668",
    "title": "Concentration",
    "info": "Students take at least three electives: one of limited choice and two of free choice. List of options changes yearly.",
    "prereq": []
  },
  {
    "code": "WMBA 5669",
    "subject": "WMBA",
    "id": "5669",
    "title": "Concentration",
    "info": "Students take at least three electives: one of limited choice and two of free choice. List of options changes yearly.",
    "prereq": []
  },
  {
    "code": "WMBA 5670",
    "subject": "WMBA",
    "id": "5670",
    "title": "Field Project",
    "info": "Students define problem; gather, analyze, and evaluate data; develop managerial recommendations; and prepare/present a report.",
    "prereq": []
  },
  {
    "code": "WMBA 5671",
    "subject": "WMBA",
    "id": "5671",
    "title": "Managing Prj Ops",
    "info": "Issues/concepts related to managing projects in organizations. Project planning/organization, budgeting/control, project life cycles, organization of workflow, project planning elements. Organizational forms, conflict resolution, leadership/task management in project environment. Project scheduling: WBS, CPM, PERT, simulation, resource constrained scheduling.",
    "prereq": []
  },
  {
    "code": "WMBA 5672",
    "subject": "WMBA",
    "id": "5672",
    "title": "AOSM",
    "info": "AOSM technique for linking stategic thinking, acting, and learning. Helping make sense of complex problems and communicating to oneself/others what might be done about them.",
    "prereq": []
  },
  {
    "code": "WMBA 5673",
    "subject": "WMBA",
    "id": "5673",
    "title": "Strategic Brand Management",
    "info": "Warsaw Executive MBA: Strategic Brand Management",
    "prereq": []
  },
  {
    "code": "WMBA 5674",
    "subject": "WMBA",
    "id": "5674",
    "title": "Manager's Self-Development",
    "info": "Concentration course for Warsaw Executive MBA students.",
    "prereq": []
  },
  {
    "code": "WMBA 5675",
    "subject": "WMBA",
    "id": "5675",
    "title": "Power of Human Capital",
    "info": "Course taken in Warsaw for Carlson School of Management's Warsaw Executive MBA program.",
    "prereq": []
  },
  {
    "code": "WMBA 5690",
    "subject": "WMBA",
    "id": "5690",
    "title": "WEMBA Substitute Class",
    "info": "For WEMBA students completing credits after end of official program. Majority of courses completed through Canadian Executive MBA program.",
    "prereq": []
  },
  {
    "code": "WMBA 5691",
    "subject": "WMBA",
    "id": "5691",
    "title": "WEMBA Substitute Class",
    "info": "For WEMBA students completing credits after end of official program. Majority of courses completed through Canadian Executive MBA program.",
    "prereq": []
  },
  {
    "code": "WMBA 5692",
    "subject": "WMBA",
    "id": "5692",
    "title": "WEMBA Substitute Class",
    "info": "For WEMBA students completing credits after end of official program. Majority of courses completed through Canadian Executive MBA program.",
    "prereq": []
  },
  {
    "code": "WMBA 5693",
    "subject": "WMBA",
    "id": "5693",
    "title": "WEMBA Substitute Class",
    "info": "For WEMBA students completing credits after end of official program. Majority of courses completed through Canadian Executive MBA program.",
    "prereq": []
  },
  {
    "code": "WMBA 5694",
    "subject": "WMBA",
    "id": "5694",
    "title": "International Residency",
    "info": "Perspective on U.S./international business practices. Global business strategy coursework, corporate site visits.",
    "prereq": []
  },
  {
    "code": "WMBA 5695",
    "subject": "WMBA",
    "id": "5695",
    "title": "Enterprising Entrepreneurship",
    "info": "Enterprising entrepreneurship from IDEA to IPO.",
    "prereq": []
  },
  {
    "code": "WMBA 5696",
    "subject": "WMBA",
    "id": "5696",
    "title": "Developing Business",
    "info": "Entrepreneurship as a business phenomenon, whether as a corporate or independent venture or as an alliance. How to apply knowledge to new-business development process.",
    "prereq": []
  },
  {
    "code": "WMBA 5697",
    "subject": "WMBA",
    "id": "5697",
    "title": "Corporate Restructuring",
    "info": "Corporate restructuring for value.",
    "prereq": []
  },
  {
    "code": "WMBA 5698",
    "subject": "WMBA",
    "id": "5698",
    "title": "Financial Risk Management",
    "info": "Financial risk mangagement. Ways for a firm to reduce risk.",
    "prereq": []
  },
  {
    "code": "WMBA 5699",
    "subject": "WMBA",
    "id": "5699",
    "title": "Technology Marketing",
    "info": "Marketing/management side of technology. Strategic decision problems in technology marketing/management. How to address these decision problems. Technology trends, drivers shaping the economy.",
    "prereq": []
  },
  {
    "code": "WMBA 5700",
    "subject": "WMBA",
    "id": "5700",
    "title": "Developing Management Skills",
    "info": "n/a",
    "prereq": []
  },
  {
    "code": "WMBA 5701",
    "subject": "WMBA",
    "id": "5701",
    "title": "Manager's Development Path",
    "info": "Warsaw Executive MBA elective course.",
    "prereq": []
  }
]