[
  {
    "code": "WPS 1001",
    "subject": "WPS",
    "id": "1001",
    "title": "WPS Profession Orientation",
    "info": "How industry converts forest resources into products while protecting source of raw material.",
    "prereq": []
  },
  {
    "code": "WPS 1002",
    "subject": "WPS",
    "id": "1002",
    "title": "App ofComp/Sens Tech in WPS",
    "info": "How sensor/computer technologies are used to monitor/evaluate environmental conditions. Applications of common computer packages to problem solving. Word processing, spreadsheet, presentation/database applications are used for course exercises in building science or wood products marketing/manufacturing. Sensor technology: application in process control and in collection/analysis of data from field or laboratory sensors.",
    "prereq": []
  },
  {
    "code": "WPS 1301",
    "subject": "WPS",
    "id": "1301",
    "title": "Wood as a Raw Material",
    "info": "Physical/chemical nature of wood and wood fiber. Raw material requirements, manufacturing processes, product characteristics for principal forest products. World wood supply, consumption trends.",
    "prereq": []
  },
  {
    "code": "WPS 1303",
    "subject": "WPS",
    "id": "1303",
    "title": "Wood Structure/Identification",
    "info": "Features of wood structure vital to identifying wood of various tree species. Physical properties of wood.",
    "prereq": []
  },
  {
    "code": "WPS 3305",
    "subject": "WPS",
    "id": "3305",
    "title": "Fundamentals of Lumber Grading",
    "info": "History, development, and practical application of hardwood/softwood lumber grading methods.",
    "prereq": []
  },
  {
    "code": "WPS 3312",
    "subject": "WPS",
    "id": "3312",
    "title": "Building Materials Estimating",
    "info": "Modern methods of estimating quantity, grade, specifications of building materials for light frame construction.",
    "prereq": []
  },
  {
    "code": "WPS 4201",
    "subject": "WPS",
    "id": "4201",
    "title": "Wood Industry Tours",
    "info": "Five-day bus tour consisting of visits to at least 12 manufacturers representing broad cross section of wood-using industry.",
    "prereq": []
  },
  {
    "code": "WPS 4301",
    "subject": "WPS",
    "id": "4301",
    "title": "Statics/Engineering Mechanics",
    "info": "Basic mechanics, strength of materials.",
    "prereq": []
  },
  {
    "code": "WPS 4302",
    "subject": "WPS",
    "id": "4302",
    "title": "Wood Chemistry",
    "info": "Occurrence, biosynthesis, structure, and chemistry of chief biopolymers. Related lower molecular weight components in woody tissues. Chemical/biochemical principles of pulping wood and bleaching pulp.",
    "prereq": []
  },
  {
    "code": "WPS 4303",
    "subject": "WPS",
    "id": "4303",
    "title": "Wood Deterioration/Preservatio",
    "info": "Deterioration of wood and wood products by bacteria, fungi, insects, marine organisms, fire, and weathering. Methods of preservation, preservatives used. Lecture, lab.",
    "prereq": []
  },
  {
    "code": "WPS 4304",
    "subject": "WPS",
    "id": "4304",
    "title": "Wood Physics and Drying",
    "info": "Psychrometrics, cell wall structure, specific gravity determinations/calculations, shrinking/swelling calculations, mechanosorptive description of creep. Wood drying processes.",
    "prereq": []
  },
  {
    "code": "WPS 4306",
    "subject": "WPS",
    "id": "4306",
    "title": "Analysis of Production Systems",
    "info": "Engineering/economic analysis of manufacturing/distribution systems for wood-based products. Material balances, equipment selection, economic analysis, presentation techniques.",
    "prereq": []
  },
  {
    "code": "WPS 4307",
    "subject": "WPS",
    "id": "4307",
    "title": "Wood-Base Panel Technology",
    "info": "Design, manufacture, properties, applications, and performance of structural/non-structural wood-based composite products.",
    "prereq": []
  },
  {
    "code": "WPS 4308",
    "subject": "WPS",
    "id": "4308",
    "title": "Wood Machining",
    "info": "History/fundamentals of wood machining processes. Analysis of tool/workpiece interaction. Effects on recovery efficiencies, tool wear, and surface condition. Application of wood processing systems/technologies. Lectures, demonstrations, field trips.",
    "prereq": []
  },
  {
    "code": "WPS 4309",
    "subject": "WPS",
    "id": "4309",
    "title": "Wood-Fluid Relationships",
    "info": "Moisture in wood, its relationship to density and specific gravity, shrinking/swelling, electrical properties, strength properties, thermoconductivity, absorption isotherms, dimensional stabilization, permeability, and diffusion.",
    "prereq": []
  },
  {
    "code": "WPS 4318",
    "subject": "WPS",
    "id": "4318",
    "title": "Pulp/Ppr Procs Simulation/Ctrl",
    "info": "Concepts, methodology, and tools in process simulation, process dynamics, and automatic process control.",
    "prereq": []
  },
  {
    "code": "WPS 4321",
    "subject": "WPS",
    "id": "4321",
    "title": "Material Science of Paper",
    "info": "Response of fibers subjected to various operations of papermaking processes. Mechanisms acting in stock preparation, refining, wet-end operations, web consolidation, and drying. Influences on fiber, pulp suspension, and paper properties. Challenges placed on end products by changing raw materials and requirements, including introduction of recycled pulp in paper products.",
    "prereq": []
  },
  {
    "code": "WPS 4322",
    "subject": "WPS",
    "id": "4322",
    "title": "Biol & Enviro Science of Paper",
    "info": "Biological process technology as applied to raw materials, manufacture processes, and product performance in paper industry. Roles/uses of microorganisms/enzymes in pulp/paper improvements/problems. Environmental impacts related to air/water discharge from papermaking as reflected in major portions of a recent papermill expansion.",
    "prereq": []
  },
  {
    "code": "WPS 4333",
    "subject": "WPS",
    "id": "4333",
    "title": "Sys Approach to Resident Const",
    "info": "Energy, moisture control, and indoor air quality in residential buildings. Design, construction, and operational aspects for providing energy efficiency, durability, and healthy environment. Interaction between moisture and wood products within building system.",
    "prereq": []
  },
  {
    "code": "WPS 4355W",
    "subject": "WPS",
    "id": "4355W",
    "title": "Mech/Structrl Design/Wood Prod",
    "info": "Nature of mechanical properties of wood, design, and analysis of wood members/structures.",
    "prereq": []
  },
  {
    "code": "WPS 4359",
    "subject": "WPS",
    "id": "4359",
    "title": "Surface,Colloids,Coating Proc",
    "info": "Principles of surface/colloid chemistry applied to basic problems in pulp/paper manufacturing operations and to product uses. Coating process and products (primarily paper). Theory, techniques, and procedures for formulating/applying coatings. Properties/uses of coated products.",
    "prereq": []
  },
  {
    "code": "WPS 4364",
    "subject": "WPS",
    "id": "4364",
    "title": "Process Engineering Design",
    "info": "Process engineering related problems, optimization/design of pulp/paper processes. Application of engineering principles. Process engineering studies of industrial production systems.",
    "prereq": []
  },
  {
    "code": "WPS 4401W",
    "subject": "WPS",
    "id": "4401W",
    "title": "Forest Products Marketing",
    "info": "Marketing/selling forest products. Focuses on companies that distribute wood-based construction materials. Lecture, discussion, in-class role playing, case studies, guest presenters, field trips to local companies.",
    "prereq": []
  },
  {
    "code": "WPS 4405",
    "subject": "WPS",
    "id": "4405",
    "title": "Paper in Today's World",
    "info": "Students prepare teaching unit on pulp/paper for use in elementary school, junior high, or senior high school science class.",
    "prereq": []
  },
  {
    "code": "WPS 5402",
    "subject": "WPS",
    "id": "5402",
    "title": "Bus Markets in FP Industry",
    "info": "How forest products companies sell to other businesses, how this differs from traditional consumer process. Emphasizes business marketing communications, sales force management, organizational buying, partnering, e-commerce, globalization of business markets. Case studies, discussion, daily readings from course text, academic/industry publications.",
    "prereq": []
  }
]