[
  {
    "uid": "819055",
    "code": "ABUS3029W",
    "subject": "ABUS",
    "number": "3029",
    "honors": false,
    "writing": true,
    "name": "Writing Workshop - APS Majors",
    "fullname": "Writing Workshop for Applied & Professional Studies Majors",
    "info": "Writing is omnipresent throughout Applied and Professional Studies (APS) courses; nearly all require some form of written product and assess students in some way through their writing ability. Focusing on in-depth instruction, constructive feedback, and hands-on experience, this 7-week writing workshop is designed for students who find themselves struggling with writing concepts in their other classes or who want more writing practice to refine and hone their existing skills. Students will learn to understand writing expectations in their disciplines and develop techniques for brainstorming, organizing, outlining, and researching. Students will also practice the drafting process, focusing on mastering business grammar, avoiding common mistakes, and cultivating a clear and concise style. Students will learn the components of clear structure such as transitioning between ideas, logical organization, and integrating research. Students will also develop reliable editing techniques to test their own writing for clarity, logic, and appropriate tone, as well as methods for thinking through critical feedback and incorporating changes into revisions of existing documents.   Students must be enrolled in a CCAPS undergraduate major (premajor status is allowed). ",
    "prereq": {}
  },
  {
    "uid": "805356",
    "code": "ABUS3051",
    "subject": "ABUS",
    "number": "3051",
    "honors": false,
    "writing": false,
    "name": "Career Search for Profl Envt",
    "fullname": "Career Search for the Professional Environment",
    "info": "An introduction to the nuts and bolts of job search strategies, including résumé writing, interviewing, networking, and the use of technology and the Internet in job seeking. You will begin to make realistic decisions about what kinds of jobs and work environments will best suit you after graduation and into the future, and formulate a concrete plan for how to attain this important career goal. In addition, you will have an understanding of the professional environment of business. This will include appropriate on-the-job behavior and how knowledge of corporate culture, communication, and etiquette can make the difference between struggling in the business world and succeeding and advancing. Professional presentation, dress, and communication are highlighted. Assignments will focus on practical and applied knowledge relating to career-oriented skills, exploration, and success. Prerequisites: None, but upper-division status recommended.",
    "prereq": {}
  },
  {
    "uid": "819857",
    "code": "ABUS3052",
    "subject": "ABUS",
    "number": "3052",
    "honors": false,
    "writing": false,
    "name": "Careers in Remote Gig Economy",
    "fullname": "Career Building in the Remote Gig Economy",
    "info": "Businesses are shifting from full-time permanent employment models to a greater reliance on short-term contract work and freelance projects. This trend is referred to as the emerging \"gig economy.\" Already, more than one in three people earn a full or partial income from leveraging this evolving marketplace. In 2019, Amazon announced plans to hire over a thousand remote customer service reps. Technical coders, freelance photographers, consultants, bloggers, rideshare contractors, career coaches, and online affiliate marketers are just a few among many remote gig opportunities experiencing rapid growth.  This course examines the structure of a remote gig economy and corresponding career opportunities. Students will develop a deep understanding of the current gig landscape, develop initiatives and self-direction tactics to meet its needs, and leave armed to succeed in a growing remote gig economy.  Activities are centered around obtaining work in the gig economy and being an exceptional remote \"gigger\" as an individual contributor. Additionally, students will learn how to parlay those talents into endless career path opportunities, including leadership and management roles in a quickly evolving, exciting workplace.\nPrerequisites: None\n",
    "prereq": {}
  },
  {
    "uid": "805755",
    "code": "ABUS3065",
    "subject": "ABUS",
    "number": "3065",
    "honors": false,
    "writing": false,
    "name": "Computer Security Business Pro",
    "fullname": "Computer Security for the Business Professional",
    "info": "Computer security without technical jargon. Real-world examples and issues. Practices for safe, secure, and ethical computer use: virus, worm, and malware detection and elimination; antivirus and firewall selection; secure Internet purchasing; social networking sites; web page setup. \n\nprereq: Basic computer/Internet navigation skills; laptop with browser and MS Word or equivalent.",
    "prereq": {}
  },
  {
    "uid": "819721",
    "code": "ABUS3201",
    "subject": "ABUS",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Digital Design-Small Business",
    "fullname": "Digital Design Strategies for Small Business",
    "info": "Basics of multi-platform strategies to promote small businesses or a personal brand. Primary concepts include developing a cross-platform digital presence, creating brand identity, analyzing strategy effectiveness, and researching the competition. Students will work to develop a complete digital strategy for their own small business or personal brand by working both individually and in groups to find creative solutions for reaching their target audience in today's market. \nPrerequisites:  None.",
    "prereq": {}
  },
  {
    "uid": "801333",
    "code": "ABUS3301",
    "subject": "ABUS",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Intro to Quality Management",
    "fullname": "Introduction to Quality Management",
    "info": "Principles/concepts of managing quality in business applications. Improving business processes with six sigma method. Implementing/leading process improvement. Baldrige Award, ISO 9000.\n\nprereq: Introductory statistics",
    "prereq": {}
  },
  {
    "uid": "811497",
    "code": "ABUS3510",
    "subject": "ABUS",
    "number": "3510",
    "honors": false,
    "writing": false,
    "name": "Virtual Global Communication",
    "fullname": "Communicating Virtually Across Global Teams in Applied Business Settings",
    "info": "Collaborative exploration of virtual communication within teams/across cultures. Impact of technologies on global business/societies. Virtual team functioning/dynamics. Influence of cultural perspective on communication within  group. Role of communication technology in cultural development. Ethical/legal implications.",
    "prereq": {}
  },
  {
    "uid": "015096",
    "code": "ABUS3950",
    "subject": "ABUS",
    "number": "3950",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics in Applied Business",
    "info": "Management issues in a changing workplace. Topics vary.\n\nprereq: At least 45 cr",
    "prereq": {}
  },
  {
    "uid": "015080",
    "code": "ABUS4011",
    "subject": "ABUS",
    "number": "4011",
    "honors": false,
    "writing": false,
    "name": "Hist Perspec & Contemp Bus",
    "fullname": "Historical Perspectives and Contemporary Business Challenges",
    "info": "Global competitiveness, product and service quality, information revolution, and changing customer/workforce demographics. Approaches to meeting contemporary challenges studied against historical backdrop of evolving management practices. Emphasizes developing systematic ways of analyzing complex problems.",
    "prereq": {}
  },
  {
    "uid": "015081",
    "code": "ABUS4012",
    "subject": "ABUS",
    "number": "4012",
    "honors": false,
    "writing": false,
    "name": "DecisionMaking&ProblemSolving",
    "fullname": "Strategic Decision Making and Problem Solving",
    "info": "Frameworks/processes for decision-making. Analyzing causes, effects of problems, and solutions in organizations. Creativity, team building. Case studies, final real-world project, online presentation.\n\nprereq: 45 cr",
    "prereq": {}
  },
  {
    "uid": "811449",
    "code": "ABUS4013W",
    "subject": "ABUS",
    "number": "4013",
    "honors": false,
    "writing": true,
    "name": "Law, Ethics, &  Risk for Mgrs",
    "fullname": "Legal, Ethical, and Risk Issues for Managers",
    "info": "Key legal, ethical, and risk frameworks in business activity and civic life. Students will identify areas of exposure within their specific industry and learn about best practices to minimize legal liability and manage risk. The writing-related instruction is designed to develop effective management-level communication skills regarding legal, ethical, and other risks and to develop a thoughtful analytical approach to addressing real-world risks.\n  \nprereq: CMgt 4011 recommended for CMgt students, 45 semester credits",
    "prereq": {
      "or": [
        "013688"
      ]
    }
  },
  {
    "uid": "015082",
    "code": "ABUS4021",
    "subject": "ABUS",
    "number": "4021",
    "honors": false,
    "writing": false,
    "name": "Small Group Behavior /Teamwork",
    "fullname": "Small Group Behavior and Teamwork",
    "info": "Emphasizes work groups in organizations. Factors affecting performance/productivity. Identify formal/informal roles. How effective teamwork is created/sustained. Leadership/followership practiced.",
    "prereq": {}
  },
  {
    "uid": "015083",
    "code": "ABUS4022W",
    "subject": "ABUS",
    "number": "4022",
    "honors": false,
    "writing": true,
    "name": "Management in Organizations",
    "fullname": "Management in Organizations",
    "info": "Demands on today's managers, with a focus on small to medium-sized organizations. Techniques/ideas beyond traditional studies. Applying management theory at all levels. Managing in a global workplace. Organizational planning and decision making. Organizing resources. Leading/motivating people. Controlling/evaluating organizational activities. This writing intensive designated course will spend significant time focusing on the writing process. Writing is crucial to this discipline because clear, accurate, and professional communication is essential to organization management. The ability to write effectively in terms of specified audiences ensures, in the professional world, successful communication between team members as well as the success of the projects, companies, and employees they represent.\n\nprereq: 45 semester credits recommended",
    "prereq": {}
  },
  {
    "uid": "015084",
    "code": "ABUS4023W",
    "subject": "ABUS",
    "number": "4023",
    "honors": false,
    "writing": true,
    "name": "Communicating for Results",
    "fullname": "Communicating for Results",
    "info": "Aspects of communication essential for being persuasive/influential. Organizing/presenting ideas effectively, strategies for audience analysis, choosing communication methods, making appropriate use of informal influence methods, handling dissent. Processes for intercultural communication.\n\nprereq: 45 cr completed",
    "prereq": {}
  },
  {
    "uid": "015088",
    "code": "ABUS4024",
    "subject": "ABUS",
    "number": "4024",
    "honors": false,
    "writing": false,
    "name": "Effective Oral Communication",
    "fullname": "Effective Oral Communication and Business Presentations",
    "info": "Building/developing business presentation skills and oral communications effectiveness. Videotaping/critiques of actual presentations based on audience analysis, technique selection, and handling receptive/hostile audiences.",
    "prereq": {}
  },
  {
    "uid": "016180",
    "code": "ABUS4025",
    "subject": "ABUS",
    "number": "4025",
    "honors": false,
    "writing": false,
    "name": "Negotiating for Agreement",
    "fullname": "Negotiating for Agreement",
    "info": "Practical negotiating tools, hands-on practice to engage in win-win negotiations.",
    "prereq": {}
  },
  {
    "uid": "015085",
    "code": "ABUS4031",
    "subject": "ABUS",
    "number": "4031",
    "honors": false,
    "writing": false,
    "name": "Strategic Use Bus.Info.Systems",
    "fullname": "Strategic Use of Business Information Systems",
    "info": "Relationship of information systems and decision making.  Databases, decision management tools, customer relationship management, e-business, trends, information security. Database and web page development, case studies, final empirical project.\n\nprereq: Basic proficiency with 'office' software, 45 cr",
    "prereq": {}
  },
  {
    "uid": "015089",
    "code": "ABUS4032",
    "subject": "ABUS",
    "number": "4032",
    "honors": false,
    "writing": false,
    "name": "Skills for Decision Making",
    "fullname": "Quantitative Skills for Decision Making",
    "info": "Exploratory data analysis, visual display of data, basic mathematical/statistical techniques for analysis. Decision theory, decision modeling.",
    "prereq": {}
  },
  {
    "uid": "015090",
    "code": "ABUS4041",
    "subject": "ABUS",
    "number": "4041",
    "honors": false,
    "writing": false,
    "name": "Dynamics of Leadership",
    "fullname": "Dynamics of Leadership",
    "info": "Successful leadership via flexible approach. Knowledge, skills, and abilities that leaders develop from eight leadership strategies: academic, bureaucratic, eclectic, economic, fellowship, military, political, social. Ways to lead diverse populations in a global environment.\n\nprereq: 45 cr completed",
    "prereq": {}
  },
  {
    "uid": "015086",
    "code": "ABUS4042",
    "subject": "ABUS",
    "number": "4042",
    "honors": false,
    "writing": false,
    "name": "Plan & Implement Stratg Decisn",
    "fullname": "Planning and Implementing Strategic Decisions",
    "info": "Strategic assessment of a company?s competitive capabilities/performance. How companies allocate resources to their activities. Analyzing business environment, assessing business risk, determining what actions are needed. Evaluating choices firms make to compete successfully and sustain profitability.",
    "prereq": {}
  },
  {
    "uid": "015087",
    "code": "ABUS4043",
    "subject": "ABUS",
    "number": "4043",
    "honors": false,
    "writing": false,
    "name": "Project Management in Practice",
    "fullname": "Project Management in Practice",
    "info": "Introduction to project management: tools and techniques for defining, scheduling, and managing a project. Learn about team development and ways to enhance team performance through planning and executing a project. Requires use of MS Project, which will be made available to students without cost via download.\n\nprereq: 45 cr completed",
    "prereq": {}
  },
  {
    "uid": "015091",
    "code": "ABUS4044",
    "subject": "ABUS",
    "number": "4044",
    "honors": false,
    "writing": false,
    "name": "Tools for International Trade",
    "fullname": "Tools for International Trade",
    "info": "International forces/trends. Identifying ways in which businesses can work within context of international change. Tools used in specific transactions, ways to diagnose in what circumstances they are most appropriately applied.",
    "prereq": {}
  },
  {
    "uid": "015093",
    "code": "ABUS4101",
    "subject": "ABUS",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Accounting&Finance for Mgrs",
    "fullname": "Accounting and Finance for Managers",
    "info": "Cost accounting concepts. Cost behavior. Management decision making using cost data. Time value of money. Cost of capital. Capital budgeting techniques. Financial statement analysis. Assignments draw on business/industry examples.\n\nprereq: Financial accounting, 45 cr",
    "prereq": {}
  },
  {
    "uid": "015095",
    "code": "ABUS4103",
    "subject": "ABUS",
    "number": "4103",
    "honors": false,
    "writing": false,
    "name": "Marketing and Sales",
    "fullname": "Marketing and Sales",
    "info": "Legal, behavioral, ethical, competitive, economic, and technological factors as they affect product pricing, promotion, and marketing. Personal selling function as integral part of distribution system. Sales force organization, selection, training, motivation, compensation, forecasting, budgeting, control.",
    "prereq": {}
  },
  {
    "uid": "015092",
    "code": "ABUS4104",
    "subject": "ABUS",
    "number": "4104",
    "honors": false,
    "writing": false,
    "name": "Management and Human Resource",
    "fullname": "Management and Human Resource Practices",
    "info": "Providing day-to-day leadership. Organizing work, motivating employees. Delegating, coordinating, and achieving results. Front line human resource practices, including selection, induction, and training of new employees, employee appraisal. Handling grievances/discipline.\n\nprereq: 45 cr completed",
    "prereq": {}
  },
  {
    "uid": "819726",
    "code": "ABUS4105",
    "subject": "ABUS",
    "number": "4105",
    "honors": false,
    "writing": false,
    "name": "Authentic Business Leadership",
    "fullname": "Becoming an Authentic Leader in an Applied Business Setting",
    "info": "Students will gain proficiency in various leadership modalities within a self-reflective framework. They will learn to build their own authentic leadership capabilities as well as assess those of fellow leaders across individual, group, and organization levels. Assignments will examine temperament and decision-making, goal setting and personal beliefs, change-making and coping with pressure, and developing personal strengths and professional authenticity.\nPrerequisites:  None",
    "prereq": {}
  },
  {
    "uid": "826901",
    "code": "ABUS4106",
    "subject": "ABUS",
    "number": "4106",
    "honors": false,
    "writing": false,
    "name": "Scandals vs. Best Practices",
    "fullname": "Scandals versus Best Practices: Business Ethics in the Real World",
    "info": "This course focuses on the impact of business ethics decisions with the goal of helping students develop a personal business ethics philosophy. Decisions are explored by studying current real-world cases embodying particular business constructs: stakeholders, corporate responsibility, sustainability, information sharing, organizational culture, global business, and leadership. Students will evaluate important historical decision-making variables and develop their own set of values. The course will go beyond theory to examine the ways that ethical decisions both challenge and benefit businesses, looking at both poor (scandals) versus good (best practices) decision-making.",
    "prereq": {}
  },
  {
    "uid": "802805",
    "code": "ABUS4151",
    "subject": "ABUS",
    "number": "4151",
    "honors": false,
    "writing": false,
    "name": "Innovation for Leaders & Orgs.",
    "fullname": "Innovation for Leaders and Organizations",
    "info": "Innovation as cornerstone of knowledge economy. History of innovation process, importance to individuals/organizations. Strategies to foster innovation. Responsibilities in innovation skill-building/leadership.\n\nprereq: 45 cr",
    "prereq": {}
  },
  {
    "uid": "808503",
    "code": "ABUS4211",
    "subject": "ABUS",
    "number": "4211",
    "honors": false,
    "writing": false,
    "name": "Facil Asset Mgmt, Fin, Budget",
    "fullname": "Facility Asset Management, Finance, and Budgeting",
    "info": "Examination of different types of leases. Relevance of BOMA (Building Office & Managers Association) space standards. Understanding components of total annual and capital facility costs. Analyzing and interpreting facility financial statements and reports. Constructing facility capital and operating budgets. Illustrating GAAP (generally accepted accounting principles) related to asset capitalization, and applying financial terminology when speaking to the chief financial officer.\n\nRecommended prereq: ABUS 4101 or basic accounting/finance knowledge/experience",
    "prereq": {
      "or": [
        "015093"
      ]
    }
  },
  {
    "uid": "808521",
    "code": "ABUS4213",
    "subject": "ABUS",
    "number": "4213",
    "honors": false,
    "writing": false,
    "name": "Facility Mgmt Fundamentals",
    "fullname": "Facility Management Fundamentals",
    "info": "Managing operation and maintenance of building systems and facility management departments. Operation of mechanical, electrical, and plumbing systems. Critical spaces, fire/life safety systems, utilities. Maintenance for specific building systems. Technology and resources used to support building operations and maintenance.",
    "prereq": {}
  },
  {
    "uid": "808498",
    "code": "ABUS4217",
    "subject": "ABUS",
    "number": "4217",
    "honors": false,
    "writing": false,
    "name": "Real Estate Process & Tools",
    "fullname": "Real Estate Development: Process and Tools",
    "info": "Real estate development creates and alters our built environment. Working with architects, engineers, contractors, financing teams, government, and a host of consultants, real estate developers transform ideas into buildings, and with this, the spaces in which we live, work, and play. So, how do developers identify good and bad opportunities, and then, once committed, manage a wide group of stakeholders, often with disparate interests, to get the project completed and operating as planned? It is a challenge every step of the way, with a myriad of risks and obstacles to overcome, but with significant potential rewards. This course traces the development process from beginning to end, introducing foundational knowledge in project feasibility analysis and financial modeling, and integrating real world examples via case studies and interviews with Twin Cities-based practitioners.\n\nPrereq: 45 credits.  Familiarity with finance and accounting concepts helpful.",
    "prereq": {}
  },
  {
    "uid": "818993",
    "code": "ABUS4218",
    "subject": "ABUS",
    "number": "4218",
    "honors": false,
    "writing": false,
    "name": "Real Estate Finance",
    "fullname": "Real Estate Finance",
    "info": "Real estate finance, as commonly understood, is about the capital that transforms development ideas into the built form.  But in this course, we will focus on real estate finance as a dynamic and significant industry and explore the internal language, norms, and practices of financiers, ranging all the way from hedge funds seeking returns rivaling those of Wall Street, to those backing community redevelopment and affordable housing projects.  It will begin with an overview of the industry and introduce common tools of finance such as pro forma, then move on to sources of finance, from hedge funds to commercial banks and community-based lenders. We will be visited by finance practitioners, including several operating in the Twin Cities, as well as their development clients.  There is an entire real estate finance ecosystem to explore, and students will leave the class with an understanding of its products, sources, and roles while developing facility with its analytical tools.  ",
    "prereq": {}
  },
  {
    "uid": "801203",
    "code": "ABUS4321",
    "subject": "ABUS",
    "number": "4321",
    "honors": false,
    "writing": false,
    "name": "Evaluating Perform Excellence",
    "fullname": "Evaluating Performance Excellence in Organizations",
    "info": "Systematic processes for leadership, quality improvement, performance excellence. Analyze strengths/improvements using Baldrige National Quality Award and MNQA criteria. Students join MNQA board of evaluators and complete team evaluation of group seeking MNQA.\n\nprereq: Submit MNQA evaluator application",
    "prereq": {}
  },
  {
    "uid": "016244",
    "code": "ABUS4501",
    "subject": "ABUS",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Small Bsns Building & Running",
    "fullname": "Building and Running a Small Business Enterprise",
    "info": "Basic marketing, finance, and leadership principles that apply to the formation of a small business enterprise. A variety of class discussions and independent reflective exercises will enable students to assess their resources and develop management, leadership, and business administration skills. The final project is collaborative: the creation of a business plan for a start-up.\n\nPrerequisites: None, although previous business experience or study will be helpful.\n",
    "prereq": {}
  },
  {
    "uid": "818300",
    "code": "ABUS4502",
    "subject": "ABUS",
    "number": "4502",
    "honors": false,
    "writing": false,
    "name": "Inclusive Business Leadership",
    "fullname": "Inclusive Business Leadership: Advancing Diversity",
    "info": "Diversity exists in most organizations and is often sought after, but may not contribute significantly to organizational success until leaders learn the real meaning of diversity and how to unleash its potential through inclusive practices.  This course is all about self-exploration to become familiar with such things as unconscious biases, perceptions, and habits—whatever stands in the way of inclusive leadership. This is accomplished through weekly self-reflections, a self-test, small-group work to model inclusive leadership, and an opportunity to interview a chosen HR leader about his or her inclusiveness practices. You will gain the ability to strategically plan for creating dynamic workplace inclusivity, including techniques for actively engaging business leaders.  Prerequisites: None.",
    "prereq": {}
  },
  {
    "uid": "016242",
    "code": "ABUS4503",
    "subject": "ABUS",
    "number": "4503",
    "honors": false,
    "writing": false,
    "name": "Tech Chng, Work Org, Mgmt Prac",
    "fullname": "Technological Change, Work Organization, and Management Practices",
    "info": "Evolution of work organization in the United States. Factors responsible for changes. Effect of changes on labor-management relations. Revolutions in technology, scientific management, collective bargaining, self-directed work teams, and lean production methods.",
    "prereq": {}
  },
  {
    "uid": "016240",
    "code": "ABUS4505",
    "subject": "ABUS",
    "number": "4505",
    "honors": false,
    "writing": false,
    "name": "Values & Ethics at Work",
    "fullname": "Values and Ethics at Work",
    "info": "Ways in which we look at work/our jobs. Religious, legal, social, cultural, and personal viewpoints. Topics may include pay equity/benefits, discrimination, product liability, corporate political contributions, loyalty, family/work conflicts, community responsibility, and role of business in society. Case examples.",
    "prereq": {}
  },
  {
    "uid": "016251",
    "code": "ABUS4507",
    "subject": "ABUS",
    "number": "4507",
    "honors": false,
    "writing": false,
    "name": "Change-Agent Skills",
    "fullname": "Change-Agent Skills",
    "info": "Assessing needed change in relation to environment. Phases of change. Persuasive techniques. Shared responsibilities in carrying out change. Change as internal/external process. Leadership practices.",
    "prereq": {}
  },
  {
    "uid": "016249",
    "code": "ABUS4509",
    "subject": "ABUS",
    "number": "4509",
    "honors": false,
    "writing": false,
    "name": "New Product Development",
    "fullname": "New Product Development",
    "info": "How new consumer, industrial, and service products are planned/developed. Idea generation, concept/buyer testing, pricing, sales/profit strategies, product positioning, promotion, packaging/distribution. Marketing case histories. Student projects.\n\nprereq: [[4103 or 4701 or Mktg 3001], at least 45 cr] or instr consent",
    "prereq": {
      "or": [
        "015095",
        "796580",
        "013127"
      ]
    }
  },
  {
    "uid": "016269",
    "code": "ABUS4511",
    "subject": "ABUS",
    "number": "4511",
    "honors": false,
    "writing": false,
    "name": "Operating a Small Business",
    "fullname": "Operating a Small Business Start-Up",
    "info": "Strategies as well as the practical knowledge and skills needed to operate your new small business. In ABus 4501, you planned to start a small business. In ABus 4511, you will expand upon that business plan to include growth strategies; a refined vision and focus based on business trends and projections; position descriptions for people needed to help start and keep you in business; the legal documents required to run your business; and an accountability chart depicting roles and responsibilities of your team members and external partners in launching and sustaining your small business. You will also identify performance indicators, learn how to remain competitive and innovative in the marketplace, and prepare to evolve your plans and processes over time. You will also participate in a variety of class discussions and independently complete reflective exercises that help you assess and develop your management, leadership, and conflict-resolution skills.\n\nPrerequisites: 45 credits, and ABus 4501-Building a Small Business Start-up, are prerequisites for this course.  If you have obtained this background information in some other way, check with the instructor to determine if your background is sufficient for getting the most out of this class.  It is also helpful to have taken other business-related courses such as finance, marketing, and human resources.",
    "prereq": {
      "or": [
        "016244"
      ]
    }
  },
  {
    "uid": "016576",
    "code": "ABUS4515",
    "subject": "ABUS",
    "number": "4515",
    "honors": false,
    "writing": false,
    "name": "Strat/Mgmt Sustainable Future",
    "fullname": "Strategy and Management for a Sustainable Future",
    "info": "Sustainability in business. Relationship of sustainable environments to organizations. Economic/strategic enterprise value. Relationship of sustainable business practices to marketplace trends/realities.\n\nprereq: 45 cr completed",
    "prereq": {}
  },
  {
    "uid": "820122",
    "code": "ABUS4518",
    "subject": "ABUS",
    "number": "4518",
    "honors": false,
    "writing": false,
    "name": "Innovative Decision Making",
    "fullname": "Leadership and Innovative Decision Making in Applied Business",
    "info": "This course is a deep immersion in essential skills for businesspeople: change management, creative problem solving, and innovation, leading to effective decision-making. Huge changes in our world require creative and innovative responses. You might be called upon to make important decisions for the next half-century, so why not learn the tools right now to make them great ones? These skills are the pillars of a successful personal and professional life, and workplace managers are pleading for more creativity in their employees.  Be one of those outstanding individuals who can be a creative problem solver, not a problem. Though the course is built as a guide in using these important concepts to launch and build a successful business of your own, it is recommended for anyone contemplating a business career. Prerequisites: None",
    "prereq": {}
  },
  {
    "uid": "820565",
    "code": "ABUS4545",
    "subject": "ABUS",
    "number": "4545",
    "honors": false,
    "writing": false,
    "name": "Defying Workplace Racial Bias",
    "fullname": "Defying Racial Bias in the Workplace: Individual Action and Accountability",
    "info": "This course focuses on the employee as an individual and the ways unconscious bias adversely affects organizational culture, including stifling decision-making, productivity, innovation, and market competitiveness. Inclusion and multiculturalism take center stage. Through self-examination and reflection within the context of their own experience, students will explore the concepts of identity, privilege, and conscious and unconscious bias, as well as their financial impacts on the organization. They will identify ways they can mitigate racial workplace bias by holding themselves and their organization accountable. The concept of allyship will also be explored. Students will learn how, by putting allyship into practice, they can contribute to the creation of an antiracist work environment. By building empathy, embracing difference, and using emotional intelligence techniques, they will learn how to foster diversity, inclusion, and equity. Throughout the course, they will develop an understanding of the ways recognition of individual racial bias will unlock the potential of both themselves and the organization.\n\nPrerequisites: None",
    "prereq": {}
  },
  {
    "uid": "809327",
    "code": "ABUS4571W",
    "subject": "ABUS",
    "number": "4571",
    "honors": false,
    "writing": true,
    "name": "Introduction to Grant Writing",
    "fullname": "Introduction to Grant Writing",
    "info": "Nonprofits such as health care entities and arts organizations will continue to be challenged by limited resources and increased needs in communities they serve. This reality also results in an increased need for these groups to find additional financial support. This course will provide an understanding of ways to find, research, and write proposals for grants offered by government and private entities. As a writing intensive course, it will spend significant time focusing on the writing process. Writing is crucial to the field because the only way for a nonprofit to be awarded a grant is by submitting a written proposal. The strength of the proposal has a significant impact on the money that an organization will receive. Students will become familiar with various sections of the proposal by drafting, editing, and seeking feedback and by revising a needs assessment, goal statement, budget justification, and statement of organizational purpose. By learning how to write well in the field, students will increase their chances of being employed by a nonprofit and securing funding for their organization.",
    "prereq": {}
  },
  {
    "uid": "796312",
    "code": "ABUS4601",
    "subject": "ABUS",
    "number": "4601",
    "honors": false,
    "writing": false,
    "name": "Corporate Finance",
    "fullname": "Corporate Finance",
    "info": "Principles of financial management. Implementation by corporate financial managers in strategic financial decisions. Financial statement analysis. Time value of money. Risk/return. Equity valuation. Fixed income securities. Capital budgeting analysis. Cost of capital. Long-term financing. Capital structure analysis. Dividend policy.",
    "prereq": {}
  },
  {
    "uid": "796580",
    "code": "ABUS4701",
    "subject": "ABUS",
    "number": "4701",
    "honors": false,
    "writing": false,
    "name": "Introduction to Marketing",
    "fullname": "Introduction to Marketing",
    "info": "Conceptual tools for creating a marketing plan. How marketing relates to other functional areas of business. Importance of an ethical, global view.\n\nprereq: [Macroeconomics or microeconomics], 45 cr",
    "prereq": {}
  },
  {
    "uid": "818231",
    "code": "ABUS4702",
    "subject": "ABUS",
    "number": "4702",
    "honors": false,
    "writing": false,
    "name": "Applied Digital Marketing",
    "fullname": "Applied Digital Marketing",
    "info": "Digital marketing represents the fastest growing sector in most marketing departments. But what is digital marketing? Understanding the digital realm of marketing requires a curiosity about how new technologies will change business, while grasping the key strategies that drive tactics and trends. This course is designed to be a primer on the world of digital marketing and ways it will affect both your future employment and larger business trends. Through case studies, discussion forums, and interactive activities, you will learn about the latest research and best practices in the industry to have a solid grasp of the core concepts and tools of digital marketing management, both today and in the future.\n\nPrerequisites: None",
    "prereq": {}
  },
  {
    "uid": "805185",
    "code": "ABUS4703",
    "subject": "ABUS",
    "number": "4703",
    "honors": false,
    "writing": false,
    "name": "Mrkting Professional Practice",
    "fullname": "Marketing for the Professional Practice",
    "info": "Principles of marketing applied to the management of the professional practice. Begins with an introduction to marketing and its overall role and function. We will examine the four P's of marketing (product, price, place, and promotion), then move on to developing a marketing plan, which serves as a map that highlights a path towards success. We look at the major components of a marketing plan and provide you with an opportunity to gain knowledge and experience by completing one. Topics include understanding the internal and external environment, segmenting the market, positioning, differentiating, branding, and formulating a marketing plan with goals, strategies, and financial considerations.\n\nprereq: 45 semester cr recommended",
    "prereq": {}
  },
  {
    "uid": "806828",
    "code": "ABUS4705",
    "subject": "ABUS",
    "number": "4705",
    "honors": false,
    "writing": false,
    "name": "Leadership & Mgmt Prof Pract",
    "fullname": "Leadership and Management for the Professional Practice",
    "info": "An introduction to organizational behavior for students and professionals interested in leading or managing a professional practice. Its purpose is to improve your effectiveness as a leader or manager through an understanding of the sociological, economic, and political factors that affect organizations. The course will progress from an introspective look at leadership and your own personal preferences and style, to interactions with others in groups or teams, to the structure and dynamics of organizations and how they respond to external factors.\n\nprereq: 45 semester cr recommended",
    "prereq": {}
  },
  {
    "uid": "805186",
    "code": "ABUS4707",
    "subject": "ABUS",
    "number": "4707",
    "honors": false,
    "writing": false,
    "name": "Finance Mgmt for Prof Practice",
    "fullname": "Financial Management for the Professional Practice",
    "info": "Provides professional practitioners with the skills they need to make informed financial decisions for their business. It introduces the fundamental concepts of finance and also touches on related topics in financial and managerial accounting, marketing, and personal finance. Students will work in small groups to implement the principles they have learned by developing and analyzing a business plan of the kind used to request funding for a professional practice.\n\nprereq: 45 semester cr recommended\n\n",
    "prereq": {}
  },
  {
    "uid": "806851",
    "code": "ABUS4709",
    "subject": "ABUS",
    "number": "4709",
    "honors": false,
    "writing": false,
    "name": "Managing Prof Pract I: Bus Des",
    "fullname": "Managing the Professional Practice I: Business Design",
    "info": "Factors/challenges involved in designing structure of professional practice. Core values/mission, design of services, physical design, risk management, equipment/IT, partners/staffing. Exercises in applied practice development/management.\n\nprereq: 45 cr",
    "prereq": {}
  },
  {
    "uid": "808135",
    "code": "ABUS4711",
    "subject": "ABUS",
    "number": "4711",
    "honors": false,
    "writing": false,
    "name": "Man Prof Pract II: Operations",
    "fullname": "Managing the Professional Practice II: Operations",
    "info": "Factors/challenges in day-to-day operations of professional practice. Marketing, human resources, finance, entrepreneurial spirit, inventory management, operational quality, transitions. Exercises in applied operations.\n\nprereq: 4709, 45 cr",
    "prereq": {
      "and": [
        "806851"
      ]
    }
  },
  {
    "uid": "016248",
    "code": "ABUS4993",
    "subject": "ABUS",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Specially arranged projects, trips, or field work.\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "015097",
    "code": "ABUS4999",
    "subject": "ABUS",
    "number": "4999",
    "honors": false,
    "writing": false,
    "name": "Practicum",
    "fullname": "Practicum",
    "info": "Project in student's employing organization or in organization providing an internship. Integrates projects from previous coursework or develops plan for new venture or expands existing business. Limited class meetings.",
    "prereq": {}
  }
]