[
  {
    "uid": "805908",
    "code": "ACL5100",
    "subject": "ACL",
    "number": "5100",
    "honors": false,
    "writing": false,
    "name": "Topics in ACL",
    "fullname": "Topics in Arts and Cultural Leadership",
    "info": "Topics in Arts and Cultural Leadership.",
    "prereq": {}
  },
  {
    "uid": "805912",
    "code": "ACL5211",
    "subject": "ACL",
    "number": "5211",
    "honors": false,
    "writing": false,
    "name": "Trends in Arts Cultural Mgmt",
    "fullname": "Trends and Impacts in Arts and Cultural Leadership and Management",
    "info": "Through discussion and analysis, research and peer presentation projects, this seminar will investigate and question the theoretical nuances from which nonprofit arts and cultural organizations are built and the practical influences that affect them daily. Leadership in the cultural sector is evolving rapidly; textbook strategies are being re- evaluated and organizations are re-inventing themselves in creative ways in response to current social and economic conditions. Emphasis is placed on current events, immediate and long- term trends and research into what is happening now. Topics include the role of arts and cultural organizations within the community; past, current and future concepts in organizational structures; and the application of traditional and integrated relationship-based strategies.",
    "prereq": {}
  },
  {
    "uid": "805913",
    "code": "ACL5221",
    "subject": "ACL",
    "number": "5221",
    "honors": false,
    "writing": false,
    "name": "Entrepreneurship Resource Dev",
    "fullname": "Creative Entrepreneurship and Resource Development",
    "info": "An entrepreneurial approach to developing resources (including financial, human, and partnership) for arts and culture based enterprises whether using a nonprofit, for-profit or social enterprise business model. The course will investigate and discuss the complexities and nuances of how to determine the appropriate business model and develop both earned and philanthropic income. Students focus on framing and articulating the relevance of the enterprise as well as understanding the perspectives of audiences, customers, funders and donors. The course also explores the role of communications strategies in support of fundraising, and the importance of leadership in acquiring resources to sustain and grow successful organizations. Students develop both a broad understanding of resources as well as detailed strategies for supporting work in arts and culture based enterprises.",
    "prereq": {}
  },
  {
    "uid": "805914",
    "code": "ACL5231",
    "subject": "ACL",
    "number": "5231",
    "honors": false,
    "writing": false,
    "name": "Ethical and Legal Issues",
    "fullname": "Ethical Dilemmas and Legal Issues for Cultural Leaders",
    "info": "This course explores topics in ethics, law and leadership. Through interactive sessions, readings, presentations, discussions, papers and guest speakers, student-leaders will develop knowledge, tools and resources for assessment of ethical and legal issues within arts and cultural contexts. The course will engage student-leaders with an overview of relevant topics and a foundation for further exploration of self selected topics. Student-leaders will learn to spot issues and identify when to seek legal guidance, and assess considerations relevant to critical problem solving and informed decision-making.",
    "prereq": {}
  },
  {
    "uid": "816055",
    "code": "ACL5241",
    "subject": "ACL",
    "number": "5241",
    "honors": false,
    "writing": false,
    "name": "Financial Management for Arts",
    "fullname": "Financial Management for Arts Nonprofits, Community Organizations, and Artists",
    "info": "This course introduces students to concepts and applications of financial management and leadership practices with a specific focus on nonprofit arts and cultural organizations. The goal of the course is to develop both theoretical and practical understanding of the central responsibilities of financial management and leadership to equip students to use financial information, identify business models, and employ a financial lens for planning and decisions. Focus will be on the fundamentals of budgeting and accounting, interpretation of financial statements, data, and procedures for operational forecasts, as well as the fiduciary responsibilities of nonprofit boards. \n\nThis course is designed for individuals working within arts nonprofits or community organizations, considering a career in the arts, or interested in learning more about nonprofit financial management principles. Individuals interested in financial sustainability as individual artists or cultural leaders will also benefit from this foundation in financial best practices. The goal of the course is to develop both theoretical and practical understanding of the central responsibilities of solid financial management to benefit arts, cultural, and/or community organizations and the sector as a whole. Students will have the opportunity to apply what is learned to a case study organization.\n",
    "prereq": {}
  },
  {
    "uid": "816045",
    "code": "ACL5251",
    "subject": "ACL",
    "number": "5251",
    "honors": false,
    "writing": false,
    "name": "Forces and Resources of Change",
    "fullname": "Courageous Imagination in Action: Art and Culture as Forces and Resources of Change",
    "info": "This class is for anyone passionate about the unique capacities embedded in arts and cultural work, concerned about the cascade of challenges facing humanity, and determined to lead with and through the powerful resources of the arts and culture. Fundamental changes in organizations, programs, and resources are needed to meet the complex challenges of our times. A key emphasis of the course is development of a personal mission and purpose by each student as a leader in working with existing organizations and systems and leading changes essential for a sustainable, humane, creative, and thriving future. The course is designed to challenge and support students as they choose a direction and purpose they wish to address – contacts, examples, resources, local, regional, national, websites, people, and examples will be provided. The course examines existing organizations and systems, those in transformation and the opportunity, need and challenge in creating new forms. Students meet key people in different sectors and stages of change.\n\nThis is a highly interactive course, with simulations, imaginative work and a variety of visitors, site visits, and explorations of ideas and beliefs that may be challenging.  These may include connections with Minnesota State legislature, regional arts councils, City of Minneapolis and/or St Paul, large and small arts and culture organizations in the area. National networks including USDAC, Americans for the Arts, Climate Generation, The Wounded Warrior Project, and others. Students will prepare a presentation that links their personal purpose and mission with the work they seek and the differences they hope to make and support.\n",
    "prereq": {}
  },
  {
    "uid": "818876",
    "code": "ACL5261",
    "subject": "ACL",
    "number": "5261",
    "honors": false,
    "writing": false,
    "name": "Creative Placemaking",
    "fullname": "Creative Placemaking, Participatory Planning, and Community Building",
    "info": "The rise of the creative economy, creative cities, the creative class, and creative placemaking are generally considered unique to the 21st century. Are these new phenomena or just new brand identities for the historic role of cities as centers of cultural production and exchange? As contemporary phenomena, they have also been linked to a rise in social and economic inequities. Creativity, culture, and the role of artists are of increasing significance in the ways cities and communities are planned, form, and function. What roles can artists, activists, cultural leaders, urban planners, and other civic leaders play with regard to making cities more equitable and culturally vibrant? This course explores the evolving relationships of arts, culture, and the creative sector with city planning, development, and democractic practices. Students will hear directly from community leaders and undertake their own community change projects.",
    "prereq": {}
  },
  {
    "uid": "805915",
    "code": "ACL5950",
    "subject": "ACL",
    "number": "5950",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Special topics.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "806617",
    "code": "ACL5993",
    "subject": "ACL",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study for qualified graduate students.\n\nprereq: Grad student, dept consent",
    "prereq": {}
  },
  {
    "uid": "820472",
    "code": "ACL6001",
    "subject": "ACL",
    "number": "6001",
    "honors": false,
    "writing": false,
    "name": "A Multiplicity of Ways",
    "fullname": "A Multiplicity of Ways: Epistemologies In the 21st Century",
    "info": "There are many different ways to experience and understand the world. Creative, culturally based forms of expression serve to expand on those ways. However, colonial practices, alive in academic, arts, and cultural environments globally, homogenize ways of knowing, understanding, and evaluating the world around us. These epistemologies are grounded in collecting data, building analysis, logic and theory that fits the data. Other ways of being, knowing, and seeing are equally meaningful, and are critical in efforts to understand the complex world we live in and create the possibility for transformational social change that is relevant to multiple human experiences and contexts. This course will guide students in developing a framework to better understand and act in meaningful and interdependent ways in the world. Students will explore concepts, worldviews and art and cultural practices from many points of view, challenging the concept of universality in favor of a multiplicity of ways of being, knowing, seeing, and doing. Students will be better prepared to address the pressing needs of arts and cultural organizations and social movements within a global and multicultural context.\n",
    "prereq": {}
  },
  {
    "uid": "809117",
    "code": "ACL6002",
    "subject": "ACL",
    "number": "6002",
    "honors": false,
    "writing": false,
    "name": "Capstone: Applied Research",
    "fullname": "Capstone: Applied Research Project",
    "info": "Course provides an environment that will motivate, support, and assist students in the completion of their Capstone Project through development of a Project Proposal.\n\nStudent projects explore personal, organizational, community, and/or systems change and as such generate valuable experiences and insights. There will be a minimum of five classroom meetings of students and instructor. Additional one-on-one meetings with the instructor are required. The instructor is also available for individual consultation as needed.",
    "prereq": {}
  },
  {
    "uid": "816763",
    "code": "ACL6003",
    "subject": "ACL",
    "number": "6003",
    "honors": false,
    "writing": false,
    "name": "Capstone: Presentation",
    "fullname": "Capstone: Reflections and Presentation",
    "info": "Course provides an environment that will motivate, support, and assist students in the completion of an excellent Capstone Paper that reflects knowledge and skills acquired during the course of study in the Arts and Cultural Leadership Program and place them in a meaningful and theoretical context. Past student projects explored personal, organizational, community, and/or systems change and as such generated valuable experiences and insights. There will be a minimum of five classroom meetings of students and instructor in addition to a final presentation event. Additional one on one meetings with the instructor are required. The instructor is also available for individual consultation as needed.",
    "prereq": {}
  },
  {
    "uid": "805974",
    "code": "ACL6201",
    "subject": "ACL",
    "number": "6201",
    "honors": false,
    "writing": false,
    "name": "Reimagining Cultural Leadershp",
    "fullname": "Reimagining Cultural Leadership",
    "info": "Seismic societal change has intensified calls for relevant, bold, innovative leadership to reimagine the roles and possibilities of arts and culture. Students will reflect on how their personal passions, strengths, and capabilities can help them meet this moment as cultural leaders. Students will examine cultural competency models and develop their vision of culturally intelligent leadership. They will explore systems of privilege and power in relation to arts and culture, and conceive of ways to promote diversity, equity, access, and inclusion. The course will cover other core leadership accountabilities, including strategic thinking, organizational change, community engagement, board and staff development, fiscal solvency, public advocacy, and crisis management. Students will be assigned to case presentation teams that explore specific arts and culture leadership challenges and generate corresponding strategies and solutions. Three cultural leaders will visit the class. Finally, students will write a synthesis paper identifying their personal mission and values, career aspirations, and how they will apply strategic and behavioral aspects of cultural leadership covered in class.",
    "prereq": {}
  },
  {
    "uid": "805975",
    "code": "ACL6202",
    "subject": "ACL",
    "number": "6202",
    "honors": false,
    "writing": false,
    "name": "Service Lead Board Practicum",
    "fullname": "Service Leadership and Board Practicum",
    "info": "Effective chief executives of nonprofit arts and cultural organizations differ most from their less effective counterparts in the ways in which they work with their boards of directors, their staff and their artistic leadership, not in their fundraising prowess or their management expertise. In fact, the degree to which nonprofit executives work in genuine partnership with their boards, staff and artistic leadership often makes the difference between successful and unsuccessful organizations. Complicating matters is the fact that while nonprofits are increasingly in need of experienced, qualified board members, there are limited opportunities for preparing new or prospective board members for board service or for developing more experienced board members into effective board leaders. Often it is the chief executive who must train the board.\n\nThis practicum has two primary areas of focus: The first is on continuing to develop your own leadership skills and values, and establishing practices that can be sustained after you graduate from the program. The second is on the role of the chief executive in determining the effectiveness of his or her board of directors and in engaging board members in meaningful governance as well as their respective roles and responsibilities. It will be our goal to build upon the voluntary leadership and life experiences of each individual class member and to explore ways in which students can increase their own leadership competencies during the course and then throughout their careers.\n\nThe course will cover the changing roles of arts and cultural organizations in today's world, the funding environments affecting arts nonprofit governance, review basic roles and responsibilities of the chief executive in relation to the board as well as the roles and responsibilities of arts board membership. Particular attention will be paid to board dynamics, especially those between the board as a whole, the board's key leadership and the nonprofit's executive leadership and how our own life and leadership experiences affect our ability to work in concert with others in voluntary capacities.  ",
    "prereq": {}
  },
  {
    "uid": "826148",
    "code": "ACL6203",
    "subject": "ACL",
    "number": "6203",
    "honors": false,
    "writing": false,
    "name": "Exp Leadership Plan (Pt 1)",
    "fullname": "Experiential Leadership Plan (Part I)",
    "info": "The ACL practicum experience consists of a 2-course sequence, ACL 6203 Experiential Leadership Plan (Part I) and ACL 6204 Experiential Leadership Practicum. Together they provide a well-thought-out and planned project-based, experiential learning opportunity revolving around a student-designed field experience. The student applies theory, expands skills, and gains new experiences in the arts and cultural sector in this course sequence.\n \nThis first course consists of designing and setting up an organizational or community-based change activity that may take the form of an intern/externship, social entrepreneurship venture, or volunteer service with a board, committee, community organization, or public agency. Students assess their individual learning goals for a practicum experience, gain an understanding of what makes a successful practicum, and draft a practicum proposal. The proposal must identify a practicum field supervisor or mentor with whom the student will work during Part II. The plan must be completed and approved before permission will be granted to register for the second part, ACL 6204.\n\nStudents will then complete the practicum experience while registered for ACL 6204 (Part II) under the direction of an external field supervisor and in conjunction with the university instructor. See the ACL 6204 syllabus for more specific information about practicum requirements.\n",
    "prereq": {}
  },
  {
    "uid": "826155",
    "code": "ACL6204",
    "subject": "ACL",
    "number": "6204",
    "honors": false,
    "writing": false,
    "name": "Exp Leadership (Part II)",
    "fullname": "Experiential Leadership Practicum  (Part II)",
    "info": "The ACL practicum experience consists of a 2-course sequence, ACL 6203 Experiential Leadership Plan (Part I) and ACL 6204 Experiential Leadership Practicum (Part II). In conjunction with ACL 6203, this course is a project-based learning opportunity focused on a student-designed practicum intended to give the student an opportunity to apply theory, expand skills, and gain experience in the arts and cultural sector. The practicum consists of an organizational or community-based opportunity for professional growth that may take the form of an intern/externship, entrepreneurial venture, or volunteer service with a board, committee, community organization, or public agency. The courses may be taken in sequence within one academic year or with a year between them should the student require more time to implement the practicum experience. Careful planning should be conducted with the ACL Adviser. \nIn this course, students will conduct and reflect on their practicum experience. A practicum proposal must be completed and approved before permission will be granted to register for ACL 6204. \nStudents will complete the practicum experience while registered for ACL 6204 under the direction of an external field mentor in conjunction with the university instructor. During this semester, students will benefit from the experiences of their peers and reflect on their experiences. \n",
    "prereq": {}
  },
  {
    "uid": "809116",
    "code": "ACL8001",
    "subject": "ACL",
    "number": "8001",
    "honors": false,
    "writing": false,
    "name": "Intro Inquiry Arts and Culture",
    "fullname": "Introduction to Critical and Cultural Inquiry in Arts and Culture",
    "info": "This seminar, required for ACL students, introduces research frameworks, methods, standards, and practice as well as critical thinking appropriate for arts and cultural research.",
    "prereq": {}
  }
]