[
  {
    "uid": "794984",
    "code": "ADDS4001",
    "subject": "ADDS",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Prof. Pract. Add. Couns.",
    "fullname": "Professional Practice of Addictions Counseling",
    "info": "Core addictions counseling functions including clinical assessment, case management, documentation treatment planning, and ethical issues. Students begin process of securing internship.",
    "prereq": {}
  },
  {
    "uid": "794985",
    "code": "ADDS4002",
    "subject": "ADDS",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Intern. Subst. Couns. I",
    "fullname": "Internship in Substance Abuse Counseling I",
    "info": "Supervised field work experience. Practical application of substance abuse counseling skills such as assessment, treatment planning, and case management.",
    "prereq": {}
  },
  {
    "uid": "804388",
    "code": "ADDS5001",
    "subject": "ADDS",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Found. in Addiction Studies",
    "fullname": "Foundations in Addiction Studies",
    "info": "Theoretical perspectives/concepts related to etiology of alcohol/drug dependency/abuse. Emphasizes bio-psycho-social models of addiction/disease: psychodynamics, social learning, contingency, family systems. Connection of theory to empirical research.",
    "prereq": {}
  },
  {
    "uid": "804412",
    "code": "ADDS5002",
    "subject": "ADDS",
    "number": "5002",
    "honors": false,
    "writing": false,
    "name": "Intro to Evidence Based Pract.",
    "fullname": "Intro to Evidence Based Practices and the Helping Relationship",
    "info": "Knowledge, techniques, skills, and processes for initiating, conducting, and terminating a counseling relationship. Nature/process of helping. Evidence-based practices. Reading, discussion, written exercises, role-play, observation, feedback, out-of-class experiences.",
    "prereq": {}
  },
  {
    "uid": "791118",
    "code": "ADDS5003",
    "subject": "ADDS",
    "number": "5003",
    "honors": false,
    "writing": false,
    "name": "Appl Psychopharm Hum Serv Prof",
    "fullname": "Applied Psychopharmacology for Human Service Professionals",
    "info": "Categories of psychoactive drugs. Medications to treat mental disorders. Legal drugs such as alcohol, nicotine, cocaine, and marijuana. What is occurring physiologically when someone takes a psychoactive drug.",
    "prereq": {}
  },
  {
    "uid": "793186",
    "code": "ADDS5004",
    "subject": "ADDS",
    "number": "5004",
    "honors": false,
    "writing": false,
    "name": "Co-Occur Addict Mntl Hlth Dis",
    "fullname": "Co-Occurring Addictive and Mental Health Disorders",
    "info": "Mentally ill, chemically abusive, or dependent clients. Intervention, advocacy, education, and support for client and those who are part of his or her environment. Social, environmental, and multicultural factors. Meets partial state requirements for becoming licensed as an alcohol/drug counselor.",
    "prereq": {}
  },
  {
    "uid": "804748",
    "code": "ADDS5005",
    "subject": "ADDS",
    "number": "5005",
    "honors": false,
    "writing": false,
    "name": "Group Therapy: Theory & Pract.",
    "fullname": "Group Therapy: Theory and Practice",
    "info": "Designing/facilitating therapy groups. Intra-/inter-personal dynamics, leadership skills, developmental aspects, ethical issues. Application to therapy of chemically addicted individuals. Lectures, discussion, experiential exercises, small groups, readings.",
    "prereq": {}
  },
  {
    "uid": "804389",
    "code": "ADDS5006",
    "subject": "ADDS",
    "number": "5006",
    "honors": false,
    "writing": false,
    "name": "Intro Resilience/Health Realiz",
    "fullname": "Introduction to Resilience/Health Realization",
    "info": "Resilience, health realization, and the link between them. Applications in students' personal, professional, and organizational lives. Relevant literature, theory, and research. ",
    "prereq": {}
  },
  {
    "uid": "804904",
    "code": "ADDS5007",
    "subject": "ADDS",
    "number": "5007",
    "honors": false,
    "writing": false,
    "name": "Adolescence & Substance Abuse",
    "fullname": "Adolescence and Substance Abuse",
    "info": "Screening, assessing, and treating adolescents. How to involve family and others. Interventions, approaches, best practices. Legal/ethical issues. Lectures, discussion, readings, exercises.",
    "prereq": {}
  },
  {
    "uid": "805958",
    "code": "ADDS5009",
    "subject": "ADDS",
    "number": "5009",
    "honors": false,
    "writing": false,
    "name": "Multicult Aspects of Addiction",
    "fullname": "Multicultural Aspects of Addiction",
    "info": "What is culture? How might culture, cultural practices, and history be significant in the use/abuse of substances? How is culture relevant to the attitudes/practices in the prevention/treatment of substance use/abuse? Multicultural counseling and cultural competence in addiction counseling. People as individuals; clinician's own cultural worldview/other cultural worldviews.",
    "prereq": {}
  },
  {
    "uid": "805420",
    "code": "ADDS5010",
    "subject": "ADDS",
    "number": "5010",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "805429",
    "code": "ADDS5011",
    "subject": "ADDS",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Addiction Studies",
    "fullname": "Foundations in Addiction Studies",
    "info": "Theoretical perspectives/concepts related to etiology of alcohol/drug dependency/abuse. Emphasizes bio-psycho-social models of addiction/disease: psychodynamics, social learning, contingency, family systems. Connection of theory to empirical research.",
    "prereq": {}
  },
  {
    "uid": "808415",
    "code": "ADDS5021",
    "subject": "ADDS",
    "number": "5021",
    "honors": false,
    "writing": false,
    "name": "Intro to Evidence Based Pract.",
    "fullname": "Introduction to Evidence Based Practices and the Helping Relationship",
    "info": "Initiating, conducting, and terminating a counseling relationship. Use of self in counseling process. Nature/process of helping. Evidence-based practices/theories.  Reading, discussion, written exercises, role-play, observation, feedback, out-of-class practice.",
    "prereq": {}
  },
  {
    "uid": "808420",
    "code": "ADDS5031",
    "subject": "ADDS",
    "number": "5031",
    "honors": false,
    "writing": false,
    "name": "Applied Psychopharmacology",
    "fullname": "Applied Psychopharmacology",
    "info": "This course provides a comprehensive survey of the basic concepts of psychopharmacology and psychiatric conditions for which psychoactive medication presents an appropriate intervention strategy. It is intended to be an introduction into the field and is designed to provide a working knowledge base to enable students to more competently address the experiences of their clients taking prescribed psychotropic medications.",
    "prereq": {}
  },
  {
    "uid": "808421",
    "code": "ADDS5041",
    "subject": "ADDS",
    "number": "5041",
    "honors": false,
    "writing": false,
    "name": "Motivational Counseling",
    "fullname": "Methods and Models I: Motivational Counseling",
    "info": "Concepts of motivational interviewing. Spirit of MI. Primary counseling skills. Working with resistance. Identifying/eliciting change talk. Transitioning into change, negotiating treatment plan. Strengths/shortcoming of MI.",
    "prereq": {}
  },
  {
    "uid": "808422",
    "code": "ADDS5051",
    "subject": "ADDS",
    "number": "5051",
    "honors": false,
    "writing": false,
    "name": "Cognitive Behavioral Therapy",
    "fullname": "Methods and Models II: Cognitive Behavioral Therapy",
    "info": "Components of cognitive model. Assessment, case formulation, automatic thoughts, core beliefs, cognitive restructuring, behavior change elements, therapeutic relationship. Learn, practice, master key concepts.",
    "prereq": {}
  },
  {
    "uid": "808424",
    "code": "ADDS5071",
    "subject": "ADDS",
    "number": "5071",
    "honors": false,
    "writing": false,
    "name": "Found. Co-occurring Disorders",
    "fullname": "Foundations of Co-occurring Disorders",
    "info": "Understanding mentally ill/chemically abusive or dependent client. Intervention, advocacy, education, support for client/those part of his/her environment. Social, environmental, multicultural factors that contribute resources for these clients.",
    "prereq": {}
  },
  {
    "uid": "809298",
    "code": "ADDS5101",
    "subject": "ADDS",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Adolescents Co-occurring",
    "fullname": "Adolescents and Co-occurring Substance Use and Mental Health Disorders",
    "info": "Adolescents/co-occurring substance use/mental health disorders.",
    "prereq": {}
  },
  {
    "uid": "812789",
    "code": "ADDS5121",
    "subject": "ADDS",
    "number": "5121",
    "honors": false,
    "writing": false,
    "name": "Internship Prep",
    "fullname": "Professional Seminar 1: Internship Prep",
    "info": "Prepares students for successful entry into field of substance use disorder counseling by focusing on facets that are critical to their professional development. Through discussions, experiential learning activities, guest lectures and site visits, students gain further understanding of the internship placement process and requirements, settings that fit their individual training and career goals, requirements for initial licensing and renewal, the testing process, models of professional development, the importance of professional advocacy and associations, self-care and requirements and benefits of clinical supervision. Professional ethics, including state rules, statutes, codes of conduct and regulations for practitioners and agencies are also addressed. Students will also develop their job search skills and apply them to secure a field placement for the internship seminar.",
    "prereq": {}
  },
  {
    "uid": "810681",
    "code": "ADDS5224",
    "subject": "ADDS",
    "number": "5224",
    "honors": false,
    "writing": false,
    "name": "Spirituality in Practice",
    "fullname": "Integrating Spirituality in Counseling Practice",
    "info": "Knowledge/skills of counseling students/practitioners in professional competencies for addressing spiritual/religious issues. Lecture, discussion, experiential exercises/readings to advance cognitive, interpersonal/practical skills. Treatment of persons with co-occurring disorders.",
    "prereq": {}
  },
  {
    "uid": "807453",
    "code": "ADDS5950",
    "subject": "ADDS",
    "number": "5950",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Special topics in addiction studies.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "807454",
    "code": "ADDS5993",
    "subject": "ADDS",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed study.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "808426",
    "code": "ADDS5994",
    "subject": "ADDS",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed research.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "827054",
    "code": "ADDS6001",
    "subject": "ADDS",
    "number": "6001",
    "honors": false,
    "writing": false,
    "name": "Foundations of Substance Use",
    "fullname": "Foundations of Substance Use Disorder and Co-Occurring Disorders, and Mental Health Counseling",
    "info": "This comprehensive course examines the intricate relationship between mental health and substance use disorders, recognizing the prevalent co-occurrence of these conditions. Additionally, it introduces students to the knowledge, techniques, skills, and process involving initiating, conducting, and terminating an effective counseling relationship. It provides students with a thorough understanding of the intersection between clients' substance use issues, mental health concerns, and the foundations of clinical practice. Through a critical examination of substance use theories, models, and research, emphasis is placed on grasping the biopsychosocial factors influencing the etiology, incidence, course, and care of substance use and mental health disorders. The course equips students with effective strategies for intervention with clients grappling with co-occurring disorders, incorporating multicultural perspectives throughout the exploration of content areas. Ultimately, the goal is to familiarize students with the complexities of co-occurring disorders and empower them with the knowledge and skills needed for comprehensive and culturally sensitive therapeutic approaches.",
    "prereq": {}
  },
  {
    "uid": "827053",
    "code": "ADDS6005",
    "subject": "ADDS",
    "number": "6005",
    "honors": false,
    "writing": false,
    "name": "Counseling Ethics and Identity",
    "fullname": "Counseling Ethics and Professional Counselor Identity",
    "info": "This integrative course focuses on both foundational counseling principles and ethical practice within substance use disorder and mental health counseling. The course delves into the historical development, current challenges, and future trends in counseling, ensuring the integration of ethical, moral, legal, and professional principles into counseling practice. Students will explore essential knowledge, skills, and techniques for initiating, conducting, and concluding effective counseling relationships, emphasizing the importance of therapeutic alliances and the use of self in the counseling process. Students gain insights into ethical and responsible practice, developing a personal ethical decision model that integrates American Counseling Association (ACA) and Association for Addiction Professionals (NAADAC) codes of ethics, along with relevant statutes and regulations. Through case studies, students analyze and apply codes of ethics and regulations, addressing key topics such as client welfare, advocacy, professional competence, personal wellness, boundaries, and confidentiality.",
    "prereq": {}
  },
  {
    "uid": "827023",
    "code": "ADDS6011",
    "subject": "ADDS",
    "number": "6011",
    "honors": false,
    "writing": false,
    "name": "Applied Psychopharmacology",
    "fullname": "Applied Psychopharmacology",
    "info": "This course engages students in an in-depth exploration of psychopharmacology concepts related to substance-use disorders and mental health. Students delve into the intricate interplay between psychoactive medications and various psychiatric conditions. Serving as a gateway to the field, it aims to foster a higher-order understanding of the importance of psychopharmacology in the treatment of substance use disorders and mental health conditions. By emphasizing the synthesis of theoretical concepts and practical applications, students will not only gain an understanding of psychopharmacology but also develop the ability to critically analyze and assess the experiences of their clients taking prescribed psychotropic medications. The overarching goal is to equip students with the skills to proficiently navigate the complexities of psychopharmacological interventions and enhance their capacity to address clients' experiences with a sophisticated and evaluative approach.",
    "prereq": {}
  },
  {
    "uid": "808416",
    "code": "ADDS6015",
    "subject": "ADDS",
    "number": "6015",
    "honors": false,
    "writing": false,
    "name": "Social and Cultural Diversity",
    "fullname": "Social and Cultural Diversity in Counseling",
    "info": "This course delves into the exploration of key questions surrounding social and cultural diversity, substance use, and mental health. It aims to clarify the impact of culture and cultural practices on substance use disorders and mental health issues. Additionally, the course addresses how culture influences attitudes and approaches in preventing and treating substance use disorders, as well as mental and behavioral health disorders. While specific cultural groups will be discussed, the course places significant importance on introducing general concepts of multicultural practice, cultural sensitivity, cultural humility, and cultural attunement in therapeutic settings. A strong focus throughout the course is on examining the clinician's own cultural worldview and enhancing their understanding of other cultural perspectives and life experiences.",
    "prereq": {}
  },
  {
    "uid": "808423",
    "code": "ADDS6021",
    "subject": "ADDS",
    "number": "6021",
    "honors": false,
    "writing": false,
    "name": "Counseling Skills: Group",
    "fullname": "Counseling Skills: Group Counseling",
    "info": "This course will examine the foundational principles of group dynamics and their application to group psychotherapy. The course will discuss the development and implementation of groups, sustainability, and how change is facilitated. The course will immerse students into the stages of group development, from formation to termination, and the various attributes of each stage, such as structure and group dynamics. The course will apply a wide array of theoretical approaches to group therapy to explore both conceptualization and facilitation skills for groups of diverse populations across various developmental stages. This course combines a variety of teaching methods including lectures, discussion, experiential exercises, small group participation, and readings to advance students? cognitive, interpersonal, and practical skills.",
    "prereq": {}
  },
  {
    "uid": "827052",
    "code": "ADDS6025",
    "subject": "ADDS",
    "number": "6025",
    "honors": false,
    "writing": false,
    "name": "Counseling Skills: CBT, MI",
    "fullname": "Counseling Skills: Cognitive Behavioral Therapy and Motivational Interviewing",
    "info": "In this course students will learn and demonstrate the major concepts of Motivational Interviewing (MI) and Cognitive Behavioral Therapy (CBT). These concepts include understanding the common factors to therapy, the core micro-counseling and interviewing skills as well as dealing with discord and sustain talk; strategies for identifying, eliciting, and responding to change talk; transitioning into change and negotiating a treatment plan; and supporting and strengthening confidence and commitment. Additional course concepts will include components of cognitive behavioral therapy assessment and case formulation, as well as specific cognitive and behavioral interventions.",
    "prereq": {}
  },
  {
    "uid": "808425",
    "code": "ADDS6031",
    "subject": "ADDS",
    "number": "6031",
    "honors": false,
    "writing": false,
    "name": "Foundations  Assmt and Treatmt",
    "fullname": "Foundations of Assessment and Treatment Planning",
    "info": "This course is intended to introduce the principles of treatment planning and assessment of individuals experiencing co-occurring substance use and mental health disorders. The course will review relevant issues such as physiological effects, etiology, assessments, diagnosis, levels of treatment, motivation/readiness, confidentiality, intervention strategies, community support, ethics, prevention, and social justice. This includes, but is not limited to, theoretical and historical bases for assessment techniques; assessing validity and reliability; appraisal methods including environmental and performance assessment, individual and group test inventory methods, behavioral observations, and computer-assisted assessments; psychometric statistics; strategies for selecting, administering, interpreting, and using assessment and evaluation instruments and techniques in counseling; and ethical consideration in appraisal.\n\nStudents will demonstrate an ability to effectively apply the learned concepts to complete a comprehensive substance use assessment. ",
    "prereq": {}
  },
  {
    "uid": "808448",
    "code": "ADDS6035",
    "subject": "ADDS",
    "number": "6035",
    "honors": false,
    "writing": false,
    "name": "Research & Evaluation Methods",
    "fullname": "Research and Evaluation Methods in Counseling",
    "info": "This course is designed to provide graduate students with knowledge and skills in research methods to further their competency as both consumers and producers of research in the clinical mental health and substance use counseling fields. Research is essential to the continued development of these professions that utilize prevention and intervention aims in these bodies of literature. Understanding the elements of research is important in helping professionals to be able to evaluate critically and/or conduct research to enhance one's skills and advance the edges of knowledge in the field. This course will provide the student with a basic framework for understanding and evaluating empirical research, as well as knowledge of fully developing study with quantitative, qualitative, or mixed-methods research designs. This course builds knowledge by practical application in the development of a research proposal over the course of the term. Students will complete this project in steps through weekly assignments, in-class activities and discussion, lecture, and group work. ",
    "prereq": {}
  },
  {
    "uid": "827169",
    "code": "ADDS6905",
    "subject": "ADDS",
    "number": "6905",
    "honors": false,
    "writing": false,
    "name": "Practicum",
    "fullname": "Practicum",
    "info": "ADDS/IBH 6905 is a summative course experience that brings together content area knowledge acquired in courses in the program and applies it to clinical practice for the first time. The first half of the course will provide the groundwork for the development of one’s professional portfolio, a reflective collection and analysis of work completed in the program. The portfolio will serve to synthesize foundational knowledge and self-reflective development as a future clinician. The second half of the course will bridge the gap between content knowledge and clinical application and will equip students with practical knowledge related to the clinical realities of substance use and mental health treatment and provide supervision of the first 100 hours of internship. This comprehensive course is designed to help students develop and refine counseling skills and foster the growth of a professional counselor identity. With a focus on the Twelve Core Functions of substance use disorder counseling and direct client service, including a minimum of 40 hours of direct service experience, participants will advance their proficiency in evidence-based practices. Working under the guidance of licensed counselors in the behavioral and mental health field, students will accrue clinical hours at sites dedicated to professional counseling for emotional, behavioral, and mental disorders, including substance use disorders. ",
    "prereq": {}
  },
  {
    "uid": "809011",
    "code": "ADDS6996",
    "subject": "ADDS",
    "number": "6996",
    "honors": false,
    "writing": false,
    "name": "Counseling Internship",
    "fullname": "Counseling Internship",
    "info": "ADDS 6996 Counseling Internship is a comprehensive course designed to help students develop and refine counseling skills and foster the growth of a professional counselor identity. With a focus on the Twelve Core Functions of substance use disorder counseling and direct client service, participants will advance their proficiency in evidence-based practices. Working under the guidance of licensed counselors in the behavioral and mental health field, students will accrue clinical hours at sites dedicated to professional counseling for emotional, behavioral, and mental disorders, including substance use disorders. During the clinical placement, students will actively observe and co-facilitate both individual and group counseling sessions, tailored to their developmental level and supervised by a field supervisor. Alongside weekly onsite supervision, participants will engage in 2-hour weekly group supervision seminar sessions with a faculty member. Students are required to maintain a detailed log of their clinical hours, subject to verification by the onsite supervisor. Furthermore, students will participate in evaluations conducted by both onsite and faculty supervisors, assessing their knowledge, skills, and professional dispositions. Clear communication of individual licensing needs is the responsibility of each student, facilitated through ongoing dialogue with the course instructor.",
    "prereq": {}
  }
]