[
  {
    "uid": "002799",
    "code": "AFEE1002",
    "subject": "AFEE",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Prin Career Plan/Ag Prof",
    "fullname": "Principles of Career Planning for Agricultural Professionals",
    "info": "Self assessment and analysis of interests, skills, and abilities. Analyses of occupations, employment potential, employee expectations for work. Use informational interviews to examine career options and employment portfolio for career planning.",
    "prereq": {}
  },
  {
    "uid": "796729",
    "code": "AFEE3105",
    "subject": "AFEE",
    "number": "3105",
    "honors": false,
    "writing": false,
    "name": "Intro to Strat Plng thru HR",
    "fullname": "Introduction to Strategic Planning through Human Resources",
    "info": "Processes organizations use when engaged in strategic planning. How to participate in planning, implementing, and evaluating strategic innitiatives to improve performance.",
    "prereq": {}
  },
  {
    "uid": "005185",
    "code": "AFEE3121",
    "subject": "AFEE",
    "number": "3121",
    "honors": false,
    "writing": false,
    "name": "Comm Energy Power Trans/Ma",
    "fullname": "Communication, Energy and Power, Transportation and Machinery Technologies",
    "info": "Experiences in communication, information, energy, power, and transportation technologies. Fundamentals of mechanical, fluid, and electrical power; transportation of people and materials; and technology systems for information and communication, including graphic communication and computer applications. Multiple-activity laboratory.",
    "prereq": {}
  },
  {
    "uid": "805583",
    "code": "AFEE3361",
    "subject": "AFEE",
    "number": "3361",
    "honors": false,
    "writing": false,
    "name": "World Development Problems",
    "fullname": "World Development Problems",
    "info": "Development problems throughout the world. Development in Third World countries. First World development problems. Population, health and disease, education, agriculture, industry, finance, politics, and human rights.",
    "prereq": {}
  },
  {
    "uid": "002977",
    "code": "AFEE4096",
    "subject": "AFEE",
    "number": "4096",
    "honors": false,
    "writing": false,
    "name": "Practicum: Ag Ed Technology",
    "fullname": "Practicum: Agricultural Education Technology",
    "info": "Individualized study packages addressing technology in agriculture production, horticulture, natural resource, biotechnology, farm and agribusiness, management, agricultural science, agriculture mechanics, youth organizations, adult and beginning farm and agribusiness management.",
    "prereq": {}
  },
  {
    "uid": "002137",
    "code": "AFEE5113",
    "subject": "AFEE",
    "number": "5113",
    "honors": false,
    "writing": false,
    "name": "AGED:   Dev & Tech",
    "fullname": "Adult Agricultural Education Program Development and Technology",
    "info": "Organization and implementation of education programs for farmers, farm managers, and agribusiness personnel using community and environmental resources, agricultural and instructional technology, and management information systems to attain family and business goals.",
    "prereq": {}
  },
  {
    "uid": "002731",
    "code": "AFEE5237",
    "subject": "AFEE",
    "number": "5237",
    "honors": false,
    "writing": false,
    "name": "Mento Sup Ag Ed Tea",
    "fullname": "Mentorship for Supervising Agricultural Education Teachers",
    "info": "Professional development training for experienced teachers to serve as mentors for beginning and student teachers of agricultural education.  Emphasis on supervision and assessment of teaching performance. Focus on critical period of induction into the teaching profession.",
    "prereq": {}
  },
  {
    "uid": "003559",
    "code": "AFEE5239",
    "subject": "AFEE",
    "number": "5239",
    "honors": false,
    "writing": false,
    "name": "Prog Org & Mgt/AgEd",
    "fullname": "Program Organization and Management in Agricultural Education",
    "info": "Analysis of organization, management, and assessment of agricultural education programs at the middle, high school, and adult levels.",
    "prereq": {}
  },
  {
    "uid": "003248",
    "code": "AFEE5290",
    "subject": "AFEE",
    "number": "5290",
    "honors": false,
    "writing": false,
    "name": "Cur Issues AGEE",
    "fullname": "Seminar: Current Issues in Agricultural Education and Extension",
    "info": "Exploration of current issues in agricultural education and extension, strategies of response, implications of response actions, and related leadership roles.",
    "prereq": {}
  },
  {
    "uid": "001858",
    "code": "AFEE5296",
    "subject": "AFEE",
    "number": "5296",
    "honors": false,
    "writing": false,
    "name": "Prof Exp: Pract",
    "fullname": "Professional Experience Practicum in Agricultural Education and Extension",
    "info": "Observation, study, and experience in agricultural business and industry; identification of educational problems observed in the agricultural industry; evaluation of personal experience.",
    "prereq": {}
  },
  {
    "uid": "003202",
    "code": "AFEE5331",
    "subject": "AFEE",
    "number": "5331",
    "honors": false,
    "writing": false,
    "name": "Hist Phil Systems of Ext",
    "fullname": "History, Philosophy, and Systems of Extension",
    "info": "History and philosophy of extension; modification and adaptation to worldwide methods and approved practices; extension methodologies; innovative approaches; systems appropriate to development environments.",
    "prereq": {}
  },
  {
    "uid": "002918",
    "code": "AFEE5341",
    "subject": "AFEE",
    "number": "5341",
    "honors": false,
    "writing": false,
    "name": "Global Prog Del Techniques Ex",
    "fullname": "Global Program Delivery Techniques and Technology of Extension",
    "info": "Educational activities, teaching, and communications methods and techniques, from outreach to extension services, with an emphasis on youth and adult education programs in different global settings.",
    "prereq": {}
  },
  {
    "uid": "002908",
    "code": "AFEE5351",
    "subject": "AFEE",
    "number": "5351",
    "honors": false,
    "writing": false,
    "name": "Methods for Change",
    "fullname": "Methods for Change in Developing Countries",
    "info": "Strategies and methodologies promoting change in developing countries.  Examination of sociological and cultural parameters of improved practices in rural, community, and agricultural development. Project planning, implementation, and evaluation related to change in developing countries.",
    "prereq": {}
  },
  {
    "uid": "003204",
    "code": "AFEE5361",
    "subject": "AFEE",
    "number": "5361",
    "honors": false,
    "writing": false,
    "name": "World Development Problems",
    "fullname": "World Development Problems",
    "info": "Development in Third World countries. Examples of First World development problems. Population, health and disease, education, agriculture, industry, finance, politics, and human rights.\n\nprereq: Grad students only",
    "prereq": {}
  },
  {
    "uid": "003245",
    "code": "AFEE5371",
    "subject": "AFEE",
    "number": "5371",
    "honors": false,
    "writing": false,
    "name": "Farming Systems Res/Ext",
    "fullname": "Farming Systems Research and Extension",
    "info": "Introduction to the theory and practice of linking farming systems, research, and extension. An interdisciplinary and holistic approach to rural development for individuals and communities throughout the world.",
    "prereq": {}
  },
  {
    "uid": "797955",
    "code": "AFEE5401",
    "subject": "AFEE",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Intro to FBM Ed Teaching",
    "fullname": "Introduction to Farm Business Management Education Teaching",
    "info": "Farm business management career and technical education teaching. Philosophy, history, mission, purposes. Course development, learning styles, roles of instructor. Rewards of profession. Curriculum. Foundational economics principles. Instructional methods. Recruiting/retaining students.",
    "prereq": {}
  },
  {
    "uid": "791419",
    "code": "AFEE5405",
    "subject": "AFEE",
    "number": "5405",
    "honors": false,
    "writing": false,
    "name": "Adv Farm Fin Analysis Methods",
    "fullname": "Advanced Farm Financial Analysis Methodology and Concepts",
    "info": "Farm financial analysis concepts, whole entity financial analysis issues/tools, enterprise analysis options/methodologies. Evaluation of industry standardization efforts. Analysis of where each option fits.",
    "prereq": {}
  },
  {
    "uid": "791420",
    "code": "AFEE5407",
    "subject": "AFEE",
    "number": "5407",
    "honors": false,
    "writing": false,
    "name": "Adv. Farm Fin. Analysis Applic",
    "fullname": "Application of Advanced Farm Financial Analysis Tools and Methods",
    "info": "Use of advanced farm financial analysis tools/methodology to analyze financial performance of actual farm businesses. Case farms are used to apply whole entity financial analysis tools/concepts and enterprise analysis methodologies.",
    "prereq": {}
  },
  {
    "uid": "795537",
    "code": "AFEE5409",
    "subject": "AFEE",
    "number": "5409",
    "honors": false,
    "writing": false,
    "name": "Teaching Strat Fm Bus Planning",
    "fullname": "Seminar: Teaching Strategic Farm Business Planning",
    "info": "Teaching strategic business planning to farm managers and agricultural professionals. Philosophy of strategic management, components of a strategic business plan. Materials/tools to apply strategic farm business planning in educational programs. Students apply strategic planning methods/concepts to case farm businesses.   ",
    "prereq": {}
  },
  {
    "uid": "797483",
    "code": "AFEE5411",
    "subject": "AFEE",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Teaching Farm Fin Planning",
    "fullname": "Seminar: Farm Financial Planning Teaching Tools and Methods",
    "info": "Preparation to teach farm financial planning to farm managers and agricultural professionals. Principles/concepts of long range financial planning and short range cash flow planning. Farm planning software tools, case farm situations, practical farm planning experience.",
    "prereq": {}
  },
  {
    "uid": "795540",
    "code": "AFEE5413",
    "subject": "AFEE",
    "number": "5413",
    "honors": false,
    "writing": false,
    "name": "Tch. Commodity Mktg Tools",
    "fullname": "Seminar: Teaching Effective Use of Commodity Marketing Tools",
    "info": "Teaching commodity marketing tools to farm managers and agricultural professionals. Commodity marketing tools, including cash forward contracts, futures, and options, and how to use them to enhance price and protect income. How to choose marketing tools, given financial/market conditions.",
    "prereq": {}
  },
  {
    "uid": "795541",
    "code": "AFEE5415",
    "subject": "AFEE",
    "number": "5415",
    "honors": false,
    "writing": false,
    "name": "Teaching Commodity Mktg Strat",
    "fullname": "Seminar: Teaching Commodity Marketing Strategies",
    "info": "Teaching commodity market planning to farm managers and agricultural professionals. Development of marketing plans to enhance price and protect income. Introduction to tools to simulate implementation of plans against actual price scenarios.",
    "prereq": {}
  }
]