[
  {
    "uid": "795135",
    "code": "AHS1101",
    "subject": "AHS",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Orientation to Health Careers",
    "fullname": "Orientation to Health Careers",
    "info": "This course is for students who are exploring health careers. Students will have the opportunity to assess their work values and interests, to learn about the academic and experiential requirements from over 20+ guest speakers of health professional programs. By the end of the course, students will integrate new found self-awareness and health career knowledge into a comprehensive career action plan that best meets their career interests.",
    "prereq": {}
  },
  {
    "uid": "798927",
    "code": "AHS1102",
    "subject": "AHS",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Orientation to Health Careers",
    "fullname": "Orientation to Health Careers",
    "info": "This course is for students who are exploring health careers. Students will have the opportunity to assess their work values and interests, to learn about the academic and experiential requirements of many health professional programs. By the end of the course, students will integrate new found self-awareness and health career knowledge into a comprehensive career action plan that best meets their career interests.",
    "prereq": {}
  },
  {
    "uid": "806434",
    "code": "AHS1104",
    "subject": "AHS",
    "number": "1104",
    "honors": false,
    "writing": false,
    "name": "Experiences in Health",
    "fullname": "Experiences in Health",
    "info": "AHS 1104 Experiences in Health is a two (2) credit course, offered in-person. Classes will be in the classroom every third week, and the other class days will be spent in an experiential learning opportunity in one of our health science schools. Locations will be provided on Canvas. This course is designed for students enrolled in the Health Professions Pathways program. This course will involve hands-on experiential learning in collaboration with many of our health science programs at the University. Including experiences in Dentistry, Medical Lab Science, Nursing, Occupational Therapy, Pharmacy, Physical Therapy, Public Health, and Veterinary Medicine. This course is designed for those interested in exploring a variety of health professions, learning about the different roles of a healthcare team, as well as the attributes and qualities of inter-professional teams in healthcare. The course will also cover materials related to professional development and preparation for a health professional program. prereq: Enrolled in the Health Professions Pathways Program; AHS 1101, AHS 1102 or AHS 1600.",
    "prereq": {
      "or": [
        "795135",
        "798927"
      ]
    }
  },
  {
    "uid": "803873",
    "code": "AHS1611",
    "subject": "AHS",
    "number": "1611",
    "honors": false,
    "writing": false,
    "name": "The Future Physician",
    "fullname": "The Future Physician: Medicine in the 21st Century",
    "info": "Multi-disciplinary field of medicine. Challenges shaping work of health professionals in health care field. History of medicine/health. Global health issues/health care. Roles of physicians, team members, patient.",
    "prereq": {}
  },
  {
    "uid": "796324",
    "code": "AHS1612",
    "subject": "AHS",
    "number": "1612",
    "honors": false,
    "writing": false,
    "name": "The Future Physician",
    "fullname": "The Future Physician - Life & Work of a Physician",
    "info": "The Life and Work of a Physician, this course features specialists who share their passion for their specialty, as well as their own personal journey into medicine and their specialty.  \n\n",
    "prereq": {}
  },
  {
    "uid": "796944",
    "code": "AHS1613",
    "subject": "AHS",
    "number": "1613",
    "honors": false,
    "writing": false,
    "name": "Experiences in Healthcare",
    "fullname": "Experiences in Health Care and Public Health",
    "info": "An ideal course for students interested in any health profession career. This is a service-learning course, and students will find and participate in 35 hours of volunteering in a setting relevant to their future health career. Throughout the course students will reflect on their volunteer experiences. \n\nThis is an asynchronous, online course with weekly assignments and discussions. Over the first half of the semester students explore concepts related to interprofessional collaborative team approaches in healthcare. During the second half of the semester, students compile the individual components that will be part of their application to the health profession program they are pursuing.",
    "prereq": {}
  },
  {
    "uid": "802472",
    "code": "AHS2301",
    "subject": "AHS",
    "number": "2301",
    "honors": false,
    "writing": false,
    "name": "Orientation Clinical Research",
    "fullname": "Orientation to Research and Clinical Research",
    "info": "This course introduces Health Profession Pathways pre-health undergraduates to research and clinical research. \nResearch is a very broad field; as such, it is critical for students to explore and develop a baseline of their research interests before entering a research lab. The research exploration and application process can be daunting, therefore this course will focus on the overarching aspects of research in order to support students on their journey to becoming future researchers. This course will also focus on the differences between bench research and clinical research.\n",
    "prereq": {}
  },
  {
    "uid": "806362",
    "code": "AHS2707",
    "subject": "AHS",
    "number": "2707",
    "honors": false,
    "writing": false,
    "name": "Global Health Challenges",
    "fullname": "Global Health Challenges for Future Health Professionals",
    "info": "This is a two-credit course designed for students who have an interest in learning more about global health careers, including the issues and the challenges and opportunities health professionals face as they work in global health. \n\nEvery year this course is designed a little differently – to respond to current events in global health.  We have focused on topics including: pandemic flu, natural and man made disasters, social determinants of health, immigration and other topics. ",
    "prereq": {}
  },
  {
    "uid": "817554",
    "code": "AHS3001",
    "subject": "AHS",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Health and Medicine in India",
    "fullname": "Health and Medicine in India in a Social and Cultural Context",
    "info": "Students are required to attend two pre-orientations, travel to India on the global seminar, and complete a project and presentation upon their return to the United States.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "817551",
    "code": "AHS3002",
    "subject": "AHS",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Global Health in Thailand",
    "fullname": "Global Health in Thailand - Humans, Elephants, and Disease",
    "info": "\t\nGlobal Health in Thailand is a Global Seminar that travels to Chiang Mai, Thailand to examine the relationship between human, animal, and environmental health through the One Health approach. The course travels to Thailand over winter break and then meets for the first half of Spring semester. For more information, see the Learning Abroad Center website.",
    "prereq": {}
  },
  {
    "uid": "825329",
    "code": "AHS3003",
    "subject": "AHS",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Sust Apprch to Health - France",
    "fullname": "Sustainable Approaches to Health in France",
    "info": "A wide range of factors influences health status in a country including politics, economics, culture, history and the systems that provide structure and process in country.  As the global world developed the 2030 Sustainable Development Goals (SDGs) framework, we have seen an increase in innovative strategies by countries to meet the 2030 goals, with France emerging as a leader in their efforts. The 2030 Sustainable Development Goals are framed by five categories: planet, people, prosperity, peace, and partnership.  France has made some innovative efforts to move the needle in each of these categories. For example, France is leading the way with food security, having introduced a new international strategy for food security, nutrition, and sustainable agriculture in October 2019.  From public health and healthcare systems to food safety and security, the extensive challenges require collaboration, coordination, and an interprofessional approach to be successful.\n\nAccording to writer Kim Ann Zimmerman, “The culture and underlying values in France are distinctly different from the US. The French believe in égalité, which means equality, and is part of the country's motto: \"Liberté, Egalité, Fraternité.\" Many say they place a higher importance on equality than liberty and fraternity, the other two words in the motto.”  We will explore how France’s history, culture, and underlying values affect health, health disparities and systems that influence health, healthcare and SDGs",
    "prereq": {}
  },
  {
    "uid": "818292",
    "code": "AHS3004",
    "subject": "AHS",
    "number": "3004",
    "honors": false,
    "writing": false,
    "name": "Health in the Andes",
    "fullname": "Health in the Andes- Humans, Animals, and Ecosystems",
    "info": "During the first half of the spring semester at the University of Minnesota, students will learn about the challenges and opportunities of addressing the United Nations Sustainable Development Goals in Ecuador while comparing and contrasting with the US and/or Minnesota. Students will work in teams who will be tasked to focus on a perspective of a Sustainable Development Goal throughout the semester. Students will also learn very basic Spanish words and phrases in preparation for time in Ecuador. Through taking and learning about the Intercultural Development Inventory and cultural development and reflection activities including Observe, Describe, Interpret, and Evaluate (ODIE), students will learn more about their own cultures while preparing to openly experience cultures in Ecuador.  \n\nDuring their time abroad, students will have the opportunity to apply the knowledge learned in the early spring semester to observations and experiences in Ecuador. The teams will ask questions during site visits from their assigned SDG perspective in preparation for their final project on SDGs in Ecuador. Site visits will include a visit to Colonial Quito and the Mitad del Mundo City Museum. Students will visit an urban and rural health center, the CINCA Agroecological Center, the San Clemente Pukyu Pamba project featuring an indigenous community where they will share a meal with the community. Students will also participate in an indigenous healing ceremony. Finally students will visit Pambilino, a Bosque Escuela, located in  the northwest of Ecuador near the community of Mashpi, a nature reserve of the Choco rainforest that has a 4 hectare permaculture farm in the North Occidental of Ecuador, nestled within the tropical foothills of Ecuador. They work to teach sustainable agroforestry techniques to those that want to learn on the Bosque-escuela.\n\nUpon returning to Minnesota, the students will participate in re-entry activities, present their final project, and have a final class debrief. Students will complete reflective journal entries throughout the semester and a final personal reflection on SGDs in Ecuador compared and contrasted to Minnesota/USA.",
    "prereq": {}
  },
  {
    "uid": "813127",
    "code": "AHS3101",
    "subject": "AHS",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "New Health Professions Team",
    "fullname": "The New Health Professions Team",
    "info": "The future health of our world population requires a generation of creative, motivated, strategic, expansive thinkers prepared to collaborate across disciplines and sectors to preempt and address the causes of poor health in patients and populations. The knowledge and skills needed to be successful come from all disciplines, not just the health professions, and require us to learn about and work with each other. In addition to sharing discipline specific knowledge, the key is to translate concepts and language so interprofessional teams can identify, dissect, define, and solve health-related grand challenges together. This course will help students grow in their understanding and capacity to work in interdisciplinary teams in a multitude of settings, from serving patients to serving communities. \n\nprereq: This course is recommended for junior and senior undergraduate students pursuing a health career.",
    "prereq": {}
  },
  {
    "uid": "809328",
    "code": "AHS3401",
    "subject": "AHS",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Writing a Personal Statement",
    "fullname": "Writing a Personal Statement for a Health Program",
    "info": "AHS 3401 will keep you on track to write a compelling and unique personal statement. This course is designed for students who will be applying to a health professional degree program (i.e. medicine, dentistry, pharmacy, physical therapy, etc.). \n\nprereq: Junior or Senior status. Students must have a competitive GPA, and be within one year of submitting their application for a health professional degree program. ",
    "prereq": {}
  },
  {
    "uid": "803279",
    "code": "AHS4393",
    "subject": "AHS",
    "number": "4393",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Students participating in a directed study will carry out an independent project under supervision of an instructor from the Pre-Health Student Resource Center. Registering for directed study allows you to get credit for conducting research or independent studies that match with your interest as a future health professional.  You should discuss your interest with an instructor prior to completing your directed study contract \nhttp://z.umn.edu/directed_activity \n\nprereq: instructor consent",
    "prereq": {}
  },
  {
    "uid": "812132",
    "code": "AHS5100",
    "subject": "AHS",
    "number": "5100",
    "honors": false,
    "writing": false,
    "name": "HIV Drug Discovery",
    "fullname": "HIV Drug Discovery",
    "info": "Basic virology, medicinal chemistry, pharmacology of HIV chemotherapy. General process of drug discovery, including target selection/validation, in vitro assay development, computer-aided inhibitor design strategies/drug-like properties. Major classes of FDA-approved anti-HIV drugs. Intellectual properties, FDA regulatory issues, successful antiviral discovery story.\n\nprereq: One year of organic chemistry, [CHEM 2301 and 2302] or equivalent, [one semester of biochemistry], [BIOC 3021 or equivalent]",
    "prereq": {
      "or": [
        {
          "and": [
            "002392",
            "002393"
          ]
        },
        {
          "or": [
            "014290"
          ]
        }
      ]
    }
  },
  {
    "uid": "799497",
    "code": "AHS6001",
    "subject": "AHS",
    "number": "6001",
    "honors": false,
    "writing": false,
    "name": "Emergency Readiness Rounds",
    "fullname": "Emergency Readiness Rounds",
    "info": "How to take the lead in a hospital, public health agency, or health service organization during a disaster. Allocating scarce health service resources in an emergency. Role of emergency incident command system in a public health and health care delivery system. Preparedness for bioterrorism, infectious disease outbreaks, and emerging health threats. Current issues/controversies. Five seminars each semester. Offered face-to-face and via webcast in a grand rounds format.",
    "prereq": {}
  }
]