[
  {
    "uid": "008666",
    "code": "AMIN1001",
    "subject": "AMIN",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Am. In. & Indigenous Peoples",
    "fullname": "Introduction to American Indian & Indigenous Peoples",
    "info": "Introduction to how voices/visions of indigenous peoples have contributed to history of cultural expression in North America. Historic contexts/varieties of this expression by region, tribal cultures. Emphasizes contributions in literature, philosophy, politics, fine arts.",
    "prereq": {}
  },
  {
    "uid": "788948",
    "code": "AMIN1002",
    "subject": "AMIN",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Indigenous Peoples Global Pers",
    "fullname": "Indigenous Peoples in Global Perspective",
    "info": "Colonial experiences of selected indigenous peoples in Americas, Euroasia, Pacific Rim.",
    "prereq": {}
  },
  {
    "uid": "793246",
    "code": "AMIN1003",
    "subject": "AMIN",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "American Indians in MN",
    "fullname": "American Indians in Minnesota",
    "info": "History, culture, and lived experience of American Indian people in Minnesota. Self-representation and histories of Anishinaabe (Ojibwe) and Dakota peoples through film, music, oral traditions, and written texts. Work by non-Indian scholars focuses on cultural, philosophical, and linguistic perspectives of Anishinaabe and Dakota peoples.",
    "prereq": {}
  },
  {
    "uid": "010037",
    "code": "AMIN1101",
    "subject": "AMIN",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Beg Ojibwe I",
    "fullname": "Beginning Ojibwe I",
    "info": "Acquisition of speaking skills, fundamentals of grammar, writing systems.",
    "prereq": {}
  },
  {
    "uid": "010045",
    "code": "AMIN1102",
    "subject": "AMIN",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Beg Ojibwe II",
    "fullname": "Beginning Ojibwe II",
    "info": "Acquisition of speaking skills, fundamentals of grammar, and writing systems.",
    "prereq": {}
  },
  {
    "uid": "010087",
    "code": "AMIN1121",
    "subject": "AMIN",
    "number": "1121",
    "honors": false,
    "writing": false,
    "name": "Beg Dakota I",
    "fullname": "Beginning Dakota I",
    "info": "Development of the four skills of language acquisition: listening, speaking, reading, and writing. Oral drills and in-class participation focused on questions and answers.",
    "prereq": {}
  },
  {
    "uid": "010090",
    "code": "AMIN1122",
    "subject": "AMIN",
    "number": "1122",
    "honors": false,
    "writing": false,
    "name": "Beg Dakota II",
    "fullname": "Beginning Dakota II",
    "info": "Further development of language acquisition skills with oral drills and in-class participation focused on questions and answers.",
    "prereq": {}
  },
  {
    "uid": "803615",
    "code": "AMIN1201",
    "subject": "AMIN",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Racial Formation/Transform US",
    "fullname": "Racial Formation and Transformation in the United States",
    "info": "How aggrieved racialized groups struggle over identity, culture, place, and meaning. Histories of racialization. Strategies toward rectification of historical injustices from dispossession, slavery, exploitation, and exclusion.",
    "prereq": {}
  },
  {
    "uid": "795901",
    "code": "AMIN1902",
    "subject": "AMIN",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topic specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "799009",
    "code": "AMIN1905",
    "subject": "AMIN",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Course Guide.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "791122",
    "code": "AMIN1908W",
    "subject": "AMIN",
    "number": "1908",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "817028",
    "code": "AMIN1911",
    "subject": "AMIN",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Creation Stories Am Indian Lit",
    "fullname": "Creative Process and Creation Stories in American Indian Literature",
    "info": "Creation is a powerful word in native oral/written literary traditions, speaking not so much of an event from the past (like the Big Bang), but more of a process and a place we are implicated in. We live in creation and in living in this place we seek to see to its ongoing health. In this course we will explore prominent ideas and themes in Native creation stories, by reading stories and scholarly commentary on what creation means in Native philosophy. Our reading will lead us to think about what we are doing to creation in an environmental sense, and we will think about how Native stories offer other perspectives on how we may think about how we are treating creation. We will explore the themes/ideas from the readings with creative writing, reflecting on our own relationship with creation through poetry, fiction, and essay. Creation is powerfully good for all of us!",
    "prereq": {}
  },
  {
    "uid": "817991",
    "code": "AMIN1912",
    "subject": "AMIN",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Strange Spirits Am. Indian Lit",
    "fullname": "Strange Spirits: Monsters, Star Beings, and Other Mysterious Creatures in American Indian Literature",
    "info": "Maybe you've seen a movie where the characters spot some strange creature moving through the dark woods of a shadowy night and one of them explains, \"It's a windigo. Native Americans say it eats human flesh.\" Maybe you wondered what this monster is and what Native people think of it. Maybe you thought it strange that a film was using a creature from Native tradition to threaten non-Native characters. Maybe you thought using such a creature was a bit too similar to those old movies where \"savage\" Indians threaten pioneer families.\n\nIn this seminar, we explore what strange spirits like windigos, Sasquatch, or Star Beings (aliens) mean in Native and non-Native contexts. In Indigenous contexts, such stories carry knowledge about how to live ethically with the world. We will also examine texts by non-Natives that engage with the Native content of these stories, asking whether they engage with this content as knowledge or as entertainment. Our comparative examination raises important questions about the relation of colonialism to the appropriation of Native lands and cultural expressions.",
    "prereq": {}
  },
  {
    "uid": "816461",
    "code": "AMIN3001",
    "subject": "AMIN",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Public History",
    "fullname": "Public History",
    "info": "Interpretations of collective past as produced in public venues, including museum exhibitions, films, theme parks, and websites. Intellectual and political issues in history produced for public audiences. Career opportunities.",
    "prereq": {}
  },
  {
    "uid": "010058",
    "code": "AMIN3103",
    "subject": "AMIN",
    "number": "3103",
    "honors": false,
    "writing": false,
    "name": "Int Ojibwe I",
    "fullname": "Intermediate Ojibwe I",
    "info": "Improving speaking skills; grammatical structures; storytelling, oral history, and translation projects.",
    "prereq": {}
  },
  {
    "uid": "010081",
    "code": "AMIN3104",
    "subject": "AMIN",
    "number": "3104",
    "honors": false,
    "writing": false,
    "name": "Int Ojibwe II",
    "fullname": "Intermediate Ojibwe II",
    "info": "Improving speaking skills; grammatical structure; storytelling, oral history, and translation projects.",
    "prereq": {}
  },
  {
    "uid": "791486",
    "code": "AMIN3107",
    "subject": "AMIN",
    "number": "3107",
    "honors": false,
    "writing": false,
    "name": "Structure of Anishinaabemowin",
    "fullname": "The Structure of Anishinaabemowin: The Ojibwe Language",
    "info": "Analysis of Anishinaabemowin (Ojibwe language) structure in the context of an endangered Algonquian language. Examine writing systems, phonological (sound) features, morphology (word parts), and grammatical structures as documented historically and presently. The aim of the course is to provide students with an overview of the structure of Anishinaabemowin and introduce them to primary sources readings. Unlike language courses students may be familiar with from other departments, this course will not require memorization of extensive amounts of vocabulary — our focus will be on understanding the structure of the language and acquiring an appreciation of the relevant linguistic issues and language revitalization issues.",
    "prereq": {}
  },
  {
    "uid": "791487",
    "code": "AMIN3108",
    "subject": "AMIN",
    "number": "3108",
    "honors": false,
    "writing": false,
    "name": "History of Anishinaabemowin",
    "fullname": "History of Anishinaabemowin, the Ojibwe Language",
    "info": "Historical development of Anishinaabwmowin.\n\nprereq: 3107",
    "prereq": {
      "and": [
        "791486"
      ]
    }
  },
  {
    "uid": "791488",
    "code": "AMIN3109",
    "subject": "AMIN",
    "number": "3109",
    "honors": false,
    "writing": false,
    "name": "Anishinaabe Literature",
    "fullname": "Anishinaabe Literature",
    "info": "Readings in Anishinaabe oral literature.\n\nprereq: 3103",
    "prereq": {
      "and": [
        "010058"
      ]
    }
  },
  {
    "uid": "010093",
    "code": "AMIN3123",
    "subject": "AMIN",
    "number": "3123",
    "honors": false,
    "writing": false,
    "name": "Int Dakota I",
    "fullname": "Intermediate Dakota I",
    "info": "Development of listening, speaking, reading, and writing skills with oral drills and in class participation focused on questions and answers.",
    "prereq": {}
  },
  {
    "uid": "010095",
    "code": "AMIN3124",
    "subject": "AMIN",
    "number": "3124",
    "honors": false,
    "writing": false,
    "name": "Int Dakota II",
    "fullname": "Intermediate Dakota II",
    "info": "Further development of the listening, speaking, reading, and writing skills with oral drills and in class participation focused on questions and answers.",
    "prereq": {}
  },
  {
    "uid": "791489",
    "code": "AMIN3141",
    "subject": "AMIN",
    "number": "3141",
    "honors": false,
    "writing": false,
    "name": "American Indian Lang. Planning",
    "fullname": "American Indian Language Planning",
    "info": "Planning for maintenance/revitalization of North American indigenous languages. Condition/status of languages. Documentation, cultivation, literacy, education.",
    "prereq": {}
  },
  {
    "uid": "793317",
    "code": "AMIN3143",
    "subject": "AMIN",
    "number": "3143",
    "honors": false,
    "writing": false,
    "name": "Language in AmIn Culture & Soc",
    "fullname": "Language in American Indian Culture and Society",
    "info": "Survey of North American indigenous languages in social/cultural contexts, from before European contact to present.",
    "prereq": {}
  },
  {
    "uid": "008058",
    "code": "AMIN3201W",
    "subject": "AMIN",
    "number": "3201",
    "honors": false,
    "writing": true,
    "name": "American Indian Literature",
    "fullname": "American Indian Literature",
    "info": "Comparative studies of oral traditions, modern literature from various tribal cultures.",
    "prereq": {}
  },
  {
    "uid": "791490",
    "code": "AMIN3203W",
    "subject": "AMIN",
    "number": "3203",
    "honors": false,
    "writing": true,
    "name": "American Indian Aesthetics",
    "fullname": "American Indian Aesthetics",
    "info": "Ways in which American Indians have distinguished themselves as artistic thinkers. Regional traditions of American Indian art. Ways in which art was connected with everyday life and with religious practices. How American Indians thought about art differently from their Western counterparts. Innovations that contemporary American Indian artists have made in the way art is done and thought about by Indians/non-Indians.",
    "prereq": {}
  },
  {
    "uid": "810017",
    "code": "AMIN3205",
    "subject": "AMIN",
    "number": "3205",
    "honors": false,
    "writing": false,
    "name": "Pre-Columbian Art",
    "fullname": "Art of Central and South America Before Columbus",
    "info": "Art/architecture of native peoples of Americas from twelfth century B.C. until arrival of Europeans in sixteenth century. Ways that people living in diverse areas of South America/Mesoamerica used art/architecture. Tools to investigate Pre-Columbian art at more advanced levels.\n",
    "prereq": {}
  },
  {
    "uid": "009813",
    "code": "AMIN3301",
    "subject": "AMIN",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "American Indian Philosophies",
    "fullname": "American Indian Philosophies",
    "info": "World views of indigenous people of Americas. Topics include native medicines/healing practices, ceremonies/ritual, governance, ecology, humor, tribal histories, status of contemporary native people.",
    "prereq": {}
  },
  {
    "uid": "789025",
    "code": "AMIN3303",
    "subject": "AMIN",
    "number": "3303",
    "honors": false,
    "writing": false,
    "name": "American Indians & Photography",
    "fullname": "American Indians and Photography",
    "info": "Historical/comparative overview of photos in which American Indian people are central subjects. Primary features of images in American Indian photos. Relationships among those involved in making/viewing photos. Ways in which photos are interpreted. Relation of photos to social contexts in which they are produced and to agencies of those who stand behind their making.",
    "prereq": {}
  },
  {
    "uid": "809851",
    "code": "AMIN3304",
    "subject": "AMIN",
    "number": "3304",
    "honors": false,
    "writing": false,
    "name": "Indigenous Filmmakers",
    "fullname": "Indigenous Filmmakers",
    "info": "Analysis of film/video made by American Indian writers, directors, producers within contexts of tribally specific cultures/histories, as well as within context of US culture/film history. ",
    "prereq": {}
  },
  {
    "uid": "807950",
    "code": "AMIN3312",
    "subject": "AMIN",
    "number": "3312",
    "honors": false,
    "writing": false,
    "name": "AmIn Envl Issues/Perspectives",
    "fullname": "American Indian Environmental Issues and Ecological Perspectives",
    "info": "American Indian environmental issues in U.S./Canada. Analysis of social, political, economic, legal forces/institutions. Colonial histories/tribal sovereignty.",
    "prereq": {}
  },
  {
    "uid": "808629",
    "code": "AMIN3314",
    "subject": "AMIN",
    "number": "3314",
    "honors": false,
    "writing": false,
    "name": "AmIn Nat Res Mgmt & Env Policy",
    "fullname": "Natural Resource Management and Environmental Policy in Indian Country",
    "info": "American Indian natural resource management issues in U.S./Canada. Analysis of land tenure practices (pre-/post-European arrival), federal management programs, tribal natural resource governance/policy. Co-management initiatives between federal/state/tribal agencies.",
    "prereq": {}
  },
  {
    "uid": "008445",
    "code": "AMIN3401",
    "subject": "AMIN",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "American Indian Art",
    "fullname": "American Indian Art",
    "info": "Visual arts depicting rituals, traditions, values, and worldviews of major American Indian populations. Creative processes of art from pre-contact times through contemporary art.  Emphasis placed on style, technique, materials and imagery, and symbolism.",
    "prereq": {}
  },
  {
    "uid": "794412",
    "code": "AMIN3402",
    "subject": "AMIN",
    "number": "3402",
    "honors": false,
    "writing": false,
    "name": "Am In and the Cinema",
    "fullname": "American Indians and the Cinema",
    "info": "Representations of American Indians in film, historically/contemporarily. What such representations assert about Native experience and cultural viability. What they reflect about particular relationships of power.",
    "prereq": {}
  },
  {
    "uid": "789429",
    "code": "AMIN3409",
    "subject": "AMIN",
    "number": "3409",
    "honors": false,
    "writing": false,
    "name": "American Indian Women",
    "fullname": "American Indian Women: Ethnographic and Ethnohistorical Perspectives",
    "info": "Comparative survey of ethnographic/ethnohistorical writings by/about American Indian women.",
    "prereq": {}
  },
  {
    "uid": "788978",
    "code": "AMIN3501",
    "subject": "AMIN",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Indigenous Gov't & Politics",
    "fullname": "Indigenous Tribal Governments and Politics",
    "info": "History, development, structure, politics of American Indian Governments. North American indigenous societies from pre-colonial times to present.  Evolution of aboriginal governments confronted/affected by colonizing forces of European/Euro-American states. Bearing of dual citizenship on nature/powers of tribal governments in relation to states, federal government.",
    "prereq": {}
  },
  {
    "uid": "793054",
    "code": "AMIN3601",
    "subject": "AMIN",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "AmIn Oral Traditions",
    "fullname": "American Indian Oral Traditions",
    "info": "Survey of oral traditions of indigenous peoples of North America.",
    "prereq": {}
  },
  {
    "uid": "810186",
    "code": "AMIN3602",
    "subject": "AMIN",
    "number": "3602",
    "honors": false,
    "writing": false,
    "name": "Archaeology & Native Americans",
    "fullname": "Archaeology and Native Americans",
    "info": "Historical, political, legal, and ethical dimensions of the relationship of American archaeology to American Indian people. Case studies of how representational narratives about Native people are created through archaeology; responses by Native communities; and the frameworks for collaborative and equitable archaeological practice.  Professional ethics in archaeology/heritage studies in American contexts.",
    "prereq": {}
  },
  {
    "uid": "814649",
    "code": "AMIN3604",
    "subject": "AMIN",
    "number": "3604",
    "honors": false,
    "writing": false,
    "name": "Indigenous Immersion Methods",
    "fullname": "Indigenous Immersion Methods for the Home, Classroom, and Community",
    "info": "Prepares students as advanced language students to participate in and facilitate immersion environments within both formal and informal settings including the home, second language classrooms, immersion classrooms, language tables, immersion camps, and other community settings. prereq: OJIB 3104, DAKO 3124 or four semesters of another target language, or with instructor approval.",
    "prereq": {
      "or": [
        "801130",
        "801126"
      ]
    }
  },
  {
    "uid": "010187",
    "code": "AMIN3701",
    "subject": "AMIN",
    "number": "3701",
    "honors": false,
    "writing": false,
    "name": "Ojibwe Culture & History",
    "fullname": "Ojibwe Culture and History",
    "info": "Ojibwe culture, history, and traditions, including philosophy, religion, and lifestyle. Students develop an appreciation for the values and belief systems of traditional Indian people.",
    "prereq": {}
  },
  {
    "uid": "010196",
    "code": "AMIN3711",
    "subject": "AMIN",
    "number": "3711",
    "honors": false,
    "writing": false,
    "name": "Dakota Culture & History",
    "fullname": "Dakota Culture and History",
    "info": "Dakota culture, language, history, literature. Contemporary issues, the arts.",
    "prereq": {}
  },
  {
    "uid": "010279",
    "code": "AMIN3713",
    "subject": "AMIN",
    "number": "3713",
    "honors": false,
    "writing": false,
    "name": "American Indian Great Lakes",
    "fullname": "Lands and Homelands in the American Indian Great Lakes",
    "info": "Tribes that have strong historic ties to Minnesota region, such as the Ojibwe, Dakota, and Ho-Chunk Nations. Integrity/viability of American Indian societies. Conflict of cultures that occurred with Native American and Euroamerican contact in Minnesota and the Great Lakes.",
    "prereq": {}
  },
  {
    "uid": "792218",
    "code": "AMIN3721",
    "subject": "AMIN",
    "number": "3721",
    "honors": false,
    "writing": false,
    "name": "Indians in Minnesota",
    "fullname": "Indians in Minnesota",
    "info": "American Indian history in Minnesota regarding both pre and post European contact. Minnesota tribes, past/present. Focuses on Ojibwe and Dakota and how they interacted. Culture and way of life of tribes. Historical accounts, treaties. Events/issues in Minnesota today that involve Indian people.",
    "prereq": {}
  },
  {
    "uid": "797070",
    "code": "AMIN3870",
    "subject": "AMIN",
    "number": "3870",
    "honors": false,
    "writing": false,
    "name": "Topics -Am Ind Hist",
    "fullname": "Topics in American Indian History",
    "info": "Topics may include social history, oral history, history of particular regions, political systems, education, and policy. Designed for undergraduates.",
    "prereq": {}
  },
  {
    "uid": "792284",
    "code": "AMIN3871",
    "subject": "AMIN",
    "number": "3871",
    "honors": false,
    "writing": false,
    "name": "Amer Indians to 1830",
    "fullname": "American Indian History: Pre-Contact to 1830",
    "info": "American Indian history from the era of ancient Native America to the removal era.  Social, cultural, political, and economic diversity of Native American peoples and Native American experiences with European colonialism.",
    "prereq": {}
  },
  {
    "uid": "792283",
    "code": "AMIN3872",
    "subject": "AMIN",
    "number": "3872",
    "honors": false,
    "writing": false,
    "name": "Indians since 1830",
    "fullname": "American Indian History: 1830 to the Present",
    "info": "Focus on the impact of federal Indian policy on American Indian cultures and societies, and on American Indian culture change.  ",
    "prereq": {}
  },
  {
    "uid": "010277",
    "code": "AMIN3876",
    "subject": "AMIN",
    "number": "3876",
    "honors": false,
    "writing": false,
    "name": "American Indian Education",
    "fullname": "American Indian Education",
    "info": "Educational processes in American Indian cultures. History of school programs established for tribes by missionaries/U.S./Canadian governments. Importance of boarding schools in shaping the lives, families, communities, educational expectations of Indian people in late-19th/early-20th centuries.",
    "prereq": {}
  },
  {
    "uid": "818551",
    "code": "AMIN3896",
    "subject": "AMIN",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "Allows students to examine, reflect on, and construct meaning from their internship experience through self assessment of personal and career needs and goals, examination of what it means to be a \"professional\" and operate within professional environments, evaluation of performance and accomplishments, articulation of knowledge and skills via effective resume writing. A student may only earn credit for a given internship through one course at a time.",
    "prereq": {}
  },
  {
    "uid": "795573",
    "code": "AMIN3920",
    "subject": "AMIN",
    "number": "3920",
    "honors": false,
    "writing": false,
    "name": "American Indian Studies Topics",
    "fullname": "American Indian Studies Topics",
    "info": "Various topics in American Indian Studies.",
    "prereq": {}
  },
  {
    "uid": "008670",
    "code": "AMIN4201",
    "subject": "AMIN",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Topics: American Indian Lit",
    "fullname": "Topics in American Indian Literature",
    "info": "Topics organized around issues of theme or genre or region or tribe or gender.",
    "prereq": {}
  },
  {
    "uid": "797134",
    "code": "AMIN4231",
    "subject": "AMIN",
    "number": "4231",
    "honors": false,
    "writing": false,
    "name": "Color of Public Policy in US",
    "fullname": "Color of Public Policy: African Americans, American Indians, Asian Americans, & Chicanos in the U.S.",
    "info": "Structural or institutional conditions through which people of color have been marginalized in public policy. Critical evaluation of social theory in addressing the problem of contemporary communities of color in the United States. ",
    "prereq": {}
  },
  {
    "uid": "791491",
    "code": "AMIN4301",
    "subject": "AMIN",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Am In Intellectuals",
    "fullname": "American Indian Intellectuals",
    "info": "Contributions that American Indians have made to understanding American Indain topics and the world around them. Works that have stood as paradigms of American Indian thinking. Emphasizes works written after 1945.",
    "prereq": {}
  },
  {
    "uid": "009341",
    "code": "AMIN4402",
    "subject": "AMIN",
    "number": "4402",
    "honors": false,
    "writing": false,
    "name": "Am In Cinema",
    "fullname": "American Indians and the Cinema",
    "info": "The effect of Hollywood cinema on the American Indian image. Lecture, discussion, slides of artistic portrayals of American Indians, film clips, and full-length movies.",
    "prereq": {}
  },
  {
    "uid": "010280",
    "code": "AMIN4501",
    "subject": "AMIN",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Law, Sov'ty, & Treaty Rights",
    "fullname": "Law, Sovereignty, and Treaty Rights",
    "info": "History of American Indian law and the post-contact effects of colonial and U.S. law on American Indians through the 20th century.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "008666"
      ]
    }
  },
  {
    "uid": "008644",
    "code": "AMIN4511",
    "subject": "AMIN",
    "number": "4511",
    "honors": false,
    "writing": false,
    "name": "Indigenous Political Economies",
    "fullname": "Indigenous Political Economies",
    "info": "Sources, nature, consequences of social/economic development/change in Indian communities. Precontact Indian communities. Effect of European contact. Social movements into 20th century, including phenomenon of urban Indian communities.\n\nprereq: 1001",
    "prereq": {
      "and": [
        "008666"
      ]
    }
  },
  {
    "uid": "010281",
    "code": "AMIN4515",
    "subject": "AMIN",
    "number": "4515",
    "honors": false,
    "writing": false,
    "name": "Am In Movements",
    "fullname": "Contemporary American Indian Movements",
    "info": "American Indian organizations and social movements of the 20th century. Explorations of political activism on and off reservations; treaty disputes; economic development strategies; the revival of traditional beliefs.\n",
    "prereq": {}
  },
  {
    "uid": "788979",
    "code": "AMIN4525W",
    "subject": "AMIN",
    "number": "4525",
    "honors": false,
    "writing": true,
    "name": "Federal Indian Policy",
    "fullname": "Federal Indian Policy",
    "info": "Formulation, implementation, evolution, comparison of Indian policy from pre-colonial times to self-governance new millennium. Theoretical approaches to federal Indian policy. Major federal Indian policies. Views/attitudes of policy-makers, reactions of indigenous nations to policies. Effect of bodies of literature related to policies.",
    "prereq": {}
  },
  {
    "uid": "817016",
    "code": "AMIN4532",
    "subject": "AMIN",
    "number": "4532",
    "honors": false,
    "writing": false,
    "name": "Vine Deloria, Jr.",
    "fullname": "Vine Deloria, Jr.: A Renaissance Indigenous Figure",
    "info": "In-depth consideration of indigenous scholar and activist Vine Deloria Jr.'s intellectual works, and impacts on fields such as law, religion and theology, history, natural and social science, literary criticism, education, anthropology, paleontology, and political science. Students read, discuss, produce research on an aspect of Deloria's work.",
    "prereq": {}
  },
  {
    "uid": "810388",
    "code": "AMIN4821W",
    "subject": "AMIN",
    "number": "4821",
    "honors": false,
    "writing": true,
    "name": "Capstone Seminar",
    "fullname": "Capstone Seminar",
    "info": "Seminar for preparation/completion of American Indian Studies Senior Project requirement.",
    "prereq": {}
  },
  {
    "uid": "010284",
    "code": "AMIN4990",
    "subject": "AMIN",
    "number": "4990",
    "honors": false,
    "writing": false,
    "name": "Topics:American Indian Studies",
    "fullname": "Topics in American Indian Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "010283",
    "code": "AMIN4991",
    "subject": "AMIN",
    "number": "4991",
    "honors": false,
    "writing": false,
    "name": "Amer Indian Independent Study",
    "fullname": "Amer Indian Independent Study",
    "info": "Prereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "010289",
    "code": "AMIN4994",
    "subject": "AMIN",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Individually arranged research with faculty to meet student needs and interests.\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "010290",
    "code": "AMIN4996",
    "subject": "AMIN",
    "number": "4996",
    "honors": false,
    "writing": false,
    "name": "Am In Field Study",
    "fullname": "Field Study",
    "info": "Opportunities for experiential learning in a variety of American Indian community settings. Consult department faculty at least one term before enrolling.\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "792211",
    "code": "AMIN5107",
    "subject": "AMIN",
    "number": "5107",
    "honors": false,
    "writing": false,
    "name": "Structure of Anishinaabemowin",
    "fullname": "The Structure of Anishinaabemowin: The Ojibwe Language",
    "info": "Analysis of Anishinaabemowin (Ojibwe language) structure in the context of an endangered Algonquian language. Examine writing systems, phonological (sound) features, morphology (word parts), and grammatical structures as documented historically and presently. The aim of the course is to provide students with an overview of the structure of Anishinaabemowin and introduce them to primary sources readings. Unlike language courses students may be familiar with from other departments, this course will not require memorization of extensive amounts of vocabulary — our focus will be on understanding the structure of the language and acquiring an appreciation of the relevant linguistic issues and language revitalization issues.",
    "prereq": {}
  },
  {
    "uid": "792219",
    "code": "AMIN5108",
    "subject": "AMIN",
    "number": "5108",
    "honors": false,
    "writing": false,
    "name": "History of Anishinaabemowin",
    "fullname": "History of Anishinaabemowin, the Ojibwe Language",
    "info": "Historical development of Anishinaabemowin.\n\nprereq: 3107 or instr consent",
    "prereq": {
      "or": [
        "791486"
      ]
    }
  },
  {
    "uid": "792220",
    "code": "AMIN5109",
    "subject": "AMIN",
    "number": "5109",
    "honors": false,
    "writing": false,
    "name": "Anishinaabe Literature",
    "fullname": "Anishinaabe Literature",
    "info": "Readings in Anishinaabe oral literature.\n\nprereq: 3107 or 5107 or instr consent",
    "prereq": {
      "or": [
        "791486",
        "792211"
      ]
    }
  },
  {
    "uid": "792221",
    "code": "AMIN5141",
    "subject": "AMIN",
    "number": "5141",
    "honors": false,
    "writing": false,
    "name": "AmIn Language Planning",
    "fullname": "American Indian Language Planning",
    "info": "Planning for maintenance/revitalization of North American indigenous languages. Condition/status of languages. Documentation, cultivation, literacy, education.\n\nprereq: 3103 or 3123 or instr consent",
    "prereq": {
      "or": [
        "010058",
        "010093"
      ]
    }
  },
  {
    "uid": "817017",
    "code": "AMIN5202",
    "subject": "AMIN",
    "number": "5202",
    "honors": false,
    "writing": false,
    "name": "Indigenous & Supreme Court",
    "fullname": "Indigenous Peoples and Issues Before the United States Supreme Court",
    "info": "Seminar explores the role and the practice of the US Supreme Court as a policy-making institution when dealing with indigenous nations and their citizens. Analysis of theoretical, behavioral, political, and institutional perspectives. Student work includes reading and textual analysis, leading discussions, analytical research paper.",
    "prereq": {}
  },
  {
    "uid": "796703",
    "code": "AMIN5301",
    "subject": "AMIN",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "AmIn Intellectuals",
    "fullname": "American Indian Intellectuals",
    "info": "Transition Period, 1890-1934. Charles Eastman, Zitkala-Sa, Luther Standing Bear, Arthur Parker. Impact of 1968-1975 Red Power movement. Works by Vine Deloria, Jr., N. Scott Momaday, Paula Gunn Allen, Gerald Vizenor.",
    "prereq": {}
  },
  {
    "uid": "793247",
    "code": "AMIN5303",
    "subject": "AMIN",
    "number": "5303",
    "honors": false,
    "writing": false,
    "name": "American Indians & Photography",
    "fullname": "American Indians and Photography",
    "info": "Historical/comparative overview of photos in which American Indian people are central subjects. Primary features of images in American Indian photos. Relationships among those involved in making/viewing photos. Ways in which photos are interpreted. Relation of photos to social contexts in which they are produced and to agencies of those who stand behind their making.",
    "prereq": {}
  },
  {
    "uid": "795034",
    "code": "AMIN5402",
    "subject": "AMIN",
    "number": "5402",
    "honors": false,
    "writing": false,
    "name": "Am In and the Cinema",
    "fullname": "American Indians and the Cinema",
    "info": "Representations of American Indians in film, historically/contemporarily. What such representations assert about Native experience and cultural viability. What they reflect about particular relationships of power.",
    "prereq": {}
  },
  {
    "uid": "803927",
    "code": "AMIN5407",
    "subject": "AMIN",
    "number": "5407",
    "honors": false,
    "writing": false,
    "name": "Craft of Amer Indian Ethnohist",
    "fullname": "Craft and Conventions of American Indian Ethnohistory",
    "info": "Conventions and paradigmatic approaches scholars follow to represent/interpret written documents and oral traditions in constructing their narratives. Craft of ethnohistory: techniques, methods, styles of criticism.  ",
    "prereq": {}
  },
  {
    "uid": "794278",
    "code": "AMIN5409",
    "subject": "AMIN",
    "number": "5409",
    "honors": false,
    "writing": false,
    "name": "American Indian Women",
    "fullname": "American Indian Women: Ethnographic and Ethnohistorical Perspectives",
    "info": "Comparative survey of ethnographic/ethnohistorical writings by/about American Indian women.",
    "prereq": {}
  },
  {
    "uid": "817830",
    "code": "AMIN5412",
    "subject": "AMIN",
    "number": "5412",
    "honors": false,
    "writing": false,
    "name": "Cmparativ Indigenous Feminisms",
    "fullname": "Comparative Indigenous Feminisms",
    "info": "The course will examine the relationship between Western feminism and indigenous feminism as well as the interconnections between women of color feminism and indigenous feminism. In addition to exploring how indigenous feminists have theorized from 'the flesh' of their embodied experience of colonialism, the course will also consider how indigenous women are articulating decolonization and the embodiment of autonomy through scholarship, cultural revitalization, and activism.",
    "prereq": {}
  },
  {
    "uid": "818972",
    "code": "AMIN5602",
    "subject": "AMIN",
    "number": "5602",
    "honors": false,
    "writing": false,
    "name": "Archaeology & Native Americans",
    "fullname": "Archaeology and Native Americans",
    "info": "Historical, political, legal, and ethical dimensions of the relationship of American archaeology to American Indian people.  Case studies of how representational narratives about Native people are created through archaeology; responses by Native communities; and the frameworks for collaborative and equitable archaeological practice.  Professional ethics in archaeology/heritage studies in American contexts.",
    "prereq": {}
  },
  {
    "uid": "809994",
    "code": "AMIN5802",
    "subject": "AMIN",
    "number": "5802",
    "honors": false,
    "writing": false,
    "name": "The Inka and Their Ancestors",
    "fullname": "Art of the Inka and their Ancestors",
    "info": "Art/architecture of people of Andes, from first appearance in archaeological record until Spanish invasion in 16th century. Problems, theoretical/methodological approaches. Analysis of scholarly writing, focusing on evidence. ",
    "prereq": {}
  },
  {
    "uid": "797071",
    "code": "AMIN5890",
    "subject": "AMIN",
    "number": "5890",
    "honors": false,
    "writing": false,
    "name": "Readings in Amer Indian Hist",
    "fullname": "Readings in American Indian and Indigenous History",
    "info": "Students in this course will read recently published scholarship in American Indian and Indigenous history that takes up pressing research questions, promises to push inquiry in new directions, and that theorizes important interventions in our thinking to understand where the field is situated and moving. Reflecting the instinctively interdisciplinary nature of American Indian and Indigenous history, readings will be drawn not just from the discipline of history but across other disciplines such as Anthropology, American Studies, Geography, Literature, Political Science, and Legal Studies. As well, readings will include scholarship that reaches out to embrace the Global Indigenous studies turn.\nprereq: Advanced undergrad with instr consent or grad student",
    "prereq": {}
  },
  {
    "uid": "819023",
    "code": "AMIN5891",
    "subject": "AMIN",
    "number": "5891",
    "honors": false,
    "writing": false,
    "name": "American Indian Workshop",
    "fullname": "American Indian and Indigenous Studies Workshop",
    "info": "The American Indian and Indigenous Studies Workshop brings graduate and advanced undergraduate students and faculty together to read and provide intensive feedback (written and oral) on their works in progress. As an interdisciplinary field, AIIS students stand to benefit from ongoing and engaged conversations about that work that will deepen and enhance their professionalization in the field. The readings for the workshop are submissions from the membership of the workshop (which will include participants who are not formally enrolled in the workshop). We read and consider two submissions per week (sometimes more if the submissions are shorter) that are pre-circulated to all participants via the workshop's listserv. Readings under consideration include research papers, dissertation chapters, article manuscripts, research proposals, conference papers, and other submissions that will benefit from intensive engagement with the members and will deepen the knowledge of all of the participants. Students will gain experience with the research, writing, and revision process as well as scholarly conversations about original research and writing. The overarching aim of the workshop is to develop research, writing, revision, and scholarly discussion skills as well as community-building in American Indian and Indigenous Studies and professionalization in an increasingly interdisciplinary and global field of study.",
    "prereq": {}
  },
  {
    "uid": "788729",
    "code": "AMIN5920",
    "subject": "AMIN",
    "number": "5920",
    "honors": false,
    "writing": false,
    "name": "Topics:American Indian Studies",
    "fullname": "Topics in American Indian Studies",
    "info": "Various topics in American Indian studies, depending upon instructor/semester.",
    "prereq": {}
  },
  {
    "uid": "792222",
    "code": "AMIN5991",
    "subject": "AMIN",
    "number": "5991",
    "honors": false,
    "writing": false,
    "name": "Grad Level Directed Studies",
    "fullname": "Graduate Level Directed Studies",
    "info": "Contact department for futher information.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "817974",
    "code": "AMIN8301",
    "subject": "AMIN",
    "number": "8301",
    "honors": false,
    "writing": false,
    "name": "Critical Indigenous Theory",
    "fullname": "Critical Indigenous Theory",
    "info": "This course covers the \"critical turn\" in American Indian and Native or Indigenous Studies as evident in the emergence of three overlapping threads or intellectual/political genealogies: critiques of Indigeneity (the claims and conditions of nativeness to specific places), Indigenous Feminist (which foregrounds the salience of gender in indigenous critiques of power structures), and Indigenous Queer, sometimes labeled \"Two-Spirit\" (which foregrounds sexuality). What are the analytical, political and cultural backgrounds and what are their purchases for theory, critique, and practice? For interrogating academic and non-academic (including Indigenous) forms of inquiry and knowledge production and being in the world?",
    "prereq": {}
  },
  {
    "uid": "817647",
    "code": "AMIN8910",
    "subject": "AMIN",
    "number": "8910",
    "honors": false,
    "writing": false,
    "name": "Am Indian & Indig Studies",
    "fullname": "Topics in American Indian and Indigenous Studies",
    "info": "This is a topics shell",
    "prereq": {}
  }
]