[
  {
    "uid": "008657",
    "code": "AMST1001",
    "subject": "AMST",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "AmPopularArt&PublicLife1900-40",
    "fullname": "American Popular Arts and Public Life, 1900-1940",
    "info": "Interdisciplinary study of American society from precontact to industrialization. American literature, art, music, and popular culture in historical context.",
    "prereq": {}
  },
  {
    "uid": "008854",
    "code": "AMST1002",
    "subject": "AMST",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "AmPopArts&Life, 1940-present",
    "fullname": "American Popular Arts and Public Life, 1940 to present",
    "info": "Interdisciplinary study of American society from industrialization through the present. Examination of American literature, art, music, and popular culture in historical context.",
    "prereq": {}
  },
  {
    "uid": "799072",
    "code": "AMST1011",
    "subject": "AMST",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Religions & American Identity",
    "fullname": "Religions and American Identity in the United States from World War II to the Present",
    "info": "Political/cultural watersheds of last 60 years. Changing ideas about religion. Debates within/between religious traditions/communities. How gender, race, class, and sexuality have shaped relationships between religion and politics. Tensions between secularism and religiosity and liberalism and fundamentalism. Ways in which religion has acted as both a progressive and a conservative political force. ",
    "prereq": {}
  },
  {
    "uid": "799631",
    "code": "AMST1012",
    "subject": "AMST",
    "number": "1012",
    "honors": false,
    "writing": false,
    "name": "U.S. on an Immigrant Planet",
    "fullname": "Migrants, Refugees, Citizens, and Exiles: The U.S. on an Immigrant Planet",
    "info": "Immigration to the United States at various historical periods and across geographical/political terrains. How immigration, as a national/racial project, is shaped by legal categories and discursive practices based on race, class, gender, and sexuality. Diverse ways marginalized groups produce national/transnational political practices.",
    "prereq": {}
  },
  {
    "uid": "826600",
    "code": "AMST1101",
    "subject": "AMST",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Imagining Asian America",
    "fullname": "Imagining Asian America",
    "info": "What are the histories, cultures, and experiences of Asian Americans, the fastest-growing group in the United States? How do they fit into the U.S.'s history of immigration, race, and citizenship? Is the \"model minority\" myth really true? This course is an introduction to Asian American Studies, an interdisciplinary field that uses ethnography, literature, histories, films, memoirs, and other texts to study how the history of Asian immigration to the United States has visibly shaped existing Asian American communities and identities, and how \"Asian America\" is central to a more general understanding of American popular culture and public life.\n\nThe course is roughly organized chronologically. We will first begin with an introduction to the field of Asian American Studies by asking the questions: What is Asian America? What is Asian American Studies? We will then examine important concepts, categories, and processes before exploring the rich history of Asian migration to the United States and contemporary issues facing Asian Americans today.\n\nOne of the core principles of this course is to encourage active and interdisciplinary learning. This means that we will be learning in a variety of ways to explore and understand the material (reading, writing, watching, listening, seeing, discussing, presenting). We will be drawing from a wide range of disciplines (history, law, sociology, education, cultural studies, psychology, etc.). And we will be using a variety of materials (memoir, scholarly articles, historical documents, government records, newspapers, films, photographs, popular culture, etc.) Your active participation in these activities is essential.",
    "prereq": {}
  },
  {
    "uid": "016268",
    "code": "AMST1112",
    "subject": "AMST",
    "number": "1112",
    "honors": false,
    "writing": false,
    "name": "Am Cultures II, Transition",
    "fullname": "American Cultures II, Transition",
    "info": "Interdisciplinary study of diversity of American cultures, 1890-1945.  Urban life/leisure, changing family/gender roles, race/national identity.",
    "prereq": {}
  },
  {
    "uid": "016267",
    "code": "AMST1113",
    "subject": "AMST",
    "number": "1113",
    "honors": false,
    "writing": false,
    "name": "Am Cultures III, trans",
    "fullname": "American Cultures III, Transition",
    "info": "Interdisciplinary study of diversity of American cultures, 1945-present.  Family practices/gender roles.  Social change movements (civil rights, American Indian, women's).  Politics of popular culture (music, television, fashion, art).",
    "prereq": {}
  },
  {
    "uid": "008467",
    "code": "AMST1201",
    "subject": "AMST",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Public Ethics",
    "fullname": "Learning Public Ethics Through Arts and the University",
    "info": "Residential College course on study of public ethical decision-making. Case studies of University institutions, literature, and arts, looking at University/public interaction and arts representations to learn ways ethics works in people's participation in public life.",
    "prereq": {}
  },
  {
    "uid": "791979",
    "code": "AMST1401",
    "subject": "AMST",
    "number": "1401",
    "honors": false,
    "writing": false,
    "name": "Comparative Gender/Sexuality",
    "fullname": "Comparative Genders and Sexualities",
    "info": "Gender/sexual practices/identities within international framework. How such practices/identities reflect/refract national ideals and express national/international division.",
    "prereq": {}
  },
  {
    "uid": "815425",
    "code": "AMST1511",
    "subject": "AMST",
    "number": "1511",
    "honors": false,
    "writing": false,
    "name": "Americans Abroad",
    "fullname": "Americans Abroad:  Rethinking Travel, Culture, & Empire",
    "info": "In this course, we will look at Americans (including ourselves) who travel abroad and what their experiences, both in the present and historically, tell us about how we imagine others and our/their place in the world. What do these experiences tell us about who we are as a people, a culture, and a nation? This course will examine how these experiences have transformed (and continue to transform) Americans and the countries and cultures with which they interact. Indeed, this course challenges students to consider the overall effects that these processes have had on America's relationship with the rest of the world.",
    "prereq": {}
  },
  {
    "uid": "791610",
    "code": "AMST1902",
    "subject": "AMST",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "800838",
    "code": "AMST1905",
    "subject": "AMST",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "827073",
    "code": "AMST1906W",
    "subject": "AMST",
    "number": "1906",
    "honors": false,
    "writing": true,
    "name": "Race and Science Fiction",
    "fullname": "Race and Science Fiction",
    "info": "Race and Science Fiction considers how science fiction allows us to ask questions about race across time and space. In doing so, the course not only introduces students to how race and racism have been differently constructed throughout history but also gives students the tools to contextualize and critique present issues of racial inequality. The course also sets up first year students for a successful future at the University of Minnesota by introducing them to the core values and themes of a liberal education. ",
    "prereq": {}
  },
  {
    "uid": "790643",
    "code": "AMST1907W",
    "subject": "AMST",
    "number": "1907",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "788728",
    "code": "AMST1908W",
    "subject": "AMST",
    "number": "1908",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "788173",
    "code": "AMST1909W",
    "subject": "AMST",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "817915",
    "code": "AMST1911",
    "subject": "AMST",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Asian Americans and Food",
    "fullname": "Asian Americans and Food",
    "info": "Asian Americans have always been intimately connected to food practices and institutions in the American imagination. Food is the medium through which Asian American cultural difference, their status as \"perpetual foreigners,\" and the \"model minority character\" are typically expressed and disseminated. Historically, Asian migration to the United States was fueled by labor needs, particularly in the agricultural sector. In addition, Asian labor has been stereotypically linked to food service and preparation such as the ubiquitous Chinese take-out place and more recently, the sushi and Korean fusion joints.\n \nThis course is an introduction to the interdisciplinary study of food as a way to understand the historical, social, and cultural aspects of Asian American food preparation, distribution, and consumption. Students will investigate the politics and poetics of Asian American food ways by examining social habits and rituals around food in homes, restaurants, and other public venues. Texts include ethnographic essays, fictional works, memoirs, magazines, visual arts, and television shows.",
    "prereq": {}
  },
  {
    "uid": "818885",
    "code": "AMST1912",
    "subject": "AMST",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Baseball and American Culture",
    "fullname": "Baseball and American Culture",
    "info": "To an extent not seen in any other sport, America's National Pastime is intertwined with the very fabric of life in America, and this is reflected in the prominent place of baseball in American cultural production such as film and literature. On the one hand, baseball provides a means through which the American dream has often been viewed and has itself been viewed as an idyllic representation of that dream and all that is good about American culture. But on the other hand, throughout history baseball has also reflected many of the struggles seen in the broader society. Whether it be racism, the realities of war, the place of women, the labor movement and unionization, or any of a number of other issues, baseball has provided a view into societal issues - sometimes leading the way and shining a spotlight on the issues and sometimes lagging behind other parts of society in dealing with the issues. Throughout this course we will look at these different sides of the connection between baseball and American culture.",
    "prereq": {}
  },
  {
    "uid": "819805",
    "code": "AMST1914",
    "subject": "AMST",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "Women, Rage, and Politics",
    "fullname": "Woman, Rage, and Politics",
    "info": "The election of the “squad” – Alexandria Ocasio-Cortez, Ilhan Omar, Ayana Pressley, and Rashida Tlaib – signaled a new era of progressive and diverse political leadership. Yet these women’s unapologetic efforts to demand an accounting on behalf of the American people resulted in vociferous attacks by both conservative and liberal pundits. This backlash has a long history where women in power have been labeled pejoratively as demanding, as vindictive, as power-hungry, as monsters. Angry men are seen as righteous (Brett Kavanaugh), while angry women are “nasty” (Hillary Clinton). This course explores the relationship between women, rage, and politics. We consider what it means to make and claim space as women of color in politics. We look at how rage –  women’s rage, white rage, rage against women – gets mobilized to cement and/or combat racism, xenophobia, and misogyny. The course reframes women’s rage as intrepid and redemptive, capable of sparking change during this political moment. \n",
    "prereq": {}
  },
  {
    "uid": "825081",
    "code": "AMST1915",
    "subject": "AMST",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "In Pursuit of Equality",
    "fullname": "In Pursuit of Equality:  Racial and Gender Justice in American Workplaces",
    "info": "Title VII of the of 1964 Civil Rights Act outlawed race and sex discrimination in American workplaces. Yet, employers in this time period were alternately uncertain, reluctant, or downright resistant to implementing these new antidiscrimination laws. Put another way, the change in law did not automatically result in more people of color and white women being hired or put an end to discrimination. Between 1964 and 1981, the impetus for change came from social movements such as the civil rights movement and the women’s liberation movement as they worked with or inspired unions, caucuses, and associations to push for the enforcement of federal law, thereby opening up American workplaces to people of color and white women.  To understand how activists transformed American workplaces, this course begins by focusing on the social movements of the 1960s and 1970s and their political ideals and strategies. The remainder of the course will focus on how unions, caucuses, and associations in a variety of workplaces drew from these social movements in their pursuit of racial and/or gender equality.  Not only will the course explore how these different campaigns faired, but it will also consider the questions they raise for racial and gender workplace justice in the contemporary moment.",
    "prereq": {}
  },
  {
    "uid": "818925",
    "code": "AMST1918",
    "subject": "AMST",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "American Quest for Security",
    "fullname": "The American Quest for Security",
    "info": "For more than half a century, Americans have been concerned about security ? national security as well as personal security. What do Americans mean when they talk about security? What are they worried about, and how do they try to keep themselves safe and secure? The quest for national security has taken shape at the level of foreign policy and military engagement. At the same time, Americans have endeavored to achieve their own safety and security through political and personal efforts. This seminar examines the various ways that citizens have addressed the issue of security in their own lives, whether their fears have been justified, and whether their efforts have kept them safe. The goal is for students to understand the issue of security in a historical context, and to enable them to be effective citizens in a world that often feels dangerous.",
    "prereq": {}
  },
  {
    "uid": "798731",
    "code": "AMST2011",
    "subject": "AMST",
    "number": "2011",
    "honors": false,
    "writing": false,
    "name": "U. S. since September 11th",
    "fullname": "The United States since September 11",
    "info": "How American citizenship and nationhood have changed since 9/11. The event and its aftermath in historical perspective. Political, economic, and military antecedents. How 9/11 has changed relations between the U.S. government, U.S. citizens, immigrants, and international community. How 9/11 has been remembered.",
    "prereq": {}
  },
  {
    "uid": "800216",
    "code": "AMST2021",
    "subject": "AMST",
    "number": "2021",
    "honors": false,
    "writing": false,
    "name": "Bodies and Their Discontents",
    "fullname": "Bodies and Their Discontents",
    "info": "Aesthetic/cultural ideal of the beautiful/normal body as it has developed as a marker of citizenship in the U.S. and been shaped by ideas of race, gender, sexuality and class.   Ways that institutions, governments, social groups, and individuals have produced norms and assumptions about \"the good,\" \"the beautiful,\" and \"the healthy.\" How these norms have been institutionalized in media, aesthetics, politics, and commerce.",
    "prereq": {}
  },
  {
    "uid": "815446",
    "code": "AMST2031",
    "subject": "AMST",
    "number": "2031",
    "honors": false,
    "writing": false,
    "name": "Chasing the American Dream",
    "fullname": "Chasing the American Dream: Economic Opportunity & Inequality in the U.S.",
    "info": "This course begins by focusing on the historical origins and meanings of the American dream. How did this dream of unlimited opportunity come about?  What has it meant in different historical moments and to divergent social groups? And, why does it continue to be such a powerful and compelling idea in the United States and around the world?",
    "prereq": {}
  },
  {
    "uid": "825103",
    "code": "AMST2041",
    "subject": "AMST",
    "number": "2041",
    "honors": false,
    "writing": false,
    "name": "The Politics of Pandemics",
    "fullname": "The Politics of Pandemics",
    "info": "This course examines public health in the United States, its institutions, practices, and policies and how they have been applied to infectious and chronic disease, as well as related to health and wellness more broadly.  American public health is contextualized historically and pandemic problems, such as AIDS, tuberculosis, heart disease, obesity, and infectious disease, are examined critically relation to American culture and politics, including the most recent corona-virus pandemic.  Students will gain an in-depth perspective on public health in the United States and how the history of American public health is deeply influenced by politics and culture, particular the dimensions of race, class, gender, and sexuality.",
    "prereq": {}
  },
  {
    "uid": "791279",
    "code": "AMST3001",
    "subject": "AMST",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Contmp Perspectives Asian Amer",
    "fullname": "Contemporary Perspectives on Asian America",
    "info": "Interdisciplinary overview of Asian American identities. Post-1965 migration/community. History, cultural productions, and concerns of Americans of Chinese, Japanese, Korean, South Asian, Filipino, and Southeast Asian ancestry.",
    "prereq": {}
  },
  {
    "uid": "797678",
    "code": "AMST3003",
    "subject": "AMST",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Public History",
    "fullname": "Public History",
    "info": "Interpretations of collective past as produced in public venues, including museum exhibitions, films, theme parks, websites. Intellectual and political issues in history produced for public audiences. Career opportunities.",
    "prereq": {}
  },
  {
    "uid": "009287",
    "code": "AMST3111",
    "subject": "AMST",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Am Cult & Arts",
    "fullname": "American Cultures and the Arts",
    "info": "Relationships between American cultures and artistic production through study of the works and lives of selected artists. How American societies and cultures shape, and are shaped by, artistic forms and expressions.",
    "prereq": {}
  },
  {
    "uid": "817029",
    "code": "AMST3112",
    "subject": "AMST",
    "number": "3112",
    "honors": false,
    "writing": false,
    "name": "Prince, Porn, and Public Space",
    "fullname": "Prince, Porn, and Public Space: The Cultural Politics of the Twin Cities in the 1980s",
    "info": "This course uses music (especially Prince and the Replacements), debates around pornography/sex, and shifts around access to public space in order to explore the local culture and national importance of the Twin Cities during the 1980s.",
    "prereq": {}
  },
  {
    "uid": "009317",
    "code": "AMST3113W",
    "subject": "AMST",
    "number": "3113",
    "honors": false,
    "writing": true,
    "name": "Global MN: Diversity in 21st C",
    "fullname": "Global Minnesota: Diversity in the 21st Century",
    "info": "Diverse cultural (racial, ethnic, class) groups in America. Institutions/processes that shape their relations and create domination, resistance, hybridity, nationalism, racism, alliance. Specific content may vary.",
    "prereq": {}
  },
  {
    "uid": "008469",
    "code": "AMST3114",
    "subject": "AMST",
    "number": "3114",
    "honors": false,
    "writing": false,
    "name": "Intn'l Perspective",
    "fullname": "America in International Perspective",
    "info": "The nature of international cultural exchange. The impact of U.S. cultures and society on other countries of the world as well as the impact of other cultures and societies on the United States.   ",
    "prereq": {}
  },
  {
    "uid": "795349",
    "code": "AMST3116",
    "subject": "AMST",
    "number": "3116",
    "honors": false,
    "writing": false,
    "name": "Jews and Popular Culture",
    "fullname": "Jews and Popular Culture in 20th Century United States",
    "info": "How theater, film, music, humor, and television were affected by Jews. innovations, social marginality, and wish to assimilate or resist assimilation to the culture. How the nation was and was not reshaped in the process. ",
    "prereq": {}
  },
  {
    "uid": "799632",
    "code": "AMST3117",
    "subject": "AMST",
    "number": "3117",
    "honors": false,
    "writing": false,
    "name": "Latinos in Global Cities",
    "fullname": "Latinos in America's Global Cities",
    "info": "Relationship between Latina/o immigration and development of America's global cities. Theoretical foundation for understanding global cities. Similarities/differences among socio-political trajectories and cultural practices of Latina/o communities.",
    "prereq": {}
  },
  {
    "uid": "797679",
    "code": "AMST3212",
    "subject": "AMST",
    "number": "3212",
    "honors": false,
    "writing": false,
    "name": "Dissident Sexualities in U.S.",
    "fullname": "Dissident Sexualities in U.S. History",
    "info": "History of sexuality in United States. Emphasizes sexualities that have challenged dominant social/cultural norms. Development of transgender, bisexual, lesbian, gay identities/communities. Politics of sex across lines of race/ethnicity. Historical debates over controversial practices, including sex work.",
    "prereq": {}
  },
  {
    "uid": "825330",
    "code": "AMST3214",
    "subject": "AMST",
    "number": "3214",
    "honors": false,
    "writing": false,
    "name": "Queer Kinship",
    "fullname": "Queer Kinship: Undoing the American Family",
    "info": "What is the American family? Is it a part of the “American Dream”? Is it a claim to national belonging? The American family only exists within US mythology built on imperialism and settler colonialism. This course will explore how the heteronormative nuclear family structure symbolizes modern capitalist society that emphasizes the core American values of individualism, democracy, and the ability to reproduce. Thus, the individual family members are not only transformed into productive citizens but are also tasked with the responsibility to reproduce the nation(alism). For example, the recent advancement for gay marriage is scripted as a new phenomenon that poses as both a threat to the American values and a sign of progress. This paradox exposes the limits of gay identity politics and nationalist ideology within neoliberalism, which later used to justify and rationalize racist and xenophobic ideologies. This course asks: how is the American family always already queer?",
    "prereq": {}
  },
  {
    "uid": "009207",
    "code": "AMST3252W",
    "subject": "AMST",
    "number": "3252",
    "honors": false,
    "writing": true,
    "name": "Pop cult & politics",
    "fullname": "American Popular Culture and Politics: 1900 to 1940",
    "info": "Historical analysis of how popular arts represent issues of gender, race, consumerism, and citizenship. How popular artists define boundaries of citizenship and public life: inclusions/exclusions in polity and national identity. How popular arts reinforce/alter political ideologies.",
    "prereq": {}
  },
  {
    "uid": "009225",
    "code": "AMST3253W",
    "subject": "AMST",
    "number": "3253",
    "honors": false,
    "writing": true,
    "name": "Pop cult & politics",
    "fullname": "American Popular Culture and Politics: 1940 to the Present",
    "info": "Historical analysis of how popular arts represent issues of gender, race, consumerism, and citizenship. How popular artists define boundaries of citizenship and public life: inclusions/exclusions in polity and national identity. How popular arts reinforce/alter political ideologies.",
    "prereq": {}
  },
  {
    "uid": "802176",
    "code": "AMST3261",
    "subject": "AMST",
    "number": "3261",
    "honors": false,
    "writing": false,
    "name": "Politics of 'Black' Migration",
    "fullname": "Politics of 'Black' Migration: Identity, Solidarity, and Tensions in the African Diaspora",
    "info": "Diversity of post-civil rights and post-colonial era African diasporic people. identifying or being perceived as Black/black. Tensions, new solidarities. Black migration politics during age of international/transnational migration.",
    "prereq": {}
  },
  {
    "uid": "009991",
    "code": "AMST3301W",
    "subject": "AMST",
    "number": "3301",
    "honors": false,
    "writing": true,
    "name": "Senior Proseminar",
    "fullname": "Senior Proseminar in American Studies",
    "info": "Problem related to representative theme, figure, or period. Students research/write senior theses.",
    "prereq": {}
  },
  {
    "uid": "818298",
    "code": "AMST3361",
    "subject": "AMST",
    "number": "3361",
    "honors": false,
    "writing": false,
    "name": "Asian Americans and Food",
    "fullname": "Asian Americans and Food",
    "info": "Asian Americans have always been intimately connected to food practices and institutions in the American imagination. Food is the medium through which Asian American cultural difference, their status as \"perpetual foreigners\" and the \"model minority character\" are typically expressed and disseminated. Historically, Asian migration to the United States was fueled by labor needs particularly in the agricultural sector. In addition, Asian labor has been stereotypically linked to food service and preparation such as the ubiquitous Chinese take-out place and more recently, the sushi and Korean fusion joints. This course is an introduction to the interdisciplinary study of food to better understand the historical, social, and cultural aspects of Asian American food preparation, distribution and consumption. Students will investigate the politics and poetics of Asian American foodways by examining social habits, and rituals around food in restaurants, homes and other public venues. The course texts include ethnographic essays, fictional works, memoirs, magazines, and television shows.",
    "prereq": {}
  },
  {
    "uid": "797668",
    "code": "AMST3402",
    "subject": "AMST",
    "number": "3402",
    "honors": false,
    "writing": false,
    "name": "Amer Indians and the Cinema",
    "fullname": "American Indians and the Cinema",
    "info": "Representations of American Indians in film, historically/contemporarily. What such representations assert about Native experience and cultural viability. What they reflect about particular relationships of power.",
    "prereq": {}
  },
  {
    "uid": "827185",
    "code": "AMST3409W",
    "subject": "AMST",
    "number": "3409",
    "honors": false,
    "writing": true,
    "name": "Asian American Women Culture",
    "fullname": "Asian American Women's Cultural Production",
    "info": "This course explores cultural texts produced by and about Asian American women and queers. It wrestles with the complexities of a historical moment in which Asian American women are both increasingly visible in pop culture and increasingly visible targets of violence. We will push beyond judgments of “positive” or “negative” representations of Asian Americans and instead explore the political dimensions of these cultural representations—that is, how they animate, reference, or repress longer histories of migration, war, labor, and empire. We will approach the categories of both “Asian American” and “women” less as static identities and more as shifting political coalitions that bring together diverse groups of people whose experience of gender, sexuality, race, and class deviates from the norm of white, heterosexual, and cisgender American citizenship. In tracking (and at times celebrating) these deviations, we will ask: how might film, TV, literature, art, and theory help illuminate Asian American feminist politics?",
    "prereq": {}
  },
  {
    "uid": "795351",
    "code": "AMST3632W",
    "subject": "AMST",
    "number": "3632",
    "honors": false,
    "writing": true,
    "name": "Jewish Women in the US",
    "fullname": "Jewish Women in the United States",
    "info": "History of American Jewish women. Uses literary/religious texts, primary documents, films, and histories to analyze Jewish women.s experiences in the United States and their transformation of Judaism, political activism, and their role in the bourgeois family. How they are represented, how they represent themselves. Interdisciplinary approach,",
    "prereq": {}
  },
  {
    "uid": "827157",
    "code": "AMST3661",
    "subject": "AMST",
    "number": "3661",
    "honors": false,
    "writing": false,
    "name": "African Americans in Germany",
    "fullname": "African Americans in Germany",
    "info": "How have African Americans understood their experiences with race outside of the United States? African Americans have been migrating and circulating the globe since the American Revolution, and it is only recently that scholars have considered the ways in which an abroad experience has been transformative for African Americans. In this seminar-style class, we will explore why and how African Americans have used their experiences in Germany to express a new understanding of their identity in the United States.",
    "prereq": {}
  },
  {
    "uid": "801607",
    "code": "AMST3713",
    "subject": "AMST",
    "number": "3713",
    "honors": false,
    "writing": false,
    "name": "American Indian Great Lakes",
    "fullname": "Lands and Homelands in the American Indian Great Lakes",
    "info": "Tribes that have strong historic ties to Minnesota region, such as the Ojibwe, Dakota, and Ho-Chunk Nations. Integrity/viability of American Indian societies. Conflict of cultures that occurred with Native American and Euroamerican contact in Minnesota and the Great Lakes.",
    "prereq": {}
  },
  {
    "uid": "815659",
    "code": "AMST3752",
    "subject": "AMST",
    "number": "3752",
    "honors": false,
    "writing": false,
    "name": "Chicanos Contemporary Society",
    "fullname": "Chicanas and Chicanos in Contemporary Society",
    "info": "Introduction to sociological analysis of theoretical/methodological approaches to Chicano/a and Latina/o communities. Socioeconomic conditions, education, cultural change, the family, gender relations, political experiences. Theories, issues, methods of sociological research. Debates regarding qualitative/quantitative research methods.",
    "prereq": {}
  },
  {
    "uid": "825349",
    "code": "AMST3814",
    "subject": "AMST",
    "number": "3814",
    "honors": false,
    "writing": false,
    "name": "Women, Rage, and Politics",
    "fullname": "Women, Rage, and Politics",
    "info": "This course explores the relationship between women, rage, and politics.  Following bell hooks, we ask where is the rage?  Doing so, invites us to interrogate how rage is gendered, how politics are gendered, and how do rage and gender intersect to mobilize for justice.  Drawing on political organizing by women of color during the recent Black Lives Matter uprising, we consider what it means to make and claim space as women of color in politics.  We also look at how rage - BIPOC women's rage, white rage, rage against women - gets mobilized to cement and/or combat racism, xenophobia, and misogyny.  Finally, the course reframes women's rage as intrepid and redemptive, capable of sparking change during this political movement.",
    "prereq": {}
  },
  {
    "uid": "802157",
    "code": "AMST3837",
    "subject": "AMST",
    "number": "3837",
    "honors": false,
    "writing": false,
    "name": "Minnesota History",
    "fullname": "Minnesota History",
    "info": "Topics in political/social history of Minnesota and its region in 19th/20th centuries.",
    "prereq": {}
  },
  {
    "uid": "818550",
    "code": "AMST3896",
    "subject": "AMST",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": {}
  },
  {
    "uid": "009383",
    "code": "AMST3920",
    "subject": "AMST",
    "number": "3920",
    "honors": false,
    "writing": false,
    "name": "Topics in American Studies",
    "fullname": "Topics in American Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "013585",
    "code": "AMST3993",
    "subject": "AMST",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009102",
    "code": "AMST4101",
    "subject": "AMST",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Gender,  Politics",
    "fullname": "Gender, Sexuality, and Politics in America",
    "info": "Ways public and private life intersect through the issues of gender, sexuality, family, politics, and public life; ways in which racial, ethnic, and class divisions have been manifest in the political ideologies affecting private life. ",
    "prereq": {}
  },
  {
    "uid": "792884",
    "code": "AMST4301",
    "subject": "AMST",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Workrs&Consumrs-Global Economy",
    "fullname": "Workers and Consumers in the Global Economy",
    "info": "Impact of global economy on workplaces/workers in the United states, Mexico, and Caribbean countries. Influence on consumption. Consequences for American culture/character. Effects on U.S./Mexican factory work, service sector, temporary working arrangements, offshore production jobs in Dominican Republic, and professional/managerial positions.",
    "prereq": {}
  },
  {
    "uid": "819773",
    "code": "AMST4401",
    "subject": "AMST",
    "number": "4401",
    "honors": false,
    "writing": false,
    "name": "Inclusion in Museums",
    "fullname": "Inclusion in Public History and Museums",
    "info": "Inclusion in Public History and Museum is designed to engage students in studying the challenges related to the under-representation of communities of color and American Indian Nations in historical organizations and public history graduate programs.  The course serves as a foundation into a summer internship program made possible through the Arts and Cultural Heritage Fund.  Class sessions will provide a philosophical understanding of museum practice, your summer internship at the Minnesota Historical Society will provide practical experience inside the workings of a major state historical organization.  The course is critical part of the History Museum Fellows Program, in identifying and addressing issues of how traditionally marginalized  communities are represented in the traditional narrative of history – both in Minnesota museums and in museums with national audiences. \n\nThe course and associated Fellowship Program will create a unique opportunity for students to strengthen undergraduate coursework with a one-of-a-kind seminar, explore career interests and receive assistance in exploring options for graduate training as a museum professional. ",
    "prereq": {}
  },
  {
    "uid": "008407",
    "code": "AMST4961",
    "subject": "AMST",
    "number": "4961",
    "honors": false,
    "writing": false,
    "name": "Proseminar I",
    "fullname": "Proseminar I",
    "info": "Classic/contemporary works/problems. Development of American Studies. Idealizing of American past. Challenges of multiculturalism. Contemporary themes.\n\nprereq: AmSt jr or AmSt sr or instr consent",
    "prereq": {}
  },
  {
    "uid": "010007",
    "code": "AMST4962W",
    "subject": "AMST",
    "number": "4962",
    "honors": false,
    "writing": true,
    "name": "Proseminar",
    "fullname": "Proseminar in American Studies",
    "info": "This course serves as the capstone course for majors of the American Studies BA program.\n\nprereq: AmSt sr or instr consent",
    "prereq": {}
  },
  {
    "uid": "008521",
    "code": "AMST5101",
    "subject": "AMST",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Religion & Am Cult",
    "fullname": "Religion and American Culture",
    "info": "Role of religion in shaping contemporary American cultural pluralism. Institutions and processes, intellectual frameworks, aesthetic and symbol systems that form religious communities and contribute to religious conflicts in U.S. society and culture. ",
    "prereq": {}
  },
  {
    "uid": "013376",
    "code": "AMST5202",
    "subject": "AMST",
    "number": "5202",
    "honors": false,
    "writing": false,
    "name": "Practice Am Rlgion",
    "fullname": "Thought and Practice of American Religions",
    "info": "Holidays, festivals, religious arts, organizations, spirituality, ethics, and systems of thought of \"civil religion,\" \"women's religion,\" indigenous American religions, American versions of Christianity, Judaism, Islam, Buddhism, and other world faiths, and their interactions in the United States and worldwide.",
    "prereq": {}
  },
  {
    "uid": "797669",
    "code": "AMST5402",
    "subject": "AMST",
    "number": "5402",
    "honors": false,
    "writing": false,
    "name": "Amer Indians and the Cinema",
    "fullname": "American Indians in the Cinema",
    "info": "Representations of American Indians in film, historically/contemporarily. What such representations assert about Native experience and cultural viability. What they reflect about particular relationships of power.",
    "prereq": {}
  },
  {
    "uid": "817831",
    "code": "AMST5412",
    "subject": "AMST",
    "number": "5412",
    "honors": false,
    "writing": false,
    "name": "Cmparativ Indigenous Feminisms",
    "fullname": "Comparative Indigenous Feminisms",
    "info": "The course will examine the relationship between Western feminism and indigenous feminism as well as the interconnections between women of color feminism and indigenous feminism. In addition to exploring how indigenous feminists have theorized from 'the flesh' of their embodied experience of colonialism, the course will also consider how indigenous women are articulating decolonization and the embodiment of autonomy through scholarship, cultural revitalization, and activism.   ",
    "prereq": {}
  },
  {
    "uid": "010359",
    "code": "AMST5920",
    "subject": "AMST",
    "number": "5920",
    "honors": false,
    "writing": false,
    "name": "Topics in American Studies",
    "fullname": "Topics in American Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "008450",
    "code": "AMST8201",
    "subject": "AMST",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Hist Foundations",
    "fullname": "Historical Foundations of American Studies",
    "info": "Exposition of American studies as a field of inquiry, including its history, major theoretical framework, and interdisciplinary methodologies.\n\nprereq: grad AmSt major",
    "prereq": {}
  },
  {
    "uid": "009810",
    "code": "AMST8202",
    "subject": "AMST",
    "number": "8202",
    "honors": false,
    "writing": false,
    "name": "Theory/Practice",
    "fullname": "Theoretical Foundations and Current Practice in American Studies",
    "info": "Analysis of central theoretical work in the field and survey of key methodologies.\n\nprereq: grad AmSt major or instr consent or dept consent",
    "prereq": {}
  },
  {
    "uid": "799975",
    "code": "AMST8231",
    "subject": "AMST",
    "number": "8231",
    "honors": false,
    "writing": false,
    "name": "Legacy of the Cold War: Readng",
    "fullname": "Cultural Fallout: The Cold War and Its Legacy, Readings",
    "info": "Culture of Cold War, its legacy. How it affected/reflected domestic politics, public policies, civic life, gender expectations, sexuality, class relations, racial justice, and civil rights. Impact of domestic anti-communism and of American cultural politics abroad.",
    "prereq": {}
  },
  {
    "uid": "799976",
    "code": "AMST8232",
    "subject": "AMST",
    "number": "8232",
    "honors": false,
    "writing": false,
    "name": "Legacy of the Cold War: Resch",
    "fullname": "Cultural Fallout: The Cold War and Its Legacy, Research",
    "info": "Student produce a research paper on history/culture of Cold War era as it developed in United States after World War II.  Research projects build upon readings from 8231.\n\nprereq: 8231",
    "prereq": {
      "and": [
        "799975"
      ]
    }
  },
  {
    "uid": "008505",
    "code": "AMST8239",
    "subject": "AMST",
    "number": "8239",
    "honors": false,
    "writing": false,
    "name": "Race/Gender in US",
    "fullname": "Gender, Race, Class, Ethnicity, and Sexuality in the United States: Readings",
    "info": "Social, cultural, and artistic modes of self-expression. Intellectual analysis of people in the United States identified as female or male or as members of groups defined by race, ethnicity, class, or sexual orientation.",
    "prereq": {}
  },
  {
    "uid": "008512",
    "code": "AMST8240",
    "subject": "AMST",
    "number": "8240",
    "honors": false,
    "writing": false,
    "name": "Race/Gender in US",
    "fullname": "Gender, Race, Class, Ethnicity, and Sexuality in the United States: Topical Development",
    "info": "Social, cultural, and artistic modes of self-expression and intellectual analysis of people in the United States identified as female or male and/or as members of group defined by race, ethnicity, class, or sexual orientation.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008982",
    "code": "AMST8249",
    "subject": "AMST",
    "number": "8249",
    "honors": false,
    "writing": false,
    "name": "Pop Culture&Politics 20th Cntr",
    "fullname": "Popular Culture and Politics in the 20th Century: Readings",
    "info": "Popular arts in their political/social context. Issues of race, gender, class, and nationalism.",
    "prereq": {}
  },
  {
    "uid": "009080",
    "code": "AMST8250",
    "subject": "AMST",
    "number": "8250",
    "honors": false,
    "writing": false,
    "name": "Pop Culture&Politics 20th Cntr",
    "fullname": "Popular Culture and Politics in the 20th Century: Research Strategies",
    "info": "Popular arts in their political/social context. Focuses on issues of race, gender, class, and nationalism.\n\nprereq: 8239 or instr consent",
    "prereq": {
      "or": [
        "008505"
      ]
    }
  },
  {
    "uid": "009146",
    "code": "AMST8259",
    "subject": "AMST",
    "number": "8259",
    "honors": false,
    "writing": false,
    "name": "Lit, Hist, Culture",
    "fullname": "Literature, History, and Culture: Research Strategies",
    "info": "Interdisciplinary study of connections between literary expression and history, particularly as they articulate themes in American culture.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009155",
    "code": "AMST8260",
    "subject": "AMST",
    "number": "8260",
    "honors": false,
    "writing": false,
    "name": "Lit, Hist, Culture",
    "fullname": "Literature, History, and Culture: Topical Development",
    "info": "Interdisciplinary study of connections between literary expression and history, particularly as they articulate themes in American culture.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "800097",
    "code": "AMST8288",
    "subject": "AMST",
    "number": "8288",
    "honors": false,
    "writing": false,
    "name": "Working in the Global Economy",
    "fullname": "Working in the Global Economy: Readings",
    "info": "Debates about global economy's consequences for American culture/character. Effects of global capitalism on factory work, service sector, pink-collar, and factory work in multinational corporations and professional/managerial positions inside/outside U.S. borders. How work is lived through race, class, gender, and nation.",
    "prereq": {}
  },
  {
    "uid": "800098",
    "code": "AMST8289",
    "subject": "AMST",
    "number": "8289",
    "honors": false,
    "writing": false,
    "name": "Ethnographic Research Methods",
    "fullname": "Ethnographic Research Methods: Research Strategies in American Studies",
    "info": "Students conduct an empirical research project, write a final paper. Assumptions/practices of positivism, reflexive science, and feminist methodology. Issues surrounding politics/ethics of feminist research. Dilemmas in practice of fieldwork, oral histories, reading, and writing.\n\nprereq: 8288 or instr consent",
    "prereq": {
      "or": [
        "800097"
      ]
    }
  },
  {
    "uid": "788071",
    "code": "AMST8333",
    "subject": "AMST",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "008419",
    "code": "AMST8401",
    "subject": "AMST",
    "number": "8401",
    "honors": false,
    "writing": false,
    "name": "Practicum",
    "fullname": "Practicum in American Studies",
    "info": "Training in teaching undergraduate courses in American studies.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788308",
    "code": "AMST8444",
    "subject": "AMST",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "797046",
    "code": "AMST8520",
    "subject": "AMST",
    "number": "8520",
    "honors": false,
    "writing": false,
    "name": "American Art&Material Culture",
    "fullname": "Seminar: American Art and Material Culture",
    "info": "Selected topics in American art, popular art, and material culture, with emphasis on methods and techniques of inquiry: creation and use of archives, oral history, sources for pictorial evidence, and current approaches to interpreting both traditional and non-traditional data.",
    "prereq": {}
  },
  {
    "uid": "788435",
    "code": "AMST8666",
    "subject": "AMST",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "x\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788565",
    "code": "AMST8777",
    "subject": "AMST",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "008426",
    "code": "AMST8801",
    "subject": "AMST",
    "number": "8801",
    "honors": false,
    "writing": false,
    "name": "Dissertation Seminar",
    "fullname": "Dissertation Seminar",
    "info": "Conceptualizing the research problem for the dissertation and structuring the process of writing a chapter of it.\n\nprereq: AmSt doctoral student beginning dissertation work",
    "prereq": {}
  },
  {
    "uid": "787820",
    "code": "AMST8888",
    "subject": "AMST",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "791048",
    "code": "AMST8920",
    "subject": "AMST",
    "number": "8920",
    "honors": false,
    "writing": false,
    "name": "Topics in American Studies",
    "fullname": "Topics in American Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "010362",
    "code": "AMST8970",
    "subject": "AMST",
    "number": "8970",
    "honors": false,
    "writing": false,
    "name": "Independent Study",
    "fullname": "Independent Study in American Studies",
    "info": "Independent study of interdisciplinary aspects of American civilization under guidance of faculty members of various departments.\n\nprereq: instr consent, dept consent",
    "prereq": {}
  }
]