[
  {
    "uid": "795010",
    "code": "ANSC1001",
    "subject": "ANSC",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Orientation to Animal Science",
    "fullname": "Orientation to Animal Science",
    "info": "Current issues, career planning, professional development. Interviews with faculty and other resource persons. ",
    "prereq": {}
  },
  {
    "uid": "791682",
    "code": "ANSC1007",
    "subject": "ANSC",
    "number": "1007",
    "honors": false,
    "writing": false,
    "name": "Horse in Your Backyard",
    "fullname": "Horse in Your Backyard",
    "info": "Role of horses in society. How to keep a horse well fed and healthy. Nutrition, feedstuffs, pasture, health. How to seek/interpret information on vaccination, worming, nutrition, grazing management, hay selection, manure handling, and use of dietary feed additives/enhancers.",
    "prereq": {}
  },
  {
    "uid": "008376",
    "code": "ANSC1011",
    "subject": "ANSC",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Animals and Society",
    "fullname": "Animals and Society",
    "info": "This online course is designed for anyone interested in the ways in which we as a human society interact with, affect and are affected by non-human animals. Students will gain a broad understanding of the major ways in which humans use animals in contemporary society, including as food, as companions, as research subjects, and as entertainment. Other topics will include: social and ethical issues concerning animal use, the human-animal bond, animals in culture, and animals and the law.",
    "prereq": {}
  },
  {
    "uid": "010310",
    "code": "ANSC1021",
    "subject": "ANSC",
    "number": "1021",
    "honors": false,
    "writing": false,
    "name": "Avian Sampler",
    "fullname": "Avian Sampler",
    "info": "Aspects of avian biology. Planned environmental/conservation practices. Wildlife rehabilitation programs for maintaining healthy populations of wild birds in Minnesota. Emphasizes care, management, and health considerations of avian species such as domestic poultry, raptors, and companion birds.",
    "prereq": {}
  },
  {
    "uid": "826934",
    "code": "ANSC1051",
    "subject": "ANSC",
    "number": "1051",
    "honors": false,
    "writing": false,
    "name": "Intro to Veterinary Science",
    "fullname": "Intro to Veterinary Science",
    "info": "The goals of this course are to afford learners a base knowledge of veterinary science by moving through topics ranging from the cell to surgery and to provide a view of the practice of veterinary medicine through the eyes of an experienced practitioner. ",
    "prereq": {}
  },
  {
    "uid": "008375",
    "code": "ANSC1101",
    "subject": "ANSC",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Introductory Animal Science",
    "fullname": "Introductory Animal Science",
    "info": "Fundamental concepts of animal breeding, physiology, nutrition, and management as they apply to the production of beef, dairy, horses, poultry, sheep, swine, and other livestock. Fall term class open only to ANSC majors. Spring term class open to all majors.",
    "prereq": {}
  },
  {
    "uid": "813091",
    "code": "ANSC1201",
    "subject": "ANSC",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Backyard Chickens",
    "fullname": "Backyard Chickens - Science and Practice",
    "info": "Backyard Chickens - Science and Practice is an online course designed to meet the needs of students interested in understanding chickens in general, and for those who engage or are planning to engage in small scale farming of chickens. This course, expanded over 6 modules; (1) Basic biology and behavior (2) Selection (3) Housing (4) Nutrition (5) Management and (6) Diseases as it relates to chickens, will help the students understand the basic science of rearing chickens. Each of the six modules encompasses pertinent short video or PowerPoint lectures that provide fundamental and applied information on backyard chicken rearing.",
    "prereq": {}
  },
  {
    "uid": "816322",
    "code": "ANSC1205",
    "subject": "ANSC",
    "number": "1205",
    "honors": false,
    "writing": false,
    "name": "Animal Handling: Livestock",
    "fullname": "Animal Handling - Livestock",
    "info": "Students will learn how to handle and restrain animals safely. Cattle, sheep, and pigs in the Animal Science Department\u0092s St. Paul animal units are the animals primarily worked with. Students will perform common animal husbandry techniques on these animals. Proper techniques that promote animal welfare will be emphasized. This course is meant for Animal Science freshmen students that have minimal experience working with livestock.",
    "prereq": {}
  },
  {
    "uid": "010295",
    "code": "ANSC1403",
    "subject": "ANSC",
    "number": "1403",
    "honors": false,
    "writing": false,
    "name": "Companion Animal Nutrition",
    "fullname": "Companion Animal Nutrition and Care",
    "info": "This course is designed for individuals having no prior training with animals or nutrition but have interest in caring for and understanding the contemporary importance of companion animals. Emphasis will be on nutrition of healthy animals and the various factors that play a role in feeding an animal adequately. These factors include animal behavior, environmental conditions, food type, and availability. The course will emphasize basic principles of nutrition. The target audience of this course is all undergraduate students interested in nutrition and care of companion animals. The course will focus on companion animals, but not exclusively dogs and cats.",
    "prereq": {}
  },
  {
    "uid": "820051",
    "code": "ANSC1480",
    "subject": "ANSC",
    "number": "1480",
    "honors": false,
    "writing": false,
    "name": "Topics in Animal Science",
    "fullname": "Topics in Animal Science",
    "info": "Various topics",
    "prereq": {}
  },
  {
    "uid": "010315",
    "code": "ANSC1511",
    "subject": "ANSC",
    "number": "1511",
    "honors": false,
    "writing": false,
    "name": "Food An Products for Consumers",
    "fullname": "Food Animal Products for Consumers",
    "info": "Introduction to the compositional variation, processing, selection, storage, cookery, palatability, nutritional value, and safety of red meat, poultry, fish, and dairy products. Meets CFANS interdisciplinary requirement.",
    "prereq": {}
  },
  {
    "uid": "803426",
    "code": "ANSC1701",
    "subject": "ANSC",
    "number": "1701",
    "honors": false,
    "writing": false,
    "name": "Historical Influence of Horse",
    "fullname": "Historical Influence of the Horse on Society",
    "info": "Concepts of historical inquiry using the powerful/changing relationship between Man and horse. Students function as historians: framing questions, searching for appropriate sources, developing explanation model with reasoned\narguments, and finally, write/defend interpretation.",
    "prereq": {}
  },
  {
    "uid": "819025",
    "code": "ANSC1901",
    "subject": "ANSC",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "Journey of food in your body",
    "fullname": "The journey of food in your body - digestive physiology",
    "info": "In this course we will review how the digestive system works, and how nutrients are taken up from food by our bodies. We will discuss fast and slow food, diets, bugs and poop. We will run some fact-checking to popular internet claims and guide you on how to distinguish well-supported information from bogus. You will also learn to search and read scientific papers and the basics of technical writing in the field.",
    "prereq": {}
  },
  {
    "uid": "826004",
    "code": "ANSC1902",
    "subject": "ANSC",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Gruel to Gourmet: Food Systems",
    "fullname": "Gruel to Gourmet: Food Systems, Culture, History and Sustainability in France",
    "info": "This study abroad course examines the concepts of sustainability in relation to food production and culture in a country and place where food is a fundamental component of the regional and national culture. The course incorporates intercultural development concepts to introduce students to past and present French culture through the cultural importance of food systems, the ethics of food consumption, and production and the concepts of sustainability.",
    "prereq": {}
  },
  {
    "uid": "826221",
    "code": "ANSC1903",
    "subject": "ANSC",
    "number": "1903",
    "honors": false,
    "writing": false,
    "name": "Fork to Fine Dining in France",
    "fullname": "Fork to Fine Dining: Food Systems and Sustainability in France",
    "info": "This study abroad course examines the concepts of sustainability in relation to food production and culture in a country and place where food is a fundamental component of the regional and national culture. The course incorporates intercultural development concepts to introduce students to past and present French culture through the cultural importance of food systems, the ethics of food consumption, and production and the concepts of sustainability.\n\nThis course involves a study abroad component to France during spring break. Please note that you must also apply and confirm your spot for this seminar through the Learning Abroad Center. Application deadline is December 12. For more information, visit: https://umabroad.umn.edu/programs/europe/food-systems-france.",
    "prereq": {}
  },
  {
    "uid": "799165",
    "code": "ANSC2001",
    "subject": "ANSC",
    "number": "2001",
    "honors": false,
    "writing": false,
    "name": "Transfer Orientation",
    "fullname": "Animal Science Orientation for Transfer Students",
    "info": "The major, the faculty. Clubs, organizations, resources.  Career exploration/preparation. Internship opportunities, working on a resume, developing interview skills.",
    "prereq": {}
  },
  {
    "uid": "008399",
    "code": "ANSC2011",
    "subject": "ANSC",
    "number": "2011",
    "honors": false,
    "writing": false,
    "name": "Dairy Cattle Judging",
    "fullname": "Dairy Cattle Judging",
    "info": "Evaluation of dairy animals on the basis of physical appearance, including classes of heifers and cows from the six major dairy breeds. Held in conjunction with the Minnesota State Fair. Training in oral reasons.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008442",
    "code": "ANSC2012",
    "subject": "ANSC",
    "number": "2012",
    "honors": false,
    "writing": false,
    "name": "Livestock & Carcass Evaluation",
    "fullname": "Livestock and Carcass Evaluation",
    "info": "Evaluation of cattle, swine, and sheep. Breeding stock evaluated on live appraisal, performance records, and breeding values. Market animals evaluated, graded, and priced on physical appearance followed by evaluation and grading of their carcasses.",
    "prereq": {}
  },
  {
    "uid": "008633",
    "code": "ANSC2013",
    "subject": "ANSC",
    "number": "2013",
    "honors": false,
    "writing": false,
    "name": "Beginning Livestock Judging",
    "fullname": "Beginning Livestock Judging",
    "info": "Visual evaluation of beef cattle, swine, and sheep for type, muscling, degree of finish, structure, and soundness. Short oral presentations. Preparation for collegiate livestock judging competition.\n\n",
    "prereq": {}
  },
  {
    "uid": "798241",
    "code": "ANSC2014",
    "subject": "ANSC",
    "number": "2014",
    "honors": false,
    "writing": false,
    "name": "Poultry Judging",
    "fullname": "Poultry Judging",
    "info": "Differences among poultry/poultry products. Intact eggs, broken-out eggs, chicken carcasses, live chickens. Compete for position on four-person team representing U of M at U.S. Poultry & Egg Association's Collegiate Poultry Judging.",
    "prereq": {}
  },
  {
    "uid": "817701",
    "code": "ANSC2015",
    "subject": "ANSC",
    "number": "2015",
    "honors": false,
    "writing": false,
    "name": "Animal Welfare & Ethics",
    "fullname": "Animal Welfare Science and Ethics",
    "info": "This multidisciplinary course helps students develop an intellectual framework for understanding and interpreting issues involving animal welfare and ethics of animal use in agriculture, science and society. ",
    "prereq": {}
  },
  {
    "uid": "817700",
    "code": "ANSC2016",
    "subject": "ANSC",
    "number": "2016",
    "honors": false,
    "writing": false,
    "name": "Applied Animal Behavior",
    "fullname": "Introduction to Applied Animal Behavior",
    "info": "Basic concepts and applications of animal behavior within the contexts of human use. Emphasis on domesticated species, but other species within captive environments also examined.",
    "prereq": {}
  },
  {
    "uid": "797865",
    "code": "ANSC2055",
    "subject": "ANSC",
    "number": "2055",
    "honors": false,
    "writing": false,
    "name": "Horse Management",
    "fullname": "Horse Management",
    "info": "This course is offered online (semi-self paced) and provides an introduction to equine-related careers, the equine industry, and horse breeds and behavior. Current events will be discussed including topics such as horse slaughter and unwanted horses. Students will learn about the importance of bodyweight estimation, body condition scoring, hay analysis, plants poisonous to horses, liability, insurance options, as well as feeding, pasture, manure, and facility management. Equine health care will be discussed including colic, hoof care, vaccinations, deworming, and the role of genetics. Each week, students will participate in a course discussion, quiz, or exam.",
    "prereq": {}
  },
  {
    "uid": "808250",
    "code": "ANSC2056",
    "subject": "ANSC",
    "number": "2056",
    "honors": false,
    "writing": false,
    "name": "Horse Mgmt Practicum",
    "fullname": "Horse Management Practicum",
    "info": "Best management practices. Daily care (in small groups, weekends included) of horses. Volunteer day at local equine nonprofit. Applied equine management research project. Two group presentations.\n\nprereq: 2055 or concurrent registration is required (or allowed) in 2055",
    "prereq": {
      "or": [
        "797865"
      ]
    }
  },
  {
    "uid": "788393",
    "code": "ANSC2102",
    "subject": "ANSC",
    "number": "2102",
    "honors": false,
    "writing": false,
    "name": "Horse Production",
    "fullname": "Horse Production",
    "info": "Fundamentals of horse care. Equine nutrition, behavior, diseases. Hoof care. First aid, health care, disease prevention. Parasites.",
    "prereq": {}
  },
  {
    "uid": "010423",
    "code": "ANSC2401",
    "subject": "ANSC",
    "number": "2401",
    "honors": false,
    "writing": false,
    "name": "Animal Nutrition",
    "fullname": "Animal Nutrition",
    "info": "Classification/function of nutrients. Use of nutrients for body maintenance, growth, egg production, gestation, and lactation. Comparative study of digestive systems of farm animal species.",
    "prereq": {}
  },
  {
    "uid": "795641",
    "code": "ANSC3007",
    "subject": "ANSC",
    "number": "3007",
    "honors": false,
    "writing": false,
    "name": "Equine Nutrition",
    "fullname": "Equine Nutrition",
    "info": "Principles of nutrition. Emphasizes unique aspects of equine nutrition. Nutritional needs of healthy animals. Factors in feeding. Animal behavior, growth/development, physiological status, environmental conditions, food type, availability. How physiology of horse's gastrointestinal tract, utilization of feedstuffs, and horse's nutritional requirements interrelate. Balanced rations, nutritional related ailments. Pasture management, forage selection, use of dietary feed additives/enhancers.\n\nprereq: ANSC 2401",
    "prereq": {
      "and": [
        "010423"
      ]
    }
  },
  {
    "uid": "008641",
    "code": "ANSC3011",
    "subject": "ANSC",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "Statistics for Animal Science",
    "fullname": "Statistics for Animal Science",
    "info": "Basic statistical concepts. Develop statistical reasoning/critical thinking skills. Descriptive statistics, probability, sampling and sampling distributions, hypothesis testing, experimental design, linear correlation, linear regression and multiple regression. How to make sound arguments/decisions based on statistics when reviewing news articles or scientific publications with statistical content. Explore/draw conclusions from data using a basic statistical software package.",
    "prereq": {}
  },
  {
    "uid": "817150",
    "code": "ANSC3015",
    "subject": "ANSC",
    "number": "3015",
    "honors": false,
    "writing": false,
    "name": "Animal Welfare Judging Assess",
    "fullname": "Animal Welfare Judging and Assessment",
    "info": "Advanced application of animal welfare science toward the assessment of real-life scenarios in agriculture, companion, and exotic animals. Top students will compete on the UMN team at the Intercollegiate Animal Welfare Judging and Assessment Competition held in November each year.\n\nprereq: Instructor consent",
    "prereq": {}
  },
  {
    "uid": "795904",
    "code": "ANSC3052",
    "subject": "ANSC",
    "number": "3052",
    "honors": false,
    "writing": false,
    "name": "Equine Anatomy & Exercise Phys",
    "fullname": "Equine Anatomy and Exercise Physiology",
    "info": "Interrelationship between physical structure/function. Emphasizes ways in which specialized aspects of anatomy/physiology contribute to unique athletic performance capabilities of horse.",
    "prereq": {}
  },
  {
    "uid": "802474",
    "code": "ANSC3092",
    "subject": "ANSC",
    "number": "3092",
    "honors": false,
    "writing": false,
    "name": "Undergrad Research in AnSc",
    "fullname": "Undergraduate Research in Animal Science",
    "info": "Students conduct research project under supervision of faculty member.",
    "prereq": {}
  },
  {
    "uid": "819492",
    "code": "ANSC3093",
    "subject": "ANSC",
    "number": "3093",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed Study: A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll. No more than 6 credits of directed study counts towards CFANS major requirements. \n\nprereq: instructor consent.",
    "prereq": {}
  },
  {
    "uid": "819493",
    "code": "ANSC3094",
    "subject": "ANSC",
    "number": "3094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use the University-wide online directed research contract process in order to enroll. No more than 6 credits of directed research counts towards CFANS major requirements. \n\nprereq: instructor consent. ",
    "prereq": {}
  },
  {
    "uid": "008402",
    "code": "ANSC3141",
    "subject": "ANSC",
    "number": "3141",
    "honors": false,
    "writing": false,
    "name": "Advanced Dairy Judging",
    "fullname": "Advanced Dairy Judging",
    "info": "Training in presentation of oral reasons in dairy cattle judging. Selected students from this course participate in fall intercollegiate dairy judging contest.\n\nprereq: 2011 or instr consent",
    "prereq": {
      "or": [
        "008399"
      ]
    }
  },
  {
    "uid": "008637",
    "code": "ANSC3142",
    "subject": "ANSC",
    "number": "3142",
    "honors": false,
    "writing": false,
    "name": "Advanced Livestock Judging",
    "fullname": "Advanced Livestock Judging",
    "info": "Visual evaluation of beef cattle, swine, and sheep for muscling, finish, structure, and soundness. Use of production (growth and reproduction) records in evaluation. Oral presentations. Preparation for national collegiate livestock judging contest.\n\nprereq: instructor consent",
    "prereq": {}
  },
  {
    "uid": "010304",
    "code": "ANSC3143",
    "subject": "ANSC",
    "number": "3143",
    "honors": false,
    "writing": false,
    "name": "Meat Judging & Grading",
    "fullname": "Meat Judging and Grading",
    "info": "In-depth training in beef, pork, and lamb judging, writing reasons, and beef carcass grading and specifications. Field trips to packing plants. Students selected from course participate in intercollegiate meats judging contests.",
    "prereq": {}
  },
  {
    "uid": "798242",
    "code": "ANSC3144",
    "subject": "ANSC",
    "number": "3144",
    "honors": false,
    "writing": false,
    "name": "Advanced Poultry Judging",
    "fullname": "Advanced Poultry Judging",
    "info": "How to judge live poultry and poultry products. Students compete for a position on four-person team representing U of M at National Collegiate Poultry Judging contest.",
    "prereq": {}
  },
  {
    "uid": "792285",
    "code": "ANSC3203W",
    "subject": "ANSC",
    "number": "3203",
    "honors": false,
    "writing": true,
    "name": "Env, Food Prod & the Citizen",
    "fullname": "Environment, Global Food Production, and the Citizen",
    "info": "Ecological/ethical concerns of food production systems in global agriculture: past, present, and future. Underlying ethical positions about how agroecosystems should be configured. Interactive learning using decision cases, discussions, videos, other media.",
    "prereq": {}
  },
  {
    "uid": "009077",
    "code": "ANSC3221",
    "subject": "ANSC",
    "number": "3221",
    "honors": false,
    "writing": false,
    "name": "Animal Breeding",
    "fullname": "Animal Breeding",
    "info": "Application of qualitative and quantitative genetics to animal breeding. Concepts of livestock improvement through selection and mating programs.",
    "prereq": {}
  },
  {
    "uid": "009261",
    "code": "ANSC3301",
    "subject": "ANSC",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Human and Animal Physiology",
    "fullname": "Human and Animal Physiology",
    "info": "Functions of major systems in mammals. Nervous system, muscles, cardiovascular system, respiration, renal system. \nEndocrinology/metabolism. Blood, immunology, reproduction. Students are encouraged to take one upper level biology and chemistry course prior to registering. Biol 1009 is strongly recommended.",
    "prereq": {}
  },
  {
    "uid": "804115",
    "code": "ANSC3302",
    "subject": "ANSC",
    "number": "3302",
    "honors": false,
    "writing": false,
    "name": "Human & Animal Physiology Lab",
    "fullname": "Human and Animal Physiology Laboratory",
    "info": "Companion course to 3301. Physiological principles are demonstrated using active learning approaches. Nervous system, muscles, cardiovascular, respiration, renal, endocrinology/metabolism, blood, immunology, reproduction.\n\nprereq: 3301 or concurrent registration is required (or allowed) in 3301",
    "prereq": {
      "or": [
        "009261"
      ]
    }
  },
  {
    "uid": "825681",
    "code": "ANSC3303W",
    "subject": "ANSC",
    "number": "3303",
    "honors": false,
    "writing": true,
    "name": "Human and Animal Phys with lab",
    "fullname": "Human and Animal Physiology with lab",
    "info": "Companion course to 3301. Physiological principles are demonstrated using active learning approaches. Nervous system, muscles, cardiovascular, respiration, renal, endocrinology/metabolism, blood, immunology, reproduction.\n\nprereq: Biol 1009 or equivalent is strongly recommended.",
    "prereq": {
      "or": [
        "005416"
      ]
    }
  },
  {
    "uid": "009148",
    "code": "ANSC3305",
    "subject": "ANSC",
    "number": "3305",
    "honors": false,
    "writing": false,
    "name": "Reproductive Bio: Hlth&Disease",
    "fullname": "Reproductive Biology in Health and Disease",
    "info": "Reproductive organ functions, fertilization, estrous cycle and endocrine control, reproductive efficiency, problems/principles of artificial insemination. Anatomy, physiology, biochemistry of mammary gland. Mammary growth, initiation/maintenance of lactation, milk synthesis, factors influencing lactation curve.\n\nprereq: Biol 1009 or equiv",
    "prereq": {
      "or": [
        "005416"
      ]
    }
  },
  {
    "uid": "009310",
    "code": "ANSC3307",
    "subject": "ANSC",
    "number": "3307",
    "honors": false,
    "writing": false,
    "name": "Artificial Insemination Tech",
    "fullname": "Artificial Insemination Techniques",
    "info": "Hands-on training/techniques of artificial insemination at an off-campus laboratory setting. Techniques of AI and semen handling. Criteria for selection of bulls.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009312",
    "code": "ANSC3327",
    "subject": "ANSC",
    "number": "3327",
    "honors": false,
    "writing": false,
    "name": "General Endocrinology",
    "fullname": "General Endocrinology",
    "info": "Biological effects, biochemistry, methods of assay, and regulatory aspects of hormones.",
    "prereq": {}
  },
  {
    "uid": "808251",
    "code": "ANSC3403",
    "subject": "ANSC",
    "number": "3403",
    "honors": false,
    "writing": false,
    "name": "Comp Anim Hot Button Issues",
    "fullname": "Companion Animal Hot Button Issues",
    "info": "Various issues that affect companion animals in our society. Students debate pros/cons of each issue and formalize their own opinions based on information presented by debate teams.",
    "prereq": {}
  },
  {
    "uid": "816809",
    "code": "ANSC3480",
    "subject": "ANSC",
    "number": "3480",
    "honors": false,
    "writing": false,
    "name": "Topics in Animal Science",
    "fullname": "Topics in Animal Science",
    "info": "Various topics",
    "prereq": {}
  },
  {
    "uid": "009314",
    "code": "ANSC3501",
    "subject": "ANSC",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Farm Animal Environment",
    "fullname": "Farm Animal Environment",
    "info": "Biological/physical processes involved in adjustment of animals to ambient environments. Applications to farm animal management.",
    "prereq": {}
  },
  {
    "uid": "795011",
    "code": "ANSC3509",
    "subject": "ANSC",
    "number": "3509",
    "honors": false,
    "writing": false,
    "name": "Animal Biotechnology",
    "fullname": "Animal Biotechnology",
    "info": "ANSC 3509 is a course for undergraduates seeking a broad understanding of animal biotechnology in a single semester. The course covers the major concepts and principles of modern animal biotechnology. Topics include: genes and genomes, recombinant DNA technology, genetically modified foods and medicines, proteins as products, DNA fingerprinting and forensic analysis, bioremediation, aquatic biotechnology, medical biotechnology, and bioethics as it pertains to biotechnology. The course does not require any prerequisites and is targeted at students from all backgrounds and majors. We will discuss this history of biotechnology through current events. The laboratory component will focus on basic skills required in a molecular lab including aseptic technique, DNA extraction, pipetting, PCR, casting and running gels, data analysis, and guided bioinformatics lessons. The laboratory component will also teach molecular techniques necessary in forensic DNA fingerprinting, and how to gather DNA profiling data of individual animals to study population genetics. The course focuses primarily on the science biotechnology, but has strong components on ethics, policy, and society. For each topic, career paths are discussed, including how to prepare for careers in biotechnology fields.",
    "prereq": {}
  },
  {
    "uid": "009313",
    "code": "ANSC3511",
    "subject": "ANSC",
    "number": "3511",
    "honors": false,
    "writing": false,
    "name": "Animal Growth & Development",
    "fullname": "Animal Growth and Development",
    "info": "Principles of animal growth. Interaction of nutrition, hormones, exercise, heredity, and disease in regulating growth. Strongly recommended that students have previously taken a college-level biology course.",
    "prereq": {}
  },
  {
    "uid": "801934",
    "code": "ANSC3521",
    "subject": "ANSC",
    "number": "3521",
    "honors": false,
    "writing": false,
    "name": "Biotech Appl in Pharm R&D",
    "fullname": "Biotechnology Applications in Pharmaceutical Research and Development",
    "info": "Cell/molecular biology, pharmacology, FDA regulatory process, pharmaceutical business models. Applications for drug discovery/development. Special project for commercial exploitation of biotechnology-based concept. Guest speakers.",
    "prereq": {}
  },
  {
    "uid": "817705",
    "code": "ANSC3555",
    "subject": "ANSC",
    "number": "3555",
    "honors": false,
    "writing": false,
    "name": "Applied Microbiology for AnSc",
    "fullname": "Applied Livestock and Poultry Microbiology",
    "info": "This applied microbiology course is intended to provide theoretical basis and hands-on experience to students on major pathogenic bacteria colonizing livestock and domestic poultry. This course will provide skills to the students who seriously consider farm animal and poultry microbiology research and/or teaching in their careers. Pathogenic bacteria in livestock and poultry such as Listeria monocytogenes, Escherichia coli O157: H7, and Salmonella, fungal microorganisms (Aspergillus), and beneficial microorganisms such as Lactobacillus, will be discussed. In addition, the course will introduce feed testing methods (Bacteriological Analytical Manual (BAM) methodology), common antibacterials/antibiotics used for decontamination and disinfection, and the emerging alternatives to antibiotics with a perspective on bacterial antibiotic resistance. In a flipped class room format, the students will gather necessary information provided by the instructor, listen to short lectures on the methods and mechanisms, participate in demonstrations, and apply it in a typical BSL2 laboratory set up under supervision.\n\nAll students should undergo BSL2 training prior to enrollment. Online training counts to approximately 5-6 hours. Not more than 4 students will be allowed for each session due to BSL2 pathogenic microbiology space restriction, access to RAR facilities, and some non-conventional microbiological methods. Special health conditions, pregnancy, and immunocompromised situations must be consulted with the instructor prior to enrollment. The students must obtain clearance from ROHC for their tetanus vaccination status.  \n\nprereq: Instructor Permission\n",
    "prereq": {}
  },
  {
    "uid": "014738",
    "code": "ANSC3609",
    "subject": "ANSC",
    "number": "3609",
    "honors": false,
    "writing": false,
    "name": "Planning for Animal Enterprise",
    "fullname": "Business Planning for Animal Enterprises",
    "info": "Systems approach to decision making and problem solving in production enterprises. Planning, long range goal setting, production analysis, risk analysis, and cost-benefit analysis. Quality-of-life issues.",
    "prereq": {}
  },
  {
    "uid": "825921",
    "code": "ANSC3701",
    "subject": "ANSC",
    "number": "3701",
    "honors": false,
    "writing": false,
    "name": "Poultry Products Technology",
    "fullname": "Poultry Products Technology",
    "info": "Explores procurement, processing, and distribution of poultry meat, eggs, and further processed products. Composition, quality measurements, preservation, and economics are related to the biochemistry, microbiology, and technology involved in current processing methods.",
    "prereq": {}
  },
  {
    "uid": "825922",
    "code": "ANSC3702",
    "subject": "ANSC",
    "number": "3702",
    "honors": false,
    "writing": false,
    "name": "Applied Avian Physiology",
    "fullname": "Applied Avian Physiology",
    "info": "Applied Avian Physiology is an intensive 3-credit lecture and laboratory course designed to introduce industry relevant aspects of avian physiology\nwith emphasis on behavior, neurology, muscle, cardiovascular, immunology, digestive, endocrinology, and reproductive systems for egg and meat producing birds. ",
    "prereq": {}
  },
  {
    "uid": "825923",
    "code": "ANSC3703",
    "subject": "ANSC",
    "number": "3703",
    "honors": false,
    "writing": false,
    "name": "Avian Health",
    "fullname": "Avian Health",
    "info": "Trains students to identify diseases that commonly plague poultry. Instruction on animal well-being, transport regulations, disease surveillance, and methods of disinfection and sanitation are included. ",
    "prereq": {}
  },
  {
    "uid": "825924",
    "code": "ANSC3704",
    "subject": "ANSC",
    "number": "3704",
    "honors": false,
    "writing": false,
    "name": "Poultry Nutrition",
    "fullname": "Poultry Nutrition",
    "info": "Develop a conceptual understanding of nutrient requirements and feed production for optimal growth and production of commercial poultry species. The use of computer programming for feed formulation is emphasized.",
    "prereq": {}
  },
  {
    "uid": "802121",
    "code": "ANSC3801",
    "subject": "ANSC",
    "number": "3801",
    "honors": false,
    "writing": false,
    "name": "Livestock Merchandising",
    "fullname": "Livestock Merchandising",
    "info": "Promotion/merchandising of purebred livestock. Hands-on training in advertising, livestock photography, showing/fitting, sale organization. Field trips to seed stock operations/auctions. Presentations by industry and breed association leaders. Students conduct annual sale.\n\nprereq: Jr or sr or instr consent",
    "prereq": {}
  },
  {
    "uid": "012860",
    "code": "ANSC4009W",
    "subject": "ANSC",
    "number": "4009",
    "honors": false,
    "writing": true,
    "name": "Undergraduate Research Thesis",
    "fullname": "Undergraduate Research Thesis",
    "info": "Usually one full year. Research/thesis experience under supervision of CFANS faculty member. Written bound thesis, oral presentation of research results.\n\nprereq: Jr or sr major in AnSc, instr consent",
    "prereq": {}
  },
  {
    "uid": "010274",
    "code": "ANSC4011",
    "subject": "ANSC",
    "number": "4011",
    "honors": false,
    "writing": false,
    "name": "Dairy Cattle Breeding",
    "fullname": "Dairy Cattle Genetics",
    "info": "Quantitative genetic principles of breeding dairy cattle. Evaluation of males, females. Systems of mating. Rates of genetic improvement with/without AI.\n\nprereq: (prereq 3221, previous or current registration in 4604, junior status or instructor permission)",
    "prereq": {
      "or": [
        "009077",
        "009100"
      ]
    }
  },
  {
    "uid": "010329",
    "code": "ANSC4092",
    "subject": "ANSC",
    "number": "4092",
    "honors": false,
    "writing": false,
    "name": "Spec Problems: Animal Science",
    "fullname": "Special Problems in Animal Science",
    "info": "Independent study in an area of animal science, under supervision of faculty member.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "010330",
    "code": "ANSC4093",
    "subject": "ANSC",
    "number": "4093",
    "honors": false,
    "writing": false,
    "name": "Tutorial in Animal Science",
    "fullname": "Tutorial in Animal Science",
    "info": "Informally structured to encourage in-depth study of specific disciplines in animal science. Pertinent readings; preparation of written essays of high quality required.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "801693",
    "code": "ANSC4094",
    "subject": "ANSC",
    "number": "4094",
    "honors": false,
    "writing": false,
    "name": "Directed Research in ANSC",
    "fullname": "Directed Research in Animal Science",
    "info": "Research in an area of animal science, under supervision of faculty member. Written report on the research is required.",
    "prereq": {}
  },
  {
    "uid": "010328",
    "code": "ANSC4096",
    "subject": "ANSC",
    "number": "4096",
    "honors": false,
    "writing": false,
    "name": "PEP: Internship",
    "fullname": "Professional Experience Program: Internship",
    "info": "Supervised professional experience in animal industries and farm enterprise systems. Various aspects of the industry and related fields. Evaluative reports. Consultations with faculty advisers and employers.\n\nprereq: CFANS undergrad, instr consent, agreement form",
    "prereq": {}
  },
  {
    "uid": "010358",
    "code": "ANSC4099",
    "subject": "ANSC",
    "number": "4099",
    "honors": false,
    "writing": false,
    "name": "Workshop in Animal Science",
    "fullname": "Special Workshop in Animal Science",
    "info": "Independent study in an area of animal science, under supervision of faculty member. \n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788394",
    "code": "ANSC4102",
    "subject": "ANSC",
    "number": "4102",
    "honors": false,
    "writing": false,
    "name": "Equine Management",
    "fullname": "Equine Management",
    "info": "Fundamentals of horse management. Record keeping (traditional, computer\nbased). Marketing, sales techniques. Legal aspects (e.g., contracts, \nzoning, liability, insurance). A management project involves establishing, maintaining, improving an equine business.",
    "prereq": {}
  },
  {
    "uid": "807662",
    "code": "ANSC4305",
    "subject": "ANSC",
    "number": "4305",
    "honors": false,
    "writing": false,
    "name": "Companion & Wild Species Repro",
    "fullname": "Companion & Wild Species Reproduction",
    "info": "Reproductive physiology specific to domesticated companion canine and feline species as well as avian species. Management of breeding and reproductive diseases in companion species as well as conservation management in wild species.\n\nprereq: ANSC 3305",
    "prereq": {
      "and": [
        "009148"
      ]
    }
  },
  {
    "uid": "009730",
    "code": "ANSC4401",
    "subject": "ANSC",
    "number": "4401",
    "honors": false,
    "writing": false,
    "name": "Swine Nutrition",
    "fullname": "Swine Nutrition",
    "info": "A comprehensive review of major considerations in providing optimum, cost-effective nutrition to swine in all stages of production.\n\nprereq: 2401, 3511 recommended",
    "prereq": {
      "and": [
        "010423",
        "009313"
      ]
    }
  },
  {
    "uid": "010247",
    "code": "ANSC4403",
    "subject": "ANSC",
    "number": "4403",
    "honors": false,
    "writing": false,
    "name": "Ruminant Nutrition",
    "fullname": "Ruminant Nutrition of Production & Exotic Animals",
    "info": "This is a hybrid course with approximately 75% of material delivered via on-line lectures.  Students will meet once per week for a in-class hands-on activity or a guest lecture.   Species focus will include dairy, beef, small ruminants, deer, buffalo and zoo ruminants.   Topics include digestive tract physiology, microbiology of the rumen, nutrient requirements, nutrient utilization, nutrient content of feedstuffs, diet formulation and feeding challenges.",
    "prereq": {}
  },
  {
    "uid": "795012",
    "code": "ANSC4404",
    "subject": "ANSC",
    "number": "4404",
    "honors": false,
    "writing": false,
    "name": "Applied Dairy Nutrition",
    "fullname": "Applied Dairy Nutrition",
    "info": "Application of nutrition principles to dairy cow nutrition. Nutrient requirements of dairy cows, feed ingredient selection/usage, and formulation/evaluation of dairy cow rations using computer programs. Case study analysis of feeding programs used on dairy farms. AnSc 4403 recommended.",
    "prereq": {}
  },
  {
    "uid": "010311",
    "code": "ANSC4405",
    "subject": "ANSC",
    "number": "4405",
    "honors": false,
    "writing": false,
    "name": "Poultry Nutrition",
    "fullname": "Poultry Nutrition",
    "info": "Nutrient requirements of chickens and turkeys; feed composition and use in formulation of adequate diets. Role of feed additives. Least cost formulations, nutritional interrelationships, and feeding systems.",
    "prereq": {}
  },
  {
    "uid": "009731",
    "code": "ANSC4601",
    "subject": "ANSC",
    "number": "4601",
    "honors": false,
    "writing": false,
    "name": "Pork Production Systems Mgmt",
    "fullname": "Pork Production Systems Management",
    "info": "Interrelationships of business, marketing, and biological performance of pigs in various types of production systems.",
    "prereq": {}
  },
  {
    "uid": "009081",
    "code": "ANSC4602",
    "subject": "ANSC",
    "number": "4602",
    "honors": false,
    "writing": false,
    "name": "Sheep Production Systems Mgmt",
    "fullname": "Sheep Production Systems Management",
    "info": "Nutrition, management, genetics, reproduction, health. Application of production records, selection, and marketing technology. Current research. Social concerns, consumer affairs, industry practices. Field trips to sheep farms and related industries.",
    "prereq": {}
  },
  {
    "uid": "010317",
    "code": "ANSC4603",
    "subject": "ANSC",
    "number": "4603",
    "honors": false,
    "writing": false,
    "name": "Beef Production Systems Mgmt",
    "fullname": "Beef Production Systems Management",
    "info": "How to resolve problems and manage cow-calf, stocker, or feedlot operations. Segments of beef industry, challenges. Nutrition, reproduction, genetics, and health in beef cattle production. Students evaluate a beef cattle enterprise and contribute in marketing, selection, reproduction, nutrition, or health management. Concurrent registration is allowed in AnSc 4613. ",
    "prereq": {}
  },
  {
    "uid": "009100",
    "code": "ANSC4604",
    "subject": "ANSC",
    "number": "4604",
    "honors": false,
    "writing": false,
    "name": "Dairy Production Systems Mgmt",
    "fullname": "Dairy Production Systems Management",
    "info": "Practical applications of principles of dairy cattle health and welfare, nutrition, reproduction, housing, genetics, and economics in a problem solving context. Lectures, farm evaluations and case studies. \n\nprereq: AnSc 1101, AnSc 2401",
    "prereq": {
      "and": [
        "008375",
        "010423"
      ]
    }
  },
  {
    "uid": "010313",
    "code": "ANSC4605",
    "subject": "ANSC",
    "number": "4605",
    "honors": false,
    "writing": false,
    "name": "Poultry Prod Systems Mgmt",
    "fullname": "Poultry Production Systems Management",
    "info": "Physiology, genetics, diseases, nutrition of poultry, relation to management practices for production of eggs, broilers, and turkeys. Technical/practical phases of production/marketing, underlying principles. Visits to commercial production units.",
    "prereq": {}
  },
  {
    "uid": "014773",
    "code": "ANSC4611",
    "subject": "ANSC",
    "number": "4611",
    "honors": false,
    "writing": false,
    "name": "Adv Pork Prod Systems Mgmt",
    "fullname": "Advanced Pork Production Systems Management",
    "info": "Analysis of pork production systems. Case studies, visits to pork production operations.",
    "prereq": {}
  },
  {
    "uid": "803832",
    "code": "ANSC4612",
    "subject": "ANSC",
    "number": "4612",
    "honors": false,
    "writing": false,
    "name": "Tools for Dairy Consultants",
    "fullname": "Tools for Dairy Consultants in the 21st Century",
    "info": "Management information system. Data collection, organization, analysis, and interpretation of dairy production and health data. Using tradition dairy records. PC Dart Herd Detective software.  Hand-held and Web-based dairy record analysis systems. Teleconferencing, consultant conferencing with project farm.",
    "prereq": {}
  },
  {
    "uid": "014743",
    "code": "ANSC4613",
    "subject": "ANSC",
    "number": "4613",
    "honors": false,
    "writing": false,
    "name": "Adv Beef Prod Systems Mgmt",
    "fullname": "Advanced Beef Production Systems Management",
    "info": "Student enterprise-analysis teams evaluate a beef cattle enterprise and solve  problems in marketing, selection, reproduction, nutrition, or health management.\n\nprereq: 4603",
    "prereq": {
      "and": [
        "010317"
      ]
    }
  },
  {
    "uid": "014740",
    "code": "ANSC4614",
    "subject": "ANSC",
    "number": "4614",
    "honors": false,
    "writing": false,
    "name": "Adv Dairy Prod Systems Mgmt",
    "fullname": "Advanced Dairy Production Systems Management",
    "info": "Practical application of electronic tools for 21st century dairy consultant. Data collection, organization, analysis, interpretation of dairy production/health data.\n\nprereq: 4604",
    "prereq": {
      "and": [
        "009100"
      ]
    }
  },
  {
    "uid": "825848",
    "code": "ANSC4711",
    "subject": "ANSC",
    "number": "4711",
    "honors": false,
    "writing": false,
    "name": "Breeder Flock & Hatchery Mgmt",
    "fullname": "Breeder Flock & Hatchery Management",
    "info": "History of artificial incubation relevant to the U.S. hatching industry. Practices involved in successful incubation of hatching eggs and embryonic development in birds. Management factors involved in breeder hen production and operating a hatchery.",
    "prereq": {}
  },
  {
    "uid": "825925",
    "code": "ANSC4712",
    "subject": "ANSC",
    "number": "4712",
    "honors": false,
    "writing": false,
    "name": "Poultry Enterprise Management",
    "fullname": "Poultry Enterprise Management",
    "info": "Poultry Enterprise Management is designed to compile various aspects of previous poultry classes and is designed to expose students to the business and management aspects of the poultry industry. It is also designed to teach students how to interact and communicate effectively within the poultry industry and train them to make business decisions that impact the economic welfare of various poultry industry sectors. Students will learn how to develop a poultry operation business plan that includes everything from building design to an overall economic analysis of their operation.  ",
    "prereq": {}
  },
  {
    "uid": "818692",
    "code": "ANSC5015",
    "subject": "ANSC",
    "number": "5015",
    "honors": false,
    "writing": false,
    "name": "Animal Welfare Science& Ethics",
    "fullname": "Animal Welfare Science and Ethics",
    "info": "This multidisciplinary course helps students develop an intellectual framework for understanding and interpreting issues involving animal welfare and ethics of animal use in agriculture, science and society. \n",
    "prereq": {}
  },
  {
    "uid": "819727",
    "code": "ANSC5025",
    "subject": "ANSC",
    "number": "5025",
    "honors": false,
    "writing": false,
    "name": "Gut Microbiome Systems",
    "fullname": "Gut Microbiome Systems",
    "info": "This course is primarily focused on providing conceptual and methodological tools to understand how diet and the gut microbiome converge to impact the physiological landscape of animals and humans, considering diet, host and microbiome as one highly integrated system. To that end, the course relies on concepts of data analysis, gastrointestinal microbiology, the breadth of scientific literature produced up to date and hands on experiences to immerse attendants in the ever-growing microbiome field and open them to consider a microbiome lens to address different research questions in their respective fields. \n\nThe course emphasizes three main conceptual areas:\n\n1.\tCompositional and functional organization of microbial communities in the mammalian gut: From cells to functional communities.\n2.\tDietary drivers of the mammalian gut microbiome: Nutritional Ecology in the mammalian gut \n3.\tHost-microbiome interactions: Physiological impact of the mammalian gut microbiome  \n\nRather than memorizing these concepts, the course emphasizes the need to apply them to real life issues in animal and human nutrition and health. As such, recognizing these conceptual areas in context, and using them for problem solving in their respective research areas, is the ultimate goal of the course.\n\nUndergraduate level course in microbiology and physiology are suggested to enroll in this course. Also, previous completion of statistics courses and familiarity with the R statistical interface and command line are recommended.",
    "prereq": {}
  },
  {
    "uid": "819378",
    "code": "ANSC5035",
    "subject": "ANSC",
    "number": "5035",
    "honors": false,
    "writing": false,
    "name": "Animal Welfare Judging Assess",
    "fullname": "Animal Welfare Judging and Assessment",
    "info": "Advanced application of animal welfare science toward the assessment of real-life scenarios in agriculture, companion, and exotic animals. Top students will compete on the UMN team at the Intercollegiate Animal Welfare Judging and Assessment Competition held in November each year.",
    "prereq": {}
  },
  {
    "uid": "813234",
    "code": "ANSC5091",
    "subject": "ANSC",
    "number": "5091",
    "honors": false,
    "writing": false,
    "name": "From Ideas to Strategic Plans",
    "fullname": "Research Proposals: From Ideas to Strategic Plans",
    "info": "You have a great research idea, now what? How do you turn your idea into a proposal? It has been said paraphrasing Edison, that innovation is one percent inspiration, ninety-nice percent perspiration. In this course, we will start with and inspiring idea and sweat our way to develop a research proposal. The students will go through a step-by-step process that starts choosing and defining a research idea, then proceeding to do literature reviews and to the development of hypothesis, aims, objectives and a research strategy. The aim of this course is to provide students with tools to understand the structure of scientific reports and proposals, literature searches and basic data interpretation. The student will learn about different research approaches and how to achieve consistency in their research projects. We will guide students in how to begin and develop a written research proposal that will satisfy the requirements of their advisers, institution and funding organizations.\n\nprereq: There are no prerequisites, however, having taken ANSC 3011 Statistics for Animal Science is desirable.",
    "prereq": {
      "or": [
        "008641"
      ]
    }
  },
  {
    "uid": "788136",
    "code": "ANSC5099",
    "subject": "ANSC",
    "number": "5099",
    "honors": false,
    "writing": false,
    "name": "Workshop in Animal Science",
    "fullname": "Special Workshop in Animal Science",
    "info": "Topics vary. See Class Schedule or department. Topics may use guest lectures/experts.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788395",
    "code": "ANSC5200",
    "subject": "ANSC",
    "number": "5200",
    "honors": false,
    "writing": false,
    "name": "Stat Genet & Genomics",
    "fullname": "Statistical Genetics and Genomics",
    "info": "Gene discovery. Genomic selection. Data analysis. Phenotypes/DNA markers. Parametric/non parametric linkage analysis. Mapping quantitative trait loci (QTL). Parentage testing.\n\nprereq: [Stat 3021 or equiv], [Biol 4003 or equiv]",
    "prereq": {
      "and": [
        {
          "or": [
            "001622"
          ]
        },
        {
          "or": [
            "009489"
          ]
        }
      ]
    }
  },
  {
    "uid": "807798",
    "code": "ANSC5305",
    "subject": "ANSC",
    "number": "5305",
    "honors": false,
    "writing": false,
    "name": "Companion & Wild Species Repro",
    "fullname": "Companion & Wild Species Reproduction",
    "info": "Principles of reproductive physiology specific to domesticated companion canine and feline species as well as avian species. These principles discussed in the context of the management of breeding and reproductive diseases in companion species as well as conservation management in wild species.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "795105",
    "code": "ANSC5327",
    "subject": "ANSC",
    "number": "5327",
    "honors": false,
    "writing": false,
    "name": "Endocrine and Repro Physiology",
    "fullname": "Endocrine and Reproductive Physiology",
    "info": "Endocrine system. Synthesis, structure, actions, and regulation of hormones. Major endocrine glands/tissues, including the hypothalamus, anterior/posterior pituitary, thyroid, parathyroid, pancreas, adrenal cortex and medulla, gastrointestinal tract, and gonads. Emphasizes metabolic/reproductive endocrinology.\n",
    "prereq": {}
  },
  {
    "uid": "817758",
    "code": "ANSC5555",
    "subject": "ANSC",
    "number": "5555",
    "honors": false,
    "writing": false,
    "name": "Applied Microbiology for AnSc",
    "fullname": "Applied Livestock and Poultry Microbiology",
    "info": "This applied microbiology course is intended to provide theoretical basis and hands-on experience to students on major pathogenic bacteria colonizing livestock and domestic poultry. This course will provide skills to the students who seriously consider farm animal and poultry microbiology research and/or teaching in their careers. Pathogenic bacteria in livestock and poultry such as Listeria monocytogenes, Escherichia coli O157: H7, and Salmonella, fungal microorganisms (Aspergillus), and beneficial microorganisms such as Lactobacillus, will be discussed. In addition, the course will introduce feed testing methods (Bacteriological Analytical Manual (BAM) methodology), common antibacterials/antibiotics used for decontamination and disinfection, and the emerging alternatives to antibiotics with a perspective on bacterial antibiotic resistance. In a flipped class room format, the students will gather necessary information provided by the instructor, listen to short lectures on the methods and mechanisms, participate in demonstrations, and apply it in a typical BSL2 laboratory set up under supervision. \n\n\nAll students should undergo BSL2 training prior to enrollment. Online training counts to approximately 5-6 hours. Not more than 4 students will be allowed for each session due to BSL2 pathogenic microbiology space restriction, access to RAR facilities, and some non-conventional microbiological methods. Special health conditions, pregnancy, and immunocompromised situations must be consulted with the instructor prior to enrollment. The students must obtain clearance from ROHC for their tetanus vaccination status.  ",
    "prereq": {}
  },
  {
    "uid": "806102",
    "code": "ANSC5625",
    "subject": "ANSC",
    "number": "5625",
    "honors": false,
    "writing": false,
    "name": "Nutritional Biochemistry",
    "fullname": "Nutritional Biochemistry",
    "info": "Overview of biochemical molecules and pathways important in nutritional events.\n\nprereq: BIOC 3021 or instr consent",
    "prereq": {
      "or": [
        "014290"
      ]
    }
  },
  {
    "uid": "806569",
    "code": "ANSC5626",
    "subject": "ANSC",
    "number": "5626",
    "honors": false,
    "writing": false,
    "name": "Nutritional Physiology",
    "fullname": "Nutritional Physiology",
    "info": "Whole body macronutrient metabolism as it relates to etiology of metabolic diseases. Signaling between tissues to control homeostasis. How dysregulation of crosstalk can lead to metabolic diseases. How diet, exercise, or starvation impact metabolism. Regulation of food intake and energy expenditure. Designing/analyzing/interpreting research data.",
    "prereq": {}
  },
  {
    "uid": "803901",
    "code": "ANSC5702",
    "subject": "ANSC",
    "number": "5702",
    "honors": false,
    "writing": false,
    "name": "Cell Physiology",
    "fullname": "Cell Physiology",
    "info": "Cell Physiology involves the study of control mechanisms involved in maintaining homeostasis with respect to a variety of parameters including regulation of pH, volume, nutrient content, intracellular electrolyte composition, membrane potential, receptor signaling and aspects of intercellular communication. The first half of this team-taught course is organized in a partially on-line format where students learn from on-line materials and then take an on-line quiz each week before meeting with the instructor to review key concepts in class. The second half of the course is presented in lecture format. Student evaluation is based on quiz scores, in-class exams and graded problem sets.",
    "prereq": {}
  },
  {
    "uid": "817763",
    "code": "ANSC8011",
    "subject": "ANSC",
    "number": "8011",
    "honors": false,
    "writing": false,
    "name": "Animal Science Applied Stats",
    "fullname": "Applied Statistical Models and Analysis for Animal Science Professionals",
    "info": "This course is designed for graduate students in the applied agricultural, animal science, and related programs that require an understanding of applied statistical analysis and interpretation of research data.  \n\nStudents will learn central principles in sampling, experimental design, and statistical analysis.  The course will have an intense focus on data analysis of research data with SAS software. By the end of the semester, students should be able to generate testable hypotheses, organize a work plan to collect research data, and analyze results using appropriate statistical procedures and SAS software. \n\nPrerequisites: STAT 3021 or 5021: Statistical Analysis or equivalent, or consent of instructors",
    "prereq": {}
  },
  {
    "uid": "008405",
    "code": "ANSC8111",
    "subject": "ANSC",
    "number": "8111",
    "honors": false,
    "writing": false,
    "name": "Genetic Improvement of Animals",
    "fullname": "Genetic Improvement of Animals",
    "info": "Application of population genetics to livestock breeding; selection index theory and practice; basis of relationships and covariances among relatives; and selection based on multiple sources of information.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009088",
    "code": "ANSC8121",
    "subject": "ANSC",
    "number": "8121",
    "honors": false,
    "writing": false,
    "name": "Linear Model Methods",
    "fullname": "Linear Model Methods",
    "info": "Techniques and statistical tools for analysis of data. Matrix manipulation, least-squares procedures, correction for environmental factors, estimation of components of variance, and standard errors of estimates.\n\nprereq: Stat 5021",
    "prereq": {
      "and": [
        "001624"
      ]
    }
  },
  {
    "uid": "797166",
    "code": "ANSC8131",
    "subject": "ANSC",
    "number": "8131",
    "honors": false,
    "writing": false,
    "name": "Mol Biol Tech",
    "fullname": "Molecular Biology Techniques",
    "info": "Basic theory and current methodologies of molecular biology and recombinant DNA technology.  Lab work includes DNA and RNA hybridization, gene transfer, and polymerase chain reaction techniques.  Primarily for students with limited exposure to molecular biology.",
    "prereq": {}
  },
  {
    "uid": "791683",
    "code": "ANSC8134",
    "subject": "ANSC",
    "number": "8134",
    "honors": false,
    "writing": false,
    "name": "Ethical Conduct/An Research",
    "fullname": "Ethical Conduct of Animal Research",
    "info": "Ethical considerations in use of animal subjects in agricultural, veterinary, and biomedical research. Federal, state, and University guidelines relating to proper conduct for acquisition/use of animals for laboratory, observational, epidemiological, and clinical research.  Regulatory requirements, bases for what is deemed proper conduct. Societal impact on scientific investigations utilizing animal subjects.\n\nprereq: Grad student or prof school student or instr consent",
    "prereq": {}
  },
  {
    "uid": "790465",
    "code": "ANSC8141",
    "subject": "ANSC",
    "number": "8141",
    "honors": false,
    "writing": false,
    "name": "Mixed Model Meths/Gen Analysis",
    "fullname": "Mixed Model Methods for Genetic Analysis",
    "info": "Theoretical foundation of genetic prediction, selection index theory, best linear unbiased prediction, multivariate mixed models, estimation of variance components using maximum/restricted maximum likelihood methods, genomic prediction/variance component estimation.\n\nprereq: 5200 or CMB 5200 or equiv",
    "prereq": {
      "or": [
        "788395",
        "016425"
      ]
    }
  },
  {
    "uid": "013253",
    "code": "ANSC8194",
    "subject": "ANSC",
    "number": "8194",
    "honors": false,
    "writing": false,
    "name": "Res Anim Genetics",
    "fullname": "Research in Animal Genetics",
    "info": "Research in quantitative genetics, cytogenetics, molecular genetics, and other areas related to animal breeding.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "013555",
    "code": "ANSC8211",
    "subject": "ANSC",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Anim Growth Devel",
    "fullname": "Animal Growth and Development",
    "info": "Whole body growth of animals, bone, and adipose tissue; structure, function, differentiation, and development of tissues; mode of action of hormones, growth factors, and growth promoters.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "013256",
    "code": "ANSC8294",
    "subject": "ANSC",
    "number": "8294",
    "honors": false,
    "writing": false,
    "name": "Res Muscle Physiol",
    "fullname": "Research in Muscle Chemistry and Physiology",
    "info": "Research in selected areas.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "013238",
    "code": "ANSC8311",
    "subject": "ANSC",
    "number": "8311",
    "honors": false,
    "writing": false,
    "name": "Animal Bioenergetics",
    "fullname": "Animal Bioenergetics",
    "info": "Integrated systems approach to energy metabolism of animals. Application of classical techniques of calorimetry and comparative slaughter. Development of systems for expressing energy content of feeds, and techniques for measuring whole body and organ metabolism of specific nutrients.\n\nprereq: instr consent; BIOC 4331 recommended",
    "prereq": {
      "and": [
        "002945"
      ]
    }
  },
  {
    "uid": "792289",
    "code": "ANSC8312",
    "subject": "ANSC",
    "number": "8312",
    "honors": false,
    "writing": false,
    "name": "Protein Metabolism",
    "fullname": "Protein Metabolism",
    "info": "Basic and applied concepts of protein metabolism in farm animals.\n\nprereq: BioC 4331",
    "prereq": {
      "and": [
        "002945"
      ]
    }
  },
  {
    "uid": "826910",
    "code": "ANSC8315",
    "subject": "ANSC",
    "number": "8315",
    "honors": false,
    "writing": false,
    "name": "Adv Ruminant Physiology & Nutr",
    "fullname": "Adv Ruminant Physiology & Nutrition",
    "info": "Principles of anatomy, physiology, microbial ecology, metabolism, and nutrition of ruminants, including current research approaches, feeding systems, and environmental implications. ",
    "prereq": {}
  },
  {
    "uid": "013239",
    "code": "ANSC8320",
    "subject": "ANSC",
    "number": "8320",
    "honors": false,
    "writing": false,
    "name": "Conc Nutr Physiol",
    "fullname": "Concepts and Developments in Nutritional Physiology",
    "info": "Review and critical evaluation of pertinent scientific literature.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "013257",
    "code": "ANSC8330",
    "subject": "ANSC",
    "number": "8330",
    "honors": false,
    "writing": false,
    "name": "Concepts in Animal Science",
    "fullname": "Concepts and Developments in Animal Science",
    "info": "Review, critical evaluation of recent research reports.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788073",
    "code": "ANSC8333",
    "subject": "ANSC",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "013259",
    "code": "ANSC8340",
    "subject": "ANSC",
    "number": "8340",
    "honors": false,
    "writing": false,
    "name": "SWINE NUTR DEVEL",
    "fullname": "Concepts and Developments in Swine Nutrition",
    "info": "Review and critical evaluation of scientific literature.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "799105",
    "code": "ANSC8344",
    "subject": "ANSC",
    "number": "8344",
    "honors": false,
    "writing": false,
    "name": "Mechanisms of Hormone Action",
    "fullname": "Mechanisms of Hormone Action",
    "info": "Major signal transduction, apoptosis. Topics incorporate pharmacology, biochemistry, and cell biology of hormone action in relevant physiological systems.  Lectures on basic principles. Specialized lectures. Discussion of primary literature.\n\nprereq: Course in biochemistry or cell biology or instr consent",
    "prereq": {}
  },
  {
    "uid": "013255",
    "code": "ANSC8394",
    "subject": "ANSC",
    "number": "8394",
    "honors": false,
    "writing": false,
    "name": "Res Anim Nutrition",
    "fullname": "Research in Animal Nutrition",
    "info": "Research in selected areas: topics and animal species determined by consultation.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "012708",
    "code": "ANSC8411",
    "subject": "ANSC",
    "number": "8411",
    "honors": false,
    "writing": false,
    "name": "Physiology of Reproduction",
    "fullname": "Physiology of Reproduction",
    "info": "Emphasis is on gametogenesis, conception, and implantation.\n\nprereq: 3305 or equiv",
    "prereq": {
      "or": [
        "009148"
      ]
    }
  },
  {
    "uid": "009484",
    "code": "ANSC8421",
    "subject": "ANSC",
    "number": "8421",
    "honors": false,
    "writing": false,
    "name": "PHYS FERTIL,GESTAT",
    "fullname": "Physiology of Fertilization and Gestation",
    "info": "Physiological events occurring during gametogenesis; capacitation and fertilization; period of the embryo; period of the fetus; and parturition.\n\nprereq: 3305 or instr consent",
    "prereq": {
      "or": [
        "009148"
      ]
    }
  },
  {
    "uid": "009495",
    "code": "ANSC8431",
    "subject": "ANSC",
    "number": "8431",
    "honors": false,
    "writing": false,
    "name": "IMMUNOREPRODUCTION",
    "fullname": "Immunoreproduction",
    "info": "Blood groups and polymorphic proteins affecting reproduction; immunoglobulin formation; antigens of semen, ova, and genital secretions; immunopathology; maternal-fetal incompatibility; and antibodies to hormones.\n\nprereq: 3305 or instr consent",
    "prereq": {
      "or": [
        "009148"
      ]
    }
  },
  {
    "uid": "788309",
    "code": "ANSC8444",
    "subject": "ANSC",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "012832",
    "code": "ANSC8451",
    "subject": "ANSC",
    "number": "8451",
    "honors": false,
    "writing": false,
    "name": "Reproductive Endocrinology",
    "fullname": "Reproductive Endocrinology",
    "info": "Hormonal regulation of mammalian reproductive cycles and seasonal patterns; nutritional and stress effects on reproductive endocrinology; mechanism of hormone action.\n\nprereq: 3305 or 3327 or equiv, BioC 3021",
    "prereq": {
      "or": [
        "009148",
        "009312",
        "014290"
      ]
    }
  },
  {
    "uid": "013254",
    "code": "ANSC8494",
    "subject": "ANSC",
    "number": "8494",
    "honors": false,
    "writing": false,
    "name": "Res Anim Physiol",
    "fullname": "Research in Animal Physiology",
    "info": "Individual research under faculty direction.  Topic determined by consultation: a specialized aspect of a thesis problem or an independent problem of mutual interest to graduate student and adviser.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "013250",
    "code": "ANSC8510",
    "subject": "ANSC",
    "number": "8510",
    "honors": false,
    "writing": false,
    "name": "Grad Seminar",
    "fullname": "Graduate Seminar",
    "info": "Students attend seminars and lead a seminar, giving oral presentation of scientific data. Public speaking skills. Preparing visuals for scientific presentations. Audience critiques of presentations.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "827274",
    "code": "ANSC8511",
    "subject": "ANSC",
    "number": "8511",
    "honors": false,
    "writing": false,
    "name": "Animal Science Faculty Seminar",
    "fullname": "Animal Science Faculty Seminar",
    "info": "This is a required course for 1st year students in which Animal Science graduate faculty  members present a 25-minute seminar followed by 10-minute Q&A with two  presentations per week. The presenting faculty will describe their research efforts,  impact of their research (and extension efforts if applicable) towards the grand  challenges in animal science, sharable resources available in their labs, skills they could  help students develop, graduate-level courses they teach, and additional information the  faculty member wants to share. The current DGS leads a 5-min discussion in the beginning of the class period and coordinates the course. Other students and faculty are invited to attend any session they want. The schedule of presentations will be distributed to Animal Science faculty, other graduate students not registered for the course, and senior undergraduate  students.",
    "prereq": {}
  },
  {
    "uid": "825663",
    "code": "ANSC8520",
    "subject": "ANSC",
    "number": "8520",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Various topics in Animal Science",
    "prereq": {}
  },
  {
    "uid": "013252",
    "code": "ANSC8594",
    "subject": "ANSC",
    "number": "8594",
    "honors": false,
    "writing": false,
    "name": "Res AnSc",
    "fullname": "Research in Animal Science",
    "info": "Research including experimental studies in disciplines associated with animal production and research, with emphasis on interdisciplinary studies.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788436",
    "code": "ANSC8666",
    "subject": "ANSC",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "x\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788566",
    "code": "ANSC8777",
    "subject": "ANSC",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787822",
    "code": "ANSC8888",
    "subject": "ANSC",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "812222",
    "code": "ANSC8990",
    "subject": "ANSC",
    "number": "8990",
    "honors": false,
    "writing": false,
    "name": "Curricular Practical Training",
    "fullname": "Curricular Practical Training",
    "info": "Industrial work assignment involving animal science. Review/approval by faculty member and director of graduate studies. Final report covering work assignment.\n\nprereq: AnSc grad student, dept consent",
    "prereq": {}
  }
]