[
  {
    "uid": "008711",
    "code": "ANTH1001",
    "subject": "ANTH",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Human Evolution",
    "fullname": "Human Evolution",
    "info": "What does it mean to be human? This question, central to the discipline of anthropology, has provided inspiration to scientists, philosophers, and artists for many centuries. In this course, we will begin to answer this question using the scientific study of the biological and cultural evolution of the human lineage. The first half of the term will introduce you to basic concepts in evolutionary theory: natural selection, genetics, behavioral ecology, and comparative anatomy. Using these tools, we will then spend the rest of the semester reconstructing the ecology, diet, anatomy, and behavior of our early ancestors, from the first apes to walk on two legs to the modern humans that conquered the globe. Weekly readings and lectures will provide the theoretical framework for understanding the evolutionary biology of Homo sapiens; laboratory sections will give you an opportunity to apply these theories and evaluate the fossil evidence for yourself. Through this combined approach, we will tackle such important questions as: What features define the human lineage? In what ecological setting did our ancestors become bipedal? What role did global climate change play in our evolution? How did tool use and cultural evolution feedback into our biological evolution? When and where did modern humans originate and what behaviors characterized this emergence? Why were there many species of humans in the past but only one today? Why is it important for the future of humanity for the average citizen to understand the principles of evolution as applied to the human animal? Upon completion of this course, you will have a broad knowledge of the role biological anthropology plays within the discipline of anthropology. More importantly, however, you will acquire a better understanding of the biological heritage of our species and our place among other forms of life on our planet.",
    "prereq": {}
  },
  {
    "uid": "803630",
    "code": "ANTH1002",
    "subject": "ANTH",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Cultural Heritage/Archaeology",
    "fullname": "Cultural Heritage and Archaeology",
    "info": "Archaeology/archaeological epistemology as scholarly research, cultural heritage, and subject of competing claims. Students compare media about archaeology for different interpretations of the past.",
    "prereq": {}
  },
  {
    "uid": "008712",
    "code": "ANTH1003W",
    "subject": "ANTH",
    "number": "1003",
    "honors": false,
    "writing": true,
    "name": "Understanding Cultures",
    "fullname": "Understanding Cultures",
    "info": "Introduction to social and cultural anthropology. Comparative study of societies and cultures around the world. Topics include adaptive strategies, economic processes, kinship, marriage, and gender, social stratification, politics and conflicts, religion and ritual, and personality and culture.",
    "prereq": {}
  },
  {
    "uid": "787786",
    "code": "ANTH1005W",
    "subject": "ANTH",
    "number": "1005",
    "honors": false,
    "writing": true,
    "name": "Cultural Diversity/World Sys",
    "fullname": "Introduction to Cultural Diversity and the World System",
    "info": "Anthropology of cultural diversity, in the United States and around the world. Comparative study of relationship between local cultures and global processes. Race/ethnicity, economic/social organization, political/religious systems, gender, social change.",
    "prereq": {}
  },
  {
    "uid": "816932",
    "code": "ANTH1101",
    "subject": "ANTH",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Imagining Asian America",
    "fullname": "Imagining Asian America",
    "info": "What are the histories, cultures, and experiences of Asian Americans, the fastest-growing group in the United States? How do they fit into the U.S.'s history of immigration, race, and citizenship? Is the \"model minority\" myth really true? This course is an introduction to Asian American Studies, an interdisciplinary field that uses ethnography, literature, histories, films, memoirs, and other texts to study how the history of Asian immigration to the United States has visibly shaped existing Asian American communities and identities, and how “Asian America” is central to a more general understanding of American popular culture and public life.\n\nThe course is roughly organized chronologically. We will first begin with an introduction to the field of Asian American Studies by asking the questions: What is Asian America? What is Asian American Studies? We will then examine important concepts, categories, and processes before exploring the rich history of Asian migration to the United States and contemporary issues facing Asian Americans today.\n\nOne of the core principles of this course is to encourage active and interdisciplinary learning. This means that we will be learning in a variety of ways to explore and understand the material (reading, writing, watching, listening, seeing, discussing, presenting). We will be drawing from a wide range of disciplines (history, law, sociology, education, cultural studies, psychology, etc.). And we will be using a variety of materials (memoir, scholarly articles, historical documents, government records, newspapers, films, photographs, popular culture, etc.) Your active participation in these activities is essential.",
    "prereq": {}
  },
  {
    "uid": "016266",
    "code": "ANTH1111",
    "subject": "ANTH",
    "number": "1111",
    "honors": false,
    "writing": false,
    "name": "Human Origins",
    "fullname": "Human Origins",
    "info": "World prehistory as investigated by anthropologists. Methods/concepts used to study prehistoric human biological/cultural development.",
    "prereq": {}
  },
  {
    "uid": "788396",
    "code": "ANTH1902",
    "subject": "ANTH",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "803826",
    "code": "ANTH1903",
    "subject": "ANTH",
    "number": "1903",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "788191",
    "code": "ANTH1904",
    "subject": "ANTH",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "790185",
    "code": "ANTH1905",
    "subject": "ANTH",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Human Evolution in Poplr Media",
    "fullname": "Human Evolution in Popular Media",
    "info": "Popular media is filled with portrayals of humanity's past and our potential futures. Diet influencers and cookbooks tell us to follow the paleodiet or eat raw foods assuming that is what our ancestors ate. Movies like Jurassic World depict humans living alongside dinosaurs and suggest that modern technology could bring back extinct species. TV shows like Ancient Aliens tell us that extraterrestrials have influenced our evolution, while comic books like The X-Men and The Incredible Hulk suggest that DNA modification could give humans extraordinary abilities. In this seminar we will explore representations of human evolution in popular media and assess how accurately (or not) these depictions reflect the current scientific consensus. Through critical reading, discussions, and engagement with several forms of media, such as films, documentaries, and tv shows, we will learn how our species arose, which evolutionary mechanisms still impact us today, and how misconceptions about evolution as depicted in popular culture influence our ideas about the present and future of humans. \n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "795905",
    "code": "ANTH1906W",
    "subject": "ANTH",
    "number": "1906",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary. See Course Guide.",
    "prereq": {}
  },
  {
    "uid": "791110",
    "code": "ANTH1907W",
    "subject": "ANTH",
    "number": "1907",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "790186",
    "code": "ANTH1908W",
    "subject": "ANTH",
    "number": "1908",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "788059",
    "code": "ANTH1909W",
    "subject": "ANTH",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "791123",
    "code": "ANTH1910W",
    "subject": "ANTH",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "817195",
    "code": "ANTH1911W",
    "subject": "ANTH",
    "number": "1911",
    "honors": false,
    "writing": true,
    "name": "Changing Human Adaptations",
    "fullname": "Changing Human Adaptations",
    "info": "Humans, like other species, are integral to the ecology of the earth. We display a series of adaptations that allow us to eat, grow, find mates, and raise offspring. Do humans have a fundamental ecological niche? How have humans adapted to climate change over time and space, for example, as we spread out of Africa, into Eurasia and then into the Americas?  We consider how climate, environmental, and habitat reconstructions are made by scientists; and how diets, food acquisition strategies, geographic distribution, and social structure are known to paleoanthropologists.  We consider changes in the human gut, tooth size, body size, and social behaviors. We also explore how long humans have made a significant impact on the environment, via hunting and overhunting, planting food, population growth and greenhouse gas emissions. When did the \"Anthropocene\" begin?  ",
    "prereq": {}
  },
  {
    "uid": "817030",
    "code": "ANTH1912",
    "subject": "ANTH",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Time: Now and Then",
    "fullname": "Time: Now and Then",
    "info": "The topic of the class is “time” and our goal will be to understand how time is far more complicated than we might think. Indeed, time is a problem for us: as an experience, as a way of explaining the material world, and as a political and historical phenomenon. Though we cannot go back in time, human experiences of time are not linear or straightforward: memory, prediction, nostalgia, boredom, and regret on the one hand and myth, fantasy, hope, and science fiction on the other, pull us back and forth across time lines and scales. Physicists tell us that time is relative, that it is not a thing or a happening, that it may simply be our name for a structure we cannot comprehend. Meanwhile, in the historical time of Earth, different cultural traditions have experienced, explained, and used time in radically different ways. Moreover, as Europeans colonized the globe, encounters between different kinds of time have produced political effects that remain at the center of conflict, exchange, and inequalities. This course takes an anthropological perspective on time, drawing additionally on readings from history and geography to explore why it is we find time so very troublesome.",
    "prereq": {}
  },
  {
    "uid": "817058",
    "code": "ANTH1913",
    "subject": "ANTH",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "Race and the Making of Humans",
    "fullname": "Race and the Making of Humans",
    "info": "When Barack Obama was elected president of the United States, the first black man to hold such office, many people proclaimed our society to be \u0093post-racial.\u0094 Simultaneously, the Supreme Court still routinely adjudicates cases relating to affirmative action, considering the value and meaning of diversity in our schools, while laws prohibit \u0093hate crimes.\u0094 The racial wealth gap, especially between the categories of \u0093black\u0094 and \u0093white,\u0094 has not declined but rather has tripled over the past twenty-five years. The US Census now allows respondents to check all the boxes that apply regarding race/ethnicity rather than just one. What is race, exactly, and what does the category mean? If race is one of the major ways we mark difference and hierarchy, should we recognize racial diversity or not? What good is race anyway?",
    "prereq": {}
  },
  {
    "uid": "817970",
    "code": "ANTH1914W",
    "subject": "ANTH",
    "number": "1914",
    "honors": false,
    "writing": true,
    "name": "American Cinema & Roots Music",
    "fullname": "From \"O Brother Where Art Thou?\" to \"12 Years a Slave\": American Cinema and American Roots Music",
    "info": "This seminar focuses on the ways in which popular culture (movies and other visual media) presents and comments upon southern American \"roots\" music. Although the music had deep roots in the American past, it also underwent dramatic transformations with the coming of industrial capitalism to the South and as a result of the commercial recording process itself, especially in the 1920s. This music continues to shape popular music today, and it continues to be a focus of cinematic attention. In this seminar we will focus on three sets of issues. First, we will consider the music in terms of the historical contexts that shaped it. Second, we will consider the question of how popular cinema and documentary films interpret (in sometimes problematic ways) this music, and what the politics of those representations might be. Third, we will attempt to understand musical genres and the movies in which they are featured in relation to the production of race, class and gender, and the experience of inequality in the United States.",
    "prereq": {}
  },
  {
    "uid": "825207",
    "code": "ANTH1915",
    "subject": "ANTH",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "Futuristics",
    "fullname": "Futuristics: Bio-cultural Futures of our Species",
    "info": "The Futuristics seminar is organized around a single unifying question: what is the bio-cultural future of humanity? We will seek answers to that question by focusing on major technological, biological, and social domains, and speculating about how these areas will change in the next 20-50 years, and how those changes will impact our species. Major themes will include future biological evolution, genetic engineering, artificial intelligence and computer-human interfaces, climate change, the global and digital economy, education, and space. Students will explore the generative tension between creative and rigorous prediction, and learn basic methods researchers use to model the future. The seminar culminates in discussion and writing of speculative fiction that imagines possible futures of our species based on current evidence and forecasts. ",
    "prereq": {}
  },
  {
    "uid": "818060",
    "code": "ANTH1917",
    "subject": "ANTH",
    "number": "1917",
    "honors": false,
    "writing": false,
    "name": "Racism, Anti-Racism & America",
    "fullname": "Racism, Anti-Racism, and the American Dream",
    "info": "Is racism integral, or antithetical, to the American dream? To what degree has its promise of freedom and prosperity rested on the exclusion of Indigenous, Black and other People of Color from those opportunities? Have white Americans achieved its promise of freedom and prosperity at the expense of others? Or, has the dream been perverted by the exclusion of Black, Indigenous and People of Color to what Martin Luther King described as ?a lonely island of poverty in the midst of a vast ocean of material prosperity?? Moreover, to what extent have Americans resisted their exclusion or the exclusion of others from the promise of the Dream? Given that in the contemporary moment, inequality in the US has surpassed that of the Great Depression, what do these fractures and contestations in the American Dream mean for a larger society experiencing rampant precarity writ large? This pair of seminars (ANTH 1917 and HIST 1917) explores these questions in dialogue, occasionally meeting together and with a larger group of seminars connected to the College of Liberal Arts?s ?Living and Learning in the Land of 10,000 Perspectives? Civic Readiness Initiative. We believe that this cross-fertilization is critical because the fault-lines of inequality have precisely cohered to these structural formations and categories of analysis, i.e. race and racism. Moreover, an interdisciplinary approach (through anthropology and history) is crucial for examining the contested nature, historical contexts, and contemporary investments of the American Dream.",
    "prereq": {}
  },
  {
    "uid": "818994",
    "code": "ANTH1918",
    "subject": "ANTH",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "Justice?",
    "fullname": "Justice?",
    "info": "What is justice, and how do we know it?  Where does it begin and end? And, who gets to decide? Is justice a stable concept that can be applied universally, or a socially constructed (and therefore unstable) category that should only be approached in contextually specific ways?\n\nThis course takes an interdisciplinary approach to the concept of justice. Students will be exposed to a variety of texts - in philosophy, political science and economy, religion, anthropology, literature and law – and contexts from which conceptions of justice have emerged and/or been challenged. As the title of this course, suggests, students will not merely be tracing the history and development of \"justice,\" but also identifying and interrogating its conceptual limits. \n",
    "prereq": {}
  },
  {
    "uid": "818901",
    "code": "ANTH1919",
    "subject": "ANTH",
    "number": "1919",
    "honors": false,
    "writing": false,
    "name": "Biology of Human Diversity",
    "fullname": "Biology of Human Diversity",
    "info": "This course explores the biological dimensions across which modern humans differ. Of all primate species, Homo sapiens has, by far, the greatest distribution, inhabiting nearly every part of the terrestrial earth. Variation within our species is both substantial and complex. Widely dispersed populations tend to differentiate through the process of adaptation to local environments and the accumulation of random genetic changes. However, complex patterns of gene exchange and culturally-mitigated migration can overwrite endemic variation, keeping our species genetically integrated and leaving traces of the prehistoric spread of populations around the world. We explore what it means to be human by examining the diversity of biological adaptations within our species. What features are unique to certain populations? What features unite us as a species? We will also work through the complex issues related to concepts of human race, and discuss the biological underpinnings of human variation.",
    "prereq": {}
  },
  {
    "uid": "811612",
    "code": "ANTH2006",
    "subject": "ANTH",
    "number": "2006",
    "honors": false,
    "writing": false,
    "name": "Humans and Aliens",
    "fullname": "Humans and Aliens: Learning Anthropology through Science Fiction",
    "info": "Science Fiction has been one of the most popular genres of literature over the last century and a half. Despite its great popularity, however, many fans of the genre do not realize how much it has in common with the discipline of Anthropology. Anthropology is the study of what it means to be human in all times and places. Science fiction, for its part, explores human existence in equally diverse contexts, except that those imagined contexts frequently have not yet happened. Despite this similarity, anthropology is extremely poorly known compared to science fiction. This course uses the stimulating and entertaining literature of science fiction to expose students to anthropology who, having never been exposed to it in high school, are likely to leave university without learning the power of the discipline’s perspective on humanity. Through individual pairings of anthropology texts and science fiction stories, the course explores the relevance of biological anthropology, social anthropology, linguistic anthropology, and archaeology to humanity’s future. The course’s juxtaposition of anthropological literature to science fiction stories is designed to provide students with the ability to see how our future is more dependent on how humanity works (as anthropology understands it), than merely what the next technological invention has to offer us.  \n\tThis course introduces students to the breadth of anthropological topics using the literature of such award-winning science fiction (SF) authors as Isaac Asimov, Elisabeth Bear, Jerome Bixby, Octavia Butler, Ted Chiang, Arthur C. Clarke, Philip K. Dick, Robert Heinlein, Frank Herbert, Ursula K. Le Guin, Catherine Moore, Mike Resnik, Kim Stanley Robinson, Neil Stephenson, James Tiptree, Jr., and Kurt Vonnegut. While the course is not designed to cover the literary criticism of SF literature nor the social analysis of the SF community of readers and authors, the choice of which SF authors to oppose to select anthropological topics was shaped by my understanding of the historical development of SF literature. Students will thus read stories written from the Golden Age of magazine SF to the most recent post-cyberpunk novelists. The selection of SF stories is of course idiosyncratic but it is designed to reflect the goal of learning something of anthropology while having a blast reading SF.  \n",
    "prereq": {}
  },
  {
    "uid": "008713",
    "code": "ANTH3001",
    "subject": "ANTH",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Intro to Archaeology",
    "fullname": "Introduction to Archaeology",
    "info": "Archaeology is the study of humans in the past, primarily through the material remains they left behind. It seeks to answer fundamental questions, such as “When did humans first become dependent on fire?”, “What factors led to the development of agriculture?”, or “How can we explain the rise and fall of early civilizations?”  The study of each of these big questions relies on answering many small questions that are asked in the context of archaeological excavations and laboratory analyses.  A common theme underlies them: archaeology aims to reconstruct and understand why past human cultures changed.\n\nThe goal of this class is to provide an understanding of the methods and techniques used by archaeologists in their investigations.  It includes not only hands-on learning of specific analytical techniques, such as faunal and lithic analysis as well as site survey and excavation strategies, but also focuses on the theoretical approaches that guide the questions we ask and the methods we apply to answer them.  This class, therefore, prepares students for more upper-level classes in archaeology.  It also leads to a new way of thinking.  This way of thinking is primarily critical and analytical.  It leads one to think about how data are interpreted, and how theoretical frameworks as well as innate biases color these interpretations.  Seeking solutions to interpretive problems requires the creative application of multidisciplinary approaches.  Therefore, the study of archaeology leads to a new way of thinking about and doing science.",
    "prereq": {}
  },
  {
    "uid": "795413",
    "code": "ANTH3002",
    "subject": "ANTH",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Sex, Evolution, and Behavior",
    "fullname": "Sex, Evolution, and Behavior:  Examining Human Evolutionary Biology",
    "info": "Methods/theories used to understand humans in an evolutionary framework.  What can be known only, or primarily, form an evolutionary perspective.  How evolutionary biology of humans might lead to better evolutionary theory. How physiology, development, behavior, and ecology coordinate/co-evolve in humans.",
    "prereq": {}
  },
  {
    "uid": "008714",
    "code": "ANTH3003",
    "subject": "ANTH",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Cultural Anth",
    "fullname": "Cultural Anthropology",
    "info": "Topics vary. Field research. Politics of ethnographic knowledge. Marxist/feminist theories of culture. Culture, language, and discourse. Psychological anthropology. Culture/transnational processes.",
    "prereq": {}
  },
  {
    "uid": "794967",
    "code": "ANTH3004",
    "subject": "ANTH",
    "number": "3004",
    "honors": false,
    "writing": false,
    "name": "Controversies in Anthropology",
    "fullname": "Great Controversies in Anthropology",
    "info": "Notable controversies in anthropology: Is human \"reason\" the same in all cultures? What makes up evidence/truth when we study people? Whose \"voices\" should be heard?  Should anthropologists support contemporary attempts at economic 'development\"? Is it possible to agree on a set of universal individual or cultural rights?  Can we make qualitative judgments about cultures? What civic/political responsibilities does the anthropologist have at home and with the people whom she or he studies? In-class debates.",
    "prereq": {}
  },
  {
    "uid": "008717",
    "code": "ANTH3005W",
    "subject": "ANTH",
    "number": "3005",
    "honors": false,
    "writing": true,
    "name": "Language, Culture, and Power",
    "fullname": "Language, Culture, and Power",
    "info": "Studying language as a social practice, students transcribe and analyze conversation they record themselves and consider issues of identity and social power in daily talk.",
    "prereq": {}
  },
  {
    "uid": "811613",
    "code": "ANTH3006",
    "subject": "ANTH",
    "number": "3006",
    "honors": false,
    "writing": false,
    "name": "Humans and Aliens",
    "fullname": "Humans and Aliens: Learning Anthropology through Science Fiction",
    "info": "Science Fiction has been one of the most popular genres of literature over the last century and a half. Despite its great popularity, however, many fans of the genre do not realize how much it has in common with the discipline of Anthropology. Anthropology is the study of what it means to be human in all times and places. Science fiction, for its part, explores human existence in equally diverse contexts, except that those imagined contexts frequently have not yet happened. Despite this similarity, anthropology is extremely poorly known compared to science fiction. This course uses the stimulating and entertaining literature of science fiction to expose students to anthropology who, having never been exposed to it in high school, are likely to leave university without learning the power of the discipline’s perspective on humanity. Through individual pairings of anthropology texts and science fiction stories, the course explores the relevance of biological anthropology, social anthropology, linguistic anthropology, and archaeology to humanity’s future. The course’s juxtaposition of anthropological literature to science fiction stories is designed to provide students with the ability to see how our future is more dependent on how humanity works (as anthropology understands it), than merely what the next technological invention has to offer us.  \n\tThis course introduces students to the breadth of anthropological topics using the literature of such award-winning science fiction (SF) authors as Isaac Asimov, Elisabeth Bear, Jerome Bixby, Octavia Butler, Ted Chiang, Arthur C. Clarke, Philip K. Dick, Robert Heinlein, Frank Herbert, Ursula K. Le Guin, Catherine Moore, Mike Resnik, Kim Stanley Robinson, Neil Stephenson, James Tiptree, Jr., and Kurt Vonnegut. While the course is not designed to cover the literary criticism of SF literature nor the social analysis of the SF community of readers and authors, the choice of which SF authors to oppose to select anthropological topics was shaped by my understanding of the historical development of SF literature. Students will thus read stories written from the Golden Age of magazine SF to the most recent post-cyberpunk novelists. The selection of SF stories is of course idiosyncratic but it is designed to reflect the goal of learning something of anthropology while having a blast reading SF.  \n",
    "prereq": {}
  },
  {
    "uid": "795397",
    "code": "ANTH3008",
    "subject": "ANTH",
    "number": "3008",
    "honors": false,
    "writing": false,
    "name": "Introduction to Flintknapping",
    "fullname": "Introduction to Flintknapping",
    "info": "Hands-on experience in replication of prehistoric stone tools as basis for archaeological analysis and as art form in itself.",
    "prereq": {}
  },
  {
    "uid": "008716",
    "code": "ANTH3009",
    "subject": "ANTH",
    "number": "3009",
    "honors": false,
    "writing": false,
    "name": "Pathways to Civilization",
    "fullname": "Prehistoric Pathways to World Civilizations",
    "info": "How did complex urban societies first develop? This course addresses this question in ten regions of the world including Maya Mesoamerica, Inca South America, Sumerian Near East, Shang Civilization in East Asia, and early Greece and Rome.",
    "prereq": {}
  },
  {
    "uid": "008732",
    "code": "ANTH3010",
    "subject": "ANTH",
    "number": "3010",
    "honors": false,
    "writing": false,
    "name": "Native NA-Regional",
    "fullname": "Native North Americans in Regional Perspective",
    "info": "An in-depth cultural and historical survey of native peoples who inhabit a particular region of North American (e.g., the greater southwest, prairie/woodland transition zone, Great Lakes area, Northwest coast, etc.).",
    "prereq": {}
  },
  {
    "uid": "008728",
    "code": "ANTH3011",
    "subject": "ANTH",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "Arch- Ancnt Nr East",
    "fullname": "Archaeology of the Ancient Near East",
    "info": "Development of culture and society in ancient Near East from beginnings of agriculture and settled village life to first states and up to the threshold of imperialism (10,000 to 2,000 B.C.).",
    "prereq": {}
  },
  {
    "uid": "801374",
    "code": "ANTH3015W",
    "subject": "ANTH",
    "number": "3015",
    "honors": false,
    "writing": true,
    "name": "Evolution of Language",
    "fullname": "Biology, Evolution, and Cultural Development of Language & Music",
    "info": "Language is the most human form of behavior, and the investigation of the ways language and culture interact is one of the most important aspects of the study of human beings. The most fascinating problem in this study is how language itself may have evolved as the result of the interaction between biological and cultural development of the human species. In this course we will consider the development of the brain, the relationship between early hominins, including Neanderthals and modern humans, and such questions as the role of gossip and music in the development of language.",
    "prereq": {}
  },
  {
    "uid": "826042",
    "code": "ANTH3016",
    "subject": "ANTH",
    "number": "3016",
    "honors": false,
    "writing": false,
    "name": "African Archaeology",
    "fullname": "Africa and African Diaspora Archaeology",
    "info": "\tAfrica and African Diaspora Archaeology (AFRO/ ANTH 3016/5016) examines the evolution of human behavior in Africa and looks at subsequent social, cultural, and technological developments as shown in archaeological records including artifacts, ecofacts, rock art, and structures at archaeological sites. It also discusses methods used to identify archaeological records and how these records can be used to reconstruct past ways of life. Students will obtain hand-on-experience in identifying, classifying, and interpreting archaeological objects. The course covers Africa from around 2.6 million years ago to the recent past, focusing primarily on the last 10,000 years. It examines the development and spread of food production, pottery, metallurgy, trade, and African connections with the Atlantic world dating back to the fifteenth century. ",
    "prereq": {}
  },
  {
    "uid": "008730",
    "code": "ANTH3017",
    "subject": "ANTH",
    "number": "3017",
    "honors": false,
    "writing": false,
    "name": "Ppls/Cultrs- Mid Am",
    "fullname": "Peoples and Cultures of Middle America",
    "info": "Indian and Mestizo (Hispanic) cultures of Mexico and Guatemala and parts of Belize, Honduras, and Nicaragua. Describes both pre-Hispanic and Hispanic influences, with attention to area-wide patterns and local traditions.",
    "prereq": {}
  },
  {
    "uid": "008731",
    "code": "ANTH3019",
    "subject": "ANTH",
    "number": "3019",
    "honors": false,
    "writing": false,
    "name": "Hisp Cult of Lat Am",
    "fullname": "Hispanic Cultures of Latin America",
    "info": "Hispanic cultures from Mexico to South America. Economy, underdevelopment. The family and ritual kinship. Gender, religion, values, ideology, and change. Continuity/change. ",
    "prereq": {}
  },
  {
    "uid": "008733",
    "code": "ANTH3020",
    "subject": "ANTH",
    "number": "3020",
    "honors": false,
    "writing": false,
    "name": "Topics/Anth Africa",
    "fullname": "Topics in the Anthropology of Africa",
    "info": "Perspectives on Africa using ethnographic methods and theories. Topics such as kinship and gender; ecological adaptations; economic systems; belief systems; political organization; art and aesthetics; Islamicization; colonization; liberation movements and nationalism; culture change.",
    "prereq": {}
  },
  {
    "uid": "791477",
    "code": "ANTH3021W",
    "subject": "ANTH",
    "number": "3021",
    "honors": false,
    "writing": true,
    "name": "Anthropology: The Middle East",
    "fullname": "Anthropology of the Middle East",
    "info": "Anthropological methods of analyzing/interpreting Middle Eastern cultures/societies.",
    "prereq": {}
  },
  {
    "uid": "798889",
    "code": "ANTH3022W",
    "subject": "ANTH",
    "number": "3022",
    "honors": false,
    "writing": true,
    "name": "Dreaming and Myth",
    "fullname": "Anthropology of Dreaming and Myth",
    "info": "What is universal in dreaming/myth, how they vary in different cultures. Influence of dreams on myths. Appearance of folk narratives and cultural symbols in dreams. Relationship between individual and culture.  Symbolism, metaphor, metonymy, other tropes common to dreaming/myth. Underlying psychological processes. Papers by anthropologists, case studies, cultural examples.",
    "prereq": {}
  },
  {
    "uid": "008734",
    "code": "ANTH3023",
    "subject": "ANTH",
    "number": "3023",
    "honors": false,
    "writing": false,
    "name": "Cult/Soc of  India",
    "fullname": "Culture and Society of India",
    "info": "Contemporary society and culture in South Asia from an anthropological perspective with reference to nationalism; postcolonial identities; media and public culture; gender, kinship and politics; religion; ethnicity; and the Indian diaspora.",
    "prereq": {}
  },
  {
    "uid": "008735",
    "code": "ANTH3025",
    "subject": "ANTH",
    "number": "3025",
    "honors": false,
    "writing": false,
    "name": "Pacific Island Societies",
    "fullname": "Pacific Island Societies",
    "info": "Geography, prehistory, and Western exploration of Pacific Islands from Hawaii to Papua New Guinea. Culture change as these peoples become incorporated into the modern world system. Topics in regional ethnology. Relationship of societies to major issues in anthropological thought.\n\nprereq: 1003 or 1005 or 3003 or  instr consent",
    "prereq": {
      "or": [
        "008712",
        "787786",
        "008714"
      ]
    }
  },
  {
    "uid": "008736",
    "code": "ANTH3027W",
    "subject": "ANTH",
    "number": "3027",
    "honors": false,
    "writing": true,
    "name": "Arch. of Prehistoric Europe",
    "fullname": "Archaeology of Prehistoric Europe",
    "info": "How archaeologists analyze/interpret artifacts to develop knowledge about formation of European society, from earliest evidence of human occupation to Roman period.",
    "prereq": {}
  },
  {
    "uid": "788202",
    "code": "ANTH3028",
    "subject": "ANTH",
    "number": "3028",
    "honors": false,
    "writing": false,
    "name": "Historical Archaeology",
    "fullname": "Historical Archaeology",
    "info": "In this course, we will explore the theories and methods of historical archaeology – such as material culture studies, landscape perspectives, archival, and oral historical interpretation - as a means of intervening in contemporary discussions of diversity in the United States. Historical archaeology can be a very effective means to challenge some of the standard American narratives about our diverse past. Our aim is to move beyond either a simplistic ethnic pluralism or the superficial “melting pot” progressive history and instead grapple with the materiality of settler colonialism, white supremacy, and capitalism.\n\nIn learning about this field, we will consider what has distinguished historical archaeology from American archaeology more broadly, and how those differences are parlayed into specific research strengths. This includes several themes: colonialism; the modern world and globalizing economies; intersectional identities (race and ethnicity, class, sex and gender, religion, age, ability/disability) and social movements; public memory and commemoration; landscapes and social space; citizenship and subjectivity. Although historical archaeology until recently has been restrictively defined as addressing the European-colonized New World, the discipline in the past twenty years has significantly broadened its scope and impact on the practice of archaeology as a whole. Throughout the course we will discuss these developments, and what directions archaeology may take in the future as a result. Course work includes both reading/discussion and learning methods through practical exercises, and handling of archaeological material.\n",
    "prereq": {}
  },
  {
    "uid": "008738",
    "code": "ANTH3031",
    "subject": "ANTH",
    "number": "3031",
    "honors": false,
    "writing": false,
    "name": "After Communism",
    "fullname": "Altering States: After Communism",
    "info": "Post-socialist transitions in Central/Eastern Europe from anthropological perspective. Daily life under socialism. Collapse of socialist rule in relation to key areas of social life such as gender, identity, nationalism, and ethnicity.",
    "prereq": {}
  },
  {
    "uid": "800621",
    "code": "ANTH3033",
    "subject": "ANTH",
    "number": "3033",
    "honors": false,
    "writing": false,
    "name": "Introduction to Folklore",
    "fullname": "Introduction to Folklore",
    "info": "Ethnographic study of folklore. Folktales, myths, foodways, music, material arts, personal narratives, magic, legends, drama, and traditions from a wide range of periods, cultures, and regions. Readings, lectures, videos, projects.",
    "prereq": {}
  },
  {
    "uid": "808417",
    "code": "ANTH3034W",
    "subject": "ANTH",
    "number": "3034",
    "honors": false,
    "writing": true,
    "name": "Roots Music in America",
    "fullname": "Roots Music in American Culture and Society",
    "info": "This course focuses on aspects of southern American vernacular music that came to public attention in the 1920s and 1930s as commercial recordings and field recordings of rural music became available. Although the music had deep roots in the American past, it also underwent dramatic transformations as a result of the coming of industrial capitalism to the south and as a result of the commercial recording process itself. This music continues to profoundly shape popular music today. We will try to consider as many questions as possible during the semester, but we will focus especially on three sets of issues. First, we will consider the music in terms of the historical contexts that shaped it. Second, we will consider the cultural politics surrounding the music as we focus on question of how historical narratives, popular media and popular perceptions, and scholarly works represent and interpret (in often problematic ways) certain genres of popular music and what the politics of those representations might be; and we will consider also how we listen to ?roots music,? how our listening is shaped by contemporary social and political circumstances. Third, we will attempt to understand musical genres in relation to the production of race and class and the experience of racial and class inequalities in the United States, and this may in turn prompt us to think critically about the idea of musical genre itself.",
    "prereq": {}
  },
  {
    "uid": "788054",
    "code": "ANTH3035",
    "subject": "ANTH",
    "number": "3035",
    "honors": false,
    "writing": false,
    "name": "Anthropologies of Death",
    "fullname": "Anthropologies of Death",
    "info": "Anthropological perspectives on death. Diverse understandings of afterlife, cultural variations in death ritual, secularization of death in modern era, management of death in medicine, cultural shifts/conflicts in what constitutes good or natural death.",
    "prereq": {}
  },
  {
    "uid": "801406",
    "code": "ANTH3036",
    "subject": "ANTH",
    "number": "3036",
    "honors": false,
    "writing": false,
    "name": "The Body in Society",
    "fullname": "The Body in Society",
    "info": "Body-related practices throughout the world. Readings, documentaries, mass media.",
    "prereq": {}
  },
  {
    "uid": "825788",
    "code": "ANTH3037",
    "subject": "ANTH",
    "number": "3037",
    "honors": false,
    "writing": false,
    "name": "Food Sovereignty in Africa",
    "fullname": "Food Sovereignty in Africa",
    "info": "\"Food Sovereignty in Africa\" critically evaluates how the physical environment and historical processes shaped agricultural productivity in Africa, as well as exploring the subsequent relationship the continent has had with the rest of the world. The course uses multi-disciplinary resources to examine historical factors that have contributed to contemporary food security issues, and discusses grassroots food movements that embrace the ethics and values of African societies in their efforts to  achieve both food security and environmental sustainability. It also examines the interplay between  food security, indigenous knowledge, and environmental sustainability by comparing various  standpoints on African food production, scrutinizing the challenges the continent is facing and the unique perspectives it offers in terms of agricultural development in the globalized world. Finally, the  course examines how agricultural systems in Africa are affected by the new global land rush. After  taking the course, students will have better knowledge of emerging research directions on Africa and  will be equipped with sufficient research and practical skills to pursue independent studies beyond the  classroom.  \n",
    "prereq": {}
  },
  {
    "uid": "008995",
    "code": "ANTH3041",
    "subject": "ANTH",
    "number": "3041",
    "honors": false,
    "writing": false,
    "name": "Ecological Anthropology",
    "fullname": "Ecological Anthropology",
    "info": "Concepts, theories, and methods of ecological anthropology (cultural ecology). How humans interact with biophysical environment. Compares biological/cultural interactions with environment. Examines adaptive strategies cross-culturally.\n\nprereq: 1003 or instr consent",
    "prereq": {
      "or": [
        "008712"
      ]
    }
  },
  {
    "uid": "008742",
    "code": "ANTH3043",
    "subject": "ANTH",
    "number": "3043",
    "honors": false,
    "writing": false,
    "name": "Art, Aest. and Anth",
    "fullname": "Art, Aesthetics and Anthropology",
    "info": "The relationship of art to culture from multiple perspectives including art as a cultural system; the cultural context of art production; the role of the artist in different cultures; methodological considerations in the interpretation of art across cultural boundaries.",
    "prereq": {}
  },
  {
    "uid": "793749",
    "code": "ANTH3045",
    "subject": "ANTH",
    "number": "3045",
    "honors": false,
    "writing": false,
    "name": "Religion & Culture",
    "fullname": "Religion and Culture",
    "info": "Religious beliefs and world views cross-culturally. Religious dimensions of human life through theories of origins, functions, and forms (e.g. myth, ritual, and symbolism) of religion in society.",
    "prereq": {}
  },
  {
    "uid": "798282",
    "code": "ANTH3046W",
    "subject": "ANTH",
    "number": "3046",
    "honors": false,
    "writing": true,
    "name": "Romance and Culture",
    "fullname": "Romance and Culture",
    "info": "Romance, aspects of this kind of love relationships from different perspectives in social/biological sciences. Draws on cross-cultural materials.",
    "prereq": {}
  },
  {
    "uid": "008744",
    "code": "ANTH3047W",
    "subject": "ANTH",
    "number": "3047",
    "honors": false,
    "writing": true,
    "name": "Sex, Gender & Sexuality",
    "fullname": "Anthropology of Sex, Gender and Sexuality",
    "info": "This course explores the concepts of \"sex,\" \"gender,\" and \"sexuality\" through the scholarship of feminist anthropology, queer anthropology, and their antecedents.  Students will read ethnographies that grapple with the contingent and shifting formations of these social constructions - when they emerge, disentangle, re-entangle, submerge, etc. The course will highlight the roles of imperialism, (settler) colonialism, capitalism, racism, heteropatriarchy, ableism, and other forms of social power in shaping these formations as well at the social categories - \"sex,\" \"gender,\" and \"sexuality\" - themselves.",
    "prereq": {}
  },
  {
    "uid": "817463",
    "code": "ANTH3101",
    "subject": "ANTH",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Human Biological Diversity",
    "fullname": "Human Biological Diversity",
    "info": "This course explores the many biological dimensions across which modern humans differ. Of all primate species, Homo sapiens has, by far, the greatest distribution: we inhabit nearly every part of the terrestrial earth. As a consequence, variation within our species is both substantial and complex. On one hand, widely dispersed populations tend to differentiate through the process of adaptation to local environments and the accumulation of random genetic changes. On the other hand, complex patterns of gene exchange and culturally-mitigated migration can overwrite endemic variation, keeping our species genetically integrated and leaving traces of the prehistoric spread of populations around the world. Here, we will explore what it means to be human by examining the diversity of biological adaptations within our species. What features are unique to certain populations? What features unite us as a species? We will also work through the complex issues related to concepts of human race and discuss the biological underpinnings of human variation.",
    "prereq": {}
  },
  {
    "uid": "008729",
    "code": "ANTH3143",
    "subject": "ANTH",
    "number": "3143",
    "honors": false,
    "writing": false,
    "name": "American Indian Lang/Cult",
    "fullname": "American Indian Languages and Cultures",
    "info": "Survey of cultural developments among native peoples of North American from historic times to present.",
    "prereq": {}
  },
  {
    "uid": "818189",
    "code": "ANTH3145W",
    "subject": "ANTH",
    "number": "3145",
    "honors": false,
    "writing": true,
    "name": "Urban Anthropology",
    "fullname": "Urban Anthropology",
    "info": "This class explores anthropological approaches to urban life. On one hand, the course examines the ontological nature of the city by looking into the relation between cities and their environment, and asking whether and how people differentiated \"urban\" and \"non-urban\" spaces. It uncovers the social practices and behaviors that define urban life; urban-rural distinctions; the material and ecological processes that constitute cities; and popular representations of city and/or countryside. On the other hand, the course investigates the spatial and social divisions of the city, seeking to understand the historical struggles and ongoing processes that both draw together and differentiate the people of an urban environment. It studies how cities influence decision-making, contributing to the uneven distribution of power and resources. It considers: industrialization; urban class conflict; gendered and racialized spaces; and suburbanization. Both of these approaches will also critically consider the city as a social object that we encounter and learn about through our engagement with kinds of media, such as novels and film. Hence, reading for the class will include literature from the social sciences and humanities, as well as critical works of fiction.\n\nStudents will engege with these broader anthropological issues through an investigation of several global cities, especially Minneapolis-St. Paul, Chicago, Paris, Mexico City, Brasilia, and New Delhi. The class mixes lecture, discussion, and guided research. Lectures will introduce the history of urbanism and urban anthropology. Discussions will critically examine the readings, and offer insights and examples to better understand them. By participating in a guided research project, students will uncover hidden aspects of their own city, using ethnography or archaeology to shed light on the urban environment, social struggles over space, or other themes.",
    "prereq": {}
  },
  {
    "uid": "826286",
    "code": "ANTH3147",
    "subject": "ANTH",
    "number": "3147",
    "honors": false,
    "writing": false,
    "name": "Digital Anthropology",
    "fullname": "Digital Anthropology",
    "info": "Recent developments and adoption of new digital technologies, especially smart phones, social media, and gaming, have prompted academic and popular interest in and debates about the relationship of this technology to society. Anthropologists and other social scientists have been discussing in what ways technology in its various forms interacts with human culture for many years. How does it change society? How does society define its uses and meanings? The focus of this course is the multiple ways in which digital technology affects relationships in culture and society.  We shall how digital technologies influence identity, labor practices, political strategies, among much else.  We will explore ethnographic research on digital cultures, by way of answering this question. For the most part, the course will put an emphasis on anthropological and/or ethnographically informed work, although the readings will also be interdisciplinary, drawing on relevant literature from a variety of academic disciplines in the history of communications.  ",
    "prereq": {}
  },
  {
    "uid": "809894",
    "code": "ANTH3205",
    "subject": "ANTH",
    "number": "3205",
    "honors": false,
    "writing": false,
    "name": "Pre-Columbian Art",
    "fullname": "Art of Central and South America Before Columbus",
    "info": "Art/architecture of native peoples of Americas from twelfth century B.C. until arrival of Europeans in sixteenth century. Ways that people living in diverse areas of South America/Mesoamerica used art/architecture. Tools to investigate Pre-Columbian art at more advanced levels.",
    "prereq": {}
  },
  {
    "uid": "818560",
    "code": "ANTH3206",
    "subject": "ANTH",
    "number": "3206",
    "honors": false,
    "writing": false,
    "name": "Purity and Pollution",
    "fullname": "Sex, Murder, and Bodily Discharges: Purity and Pollution in the Ancient World",
    "info": "\"Dirt is dangerous\" wrote Mary Douglas more than 50 years ago in her groundbreaking study, Purity and Danger: an Analysis of the Concept of Pollution and Taboo.  Her work has been influential in ancient Near Eastern and Mediterranean studies when dealing with issues of sacred/profane, purity/pollution, and ritual sacrifice and purification. Douglas' work provides a framework within which to understand ancients' thinking about these concepts that range from the sacredness of space and bodies to perceived pollutions cause by bodily leakage or liminal stages of life and death.  In this course, we will examine Douglas' theory in light of ancient evidence, with special attention to anceint Israelite literature (the Tanakh or Old Testament) and ancient Jewish literature (the Dead Sea Scrolls), but we will also analyze other ancient Near Eastern and Mediterranean examples of purity and pollution (from epigraphical and documentary evidence).",
    "prereq": {}
  },
  {
    "uid": "794789",
    "code": "ANTH3212",
    "subject": "ANTH",
    "number": "3212",
    "honors": false,
    "writing": false,
    "name": "Globalization and Inequality",
    "fullname": "Globalization, Markets, and Inequality",
    "info": "Globalization of American business/culture, uneven relationships between developed/underdeveloped national economies, social/economic consequences of market economies and free trade. Focuses on growing inequalities in global economy. Wall Street and transnational corporations, sweatshops, consumer culture, brand-name global marketing, mass downsizings.\n",
    "prereq": {}
  },
  {
    "uid": "008781",
    "code": "ANTH3221",
    "subject": "ANTH",
    "number": "3221",
    "honors": false,
    "writing": false,
    "name": "Field School",
    "fullname": "Field School",
    "info": "Field excavation, survey, and research. Intensive training in excavation techniques, recordation, analysis, and interpretation of archaeological materials or prehistoric remains.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "801705",
    "code": "ANTH3242W",
    "subject": "ANTH",
    "number": "3242",
    "honors": false,
    "writing": true,
    "name": "NonWestern Peoples in Movies",
    "fullname": "Hero, Savage, or Equal? Representations of NonWestern Peoples in the Movies",
    "info": "This course will explore images of nonWestern peoples and cultures as they have appeared in the movies and in other popular media. It has four aims: l) to introduce the problem of nonWestern peoples in the West from historical points of view, 2) to discuss the relationship between mass media and issue of representation to the marketplace, 3) to introduce the concept of morality in and through collective representations as developed by Durkheim, and 4) to analyze the problem of moral agency in a series of Hollywood and Independent movies which portray nonwestern peoples and cultures. We will watch movies portraying three different groups of cultures, Pacific Islanders, Native Americans, and the Japanese. In each unit, we will first read important commentary on Western representations of each of these peoples, such as Bernard Smith on Pacific Islanders and Vine Deloria on images of Native Americans and Gina Marchetti on Hollywood’s Japanese.",
    "prereq": {}
  },
  {
    "uid": "818190",
    "code": "ANTH3255",
    "subject": "ANTH",
    "number": "3255",
    "honors": false,
    "writing": false,
    "name": "The Archaeology of Religion",
    "fullname": "Archaeology of Ritual and Religion",
    "info": "The course discusses evidence for the origins of religion and its diverse roles in human societies over millennia. It focuses on how artifacts and architecture are essential to religious experience. It asks: What constitutes religion for different cultures? Why is religion at the heart of politics, social life, and cultural imagination? ",
    "prereq": {}
  },
  {
    "uid": "797547",
    "code": "ANTH3306W",
    "subject": "ANTH",
    "number": "3306",
    "honors": false,
    "writing": true,
    "name": "Medical Anthropology",
    "fullname": "Medical Anthropology",
    "info": "Relations among human affliction, health, healing, social institutions, and cultural representations cross-culturally. Human health/affliction. Medical knowledge/power. Healing. Body, international health, colonialism, and emerging diseases. Reproduction. Aging in a range of geographical settings.\n\nprereq: 1003 or 1005 or entry level soc sci course recommended",
    "prereq": {
      "or": [
        "008712",
        "787786"
      ]
    }
  },
  {
    "uid": "010136",
    "code": "ANTH3310",
    "subject": "ANTH",
    "number": "3310",
    "honors": false,
    "writing": false,
    "name": "Topics-Bio/Phys Ant",
    "fullname": "Topics in Biological and Physical Anthropology",
    "info": "Topics may include faunal analysis, the human skeleton and osteology, primate and human evolution, and forensic anthropology. Topics vary according to student and faculty interest.",
    "prereq": {}
  },
  {
    "uid": "818991",
    "code": "ANTH3327W",
    "subject": "ANTH",
    "number": "3327",
    "honors": false,
    "writing": true,
    "name": "Inca, Aztec, Maya Civilztns",
    "fullname": "Inca, Aztec & Maya Civilizations",
    "info": "This course is an intensive examination of the emergence, growth, and conquest of native civilizations in ancient America, focusing on the Maya, Aztec, and Inca states. Lectures and discussions examine the culture and history of these Native American civilizations, while also introducing students to anthropological theories of the state, religion, aesthetics, and history.",
    "prereq": {}
  },
  {
    "uid": "801575",
    "code": "ANTH3401",
    "subject": "ANTH",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Human Fossil Record",
    "fullname": "The Human Fossil Record",
    "info": "Fossil evidence paleoanthropologist's use to reconstruct human evolutionary history. Taxonomy, phylogeny, behavior, ecology, tool use, land use, biogeography. Hands-on examination of fossil casts, readings from primary/secondary professional sources.\n\nprereq: ANTH 1001 or instr consent",
    "prereq": {
      "or": [
        "008711"
      ]
    }
  },
  {
    "uid": "805438",
    "code": "ANTH3402",
    "subject": "ANTH",
    "number": "3402",
    "honors": false,
    "writing": false,
    "name": "Zooarchaeology Laboratory",
    "fullname": "Zooarchaeology Laboratory",
    "info": "How archaeologists reconstruct past societies, diets, and environments. Bones and bone fragments to skeletal element (e.g., femur, humerus, tibia), side, age, and taxon (e.g., horse, bison, antelope, hyena). Adaptations and functional morphology of animals? anatomy. Tool marks, tooth marks, burning, and types of bone breakage. Past societies' hunting, sharing, cooking practices as well as environmental reconstruction using vertebrates.",
    "prereq": {}
  },
  {
    "uid": "803009",
    "code": "ANTH3405",
    "subject": "ANTH",
    "number": "3405",
    "honors": false,
    "writing": false,
    "name": "Human Skeletal Analysis",
    "fullname": "Human Skeletal Analysis",
    "info": "Structure, design, and variability of modern human skeleton. Anatomy, functional morphology, development, evolutionary history. Bone histology/biology, excavation/preservation, taphonomy, pathology, forensic analyses. Differentiating between males/females, adults/sub-adults, and humans/non-humans.",
    "prereq": {}
  },
  {
    "uid": "816048",
    "code": "ANTH3501",
    "subject": "ANTH",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Managing Museum Collections",
    "fullname": "Managing Museum Collections",
    "info": "This course provides a hands-on and research experience in collections management utilizing artifact, archival, and digital collections. Museum collections, the objects or specimens they contain, the information associated with them, and their care and maintenance are a crucial part of both the sciences and the humanities. While seemingly disparate, many of the issues faced by those responsible for collections are quite similar: how to preserve and care for those collections, legal issues surrounding the materials they contain, how to organize and classify the items, how to facilitate discovery and access, and how to make the information contained in them available to the broadest audience possible. The course includes lectures by museum professionals, hands-on activities and selected readings.\n\nCredit will not be granted if credit has been received for ANTH 5501.",
    "prereq": {}
  },
  {
    "uid": "008737",
    "code": "ANTH3601",
    "subject": "ANTH",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "Archaeology & Native Americans",
    "fullname": "Archaeology and Native Americans",
    "info": "Historical, political, legal, and ethical dimensions of the relationship of American archaeology to American Indian people. Case studies of how representational narratives about Native people are created through archaeology; responses by Native communities; and the frameworks for collaborative and equitable archaeological practice.  Professional ethics in archaeology/heritage studies in American contexts.",
    "prereq": {}
  },
  {
    "uid": "818980",
    "code": "ANTH3631",
    "subject": "ANTH",
    "number": "3631",
    "honors": false,
    "writing": false,
    "name": "Islam in America",
    "fullname": "Islam in America: A History of the Present",
    "info": "From the \"Age of Discovery\" and the African slave trade, to Malcolm X and the War on Terror, Islam has long been an integral part of the American landscape. In this course, students will examine the history of Islam and social formation of Muslim communities in the United States. We will approach this history in the plural: as histories of Islam in America, paying particular attention to the different local and global dynamics that led to the migration of this racially, ethnically, and class variegated community. \n\nThis course will explore how racial, national, cultural, and sectarian differences within and between Muslim communities shape and challenge the notion of a singular Islam or Muslim community. We will ask how and why Islam and Muslims have been characterized - both historically and today - as a \"problem\" in/for America. What does the emergence of terminology like \"American Muslim\" and \"American Islam\" tell us about these historical tensions, conceptions of good/bad citizenship, and identity politics more broadly, in the United States today? ",
    "prereq": {}
  },
  {
    "uid": "818549",
    "code": "ANTH3896",
    "subject": "ANTH",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": {}
  },
  {
    "uid": "788795",
    "code": "ANTH3980",
    "subject": "ANTH",
    "number": "3980",
    "honors": false,
    "writing": false,
    "name": "Topics in Anthropology",
    "fullname": "Topics in Anthropology",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "008753",
    "code": "ANTH3993",
    "subject": "ANTH",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Dir Study Capstone Proj Prep",
    "fullname": "Directed Study for Capstone Project Preparation",
    "info": "The Anthropology Independent Capstone Project Planning course is the first semester in a two-semester project sequence. In this first semester course, ANTH 3993, students plan their project and carry out preliminary research in consultation with their faculty mentor. Students and faculty mentors meet throughout the semester. The resulting project typically consists of an annotated bibliography, project proposal, Interdisciplinary Review Board application if appropriate , and/or pilot study. A directed study contract between the student and faculty mentor is required for registration. \n\nprereq: [Jr or sr] anth major, instr consent",
    "prereq": {}
  },
  {
    "uid": "008992",
    "code": "ANTH4001",
    "subject": "ANTH",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Experimental Archaeology",
    "fullname": "Experimental Archaeology",
    "info": "\"Experimental Archaeology\" conjures images of Viking ship replicas setting sail and elaborate pulley systems rigged to raise megaliths. Such endeavors can yield precious insight into ancient technologies. But how can we carry out experimental archaeology in a college class? Thankfully, an infinite number of exciting archaeological experiments can easily be carried out in a well-equipped archaeological science lab. In this class, you will learn why experimental archaeology is one of the most important tools that archaeologists use to reconstruct the past. You will spend the first half of the semester reading about experimental archaeology. As the semester progresses, we will focus on pyrotechnology, which is the controlled use of fire to deliberately alter materials such as stone, clay, and metal. Pyrotechnology also includes the use of fire for cooking and heat and the resulting unintentional alteration of materials affected by these activities such as wood, bone, and sediments. During the second half of the course, you will design your own experiment. You will carry it out and analyze the results in our laboratory and present them to the class in a highly collaborative and supportive environment. Along the way you will learn the fundamental principles of good experimental design, cutting-edge methods of archaeological science, and all about pyrotechnology. ANTH 3001 or a similar introductory archaeology course is strongly recommended!",
    "prereq": {}
  },
  {
    "uid": "826661",
    "code": "ANTH4002",
    "subject": "ANTH",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Epidemics in Evolution",
    "fullname": "Epidemics in Human Evolution",
    "info": "This course examines the global human experience with health and disease through an\narchaeological and historical perspective, from the early days of our species to the present. We\nwill survey major infectious and noncommunicable diseases that have affected human\nsocieties, including tuberculosis, plague, influenza, syphilis, HIV/AIDS, and leprosy. You will\nlearn how humans have responded and adapted to many of these conditions, and how disease\norganisms have evolved in tandem. Course content examines large-scale disease and health\npatterns over time with a special focus on global pandemics and major epidemiological\ntransitions such as those brought about by the introduction of agriculture, the Age of\nExploration, colonialism, and industrialization. You will become familiar with the methods and\napproaches used by anthropologists and archaeologists to study disease in the past and how\nthese inferences influence understanding of present-day health. The course will end with a\ndiscussion of emerging health challenges such as the rise of antibiotic resistance, novel zoonotic\ndiseases, and the prevalence of health disparities.",
    "prereq": {}
  },
  {
    "uid": "008715",
    "code": "ANTH4003W",
    "subject": "ANTH",
    "number": "4003",
    "honors": false,
    "writing": true,
    "name": "Contmp Perspectives: Cul Anth",
    "fullname": "Contemporary Perspectives in Cultural Anthropology",
    "info": "This course considers issues of race, class, gender, \"culture,\" and globality across multiple genres of writing (ethnography, history, fiction, poetry, memoir). We do this by reading the work of writers who, with an ethnographic sensibility, focus on a particular person whose life is lived in obscurity, at the margins. We ask how such an approach that aims to evoke a world through a life might allow the reader to understand how people move across space and time and through their social worlds, in ways that other kinds of ethnographic or historical writing might not.\n\nprereq: [1003 or 1005],  or instr consent",
    "prereq": {
      "or": [
        "008712",
        "787786"
      ]
    }
  },
  {
    "uid": "827237",
    "code": "ANTH4004",
    "subject": "ANTH",
    "number": "4004",
    "honors": false,
    "writing": false,
    "name": "Experimental Archaeology",
    "fullname": "Experimental Archaeology",
    "info": "\"Experimental Archaeology\" conjures images of Viking ship replicas setting sail and elaborate pulley systems rigged to raise megaliths. Such endeavors can yield precious insight into ancient technologies. But how can we carry out experimental archaeology in a college class? Thankfully, an infinite number of exciting archaeological experiments can easily be carried out in a well-equipped archaeological science lab. In this class, you will learn why experimental archaeology is one of the most important tools that archaeologists use to reconstruct the past. You will spend the first half of the semester reading about experimental archaeology. As the semester progresses, we will focus on pyrotechnology, which is the controlled use of fire to deliberately alter materials such as stone, clay, and metal. Pyrotechnology also includes the use of fire for cooking and heat, and the resulting unintentional alteration of materials affected by these activities such as wood, bone, and sediments. During the second half of the course, you will design your own experiment. You will carry it out and analyze the results in our laboratory, and present them to the class in a highly collaborative and supportive environment. Along the way you will learn the fundamental principles of good experimental design, cutting-edge methods of archaeological science, and all about pyrotechnology. ANTH 3001 or a similar introductory archaeology course is strongly recommended!",
    "prereq": {}
  },
  {
    "uid": "008718",
    "code": "ANTH4007",
    "subject": "ANTH",
    "number": "4007",
    "honors": false,
    "writing": false,
    "name": "Lab Techniques - Archaelogy",
    "fullname": "Laboratory Techniques in Archaeology",
    "info": "Plant remains, material culture, faunal remains, human osteology. Emphasizes lab experience. Instructor consent required.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "805533",
    "code": "ANTH4009W",
    "subject": "ANTH",
    "number": "4009",
    "honors": false,
    "writing": true,
    "name": "Warfare and Human Evolution",
    "fullname": "Warfare and Human Evolution",
    "info": "Armed, violent conflict among groups ? warfare ? is a distinctive and devastating trait ofmany human societies. The practice of warfare brings together a number of unusualcharacteristics of our species, including the ability to cooperate, to discuss plans, and to makeand use weapons, which together combine to create immense human suffering. War has longbeen a central topic of anthropologists, who have raised many questions. Is warfare a humanuniversal? Are there truly peaceful societies? Why does war occur more often at some times andplaces than others? How, when and why did warfare evolve? What, if anything, does warfarehave to do with intergroup aggression in other animals? What role has warfare, or its moreprimitive antecedents, played in the evolution of our species? Efforts to explain war havethemselves been contentious, with some scholars arguing that war is a recent phenomenonresulting from factors such the development of agriculture, and other scholars arguing that war isan evolutionarily ancient phenomenon with roots in the common ancestor of humans andchimpanzees. In this seminar, we will read and discuss classic and recent texts on this broad andoften divisive subject. To better assess the arguments presented in survey and theoretical papers,we will read original ethnographic materials, with each student choosing one subsistence societyas the focus of their research efforts.",
    "prereq": {}
  },
  {
    "uid": "008993",
    "code": "ANTH4011",
    "subject": "ANTH",
    "number": "4011",
    "honors": false,
    "writing": false,
    "name": "Senior Seminar",
    "fullname": "Senior Seminar",
    "info": "Research seminar. Topics/methodologies differ according to staff, student interests. Students complete substantial research paper.",
    "prereq": {}
  },
  {
    "uid": "008994",
    "code": "ANTH4013W",
    "subject": "ANTH",
    "number": "4013",
    "honors": false,
    "writing": true,
    "name": "Capstone Project Writing Sem",
    "fullname": "Capstone Project Writing Seminar",
    "info": "This seminar is designed for students participating in the Anthropology Senior Capstone Project. The purpose of this seminar is to provide students with instructional support and a structured environment in which to develop their research and writing skills within the practical context of writing a senior thesis for the Capstone. The thesis is based on original research for the Senior Capstone Project conducted by students in consultation with their advisors, and it is advised that students finish conducting research before enrolling in this course. In some cases, it is possible research may continue from the planning course into this seminar.  The seminar meets once a week, during which time students engage in active learning exercises, in-class discussions, and peer review as they write their thesis. The goal of this course is to align the writing abilities of students with the writing criteria developed by departmental faculty as part of the Center for Writing’s Writing Enriched Curriculum. This course compliments student’s advisor-advisee relationship for the Senior Capstone Project, and it is required that students set up regular meetings with their advisors to discuss their progress in the course in addition to consulting about the content of their projects. \n\nprereq: sr major, instr consent",
    "prereq": {}
  },
  {
    "uid": "008719",
    "code": "ANTH4019",
    "subject": "ANTH",
    "number": "4019",
    "honors": false,
    "writing": false,
    "name": "Symbolic Anth",
    "fullname": "Symbolic Anthropology",
    "info": "Pragmatic/structural aspects of social symbolism cross-culturally. Focuses on power, exchange, social boundaries, gender, and rituals of transition/reversal.\n\nprereq: 1003 or 1005 or grad student or instr consent",
    "prereq": {
      "or": [
        "008712",
        "787786"
      ]
    }
  },
  {
    "uid": "008720",
    "code": "ANTH4021",
    "subject": "ANTH",
    "number": "4021",
    "honors": false,
    "writing": false,
    "name": "Psycho Anth",
    "fullname": "Psychological Anthropology",
    "info": "Self, emotion, cognition, and child development in cross-cultural perspective.  Examines cultural and social influences on personality, and psychological foundations of society and culture.",
    "prereq": {}
  },
  {
    "uid": "008760",
    "code": "ANTH4023W",
    "subject": "ANTH",
    "number": "4023",
    "honors": false,
    "writing": true,
    "name": "Culture Theory",
    "fullname": "Culture Theory",
    "info": "In-depth examination of key developments in the culture concept, from Darwin to present-day postmodern approaches. Examines the view that cultures have an inherent order that cannot be explained psychologically or biologically, and reactions to this view.",
    "prereq": {}
  },
  {
    "uid": "008723",
    "code": "ANTH4025",
    "subject": "ANTH",
    "number": "4025",
    "honors": false,
    "writing": false,
    "name": "Ethnogrphc Classics",
    "fullname": "Studies in Ethnographic Classics",
    "info": "Five types of explanations employed in ethnographic research: diffusionism and theory of survivals; functionalist response; British structuralists; French structuralism; interpretive turn. Problems in ethnographic practice, analysis, and writing. Focuses on several classic monographic examples and associated theoretical writing.\n\nprereq: 1003 or 1005",
    "prereq": {
      "or": [
        "008712",
        "787786"
      ]
    }
  },
  {
    "uid": "810252",
    "code": "ANTH4029W",
    "subject": "ANTH",
    "number": "4029",
    "honors": false,
    "writing": true,
    "name": "Anthropology of Social Class",
    "fullname": "Anthropology of Social Class",
    "info": "This course is divided into three parts, each of which has different, but related, purposes. The initial part has general and theoretical goals.   First, differences between cultural anthropology and sociology with respect to the study of class difference will be introduced.  Secondly, the major theories about hierarchy in pre-state society will be examined.  Third, central theories and concepts in the study of stratification in complex societies will be surveyed.  In particular, attention will be paid to the relationship between class and individual taste in the work of Pierre Bourdieu. The second part will focus on attitudes about class difference in N. American society. Topics will center on class in everyday life, with special reference to the domains of education, consumption and romantic love. The third part of the course will concern class in nonWestern and/or developing countries, specifically in the Pacific and India.  Throughout the course, in addition to readings and lectures, use will be made of representations of class in popular culture, such as magazines and the movies.",
    "prereq": {}
  },
  {
    "uid": "008725",
    "code": "ANTH4031W",
    "subject": "ANTH",
    "number": "4031",
    "honors": false,
    "writing": true,
    "name": "Anthro and Social Justice",
    "fullname": "Anthropology and Social Justice",
    "info": "Practical application of theories/methods from social/cultural anthropology. Issues of policy, planning, implementation, and ethics as they relate to applied anthropology.\n\nprereq: 1003 or 1005 or 4003 or grad student or instr consent",
    "prereq": {
      "or": [
        "008712",
        "787786",
        "008715"
      ]
    }
  },
  {
    "uid": "008727",
    "code": "ANTH4035",
    "subject": "ANTH",
    "number": "4035",
    "honors": false,
    "writing": false,
    "name": "Ethnog Rsrch Methds",
    "fullname": "Ethnographic Research Methods",
    "info": "History of and current issues in ethnographic research. Research projects, including participant observation, interviewing, research design, note taking, life history, and other ethnographic methods.\n\nprereq: 1003 or 1005 or grad student",
    "prereq": {
      "or": [
        "008712",
        "787786"
      ]
    }
  },
  {
    "uid": "008739",
    "code": "ANTH4043",
    "subject": "ANTH",
    "number": "4043",
    "honors": false,
    "writing": false,
    "name": "Archaeology of Northern Europe",
    "fullname": "Romans, Anglo-Saxons and Vikings: Archaeology of Northern Europe",
    "info": "Archaeology of the British Isles, Scandinavia, and northern continental Europe, from the Romans through the Viking Period. Themes to be examined include social and political organization, cross-cultural interaction, art and symbolism, and religion and ritual.",
    "prereq": {}
  },
  {
    "uid": "008740",
    "code": "ANTH4045",
    "subject": "ANTH",
    "number": "4045",
    "honors": false,
    "writing": false,
    "name": "Gender/Power-S Asia",
    "fullname": "Gender and Power in South Asia",
    "info": "Analysis of the politics of gender in South Asia, especially India, focusing on colonial and nationalist constructions of gender and \"tradition\"; kinship, class and gender; gender and women's speech; feminism in India; fundamentalism and postcolonial identities; gender and violence.",
    "prereq": {}
  },
  {
    "uid": "008741",
    "code": "ANTH4047",
    "subject": "ANTH",
    "number": "4047",
    "honors": false,
    "writing": false,
    "name": "Anth of Amer Culture",
    "fullname": "Anthropology of American Culture",
    "info": "Anthropological approaches to contemporary American society/culture. Tensions between market and family. Unity, diversity. Individualism, community.",
    "prereq": {}
  },
  {
    "uid": "008743",
    "code": "ANTH4049",
    "subject": "ANTH",
    "number": "4049",
    "honors": false,
    "writing": false,
    "name": "Religion and Culture",
    "fullname": "Religion and Culture",
    "info": "Our subtitle is “sacredness.” The operational presupposition of the class is that sacredness is more than a mental phenomenon: it involves objects and bodies. Modern perspectives on religion have long downplayed this “material” aspect as they privileged iconoclastic spirituality. The anthropology of religion aims to go beyond the material/spiritual opposition and asks how rituals employ objects and bodies in order to capture the effect we might call spiritual or mystical. Intellectually, this is an extremely difficult wisdom for the moderns to grasp because the binary oppositions between the spiritual and the material, between mind and the body, subtend modern society’s very sense of order and rationality. This class is successful if we can have even a glimpse of how much difficulty we moderns have in seeing beyond these binaries. \nTake, for example, sacrifice. It is almost intuitive that the human condition abides in the requisition of sacrifice: redemption is found by suffering, abundance secured by loss, and the gift of life enabled by death. Such an intuition is as universal as its practiced intent is ambiguous to us. Ambiguous because the following questions immediately rise: For whom or in whose \"eyes\" is a gesture of sacrificial offering supposed to be accounted for? If one facilitates one’s own death in the hands of one’s enemy in a redemptive gesture—which is, arguably, the case of Jesus Christ—would the enemy part of the redeemed? We will raise the most impenetrable of such questions through compelling examples in contemporary politics, such as the post-9/11 category of so-called religiously-motivated protest suicide. As Talal Asad argues, one of the reasons the \"suicide bombing\" is so disconcerting to us is not because of the extent of its violence—which is not remarkable compared to technology-driven terror tactics—but because the act violates our dearest binaries: victim/victimizer, dying/killing, means/ends, and crime/punishment. At the bottom of these binaries, as we will see in this class, is the binary opposition between materiality and spirituality. This issue will be expanded into modern society in the latter part of the class. \n\nThere are no prerequisites for this class. ",
    "prereq": {}
  },
  {
    "uid": "008745",
    "code": "ANTH4051",
    "subject": "ANTH",
    "number": "4051",
    "honors": false,
    "writing": false,
    "name": "Kin, Gend, Divers",
    "fullname": "Kinship, Gender, and Diversity",
    "info": "Cross-cultural variation in meanings, expectations, and practices related to marriage, family, sexuality and parenthood.  Applies knowledge of variations to cultural diversity and other issues in U.S. society (e.g. changing marriage and family forms, incest, reproductive rights, reproductive technology).\n",
    "prereq": {}
  },
  {
    "uid": "008746",
    "code": "ANTH4053",
    "subject": "ANTH",
    "number": "4053",
    "honors": false,
    "writing": false,
    "name": "Economic Anthropology",
    "fullname": "Economy, Culture, and Critique",
    "info": "Systems of production/distribution, especially in nonindustrial societies. Comparison, history, critique of major theories. Cross-cultural anthropological approach to material life that subsumes market/nonmarket processes.",
    "prereq": {}
  },
  {
    "uid": "008747",
    "code": "ANTH4057",
    "subject": "ANTH",
    "number": "4057",
    "honors": false,
    "writing": false,
    "name": "Politics & Law",
    "fullname": "Politics and Law",
    "info": "Problems of inequality, order and authority in nonstate as well as state-based societies.  Historical and cross-cultural survey of the concepts through which these problems have been understood. Comparative political/legal systems, featuring case studies from Africa, Burma, New Guinea, Indonesia, and the United States.\n",
    "prereq": {}
  },
  {
    "uid": "008748",
    "code": "ANTH4061",
    "subject": "ANTH",
    "number": "4061",
    "honors": false,
    "writing": false,
    "name": "Culture & Childhood",
    "fullname": "Culture and Childhood",
    "info": "Contexts, expectations, and tasks/activities of childhoo, based on case studies from diverse cultures. Application/evaluation of Western theories of child development in relation to non-Western societies. Conditions of childhood from a global perspective.",
    "prereq": {}
  },
  {
    "uid": "008749",
    "code": "ANTH4065",
    "subject": "ANTH",
    "number": "4065",
    "honors": false,
    "writing": false,
    "name": "Anthropology of Development",
    "fullname": "The Anthropology of Development",
    "info": "Anthropological contributions to development practice/theory. Anthropological analysis of development institutions. Theories of development. Case studies from several parts of world explore relation of global forces and local cultures.",
    "prereq": {}
  },
  {
    "uid": "008750",
    "code": "ANTH4067",
    "subject": "ANTH",
    "number": "4067",
    "honors": false,
    "writing": false,
    "name": "Anth-Soc Movmnts",
    "fullname": "Anthropology of Social Movements",
    "info": "Cross-cultural study of the characteristics, functions and processes of movements of social, political, religious and ecological change. Examination of method and theory in the study of such movements. Ethnographic examples in the United States, Europe, Latin America and Africa.",
    "prereq": {}
  },
  {
    "uid": "008751",
    "code": "ANTH4069",
    "subject": "ANTH",
    "number": "4069",
    "honors": false,
    "writing": false,
    "name": "Historical Ecology",
    "fullname": "Historical Ecology & Anthropology of the Environment",
    "info": "This seminar course discusses current approaches to historical ecology, the study of human-environmental relationships over time. The course draws on and combines perspectives from the four subdisciplines of anthropology (archaeological anthropology, bioarchaeological anthropology, linguistic anthropology, and sociocultural anthropology), and similar disciplines, to understand the varying ways that scholars have analyzed and defined ecologies and environmental problems. It places particular emphasis on theories that define human relationships to the environment as recursive and interdependent. These theories stand in contrast to common Western theological suppositions that see the environment as a framework to which human societies adapt or a set of resources for human communities to exploit. Rather, historical ecologists argue that the environment is a true ecology with humans in it. They contend that human communities are fundamentally and inextricably intertwined with the life cycles and needs of other species, and consequently they study how human-environmental interactions emerge through distinct historical processes and cultural circumstances.",
    "prereq": {}
  },
  {
    "uid": "008752",
    "code": "ANTH4071",
    "subject": "ANTH",
    "number": "4071",
    "honors": false,
    "writing": false,
    "name": "Race, Culture and Vision",
    "fullname": "Race, Culture, and Vision",
    "info": "Evaluation of main trends in study of racism. Psychological, sociological, symbolic, and \"critical\" approaches that treat racism as a sociodiscursive phenomenon. Racist discourse as a practice that defines an \"other\" and subjugates that other to strategies of exclusion.\n\nprereq: 1003 or 1005 or 3003 or instr consent",
    "prereq": {
      "or": [
        "008712",
        "787786",
        "008714"
      ]
    }
  },
  {
    "uid": "788055",
    "code": "ANTH4075",
    "subject": "ANTH",
    "number": "4075",
    "honors": false,
    "writing": false,
    "name": "Cultural Histories of Healing",
    "fullname": "Cultural Histories of Healing",
    "info": "Introduction to historically informed anthropology of healing practice. Shift to biologically based medicine in Europe, colonialist dissemination of biomedicine, political/cultural collisions between biomedicine and \"ethnomedicines,\" traffic of healing practices in a transnationalist world.",
    "prereq": {}
  },
  {
    "uid": "797427",
    "code": "ANTH4077",
    "subject": "ANTH",
    "number": "4077",
    "honors": false,
    "writing": false,
    "name": "Neanderthals",
    "fullname": "Neanderthals: Biology and Culture of Humanity's Nearest Relative",
    "info": "Paleontological/archaeological record. Students reconstruct behavioral similarities/differences between Neanderthals and modern humans. Why humans alone survived end of Pleistocene.\n\nprereq: 1001 or 3001 or 3002 or instr consent",
    "prereq": {
      "or": [
        "008711",
        "008713",
        "795413"
      ]
    }
  },
  {
    "uid": "819014",
    "code": "ANTH4093",
    "subject": "ANTH",
    "number": "4093",
    "honors": false,
    "writing": false,
    "name": "In-Class Capstone Project",
    "fullname": "In-Class Capstone Project",
    "info": "Course that fulfills the senior capstone requirement as an add-on directed study in association with an upper-level 4xxx-5xxx-level ANTH course. Instructor or department consent required.",
    "prereq": {}
  },
  {
    "uid": "803440",
    "code": "ANTH4101",
    "subject": "ANTH",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Decolonizing Archives",
    "fullname": "Decolonizing Archives",
    "info": "Archives are not neutral. In order to decolonize them, scholars in anthropology and other disciplines must first understand the ways in which Western settler values have structured them. Who decides acquisition policy? How are items indexed, described, and related to one another? Who has access, and under what conditions? And who is structurally excluded? In this course we decolonize by recontextualizing both the archives as institutions and their contents. In other words, we use methods appropriate for contemporary anthropological archival research. We will consider preservation, curation, organizational bias in archives, analytic scale, voice, and how historical texts are material culture. Students engage in original archival research.",
    "prereq": {}
  },
  {
    "uid": "802995",
    "code": "ANTH4103",
    "subject": "ANTH",
    "number": "4103",
    "honors": false,
    "writing": false,
    "name": "Archaeologies of Colonialism",
    "fullname": "Archaeologies of Colonialism",
    "info": "Theories, geographically diverse case studies on how colonization affects colonizers/colonized and creates new populations. How archaeology was born of colonial pursuits. Research projects, lecture, discussion.",
    "prereq": {}
  },
  {
    "uid": "809329",
    "code": "ANTH4121",
    "subject": "ANTH",
    "number": "4121",
    "honors": false,
    "writing": false,
    "name": "Business Anthropology",
    "fullname": "Business Anthropology",
    "info": "Anthropological/ethnographic understandings/research techniques.",
    "prereq": {}
  },
  {
    "uid": "813704",
    "code": "ANTH4150",
    "subject": "ANTH",
    "number": "4150",
    "honors": false,
    "writing": false,
    "name": "Critical Global Health",
    "fullname": "Critical Approaches to Global Health",
    "info": "Seminar introduces students to critical and anthropological approaches to global health and medical humanitarianism, focusing on shifting health conditions facing populations and individuals around the globe today and on the scientific and medical practices that are made around them. \n\nThrough ethnographic and anthropological accounts of global health, students will examine important issues in global public health, medical humanitarianism, and medical development. These include: global and local health inequalities, the role and history of transnational institutions in public health, critiques of vertical funding and \"magic bullet\" approaches, and the role of economy, environment, and politics in shaping health and medicine around the world.\n\nThe overall aim of the class is to equip students with a broad understanding of global health and with a critical awareness of global health as shaped by social, economic, medical and technological practices.",
    "prereq": {}
  },
  {
    "uid": "807544",
    "code": "ANTH4329",
    "subject": "ANTH",
    "number": "4329",
    "honors": false,
    "writing": false,
    "name": "Primate Behavior",
    "fullname": "Primate Ecology and Social Behavior",
    "info": "This course examines the evolution of social behavior in Primates, the order of mammals that includes humans. In this course we will examine how studies of the behavior and ecology of species in this diverse order have provided insights into the evolution of many traits, including: aggression, altruism, cooperation, mating systems, social bonds, group size and composition, intelligence, and culture.\n\nprereq: BIOL 1009 or 1951 or 3411 or ANTH 1001 or instr consent",
    "prereq": {
      "or": [
        "005416",
        "817196",
        "014289",
        "008711"
      ]
    }
  },
  {
    "uid": "799926",
    "code": "ANTH4344",
    "subject": "ANTH",
    "number": "4344",
    "honors": false,
    "writing": false,
    "name": "Europe and its Margins",
    "fullname": "Europe and its Margins",
    "info": "This course explores some of the forms of human imagining (literary, artistic, political, social scientific) engendered by the notoriously hard to define entity known as \"Europe.\"  It does so by focusing on regions and populations that have been thought of at various times as marking Europe's inner and outer cultural and/or geographical limits.  Topics addressed include: the relationship between physical geography, cultural memory, and the formation (or subversion) of identity claims; the reconfigured political landscapes of post-socialism and European integration; immigration, refugee flows, and the rise of far-right ethno-nationalisms; and the effects of pandemics past and present.\n\nprereq: One course in [ANTH or GLOS]",
    "prereq": {}
  },
  {
    "uid": "008754",
    "code": "ANTH4980",
    "subject": "ANTH",
    "number": "4980",
    "honors": false,
    "writing": false,
    "name": "Topics in Sociocultural Anth",
    "fullname": "Topics in Sociocultural Anthropology",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "008755",
    "code": "ANTH4990",
    "subject": "ANTH",
    "number": "4990",
    "honors": false,
    "writing": false,
    "name": "Topics-Arch: Sem",
    "fullname": "Topics in Archaeology: Seminar",
    "info": "Discussion/review/analysis of specific current theoretical and/or methodological issues in archaeology. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "008784",
    "code": "ANTH4991",
    "subject": "ANTH",
    "number": "4991",
    "honors": false,
    "writing": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Under special circumstances and with the approval of the instructor, qualified students may register for a listed course on a tutorial basis.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008785",
    "code": "ANTH4992",
    "subject": "ANTH",
    "number": "4992",
    "honors": false,
    "writing": false,
    "name": "Dir Readings",
    "fullname": "Directed Readings",
    "info": "Allows students to pursue special interests in anthropology through reading materials under the guidance of a faculty member.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008786",
    "code": "ANTH4993",
    "subject": "ANTH",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Allows students to pursue special interests in anthropology under the guidance of a faculty member.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008787",
    "code": "ANTH4994W",
    "subject": "ANTH",
    "number": "4994",
    "honors": false,
    "writing": true,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Qualified students may conduct a well-defined research project under the guidance of a faculty member.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "826669",
    "code": "ANTH5002",
    "subject": "ANTH",
    "number": "5002",
    "honors": false,
    "writing": false,
    "name": "Epidemics in Evolution",
    "fullname": "Epidemics in Human Evolution",
    "info": "This course examines the global human experience with health and disease through an\narchaeological and historical perspective, from the early days of our species to the present. We\nwill survey major infectious and noncommunicable diseases that have affected human\nsocieties, including tuberculosis, plague, influenza, syphilis, HIV/AIDS, and leprosy. You will\nlearn how humans have responded and adapted to many of these conditions, and how disease\norganisms have evolved in tandem. Course content examines large-scale disease and health\npatterns over time with a special focus on global pandemics and major epidemiological\ntransitions such as those brought about by the introduction of agriculture, the Age of\nExploration, colonialism, and industrialization. You will become familiar with the methods and\napproaches used by anthropologists and archaeologists to study disease in the past and how\nthese inferences influence understanding of present-day health. The course will end with a\ndiscussion of emerging health challenges such as the rise of antibiotic resistance, novel zoonotic\ndiseases, and the prevalence of health disparities.",
    "prereq": {}
  },
  {
    "uid": "795398",
    "code": "ANTH5008",
    "subject": "ANTH",
    "number": "5008",
    "honors": false,
    "writing": false,
    "name": "Advanced Flintknapping",
    "fullname": "Advanced Flintknapping",
    "info": "Hands-on experience in replication of prehistoric stone tools, as basis for archaeological analysis and as art form in itself.\n\nprereq: Exclude fr or soph 5000 level courses. Take ANTH 3008 or ANTH5269 or Instructor Permission.",
    "prereq": {
      "or": [
        "795397",
        "793721"
      ]
    }
  },
  {
    "uid": "806375",
    "code": "ANTH5009",
    "subject": "ANTH",
    "number": "5009",
    "honors": false,
    "writing": false,
    "name": "Human Behavioral Biology",
    "fullname": "Human Behavioral Biology",
    "info": "In-depth introduction to, and critical review of, human behavioral biology, examining the approaches in anthropology and related fields. Classic texts/recent empirical studies of humans and other species. Theoretical underpinnings of this new discipline/how well theoretical predictions have been supported by subsequent research.  ",
    "prereq": {}
  },
  {
    "uid": "801375",
    "code": "ANTH5015W",
    "subject": "ANTH",
    "number": "5015",
    "honors": false,
    "writing": true,
    "name": "Evolution of Language",
    "fullname": "Biology, Evolution, and Cultural Development of Language & Music",
    "info": "Language is the most human form of behavior, and the investigation of the ways language and culture interact is one of the most important aspects of the study of human beings. The most fascinating problem in this study is how language itself may have evolved as the result of the interaction between biological and cultural development of the human species. In this course we will consider the development of the brain, the relationship between early hominins, including Neanderthals and modern humans, and such questions as the role of gossip and music in the development of language.",
    "prereq": {}
  },
  {
    "uid": "826043",
    "code": "ANTH5016",
    "subject": "ANTH",
    "number": "5016",
    "honors": false,
    "writing": false,
    "name": "African Archaeology",
    "fullname": "Africa and African Diaspora Archaeology",
    "info": "\tAfrica and African Diaspora Archaeology (AFRO/ ANTH 3016/5016) examines the evolution of human behavior in Africa and looks at subsequent social, cultural, and technological developments as shown in archaeological records including artifacts, ecofacts, rock art, and structures at archaeological sites. It also discusses methods used to identify archaeological records and how these records can be used to reconstruct past ways of life. Students will obtain hand-on-experience in identifying, classifying, and interpreting archaeological objects. The course covers Africa from around 2.6 million years ago to the recent past, focusing primarily on the last 10,000 years. It examines the development and spread of food production, pottery, metallurgy, trade, and African connections with the Atlantic world dating back to the fifteenth century. ",
    "prereq": {}
  },
  {
    "uid": "801707",
    "code": "ANTH5021W",
    "subject": "ANTH",
    "number": "5021",
    "honors": false,
    "writing": true,
    "name": "Anthropology:  The Middle East",
    "fullname": "Anthropology of the Middle East",
    "info": "Anthropological field methods of analyzing/interpreting Middle Eastern cultures/societies.",
    "prereq": {}
  },
  {
    "uid": "008761",
    "code": "ANTH5025W",
    "subject": "ANTH",
    "number": "5025",
    "honors": false,
    "writing": true,
    "name": "Cultural Semantics",
    "fullname": "Cultural Semantics",
    "info": "Understanding cultures and cognitive classification systems through lexical semantics.",
    "prereq": {}
  },
  {
    "uid": "008762",
    "code": "ANTH5027W",
    "subject": "ANTH",
    "number": "5027",
    "honors": false,
    "writing": true,
    "name": "Arch. of Prehistoric Europe",
    "fullname": "Archaeology of Prehistoric Europe",
    "info": "How archaeologists/historians analyze/interpret artifacts to develop knowledge about formation of European society, from earliest evidence of human occupation to Roman Period. Interpreting archaeological evidence from specific sites to understand broad trends in human past.",
    "prereq": {}
  },
  {
    "uid": "816551",
    "code": "ANTH5028",
    "subject": "ANTH",
    "number": "5028",
    "honors": false,
    "writing": false,
    "name": "Historical Archaeology",
    "fullname": "Historical Archaeology",
    "info": "In this course, we will explore the theories and methods of historical archaeology – such as material culture studies, landscape perspectives, archival, and oral historical interpretation - as a means of intervening in contemporary discussions of diversity in the United States. Historical archaeology can be a very effective means to challenge some of the standard American narratives about our diverse past. Our aim is to move beyond either a simplistic ethnic pluralism or the superficial “melting pot” progressive history and instead grapple with the materiality of settler colonialism, white supremacy, and capitalism. In learning about this field, we will consider what has distinguished historical archaeology from American archaeology more broadly, and how those differences are parlayed into specific research strengths. This includes several themes: colonialism; the modern world and globalizing economies; intersectional identities (race and ethnicity, class, sex and gender, religion, age, ability/disability) and social movements; public memory and commemoration; landscapes and social space; citizenship and subjectivity. Although historical archaeology until recently has been restrictively defined as addressing the European-colonized New World, the discipline in the past twenty years has significantly broadened its scope and impact on the practice of archaeology as a whole. Throughout the course we will discuss these developments, and what directions archaeology may take in the future as a result. Course work includes both reading/discussion and learning methods through practical exercises, and handling of archaeological material.",
    "prereq": {}
  },
  {
    "uid": "008763",
    "code": "ANTH5029",
    "subject": "ANTH",
    "number": "5029",
    "honors": false,
    "writing": false,
    "name": "Philosophic Anth",
    "fullname": "Philosophical Anthropology",
    "info": "Advanced survey of traditional problems associated with broad-ranging views on human nature and culture. Specific arguments of relativists, behaviorists, phenomenologists, and others in relation to social life. Structuralist and post-structuralist approaches.",
    "prereq": {}
  },
  {
    "uid": "796887",
    "code": "ANTH5031W",
    "subject": "ANTH",
    "number": "5031",
    "honors": false,
    "writing": true,
    "name": "Ethnographies of Science",
    "fullname": "Ethnographies of Science",
    "info": "Ethnographic, historical, and sociological accounts of scientific practice. How facts are constructed/negotiated. Social, cultural, and political influences on scientific methods. How scientific projects articulate with hierarchies of race/gender. International differences in scientific practice.\n\nprereq: Sr or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "008764",
    "code": "ANTH5033",
    "subject": "ANTH",
    "number": "5033",
    "honors": false,
    "writing": false,
    "name": "Feminst Anthroplgy",
    "fullname": "Feminist Anthropology",
    "info": "Advanced introduction to the development of feminist theory in anthropology. Theoretical and methodological shifts in feminist anthropology and ethnography. Feminist ethnography within the discipline as a whole; current debates concerning the reading and writing of ethnography.\n\nprereq: 3047 or grad or instr consent",
    "prereq": {
      "or": [
        "008744"
      ]
    }
  },
  {
    "uid": "825789",
    "code": "ANTH5037",
    "subject": "ANTH",
    "number": "5037",
    "honors": false,
    "writing": false,
    "name": "Food Sovereignty in Africa",
    "fullname": "Food Sovereignty in Africa",
    "info": "Food Sovereignty in Africa critically evaluates how the physical environment and historical processes shaped agricultural productivity in Africa, as well as exploring the subsequent relationship the continent has had with the rest of the world. The course uses multi-disciplinary resources to examine historical factors that have contributed to contemporary food security issues, and discusses grassroots food movements that embrace the ethics and values of African societies in their efforts to  achieve both food security and environmental sustainability. It also examines the interplay between food security, indigenous knowledge, and environmental sustainability by comparing various standpoints on African food production, scrutinizing the challenges the continent is facing and the unique perspectives it offers in terms of agricultural development in the globalized world. Finally, the course examines how agricultural systems in Africa are affected by the new global land rush. After taking the course, students will have better knowledge of emerging research directions on Africa and will be equipped with sufficient research and practical skills to pursue independent studies beyond the classroom.  ",
    "prereq": {}
  },
  {
    "uid": "008998",
    "code": "ANTH5041",
    "subject": "ANTH",
    "number": "5041",
    "honors": false,
    "writing": false,
    "name": "Ecological Anthropology",
    "fullname": "Ecological Anthropology",
    "info": "Concepts, theories, and methods of ecological anthropology (cultural ecology) show how humans interact with the biophysical environment. Compare biological and cultural interactions with the environment; examine adaptive strategies cross-culturally.\n\nprereq: grad or instr consent",
    "prereq": {}
  },
  {
    "uid": "794793",
    "code": "ANTH5043",
    "subject": "ANTH",
    "number": "5043",
    "honors": false,
    "writing": false,
    "name": "Colonialism and Culture",
    "fullname": "Colonialism and Culture",
    "info": "Making of culture as colonial/anthropological object of knowledge. Relationship between colonial knowledge/formation of academic disciplines (especially anthropology). Colonial/postcolonial transformations of colony, nation, and metropole.",
    "prereq": {}
  },
  {
    "uid": "009848",
    "code": "ANTH5045W",
    "subject": "ANTH",
    "number": "5045",
    "honors": false,
    "writing": true,
    "name": "Urban Anthropology",
    "fullname": "Urban Anthropology",
    "info": "This class explores anthropological approaches to urban life. On one hand, the course examines the ontological nature of the city by looking into the relation between cities and their environment, and asking whether and how people differentiate \"urban\" and \"non-urban\" spaces. It uncovers the social practices and behaviors that define urban life; urban-rural distinctions; the material and ecological processes that constitute cities; and popular representations of city and/or countryside. On the other hand, the course investigates the spatial and social divisions of the city, seeking to understand the historical struggles and ongoing processes that both draw together and differentiate the people of an urban environment. It studies how cities influence political decision-making, contributing to the uneven distribution of power and resources. It considers: industrialization; urban class conflict; gendered and racialized spaces; and suburbanization. Both of these approaches will also critically consider the city as a social object that we encounter and learn about through our engagement with kinds of media, such as novels and film. Hence, reading for the class will include literature from the social sciences and humanities, as well as critical works of fiction.\n\nStudents will engage with these broader anthropological issues through an investigation of several global cities, especially Minneapolis-St. Paul, Chicago, Paris, Mexico City, Brasilia, and New Delhi. The class mixes lecture, discussion, and guided research. Lectures will introduce the history of urbanism and urban anthropology. Discussions will critically evaluate the readings, and offer insights and examples to better understand them. By participating in a guided research project, students will uncover hidden aspects of their own city, using ethnography or archaeology to shed light on the urban environment, social struggles over space, or other themes. ",
    "prereq": {}
  },
  {
    "uid": "008996",
    "code": "ANTH5059",
    "subject": "ANTH",
    "number": "5059",
    "honors": false,
    "writing": false,
    "name": "Anth of Religion",
    "fullname": "Anthropology of Religion",
    "info": "Comparative study of myths, religious beliefs and rituals cross-culturally. Analysis of how religion and social relations are integrated. Careful examination of landmark cases and conceptual approaches in the anthropology of religion.",
    "prereq": {}
  },
  {
    "uid": "811501",
    "code": "ANTH5112",
    "subject": "ANTH",
    "number": "5112",
    "honors": false,
    "writing": false,
    "name": "Hominin Behavior",
    "fullname": "Reconstructing Hominin Behavior",
    "info": "Major hypotheses regarding evolution of human behavior. Combine evidence from realm of biological anthropology as we consider link between bone biology/behavior. Archaeological record. Hypotheses about biocultural evolution regarding tool-use, hunting, scavenging, food sharing, grandmothers, cooking, long distance running.\n\nprereq: Previous coursework in Biological Anthropology or Archaeology",
    "prereq": {}
  },
  {
    "uid": "810487",
    "code": "ANTH5113",
    "subject": "ANTH",
    "number": "5113",
    "honors": false,
    "writing": false,
    "name": "Primate Evolution",
    "fullname": "Primate Evolution",
    "info": "Evolutionary history of primates. Particular focus on origin/diversification of apes/Old World monkeys.\n\nprereq: Anthropology major, junior or senior",
    "prereq": {}
  },
  {
    "uid": "808428",
    "code": "ANTH5121",
    "subject": "ANTH",
    "number": "5121",
    "honors": false,
    "writing": false,
    "name": "Business Anthropology",
    "fullname": "Business Anthropology",
    "info": "Anthropological/ethnographic understandings/research techniques.prereq: MBA student",
    "prereq": {}
  },
  {
    "uid": "791988",
    "code": "ANTH5128",
    "subject": "ANTH",
    "number": "5128",
    "honors": false,
    "writing": false,
    "name": "Anthropology of Education",
    "fullname": "Anthropology of Education",
    "info": "Cross-cultural perspectives in examining educational patterns. Implicit/explicit cultural assumptions. Methods/approaches to cross-cultural studies in education.",
    "prereq": {}
  },
  {
    "uid": "793055",
    "code": "ANTH5221",
    "subject": "ANTH",
    "number": "5221",
    "honors": false,
    "writing": false,
    "name": "Anthropology Material Culture",
    "fullname": "Anthropology of Material Culture",
    "info": "The course examines material culture as a social creation, studied from multiple theoretical and methodological perspectives (e.g., social anthropology, archaeology, primatology, history of science). The course examines the changing role of material culture from prehistory to the future.",
    "prereq": {}
  },
  {
    "uid": "790582",
    "code": "ANTH5244",
    "subject": "ANTH",
    "number": "5244",
    "honors": false,
    "writing": false,
    "name": "Interpreting Ancient Bone",
    "fullname": "Interpreting Ancient Bone",
    "info": "To Interpret Ancient Bone we must sharpen observational skills, read about observations and analysis by previous workers, and learn to record and analyze complex information. The class combines seminar/discussion formats, in which we read literature about how to best accomplish this type of research, and laboratory time, to give students the opportunity to observe and record modifications to bones that form the basis of archaeological and forensic observations. Students analyze different kinds of tool marks on bone, weathering, carnivore modifications, eco-morphology, ages of death, bone tools, and bones from archaeological sites to infer the \"life history\" of a bone.  We recommend you take the Human Skeleton or Zooarchaeology Laboratory before you take this class, but it is not absolutely required.",
    "prereq": {}
  },
  {
    "uid": "803596",
    "code": "ANTH5255",
    "subject": "ANTH",
    "number": "5255",
    "honors": false,
    "writing": false,
    "name": "The Archaeology of Religion",
    "fullname": "Archaeology of Ritual and Religion",
    "info": "The course discusses evidence for the origins of religion and its diverse roles in human societies over millennia. It focuses on how artifacts and architecture are essential to religious experience. It asks: What constitutes religion for different cultures? Why is religion at the heart of politics, social life, and cultural imagination?",
    "prereq": {}
  },
  {
    "uid": "793721",
    "code": "ANTH5269",
    "subject": "ANTH",
    "number": "5269",
    "honors": false,
    "writing": false,
    "name": "Stone Tool Technology",
    "fullname": "Analysis of Stone Tool Technology",
    "info": "The course offers practical lab experience in analyzing archaeological collections of stone tools to learn about human behavior in the past. Students gain experience needed to get a job in the cultural resource management industry.",
    "prereq": {}
  },
  {
    "uid": "802931",
    "code": "ANTH5325",
    "subject": "ANTH",
    "number": "5325",
    "honors": false,
    "writing": false,
    "name": "The Art of the Aztec Empire",
    "fullname": "The Art of the Aztec Empire",
    "info": "Art/architecture of Nahuati-speaking Aztecs of Central Mexico, from their first appearance in archaeological record until Spanish invasion of Central Mexico in 1521. Theoretical/methodological approaches. Critical analysis of scholarly writing and what constitutes \"evidence.\"",
    "prereq": {}
  },
  {
    "uid": "818989",
    "code": "ANTH5327W",
    "subject": "ANTH",
    "number": "5327",
    "honors": false,
    "writing": true,
    "name": "Inca, Aztec, Maya Civilztns",
    "fullname": "Inca, Aztec & Maya Civilizations",
    "info": "This course is an intensive examination of the emergence, growth, and conquest of native civilizations in ancient America, focusing on the Maya, Aztec, and Inca states. Lectures and discussions examine the culture and history of these Native American civilizations, while also introducing students to anthropological theories of the state, religion, aesthetics, and history.",
    "prereq": {}
  },
  {
    "uid": "801576",
    "code": "ANTH5401",
    "subject": "ANTH",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Human Fossil Record",
    "fullname": "The Human Fossil Record",
    "info": "Fossil evidence paleoanthropologists use to reconstruct human evolutionary history. Taxonomy, phylogeny, behavior, ecology, tool use, land use, and biogeography. Examination of fossil casts, readings from primary/secondary professional sources.\n\nprereq: ANTH 1001 or instr consent",
    "prereq": {
      "or": [
        "008711"
      ]
    }
  },
  {
    "uid": "805439",
    "code": "ANTH5402",
    "subject": "ANTH",
    "number": "5402",
    "honors": false,
    "writing": false,
    "name": "Zooarchaeology Laboratory",
    "fullname": "Zooarchaeology Laboratory",
    "info": "How archaeologists reconstruct the past through the study of animal bones associated with artifacts at archaeological sites. Skeletal element (e.g., humerus, femur, tibia), and taxon (e.g., horse, antelope, sheep, bison, hyena) when confronted with bone. Comparative collection of bones from known taxa.  ",
    "prereq": {}
  },
  {
    "uid": "801564",
    "code": "ANTH5403",
    "subject": "ANTH",
    "number": "5403",
    "honors": false,
    "writing": false,
    "name": "Quantitative Methods",
    "fullname": "Quantitative Methods in Biological Anthropology",
    "info": "Quantitative methods used by biological anthropologists. Applying these methods to real anthropometric data. Lectures, complementary sessions in computer lab.\n\nprereq: Basic univariate statistics course or instr consent",
    "prereq": {}
  },
  {
    "uid": "803073",
    "code": "ANTH5405",
    "subject": "ANTH",
    "number": "5405",
    "honors": false,
    "writing": false,
    "name": "Human Skeletal Analysis",
    "fullname": "Human Skeletal Analysis",
    "info": "Structure, design, and variability of modern human skeleton. Anatomy, functional morphology, development, evolutionary history. Bone histology/biology, excavation, preservation, taphonomy, pathology, forensic analyses. Differentiating between males/females, adults/sub-adults, and humans/non-humans. Quizzes, exams, research paper, project..",
    "prereq": {}
  },
  {
    "uid": "817832",
    "code": "ANTH5412",
    "subject": "ANTH",
    "number": "5412",
    "honors": false,
    "writing": false,
    "name": "Cmparativ Indigenous Feminisms",
    "fullname": "Comparative Indigenous Feminisms",
    "info": "The course will examine the relationship between Western feminism and indigenous feminism as well as the inter connections between women of color feminism and indigenous feminism. In addition to exploring how  indigenous feminists have theorized from 'the flesh' of their embodied experience of colonialism, the course will also consider how indigenous women are articulating decolonization and the embodiment of autonomy through scholarship, cultural revitalization, and activism.",
    "prereq": {}
  },
  {
    "uid": "799880",
    "code": "ANTH5422",
    "subject": "ANTH",
    "number": "5422",
    "honors": false,
    "writing": false,
    "name": "Citizenship and Nationalism",
    "fullname": "Anthropologies of Citizenship and Nationalism",
    "info": "Why/how citizenship and nationalism have been constructed over time as a force of cultural identity/belonging. Key theories, recent developments in citizenship theory. Defining an anthropological approach to citizenship.\n\nprereq: 3xxx course in [anthorpology or related discipline]",
    "prereq": {}
  },
  {
    "uid": "800217",
    "code": "ANTH5442",
    "subject": "ANTH",
    "number": "5442",
    "honors": false,
    "writing": false,
    "name": "Archaeology of  British Isles",
    "fullname": "Archaeology of the British Isles",
    "info": "Have you ever wondered how archaeologists interpret the vast amount of archaeological evidence from the British Isles, one of the most studied and best documented parts of the world?  And how do archaeologists and governmental agencies protect the heritage of Britain, from major monuments such as Stonehenge, Roman forts, and Shakespeare’s theaters, to the minor products of craft industries such as personal ornaments and coins?  This course teaches you about the archaeology of the British Isles, in all of its aspects.  You learn how archaeologists study the changing societies of Britain and Ireland, from the first settlers about a million years ago to modern times.  You learn about the strategies that public institutions employ to preserve and protect archaeological sites, and about the place of archaeology in tourism in the British Isles and in the formation of identities among the diverse peoples of modern Britain.",
    "prereq": {}
  },
  {
    "uid": "807949",
    "code": "ANTH5444",
    "subject": "ANTH",
    "number": "5444",
    "honors": false,
    "writing": false,
    "name": "Archaeological Ceramics",
    "fullname": "Archaeological Ceramics",
    "info": "Ceramics as material, technology, and cultural/social trace. Methods of assessing technology/use. Research, design, and interpretation of ceramic analyses. Students work with collections and propose/answer a research question about a ceramic assemblage. Readings, discussion.\n\nprereq: 3001 or instr consent",
    "prereq": {
      "or": [
        "008713"
      ]
    }
  },
  {
    "uid": "800218",
    "code": "ANTH5446",
    "subject": "ANTH",
    "number": "5446",
    "honors": false,
    "writing": false,
    "name": "Archaeology of Representation",
    "fullname": "Archaeology of Representation as Communication",
    "info": "Seminar. Uses of paintings, sculptures, drawings, and photgraphs as means of communication, from earliest representations of 30,000 years ago to present day.",
    "prereq": {}
  },
  {
    "uid": "808418",
    "code": "ANTH5448",
    "subject": "ANTH",
    "number": "5448",
    "honors": false,
    "writing": false,
    "name": "Applied Heritage Management",
    "fullname": "Applied Heritage Management",
    "info": "Contexts of cultural heritage applicable to federal/state protection. Approaches to planning/management. Issues of heritage/stakeholder conflict.",
    "prereq": {}
  },
  {
    "uid": "817339",
    "code": "ANTH5450",
    "subject": "ANTH",
    "number": "5450",
    "honors": false,
    "writing": false,
    "name": "Spatial Analysis in Anthroplgy",
    "fullname": "Spatial Analysis in Anthropology: Research Design and Field Applications",
    "info": "This advanced undergraduate and graduate course introduces students to spatial analyses essential to anthropological ethnography, archaeology, and historical ecology. It builds on introductory courses at UMN, providing students an opportunity to learn anthropological applications of spatial analysis methods, including: research design, field mapping, database management, digital survey platforms, GIS analyses, and integration of quantitative and qualitative (ethnographic and historical) data. The structure of the course will follow the trajectory of a typical doctoral-level anthropological project, from pre-field data acquisition and preparation, to in-field data collection, post-field analysis, and presentation. Students who take this course will master skills that are crucial for successful anthropological spatial analysis in the field and laboratory. ",
    "prereq": {}
  },
  {
    "uid": "816028",
    "code": "ANTH5501",
    "subject": "ANTH",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Managing Museum Collections",
    "fullname": "Managing Museum Collections",
    "info": "This course provides a hands-on and research experience in collections management utilizing artifact, archival, and digital collections. Museum collections, the objects or specimens they contain, the information associated with them, and their care and maintenance are a crucial part of both the sciences and the humanities. While seemingly disparate, many of the issues faced by those responsible for collections are quite similar: how to preserve and care for those collections, legal issues surrounding the materials they contain, how to organize and classify the items, how to facilitate discovery and access, and how to make the information contained in them available to the broadest audience possible. The course includes lectures by museum professionals, hands-on activities, and selected readings.\n\nCredit will not be granted if credit has been received for ANTH 3501.",
    "prereq": {}
  },
  {
    "uid": "799881",
    "code": "ANTH5525",
    "subject": "ANTH",
    "number": "5525",
    "honors": false,
    "writing": false,
    "name": "Culture/Soc Sci Professionals",
    "fullname": "Understanding Cultures for Social Science Professionals",
    "info": "Culture in a golobalized world. How anthropological concept of culture can help social service professionals understand and engage with people from diverse backgrounds.",
    "prereq": {}
  },
  {
    "uid": "810122",
    "code": "ANTH5601",
    "subject": "ANTH",
    "number": "5601",
    "honors": false,
    "writing": false,
    "name": "Archaeology & Native Americans",
    "fullname": "Archaeology and Native Americans",
    "info": "Historical, political, legal, and ethical dimensions of the relationship of American archaeology to American Indian people. Case studies of how representational narratives about Native people are created through archaeology; responses by Native communities; and the frameworks for collaborative and equitable archaeological practice.  Professional ethics in archaeology/heritage studies in American contexts.",
    "prereq": {}
  },
  {
    "uid": "810118",
    "code": "ANTH5802",
    "subject": "ANTH",
    "number": "5802",
    "honors": false,
    "writing": false,
    "name": "The Inka and Their Ancestors",
    "fullname": "Art of the Inka and their Ancestors",
    "info": "Art/architecture of people of Andes, from first appearance in archaeological record until Spanish invasion in 16th century. Problems, theoretical/methodological approaches. Analysis of scholarly writing, focusing on evidence.",
    "prereq": {}
  },
  {
    "uid": "827120",
    "code": "ANTH5910",
    "subject": "ANTH",
    "number": "5910",
    "honors": false,
    "writing": false,
    "name": "Topics: Anthropology",
    "fullname": "Topics: Anthropology",
    "info": "Topic in Anthropology for 5xxx level requirements",
    "prereq": {}
  },
  {
    "uid": "788796",
    "code": "ANTH5980",
    "subject": "ANTH",
    "number": "5980",
    "honors": false,
    "writing": false,
    "name": "Topics in Anthropology",
    "fullname": "Topics in Anthropology",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "790520",
    "code": "ANTH5990",
    "subject": "ANTH",
    "number": "5990",
    "honors": false,
    "writing": false,
    "name": "Topics in Archaeology",
    "fullname": "Topics in Archaeology",
    "info": "Topics specified in Class Schedule.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008756",
    "code": "ANTH8001",
    "subject": "ANTH",
    "number": "8001",
    "honors": false,
    "writing": false,
    "name": "Ethnography, Theory, History",
    "fullname": "Ethnography, Theory, History",
    "info": "Introduction to foundational concepts, methods, and ethnographic work. Emphasizes theories that have shaped 20th-century thinking in cultural anthropology. Connection of these theories to fieldwork and contemporary issues.",
    "prereq": {}
  },
  {
    "uid": "008757",
    "code": "ANTH8002",
    "subject": "ANTH",
    "number": "8002",
    "honors": false,
    "writing": false,
    "name": "Ethno: Contemp Theory/Practice",
    "fullname": "Ethnography: Contemporary Theory and Practice",
    "info": "Concepts/perspectives in anthropology. Emphasizes American cultural anthropology. Rrecent work in semiotic, psychological, and feminist anthropology.",
    "prereq": {}
  },
  {
    "uid": "008758",
    "code": "ANTH8003",
    "subject": "ANTH",
    "number": "8003",
    "honors": false,
    "writing": false,
    "name": "Fndtns S/C Anth - 3",
    "fullname": "Foundations of Social and Cultural Anthropology",
    "info": "Builds on theoretical perspectives analyzed in 8001 and 8002; focuses on politics of culture and politics of ethnographic practice and writing.",
    "prereq": {}
  },
  {
    "uid": "008759",
    "code": "ANTH8004",
    "subject": "ANTH",
    "number": "8004",
    "honors": false,
    "writing": false,
    "name": "Fndtns Anth Archaeo",
    "fullname": "Foundations of Anthropological Archaeology",
    "info": "Theoretical foundations of anthropological archaeology in historical and contemporary perspective.\n\nprereq: 8001, 8002",
    "prereq": {
      "and": [
        "008756",
        "008757"
      ]
    }
  },
  {
    "uid": "802245",
    "code": "ANTH8005",
    "subject": "ANTH",
    "number": "8005",
    "honors": false,
    "writing": false,
    "name": "Linguistic Anthropology",
    "fullname": "Linguistic Anthropology",
    "info": "Introduction to literature of anthropological linguistics.  ",
    "prereq": {}
  },
  {
    "uid": "816767",
    "code": "ANTH8009",
    "subject": "ANTH",
    "number": "8009",
    "honors": false,
    "writing": false,
    "name": "Pathways to Civilizations",
    "fullname": "Prehistoric Pathways to World Civilizations",
    "info": "How did complex urban societies first develop? This course addresses this question in ten regions of the world including Maya Mesoamerica, Inca South America, Sumerian Near East, Shang Civilization in East Asia, and early Greece and Rome.",
    "prereq": {}
  },
  {
    "uid": "826222",
    "code": "ANTH8014",
    "subject": "ANTH",
    "number": "8014",
    "honors": false,
    "writing": false,
    "name": "Mol Anthro",
    "fullname": "Molecular Anthropology",
    "info": "This graduate seminar examines how DNA is used to trace the evolutionary history of humans and our hominin relatives. We will examine how genetic evidence has informed understanding of human evolution, the peopling of the world, human adaptation, animal domestication, disease and health, forensics, and the embodiment of the lived experience. Students will review important concepts of molecular and population genetics and become familiar with current methodologies and datasets used in molecular anthropology—including those used in fields paleogenomics and epigenetics research. Lastly, we will discuss how molecular anthropologists engage with the ethical issues posed by genetic technologies, especially as it pertains to research with Indigenous and underrepresented communities, discussions of race and identity, commercial genetic testing, and forensic genetic genealogy. Course discussions will highlight how genetic findings are integrated with other lines of evidence such as archaeology, cultural anthropology, and traditional knowledge sources, to reconstruct the complexity of the past and present human experience. Course meetings will be a mix of lecture, discussion sessions and practical data analysis training sessions. Students will be assessed based on participation in class discussions, in-class practical exercises, and a term paper representing a thorough literature review of a topic related to the course. ",
    "prereq": {}
  },
  {
    "uid": "809405",
    "code": "ANTH8111",
    "subject": "ANTH",
    "number": "8111",
    "honors": false,
    "writing": false,
    "name": "Evolutionary Morphology",
    "fullname": "Evolutionary Morphology",
    "info": "Basic foundation of diverse anatomical adaptations of living/fossil primates. Principles of evolutionary theory. Stages of embryogenesis/fetal development. Morphological diversity. Evolutionary morphology. Body size, allometry, heterochrony. Primate evolution.",
    "prereq": {}
  },
  {
    "uid": "811466",
    "code": "ANTH8112",
    "subject": "ANTH",
    "number": "8112",
    "honors": false,
    "writing": false,
    "name": "Hominin Behavior",
    "fullname": "Reconstructing Hominin Behavior",
    "info": "Consider major hypotheses regarding evolution of human behavior. Evidence/arguments used to support or reject hypotheses. Consider link between bone biology/behavior. Archaeological record for more holistic understanding of evidence.",
    "prereq": {}
  },
  {
    "uid": "810457",
    "code": "ANTH8113",
    "subject": "ANTH",
    "number": "8113",
    "honors": false,
    "writing": false,
    "name": "Primate Evolution",
    "fullname": "Primate Evolution",
    "info": "Evolutionary history of primates, with particular focus on origin/diversification of apes/Old World monkeys.\n\nprereq: Anthropology doctoral student",
    "prereq": {}
  },
  {
    "uid": "813202",
    "code": "ANTH8114",
    "subject": "ANTH",
    "number": "8114",
    "honors": false,
    "writing": false,
    "name": "Primate Behavioral Ecology",
    "fullname": "Biological Anthropology Graduate Program Seminar: Behavioral Ecology of Primates",
    "info": "Course focuses on the behavioral ecology of primates, including humans, with a focus on how the evolution of social behaviors relates to ecology. The course serves as one of three Biological Anthropology Graduate Program Seminars, which provide training in the foundations of biological anthropology. For Biological Anthropology graduate students, the take-home exam for this course will stand as one of the three required Preliminary Papers. Students outside of Biological Anthropology are welcome to enroll pending permission of the instructor.\n\nprereq: Anthropology graduate student or instr consent.",
    "prereq": {}
  },
  {
    "uid": "008771",
    "code": "ANTH8120",
    "subject": "ANTH",
    "number": "8120",
    "honors": false,
    "writing": false,
    "name": "Prb/CulChng&AppAnth",
    "fullname": "Problems in Culture Change and Applied Anthropology",
    "info": "Comparative studies of change in cultural systems.  Impact of global processes on local cultures.  Roles of anthropology and anthropologists in policy, planning, implementation, and evaluation.",
    "prereq": {}
  },
  {
    "uid": "808429",
    "code": "ANTH8121",
    "subject": "ANTH",
    "number": "8121",
    "honors": false,
    "writing": false,
    "name": "Business Anthropology",
    "fullname": "Business Anthropology",
    "info": "Ways in which anthropological understandings and research techniques, particularly ethnographic techniques, can be used to enhance study/practice of business.",
    "prereq": {}
  },
  {
    "uid": "798146",
    "code": "ANTH8201",
    "subject": "ANTH",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Humans and Non-Humans",
    "fullname": "Humans and Nonhumans: Hybrids and Collectives",
    "info": "Social life as consisting of relationships not only among human beings, but also between humans and nonhumans: animals, plants, environments, technologies, etc. Focuses on figure of hybrid, its role in formations of collective life.",
    "prereq": {}
  },
  {
    "uid": "008772",
    "code": "ANTH8203",
    "subject": "ANTH",
    "number": "8203",
    "honors": false,
    "writing": false,
    "name": "Methds/soc-cul anth",
    "fullname": "Research Methods in Social and Cultural Anthropology",
    "info": "Classic and current issues in research methodology, including positivist, interpretivist, feminist, and postmodernist frameworks.  Methodology, in the broadest sense of the concept, is evaluated.  Students conduct three research exercises and set up an ethnographic research project.\n\nprereq: Grad anth major or instr consent",
    "prereq": {}
  },
  {
    "uid": "008773",
    "code": "ANTH8205",
    "subject": "ANTH",
    "number": "8205",
    "honors": false,
    "writing": false,
    "name": "Economic Anthro",
    "fullname": "Economic Anthropology",
    "info": "Theoretical foundations of economic anthropology examined through critical readings of traditional, classical, and contemporary authors. Ethnographic puzzles of material life and issues of ecological degradation, development, market expansion, gender, and transglobal processes.",
    "prereq": {}
  },
  {
    "uid": "008774",
    "code": "ANTH8207",
    "subject": "ANTH",
    "number": "8207",
    "honors": false,
    "writing": false,
    "name": "Polit & Social Anth",
    "fullname": "Political and Social Anthropology",
    "info": "Western concepts of politics, power, authority, society, state, and law.  Cross-cultural approaches to these concepts in historical perspective. Major theoretical frameworks and current problems and positions in social and political anthropology.  Ethnographic classics and new directions.",
    "prereq": {}
  },
  {
    "uid": "008775",
    "code": "ANTH8209",
    "subject": "ANTH",
    "number": "8209",
    "honors": false,
    "writing": false,
    "name": "Psychological Anth",
    "fullname": "Psychological Anthropology",
    "info": "Self, emotion, cognitive processes, and child development in cross-cultural perspective.",
    "prereq": {}
  },
  {
    "uid": "008776",
    "code": "ANTH8211",
    "subject": "ANTH",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Symbolic Anth",
    "fullname": "Symbolic Anthropology",
    "info": "Advanced introduction to semiotic, structuralist, and interpretive approaches in anthropology.  Reviews classic foundations and recent developments.",
    "prereq": {}
  },
  {
    "uid": "008777",
    "code": "ANTH8213",
    "subject": "ANTH",
    "number": "8213",
    "honors": false,
    "writing": false,
    "name": "Ecological Anth",
    "fullname": "Ecological Anthropology",
    "info": "Seminar on method, theory, and key problems in ecological anthropology and human ecology. Examines approaches in light of human practices, interactions between culture and the environment, global environmental change, and our understanding of human dimensions of ecosystem-based management.",
    "prereq": {}
  },
  {
    "uid": "008999",
    "code": "ANTH8215",
    "subject": "ANTH",
    "number": "8215",
    "honors": false,
    "writing": false,
    "name": "Anth of Gender",
    "fullname": "Anthropology of Gender",
    "info": "Comparative, cross-cultural approach to gender. Focuses on various theories (e.g., feminist, postmodernist, psychoanalytic) of power, gender, authority, and femininity and masculinity.  Gender ambiguity and issues of sexuality.\n\nprereq: Grad anth major or instr consent",
    "prereq": {}
  },
  {
    "uid": "008778",
    "code": "ANTH8217",
    "subject": "ANTH",
    "number": "8217",
    "honors": false,
    "writing": false,
    "name": "Pedagogy",
    "fullname": "Pedagogy",
    "info": "Introduction to role of teaching in academic culture, active learning and critical thinking styles, learning style differences among students, and development of writing assignments, discussion groups, exams, and lectures that help students develop critical, observational, and integrative abilities most crucial to anthropology.",
    "prereq": {}
  },
  {
    "uid": "008779",
    "code": "ANTH8219",
    "subject": "ANTH",
    "number": "8219",
    "honors": false,
    "writing": false,
    "name": "Grant Writing",
    "fullname": "Grant Writing",
    "info": "Students draft a research proposal in their area of interest. Seminar involves reading and evaluating proposals, learning about funding and process of submitting proposals, nuts of bolts of composing a proposal, and ethics of research in anthropology.\n\nprereq: Grad anth majors preparing to submit research grant proposals next academic yr",
    "prereq": {}
  },
  {
    "uid": "008780",
    "code": "ANTH8220",
    "subject": "ANTH",
    "number": "8220",
    "honors": false,
    "writing": false,
    "name": "Field School",
    "fullname": "Field School",
    "info": "Advanced field excavation, survey, and research. Intensive training in excavation techniques, recordation, analysis, and interpretation of archaeological materials or prehistoric remains.",
    "prereq": {}
  },
  {
    "uid": "797843",
    "code": "ANTH8221",
    "subject": "ANTH",
    "number": "8221",
    "honors": false,
    "writing": false,
    "name": "Nature, Culture, and the Body",
    "fullname": "Nature, Culture, and the Body",
    "info": "The body as a site for thinking through issues of power, modernity, subjectivity, citizenship, race, sex, gender, sexuality, and life/death. The body in relation to classic concerns in anthropology about production of nature/culture, sex, gender, kinship, and social practice.",
    "prereq": {}
  },
  {
    "uid": "818996",
    "code": "ANTH8223",
    "subject": "ANTH",
    "number": "8223",
    "honors": false,
    "writing": false,
    "name": "Anthropology of Place & Space",
    "fullname": "Anthropology of Place & Space",
    "info": "This course asks questions about the meaning of place, the relationship of space to place, the relationship of identity to place, and the relationship of place to environmental change in the event of industrial pollution, development projects, natural disasters and climate change. Theories of and ethnographic accounts of space and place in Cultural Anthropology and Geography will be discussed.  In addition to foundational texts in the topic, we will also be reading contemporary accounts of nonwestern places. ",
    "prereq": {}
  },
  {
    "uid": "789765",
    "code": "ANTH8230",
    "subject": "ANTH",
    "number": "8230",
    "honors": false,
    "writing": false,
    "name": "Anth Research Design",
    "fullname": "Anthropological Research Design",
    "info": "Training seminar on research development, coordination, grant management, field/laboratory research management, fundraising.\n\nprereq: Anth grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "790546",
    "code": "ANTH8244",
    "subject": "ANTH",
    "number": "8244",
    "honors": false,
    "writing": false,
    "name": "Interpreting Ancient Bone",
    "fullname": "Interpreting Ancient Bone",
    "info": "To Interpret Ancient Bone we must sharpen observational skills, read about observations and analysis by previous workers, and learn to record and analyze complex information. The class combines seminar/discussion formats, in which we read literature about how to best accomplish this type of research, and laboratory time, to give students the opportunity to observe and record modifications to bones that form the basis of archaeological and forensic observations. Students analyze different kinds of tool marks on bone, weathering, carnivore modifications, eco-morphology, ages of death, bone tools, and bones from archaeological sites to infer the \"life history\" of a bone. We recommend you take the Human Skeleton or Zooarchaeology Laboratory before you take this class, but it is not absolutely required.",
    "prereq": {}
  },
  {
    "uid": "825509",
    "code": "ANTH8310",
    "subject": "ANTH",
    "number": "8310",
    "honors": false,
    "writing": false,
    "name": "Topics: Biological Anth",
    "fullname": "Topics: Biological Anthropology",
    "info": "Seminar examines particular aspects of method and/or theory within the biological anthropology discipline. Topics vary according to student and faculty interests.",
    "prereq": {}
  },
  {
    "uid": "788074",
    "code": "ANTH8333",
    "subject": "ANTH",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Masters",
    "fullname": "FTE: Masters",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788310",
    "code": "ANTH8444",
    "subject": "ANTH",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "008782",
    "code": "ANTH8510",
    "subject": "ANTH",
    "number": "8510",
    "honors": false,
    "writing": false,
    "name": "Topics: Archaeology",
    "fullname": "Topics in Archaeology",
    "info": "Seminar examines particular aspects of archaeological methods and/or theory.  Topics vary according to student and faculty interests.",
    "prereq": {}
  },
  {
    "uid": "816948",
    "code": "ANTH8555",
    "subject": "ANTH",
    "number": "8555",
    "honors": false,
    "writing": false,
    "name": "Master's Project Credits",
    "fullname": "Master's Project Credits",
    "info": "Student may contact the department for more information.",
    "prereq": {}
  },
  {
    "uid": "788437",
    "code": "ANTH8666",
    "subject": "ANTH",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788567",
    "code": "ANTH8777",
    "subject": "ANTH",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "008783",
    "code": "ANTH8810",
    "subject": "ANTH",
    "number": "8810",
    "honors": false,
    "writing": false,
    "name": "Sociocultural Anthropology",
    "fullname": "Topics in Sociocultural Anthropology",
    "info": "Seminar examines particular aspects of method and/or theory. Topics vary according to student and faculty interests.",
    "prereq": {}
  },
  {
    "uid": "787824",
    "code": "ANTH8888",
    "subject": "ANTH",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "817355",
    "code": "ANTH8980",
    "subject": "ANTH",
    "number": "8980",
    "honors": false,
    "writing": false,
    "name": "Anthropology Graduate Workshop",
    "fullname": "Anthropology Graduate Workshop",
    "info": "Seminar examines aspects of the discipline that transcend traditional subfield boundaries.",
    "prereq": {}
  },
  {
    "uid": "825058",
    "code": "ANTH8990",
    "subject": "ANTH",
    "number": "8990",
    "honors": false,
    "writing": false,
    "name": "Topics in Anthropology",
    "fullname": "Topics in Anthropology",
    "info": "Seminar examines aspects of the discipline that transcend traditional subfield boundaries.",
    "prereq": {}
  },
  {
    "uid": "008788",
    "code": "ANTH8991",
    "subject": "ANTH",
    "number": "8991",
    "honors": false,
    "writing": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Under special circumstances and with instructor approval, qualified students may register for a listed course on a tutorial basis.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008789",
    "code": "ANTH8992",
    "subject": "ANTH",
    "number": "8992",
    "honors": false,
    "writing": false,
    "name": "Dir. Readings",
    "fullname": "Directed Reading",
    "info": "tbd\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008790",
    "code": "ANTH8993",
    "subject": "ANTH",
    "number": "8993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Directed Study\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008791",
    "code": "ANTH8994",
    "subject": "ANTH",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Dir Research",
    "fullname": "Directed Research",
    "info": "N/A\n\nprereq: instr consent",
    "prereq": {}
  }
]