[
  {
    "uid": "827278",
    "code": "APSC8081",
    "subject": "APSC",
    "number": "8081",
    "honors": false,
    "writing": false,
    "name": "Scientific Ethics & Strategies",
    "fullname": "Scientific Ethics and Strategies for Success",
    "info": "The overall mission of this course is to provide first-year Applied Plant Sciences (APS) students basic training in Research Ethics, educate them on best practices and strategies for succeeding in graduate school, and facilitate interactions within the incoming student cohort. The course is divided into two components: \n(1) Students will learn about and discuss various topics related to scientific research ethics, particularly themes that are pertinent to everyday plant science research. The ethics component of this class will be conducted in accordance with the UMN standards and guidelines (Appendix | Responsible Conduct of Research and Ethical Teaching and Scholarship (umn.edu)). \n(2) Students will learn about and discuss best practices for success in graduate school. A wide range of topics will be covered, including balancing research and scholastic responsibilities, and overall wellbeing. In class activities will focus on instructor presentations, small group discussions, and whole class discussions. Students will have weekly assignments that require activities and/or reflection on course topics, including weekly writing assignments.",
    "prereq": {}
  },
  {
    "uid": "792775",
    "code": "APSC8123",
    "subject": "APSC",
    "number": "8123",
    "honors": false,
    "writing": false,
    "name": "Resrch Ethics in Plant/Env Sci",
    "fullname": "Research Ethics in the Plant and Environmental Sciences",
    "info": "Ethics training to graduate students enrolled in plant/environmental graduate research programs and fulfill requirement for training in responsible conduct of research.",
    "prereq": {}
  },
  {
    "uid": "817910",
    "code": "APSC8201",
    "subject": "APSC",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Advanced Plant Breeding",
    "fullname": "Advanced Plant Breeding",
    "info": "This course covers the principles underlying the application of genetics and statistics to cultivar development; evaluation of breeding methods; and methods to enhance genetic progress and efficiency through the application of statistical genetics, genomics, and molecular markers. In terms of format, this course is combination of lecture, discussion, and computer lab, varying according to the topic. An emphasis will be placed on classical and current literature to teach concepts, as well as hands-on experience with data analysis.  \n\nIntroductory courses in plant breeding/genetics and statistics. Knowledge of population and quantitative genetics would be useful but not required.",
    "prereq": {}
  },
  {
    "uid": "827230",
    "code": "APSC8223",
    "subject": "APSC",
    "number": "8223",
    "honors": false,
    "writing": false,
    "name": "Describing Genetic Diversity",
    "fullname": "Describing Genetic Diversity",
    "info": "Understanding how diversity is partitioned within populations is essential to breeding and allows us to make inferences about population history and taxonomy. As sequencing and genotyping technologies get cheaper and more universally available, these types of analyses are possible in more and more crops. While the tools to carry out such analyses are often relatively simple and user-friendly, correctly implementing and interpreting them is much more difficult. In this course, we will discuss several common ways of representing and describing genetic diversity, explore the theory underlying them, and develop an understanding of their strengths, weaknesses, and proper application. This is a graduate-level discussion and reading-heavy course appropriate for anyone interested in understanding how we quantify and describe genetic diversity. The class will include a brief overview of population genetics before focusing on commonly used analysis methods.",
    "prereq": {}
  },
  {
    "uid": "817911",
    "code": "APSC8270",
    "subject": "APSC",
    "number": "8270",
    "honors": false,
    "writing": false,
    "name": "Graduate Seminar",
    "fullname": "Graduate Seminar",
    "info": "Examine qualities of effective scientific presentations. Develop skills in presenting scientific information effectively. Practice public speaking skills. Presenting scientific information to the general public. Organize a seminar series. \n\nprereq: Graduate major in Applied Plant Sciences",
    "prereq": {}
  },
  {
    "uid": "817912",
    "code": "APSC8280",
    "subject": "APSC",
    "number": "8280",
    "honors": false,
    "writing": false,
    "name": "Topics Applied Plant Sciences",
    "fullname": "Current Topics in Applied Plant Sciences",
    "info": "This variable-credit course is a forum for learning and discussing contemporary topics in applied plant sciences. The topics covered differ according to the instructor and term that the class is taught.",
    "prereq": {}
  },
  {
    "uid": "788076",
    "code": "APSC8333",
    "subject": "APSC",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788313",
    "code": "APSC8444",
    "subject": "APSC",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788439",
    "code": "APSC8666",
    "subject": "APSC",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788569",
    "code": "APSC8777",
    "subject": "APSC",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787826",
    "code": "APSC8888",
    "subject": "APSC",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "826813",
    "code": "APSC8901",
    "subject": "APSC",
    "number": "8901",
    "honors": false,
    "writing": false,
    "name": "Thesis Proposal Preparation",
    "fullname": "Thesis Proposal Preparation",
    "info": "The overall mission of this course is to provide a forum and timeline for first-year Applied Plant Sciences (APS) students to learn about their projects, develop writing and reviewing skills, and get to know the other students in their cohort. The course has four specific purposes: (1) Increase student understanding of their research projects; (2) Encourage planning and research discussions between APS graduate students with their advisors and committee members; (3) Provide experience and guidance to students with the proposal writing, editing, and peer-review process; and (4) Facilitate the preparation of student thesis proposals, in accordance with the APS program requirements. The final product of this effort will be a drafted thesis proposal that each student will submit to their committee members and the program. Submission of a complete proposal to the student's committee and the APS program is required to complete this course.\n\nprereq: APS Graduate Student",
    "prereq": {}
  }
]