[
  {
    "uid": "826369",
    "code": "ARAB1001",
    "subject": "ARAB",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Survival Arabic",
    "fullname": "Survival Arabic",
    "info": "In this two-credit course, you will learn fundamental Arabic skills that allow you to interact successfully in Arabic with native speakers of the language, and navigate environments where Arabic is written and spoken. Topics we cover include greeting and inquiring about people; using appropriate politeness phrases; giving and following directions; ordering meals; making transactions and reservations; and getting medical care. You will also learn about Arab communities and societies and explore examples of popular culture from the Arabic-speaking world. This practice-oriented course is a great introduction to Arabic for college and high-school students, researchers, professionals, and travelers. It can be taken on its own or as a prequel to Arabic study during the academic year. This course is taught in person and has no prerequisites.",
    "prereq": {}
  },
  {
    "uid": "005526",
    "code": "ARAB1101",
    "subject": "ARAB",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Beginning Arabic I",
    "fullname": "Beginning Arabic I",
    "info": "After learning the Arabic script, you will develop your ability to communicate in Arabic about yourself, your community, and your environment. You will learn to speak, write, read, and listen to meet the demands of daily life. You will learn to inquire about others and negotiate meaning with them, and to interpret concise print, oral, and digital texts. You will also begin to explore the rich cultural diversity of the Arab world. This class is taught following a communicative and interactive approach and is focused on practice.",
    "prereq": {}
  },
  {
    "uid": "005527",
    "code": "ARAB1102",
    "subject": "ARAB",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Beginning Arabic II",
    "fullname": "Beginning Arabic II",
    "info": "As the continuation of ARAB-1101, ARAB-1102 focuses on the equal development of the fundamental skills of speaking, writing, reading, and listening in Modern Standard Arabic. Content is tailored to meet the communicative demands of daily life. Class time is mostly devoted to practice. In addition to daily homework assignments, students give oral presentations, compose basic essays, and work on an oral or written project. Attendance of this class is required for all five weekly contact hours. \n\nPre-req: pass in ARAB-1101/4101, or equivalent experience as assessed through a placement test.",
    "prereq": {}
  },
  {
    "uid": "827196",
    "code": "ARAB1105",
    "subject": "ARAB",
    "number": "1105",
    "honors": false,
    "writing": false,
    "name": "Jumpstart Beginning Arabic I",
    "fullname": "Jumpstart Beginning Arabic I",
    "info": "This course is designed for novice learners of Arabic who are not entirely new to the study of the language. Specifically, if you have learned the Arabic alphabet and are able to greet people and introduce yourself in Arabic, this beginning-level Arabic course is for you. It differs from ARAB 1101/ 4101, Beginning Arabic I, in that we skip learning the Arabic alphabet. As in ARAB 1101/4101, we cover lessons one through five in al-Kitaab Part I, and practice an Arabic colloquial once a week. While ARAB 1101/4101 meets five times per week, we meet four times a week. At the end of this course, you will be ready to take ARAB 1102/4102, Beginning Arabic II.\n\nYour Arabic study will focus on the fundamental skills of speaking, reading, writing, and listening, as well as on basic language skills needed to meet the demands of daily life. While Mondays through Wednesdays are focused on Modern Standard, our Thursday class periods will be dedicated to colloquial Arabic. Our work on both registers in this course will enable you to communicate efficiently in both informal and formal settings.\n\nInstruction will be in Arabic, with some English. Arabic is intended to be the main medium of communication in the classroom. The al-Kitaab textbook provides explanations about pronunciation and grammar in English. You will be responsible for studying these explanations at home and joining our class sessions prepared to ask and answer questions and ready to practice. Class time will be devoted to practicing Arabic. This class is taught following a communicative and interactive approach, which means that you will be expected to engage and participate intensively.\n\nAs your instructor, I see it as my role to support not only the development of your linguistic abilities in Arabic, but also your familiarity with the rich cultures of the Arab world. Therefore, we will explore a variety of cultural and artistic materials. You can expect your class to be diverse, creative, and challenging.",
    "prereq": {}
  },
  {
    "uid": "008870",
    "code": "ARAB1201",
    "subject": "ARAB",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Reading in Arabic  I",
    "fullname": "Reading in Arabic I",
    "info": "Reading authentic texts/articles in Arabic. Translation, interpretation.",
    "prereq": {}
  },
  {
    "uid": "008871",
    "code": "ARAB1202",
    "subject": "ARAB",
    "number": "1202",
    "honors": false,
    "writing": false,
    "name": "Reading in Arabic II",
    "fullname": "Reading in Arabic II",
    "info": "Reading authentic texts/articles in Arabic. Translation, interpretation.",
    "prereq": {}
  },
  {
    "uid": "825631",
    "code": "ARAB1900",
    "subject": "ARAB",
    "number": "1900",
    "honors": false,
    "writing": false,
    "name": "Topics in Arabic",
    "fullname": "Topics in Arabic",
    "info": "Topics specified in course guide.",
    "prereq": {}
  },
  {
    "uid": "820449",
    "code": "ARAB3030",
    "subject": "ARAB",
    "number": "3030",
    "honors": false,
    "writing": false,
    "name": "Arabic Content-Based Instructi",
    "fullname": "Arabic Content-Based Instruction",
    "info": "Topics in Arabic culture held in conjunction with colloquial language courses.",
    "prereq": {}
  },
  {
    "uid": "005436",
    "code": "ARAB3036",
    "subject": "ARAB",
    "number": "3036",
    "honors": false,
    "writing": false,
    "name": "Islam",
    "fullname": "Islam: Religion and Culture",
    "info": "Religion of Islam, faith, practices, sectarian splintering, expansion outside original home to status of world religion, institutions, status in world societies--Asia, Europe, the Americas.",
    "prereq": {}
  },
  {
    "uid": "005528",
    "code": "ARAB3101",
    "subject": "ARAB",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Intermediate Arabic I",
    "fullname": "Intermediate Arabic I",
    "info": "This course is designed for students who have successfully completed two semesters of intensive Beginner Modern Standard Arabic. Like its prequels, Intermediate Arabic I focuses on the equal development of the fundamental skills of speaking, writing, reading, and listening in Modern Standard Arabic. This course is designed as a communicative and interactive learning environment, with a strong emphasis on practice. Presentations, oral interaction and writing samples are expected to become lengthier and more intricate. Students study increasingly complex grammar through engagement with authentic oral, print and digital texts. \n\nprereq: pass in Arab 1102/4102 or equivalent experience as assessed through a placement test.",
    "prereq": {
      "or": [
        "005527",
        "801544"
      ]
    }
  },
  {
    "uid": "005529",
    "code": "ARAB3102",
    "subject": "ARAB",
    "number": "3102",
    "honors": false,
    "writing": false,
    "name": "Intermediate Arabic II",
    "fullname": "Intermediate Arabic II",
    "info": "This course is designed for students who have successfully completed three semesters of intensive Modern Standard Arabic. Like its prequels, Intermediate Arabic II focuses on the equal development of the fundamental skills of speaking, writing, reading, and listening in Modern Standard Arabic. Thematic units, however, transcend the communicative needs of daily life to include communication about subjects of a broader cultural, historical and sociological relevance. This course is designed as a communicative and interactive learning environment, with a strong emphasis on practice. Presentations, oral interaction, and writing samples are expected to become lengthier and more intricate. Students study increasingly complex grammar through engagement with authentic oral, print, and digital texts. \n\nPre-req: pass in ARAB-3101/4122 or equivalent experience as assessed through a placement test.",
    "prereq": {}
  },
  {
    "uid": "826370",
    "code": "ARAB3201",
    "subject": "ARAB",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Arabic Calligraphy",
    "fullname": "Arabic Calligraphy",
    "info": "In this course, you will study the history of Arabic calligraphy and explore various calligraphic styles. You will learn about the work of well-known Arab calligraphers, and about the ways in which visual artists from the Arab world have incorporated calligraphy into their work. Additionally, you will practice creating your own calligraphic work under the guidance of your instructor.\nPrerequisite: Minimal knowledge of the Arabic alphabet required; can be developed by means of concurrent registration in an Arabic language course.",
    "prereq": {}
  },
  {
    "uid": "805099",
    "code": "ARAB3290",
    "subject": "ARAB",
    "number": "3290",
    "honors": false,
    "writing": false,
    "name": "Arabic Teaching Tutorial",
    "fullname": "Arabic Language Teaching Tutorial",
    "info": "Students tutor beginning students of Arabic and are part of department's Arabic language team.\n\nprereq: Grade of A in 3102/4122",
    "prereq": {
      "or": [
        "005529",
        "801545"
      ]
    }
  },
  {
    "uid": "005347",
    "code": "ARAB3491",
    "subject": "ARAB",
    "number": "3491",
    "honors": false,
    "writing": false,
    "name": "Islam Civilization",
    "fullname": "Classical Islamic Civilization",
    "info": "Islamic legacy in the classical age (800-1400), including medical and natural sciences, mathematics, philosophy, literature, and their transmission to Europe.",
    "prereq": {}
  },
  {
    "uid": "006278",
    "code": "ARAB3505",
    "subject": "ARAB",
    "number": "3505",
    "honors": false,
    "writing": false,
    "name": "Modern Middle East",
    "fullname": "Survey of the Modern Middle East",
    "info": "Peoples, lands, and cultures of the Middle East.  Historical survey from earliest civilizations to the present.",
    "prereq": {}
  },
  {
    "uid": "008836",
    "code": "ARAB3514",
    "subject": "ARAB",
    "number": "3514",
    "honors": false,
    "writing": false,
    "name": "African-Arabic Lit",
    "fullname": "African-Arabic Literature in Translation",
    "info": "Literature from continental Africa in Arabic. Novels, short stories, poetry, and drama by such writers as Abd-al-Hayy, Abd-al-Sabur, Mahfouz, El-Saadawi, and Wattar. No knowledge of Arabic required.",
    "prereq": {}
  },
  {
    "uid": "013781",
    "code": "ARAB3524",
    "subject": "ARAB",
    "number": "3524",
    "honors": false,
    "writing": false,
    "name": "The Qur'an",
    "fullname": "Introduction to the Qur'an",
    "info": "Textual, thematic, interpretive, and narrative aspects of the Qur'an and its influence on modern Arabic literature. All readings in English.",
    "prereq": {}
  },
  {
    "uid": "004907",
    "code": "ARAB3541",
    "subject": "ARAB",
    "number": "3541",
    "honors": false,
    "writing": false,
    "name": "Islam: Catholic Age",
    "fullname": "Islam in the Catholic Age: Arab Phase 600 A.D. to 900 A.D.",
    "info": "The rise of Islam in its Arabian setting. Roles of the prophet, the Orthodox and Umayyad Caliphs. Development of the Islamic state and empire. Status of Muslims and non-Muslims.",
    "prereq": {}
  },
  {
    "uid": "004910",
    "code": "ARAB3542",
    "subject": "ARAB",
    "number": "3542",
    "honors": false,
    "writing": false,
    "name": "Medieval Islam",
    "fullname": "Medieval Islam",
    "info": "Islamic dynasties, Mamluks and Mongols, Crusaders and Assassins. Abbasid Caliphate's disintegration and rise of Seljuk Turks.",
    "prereq": {}
  },
  {
    "uid": "004911",
    "code": "ARAB3543",
    "subject": "ARAB",
    "number": "3543",
    "honors": false,
    "writing": false,
    "name": "Arabs under Ottoman",
    "fullname": "Arabs Under Mamluks and Ottomans: 1300-1920",
    "info": "Struggle against Crusaders and Mongols.  Disintegration and reemergence under Muhammad Ali of Egypt; dynastic struggles in Syria; rise of Young Turks; Arab revolt.",
    "prereq": {}
  },
  {
    "uid": "005346",
    "code": "ARAB3544",
    "subject": "ARAB",
    "number": "3544",
    "honors": false,
    "writing": false,
    "name": "Recent Arab World",
    "fullname": "Arab World 1920 to the Present",
    "info": "Struggle in the Arab world for independence and its course since independence. Emphasis on development, political stability and unity; political structures; the Arab-Israeli conflict.",
    "prereq": {}
  },
  {
    "uid": "005437",
    "code": "ARAB3547",
    "subject": "ARAB",
    "number": "3547",
    "honors": false,
    "writing": false,
    "name": "Ottoman History",
    "fullname": "The Ottoman Empire",
    "info": "Founding of Ottoman society and state to empire, 1300 to end of the empire in 1920.  Lands, institutions, peoples, legacy, impact on Europe.",
    "prereq": {}
  },
  {
    "uid": "816504",
    "code": "ARAB3811",
    "subject": "ARAB",
    "number": "3811",
    "honors": false,
    "writing": false,
    "name": "Egyptian Colloquial Arabic I",
    "fullname": "Egyptian Colloquial Arabic I",
    "info": "This course is designed for students of Arabic who have taken a minimum of two semesters of Modern Standard Arabic (ARAB 1101 and 1102), or the equivalent thereof as determined by a placement test. The course provides training in the fundamentals of Egyptian Colloquial Arabic, one of the most widely-spoken and widely-understood Arabic vernaculars. Students practice the expression and comprehension of communicative needs in a variety of daily-life, informal situations. In addition, they are acquainted with a range of authentic cultural materials (film, TV broadcasts, songs) in Egyptian Arabic. The course relies heavily on oral practice and class periods are designed to be interactive.\n\nCredit will not be granted if student has already taken ARAB 3900 Fall 2015, Summer 2016",
    "prereq": {}
  },
  {
    "uid": "816505",
    "code": "ARAB3812",
    "subject": "ARAB",
    "number": "3812",
    "honors": false,
    "writing": false,
    "name": "Egyptian Colloquial Arabic II",
    "fullname": "Egyptian Colloquial Arabic II",
    "info": "As the continuation of ARAB 3811 Egyptian Colloquial Arabic I, this course focuses on further developing oral expression and comprehension skills in Egyptian Arabic. By practicing the target language, students explore important elements of Egyptian culture and history and engage with a dynamic cross-section of authentic media and cultural material including film, television, news, and music. The course relies heavily on oral practice and class periods are designed to be interactive. Textbooks used are Samia Louis' Kallimni 'Arabi and Kallimni 'Arabi Aktar. The course is designed for students of Arabic who have completed Egyptian Colloquial Arabic I, or the equivalent thereof, as determined by a placement test. This course is open to non-native speakers and non-heritage learners of Arabic only. As a 3-credit course, it cannot be taken in lieu of ARAB 3101 or ARAB 3102 to fulfill the CLA second language requirement. It can, however, be taken concurrently with these classes.\n\nCredit will not be granted if student has already taken ARAB 3900 Spring 2016, Summer 2016",
    "prereq": {}
  },
  {
    "uid": "819049",
    "code": "ARAB3813",
    "subject": "ARAB",
    "number": "3813",
    "honors": false,
    "writing": false,
    "name": "Jordanian Colloquial Arabic",
    "fullname": "Jordanian Colloquial Arabic",
    "info": "This course is designed for students of Arabic who have taken minimum two semesters of Modern Standard Arabic (ARAB 1101 & 1102), or the equivalent thereof as determined by a placement test. The course provides training in the fundamentals of Jordanian and Palestinian spoken Arabic, which is widely understood all over the Arab world, and is also very similar to the Arabic spoken in Syria and Lebanon. This course specifically revolves around the development of your speaking, listening and transcultural skills. It will provide you with many opportunities to speak, watch, and listen to Jordanian Arabic and to learn about the cultures and societies of the Levant. The course aims to increase your ability to successfully navigate the variety of Arabic language registers, and to substantially improve your cultural competence. \nThis course is open to non-native speakers and non-heritage learners of Arabic only. As a 3-credit course, it cannot be taken in lieu of ARAB 3101 or ARAB 3102 to fulfill the CLA second language requirement. It can, however, be taken concurrently with these classes. ",
    "prereq": {}
  },
  {
    "uid": "825266",
    "code": "ARAB3814",
    "subject": "ARAB",
    "number": "3814",
    "honors": false,
    "writing": false,
    "name": "Gulf Colloquial Arabic",
    "fullname": "Gulf Colloquial Arabic",
    "info": "This course is designed for students of Arabic who have taken minimum two semesters of Modern Standard Arabic (ARAB 1101 & 1102), or the equivalent thereof as determined by a placement test. The course provides training in the fundamentals of the spoken Arabic of the Arabian Peninsula region. You will learn how to participate with ease and confidence in informal conversations in Gulf Colloquial Arabic around topics in the domestic and informal sphere, as well as some general interest topics of communal/regional relevance. You will engage with a wide variety of authentic popular culture materials from the region, and will explore a variety of cultural practices prevalent in the Arabian Peninsula region, thereby substantially improving your intercultural competence.\nThis course is open to non-native speakers and non-heritage learners of Arabic only. As a 3-credit course, it cannot be taken in lieu of ARAB 3101 or ARAB 3102 to fulfill the CLA second language requirement. It can, however, be taken concurrently with these classes. ",
    "prereq": {}
  },
  {
    "uid": "787718",
    "code": "ARAB3900",
    "subject": "ARAB",
    "number": "3900",
    "honors": false,
    "writing": false,
    "name": "Topics in Arabic",
    "fullname": "Topics in Arabic",
    "info": "Topics specified in course guide.",
    "prereq": {}
  },
  {
    "uid": "820535",
    "code": "ARAB3920",
    "subject": "ARAB",
    "number": "3920",
    "honors": false,
    "writing": false,
    "name": "Topics: Arabic Culture",
    "fullname": "Topics in Arabic Culture",
    "info": "Selected topics in Arabic culture. Topics specified in the Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "005348",
    "code": "ARAB3993",
    "subject": "ARAB",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "For advanced students with individual faculty members.\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "802356",
    "code": "ARAB4101",
    "subject": "ARAB",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Beg Arabic I Grad Research",
    "fullname": "Beginning Arabic I for Graduate Student Research",
    "info": "After learning the Arabic script, you will develop your ability to communicate in Arabic about yourself, your community and your environment. You will learn to speak, write, read, and listen to meet the demands of daily life. You will learn to inquire about others and negotiate meaning with them, and to interpret concise print, oral, and digital texts. You will also begin to explore the rich cultural diversity of the Arab world. This class is taught following a communicative and interactive approach and is focused on practice.",
    "prereq": {}
  },
  {
    "uid": "801544",
    "code": "ARAB4102",
    "subject": "ARAB",
    "number": "4102",
    "honors": false,
    "writing": false,
    "name": "Beg Arabic II Grad Research",
    "fullname": "Beginning Arabic II for Graduate Student Research",
    "info": "Comprehension, oral practice, reading of standard Arabic. Meets with 1102.\n\nprereq: 4101 or equiv",
    "prereq": {
      "or": [
        "802356"
      ]
    }
  },
  {
    "uid": "827197",
    "code": "ARAB4105",
    "subject": "ARAB",
    "number": "4105",
    "honors": false,
    "writing": false,
    "name": "Jump BegArabic I Grad Research",
    "fullname": "Jumpstart Beginning Arabic I Graduate Student Research",
    "info": "This course is designed for novice learners of Arabic who are not entirely new to the study of the language. Specifically, if you have learned the Arabic alphabet and are able to greet people and introduce yourself in Arabic, this beginning-level Arabic course is for you. It differs from ARAB 1101/ 4101, Beginning Arabic I, in that we skip learning the Arabic alphabet. As in ARAB 1101/4101, we cover lessons one through five in al-Kitaab Part I, and practice an Arabic colloquial once a week. While ARAB 1101/4101 meets five times per week, we meet four times a week. At the end of this course, you will be ready to take ARAB 1102/4102, Beginning Arabic II.\n\nYour Arabic study will focus on the fundamental skills of speaking, reading, writing, and listening, as well as on basic language skills needed to meet the demands of daily life. While Mondays through Wednesdays are focused on Modern Standard, our Thursday class periods will be dedicated to colloquial Arabic. Our work on both registers in this course will enable you to communicate efficiently in both informal and formal settings.\n\nInstruction will be in Arabic, with some English. Arabic is intended to be the main medium of communication in the classroom. The al-Kitaab textbook provides explanations about pronunciation and grammar in English. You will be responsible for studying these explanations at home and joining our class sessions prepared to ask and answer questions, and ready to practice. Class time will be devoted to practicing Arabic. This class is taught following a communicative and interactive approach, which means that you will be expected to engage and participate intensively.\n\nAs your instructor, I see it as my role to support not only the development of your linguistic abilities in Arabic, but also your familiarity with the rich cultures of the Arab world. Therefore, we will explore a variety of cultural and artistic materials. You can expect your class to be diverse, creative, and challenging.",
    "prereq": {}
  },
  {
    "uid": "802312",
    "code": "ARAB4121",
    "subject": "ARAB",
    "number": "4121",
    "honors": false,
    "writing": false,
    "name": "Int Arabic I Grad Research",
    "fullname": "Intermediate Arabic I for Graduate Student Research",
    "info": "This course is designed for students who have successfully completed two semesters of intensive Beginner Modern Standard Arabic. Like its prequels, Intermediate Arabic I focuses on the equal development of the fundamental skills of speaking, writing, reading, and listening in Modern Standard Arabic. This course is designed as a communicative and interactive learning environment, with a strong emphasis on practice. Presentations, oral interaction, and writing samples are expected to become lengthier and more intricate. Students study increasingly complex grammar through engagement with authentic oral, print, and digital texts. \n\nprereq: pass in Arab 1102/4102 or equivalent experience as assessed through a placement test.",
    "prereq": {
      "or": [
        "005527",
        "801544"
      ]
    }
  },
  {
    "uid": "801545",
    "code": "ARAB4122",
    "subject": "ARAB",
    "number": "4122",
    "honors": false,
    "writing": false,
    "name": "Int Arabic II Grad Research",
    "fullname": "Intermediate Arabic II for Graduate Student Research",
    "info": "Advanced grammar, analyses of readings, oral comprehension. Meets with 3102.\n\nprereq: 4121 or equiv",
    "prereq": {
      "or": [
        "802312"
      ]
    }
  },
  {
    "uid": "819779",
    "code": "ARAB4811",
    "subject": "ARAB",
    "number": "4811",
    "honors": false,
    "writing": false,
    "name": "Egyptian Arabic I Grad Resrch",
    "fullname": "Egyptian Colloquial Arabic I for Graduate Research",
    "info": " This course is designed for students of Arabic who have taken a minimum of two semesters of Modern Standard Arabic (ARAB 1101 and 1102), or the equivalent thereof as determined by a placement test. The course provides training in the fundamentals of Egyptian Colloquial Arabic, one of the most widely-spoken and widely-understood Arabic vernaculars. Students practice the expression and comprehension of communicative needs in a variety of daily-life, informal situations. In addition, they are acquainted with a range of authentic cultural materials (film, TV broadcasts, songs) in Egyptian Arabic. The course relies heavily on oral practice and class periods are designed to be interactive.\nMeets with ARAB 3811.",
    "prereq": {}
  },
  {
    "uid": "819780",
    "code": "ARAB4813",
    "subject": "ARAB",
    "number": "4813",
    "honors": false,
    "writing": false,
    "name": "Jordanian Arabic Grad Research",
    "fullname": "Jordanian Colloquial Arabic for Graduate Research",
    "info": "This course is designed for students of Arabic who have taken minimum two semesters of Modern Standard Arabic (ARAB 1101 & 1102), or the equivalent thereof as determined by a placement test. The course provides training in the fundamentals of Jordanian and Palestinian spoken Arabic, which is widely understood all over the Arab world, and is also very similar to the Arabic spoken in Syria and Lebanon. This course specifically revolves around the development of your speaking, listening and transcultural skills. It will provide you with many opportunities to speak, watch, and listen to Jordanian Arabic and to learn about the cultures and societies of the Levant. The course aims to increase your ability to successfully navigate the variety of Arabic language registers, and to substantially improve your cultural competence. \nThis course is open to non-native speakers and non-heritage learners of Arabic only. ",
    "prereq": {}
  },
  {
    "uid": "825090",
    "code": "ARAB4814",
    "subject": "ARAB",
    "number": "4814",
    "honors": false,
    "writing": false,
    "name": "Gulf Arabic Grad Research",
    "fullname": "Gulf Colloquial Arabic for Graduate Research",
    "info": "This course is designed for students of Arabic who have taken minimum two semesters of Modern Standard Arabic (ARAB 1101 & 1102), or the equivalent thereof as determined by a placement test. The course provides training in the fundamentals of the spoken Arabic of the Arabian Peninsula region. You will learn how to participate with ease and confidence in informal conversations in Gulf Colloquial Arabic around topics in the domestic and informal sphere, as well as some general interest topics of communal/regional relevance. You will engage with a wide variety of authentic popular culture materials from the region, and will explore a variety of cultural practices prevalent in the Arabian Peninsula region, thereby substantially improving your intercultural competence.\nThis course is open to non-native speakers and non-heritage learners of Arabic only. ",
    "prereq": {}
  },
  {
    "uid": "007010",
    "code": "ARAB5001",
    "subject": "ARAB",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Research Methods",
    "fullname": "Research Methods in Arabic Studies",
    "info": "Skills and techniques required to deal with medieval and modern works in Arabic literature and Islam.  A survey of the most important research bibliographies in Arabic and Islamic studies. Bibliographic references in English and, when appropriate, Arabic.",
    "prereq": {}
  },
  {
    "uid": "008832",
    "code": "ARAB5011",
    "subject": "ARAB",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Islam in Africa",
    "fullname": "Islam in Africa",
    "info": "Ideological, doctrinal, and ritual aspects of continental African Islam. Emphasis on various religious brotherhoods and Sufi orders from different African countries in the 20th century.  No knowledge of Arabic required.",
    "prereq": {}
  },
  {
    "uid": "016252",
    "code": "ARAB5036",
    "subject": "ARAB",
    "number": "5036",
    "honors": false,
    "writing": false,
    "name": "Islam",
    "fullname": "Islam: Religion and Culture",
    "info": "Religion of Islam, faith, practices, sectarian splintering, expansion outside original home to status of world religion, institutions, status in world societies - Asia, Europe, Americas.",
    "prereq": {}
  },
  {
    "uid": "816768",
    "code": "ARAB5040",
    "subject": "ARAB",
    "number": "5040",
    "honors": false,
    "writing": false,
    "name": "Readings in Arabic Texts",
    "fullname": "Readings in Arabic Texts",
    "info": "Post-advanced study of extensive, complex original Arabic texts and development of students' Arabic discussion and writing skills in the realms of literature, academia, media and/or business. All primary and secondary readings, assignments, in-class analysis and discussion are done fully in Arabic.  Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "818601",
    "code": "ARAB5041",
    "subject": "ARAB",
    "number": "5041",
    "honors": false,
    "writing": false,
    "name": "Classical/Modern Arabic Prose",
    "fullname": "Classical and Modern Arabic Prose",
    "info": "In this class, students read extensive, complex, original Arabic texts and develop their academic discussion and writing skills in Arabic. The course covers a substantial number of Arabic literary texts of different genres and time periods: excerpts of the Prophet's biography, classical treatises and travel writing, stories from the \"1001 Nights,\" 20th-century short stories, and short novels. To contextualize the literary texts, students read secondary texts also composed in Arabic and engage with Arabic audiovisual materials (video clips, TV interviews, songs) in class and at home. In-class analysis and discussion of the texts is conducted exclusively in Arabic. prereq: ARAB 5102 or the equivalent thereof as established by a placement test",
    "prereq": {
      "or": [
        "005531"
      ]
    }
  },
  {
    "uid": "005530",
    "code": "ARAB5101",
    "subject": "ARAB",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Advanced Arabic I",
    "fullname": "Advanced Arabic I",
    "info": "Advanced readings in classical/modern Arabic. Compositions based on texts.\n\nprereq: Grade B- or higher in 3102 or instr consent",
    "prereq": {
      "or": [
        "005529"
      ]
    }
  },
  {
    "uid": "005531",
    "code": "ARAB5102",
    "subject": "ARAB",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Advanced Arabic II",
    "fullname": "Advanced Arabic II",
    "info": "Readings of Arabic texts. Writing compositions based on texts. Continuation of 5101.",
    "prereq": {}
  },
  {
    "uid": "797054",
    "code": "ARAB5491",
    "subject": "ARAB",
    "number": "5491",
    "honors": false,
    "writing": false,
    "name": "Islam Civilization",
    "fullname": "Classical Islamic Civilization",
    "info": "Islamic legacy in the classical age (800-1400), including medical/natural sciences, mathematics, philosophy, literature, and their transmission to Europe.",
    "prereq": {}
  },
  {
    "uid": "007004",
    "code": "ARAB5501",
    "subject": "ARAB",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Arabic Poetry",
    "fullname": "Modern Arabic Poetry in Translation",
    "info": "Free verse movement and its major trends: post-romantic, social realist, symbolist, resistance, prose poem. Emphasizes leading poets such as al-Mala'ika, al-Sayyab, al-Bayati, and Adunis. Theoretical/critical essays. All readings in English.",
    "prereq": {}
  },
  {
    "uid": "007005",
    "code": "ARAB5502",
    "subject": "ARAB",
    "number": "5502",
    "honors": false,
    "writing": false,
    "name": "Arabic Novel",
    "fullname": "The Arabic Novel in Translation",
    "info": "The novel as a new genre in Arabic literature. Trends: realist, psychological, existentialist, feminist, post-modernist, fantastic, experimentalist. Emphasizes major writers such as Mahfouz, Ghanem, Salih, Jabra, El Sa'dawi, Munif, and Khouri. Theoretical/critical essays. Cultural /historical context.",
    "prereq": {}
  },
  {
    "uid": "009520",
    "code": "ARAB5503",
    "subject": "ARAB",
    "number": "5503",
    "honors": false,
    "writing": false,
    "name": "Arabic Drama",
    "fullname": "Arabic Drama in Translation",
    "info": "Emergence and development of drama as a European-inspired genre in Arabic literature. Emphasizes major trends and playwrights. All readings in English.",
    "prereq": {}
  },
  {
    "uid": "792267",
    "code": "ARAB5505",
    "subject": "ARAB",
    "number": "5505",
    "honors": false,
    "writing": false,
    "name": "Modern Middle East",
    "fullname": "Survey of the Modern Middle East",
    "info": "Peoples, lands, and cultures of the Middle East.  Historical survey from earliest civilizations to the present.",
    "prereq": {}
  },
  {
    "uid": "788933",
    "code": "ARAB5541",
    "subject": "ARAB",
    "number": "5541",
    "honors": false,
    "writing": false,
    "name": "Islam: Catholic Age",
    "fullname": "Islam in the Catholic Age: Arab Phase 600 A.D. to 900 A.D.",
    "info": "The rise of Islam in its Arabian setting. Roles of the prophet, the Orthodox and Umayyad Caliphs. Development of the Islamic state and empire. Status of Muslims and non-Muslims.",
    "prereq": {}
  },
  {
    "uid": "788934",
    "code": "ARAB5542",
    "subject": "ARAB",
    "number": "5542",
    "honors": false,
    "writing": false,
    "name": "Medieval Islam",
    "fullname": "Medieval Islam",
    "info": "Islamic dynasties, Mamluks and Mongols, and Crusaders and Assassins.  Abbasid Caliphate's disintegration and rise of Seljuk Turks.",
    "prereq": {}
  },
  {
    "uid": "788960",
    "code": "ARAB5543",
    "subject": "ARAB",
    "number": "5543",
    "honors": false,
    "writing": false,
    "name": "Arabs under Ottoman",
    "fullname": "Arabs Under Mamluks and Ottomans: 1300-1920",
    "info": "Struggle against Crusaders and Mongols.  Disintegration and reemergence under Muhammad Ali of Egypt; dynastic struggles in Syria; rise of Young Turks; Arab revolt.",
    "prereq": {}
  },
  {
    "uid": "788961",
    "code": "ARAB5544",
    "subject": "ARAB",
    "number": "5544",
    "honors": false,
    "writing": false,
    "name": "Recent Arab World",
    "fullname": "Arab World 1920 to the Present",
    "info": "Struggle in the Arab world for independence and its course since independence. Emphasis on development, political stability and unity; political structures; the Arab-Israeli conflict.",
    "prereq": {}
  },
  {
    "uid": "007007",
    "code": "ARAB5678",
    "subject": "ARAB",
    "number": "5678",
    "honors": false,
    "writing": false,
    "name": "Afri-Arabic Fiction",
    "fullname": "Seminar: African-Arabic Fiction in Translation",
    "info": "African fiction in Arabic, including works of Barrada, Idris, Mahrouz, al-Matwi, El-Saadawi, and el-Zayat. Emphasizes twentieth century. Tests discussed in historical/cultural context. Theoretical/critical essays. All readings in English.",
    "prereq": {}
  },
  {
    "uid": "005350",
    "code": "ARAB5900",
    "subject": "ARAB",
    "number": "5900",
    "honors": false,
    "writing": false,
    "name": "Topics in Arabic",
    "fullname": "Topics in Arabic Literature and Culture",
    "info": "Readings and discussion of selected works in Arabic. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "005349",
    "code": "ARAB5993",
    "subject": "ARAB",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator. The Faculty member will ensure academic standards are upheld, including: \n\n-The work proposed is at the appropriate level for the course, academic in nature, and the student will be involved intellectually in the project. \n-The project scope is reasonable for one semester and the number of credits specified (42 hours of work per credit).\n-The faculty mentor is qualified to serve in this role.\n-Assessment of student learning and grading criteria are clear and appropriate.\n-The student will be working in a respectful, inclusive environment.\n",
    "prereq": {}
  },
  {
    "uid": "788077",
    "code": "ARAB8333",
    "subject": "ARAB",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)",
    "prereq": {}
  }
]