[
  {
    "uid": "797693",
    "code": "ARCH1281",
    "subject": "ARCH",
    "number": "1281",
    "honors": false,
    "writing": false,
    "name": "Design Fundamentals I",
    "fullname": "Design Fundamentals I",
    "info": "Using architecture broadly defined, students will develop essential habits of work and mind, as well as an ability to understand the relationship between drawing, making and exploring. The course will introduce and begin to build an understanding of the role of iteration and critique, as well as traditional and contemporary modes of representation in architecture.",
    "prereq": {}
  },
  {
    "uid": "819180",
    "code": "ARCH1621",
    "subject": "ARCH",
    "number": "1621",
    "honors": false,
    "writing": false,
    "name": "Intro to Critical Inquiry",
    "fullname": "Introduction to Critical Inquiry in Practice",
    "info": "This is an introductory course where we, including professors, students, and professionals, will discuss various topics related to architecture. Sometimes, we'll look back at the history of architecture to understand how it has changed over time. We'll discuss popular ideas and practices and how they have been used or misused. We'll also talk about new and\nemerging ideas in architecture that are being explored today all over the world. The word \"critical\" indicates that we'll be questioning and\nexamining old practices to see if they are still relevant to our modern, globalized world, or if they need to change, and where they might head in the future.",
    "prereq": {}
  },
  {
    "uid": "011259",
    "code": "ARCH1701",
    "subject": "ARCH",
    "number": "1701",
    "honors": false,
    "writing": false,
    "name": "Designed  Env",
    "fullname": "The Designed Environment",
    "info": "Examination of seminal issues in the designed environment, including relationships between place and space, and realms of the ideal and real,  public and private. Survey of how the fields of architecture, landscape architecture, and urban design have explored those issues.",
    "prereq": {}
  },
  {
    "uid": "798436",
    "code": "ARCH1905",
    "subject": "ARCH",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Architecture:  Ideas, Making",
    "fullname": "Architecture: Ideas, Making",
    "info": "Ideas about architecture as simultaneous/two-way relationship between thinking and making, between architecture as \"idea\" and as \"verb.\" Architecture as a group of conscious intentions within larger framework of our cultural past, present, and speculative future.",
    "prereq": {}
  },
  {
    "uid": "791483",
    "code": "ARCH1906W",
    "subject": "ARCH",
    "number": "1906",
    "honors": false,
    "writing": true,
    "name": "Waste Culture & Alternatives",
    "fullname": "Waste (Not): Envisioning Alternatives to a Throw-away Culture",
    "info": "What we use. What we waste. Thinking creatively about how to live/work more sustainably. How objects/environments might be designed to allow multiple uses, have longer life-cycles, or enable recycling/reuse.",
    "prereq": {}
  },
  {
    "uid": "797719",
    "code": "ARCH2281",
    "subject": "ARCH",
    "number": "2281",
    "honors": false,
    "writing": false,
    "name": "Design Fundamentals II",
    "fullname": "Design Fundamentals II",
    "info": "Foundation architectural design studio. Design principles, technical drawing, material manipulation.",
    "prereq": {}
  },
  {
    "uid": "011341",
    "code": "ARCH2301",
    "subject": "ARCH",
    "number": "2301",
    "honors": false,
    "writing": false,
    "name": "Drawing and Critical Thinking",
    "fullname": "Drawing and Critical Thinking",
    "info": "This course provides an in-depth foundation for understanding how drawing functions as a discipline-specific way of thinking, brings self-critical precision to non-verbal production, and supports processes of conceptual exploration. \n\nprereq: Arch 2281 or department consent",
    "prereq": {
      "or": [
        "797719"
      ]
    }
  },
  {
    "uid": "797718",
    "code": "ARCH3150",
    "subject": "ARCH",
    "number": "3150",
    "honors": false,
    "writing": false,
    "name": "Topics in Architecture:",
    "fullname": "Topics in Architecture",
    "info": "Selected topics in  architecture design, theory, representation, or history.",
    "prereq": {}
  },
  {
    "uid": "817306",
    "code": "ARCH3211",
    "subject": "ARCH",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "BDA: Image, Authorship, & Arch",
    "fullname": "BDA: Image, Authorship, and Architecture",
    "info": "Understanding the discipline and practice of architecture as fundamentally grounded in visual literacy, communication and authorship. Assignments and discussion help students: identify and characterize authorship of imagery; critically evaluate and converse about authorship of imagery; understand one's own authorship and its potential for growth, exploration and expression of visual themes in architecture.",
    "prereq": {}
  },
  {
    "uid": "817236",
    "code": "ARCH3212",
    "subject": "ARCH",
    "number": "3212",
    "honors": false,
    "writing": false,
    "name": "BDA: Analytical Modeling",
    "fullname": "BDA: Analytical Modeling of Contemporary Architecture",
    "info": "Insight into analytical modeling as one of the most important tools for a designer. Exercises, activities and iterative making of analytical models will help students to gain insight into works of contemporary architecture; analyze constituent elements and systems of form, space and order; investigate and make visible the underlying conceptual notions that generated the work; explore physical modeling as modes and techniques of analysis and representation; explore the specific issue of scale in analysis, representation and design resolution; read 2-D architectural drawings and translate them into 3-D physical form; and generally improve physical modeling skills.\n",
    "prereq": {}
  },
  {
    "uid": "816949",
    "code": "ARCH3221",
    "subject": "ARCH",
    "number": "3221",
    "honors": false,
    "writing": false,
    "name": "BDA: Masonry Dsgn & Constrctn",
    "fullname": "BDA: Masonry Design and Construction",
    "info": "This is a fast paced, high-energy course that combines modern design tools with the art and craft of making through a hands-on design-build process. This workshop is an opportunity for architecture students to learn and practice masonry design and construction by working directly with the Bricklayers & Allied Craftworkers (BAC) Local Union (Minnesota/North Dakota) Apprenticeship Training Center and in conjunction with the International Masonry Institute (IMI).",
    "prereq": {}
  },
  {
    "uid": "817237",
    "code": "ARCH3222",
    "subject": "ARCH",
    "number": "3222",
    "honors": false,
    "writing": false,
    "name": "BDA: Box Problem",
    "fullname": "BDA Box Problem",
    "info": "Students gain insight into the process of making by designing a wooden box that addresses a specific ritual, ceremony, event or activity of their choosing. The box will be evaluated on creativity, technique, craft, and risk.  Introduction and practice with a variety of woodworking joints and techniques used to construct a wooden box.  ",
    "prereq": {}
  },
  {
    "uid": "817467",
    "code": "ARCH3223",
    "subject": "ARCH",
    "number": "3223",
    "honors": false,
    "writing": false,
    "name": "BDA: Screen Test: Metal Work",
    "fullname": "BDA: Screen Test: Metal Work",
    "info": "Understanding the screen as an architectural element and screening as an architectural device. Understanding the nature of making and material craft in the design process, specifically metals and metal alloys designed and fabricated as architectural screen panels. Students develop: ability to understand, work with and transform metals; design vocabulary around screens, screening and patterns in architecture; design ideas as material assemblies and spatial propositions; verbal and visual communication skills as part of the design process; criteria for making design decision relevant for using screens, screening and patterns in architecture.\n",
    "prereq": {}
  },
  {
    "uid": "819826",
    "code": "ARCH3231",
    "subject": "ARCH",
    "number": "3231",
    "honors": false,
    "writing": false,
    "name": "Intensive Applications",
    "fullname": "Intensive Applications Design Workshop",
    "info": "\nBDA design core workshops develop your ability to critically approach a broad range of conditions through the lens of architecture.  This course will focus on critical inquiry of tangible architectural attributes such as material (assembly), site (context), or program (need). This workshop foregrounds analysis of measurable, physical and specific conditions, and favors local project sites and/or precedent projects.  The course offers a structure for moderately directed learning (including guided peer review), emphasizes iteration and process, and offers an opportunity to discover where and how your own interests align with broader opportunities as an emerging designer in architecture and/or other allied disciplines and design fields.\n",
    "prereq": {}
  },
  {
    "uid": "819827",
    "code": "ARCH3232",
    "subject": "ARCH",
    "number": "3232",
    "honors": false,
    "writing": false,
    "name": "Extensive Applications",
    "fullname": "Extensive Applications Design Workshop",
    "info": "\nBDA design core workshops develop your ability to critically approach a broad range of conditions through the lens of architecture.  This course focuses on the critical inquiry of latent or intangible attributes such as architecture's experiential, social, cultural, political, ethical, and poetic dimensions. Students in this course will engage architecture from the point of view of ephemeral conditions, theoretical understandings and operations, spatializing of data, and/or architectural inquiry applied to complex conditions or translations.   The course offers a structure for moderately directed learning (including guided peer review), emphasizes iteration and process, and offers an opportunity to discover where and how your own interests align with broader opportunities as an emerging designer in architecture and/or other allied disciplines and design fields.\n",
    "prereq": {}
  },
  {
    "uid": "800455",
    "code": "ARCH3250",
    "subject": "ARCH",
    "number": "3250",
    "honors": false,
    "writing": false,
    "name": "Design Workshop",
    "fullname": "Design Workshop",
    "info": "Design process as it relates to architecture. Hands-on projects involving interactive design process. Students develop rigorous/inventive graphic means of communicating.\n\nprereq: 2281, [Arch BA or BDA major]",
    "prereq": {
      "and": [
        "797719"
      ]
    }
  },
  {
    "uid": "817480",
    "code": "ARCH3261",
    "subject": "ARCH",
    "number": "3261",
    "honors": false,
    "writing": false,
    "name": "BDA: The Art of Daylighting",
    "fullname": "BDA: The Art of Daylighting Design: Exquisite Rooms",
    "info": "Daylighting design and luminous phenomena have long captured the imagination of designers and architects. The beauty and power of light and shadow inspires the work of the greatest architectural masters. This BDA Workshop explores the many roles of daylighting in architectural design and how it is shaped by the intersection of both poetic and performance goals and aspirations.  A select group of exquisite rooms of leading modern and contemporary architects will be compared and contrasted to gain insight into larger luminous design concepts, principles, strategies, and lessons on the art of daylighting design. Physical and computer models, photography, rendered drawings, diagramming, and computer analysis will be explored to understand the daylighting design philosophies, strategies, and details of 'Masters of Light' and the application of daylighting design lessons to an individual daylight investigation. Learning objectives are: to compare and contrast poetic and performance daylighting design concepts, principles, and strategies of modern and contemporary masters; to develop a comparative knowledge of daylighting theories and practices from case studies of exquisite rooms to gain the knowledge and skills necessary to effectively develop and assess qualitative and quantitative daylighting strategies; and to develop a personal daylighting design theory, process, and practice.\n",
    "prereq": {}
  },
  {
    "uid": "817481",
    "code": "ARCH3271",
    "subject": "ARCH",
    "number": "3271",
    "honors": false,
    "writing": false,
    "name": "BDA: Watercolor Sketching",
    "fullname": "BDA: Watercolor Sketching: Exploring Iconic Sites",
    "info": "Students will develop skills in representation and visualization using watercolor as a medium for examining architecture as material, structure and attitude. Students will explore creative methods in representation through a process of working en plein air. A new site of architectural significance will be visited each week. The goal of this design workshop is for students to discover and capture a sense of space, material and design in a personal manner, developing skills in representation as well as in design process. The way of working en plein air reflects a tradition in architecture of studying precedents in situ as well as an attitude captured by Frederick Frank in The Zen of Seeing, namely: To stop rushing around, to sit quietly on the grass, to switch off the world and come back to the earth, to allow the eye to see a willow, a bush, a cloud, a leaf, is an unforgettable experience.\n",
    "prereq": {}
  },
  {
    "uid": "798011",
    "code": "ARCH3281",
    "subject": "ARCH",
    "number": "3281",
    "honors": false,
    "writing": false,
    "name": "Arch. Studio 01: Material",
    "fullname": "Architecture Studio 01: Material",
    "info": "Students in this undergraduate studio practice an iterative, open-ended design process as it relates especially to the technical and experiential role of materials, material assembly, construction, structure, and tectonics in architecture. Students develop their ability to think through multiple modes of media, including physical and digital drawings and models, with an emphasis on physical model-making.\n\nprereq: Arch BS major and Arch 2301",
    "prereq": {
      "or": [
        "011341"
      ]
    }
  },
  {
    "uid": "011264",
    "code": "ARCH3282",
    "subject": "ARCH",
    "number": "3282",
    "honors": false,
    "writing": false,
    "name": "Architecture Studio 02: Site",
    "fullname": "Architecture Studio 02: Site",
    "info": "Students in this undergraduate studio practice an iterative, open-ended design process as it relates especially to the fundamental role of site as a technical and experiential context in architecture. Students learn to identify and explore the static, dynamic, tangible, and intangible forces that impact, and are impacted by, architectural interventions. Students develop their ability to think through multiple modes of media, including physical and digital drawings and models, with an emphasis on physical model-making. \n\nprereq: [3281 or 4281], BS Arch major",
    "prereq": {
      "or": [
        "798011",
        "011263"
      ]
    }
  },
  {
    "uid": "011352",
    "code": "ARCH3301",
    "subject": "ARCH",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Drwng Dsgn Arch",
    "fullname": "Drawing for Design in Architecture",
    "info": "Introduction to practical/conceptual function of drawing in architecture.\n\nprereq: [1301 or LA 1301 or 2301], [Arch or BED major]",
    "prereq": {
      "and": [
        {
          "or": [
            "797163",
            "803701"
          ]
        }
      ]
    }
  },
  {
    "uid": "809355",
    "code": "ARCH3312",
    "subject": "ARCH",
    "number": "3312",
    "honors": false,
    "writing": false,
    "name": "Drawing Infrastructure",
    "fullname": "Drawing Infrastructure",
    "info": "This course will explore both historic and modern infrastructure as cultural and engineering constructs through representation as a form of critical research. The course is location and content and focus will change as location of study program changes. The course will be structured around study trips, readings, on-site lectures and will be supplemented by the participation of several guest speakers.",
    "prereq": {}
  },
  {
    "uid": "797715",
    "code": "ARCH3351",
    "subject": "ARCH",
    "number": "3351",
    "honors": false,
    "writing": false,
    "name": "AutoCAD I",
    "fullname": "AutoCAD I",
    "info": "Concepts, tools, and techniques of computer-aided drawing with  current AutoCAD Release. Producing dimensioned/annotated drawings for plotting. 3-D drawing capabilities. Use of dimension variables, attributes, blocks, symbols.\n\nprereq: Arch major or BED major or instr consent",
    "prereq": {}
  },
  {
    "uid": "011852",
    "code": "ARCH3352",
    "subject": "ARCH",
    "number": "3352",
    "honors": false,
    "writing": false,
    "name": "AutoCAD II",
    "fullname": "AutoCAD II",
    "info": "Concepts, tools, and techniques of computer-aided drawing with current AutoCAD Release. Strategies for producing dimensioned/annotated drawing for plotting. Dimension variables, attributes, blocks, symbols. Creation of customized menus.",
    "prereq": {}
  },
  {
    "uid": "798040",
    "code": "ARCH3381",
    "subject": "ARCH",
    "number": "3381",
    "honors": false,
    "writing": false,
    "name": "Intro Comput Aided Arch Dsgn",
    "fullname": "Introduction to Computer Aided Architectural Design",
    "info": "Introduction to 2-D drawing, 3-D modeling/animation, printing, plotting. Electronic networking/communications, database management, spreadsheet analysis, land-use analysis, project management.\n\nprereq: Arch major or BED major or instr consent",
    "prereq": {}
  },
  {
    "uid": "816303",
    "code": "ARCH3391",
    "subject": "ARCH",
    "number": "3391",
    "honors": false,
    "writing": false,
    "name": "Design & Rep with BIM",
    "fullname": "Design and Representation with BIM",
    "info": "In this course, students will be introduced to the concept of Building Information Modeling (BIM) through the use of Autodesk Revit, one, one of the BIM software tools most commonly used in architectural practice today. \n\nStudents will engage in a series of design exercises that will require both learning and applying Revit in the context of real world architectural scenarios. In addition to learning Autodesk Revit as a design tool, we will examine the use of BIM technology within the architectural industry through a series of case study examples. Also, presenters will share firsthand accounts of CAD and BIM Software being implemented in architectural practice.",
    "prereq": {}
  },
  {
    "uid": "009938",
    "code": "ARCH3411W",
    "subject": "ARCH",
    "number": "3411",
    "honors": false,
    "writing": true,
    "name": "Architectural History to 1750",
    "fullname": "Architectural History to 1750",
    "info": "Built environment as a tool to study the human past from ancient times to 1750. Major trends of style and form and the relationships, practices, and beliefs that have shaped human behavior.\n\nprereq: Soph or above",
    "prereq": {}
  },
  {
    "uid": "011316",
    "code": "ARCH3412W",
    "subject": "ARCH",
    "number": "3412",
    "honors": false,
    "writing": true,
    "name": "Arch Hist since 1750",
    "fullname": "Architectural History Since 1750",
    "info": "Examples of the built environment from the Enlightenment to the present are studied within a broad social, cultural, and political context. Major architectural movements and their associated forms and designs.\n\nprereq: Soph or above",
    "prereq": {}
  },
  {
    "uid": "804944",
    "code": "ARCH3451W",
    "subject": "ARCH",
    "number": "3451",
    "honors": false,
    "writing": true,
    "name": "Theory in Design Use",
    "fullname": "Theory in Design Use",
    "info": "Introduction to contemporary architectural criticism. Ideas put forth by this criticism in three papers. Relating these ideas to student's own design work.\n\nprereq: [1701, 3311, 3312, [one BS design studio or two BDA workshops]",
    "prereq": {
      "and": [
        "011259",
        "809355"
      ]
    }
  },
  {
    "uid": "811594",
    "code": "ARCH3511",
    "subject": "ARCH",
    "number": "3511",
    "honors": false,
    "writing": false,
    "name": "Material Transformations",
    "fullname": "Material Transformations: Technology and Change in the Built Environment",
    "info": "Surveys development of significant architectural material technologies/their relationships to society/natural environment.",
    "prereq": {}
  },
  {
    "uid": "804945",
    "code": "ARCH3514",
    "subject": "ARCH",
    "number": "3514",
    "honors": false,
    "writing": false,
    "name": "Construction and Materials",
    "fullname": "Construction and Materials in Design Use",
    "info": "Vernacular Mexican materials and construction systems in courtyard building in Oaxaca. Issues in architectural materiality in design. Students develop materials/joints in their own designs.\n\nprereq: 1701, 3311, 3312, [one BS design studio or two BDA workshops]",
    "prereq": {
      "and": [
        "011259",
        "809355"
      ]
    }
  },
  {
    "uid": "787805",
    "code": "ARCH3611",
    "subject": "ARCH",
    "number": "3611",
    "honors": false,
    "writing": false,
    "name": "Design in the Digital Age",
    "fullname": "Design in the Digital Age",
    "info": "Introduction to design, design process. Developing/understanding ways of seeing, thinking, and acting as a designer. Changes in design being wrought by digital technology. Team design project.",
    "prereq": {}
  },
  {
    "uid": "804747",
    "code": "ARCH3641",
    "subject": "ARCH",
    "number": "3641",
    "honors": false,
    "writing": false,
    "name": "Intro to Heritage Preservation",
    "fullname": "Introduction to Heritage Preservation",
    "info": "Potential of, and challenges to, heritage preservation in the United States. Preservation's pros/cons. Lectures, readings, films, class discussions, assignments, local field trips, case studies.\n\nprereq: Jr or sr only",
    "prereq": {}
  },
  {
    "uid": "011373",
    "code": "ARCH3711W",
    "subject": "ARCH",
    "number": "3711",
    "honors": false,
    "writing": true,
    "name": "Env Design Soc-Cltrl Cntxt",
    "fullname": "Environmental Design and the Sociocultural Context",
    "info": "Designed environment as cultural medium/product of sociocultural process/expression of values, ideas, behavioral patterns. Design/construction as complex political process.\n\nprereq: Soph or above",
    "prereq": {}
  },
  {
    "uid": "809447",
    "code": "ARCH3722",
    "subject": "ARCH",
    "number": "3722",
    "honors": false,
    "writing": false,
    "name": "The City in Visual Culture",
    "fullname": "The City in Visual Culture",
    "info": "Grounded by the rich, complex and diverse architectural and urban contexts of the city, this course will examine how the spaces of the city are created, experienced and represented through its visual culture. The class will investigate how the physical landscape of the city has changed over time through all its historical incarnations. The course is location and content and focus will change as location of study program changes. The course will be structured around weekly seminars, readings, on-site lectures and will be supplemented by the participation of several guest speakers.",
    "prereq": {}
  },
  {
    "uid": "816881",
    "code": "ARCH3756",
    "subject": "ARCH",
    "number": "3756",
    "honors": false,
    "writing": false,
    "name": "Public Interest Design",
    "fullname": "Public Interest Design: Principles and Practices",
    "info": "As the allied fields of design evolve in response to an increasing number of global challenges - inequity, social and political turmoil, disruptive climate-change, accelerating population growth - the question of how designers will address the needs of the most vulnerable among us is fundamental.\n\nPublic Interest Design (PID), an emerging area of specialization within the design professions, specifically considers the concerns of the vast majority of the world?s inhabitants who are historically under-resourced and ill-equipped to respond to the ?Grand Challenges? facing humankind.  \n\nWith this mind, this introductory survey course has two aims:   \n\nFirst, to critically examine the range of environmental, economic, social, and ethical issues that underpins work with under-resourced domestic and international communities ? including how these concerns can be collectively addressed to become more resilient; and second, to investigate organizational models that seek to broaden the traditional scope of the allied design fields as disciplines and professions by advocating a humanitarian basis for practice.       \n",
    "prereq": {}
  },
  {
    "uid": "011393",
    "code": "ARCH3993",
    "subject": "ARCH",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "797696",
    "code": "ARCH4150",
    "subject": "ARCH",
    "number": "4150",
    "honors": false,
    "writing": false,
    "name": "Topics in Architecture:",
    "fullname": "Topics in Architecture",
    "info": "Design, technology, history, theory, representation, or urbanism.\n\nprereq: Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "813152",
    "code": "ARCH4150W",
    "subject": "ARCH",
    "number": "4150",
    "honors": false,
    "writing": true,
    "name": "Topics in Arch (Writing Int)",
    "fullname": "Topics in Architecture (Writing Intensive)",
    "info": "Selected topics in Architecture that meet Writing Intensive requirements.",
    "prereq": {}
  },
  {
    "uid": "819745",
    "code": "ARCH4231",
    "subject": "ARCH",
    "number": "4231",
    "honors": false,
    "writing": false,
    "name": "Advanced Intensive Application",
    "fullname": "Advanced Intensive Applications Design Workshop",
    "info": "BDA design core workshops develop your ability to critically approach a broad range of conditions through the lens of architecture.  This course will focus on the critical inquiry of tangible architectural attributes such as material (assembly), site (context), or program (need). This workshop foregrounds the analysis of more measurable, physical and specific conditions, and will favor local project sites and/or precedent projects.  Appropriate to an advanced design workshop, this course provides a structure for more guided, self-directed learning in service of iteratively advancing a design project through the lens of architecture. \n",
    "prereq": {}
  },
  {
    "uid": "819746",
    "code": "ARCH4232",
    "subject": "ARCH",
    "number": "4232",
    "honors": false,
    "writing": false,
    "name": "Advanced Extensive Application",
    "fullname": "Advanced Extensive Applications Design Workshop",
    "info": "\nBDA design core workshops develop your ability to critically approach a broad range of conditions through the lens of architecture.  This course focuses on the critical inquiry of latent or intangible attributes such as architecture's experiential, social, cultural, political, ethical, and poetic dimensions. Students in this course will engage architecture from the point of view of ephemeral conditions, theoretical understandings and operations, spatializing of data, and/or architectural inquiry applied to complex conditions or translations. Appropriate to an advanced design workshop, this course provides a structure for more guided, self-directed learning in service of iteratively advancing a design project through the lens of architecture. \n",
    "prereq": {}
  },
  {
    "uid": "011263",
    "code": "ARCH4281",
    "subject": "ARCH",
    "number": "4281",
    "honors": false,
    "writing": false,
    "name": "Arch Studio I",
    "fullname": "Undergraduate Architecture Studio I",
    "info": "Architectural questions in settlement patterns, architectural elements in their formal organization. Mapping techniques, orthographic projections, analytic drawing, models.",
    "prereq": {}
  },
  {
    "uid": "788994",
    "code": "ARCH4283",
    "subject": "ARCH",
    "number": "4283",
    "honors": false,
    "writing": false,
    "name": "Architecture Studio 03:Program",
    "fullname": "Architecture Studio 03:Program",
    "info": "Students in this undergraduate studio practice an iterative, open-ended design process as it relates especially to the fundamental role of program as a technical and experiential aspect of architecture. Students learn to broadly explore and critically evaluate the needs and activities required and possible through design interventions in the built environment. Students develop their ability to think through multiple modes of media, including physical and digital drawings and models, with an emphasis on digital model-making.",
    "prereq": {}
  },
  {
    "uid": "789984",
    "code": "ARCH4284",
    "subject": "ARCH",
    "number": "4284",
    "honors": false,
    "writing": false,
    "name": "Architecture Studio 04",
    "fullname": "Architecture Studio 04: Urban Design",
    "info": "Students in this undergraduate studio develop design sensibilities around the role of architecture in the urban environment.  Students engage the complex realities and discourses that relate to urban design; develop their ability to work with multiple layers of consideration, related terminology and means of representation; develop their ability to work with ways of observing, interpreting, and synthesizing that are specific to urban conditions and processes; and further develop a sensibility for the broad possibilities of doing urban design. ",
    "prereq": {}
  },
  {
    "uid": "798392",
    "code": "ARCH4301",
    "subject": "ARCH",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Conceptual Drawing",
    "fullname": "Conceptual Drawing",
    "info": "Drawing as way of analyzing, exploring, and generating design ideas. Projection systems, diagramming, mapping. Different modes of visual perception. Nonverbal structures.",
    "prereq": {}
  },
  {
    "uid": "797716",
    "code": "ARCH4311",
    "subject": "ARCH",
    "number": "4311",
    "honors": false,
    "writing": false,
    "name": "Theory of Arch Rprsntn",
    "fullname": "Theory of Architectural Representation",
    "info": "Integration of emerging computer graphics with photography and architectural graphic conventions. Historical, theoretical, and critical issues of representation. Influence of visual media on architectural field.",
    "prereq": {}
  },
  {
    "uid": "797717",
    "code": "ARCH4313",
    "subject": "ARCH",
    "number": "4313",
    "honors": false,
    "writing": false,
    "name": "Visual Comm Techniques in Arch",
    "fullname": "Visual Communication Techniques in Architecture",
    "info": "Delineation, presentation, and design techniques. Various visual media, methods of investigation.",
    "prereq": {}
  },
  {
    "uid": "797714",
    "code": "ARCH4321",
    "subject": "ARCH",
    "number": "4321",
    "honors": false,
    "writing": false,
    "name": "Arch in Watercolor",
    "fullname": "Architecture in Watercolor",
    "info": "Watercolor as tool in design process. Foundation principles, techniques, medium, tools, materials. Color relationships, mixing, composition, applications to design.\n\nprereq: 2301",
    "prereq": {
      "and": [
        "011341"
      ]
    }
  },
  {
    "uid": "810971",
    "code": "ARCH4325",
    "subject": "ARCH",
    "number": "4325",
    "honors": false,
    "writing": false,
    "name": "Arch Photography",
    "fullname": "Architectural Photography: Imaging by Design",
    "info": "Principals of architectural photography as language of design through lectures, demonstrations, critical discussions. Ongoing photographic study under framework of conceptual themes. compositional forms, graphic styling, use of natural/artificial light, technical issues.\n",
    "prereq": {}
  },
  {
    "uid": "814203",
    "code": "ARCH4341",
    "subject": "ARCH",
    "number": "4341",
    "honors": false,
    "writing": false,
    "name": "Architecture Portfolio Design",
    "fullname": "Architecture Portfolio Design",
    "info": "An introduction to design principles as they relate to the architecture portfolio. Students extend design thinking and visual communication skills in architecture into broader, life-long applications within the architecture profession by designing a portfolio that represents in a meaningful way a range of architecture and/or other coursework. ",
    "prereq": {}
  },
  {
    "uid": "797847",
    "code": "ARCH4361",
    "subject": "ARCH",
    "number": "4361",
    "honors": false,
    "writing": false,
    "name": "3D Arch Mdlg/Dsgn",
    "fullname": "3-D Computer Architectural Modeling and Design",
    "info": "Use of 3D computer modeling for representation in abstract/realistic ways. Creation/arrangement of objects. Setting up lighting. Developing surface materials. Creating still renderings/animations. Ways computer visualization can be used for design exploration, feedback during idea development, and realistic representation of designs.\n\nprereq: 3351, Arch major",
    "prereq": {
      "or": [
        "797715"
      ]
    }
  },
  {
    "uid": "800040",
    "code": "ARCH4382",
    "subject": "ARCH",
    "number": "4382",
    "honors": false,
    "writing": false,
    "name": "Comput Aided Arch Dsgn",
    "fullname": "Computer-Aided Architectural Design",
    "info": "Computer-aided tools as used in design. Practice in 2-/3-D CAD, image manipulation. Advanced multimedia visualization techniques, including solid modeling, photo realistic imaging, animation, and video editing/recording.",
    "prereq": {}
  },
  {
    "uid": "813131",
    "code": "ARCH4410",
    "subject": "ARCH",
    "number": "4410",
    "honors": false,
    "writing": false,
    "name": "Topics in Arch History",
    "fullname": "Topics in Architectural History",
    "info": "Selected topics in Architectural History",
    "prereq": {}
  },
  {
    "uid": "797630",
    "code": "ARCH4421W",
    "subject": "ARCH",
    "number": "4421",
    "honors": false,
    "writing": true,
    "name": "Arch Interp: Cave & Light",
    "fullname": "Architecture and Interpretation: The Cave and the Light",
    "info": "Historical/hermeneutical investigation of iconography of grotto. Intertwined themes of descent into earth and ascent to light, from earliest strata of human culture to present day.\n\nprereq: [3411, 3412] or instr consent",
    "prereq": {
      "and": [
        "009938",
        "011316"
      ]
    }
  },
  {
    "uid": "797706",
    "code": "ARCH4423",
    "subject": "ARCH",
    "number": "4423",
    "honors": false,
    "writing": false,
    "name": "Gothic Arch",
    "fullname": "Gothic Architecture",
    "info": "History of architecture and urban design in Western Europe, from 1150 to 1400.\n\nprereq: 3411 or instr consent",
    "prereq": {
      "or": [
        "009938"
      ]
    }
  },
  {
    "uid": "797707",
    "code": "ARCH4424",
    "subject": "ARCH",
    "number": "4424",
    "honors": false,
    "writing": false,
    "name": "Ren Arch",
    "fullname": "Renaissance Architecture",
    "info": "History of architecture and urban design in Italy, from 1400 to 1600. Emphasizes major figures (Brunelleschi, Alberti, Bramante, Palladio) and evolution of major cities (Rome, Florence, Venice).\n\nprereq: 3411 or instr consent",
    "prereq": {
      "or": [
        "009938"
      ]
    }
  },
  {
    "uid": "797708",
    "code": "ARCH4425W",
    "subject": "ARCH",
    "number": "4425",
    "honors": false,
    "writing": true,
    "name": "Baroque Arch",
    "fullname": "Baroque Architecture",
    "info": "Architecture and urban design in Italy, from 1600 to 1750. Emphasizes major figures (Bernini, Borromini, Cortona, Guarini) and evolution of major cities (Rome, Turin).\n\nprereq: 3411 or instr consent",
    "prereq": {
      "or": [
        "009938"
      ]
    }
  },
  {
    "uid": "797709",
    "code": "ARCH4426",
    "subject": "ARCH",
    "number": "4426",
    "honors": false,
    "writing": false,
    "name": "Arch & Nature",
    "fullname": "Architecture and Nature: 1500-1750",
    "info": "History of interaction of architecture and nature in Italy, England, and France in 16th/17th centuries. Major monuments, their relationship to theories of architecture/gardening and to urban/rural life.",
    "prereq": {}
  },
  {
    "uid": "809448",
    "code": "ARCH4428",
    "subject": "ARCH",
    "number": "4428",
    "honors": false,
    "writing": false,
    "name": "Hist & Culture European Cities",
    "fullname": "History and Culture of European Cities",
    "info": "This is a history course aimed at investigating the rich urban, landscape and architectural legacy of European cities, tracing their complex histories through the development of city morphology, and ceremonial and quotidian spaces. The course is location and content and focus will change as location of study program changes. Lectures are in class and also includes several field trips to historic sites and landscapes.",
    "prereq": {}
  },
  {
    "uid": "797749",
    "code": "ARCH4431W",
    "subject": "ARCH",
    "number": "4431",
    "honors": false,
    "writing": true,
    "name": "18th-Cen Arch & Enlightenment",
    "fullname": "Eighteenth-Century Architecture and the Enlightenment",
    "info": "Architecture, urban planning, and garden design in Europe and America, 1650 to 1850.",
    "prereq": {}
  },
  {
    "uid": "797710",
    "code": "ARCH4432",
    "subject": "ARCH",
    "number": "4432",
    "honors": false,
    "writing": false,
    "name": "Modern Arch",
    "fullname": "Modern Architecture",
    "info": "Architecture and urban design in Europe and the United States from early 19th century to World War II.\n\nprereq: 3412 or instr consent",
    "prereq": {
      "or": [
        "011316"
      ]
    }
  },
  {
    "uid": "797711",
    "code": "ARCH4434",
    "subject": "ARCH",
    "number": "4434",
    "honors": false,
    "writing": false,
    "name": "Contemporary Arch",
    "fullname": "Contemporary Architecture",
    "info": "Developments, theories, movements, and trends in architecture and urban design from World War II to present.\n\nprereq: 3412 or instr consent",
    "prereq": {
      "or": [
        "011316"
      ]
    }
  },
  {
    "uid": "816521",
    "code": "ARCH4435",
    "subject": "ARCH",
    "number": "4435",
    "honors": false,
    "writing": false,
    "name": "American Architecture",
    "fullname": "History of American Architecture",
    "info": "Through lectures, readings, discussion, and research, we will analyze buildings and spaces—architect designed and \"vernacular\"—in the context of social, political, economic, technological, and ecological change. As we address these issues, we will examine the ways design and daily life, performed locally, interacted with national and global systems and flows; and the role the built environment has played in advancing structures and concepts of class, gender, race, ethnicity, and power. Students will gain a broad familiarity with the history of American buildings and landscapes, develop critical frameworks for analysis, and enhance their understanding of the environments they interact with every day—as designers, citizens, consumers, and professionals.",
    "prereq": {}
  },
  {
    "uid": "797712",
    "code": "ARCH4439",
    "subject": "ARCH",
    "number": "4439",
    "honors": false,
    "writing": false,
    "name": "Hist  Arch Theory",
    "fullname": "History of Architectural Theory",
    "info": "History of architectural theory from antiquity to 20th century",
    "prereq": {}
  },
  {
    "uid": "804709",
    "code": "ARCH4441",
    "subject": "ARCH",
    "number": "4441",
    "honors": false,
    "writing": false,
    "name": "Minnestoa: Arch and Landscapes",
    "fullname": "Minnesota: Architecture and Landscapes",
    "info": "History of major architectural monuments, urban phenomena, and landscape forms of Minnesota. Interrelationships between architecture, geography, and people.\n\nprereq: [3411, 3412] recommended",
    "prereq": {
      "and": [
        "009938",
        "011316"
      ]
    }
  },
  {
    "uid": "797639",
    "code": "ARCH4445W",
    "subject": "ARCH",
    "number": "4445",
    "honors": false,
    "writing": true,
    "name": "Suburbia",
    "fullname": "Suburbia",
    "info": "Suburbia, from origins in 18th-century England to present.  Historical changes and present challenges, especially in America. Ideology, mythology, planning, development, geography, transportation, the family. Specific sites/designs. Representations in film, television, popular literature, and music.",
    "prereq": {}
  },
  {
    "uid": "797640",
    "code": "ARCH4446",
    "subject": "ARCH",
    "number": "4446",
    "honors": false,
    "writing": false,
    "name": "Arch post-WWII: Aesth & Politi",
    "fullname": "Architecture Since World War II: Post-War Experimentation; Aesthetics and Politics of Architecture",
    "info": "Avant-garde responses to post-war consciousness of social/meaning in architecture. Eroding communal identity, common man, architectural symbolism, monumentality, critical regionalism, place/technology in form making, popular culture, rise of theory.",
    "prereq": {}
  },
  {
    "uid": "818813",
    "code": "ARCH4451",
    "subject": "ARCH",
    "number": "4451",
    "honors": false,
    "writing": false,
    "name": "Contemporary Arch. Thinking",
    "fullname": "Contemporary Architectural Thinking",
    "info": "This course examines major architectural theories and debates which have informed, catalyzed, or destabilized the discourse of architecture in the past seven decades. Focusing on selected key texts, ideologies, and figures, the course considers the changing role of architectural theory—as a vehicle of thought, a guide for practice, a catalyst for design, and a platform for debate. Topics shows formal or theoretical resonances in the problematics and poetics of architectural productions apropos of the technofantasist neo-avant-gardism, the post-structural semiosis, the postmodern consumerism, conceptual architecture, pop architecture, hippie counterculture, etc.",
    "prereq": {}
  },
  {
    "uid": "797713",
    "code": "ARCH4461",
    "subject": "ARCH",
    "number": "4461",
    "honors": false,
    "writing": false,
    "name": "North American Indian Arch",
    "fullname": "North American Indian Architecture",
    "info": "Historic/contemporary principles/theories of North American Indian architecture. Culture, technology, environment, art, and craft of North American Indians in their settlements/architecture.\n\nprereq: Arch 3412, Arch or AmIn major",
    "prereq": {
      "or": [
        "011316"
      ]
    }
  },
  {
    "uid": "791686",
    "code": "ARCH4511",
    "subject": "ARCH",
    "number": "4511",
    "honors": false,
    "writing": false,
    "name": "Materials and Methods I",
    "fullname": "Materials and Methods I",
    "info": "Building materials, assemblies, construction operations shaping building designs. Material properties for designing/detailing building systems, elements, components. Applications. Modeling, hands-on building experiences.\n\nprereq: BS Arch major or BDA major jr/sr",
    "prereq": {}
  },
  {
    "uid": "798400",
    "code": "ARCH4521",
    "subject": "ARCH",
    "number": "4521",
    "honors": false,
    "writing": false,
    "name": "Environmental Technology I",
    "fullname": "Environmental Technology I",
    "info": "Issues related to environmental quality/design. Climate response. Heating, cooling, lighting design. Indoor air quality.\n\nprereq: Architecture major BDA or BS, jr or sr",
    "prereq": {}
  },
  {
    "uid": "012128",
    "code": "ARCH4542",
    "subject": "ARCH",
    "number": "4542",
    "honors": false,
    "writing": false,
    "name": "Bldg Energy Syst",
    "fullname": "Building Energy Systems",
    "info": "Functions of building mechanical systems and their integration with other building components. Residential/commercial HVAC systems, alternative energy sources, energy effciency, structural implications of mechanical systems, indoor air quality, environmental strategies. Case studies.",
    "prereq": {}
  },
  {
    "uid": "791402",
    "code": "ARCH4552",
    "subject": "ARCH",
    "number": "4552",
    "honors": false,
    "writing": false,
    "name": "Integrated Design Processes",
    "fullname": "Integrated Design Processes",
    "info": "Wood/steel building design topics. Emphasizes whole building design and individual structural elements. Conceptual design strategies. Planning/design phases. Criteria for selection of building systems. Principles of wood/steel structural systems. Basic building code requirements. Individual/group design/research projects.",
    "prereq": {}
  },
  {
    "uid": "797741",
    "code": "ARCH4561",
    "subject": "ARCH",
    "number": "4561",
    "honors": false,
    "writing": false,
    "name": "Arch and Ecology",
    "fullname": "Architecture and Ecology",
    "info": "Introduction to theories/practices of ecological approaches to architectural design. Ecological context, implications/opportunities of architecture. Historical/theoretical framework for ecological design thinking. Issues studied at various scales: site/community, building, component.",
    "prereq": {}
  },
  {
    "uid": "791526",
    "code": "ARCH4571",
    "subject": "ARCH",
    "number": "4571",
    "honors": false,
    "writing": false,
    "name": "Architectural Structures I",
    "fullname": "Architectural Structures I",
    "info": "Structural mechanics, graphic/quantitative analysis. Loads, materiality, strength, equilibrium, stability, serviceability, reliability. External/internal forces. Shear/moment diagrams/calculations. Structural behavior of building systems. Design using wood/steel members.\n\nprereq: BS Arch major",
    "prereq": {}
  },
  {
    "uid": "791404",
    "code": "ARCH4572",
    "subject": "ARCH",
    "number": "4572",
    "honors": false,
    "writing": false,
    "name": "StrucFrames&BldgDsgn/Cnstrctn",
    "fullname": "Structural Frames and Building Design/Construction",
    "info": "Basic contemporary structural systems in masonry, steel, and wood framing systems. Forms/performance of systems.",
    "prereq": {}
  },
  {
    "uid": "797848",
    "code": "ARCH4671",
    "subject": "ARCH",
    "number": "4671",
    "honors": false,
    "writing": false,
    "name": "Hist Prsvts",
    "fullname": "Historic Preservation",
    "info": "Philosophy, theory, origins of historic preservation. Historic archaeology, research, descriptive analysis, documentation. Government's role, standards/guidelines, building codes, neighborhood preservation, advocacy. Using primary/secondary resources. Controversial aspects.\n\nprereq: Jr or sr or instr consent",
    "prereq": {}
  },
  {
    "uid": "797849",
    "code": "ARCH4672",
    "subject": "ARCH",
    "number": "4672",
    "honors": false,
    "writing": false,
    "name": "Hist Bldg Consrvtn",
    "fullname": "Historic Building Conservation",
    "info": "Historic building materials, systems, methods of conservation. Structural systems, building repair/pathology. Introducing new environmental systems. Conserving interiors. Research on materials/techniques, using primary/secondary resources. Documenting with photography/measured drawings.\n\nprereq: 4671 or concurrent enrollment in 4671 or instr consent",
    "prereq": {
      "or": [
        "797848"
      ]
    }
  },
  {
    "uid": "809356",
    "code": "ARCH4674",
    "subject": "ARCH",
    "number": "4674",
    "honors": false,
    "writing": false,
    "name": "World Heritage Conservation",
    "fullname": "World Heritage Conservation",
    "info": "Design/planning options for conservation of historic buildings/cultural heritage sites. Case studies link current practices, methods/solutions with expert preservationists, site conservationists, local communities in development/design of conservation proposals.\n\nprereq: Jr or sr or instr consent",
    "prereq": {}
  },
  {
    "uid": "797641",
    "code": "ARCH4701W",
    "subject": "ARCH",
    "number": "4701",
    "honors": false,
    "writing": true,
    "name": "Intro to Urban Form and Theory",
    "fullname": "Introduction to Urban Form and Theory",
    "info": "Urban form, related issues of design/theory/culture. Thematic history of cities. Lectures, discussions, assignments.\n\nprereq: [3411, 3412] or instr consent",
    "prereq": {
      "and": [
        "009938",
        "011316"
      ]
    }
  },
  {
    "uid": "804097",
    "code": "ARCH4731",
    "subject": "ARCH",
    "number": "4731",
    "honors": false,
    "writing": false,
    "name": "Territorial City",
    "fullname": "Territorial City",
    "info": "Seminar. Students research, define, and test conditions within which the territory and contemporary city coexist. Site for research is Twin Cities metropolitan area. Readings, discussions, field trips, collaborative development of urban proposals.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "796159",
    "code": "ARCH4750",
    "subject": "ARCH",
    "number": "4750",
    "honors": false,
    "writing": false,
    "name": "Intro to Urban Form & Issues",
    "fullname": "Introduction to Urban Form and Issues",
    "info": "Special topics in theory/practice of urban design.\n\nprereq: Undergrad arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "817754",
    "code": "ARCH5001",
    "subject": "ARCH",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Architectural Design Studies",
    "fullname": "Architectural Design Studies: Representation & Design",
    "info": "During this six week, summer intensive course, students will focus on basic issues of visual thinking and conceptual representation in architecture. This sequence of complementary exercises introduces issues and ways of working intended to complement educational backgrounds from other, non-architectural, disciplines. To do that we have designed the exercises to juxtapose different ways of perceiving and understanding constructed environments. While exploring these architectural ways of thinking, the exercises will also help to acknowledge preconceptions that may hinder one's ability to explore conceptual decisions. ",
    "prereq": {}
  },
  {
    "uid": "797931",
    "code": "ARCH5101",
    "subject": "ARCH",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Architectural Design Studies",
    "fullname": "Architectural Design Studies",
    "info": "Principles/methods architecture design. Theories, history, technologies, media, and processes as foundation for critical thinking. Analytic modeling, visual thinking.\n\nprereq: 3+ track for MArch",
    "prereq": {}
  },
  {
    "uid": "803138",
    "code": "ARCH5110",
    "subject": "ARCH",
    "number": "5110",
    "honors": false,
    "writing": false,
    "name": "Architecture as Catalyst",
    "fullname": "Architecture as Catalyst",
    "info": "Topical workshops on design methods, theories, or emerging practices.\n\nprereq: M.Arch",
    "prereq": {}
  },
  {
    "uid": "011684",
    "code": "ARCH5123",
    "subject": "ARCH",
    "number": "5123",
    "honors": false,
    "writing": false,
    "name": "Arch Thesis",
    "fullname": "Architectural Thesis",
    "info": "Student's choice, study and solution of an architectural problem to demonstrate proficiency in all phases of design.",
    "prereq": {}
  },
  {
    "uid": "806380",
    "code": "ARCH5207",
    "subject": "ARCH",
    "number": "5207",
    "honors": false,
    "writing": false,
    "name": "Venice Design Workshop",
    "fullname": "Venice Design Workshop",
    "info": "Design interventions with special concerns for urban landscapes, heritage conservation, and sustainable development. Jointly conducted with a graduate landscape architecture design studio. Design techniques for site plans/masterplans. Final project.\n\nprereq: M.Arch or instr consent",
    "prereq": {}
  },
  {
    "uid": "810928",
    "code": "ARCH5212",
    "subject": "ARCH",
    "number": "5212",
    "honors": false,
    "writing": false,
    "name": "Undergrad Arch Studio 05",
    "fullname": "Undergraduate Architecture Studio 05: Advanced Design",
    "info": "Advanced design studio to engage students in range of critical subjects to be determined by respective instructors. Intended to challenge students with independent/experimental approach to design that builds on prior knowledge, develop working methodologies/design ethics.\n\nprereq: C- or better in 3281, 3282, 4283, 4284",
    "prereq": {
      "or": [
        "798011",
        "011264",
        "788994",
        "789984"
      ]
    }
  },
  {
    "uid": "826980",
    "code": "ARCH5213",
    "subject": "ARCH",
    "number": "5213",
    "honors": false,
    "writing": false,
    "name": "Arch Studio 06: Research",
    "fullname": "Undergraduate Architecture Studio 06: Research",
    "info": "As the sixth and final undergraduate Bachelor of Science in Architecture studio, this course presents a framework for faculty and student research to structure contemporary design questions that should be both urgent and contemporary. Within this framework and working under the direction of a studio coordinator, each faculty member will design a studio topic that fits within the umbrella topic of BS-06 while simultaneously exploring a design problem emerging from an ongoing set of research questions determined by faculty interest. It is expected that students will develop individual design proposals within the parameters of the respective studio frameworks that champion their skills and insightful abilities. In this sense, a high value is placed upon the formulation and execution of personally and critically determined ideas and their means of development and presentation.",
    "prereq": {}
  },
  {
    "uid": "011687",
    "code": "ARCH5241",
    "subject": "ARCH",
    "number": "5241",
    "honors": false,
    "writing": false,
    "name": "Prin Dsgn Prgm",
    "fullname": "Principles of Design Programming",
    "info": "Architectural programming. Client/user needs. Equipment, space, activity analysis. Site selection, precedent analysis. Analysis of standards/regulations. Technology and materials. Hypothesis formulation/evaluation. Conceptual development, research, representation, interpretation.\n\nprereq: [8251, [M.Arch or MS Arch] major] or instr consent",
    "prereq": {
      "or": [
        "012285"
      ]
    }
  },
  {
    "uid": "788862",
    "code": "ARCH5250",
    "subject": "ARCH",
    "number": "5250",
    "honors": false,
    "writing": false,
    "name": "Advanced Topics in Design",
    "fullname": "Advanced Topics in Design",
    "info": "Advanced topics in architectural design.",
    "prereq": {}
  },
  {
    "uid": "011698",
    "code": "ARCH5291",
    "subject": "ARCH",
    "number": "5291",
    "honors": false,
    "writing": false,
    "name": "Accelerated Arch Studio I",
    "fullname": "Accelerated Undergraduate Architecture Studio I",
    "info": "Selected architectural problems developed by faculty to deepen/enrich ideas introduced in required architectural studio sequence.",
    "prereq": {}
  },
  {
    "uid": "011700",
    "code": "ARCH5292",
    "subject": "ARCH",
    "number": "5292",
    "honors": false,
    "writing": false,
    "name": "Accelerated Arch Studio II",
    "fullname": "Accelerated Undergraduate Architecture Studio II",
    "info": "Architectural problems. Emphasizes development of structures as integral part of design, site planning, design process.",
    "prereq": {}
  },
  {
    "uid": "798393",
    "code": "ARCH5301",
    "subject": "ARCH",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Conceptual Drawing",
    "fullname": "Conceptual Drawing",
    "info": "Drawing as way of analyzing, exploring, and generating design ideas. Projection systems, diagramming, mapping. Different modes of visual perception. Nonverbal structures.\n\nprereq: MArch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "011847",
    "code": "ARCH5311",
    "subject": "ARCH",
    "number": "5311",
    "honors": false,
    "writing": false,
    "name": "Theory of Arch Rprsntn",
    "fullname": "Theory of Architectural Representation",
    "info": "Integration of emerging computer graphics with photography and architectural graphic conventions. Historical, theoretical, and critical issues of representation. Influence of visual media on architectural field.",
    "prereq": {}
  },
  {
    "uid": "011380",
    "code": "ARCH5313",
    "subject": "ARCH",
    "number": "5313",
    "honors": false,
    "writing": false,
    "name": "Vis Comm Technqs in Arch",
    "fullname": "Visual Communication Techniques in Architecture",
    "info": "Delineation, presentation, and design techniques. Various visual media and methods of investigation.\n\nprereq: M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "011848",
    "code": "ARCH5321",
    "subject": "ARCH",
    "number": "5321",
    "honors": false,
    "writing": false,
    "name": "Arch in Watercolor",
    "fullname": "Architecture in Watercolor",
    "info": "Watercolor as a tool in design process. Foundation principles, techniques, medium, tools, materials. Color relationships, mixing, composition, applications to design.\n\nprereq: M Arch grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "788971",
    "code": "ARCH5350",
    "subject": "ARCH",
    "number": "5350",
    "honors": false,
    "writing": false,
    "name": "Topics in Arch Representation",
    "fullname": "Topics in Architectural Representation",
    "info": "Selected topics in architectural representation.",
    "prereq": {}
  },
  {
    "uid": "011851",
    "code": "ARCH5351",
    "subject": "ARCH",
    "number": "5351",
    "honors": false,
    "writing": false,
    "name": "AutoCAD I",
    "fullname": "AutoCAD I",
    "info": "Basic concepts, tools, and techniques of computer-aided drawing with  current AutoCAD Release. Strategies and techniques for producing dimensioned and annotated drawings suitable for plotting and an introduction to 3-D drawing capabilities. Use of dimension variables, attributes, blocks, symbols, and the creation of customized menus.",
    "prereq": {}
  },
  {
    "uid": "011849",
    "code": "ARCH5361",
    "subject": "ARCH",
    "number": "5361",
    "honors": false,
    "writing": false,
    "name": "3D Arch Mdlg/Dsgn",
    "fullname": "3-D Computer Architectural Modeling and Design",
    "info": "Use of 3D computer modeling for representation in abstract/realistic ways. Computer modeling software. Creation/arrangement of objects, setting up lighting, developing surface materials, creating still renderings/animations. Ways in which computer visualization can be used for design exploration, for feedback during development of ideas, and for realistic representation of fully formed designs.\n\nprereq: M Arch major",
    "prereq": {}
  },
  {
    "uid": "013504",
    "code": "ARCH5371",
    "subject": "ARCH",
    "number": "5371",
    "honors": false,
    "writing": false,
    "name": "Comp Methods I",
    "fullname": "Computer Methods I",
    "info": "Introduction to current techniques, computer programs, and their application to architectural computing.",
    "prereq": {}
  },
  {
    "uid": "013505",
    "code": "ARCH5372",
    "subject": "ARCH",
    "number": "5372",
    "honors": false,
    "writing": false,
    "name": "Comp Methods II",
    "fullname": "Computer Methods II",
    "info": "Current techniques, computer programs, and their application to architectural computing and design.\n\nprereq: 5371, concurrent registration is required (or allowed) in  8252 and M Arch major or instr consent",
    "prereq": {
      "or": [
        "013504",
        "012286"
      ]
    }
  },
  {
    "uid": "013507",
    "code": "ARCH5373",
    "subject": "ARCH",
    "number": "5373",
    "honors": false,
    "writing": false,
    "name": "Comp Methods III",
    "fullname": "Computer Methods III",
    "info": "Advanced techniques, computer programs, and their application to architectural computing in design, theory, and technology.",
    "prereq": {}
  },
  {
    "uid": "013509",
    "code": "ARCH5374",
    "subject": "ARCH",
    "number": "5374",
    "honors": false,
    "writing": false,
    "name": "Comp Methods IV",
    "fullname": "Computer Methods IV",
    "info": "Advanced architectural computing applications in design, history, theory, representation, and technology.",
    "prereq": {}
  },
  {
    "uid": "012032",
    "code": "ARCH5381",
    "subject": "ARCH",
    "number": "5381",
    "honors": false,
    "writing": false,
    "name": "Intro Comput Aided Arch Dsgn",
    "fullname": "Introduction to Computer Aided Architectural Design",
    "info": "2-D drawing, 3-D modeling/animation, printing, plotting. Electronic networking/communications, database management, spreadsheet analysis, land-use analysis, project management.\n\nprereq: Arch or BED or M Arch or grad student in LA or instr consent",
    "prereq": {}
  },
  {
    "uid": "012035",
    "code": "ARCH5382",
    "subject": "ARCH",
    "number": "5382",
    "honors": false,
    "writing": false,
    "name": "Comput Aided Arch Dsgn",
    "fullname": "Computer Aided Architectural Design",
    "info": "2-D/3-D CAD, image manipulation. Advanced multimedia visualization techniques for design, including solid modeling, photo-/realistic imaging, animation, video-editing/recording.",
    "prereq": {}
  },
  {
    "uid": "816257",
    "code": "ARCH5391",
    "subject": "ARCH",
    "number": "5391",
    "honors": false,
    "writing": false,
    "name": "Design & Rep with BIM",
    "fullname": "Design and Representation with BIM",
    "info": "In this course, students will be introduced to the concept of Building Information Modeling (BIM) through the use of Autodesk Revit, one, one of the BIM software tools most commonly used in architectural practice today. Students will engage in a series of design exercises that will require both learning and applying Revit in the context of real world architectural scenarios. In addition to learning Autodesk Revit as a design tool, we will examine the use of BIM technology within the architectural industry through a series of case study examples. Also, presenters will share firsthand accounts of CAD and BIM Software being implemented in architectural practice.",
    "prereq": {}
  },
  {
    "uid": "816258",
    "code": "ARCH5392",
    "subject": "ARCH",
    "number": "5392",
    "honors": false,
    "writing": false,
    "name": "Facade Design & Construction",
    "fullname": "Facade Design & Construction",
    "info": "This course explains and explores contemporary facade design by introducing students to key technical principles that will empower them to be more thoughtful and informed facade designers. We will take an in-depth look at four fundamental facade materials — stone, clay, metal, and glass — followed by exploration and development in a 3D environment of the students' choice.",
    "prereq": {}
  },
  {
    "uid": "012039",
    "code": "ARCH5410",
    "subject": "ARCH",
    "number": "5410",
    "honors": false,
    "writing": false,
    "name": "Topics in Architectural Hist",
    "fullname": "Topics in Architectural History",
    "info": "Advanced study in architectural history. Readings, research, seminar reports.",
    "prereq": {}
  },
  {
    "uid": "012038",
    "code": "ARCH5411",
    "subject": "ARCH",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Prncpls Dsgn Thry",
    "fullname": "Principles of Design Theory",
    "info": "Principles of design and their instrumentation. How and why architecture theory is generated. Types and significance of formal analysis. Theoretical positions and modes of criticism.\n\nprereq: M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "814100",
    "code": "ARCH5412",
    "subject": "ARCH",
    "number": "5412",
    "honors": false,
    "writing": false,
    "name": "Arch: Global and Cultural Hist",
    "fullname": "Architecture: A Global and Cultural History",
    "info": "This course examines the history of architecture from a global perspective, addressing a variety of traditions and geographical locations, and following their interconnections and exchanges. ",
    "prereq": {}
  },
  {
    "uid": "817319",
    "code": "ARCH5413",
    "subject": "ARCH",
    "number": "5413",
    "honors": false,
    "writing": false,
    "name": "Modern & Contemp Global Arch",
    "fullname": "Modern and Contemporary Global Architecture",
    "info": "This course is a global history of modern and contemporary architecture, tailored to graduate\nstudents in the M.Arch. program. The course examines the architectural production of the 20th\nand 21st centuries through the focused study of buildings, urban plans, unbuilt designs,\nmanifestos, and other visual and textual documents. Students will be called upon to reflect on\nissues of design, planning, programming, technology, and representation, connecting this\ncourse to their architectural training and future professional practice. At the same time, the\ncourse will offer a critical and multidisciplinary perspective, presenting architecture in the context\nof culture, politics, economics, ideology, and other historical developments. The premise of this\ncourse is the fundamental role of history for contemporary and future architectural practice. The\ncourse assignments, readings, and activities aim to spur a productive dialogue between critical\nreflection and historical knowledge with an eye towards creative action.",
    "prereq": {}
  },
  {
    "uid": "797642",
    "code": "ARCH5421",
    "subject": "ARCH",
    "number": "5421",
    "honors": false,
    "writing": false,
    "name": "Arch Interp: Cave & Light",
    "fullname": "Architecture and Interpertation: The Cave and the Light",
    "info": "Historical/hermeneutical investigation of iconography of grotto. Intertwined themes of descent into earth and ascent to light, from earliest strata of human culture to present day.\n\nprereq: [3411, 3412] or instr consent",
    "prereq": {
      "and": [
        "009938",
        "011316"
      ]
    }
  },
  {
    "uid": "010000",
    "code": "ARCH5423",
    "subject": "ARCH",
    "number": "5423",
    "honors": false,
    "writing": false,
    "name": "Gothic Arch",
    "fullname": "Gothic Architecture",
    "info": "History of architecture and urban design in Western Europe, from 1150 to 1400.\n\nprereq: MS Arch or M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "009981",
    "code": "ARCH5424",
    "subject": "ARCH",
    "number": "5424",
    "honors": false,
    "writing": false,
    "name": "Ren Arch",
    "fullname": "Renaissance Architecture",
    "info": "History of architecture and urban design in Italy, from 1400 to 1600. Emphasizes major figures (Brunelleschi, Alberti, Bramante, Palladio) and evolution of major cities (Rome, Florence, Venice).\n\nprereq: MS Arch or M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "009993",
    "code": "ARCH5425",
    "subject": "ARCH",
    "number": "5425",
    "honors": false,
    "writing": false,
    "name": "Baroque Arch",
    "fullname": "Baroque Architecture",
    "info": "Architecture and urban design in Italy, from 1600 to 1750. Emphasizes major figures (Bernini, Borromini, Cortona, Guarini) and evolution of major cities (Rome, Turin).\n\nprereq: MS Arch or M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012042",
    "code": "ARCH5426",
    "subject": "ARCH",
    "number": "5426",
    "honors": false,
    "writing": false,
    "name": "Arch & Nature",
    "fullname": "Architecture and Nature: 1500-1750",
    "info": "History of interaction of architecture and nature in Italy, England, and France in 16th/17th centuries. Major monuments, their relationship to theories of architecture/gardening and to urban/rural life.",
    "prereq": {}
  },
  {
    "uid": "012043",
    "code": "ARCH5431",
    "subject": "ARCH",
    "number": "5431",
    "honors": false,
    "writing": false,
    "name": "18th-Cen Arch & Enlightenment",
    "fullname": "Eighteenth-Century Architecture and the Enlightenment",
    "info": "Architecture, urban planning, and garden design in Europe and America from 1650 to 1850.",
    "prereq": {}
  },
  {
    "uid": "012044",
    "code": "ARCH5432",
    "subject": "ARCH",
    "number": "5432",
    "honors": false,
    "writing": false,
    "name": "Modern Arch",
    "fullname": "Modern Architecture",
    "info": "Architecture and urban design in Europe and the United States, from early 19th century to World War II.\n\nprereq: MS Arch or M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012070",
    "code": "ARCH5434",
    "subject": "ARCH",
    "number": "5434",
    "honors": false,
    "writing": false,
    "name": "Contemporary Arch",
    "fullname": "Contemporary Architecture",
    "info": "Developments, theories, movements, and trends in architecture and urban design, from World War II to present.\n\nprereq: MS Arch or M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "816259",
    "code": "ARCH5435",
    "subject": "ARCH",
    "number": "5435",
    "honors": false,
    "writing": false,
    "name": "History of American Arch",
    "fullname": "History of American Architecture",
    "info": "Through lectures, readings, discussion, and research, we will analyze buildings and spaces—architect designed and \"vernacular\"—in the context of social, political, economic, technological, and ecological change. As we address these issues, we will examine the ways design and daily life, performed locally, interacted with national and global systems and flows; and the role the built environment has played in advancing structures and concepts of class, gender, race, ethnicity, and power. Students will gain a broad familiarity with the history of American buildings and landscapes, develop critical frameworks for analysis, and enhance their understanding of the environments they interact with every day—as designers, citizens, consumers, and professionals.",
    "prereq": {}
  },
  {
    "uid": "012076",
    "code": "ARCH5439",
    "subject": "ARCH",
    "number": "5439",
    "honors": false,
    "writing": false,
    "name": "Hist  Arch Theory",
    "fullname": "History of Architectural Theory",
    "info": "History of architectural theory, from antiquity to 20th century.",
    "prereq": {}
  },
  {
    "uid": "804710",
    "code": "ARCH5441",
    "subject": "ARCH",
    "number": "5441",
    "honors": false,
    "writing": false,
    "name": "Minnesota: Arch and Landscapes",
    "fullname": "Minnesota: Architecture and Landscapes",
    "info": "History of major architectural monuments, urban phenomena, and landscape forms of Minnesota. Interrelationships between architecture, geography, and people.\n\nprereq: [3411, 3412] recommended",
    "prereq": {
      "and": [
        "009938",
        "011316"
      ]
    }
  },
  {
    "uid": "797643",
    "code": "ARCH5445",
    "subject": "ARCH",
    "number": "5445",
    "honors": false,
    "writing": false,
    "name": "Suburbia",
    "fullname": "Suburbia",
    "info": "Suburbia, from origins in 18th-century England to present.  Historical changes and present challenges, especially in America. Ideology, mythology, planning, development, geography, transportation, the family. Specific sites/designs. Representations in film, television, popular literature, and music.",
    "prereq": {}
  },
  {
    "uid": "797644",
    "code": "ARCH5446",
    "subject": "ARCH",
    "number": "5446",
    "honors": false,
    "writing": false,
    "name": "Arch Since World War II",
    "fullname": "Architecture Since World War II: Postwar Experimentation: Aesthetics and Politics of Architecture",
    "info": "Eight-week seminar. Avant-garde architectural responses to postwar consciousness of social issues/meaning. How tenets of western avant-gardism were transformed by regional constraints when introduced to post-independent agendas of non-western world.\n\nprereq: M Arch major",
    "prereq": {}
  },
  {
    "uid": "012081",
    "code": "ARCH5450",
    "subject": "ARCH",
    "number": "5450",
    "honors": false,
    "writing": false,
    "name": "Topics in Architectural Theory",
    "fullname": "Topics in Architectural Theory",
    "info": "Selected topics in architectural theory and criticism.",
    "prereq": {}
  },
  {
    "uid": "012087",
    "code": "ARCH5451",
    "subject": "ARCH",
    "number": "5451",
    "honors": false,
    "writing": false,
    "name": "Arch: Dfng Dscpln",
    "fullname": "Architecture: Defining the Discipline",
    "info": "Paradigms through which architecture has defined itself. Implications for its practice, product, and architecture in general. Lecture, discussion, design exercises.\n\nprereq: M Arch major",
    "prereq": {}
  },
  {
    "uid": "012089",
    "code": "ARCH5452",
    "subject": "ARCH",
    "number": "5452",
    "honors": false,
    "writing": false,
    "name": "Arch: Dsn Form Ord",
    "fullname": "Architecture: Design, Form, Order, and Meaning",
    "info": "Architecture and the issue of meaning. Explores fundamental and constituent elements of architectural form and order; their inherent tectonic, phenomenal, experiential, and symbolic characteristics; their potential and implications for the creation and structure of meaningful human places.\n\nprereq: M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012098",
    "code": "ARCH5454",
    "subject": "ARCH",
    "number": "5454",
    "honors": false,
    "writing": false,
    "name": "Structuralism & Post-Strctrlsm",
    "fullname": "Structuralism and Post-Structuralism",
    "info": "Expressive and cultural dimensions of architecture, especially those related to linguistic analogies, knowledge production, and contemporary philosophy. Broad critical perspective of architectural discussion and argumentation addressing current issues.",
    "prereq": {}
  },
  {
    "uid": "012099",
    "code": "ARCH5455",
    "subject": "ARCH",
    "number": "5455",
    "honors": false,
    "writing": false,
    "name": "Typology and Arch",
    "fullname": "Typology and Architecture: Theories of Analysis and Synthesis",
    "info": "Theoretical traditions and development of typology's role in architecture. Investigates works of Laugier, Quatremere de Quincy, Viollet-Le Duc, Ledoux, Durand, Camillo Sitte, and Le Corbusier. Recent developments and theoretical positions of neo-rational and contextual arguments for contemporary applications of the idea of type.",
    "prereq": {}
  },
  {
    "uid": "012102",
    "code": "ARCH5458",
    "subject": "ARCH",
    "number": "5458",
    "honors": false,
    "writing": false,
    "name": "Arch & Culture",
    "fullname": "Architecture and Culture",
    "info": "Architecture as a cultural medium. Relationships among architecture, people, and culture; research findings and design; vernacular and high style architecture. Physiological and symbolic messages; reception theory in architecture; cultural critique and change; implications for architectural practice.",
    "prereq": {}
  },
  {
    "uid": "013533",
    "code": "ARCH5459",
    "subject": "ARCH",
    "number": "5459",
    "honors": false,
    "writing": false,
    "name": "Gender & Arch",
    "fullname": "Gender and Architecture",
    "info": "Examination of ideas related to gender and architecture, gendered and non-gendered places and practices, and their relations to cultural norms and change.\t\t\t\t\t\t\t\t",
    "prereq": {}
  },
  {
    "uid": "012103",
    "code": "ARCH5461",
    "subject": "ARCH",
    "number": "5461",
    "honors": false,
    "writing": false,
    "name": "N Amer Indian Arch",
    "fullname": "North American Indian Architecture",
    "info": "Historic/contemporary principles/theories of North American Indian architecture. Culture, technology, environment, art, and craft of North American Indians in their settlements/architecture.\n\nprereq: M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "806381",
    "code": "ARCH5462",
    "subject": "ARCH",
    "number": "5462",
    "honors": false,
    "writing": false,
    "name": "Venice: A Port City",
    "fullname": "Venice: A Port City",
    "info": "Historical understanding of Venice and its lagoon, the rise and decline of Venice as a maritime empire as well as a port city of global trades, and environmental issues of heritage conservation. Seminars/field trips highlighting architectural and artistic achievements of Venice.\n\nprereq: M.Arch or MLA or instr consent",
    "prereq": {}
  },
  {
    "uid": "804699",
    "code": "ARCH5465",
    "subject": "ARCH",
    "number": "5465",
    "honors": false,
    "writing": false,
    "name": "LeCorbusier",
    "fullname": "LeCorbusier's Search for Theory and Identity in His Formative Years",
    "info": "Seminar. Charles-Edouard Jeanneret's transition from apprentice of watchcase engraving to student of architecture, 1902-20. Early education, travels, design of houses in La Chaux de Fonds, transition to life in Paris, success in establishing theoretical identity.\n\nprereq: M Arch major",
    "prereq": {}
  },
  {
    "uid": "803696",
    "code": "ARCH5468",
    "subject": "ARCH",
    "number": "5468",
    "honors": false,
    "writing": false,
    "name": "Constructing Sacred Space",
    "fullname": "Constructing Sacred Space",
    "info": "Speculative understandings of space, form, and expression of sacred space in historic/contemporary cultural/social contexts, using Islamic art/architecture. Language of architecture.",
    "prereq": {}
  },
  {
    "uid": "011262",
    "code": "ARCH5501",
    "subject": "ARCH",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Arch and Ecology",
    "fullname": "Architecture and Ecology",
    "info": "Introduction to theories/practices of ecological approaches to architectural design. Ecological context, implications/opportunities of architecture. Historical/theoretical framework for ecological design thinking. Issues studied at a variety of scales: site/community, building scale, component scale. Fundamental theories, concepts, principles, strategies, and design tools addressed at each scale.",
    "prereq": {}
  },
  {
    "uid": "012106",
    "code": "ARCH5511",
    "subject": "ARCH",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Const Matrls Arch",
    "fullname": "Construction Materials in Architecture",
    "info": "Building materials, assemblies, and construction operations shaping building designs. Material properties for design/detailing of building systems, elements, and components. Implications in design applications. Modeling, hands-on building experiences.",
    "prereq": {}
  },
  {
    "uid": "012119",
    "code": "ARCH5512",
    "subject": "ARCH",
    "number": "5512",
    "honors": false,
    "writing": false,
    "name": "Build Mthds Arch",
    "fullname": "Building Methods in Architecture",
    "info": "Analysis of architectural materials, building systems, and construction operations related to enclosure systems design, building infrastructure, and detailing. Application of legal constraints and regulations (e.g., ADA, building codes, life-safety issues) in preparation of drawings, specifications, and construction documents for building design.",
    "prereq": {}
  },
  {
    "uid": "012125",
    "code": "ARCH5513",
    "subject": "ARCH",
    "number": "5513",
    "honors": false,
    "writing": false,
    "name": "Thermal Design in Architecture",
    "fullname": "Environmental Technology  I: Thermal Design in Architecture",
    "info": "Thermal and climatic issues in the design of small and mid-size buildings.  Investigations in built and mechanical methods to modify climate.  Evaluation of the impact of design techniques on energy use, the environment, and architectural meaning.\n\nprereq: M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012123",
    "code": "ARCH5514",
    "subject": "ARCH",
    "number": "5514",
    "honors": false,
    "writing": false,
    "name": "Lighting and Acoustic Design",
    "fullname": "Environmental Technology II: Lighting and Acoustic Design",
    "info": "Principles of daylighting, electric lighting, and acoustic design in architecture. Relationship between luminous and acoustic environments, human comfort and architectural experience. Analytical methods, design process, and modeling of daylighting.\n\nprereq: M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "802323",
    "code": "ARCH5515",
    "subject": "ARCH",
    "number": "5515",
    "honors": false,
    "writing": false,
    "name": "Tech One: Matrls. & Constr.",
    "fullname": "Technology One: Building Materials and Construction Systems",
    "info": "Building materials (concrete, masonry, steel, timber, glass). Building systems (structure, envelope, circulation, HVAC, plumbing). Integration of systems. Building construction processes/terminology.\n\nprereq: M Arch student",
    "prereq": {}
  },
  {
    "uid": "802324",
    "code": "ARCH5516",
    "subject": "ARCH",
    "number": "5516",
    "honors": false,
    "writing": false,
    "name": "Tech Two: Lumin Therm Des",
    "fullname": "Technology Two: Luminous and Thermal Design",
    "info": "Concepts/principles of daylighting, thermal, energy, and systems integration. Architectural/technological implications of lighting and thermal design. Ecological thinking in support of sustainable design decision making.\n\nprereq: M Arch",
    "prereq": {}
  },
  {
    "uid": "802325",
    "code": "ARCH5517",
    "subject": "ARCH",
    "number": "5517",
    "honors": false,
    "writing": false,
    "name": "Tech Three: Strct Sys",
    "fullname": "Technology Three: Structural Systems",
    "info": "Structural behavior in withstanding gravity and lateral forces. Evolution, range, and applications of structural systems. Structural analysis. Graphical methods, site visits, analog/digital modeling. Case studies, problems.\n\nprereq: M Arch student",
    "prereq": {}
  },
  {
    "uid": "817320",
    "code": "ARCH5518",
    "subject": "ARCH",
    "number": "5518",
    "honors": false,
    "writing": false,
    "name": "Environmental Technology",
    "fullname": "Environmental Technology: Integrative Ecological Design for Responsive Architecture",
    "info": "This course introduces the ecological design concepts and principles of daylighting, thermal, energy, and building systems integration. The course will provide students with an understanding of the primary architectural and technological implications of lighting and thermal to inform design and ecological thinking and to support sustainable design decision-making.",
    "prereq": {}
  },
  {
    "uid": "803711",
    "code": "ARCH5521",
    "subject": "ARCH",
    "number": "5521",
    "honors": false,
    "writing": false,
    "name": "Material Investigation",
    "fullname": "Material Investigation: Concrete",
    "info": "Design projects identify common problems/improvements, investigate alternatives, and develop solutions where concrete is primary building material.\n\nprereq: MArch or MS",
    "prereq": {}
  },
  {
    "uid": "803712",
    "code": "ARCH5523",
    "subject": "ARCH",
    "number": "5523",
    "honors": false,
    "writing": false,
    "name": "Material Investigation",
    "fullname": "Material Investigation: Steel and Glass",
    "info": "Design projects identify common problems and improvements, investigate alternatives and develop solutions where steel and glass are the primary building materials.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "012631",
    "code": "ARCH5525",
    "subject": "ARCH",
    "number": "5525",
    "honors": false,
    "writing": false,
    "name": "Dsgn in Masonry",
    "fullname": "Design in Masonry",
    "info": "Design principles, construction methods, and document production for masonry structures.",
    "prereq": {}
  },
  {
    "uid": "803139",
    "code": "ARCH5527",
    "subject": "ARCH",
    "number": "5527",
    "honors": false,
    "writing": false,
    "name": "Material Investigations",
    "fullname": "Material Investigations: Stone and Water",
    "info": "Design projects identify common problems/improvements, investigate alternatives, and develop solutions where wood is primary building material.\n\nprereq: M.Arch or M.S.",
    "prereq": {}
  },
  {
    "uid": "012124",
    "code": "ARCH5539",
    "subject": "ARCH",
    "number": "5539",
    "honors": false,
    "writing": false,
    "name": "Daylighting Architecture Dsgn",
    "fullname": "Daylighting and Architecture Design",
    "info": "This 15-week seminar will explore approaches to daylighting and architectural design that weave together diverse layers of ecological, physiological, and psychological issues to enhance our understanding and relationship of light in place and time. We will explore how the formal, aesthetic, atmospheric, and experiential aspects of daylighting also support and foster more sustainable and regenerative approaches to architectural design. The goal of the seminar is to familiarize students with daylighting from an ecological perspective in order to use both creatively in the design process.",
    "prereq": {}
  },
  {
    "uid": "805760",
    "code": "ARCH5541",
    "subject": "ARCH",
    "number": "5541",
    "honors": false,
    "writing": false,
    "name": "Material Strategies",
    "fullname": "Material Strategies",
    "info": "Emergent materials in advanced building design; strategies for material approaches relevant to global resource flows, technological trajectories, and sociocultural effects.  Research projects based on evaluative tools and case studies.\n\nprereq: M Arch or Arch MS major",
    "prereq": {}
  },
  {
    "uid": "012131",
    "code": "ARCH5550",
    "subject": "ARCH",
    "number": "5550",
    "honors": false,
    "writing": false,
    "name": "Topics in Technology",
    "fullname": "Topics in Technology",
    "info": "Selected topics in architecture technology, e.g., construction, environmental management, energy performance, lighting, and materials.",
    "prereq": {}
  },
  {
    "uid": "012135",
    "code": "ARCH5561",
    "subject": "ARCH",
    "number": "5561",
    "honors": false,
    "writing": false,
    "name": "Tech 1, Structures for Bldg",
    "fullname": "Tech 1, Structures for Building",
    "info": "Role of structure in architectural design. Common systems found throughout history. Review systems to identify parameters that influence structural decisions.\n\nprereq: M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "810226",
    "code": "ARCH5562",
    "subject": "ARCH",
    "number": "5562",
    "honors": false,
    "writing": false,
    "name": "Tech 2, Intro to Bldg Tech",
    "fullname": "Tech 2, Intro to Building Technology",
    "info": "Origin/development of architectural idea. Designs as direct means of representing our underlying intentions.\n\nprereq: M.Arch or instr consent",
    "prereq": {}
  },
  {
    "uid": "811442",
    "code": "ARCH5563",
    "subject": "ARCH",
    "number": "5563",
    "honors": false,
    "writing": false,
    "name": "Tech 3: Advanced Bldg Tech",
    "fullname": "Tech 3:  Advanced Building Technology Integrated Building Systems",
    "info": "Logic of integrating building systems. Improving understanding of/thinking critically about integration principles, theories, practice, application. Identifying/working through problems the project architect must address.\n\nprereq: M.Arch or instr consent",
    "prereq": {}
  },
  {
    "uid": "810227",
    "code": "ARCH5564",
    "subject": "ARCH",
    "number": "5564",
    "honors": false,
    "writing": false,
    "name": "Tech 4 Bldg Structural Systems",
    "fullname": "Tech 4: Building Structural Systems",
    "info": "Main concepts related to building structures. Basic knowledge of flow of forces. Review of rules for sizing structures. Calculations to understand systems behavior. Knowledge/tools to design buildings considering structure within design process.\n\nprereq: M.Arch or instr consent",
    "prereq": {}
  },
  {
    "uid": "012147",
    "code": "ARCH5571",
    "subject": "ARCH",
    "number": "5571",
    "honors": false,
    "writing": false,
    "name": "Arch Strct I",
    "fullname": "Architectural Structures I: Wood and Steel Design",
    "info": "Influence of history/culture on architecture/structure. Structural mechanics, analysis, form finding, and design by experimental, qualitative/intuitive, and quantitative methods. Vector-/form-active structural systems, funicular structures. Bending/compression elements, plates/grids. Tensile architecture, shells. Traditional construction materials.",
    "prereq": {}
  },
  {
    "uid": "012259",
    "code": "ARCH5572",
    "subject": "ARCH",
    "number": "5572",
    "honors": false,
    "writing": false,
    "name": "Arch Strct II",
    "fullname": "Architectural Structures II: Concrete and Masonry Design",
    "info": "Overview of advanced materials: reinforced fiberglass, structural glass, and structural tensile fabrics. Impact of construction technology on architecture and methods of integrating knowledge of structural materials and construction methods into the design process.",
    "prereq": {}
  },
  {
    "uid": "810018",
    "code": "ARCH5609",
    "subject": "ARCH",
    "number": "5609",
    "honors": false,
    "writing": false,
    "name": "Development of Research",
    "fullname": "Development and Implementation of Research",
    "info": "Bridge gaps among architectural research, design, practice.  Forum for students to independently develop research topics/implement research methods related to architectural scholarship/practice, aided by classmates, instructor, guest lecturers.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "787811",
    "code": "ARCH5611",
    "subject": "ARCH",
    "number": "5611",
    "honors": false,
    "writing": false,
    "name": "Design in the Digital Age",
    "fullname": "Design in the Digital Age",
    "info": "Introduction to design, design process. Developing/understanding ways of seeing, thinking, and acting as a designer. Changes in design being wrought by digital technology. Team design project.\n\nprereq: Grad student or upper level undergrad student",
    "prereq": {}
  },
  {
    "uid": "012263",
    "code": "ARCH5621",
    "subject": "ARCH",
    "number": "5621",
    "honors": false,
    "writing": false,
    "name": "Pro Pract Arch",
    "fullname": "Professional Practice in Architecture",
    "info": "Legal, ethical, business, and practical requirements of architectural practice. Contemporary and historical models of contract formation, business principles, accounting, project management, design services, and marketing.\n\nprereq: M Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "810335",
    "code": "ARCH5630",
    "subject": "ARCH",
    "number": "5630",
    "honors": false,
    "writing": false,
    "name": "Practicum: Adv. Iss. in Pract.",
    "fullname": "Practicum: Advanced Issues in Practice",
    "info": "Advanced architectural practice topics not normally covered in curricula are examined/evaluated as foundation for licensure/ARE 4.0 testing processes.\n\nprereq: M.S. Architecture or M.Arch",
    "prereq": {}
  },
  {
    "uid": "012266",
    "code": "ARCH5631",
    "subject": "ARCH",
    "number": "5631",
    "honors": false,
    "writing": false,
    "name": "Lgl Cntrcts Arch",
    "fullname": "Legal Contracts in Architecture",
    "info": "Legal subject matter relevant to the work of architects and design professionals.",
    "prereq": {}
  },
  {
    "uid": "012271",
    "code": "ARCH5645",
    "subject": "ARCH",
    "number": "5645",
    "honors": false,
    "writing": false,
    "name": "Rl Estat Dev Arch",
    "fullname": "Real Estate Development in Architecture",
    "info": "Fundamentals of real estate development and investment building. Processes and rules of specialists in development of investment projects. Topics include pro forma value and depreciation, tax shelter, feasibility, market analysis, appraisal equity financing, design, construction, leasing, and property management.",
    "prereq": {}
  },
  {
    "uid": "012276",
    "code": "ARCH5650",
    "subject": "ARCH",
    "number": "5650",
    "honors": false,
    "writing": false,
    "name": "Topics Architectural Practice",
    "fullname": "Topics in Architectural Practice",
    "info": "Topics in architectural practice, methods of design production, marketing, operation, and relationships among clients, architecture, and society.\n\nprereq: 5621, Arch major or 5621, M Arch major or instr consent",
    "prereq": {
      "or": [
        "012263"
      ]
    }
  },
  {
    "uid": "807868",
    "code": "ARCH5651",
    "subject": "ARCH",
    "number": "5651",
    "honors": false,
    "writing": false,
    "name": "Building Stories",
    "fullname": "Building Stories",
    "info": "Professional practice education by means of case study analysis.",
    "prereq": {}
  },
  {
    "uid": "015391",
    "code": "ARCH5670",
    "subject": "ARCH",
    "number": "5670",
    "honors": false,
    "writing": false,
    "name": "Topics in Historic Preservatn",
    "fullname": "Topics in Historic Preservation",
    "info": "Selected topics in the theory, philosophy, research, and methods of architectural historic preservation.",
    "prereq": {}
  },
  {
    "uid": "012040",
    "code": "ARCH5671",
    "subject": "ARCH",
    "number": "5671",
    "honors": false,
    "writing": false,
    "name": "Hist Prsvtn",
    "fullname": "Historic Preservation",
    "info": "Philosophy, theory, origins of historic preservation. Historic archaeology/research, descriptive analysis, documentation of historic buildings. Government's role in historic preservation, preservation standards/guidelines, preservation/building codes, preservation advocacy.",
    "prereq": {}
  },
  {
    "uid": "012110",
    "code": "ARCH5672",
    "subject": "ARCH",
    "number": "5672",
    "honors": false,
    "writing": false,
    "name": "Hist Bldg Consrvtn",
    "fullname": "Historic Building Conservation",
    "info": "Historic building materials, systems, and methods of conservation. Discussion of structural systems, building repair and pathology, introduction of new environmental systems in historic buildings, and conservation of historic interiors. Research on historic building materials and techniques using primary and secondary resources and on documentation of a specific historic site through large-format photography and measured drawings.\n\nprereq: 3412, 5671 or instr consent",
    "prereq": {
      "or": [
        "011316",
        "012040"
      ]
    }
  },
  {
    "uid": "015448",
    "code": "ARCH5673",
    "subject": "ARCH",
    "number": "5673",
    "honors": false,
    "writing": false,
    "name": "Hist Prty Resch and Docmtatn",
    "fullname": "Historic Property Research and Documentation",
    "info": "Philosophy, theory, methods of historic building research. Descriptive analysis of buildings, building documentation, historical archaeology, architectural taxonomy.\n\nprereq: [3412, 3641, 4671, 5671, 4672 or 5672] or instr consent",
    "prereq": {
      "or": [
        "011316",
        "804747",
        "797848",
        "012040",
        "797849",
        "012110"
      ]
    }
  },
  {
    "uid": "807334",
    "code": "ARCH5674",
    "subject": "ARCH",
    "number": "5674",
    "honors": false,
    "writing": false,
    "name": "World Heritage Conservation",
    "fullname": "World Heritage Conservation",
    "info": "Investigations of World Heritage conservation and nomination for the preservation of historic buildings and sites and their management for public use. Case studies link current practices, methods, and solutions with expert preservationists, site conservationists and local communities in the development and design of preservation strategies.\n\nprereq: MS in Arch-HP concentration or M.ARCH or MLA or instr consent",
    "prereq": {}
  },
  {
    "uid": "807348",
    "code": "ARCH5676",
    "subject": "ARCH",
    "number": "5676",
    "honors": false,
    "writing": false,
    "name": "Economics of Heritage Pres.",
    "fullname": "Economics of Heritage Preservation",
    "info": "Theory and practice of heritage preservation-based community redevelopment/economics. Financial aspects of real estate development. Case studies of recent historic rehabilitation projects throughout Minnesota. Financial feasibility and compliance with design guidelines/regulatory aspects. Financial incentives in other states/how new policies in Minnesota might positively influence preservation activity.",
    "prereq": {}
  },
  {
    "uid": "811595",
    "code": "ARCH5677",
    "subject": "ARCH",
    "number": "5677",
    "honors": false,
    "writing": false,
    "name": "Preservation Vernacular Envir.",
    "fullname": "Preservation of the Vernacular Built Environment and Cultural Landscape",
    "info": "Theoretical, methodological, practical implications of preserving vernacular environment such as commercial blocks, strips/buildings, warehouses/sheds, wharves/piers, abandoned streetcar tracks/railroad spurs.\n\nprereq: Grad student, open to upper level (junior/senior) undergraduates with instr consent. Honors student encouraged.",
    "prereq": {}
  },
  {
    "uid": "816818",
    "code": "ARCH5678",
    "subject": "ARCH",
    "number": "5678",
    "honors": false,
    "writing": false,
    "name": "Preservation & Sustainability",
    "fullname": "Preservation & Sustainability",
    "info": "Topics covered include identification of historic properties, consideration of constraints on modification, examination of potential energy-saving treatments, consideration of the full range of options for \u0093greening\u0094 buildings and neighborhood, and discussion of resolution of conflicts between the two. ",
    "prereq": {}
  },
  {
    "uid": "813209",
    "code": "ARCH5686",
    "subject": "ARCH",
    "number": "5686",
    "honors": false,
    "writing": false,
    "name": "Research into Practice",
    "fullname": "Capstone: Research into Practice",
    "info": "ARCH 5686 is the first of a two-course sequence required as the capstone experience for MS-ARP students. The course provides a forum for understanding the current state of research in the design and building industry and its trajectories and trends. Student projects will apply this knowledge to a research topic area in the building industry, assessing research capacity of practice in the topic area, mapping its potential in context of innovative precedents, research literature, and suggesting future of practice.\n\nprereq: MS-RP student",
    "prereq": {}
  },
  {
    "uid": "813210",
    "code": "ARCH5687",
    "subject": "ARCH",
    "number": "5687",
    "honors": false,
    "writing": false,
    "name": "Practice into Research",
    "fullname": "Capstone: Practice into Research",
    "info": "ARCH 5687 is the second of a two-course sequence required as the capstone experience for MS-ARP students. Building upon the previous semester understanding the state of research in particular topic area in the building industry, this course develops and implements a single research project in comparative context. The work of individual students adds to a collective knowledge base on practice-based applied research best practices and development of industry-wide knowledge, metrics, and standards. \n\nprereq: Arch 5686",
    "prereq": {
      "and": [
        "813209"
      ]
    }
  },
  {
    "uid": "813211",
    "code": "ARCH5688",
    "subject": "ARCH",
    "number": "5688",
    "honors": false,
    "writing": false,
    "name": "Built Envt Research Prac Collo",
    "fullname": "Built Environments Research Practices Colloquium",
    "info": "The Research Practices internship is intended to develop meaningful connections between education, practice, and research as the key experience-based learning in the Master of Science Applied Research Practices in Built Environments concentration. Coursework is focused on advancing practice-based and use-inspired applied research which builds upon robust literature review, case-based knowledge, evidence-based design, and performance-based outcomes for the built environment industry. The course work is structured to identify and develop practice-engaged emerging research questions, conduct and implement research design, disseminate best practices, case studies, design frameworks, and strategies to drive innovation, ensure quality, and create value for the profession of architecture which will maximize positive environmental, social, and economic impacts. \n\nThis course is specifically related to internship experience in a local or regional context to study larger emerging practice-related issues in the Research Practices Consortium. Students have access to professional firms in the Research Practices Consortium. Research Practices Internships are based on research priorities set by the Consortium, particular member firm, student intern, and faculty advisors. Additional firms (national and international as appropriate) outside the region may be used as comparators. Students are asked to form research networks in academia and practice. In this course, students position research as Practice knowledge based on topics in the Research Practices internships.\n\nIn this 1 credit course, the themes are addressed in graphic and text representation are described below. Visual methods of data collection, analysis and representation along with diagramming concepts and information graphics are essential to understanding and explaining critical issues in a research implementation and/or case study in the built environment fields. The format of information can be designed to emphasize comparisons between data sets or projects or to highlight unique characteristics of research finding or  individual projects. This course will explore a variety of strategies commonly used in built environment practices and ask the student to apply one method to present the research and/or case developed in the Research Practices Internship. Additionally, this course relates the research definition completed in the Research Practices internship to Practice by conceptualizing and diagramming related case studies and/or examining, critiquing current methods of practice, and proposing future methods of practice in response to the research.\n",
    "prereq": {}
  },
  {
    "uid": "818202",
    "code": "ARCH5689",
    "subject": "ARCH",
    "number": "5689",
    "honors": false,
    "writing": false,
    "name": "Adv. Inclusive Pro Practice",
    "fullname": "Advanced Inclusive Professional Practice",
    "info": "Advanced inclusive professional practice class focuses on new and emerging issues in architectural practice including: Lean design, research practices, collaborative intercultural competence. Student projects include creation of interactive material and diagrams.",
    "prereq": {}
  },
  {
    "uid": "012279",
    "code": "ARCH5711",
    "subject": "ARCH",
    "number": "5711",
    "honors": false,
    "writing": false,
    "name": "Theory and Principles",
    "fullname": "Theory and Principles of Urban Design",
    "info": "Seminar. Debate on dominant theories/paradigms informing city design from renaissance to 21th century. Critical issues central to current debates.\n\nprereq: M Arch major or LA grad major or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "794211",
    "code": "ARCH5721",
    "subject": "ARCH",
    "number": "5721",
    "honors": false,
    "writing": false,
    "name": "Case Studies in Urban Design",
    "fullname": "Case Studies in Urban Design",
    "info": "Reading seminar. Evolution of contemporary city. Dynamics that created contemporary urban spatial patterns. Planning/design theories that have guided public interventions in built environment. Thematic texts, classroom discussions.\n\nprereq: Grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "798446",
    "code": "ARCH5724",
    "subject": "ARCH",
    "number": "5724",
    "honors": false,
    "writing": false,
    "name": "Meanings of Place",
    "fullname": "Meanings of Place",
    "info": "Analysis of meanings and messages of surroundings, and examination of links between sense of place and feelings of well-being. Exploration of what present-day environments can reveal about the past. Survey of Twin Cities' central district and selected neighborhoods, and other settings inside and outside Minnesota. ",
    "prereq": {}
  },
  {
    "uid": "804098",
    "code": "ARCH5731",
    "subject": "ARCH",
    "number": "5731",
    "honors": false,
    "writing": false,
    "name": "Territorial City",
    "fullname": "Territorial City",
    "info": "Seminar. Students research, define, and test conditions within which the territory and contemporary city coexist. Site for research is Twin Cities metropolitan area.\nReadings, discussions, field trips, collaborative development of urban proposals.",
    "prereq": {}
  },
  {
    "uid": "012281",
    "code": "ARCH5750",
    "subject": "ARCH",
    "number": "5750",
    "honors": false,
    "writing": false,
    "name": "Topics in Urban Design",
    "fullname": "Topics in Urban Design",
    "info": "Special topics in theory/practice of urban design.",
    "prereq": {}
  },
  {
    "uid": "816844",
    "code": "ARCH5756",
    "subject": "ARCH",
    "number": "5756",
    "honors": false,
    "writing": false,
    "name": "Public Interest Design",
    "fullname": "Public Interest Design: Principles and Practices",
    "info": "As the allied fields of design evolve in response to an increasing number of global challenges\u0097inequity, social and political turmoil, disruptive climate-change, accelerating population growth\u0097the question of how designers will address the needs of the most vulnerable among us is fundamental.\n\nPublic Interest Design (PID), an emerging area of specialization within the design professions, specifically considers the concerns of the vast majority of the world's inhabitants who are historically under-resourced and ill-equipped to respond to the \"Grand Challenges\" facing humankind.  \n\nWith this mind, this introductory survey course has two aims:   \n\nFirst, to critically examine the range of environmental, economic, social, and ethical issues that underpins work with under-resourced domestic and international communities\u0097including how these concerns can be collectively addressed to become more resilient; and second, to investigate organizational models that seek to broaden the traditional scope of the allied design fields as disciplines and professions by advocating a humanitarian basis for practice.       \n",
    "prereq": {}
  },
  {
    "uid": "803726",
    "code": "ARCH5770",
    "subject": "ARCH",
    "number": "5770",
    "honors": false,
    "writing": false,
    "name": "Field Studies in Urban Design",
    "fullname": "Field Studies in Urban Design",
    "info": "Travel study of urbanism through guided field trips and lectures by local experts. Relationship between built environment, land, water, and transit. Planning and development policies. On-site graphic documentation and analysis. Design or written papers.",
    "prereq": {}
  },
  {
    "uid": "794217",
    "code": "ARCH5790",
    "subject": "ARCH",
    "number": "5790",
    "honors": false,
    "writing": false,
    "name": "Special Topics Met Design",
    "fullname": "Special Topics in Metropolitan Design",
    "info": "Special Topics in Metropolitan Design",
    "prereq": {}
  },
  {
    "uid": "012282",
    "code": "ARCH5993",
    "subject": "ARCH",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "012283",
    "code": "ARCH8101",
    "subject": "ARCH",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "Subj Mthds Arch",
    "fullname": "Subjects and Methods in Architecture",
    "info": "The discipline of architecture.\n\nprereq: Grad Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012284",
    "code": "ARCH8250",
    "subject": "ARCH",
    "number": "8250",
    "honors": false,
    "writing": false,
    "name": "Adv Topics Design",
    "fullname": "Advanced Topics in Design",
    "info": "Design studio.\n\nprereq: Admitted to 3+ track for MArch prog or instr consent",
    "prereq": {}
  },
  {
    "uid": "012285",
    "code": "ARCH8251",
    "subject": "ARCH",
    "number": "8251",
    "honors": false,
    "writing": false,
    "name": "Grad Arch Dsgn I",
    "fullname": "Graduate Architectural Design I",
    "info": "Design projects focus on fundamental issues of space/form/ light/materiality in relation to human habitation. Design as a process of exploration/inquiry. Modes/media of\nrepresentation, their critical impact.\n\nprereq: MArch or instr consent",
    "prereq": {}
  },
  {
    "uid": "012286",
    "code": "ARCH8252",
    "subject": "ARCH",
    "number": "8252",
    "honors": false,
    "writing": false,
    "name": "Grad Arch Dsgn II",
    "fullname": "Graduate Architectural Design II",
    "info": "Fundamental architectural problems involving design as a creative inquiry.  Individual and collaborative effort.\n\nprereq: 8251, grad Arch major or instr consent",
    "prereq": {
      "or": [
        "012285"
      ]
    }
  },
  {
    "uid": "012294",
    "code": "ARCH8253",
    "subject": "ARCH",
    "number": "8253",
    "honors": false,
    "writing": false,
    "name": "Grad Arch Dsgn III",
    "fullname": "Graduate Architectural Design III",
    "info": "Issues of design process, representation, programming, technology, and urban relations.\n\nprereq: [8251, MArch] or instr consent",
    "prereq": {
      "and": [
        "012285"
      ]
    }
  },
  {
    "uid": "012296",
    "code": "ARCH8254",
    "subject": "ARCH",
    "number": "8254",
    "honors": false,
    "writing": false,
    "name": "Tech Applications in Design",
    "fullname": "Technical Applications in Design",
    "info": "Design potential inherent in technical development process of design project. Testing concepts, developing details, integrating building systems. Structural bay enclosure, cost considerations, regulatory compliance. Building-information modeling, analog/digital representations in architecture document production.\n\nprereq: [8253, MArch major] or dept consent",
    "prereq": {
      "or": [
        "012294"
      ]
    }
  },
  {
    "uid": "012297",
    "code": "ARCH8255",
    "subject": "ARCH",
    "number": "8255",
    "honors": false,
    "writing": false,
    "name": "Grad Arch Dsgn V",
    "fullname": "Graduate Architectural Design V",
    "info": "Fundamental architectural problems involving design as a creative inquiry. Individual/collaborative effort.\n\nprereq: [8254, grad Arch major] or instr consent",
    "prereq": {
      "or": [
        "012296"
      ]
    }
  },
  {
    "uid": "012301",
    "code": "ARCH8295",
    "subject": "ARCH",
    "number": "8295",
    "honors": false,
    "writing": false,
    "name": "Dir Grad Arch  Design",
    "fullname": "Directed Graduate Architectural Design",
    "info": "N/A\n\nprereq: 8251, grad Arch major or instr consent",
    "prereq": {
      "or": [
        "012285"
      ]
    }
  },
  {
    "uid": "803494",
    "code": "ARCH8299",
    "subject": "ARCH",
    "number": "8299",
    "honors": false,
    "writing": false,
    "name": "Master's Final Project",
    "fullname": "Master's Final Project",
    "info": "Final studio project for Plan C master's. Measures knowledge of architecture and ability to conduct research for design proposal, communicate in visual/written representations. Proposal, graphic presentation of project.\n\nprereq: Plan C, MArch",
    "prereq": {}
  },
  {
    "uid": "788078",
    "code": "ARCH8333",
    "subject": "ARCH",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "012305",
    "code": "ARCH8350",
    "subject": "ARCH",
    "number": "8350",
    "honors": false,
    "writing": false,
    "name": "Adv Topics in Rep",
    "fullname": "Advanced Topics in Representation",
    "info": "Theory and practice of visual representation in architecture.\n\nprereq: Grad Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012309",
    "code": "ARCH8450",
    "subject": "ARCH",
    "number": "8450",
    "honors": false,
    "writing": false,
    "name": "Topics in Theory",
    "fullname": "Topics in Theory",
    "info": "Topics vary\n\nprereq: 5411, grad Arch major or instr consent",
    "prereq": {
      "or": [
        "012038"
      ]
    }
  },
  {
    "uid": "012308",
    "code": "ARCH8494",
    "subject": "ARCH",
    "number": "8494",
    "honors": false,
    "writing": false,
    "name": "Dir Rsrch Arch His",
    "fullname": "Directed Research in Architectural History",
    "info": "tbd\n\nprereq: Grad Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012312",
    "code": "ARCH8550",
    "subject": "ARCH",
    "number": "8550",
    "honors": false,
    "writing": false,
    "name": "Topics Technology",
    "fullname": "Topics in Technology",
    "info": "Special topics in theory/practice of architecture technologies.\n\nprereq: Grad arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "797882",
    "code": "ARCH8561",
    "subject": "ARCH",
    "number": "8561",
    "honors": false,
    "writing": false,
    "name": "Sustainable Design Thry&Prctce",
    "fullname": "Sustainable Design Theory and Practice",
    "info": "History, theory, and ethics of sustainable design processes/practices. Emphasizes approaches to sustainable architecture. Regional/global ecological issues, design strategies, methods of assessment. Primary architectural/technological implications of sustainable design theory/practice that inform design thinking/research. Sustainable design issues. Research projects, case studies, fieldwork.\n\nprereq: [5513, [grad MS or MArch]] or instr consent",
    "prereq": {
      "and": [
        "012125"
      ]
    }
  },
  {
    "uid": "797866",
    "code": "ARCH8563",
    "subject": "ARCH",
    "number": "8563",
    "honors": false,
    "writing": false,
    "name": "Energy&IEQ for Sustainable Des",
    "fullname": "Energy and Indoor Environmental Quality Issues in Sustainable Design",
    "info": "Energy/IEQ aspects of sustainable design related to global environmental issues. Energy/IEQ strategies, methods, and tools as applied to sustainable building design. Research projects, case studies.\n\nprereq: [5513, [grad MS or MArch]] or instr consent",
    "prereq": {
      "and": [
        "012125"
      ]
    }
  },
  {
    "uid": "797883",
    "code": "ARCH8565",
    "subject": "ARCH",
    "number": "8565",
    "honors": false,
    "writing": false,
    "name": "Materials Perfrm Sustnble Bldn",
    "fullname": "Materials Performance in Sustainable Building",
    "info": "Building-material properties, resource conservation, fabrication/construction processes in production of high performance sustainable building designs. Application of assessment/evaluation tools (LCA, BEES, Athena or LEED) for IEQ, waste reduction and management with an emphasis on experimental/analytic methods. Aesthetic/technical solutions that integrate design selection processes, construction methods, commissioning processes, and facility management, maintenance, and decommissioning.\n\nprereq: [5512, grad MS or March]] or instr consent",
    "prereq": {
      "or": [
        "012119"
      ]
    }
  },
  {
    "uid": "797867",
    "code": "ARCH8567",
    "subject": "ARCH",
    "number": "8567",
    "honors": false,
    "writing": false,
    "name": "Site/Water Sustainable Design",
    "fullname": "Site and Water Issues in Sustainable Design",
    "info": "Site, water and site/building integration aspects of sustainable design. Ecological principles, site analysis. Water/site/building integration strategies, methods, and tools integrated with sustainable design issues such as energy, indoor environmental quality, and materials.  Research projects, case studies, measurement methods.\n\nprereq: [5512, [grad MS or MArch student]] or instr consent",
    "prereq": {
      "and": [
        "012119"
      ]
    }
  },
  {
    "uid": "012313",
    "code": "ARCH8650",
    "subject": "ARCH",
    "number": "8650",
    "honors": false,
    "writing": false,
    "name": "Topics Arch Practice",
    "fullname": "Topics in Architectural Practice",
    "info": "N/A\n\nprereq: Grad Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012316",
    "code": "ARCH8750",
    "subject": "ARCH",
    "number": "8750",
    "honors": false,
    "writing": false,
    "name": "Topics Urban Design",
    "fullname": "Topics in Urban Design",
    "info": "N/A\n\nprereq: Grad Arch major or instr consent",
    "prereq": {}
  },
  {
    "uid": "788570",
    "code": "ARCH8777",
    "subject": "ARCH",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only",
    "prereq": {}
  }
]