[
  {
    "uid": "005419",
    "code": "BIOL1001",
    "subject": "BIOL",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Evolution & Ecology",
    "fullname": "Introductory Biology: Evolutionary and Ecological Perspectives",
    "info": "A one-semester exploration of the genetic, evolutionary, and ecological processes that govern biological diversity from populations to ecosystems. We explore how these processes influence human evolution, health, population growth, and conservation. We also consider how the scientific method informs our understanding of biological processes. Lab. This course is oriented towards non-majors and does not fulfill prerequisites for allied health grad programs.",
    "prereq": {}
  },
  {
    "uid": "005420",
    "code": "BIOL1002W",
    "subject": "BIOL",
    "number": "1002",
    "honors": false,
    "writing": true,
    "name": "Molecular, Cell & Development",
    "fullname": "Introductory Biology II: Molecular, Cellular, and Developmental Perspectives",
    "info": "Chemistry of living things, cell structure/transport, energy processing in cells, introduction to primary metabolism, molecular genetics, cell physiology, cell cycles, principles of animal/plant development, regulation of development. Lab focuses on molecular scientific techniques, investigative designs.",
    "prereq": {}
  },
  {
    "uid": "803629",
    "code": "BIOL1003",
    "subject": "BIOL",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "Evolution and Biology of Sex",
    "fullname": "Evolution and Biology of Sex",
    "info": "This course is designed as a one-semester exploration of biology from the standpoint of the evolution and biology of sex. It emphasizes scientific processes, evolution, sexual behavior, reproductive biology, and diversity with respect to sexual orientation, reproductive strategies, and gender identity. Lab activities complement these topics. This course does not fulfill prerequisites for allied health grad programs.",
    "prereq": {}
  },
  {
    "uid": "005416",
    "code": "BIOL1009",
    "subject": "BIOL",
    "number": "1009",
    "honors": false,
    "writing": false,
    "name": "General Biology",
    "fullname": "General Biology",
    "info": "A comprehensive introduction to biology - includes molecular structure of living things, cell processes, energy utilization, genetic information and inheritance, mechanisms of evolution, biological diversity, and ecology. Includes lab. This comprehensive course serves as a prerequisite and requirement in many majors.\n\n ",
    "prereq": {}
  },
  {
    "uid": "798578",
    "code": "BIOL1011",
    "subject": "BIOL",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "General Biology for CSE",
    "fullname": "General Biology for College of Science and Engineering Students",
    "info": "Major concepts of modern biology. Molecular structure of living things, energy recruitment/utilization, flow of genetic information through organisms/populations. Principles of inheritance, ecology, and evolution. Lecture component is concurrent with 1009 lecture. ",
    "prereq": {}
  },
  {
    "uid": "805043",
    "code": "BIOL1012",
    "subject": "BIOL",
    "number": "1012",
    "honors": false,
    "writing": false,
    "name": "Human Biology",
    "fullname": "Human Biology: Concepts and Current Ethical Issues",
    "info": "One semester exploration of human anatomy and physiology within the context of ethics; topics such as human genetic diversity, organs and tissues, disease and reproduction. Weekly policy debates.  Active learning format. Animal dissections required. Suitable for students in any major. Must be taken in addition to BIOL 1009 to fulfill prerequisites for allied health grad programs.\n\nThis course explores several interdisciplinary questions, each of which addresses biology through an ethical and societal lens.  In “What makes humans unique?”, we will consider the evolution of human traits, how the concept of race relates to human genetic diversity, and the fallibility of human memories.  In “How does blood and organ donation work?”, we will examine how our bodies can recognize and respond to foreign materials, how vaccines work, and who should have access to life saving tissue and organ transplants.  In “How do stress, diet and exercise affect health?” ,we will consider disparities in access to adequate nutrition, exposure to stress, and exercise, and how these affect our bodies and our mental health.  Lastly, in “How does a unique individual develop from a single cell”, we will examine how a single cell develops into a fully functional human being, and how similar processes lead to cancer. We will also consider the role of genes and hormones in human reproduction and the development of reproductive structures in embryos, while explicitly addressing the ethics of the distinctions between the concepts of sex characteristics, sex assigned at birth, and gender. We will learn how a cell can become cancerous, as well as how a cell develops into a fully functioning human being.  Additionally, we will consider the role of hormones in the development of male, female, and intersex organs, while being explicit about the differences between gender, sexual orientation, and sex assigned at birth.  \n\nIn lecture, instructors and teaching assistants will support students as they evaluate data and work through concepts in teams. Students will also dedicate significant time to the consideration of ethical questions in human biology, and work with teammates to organize and present a position on a policy related to an ethics question. In lab, students will further explore human anatomy and physiology, connecting structure and function through several dissections and activities. Students will read and share scientific papers, make observations, design experiments and analyze data.  Students will work in teams to complete a multi-week project on the physiology of stress. We will continue our exploration of ethics topics in lab, where we will discuss and apply ethics in human subjects research and research on non-human animals.  \n\nAbout ⅓ of the course grade will be based on four traditional lecture exams and a final lab exam. The remainder of the course grade is comprised of open notes quizzes, in class team assignments, individual assignments, and team projects. Course grading is based on mastery of concepts and skills, and students are encouraged to collaborate in understanding course material.",
    "prereq": {}
  },
  {
    "uid": "816440",
    "code": "BIOL1015",
    "subject": "BIOL",
    "number": "1015",
    "honors": false,
    "writing": false,
    "name": "Human Physiology",
    "fullname": "Human Physiology, Technology, and Medical Devices",
    "info": "Course is organized around homeostasis, information flow, and other concepts in physiology. For non-biology majors who wish to explore interests in health care or medical device engineering. Active learning format. Labs focus on data collection and simple organ dissections. Does not fulfill prerequisites for most biomedical graduate programs.",
    "prereq": {}
  },
  {
    "uid": "000440",
    "code": "BIOL1021",
    "subject": "BIOL",
    "number": "1021",
    "honors": false,
    "writing": false,
    "name": "Careers in Life Sciences",
    "fullname": "Introduction to Careers in the Life Sciences",
    "info": "BIOL 1021 exposes students to different career pathways and opportunities in the life sciences and related fields. The class will feature guest speakers, lab and facility tours, and small group discussions led by CBS student leaders to foster community and connections. Weekly career content and reflection assignments will support students' academic and career goals.",
    "prereq": {}
  },
  {
    "uid": "011160",
    "code": "BIOL1041",
    "subject": "BIOL",
    "number": "1041",
    "honors": false,
    "writing": false,
    "name": "Grad Program Prep",
    "fullname": "Preparation for Graduate Programs in Science",
    "info": "Necessary elements for excelling in mathematics, physical and biological sciences to prepare for graduate work in science. Required for new freshmen in the Mathematics and Science Tutorial (MST) Program. ",
    "prereq": {}
  },
  {
    "uid": "804799",
    "code": "BIOL1052",
    "subject": "BIOL",
    "number": "1052",
    "honors": false,
    "writing": false,
    "name": "Envir. Biol.: Sci & Solutions",
    "fullname": "Environmental Biology: Science and Solutions",
    "info": "This course explores the science behind environmental topics. It delves into the interface of science and policy, environmental decision-making and ethics. Topics include biodiversity, environmental toxicology, food production, and global climate change. Students looking to fulfill the liberal education requirement-Biological Sciences with Lab in this topic should take Biology 1055.",
    "prereq": {}
  },
  {
    "uid": "809995",
    "code": "BIOL1055",
    "subject": "BIOL",
    "number": "1055",
    "honors": false,
    "writing": false,
    "name": "Envir. Biol. with Lab",
    "fullname": "Environmental Biology: Science and Solutions with Laboratory",
    "info": "Explores science behind environmental topics. Delves into the interface of science and policy, environmental decision-making and ethics. Topics include biodiversity, env. toxicology, food production, and climate change. In lab students conduct the work of biologists, proposing hypotheses, conducting experiments, and analyzing/interpreting data. This course is intended to engage non-biology majors in the work of biology, studying current biological knowledge through evidence-based discussions of what is currently known, and by addressing science that is unknown to the students (and, at times to the biological community) through the generation and testing of hypotheses, collection and analysis of data, and practice of making data-informed conclusions.  \n\n",
    "prereq": {}
  },
  {
    "uid": "008234",
    "code": "BIOL1093",
    "subject": "BIOL",
    "number": "1093",
    "honors": false,
    "writing": false,
    "name": "Biol Colloq Dir Std",
    "fullname": "Biology Colloquium: Directed Study",
    "info": "Individual study or research undertaken by a student concurrently enrolled in Biol 1020 with oversight by a faculty sponsor.\n\nprereq: 1020 and concurrent registration is required (or allowed) in  1020",
    "prereq": {}
  },
  {
    "uid": "013320",
    "code": "BIOL1101",
    "subject": "BIOL",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Genetics and Society",
    "fullname": "Genetics and Society",
    "info": "Principles of heredity and their social and cultural implications.\n\nprereq: Credit will not be granted if credit has been received for: BIOL 3020, Biol 4003, GCD 3022. No CBS Major Juniors or Seniors.",
    "prereq": {
      "or": [
        "009489",
        "006271"
      ]
    }
  },
  {
    "uid": "795036",
    "code": "BIOL1105",
    "subject": "BIOL",
    "number": "1105",
    "honors": false,
    "writing": false,
    "name": "Intro Biol Soc Env",
    "fullname": "Introduction to Biology, Society, and the Environment",
    "info": "Social context of biology, relevance of biology to social/environmental issues. How biology shapes and is shaped by current events, legislation, ethical concerns, and history. Case studies, discussion.",
    "prereq": {}
  },
  {
    "uid": "016138",
    "code": "BIOL1111",
    "subject": "BIOL",
    "number": "1111",
    "honors": false,
    "writing": false,
    "name": "Biology Freshman Seminar",
    "fullname": "Freshman Seminar for the biological Sciences",
    "info": "Orientation to University environment.  Special topics that illustrate the importance of biological topics/issues in modern society.",
    "prereq": {}
  },
  {
    "uid": "016146",
    "code": "BIOL1113",
    "subject": "BIOL",
    "number": "1113",
    "honors": false,
    "writing": false,
    "name": "Biology Freshman Seminar",
    "fullname": "Freshman Seminar for the Biological Sciences",
    "info": "Orientation to University environment.  Special topics that illustrate the importance of biological topics/issues in modern society.  Writing-intensive.",
    "prereq": {}
  },
  {
    "uid": "801118",
    "code": "BIOL1301",
    "subject": "BIOL",
    "number": "1301",
    "honors": false,
    "writing": false,
    "name": "Introduction to Leadership",
    "fullname": "Dean's Scholar: Introduction to Leadership",
    "info": "Leadership theory/concepts. Personal views on leadership. Characteristics for effective leadership. Course uses experiential teaching methods, self-reflection.\n\nprereq: Dean's Scholar",
    "prereq": {}
  },
  {
    "uid": "808500",
    "code": "BIOL1700",
    "subject": "BIOL",
    "number": "1700",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Biology",
    "fullname": "Special Topics in Biology",
    "info": "Faculty members lead students in discussion on topics of interest.",
    "prereq": {}
  },
  {
    "uid": "793065",
    "code": "BIOL1805",
    "subject": "BIOL",
    "number": "1805",
    "honors": false,
    "writing": false,
    "name": "Nature of Life",
    "fullname": "Nature of Life: Introducing New Students to the Biological Sciences",
    "info": "Building on incoming student summer programming to get started in the Biological Sciences in CBS. Providing transition programming, academic success tools, college learning, and guidance as a foundation for success in the biological sciences. Introduction to the College of Biological Sciences community and opportunities through class content, guild activities, and peer mentoring.\n\nprereq: Fr in College of Biological Sciences",
    "prereq": {}
  },
  {
    "uid": "808856",
    "code": "BIOL1806",
    "subject": "BIOL",
    "number": "1806",
    "honors": false,
    "writing": false,
    "name": "Nature of Life, Part Two",
    "fullname": "Nature of Life, Part Two",
    "info": "Second semester of Nature of Life with focus on building intentional pathway in CBS/student success/engagement.\n\nprereq: 1805",
    "prereq": {
      "and": [
        "793065"
      ]
    }
  },
  {
    "uid": "826451",
    "code": "BIOL1807",
    "subject": "BIOL",
    "number": "1807",
    "honors": false,
    "writing": false,
    "name": "Nature of Life Part III",
    "fullname": "Nature of Life Part III",
    "info": "Reflect on aspirations, personal characteristics, values, and experiences thus far. Use resources/practical tools to reach educational/professional goals. Special focus on developing personal/professional goals, articulating personal experiences in light of aspirations.",
    "prereq": {}
  },
  {
    "uid": "016578",
    "code": "BIOL1901",
    "subject": "BIOL",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "ScienceSpeak: Communicating",
    "fullname": "ScienceSpeak: Communicating Science in Daily Life",
    "info": "How could we communicate science better in daily life? This seminar is designed for students to learn effective practices to have “better” conversations about science in their professional and personal lives. Within class, we’ll discuss current scientific topics as shared in popular media, as well as the challenges facing scientists, in particular with disputed ideas! The point is not to become an expert on any scientific topic but rather to support future scientific leaders so they can effectively share scientific knowledge and have meaningful conversations about science with those in their daily lives.",
    "prereq": {}
  },
  {
    "uid": "016582",
    "code": "BIOL1903",
    "subject": "BIOL",
    "number": "1903",
    "honors": false,
    "writing": false,
    "name": "Biology Freshman Seminar",
    "fullname": "Freshman Seminar for the Biological Sciences",
    "info": "Orientation to University environment. Special topics illustrate importance of biological issues.",
    "prereq": {}
  },
  {
    "uid": "811873",
    "code": "BIOL1904",
    "subject": "BIOL",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Storytelling/Startups Ireland",
    "fullname": "Storytelling and Startups in Ireland",
    "info": "Ireland has a long and successful literary tradition and it is no accident that the \"gift of the gab\", the ability to speak eloquently and persuasively, is associated with the Irish, for example the legend of the Blarney Stone. The Irish tradition of storytelling is promoted in the Irish education system, by government policies, and most obviously by Irish pub culture. The result is that creativity in the arts and in business is strong in Ireland. Dublin is the emerging \"heart of technology in Europe\", home to many business startups and to proven juggernauts such as Google, Facebook, AirBnB, and Amazon. This class will explore components of education, culture, and business management that cultivate creativity and innovation. We will study current examples of success and failure. As a class we will move beyond our natural constraints and travel abroad over spring break to Dublin to understand the rich Irish history of storytelling across disciplines, including art, science, and business.  This course involves a study abroad component and travels to Ireland during spring break. Please note that you must also apply and confirm your spot for this course through the Learning Abroad Center. Application deadline is December 1. For more information, visit: https://umabroad.umn.edu/programs",
    "prereq": {}
  },
  {
    "uid": "016667",
    "code": "BIOL1905",
    "subject": "BIOL",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Swedish Innovation",
    "fullname": "Beyond the Nobel Prize: Examining the Evolution of Swedish Innovation",
    "info": "This course is open to undergraduates from all disciplines and will appeal to students with a broad interest in the creative process and understanding innovation of the past and present. Using the Nobel Prize awards as examples of academic, cultural, and scientific advances, students will examine innovation across a variety of disciplines and consider how solutions to problems facing society requires creativity, collaboration, and new ways of thinking. In addition to examining the contributions of Nobel Laureates, students will learn about the rich contributions of Swedes through inventions such as the Better Shelter, zipper, ultrasound, pacemaker, and 3-point seat belt.",
    "prereq": {}
  },
  {
    "uid": "818086",
    "code": "BIOL1906",
    "subject": "BIOL",
    "number": "1906",
    "honors": false,
    "writing": false,
    "name": "Tradition & Innovation Iceland",
    "fullname": "Tradition and Innovation in Iceland",
    "info": "This course will examine Icelandic innovation. It will consider how the society was able to survive multiple famines, plagues, volcanic eruptions, pirate raids, and wars to become one of the most innovative countries in the world. We will also examine how the education system and government policy contribute to innovation and the benefits of innovation in business.",
    "prereq": {}
  },
  {
    "uid": "826382",
    "code": "BIOL1907",
    "subject": "BIOL",
    "number": "1907",
    "honors": false,
    "writing": false,
    "name": "Astrobiology",
    "fullname": "Astrobiology: The science of the search for life on other planets",
    "info": "The field of Astrobiology is relatively new and brings together concepts from many different scientific fields (including geology, chemistry, biology, astronomy, and planetary science) to help answer one of the most fundamental questions humankind has postulated looking up at the stars: Are we alone in the Universe? Building from a foundation of what we know about life today and what we know of past life preserved in the rock record on Earth, we have embarked on a quest to look for signs of life on habitable worlds in our solar system (including Mars, Europa, Ganymede, and Enceladus). Furthermore, with an ever increasing catalog of worlds detected around stars outside of our solar system, we are studying how to look for life on worlds beyond our solar system.This course will address questions that are fundamental to Astrobiology, including: What is life? What are the requisites for life as we know it? Were these requisites present on other worlds in the past, or are they present today? How do we look for signs of past or present life on other worlds? To help address these questions, students will be exposed to basic principles of astronomy (star formation, planetary accretion), geology (planetary composition, geologic time, plate tectonics, preservation of biosignatures), chemistry (elements and reactions essential to life, chemical signatures life produces), and biology (metabolism, chemotrophy, phototrophy, biological innovation). Students will leave this course with a deeper understanding of: how our solar system and planet formed; how life developed and evolved; planetary geology and geologic time; the types of life present in extreme environments; what conditions are necessary to make a world habitable; past, present, and future missions looking for life on other worlds; and the place of our planet in the universe.",
    "prereq": {}
  },
  {
    "uid": "016666",
    "code": "BIOL1910W",
    "subject": "BIOL",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Biology Freshman Seminar",
    "fullname": "Freshman Seminar for the Biological Sciences",
    "info": "Orientation to University environment. Special topics that illustrate the importance of biological topics/issues in modern society. Writing-intensive.",
    "prereq": {}
  },
  {
    "uid": "816976",
    "code": "BIOL1911",
    "subject": "BIOL",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Curing Cancer",
    "fullname": "Curing Cancer",
    "info": "The objective of this seminar is to develop a basic understanding of the molecular origins of cancer, how it is currently treated, and the exciting efforts to develop new, more effective anti-cancer drugs. We will read and discuss two recent books, The Emperor of all Maladies by Siddhartha Mukherjee and The Immortal Life of Henrietta Lacks. Each class session will involve interactive discussions and a lively exchange of thoughts and ideas.",
    "prereq": {}
  },
  {
    "uid": "816977",
    "code": "BIOL1912",
    "subject": "BIOL",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Photographing the U Community",
    "fullname": "Photographing the University Community",
    "info": "This seminar will provide students and faculty an opportunity to explore the art of photojournalism and/or documentary photography. Students and faculty will take photographs on the University campus or the surrounding neighborhoods and then each person will assemble their photographs into a coherent essay. The seminar will include social themes and will have a strong writing component, as well as the obvious focus on photography.",
    "prereq": {}
  },
  {
    "uid": "816978",
    "code": "BIOL1913",
    "subject": "BIOL",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "Evol-Creationism Controversy",
    "fullname": "Understanding the Evolution-Creationism Controversy",
    "info": "This seminar has two goals: 1) to help you succeed at the University of Minnesota, and 2) to help you develop your own understanding and appreciation of the evolution-creationism controversy. We will discuss the many aspects of the evolution-creationism controversy, including its history, legacy, relevance, and key people. We will also discuss a variety of issues related to the controversy, including those involving court decisions, public opinion, racism, politics, etc. Many people are emotional and opinionated about the evolution-creationism controversy. Although this seminar is not focused on opinions, we will talk about why so many people feel strongly about this issue, and why the controversy persists. You will be interested in, and probably surprised by, what you learn. Each week we will also talk about concerns and/or questions you have about life at the University. Although I can't fix your parking tickets, I can offer advice about what you'll need to do to succeed here. ",
    "prereq": {}
  },
  {
    "uid": "816979",
    "code": "BIOL1914",
    "subject": "BIOL",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "Nature of Research: For You?",
    "fullname": "The Nature of Research: Is It For You?",
    "info": "There will be two parts to this seminar. In the first part, students will meet with researchers from all levels ? from current undergraduates working in labs to faculty members, and we will discuss how and why each ended up in research. In the second part, students will participate in a research project funded by the National Science Foundation. Students will gain hands-on experience and use state-of-the-art techniques to address basic scientific questions concerning cell biology.\n\n",
    "prereq": {}
  },
  {
    "uid": "817127",
    "code": "BIOL1915",
    "subject": "BIOL",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "Genomics in Your Life",
    "fullname": "Genomics in Your Present and Future Life",
    "info": "Our understanding of DNA and genomes has infiltrated every aspect of society including medicine (diagnosis and susceptibilities to disease as well as developing new gene-based therapies, including gene therapy), CSI, ethics, GMOs for sustainable agriculture, and even designing our kids genomes. Class lectures and all reading material will be available online. Students will share their thoughts on a variety of controversial issues both online. In class, we will use the on-line blogs and lecture material as a starting points to discuss further various aspects of different applications of modern precision genetic technologies.  The fundamental goal of the class is to encourage students to develop their processes of thinking about, and discussing in a small group, current complex and controversial issues. No final papers and no final exam.",
    "prereq": {}
  },
  {
    "uid": "817136",
    "code": "BIOL1916",
    "subject": "BIOL",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Visualizing Results",
    "fullname": "Visualizing Results",
    "info": "Much of research is focused on generating and analyzing data. But effectively displaying this data is key to communicating one's results. Effective visualizations can help communicate major results and can be quite convincing. Poor visualizations can confuse and even mislead the audience. This course will consider best practices in the visual presentation of scientific and empowers students to evaluate the presentation of data and to generate effective figures using modern computational software.",
    "prereq": {}
  },
  {
    "uid": "817356",
    "code": "BIOL1917",
    "subject": "BIOL",
    "number": "1917",
    "honors": false,
    "writing": false,
    "name": "Experimental Evolution",
    "fullname": "Experimental Evolution",
    "info": "Life originated over four billion years ago. Since that time, evolution has shaped living systems, generating tremendous biological diversity. Experimental evolution is a dynamic approach to investigating life, examining how and why biological systems change over evolutionary time. We will focus on how experimental evolution is done, what we have already learned, and the bright future for new research. Topics will include adaptive radiation, infectious diseases, the genetic basis of phenotypes, speciation, and the evolution of multicellularity. Readings will be primary literature and review articles, to be discussed every meeting. Toward the end of the semester, students will propose their own experimental evolution study based upon the readings, class discussions, and meetings with faculty.",
    "prereq": {}
  },
  {
    "uid": "817867",
    "code": "BIOL1918",
    "subject": "BIOL",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "Evolutionary Perspectives",
    "fullname": "Evolutionary Perspectives on Agriculture and Human Health",
    "info": "Crops, humans, pests, and pathogens have evolved and continue to evolve, largely by natural selection (nonrandom differences in reproduction and survival among random genetic variants).  Weeds and insect pests readily evolve resistance to our control methods, from crop rotation to chemical pesticides.  Human pathogens evolve resistance to antibiotics.  Can we slow such harmful evolution?  Also, can the evolutionary history of crops help guide plant breeding?  Can our own evolutionary history suggest ways to improve health-care in humans?  In alternate weeks, students will discuss an assigned article or video and then find a related scientific journal article and explain one figure from the article. Grades will depend in part on courteous and insightful questions and comments among students. This course will be offered remotely via Zoom at a scheduled time. Personal interaction in this course is required through audio and video using Zoom. Short presentations by students will use “Share Screen”.",
    "prereq": {}
  },
  {
    "uid": "817868",
    "code": "BIOL1919",
    "subject": "BIOL",
    "number": "1919",
    "honors": false,
    "writing": false,
    "name": "Native Plants and Native Foods",
    "fullname": "Native Plants and Native Foods",
    "info": "This seminar will encourage students to explore plants native to your culture. Are these plants well-known and readily available or are they heritage plants, parts of an endangered tradition? As we examine plant/food use from biological, historical, and cultural perspectives, you will research a plant, analyze multidisciplinary research, and construct a video. Students can also look forward to guest speakers and field trips that will introduce you to broader University plant resources.",
    "prereq": {}
  },
  {
    "uid": "817869",
    "code": "BIOL1920",
    "subject": "BIOL",
    "number": "1920",
    "honors": false,
    "writing": false,
    "name": "Biology at the Movies",
    "fullname": "Biology at the Movies",
    "info": "This freshman seminar is all about biological media (pun intended). Students will examine how biology topics and biologists are portrayed in science fiction and horror movies and TV shows. Students will present examples of their favorite biology-related shows and movies and then the class will work together to determine which ideas are sci-fi and which are sci-fact. You'll learn things that are strange but true and things that seem true but aren't. Near the end of the course, we'll use our new-found knowledge to make predictions about the future of biology research. This freshman seminar will have a clear focus on biology; you don't need to be a biology major, but you can expect to be finding and reading primary biological research papers. Note: some of the movies we'll be watching will be rated R.",
    "prereq": {}
  },
  {
    "uid": "817870",
    "code": "BIOL1921",
    "subject": "BIOL",
    "number": "1921",
    "honors": false,
    "writing": false,
    "name": "How Artists look at Biology",
    "fullname": "How Artists look at Biology",
    "info": "This seminar will explore the many and diverse interactions between art and biology. The topics covered range from the portrayal of biology in classic art, to the use of artistic venues for studying and remediating environmental problems, to the utility of photography, painting, sculpture, and other art forms to explore levels of biology ranging from molecular and cellular structures to landscapes. The course includes hands-on creation of artistic biological objects. Topics will be explored using recorded media and presentations by students, the instructor, and invited speakers to cover novel topics at the art/biology interface. ",
    "prereq": {}
  },
  {
    "uid": "817871",
    "code": "BIOL1922",
    "subject": "BIOL",
    "number": "1922",
    "honors": false,
    "writing": false,
    "name": "Your Microbiome",
    "fullname": "You Contain Multitudes: Living in the Age of the Microbiome",
    "info": "The recent discovery that each of us is home to a unique collection of microbes raises many questions about how this \"microbiome\" affects our health, nutrition, and even mood. Scientific research on the microbiome, fueled by improvements in DNA sequencing technology, has moved beyond classifying who has what microbes and is now beginning to answer questions about how microbes and multi-cellular life co-evolve and co-exist. In this course, we will primarily read and discuss \"I Contain Multitudes\" by Ed Yong and complete short writing assignments that explore differences between styles of science writing. No prior knowledge of (micro)biology is assumed or required--only a desire to change the world though science communication.",
    "prereq": {}
  },
  {
    "uid": "817895",
    "code": "BIOL1923",
    "subject": "BIOL",
    "number": "1923",
    "honors": false,
    "writing": false,
    "name": "Fake! Value of Authenticity",
    "fullname": "Fake! The Value of Authenticity",
    "info": "Fake art, fake diamonds, fake friends, fake news? What is fake and how do we know what is real? Are things that are fake automatically worthless (or worth less)? In this freshman seminar we will explore what fake means in different contexts, from nature to art to society. Through readings, discussions, guest speakers, and activities we will discover aspects of \"fake\" from flowers that pretend to be insects to imitation food, from counterfeit designer clothes to forged money or paintings. What motivates people to create fake objects? And why do we feel cheated when we learn that something is not what it pretends to be?",
    "prereq": {}
  },
  {
    "uid": "817896",
    "code": "BIOL1924",
    "subject": "BIOL",
    "number": "1924",
    "honors": false,
    "writing": false,
    "name": "Imaging Biology",
    "fullname": "Imaging Biology",
    "info": "Advances in microscopy and imaging technology have aided examination of biological processes that were previously invisible to the naked eye. The field has progressed rapidly in the last century and advances in imaging technology have helped us answer some of the most fundamental questions in biology while also helping image at an unprecedented scale, from molecules to entire fields of crops. This course will introduce students to the kinds of microscopy, digital imaging, molecular probes used for imaging, and the future of imaging technology. Come take this journey with visual lectures, discussions, field trips to imaging centers, and guest lectures by experts.",
    "prereq": {}
  },
  {
    "uid": "819149",
    "code": "BIOL1925",
    "subject": "BIOL",
    "number": "1925",
    "honors": false,
    "writing": false,
    "name": "Biology: Scientific Discovery",
    "fullname": "Biological Wonder to Scientific Discovery",
    "info": "?In the field of observation, chance favors only the prepared mind.? Louis PasteurWhen exploring the beauty and wonder of the natural world, scientists must unleash their creative side. For example, if you are a scientist and have a history of experiments that have been conducted, the lessons from those past experiments may help you to succeed in the new experiment. This is especially true if you keep an open mind when you get an unexpected result.The primary literature, small group activities and class discussion will be used in this course to explore how biological wonders have turned into scientific discoveries. Molecular biology will be emphasized, but all biological science topics are open for discussion. ",
    "prereq": {}
  },
  {
    "uid": "819870",
    "code": "BIOL1926",
    "subject": "BIOL",
    "number": "1926",
    "honors": false,
    "writing": false,
    "name": "Nature / Nurture: Joint roles",
    "fullname": "Entanglement of genomic and environmental influences on traits of organisms",
    "info": "Genetic determinism, a view that variation in traits is overwhelmingly due to genetic differences among individuals, has a deep history in biology. Despite many direct, experimental demonstrations of major effects of environmental conditions on many traits, emphasis on genetic effects predominates today, especially in the popular press. Through readings and discussion, we will explore the joint roles of genome and environment as influences on traits, and we will consider implications for fields of biological research and also for society.",
    "prereq": {}
  },
  {
    "uid": "819923",
    "code": "BIOL1927",
    "subject": "BIOL",
    "number": "1927",
    "honors": false,
    "writing": false,
    "name": "The Nobel Prize",
    "fullname": "The Greatest Benefit to Humankind: the Nobel Prize and Where Good Ideas Come From",
    "info": "Through studying the Nobel Prize, the people and the research behind them, we’ll consider where good ideas come from and some of the best ideas that have led to the greatest benefit to humankind. The history of the Nobel Prize is filled with societal changing ideas, but it is also filled with drama and scandal! We’ll consider who has been chosen to receive a Nobel Prize and why, research awarded the Nobel Prize that has later been disproven, and discuss how the Nobel Prize selection might be adapted for the future. Students will examine innovation across a variety of disciplines and consider how solutions to problems facing society require creativity, collaboration, and new ways of thinking through activities designed to improve your creative thinking. Classwork will involve discussion, group work, writing, and an in-class presentation.\n\n",
    "prereq": {}
  },
  {
    "uid": "825117",
    "code": "BIOL1928",
    "subject": "BIOL",
    "number": "1928",
    "honors": false,
    "writing": false,
    "name": "Art & Sci. of Natural History",
    "fullname": "Inventing Nature: The Art and Science of Natural History",
    "info": "Natural history is often presented as a series of dry facts about the world. But how were these facts arrived at, what kind of data are they based on, and who decided they were important? In this seminar, we will learn about the invention of modern natural history. We will collect specimens, practice scientific illustration, and visit real collections. We will explore the exploitative history of  Western naturalists and how modern natural history can be expanded to include alternative knowledge systems. Finally, we will learn how natural history collections provide crucial data on how we have impacted the world, especially via climate change.",
    "prereq": {}
  },
  {
    "uid": "825817",
    "code": "BIOL1929",
    "subject": "BIOL",
    "number": "1929",
    "honors": false,
    "writing": false,
    "name": "Drawn to Nature",
    "fullname": "Drawn to Nature: Observing the World Around Us",
    "info": "Keeping a nature journal is one way to hone your skills of observation, enjoy the natural world around you, and relax. In this seminar we will explore nature through the practice of keeping a nature journal. Lessons will include the history of sketchbooks in exploration, approaches for starting your own journal, what materials to use, and how to get outside and start. There will be little reading, but all students are expected to participate and share their work weekly. Class will include field trips to the College of Biological Science Plant Conservatory and the Landscape Arboretum. No prior experience in art is required. ",
    "prereq": {}
  },
  {
    "uid": "825818",
    "code": "BIOL1930",
    "subject": "BIOL",
    "number": "1930",
    "honors": false,
    "writing": false,
    "name": "Animal Sensory Systems",
    "fullname": "What Can Jellyfish Tell Us about Human Eyes? The Evolution of Animal Sensory Systems",
    "info": "If we tracked our ancestors back 750 million years ago, we’d see an animal who’s offspring would later become humans and jellyfish. This animal would already have most of the same gene families that we do today. Genomic content, embryonic development, cell physiology, and animal behavior are fundamentally similar in all animals, with minor tweaks at the right moment resulting in organisms as different as a worm or a bird. This course will explore how evolution builds a trait, focusing on some of the best studied traits that can be compared across animals: visual systems. We will touch on how the fields of genomics, embryology, neurophysiology, and animal behavior are intertwined at sensory systems, and how they have helped us learn about Biology more broadly. We will explore examples from different animals, especially overlooked invertebrates, and understand how their study can help human health and society. Class will primarily be discussion and low-stakes presentations based on both assigned and student-chosen readings from scientific literature, pop sci. articles, and news sources. ",
    "prereq": {}
  },
  {
    "uid": "826509",
    "code": "BIOL1932W",
    "subject": "BIOL",
    "number": "1932",
    "honors": false,
    "writing": true,
    "name": "Replicators ? Innovators",
    "fullname": "Replicators ? Innovators",
    "info": "Genetic legacy and transformational memetics.In this seminar, we will explore human history using genetic data, and our personal history through knowledge, beliefs, habits, and values we embody. We will read A Brief History of Everyone Who Ever Lived and articles that explore how to change life experience by shaping ones mind to support the realization of dream and vision. In this course, we will give time to personal development activities such as visioning, goal setting, and progress tracking and to new styles of collaboration and organization, and new levels of intentionality on your personal journey. This is a writing-intensive course.",
    "prereq": {}
  },
  {
    "uid": "816400",
    "code": "BIOL1942",
    "subject": "BIOL",
    "number": "1942",
    "honors": false,
    "writing": false,
    "name": "Genetics and Reproduction",
    "fullname": "The History, Science, and Politics of Genetics and Reproduction",
    "info": "In this seminar, students will read, discuss, debate, and generally engage with a myriad of issues surrounding the science of genetics and the application of revolutionary technologies to human reproduction. Students will explore topics and controversies relating to the past, present, and future of human sexual activity and human reproduction, and how reproductive technologies (such as in vitro fertilization) have helped shape our modern society. Through the use of both fiction and non-fiction literature, students will learn the details of current scientific breakthroughs such as \"designer babies.\" This seminar aims to engage students in an exploration of their personal beliefs about the roles of science, the government, and also religious institutions on human reproductive rights.",
    "prereq": {}
  },
  {
    "uid": "817196",
    "code": "BIOL1951",
    "subject": "BIOL",
    "number": "1951",
    "honors": false,
    "writing": false,
    "name": "Foundations of Biology I",
    "fullname": "Foundations of Biology Lecture I for Biological Sciences Majors",
    "info": "Core biological concepts, from biomolecules to ecosystems. Emphasizes evolution, organismal diversity, and genetics within context of problem solving/applications. Students must take both BIOL 1951 and BIOL 1961 to be awarded the Biological Sciences LE.\n\nThis course is required for all CBS majors",
    "prereq": {}
  },
  {
    "uid": "817200",
    "code": "BIOL1961",
    "subject": "BIOL",
    "number": "1961",
    "honors": false,
    "writing": false,
    "name": "Foundations of Biology Lab I",
    "fullname": "Foundations of Biology Lab I for Biological Sciences Majors",
    "info": "Core biological concepts, from biomolecules to ecosystems. Emphasizes evolution, organismal diversity, and genetics within context of problem solving/applications. Students must take both BIOL 1951 and BIOL 1961 to be awarded the Biological Sciences LE. \n\nThis course is required for all CBS majors",
    "prereq": {}
  },
  {
    "uid": "787796",
    "code": "BIOL1981",
    "subject": "BIOL",
    "number": "1981",
    "honors": false,
    "writing": false,
    "name": "Explorations in Biology",
    "fullname": "Intersections of Biology at Lake Itasca",
    "info": "Plant biochemistry, terrestrial ecology, aquatic ecology, ecological genetics, molecular biology. Ten-day course at Lake Itasca Forestry and Biological Station in north central Minnesota. Lab, field work.",
    "prereq": {}
  },
  {
    "uid": "009501",
    "code": "BIOL2001",
    "subject": "BIOL",
    "number": "2001",
    "honors": false,
    "writing": false,
    "name": "Career Planning for Biologists",
    "fullname": "Career Planning for Biologists",
    "info": "Course structured to provide career planning and exploration guidance based on individual's specific goals. Option to focus coursework on identifying career interests, exploring career options in the biological sciences, preparing for job or internship applications, or organizing graduate school application materials. Provides career coaching on topics related to resume writing, interviewing and professional relationship building, and introduces resources to engage in effective career exploration and planning in the biological sciences. ",
    "prereq": {}
  },
  {
    "uid": "800456",
    "code": "BIOL2002",
    "subject": "BIOL",
    "number": "2002",
    "honors": false,
    "writing": false,
    "name": "Foundations of Biology I",
    "fullname": "Foundations of Biology for Biological Sciences Majors, Part I",
    "info": "Core biological concepts, from biomolecules to ecosystems. Emphasizes evolution, organismal diversity, and genetics within context of problem solving/applications.\n\nprereq: [[CHEM 1021 or 1061 or equiv], CBS major] or dept consent; calculus I or equiv recommended",
    "prereq": {
      "or": [
        "002384",
        "807753"
      ]
    }
  },
  {
    "uid": "800457",
    "code": "BIOL2003",
    "subject": "BIOL",
    "number": "2003",
    "honors": false,
    "writing": false,
    "name": "Foundations of Biology II",
    "fullname": "Foundations of Biology for Biological Sciences Majors, Part II",
    "info": "Second of two courses. Biological concepts, from biomolecules to ecosystems. Ecology/biochemistry concepts within problem solving/application.",
    "prereq": {}
  },
  {
    "uid": "013389",
    "code": "BIOL2005",
    "subject": "BIOL",
    "number": "2005",
    "honors": false,
    "writing": false,
    "name": "Animal Diversity Lab",
    "fullname": "Animal Diversity Laboratory",
    "info": "Dissection, direct observation of representatives of major animal groups.",
    "prereq": {}
  },
  {
    "uid": "810259",
    "code": "BIOL2007",
    "subject": "BIOL",
    "number": "2007",
    "honors": false,
    "writing": false,
    "name": "Marine Animals Laboratory",
    "fullname": "Marine Animal Diversity Laboratory",
    "info": "Survey of marine animal diversity. Understanding major animal groups, how they relate to one another, how they differ in structure, how each group achieves survival/ reproduction in diverse environments. Lab includes dissections, including vertebrates, such as fish.\n\nPrereq/coreq: Biol 2005/Biol 2012/Biol 3012",
    "prereq": {}
  },
  {
    "uid": "012868",
    "code": "BIOL2012",
    "subject": "BIOL",
    "number": "2012",
    "honors": false,
    "writing": false,
    "name": "General Zoology",
    "fullname": "General Zoology",
    "info": "Major animal groups (phyla). Applications of morphological, physiological, and developmental characteristics to define evolutionary relationships. Parasitic forms affecting human welfare. Lab requires dissection, including mammals.\n\nprereq: One semester of college biology",
    "prereq": {}
  },
  {
    "uid": "790463",
    "code": "BIOL2032",
    "subject": "BIOL",
    "number": "2032",
    "honors": false,
    "writing": false,
    "name": "General Microbiology w/Lab",
    "fullname": "General Microbiology With Laboratory",
    "info": "Principles of microbiology. Bacterial metabolism, growth, genetics. Biology of viruses/fungi. Control of microorganisms. Host-microbe interactions. Microorganisms/disease. Applied microbiology. Lab.",
    "prereq": {}
  },
  {
    "uid": "804116",
    "code": "BIOL2101",
    "subject": "BIOL",
    "number": "2101",
    "honors": false,
    "writing": false,
    "name": "Brewing: Biol, Hist, Practice",
    "fullname": "Brewing: The Biology, History, and Practice",
    "info": "Rigorous look at the history of brewing, microbiology, biochemistry, and biological concepts associated with brewing, such as competition, and practical aspects of modern brewing. This lecture/laboratory hybrid course will teach students the components used in brewing and how they contribute to the final product as well as the process of brewing using hands on laboratory.\n\nTextbook is online and will be posted on the Canvas site.\n\nprereq: BIOL 1001 or 1009 or 1951 or 2002 or 2003 or 2004\n\nStudents must be 21 by the first day of class to register, we will check IDs on the first day of class. There are three required field trips. For the field trips students meet in McNeal Hall at 1:00pm and return approximately at 5pm to McNeal Hall.",
    "prereq": {
      "or": [
        "005419",
        "005416",
        "817196",
        "800456",
        "800457"
      ]
    }
  },
  {
    "uid": "005421",
    "code": "BIOL2201",
    "subject": "BIOL",
    "number": "2201",
    "honors": false,
    "writing": false,
    "name": "Intro Computing in Biology",
    "fullname": "Introduction to Computing in Biology",
    "info": "Hands-on use of microcomputers to show how computers manipulate data, prepare graphs/graphics, acquire/analyze scientific data, perform literature searches, prepare scientific presentations, communicate via network.",
    "prereq": {}
  },
  {
    "uid": "802957",
    "code": "BIOL2301",
    "subject": "BIOL",
    "number": "2301",
    "honors": false,
    "writing": false,
    "name": "Critical Service Learning",
    "fullname": "Dean's Scholar: Critical Service Learning",
    "info": "Importance of service in leadership. How personal experiences influence perspectives on social issues. Techniques for group work. Service project with community organization related to biological sciences.\n\nprereq: 1301, CBS Dean's Scholar",
    "prereq": {
      "and": [
        "801118"
      ]
    }
  },
  {
    "uid": "808501",
    "code": "BIOL2700",
    "subject": "BIOL",
    "number": "2700",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Biology",
    "fullname": "Special Topics in Biology",
    "info": "Faculty members lead students in discussion of topics of interest.",
    "prereq": {}
  },
  {
    "uid": "811161",
    "code": "BIOL2800",
    "subject": "BIOL",
    "number": "2800",
    "honors": false,
    "writing": false,
    "name": "Ecology for Educators",
    "fullname": "Understanding the Environment: Ecology for Educators",
    "info": "Ecology/earth systems science content, concepts, and investigation skills that environmental educators, science communicators, and natural history interpreters should be proficient in when addressing respective audiences about science, environmental issues, and nature studies.",
    "prereq": {}
  },
  {
    "uid": "797262",
    "code": "BIOL2812",
    "subject": "BIOL",
    "number": "2812",
    "honors": false,
    "writing": false,
    "name": "Field Zoology",
    "fullname": "Field Zoology",
    "info": "Major animal groups. Native Minnesota organisms in their natural habitat. Lecture, lab, and field experiences emphasize morphological, physiological, and developmental characteristics to define evolutionary relationships. Parasitic forms affecting human welfare. Labs require dissections, including mammals.",
    "prereq": {}
  },
  {
    "uid": "787797",
    "code": "BIOL2822",
    "subject": "BIOL",
    "number": "2822",
    "honors": false,
    "writing": false,
    "name": "Evolution",
    "fullname": "Evolution",
    "info": "Diversity of forms in fossil record and in presently existing biology. Genetic mechanisms of evolution. Examples of ongoing evolution in wild/domesticated populations and in disease-causing organisms. Lab.",
    "prereq": {}
  },
  {
    "uid": "811317",
    "code": "BIOL2905",
    "subject": "BIOL",
    "number": "2905",
    "honors": false,
    "writing": false,
    "name": "Nature of Life, Part III",
    "fullname": "Nature of Life, Part III",
    "info": "Reflect on aspirations, personal characteristics, experiences. Resources/practical tools to reach educational/professional goals. Special focus on developing personal/professional goals, articulating personal experiences in light of aspirations.\n\nprereq: 1805, 1806",
    "prereq": {
      "and": [
        "793065",
        "808856"
      ]
    }
  },
  {
    "uid": "811318",
    "code": "BIOL2906",
    "subject": "BIOL",
    "number": "2906",
    "honors": false,
    "writing": false,
    "name": "Nature of Life, Part IV",
    "fullname": "Nature of Life, Part IV",
    "info": "Reflect on aspirations, personal characteristics, experiences. Resources/practical tools to reach educational/professional goals. Special focus on developing personal/professional goals, articulating personal experiences in light of aspirations.\n\nprereq: 2905",
    "prereq": {
      "and": [
        "811317"
      ]
    }
  },
  {
    "uid": "825256",
    "code": "BIOL2996",
    "subject": "BIOL",
    "number": "2996",
    "honors": false,
    "writing": false,
    "name": "Directed Intro to Research",
    "fullname": "Directed Introduction to Research",
    "info": "Directed Introduction to Research is an introduction to laboratory or field biological research for students with no prior experience, normally first- and second-year students. The University directed studies contract will be used to describe the training experience which could include attending lab meetings, reading and discussing research papers from the lab, learning basic lab and field techniques, assays, and approaches used by the research group, and learning to keep a lab or field notebook. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course and how the assessment of learning will be conducted. Lab or field training can be led by graduate students or postdocs in the research group but one-on-one meetings with the PI should be included. The course is one credit and the student and PI agree that 45 hours of work will be done. There will be one group meeting per semester per major for all of the students enrolled in 2996 to discuss the research experience with the Director of Undergraduate Research for the major and a panel of more experienced undergraduate researchers. The goal of that meeting is community building and to introduce students to opportunities for further research experience. The grading option is S/N, similar to all directed studies/research courses in CBS. This course can be repeated, if it is done with a different mentor, for a total of two credits. One credit of this course can be counted as a degree requirement for each CBS major.",
    "prereq": {}
  },
  {
    "uid": "809758",
    "code": "BIOL3001",
    "subject": "BIOL",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Nature of Science and Research",
    "fullname": "Nature of Science and Research",
    "info": "Explore how to read/use research papers. Role of research ethics. Financial, legal, regulatory oversight on research/other topics. **This course is for new CBS transfer students from other institutions.\n\nprereq: College-level biology",
    "prereq": {}
  },
  {
    "uid": "802140",
    "code": "BIOL3004",
    "subject": "BIOL",
    "number": "3004",
    "honors": false,
    "writing": false,
    "name": "Foundations of Biology II Lab",
    "fullname": "Foundations of Biology for Biological Sciences Majors, Part II Laboratory",
    "info": "This course follows BIOL 1961 and is required for all CBS majors. Students design and perform research projects that will require an additional 4-to-6 hours per week of work outside of class; times to be arranged. Each section is devoted to a single research area; check the section details to see which sections correspond to each research area. Research projects in zebrafish environmental toxicology and zebrafish microbiome sections will require in-person work in the BIOL 3004 laboratory. Only students with previous command line coding experience should enroll for a computational microbiology section. All projects involve applying quantitative skills, scientific method, and modern biological tools to real-world questions. \n\nprereq: Foundations of Biology Lab I: BIOL 1961, 1961H, 2002, or 2002H AND CHEM 1021, 1061, 1071H, or 1081. \nCredit will not be granted if credit has been received for: BIOL 3004H.",
    "prereq": {
      "or": [
        "817200",
        "800456",
        "002384",
        "807753",
        "815252"
      ]
    }
  },
  {
    "uid": "825762",
    "code": "BIOL3012",
    "subject": "BIOL",
    "number": "3012",
    "honors": false,
    "writing": false,
    "name": "Animal Diversity and Evolution",
    "fullname": "Animal Diversity and Evolution",
    "info": "This course is a survey of animal diversity, with an emphasis on understanding the major animal groups, how they are related to one another, how they differ in structure, and how each group achieves survival and reproduction in the diverse environments of the Earth. We will place particular emphasis on major evolutionary transitions that animals have made through their history, including the origins of multicellularity, the achievement of motion, invasion of terrestrial habitats, and the achievement of flight. We will also emphasize the science behind our contemporary understanding of animals, from multiple perspectives – behavioral, evolutionary, physiological, and ecological.  Lab requires dissection, including mammals.\n\nprereq: BIOL 1001/1001H, or BIOL 1009/1009H, or BIOL 1951/1951H",
    "prereq": {
      "or": [
        "005419",
        "005416",
        "817196"
      ]
    }
  },
  {
    "uid": "819674",
    "code": "BIOL3015",
    "subject": "BIOL",
    "number": "3015",
    "honors": false,
    "writing": false,
    "name": "Molecular Biology",
    "fullname": "Molecular Biology",
    "info": "All areas of biology have been transformed by the recent advances in molecular biology technology. Every life scientist, whether they study viruses or crashes of elephants, uses DNA cloning, sequencing, and genomic analysis. This technology has also impacted all aspects of health care by generating highly specific diagnostic tools and personalized treatments. \n\nThe purpose of this course is to give students a solid foundation in the principles and tools of molecular biology. Biol 3015 will introduce concepts and techniques for understanding gene expression and the flow of genetic information. We will discuss the structure of nucleic acids and proteins, the replication and repair of DNA, transcription and its regulation, and translation. Students will also learn about current technologies used in molecular biology including cloning, PCR, DNA sequencing, mass spectrometry, DNA microarrays, proteomics, bioinformatics, and whole genome analysis. \n\nCredit will not be granted if credit has been received for: BIOL 3025",
    "prereq": {}
  },
  {
    "uid": "814490",
    "code": "BIOL3025",
    "subject": "BIOL",
    "number": "3025",
    "honors": false,
    "writing": false,
    "name": "Molecular Biology and Society",
    "fullname": "Molecular Biology and Society",
    "info": "An in-depth analysis of molecular biology topics and methods related to the Central Dogma of modern biology. This course is open to both CBS majors and non-CBS majors. Prerequisites include Biol2003/2003H or [Biol1009/1009H AND Chem1061/1061H].",
    "prereq": {}
  },
  {
    "uid": "825331",
    "code": "BIOL3051",
    "subject": "BIOL",
    "number": "3051",
    "honors": false,
    "writing": false,
    "name": "Genome Editing and Engineering",
    "fullname": "Genome Editing and Engineering",
    "info": "Allowing researchers to modify genetic information in nearly any organism’s genome, genome editing, and engineering technologies have been widely used in all areas of biology. These technologies have evolved rapidly in recent years and not only hold the promise to revolutionize medical and agricultural fields, but also make profound impacts on our society. The purpose of the course is to give students a comprehensive overview of principles, development and applications of genetic engineering and genome editing technologies in both prokaryotes and eukaryotes. \n\nThis course will introduce concepts and history of genome engineering in both prokaryotes and eukaryotes. We will discuss the mechanisms and applications of both techniques using examples in bacteria and plant genome and metabolic pathway engineering. Students will also have hands-on experience to design CRISPR and modify bacterial and plant genomes.\n\nIn addition, this course will contribute to students’ liberal education by discussing the consequences of these technologies for society and technological development, including the ethics of altering genomes, consequences on ecosystems, and the benefits, drawbacks, and limitations of these technologies. \n\nRecommended prerequisites: Introductory biology such as Biol 1951 and 2003, Biol 1009 or BMEN 2501",
    "prereq": {
      "or": [
        "817196",
        "800457",
        "005416",
        "789294"
      ]
    }
  },
  {
    "uid": "010996",
    "code": "BIOL3101",
    "subject": "BIOL",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Introduction to Neuroscience I",
    "fullname": "Introduction to Neuroscience I: From Molecules to Madness",
    "info": "Basic principles of cellular/molecular neurobiology and nervous systems.",
    "prereq": {}
  },
  {
    "uid": "011181",
    "code": "BIOL3102W",
    "subject": "BIOL",
    "number": "3102",
    "honors": false,
    "writing": true,
    "name": "Intro: Neuroscience II",
    "fullname": "Introduction to Neuroscience II: Biological Basis of Behavior",
    "info": "Organization of neural systems/subsystems underlying sensory/motor aspects of behavior. Writing intensive.",
    "prereq": {}
  },
  {
    "uid": "804946",
    "code": "BIOL3209",
    "subject": "BIOL",
    "number": "3209",
    "honors": false,
    "writing": false,
    "name": "Evol-Creationism Controversy",
    "fullname": "Understanding the Evolution-Creationism Controversy",
    "info": "Aspects of evolution-creationism controversy, including its history, legacy, relevance, and key people. Court decisions, public opinion, and related issues (e.g., racism, politics).\n\nprereq: BIOL 1001, 1009, 1951 or 2002, or equiv",
    "prereq": {
      "or": [
        "005419",
        "005416",
        "817196",
        "800456"
      ]
    }
  },
  {
    "uid": "013077",
    "code": "BIOL3211",
    "subject": "BIOL",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "Physiology of Humans & Animals",
    "fullname": "Physiology of Humans and Other Animals",
    "info": "Study of the various solutions to common physiological problems faced by humans, other vertebrates, and invertebrates. Core concepts in physiology including flow down gradients, homeostatsis, cell-cell communication, interdependence of body systems, cell membrane dynamics, and mathematical modeling of physiological processes. Active learning format.\n\nprereq: [1009 or 2003], [CHEM 1062/1066 or 1082/1086], [2005 is recommended]",
    "prereq": {
      "and": [
        {
          "or": [
            "005416",
            "800457"
          ]
        },
        {
          "or": [
            "807756",
            "807754",
            "815284",
            "815283"
          ]
        },
        {
          "and": [
            "013389"
          ]
        }
      ]
    }
  },
  {
    "uid": "809835",
    "code": "BIOL3270",
    "subject": "BIOL",
    "number": "3270",
    "honors": false,
    "writing": false,
    "name": "Intro to Systems Biology",
    "fullname": "Introduction To Systems Biology",
    "info": "Emergent properties of metabolic networks; Computational modeling of metabolism; Parameter estimation from high-throughput measurements; Prediction of metabolic phenotypes for knockout mutants; Flux balance analysis; Metabolic control analysis.\n\nprereq: Recommended prereq MATH1241, BIOC3021",
    "prereq": {
      "and": [
        "808276",
        "014290"
      ]
    }
  },
  {
    "uid": "806661",
    "code": "BIOL3272",
    "subject": "BIOL",
    "number": "3272",
    "honors": false,
    "writing": false,
    "name": "Applied Biostatistics",
    "fullname": "Applied Biostatistics",
    "info": "Conceptual basis of statistical analysis. Statistical analysis of biological data. Data visualization, descriptive statistics, significance tests, experimental design, linear model, simple/multiple regression, general linear model. Lectures, computer lab.\n\nprereq: High school algebra; BIOL 2003 recommended",
    "prereq": {
      "and": [
        "800457"
      ]
    }
  },
  {
    "uid": "803715",
    "code": "BIOL3302",
    "subject": "BIOL",
    "number": "3302",
    "honors": false,
    "writing": false,
    "name": "Leadership Capstone Experience",
    "fullname": "Dean's Scholar: Leadership Capstone Experience",
    "info": "In BIOL 3302, students will actively refine their perspectives about leadership, through examining their past experiences, their previous and future growth as a leader, and their personal effectiveness across situations and contexts. They will explore emotional and social awareness, vulnerability, feedback, perspective taking, critical thinking, empathy, and effective communication through conversation, written narratives, and creative expression.\nprereq: 1301, 2301, CBS dean's scholar",
    "prereq": {
      "and": [
        "801118",
        "802957"
      ]
    }
  },
  {
    "uid": "803716",
    "code": "BIOL3303",
    "subject": "BIOL",
    "number": "3303",
    "honors": false,
    "writing": false,
    "name": "Peer Leadership Development",
    "fullname": "Peer Leadership Development",
    "info": "This course is designed to teach you theoretical frameworks, principles, and practices of effective peer leadership. As a student leader in CBS, you are in a peer leadership role that requires you to serve as a support, resource, connection, and bridge between your peers and their campus experience in the College of Biological Sciences. This course will complement basic job training and provide you with in-depth academic frameworks about the theory behind peer leadership, how it impacts the college student experience, why it works, and tools and practices that distinguish role modeling from exceptional peer leadership. This course will teach you the skills and techniques of being an effective peer leader, as well as how to support undergraduate students in their own transitions. Through college student development theory, peer leadership frameworks, reflective activities, group activities, and class discussion, we will explore how your personal experiences influence your understanding, practices, and effectiveness of peer leadership. The course also offers a learning laboratory for you to reflect and synthesize various aspects of your student leadership experience with a community of fellow leaders.",
    "prereq": {}
  },
  {
    "uid": "809306",
    "code": "BIOL3310",
    "subject": "BIOL",
    "number": "3310",
    "honors": false,
    "writing": false,
    "name": "Research Seminars in Biology",
    "fullname": "Research Seminars in Biology",
    "info": "Research seminars in Genetics, Microbiology, Plant Biology, Ecology, Biomedical Engineering, Biochemistry, Neuroscience.  Identify, prepare for, evaluate, discuss research seminars.\n\nprereq: One semester of college level general biology",
    "prereq": {}
  },
  {
    "uid": "818970",
    "code": "BIOL3311",
    "subject": "BIOL",
    "number": "3311",
    "honors": false,
    "writing": false,
    "name": "Leadership in Science",
    "fullname": "Leadership in Science",
    "info": "Seminar and discussion on the topic of leadership in science.",
    "prereq": {}
  },
  {
    "uid": "012848",
    "code": "BIOL3407",
    "subject": "BIOL",
    "number": "3407",
    "honors": false,
    "writing": false,
    "name": "Ecology",
    "fullname": "Ecology",
    "info": "Principles of population growth/interactions and ecosystem function applied to ecological issues. Regulation of human populations,  dynamics/impacts of disease, invasions by exotic organisms, habitat fragmentation, biodiversity. Lab.",
    "prereq": {}
  },
  {
    "uid": "799776",
    "code": "BIOL3408W",
    "subject": "BIOL",
    "number": "3408",
    "honors": false,
    "writing": true,
    "name": "Ecology",
    "fullname": "Ecology",
    "info": "Principles of population growth/interactions and ecosystem function applied to ecological issues. Regulation of human populations, dynamics/impacts of disease, invasions by exotic organisms, habitat fragmentation, biodiversity. Lab.",
    "prereq": {}
  },
  {
    "uid": "012681",
    "code": "BIOL3409",
    "subject": "BIOL",
    "number": "3409",
    "honors": false,
    "writing": false,
    "name": "Evolution",
    "fullname": "Evolution",
    "info": "Diversity of forms in fossil record and in presently existing biology. Genetic mechanisms of evolution. Examples of ongoing evolution in wild/domesticated populations and in disease-causing organisms. Lab.\n\nprereq: One semester college biology",
    "prereq": {}
  },
  {
    "uid": "014289",
    "code": "BIOL3411",
    "subject": "BIOL",
    "number": "3411",
    "honors": false,
    "writing": false,
    "name": "Intro Animal Behavior",
    "fullname": "Introduction to Animal Behavior",
    "info": "Biological study of animal behavior. Mechanism development, function, and evolution. Emphasizes evolution of adaptive behavior, social behavior in the natural environment. Lab.",
    "prereq": {}
  },
  {
    "uid": "810257",
    "code": "BIOL3411W",
    "subject": "BIOL",
    "number": "3411",
    "honors": false,
    "writing": true,
    "name": "Intro to Animal Behavior",
    "fullname": "Introduction to Animal Behavior",
    "info": "Writing intensive course. Introduction to animal behavior. Feeding behavior, reproductive behavior, perception, learning, animal conflict, social behavior, parental care, communication. Scientific process. Formulate research questions.\n\nprereq: Undergrad biology course",
    "prereq": {}
  },
  {
    "uid": "010642",
    "code": "BIOL3413",
    "subject": "BIOL",
    "number": "3413",
    "honors": false,
    "writing": false,
    "name": "Biological Rhythms",
    "fullname": "Biological Rhythms and Timing Mechanisms",
    "info": "Timing mechanisms and rhythms of organisms in physiological processes, ecological adaptation, and health. Current hypotheses concerning their cellular/molecular nature.  Individual projects.",
    "prereq": {}
  },
  {
    "uid": "016768",
    "code": "BIOL3501",
    "subject": "BIOL",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Biology of Cancer",
    "fullname": "Biology of Cancer",
    "info": "Biological aspects of etiology, phylogeny, and cellular processes involved in neoplasia. Growth/differentiation of normal/cancer cells. History of cancer research.",
    "prereq": {}
  },
  {
    "uid": "790564",
    "code": "BIOL3503",
    "subject": "BIOL",
    "number": "3503",
    "honors": false,
    "writing": false,
    "name": "Biology of Aging",
    "fullname": "Biology of Aging",
    "info": "Age-related changes in individuals/populations. Evolution of senescence. Genes that influence aging. Interventions. Prospects for an aging human society.\n\nprereq: 1002 or 1009 or 2003 or equiv",
    "prereq": {
      "or": [
        "005420",
        "005416",
        "800457"
      ]
    }
  },
  {
    "uid": "009496",
    "code": "BIOL3600",
    "subject": "BIOL",
    "number": "3600",
    "honors": false,
    "writing": false,
    "name": "Directed Instruction",
    "fullname": "Directed Instruction",
    "info": "Students assist with biology colloquium.\n\nprereq: 1020, upper div, application, instr consent; up to 4 cr may apply to major",
    "prereq": {}
  },
  {
    "uid": "016826",
    "code": "BIOL3696",
    "subject": "BIOL",
    "number": "3696",
    "honors": false,
    "writing": false,
    "name": "Internship: Bio Sciences",
    "fullname": "Biological Sciences Internship Seminar",
    "info": "This course helps students reflect on an internship or job in settings including industry, nonprofits, healthcare, or a government agency. Through assignments, students integrate what they learn in their internship with their career development and long-term career goals. \n\nCBS international students register for this course for CPT. \n\nNote: Students completing their internship or job during the summer semester will register for Section 1 of the fall semester course. Students completing their internship or job during the fall semester will register for Section 2 of the fall semester course.\n\nprereq: Approved internship, instructor consent",
    "prereq": {}
  },
  {
    "uid": "009514",
    "code": "BIOL3700",
    "subject": "BIOL",
    "number": "3700",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Biology",
    "fullname": "Special Topics in Biology",
    "info": "Faculty members lead students in discussions on topics of interest.",
    "prereq": {}
  },
  {
    "uid": "015098",
    "code": "BIOL3722",
    "subject": "BIOL",
    "number": "3722",
    "honors": false,
    "writing": false,
    "name": "Marine Biol Euro Coastal Water",
    "fullname": "Marine Biology of European Coastal Waters",
    "info": "Marine biology using Baltic and North Seas as focus for study. Biology of coastal waters, interactions between organisms and their environment, methods used by marine researchers to investigate biological systems. Conduct simple experiments during field trips. Given in Copenhagen area, with study tour in northern and western Denmark.",
    "prereq": {}
  },
  {
    "uid": "015099",
    "code": "BIOL3724",
    "subject": "BIOL",
    "number": "3724",
    "honors": false,
    "writing": false,
    "name": "Biol Oceanography",
    "fullname": "Biological Oceanography",
    "info": "Interaction among biology, physics, and chemistry in the ocean, with special reference to unique characteristics of North and Baltic Seas. Effects of light, temperature, salinity, density, pressure, and limiting chemical constituents on marine biological systems. Problems in fisheries management. Given in Denmark.",
    "prereq": {}
  },
  {
    "uid": "015106",
    "code": "BIOL3726",
    "subject": "BIOL",
    "number": "3726",
    "honors": false,
    "writing": false,
    "name": "Marine Biol Sci Project",
    "fullname": "Marine Biological Science Project",
    "info": "Research project with practical field components. Use scientific libraries of various research institutions, engage in discussions and seminars with leading Danish and German scientists, and conduct experiments on research ship at Marine Biological Laboratory. Given in Denmark.",
    "prereq": {}
  },
  {
    "uid": "015107",
    "code": "BIOL3728",
    "subject": "BIOL",
    "number": "3728",
    "honors": false,
    "writing": false,
    "name": "Ecol North/Baltic Seas",
    "fullname": "Ecology and Human Impact in the North and Baltic Seas",
    "info": "Ecosystems of North and Baltic Seas and how natural and human activities threaten their integrity. Given in Copenhagen area, with study tour in northern and western Denmark.",
    "prereq": {}
  },
  {
    "uid": "015108",
    "code": "BIOL3732",
    "subject": "BIOL",
    "number": "3732",
    "honors": false,
    "writing": false,
    "name": "Marine Vert Biology",
    "fullname": "Marine Vertebrate Biology",
    "info": "Ecology and physiology of marine fish, birds, and mammals. Factors controlling vertebrate distribution and abundance. Role of vertebrates in marine ecosystems. Ecological impact of habitat alteration, pollution, fishing, and hunting, with emphasis on North and Baltic Seas. Given in Denmark.",
    "prereq": {}
  },
  {
    "uid": "015109",
    "code": "BIOL3734",
    "subject": "BIOL",
    "number": "3734",
    "honors": false,
    "writing": false,
    "name": "Arctic Biol",
    "fullname": "Arctic Biology",
    "info": "Field and classroom study of Arctic environment of Iceland. Geology; terrestrial biology, freshwater and marine biology/ecology; humans in the Arctic. Themes include life under extreme conditions, Arctic vs. temperate and tropical waters, effects of biodiversity on evolution. Given in Iceland.",
    "prereq": {}
  },
  {
    "uid": "826393",
    "code": "BIOL3800",
    "subject": "BIOL",
    "number": "3800",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Biology",
    "fullname": "Special Topics in Biology at Itasca",
    "info": "Faculty members lead students in discussions on topics of interest, held at the Itasca Biological Station and Laboratories.",
    "prereq": {}
  },
  {
    "uid": "811030",
    "code": "BIOL3809",
    "subject": "BIOL",
    "number": "3809",
    "honors": false,
    "writing": false,
    "name": "Evolution at Itasca",
    "fullname": "Evolution in Lab and Field",
    "info": "Foundations of evolutionary biology. Experimental evolution with model organism in lab. Context-dependent evolutionary stable strategies in field. Pose own evolution-related hypothesis, based on natural phenomena at Itasca State Park field setting. Observational or experimental test of hypothesis.\n\nprereq: Introductory Biology with laboratory, college-level math",
    "prereq": {}
  },
  {
    "uid": "799104",
    "code": "BIOL3820",
    "subject": "BIOL",
    "number": "3820",
    "honors": false,
    "writing": false,
    "name": "Aquatic Toxicology",
    "fullname": "Aquatic Toxicology",
    "info": "Principles of Aquatic Toxicology. Environmental, industrial, and natural chemicals. Fate/interactions of chemicals with organisms and the aquatic environment. Insectisides, endocrine distuptors, biomarkers/bioassays, molecular sensors, risk assessment.",
    "prereq": {}
  },
  {
    "uid": "799931",
    "code": "BIOL3825",
    "subject": "BIOL",
    "number": "3825",
    "honors": false,
    "writing": false,
    "name": "Ecological Genetics",
    "fullname": "Ecological Genetics",
    "info": "Using molecular techniques to study genetic variation and population structure in nature. How to isolate DNA from tissue samples, run gels, amplify DNA using polymerase chain reaction (PCR), and analyze DNA sequence variation. Conceptual basis for interpreting genetic polymorphism and sequence variation. Organisms to be studied include Colias butterflies, Daphnia in Lake Itasca, and possibly others chosen by students.",
    "prereq": {}
  },
  {
    "uid": "818491",
    "code": "BIOL3905",
    "subject": "BIOL",
    "number": "3905",
    "honors": false,
    "writing": false,
    "name": "Swedish Innovation",
    "fullname": "Beyond the Nobel Prize: Examining the Evolution of Swedish Innovation",
    "info": "This course is open to undergraduates from all disciplines and will appeal to students with a broad interest creativity and innovation.Students will examine innovation across a variety of disciplines and consider how solutions to problems facing society require creativity, collaboration, and new ways of thinking. In particular, we will explore personal creativity, as well as how environments can foster innovation, particularly in the Swedish context by traveling to Stockholm over spring break. We examine the reasons behind Sweden’s ranking (#2 in 2017) on the Global Innovation Index, as well as the Nobel Prize, international awards bestowed by Swedish institutions that recognize significant academic, cultural and scientific advances. In addition, as a learning abroad seminar, students will learn about their own level of and strategies to increase their intercultural competence, and engage in a practical experience of navigating another culture in an intentional and reflective way.",
    "prereq": {}
  },
  {
    "uid": "009489",
    "code": "BIOL4003",
    "subject": "BIOL",
    "number": "4003",
    "honors": false,
    "writing": false,
    "name": "Genetics",
    "fullname": "Genetics",
    "info": "Genetic information, its transmission from parents to offspring, its expression in cells/organisms, and its course in populations. \n\nprereq: Biol 2003/2003H or BioC 3021 or BioC 4331 or grad",
    "prereq": {
      "or": [
        "800457",
        "014290",
        "002945"
      ]
    }
  },
  {
    "uid": "010881",
    "code": "BIOL4004",
    "subject": "BIOL",
    "number": "4004",
    "honors": false,
    "writing": false,
    "name": "Cell Biology",
    "fullname": "Cell Biology",
    "info": "Processes fundamental to cells. Emphasizes eukaryotic cells.  Assembly/function of membranes/organelles. Cell division, cell form/movement, intercellular communication, transport, secretion pathways. Cancer cells, differentiated cells. \n\nprereq: Completion of Biol 4003 is preferred, Biol2003/2003H or Biol4003 or grad",
    "prereq": {
      "or": [
        "009489",
        "800457"
      ]
    }
  },
  {
    "uid": "805463",
    "code": "BIOL4035",
    "subject": "BIOL",
    "number": "4035",
    "honors": false,
    "writing": false,
    "name": "Metagenomics Laboratory",
    "fullname": "Metagenomics Laboratory",
    "info": "Impact of human activities on the Mississippi River through metagenomics; a new science used to determine the diversity/function of all the microbes in an environmental sample. Student data adds to a database about the microbial communities in the river/how this impacts issues of water quality.",
    "prereq": {}
  },
  {
    "uid": "010997",
    "code": "BIOL4105",
    "subject": "BIOL",
    "number": "4105",
    "honors": false,
    "writing": false,
    "name": "Neurobiology Lab I",
    "fullname": "Neurobiology Laboratory I",
    "info": "Principles, methods, and laboratory exercises for investigating neural mechanisms and examining experimental evidence.",
    "prereq": {}
  },
  {
    "uid": "014986",
    "code": "BIOL4115",
    "subject": "BIOL",
    "number": "4115",
    "honors": false,
    "writing": false,
    "name": "Neurobiology Lab II",
    "fullname": "Neurobiology Laboratory II",
    "info": "Principles, methods and lab exercises for investigating neural mechanisms and examining experimental evidence.",
    "prereq": {}
  },
  {
    "uid": "009492",
    "code": "BIOL4125",
    "subject": "BIOL",
    "number": "4125",
    "honors": false,
    "writing": false,
    "name": "Recombinant DNA Laboratory",
    "fullname": "Recombinant DNA Laboratory",
    "info": "Basic recombinant DNA techniques: methods for growing, isolating, and purifying recombinant DNAs and cloning vectors, DNA sequencing and sequence analysis, gene expression, Polymerase Chain Reaction (PCR), Southern and Western blotting, and other current techniques.",
    "prereq": {}
  },
  {
    "uid": "798453",
    "code": "BIOL4151",
    "subject": "BIOL",
    "number": "4151",
    "honors": false,
    "writing": false,
    "name": "Res Topics Neurosci",
    "fullname": "Research Topics in Neuroscience",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "013620",
    "code": "BIOL4185",
    "subject": "BIOL",
    "number": "4185",
    "honors": false,
    "writing": false,
    "name": "Recombinant DNA Laboratory",
    "fullname": "Recombinant DNA Laboratory",
    "info": "Basic recombinant DNA techniques. Methods for growing, isolating, and purifying recombinant DNAs and for cloning vectors.",
    "prereq": {}
  },
  {
    "uid": "801166",
    "code": "BIOL4201",
    "subject": "BIOL",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Laboratory Teaching",
    "fullname": "Teaching in the Biology Laboratory",
    "info": "Pedagogical underpinnings for teaching in lab.\n\nprereq: Student who is teaching in CBS lab course",
    "prereq": {}
  },
  {
    "uid": "813235",
    "code": "BIOL4321W",
    "subject": "BIOL",
    "number": "4321",
    "honors": false,
    "writing": true,
    "name": "Deconstructing Biology Rsearch",
    "fullname": "Deconstructing Research: Writing about Biological Research for Non-scientists",
    "info": "Deconstructing Biology Research is designed to help majors in the College of Biological Sciences improve their skills in selecting primary research papers, understanding the experimental approaches taken by the authors of those papers, and evaluating the results and conclusions. Students will then share that knowledge by writing effective deconstructions that explain the research approaches and results for different audiences, including the public at large.",
    "prereq": {}
  },
  {
    "uid": "009493",
    "code": "BIOL4501",
    "subject": "BIOL",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Social Uses of Biol",
    "fullname": "Social Uses of Biology",
    "info": "Influence of biological science on the quality of human life: agriculture, medicine, occupational health, environmental science, and theories of human nature. Responsibilities and roles of biologists in policy formulation in the scientific and political world.",
    "prereq": {}
  },
  {
    "uid": "810260",
    "code": "BIOL4590",
    "subject": "BIOL",
    "number": "4590",
    "honors": false,
    "writing": false,
    "name": "Coral Reef Ecology",
    "fullname": "Coral Reef Ecology",
    "info": "Contemporary issues in tropical reef ecology from diverse perspectives. Option of two-credit seminar during fall semester plus additional two-credit field option (BIOL 4596) to involve SCUBA diving/snorkeling on tropical reef.prereq: Introductory biology course with lab",
    "prereq": {}
  },
  {
    "uid": "810262",
    "code": "BIOL4596",
    "subject": "BIOL",
    "number": "4596",
    "honors": false,
    "writing": false,
    "name": "Coral Reef Ecology (Dive Trip)",
    "fullname": "Coral Reef Ecology (Dive Trip)",
    "info": "SCUBA diving/snorkeling on tropical reef. Conduct primary research/writing.\n\nprereq: Introductory biology with lab, valid passport, and SCUBA certification.",
    "prereq": {}
  },
  {
    "uid": "803717",
    "code": "BIOL4700",
    "subject": "BIOL",
    "number": "4700",
    "honors": false,
    "writing": false,
    "name": "Cell Physiology",
    "fullname": "Cell Physiology",
    "info": "Principles of cellular physiology. Control mechanisms involved in maintaining homeostasis with respect to cell pH, volume, electrolyte composition, membrane potential, and calcium signaling.",
    "prereq": {}
  },
  {
    "uid": "803434",
    "code": "BIOL4793W",
    "subject": "BIOL",
    "number": "4793",
    "honors": false,
    "writing": true,
    "name": "Directed Studies: WI",
    "fullname": "Directed Studies: Writing Intensive",
    "info": "Writing Intensive Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. One main feature of this course is that the student will receive writing instruction and the written output of the course will be revised during the semester. The project needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, how writing instruction will take place, a timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. This course is graded S/N and approval of the DUGS is required before a grade of S can be given by the faculty mentor. \n\nprereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.\n",
    "prereq": {
      "or": [
        "803434",
        "803435",
        "803140",
        "803141"
      ]
    }
  },
  {
    "uid": "803435",
    "code": "BIOL4794W",
    "subject": "BIOL",
    "number": "4794",
    "honors": false,
    "writing": true,
    "name": "Directed Research: WI",
    "fullname": "Directed Research: Writing Intensive",
    "info": "Writing Intensive Directed Research is an individual-study, laboratory or field research experience in which the student is mentored directly by a faculty member. This course is not for students starting out in research. It is intended for students who already have been working in the research group of the mentor and have developed an independent research project. In this course, the student will receive writing instruction through a writing support course (corresponding to 1 credit in addition to the credits of directed research time) that will meet weekly throughout the semester. The written output usually is in the form of a scientific paper describing the results of the student's project. Written output of the course must be revised during the semester and a schedule for writing, assessment, and revision needs to be in place at the beginning of the semester. The project needs to be explained in the campus Directed Research contract and the project and participation in the writing support course agreed on by both the student and faculty mentor. The contract must be approved by the Director of Undergraduate Studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, agreement about how writing instruction will take place, confirmation of understanding of the timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course - near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. The DUGS can call for a final revision before a grade is given. This course is graded S/N by the writing support course instructor, and approval of both the DUGS and the research mentor is required before a grade of S can be given by the writing support course instructor.\n\nThis course is for non-Honors students. Students should register for the number of research credits they intend to pursue plus 1 cr for the writing support component (for example: 2-4 cr of research + 1 cr writing support = 3-5 cr).\n\nprereq: department consent, instructor consent, no more than a total of 7 credits of 4793W, 4794W, 4993, 4994 combined can count towards CBS major requirements.\n",
    "prereq": {
      "or": [
        "803434",
        "803435",
        "803140",
        "803141"
      ]
    }
  },
  {
    "uid": "014676",
    "code": "BIOL4850",
    "subject": "BIOL",
    "number": "4850",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Biology",
    "fullname": "Special Topics in Biology",
    "info": "Offered at Itasca Biological Station and Laboratories. Metagenomics, telemetry/animal behavior, aquatic botany, field evolution, parasite and disease ecology.\n\nprereq: Beginning biology",
    "prereq": {}
  },
  {
    "uid": "793615",
    "code": "BIOL4862",
    "subject": "BIOL",
    "number": "4862",
    "honors": false,
    "writing": false,
    "name": "Biological Photography",
    "fullname": "Biological Photography and Digital Imaging Techniques",
    "info": "Field photography techniques for documentation of invertebrates, vertebrates, aquatic organisms, and habitats of Itasca area. Digital imaging equipment, software, related techniques. Building video files for the web.",
    "prereq": {}
  },
  {
    "uid": "826254",
    "code": "BIOL4894",
    "subject": "BIOL",
    "number": "4894",
    "honors": false,
    "writing": false,
    "name": "Directed Research in Biotech",
    "fullname": "Directed Research In Biotechnology",
    "info": "Directed Research is an individual-study, laboratory or field investigation course. For Directed Research in Biotechnology, the faculty mentor must be approved by the Director of Undergraduate Studies for the Biotechnology minor and the research topic must be related to Biotechnology. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a Research/Directed Studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the Biotechnology minor before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted.\nprereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.",
    "prereq": {
      "or": [
        "803434",
        "803435",
        "803140",
        "803141"
      ]
    }
  },
  {
    "uid": "009498",
    "code": "BIOL4950",
    "subject": "BIOL",
    "number": "4950",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Biology",
    "fullname": "Special Topics in Biology",
    "info": "In-depth study of special topic in life sciences.",
    "prereq": {}
  },
  {
    "uid": "803140",
    "code": "BIOL4993",
    "subject": "BIOL",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. The topic for the course needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. prereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.",
    "prereq": {
      "or": [
        "803434",
        "803435",
        "803140",
        "803141"
      ]
    }
  },
  {
    "uid": "803141",
    "code": "BIOL4994",
    "subject": "BIOL",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed Research is an individual-study, laboratory or field investigation course. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a Research/Directed Studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. \nprereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.\n\n ",
    "prereq": {
      "or": [
        "803434",
        "803435",
        "803140",
        "803141"
      ]
    }
  },
  {
    "uid": "808373",
    "code": "BIOL5272",
    "subject": "BIOL",
    "number": "5272",
    "honors": false,
    "writing": false,
    "name": "Applied Biostatistics",
    "fullname": "Applied Biostatistics",
    "info": "Conceptual basis of statistical analysis. Statistical analysis of biological data. Data visualization, descriptive statistics, significance tests, experimental design, linear model, simple/multiple regression, general linear model. Lectures, computer lab. \n\nprereq: High school algebra; BIOL 2003 recommended.",
    "prereq": {
      "and": [
        "800457"
      ]
    }
  },
  {
    "uid": "801988",
    "code": "BIOL5309",
    "subject": "BIOL",
    "number": "5309",
    "honors": false,
    "writing": false,
    "name": "Molecular Ecology",
    "fullname": "Molecular Ecology And Ecological Genomics",
    "info": "Application of molecular tools (PCR, sequencing, AFLP, SNPs, QTL) and analyses of molecular data for understanding ecological/evolutionary processes. Strengths/weaknesses of techniques/analyses. Questions molecular tools are used to answer.\n\nprereq: BIOL 3407 or BIOL 3409 or BIOL 4003",
    "prereq": {
      "or": [
        "012848",
        "012681",
        "009489"
      ]
    }
  },
  {
    "uid": "013731",
    "code": "BIOL5407",
    "subject": "BIOL",
    "number": "5407",
    "honors": false,
    "writing": false,
    "name": "Ecology",
    "fullname": "Ecology",
    "info": "Principles of population growth/interactions and ecosystem function applied to ecological issues, including regulation of human populations, dynamics/impacts of disease, invasions by exotic organisms, habitat fragmentation, and biodiversity. Lab.\n\nprereq: [One semester college biology, [MATH 1142 or MATH 1271 or MATH 1281 or equiv], grad student] or instr consent",
    "prereq": {
      "or": [
        "000119",
        "000120",
        "016334"
      ]
    }
  },
  {
    "uid": "013732",
    "code": "BIOL5409",
    "subject": "BIOL",
    "number": "5409",
    "honors": false,
    "writing": false,
    "name": "Evolution",
    "fullname": "Evolution",
    "info": "Diversity of forms in fossil record and in presently existing biology. Genetic mechanisms of evolution. Examples of ongoing evolution in wild/domesticated populations and in disease-causing organisms. Lab.\n\nprereq: One semester of college biology, grad student",
    "prereq": {}
  },
  {
    "uid": "798715",
    "code": "BIOL5485",
    "subject": "BIOL",
    "number": "5485",
    "honors": false,
    "writing": false,
    "name": "Bioinformatics",
    "fullname": "Bioinformatics: Experimental Design and Computational Analysis in Systems Biology",
    "info": "Modern computational tools used in molecular biology and genomics research. When/how to use particular tools, how to interpret results. Principles, advantages/disadvantages of various methods.",
    "prereq": {}
  },
  {
    "uid": "005424",
    "code": "BIOL5501",
    "subject": "BIOL",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Biol Collections",
    "fullname": "Biological Collections: Curation and Management",
    "info": "Roles and value of biological collections in terms of biodiversity; natural history museum management and philosophy; conservation of museum specimens; data access and ethics. Students participate in various curatorial activities.",
    "prereq": {}
  },
  {
    "uid": "013562",
    "code": "BIOL5511",
    "subject": "BIOL",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Teaching Bioscience",
    "fullname": "Teaching the Biological Sciences",
    "info": "Methods and teaching styles used by outstanding university teachers including reviews and critiques from research on teaching. Opportunities for students to practice and evaluate teaching strategies.",
    "prereq": {}
  },
  {
    "uid": "820023",
    "code": "BIOL5701",
    "subject": "BIOL",
    "number": "5701",
    "honors": false,
    "writing": false,
    "name": "Science Communication",
    "fullname": "Science Communication: A Primer for Scientists",
    "info": "Are you interested in honing your skills as a communicator? This class will help you improve your skills and gain confidence through practice and feedback. At the end of the course, you will have two finished pieces that you can use for fellowship applications or to publish. Topics covered include,  translating technical concepts and avoiding jargon, understanding your audience and employing storytelling to engage them, identifying what makes science newsworthy, exploring concepts in inclusive science communication, and writing science stories and a three-minute thesis talk. \nThe skills and practice from this course will help you in your future writing, presentations, and networking whether you want a career in academia, industry, nonproﬁt, government, or beyond. In addition to gaining a solid foundation in science communication, you will hear from guest speakers and experts about careers translating science.",
    "prereq": {}
  },
  {
    "uid": "009499",
    "code": "BIOL5910",
    "subject": "BIOL",
    "number": "5910",
    "honors": false,
    "writing": false,
    "name": "Topics for Teachers",
    "fullname": "Special Topics in Biology for Teachers",
    "info": "Courses developed for K-12 teachers depending on topics or subtopics which might include any of the following: plant biology, animal biology, genetics, cell biology, biochemistry, microbiology.\n\nprereq: BA or BS in science or science education or elementary education or K-12 licensed teacher",
    "prereq": {}
  },
  {
    "uid": "787914",
    "code": "BIOL5913",
    "subject": "BIOL",
    "number": "5913",
    "honors": false,
    "writing": false,
    "name": "Monarch Biology for Teachers",
    "fullname": "Biology for Teachers: Monarchs in the Classroom",
    "info": "Two-week summer workshop. Week one focuses on monarch butterfly biology taught through fieldwork, labs, lecture, and research projects. A 2- to 3-week break follows, when students raise monarchs, conduct simple experiments. Week two focuses on designing classroom activities/projects based on monarch biology. Follow-up meetings held during academic year.",
    "prereq": {}
  },
  {
    "uid": "800113",
    "code": "BIOL5950",
    "subject": "BIOL",
    "number": "5950",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "In-depth study of special topic in life sciences.",
    "prereq": {}
  },
  {
    "uid": "016145",
    "code": "BIOL6793",
    "subject": "BIOL",
    "number": "6793",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Individual study on selected topics/problems. Emphasizes either readings/use of scientific literature or laboratory/field techniques.\n\nprereq: MBS, 7 cr max, instr consent",
    "prereq": {}
  },
  {
    "uid": "016143",
    "code": "BIOL6794",
    "subject": "BIOL",
    "number": "6794",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Laboratory or field investigation of selected areas of research.\n\nprereq: MBS, instr consent",
    "prereq": {}
  },
  {
    "uid": "016148",
    "code": "BIOL6999",
    "subject": "BIOL",
    "number": "6999",
    "honors": false,
    "writing": false,
    "name": "Capstone Project",
    "fullname": "Capstone Project",
    "info": "Independent, original investigation of a relevant subject, challenge, or issue within biological sciences. Project takes approximately 120 hours.\n\nprereq: MBS, instr consent",
    "prereq": {}
  },
  {
    "uid": "817477",
    "code": "BIOL8100",
    "subject": "BIOL",
    "number": "8100",
    "honors": false,
    "writing": false,
    "name": "Improvisation for Scientists",
    "fullname": "Improvisation for Scientists",
    "info": "This is a 7-week course designed to practice a wide array of strategies in order to gain awareness and control over your personal expression. Students will develop more effective ways to expand their ability to navigate the stress generally associated with delivering content in front of others. By learning how to manage their personal expression more effectively, students will be able to use specific tools in order to adapt their expression to various settings (large audiences, small groups, or one on one interviews/counseling). \n\nAdapting exercises from techniques such as improvisation and storytelling, this class will provide a comfortable and safe environment for students who want to expand their confidence when presenting for others.\n",
    "prereq": {}
  }
]