[
  {
    "uid": "013819",
    "code": "BLAW3058",
    "subject": "BLAW",
    "number": "3058",
    "honors": false,
    "writing": false,
    "name": "Law of Contracts and Agency",
    "fullname": "The Law of Contracts and Agency",
    "info": "Origin of law, its place in and effect on society; history and development of law; system of courts; legal procedure. Law of contracts as the basic law affecting business transaction. Laws affecting the sale of goods and contracts and the law of agency.",
    "prereq": {}
  },
  {
    "uid": "818126",
    "code": "BLAW3059",
    "subject": "BLAW",
    "number": "3059",
    "honors": false,
    "writing": false,
    "name": "Real Estate Law",
    "fullname": "Real Estate Law",
    "info": "Every business owner or manager inevitably will be involved with purchasing, selling, owning, leasing, zoning, taxing, mortgaging and financing real estate. This course provides the basic tools to understand all aspects of real estate and to spot issues that require legal counsel.",
    "prereq": {}
  },
  {
    "uid": "819871",
    "code": "BLAW3061",
    "subject": "BLAW",
    "number": "3061",
    "honors": false,
    "writing": false,
    "name": "Business Law Basics",
    "fullname": "Business Law Basics",
    "info": "This course provides a broad background in the fundamentals of many business law topics that are important to any businessperson.  NOTE: This course is designed for students who do not have knowledge or experience with any aspect of business law.  There is no prerequisite for this course.  The goal is to provide basic concepts that can be used throughout your career to spot legal issues, identify potential concerns, and with the aid of counsel, solve or avoid problems. General topics include:  various legal entities in which business can be conducted, tort law (with emphasis on negligence), real estate law, the law of agency, intellectual property (patents, copyrights, trade secrets and trademarks), warranty law, product liability, employment law, certain discrimination laws (including Minnesota’s fairly recent protections for women in the workplace), alternative dispute resolution and administrative law.  Throughout the course, we will examine the impact of the Supreme Court on American business.\n  NOTE: Students who previously took BLAW 3058 (4 credit course) should NOT take this course.",
    "prereq": {
      "or": [
        "013819"
      ]
    }
  },
  {
    "uid": "819872",
    "code": "BLAW3062",
    "subject": "BLAW",
    "number": "3062",
    "honors": false,
    "writing": false,
    "name": "Contract Law and Corporate Reg",
    "fullname": "Contract Law and Corporate Regulation",
    "info": "This course highlights topics that are important to any business major, with particular emphasis on publicly-traded companies. NOTE: This course is designed for students who do not have knowledge or experience with any aspect of business law.  There is no prerequisite for this course.  General topics include:  (1) the law of contracts and transactions involving the sale of goods, (2) secured transactions (how creditors can use a debtor’s assets as collateral to secure indebtedness), and (3) the basics of bankruptcy law.  Public company subjects include:  pros and cons of going public, the IPO process, federal securities laws and SEC regulations regarding public company reporting requirements, insider trading, the Sarbanes-Oxley Act of 2002 and its impact on corporate governance, trends in shareholder democracy rights and shareholder activism, and the role of boards and audit committees.  Throughout the course, we will examine the impact of the Supreme Court on American business.   NOTE: Students who previously took BLAW 3058 (4 credit course) should NOT take this course.",
    "prereq": {
      "or": [
        "013819"
      ]
    }
  },
  {
    "uid": "014127",
    "code": "BLAW5078",
    "subject": "BLAW",
    "number": "5078",
    "honors": false,
    "writing": false,
    "name": "Partnerships,Corp",
    "fullname": "Partnerships and Corporations",
    "info": "Partnership and corporate forms of business entities, including methods of creating the relationships and the study of law used to regulate and control these organizations and their members. ",
    "prereq": {}
  },
  {
    "uid": "014128",
    "code": "BLAW5088",
    "subject": "BLAW",
    "number": "5088",
    "honors": false,
    "writing": false,
    "name": "Property, CommPaper",
    "fullname": "Law of Personal Property, Real Property, and Commercial Paper",
    "info": "Basic concepts of personal property, including rights of possessors, bailees, and finders and holders of security interests. Real property law. Transfers of ownership, control of and encumbering such interests. The law of paper (negotiable instruments).",
    "prereq": {}
  },
  {
    "uid": "015910",
    "code": "BLAW6158",
    "subject": "BLAW",
    "number": "6158",
    "honors": false,
    "writing": false,
    "name": "American Business Law",
    "fullname": "The study of laws affecting private business and publicly-traded companies.",
    "info": "This course highlights topics that are important to any business manager, with particular emphasis on areas of interest for those aspiring to high level executive/management positions with publicly-traded companies.  General topics include:  contracts, real estate law, the law of agency, employment law, certain discrimination laws (including Minnesota's fairly recent protections for women in the workplace), and forms of business entity.  Public company subjects include:  pros and cons of going public, the IPO process, federal securities laws and SEC regulations regarding public company reporting requirements, insider trading, the Sarbanes-Oxley Act of 2002 and its impact on corporate governance, trends in shareholder democracy rights and shareholder activism, and the role of boards and audit committees. Throughout the course, we will examine the impact of the Supreme Court on American business.\n\nprereq: MBA or Mgmt Sci MBA student",
    "prereq": {}
  }
]