[
  {
    "uid": "806379",
    "code": "BSE2001",
    "subject": "BSE",
    "number": "2001",
    "honors": false,
    "writing": false,
    "name": "Intro to BSE",
    "fullname": "An Introduction to Biology, Society, and Environment",
    "info": "The BSE major is built on the idea that problems of biology, health, and the environment emerge at the intersection of natural and human systems. Understanding these problems and their solutions, and building skill sets to address them, requires experience in the biological and natural sciences as well as in the social sciences and humanities. In this introduction to the BSE major, you’ll explore the interconnectedness of biology, society, and environment through a series of “case study” modules that include lectures, videos, readings, and discussions. You’ll also complete some very practical exercises to help you consider how you might develop your own unique path through the BSE major, in ways that are relevant to your personal and/or professional interests and goals.\n\nMust be completed prior to senior year.",
    "prereq": {}
  },
  {
    "uid": "802051",
    "code": "BSE3305",
    "subject": "BSE",
    "number": "3305",
    "honors": false,
    "writing": false,
    "name": "Introduction to Bioethics",
    "fullname": "Introduction to Bioethics",
    "info": "Introduction to issues/methods of bioethics. ",
    "prereq": {}
  },
  {
    "uid": "800353",
    "code": "BSE3355",
    "subject": "BSE",
    "number": "3355",
    "honors": false,
    "writing": false,
    "name": "Environ Quality",
    "fullname": "Environmental Quality",
    "info": "Quality of human environment as dependent on how humans make decisions about how to act, how they act, and how they evaluate both. Disjointed incrementalism, in which governments, organizations, and individuals play distinct/important roles.",
    "prereq": {}
  },
  {
    "uid": "809009",
    "code": "BSE3361W",
    "subject": "BSE",
    "number": "3361",
    "honors": false,
    "writing": true,
    "name": "Geography and Public Policy",
    "fullname": "Geography and Public Policy",
    "info": "Nature/effects of federal policy in United States. How documents produced as policy are crafted/implemented. Policies relating to food/agriculture, forestry, wildlife, transportation.",
    "prereq": {}
  },
  {
    "uid": "818548",
    "code": "BSE3896",
    "subject": "BSE",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor. A student may only earn credit for a given internship through one course at a time.",
    "prereq": {}
  },
  {
    "uid": "818310",
    "code": "BSE3991",
    "subject": "BSE",
    "number": "3991",
    "honors": false,
    "writing": false,
    "name": "BSE Capstone",
    "fullname": "Biology, Society, and Environment Capstone",
    "info": "This course will help you reflect on your path through the BSE major, assess the knowledge and skills you developed during your degree program, and articulate how your knowledge and skills support your personal and professional interests and goals. BSE 3991 is open to Senior BSE majors.",
    "prereq": {}
  },
  {
    "uid": "820086",
    "code": "BSE3994",
    "subject": "BSE",
    "number": "3994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research in Biology, Society, and Environment",
    "info": "Students work with a faculty supervisor on an Individual guided research project.",
    "prereq": {}
  },
  {
    "uid": "809023",
    "code": "BSE3996",
    "subject": "BSE",
    "number": "3996",
    "honors": false,
    "writing": false,
    "name": "Senior Proj Directed Research",
    "fullname": "Senior Project Directed Research",
    "info": "Individual guided research course taken in fulfillment of BSE senior project requirement.\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "809025",
    "code": "BSE3997",
    "subject": "BSE",
    "number": "3997",
    "honors": false,
    "writing": false,
    "name": "Senior Project",
    "fullname": "Senior Project",
    "info": "Senior Project add-on credit. Must be taken concurrently with  \"BSE Core\" or \"BSE Theme Elective\" course related to area of specialization.\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  }
]