[
  {
    "uid": "794639",
    "code": "CDED6101",
    "subject": "CDED",
    "number": "6101",
    "honors": false,
    "writing": false,
    "name": "PGE I: Lecture/Lab",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry I: Level I--Lecture/Laboratory Series",
    "info": "Dental materials, occlusion, dental photography, smile design, anterior ceramic restorations, posterior ceramic restorations. Color, bleaching, and endoesthetics. Anterior composite restorations. Posterior composite restorations, fiber-reinforced composite bridges, in-office indirect restorations, partial/full denture esthetics, implant esthetics, perio esthetics, practice management for contemporary esthetic dentistry. Lectures, discussion, lab applications.",
    "prereq": {}
  },
  {
    "uid": "794640",
    "code": "CDED6202",
    "subject": "CDED",
    "number": "6202",
    "honors": false,
    "writing": false,
    "name": "PGE II: Patient Series",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level II--Patient Series",
    "info": "Dental photography, anterior/posterior composite restorations, indirect anterior restorations, indirect posterior restorations. Lectures, case presentations. Clinical experience with multi-unit, complex restorative problems.\n\nprereq: 6101",
    "prereq": {
      "and": [
        "794639"
      ]
    }
  },
  {
    "uid": "794641",
    "code": "CDED7301",
    "subject": "CDED",
    "number": "7301",
    "honors": false,
    "writing": false,
    "name": "PGE III Occlusion/Function",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Occlusion and Function",
    "info": "How to provide occlusal stability through functional/anatomical harmony. Centric relation, vertical dimension, neutral zone, occlusal plane, anterior guidance. Occlusal records, articulators, occlusal equilibration, anterior previews, custom incisal guide tables. Lectures, lab, clinical experience.",
    "prereq": {}
  },
  {
    "uid": "794642",
    "code": "CDED7302",
    "subject": "CDED",
    "number": "7302",
    "honors": false,
    "writing": false,
    "name": "PGE III Ortho & Perio",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Orthodontic and Periodontal Esthetics",
    "info": "How periodontal/orthodontic therapies may be used to enhance esthetic outcome of restorative cases. How to use cephalometric analysis for evaluating facial esthetics. When to use limited orthodontic treatment before restorative treatment. How to eliminate uneven gingival contours, lengthen crowns, recontour interdental papilla, and optimize periodontal esthetics around dental implants. Lectures, workshop with removable appliances. Surgical demonstrations, discussions of cases from practice.",
    "prereq": {}
  },
  {
    "uid": "794643",
    "code": "CDED7303",
    "subject": "CDED",
    "number": "7303",
    "honors": false,
    "writing": false,
    "name": "PGE III: Implants",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Dental Implants",
    "info": "How to use dental implants as part of restorative treatment plan. Patient selection/treatment planning, surgical phases of implant placement, restorative phases of implant placement, perioesthetics related to dental implants. Lectures, lab, clinical demonstrations, discussion of cases from practice.",
    "prereq": {}
  },
  {
    "uid": "794644",
    "code": "CDED7304",
    "subject": "CDED",
    "number": "7304",
    "honors": false,
    "writing": false,
    "name": "PGE III: Partial Dentures",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Removable Partial Dentures",
    "info": "Esthetic clasping, flexible partial denture designs, contemporary materials/techniques for removable partial dentures. Survey, design, and blockout for rotational paths of insertion. Swinglock saddlelock, and flexible partial denture designs. In-office reline techniques. Simplified remount casts for occlusal refinement. Lectures, lab, discussion of cases from practice.",
    "prereq": {}
  },
  {
    "uid": "794646",
    "code": "CDED7305",
    "subject": "CDED",
    "number": "7305",
    "honors": false,
    "writing": false,
    "name": "PGE III: Endoesthetics",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Endoesthetics",
    "info": "Restoring endodontically treated teeth. Concepts/techniques in endodontic therapy, reasons for endodontic failure, internal bleaching techniques, how to restore endodontically treated teeth. Internal bleaching techniques, tooth preparation, placement of fiber posts. Lectures, lab, patient demonstration, elective patient application, discussion of cases from practice.",
    "prereq": {}
  },
  {
    "uid": "794647",
    "code": "CDED7306",
    "subject": "CDED",
    "number": "7306",
    "honors": false,
    "writing": false,
    "name": "PGE III: Diagnostic Box",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Diagnostic Box",
    "info": "Advanced techniques for photographic, cosmetic, and occlusal analysis. How to customize gender, age, and personality into case design. Emphasizes effective case presentation and staff involvement. Lecture, lab/clinical experience with diagnostic records, cosmetic previews.",
    "prereq": {}
  },
  {
    "uid": "794648",
    "code": "CDED7307",
    "subject": "CDED",
    "number": "7307",
    "honors": false,
    "writing": false,
    "name": "PGE III: Technology",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Technology in Restorative Dentistry",
    "info": "How to incorporate new technologies into practice. Composite curing technology, digital radiography, high tech software programs CAD/CAM technology digital cameras, diagnodent, intraoral cameras, other new high tech equipment. CEREC, digital radiography, digital cameras, diagnodent, high tech software systems. Small group interaction with faculty.",
    "prereq": {}
  },
  {
    "uid": "794649",
    "code": "CDED7401",
    "subject": "CDED",
    "number": "7401",
    "honors": false,
    "writing": false,
    "name": "PGE III: Research Design",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Research Design",
    "info": "Analyzing research findings, writing a research proposal. How to critique dental literature, evaluate claims made by dental manufacturers. Methods of research design, data collection/interpretation. Methods to pose a research question, prepare a research plan, and apply analytical skills to everyday practice.",
    "prereq": {}
  },
  {
    "uid": "794650",
    "code": "CDED7402",
    "subject": "CDED",
    "number": "7402",
    "honors": false,
    "writing": false,
    "name": "PGE III: Research Paper",
    "fullname": "Postgraduate Contemporary Esthetic Dentistry: Level III--Independent Research Paper",
    "info": "Independent research paper under supervision of faculty mentor. Selected topic must pose a research question, follow established research protocol, and advance knowledge in the field of contemporary restorative/esthetic dentistry.\n\nprereq: 7401",
    "prereq": {
      "and": [
        "794649"
      ]
    }
  }
]