[
  {
    "uid": "003323",
    "code": "CEGE1101",
    "subject": "CEGE",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Intro to Civil, Env, & Geo-Eng",
    "fullname": "Introduction to Civil, Environmental, and Geo-Engineering",
    "info": "This course introduces students to the civil, environmental, and geo-engineering practice and the vital role these fields play in engineering our society. Presentations by professionals and faculty will explore the current and future challenges of the field, research areas, and career opportunities. Small group discussions with upper-division CEGE students will foster connections with classmates while learning about the\nopportunities in the Civil, Environmental, and Geo- Engineering Department.",
    "prereq": {}
  },
  {
    "uid": "826387",
    "code": "CEGE1201",
    "subject": "CEGE",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Emerging Technologies in Trans",
    "fullname": "Emerging Technologies in Transportation: Automated and Electric Vehicles",
    "info": "Emerging battery and computer technologies are revolutionizing our daily transportation.\nVehicle automation has the potential to reduce congestion, create new methods of traffic control, and change our travel patterns. 29% of United States greenhouse gas emissions come from transportation, and electric vehicles could help reduce the environmental impacts. This course presents an introductory exploration into automated and electric vehicle technologies from a transportation systems perspective. As you study emerging technologies, you will also get exposed to the engineering methods used to design current transportation systems.\n\nprereq: Recommended (High school algebra, trigonometry, and physics)",
    "prereq": {}
  },
  {
    "uid": "816891",
    "code": "CEGE1501",
    "subject": "CEGE",
    "number": "1501",
    "honors": false,
    "writing": false,
    "name": "Environmental Issues Solutions",
    "fullname": "Environmental Issues and Solutions",
    "info": "You will explore a range of environmental challenges and their potential solutions, including climate change, water pollution, air pollution, renewable energy, resource depletion, and biodiversity loss, social justice, equity, ethical responsibilities. You will study the causes, consequences, and solutions while gaining hands-on experience through weekly laboratory sessions where you will work in groups, focusing on environmental monitoring, data collection, and analysis to assess environmental parameters and understand real-world applications. You will participate in engaging field trips to the Hennepin Energy Recovery Center, Eloise Butler Wildflower Garden and Bird Sanctuary, and two local lakes and/or the Mississippi River during your lab sessions. By the end of the course, you will be equipped with the knowledge, skills, and ethical awareness necessary to contribute meaningfully to the ongoing dialogue on environmental sustainability and solutions. \n\nJoin us as this course is  designed for all majors. \n\nThis course satisfies the Liberal Education requirements of Physical Sciences with Lab Core and The Environment Theme.",
    "prereq": {}
  },
  {
    "uid": "003324",
    "code": "CEGE3101",
    "subject": "CEGE",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Computer Applications I",
    "fullname": "Computer Applications I",
    "info": "Computer tools and computational methods for solving civil, environmental, and geo-engineering problems. Solving systems of linear/nonlinear equations, parameter estimation and engineering model fitting, numerical differentiation/integration, numerical solution of ordinary, and partial differential equations.\n\nprereq: MATH 1372 or equiv., PHYS 1301 or equiv., CSE or instructor consent",
    "prereq": {
      "or": [
        "003693",
        "002070"
      ]
    }
  },
  {
    "uid": "795303",
    "code": "CEGE3102",
    "subject": "CEGE",
    "number": "3102",
    "honors": false,
    "writing": false,
    "name": "Uncertainty & Decision Analy",
    "fullname": "Uncertainty and Decision Analysis",
    "info": "Stochastic models, their usefulness in reasoning about uncertainty in civil, environmental, and geo-engineering. Techniques for identifying, fitting, and validating models using data samples. Testing hypotheses about, and bounding uncertainty attached to, engineering parameters. Applications to civil, environmental, and geo-engineering.\n\nprereq: MATH 1372 or equiv",
    "prereq": {
      "or": [
        "003693"
      ]
    }
  },
  {
    "uid": "817428",
    "code": "CEGE3103",
    "subject": "CEGE",
    "number": "3103",
    "honors": false,
    "writing": false,
    "name": "Engrg Ethics and Prof Practice",
    "fullname": "Engineering Ethics and Professional Practice",
    "info": "Introduction to ethical thinking, code of ethics for engineers, accounting for Equity, Diversity and Inclusion (DEI) in engineering practice, the role of Environmental Justice, and legal aspects of professional practice, using ethical and DEI case studies.\n\nprereq: Civil Eng. or Environmental Eng. or Geoengineering Upper Division",
    "prereq": {}
  },
  {
    "uid": "817228",
    "code": "CEGE3190",
    "subject": "CEGE",
    "number": "3190",
    "honors": false,
    "writing": false,
    "name": "Curricular Practical Training",
    "fullname": "Curricular Practical Training Internship",
    "info": "Work assignment involving advanced civil engineering. Reviewed by the director of undergraduate studies. \nPrereq: CE, EnvE, or Geo major ",
    "prereq": {}
  },
  {
    "uid": "003335",
    "code": "CEGE3201",
    "subject": "CEGE",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Transportation Engineering",
    "fullname": "Transportation Engineering",
    "info": "Applying laws of motion to vehicle performance, determining constraints for highway designs. Traffic flow principles, their relation to capacity and level of service. Geometric design, traffic control, pavement design, transportation planning. \n\nprereq: PHYS 1301 or equivalent, (CEGE 3101, CEGE 3102 can be taken concurrently)",
    "prereq": {
      "or": [
        "002070",
        {
          "and": [
            "003324",
            "795303"
          ]
        }
      ]
    }
  },
  {
    "uid": "004236",
    "code": "CEGE3301",
    "subject": "CEGE",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Soil Mechanics I",
    "fullname": "Soil Mechanics I",
    "info": "Index properties and soil classification. Effective stress. Permeability and seepage. Elasticity theory. One-dimensional compression and consolidation; settlements.  Compaction; cut and fill problems.\n\nprereq: upper division CSE, AEM 3031, CEGE 3101, or instructor consent",
    "prereq": {
      "or": [
        "004340",
        "003324"
      ]
    }
  },
  {
    "uid": "004479",
    "code": "CEGE3401",
    "subject": "CEGE",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Linear Structural Analysis",
    "fullname": "Linear Structural Analysis",
    "info": "Analysis of determinate/indeterminate trusses and frames. Application of energy methods and virtual work technique in analysis of structural deformations. Force-based and displacement-based methods in analysis of indeterminate structures. Influence lines and critical load configurations.\n\nprereq: AEM 3031, upper division CSE or instructor consent",
    "prereq": {
      "or": [
        "004340"
      ]
    }
  },
  {
    "uid": "004707",
    "code": "CEGE3402",
    "subject": "CEGE",
    "number": "3402",
    "honors": false,
    "writing": false,
    "name": "Civil Engineering Materials",
    "fullname": "Civil Engineering Materials",
    "info": "Concepts and modeling of behavior mechanisms for civil engineering materials such as concrete, masonry, metals, asphalt, plastics, and wood. Standard specifications for material properties. Techniques for testing.\n\nprereq:  AEM 3031",
    "prereq": {
      "and": [
        "004340"
      ]
    }
  },
  {
    "uid": "004226",
    "code": "CEGE3501",
    "subject": "CEGE",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Environmental Engineering",
    "fullname": "Introduction to Environmental Engineering",
    "info": "A quantitative approach to environmental problems, including the development of mass and energy balances and the application of fundamental principles of environmental chemistry and microbiology. Meets the University of Minnesota's liberal education environment theme through the incorporation of environmental function, problems, and solutions throughout the course.\n\nprereq: Chem 1071 or equivalent, Phys 1302 or equivalent, Math 1372 or equivalent",
    "prereq": {
      "or": [
        "827126",
        "002071",
        "003693"
      ]
    }
  },
  {
    "uid": "005011",
    "code": "CEGE3502",
    "subject": "CEGE",
    "number": "3502",
    "honors": false,
    "writing": false,
    "name": "Fluid Mechanics",
    "fullname": "Fluid Mechanics",
    "info": "Course covers fluid statics/dynamics. Kinematics of fluid flow, equations of motion, pressure-velocity relationships, viscous effects, boundary layers. Momentum/energy equations. Lift/drag. Flow in pipes and pipe systems. Hydraulic machinery. Fluid measurements. \n\nprereq: [AEM 2012 or AEM 3031], Math 2373 or equivalent, CEGE 3101",
    "prereq": {
      "or": [
        {
          "or": [
            "004334",
            "004340"
          ]
        },
        "003694",
        "003324"
      ]
    }
  },
  {
    "uid": "811360",
    "code": "CEGE3541",
    "subject": "CEGE",
    "number": "3541",
    "honors": false,
    "writing": false,
    "name": "Environmental Engineering Lab",
    "fullname": "Environmental Engineering Laboratory",
    "info": "Laboratory-based course focused on physical, chemical, and microbiological measurements used in analysis of air, water, and solid samples. Applications include water quality, water treatment, wastewater treatment, hazardous waste treatment/remediation, air pollution, and environmental sensing.\n\nprereq: CEGE 3501",
    "prereq": {
      "and": [
        "004226"
      ]
    }
  },
  {
    "uid": "003325",
    "code": "CEGE4101W",
    "subject": "CEGE",
    "number": "4101",
    "honors": false,
    "writing": true,
    "name": "Project Mgmt & Engrg Economics",
    "fullname": "Project Management and Engineering Economics",
    "info": "Civil, Environmental, and Geo-engineering project management.  Project planning, scheduling, and controlling. Project permitting. Financing, bidding, and contracts for public projects. Budgeting, staffing, task cost control. Critical path method and graphical project representations. Project management and leadership. Risk management. Engineering economics.\n\nPrerequisites: Civil Eng. or Environmental Eng. or Geoengineering upper division",
    "prereq": {}
  },
  {
    "uid": "003327",
    "code": "CEGE4102W",
    "subject": "CEGE",
    "number": "4102",
    "honors": false,
    "writing": true,
    "name": "Capstone Design for CE",
    "fullname": "Capstone Design for Civil Engineering",
    "info": "Students participate in teams to design a solution for an open-ended civil, environmental, and geo- engineering problem. Projects include a cross-section of critical design tasks from conceptualization through preliminary planning, public hearings, design, environmental impact statements, final plans/specifications, and award of contracts. Student design reports must include an assessment of sustainability and an evaluation of issues related to ethics, diversity, equity, and inclusion.\n\nprereq: 4101W, 4401, 4501",
    "prereq": {
      "and": [
        "003325",
        "007348",
        "003486"
      ]
    }
  },
  {
    "uid": "820111",
    "code": "CEGE4103W",
    "subject": "CEGE",
    "number": "4103",
    "honors": false,
    "writing": true,
    "name": "Capstone Design for EnvE",
    "fullname": "Capstone Design for Environmental Engineering",
    "info": "Students participate in teams to design a solution for an open-ended civil, environmental, and geo- engineering problem. Projects include a cross-section of critical design tasks from conceptualization through preliminary planning, public hearings, design, environmental impact statements, final plans/specifications, and award of contracts. Student design reports must include an assessment of sustainability and an evaluation of issues related to ethics, diversity, equity, and inclusion.\n\nPrereqs: CEGE 4101W, 4501, 4502",
    "prereq": {}
  },
  {
    "uid": "003701",
    "code": "CEGE4104W",
    "subject": "CEGE",
    "number": "4104",
    "honors": false,
    "writing": true,
    "name": "Capstone Design for GeoEng",
    "fullname": "Capstone Design for Geoengineering",
    "info": "Students participate in teams to design a solution for an open-ended civil, environmental, and geo- engineering problem. Projects include a cross-section of critical design tasks from conceptualization through preliminary planning, public hearings, design, environmental impact statements, final plans/specifications, and award of contracts. Student design reports must include an assessment of sustainability and an evaluation of issues related to ethics, diversity, equity, and inclusion.\n\nprereq: CEGE 4101W,  CEGE 4121, CEGE 4311, CEGE 4351, ESCI 4501",
    "prereq": {
      "and": [
        "003325",
        "003329",
        "004251",
        "003713",
        "003958"
      ]
    }
  },
  {
    "uid": "790673",
    "code": "CEGE4111",
    "subject": "CEGE",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "CADD & Coordinate Geometry",
    "fullname": "CADD and Coordinate Geometry Applications",
    "info": "This course provides an introduction to AutoCAD, Civil 3D, and GIS software applications. Students complete all tasks to design two-lane roadways and subdivision using civil engineering design software, including topography, plan/profile, contours, cross sections, and quantity calculations. Instruction in coordinate geometry includes how various data files are obtained, and can be used to create surfaces for design.",
    "prereq": {}
  },
  {
    "uid": "003329",
    "code": "CEGE4121",
    "subject": "CEGE",
    "number": "4121",
    "honors": false,
    "writing": false,
    "name": "Computer Applications II",
    "fullname": "Computer Applications II",
    "info": "Advanced application of computer tools/methods in solving ordinary/partial differential equations from civil engineering problems. Spreadsheet, MatLab programming. Methods may include finite differences, boundary element, finite element, and control volume finite element.\n\nprereq: CEGE 3101, MATH 2373 or equivalent, MATH 2374 or equivalent, upper division CSE or instructor consent",
    "prereq": {
      "or": [
        "003324",
        "003694",
        "003695"
      ]
    }
  },
  {
    "uid": "798301",
    "code": "CEGE4160",
    "subject": "CEGE",
    "number": "4160",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Topics/credits vary.prereq: Upper div CSE",
    "prereq": {}
  },
  {
    "uid": "003331",
    "code": "CEGE4170",
    "subject": "CEGE",
    "number": "4170",
    "honors": false,
    "writing": false,
    "name": "Independent Study I",
    "fullname": "Independent Study I",
    "info": "Special studies in planning, designing, or analyzing civil engineering systems.  Lab problems, literature studies, or reports supervised by staff.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "003333",
    "code": "CEGE4180",
    "subject": "CEGE",
    "number": "4180",
    "honors": false,
    "writing": false,
    "name": "Ind Study II",
    "fullname": "Independent Study II",
    "info": "Special studies in the planning, design, or analysis of civil engineering systems.  Individual lab research problems, literature studies, reports. Supervised by staff.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "003334",
    "code": "CEGE4190",
    "subject": "CEGE",
    "number": "4190",
    "honors": false,
    "writing": false,
    "name": "Engineering Co-op Assignment",
    "fullname": "Engineering Co-op Assignment",
    "info": "Formal written report of work during six-month professional assignment.\n\nprereq: Upper div CEGE, approval of department co-op director",
    "prereq": {}
  },
  {
    "uid": "820234",
    "code": "CEGE4194",
    "subject": "CEGE",
    "number": "4194",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Special studies in planning, designing, or analyzing civil, environmental, and geo-engineering systems. Lab problems, literature studies, or reports supervised by staff.\n\nprereq: Instructor Consent",
    "prereq": {}
  },
  {
    "uid": "003337",
    "code": "CEGE4201",
    "subject": "CEGE",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Principles of Highway Design",
    "fullname": "Principles of Highway Design",
    "info": "Vertical and horizontal alignment, cross-sections and earthwork computations, roadside design, highway capacity, impact of vehicle type on geometric design, intersection design, safety impacts of highway design.\n\nprereq:  upper division CSE student, CEGE 3201 or instr consent",
    "prereq": {
      "or": [
        "003335"
      ]
    }
  },
  {
    "uid": "798298",
    "code": "CEGE4211",
    "subject": "CEGE",
    "number": "4211",
    "honors": false,
    "writing": false,
    "name": "Hwy Design & Traffic Operation",
    "fullname": "Highway Design and Traffic Operations",
    "info": "Principles of vehicle/driver performance as they apply to design and operation of highways. Highway alignment and roadside design. Intersection design and traffic control devices. Capacity/level of service. Trip generation and traffic impact analysis. Safety studies and safety impacts of design and operational decisions.\n\nprereq: CEGE 3201, CEGE 3102 or equivalent, upper division CSE or instructor consent",
    "prereq": {
      "or": [
        "003335",
        "795303"
      ]
    }
  },
  {
    "uid": "825669",
    "code": "CEGE4214",
    "subject": "CEGE",
    "number": "4214",
    "honors": false,
    "writing": false,
    "name": "Infrastructure Systems Eng.",
    "fullname": "Infrastructure Systems Engineering",
    "info": "The course introduces mathematical modeling methods such as convex or network optimization to formulate and solve civil engineering problems. Examples are motivated from emerging technologies such as sensing, shared mobility, etc. and computer tools are used to solve the problems.\n\nPrereqs: Math 2263 or equivalent, Math 2373 or equivalent, CEGE 3101 or equivalent, CEGE 3102 or equivalent",
    "prereq": {}
  },
  {
    "uid": "825881",
    "code": "CEGE4219",
    "subject": "CEGE",
    "number": "4219",
    "honors": false,
    "writing": false,
    "name": "Air Transportation Systems",
    "fullname": "Air Transportation Systems",
    "info": "This course provides an overview of the civil air transportation system design and operations. After completing this course, you should be able to  describe the operations of civil transport aircraft from the pilot and company and air traffic control perspectives; conduct basic economic analysis on airline operations and demand; conduct capacity analysis for airspace and airports; and conduct basic optimization for air transportation operations. This course will prepare students for working with the civil aviation industry.\n\nprereq: MATH 2263 or equivalent , MATH 2373 or equivalent, PHYS 1301 or equivalent \nRecommended: (CEGE 3101 or equivalent, CEGE 3102 or equivalent)",
    "prereq": {
      "or": [
        "000282",
        "003694",
        "002070",
        {
          "or": [
            "003324",
            "795303"
          ]
        }
      ]
    }
  },
  {
    "uid": "802806",
    "code": "CEGE4251",
    "subject": "CEGE",
    "number": "4251",
    "honors": false,
    "writing": false,
    "name": "Pavement Analysis",
    "fullname": "Pavement Analysis, Design, and Rehabilitation",
    "info": "Concepts/principles in rigid/flexible pavement design.  Traffic loads, soil considerations, material characteristics for highway/airfield pavement design. Rehabilitating flexible/rigid pavement systems.\n\nprereq: [3201, 3301, 3402W, upper div CSE] or grad student or instr consent",
    "prereq": {
      "and": [
        "003335",
        "004236"
      ]
    }
  },
  {
    "uid": "802807",
    "code": "CEGE4253",
    "subject": "CEGE",
    "number": "4253",
    "honors": false,
    "writing": false,
    "name": "Pavement Design, Eng, & Mgmt",
    "fullname": "Pavement Design, Engineering, and Management",
    "info": "History of road construction, pavement types, traffic, and environmental loading. Subgrade materials, aggregates, asphalt concrete, and Portland cement concrete. Flexible pavement analysis and rigid pavements analysis.  Structural design of flexible pavements and structural design of rigid pavements. Flexible pavements construction and rigid pavements construction. Distresses, maintenance, and rehabilitation of pavement systems. Assessment of pavement condition. Needs analysis and rehabilitation and maintenance strategies. Time value of money and life cycle cost analysis.\n\nprereq: [3201, 3301, 3402, upper div CSE] or grad student or instr consent",
    "prereq": {
      "and": [
        "003335",
        "004236",
        "004707"
      ]
    }
  },
  {
    "uid": "016824",
    "code": "CEGE4301",
    "subject": "CEGE",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Soil Mechanics II",
    "fullname": "Soil Mechanics II",
    "info": "Traction and stress. Mohr-Coulomb failure criterion. Experiments on soil strength. Earth pressure theories, rigid/flexible retaining walls. Stability of slopes. Bearing capacity of foundations.\n\nprereq: CEGE 3301, upper div CSE, or instr consent",
    "prereq": {
      "or": [
        "004236"
      ]
    }
  },
  {
    "uid": "004251",
    "code": "CEGE4311",
    "subject": "CEGE",
    "number": "4311",
    "honors": false,
    "writing": false,
    "name": "Rock Mechanics",
    "fullname": "Rock Mechanics",
    "info": "Site investigation/classification. In-situ stresses. Strength/failure criteria of rock/interfaces. Stereographic projections. Kinematic analysis of rock slopes. Block size/stability. Reinforcement. Methods of stress analysis.  Pillar design, stiffness effects. Elastoplastic analysis. Rock-support interaction. Numerical modeling of support systems. Lab testing of rock.prereq: CEGE 3301 or instr consent",
    "prereq": {
      "or": [
        "004236"
      ]
    }
  },
  {
    "uid": "003713",
    "code": "CEGE4351",
    "subject": "CEGE",
    "number": "4351",
    "honors": false,
    "writing": false,
    "name": "Groundwater Mechanics",
    "fullname": "Groundwater Mechanics",
    "info": "Shallow confined, unconfined, and sem-confined flows. Flow in two coupled aquifers separated by leaky layers. Transient flow. Flow toward wells. Streamlines/pathlines in two/three dimensions. Contaminant transport. Elementary computer modeling.\n\nprereq: CEGE 3101or BBE 2003, CEGE 3502 or BBE 3012, upper division",
    "prereq": {
      "or": [
        "817285",
        "005011",
        "806664"
      ]
    }
  },
  {
    "uid": "003717",
    "code": "CEGE4352",
    "subject": "CEGE",
    "number": "4352",
    "honors": false,
    "writing": false,
    "name": "Groundwater Modeling",
    "fullname": "Groundwater Modeling",
    "info": "Analytic element method. Mathematical/computer modeling of single/multiple aquifer systems. Groundwater recovery. Field problems. Theory/application of simple contaminant transport models, including capture zone analysis.\n\nprereq: 4351, upper div CSE or grad student or instr consent",
    "prereq": {
      "or": [
        "003713"
      ]
    }
  },
  {
    "uid": "007348",
    "code": "CEGE4401",
    "subject": "CEGE",
    "number": "4401",
    "honors": false,
    "writing": false,
    "name": "Steel Concrete Design",
    "fullname": "Steel and Reinforced Concrete Design",
    "info": "Limit-states design. Steel: tension, compression, flexure, combined compression/flexure, connections. Reinforced concrete: beams (rectangular, T-sections, doubly reinforced) in flexure/shear, one-way slabs, serviceability, development length, reinforcement detailing, short columns.\n\nprereq: Grade of at least C- in 3401, concurrent registration is required (or allowed) in  3402, [upper div CSE or grad student]",
    "prereq": {
      "and": [
        "004479",
        "004707"
      ]
    }
  },
  {
    "uid": "004478",
    "code": "CEGE4411",
    "subject": "CEGE",
    "number": "4411",
    "honors": false,
    "writing": false,
    "name": "Matrix Structural Analysis",
    "fullname": "Matrix Structural Analysis",
    "info": "Analysis of elastic linear plane and three-dimensional structures such as bars, shafts, beams, grids, and frames using the stiffness method. Introduction to computational strategies for modeling and analyzing structures using a matrix approach.\n\nprereq: CEGE 3101, CEGE 3401, upper div CSE or grad student or instr consent",
    "prereq": {
      "or": [
        "003324",
        "004479"
      ]
    }
  },
  {
    "uid": "004739",
    "code": "CEGE4412",
    "subject": "CEGE",
    "number": "4412",
    "honors": false,
    "writing": false,
    "name": "Reinforced Concrete II",
    "fullname": "Reinforced Concrete II",
    "info": "Advanced design of reinforced concrete structures: footings, retaining walls, columns with slenderness effects and biaxial loading, torsion, continuous systems, two-way floor systems.\n\nprereq: CEGE 4401, upper div CSE or instr consent; 4411 recommended",
    "prereq": {
      "or": [
        "007348",
        "004478"
      ]
    }
  },
  {
    "uid": "003749",
    "code": "CEGE4413",
    "subject": "CEGE",
    "number": "4413",
    "honors": false,
    "writing": false,
    "name": "Steel Design II",
    "fullname": "Steel Design II",
    "info": "Design of steel and composite steel/concrete structures, including composite beams, plate girders, beam-columns, connections and multi-story frames.\n\nprereq: CEGE 4401, upper div CSE or instr consent; 4411 recommended",
    "prereq": {
      "or": [
        "007348",
        "004478"
      ]
    }
  },
  {
    "uid": "819172",
    "code": "CEGE4416",
    "subject": "CEGE",
    "number": "4416",
    "honors": false,
    "writing": false,
    "name": "Sensors in Infrastructure",
    "fullname": "Sensors in Infrastructure",
    "info": "As sensors become part of practice in CEGE fields, an understanding of instrumentation and their application to engineering problems becomes essential. This course will highlight the interdisciplinary nature of using sensors in engineering applications and how previous coursework can be applied. The sensors covered will range from mechanical measurements (e.g. strain, displacement, and acceleration) to environmental measurements (e.g. temperature, oxygen concentration, and wind speed), and non-destructive techniques. In addition to class lectures, instruments and data acquisition will be explored in lab experiments.\nPrerequisites: CEGE 3402, AEM 3031, CSE Upper division or instructor consent",
    "prereq": {}
  },
  {
    "uid": "819803",
    "code": "CEGE4417",
    "subject": "CEGE",
    "number": "4417",
    "honors": false,
    "writing": false,
    "name": "Str Eng. Design of Wood Bldgs.",
    "fullname": "Structural Engineering Design of Wood Buildings",
    "info": "This course provides an in-depth presentation of topics in the design of wood structures. The course is intended for advanced undergraduate and entering graduate students. Topics covered in the course include: wood properties and grading; building codes and technologies; loading and design criteria for beams, columns, trusses, and wall and floor panels; and connections for wood structures.\n\nprereqs: CEGE 3401 or equivalent, upper division CSE or grad student, or instructor consent",
    "prereq": {
      "or": [
        "004479"
      ]
    }
  },
  {
    "uid": "003486",
    "code": "CEGE4501",
    "subject": "CEGE",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Hydrologic Design",
    "fullname": "Hydrologic Design",
    "info": "Hydrologic cycle: precipitation, evaporation, infiltration runoff. Flood routing through rivers and reservoirs. Statistical analysis of hydrologic data and estimation of design flows. Open channel flow, flow through conduits. Detention basin design, hydraulic structure sizing, estimation of risk of flooding.\n\nprereq: CEGE 3502",
    "prereq": {
      "and": [
        "005011"
      ]
    }
  },
  {
    "uid": "004553",
    "code": "CEGE4502",
    "subject": "CEGE",
    "number": "4502",
    "honors": false,
    "writing": false,
    "name": "Water and Wastewater Treatment",
    "fullname": "Water and Wastewater Treatment",
    "info": "Theory and design of physical, chemical, and biological processes for the treatment of water and wastewater.\n\nprereq: CEGE 3501 or ChEn 2001 or BBE 3033",
    "prereq": {
      "or": [
        "004226",
        "008635",
        "799866"
      ]
    }
  },
  {
    "uid": "004228",
    "code": "CEGE4511",
    "subject": "CEGE",
    "number": "4511",
    "honors": false,
    "writing": false,
    "name": "Hydraulic Structures",
    "fullname": "Hydraulic Structures",
    "info": "Hydraulic design procedures for culverts, dams, spillways, outlet works, and river control works. Drop structures, water intakes, bridge crossings. prereq: CEGE 4501, upper division CSE student, Grad student or instructor consent",
    "prereq": {
      "or": [
        "003486"
      ]
    }
  },
  {
    "uid": "004164",
    "code": "CEGE4512",
    "subject": "CEGE",
    "number": "4512",
    "honors": false,
    "writing": false,
    "name": "Open Channel Hydraulics",
    "fullname": "Open Channel Hydraulics",
    "info": "Theories of flow in open channels, including gradually varied and rapidly varied flows, steady and unsteady flows. Computational methods for unsteady open channel flows, applications to flood routing. Introduction to moveable bed mechanics.",
    "prereq": {}
  },
  {
    "uid": "819094",
    "code": "CEGE4513",
    "subject": "CEGE",
    "number": "4513",
    "honors": false,
    "writing": false,
    "name": "Energy Conversions",
    "fullname": "Energy Conversion from Wind Hydro and Solar Resources",
    "info": "During this class the physical principles of energy conversion from alternative resources as wind, hydro and solar will be  presented and discussed, with an emphasis on fluid mechanics and geophysical flows (atmospheric boundary layer, rivers, tidal flows).\n\nWe will start with the resource assessment devoted to quantify the available energy in the environment (wind, rivers, and sun).  Each energy resource module will include basic economic principles and assumption enabling the quantification of the efficiency and the costs of energy transformation, as well as an estimate of environmental effects (when possible). \nWe will focus on the details on wind, streams, wave and solar power using conservation equations and basic principles of  thermodynamics and fluid mechanics.\n\nprereqs: CEGE 3502 or equivalent",
    "prereq": {
      "or": [
        "005011"
      ]
    }
  },
  {
    "uid": "820537",
    "code": "CEGE4515",
    "subject": "CEGE",
    "number": "4515",
    "honors": false,
    "writing": false,
    "name": "Remote Sensing of Env. & Water",
    "fullname": "Remote Sensing of Environment and Water Resources",
    "info": "The course presents fundamentals of probability theory, statistical learning, and physics of remote sensing to increase understanding and technical knowledge of undergraduate and graduate students about Earth data analysis and remote sensing.   \n\nprereq: Recommended (CEGE 3102, Stat 3021 or equivalent, CEGE 4501) ",
    "prereq": {
      "or": [
        "795303",
        "001622",
        "003486"
      ]
    }
  },
  {
    "uid": "827097",
    "code": "CEGE4516",
    "subject": "CEGE",
    "number": "4516",
    "honors": false,
    "writing": false,
    "name": "Stream Mechanics",
    "fullname": "Stream Mechanics",
    "info": "Streams are the principle means for the delivery of the water, sediments, and nutrients that are required to sustain life on the Earth's surface. This course discusses the fundamental mechanisms that drive physical transport processes in streams, the role of these physical processes in the stream ecosystem functions, as well as the impacts of biota on these physical processes. The specific topics include open channel flow, sediment transport, channel geomorphology, groundwater flow, and the advection and diffusion of nutrients and pollutants. We will also briefly discuss how these physical processes impact stream ecological functions and how biota impacts these physical processes. In addition, we will briefly discuss current ways to restore streams, especially methods to increase channel stability. \n\nprereq: CEGE 2374 or equivalent",
    "prereq": {}
  },
  {
    "uid": "815463",
    "code": "CEGE4522",
    "subject": "CEGE",
    "number": "4522",
    "honors": false,
    "writing": false,
    "name": "Review of Intro Fluid Mechs",
    "fullname": "Review of Introductory Fluid Mechanics for Graduate Students",
    "info": "Fluid statics/dynamics. Kinematics of fluid flow, equations of motion, pressure-velocity relationships, viscous effects, boundary layers.  Momentum/energy equations. Lift/drag. Flow in pipes and pipe systems.  Hydraulic machinery. Fluid measurements",
    "prereq": {}
  },
  {
    "uid": "004822",
    "code": "CEGE4561",
    "subject": "CEGE",
    "number": "4561",
    "honors": false,
    "writing": false,
    "name": "Solids and Hazardous Wastes",
    "fullname": "Solids and Hazardous Wastes",
    "info": "This course will serve as an introduction to the topics of solid and hazardous waste management. Classes will incorporate information about prevention, treatment options, and the regulations surrounding solid and hazardous waste. They will also provide an opportunity to observe different methods of waste treatment in action.",
    "prereq": {}
  },
  {
    "uid": "004550",
    "code": "CEGE4562",
    "subject": "CEGE",
    "number": "4562",
    "honors": false,
    "writing": false,
    "name": "Remediation Technologies",
    "fullname": "Environmental Remediation Technologies",
    "info": "Theory and application of current and emerging technologies used to remediate contaminated soil and groundwater. \n\npreq: CEGE 3501, Upper division CSE or graduate student or instructor consent",
    "prereq": {}
  },
  {
    "uid": "819118",
    "code": "CEGE4563",
    "subject": "CEGE",
    "number": "4563",
    "honors": false,
    "writing": false,
    "name": "Pollutant Fate and Transport",
    "fullname": "Pollutant Fate and Transport: Processes and Modeling",
    "info": "This course will focus on understanding the processes that dictate chemical and biological fate in surface waters, including air-water transfer, adsorption, and biological and abiotic degradation. Students will evaluate the kinetics of these processes by interpreting experimental data. They will also characterize transport in surface waters by building theoretical and computational models from scratch that incorporate advection, diffusion, and dispersion transport processes. Students will use ideal and non-ideal reactor theory to develop finite difference solutions to advection-diffusion-reaction equations to describe the ultimate fate of pollutants in surface water systems such as rivers, lakes, and estuaries. Fate and transport of organic pollutants (such as pesticides and pharmaceuticals), biochemical oxygen demand, and nutrient pollution will be studied.\n\nprereqs: CEGE 3101, CEGE 3501, or instructor consent",
    "prereq": {
      "or": [
        "003324",
        "004226"
      ]
    }
  },
  {
    "uid": "818816",
    "code": "CEGE4581",
    "subject": "CEGE",
    "number": "4581",
    "honors": false,
    "writing": false,
    "name": "Dsgn Sustainable Dvlpmnt India",
    "fullname": "Design for Sustainable Development - India",
    "info": "In this interdisciplinary course in Bangalore (India's fast-growing mega-city and entrepreneurship hub) you will work in teams with local partners to research and design sustainable solutions to development challenges of water, energy, waste, agriculture, transportation, and health. \n\nprereq: Open to Junior/Seniors with min. 3.0 GPA.",
    "prereq": {}
  },
  {
    "uid": "819774",
    "code": "CEGE4582",
    "subject": "CEGE",
    "number": "4582",
    "honors": false,
    "writing": false,
    "name": "Field Methods in Water Quality",
    "fullname": "Field Methods in Water Quality: Norway",
    "info": "This course will explore various aspects of water quality while visiting Norway.  The first week will cover the water quality of streams and of stormwater.  The second week will cover the water quality of lakes.  The third week will cover drinking water and its treatment as well as municipal wastewater and its treatment.  This course will be a combination of ‘field course’ and ‘laboratory course’ . This course is considered “hands-on” in that the students will make water quality and other measurements in the field, collect water samples, and perform laboratory analyses on those collected samples. The location of the course will be in/near Trondheim, Norway for weeks 1 and 3 and at the Sletvik field station for week 2.  Students will be required to submit three laboratory reports, one for each week of the course.\n\nPrereq: (CHEM 1061, CHEM 1065) or equivalent",
    "prereq": {}
  },
  {
    "uid": "818597",
    "code": "CEGE4583",
    "subject": "CEGE",
    "number": "4583",
    "honors": false,
    "writing": false,
    "name": "Design for Life: Water in Tanz",
    "fullname": "Design for Life: Water in Tanzania",
    "info": "Teams will evaluate community needs and infrastructure to design potable water-handling systems in rural Tanzania, typically off the power grid. Fluid mechanics: complex distribution networks, system losses, pump selection, borehole development; field measurements. Designs must address Tanzanian design guidelines.",
    "prereq": {}
  },
  {
    "uid": "015935",
    "code": "CEGE5",
    "subject": "CEGE",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "Refresher Course Civil Engrs",
    "fullname": "Refresher Course for Civil Engineers",
    "info": "Review of civil engineering fundamentals required to pass the Minnesota Professional Engineering Examination in civil engineering.\n\nprereq: BCE or equivalent degree or completion of Parts I and II of the State Board Examination",
    "prereq": {}
  },
  {
    "uid": "791916",
    "code": "CEGE5094",
    "subject": "CEGE",
    "number": "5094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Special studies in the planning, design, or analysis of civil, environmental, and geo- engineering systems. Individual lab research problems, literature studies, reports. Supervised by staff. \n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "790674",
    "code": "CEGE5180",
    "subject": "CEGE",
    "number": "5180",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Topics vary depending on faculty and student interests.\n\nprereq: upper division undergraduate, graduate student, or instructor consent",
    "prereq": {}
  },
  {
    "uid": "003340",
    "code": "CEGE5211",
    "subject": "CEGE",
    "number": "5211",
    "honors": false,
    "writing": false,
    "name": "Hwy Design & Traffic Operation",
    "fullname": "Highway Design & Traffic Operations",
    "info": "Principles of vehicle/driver performance as they apply to design and operation of highways. Highway alignment and roadside design. Intersection design and traffic control devices. Capacity/level of service. Trip generation and traffic impact analysis. Safety studies and safety impacts of design and operational decisions.\n\nprereq: CEGE 3201, CEGE 3102 or equivalent, Grad Student",
    "prereq": {
      "or": [
        "003335",
        "795303"
      ]
    }
  },
  {
    "uid": "003341",
    "code": "CEGE5212",
    "subject": "CEGE",
    "number": "5212",
    "honors": false,
    "writing": false,
    "name": "Trans. Policy, Plan., & Deploy",
    "fullname": "Transportation Policy, Planning, and Deployment",
    "info": "Techniques of analysis and planning for transportation services. Demand-supply interactions. Evaluating transportation alternatives. Travel demand forecasting. Integrated model systems. Citizen participation in decision-making.\n\nprereq: 3201 or equiv, upper division CSE, or grad student",
    "prereq": {
      "or": [
        "003335"
      ]
    }
  },
  {
    "uid": "809773",
    "code": "CEGE5213",
    "subject": "CEGE",
    "number": "5213",
    "honors": false,
    "writing": false,
    "name": "Transit Planning/Mgmt",
    "fullname": "Transit Planning and Management",
    "info": "Principles/techniques related to transit systems. Historical perspective, characteristics of travel demand, demand management. Evaluating/benchmarking system performance. Transit-oriented development. Analyzing alternative transit modes. System design/finance. Case studies, field projects.\n\nprereq: Upper Division CE, EnvE, or GeoE student, CE or GeoE grad student, or instructor consent",
    "prereq": {}
  },
  {
    "uid": "790034",
    "code": "CEGE5214",
    "subject": "CEGE",
    "number": "5214",
    "honors": false,
    "writing": false,
    "name": "Infrastructure Systems Eng.",
    "fullname": "Infrastructure Systems Engineering",
    "info": "Systems approach, its application to transportation engineering/planning. Prediction of flows and level of service. Production functions, cost optimization, utility theory, demand modeling, transportation network analysis, equilibrium assignment, decision analysis, multidimensional evaluation of transportation projects.\n\nprereq: Math 2373 or equivalent, Math 2263 or equivalent. CEGE 3101 or equivalent, CEGE 3102 or eqiuvalent, CEGE graduate student or instructors consent.",
    "prereq": {
      "or": [
        "003694",
        "000282",
        "003324",
        "795303"
      ]
    }
  },
  {
    "uid": "825702",
    "code": "CEGE5219",
    "subject": "CEGE",
    "number": "5219",
    "honors": false,
    "writing": false,
    "name": "Air Transportation Systems",
    "fullname": "Air Transportation Systems",
    "info": "This course provides an overview of the civil air transportation system design and operations. After completing this course, you should be able to  describe the operations of civil transport aircraft from the pilot and company, and air traffic control perspectives; conduct basic economic analysis on airline operations and demand; conduct capacity analysis for airspace and airports; and conduct basic optimization for air transportation operations. This course will prepare students for working with the civil aviation industry.",
    "prereq": {}
  },
  {
    "uid": "802808",
    "code": "CEGE5253",
    "subject": "CEGE",
    "number": "5253",
    "honors": false,
    "writing": false,
    "name": "Asphalt and Portland Cement",
    "fullname": "Asphalt and Portland Cement Concrete Materials",
    "info": "Cement chemistry. Materials for and design of Portland cement concrete mixtures. Mixture design, short-/long-term behavior. Admixtures, fiber reinforcement. Effects of proportionment. Bituminous materials. Asphalt cement, rheology, emulsions, chip seals, hot mix asphalt, viscoelastic characterization.\n\nprereq: [3402, upper div CSE] or grad student or instr consent",
    "prereq": {
      "and": [
        "004707"
      ]
    }
  },
  {
    "uid": "790035",
    "code": "CEGE5341",
    "subject": "CEGE",
    "number": "5341",
    "honors": false,
    "writing": false,
    "name": "Wave Methods",
    "fullname": "Wave Methods for Nondestructive Testing",
    "info": "Introduction to contemporary methods for nondestructive characterization of objects of civil infrastructure (e.g., highways, bridges, geotechnical sites). Imaging technologies based on propagation of elastic waves such as ultrasonic/resonant frequency methods, seismic surveys, and acoustic emission monitoring. Lectureprereq: [AEM 2021, AEM 3031] or instr consent",
    "prereq": {
      "and": [
        "004336",
        "004340"
      ]
    }
  },
  {
    "uid": "819747",
    "code": "CEGE5342",
    "subject": "CEGE",
    "number": "5342",
    "honors": false,
    "writing": false,
    "name": "Intro to Inverse Problems",
    "fullname": "Introduction to Inverse Problems",
    "info": " Introduction to principles and applications of the inverse problems theory -- the underpinning of model-driven data analytics. The course covers(i) basic ideas, (ii) mathematical foundation, (iii) discretization strategies, (iv) regularization techniques, (v) solution algorithms, and (vi) example problems. All advanced concepts, when recalled, are introduced in an intuitive engineering setting. The discussion, supported by ample numerical examples, focuses on the inversion of linear ``forward'' models. Numerical solutions are implemented in the Matlab environment, and make use of the regtools package that accompanies the textbook (P.C. Hansen, Discrete Inverse Problems -- Insight and Applications, SIAM, 2010). Prereqs: MATH 2243, MATH 2263, CEGE 3101 or equivalent ",
    "prereq": {}
  },
  {
    "uid": "792966",
    "code": "CEGE5351",
    "subject": "CEGE",
    "number": "5351",
    "honors": false,
    "writing": false,
    "name": "Advanced Engineering Math I",
    "fullname": "Advanced Engineering Mathematics I",
    "info": "Emphasizes skills relevant for civil, environmental, and geo- engineers. Mathematical principles explained in an engineering setting. Applications from various areas in civil, environmental, and geo- engineering.\n\nprereq: [ Math 2374 or equiv], upper division CSE student or grad student] or instr consent",
    "prereq": {
      "or": [
        "003695"
      ]
    }
  },
  {
    "uid": "004759",
    "code": "CEGE5411",
    "subject": "CEGE",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Appl Struct Mech",
    "fullname": "Applied Structural Mechanics",
    "info": "Principal Stresses and strain analysis; failure criteria. Introduction to plane elasticity, energymethods, torsion of beams, and bending of unsymmetrical beams. Introduction to structural dynamics and stability.\n\nprereq: AEM 3031, Upper div CSE or grad student or instr consent",
    "prereq": {
      "or": [
        "004340"
      ]
    }
  },
  {
    "uid": "004760",
    "code": "CEGE5414",
    "subject": "CEGE",
    "number": "5414",
    "honors": false,
    "writing": false,
    "name": "Prestressed Concrete Design",
    "fullname": "Prestressed Concrete Design",
    "info": "Design of prestressed concrete structures. Time dependent effects, behavior, flexure, shear, torsion, deflections, continuous systems.\n\nprereq: CEGE 4401, upper div CSE or grad student or instr consent",
    "prereq": {
      "or": [
        "007348"
      ]
    }
  },
  {
    "uid": "004761",
    "code": "CEGE5415",
    "subject": "CEGE",
    "number": "5415",
    "honors": false,
    "writing": false,
    "name": "Masonry Structures",
    "fullname": "Masonry Structures",
    "info": "Masonry materials and their production. Mortars, grouts. Design of unreinforced and reinforced masonry structural systems. Walls, columns, lintels. Codes/specifications, testing.\n\nprereq:  CEGE 4401, upper div CSE or grad student or instr consent",
    "prereq": {
      "or": [
        "007348"
      ]
    }
  },
  {
    "uid": "819095",
    "code": "CEGE5416",
    "subject": "CEGE",
    "number": "5416",
    "honors": false,
    "writing": false,
    "name": "Sensors in Infrastructure",
    "fullname": "Sensors in Infrastructure",
    "info": "As sensors become part of practice in CEGE fields, an understanding of instrumentation and their application to engineering problems becomes essential. This course will highlight the interdisciplinary nature of using sensors in engineering applications and how previous coursework can be applied. The sensors covered will range from mechanical measurements (e.g. strain, displacement, and acceleration) to environmental measurements (e.g. temperature, oxygen concentration, and wind speed), and non-destructive techniques. In addition to class lectures, instruments and data acquisition will be explored in lab experiments.\n\nprereq: CEGE 3402, AEM 3031",
    "prereq": {
      "and": [
        "004707",
        "004340"
      ]
    }
  },
  {
    "uid": "819804",
    "code": "CEGE5417",
    "subject": "CEGE",
    "number": "5417",
    "honors": false,
    "writing": false,
    "name": "Eng. Design of Wood Buildings",
    "fullname": "Structural Engineering Design of Wood Buildings",
    "info": "This course provides an in-depth presentation of topics in the design of wood structures. The course is intended for advanced undergraduate and entering graduate students. Topics covered in the course include wood properties and grading; building codes and technologies; loading and design criteria for beams, columns, trusses, and wall and floor panels; and connections for wood structures.\n\nprereq: CEGE 3401 or equivalent, upper division CSE or grad student, or instructor's consent",
    "prereq": {
      "or": [
        "004479"
      ]
    }
  },
  {
    "uid": "826930",
    "code": "CEGE5496",
    "subject": "CEGE",
    "number": "5496",
    "honors": false,
    "writing": false,
    "name": "Industrial Internship",
    "fullname": "Industrial Internship in Structural Engineering",
    "info": "The internship program aims to help students gain hands-on experience through involvement in real-world projects, which will facilitate their transition into a professional career. The internship spans a 15-week summer session, comprising 13 weeks of full-time work at a firm and two weeks dedicated to report writing. At the end of the internship, students will present their experiences to the CEGE department in a formal presentation session.\n\nprereq: CEGE graduate student, completion of at least one semester of coursework in the MS program; no other courses can be taken simultaneously.",
    "prereq": {}
  },
  {
    "uid": "805507",
    "code": "CEGE5511",
    "subject": "CEGE",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Urban Hydrology & Water Qualit",
    "fullname": "Urban Hydrology and Water Quality",
    "info": "Urban hydrology for small watersheds and the management of storm water quality and quantity.\n\nprereq: CEGE 4501or BBE 5513, upper division CSE or grad student or instructor consent",
    "prereq": {
      "or": [
        "004022"
      ]
    }
  },
  {
    "uid": "819096",
    "code": "CEGE5512",
    "subject": "CEGE",
    "number": "5512",
    "honors": false,
    "writing": false,
    "name": "Stochastic Ecohydrology",
    "fullname": "Stochastic Ecohydrology",
    "info": "This course will provide the theoretical and quantitative basis for understanding the interactions between the water cycle, vegetation, soil biogeochemistry, and the atmosphere. A main focus of the course will be on modeling the water and carbon dynamics across the soil-plant-atmosphere system. We will provide probabilistic descriptions of this system at the daily, seasonal, and interannual timescales by incorporating various sources of randomness and non-stationarity within the environment, particularly those from rainfall. These concepts and tools will be discussed in the context of sustainable management of water resources and terrestrial ecosystems, especially in view of the changes in the hydrological regime from climate change and societal pressures.\n\nprereq: MATH 2373, MATH 2374",
    "prereq": {
      "and": [
        "003694",
        "003695"
      ]
    }
  },
  {
    "uid": "819097",
    "code": "CEGE5513",
    "subject": "CEGE",
    "number": "5513",
    "honors": false,
    "writing": false,
    "name": "Energy Conversion",
    "fullname": "Energy Conversion from Wind, Hydro and Solar Resources",
    "info": "During this class the physical principles of energy conversion from alternative resources as wind, hydro and solar will be  presented and discussed, with an emphasis on fluid mechanics and geophysical flows (atmospheric boundary layer, rivers, tidal flows).\n\nWe will start with the resource assessment devoted to quantify the available energy in the environment (wind, rivers, and sun).  Each energy resource module will include basic economic principles and assumption enabling the quantification of the efficiency and the costs of energy transformation, as well as an estimate of environmental effects (when possible). \nWe will focus on the details on wind, streams, wave and solar power using conservation equations and basic principles of  thermodynamics and fluid mechanics.\n\nprereq: CEGE 3502 or equivalent",
    "prereq": {
      "or": [
        "005011"
      ]
    }
  },
  {
    "uid": "820304",
    "code": "CEGE5514",
    "subject": "CEGE",
    "number": "5514",
    "honors": false,
    "writing": false,
    "name": "Granular Physics",
    "fullname": "Granular Physics with Environmental and Engineering Applications",
    "info": "This class concerns ways in which relatively straightforward particle-scale phenomenology is directly related to larger-scale behaviors of concern to environmental and engineering processes.  These larger scale behaviors include pattern formation driven by cooperative sorting and advection dynamics.  They also include quasi-static and dynamic non-linear responses to stresses and other forcing.  Applications we discuss include particle transport in rivers, wetlands reclamation, pavement compaction, and industrial mixing.  \nAs many large-scale and small-scale phenemonelogy can be counter-intuitive without experience, the in-class work is supplemented by two sets of hand-on activities. (1) students will explore these phenomenology in physical laboratories and (2) students will explore details unattainable in the physical laboratory by modifying existing computational simulations. (e.g., behavior in zero gravity, chaotic particle pathways, small-scale structures in colloidal suspensions).  Minimal prior programming experience is expected.  Programming assignments will be designed to be flexible for students of all levels of such experience.\n\nPrereqs: Graduate student in CSE or permission of instructor and/or CEGE 3502, MATH 2373, MATH 2374",
    "prereq": {}
  },
  {
    "uid": "820495",
    "code": "CEGE5515",
    "subject": "CEGE",
    "number": "5515",
    "honors": false,
    "writing": false,
    "name": "Remote Sensing of Env. & Water",
    "fullname": "Remote Sensing of Environment and Water Resources",
    "info": "The course presents fundamentals of probability theory, statistical learning, and physics of remotes sensing to increase understanding and technical knowledge of undergraduate and graduate students about Earth data analysis and remote sensing.  \n\nPrereqs: CEGE 4501 is recommended",
    "prereq": {}
  },
  {
    "uid": "826885",
    "code": "CEGE5516",
    "subject": "CEGE",
    "number": "5516",
    "honors": false,
    "writing": false,
    "name": "Stream Mechanics",
    "fullname": "Stream Mechanics",
    "info": "Streams are the principal means for the delivery of the water, sediments, and nutrients that are required to sustain life on the Earth's surface. This course discusses the fundamental mechanisms that drive physical transport processes in streams, the role of these physical processes in the stream ecosystem functions, as well as the impacts of biota on these physical processes. The specific topics include open channel flow, sediment transport, channel geomorphology, groundwater flow, the advection and diffusion of nutrients and pollutants. We will also briefly discuss how these physical processes impact stream ecological functions and how biota impacts these physical processes. In addition, we will briefly discuss current ways to restore streams, especially methods to increase channel stability. \n\nprereq: Multivariate Calculus",
    "prereq": {}
  },
  {
    "uid": "827290",
    "code": "CEGE5524",
    "subject": "CEGE",
    "number": "5524",
    "honors": false,
    "writing": false,
    "name": "A Circularity Revolution",
    "fullname": "A Circularity Revolution: Working to Close the Loop on Global Issues",
    "info": "A Circularity Revolution: Working to Close the Loop on Global Issues is designed to provide students the fundamental knowledge and perspectives to develop and critique sustainable solutions for water, energy, and materials use, re-use, and upcycling from technological, policy, and cultural viewpoints. The class will focus on how each student's personal and disciplinary identities intersect with society’s needs and on creating a common vocabulary, grounding students in natural elemental cycles, differing perspectives on circularity and resource use, and the importance of the co-creation of solutions. Key foci are introducing experimental analytical strategies, and basic tools and mechanisms to achieve and interrogate circularity, such as principles of green engineering, lifecycle assessment, economic and policy tools, and after-progress narratives. Case studies, social practice art interventions, and a group project will be used to demonstrate how science and technology, policy, and expansive community/stakeholder knowledge all are important aspects of developing and re-conceptualizing sustainable solutions to problems in water, material, and energy use. The course compliments a new National Science Foundation-sponsored Research Trainee Program with a circularity theme.\n\nprereq: grad student or upper division CSE  undergraduate student",
    "prereq": {}
  },
  {
    "uid": "004559",
    "code": "CEGE5541",
    "subject": "CEGE",
    "number": "5541",
    "honors": false,
    "writing": false,
    "name": "Environmental Water Chemistry",
    "fullname": "Environmental Water Chemistry",
    "info": "Introduction to water chemistry. Physical chemical principles, geochemical processes controlling chemical composition of waters, behavior of contaminants that affect the suitability of water for beneficial uses.\n\nprereq: CEGE 3501, Chem 1061, Chem 1062 or Chem 1071H/1072H, upper division CSE or grad student or instructor consent",
    "prereq": {
      "or": [
        "004226",
        "807753",
        "807756"
      ]
    }
  },
  {
    "uid": "790036",
    "code": "CEGE5542",
    "subject": "CEGE",
    "number": "5542",
    "honors": false,
    "writing": false,
    "name": "Experimental Meth Env Eng",
    "fullname": "Experimental Methods in Environmental Engineering",
    "info": "Tools necessary to conduct research in environmental engineering and chemistry. Theory of operation of analytical equipment. Sampling and data handling methods, statistical analyses, experimental design, laboratory safety. Lecture, laboratory.\n\nprereq: CEGE 3501, (CEGE 5541 recommended) Chem 1022, upper division CSE or grad student or instructor consent",
    "prereq": {
      "or": [
        "004226",
        {
          "and": [
            "004559"
          ]
        },
        "002385"
      ]
    }
  },
  {
    "uid": "809281",
    "code": "CEGE5543",
    "subject": "CEGE",
    "number": "5543",
    "honors": false,
    "writing": false,
    "name": "Intro Enviro Fluid Mechanics",
    "fullname": "Introductory Environmental Fluid Mechanics",
    "info": "In Environmental Fluid Mechanics, we study the movement and changes of pollutants and nutrients in water systems. Our focus is on quantifying transport from microscopic to watersheds scales. The overall goal is to develop physically-based knowledge of fluid flow transport processes that mediate the fate of contaminants and nutrients in the environment. An understanding of mechanisms guides sustainable water quality management strategies. The topics covered encompass dimensional analysis, scaling, transport phenomena, flow, dispersion, and chemical/biological reactions, along with practical laboratory experience.\n\nprereq: Any undergraduate fluid mechanics course or consent of the instructor",
    "prereq": {}
  },
  {
    "uid": "004368",
    "code": "CEGE5551",
    "subject": "CEGE",
    "number": "5551",
    "honors": false,
    "writing": false,
    "name": "Enviromental Microbiology",
    "fullname": "Environmental Microbiology",
    "info": "Role of microorganisms in environmental bioremediation, pollution control, water/wastewater treatment, biogeochemistry, and human health. \n\nprereq: Upper div or grad student or instructor consent",
    "prereq": {}
  },
  {
    "uid": "803874",
    "code": "CEGE5552",
    "subject": "CEGE",
    "number": "5552",
    "honors": false,
    "writing": false,
    "name": "Enviromental Microbiology Lab",
    "fullname": "Environmental Microbiology Laboratory",
    "info": "Basic microbiological techniques: isolation, identification/enumeration of bacteria, BOD, biodegradable kinetics, disinfection. Lab.\n\nprereq: CEGE 5551 or concurrent registration is required (or allowed) in CEGE 5551",
    "prereq": {
      "or": [
        "004368"
      ]
    }
  },
  {
    "uid": "807922",
    "code": "CEGE5561",
    "subject": "CEGE",
    "number": "5561",
    "honors": false,
    "writing": false,
    "name": "Air Quality Engineering",
    "fullname": "Air Quality Engineering",
    "info": "Introduction to air pollution problems/solutions, local to global. Quantitative analysis of chemistry and physics of atmospheric pollutants. Sources, sinks, and controls; atmospheric transport and transformation; air quality management and regulation; health impacts; global issues.\n\nprereq: upper division in CSE, grad student or instructor consent",
    "prereq": {}
  },
  {
    "uid": "809398",
    "code": "CEGE5570",
    "subject": "CEGE",
    "number": "5570",
    "honors": false,
    "writing": false,
    "name": "Sustainable Development- India",
    "fullname": "Design for Sustainable Development - India",
    "info": "In this interdisciplinary course in Bangalore (India's fast-growing mega-city and entrepreneurship hub) you will work in teams with local partners to research and design sustainable solutions to development challenges of water, energy, waste, agriculture, transportation, and health. \n\nPrereqs: Open to graduate students from all majors",
    "prereq": {}
  },
  {
    "uid": "807923",
    "code": "CEGE5571",
    "subject": "CEGE",
    "number": "5571",
    "honors": false,
    "writing": false,
    "name": "Acara Global Venture Design",
    "fullname": "Acara Global Venture Design: Grand Challenges",
    "info": "Project-based course focused on designing venture solutions to global grand challenges related to environment, health, development. Identify specific social-environmental problem. Design financially-viable venture solution. Collaborate with professional mentors/technical experts. Create venture plan, may pitch for funding. Course is part of Acara program.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "809012",
    "code": "CEGE5572",
    "subject": "CEGE",
    "number": "5572",
    "honors": false,
    "writing": false,
    "name": "Acara Social Venture Launchpad",
    "fullname": "Acara Social Venture Launchpad: Ideas to Impact",
    "info": "Project-based Acara entrepreneurship course in which students refine existing venture solutions to social-environmental challenges. Students work on business model/develop effective pitch. Teams interact with entrepreneurs, investors/Acara staff.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "809045",
    "code": "CEGE5573",
    "subject": "CEGE",
    "number": "5573",
    "honors": false,
    "writing": false,
    "name": "Design for Sust Dev: CII",
    "fullname": "Design for Sustainable Development: Create II",
    "info": "Weekly discussion on social or environmental venture.",
    "prereq": {}
  },
  {
    "uid": "818216",
    "code": "CEGE5582",
    "subject": "CEGE",
    "number": "5582",
    "honors": false,
    "writing": false,
    "name": "Sustainable Dev - Nicaragua",
    "fullname": "Design for Sustainable Development - Nicaragua",
    "info": "His interdisciplinary course will introduce you to innovative approaches to complex sustainable development problems. You will work in teams to research and design solutions to real social and environmental challenges while living with host families and developing your intercultural competence. \n\nPrereq: Open to graduate students from all majors.",
    "prereq": {}
  },
  {
    "uid": "809046",
    "code": "CEGE5601",
    "subject": "CEGE",
    "number": "5601",
    "honors": false,
    "writing": false,
    "name": "Experiential Education Abroad",
    "fullname": "Experiential Education Abroad",
    "info": "Special engineering studies abroad. Studies/reports\nsupervised by staff.",
    "prereq": {}
  },
  {
    "uid": "003290",
    "code": "CEGE8022",
    "subject": "CEGE",
    "number": "8022",
    "honors": false,
    "writing": false,
    "name": "Num Meth Bound Prob",
    "fullname": "Numerical Methods for Free and Moving Boundary Problems",
    "info": "Examples of free and moving boundary problems: metal solidification, filling, polymer molding, flow in porous media, ground freezing. Solutions: analytical, fixed finite difference, fixed finite element, front tracking schemes, general deforming finite element methods.\n\nprereq: 8401 or instr consent",
    "prereq": {
      "or": [
        "004461"
      ]
    }
  },
  {
    "uid": "004680",
    "code": "CEGE8094",
    "subject": "CEGE",
    "number": "8094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Special studies in the planning, design, or analysis of civil, environmental, and geo- engineering systems. Individual lab research problems, literature studies, reports. Supervised by staff. \n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "791072",
    "code": "CEGE8200",
    "subject": "CEGE",
    "number": "8200",
    "honors": false,
    "writing": false,
    "name": "Seminar: Transportation",
    "fullname": "Seminar: Transportation",
    "info": "Content depends on instructor and student. Sample topics: traffic safety, traffic flow theory, transportation materials, transportation planning, transportation economics.",
    "prereq": {}
  },
  {
    "uid": "798100",
    "code": "CEGE8202",
    "subject": "CEGE",
    "number": "8202",
    "honors": false,
    "writing": false,
    "name": "Transportation/Land Use/Design",
    "fullname": "Networks and Places: Transportation, Land Use, and Design",
    "info": "Relationship between land use and transportation. Developing synthetic design skills for linking land use transportation in urban/regional settlements. Economic, political, legal, institutional frameworks for planning. Parallel computer lab, practicum assignment.",
    "prereq": {}
  },
  {
    "uid": "003640",
    "code": "CEGE8211",
    "subject": "CEGE",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Theory of Traffic Flow",
    "fullname": "Theory of Traffic Flow",
    "info": "Definitions/measurements of basic traffic flow parameters, fundamental relationships. Macroscopic continuum and microscopic traffic flow models. Schockwaves and applications. Flow, speed, headway, and other statistical distributions of traffic parameters. Gap availability/acceptance. Simulation of traffic flow. Traffic control theory, queuing theory, applications.",
    "prereq": {}
  },
  {
    "uid": "003641",
    "code": "CEGE8212",
    "subject": "CEGE",
    "number": "8212",
    "honors": false,
    "writing": false,
    "name": "Travel Demand",
    "fullname": "Advanced Travel Demand Modeling and Supply Analysis",
    "info": "Application of random utility theory to model travel demand; deterministic and stochastic trip assignment; network design problems; transportation planning software.\n\nprereq: 5211 or equiv, Stat 3021",
    "prereq": {
      "or": [
        "003340",
        "001622"
      ]
    }
  },
  {
    "uid": "791998",
    "code": "CEGE8213",
    "subject": "CEGE",
    "number": "8213",
    "honors": false,
    "writing": false,
    "name": "Adv Trans Technologies Seminar",
    "fullname": "Advanced Transportation Technologies Seminar",
    "info": "Advanced technologies specifically related to transportation. Topics drawn from core science/technology areas of human factors, intelligent vehicles, traffic modeling/management, sensing, communications, and controls.",
    "prereq": {}
  },
  {
    "uid": "789299",
    "code": "CEGE8214",
    "subject": "CEGE",
    "number": "8214",
    "honors": false,
    "writing": false,
    "name": "Transportation Economics",
    "fullname": "Transportation Economics",
    "info": "Application of microeconomic theory to transportation. Demand/demand estimation, cost/cost estimation, pricing/investment, regulation/deregulation.  Urban/intercity passenger transportation, freight transportation.",
    "prereq": {}
  },
  {
    "uid": "003644",
    "code": "CEGE8215",
    "subject": "CEGE",
    "number": "8215",
    "honors": false,
    "writing": false,
    "name": "Trans. Data Analysis",
    "fullname": "Transportation Data Analysis",
    "info": "Maximum likelihood methods for generalized linear models, with logit/probit models. Linear regression as special cases. Applications to gap acceptance, discrete choice, speed/headway distributions, accident modeling. Introduction to Bayesian inference.\n\nprereq: [8210 or 8211], [STAT 5021 or equiv]",
    "prereq": {
      "and": [
        {
          "or": [
            "003640"
          ]
        },
        {
          "or": [
            "001624"
          ]
        }
      ]
    }
  },
  {
    "uid": "793072",
    "code": "CEGE8216",
    "subject": "CEGE",
    "number": "8216",
    "honors": false,
    "writing": false,
    "name": "Urban Traffic Ops",
    "fullname": "Urban Traffic Operations",
    "info": "Capacity analysis techniques for urban streets, optimal traffic signal timing, coordination, real time control. Traffic signal hardware, including detectors/controllers. Operational techniques for traffic management. Use of computer program packages in traffic engineering practice. Freeway operations/control.",
    "prereq": {}
  },
  {
    "uid": "799981",
    "code": "CEGE8217",
    "subject": "CEGE",
    "number": "8217",
    "honors": false,
    "writing": false,
    "name": "Transportation Network",
    "fullname": "Transportation Network Analysis",
    "info": "Concepts/tools for transportation system and network analysis. Analytical models, algorithms for formation/solution of equilibrium assignment problem for transportation networks. Static/dynamic user equilibrium traffic assignments. System optimal, stochastic user equilibrium, traffic paradox.  Linear/nonlinear programming, variational inequalities.",
    "prereq": {}
  },
  {
    "uid": "817883",
    "code": "CEGE8218",
    "subject": "CEGE",
    "number": "8218",
    "honors": false,
    "writing": false,
    "name": "Dynamic Transportation Network",
    "fullname": "Dynamic Transportation Network Analysis",
    "info": "Dynamic traffic assignment and its history as an extension to static traffic assignment. Issues related to traffic flow propagation and time-dependent travel times. Dynamic user equilibrium Variational Inequalities. Analytic and simulation-based DTA models. Dynamic transit assignment on schedule-based networks. Hyperpaths, stochastic route choice, and capacity constraints in transit networks. Introduction to activity-based modeling. Time-space prisms, activity-travel scheduling.\n\nprereqs: CEGE 5214 or IE 5531, CEGE 8217 recommended",
    "prereq": {
      "or": [
        "790034",
        "005533",
        "799981"
      ]
    }
  },
  {
    "uid": "004366",
    "code": "CEGE8231",
    "subject": "CEGE",
    "number": "8231",
    "honors": false,
    "writing": false,
    "name": "Adv Pvmt Engrg",
    "fullname": "Advanced Pavement Engineering",
    "info": "Advanced concepts in pavement analysis and design; computation of stresses and strains in flexible and rigid pavement systems; review of Boussinesq theory, Burmeister model, and Westergaard model; load transfer in rigid pavements; temperature induced stresses; mechanics of drainage.\n\nprereq: 4231 or instr consent",
    "prereq": {}
  },
  {
    "uid": "791073",
    "code": "CEGE8233",
    "subject": "CEGE",
    "number": "8233",
    "honors": false,
    "writing": false,
    "name": "Adv Bit Matls",
    "fullname": "Advanced Bituminous Materials Characterization",
    "info": "Applications of viscoelasticity, rheology, elastoplasticity, and fracture mechanics to bituminous materials characterization. Lectures, discussions of advanced research reading assignments, laboratory assignments.\n\nprereq: [3402, grad student] or instr consent",
    "prereq": {
      "and": [
        "004707"
      ]
    }
  },
  {
    "uid": "008060",
    "code": "CEGE8300",
    "subject": "CEGE",
    "number": "8300",
    "honors": false,
    "writing": false,
    "name": "Seminar: Geomechanics",
    "fullname": "Seminar: Geomechanics",
    "info": "Presentations on various topics.",
    "prereq": {}
  },
  {
    "uid": "003762",
    "code": "CEGE8301",
    "subject": "CEGE",
    "number": "8301",
    "honors": false,
    "writing": false,
    "name": "Fracture Geomatls",
    "fullname": "Fracture of Geomaterials",
    "info": "Crack tip stress and displacement fields; stress intensity factors. Energy \nprinciples of fracture; compliance method. Process zone models. J integral. Mixed-mode fracture. Behavior of cracked solids. Numerical and experimental approaches.\n\nprereq: CSE grad student, 5321, GeoE 5321 or instr consent",
    "prereq": {}
  },
  {
    "uid": "005507",
    "code": "CEGE8302",
    "subject": "CEGE",
    "number": "8302",
    "honors": false,
    "writing": false,
    "name": "Soil Plasticity",
    "fullname": "Soil/Rock Plasticity and Limit Analysis",
    "info": "Plasticity of soils and rocks. Yield conditions, flow rules. Theorems of limit analysis. Static solutions, method of characteristics. Kinematic solutions, hodograph. Energy balance. Applications to soil/rock engineering problems.\n\nprereq: CSE grad student, CE 4300 or instr consent",
    "prereq": {}
  },
  {
    "uid": "003839",
    "code": "CEGE8311",
    "subject": "CEGE",
    "number": "8311",
    "honors": false,
    "writing": false,
    "name": "Adv Rock Mechanics",
    "fullname": "Advanced Rock Mechanics",
    "info": "Stress transformations; principal stresses and directions.  Friction and behavior of rock joints; stability of frictional sliding.  Elastic waves; acoustic emission and seismic measurements.  Fragmentation and rock breakage.\n\nprereq: CSE grad student, 4311 or GeoE 4311 or instr consent",
    "prereq": {
      "or": [
        "004251"
      ]
    }
  },
  {
    "uid": "005447",
    "code": "CEGE8321",
    "subject": "CEGE",
    "number": "8321",
    "honors": false,
    "writing": false,
    "name": "Thermoporoelasticit",
    "fullname": "Thermoporoelasticity",
    "info": "Micro-mechanical description of porous media. Thermodynamics foundations. Linear theory of thermoporoelasticity: constitutive, transport, and balance laws; field equations. Determination of material constants. Singular solutions. Methods of solution: integral transform, method of singularities, finite and boundary element method.\n\nprereq: CSE grad student, 5321 or GeoE 5321 or instr consent",
    "prereq": {}
  },
  {
    "uid": "005512",
    "code": "CEGE8322",
    "subject": "CEGE",
    "number": "8322",
    "honors": false,
    "writing": false,
    "name": "Granular Materials",
    "fullname": "Storage and Flow of Granular Materials",
    "info": "Plasticity of granular media.  Static and dynamic method of slices.  Storage and flow of granular materials in bins and hoppers.  Stress concentrations, arching, piping.  Experiments on granular material properties and flow.\n\nprereq: CSE grad student, 4301 or instr consent",
    "prereq": {
      "or": [
        "016824"
      ]
    }
  },
  {
    "uid": "008033",
    "code": "CEGE8331",
    "subject": "CEGE",
    "number": "8331",
    "honors": false,
    "writing": false,
    "name": "Model Geomech Proc",
    "fullname": "Modeling Geomechanical Processes",
    "info": "Data-limited nature of problems in geomechanics.  Dimensional analysis.  Regimes of solution.  Similarity of solutions.  Elements of fracture mechanics, elastoplasticity, poroelasticity.  Applications to stability of underground excavations, fluid flow in fracture, tool-rock interaction, hydraulic fracturing.\n\nprereq: CSE grad student, 5321 or GeoE 5321",
    "prereq": {}
  },
  {
    "uid": "788087",
    "code": "CEGE8333",
    "subject": "CEGE",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "008230",
    "code": "CEGE8336",
    "subject": "CEGE",
    "number": "8336",
    "honors": false,
    "writing": false,
    "name": "Boundary Elements I",
    "fullname": "Boundary Element Methods I",
    "info": "Introduction to boundary element methods for elastostatics; stress discontinuity, displacement discontinuity, and direct boundary integral methods.  Derivation of basic mathematical solutions from the theory of elasticity.  Applications in geomechanics.\n\nprereq: CSE grad student",
    "prereq": {}
  },
  {
    "uid": "008236",
    "code": "CEGE8337",
    "subject": "CEGE",
    "number": "8337",
    "honors": false,
    "writing": false,
    "name": "Boundary Element II",
    "fullname": "Boundary Element Methods II",
    "info": "Transient and nonlinear problems.\n\nprereq: 8336, GeoE 8336 or instr consent",
    "prereq": {
      "or": [
        "008230"
      ]
    }
  },
  {
    "uid": "016477",
    "code": "CEGE8341",
    "subject": "CEGE",
    "number": "8341",
    "honors": false,
    "writing": false,
    "name": "Wave Propagation in Solids",
    "fullname": "Wave Propagation in Solids and Structures",
    "info": "Fundamentals of wave propagation theory in elastic media. Wave dispersion and packet distortion. Waves in one-dimensional structural systems: rods and beams. Waves in two- and three-dimensional media. Guided waves, Rayleigh waves and Lamb waves. Waves in heterogeneous media. Application of wave methods to structural and material diagnostics. Experimental methods for wavefield measurements and characterization. Signal processing for wave feature extraction. Introduction to nonlinear wave propagation.\n\nprereq: Basic courses in soil machanics/dynamics or instr consent",
    "prereq": {}
  },
  {
    "uid": "004775",
    "code": "CEGE8351",
    "subject": "CEGE",
    "number": "8351",
    "honors": false,
    "writing": false,
    "name": "Advanced Engineering Math II",
    "fullname": "Advanced Engineering Mathematics II",
    "info": "Emphasizes skills relevant for civil, environmental, and geo-engineers. Mathematical principles are explained in an engineering setting, with applications chosen from deformable body mechanics, rock mechanics, soil mechanics, fluid mechanics, and groundwater flow. prereq: [MATH 2374 or equivalent], [CEGE 5351], [CSE grad student or instr consent]",
    "prereq": {
      "and": [
        {
          "or": [
            "003695"
          ]
        },
        {
          "and": [
            "792966"
          ]
        }
      ]
    }
  },
  {
    "uid": "004818",
    "code": "CEGE8352",
    "subject": "CEGE",
    "number": "8352",
    "honors": false,
    "writing": false,
    "name": "Adv Grndwtr Mech II",
    "fullname": "Advanced Groundwater Mechanics II",
    "info": "Applying complex methods, including conformal mapping, in groundwater mechanics; solving problems with free boundaries using the hodograph method; drains in aquifers with free boundaries; superposition of solutions with drains; singular Cauchy integrals; boundary elements.\n\nprereq: 4351, CSE grad student or instr consent",
    "prereq": {
      "or": [
        "003713"
      ]
    }
  },
  {
    "uid": "004476",
    "code": "CEGE8361",
    "subject": "CEGE",
    "number": "8361",
    "honors": false,
    "writing": false,
    "name": "Eng Model Fitting",
    "fullname": "Engineering Model Fitting",
    "info": "Parameter estimation and inverse modeling for civil and geological engineering. Formulating engineering model fitting problems; comparing and selecting various fit criteria; implementing numerical algorithms; analyzing and interpreting results using both statistical and qualitative tools; designing future measurement plans.\n\nprereq: CSE grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004475",
    "code": "CEGE8400",
    "subject": "CEGE",
    "number": "8400",
    "honors": false,
    "writing": false,
    "name": "Seminar: Structures",
    "fullname": "Seminar: Structures",
    "info": "Content depends on instructor and student. Sample topics: theory of elasticity, optimization, reliability, wave propagation, soil dynamics, experimental equipment, wind forces on structures, structural failures, modern construction practices.",
    "prereq": {}
  },
  {
    "uid": "004461",
    "code": "CEGE8401",
    "subject": "CEGE",
    "number": "8401",
    "honors": false,
    "writing": false,
    "name": "FundFiniteElemMeth",
    "fullname": "Fundamentals of Finite Element Method",
    "info": "Elements of calculus of variations; weak and strong formulations of linear continuum and structural problems.  Isoparametric elements and numerical integration. Basic concepts of error analysis and convergence.  Analysis of plates and shells.  Introduction to mixed methods and time dependent problems.\n\nprereq: 4411 or instr consent",
    "prereq": {
      "or": [
        "004478"
      ]
    }
  },
  {
    "uid": "004462",
    "code": "CEGE8402",
    "subject": "CEGE",
    "number": "8402",
    "honors": false,
    "writing": false,
    "name": "NonlFiniteElemAnal",
    "fullname": "Nonlinear Finite Element Analysis",
    "info": "Large strains and work conjugate stresses. Equilibrium and principle of virtual work for nonlinear problems. Nonlinear elasticity and plasticity.  Finite element discretization and nonlinear algebraic equations.  Linearization and solution algorithms for nonlinear problems. Structural stability.\n\nprereq: 8401 or instr consent; offered alt yrs",
    "prereq": {
      "or": [
        "004461"
      ]
    }
  },
  {
    "uid": "004463",
    "code": "CEGE8411",
    "subject": "CEGE",
    "number": "8411",
    "honors": false,
    "writing": false,
    "name": "Plate Structures",
    "fullname": "Plate Structures",
    "info": "Analysis of plate structures based on the small-deflection elastic Kirchhoff-Love theory. Classical and numerical analysis methods. Skew and orthotropic plate structures. Elements of large deflection theory and stability of plates.\n\nprereq: 5411 or instr consent; offered alt yrs",
    "prereq": {
      "or": [
        "004759"
      ]
    }
  },
  {
    "uid": "004464",
    "code": "CEGE8412",
    "subject": "CEGE",
    "number": "8412",
    "honors": false,
    "writing": false,
    "name": "Shell Structures",
    "fullname": "Shell Structures",
    "info": "Static analysis of thin elastic shells based on Love's postulates. Membrane and bending theories. Thermal stresses in cylinders. Buckling of shells of revolution. Offered alternate years.\n\nprereq: CSE grad or instr consent",
    "prereq": {}
  },
  {
    "uid": "810123",
    "code": "CEGE8413",
    "subject": "CEGE",
    "number": "8413",
    "honors": false,
    "writing": false,
    "name": "Fracture and Scaling",
    "fullname": "Fracture and Scaling",
    "info": "Linear elastic fracture mechanics, cohesive fracture, scaling, strength statistics.\n\nprereq: 5411",
    "prereq": {
      "and": [
        "004759"
      ]
    }
  },
  {
    "uid": "004227",
    "code": "CEGE8421",
    "subject": "CEGE",
    "number": "8421",
    "honors": false,
    "writing": false,
    "name": "Structural Dynamics",
    "fullname": "Structural Dynamics",
    "info": "Response of discrete/continuous systems to dynamic loading. Formulation/solution of problems of one or more degrees of freedom. Modal analysis. Numerical integration and transform techniques.  Response of dynamic systems to base motion using response spectrum methods.\n\nprereq: [3401, AEM 2012] or instr consent; concurrent registration is required (or allowed) in  4411 recommended",
    "prereq": {
      "or": [
        {
          "and": [
            "004479",
            "004334"
          ]
        },
        "004478"
      ]
    }
  },
  {
    "uid": "004229",
    "code": "CEGE8422",
    "subject": "CEGE",
    "number": "8422",
    "honors": false,
    "writing": false,
    "name": "Earthquake Engrg",
    "fullname": "Earthquake Engineering",
    "info": "Introduction to earthquake engineering; response spectra; energy absorption capacity of structures; estimation of damping; earthquake resistant design; seismic design codes; base isolation; soil-structure interaction. Blast resistant design. Wind effects on structures.\n\nprereq: 8421 or instr consent",
    "prereq": {
      "or": [
        "004227"
      ]
    }
  },
  {
    "uid": "004465",
    "code": "CEGE8431",
    "subject": "CEGE",
    "number": "8431",
    "honors": false,
    "writing": false,
    "name": "Structural Stability",
    "fullname": "Structural Stability",
    "info": "Classification of discrete/continuous conservative/nonconservative systems. Buckling analysis of, e.g., structural members, frameworks, and plates by classical/numerical methods. Offered alternate years.\n\nprereq: CSE grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004466",
    "code": "CEGE8432",
    "subject": "CEGE",
    "number": "8432",
    "honors": false,
    "writing": false,
    "name": "Thin-Walled Members",
    "fullname": "Analysis of Thin-Walled Members",
    "info": "Analysis of thin-walled structural members based on Vlasov theory and its modifications. Members with open and closed cross sections. Second-order effects and buckling. Influence of inelastic material behavior on buckling.\n\nprereq: 5411 or instr consent; offered alt yrs",
    "prereq": {
      "or": [
        "004759"
      ]
    }
  },
  {
    "uid": "004469",
    "code": "CEGE8441",
    "subject": "CEGE",
    "number": "8441",
    "honors": false,
    "writing": false,
    "name": "Ductile Beh of Steel Struct.",
    "fullname": "Ductile Behavior of Steel Structures",
    "info": "Advanced topics in behavior of steel structures; Modeling techniques for material/geometric nonlinearity. Plastic analysis. Introduction to plasticity of continuum bodies. Computer methods. Seismic design, code provisions.\n\nprereq: 4411 or eqiv",
    "prereq": {
      "or": [
        "004478"
      ]
    }
  },
  {
    "uid": "004470",
    "code": "CEGE8442",
    "subject": "CEGE",
    "number": "8442",
    "honors": false,
    "writing": false,
    "name": "Nonl Anal Struc Sys",
    "fullname": "Analysis of Structural Systems",
    "info": "Advanced theory and computational techniques for analyzing complex structural building systems. Using comprehensive geometric and material nonlinear analysis for designing steel and composite structures.\n\nprereq: CEGE 5411 or equivalent",
    "prereq": {
      "or": [
        "004759"
      ]
    }
  },
  {
    "uid": "790409",
    "code": "CEGE8443",
    "subject": "CEGE",
    "number": "8443",
    "honors": false,
    "writing": false,
    "name": "Materials/Structures Fracture",
    "fullname": "Fracture of Materials and Structures",
    "info": "Foundations of engineering fracture mechanics. Analytical, computational, and experimental tools to analyze/design solid structures and materials containing cracks.  Predicting structural performance, designing experiments. Metals, concretes, rocks, ceramics, advanced composites, biological structures, micro-devices.\n\nprereq: 4401 or instr consent",
    "prereq": {
      "or": [
        "007348"
      ]
    }
  },
  {
    "uid": "788326",
    "code": "CEGE8444",
    "subject": "CEGE",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "004472",
    "code": "CEGE8451",
    "subject": "CEGE",
    "number": "8451",
    "honors": false,
    "writing": false,
    "name": "Beh Reinf Concr Str",
    "fullname": "Behavior of Reinforced Concrete Structures",
    "info": "Advanced topics; experimental and theoretical background to design code provisions.  Moment-curvature analysis of members.  Shear; torsion; disturbed regions.  Beam column joints; shear walls.  Effects of earthquake loading. Limit analysis.\n\nprereq: 4412 or instr consent",
    "prereq": {
      "or": [
        "004739"
      ]
    }
  },
  {
    "uid": "004473",
    "code": "CEGE8461",
    "subject": "CEGE",
    "number": "8461",
    "honors": false,
    "writing": false,
    "name": "Struct Reliability",
    "fullname": "Structural Reliability",
    "info": "Structural design standards/methods. Uncertainties in structural design. Basic probabilistic concepts, statistical distributions. Resistance/load statistics. First-/second-order reliability methods, systems reliability. Development of probability-based design codes. Offered alternate years.\n\nprereq: [4412, 4413] or instr consent",
    "prereq": {
      "and": [
        "004739",
        "003749"
      ]
    }
  },
  {
    "uid": "004474",
    "code": "CEGE8490",
    "subject": "CEGE",
    "number": "8490",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics",
    "info": "Topics vary depending on faculty and student interests.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008340",
    "code": "CEGE8500",
    "subject": "CEGE",
    "number": "8500",
    "honors": false,
    "writing": false,
    "name": "Seminar: Environmental",
    "fullname": "Seminar: Environmental",
    "info": "Broad coverage of topics in environmental engineering and science. Speakers consist primarily of graduate students in these areas, but presentations may also be given by University faculty and guest speakers.\n\nprereq: grad CE major or instr consent",
    "prereq": {}
  },
  {
    "uid": "004532",
    "code": "CEGE8501",
    "subject": "CEGE",
    "number": "8501",
    "honors": false,
    "writing": false,
    "name": "Env Fl Mech I",
    "fullname": "Environmental Fluid Mechanics I",
    "info": "Basic laws of mass, energy, and momentum transport in environmental fluid flow.  Exact and approximate solutions for viscous flow.  Irrotational flow; gravity waves.  Similitude and inspectional analysis.  Laminar boundary layers and slender flows.  Application to engineering and environmental problems.\n\nprereq: 3502 or equiv or instr consent",
    "prereq": {
      "or": [
        "005011"
      ]
    }
  },
  {
    "uid": "004533",
    "code": "CEGE8502",
    "subject": "CEGE",
    "number": "8502",
    "honors": false,
    "writing": false,
    "name": "Env Fl Mech II",
    "fullname": "Environmental Fluid Mechanics II",
    "info": "Reynolds equations.  Developed and developing turbulent boundary layers and slender flows, and their interaction with inviscid flow.  Jets, plumes, wakes and shear layers.  Statistical description of turbulence; data analysis.\n\nprereq: 8501 or instr consent",
    "prereq": {
      "or": [
        "004532"
      ]
    }
  },
  {
    "uid": "003366",
    "code": "CEGE8503",
    "subject": "CEGE",
    "number": "8503",
    "honors": false,
    "writing": false,
    "name": "Envir Mass Tranpt",
    "fullname": "Environmental Mass Transport",
    "info": "Principles of intraphase and interfacial chemical transport and fate in the environment, specifically the processes of diffusion, dispersion, and convection. Application to surface water and atmospheric mixing, dispersion in groundwater, and transport between these media.\n\nprereq: 3502, 3501 or equiv or instr consent",
    "prereq": {
      "or": [
        "005011",
        "004226"
      ]
    }
  },
  {
    "uid": "008149",
    "code": "CEGE8504",
    "subject": "CEGE",
    "number": "8504",
    "honors": false,
    "writing": false,
    "name": "Unit Op Theory",
    "fullname": "Theory of Unit Operations",
    "info": "Theoretical basis, design, operation of chemical/physical processes used in treating/controlling water quality. Adsorption, ion exchange, sedimentation, thickening, filtration, gas transfer, coagulation, flocculation, membrane processes, disinfection.\n\nprereq: 5541",
    "prereq": {
      "and": [
        "004559"
      ]
    }
  },
  {
    "uid": "005082",
    "code": "CEGE8505",
    "subject": "CEGE",
    "number": "8505",
    "honors": false,
    "writing": false,
    "name": "Bio Processes",
    "fullname": "Biological Processes",
    "info": "Theoretical principles underlying chemical and biological wastewater treatment processes, including aerobic and anaerobic treatment for organic carbon and nutrient removal. Mathematical models of microbial growth kinetics and mass transport in suspended growth and attached film applications are developed.\n\nprereq: 4502, 4501 or instr consent",
    "prereq": {
      "or": [
        "004553",
        "003486"
      ]
    }
  },
  {
    "uid": "003394",
    "code": "CEGE8506",
    "subject": "CEGE",
    "number": "8506",
    "honors": false,
    "writing": false,
    "name": "Stochastic Hydrolog",
    "fullname": "Stochastic Hydrology",
    "info": "Analysis and synthesis of hydrologic series and systems; derived distributions; uncertainty and risk analysis; flood frequency analysis; multivariate time series analysis; correlation and spectral analysis; series of long-range dependence; linear estimation; geostatistics; sampling networks; hydrologic forecasting.\n\nprereq: Stat 3021 or equiv or instr consent",
    "prereq": {
      "or": [
        "001622"
      ]
    }
  },
  {
    "uid": "003399",
    "code": "CEGE8507",
    "subject": "CEGE",
    "number": "8507",
    "honors": false,
    "writing": false,
    "name": "Adv Mthds Hydrology",
    "fullname": "Advanced Methods in Hydrology",
    "info": "Notions of scale-invariance, scaling, and multiscaling in geophysical processes; methods of multiscale analysis; wavelet transforms; time-frequency-scale analysis and fractal analysis. Applications in atmospheric, hydrologic, and geomorphologic processes.\n\nprereq: 8506",
    "prereq": {
      "and": [
        "003394"
      ]
    }
  },
  {
    "uid": "789300",
    "code": "CEGE8508",
    "subject": "CEGE",
    "number": "8508",
    "honors": false,
    "writing": false,
    "name": "Eco Fluid Mech",
    "fullname": "Ecological Fluid Mechanics",
    "info": "Fluid mechanics of  microbiological processes in lakes, rivers, and wetlands. Small-scale fluid motion, nutrient uptake, growth kinetics, ecosystem metabolism, scaling, lab/field microstructure measurements.\n\nprereq: 3502 or equiv",
    "prereq": {
      "or": [
        "005011"
      ]
    }
  },
  {
    "uid": "004534",
    "code": "CEGE8511",
    "subject": "CEGE",
    "number": "8511",
    "honors": false,
    "writing": false,
    "name": "Sed Trans",
    "fullname": "Mechanics of Sediment Transport",
    "info": "Particle motion in fluids.  Criteria for incipient motion.  Formulations for bedload and suspended load.  Bedform mechanics and hydraulic resistance relations.  Channel stability, aggradation and degradation, alluvial stream morphology.\n\nprereq: 3502 and 4501 or instr consent",
    "prereq": {
      "or": [
        "005011",
        "003486"
      ]
    }
  },
  {
    "uid": "795183",
    "code": "CEGE8521",
    "subject": "CEGE",
    "number": "8521",
    "honors": false,
    "writing": false,
    "name": "Atmospheric Boundary Layer",
    "fullname": "The Atmospheric Boundary Layer",
    "info": "Land-atmosphere interactions and turbulent transport in the atmospheric boundary layer (ABL), the lowest part of the atmosphere. ABL development and dynamics. Turbulence, surface energy balance, spectral analysis, similarity theory. Flow over homogeneous and heterogeneous surfaces. Atmospheric stability, measurement, simulation of turbulent fluxes.\n\nprereq: CSE or COAFES grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004626",
    "code": "CEGE8541",
    "subject": "CEGE",
    "number": "8541",
    "honors": false,
    "writing": false,
    "name": "Aquatic Chem",
    "fullname": "Aquatic Chemistry",
    "info": "Advanced course on water chemistry; physical chemical principles and geochemical processes controlling the chemical composition of natural waters, soil- and sediment-water interactions.  Emphasizes behavior of inorganic contaminants in natural waters and engineered systems and dissolved natural organic matter.\n\nprereq: 4541 or instr consent",
    "prereq": {}
  },
  {
    "uid": "004647",
    "code": "CEGE8542",
    "subject": "CEGE",
    "number": "8542",
    "honors": false,
    "writing": false,
    "name": "Orgnc Pollutants Enviro Systms",
    "fullname": "Chemistry of Organic Pollutants in Environmental Systems",
    "info": "Structural characteristics and physico-chemical properties of organic contaminants in aquatic systems. Emphasizes PCBs, PAHs, dioxins, insecticides, herbicides, and chlorinated solvents. Factors affecting their transport/transformation. Structure- and property-activity relationships, their use in predicting organic chemical behavior. prereq: CEGE 5541 or instr consent",
    "prereq": {
      "or": [
        "004559"
      ]
    }
  },
  {
    "uid": "827168",
    "code": "CEGE8545",
    "subject": "CEGE",
    "number": "8545",
    "honors": false,
    "writing": false,
    "name": "Data Quality",
    "fullname": "Data Quality",
    "info": "Data Quality will examine the application of quality assurance and quality control fundamentals to engineering studies in the field, in the laboratory, and in modeling. The course material will be applicable to any study. Data quality considerations are important through the planning, data generation (field, laboratory, modeling), data organization, and data interpretation stages of a project. Practical questions and problems will be considered by in-class small groups and homework assignments. These problems will be largely based on real data sets. The class topics will include: data quality as a component of effective experiment design, measures of uncertainty for experimental and analytical data, data-quality considerations in the laboratory, data-quality considerations in the field, data-quality considerations in computational modeling, documentation for data quality, and data handling, data checks.",
    "prereq": {}
  },
  {
    "uid": "003720",
    "code": "CEGE8551",
    "subject": "CEGE",
    "number": "8551",
    "honors": false,
    "writing": false,
    "name": "Env Microb: Mol Theory & Meth",
    "fullname": "Environmental Microbiology: Molecular Theory and Methods",
    "info": "Introduction to microbial genetics and molecular phylogeny. Application of nucleic-acid techniques in environmental microbiology and microbial ecology.",
    "prereq": {}
  },
  {
    "uid": "003724",
    "code": "CEGE8552",
    "subject": "CEGE",
    "number": "8552",
    "honors": false,
    "writing": false,
    "name": "GW Microbiol:Lab",
    "fullname": "Groundwater Microbiology: Laboratory",
    "info": "Subsurface microbial ecology, biogeochemical cycling, metabolic classification of subsurface bacteria, modeling bacterial transport, diagnosis of microbial induced fouling (MIF) events, bioremediation of contaminated aquifers. Lectures and four lab hours per week.\n\nprereq: grad CE major or instr consent, exposure to basic environ engr and microbiol",
    "prereq": {}
  },
  {
    "uid": "016476",
    "code": "CEGE8553",
    "subject": "CEGE",
    "number": "8553",
    "honors": false,
    "writing": false,
    "name": "Biofilms",
    "fullname": "Biofilms",
    "info": "Science/engineering concepts to investigate formation/function of biofilms. Properties/composition of biofilms, transport/transformation processes in biofilms, communication in biofilms, mathematical modeling. Applications in environmental engineering.\n\nprereq: 4551 or instr consent",
    "prereq": {}
  },
  {
    "uid": "003369",
    "code": "CEGE8561",
    "subject": "CEGE",
    "number": "8561",
    "honors": false,
    "writing": false,
    "name": "Models Aquatic Env",
    "fullname": "Analysis and Modeling of Aquatic Environments I",
    "info": "Introduction to hydrologic transport and water quality simulation in natural water systems. Deterministic, process-oriented water quality model development. Mixed cell models, advection, turbulent diffusion/dispersion. Chemical/biological kinetics in water quality models. Application of water quality models to management problems.\n\nprereq: One sem grad work or instr consent",
    "prereq": {}
  },
  {
    "uid": "003380",
    "code": "CEGE8562",
    "subject": "CEGE",
    "number": "8562",
    "honors": false,
    "writing": false,
    "name": "Mod Aquatic Env II",
    "fullname": "Analysis and Modeling of Aquatic Environments II",
    "info": "Models for transport/transformation of pollutants, nutrients, particulates, ecosystems, etc., from recently completed theses, articles, or research in progress. Students review assigned recent papers, make presentations, and analyze a topic of their choice.\n\nprereq: One sem grad work or instr consent",
    "prereq": {}
  },
  {
    "uid": "015036",
    "code": "CEGE8563",
    "subject": "CEGE",
    "number": "8563",
    "honors": false,
    "writing": false,
    "name": "Ind Treat",
    "fullname": "Industrial Waste Treatment",
    "info": "Introduction to industrial waste treatment. Individual industries, emphasizing constituents of the waste-stream and how best to recycle, recover, or reduce wastes. Cost concerns and regulations. Field trips to various industries to gain first-hand knowledge of processes involved in treatment.\n\nprereq: 3501, 4501, 4502, or equiv or instr consent",
    "prereq": {
      "or": [
        "004226",
        "003486",
        "004553"
      ]
    }
  },
  {
    "uid": "008194",
    "code": "CEGE8571",
    "subject": "CEGE",
    "number": "8571",
    "honors": false,
    "writing": false,
    "name": "Hydr. Meas.",
    "fullname": "Hydraulic Measurements",
    "info": "Lab and field methods and instruments for measuring hydraulic pressure, velocity, and discharge.\n\nprereq: 3502 or instr consent",
    "prereq": {
      "or": [
        "005011"
      ]
    }
  },
  {
    "uid": "004166",
    "code": "CEGE8572",
    "subject": "CEGE",
    "number": "8572",
    "honors": false,
    "writing": false,
    "name": "Comp Env Fluid Dyn",
    "fullname": "Computational Environmental Fluid Dynamics",
    "info": "Finite difference methods, their application to solution of one-/two-dimensional problems in environmental fluid dynamics. Stability, convergence, consistency, and accuracy of numerical schemes. Navier-Stokes equations, their physical meaning, and their numerical solution. Turbulence modeling: RANS and LES.\n\nprereq: grad student in CSE or COAFES or instr consent",
    "prereq": {}
  },
  {
    "uid": "796637",
    "code": "CEGE8581",
    "subject": "CEGE",
    "number": "8581",
    "honors": false,
    "writing": false,
    "name": "Research Ethics, Env & Water",
    "fullname": "Research and Professional Ethics in Water Resources and Environmental Science",
    "info": "Ethics of water resources science and environmental engineering research/practice. Societal responsibility, plagiarism, recording-keeping, authorship, confidentiality, conflicts of interest, professional relationships, fraud, reporting misconduct. Meets during first eight weeks of spring semester.\n\nprereq: [Environmental engineering or water resource science] grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "799470",
    "code": "CEGE8601",
    "subject": "CEGE",
    "number": "8601",
    "honors": false,
    "writing": false,
    "name": "Stream Restoration",
    "fullname": "Introduction to Stream Restoration",
    "info": "Background material required to participate in a stream restoration project. How to assimilate geologic, hydrologic, and ecological data at watershed and reach scales to plan a restoration project and evaluate/critique existing stream restoration projects.",
    "prereq": {}
  },
  {
    "uid": "800168",
    "code": "CEGE8602",
    "subject": "CEGE",
    "number": "8602",
    "honors": false,
    "writing": false,
    "name": "Stream Restoration Practice",
    "fullname": "Stream Restoration Practice",
    "info": "Field experience, group design project. Students provide a stream restoration context for each other's elective coursework, complete critical assessments of stream restoration projects, and design a stream restoration site.\n\nprereq: CEGE 8601, or EEB 8601, or ESCI 8601 ",
    "prereq": {
      "or": [
        "799470",
        "800645",
        "800150"
      ]
    }
  },
  {
    "uid": "788451",
    "code": "CEGE8666",
    "subject": "CEGE",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {
      "or": [
        "015935"
      ]
    }
  },
  {
    "uid": "788578",
    "code": "CEGE8777",
    "subject": "CEGE",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {
      "or": [
        "015935"
      ]
    }
  },
  {
    "uid": "787837",
    "code": "CEGE8888",
    "subject": "CEGE",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {
      "or": [
        "015935"
      ]
    }
  }
]