[
  {
    "uid": "803078",
    "code": "CESP3901",
    "subject": "CESP",
    "number": "3901",
    "honors": false,
    "writing": false,
    "name": "Integrative Capstone Seminar",
    "fullname": "Community Engagement Scholars Program Integrative Capstone Seminar",
    "info": "This one-credit seminar is designed to complement the Integrative Community Engagement Project (ICEP) as a capstone experience for you as a Community Engagement Scholar. The seminar will provide tools, guidance, support, and structure to help you successfully complete your ICEP.  It will also provide opportunities for you to reflect on how your previous academic and community work have informed your ICEP, and how your experiences will inform and help prepare you for the next, post-graduation phase of your life. The first half of the semester will be focused primarily on project support, and the final half of the semester will be focused on reflection. Throughout the semester we are going to be preparing you to do a digital story as your Integration and Contextualization capstone reflection on your participation in the Community Engagement Scholars Program. During our seminar meetings, we will use a variety of teaching and learning strategies to achieve the course objectives, including: workshop space to discuss projects with your small group of peers, interactive reflection activities, and short readings. A number of our class periods will be spent using a learning method called learning circles. Learning circles are a form of democratic education in which participants share stories about their experiences around a common theme to identify connections and insights about our work. As part of our digital storytelling process we will be doing several activities throughout the semester that will lead to a story circle, a part of the creative process that takes place during digital storytelling workshops. \n\nprereq: Departmental Consent based on program requirements completed or plan for completion determined with program staff. ",
    "prereq": {}
  },
  {
    "uid": "816621",
    "code": "CESP3993",
    "subject": "CESP",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study Cmty Engagement",
    "fullname": "Directed Study for Community Engagement",
    "info": "Guided individual reading or study.\n\nprereq: instr consent, dept consent, college consent.",
    "prereq": {}
  }
]