[
  {
    "uid": "002383",
    "code": "CHEM1011",
    "subject": "CHEM",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "INTRO CHEM: Lecture and Lab",
    "fullname": "Introductory Chemistry: Lecture and Laboratory",
    "info": "Elementary organic chemistry. Matter/energy, atoms, compounds, solutions, chemical reactions, mole/chemical calculations, gases, liquids, solids, chemical bonding, atomic/molecular structure, acids, bases, equilibria. Physical/chemical properties of hydrocarbons and organic compounds containing halogens, nitrogen, or oxygen.  Emphasizes problem solving.",
    "prereq": {}
  },
  {
    "uid": "797614",
    "code": "CHEM1015",
    "subject": "CHEM",
    "number": "1015",
    "honors": false,
    "writing": false,
    "name": "Intro Chemistry: Lecture",
    "fullname": "Introductory Chemistry: Lecture",
    "info": "Matter/energy, atoms, compounds, solutions, chemical reactions, mole/chemical calculations, gases, liquids, solids, chemical bonding, atomic/molecular structure, acids, bases, equilibria. Physical/chemical properties of hydrocarbons and organic compounds. Problem solving.\n\nEffective fall 2024, CHEM 1015 is no longer a prerequisite to CHEM 1061/1081/1071. \n\nCHEM 1015 should only be completed by students whose major requires this course and or any student who is taking the course to fulfill the Physical Liberal Education requirement.\n\nCHEM 1015 will meet in-person.\n\nConcurrent enrollment in CHEM 1017 lab is required. You must enroll in CHEM 1017 first.\n\nConsult with your advisor with any questions or contact the Chemistry department at chemfaq@umn.ed",
    "prereq": {
      "or": [
        "807753",
        "815252",
        "827126",
        "797614",
        "797615"
      ]
    }
  },
  {
    "uid": "820225",
    "code": "CHEM1016",
    "subject": "CHEM",
    "number": "1016",
    "honors": false,
    "writing": false,
    "name": "Exploring Chemical Thinking",
    "fullname": "Exploring Chemical Thinking",
    "info": "This course is designed to help students develop and implement algebraic and chemical thinking, the ability to use symbols to represent atoms and molecules, and how these symbolic representations of microscopic particles match our macroscopic experimental observations/data. While these unique skills will be explicitly developed in this course, they will help students gain a deeper understanding of any chemical concepts to which they are applied.",
    "prereq": {}
  },
  {
    "uid": "797615",
    "code": "CHEM1017",
    "subject": "CHEM",
    "number": "1017",
    "honors": false,
    "writing": false,
    "name": "INTRO CHEM: LAB",
    "fullname": "Introductory Chemistry: Laboratory",
    "info": "Organic chemistry. Matter/energy, atoms, compounds, solutions, chemical reactions, mole/chemical calculations, gases, liquids, solids, chemical bonding, atomic/molecular structure, acids, bases, equilibria. Physical/chemical properties of hydrocarbons and organic compounds containing halogens, nitrogen, or oxygen. Problem solving.\n\nCHEM 1017 is a 1-credit lab-only course. \n\nThis course is intended for students who need to take CHEM 1015/1017 for their major course requirement and for students who are taking the course to fulfill the Physical Science/Lab requirement.\n\nThis course will  fulfill the Physical Science/Lab core requirement, when taken with CHEM 1015 concurrently.",
    "prereq": {}
  },
  {
    "uid": "002384",
    "code": "CHEM1021",
    "subject": "CHEM",
    "number": "1021",
    "honors": false,
    "writing": false,
    "name": "Chem Prin I",
    "fullname": "Chemical Principles I",
    "info": "Atomic theory, periodic properties of elements. Thermochemistry, reaction stoichiometry. Behavior of gases, liquids, and solids. Molecular/ionic structure/bonding. Organic chemistry and polymers. Energy sources, environmental issues related to energy use.",
    "prereq": {}
  },
  {
    "uid": "002385",
    "code": "CHEM1022",
    "subject": "CHEM",
    "number": "1022",
    "honors": false,
    "writing": false,
    "name": "Chem Prin II",
    "fullname": "Chemical Principles II",
    "info": "Chemical kinetics. Radioactive decay. Chemical equilibrium. Solutions. Acids/bases. Solubility. Second law of thermodynamics. Electrochemistry/corrosion. Descriptive chemistry of elements. Coordination chemistry. Biochemistry. Applications to environmental problems.",
    "prereq": {}
  },
  {
    "uid": "807753",
    "code": "CHEM1061",
    "subject": "CHEM",
    "number": "1061",
    "honors": false,
    "writing": false,
    "name": "Chemical Principles I",
    "fullname": "Chemical Principles I",
    "info": "Atomic theory, periodic properties of elements. Thermochemistry, reaction stoichiometry. Behavior of gases, liquids, and solids. Molecular/ionic structure/bonding. Organic chemistry and polymers. energy sources, environmental issues related to energy use.\n\nprereq: Grade of at least C- in CHEM 1015 OR Math placement of MATH 1151 or grade of at least C- in MATH 1031 or 1051 or CI 1806\n\nConcurrent registration is required in 1065; registration for 1065 must precede registration for 1061\n",
    "prereq": {
      "or": [
        "797614",
        "013386",
        "002394",
        "013385",
        "802055"
      ]
    }
  },
  {
    "uid": "807756",
    "code": "CHEM1062",
    "subject": "CHEM",
    "number": "1062",
    "honors": false,
    "writing": false,
    "name": "Chem Prin II",
    "fullname": "Chemical Principles II",
    "info": "Chemical kinetics. Radioactive decay. Chemical equilibrium. Solutions. Acids/bases. Solubility. Second law of thermodynamics. Electrochemistry/corrosion. Descriptive chemistry of elements. Coordination chemistry. Biochemistry.\n\nprereq: Grade of at least C- in 1061 or equiv, concurrent registration is required (or allowed) in 1066; registration for 1066 must precede registration for 1062",
    "prereq": {
      "or": [
        "807753",
        "807754",
        "807756"
      ]
    }
  },
  {
    "uid": "807752",
    "code": "CHEM1065",
    "subject": "CHEM",
    "number": "1065",
    "honors": false,
    "writing": false,
    "name": "Chemical Principles  I Lab",
    "fullname": "Chemical Principles I Laboratory",
    "info": "Basic laboratory skills while investigating physical and chemical phenomena closely linked to lecture material. Experimental design, data collection and treatment, discussion of errors, and proper treatment of hazardous wastes.\n\nprereq: concurrent registration is required (or allowed) in 1061, 1071, 1071H, 1081",
    "prereq": {
      "and": [
        "807753",
        "827126",
        "815252"
      ]
    }
  },
  {
    "uid": "807754",
    "code": "CHEM1066",
    "subject": "CHEM",
    "number": "1066",
    "honors": false,
    "writing": false,
    "name": "Chem Prin II Lab",
    "fullname": "Chemical Principles II Laboratory",
    "info": "Basic laboratory skills while investigating physical and chemical phenomena closely linked to lecture material. Experimental design, data collection and treatment, discussion of errors, and proper treatment of hazardous wastes.\n\nprereq: concurrent registration is required (or allowed) in 1062",
    "prereq": {
      "and": [
        "807756"
      ]
    }
  },
  {
    "uid": "827126",
    "code": "CHEM1071",
    "subject": "CHEM",
    "number": "1071",
    "honors": false,
    "writing": false,
    "name": "Gen Chem I for Phy Sci & Engr",
    "fullname": "General Chemistry I for Physical Scientists and Engineers",
    "info": "Advanced introduction to atomic theory. Periodic properties of elements. Behavior of gases, liquids, and solids. Molecular/ionic structure, bonding. Aspects of organic chemistry, spectroscopy, and polymers. Mathematically demanding quantitative problems. Writing for scientific journals.\n\nPrereq: Math placement of MATH 1271 OR grade of at least C- in MATH 1151 or 1155\n\nConcurrent registration is required in 1065; registration for 1065 must precede registration for 1071",
    "prereq": {}
  },
  {
    "uid": "827131",
    "code": "CHEM1072",
    "subject": "CHEM",
    "number": "1072",
    "honors": false,
    "writing": false,
    "name": "CSE Chemical Principles II",
    "fullname": "CSE Chemical Principles II",
    "info": "Advanced introduction. Chemical kinetics/reaction mechanisms, chemical/physical equilibria, acids/bases, entropy/second law of thermodynamics, electrochemistry/corrosion; descriptive chemistry of elements; coordination chemistry; biochemistry.",
    "prereq": {}
  },
  {
    "uid": "815252",
    "code": "CHEM1081",
    "subject": "CHEM",
    "number": "1081",
    "honors": false,
    "writing": false,
    "name": "Chemistry for Life Sciences I",
    "fullname": "Chemistry for the Life Sciences I",
    "info": "The topics of atomic theory, molecular structure, bonding and shape, energy and enthalpy, gases, properties of solutions, and equilibrium will be presented along with their application to biological systems. Intended to provide a strong chemistry background for students pursuing life science related majors or careers in life science-related fields.\n\nPrereq: Math placement of MATH 1151 or grade of at least C- in MATH 1031 or 1051 or CI 1806\n\nConcurrent registration is required in 1065; registration for 1065 must precede registration for 1081.",
    "prereq": {}
  },
  {
    "uid": "815284",
    "code": "CHEM1082",
    "subject": "CHEM",
    "number": "1082",
    "honors": false,
    "writing": false,
    "name": "Chemistry for Life Sciences II",
    "fullname": "Chemistry for the Life Sciences II",
    "info": "The topics of acids, bases and equilibrium, kinetics, nucleophilic substitution and elimination reactions, free radicals, electrochemistry, and alkene addition reactions will be presented along with their application to biological systems. Intended to provide a strong chemistry background for students pursuing life science related majors or careers in life science related fields. prereq: grade of a C- or better in CHEM 1081 (lecture) and CHEM 1065 (lab); concurrent registration is required (or allowed) in 1086; registration for 1086 must precede registration for 1082. This course is recommended for CBS majors. ",
    "prereq": {
      "or": [
        "815252",
        "807752",
        "815283",
        "815284"
      ]
    }
  },
  {
    "uid": "815283",
    "code": "CHEM1086",
    "subject": "CHEM",
    "number": "1086",
    "honors": false,
    "writing": false,
    "name": "Chem for Life Sci II Lab",
    "fullname": "Chemistry for the Life Sciences II Laboratory",
    "info": "Experimental techniques and instrumentation applied to the study of chemical reactions. Techniques include computational chemistry, isolation of natural products, chromatography, acid-base titrations, preparation of buffers, study of reaction kinetics, and examination of polymer degration. \n\nPrereq: grade of a C- or better in CHEM 1081 (lecture) and CHEM 1065 (lab). Concurrent registration in CHEM 1082 is required. This course is recommended for CBS majors.",
    "prereq": {}
  },
  {
    "uid": "817204",
    "code": "CHEM1901",
    "subject": "CHEM",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "TED Talks",
    "fullname": "Ideas Worth Spreading: Digging into TED Talks",
    "info": "TED talks are among the most widely available forms of intellectual discourse. In these short oral presentations, speakers share thoughtful and thought-provoking insights on a range of topics. In this course, we will focus both on discovering our own passions and how to communicate these passions effectively to a broad audience.",
    "prereq": {}
  },
  {
    "uid": "817534",
    "code": "CHEM1902",
    "subject": "CHEM",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Chem to Modern Med",
    "fullname": "Chemistry to Modern Medicine: Changing the Way We \"Dye\"",
    "info": "Chemistry has evolved from a field based on scientific curiosity and inquiry to a central science that continues to impact our daily lives with life-saving medicines and high-tech materials. The personal narratives that led to these discoveries are both exciting and informative about how we view this science in its current form. To provide a foundation for understanding the chemistry that affects our everyday lives, this course will discuss the stories behind several landmark discoveries, from the foundational work in synthetic dyes that color our clothes, to the search for Ehrlich's \"magic bullets\" that led to the first antibiotics and anti-cancer drugs. Course content will be focused around excerpts from written texts, invited speakers, inspirational TED talks, and interactive hands-on exercises will also be incorporated into our exploration uncovering the wonders of chemistry and its impact on our daily lives. No advanced chemistry background is required.",
    "prereq": {}
  },
  {
    "uid": "817282",
    "code": "CHEM1903",
    "subject": "CHEM",
    "number": "1903",
    "honors": false,
    "writing": false,
    "name": "Chemistry in the Kitchen",
    "fullname": "Chemistry in the Kitchen",
    "info": "This seminar will look at the chemistry behind cooking and baking. In this course, we'll cover topics such as coffee roasting, gluten formation, caramelization, \"unscrambling\" an egg, the science of ice cream, and molecular gastronomy. We will discuss some of the fundamental processes and chemical transformation that occur when we step into the kitchen. In addition to chemistry, this course will touch on interdisciplinary concepts from biochemistry, neuroscience, materials science, and physics.",
    "prereq": {}
  },
  {
    "uid": "817703",
    "code": "CHEM1904",
    "subject": "CHEM",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "My Other Car is a Bicycle",
    "fullname": "My Other Car is a Bicycle",
    "info": "Bicycling is a viable and sustainable mode of transportation and a vehicle for health and wellness of both individuals and communities. In this seminar, will examine the impact of choosing cars for transportation, research city planning for non-car-based transportation, evaluate safety and risks of using bicycles on different types of infrastructure, and compare bike movements and cultures in cities worldwide, including the Twin Cities. This seminar will challenge students to evaluate how they use transportation infrastructure, consider social justice issues related to transportation infrastructure, and the role that choosing bicycles and other non-car based transportation can play in improving connectedness between and within communities. We will learn some basic bike repair and practice urban riding skills. Classes will include field trips (by bike, of course), guest lectures, and more. Each student must have access to a bike during class time.",
    "prereq": {}
  },
  {
    "uid": "790188",
    "code": "CHEM1905",
    "subject": "CHEM",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary. See freshman seminar topics.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "818129",
    "code": "CHEM1906",
    "subject": "CHEM",
    "number": "1906",
    "honors": false,
    "writing": false,
    "name": "Probing Chem Sys w Mol Simulat",
    "fullname": "Probing Chemical Systems with Molecular Simulations",
    "info": "The first computers in the 1950s allowed for molecular simulation to emerge as a new scientific approach to investigate the properties of chemical systems. The triangle of experiment, theory, and molecular simulation, each with its own advantages and disadvantages, has led to tremendous gains in understanding and predicting the chemical world. This freshman seminar will provide you with background on various molecular simulation techniques and enable you to write your own computer codes for various applications. Topics will include a Monte Carlo calculation to estimate a mathematical constant, a lattice-­based algorithm to generate fractal aggregates, molecular dynamics simulation to discover the ideal-­gas law and to probe liquids and glasses, and a Monte Carlo simulation to investigate liquid water.",
    "prereq": {}
  },
  {
    "uid": "818286",
    "code": "CHEM1907",
    "subject": "CHEM",
    "number": "1907",
    "honors": false,
    "writing": false,
    "name": "Chemistry in the Kitchen",
    "fullname": "Chemistry in the Kitchen",
    "info": "Cooking is a widely-known (and widely-appreciated) application of chemistry. In this course, we will discuss the chemical principles behind topics such as nutritional value of food, the role of gluten in baking, caramelization/roasting, and molecular gastronomy. Relevant concepts from biochemistry, neuroscience, and materials science will also addressed.",
    "prereq": {}
  },
  {
    "uid": "819089",
    "code": "CHEM1908",
    "subject": "CHEM",
    "number": "1908",
    "honors": false,
    "writing": false,
    "name": "DNA",
    "fullname": "DNA",
    "info": "DNA, the molecule of life. DNA is found in every known living organism yet is the very molecule responsible for the incredible diversity found in life. Considering the central role DNA plays in biology its impact on science, industry and society is not surprising. What may be surprising is that it is only in the past several decades that technological advances have allowed us to begin to fully realize the potential of genomics research. As with many advances in science this quickly growing field has raised a number of social and ethical challenges. This course will examine a range of DNA related topics considering scientific, historical, social and ethical perspectives. Topics will include the discovery of DNA, DNA in forensics, technology of DNA sequencing, genetically modified foods and personal genomic testing.",
    "prereq": {}
  },
  {
    "uid": "790015",
    "code": "CHEM1910W",
    "subject": "CHEM",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar, WI",
    "fullname": "Freshman Seminar: Writing Intensive",
    "info": "Topics vary. See freshman seminar topics.",
    "prereq": {}
  },
  {
    "uid": "817286",
    "code": "CHEM1911W",
    "subject": "CHEM",
    "number": "1911",
    "honors": false,
    "writing": true,
    "name": "Quant Mech & Popular Philos",
    "fullname": "Quantum Mechanics and Popular Philosophy",
    "info": "One may argue about its causal role in these matters, but there is no doubt that the language of quantum mechanics has provided a powerful new set of metaphors with which to express our understanding of ourselves and our place in the overall scheme of things. We will begin with an introduction to some of the basic ideas of quantum mechanics, including the uncertainty principle and wave/particle duality, and discuss some of the quantum paradoxes that highlight the counter-intuitive nature of these concepts. We will then go on to discuss the reflection of these ideas in popular books, articles, and web sites concerning religion, mythology, and philosophy.",
    "prereq": {}
  },
  {
    "uid": "817357",
    "code": "CHEM1912",
    "subject": "CHEM",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Quant Mechanics and Theology",
    "fullname": "Quantum Mechanics and Theology",
    "info": "During the first half of the semester, we will introduce the fundamental ideas of quantum mechanics, including wave/particle duality and the uncertainty principle. We will also discuss some of the paradoxes that highlight the counter-intuitive nature of these concepts and illustrate the properties of indeterminacy, entanglement, nonlocality, interconnectedness, and other aspects of \"quantum weirdness\".  During the second half of the semester, through students' presentations and papers on topics of their choice, we will explore the reflections of these ideas in theology and related topics.",
    "prereq": {}
  },
  {
    "uid": "820095",
    "code": "CHEM1913",
    "subject": "CHEM",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "The Art in Science",
    "fullname": "The Art in Science",
    "info": "Science is an art. But there is also much art in science. From beautiful and inspiring photographs, posters, videos, and sculptures, science can be a source of inspiration for art. Conversely, art of many media are powerful tools to understand and explain science. In this seminar class we will discuss our vision of science and how it can be portrayed in art. Students will discover research ongoing at UMN and create an art project such as a journal cover or a photography portfolio to illustrate their vision of it.",
    "prereq": {}
  },
  {
    "uid": "825385",
    "code": "CHEM1914",
    "subject": "CHEM",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "Sustainability: Promote Change",
    "fullname": "Sustainability: Promoting Change in Science, Engineering, and our Daily Lives",
    "info": "Sustainability is becoming increasingly important in our daily lives from the food we eat and the plastic products we use every day to turning the lights off when not in use! This seminar will focus on giving students a broad overview of what sustainability means in the field of science and engineering. We will survey the United Nations Sustainable Development goals and touch on topics in renewable energy, farming and food, environment and water, along with sustainable technologies and innovation. Special attention will be placed on green chemistry along with learning about the plastics problem and understanding how researchers are creating sustainable technologies with recyclability/degradability.",
    "prereq": {}
  },
  {
    "uid": "825926",
    "code": "CHEM1915",
    "subject": "CHEM",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "“Seeing is Believing.”",
    "fullname": "“Seeing is Believing.” How Do We See in Science?",
    "info": "Science is predominantly an empirical field. At its core, the scientific method is based on the formulation and testing of hypotheses based on observations and measurements; but how do we “see” in science? Cells are too small to see with the naked eye, proteins and molecules are too small to be observed even with the most powerful microscopes. So how do scientists know a process is happening and what that process is? Many powerful techniques have been developed over the years to help scientists observe the systems of interest, each type of observation providing specific data. The data, however, are often subject to interpretation. We will discuss different imaging and characterization techniques widely used in Chemistry, Biology, Biochemistry, and Material Science. Classes will include field trips to several imaging and characterization facilities hosted by various Departments and Colleges on the Twin Cities campus and guest lectures by experts in specific techniques.\n",
    "prereq": {}
  },
  {
    "uid": "826149",
    "code": "CHEM1916",
    "subject": "CHEM",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Sustainable Development",
    "fullname": "Sustainable Development – Climate, People, Technology, Science and Me",
    "info": "Sustainable development is critical to the future of the planet, its people, and our communities. Evidence of its importance are the efforts by the United Nations and a large number of organizations, including the University of Minnesota, to advance sustainable development goals. Sustainable development considers factors such as climate change, food and agriculture, energy, health, the environment and its pollution, economic growth, and technology development (e.g. green chemistry). In this First-Year seminar we will learn about how these factors are interconnected, how they affect us, how they shape our future and how we with our career can play a role in sustainability.Our weekly activities will include:1. Talking with experts on these topics2. Exploring how these topics are interconnected and affect each other3. Playing with computer simulations to understand how these factors affect climate change4. Learning what is being done world-wide (United Nations and its Sustainable Development Goals), in the State, and at the University of Minnesota5. Discovering what we can personally and through our education to contribute to sustainable development",
    "prereq": {}
  },
  {
    "uid": "815286",
    "code": "CHEM2081",
    "subject": "CHEM",
    "number": "2081",
    "honors": false,
    "writing": false,
    "name": "Chemistry for Life Science III",
    "fullname": "Chemistry for the Life Sciences III",
    "info": "The topics of spectroscopy, conjugation and aromaticity, carbonyl and their reactivity, carboxylic acid derivatives, and electrophilic aromatic substitution reactions will be presented along with their application to biological systems. Intended to provide a strong chemistry background for students pursuing life science related majors or careers in life science related fields.\n\nprereq: grade of a C- or better in CHEM 1082 (lecture) and CHEM 1086 (lab)",
    "prereq": {
      "or": [
        "815284",
        "815283"
      ]
    }
  },
  {
    "uid": "815285",
    "code": "CHEM2085",
    "subject": "CHEM",
    "number": "2085",
    "honors": false,
    "writing": false,
    "name": "Chem for Life Sci III Lab",
    "fullname": "Chemistry for the Life Sciences III Laboratory",
    "info": "Experimental techniques and instrumentation applied to the study of chemical reactions and related biological systems. Techniques include spectroscopy, isolation, kinetics and thermodynamics, green chemistry, oxidations, enzymatic reductions, drug discovery. \n\nprereq: grade of a C- or better in CHEM 1082 (lecture) and CHEM 1086 (lab). Concurrent registration in CHEM 2081 is required.",
    "prereq": {
      "or": [
        "815284",
        "815283",
        "815286"
      ]
    }
  },
  {
    "uid": "007551",
    "code": "CHEM2094",
    "subject": "CHEM",
    "number": "2094",
    "honors": false,
    "writing": false,
    "name": "Dir Research",
    "fullname": "Directed Research",
    "info": "The directed study experience allows a student to work directly with a faculty on a research project. Students enrolling in this directed study/research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "002392",
    "code": "CHEM2301",
    "subject": "CHEM",
    "number": "2301",
    "honors": false,
    "writing": false,
    "name": "Organic Chemistry I",
    "fullname": "Organic Chemistry I",
    "info": "Organic compounds, constitutions, configurations, conformations, reactions. Molecular structure. Chemical reactivity/properties. Spectroscopic characterization of organic molecules.\n\nprereq: C- or better in 1062/1066 or 1072H/1076H ",
    "prereq": {
      "or": [
        "807756",
        "807754"
      ]
    }
  },
  {
    "uid": "002393",
    "code": "CHEM2302",
    "subject": "CHEM",
    "number": "2302",
    "honors": false,
    "writing": false,
    "name": "Org Chem II",
    "fullname": "Organic Chemistry II",
    "info": "Reactions, synthesis, and spectroscopic characterization of organic compounds, organic polymers, and biologically important classes of organic compounds such as lipids, carbohydrates, amino acids, peptides, proteins, and nucleic acids.\n\nprereq: Grade of at least C- in 2301",
    "prereq": {
      "and": [
        "002392"
      ]
    }
  },
  {
    "uid": "808169",
    "code": "CHEM2304",
    "subject": "CHEM",
    "number": "2304",
    "honors": false,
    "writing": false,
    "name": "Org Chem II Life Sci",
    "fullname": "Organic Chemistry II for the Life Sciences",
    "info": "Conjugation, aromaticity, chemistry of carbonyls/amines, carbohydrates, amino acids, proteins. Enzyme mechanisms, lipids, nucleic acids. Focuses on biological significance of organic molecules/mechanisms.\n\nprereq: Grade of at least C- in 2301; designed for life sciences majors",
    "prereq": {
      "or": [
        "002392"
      ]
    }
  },
  {
    "uid": "002395",
    "code": "CHEM2311",
    "subject": "CHEM",
    "number": "2311",
    "honors": false,
    "writing": false,
    "name": "Organic Lab",
    "fullname": "Organic Lab",
    "info": "Laboratory techniques in synthesis, purification and characterization of organic compounds with an emphasis on green chemistry methodologies.\n\nprereq: Grade of at least C- in [2302] or [concurrent registration is required (or allowed) in 2302",
    "prereq": {
      "or": [
        {
          "and": [
            "002393"
          ]
        },
        "002393"
      ]
    }
  },
  {
    "uid": "007708",
    "code": "CHEM2313",
    "subject": "CHEM",
    "number": "2313",
    "honors": false,
    "writing": false,
    "name": "Hon Org Lab",
    "fullname": "Honors Organic Lab",
    "info": "Honors organic chemistry lab replacing 2311 and 4311. One lab conf, 8 hrs total lab per wk.",
    "prereq": {}
  },
  {
    "uid": "002388",
    "code": "CHEM2910",
    "subject": "CHEM",
    "number": "2910",
    "honors": false,
    "writing": false,
    "name": "Spec Topics Chem",
    "fullname": "Special Topics in Chemistry",
    "info": "Topics in chemistry. Opportunities and current research.\n\nprereq: 1 sem 1xxx chemistry or instr consent",
    "prereq": {}
  },
  {
    "uid": "002389",
    "code": "CHEM2920",
    "subject": "CHEM",
    "number": "2920",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Chemistry",
    "fullname": "Special Topics in Chemistry",
    "info": "Topics in chemistry. Opportunities and current research.\n\nprereq: 1 sem 1xxx chemistry or instr consent",
    "prereq": {}
  },
  {
    "uid": "789552",
    "code": "CHEM3001",
    "subject": "CHEM",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Chem Lit & Info Retrieval",
    "fullname": "Chemical Literature and Information Retrieval",
    "info": "Forms of chemical literature, relationships among them. Major information sources in chemistry. Basic search techniques for print/electronic sources, choosing sources most appropriate for various information needs.\n\nprereq: 2302 or concurrent registration is required (or allowed) in  2302 or instr consent",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "002390",
    "code": "CHEM3101",
    "subject": "CHEM",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Intro Analytical Chemistry",
    "fullname": "Introductory Analytical Chemistry Lecture",
    "info": "Primarily for chemistry majors. Methods/concepts of measurement by chemical/instrumental analysis, including titrimetry, quantitative spectrophotometric analysis, chromatographic separations, equilibrium/rate methods.\n\nprereq: 1062/1066 or equiv",
    "prereq": {
      "or": [
        "807756",
        "807754"
      ]
    }
  },
  {
    "uid": "002391",
    "code": "CHEM3111",
    "subject": "CHEM",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Intro Anal Chem Lab",
    "fullname": "Introductory Analytical Chemistry Lab",
    "info": "Lab for 3101. High precision methods, acidimetry and complexometry, single and multicomponent analysis by spectrophotometry, analysis of mixtures by ion exchange and gas chromatography, enzymatic and rate methods. \n\nprereq: 3101 or concurrent registration is required (or allowed) in 3101",
    "prereq": {
      "or": [
        "002390"
      ]
    }
  },
  {
    "uid": "002402",
    "code": "CHEM3121",
    "subject": "CHEM",
    "number": "3121",
    "honors": false,
    "writing": false,
    "name": "Process Analytical Chemistry",
    "fullname": "Process Analytical Chemistry",
    "info": "Strategies/techniques for analysis. Use of modern instruments, including spectrophotometry, chromatography, and electrochemistry.\n\nprereq: [2302 or concurrent registration is required (or allowed) in 2302], [4501 or concurrent registration is required (or allowed) in 4501], CSE student",
    "prereq": {
      "and": [
        {
          "or": [
            "002393"
          ]
        },
        {
          "or": [
            "016186"
          ]
        }
      ]
    }
  },
  {
    "uid": "002397",
    "code": "CHEM3501",
    "subject": "CHEM",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Intro to Therm, Kin, Stat Mech",
    "fullname": "Introduction to Thermodynamics, Kinetics, and Statistical Mechanics",
    "info": "Physical chemistry as it relates to macroscopic descriptions of chemical systems. Chemical thermodynamics, phase equilibria, chemical equilibria. Statistical mechanics. Phenomenological reaction kinetics. Kinetic theory \nof gases. Collision, statistical theories of reaction rates.",
    "prereq": {}
  },
  {
    "uid": "002398",
    "code": "CHEM3502",
    "subject": "CHEM",
    "number": "3502",
    "honors": false,
    "writing": false,
    "name": "Intro to Quantum, Spectroscopy",
    "fullname": "Introduction to Quantum Mechanics and Spectroscopy",
    "info": "Microscopic descriptions of chemical systems. Elementary quantum theory. Applications to atomic/molecular structure. Molecular spectroscopy. Quantum statistical mechanics. Import of solutions to several differential equations.",
    "prereq": {}
  },
  {
    "uid": "797957",
    "code": "CHEM4001",
    "subject": "CHEM",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Biomass Chemistry & Conversion",
    "fullname": "Chemistry of Biomass and Biomass Conversion to Fuels and Products",
    "info": "Chemistry of biomass and its sustainable utilization for biofuels and bioproducts, including bio-based materials. Chemicals/energy and their environmental implications within the context of chemical principles and associated reactions underlying the structure, properties, processing, and performance of plant materials.\n\nprereq: Chem 2301 or Chem 1082 or instructor consent\n",
    "prereq": {
      "or": [
        "002392",
        "815284"
      ]
    }
  },
  {
    "uid": "004115",
    "code": "CHEM4011",
    "subject": "CHEM",
    "number": "4011",
    "honors": false,
    "writing": false,
    "name": "Mech of Chem React",
    "fullname": "Mechanisms of Chemical Reactions",
    "info": "Reaction mechanisms, methods of study. Mechanistic concepts. Gas phase reactions. \"Electron pushing\" mechanisms in organic/enzymatic reactions. Kinetic schemes, other strategies.\n\nprereq: [2302, 4501] or equiv",
    "prereq": {
      "and": [
        "002393",
        "016186"
      ]
    }
  },
  {
    "uid": "004117",
    "code": "CHEM4021",
    "subject": "CHEM",
    "number": "4021",
    "honors": false,
    "writing": false,
    "name": "Computational Chem",
    "fullname": "Computational Chemistry",
    "info": "Theoretical methods for study of molecular structure, bonding, and reactivity. Ab initio/semi-empirical calculations. Theoretical determination of molecular electronic structure/spectra, relation to experimental techniques. Molecular mechanics. Structure determination for large systems. Molecular properties/reactivity. Computational tools. Critical assessment of methods/theoretical work in the literature. Lab.\n\nprereq: [4502 or equiv], instr consent",
    "prereq": {
      "or": [
        "016224"
      ]
    }
  },
  {
    "uid": "004131",
    "code": "CHEM4066",
    "subject": "CHEM",
    "number": "4066",
    "honors": false,
    "writing": false,
    "name": "Chem of Ind",
    "fullname": "Chemistry of Industry",
    "info": "Industrial and polymer chemistry technology. Relation of basic properties to industrial utility. Economics, social problems, industrial environment.\n\nprereq: Chem sr or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "007552",
    "code": "CHEM4094W",
    "subject": "CHEM",
    "number": "4094",
    "honors": false,
    "writing": true,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Learning experience in areas not covered by regular courses. Individually arranged with faculty member.\n\nprereq: Any 3xxx or 4xxx chem course, instr consent",
    "prereq": {}
  },
  {
    "uid": "002404",
    "code": "CHEM4101",
    "subject": "CHEM",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Modrn Instr Mthds ChemAnalysis",
    "fullname": "Modern Instrumental Methods of Chemical Analysis",
    "info": "Basic electronic, optical, computer technologies in design of chemical instrumentation. Advanced topics in spectroscopy (e.g., FT-NMR, FT-IR, atomic absorption/emission). Electrochemistry. Mass spectrometry.\n\nprereq: 2101, 2111",
    "prereq": {}
  },
  {
    "uid": "002405",
    "code": "CHEM4111W",
    "subject": "CHEM",
    "number": "4111",
    "honors": false,
    "writing": true,
    "name": "Instrum Mthd Chem Analysis Lab",
    "fullname": "Modern Instrumental Methods of Chemical Analysis Lab",
    "info": "Instrumental techniques, including spectroscopic methods, electrochemical methods, and analysis based on separation. Use of computers in data collection and reduction.\n\nprereq: 4101 or concurrent registration is required (or allowed) ",
    "prereq": {
      "or": [
        "002404"
      ]
    }
  },
  {
    "uid": "004128",
    "code": "CHEM4201",
    "subject": "CHEM",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Materials Chem",
    "fullname": "Materials Chemistry",
    "info": "Crystal systems/unit cells, phase diagrams, defects/interfaces, optical/dielectric properties, electrical/thermal conductivity, X-ray diffraction, thin film analysis, electronic structure, polarons/phonons, solid state chemistry, liquid/molecular crystals, polymers, magnetic/optical materials, porous materials, ceramics, piezoelectric materials, biomedical materials, catalysts.\n\nprereq: [[4502 or equiv], 4701] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "016224"
          ]
        },
        "002408"
      ]
    }
  },
  {
    "uid": "802476",
    "code": "CHEM4214",
    "subject": "CHEM",
    "number": "4214",
    "honors": false,
    "writing": false,
    "name": "Polymers",
    "fullname": "Polymers",
    "info": "Structure/morphology of crystalline/amorphous states. Crystallization kinetics. Vitrification, glass transition. Mechanical properties, failure, permeability, optical/electrical properties, polymer composites, effect of processing.\n\nprereq: [MATS 3011, [CHEN 3101 or CHEN 4101 or MATS 4001], [upper div MatS or ChEn or CHEM]] or instr consent",
    "prereq": {
      "and": [
        "004990",
        {
          "or": [
            "009069"
          ]
        }
      ]
    }
  },
  {
    "uid": "004126",
    "code": "CHEM4221",
    "subject": "CHEM",
    "number": "4221",
    "honors": false,
    "writing": false,
    "name": "Intro Poly Chem",
    "fullname": "Introduction to Polymer Chemistry",
    "info": "Condensation, radical, ionic, emulsion, ring-opening, metal-catalyzed polymerizations. Chain conformation, solution thermodynamics, molecular weight characterization, physical properties.\n\nprereq: [2302, 4501] or instr consent",
    "prereq": {
      "and": [
        "002393",
        "016186"
      ]
    }
  },
  {
    "uid": "004127",
    "code": "CHEM4223W",
    "subject": "CHEM",
    "number": "4223",
    "honors": false,
    "writing": true,
    "name": "Polymer Lab",
    "fullname": "Polymer Laboratory",
    "info": "Synthesis, characterization, and physical properties of polymers. Free radical, condensation, emulsion, anionic polymerization. Infrared spectroscopy/gel permeation chromatography. Viscoelasticity, rubber elasticity, crystallization. \n\nprereq: CHEM 4221 coreq CHEM 4214 or CHEN 4214 or MATS 4214 or instr consent",
    "prereq": {
      "or": [
        "004126",
        "802476",
        "789683",
        "005036"
      ]
    }
  },
  {
    "uid": "798545",
    "code": "CHEM4301",
    "subject": "CHEM",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Applied Surface & Colloid Sci",
    "fullname": "Applied Surface and Colloid Science",
    "info": "Introduction to surface/colloid science concepts. Surface tension, wetting, adsorption, capillarity. Formation/stability of sols, emulsions, and foams. Water solubility. Partition coefficients of organic species. Properties of both surfactants and water soluble polymers. Focuses on interdisciplinary applications.\n\nprereq: 3043 or BMEN 2101 or CHEN 3101 or CHEM 4501 or instr consent",
    "prereq": {
      "or": [
        "798662",
        "009069",
        "016186"
      ]
    }
  },
  {
    "uid": "002406",
    "code": "CHEM4311W",
    "subject": "CHEM",
    "number": "4311",
    "honors": false,
    "writing": true,
    "name": "Adv Org Chem Lab",
    "fullname": "Advanced Organic Chemistry Lab",
    "info": "Reactions, techniques, and instrumental methods in synthetic organic chemistry.\n\nprereq: 2311",
    "prereq": {
      "and": [
        "002395"
      ]
    }
  },
  {
    "uid": "004133",
    "code": "CHEM4321",
    "subject": "CHEM",
    "number": "4321",
    "honors": false,
    "writing": false,
    "name": "Organic Synthesis",
    "fullname": "Organic Synthesis",
    "info": "Fundamental concepts, reactions, reagents, structural/stereochemical issues, mechanistic skills for organic chemistry.\n\nprereq: [2302 or equiv], 4501, instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "002393"
          ]
        },
        "016186"
      ]
    }
  },
  {
    "uid": "004135",
    "code": "CHEM4322",
    "subject": "CHEM",
    "number": "4322",
    "honors": false,
    "writing": false,
    "name": "Adv Organic Chem",
    "fullname": "Advanced Organic Chemistry",
    "info": "Topics vary by instructor. Examples: natural products, heterocycles, asymmetric synthesis, organometallic chemistry, polymer chemistry.\n\nprereq: [2302 or equiv], 4501, instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "002393"
          ]
        },
        "016186"
      ]
    }
  },
  {
    "uid": "004137",
    "code": "CHEM4352",
    "subject": "CHEM",
    "number": "4352",
    "honors": false,
    "writing": false,
    "name": "Phys Organic Chem",
    "fullname": "Physical Organic Chemistry",
    "info": "Fundamental concepts and mechanistic tools for analysis of organic reaction mechanisms. Solvation, reactive intermediates, gas phase chemistry. Photochemistry/strained-ring chemistry.\n\nprereq: 4501, [4011 or 8011]",
    "prereq": {
      "and": [
        "016186",
        {
          "or": [
            "004115",
            "004114"
          ]
        }
      ]
    }
  },
  {
    "uid": "004139",
    "code": "CHEM4361",
    "subject": "CHEM",
    "number": "4361",
    "honors": false,
    "writing": false,
    "name": "Interp of Org Spec",
    "fullname": "Interpretation of Organic Spectra",
    "info": "Application of nuclear magnetic resonance, mass, ultraviolet, and infrared spectral analyses to organic structural problems.\n\nprereq: [2302 or equiv], 4501, instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "002393"
          ]
        },
        "016186"
      ]
    }
  },
  {
    "uid": "004142",
    "code": "CHEM4411",
    "subject": "CHEM",
    "number": "4411",
    "honors": false,
    "writing": false,
    "name": "Intro Chem Biology",
    "fullname": "Introduction to Chemical Biology",
    "info": "Chemistry of amino acids, peptides, proteins, lipids, carbohydrates, and nucleic acids. Structure, nomenclature, synthesis, reactivity. Techniques to characterize biomolecules.\n\nprereq: [2302 or 2081 equiv]",
    "prereq": {
      "or": [
        "002393",
        "815286"
      ]
    }
  },
  {
    "uid": "004144",
    "code": "CHEM4412",
    "subject": "CHEM",
    "number": "4412",
    "honors": false,
    "writing": false,
    "name": "Chem Biology Enzymes",
    "fullname": "Chemical Biology of Enzymes",
    "info": "Enzyme classification with examples from current literature. Strategies to decipher enzyme mechanisms. Chemical approaches to control enzyme catalysis.\n\nprereq: [2302 or equiv], 4501",
    "prereq": {
      "and": [
        {
          "or": [
            "002393"
          ]
        },
        "016186"
      ]
    }
  },
  {
    "uid": "004146",
    "code": "CHEM4413",
    "subject": "CHEM",
    "number": "4413",
    "honors": false,
    "writing": false,
    "name": "Nucleic Acids",
    "fullname": "Nucleic Acids",
    "info": "Chemistry/biology of nucleic acids. Structure, thermodynamics, reactivity, DNA repair, chemical oligonucleotide synthesis, antisense approaches, ribozymes. Techniques for nucleic acid research. Interactions with small molecules/proteins.\n\nprereq: 2302, [3501 or equiv]",
    "prereq": {
      "and": [
        "002393",
        {
          "or": [
            "002397"
          ]
        }
      ]
    }
  },
  {
    "uid": "812863",
    "code": "CHEM4423W",
    "subject": "CHEM",
    "number": "4423",
    "honors": false,
    "writing": true,
    "name": "Foundations of Chem Bio Lab",
    "fullname": "Foundations of Chemical Biology Laboratory",
    "info": "Experimental techniques from all areas of chemistry applied to biological problems. Experiments to highlight techniques and concepts used in modern Chemical Biology research. Emphasis on connections between classroom/laboratory learning and experimental science, health, disease, and medical research. While biochemistry courses are allowed as a prerequisite, completion of or concurrent enrollment in Chem 4411, Introduction to Chemical Biology, will provide students with the best preparation for this lab course.\n\nprereq: Chem 2311 or 2312H or 2085 (prereq); and Chem 4411 or BioC 4331 or BioC 3021 (concurrent allowed)",
    "prereq": {
      "or": [
        "004142",
        "002395",
        "815285",
        "002945",
        "014290"
      ]
    }
  },
  {
    "uid": "016186",
    "code": "CHEM4501",
    "subject": "CHEM",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Intro to Thermo, Kin, Stat Mec",
    "fullname": "Introduction to Thermodynamics, Kinetics, and Statistical Mechanics",
    "info": "Physical chemistry as it relates to macroscopic descriptions of chemical systems. Chemical thermodynamics, phase equilibria, chemical equilibria. Statistical mechanics. Phenomenological reaction kinetics. Kinetic theory \nof gases. Collision, statistical theories of reaction rates.\n\nprereq: [1062/1066 or 1071H/1075H], [MATH 2263 or concurrent registration is required (or allowed) in MATH 2263 or MATH 2374 or concurrent registration is required (or allowed) in MATH 2374], [PHYS 1302 or PHYS 1402V or PHYS 1502V]",
    "prereq": {
      "and": [
        {
          "or": [
            "807756",
            "807754"
          ]
        },
        {
          "or": [
            "000282",
            "003695"
          ]
        },
        {
          "or": [
            "002071"
          ]
        }
      ]
    }
  },
  {
    "uid": "016224",
    "code": "CHEM4502",
    "subject": "CHEM",
    "number": "4502",
    "honors": false,
    "writing": false,
    "name": "Intro to Quantum, Spectroscopy",
    "fullname": "Introduction to Quantum Mechanics and Spectroscopy",
    "info": "Microscopic descriptions of chemical systems. Quantum theory. Applications to atomic/molecular structure. Molecular spectroscopy. Quantum statistical mechanics. Discussion of solutions to several differential equations.\n\nprereq: [1062/1066 or 1072H/1076H of 1082/1086], [MATH 2263 or concurrent registration is required (or allowed) in MATH 2263 or MATH 2374 or concurrent registration is required (or allowed) in MATH 2374 or MATH 2243 or concurrent registration is required (or allowed) in MATH 2243 or MATH 2373 or concurrent registration is required (or allowed) in MATH 2373], [PHYS 1302 or PHYS 1402V or PHYS 1502V]",
    "prereq": {
      "and": [
        {
          "or": [
            "807756",
            "807754",
            "815284",
            "815283"
          ]
        },
        {
          "or": [
            "000282",
            "003695",
            "000280",
            "003694"
          ]
        },
        {
          "or": [
            "002071"
          ]
        }
      ]
    }
  },
  {
    "uid": "002407",
    "code": "CHEM4511W",
    "subject": "CHEM",
    "number": "4511",
    "honors": false,
    "writing": true,
    "name": "Adv Phys Chem Lab",
    "fullname": "Advanced Physical Chemistry Lab",
    "info": "Experiments illustrating principles and methods of thermodynamics, reaction kinetics, and quantum mechanics. \n\nprereq: 4502, chemistry major",
    "prereq": {
      "or": [
        "016224"
      ]
    }
  },
  {
    "uid": "805158",
    "code": "CHEM4601",
    "subject": "CHEM",
    "number": "4601",
    "honors": false,
    "writing": false,
    "name": "Green Chemistry",
    "fullname": "Green Chemistry",
    "info": "Survey key aspects of green chemistry in modern research and development both in academia and industry, as well as relevant implications for the environment, technology, and public policy. prereq: [2302 or 2081 or equiv]",
    "prereq": {
      "or": [
        "002393",
        "815286"
      ]
    }
  },
  {
    "uid": "002408",
    "code": "CHEM4701",
    "subject": "CHEM",
    "number": "4701",
    "honors": false,
    "writing": false,
    "name": "Inorganic Chemistry",
    "fullname": "Inorganic Chemistry",
    "info": "Periodic trends. Structure/bonding in compounds where s and p electrons are important. Descriptive chemistry of solids and transition metal compounds. Transition metal chemistry. Topics in main group and materials chemistry.\n\nprereq: 2302 or 2332H",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "002409",
    "code": "CHEM4711W",
    "subject": "CHEM",
    "number": "4711",
    "honors": false,
    "writing": true,
    "name": "Adv Inorg Chem Lab",
    "fullname": "Advanced Inorganic Chemistry Lab",
    "info": "Lab experiments in inorganic/organometallic chemistry illustrating synthetic/spectroscopic techniques.\n\nprereq: 4701, chem major",
    "prereq": {
      "or": [
        "002408"
      ]
    }
  },
  {
    "uid": "004154",
    "code": "CHEM4715",
    "subject": "CHEM",
    "number": "4715",
    "honors": false,
    "writing": false,
    "name": "Phys Inorg Chem",
    "fullname": "Physical Inorganic Chemistry",
    "info": "Physical methods (e.g., IR, UV-VIS, ESR, Mossbauer and mass spectroscopy, magnetic measurements, X-ray diffraction) and concepts applied to inorganic and organometallic systems.\n\nprereq: 4701 or equiv, chem major or instr consent",
    "prereq": {
      "or": [
        "002408"
      ]
    }
  },
  {
    "uid": "004156",
    "code": "CHEM4725",
    "subject": "CHEM",
    "number": "4725",
    "honors": false,
    "writing": false,
    "name": "Organomet Chem",
    "fullname": "Organometallic Chemistry",
    "info": "Synthesis, reactions, structures, and other properties of main group and transition metal organometallic compounds; electronic and structural theory, emphasizing their use as stoichiometric and homogeneous catalytic reagents in organic and inorganic systems.\n\nprereq: 4701 or equiv, chem major or instr consent",
    "prereq": {
      "or": [
        "002408"
      ]
    }
  },
  {
    "uid": "004158",
    "code": "CHEM4735",
    "subject": "CHEM",
    "number": "4735",
    "honors": false,
    "writing": false,
    "name": "Bioinorganic Chemistry",
    "fullname": "Bioinorganic Chemistry",
    "info": "Role of metal ions in biology. Emphasizes structure, function, and spectroscopy of metalloproteins and their synthetic analogs.\n\nprereq: 4701 or equiv, chem grad or instr consent",
    "prereq": {
      "or": [
        "002408"
      ]
    }
  },
  {
    "uid": "004160",
    "code": "CHEM4745",
    "subject": "CHEM",
    "number": "4745",
    "honors": false,
    "writing": false,
    "name": "Adv Inorg Chem",
    "fullname": "Advanced Inorganic Chemistry",
    "info": "Topics in main group and transition metal chemistry. Emphasizes synthesis, structure, physical properties, and chemical reactivity.\n\nprereq: 4701, chem major, instr consent",
    "prereq": {
      "or": [
        "002408"
      ]
    }
  },
  {
    "uid": "809278",
    "code": "CHEM4894",
    "subject": "CHEM",
    "number": "4894",
    "honors": false,
    "writing": false,
    "name": "Directed Thesis",
    "fullname": "Directed Thesis",
    "info": "Written thesis under direction of chemistry project advisor.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "016075",
    "code": "CHEM5210",
    "subject": "CHEM",
    "number": "5210",
    "honors": false,
    "writing": false,
    "name": "Materials Characterization",
    "fullname": "Materials Characterization",
    "info": "Modern tools/techniques for both bulk- and thin-film characterization.  Topics may include ion-solid interactions, Rutherford back scattering, secondary ion mass spectrometry, solid-state NMR, x-ray photoelectron spectroscopy, small-angle x-ray/neutron scattering, transmission/scanning electron/probe microscopy, near-field scanning optical microscopy, porosimetry, adsorption techniques, and ellipsometry.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "791933",
    "code": "CHEM5245",
    "subject": "CHEM",
    "number": "5245",
    "honors": false,
    "writing": false,
    "name": "Intro to Drug Design",
    "fullname": "Introduction to Drug Design",
    "info": "Concepts that govern design/discovery of drugs. Physical, bioorganic, medicinal chemical principles applied to explain rational design and mechanism of action drugs.\n\nprereq: 2302 or equiv",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "793191",
    "code": "CHEM5541",
    "subject": "CHEM",
    "number": "5541",
    "honors": false,
    "writing": false,
    "name": "Dynamics",
    "fullname": "Dynamics",
    "info": "Hamilton's/Lagrange's equations of motion. Normal modes and molecular rotation. Langevin equation and Brownian motion. Time correlation functions, collision theory, cross-sections, energy transfer. Molecular forces and potential energy surfaces. Classical electrostatics.",
    "prereq": {}
  },
  {
    "uid": "793193",
    "code": "CHEM5551",
    "subject": "CHEM",
    "number": "5551",
    "honors": false,
    "writing": false,
    "name": "Quantum Mechanics I",
    "fullname": "Quantum Mechanics I",
    "info": "Review of classical mechanics. Postulates of quantum mechanics, with applications to determination of single particle bound state energies and scattering cross-sections in central field potentials. Density operator formalism, with applications to description of two-level systems, two-particle systems, entanglement, and Bell inequality.",
    "prereq": {}
  },
  {
    "uid": "016720",
    "code": "CHEM5755",
    "subject": "CHEM",
    "number": "5755",
    "honors": false,
    "writing": false,
    "name": "X-Ray Crystallography",
    "fullname": "X-Ray Crystallography",
    "info": "Essentials of crystallography as applied to modern, single crystal X-ray diffraction methods. Practical training in use of instrumentation in X-ray crystallography facility in Department of Chemistry. Date collection, correction/refinement, structure solutions, generation of publication materials, use of Cambridge Crystallographic Structure Database.\n\nprereq: Chem grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004114",
    "code": "CHEM8011",
    "subject": "CHEM",
    "number": "8011",
    "honors": false,
    "writing": false,
    "name": "Mech of Chem React",
    "fullname": "Mechanisms of Chemical Reactions",
    "info": "Reaction mechanisms and methods of study. Mechanistic concepts in chemistry. Gas phase reactions to mechanisms, \"electron pushing\" mechanisms in organic reactions, mechanism of enzymatic reactions. Kinetic schemes and other strategies to investigate mechanisms.\n\nprereq: 2302 or equiv",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "004116",
    "code": "CHEM8021",
    "subject": "CHEM",
    "number": "8021",
    "honors": false,
    "writing": false,
    "name": "Computational Chem",
    "fullname": "Computational Chemistry",
    "info": "Modern theoretical methods used in study of molecular structure, bonding, reactivity. Concepts/practical applications. Determination of spectra, relationship to experimental techniques. Molecular mechanics. Critical assessment of reliability of methods.\n\nprereq: 4502 or equiv",
    "prereq": {
      "or": [
        "016224"
      ]
    }
  },
  {
    "uid": "794063",
    "code": "CHEM8025",
    "subject": "CHEM",
    "number": "8025",
    "honors": false,
    "writing": false,
    "name": "Graduate Research",
    "fullname": "Introduction to Graduate Research",
    "info": "New areas of chemistry, hands-on exposure to graduate research. Students rotate through up to two different labs for seven weeks. Labs are run by chemistry graduate faculty members.  ",
    "prereq": {}
  },
  {
    "uid": "016586",
    "code": "CHEM8066",
    "subject": "CHEM",
    "number": "8066",
    "honors": false,
    "writing": false,
    "name": "Ethical Chemical Research",
    "fullname": "Professional Conduct of Chemical Research",
    "info": "Builds sensitivity to ethical issues in chemical research. Readings/case studies, small-group/large-group discussion, summarizing comments from instructors/guests/panels having special expertise. Weekly seminar.\n\nprereq: Chem grad student",
    "prereq": {}
  },
  {
    "uid": "004978",
    "code": "CHEM8081",
    "subject": "CHEM",
    "number": "8081",
    "honors": false,
    "writing": false,
    "name": "MS Plan B Proj. I",
    "fullname": "M.S. Plan B Project I",
    "info": "Satisfies project requirement for Plan B master's degree. May appear on M.S. degree program, but does not count toward 14-credit minimum in major field. Topic arranged by student adviser; written report required. 8081 required; 8082 optional.\n\nprereq: grad chem major",
    "prereq": {}
  },
  {
    "uid": "004981",
    "code": "CHEM8082",
    "subject": "CHEM",
    "number": "8082",
    "honors": false,
    "writing": false,
    "name": "MS Plan B Proj. II",
    "fullname": "M.S. Plan B Project II",
    "info": "Satisfies project requirement for Plan B master's degree. May appear on M.S. degree program, but does not count toward 14-credit minimum in major field. Topic arranged by student adviser; written report required. 8081 required; 8082 optional.\n\nprereq: grad chem major",
    "prereq": {}
  },
  {
    "uid": "004118",
    "code": "CHEM8151",
    "subject": "CHEM",
    "number": "8151",
    "honors": false,
    "writing": false,
    "name": "Analy Sep & Chem Equil",
    "fullname": "Analytical Separations and Chemical Equilibria",
    "info": "Advanced treatment of principles of analytical chemistry, chemical equilibria, and dynamics. Chromotographic and other modern analytical scale separation techniques. Emphasizes column dynamics and retention mechanisms.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004120",
    "code": "CHEM8152",
    "subject": "CHEM",
    "number": "8152",
    "honors": false,
    "writing": false,
    "name": "Anal Spec",
    "fullname": "Analytical Spectroscopy",
    "info": "Survey of analytical spectroscopic methods. Design/application of spectroscopic instruments, including signal generation, acquisition, and interpretation. May include nuclear magnetic resonance, electron paramagnetic resonance, infrared and ultraviolet/visible spectroscopy, and mass spectrometry.\n\nprereq: grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "004121",
    "code": "CHEM8153",
    "subject": "CHEM",
    "number": "8153",
    "honors": false,
    "writing": false,
    "name": "Signal-noise",
    "fullname": "Extracting Signal From Noise",
    "info": "Use of analog/digital electronics and computational methods in experiments. Passive circuits, operational amplifiers, filters, oscillators and Laplace transform techniques in analysis, domain conversion for data acquisition/control, statistics, experimental design. Introduction to chemometrics, Fourier analysis, convolution/deconvolution, curve fitting.\n\nprereq: [4101 or equiv], differential equations course",
    "prereq": {
      "or": [
        "002404"
      ]
    }
  },
  {
    "uid": "004122",
    "code": "CHEM8155",
    "subject": "CHEM",
    "number": "8155",
    "honors": false,
    "writing": false,
    "name": "Electrochemistry",
    "fullname": "Advanced Electroanalytical Chemistry",
    "info": "Thermodynamics/kinetics of electron/ion transfer, electric double layer, mass transfer by diffusion/migration. Ion-selective potentiometry, chronoamperometry, chronocoulometry, cyclic voltammetry, pulse voltammetry, ion-transfer voltammetry, impedance spectroscopy, bioelectroanalysis, rotating disk electrodes, microelectrodes, chemically modified electrodes. Scanning electrochemical microscopy. EC-STM, quartz crystal microbalance.",
    "prereq": {}
  },
  {
    "uid": "004123",
    "code": "CHEM8157",
    "subject": "CHEM",
    "number": "8157",
    "honors": false,
    "writing": false,
    "name": "Bioanalytical Chemistry",
    "fullname": "Bioanalytical Chemistry",
    "info": "Theory and practical aspects of analytical methods used in determination/characterization of biologically important materials. Enzymatic/kinetic methods in study of proteins, carbohydrates, lipids, and nucleic acids.",
    "prereq": {}
  },
  {
    "uid": "004124",
    "code": "CHEM8159",
    "subject": "CHEM",
    "number": "8159",
    "honors": false,
    "writing": false,
    "name": "NMR Spec",
    "fullname": "Nuclear Magnetic Resonance Spectroscopy",
    "info": "Detailed understanding of relaxation processes, chemical exchange, quadrupolar effects, NOW, 2D NMR, NMR hardware, and solid state NMR. NMR imaging and Pulsed Field Gradient (PFG) NMR are discussed.\n\nprereq: Sem of organic chem",
    "prereq": {}
  },
  {
    "uid": "004125",
    "code": "CHEM8180",
    "subject": "CHEM",
    "number": "8180",
    "honors": false,
    "writing": false,
    "name": "spec top anal chem",
    "fullname": "Special Topics in Analytical Chemistry",
    "info": "Topics (and availability) vary by year depending on instructor and development of the field.\n\nprereq: Grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "790578",
    "code": "CHEM8201",
    "subject": "CHEM",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Materials Chem",
    "fullname": "Materials Chemistry",
    "info": "Crystal systems/unit cells, phase diagrams, defects/interfaces, optical/ dielectric properties, electrical/thermal conductivity, X-ray diffraction, thin film analysis, electronic structure, polarons/phonons, solid state chemistry, liquid/molecular crystals, polymers, magnetic/optical materials, porous materials, ceramics, piezoelectric materials, biomedical materials, catalysts.\n\nprereq: [4701, 3502] or instr consent",
    "prereq": {
      "and": [
        "002408",
        "002398"
      ]
    }
  },
  {
    "uid": "004129",
    "code": "CHEM8211",
    "subject": "CHEM",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Physical Polymer Chemistry",
    "fullname": "Physical Polymer Chemistry",
    "info": "Chain conformations. Thermodynamics of polymer solutions, blends, and copolymers. Light, neutron, and X-ray scattering. Dynamics in dilute solution and polymer characterization and in melts and viscoelasticity. Rubber elasticity, networks, gels. Glass transition. crystallization.\n\nprereq: Undergrad physical chem course",
    "prereq": {}
  },
  {
    "uid": "790575",
    "code": "CHEM8221",
    "subject": "CHEM",
    "number": "8221",
    "honors": false,
    "writing": false,
    "name": "Synthetic Polymer Chemistry",
    "fullname": "Synthetic Polymer Chemistry",
    "info": "Condensation, radical, ionic, emulsion, ring-opening, metal-catalyzed polymerizations. Chain conformation, solution thermodynamics, molecular weight characterization, physical properties.\n\nprereq: [Undergrad organic chemistry course, undergrad physical chemistry course] or instr consent",
    "prereq": {}
  },
  {
    "uid": "004130",
    "code": "CHEM8280",
    "subject": "CHEM",
    "number": "8280",
    "honors": false,
    "writing": false,
    "name": "Special Topics: Materials Chem",
    "fullname": "Special Topics in Materials Chemistry",
    "info": "Topics (and availability) vary by year depending on instructor and development of the field.\n\nprereq: Grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "004132",
    "code": "CHEM8321",
    "subject": "CHEM",
    "number": "8321",
    "honors": false,
    "writing": false,
    "name": "Organic Synthesis",
    "fullname": "Organic Synthesis",
    "info": "Core course; fundamental concepts, reactions, reagents, structural and stereochemical issues, and mechanistic skills necessary for understanding organic chemistry.\n\nprereq: 2302 or equiv",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "004134",
    "code": "CHEM8322",
    "subject": "CHEM",
    "number": "8322",
    "honors": false,
    "writing": false,
    "name": "Adv Organic Chem",
    "fullname": "Advanced Organic Chemistry",
    "info": "Modern studies. Topics, which vary by year, include natural products, heterocycles, asymmetric synthesis, organometallic chemistry, and polymer chemistry.\n\nprereq: 2302 or equiv",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "788088",
    "code": "CHEM8333",
    "subject": "CHEM",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "004136",
    "code": "CHEM8352",
    "subject": "CHEM",
    "number": "8352",
    "honors": false,
    "writing": false,
    "name": "Phys Organic Chem",
    "fullname": "Physical Organic Chemistry",
    "info": "Fundamental concepts, mechanistic tools for analyzing organic reaction mechanisms. Solvation, reactive intermediates, gas phase chemistry, photochemistry, strained-ring chemistry.\n\nprereq: 4011 or 8011",
    "prereq": {
      "or": [
        "004115",
        "004114"
      ]
    }
  },
  {
    "uid": "004138",
    "code": "CHEM8361",
    "subject": "CHEM",
    "number": "8361",
    "honors": false,
    "writing": false,
    "name": "Interp of Org Spec",
    "fullname": "Interpretation of Organic Spectra",
    "info": "Practical application of nuclear magnetic resonance, mass, ultraviolet, and infrared spectral analyses to solution of organic structural problems.\n\nprereq: 2302 or equiv",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "004140",
    "code": "CHEM8380",
    "subject": "CHEM",
    "number": "8380",
    "honors": false,
    "writing": false,
    "name": "spec top org chem",
    "fullname": "Special Topics in Organic Chemistry",
    "info": "Topics (and availability) vary by year depending on instructor and development of the field.\n\nprereq: grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "004141",
    "code": "CHEM8411",
    "subject": "CHEM",
    "number": "8411",
    "honors": false,
    "writing": false,
    "name": "Intro to Chem Biology",
    "fullname": "Introduction to Chemical Biology",
    "info": "Chemistry of amino acids, peptides, proteins, lipids, carbohydrates, and nucleic acids. Structure, nomenclature, synthesis, and reactivity. Overview of techniques used to characterize these biomolecules.\n\nprereq: 2302 or equiv",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "004143",
    "code": "CHEM8412",
    "subject": "CHEM",
    "number": "8412",
    "honors": false,
    "writing": false,
    "name": "Chemical Biology of Enzymes",
    "fullname": "Chemical Biology of Enzymes",
    "info": "Enzyme classification with representative examples from current literature. Strategies used to decipher enzyme mechanisms. Chemical approaches for control of enzyme catalysis.\n\nprereq: 2302 or equiv",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "004145",
    "code": "CHEM8413",
    "subject": "CHEM",
    "number": "8413",
    "honors": false,
    "writing": false,
    "name": "Nucleic Acids",
    "fullname": "Nucleic Acids",
    "info": "Chemistry and biology of nucleic acids: structure, thermodynamics, reactivity, DNA repair, chemical oligonucleotide synthesis, antisense approaches, ribozymes, overview of techniques used in nucleic acid research, interactions with small molecules and proteins.\n\nprereq: 2302 or equiv",
    "prereq": {
      "or": [
        "002393"
      ]
    }
  },
  {
    "uid": "788327",
    "code": "CHEM8444",
    "subject": "CHEM",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "004147",
    "code": "CHEM8480",
    "subject": "CHEM",
    "number": "8480",
    "honors": false,
    "writing": false,
    "name": "Spec Top Biol Chem",
    "fullname": "Special Topics in Biological Chemistry",
    "info": "Topics (and availability) vary by year, depending on instructor and development of the field.\n\nprereq: Grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "791687",
    "code": "CHEM8541",
    "subject": "CHEM",
    "number": "8541",
    "honors": false,
    "writing": false,
    "name": "Dynamics",
    "fullname": "Dynamics",
    "info": "Mathematical methods for physical chemistry. Classical mechanics/dynamics, normal modes of vibration. Special topics such as rotational motion, Langevin equation, Brownian motion, time correlation functions, collision theory, cross sections, energy transfer, molecular forces, potential energy surfaces, classical electrostatics, Shannon entropy.\n\nprereq: Undergrad physical chem course",
    "prereq": {}
  },
  {
    "uid": "004148",
    "code": "CHEM8551",
    "subject": "CHEM",
    "number": "8551",
    "honors": false,
    "writing": false,
    "name": "Quantum Mechanics I",
    "fullname": "Quantum Mechanics I",
    "info": "Review of classical mechanics. Postulates of quantum mechanics with applications to determination of single particle bound state energies and scattering cross-sections in central field potentials. Density operator formalism with applications to description of two level systems, two particle systems, entanglement, and Bell inequality.\n\nprereq: undergrad physical chem course",
    "prereq": {}
  },
  {
    "uid": "004149",
    "code": "CHEM8552",
    "subject": "CHEM",
    "number": "8552",
    "honors": false,
    "writing": false,
    "name": "Quantum Mechanics II",
    "fullname": "Quantum Mechanics II",
    "info": "Second Quantization;Density matrices; Molecular Electronic Structure Theory; Hartree-Fock Theory; Electron Correlation; Configuration Interaction; Perturbation Theory; Energy Derivatives; Coupled-Cluster;Density Functional Theory; Relativistic Quantum Chemistry;\n\nprereq: 8551",
    "prereq": {
      "and": [
        "004148"
      ]
    }
  },
  {
    "uid": "004150",
    "code": "CHEM8561",
    "subject": "CHEM",
    "number": "8561",
    "honors": false,
    "writing": false,
    "name": "Thermo,Stat Mech,Rxn Dynam I",
    "fullname": "Thermodynamics, Statistical Mechanics, and Reaction Dynamics I",
    "info": "Two-part sequence. Thermodynamics, equilibrium statistical mechanics, ensemble theory, partition functions. Applications, including ideal gases/crystals. Theories of simple liquids, Monte Carlo, and molecular dynamics simulations. Reaction dynamics from microscopic viewpoint.\n\nprereq: undergrad physical chem course",
    "prereq": {}
  },
  {
    "uid": "004151",
    "code": "CHEM8562",
    "subject": "CHEM",
    "number": "8562",
    "honors": false,
    "writing": false,
    "name": "Thermo,Stat Mech,Rxn Dynam II",
    "fullname": "Thermodynamics, Statistical Mechanics, and Reaction Dynamics II",
    "info": "Two-part sequence. Thermodynamics, equilibrium statistical mechanics, ensemble theory, partition functions. Applications, including ideal gases/crystals. Theories of simple liquids, Monte Carlo, and molecular dynamics simulations. Reaction dynamics from microscopic viewpoint.\n\nprereq: 8561",
    "prereq": {
      "and": [
        "004150"
      ]
    }
  },
  {
    "uid": "810864",
    "code": "CHEM8563",
    "subject": "CHEM",
    "number": "8563",
    "honors": false,
    "writing": false,
    "name": "Molecular Simulations",
    "fullname": "Molecular Simulations",
    "info": "Principles of Monte Carlo/molecular dynamics simulations. Algorithms, simulation set-up/analysis, applications to chemical systems. Hands-on computational project that requires writing of computer code.\n\nprereq: grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "810865",
    "code": "CHEM8564",
    "subject": "CHEM",
    "number": "8564",
    "honors": false,
    "writing": false,
    "name": "Laser Spectroscopy",
    "fullname": "Laser Spectroscopy",
    "info": "Fundamentals of light-molecule interactions/manifestation in spectroscopic observables. Time correlation functions, spectroscopic lineshapes, linear/nonlinear material responses, material susceptibilities. Role of lasers in measuring quantities.\n\nprereq: grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "815366",
    "code": "CHEM8565",
    "subject": "CHEM",
    "number": "8565",
    "honors": false,
    "writing": false,
    "name": "Chemical Reaction Dynamics",
    "fullname": "Chemical Reaction Dynamics",
    "info": "Fundamentals of chemical reaction dynamics including potential energy surfaces, collision theory, statistical mechanical background and transition state theory, variational transition state theory, activation energy, tunneling, unimolecular reactions, energy transfer, reactions in solution, solvation free energy, potential of mean force, quasithermodynamic treatment, reactions in solution, diffusion control, Kramers\u0092 theory, and photochemistry",
    "prereq": {}
  },
  {
    "uid": "817520",
    "code": "CHEM8566",
    "subject": "CHEM",
    "number": "8566",
    "honors": false,
    "writing": false,
    "name": "Spin Dynamics",
    "fullname": "Spin Dynamics",
    "info": "Chemistry 8566 is a 1/2-semester course on spin dynamics. The course prerequisites are described in the CSE Bulletin. Briefly, they are: one year of college-level chemistry, one year of college-level physics, and one year of college-level calculus. All of the prerequisites should have been completed before enrollment in this course. Students who do not satisfy the course prerequisites, please contact the instructor.",
    "prereq": {}
  },
  {
    "uid": "817521",
    "code": "CHEM8567",
    "subject": "CHEM",
    "number": "8567",
    "honors": false,
    "writing": false,
    "name": "Biophysical Chemistry",
    "fullname": "Biophysical Chemistry",
    "info": "CHEM 8567 is a graduate level course which emphasizes how macromolecular and membrane structure and dynamics impact biological function. Topics to be covered include high-resolution structure determination, biomolecular spectroscopy, and microscopy as applied to folding, solvation, and reaction dynamics.\n\nThe objectives for this course are to become well-versed in the language of biophysics, at a level sufficient to understand and critically evaluate the literature and to understand fundamental concepts related to structure determination and structure-function relationships of biomolecules, and to be able to apply those concepts to a variety of biological systems.\n",
    "prereq": {}
  },
  {
    "uid": "816843",
    "code": "CHEM8568",
    "subject": "CHEM",
    "number": "8568",
    "honors": false,
    "writing": false,
    "name": "Chemical Bonding at Surfaces",
    "fullname": "Chemical Bonding at Surfaces",
    "info": "A brief overview of surface science, chemical reactions at surfaces, and interactions of surfaces with light. Students will also be exposed to physical principles of chemical reactions such as transition-state theory and kinetics in within the framework of surface science.",
    "prereq": {}
  },
  {
    "uid": "819728",
    "code": "CHEM8569",
    "subject": "CHEM",
    "number": "8569",
    "honors": false,
    "writing": false,
    "name": "Electronic Structure",
    "fullname": "Electronic Structure",
    "info": "This course covers electronic structure theory applied to atoms and molecules and includes a hands-on computational project that requires writing of computer code.  It will cover Hartree-Fock theory, Density Functional Theory, electron correlation theories, relativistic effects, and other related topics.  ",
    "prereq": {}
  },
  {
    "uid": "004152",
    "code": "CHEM8580",
    "subject": "CHEM",
    "number": "8580",
    "honors": false,
    "writing": false,
    "name": "spec top phys chem",
    "fullname": "Special Topics in Physical Chemistry",
    "info": "Topics (and availability) vary depending on instructor and development of the field.\n\nprereq: grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "004976",
    "code": "CHEM8601",
    "subject": "CHEM",
    "number": "8601",
    "honors": false,
    "writing": false,
    "name": "Seminar",
    "fullname": "Seminar: Modern Problems in Chemistry",
    "info": "Weekly seminar series on modern chemical topics.\n\nprereq: grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "004977",
    "code": "CHEM8602",
    "subject": "CHEM",
    "number": "8602",
    "honors": false,
    "writing": false,
    "name": "Seminar Pres.",
    "fullname": "Seminar Presentation: Modern Problems in Chemistry",
    "info": "Weekly seminar series on modern chemical topics presented by students.\n\nprereq: grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "788452",
    "code": "CHEM8666",
    "subject": "CHEM",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "791999",
    "code": "CHEM8700",
    "subject": "CHEM",
    "number": "8700",
    "honors": false,
    "writing": false,
    "name": "Adv Concepts Medicinal Chem",
    "fullname": "Advanced Concepts in Medicinal Chemistry: Combinatorial Methods in Chemical Biology",
    "info": "Principles of current combinatorial methods for generation of biological/chemical libraries. Emphasizes utility in biology and in drug design. Material is drawn from primary literature.\n\nprereq: [2302 or equiv], [BioC 4331 or equiv]",
    "prereq": {
      "and": [
        {
          "or": [
            "002393"
          ]
        },
        {
          "or": [
            "002945"
          ]
        }
      ]
    }
  },
  {
    "uid": "004153",
    "code": "CHEM8715",
    "subject": "CHEM",
    "number": "8715",
    "honors": false,
    "writing": false,
    "name": "Phys Inorg Chem",
    "fullname": "Physical Inorganic Chemistry",
    "info": "Physical methods and concepts applied to inorganic and organometallic systems, including many of the following methods: NMR, IR, UV-VIS, ESR, M[ö]ssbauer and mass spectroscopy, magnetic measurements, X-ray diffraction.\n\nprereq: 4701 or equiv, grad chem major or instr consent",
    "prereq": {
      "or": [
        "002408"
      ]
    }
  },
  {
    "uid": "004155",
    "code": "CHEM8725",
    "subject": "CHEM",
    "number": "8725",
    "honors": false,
    "writing": false,
    "name": "Organomet Chem",
    "fullname": "Organometallic Chemistry",
    "info": "Synthesis, reactions, structures, and other important properties of main group and transition metal organometallic compounds; treatment in terms of modern electronic and structural theory; emphasis on their use as stoichiometric and homogeneous catalytic reagents in organic and inorganic systems.\n\nprereq: 4701 or equiv, grad chem major or instr consent",
    "prereq": {
      "or": [
        "002408"
      ]
    }
  },
  {
    "uid": "004157",
    "code": "CHEM8735",
    "subject": "CHEM",
    "number": "8735",
    "honors": false,
    "writing": false,
    "name": "Bioinorg Chem",
    "fullname": "Bioinorganic Chemistry",
    "info": "Survey of role of metal ions in biology; emphasizes structure, function, and spectroscopy of metalloproteins and their synthetic analogs.\n\nprereq: 4701 or equiv, grad chem major or instr consent",
    "prereq": {
      "or": [
        "002408"
      ]
    }
  },
  {
    "uid": "004159",
    "code": "CHEM8745",
    "subject": "CHEM",
    "number": "8745",
    "honors": false,
    "writing": false,
    "name": "Adv Inorg Chem",
    "fullname": "Advanced Inorganic Chemistry",
    "info": "Survey of topics in main group and transition metal chemistry; emphasizes synthesis, structure, physical properties, and chemical reactivity.\n\nprereq: 8715, grad chem major or instr consent",
    "prereq": {
      "or": [
        "004153"
      ]
    }
  },
  {
    "uid": "788579",
    "code": "CHEM8777",
    "subject": "CHEM",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "004161",
    "code": "CHEM8780",
    "subject": "CHEM",
    "number": "8780",
    "honors": false,
    "writing": false,
    "name": "spec top inorg chem",
    "fullname": "Special Topics in Inorganic Chemistry",
    "info": "Topics (and availability) vary by year depending on instructor and development of the field.\n\nprereq: Grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "004162",
    "code": "CHEM8880",
    "subject": "CHEM",
    "number": "8880",
    "honors": false,
    "writing": false,
    "name": "spec topics in chem",
    "fullname": "Special Topics in Chemistry",
    "info": "Topics (and availability) vary depending on instructor and development of the field.\n\nprereq: Grad chem major or instr consent",
    "prereq": {}
  },
  {
    "uid": "787838",
    "code": "CHEM8888",
    "subject": "CHEM",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  }
]