[
  {
    "uid": "798360",
    "code": "CMGT2019",
    "subject": "CMGT",
    "number": "2019",
    "honors": false,
    "writing": false,
    "name": "AutoCAD for Construction Mgrs",
    "fullname": "AutoCAD for Construction Managers",
    "info": "Most current version of AutoCAD software skills and construction concepts. 2-D techniques and business applications of computer-aided drafting (CAD) at job entry level.\n\nprereq: 30 sem cr",
    "prereq": {}
  },
  {
    "uid": "788913",
    "code": "CMGT3001W",
    "subject": "CMGT",
    "number": "3001",
    "honors": false,
    "writing": true,
    "name": "Introduction to Construction",
    "fullname": "Introduction to Construction",
    "info": "A wide range of construction-related topics and an overview of the industry itself are presented: type and size of projects, where the industry has come from and where it appears to be heading, and roles and responsibilities of participants. Through assignments and projects, the course defines project and construction sequences, materials and building systems, and project scheduling and delivery methods. Students will conduct research into construction materials, sustainability, and self-selected topics. As a writing intensive course focused on developing skills crucial to professionals, it requires the production and revision of a variety of construction documents, including drawings and specifications.",
    "prereq": {}
  },
  {
    "uid": "827236",
    "code": "CMGT3009",
    "subject": "CMGT",
    "number": "3009",
    "honors": false,
    "writing": false,
    "name": "Construction Technology Apps",
    "fullname": "Construction Technology Applications",
    "info": "The construction industry as a whole is getting more tech-enabled. This course will build the awareness of relevant technologies and their essential functions that students need for success in Construction Management coursework as well as their present or future careers. It may also help them in obtaining their internship and possible baseline software certification from the platform, when available. Software applications include Procore project management, Bluebeam .pdf management, Microsoft Project scheduling, and selected uses of Microsoft Excel spreadsheet design and functions.  \n\nBasic computer literacy recommended",
    "prereq": {}
  },
  {
    "uid": "791698",
    "code": "CMGT3011",
    "subject": "CMGT",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "Construction Plan Reading",
    "fullname": "Construction Plan Reading",
    "info": "Intro to construction plan reading and construction documents (using architectural, civil, mechanical, electrical drawings and project manual). Read, understand, and interpret commercial construction plans and project manuals, including notes, symbols, and plan layout.",
    "prereq": {}
  },
  {
    "uid": "808502",
    "code": "CMGT3024W",
    "subject": "CMGT",
    "number": "3024",
    "honors": false,
    "writing": true,
    "name": "Facility Programming & Design",
    "fullname": "Facility Programming and Design",
    "info": "Facility Programming and Design moves through the process of defining a building-related need, evaluating the existing facility, exploring design solutions, and presenting a business case for the final project. This course is constructed from the viewpoint of the facility manager, and each step of the instruction and each assignment builds to the final project and presentation. It is a requirement for Construction Management degree and certificate students. It can also be used as an elective for undergraduate or graduate students pursuing degrees in architecture, civil engineering, facility management, interior design, housing studies, and other related majors.\n\nThere are no formal prerequisites, but it is recommended that students have completed at least one of the following: \n1. CMgt 3011 (Construction Plan Reading) or CMgt 3001/3001W (Introduction to Construction) taken before or simultaneously with this course; 2. completion of a first or second year architecture or interior design studio; 3. relevant prior experience in the facility management industry; 4. approval of the instructor.\n",
    "prereq": {
      "or": [
        "791698",
        "788913"
      ]
    }
  },
  {
    "uid": "003336",
    "code": "CMGT3202",
    "subject": "CMGT",
    "number": "3202",
    "honors": false,
    "writing": false,
    "name": "Surveying & Mapping",
    "fullname": "Surveying & Mapping",
    "info": "Theory of precision measurements of distance, elevation, angle, and direction of points/lines above, on, or beneath earth's surface. Establishing such points/lines. Elements of coordinate systems, datum planes, and maps.prereq: CSE or Construction Mgmt",
    "prereq": {}
  },
  {
    "uid": "816560",
    "code": "CMGT4000",
    "subject": "CMGT",
    "number": "4000",
    "honors": false,
    "writing": false,
    "name": "Construction through Time",
    "fullname": "The Construction Industry through Time and Tomorrow",
    "info": "This course centers on the construction industry in all its facets. The intention is to ensure that students taking it are provided with an in-depth understanding of how the industry evolved from early times to the present day and where the industry may be heading in the future. Equipped with this knowledge, graduates will be in a better position to understand their role in whichever sector of the industry they choose to build their careers and to contribute to positive change and improvement in how the industry serves its clients. It should be emphasized that this course is neither a history of architectural or engineering design, nor of construction technology, but concentrates rather on industry structure, organization, and the way it delivers its products.",
    "prereq": {}
  },
  {
    "uid": "816874",
    "code": "CMGT4001",
    "subject": "CMGT",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Innovative Contracting",
    "fullname": "Innovative Contracting",
    "info": "The triple constraint of time/cost/quality has often been challenged by traditional design/bid/build delivery methods. The private sector has had a unique advantage in its ability to negotiate contracts in the absence of firm bidding rules, including the extensive use of design/build delivery methods, while the public sector has been required by statute to bid to the lowest responsible bidder using design/bid/build. In an attempt to find the right balance that respects the competitive public bidding process while taking advantage of alternative project delivery strategies, the public sector has used enabling legislation to aggressively find new ways to contract project delivery, improving quality, speed of delivery, and cost management while reducing risk. This course will explore the methods of innovative contracting used by MnDOT and their underlying strategies, techniques, metrics, and outcomes, using a case study approach.",
    "prereq": {}
  },
  {
    "uid": "819743",
    "code": "CMGT4002",
    "subject": "CMGT",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Lean Construction",
    "fullname": "Lean Construction",
    "info": "An introduction to lean principles and how they can be applied to the design and construction industrIes.\nPrerequisites:  None, although planning/scheduling coursework or experience is recommended.",
    "prereq": {}
  },
  {
    "uid": "816816",
    "code": "CMGT4003",
    "subject": "CMGT",
    "number": "4003",
    "honors": false,
    "writing": false,
    "name": "Managing with BIM",
    "fullname": "Managing with Building Information Modeling",
    "info": "For 5,000 years we have used hand drawings to communicate ideas and methodologies, from Egyptian hieroglyphs to computer technology. Building information modeling (BIM) computer models act as simulators, analyzing architectural programs, materials, energy usage, constructability, construction sequencing, and more, down to tens of micrometers. Today, building systems such as sheet metal and steel are fabricated directly from 3D models; material quantities are extracted from modeled objects and tied to cost early in the design process; coordinated models are visualized by project teams, clarifying scope, and providing a vehicle for communication.  This course combines high-level technical training in BIM software with theoretical processes for managing a construction project using BIM techniques and tools.\nPrereqs: None. However, if you have no prior experience with construction, we recommend CMgt 3001 - Intro to Construction and CMgt 4021 - Construction Planning and Scheduling for knowledge of industry project delivery.  Basic computer skills are required.",
    "prereq": {}
  },
  {
    "uid": "013688",
    "code": "CMGT4011",
    "subject": "CMGT",
    "number": "4011",
    "honors": false,
    "writing": false,
    "name": "Const Documents & Contracts",
    "fullname": "Construction Documents and Contracts",
    "info": "Definition, interpretation, and utilization of drawings. Specifications, agreements, bidding forms, general conditions. Bonds, contracts, subcontracts, and related documents. Appropriate provisions for minority business participation, such as tax exempt status and wage rates.\n\nprereq: 3001, 45 sem cr",
    "prereq": {
      "and": [
        "788913"
      ]
    }
  },
  {
    "uid": "013701",
    "code": "CMGT4012",
    "subject": "CMGT",
    "number": "4012",
    "honors": false,
    "writing": false,
    "name": "Risk Mgmt, Bonds & Insurance",
    "fullname": "Risk Management, Bonds, and Insurance",
    "info": "Identification/evaluation of property, liability, and financial risks of a construction project. Tools of risk control/financing. Review of insurance coverage, contract bonds, and underwriting factors.",
    "prereq": {}
  },
  {
    "uid": "013719",
    "code": "CMGT4013",
    "subject": "CMGT",
    "number": "4013",
    "honors": false,
    "writing": false,
    "name": "Legal/Ethical/Risk IssuesConst",
    "fullname": "Legal, Ethical, and Risk Issues in Construction",
    "info": "Introduces key legal, ethical, and risk frameworks that apply to construction activity and the work of the construction management professional. Case studies. Strategies to minimize/allocate legal liability and risk.",
    "prereq": {}
  },
  {
    "uid": "016924",
    "code": "CMGT4015",
    "subject": "CMGT",
    "number": "4015",
    "honors": false,
    "writing": false,
    "name": "Intro Digital Tech",
    "fullname": "Introduction to Digital Technologies in the Construction Industry",
    "info": "Role of information technology in the construction industry. Current/future uses of technology by owners, general contractors, subcontractors, facilities management personnel. Networking, databases, wireless communication, software selection, Web-based project management, online plan rooms.",
    "prereq": {}
  },
  {
    "uid": "788806",
    "code": "CMGT4016",
    "subject": "CMGT",
    "number": "4016",
    "honors": false,
    "writing": false,
    "name": "Construction Software",
    "fullname": "Construction Software",
    "info": "Current/future uses of technology by owners, general contractors, subcontractors, and facilities management personnel. Networking, databases, wireless communication, software selection, Web-based project management, online plan rooms. Hands-on, workshop environment.",
    "prereq": {}
  },
  {
    "uid": "788843",
    "code": "CMGT4017",
    "subject": "CMGT",
    "number": "4017",
    "honors": false,
    "writing": false,
    "name": "Web-based Project Management",
    "fullname": "Web-based Project Management",
    "info": "Selection/implementation of Web-based project management tools. Software such as Bidcom, E-builder, Bricsnet, Constructware, Frametech. Hands-on work with live building sites.",
    "prereq": {}
  },
  {
    "uid": "788844",
    "code": "CMGT4018",
    "subject": "CMGT",
    "number": "4018",
    "honors": false,
    "writing": false,
    "name": "E-Business in Construction",
    "fullname": "E-Business in Construction",
    "info": "Selection/implementation of Web-based project management tools. Software such as Bidcom, E-builder, Bricsnet, Constructware, Frametech. Hands-on work with live building sites. Digital technologies in construction industry. Wire/wireless communication, online plan/bid rooms, mobile computing, video conferencing.",
    "prereq": {}
  },
  {
    "uid": "790675",
    "code": "CMGT4019",
    "subject": "CMGT",
    "number": "4019",
    "honors": false,
    "writing": false,
    "name": "Autocad for Construction Mgrs",
    "fullname": "Autocad for Construction Managers",
    "info": "Entry-level techniques of computer aided drafting (AutoCAD). Lecture/lab.",
    "prereq": {}
  },
  {
    "uid": "013722",
    "code": "CMGT4021",
    "subject": "CMGT",
    "number": "4021",
    "honors": false,
    "writing": false,
    "name": "Intro Const Planng & Schedulng",
    "fullname": "Introduction to Construction Planning and Scheduling",
    "info": "Provides introductory knowledge and skill set to create an overall plan for building a construction project from concept through completion. Students will learn how to accurately communicate a plan, use resources, adapt to variability, and utilize lean practices to create a project flow that delivers value in the least wasteful way, using commercial software on personal computers. They will be required to participate in a team that collaborates outside of the classroom.  \n\nPrereq: 3001, 3011 (or CE 4101), 45 semester credits. ",
    "prereq": {}
  },
  {
    "uid": "013726",
    "code": "CMGT4022",
    "subject": "CMGT",
    "number": "4022",
    "honors": false,
    "writing": false,
    "name": "Construction  Estimating",
    "fullname": "Construction Estimating",
    "info": "Purposes/uses of various estimates. Performing quantity take-off, organizing bidding process. Requesting/analyzing subcontractor proposals. Unit pricing. Using published resources. Preparing systems-based estimates. Related software, spreadsheets, custom applications. Linkages among estimates, budgets, cost control systems, and cost records.\n\nprereq: 3001, 3011, 45 sem cr",
    "prereq": {
      "and": [
        "788913",
        "791698"
      ]
    }
  },
  {
    "uid": "013728",
    "code": "CMGT4023",
    "subject": "CMGT",
    "number": "4023",
    "honors": false,
    "writing": false,
    "name": "Value Engineering",
    "fullname": "Value Engineering",
    "info": "Step by step approach. Defining building system/materials functions. Allocating cost to functions. Defining alternative methods to perform functions. Evaluating methods for best value. Five phases of function analysis (value engineering): information, creative, evaluation, planning, implementation.",
    "prereq": {}
  },
  {
    "uid": "788870",
    "code": "CMGT4024",
    "subject": "CMGT",
    "number": "4024",
    "honors": false,
    "writing": false,
    "name": "EstimatingValueEngineering",
    "fullname": "Estimating and Value Engineering",
    "info": "Purposes/uses of various kinds of estimates. Performing quantity take-off. Organizing bidding. Requesting/analyzing subcontractor proposals. Unit pricing. Using published resources. Preparing systems-based estimates. Personal computer programs, spreadsheets, custom applications. Defining building system, materials function. Allocating cost. Defining alternative methods for performing. Evaluating to yield best value.",
    "prereq": {}
  },
  {
    "uid": "790676",
    "code": "CMGT4025",
    "subject": "CMGT",
    "number": "4025",
    "honors": false,
    "writing": false,
    "name": "Comp-Based Constrct Plan&Sched",
    "fullname": "Computer-Based Construction Planning and Scheduling",
    "info": "Project planning, scheduling, and control. Considering/understanding alternatives. Industry techniques such as critical path method. Updating/analyzing project schedules.",
    "prereq": {}
  },
  {
    "uid": "791262",
    "code": "CMGT4026",
    "subject": "CMGT",
    "number": "4026",
    "honors": false,
    "writing": false,
    "name": "Comp-Based Constrct Estimating",
    "fullname": "Computer-Based Construction Estimating",
    "info": "Various kinds of estimates via computer. Techniques for performing quantity take-off, organizing bidding process, requesting/analyzing subcontractor proposals, unit pricing, utilizing published resources, and preparing systems-based estimates. Personal computer programs, spreadsheets, custom applications. Linkages between estimates, budgets, cost control systems, and historical cost records.",
    "prereq": {}
  },
  {
    "uid": "791949",
    "code": "CMGT4027",
    "subject": "CMGT",
    "number": "4027",
    "honors": false,
    "writing": false,
    "name": "Comp-Based Project Management",
    "fullname": "Computer-Based Project Management",
    "info": "Practical application of construction project management using computer software. Students manage one or two real projects through all phases of construction. Planning, scheduling, budgeting, estimating, staffing projections, cost control, communication tools.",
    "prereq": {}
  },
  {
    "uid": "016247",
    "code": "CMGT4031",
    "subject": "CMGT",
    "number": "4031",
    "honors": false,
    "writing": false,
    "name": "Const Safety & Loss Control",
    "fullname": "Construction Safety and Loss Control",
    "info": "Introduction to construction safety, health, and loss control. Hazard recognition. Control procedures. Management systems for measuring/evaluating loss-control performances in construction industry.\n\nprereq: 3001, 45 sem cr",
    "prereq": {
      "and": [
        "788913"
      ]
    }
  },
  {
    "uid": "016245",
    "code": "CMGT4041W",
    "subject": "CMGT",
    "number": "4041",
    "honors": false,
    "writing": true,
    "name": "Spec &Tech Writing for Constrn",
    "fullname": "Specifications and Technical Writing for Construction Professionals",
    "info": "Develop/enhance appropriate oral/written communication necessary for use in the construction process from planning phase through contract closeout. Develop construction-specific practical applications to facilitate the process and avoid common pitfalls.\n\nprereq: 4011 or concurrent registration is required (or allowed) in 4011",
    "prereq": {
      "or": [
        "013688"
      ]
    }
  },
  {
    "uid": "791430",
    "code": "CMGT4051",
    "subject": "CMGT",
    "number": "4051",
    "honors": false,
    "writing": false,
    "name": "Constrctn Materials for Mangrs",
    "fullname": "Construction Materials for Managers",
    "info": "Concepts of physical properties. Behavior mechanisms for construction materials such as concrete, aggregate, steel, and wood. Standard specifications for material properties. Lab techniques for evaluation of each material.\n\nprereq: 3001, [AEM 2011 or BP 3001 or BP 3101], 45 sem cr",
    "prereq": {
      "and": [
        "788913",
        {
          "or": [
            "004329"
          ]
        }
      ]
    }
  },
  {
    "uid": "807764",
    "code": "CMGT4073",
    "subject": "CMGT",
    "number": "4073",
    "honors": false,
    "writing": false,
    "name": "Building Codes for Const Mgrs",
    "fullname": "Building Codes for Construction Managers",
    "info": "Building codes history, foundation, structure, and organization. Importance to the built environment throughout building life cycle: design, construction, occupancy, demolition. Code compliance and role of building code official. Interpretation and application to specific scenarios. Recognizing and correcting code deficiencies.\n\nprereq: 45 cr or instr consent",
    "prereq": {}
  },
  {
    "uid": "808419",
    "code": "CMGT4081",
    "subject": "CMGT",
    "number": "4081",
    "honors": false,
    "writing": false,
    "name": "Erosion and Sediment Control",
    "fullname": "Managing Erosion and Sediment Control on Construction Sites",
    "info": "Designed for those who will supervise, run, or direct construction site operations, grading, culvert replacement, and bridge construction. Best management practices to reduce or control erosion and sedimentation. Topics include permit requirements, stakeholder roles and responsibilities, sample specifications, and using the Storm Water Pollution Prevention Plan (SWPPP). Soil erodibility, turf establishment techniques, grading techniques to minimize erosion, timing of installations, and proper application of best management practices are also covered. Students will learn how to implement an erosion and sediment control plan, the requirements of various regulatory agencies, and consequences of permit violations.  Can be used to achieve the Erosion and Stormwater Construction Site Management Certification, which is required by the Minnesota Department of Transportation Standard Specifications on construction sites.\nprereq: CMGT 3001- Introduction to the Built Environment OR relevant experience\n\n",
    "prereq": {
      "or": [
        "788913"
      ]
    }
  },
  {
    "uid": "796123",
    "code": "CMGT4111",
    "subject": "CMGT",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "Construction Productivity Mgmt",
    "fullname": "Construction Productivity Management",
    "info": "How to manage/supervise a project to maximize effectiveness/efficiency. Applying theoretical concepts of improving productivity in people, materials, equipment, and processes via on-going case study. Leadership/communication as applied to construction industry.",
    "prereq": {}
  },
  {
    "uid": "014590",
    "code": "CMGT4193",
    "subject": "CMGT",
    "number": "4193",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Independent project. Topic arranged with/supervised by construction management faculty.\n\nprereq: Admitted to CMgt major or minor or certificate",
    "prereq": {}
  },
  {
    "uid": "013730",
    "code": "CMGT4196",
    "subject": "CMGT",
    "number": "4196",
    "honors": false,
    "writing": false,
    "name": "Construction Mgmt Internship",
    "fullname": "Construction Management Internship",
    "info": "Hands-on work experience within a construction company, applying previous coursework in the workplace, contributing knowledge of best practices, and participating in career and business development exercises.\n\nprereq: [[CMgt] major or minor or certificate student], [jr or sr], dept consent",
    "prereq": {}
  },
  {
    "uid": "796124",
    "code": "CMGT4201",
    "subject": "CMGT",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Construction Accounting",
    "fullname": "Construction Accounting",
    "info": "Unique characteristics and dissimilarities crucial for all parties involved to understand/manage the construction process. Unique aspects of construction financial accounting, managerial accounting, tax planning, and auditing.\n\nprereq: 3001, Acct 2050, ABus 4101",
    "prereq": {
      "and": [
        "788913",
        "015093"
      ]
    }
  },
  {
    "uid": "808522",
    "code": "CMGT4215",
    "subject": "CMGT",
    "number": "4215",
    "honors": false,
    "writing": false,
    "name": "Facil Quality Assess & Commiss",
    "fullname": "Facility Quality Assessment and Commissioning",
    "info": "How to assess condition/quality of building site, exterior/interior of facility, and  building equipment. Evaluating effectiveness/efficiency of facility operations/maintenance program. What to look for during building audits. How to write professional assessment reports. How to make useful recommendations for improvements. Value/purpose of building commissioning/ re-commissioning.\n\nprereq: 3001, [4213 or concurrent registration is required (or allowed) in 4213}, 4542, 4562",
    "prereq": {
      "or": [
        "788913",
        "800369",
        "806841"
      ]
    }
  },
  {
    "uid": "818169",
    "code": "CMGT4301",
    "subject": "CMGT",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Occupational Hlth/Safety Prins",
    "fullname": "Occupational Health and Safety Principles",
    "info": "While OSHA (Occupational Safety and Health Administration) remains the governmental regulatory agency, the responsibility for occupational safety and health of employees has evolved into an integral part of a variety of industries, including construction, health care, oil and gas extraction, and many more. The course provides a comprehensive understanding of environmental health and safety standards and their application to the management of workplace injury prevention and health promotion.\n\nprereq: 45 credits",
    "prereq": {}
  },
  {
    "uid": "818170",
    "code": "CMGT4302",
    "subject": "CMGT",
    "number": "4302",
    "honors": false,
    "writing": false,
    "name": "Environmental Health Princpls",
    "fullname": "Environmental Health Principles",
    "info": "The construction industry has one of the highest morbidity and mortality rates among professions, and there is also an economic implication. Companies can reduce the risk of injuries, diseases, and death due to environmental hazards by implementing an appropriate health and safety plan. Plans must be continually reviewed to ensure they are current with new products, scientific evidence, legal parameters, and cultural changes. This course will review requirements and provide direction in controlling regulations related to environmental and occupational health, chemical and biological safety, hazardous materials, and other health hazards.\n\nprereqs: 45 credits completed. Some knowledge of construction management principles is strongly recommended.\n",
    "prereq": {}
  },
  {
    "uid": "819160",
    "code": "CMGT4303",
    "subject": "CMGT",
    "number": "4303",
    "honors": false,
    "writing": false,
    "name": "Industrial Hygiene Principles",
    "fullname": "Industrial Hygiene Principles",
    "info": "Overview of the practice of industrial hygiene: the science of anticipating, recognizing, evaluating, and controlling workplace conditions that may cause workers' injury or illness.   Presents critical topics to enhance technical skills, deepen understanding, and gain the necessary knowledge and tools to apply the principles of Industrial hygiene effectively, efficiently, and reasonably, including hazard types, routes of exposure, and determination of exposure levels,  Also explores the industrial hygiene hazard evaluation process and how it applies to the goal of workplace safety, as well as related federal and state regulations.  Students will examine specific workplace problems related to worker health and safety.\nPrerequisites:  None",
    "prereq": {}
  },
  {
    "uid": "819161",
    "code": "CMGT4304",
    "subject": "CMGT",
    "number": "4304",
    "honors": false,
    "writing": false,
    "name": "Fire & Life Safety Principles",
    "fullname": "Fire and Life Safety Principles",
    "info": "Provides an overview of the fire and life safety requirements for new and existing buildings, as indicated in the National Fire Protection Association (NFPA) Life Safety Code.  The Code addresses life safety for fire emergencies, but also other types of emergencies, such as bomb threats. The purpose of the Code is to establish minimum requirements that will provide a reasonable degree of safety during emergencies in any structure. To apply the Code effectively, one must understand its legal authority in various jurisdictions, Code navigation, and the ways proper application of the Code can minimize the effects of a devastating fire or other emergency.  Specific topics include building classification, types of construction, fire protection, means of egress, and occupancy features. The course will enhance technical skills and provide knowledge and tools to apply the Code effectively, efficiently, and reasonably. Students will prepare a facility compliance checklist that can be used in everyday execution of the principles learned in this course.\nPrerequisites:  None",
    "prereq": {}
  },
  {
    "uid": "819162",
    "code": "CMGT4305",
    "subject": "CMGT",
    "number": "4305",
    "honors": false,
    "writing": false,
    "name": "Health & Safety Planning/Mgmt",
    "fullname": "Health and Safety Planning and Management",
    "info": "Companies can reduce the risk of injury, disease, and death due to environmental hazards by implementing an appropriate health and safety plan. Each plan must be continually reviewed to ensure it is current with new products, scientific evidence, legal parameters, and cultural changes. This course is a comprehensive study of the essential components of an effective safety planning and management system. It also examines the cultural aspects of integrating total safety planning and management into all levels of an operation.\nPrerequisites:  None",
    "prereq": {}
  },
  {
    "uid": "827174",
    "code": "CMGT4421",
    "subject": "CMGT",
    "number": "4421",
    "honors": false,
    "writing": false,
    "name": "Advanced Constr Scheduling",
    "fullname": "Advanced Construction Scheduling",
    "info": "This course builds on the prerequisite course CMGT 4021 - Construction Planning and Scheduling. Students will gain technical literacy and competency when crafting a detailed construction project schedule intended for the execution of the flow of work that will meet or exceed modern industry scheduling standards. Using Microsoft Project and Procore software, the student will apply and communicate principles of sequencing, duration, and resource leveling while also implementing applicable lean principles.",
    "prereq": {
      "or": [
        "013722"
      ]
    }
  },
  {
    "uid": "807800",
    "code": "CMGT4422",
    "subject": "CMGT",
    "number": "4422",
    "honors": false,
    "writing": false,
    "name": "Advanced Constr Cost Estimatng",
    "fullname": "Advanced Construction Cost Estimating",
    "info": "Advanced estimating concepts, including procurement, productivity, and value engineering. Working in teams, students develop and deliver a competitive bid for a real project and examine strategies to meet the owner's budget and expectations through value engineering approaches.\n\nprereq: CMGT 4022 or instr consent",
    "prereq": {
      "or": [
        "013726"
      ]
    }
  },
  {
    "uid": "807427",
    "code": "CMGT4471",
    "subject": "CMGT",
    "number": "4471",
    "honors": false,
    "writing": false,
    "name": "Sustainability forConst Mgrs",
    "fullname": "Sustainability for Construction Managers",
    "info": "Building industry's impact on the environment; sustainable building initiatives; environmental principles and practices in pre-con, construction, close-out and operations; impact on construction manager role, procurement methods, contracts, estimating and scheduling, and team structure; green adoption issues; current technologies; future trends. ",
    "prereq": {}
  },
  {
    "uid": "800369",
    "code": "CMGT4542",
    "subject": "CMGT",
    "number": "4542",
    "honors": false,
    "writing": false,
    "name": "Building Energy Systems",
    "fullname": "Building Energy Systems",
    "info": "Functions of building mechanical systems, their integration with other building components. Residential/commercial HVAC systems, alternative energy sources, energy effciency, structural implications of mechanical systems, indoor air quality, environmental strategies. Case studies.\n\nprereq: [3001, [jr or sr]] or instr consent",
    "prereq": {
      "and": [
        "788913"
      ]
    }
  },
  {
    "uid": "816570",
    "code": "CMGT4544",
    "subject": "CMGT",
    "number": "4544",
    "honors": false,
    "writing": false,
    "name": "Materials and Structures I",
    "fullname": "Materials and Structures I",
    "info": "First part of the two-semester statics/materials/structures sequence. Introduces basic statics as it relates to structural analysis, including a fundamental understanding of forces, loads, shears, and moments applied to structural elements. These principles will be applied through the development of beam diagrams using load path analysis. Provides an introduction to building structural systems and their design and construction process, and covers building loads and the methods of analyzing and designing structural elements such as beams and columns. Discusses the path of loads applied to a building and the structural materials\u0097specifically, wood and steel\u0097that are commonly used to support these loads in building construction. Finally, the course provides an overview of the tools and techniques used by the structural engineer in the course of building design, as well as basic procedures for choosing materials and member sizes for use in a building system.",
    "prereq": {}
  },
  {
    "uid": "816828",
    "code": "CMGT4545",
    "subject": "CMGT",
    "number": "4545",
    "honors": false,
    "writing": false,
    "name": "Materials and Structures II",
    "fullname": "Materials and Structures II",
    "info": "Building on the engineering, materials, and structural concepts of Materials and Structures I, this course explores concrete as a material (components, manufacture, installation, and mix design), and in terms of its structural uses. Soils and aggregates (origin, analysis, and classification) and earthwork/compaction concepts are also surveyed.  Laboratory testing of these materials is included. These two broad topics are then combined with masonry concepts to discuss foundations, retaining walls, slabs, and footings. Finally, lateral systems within a structure are discussed. An overall curriculum project (which will refer back to M&S I) will examine a real-world structural system, including loading, engineering, materials, and construction aspects.\n\nprereq:  CMgt 4544",
    "prereq": {
      "and": [
        "816570"
      ]
    }
  },
  {
    "uid": "791195",
    "code": "CMGT4550",
    "subject": "CMGT",
    "number": "4550",
    "honors": false,
    "writing": false,
    "name": "Topics in Construction Mgmt",
    "fullname": "Topics in Construction Management",
    "info": "Seminar. Timely issues/themes in construction management.",
    "prereq": {}
  },
  {
    "uid": "806841",
    "code": "CMGT4562",
    "subject": "CMGT",
    "number": "4562",
    "honors": false,
    "writing": false,
    "name": "Building Envelope Design/Const",
    "fullname": "Building Envelope Design and Construction",
    "info": "Science behind design of a weather-tight building envelope. Construction principles for foundations, exterior walls, windows, opening, roofs. Consequences of poor design/construction. Component review of building envelope (shell) elements. Testing/quality control strategies. Construction issues/envelope sequencing.\n\nprereq: None, but 4542 or 4572 or professional experience recommended",
    "prereq": {
      "or": [
        "800369",
        "798966"
      ]
    }
  },
  {
    "uid": "798966",
    "code": "CMGT4572",
    "subject": "CMGT",
    "number": "4572",
    "honors": false,
    "writing": false,
    "name": "StrucFrames&BldgDsgn/Cnstrctn",
    "fullname": "Structural Frames and Building Design/Construction",
    "info": "Basic contemporary structural systems in masonry, steel, and wood framing systems. Forms/performance of systems.\n\nprereq: 3001, [AEM 2011 or BP 3001 or BP 3101]",
    "prereq": {
      "and": [
        "788913",
        {
          "or": [
            "004329"
          ]
        }
      ]
    }
  },
  {
    "uid": "806420",
    "code": "CMGT4861",
    "subject": "CMGT",
    "number": "4861",
    "honors": false,
    "writing": false,
    "name": "Construction Mgmt Capstone",
    "fullname": "Construction Management Capstone",
    "info": "Using a case study approach, explores concepts of project management, decision theory, and leadership needed to solve critical, complex, and even routine problems within construction businesses and their projects. Students will be required to think critically and creatively about the possible solutions and be able to effectively articulate those solutions. It will apply all prior construction management-related coursework into a comprehensive construction and facility project management capstone intended to demonstrate mastery of the construction and facility management body of knowledge prior to graduation. prereqs: CMGT 4011, 4021, 4022, and 4031 (which may be taken concurrently with instructor permission).",
    "prereq": {
      "and": [
        "013688",
        "013722",
        "013726",
        "016247"
      ]
    }
  },
  {
    "uid": "791196",
    "code": "CMGT4901",
    "subject": "CMGT",
    "number": "4901",
    "honors": false,
    "writing": false,
    "name": "Comm & Construction Process",
    "fullname": "Communication and the Construction Process",
    "info": "Traces construction project from client's idea to completion. Interaction skills that construction managers need to deliver a building project through the hoops, hurdles, and pitfalls of its lifecycle. Managerial written/oral communication skills/techniques. Guest speakers, student debates in mock situations.",
    "prereq": {}
  }
]