[
  {
    "uid": "003881",
    "code": "COMM1101",
    "subject": "COMM",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Public Speaking",
    "fullname": "Introduction to Public Speaking",
    "info": "Public communication processes, elements, and ethics. Criticism of and response to public discourse. Practice in individual speaking designed to encourage civic participation. ",
    "prereq": {}
  },
  {
    "uid": "008617",
    "code": "COMM1102",
    "subject": "COMM",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Intro/Communication",
    "fullname": "Introduction to Communication",
    "info": "Verbal and nonverbal communication:  public address, interpersonal, organizational, intercultural, and electronic.  Ways in which new communication technologies influence and are influenced by existing forms of communication.",
    "prereq": {}
  },
  {
    "uid": "003893",
    "code": "COMM1313W",
    "subject": "COMM",
    "number": "1313",
    "honors": false,
    "writing": true,
    "name": "Analysis of Argument",
    "fullname": "Analysis of Argument",
    "info": "Strategies for analyzing, evaluating, generating arguments. Problems in listening/responding to argument.",
    "prereq": {}
  },
  {
    "uid": "808306",
    "code": "COMM1901",
    "subject": "COMM",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "791115",
    "code": "COMM1902",
    "subject": "COMM",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Freshman seminar. Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "800709",
    "code": "COMM1904",
    "subject": "COMM",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Toopics specified in Class Schedule.\n\nprereq: Fr or fewer than 30 cr",
    "prereq": {}
  },
  {
    "uid": "790589",
    "code": "COMM1905",
    "subject": "COMM",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "791114",
    "code": "COMM1907W",
    "subject": "COMM",
    "number": "1907",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "791378",
    "code": "COMM1908W",
    "subject": "COMM",
    "number": "1908",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "791143",
    "code": "COMM1909W",
    "subject": "COMM",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "803718",
    "code": "COMM1910W",
    "subject": "COMM",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "817033",
    "code": "COMM1911",
    "subject": "COMM",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Intro to Crisis Communication",
    "fullname": "Introduction to Crisis Communication",
    "info": "With this freshman seminar course students will be introduced to key concepts in crisis communication. We will explore key theories and case studies that illustrate the ways individuals and groups communicate during moments of crisis. As a freshman seminar, the course is designed to introduce students to the undergraduate study of communication. Students will begin to develop critical reading and writing skills that are central to a successful undergraduate education. The course bridges the fields of business communication, organizational communication, rhetorical studies, and critical media studies.\n\nAt the end of the course, students will emerge with better understanding of communicative practices during crises. Students will be encouraged to identify ethical and unethical communication practices. Students will also learn to discuss and recognize the larger societal and political implications of a variety of case studies.",
    "prereq": {}
  },
  {
    "uid": "817011",
    "code": "COMM1912",
    "subject": "COMM",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Sharing/Stealing Culture",
    "fullname": "Sharing/Stealing Culture: Copyright, Creativity, and Capitalism",
    "info": "We will spend the semester looking at a series of case studies (historical and contemporary, local, and global) that help to reveal some of the multiple complexities -- cultural, social, political, economic, aesthetic, ethical, technological, and otherwise -- that lie behind a seemingly simple concept: copyright.  Some of the major issues to be addressed include: internet filesharing/piracy and the difficulty of enforcing copyright in the digital age, racial borrowing/appropriation of cultural texts, practices, and styles, affective ownership (fans) vs. economic ownership (corporations), culture as a public good (the commons) vs. culture as private property (commerce), the use of copyright as a censorship tool, the politics of alternative forms of copyright (e.g., Creative Commons, open source, copyleft), and global/international discrepancies in copyright law/enforcement.",
    "prereq": {}
  },
  {
    "uid": "817018",
    "code": "COMM1913",
    "subject": "COMM",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "Religious Arguments",
    "fullname": "Religious Arguments",
    "info": "Religious arguments feature in a wide spectrum of global conflicts. In this seminar we will focus on the role that sacred texts play in justifying positions that religious groups take on such issues as the role of women, violence, the presence of evil, sexuality, attitude toward other religions, and the ultimate future of the earth. To examine these questions we must gain familiarity with standard analytical techniques and the assumptions, often unexamined, that both scholars and ordinary people use to amass sacred texts as evidence for their views. While centering on the role of the Bible in the major branches of Christianity, we will also discuss issues in Islam, the Sikhs, and the polytheistic religion of ancient Greece.",
    "prereq": {}
  },
  {
    "uid": "817877",
    "code": "COMM1914",
    "subject": "COMM",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "Food, Media, and Culture",
    "fullname": "Food, Media, and Culture",
    "info": "Food is intimately linked to media: meanings attached to what we eat are produced, distributed, and consumed via cookbooks, reality TV, restaurant reviews, social media, film, and advertisements. This seminar attempts to make visible what stories our culture tells itself about food. Therefore, as critical media theorists have argued, food media (and the rituals surrounding it) raise important questions in relation to power, identity, and ethics. Accordingly, food media are situated at the intersecting categories of race, class, gender, nationality, sexuality, and the environment. This course provides an introduction to the food and media nexus by drawing particular attention to the ways in which the political economy of the media, content analysis, ethnography, and audiences can lend unique insight into what we eat. Students will critically analyze food media across a wide-range of platforms and embark on field trips to restaurants and food-related sites in the Minneapolis-St. Paul area. ",
    "prereq": {}
  },
  {
    "uid": "817899",
    "code": "COMM1915",
    "subject": "COMM",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "Selfies & the Culture of Me",
    "fullname": "Selfies: Media and the Culture of Me",
    "info": "In 2013, Oxford Dictionaries announced \"selfie\" as their word of the year, explaining that usage had increased 17,000 percent in the English language in just twelve months. Defined as \"a photograph that one has taken of oneself, typically one taken with a smartphone or webcam and uploaded to a social media website,\" the selfie is now a staple of social media platforms from Facebook to Instagram, and taking and posting selfies has become a regular social practice, particularly for young people. How did this happen? This seminar examines the emerging media \"culture of me\" from a range of critical perspectives. Tracing the cultural history of the selfie from earlier forms of self-portraiture and first-person media to the rise of social media, we will examine the selfie phenomenon within broader cultural trends, from the explosion of ordinary people in the media to developments in interactive media technologies, micro celebrity, integrated marketing, and self-branding.",
    "prereq": {}
  },
  {
    "uid": "818802",
    "code": "COMM1916",
    "subject": "COMM",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Reproductive Justice",
    "fullname": "Reproductive Justice",
    "info": "According to SisterSong, the term Reproductive Justice refers to “the human right to maintain personal bodily autonomy, have children, not have children, and parent the children we have in safe and sustainable communities.” While many immediately think of abortion when they consider struggles for reproductive rights, pregnancy termination is only one small part of the story.  In this seminar, we will examine the history of social movements designed to provide women and men with reproductive autonomy, paying close attention to how those movements often failed to center the needs of those most marginalized.  This seminar will address the various elements that impact family creation including medical racism, economic (in)security, comprehensive sexual education, and environmental protections.  Students will learn how to critique and invent better reproductive rhetoric that more accurately accounts for the contextual complexities surrounding our reproductive moment.  ",
    "prereq": {}
  },
  {
    "uid": "819809",
    "code": "COMM1917",
    "subject": "COMM",
    "number": "1917",
    "honors": false,
    "writing": false,
    "name": "Sounds of Social Justice",
    "fullname": "Sounds of Social Justice",
    "info": "Tom Morello of Rage Against the Machine wrote, “Music and the arts feed our souls, but a decent wage puts food on the table. Musicians, fans of music, and grassroots political organizations are a potent force to fight for social justice.” This seminar will explore the soundscapes of contemporary activism from musical lyrics and protest chants to meditative silence and sonic weaponry. Together, we will work towards understanding the interplay between sound and social justice, examining the different sonic dimensions of cultural, political, and social rights around the world. We will consider issues of race, immigration, gender and sexuality, labor, and war with an eye (and an ear) towards what protest, progress, and change quite literally sound like. This course will make use of a wide range of media and learning styles, such as listening exercises, class discussions, field trips, and multimodal research projects. Ultimately, students will explore how our sonic realities inform our understanding and response to both cultural and human rights.",
    "prereq": {}
  },
  {
    "uid": "819879",
    "code": "COMM1918",
    "subject": "COMM",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "Communication and Sport",
    "fullname": "Analysis of the Intersection of Communication and Sport",
    "info": "Sports are something that illustrate both the best and worst aspects of society. On one hand, sports can provide common ground for those who may share few other similarities.  On the other hand, sports serve to construct and reinforce the very social and cultural differences they so effectively transcend.  Perhaps more than any other popular cultural arena, sports shape, illustrate, and bolster expectations for how people ought to conduct themselves depending on their racial, class, gender, and sexual identities.  Consequently, sporting events, the identity performances these events reinforce, and the way media outlets represent these events and performances can expose some of the most difficult and urgent questions within contemporary cultural theory, popular culture studies, and media studies.\n\nFocusing specifically on an American context, this course will combine theoretical and sports-oriented readings from communication scholars to discuss the roles sports play in American culture, their power to influence identity performances, and how sports are represented and consumed—from live events viewed in a stadium to fantasy sports.  We will examine how sports, as texts, help us to grapple with the intersections among identity, politics, media, and culture. \n",
    "prereq": {}
  },
  {
    "uid": "825134",
    "code": "COMM1919",
    "subject": "COMM",
    "number": "1919",
    "honors": false,
    "writing": false,
    "name": "Communication & Migration",
    "fullname": "Communication & Migration",
    "info": "Humans have long been on the move. The motives, circumstances, and practices of migration, however, have changed over time. This course will introduce students to various ways in which communication can facilitate or hinder migration. It will examine how stories by migrants and about migrants interlock to shape the historical and current frameworks that make immigration an enduring social and political issue. ",
    "prereq": {}
  },
  {
    "uid": "825750",
    "code": "COMM1921",
    "subject": "COMM",
    "number": "1921",
    "honors": false,
    "writing": false,
    "name": "True Crime Media",
    "fullname": "True Crime Media",
    "info": "This seminar explores true crime as a compelling and enduring media genre that originated with the rise of mass media and now proliferates across television, the Internet, and newer media formats such as podcasting. We will examine the cultural history of true crime media and learn theories and techniques for analyzing the conventions, meanings, popular appeals, and the societal implications of today?s fascination with true crime-based entertainment. Topics for exploration include the popular mediation of crime and justice, the role of gender, race, sexuality, and class in true crime media, and the involvement of audiences as true crime spectators, fans, and interactive citizen detectives. We will also consider how true crime media influences public assumptions about criminality, safety, and police and legal justice reform. ",
    "prereq": {}
  },
  {
    "uid": "825751",
    "code": "COMM1922",
    "subject": "COMM",
    "number": "1922",
    "honors": false,
    "writing": false,
    "name": "Music and the Environment",
    "fullname": "Music and the Environment",
    "info": "Music is an integral part of the human experience, including how we perceive, interpret, express, and interact with other living communities. Music helps us to understand the world, listen to others, and interpret the \"sound commons\" surrounding us. In other words, music is an essential form of environmental communication. This seminar will emphasize the ways in which musical composition, production, performance, and listening intersect with environmental movements, community organizing, ecological science, environmental philosophy, media, political institutions, and policy making. It is about music as a living and breathing art form, imbricated into ecological contexts, rather than abstracted out and isolated on stage, page, or museum exhibit (although those contexts also matter). We will talk directly with guest authors via Zoom and Public Lands Podcast interviews, using their research to spark seminar discussions and inspire student projects.",
    "prereq": {}
  },
  {
    "uid": "826340",
    "code": "COMM1923",
    "subject": "COMM",
    "number": "1923",
    "honors": false,
    "writing": false,
    "name": "Children, Media, & Moral Panic",
    "fullname": "Children, Media, and Moral Panics from Telephones to TikTok",
    "info": "Since the advent of the phonograph, the introduction of media technologies has been accompanied by concern about their contents' impacts on children. Some concerns have become intense enough to rise to the level of a moral panic, a concept we'll use to understand the social and historical forces at work in framing public responses to media content such as that found in radio, film, telephones, comic books, TV, the internet, and social media. Historical moral panics around jazz music, comic books, and TV violence have inspired legislation and even censorship to control children's access to particular kinds of media content. In this course, we will examine some of these moral panics--such as the one set in motion against comic books by psychiatrist Frederic Wertham's 1954 book Seduction of the Innocent--situate them in their historical and social contexts, and investigate both the forces behind such panics and the public responses they have inspired.",
    "prereq": {}
  },
  {
    "uid": "787650",
    "code": "COMM3110",
    "subject": "COMM",
    "number": "3110",
    "honors": false,
    "writing": false,
    "name": "Topics: Communication Studies",
    "fullname": "Topics in Communication Studies",
    "info": "Cases illustrating communication studies, theory, underlying issues.",
    "prereq": {}
  },
  {
    "uid": "016884",
    "code": "COMM3131",
    "subject": "COMM",
    "number": "3131",
    "honors": false,
    "writing": false,
    "name": "Leadership Theory/Practice",
    "fullname": "Leadership Theory and Practice",
    "info": "Preparation for New Student Program leadership position. Attitudes/skills with leadership and student life issues. Building authentic community.",
    "prereq": {}
  },
  {
    "uid": "003895",
    "code": "COMM3201",
    "subject": "COMM",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Electronic Media Production",
    "fullname": "Introduction to Electronic Media Production",
    "info": "Students work as a team to plan, script, and shoot video productions in a hands-on multi-camera television studio. By creating their own productions and reviewing the productions of others, students learn how media aesthetics shape the presentation of themes and messages.",
    "prereq": {}
  },
  {
    "uid": "802994",
    "code": "COMM3202",
    "subject": "COMM",
    "number": "3202",
    "honors": false,
    "writing": false,
    "name": "Audio Production and Podcast",
    "fullname": "Audio Production and Podcast Storytelling",
    "info": "Introductory experience with sound design and production in podcasting, soundscape composition, music, and film. How sound advances media narratives and communicates emotion. The role sound plays in the producer's and audience's construction of worlds. Field recording, Foley work, vocal recording, music, and team production of longform nonfiction narrative podcast.",
    "prereq": {}
  },
  {
    "uid": "793074",
    "code": "COMM3204",
    "subject": "COMM",
    "number": "3204",
    "honors": false,
    "writing": false,
    "name": "Adv Electronic Media Prod",
    "fullname": "Advanced Electronic Media Production",
    "info": "Video as communicative medium integrating visual/aural aesthetics.  Creation of broadcast-quality production integrating message creation, audience analysis, argument development, and visual/audio scripting. Utilization of media aesthetics to develop/shape production content.\n\nprereq: 3201 or instr consent",
    "prereq": {
      "or": [
        "003895"
      ]
    }
  },
  {
    "uid": "003948",
    "code": "COMM3211",
    "subject": "COMM",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "Introduction to Media Studies",
    "fullname": "Introduction to Media Studies",
    "info": "Historical development and current issues in electronic media technologies and programming. Effects of governmental, industrial, and public organizations on message content. Problem areas of electronic media.",
    "prereq": {}
  },
  {
    "uid": "800395",
    "code": "COMM3221",
    "subject": "COMM",
    "number": "3221",
    "honors": false,
    "writing": false,
    "name": "Musical Communication",
    "fullname": "Musical Communication",
    "info": "A critical media studies perspective on the production, distribution, consumption, circulation, and regulation of popular music.",
    "prereq": {}
  },
  {
    "uid": "800418",
    "code": "COMM3231",
    "subject": "COMM",
    "number": "3231",
    "honors": false,
    "writing": false,
    "name": "Reality TV: History/Culture/Ec",
    "fullname": "Reality TV: History, Culture, and Economics",
    "info": "Social, visual, cultural, economic, historical, and ethical dimensions of reality television.",
    "prereq": {}
  },
  {
    "uid": "800394",
    "code": "COMM3263W",
    "subject": "COMM",
    "number": "3263",
    "honors": false,
    "writing": true,
    "name": "Media Literacy",
    "fullname": "Media Literacy: Decoding Media Images and Messages",
    "info": "Analysis of media images/messages. Principles of literacy. Media content/industries. Media and identity. Media effects. Textbook/packet readings, videos, small groups of peer writing workshops, media analyses.",
    "prereq": {}
  },
  {
    "uid": "817479",
    "code": "COMM3341",
    "subject": "COMM",
    "number": "3341",
    "honors": false,
    "writing": false,
    "name": "Asian American Images",
    "fullname": "Asian American Images",
    "info": "From 19th-century anti-Chinese political cartoons to Harold and Kumar, visual representations of Asians in the United States have long influenced how Asian Americans are seen and treated. What are some of the ways that photography, graphic arts, and digital culture have pictured Asian Americans as aliens, citizens, immigrants, workers, family and community members, entertainers, and artists? Course topics will relate visual images to particular historical moments, including the early exclusion period and the \"yellow peril\" stereotype; WWII Japanese American incarceration and the drawings of Miné Okubo, and photo-journalism documenting U.S. military involvement in Southeast Asia and its aftermath. How do photographic and other images work to counter historical amnesia, heal traumatic loss, and document social injustice? Other weeks of the class will explore the ways that individuals, families, and communities use photographs, video, and other visual media to preserve a sense of connection and belonging. We will also look at how contemporary Asian American photographers such as Tseng Kwong Chi, Nikki Lee, and Wing Young Huie experiment with visual images to raise questions of racial and national identity, social inequality, gender, sexuality, and political agency. The course also includes a digital storytelling project that encourages students to create video images and sound reflecting Asian American immigration stories from local communities.\n",
    "prereq": {}
  },
  {
    "uid": "817834",
    "code": "COMM3351",
    "subject": "COMM",
    "number": "3351",
    "honors": false,
    "writing": false,
    "name": "Asian Amer and Popular Culture",
    "fullname": "Asian Americans and Popular Culture",
    "info": "Over the past few decades, Asian Americans have become increasingly visible both as the subjects and producers of popular culture in the United States. This course will explore how this new recognition of Asian Americans in popular literature, cinema, television, and entertainment is related both to longer histories of Asian immigration and racial exclusion and to post-1960s efforts to forward racial awareness, community activism, and social justice. Our first unit will look at how particular stereotypes such as the yellow peril or the wartime enemy encouraged anti-Asian feeling and violence and legal restrictions on immigration and naturalization. We will then examine how throughout history, Asian immigrants and their descendants used song, dance, theater, writing, and other forms of popular culture to express personal desires and foster collective ties. Our final unit concentrates on contemporary popular culture and its relationship to the changing identities of Asian Americans. How do Asian Americans influence the current essays, films, and videos that are consumed by millions today? How are increasingly pan-ethnic, interracial, multiracial, transnational, and global experiences reflected in popular culture?",
    "prereq": {}
  },
  {
    "uid": "003897",
    "code": "COMM3401",
    "subject": "COMM",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Intro to Communication Theory",
    "fullname": "Introduction to Communication Theory",
    "info": "Social scientific theory in human communication. Logic of scientific communication theories in interpersonal, small group, organizational, intercultural, and mediated communication.",
    "prereq": {}
  },
  {
    "uid": "010256",
    "code": "COMM3402",
    "subject": "COMM",
    "number": "3402",
    "honors": false,
    "writing": false,
    "name": "Intro: Interpersonal Comm",
    "fullname": "Introduction to Interpersonal Communication",
    "info": "Nature and function of communication between individuals in formal and informal relationships. Communicative interactions from theoretical and practical viewpoints.",
    "prereq": {}
  },
  {
    "uid": "004406",
    "code": "COMM3405",
    "subject": "COMM",
    "number": "3405",
    "honors": false,
    "writing": false,
    "name": "Language and Gender",
    "fullname": "Language and Gender",
    "info": "Gender/communication. Interdisciplinary theory. Role of communication in creating, maintaining, reinforcing, and changing gender relations in society.  ",
    "prereq": {}
  },
  {
    "uid": "004445",
    "code": "COMM3406",
    "subject": "COMM",
    "number": "3406",
    "honors": false,
    "writing": false,
    "name": "Lang/Sexual Diversi",
    "fullname": "Language and Sexual Diversity",
    "info": "Language use in lesbian, gay, bi-sexual, and transgender communities. Ways in which sexual diversity affects language use.",
    "prereq": {}
  },
  {
    "uid": "795378",
    "code": "COMM3409",
    "subject": "COMM",
    "number": "3409",
    "honors": false,
    "writing": false,
    "name": "Nonverbal Communication",
    "fullname": "Nonverbal Communication",
    "info": "Nonverbal communication in interpersonal communication process.  Nonverbal codes (touch, space, smell, eye contact) and their communicative functions (impression management, flirting, persuading, lying) in relational contexts (intimate relationships, friendships, work relationship). Theories, practices.",
    "prereq": {}
  },
  {
    "uid": "003898",
    "code": "COMM3411",
    "subject": "COMM",
    "number": "3411",
    "honors": false,
    "writing": false,
    "name": "Small Group/Team Communication",
    "fullname": "Small Group and Team Communication",
    "info": "Cooperative thinking in task-oriented groups. Planning, preparing for, and participating in small groups in private and public contexts.",
    "prereq": {}
  },
  {
    "uid": "004268",
    "code": "COMM3422",
    "subject": "COMM",
    "number": "3422",
    "honors": false,
    "writing": false,
    "name": "Interviewing &Comm",
    "fullname": "Interviewing and Communication",
    "info": "Application of communication concepts in information interview. Planning, conducting, and evaluating informational, journalistic/elite, helping, persuasive, appraisal, and employment interviews. Class training, field experience.",
    "prereq": {}
  },
  {
    "uid": "004031",
    "code": "COMM3431",
    "subject": "COMM",
    "number": "3431",
    "honors": false,
    "writing": false,
    "name": "Persuasion Theory",
    "fullname": "Persuasion Theories",
    "info": "Sociological, psychological, and communication perspectives. Theoretical knowledge applied to persuasion problems.\n\nprereq: Soph recommended",
    "prereq": {}
  },
  {
    "uid": "003899",
    "code": "COMM3441",
    "subject": "COMM",
    "number": "3441",
    "honors": false,
    "writing": false,
    "name": "Intro to Organizational Comm",
    "fullname": "Introduction to Organizational Communication",
    "info": "Functions of communication in work groups, in organizational hierarchies, and between organizations.",
    "prereq": {}
  },
  {
    "uid": "825736",
    "code": "COMM3451",
    "subject": "COMM",
    "number": "3451",
    "honors": false,
    "writing": false,
    "name": "Intercultural Comm",
    "fullname": "Intercultural Communication - Theory & Practice: Business & Organizational Communication in Germany",
    "info": "A Global Seminar course in which you will learn how to communicate effectively interculturally generally and in German business settings specifically. The course combines theoretical knowledge about how culture affects communication with the lived experience of being in a foreign country and culture.",
    "prereq": {}
  },
  {
    "uid": "003900",
    "code": "COMM3451W",
    "subject": "COMM",
    "number": "3451",
    "honors": false,
    "writing": true,
    "name": "Intercultural Comm",
    "fullname": "Intercultural Communication:  Theory and Practice",
    "info": "Theories of and factors influencing intercultural communication.  Development of effective intercultural communication skills.\n\nprereq: Planning an intercultural experience",
    "prereq": {}
  },
  {
    "uid": "003901",
    "code": "COMM3452W",
    "subject": "COMM",
    "number": "3452",
    "honors": false,
    "writing": true,
    "name": "Intercult Reentry",
    "fullname": "Communication and the Intercultural Reentry",
    "info": "Intercultural experience explored through stories and story telling, participant observation, and social scientific theory.  Constructs include identity, learning styles, cultural adaptation, values, ethics.\n\nprereq: Return from an intercultural experience",
    "prereq": {}
  },
  {
    "uid": "003903",
    "code": "COMM3601",
    "subject": "COMM",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "Intro: Rhet Theory",
    "fullname": "Introduction to Rhetorical Theory",
    "info": "Theoretical systems to explain/direct creation of public discourse. Traditional rhetoric to contemporary perspectives.  Using theory to explain practice of public discourse.",
    "prereq": {}
  },
  {
    "uid": "003905",
    "code": "COMM3605W",
    "subject": "COMM",
    "number": "3605",
    "honors": false,
    "writing": true,
    "name": "Persuasive Speaking",
    "fullname": "Persuasive Speaking and Speech Writing",
    "info": "Performance/composition with critical inquiry into rhetoric theories. Writing, thinking, and speaking skills.\n\nprereq: 1101, soph",
    "prereq": {
      "and": [
        "003881"
      ]
    }
  },
  {
    "uid": "816837",
    "code": "COMM3614",
    "subject": "COMM",
    "number": "3614",
    "honors": false,
    "writing": false,
    "name": "Adv Public Policy & Debate",
    "fullname": "Advanced Public Policy and Debate",
    "info": "Instruction in advanced theories and practices of both public and NDT/CEDA policy debate. ",
    "prereq": {}
  },
  {
    "uid": "004378",
    "code": "COMM3615W",
    "subject": "COMM",
    "number": "3615",
    "honors": false,
    "writing": true,
    "name": "Argumentation",
    "fullname": "Argumentation",
    "info": "This course explores how arguments help us manage uncertainties in various contexts, straddling the space between inquiry (knowledge making), and advocacy (change making). By combining theory and practice, the class provides students with strategies for thoughtfully analyzing and producing critical judgments. It cultivates their ability to read critically and charitably, to write and argue creatively, cogently and appropriately, and to participate ethically and constructively in various deliberative environments. ",
    "prereq": {}
  },
  {
    "uid": "003908",
    "code": "COMM3625W",
    "subject": "COMM",
    "number": "3625",
    "honors": false,
    "writing": true,
    "name": "Commun Ethics",
    "fullname": "Communication Ethics",
    "info": "Applying concepts/theories from philosophy and social science to ethical issues in interpersonal, group, organizational, intercultural, and media communication.",
    "prereq": {}
  },
  {
    "uid": "004431",
    "code": "COMM3631",
    "subject": "COMM",
    "number": "3631",
    "honors": false,
    "writing": false,
    "name": "Freedom of  Speech",
    "fullname": "Freedom of Speech",
    "info": "Communication theories and principles that underlie the concept of freedom of speech in the United States.  A variety of contexts and practices are examined in order to understand how communicative interaction should be described and, when necessary, appropriately regulated.",
    "prereq": {}
  },
  {
    "uid": "803142",
    "code": "COMM3635W",
    "subject": "COMM",
    "number": "3635",
    "honors": false,
    "writing": true,
    "name": "Famous Speeches",
    "fullname": "Famous Speeches",
    "info": "Speeches that became famous because of the occasion, issue, or speaker. Students analyze texts, research the issue?s history and the speaker?s biography/opposition, and evaluate the speech's artistry, ethical principles, effects on society, and contribution to history of ideas.",
    "prereq": {}
  },
  {
    "uid": "803571",
    "code": "COMM3645W",
    "subject": "COMM",
    "number": "3645",
    "honors": false,
    "writing": true,
    "name": "How Pictures Persuade",
    "fullname": "How Pictures Persuade",
    "info": "How words/pictures interact in graphic memoirs, political cartoons, and science to create/communicate meaning. How this interaction bears on public advocacy. Reading examples of comprehensive cognitive model of visual communication.",
    "prereq": {}
  },
  {
    "uid": "817478",
    "code": "COMM3666",
    "subject": "COMM",
    "number": "3666",
    "honors": false,
    "writing": false,
    "name": "Greek Intellectual Revolution",
    "fullname": "Greek Intellectual Revolution",
    "info": "This course is a three-week study abroad experience in Greece with the objective to examine how this ancient culture revolutionized its self-understanding of certain eternal human questions. Students will first acquire a degree of cultural competence in understanding the ancient culture, secondly understand how that revolution shaped our own western cultural foundations, and thirdly to use the ancient answers to provoke a critical assessment our answers to those same human questions.\n",
    "prereq": {}
  },
  {
    "uid": "002630",
    "code": "COMM3676W",
    "subject": "COMM",
    "number": "3676",
    "honors": false,
    "writing": true,
    "name": "Communicating Terrorism",
    "fullname": "Communicating Terrorism",
    "info": "Terrorism as an ethical and international problem. Different cultures' historical trajectories for terrorism. Contrasts between Algerian, Irish, and Arab terrorism.",
    "prereq": {}
  },
  {
    "uid": "002633",
    "code": "COMM3681W",
    "subject": "COMM",
    "number": "3681",
    "honors": false,
    "writing": true,
    "name": "Rhet Ficts & 20th Cent Confl",
    "fullname": "Rhetorical Fictions and 20th Century Conflicts",
    "info": "Analysis of selected 20th-century documentary novels. Nature of artistic truth in relation to historical truth. Cross-cultural comparisons of responses to impact of Anglo-American policies.",
    "prereq": {}
  },
  {
    "uid": "002648",
    "code": "COMM3682W",
    "subject": "COMM",
    "number": "3682",
    "honors": false,
    "writing": true,
    "name": "Communicating War",
    "fullname": "Communicating War",
    "info": "Claim: if ethics (right/wrong) exists in war, then right/wrong exist everywhere. Students experience this claim through its expression in various arts/humanities media of history, memoir, philosophical meditation, and film.",
    "prereq": {}
  },
  {
    "uid": "818544",
    "code": "COMM3896",
    "subject": "COMM",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": {}
  },
  {
    "uid": "004604",
    "code": "COMM3993",
    "subject": "COMM",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study. An opportunity in which a student completes a reading project, and/or designs and carries out a research project under the direction of a faculty member.  ",
    "prereq": {}
  },
  {
    "uid": "004606",
    "code": "COMM3994",
    "subject": "COMM",
    "number": "3994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "How communication research is designed, implemented, and published. Focus is on working with senior faculty on their current research projects.",
    "prereq": {}
  },
  {
    "uid": "004605",
    "code": "COMM3996",
    "subject": "COMM",
    "number": "3996",
    "honors": false,
    "writing": false,
    "name": "Directed Instruction",
    "fullname": "Directed Instruction",
    "info": "Supervised planning/teaching of undergraduate courses.",
    "prereq": {}
  },
  {
    "uid": "791355",
    "code": "COMM3999W",
    "subject": "COMM",
    "number": "3999",
    "honors": false,
    "writing": true,
    "name": "Capstone Project",
    "fullname": "Capstone Project",
    "info": "The Capstone is fulfilled by completing a 10-20 page capstone paper. Students seeking honors in communication studies may fulfill the capstone requirement with the honors thesis. The honors thesis is completed by taking 6 credits of of COMM 3190H, which counts towards the Additional Electives requirement. Students who double major and choose to complete the capstone requirement in their other major may waive the communication studies BA capstone, and they do not need to replace the 1 credit. Take COMM 3999W concurrently with any COMM 4xxx or 5xxx course. COMM 3999W is taken S-N only and must be taken during the same semester in which the capstone paper is written. The instructor sets the criteria for standards of quality and conceptual/theoretical content. Prerequisites: COMM major; instructor consent",
    "prereq": {}
  },
  {
    "uid": "805204",
    "code": "COMM4204",
    "subject": "COMM",
    "number": "4204",
    "honors": false,
    "writing": false,
    "name": "Producing for Television",
    "fullname": "Producing for Television: Theory and Practice",
    "info": "Producing media content based on audience, design, and story. Developing a thematic design. Evaluating and choosing a projected audience based on story concept and program bible. Each student completes a television program, including writing a script, preproduction planning, and considering crew and talent needs. Media producer responsibilities.\n\nprereq: 3201, 3204",
    "prereq": {
      "and": [
        "003895",
        "793074"
      ]
    }
  },
  {
    "uid": "003914",
    "code": "COMM4231",
    "subject": "COMM",
    "number": "4231",
    "honors": false,
    "writing": false,
    "name": "Compar Electr Media",
    "fullname": "Comparing Electronic Media Systems",
    "info": "Historical, political, and sociological aspects of electronic media systems throughout the world, including United States, Canada, Great Britain, France, Germany, and Russia.  Regulation and impact on political, social, and economic development.",
    "prereq": {}
  },
  {
    "uid": "004467",
    "code": "COMM4235",
    "subject": "COMM",
    "number": "4235",
    "honors": false,
    "writing": false,
    "name": "Ethnic Med/Minority",
    "fullname": "Electronic Media and Ethnic Minorities--A World View",
    "info": "Representation and involvement of various ethnic groups (e.g., African-Americans, Native Americans in United States and Canada, Maori, Turks in Europe) in radio, TV, cable, Internet.  Roles of government, industry, public organizations, and minority groups in regulating, managing, and financing ethnic media activities.",
    "prereq": {}
  },
  {
    "uid": "800396",
    "code": "COMM4245",
    "subject": "COMM",
    "number": "4245",
    "honors": false,
    "writing": false,
    "name": "Critical Television Studies",
    "fullname": "Critical Television Studies",
    "info": "Television as object of criticism, as cultural institution, and as omnipresent mode of commercialized popular culture.  Aesthetics, semiotics, political economics, consumer culture/advertising, social representation, global television, televisuality, flow. Reception and everyday life.\n\nprereq: 3211",
    "prereq": {
      "and": [
        "003948"
      ]
    }
  },
  {
    "uid": "815061",
    "code": "COMM4251",
    "subject": "COMM",
    "number": "4251",
    "honors": false,
    "writing": false,
    "name": "Environmental Communication",
    "fullname": "Environmental Communication",
    "info": "Historical, cultural, material contexts within which environmental communication takes place. Understand environmental communication as well as develop communication strategies that lead to more sustainable social practices, institutions, and systems.",
    "prereq": {}
  },
  {
    "uid": "800397",
    "code": "COMM4263",
    "subject": "COMM",
    "number": "4263",
    "honors": false,
    "writing": false,
    "name": "Feminist Media Studies",
    "fullname": "Feminist Media Studies",
    "info": "Issues, controversies, and practices of gender and their relationship to U.S. media. Ways in which gender is represented in and comes into play with media texts/institutions. Histories of feminism, theories/methods/political economy, case studies.\n\nprereq: 3211 or instr consent",
    "prereq": {
      "or": [
        "003948"
      ]
    }
  },
  {
    "uid": "003896",
    "code": "COMM4291",
    "subject": "COMM",
    "number": "4291",
    "honors": false,
    "writing": false,
    "name": "New Telecom Media",
    "fullname": "New Telecommunication Media",
    "info": "Development and current status of new telecommunication media such as cable TV, satellites, DBS, MDS, and video disk/cassettes.  Technology, historical development, regulation, and programming of these media and their influence on individuals, organizations, and society.\n\nprereq: 3211 or instr consent",
    "prereq": {
      "or": [
        "003948"
      ]
    }
  },
  {
    "uid": "004405",
    "code": "COMM4404W",
    "subject": "COMM",
    "number": "4404",
    "honors": false,
    "writing": true,
    "name": "Language Borderlands",
    "fullname": "Language Borderlands",
    "info": "Effect of multilingualism on self identity/sense of community. Subjective/social dimensions of being multilingual. Experience of language loss.",
    "prereq": {}
  },
  {
    "uid": "790144",
    "code": "COMM4407",
    "subject": "COMM",
    "number": "4407",
    "honors": false,
    "writing": false,
    "name": "Communication and Conflict",
    "fullname": "Communication and Conflict",
    "info": "Aspects of conflict common across types of relationships. Theories as alternative lenses to illuminate aspects of conflict. Communication strategies to manage or resolve conflict.\n\nprereq: 3401 or instr consent",
    "prereq": {
      "or": [
        "003897"
      ]
    }
  },
  {
    "uid": "003917",
    "code": "COMM4452W",
    "subject": "COMM",
    "number": "4452",
    "honors": false,
    "writing": true,
    "name": "Intercultural Interaction",
    "fullname": "Intercultural Interaction: Theory and Application",
    "info": "Small group interaction across cultures for international and U.S. students.  Discussion, simulations, readings.",
    "prereq": {}
  },
  {
    "uid": "819630",
    "code": "COMM4461",
    "subject": "COMM",
    "number": "4461",
    "honors": false,
    "writing": false,
    "name": "Prosocial Comm and Health",
    "fullname": "Prosocial Communication and Health",
    "info": "There has been a shift in how we think about and study human health and well-being. This shift also emphasizes the cultivation of positive emotions, behaviors, and practices into our daily lives so that we may improve our relationships with others and ultimately our well-being. In this senior-level undergraduate seminar we will examine a) the meaning and importance of prosocial communication in our lives; b) the communicative and relational contributions of prosociality to our health and well-being; and c) how the popular press presents happiness research.\n",
    "prereq": {}
  },
  {
    "uid": "790145",
    "code": "COMM4471",
    "subject": "COMM",
    "number": "4471",
    "honors": false,
    "writing": false,
    "name": "Comm in Marriage & Family",
    "fullname": "Communication in Marriage and Family",
    "info": "Contemporary theories of marriage/family communication using life-cycle approach. Role/function of communication in changing relational contexts. Ways of improving marriage/family relationships.\n\nprereq: 3401 or 3402 or instr consent",
    "prereq": {
      "or": [
        "003897",
        "010256"
      ]
    }
  },
  {
    "uid": "003918",
    "code": "COMM4602W",
    "subject": "COMM",
    "number": "4602",
    "honors": false,
    "writing": true,
    "name": "Political Persuasion",
    "fullname": "Contemporary Political Persuasion",
    "info": "Contemporary political speech.  Ideologies in political persuasion.\n\nprereq: 1101, 3431 or instr consent",
    "prereq": {
      "or": [
        "003881",
        "004031"
      ]
    }
  },
  {
    "uid": "004385",
    "code": "COMM4616",
    "subject": "COMM",
    "number": "4616",
    "honors": false,
    "writing": false,
    "name": "Rhet/Civil Rights",
    "fullname": "African American Civil Rights Rhetoric",
    "info": "Uses the struggle of African Americans to explore and analyze philosophical concepts, political issues, moral complexities, and discursive characteristics of civil rights rhetoric.\n\nprereq: Jr",
    "prereq": {}
  },
  {
    "uid": "003926",
    "code": "COMM4621W",
    "subject": "COMM",
    "number": "4621",
    "honors": false,
    "writing": true,
    "name": "Rhet  of Feminism",
    "fullname": "Rhetoric of Feminism",
    "info": "History/criticism of rhetoric of feminism from 19th century to present.",
    "prereq": {}
  },
  {
    "uid": "826239",
    "code": "COMM4642W",
    "subject": "COMM",
    "number": "4642",
    "honors": false,
    "writing": true,
    "name": "Rhetoric/Secrecy/Surveillance",
    "fullname": "The Rhetoric of Secrecy and Surveillance",
    "info": "\"The Rhetoric of Secrecy and Surveillance\" is a 4xxx-level course that focuses on rhetorical theory and criticism as expressed in recurring secrecy scandals and political states of emergency that demand ever-greater oversight of the population. This course is divided into three units: the history, theory, and wicked problems of secrecy and surveillance as they manifest in public and political culture. The core argument of this class is that we live in public, and that our information and our bodies are frequently exposed to the world and to a degree that we may not realize. One recurring theme of this course that is intended to prepare students for civic life beyond the university is that what we consider to be secret is often no secret at all, and the fact that we must live in public creates moral dilemmas which often go unrecognized in our everyday lives.",
    "prereq": {}
  },
  {
    "uid": "010245",
    "code": "COMM5110",
    "subject": "COMM",
    "number": "5110",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Comm Theory",
    "fullname": "Special Topics in Communication Theory",
    "info": "Advanced theoretical problems. See department office for current offering.",
    "prereq": {}
  },
  {
    "uid": "003909",
    "code": "COMM5210",
    "subject": "COMM",
    "number": "5210",
    "honors": false,
    "writing": false,
    "name": "Probs in U.S. Electronic Media",
    "fullname": "Contemporary Problems in U.S. Electronic Media",
    "info": "Problems affecting U.S. commercial and educational electronic media. Audiences; race/gender issues; regulation. ",
    "prereq": {}
  },
  {
    "uid": "800398",
    "code": "COMM5211",
    "subject": "COMM",
    "number": "5211",
    "honors": false,
    "writing": false,
    "name": "Critical Media Studies",
    "fullname": "Critical Media Studies: Theory and Methods",
    "info": "Survey of theories, research methods, and scholars dominating critical media studies since late 1920s. \n\nprereq: Graduate students or undergraduates who have completed COMM 3211 (Introduction to Media Studies) or its equivalent",
    "prereq": {
      "or": [
        "003948"
      ]
    }
  },
  {
    "uid": "003912",
    "code": "COMM5220",
    "subject": "COMM",
    "number": "5220",
    "honors": false,
    "writing": false,
    "name": "TV Genre",
    "fullname": "Television Genres",
    "info": "Nature, historical development, and influence on society of specific genres of television programming: drama, situation comedy, mystery, soap opera.  Program genre change over time and how society, government regulation, and economics of production influence that historical process.",
    "prereq": {}
  },
  {
    "uid": "800399",
    "code": "COMM5221",
    "subject": "COMM",
    "number": "5221",
    "honors": false,
    "writing": false,
    "name": "Media, Race, and Identity",
    "fullname": "Media, Race, and Identity",
    "info": "Critical media studies perspective on cultural politics of race and ethnicity. Social construction of race, politics of racism, media representations of race.\n\nprereq: 3211 or instr consent",
    "prereq": {
      "or": [
        "003948"
      ]
    }
  },
  {
    "uid": "808230",
    "code": "COMM5231",
    "subject": "COMM",
    "number": "5231",
    "honors": false,
    "writing": false,
    "name": "Media Outlaws",
    "fullname": "Media Outlaws",
    "info": "People working outside of mainstream media institutions who find creative/provocative ways to use media as space for cultural, political, or economic critique/resistance.",
    "prereq": {}
  },
  {
    "uid": "003916",
    "code": "COMM5233W",
    "subject": "COMM",
    "number": "5233",
    "honors": false,
    "writing": true,
    "name": "Natl Dev/Elect Med",
    "fullname": "Electronic Media and National Development",
    "info": "Use of electronic media to change social, political, economic, and cultural life.  Use by developing nations to improve agricultural practices, hygienic standards, literacy, and awareness of civic responsibility. ",
    "prereq": {}
  },
  {
    "uid": "810929",
    "code": "COMM5250",
    "subject": "COMM",
    "number": "5250",
    "honors": false,
    "writing": false,
    "name": "Environmental Communication",
    "fullname": "Environmental Communication",
    "info": "Historical, cultural, material contexts within which environmental communication takes place. Understand environmental communication as well as develop communication strategies that lead to more sustainable social practices, institutions, systems.",
    "prereq": {}
  },
  {
    "uid": "003921",
    "code": "COMM5261",
    "subject": "COMM",
    "number": "5261",
    "honors": false,
    "writing": false,
    "name": "Political Economy",
    "fullname": "Political Economy of Media Culture",
    "info": "Organizational practices of media communicators. Media content as link between communicators and audiences. How viewers use/process media content.\n\nprereq: 3211 or instr consent",
    "prereq": {
      "or": [
        "003948"
      ]
    }
  },
  {
    "uid": "800400",
    "code": "COMM5271",
    "subject": "COMM",
    "number": "5271",
    "honors": false,
    "writing": false,
    "name": "Media Historiography",
    "fullname": "Media Historiography",
    "info": "Critical media studies perspective (political economy, cultural, and technological) on history of mass media in the U.S., 1800s to present. Conceptual approaches to writing of media history. Skills/techniques for doing historical research in media studies.",
    "prereq": {}
  },
  {
    "uid": "003925",
    "code": "COMM5401",
    "subject": "COMM",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Adv Theories of Com",
    "fullname": "Advanced Theories of Communication",
    "info": "Survey of major theoretical approaches to communication including, positivism, constructivism, and systems.\n\nprereq: 3401 or grad",
    "prereq": {
      "or": [
        "003897"
      ]
    }
  },
  {
    "uid": "003927",
    "code": "COMM5402",
    "subject": "COMM",
    "number": "5402",
    "honors": false,
    "writing": false,
    "name": "Adv Interperson Communication",
    "fullname": "Advanced Interpersonal Communication",
    "info": "Social scientific approaches to interpersonal communication. Theory, research findings.\n\nprereq: 3401 or 3402",
    "prereq": {
      "or": [
        "003897",
        "010256"
      ]
    }
  },
  {
    "uid": "003902",
    "code": "COMM5404",
    "subject": "COMM",
    "number": "5404",
    "honors": false,
    "writing": false,
    "name": "Language and Culture",
    "fullname": "Language and Culture",
    "info": "How language/communication transmit cultural knowledge, attitudes, and beliefs. Connections among language, thought, and culture. Social/ethnic perspectives on study of language/communication.\n\nprereq: 3401 or instr consent",
    "prereq": {
      "or": [
        "003897"
      ]
    }
  },
  {
    "uid": "004404",
    "code": "COMM5406",
    "subject": "COMM",
    "number": "5406",
    "honors": false,
    "writing": false,
    "name": "Comm & Gender",
    "fullname": "Communication and Gender",
    "info": "How gender affects verbal communication. Development of analytical skills through readings, exercises, research that raise awareness of the power of language and the influence of gender prescriptions. Comparisons across languages where possible.",
    "prereq": {}
  },
  {
    "uid": "010146",
    "code": "COMM5408",
    "subject": "COMM",
    "number": "5408",
    "honors": false,
    "writing": false,
    "name": "Soc Cognition",
    "fullname": "Social Cognition",
    "info": "Role of cognitive processing in communication studies.  Models include perception, attention, memory and their use in communication.  Evaluation of social cognition theory and research.",
    "prereq": {}
  },
  {
    "uid": "003904",
    "code": "COMM5411",
    "subject": "COMM",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Small Grp Researc",
    "fullname": "Small Group Communication Research",
    "info": "Survey of small group communication research; theory and practice. Group decision-making and leadership.\n\nprereq: 3411 or instr consent",
    "prereq": {
      "or": [
        "003898"
      ]
    }
  },
  {
    "uid": "003906",
    "code": "COMM5421",
    "subject": "COMM",
    "number": "5421",
    "honors": false,
    "writing": false,
    "name": "Quantitative Research Methods",
    "fullname": "Quantitative Methods in Communication Research",
    "info": "Social scientific methods used in studying human communication. Optional data processing laboratory for additional credit.\n\nprereq: 3401 or instr consent",
    "prereq": {
      "or": [
        "003897"
      ]
    }
  },
  {
    "uid": "003907",
    "code": "COMM5431",
    "subject": "COMM",
    "number": "5431",
    "honors": false,
    "writing": false,
    "name": "Process of Persuas",
    "fullname": "The Process of Persuasion",
    "info": "Communication campaigns (e.g., advertising, political) illustrating persuasive processes and theories.  Research paper required.\n\nprereq: 3431",
    "prereq": {
      "and": [
        "004031"
      ]
    }
  },
  {
    "uid": "003910",
    "code": "COMM5441",
    "subject": "COMM",
    "number": "5441",
    "honors": false,
    "writing": false,
    "name": "Comm in Human Organizations",
    "fullname": "Communication in Human Organizations",
    "info": "Communication in organizational settings.  Organizational structure and dynamics and their effect upon the communication process.  Individual projects.",
    "prereq": {}
  },
  {
    "uid": "003911",
    "code": "COMM5451W",
    "subject": "COMM",
    "number": "5451",
    "honors": false,
    "writing": true,
    "name": "Intercultural Comm",
    "fullname": "Intercultural Communication Processes",
    "info": "Theory and research on cultural differences in values, norms, behaviors, and perceptions that affect communication across cultures internationally and domestically.",
    "prereq": {}
  },
  {
    "uid": "003913",
    "code": "COMM5461",
    "subject": "COMM",
    "number": "5461",
    "honors": false,
    "writing": false,
    "name": "Conversation Analysis",
    "fullname": "Conversation Analysis",
    "info": "Discourse processes in dyadic and multiparty conversation.  Application of concepts through analysis of conversations.",
    "prereq": {}
  },
  {
    "uid": "003915",
    "code": "COMM5462",
    "subject": "COMM",
    "number": "5462",
    "honors": false,
    "writing": false,
    "name": "Res/Spoken Lang",
    "fullname": "Field Research in Spoken Language",
    "info": "Transcribing and analyzing verbal communication and movement related to it.  Applying concepts to recorded conversations.",
    "prereq": {}
  },
  {
    "uid": "003919",
    "code": "COMM5611",
    "subject": "COMM",
    "number": "5611",
    "honors": false,
    "writing": false,
    "name": "Rhet Theory Survey",
    "fullname": "Survey of Rhetorical Theory",
    "info": "Rhetorical theory, from ancient to contemporary period. Application to public discourse.",
    "prereq": {}
  },
  {
    "uid": "003920",
    "code": "COMM5615W",
    "subject": "COMM",
    "number": "5615",
    "honors": false,
    "writing": true,
    "name": "Intro:Rhet Criticis",
    "fullname": "Introduction to Rhetorical Criticism",
    "info": "Analysis of public discourse using various theoretical perspectives.\n\nprereq: 1101; 3601 recommended",
    "prereq": {
      "and": [
        "003881",
        "003903"
      ]
    }
  },
  {
    "uid": "003922",
    "code": "COMM5617",
    "subject": "COMM",
    "number": "5617",
    "honors": false,
    "writing": false,
    "name": "US Publ Discourse I",
    "fullname": "History and Criticism of U.S. Public Discourse: 1630-1865",
    "info": "How discourse has been used to establish or maintain power. Speeches and public debates used to examine American public address from 17th century (e.g., Puritan sermons) to the Civil War.\n\nprereq: Jr",
    "prereq": {}
  },
  {
    "uid": "003923",
    "code": "COMM5618",
    "subject": "COMM",
    "number": "5618",
    "honors": false,
    "writing": false,
    "name": "US Pub Discourse II",
    "fullname": "History and Criticism of U.S. Public Discourse: 1865-1950",
    "info": "How discourse has been used to establish or maintain power. Speeches and public debates used to examine U.S. public address from the mid 19th century to 1950.",
    "prereq": {}
  },
  {
    "uid": "004607",
    "code": "COMM5970",
    "subject": "COMM",
    "number": "5970",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\n\nInstructor and department consent is required.",
    "prereq": {}
  },
  {
    "uid": "790879",
    "code": "COMM5994",
    "subject": "COMM",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Comm Research Practicum",
    "fullname": "Communication Research Practicum",
    "info": "Students participate in research group.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "817639",
    "code": "COMM8000",
    "subject": "COMM",
    "number": "8000",
    "honors": false,
    "writing": false,
    "name": "Research Colloquium",
    "fullname": "Communication Studies Research Colloquium",
    "info": "The Friday Colloquium is a mix of research presentations by scholars in Communication Studies and related fields, and workshops on professional development. The Colloquium provides graduate students with a broader introduction to the field, cutting edge work, and opportunities for developing their interests and skills.\n \nThe content and specific requirements of COMM 8xxx will vary by year, depending upon the faculty member who coordinates the colloquium series and the direction provided by the Director of Graduate Studies. In the fall of each year, the professional development portion of the Colloquium will focus on teaching.  Professional development sessions in the spring may include: navigating the job market, publishing, networking, or alternative academic career paths, depending on the range of speakers and interests of the cohort.",
    "prereq": {}
  },
  {
    "uid": "817640",
    "code": "COMM8100",
    "subject": "COMM",
    "number": "8100",
    "honors": false,
    "writing": false,
    "name": "Research Colloquium",
    "fullname": "Communication Studies Research Colloquium",
    "info": "The Friday Colloquium is a mix of research presentations by scholars in Communication Studies and related fields, and workshops on professional development. The Colloquium provides graduate students with a broader introduction to the field, cutting edge work, and opportunities for developing their interests and skills.\n \nThe content and specific requirements of COMM 8xxx will vary by year, depending upon the faculty member who coordinates the colloquium series and the direction provided by the Director of Graduate Studies. In the fall of each year, the professional development portion of the Colloquium will focus on teaching.  Professional development sessions in the spring may include: navigating the job market, publishing, networking, or alternative academic career paths, depending on the range of speakers and interests of the cohort.\n",
    "prereq": {}
  },
  {
    "uid": "817108",
    "code": "COMM8101",
    "subject": "COMM",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "Intro to Graduate Comm Studies",
    "fullname": "Introduction to Graduate Communication Studies",
    "info": "COMM 8101 is a required course that provides beginning graduate students with a foundation for understanding the discipline of communication studies from the perspective of a graduate student, scholar, and faculty citizen.",
    "prereq": {}
  },
  {
    "uid": "015887",
    "code": "COMM8110",
    "subject": "COMM",
    "number": "8110",
    "honors": false,
    "writing": false,
    "name": "Sem: COMM Research Methods",
    "fullname": "Seminar: Communication Research Methods",
    "info": "Evaluation of research methods in speech-communication.",
    "prereq": {}
  },
  {
    "uid": "003932",
    "code": "COMM8210",
    "subject": "COMM",
    "number": "8210",
    "honors": false,
    "writing": false,
    "name": "Sem:US Elect Media",
    "fullname": "Seminar: Selected Topics in U.S. Electronic Media",
    "info": "Literature survey; evaluating research on topics; conducting independent research project on a particular topic.\n\nprereq: 5210 or instr consent; offered when feasible",
    "prereq": {
      "or": [
        "003909"
      ]
    }
  },
  {
    "uid": "003933",
    "code": "COMM8211",
    "subject": "COMM",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Crit Commun Studies",
    "fullname": "Critical Communication Studies: History, Theory, Method",
    "info": "Qualitative research methods for studying media institutions, texts, audiences, and contexts.",
    "prereq": {}
  },
  {
    "uid": "003934",
    "code": "COMM8231",
    "subject": "COMM",
    "number": "8231",
    "honors": false,
    "writing": false,
    "name": "Natl/Int Elect Med",
    "fullname": "Seminar: National and International Electronic Media Systems",
    "info": "Historical and contemporary aspects of national and international electronic media systems.  Roles of national and international regulatory bodies.  Approaches to programming and evidence of effectiveness.\n\nprereq: 4231 or instr consent",
    "prereq": {
      "or": [
        "003914"
      ]
    }
  },
  {
    "uid": "788280",
    "code": "COMM8333",
    "subject": "COMM",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "003936",
    "code": "COMM8402",
    "subject": "COMM",
    "number": "8402",
    "honors": false,
    "writing": false,
    "name": "Interpersonal Communication",
    "fullname": "Seminar: Interpersonal Communication",
    "info": "Evaluate and develop new perspectives for analyzing, diagnosing, and managing interpersonal communication problems.\n\nprereq: 5402 or instr consent",
    "prereq": {
      "or": [
        "003927"
      ]
    }
  },
  {
    "uid": "004330",
    "code": "COMM8403",
    "subject": "COMM",
    "number": "8403",
    "honors": false,
    "writing": false,
    "name": "Comm & Emotion",
    "fullname": "Seminar: Emotion and Communication",
    "info": "Major theories of emotion and the role of emotion in communication.",
    "prereq": {}
  },
  {
    "uid": "004371",
    "code": "COMM8406",
    "subject": "COMM",
    "number": "8406",
    "honors": false,
    "writing": false,
    "name": "Lang/Gender Res",
    "fullname": "Seminar: Language and Gender Research",
    "info": "Readings and research on current issues. Data collected to test hypotheses and apply theory.",
    "prereq": {}
  },
  {
    "uid": "003937",
    "code": "COMM8411",
    "subject": "COMM",
    "number": "8411",
    "honors": false,
    "writing": false,
    "name": "Small Group Comm",
    "fullname": "Seminar: Small Group Communication Theory",
    "info": "Research problems and methods.",
    "prereq": {}
  },
  {
    "uid": "788415",
    "code": "COMM8444",
    "subject": "COMM",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "003938",
    "code": "COMM8451",
    "subject": "COMM",
    "number": "8451",
    "honors": false,
    "writing": false,
    "name": "Intercultural Research",
    "fullname": "Seminar: Intercultural and Diversity Research",
    "info": "Development of ideas/methods for research project, M.A. Plan B project, or Ph.D. dissertation.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "003940",
    "code": "COMM8452",
    "subject": "COMM",
    "number": "8452",
    "honors": false,
    "writing": false,
    "name": "Facil Intercul Comm",
    "fullname": "Seminar: Methods of Intercultural/Diversity Facilitation",
    "info": "Theories of and techniques for managing effective intercultural communication and diversity.  Intercultural training.\n\nprereq: 4451 or 5452 recommended",
    "prereq": {}
  },
  {
    "uid": "003941",
    "code": "COMM8502",
    "subject": "COMM",
    "number": "8502",
    "honors": false,
    "writing": false,
    "name": "Theory Construction",
    "fullname": "Seminar: Communication Theory Construction",
    "info": "Logic of communication theory development and modification from a social scientific perspective. Types of communication theories.\n\nprereq: 5421 or instr consent",
    "prereq": {
      "or": [
        "003906"
      ]
    }
  },
  {
    "uid": "003943",
    "code": "COMM8503",
    "subject": "COMM",
    "number": "8503",
    "honors": false,
    "writing": false,
    "name": "Hist/Descrpt Resrch",
    "fullname": "Historical and Descriptive Research in Speech-Communication",
    "info": "Elements involved in conducting and analyzing historical and descriptive research; approaches to historical research, assessing primary and secondary sources; completing a major research project.",
    "prereq": {}
  },
  {
    "uid": "003944",
    "code": "COMM8504",
    "subject": "COMM",
    "number": "8504",
    "honors": false,
    "writing": false,
    "name": "Sem:Rhet Criticism",
    "fullname": "Seminar: Rhetorical Criticism",
    "info": "Rhetorical criticism theories and methods. Rhetoric as applied to literary studies and the growth of hermeneutics as vantage points for reassessing rhetorical methods.\n\nprereq: 5615 or instr consent",
    "prereq": {
      "or": [
        "003920"
      ]
    }
  },
  {
    "uid": "003945",
    "code": "COMM8606",
    "subject": "COMM",
    "number": "8606",
    "honors": false,
    "writing": false,
    "name": "Rhet Analy of Campaigns/Moveme",
    "fullname": "Seminar: Rhetorical Analysis of Campaigns and Movements",
    "info": "Literature and methodology in historical and contemporary rhetorical campaigns and movements.",
    "prereq": {}
  },
  {
    "uid": "003946",
    "code": "COMM8611",
    "subject": "COMM",
    "number": "8611",
    "honors": false,
    "writing": false,
    "name": "Seminar: Rhetoric",
    "fullname": "Seminar: Rhetoric",
    "info": "History/criticism of rhetorical theory. Research in rhetoric.\n\nprereq: 5611 or instr consent",
    "prereq": {
      "or": [
        "003919"
      ]
    }
  },
  {
    "uid": "003947",
    "code": "COMM8625",
    "subject": "COMM",
    "number": "8625",
    "honors": false,
    "writing": false,
    "name": "Sem:Comm Ethics",
    "fullname": "Seminar: Communication Ethics",
    "info": "Independent research on communication ethics in interpersonal, group, organizational, intercultural, and media settings. Theories of ethics and methods of analysis.\n\nprereq: Ethics course or instr consent",
    "prereq": {}
  },
  {
    "uid": "788536",
    "code": "COMM8666",
    "subject": "COMM",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788661",
    "code": "COMM8777",
    "subject": "COMM",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787937",
    "code": "COMM8888",
    "subject": "COMM",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "817677",
    "code": "COMM8910",
    "subject": "COMM",
    "number": "8910",
    "honors": false,
    "writing": false,
    "name": "Advanced Communication Topics",
    "fullname": "Advanced Topics in Communication Studies",
    "info": "Literature survey; evaluating research on topics; conducting independent research project on a particular topic.",
    "prereq": {}
  },
  {
    "uid": "791062",
    "code": "COMM8994",
    "subject": "COMM",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Supervised research project.",
    "prereq": {}
  }
]