[
  {
    "uid": "818792",
    "code": "CPSY1301",
    "subject": "CPSY",
    "number": "1301",
    "honors": false,
    "writing": false,
    "name": "Nature-Based Learning",
    "fullname": "Nature-Based Learning in Early Childhood",
    "info": "This course is intended for undergraduate students throughout the University of Minnesota to develop an understanding of the connection between early childhood, development, and nature-based learning and play. Students will learn, through an exploration of national standards and guidelines as well as current research, best practices for connecting children and nature. \n",
    "prereq": {}
  },
  {
    "uid": "816402",
    "code": "CPSY1334",
    "subject": "CPSY",
    "number": "1334",
    "honors": false,
    "writing": false,
    "name": "Glbl Issues - Children & Youth",
    "fullname": "Global Issues on Children and Youth in Society",
    "info": "Study of hot topics currently faced by children and youth around the world, including focuses on homelessness, acculturation, mental health, substance abuse, war and political violence, immigration, and legal issues. Provides an introduction to science, ethics, and ramifications in civic life of current, controversial issues concerning child or youth development. Examines topics of concern and interest to parents, society, and young people and how developmental science informs these issues and policies as well as the decisions and actions of citizens. Students will also learn how research is translated and disseminated so that it can inform policy and practice.",
    "prereq": {}
  },
  {
    "uid": "800793",
    "code": "CPSY1904",
    "subject": "CPSY",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Int'l Studies of Childhood",
    "fullname": "International and Cross-cultural Studies of Childhood",
    "info": "Through reading, discussion, and written reflection, the course seeks to help students examine what it means to develop as a human being, to think about the practical and ethical issues humans face in guiding children?s development, and to learn how these issues are resolved in different communities around the world. The course seeks to develop an appreciation of the variety of human childhoods, and how the changes that humans themselves make in their economic and political structures, can affect this at both familial and societal levels. This course seeks to introduce students to the very wide variety of experiences that comprise human childhood across a wide variety of geographical, economic, and cultural circumstances. Students will learn about the basic paths and purposes of childhood in human societies ranging from modern European societies, traditional African and South Asian, Japanese and Indonesian societies, through technologically primitive societies in New Guinea. Students will develop a strong sense of the roles that historical societies played in the development of our contemporary understanding of human childhood. ",
    "prereq": {}
  },
  {
    "uid": "798996",
    "code": "CPSY1905",
    "subject": "CPSY",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "802004",
    "code": "CPSY1910W",
    "subject": "CPSY",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Sem, Writing Intensiv",
    "fullname": "Freshman Seminar, Writing Intensive",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "002357",
    "code": "CPSY2301",
    "subject": "CPSY",
    "number": "2301",
    "honors": false,
    "writing": false,
    "name": "Intro to Developmental Psych",
    "fullname": "Introduction to Developmental Psychology",
    "info": "Developmental psychology explores change and/ or stability as a function of age, with a focus on how early experiences affect later development across people's lives. This course examines development through the lenses of social, cultural, cognitive, biological, and learning theories by providing students with an overview of classic as well as current research and methodologies in developmental psychology. Students will gain an understanding of the usefulness of a developmental approach to psychological issues. The course focuses on conceptual understanding of different perspectives on healthy development across their life. This knowledge informs practical applications of how to help children, adolescents, and adults progress through developmental periods.\n\nPSY majors should take the cross-listed course CPSY 3301.",
    "prereq": {}
  },
  {
    "uid": "815204",
    "code": "CPSY2310",
    "subject": "CPSY",
    "number": "2310",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Child Dev",
    "fullname": "Special Topics in Child Development",
    "info": "Topics vary by semester.",
    "prereq": {}
  },
  {
    "uid": "003450",
    "code": "CPSY3301",
    "subject": "CPSY",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Intro to Developmental Psych",
    "fullname": "Introduction to Developmental Psychology",
    "info": "Developmental psychology explores change and/or stability as a function of age with a focus on how early experiences affect later development across people's lives. This course examines development through the lenses of social, cultural, cognitive, biological, and learning theories by providing students with an overview of classic as well as current research and methodologies in developmental psychology. Students will gain an understanding of the usefulness of a developmental approach to psychological issues. The course focuses on conceptual understanding of different perspectives on healthy development across their life. This knowledge informs practical applications of how to help children, adolescents, and adults progress through developmental periods.\n\nThis course is intended for non-Child Psychology/Early Childhood majors. Those majors should take the cross-listed course CPSY 2301.",
    "prereq": {}
  },
  {
    "uid": "002365",
    "code": "CPSY3308W",
    "subject": "CPSY",
    "number": "3308",
    "honors": false,
    "writing": true,
    "name": "Intro to Res Methods in DevPsy",
    "fullname": "Introduction to Research Methods in Developmental Psychology",
    "info": "Explore developmental research methodology by learning about observational research and experimental designs. Critically evaluate research articles, learn to report research, and understand the difference between science and pseudoscience. Gain awareness of the ethical and practical issues that developmental psychologists face when they work with children. \n\nprereq: sophomore standing, Developmental Psychology major",
    "prereq": {}
  },
  {
    "uid": "819913",
    "code": "CPSY3401",
    "subject": "CPSY",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Children, Youth, and Media",
    "fullname": "Children, Youth, and Media",
    "info": "This course will examine a variety of questions related to children's and adolescents' use and understanding of the media and address the role of the media in cognitive, social, and emotional development.\n\nPre-req: Interested students should have taken at least an introductory course in psychology or developmental psychology. ",
    "prereq": {}
  },
  {
    "uid": "826645",
    "code": "CPSY3501",
    "subject": "CPSY",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Infant/EC Mental Health",
    "fullname": "Introduction to Infant and Early Childhood Mental Health",
    "info": " Infant and Early Childhood Mental Health refers to how a child develops socially and emotionally during the first years of life in the context of relationships. Understanding Infant Mental Health is the key to preventing and addressing the mental health problems of very young children and their families. It also helps guide healthy social and emotional development. As a body of professionals studying, researching and helping families with very young children, the Infant Mental Health field is holistic, family-oriented, and multidisciplinary, involving social services, mental health and healthcare professionals, educators and policy makers. This course provides an introduction to the foundation of emotional well-being, and social and emotional development. It also focuses on how individuals in a wide range of professional roles can promote mental well-being for young children and reduce mental health risk factors. The course also explores the foundational tenets of the Infant and Early Childhood Mental Health field, including ethical standards, established competencies, and best practices. \n",
    "prereq": {}
  },
  {
    "uid": "817642",
    "code": "CPSY3601",
    "subject": "CPSY",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "Introduction to Child Life",
    "fullname": "Introduction to Child Life Theory and Practice",
    "info": "This course will provide an introduction to the child life profession with a strong focus on patient and family-centered care. This course will meet the required topics of study as identified by the Child Life Council. The major learning objectives include 1) gaining an understanding of the fundamental theories that support patient and family-centered care and child life practice, 2) identifying how illness, injury, and hospitalization impacts a child's development and their family, 3) gaining an understanding of the Official Documents of the Child Life Council, 4) examining the elements of therapeutic play in a clinical setting, and 5) identifying techniques to prepare a child and their family for healthcare encounters. \n\nprereq: Interested students should have at least an introductory course in psychology or developmental psychology.",
    "prereq": {}
  },
  {
    "uid": "826890",
    "code": "CPSY3701",
    "subject": "CPSY",
    "number": "3701",
    "honors": false,
    "writing": false,
    "name": "Racial Bias in Early Childhood",
    "fullname": "Racial Bias in Early Childhood",
    "info": "This course is designed to introduce you to the key concepts as well as theories of perceptual, cognitive, and social systems that facilitate prejudiced thinking in early childhood. The primary goal of this course is for you to gain new knowledge in this area of child development, increase reading, writing, and critical thinking skills, and incorporate course material into your daily life. The first part of the course will provide grounding terminology, theories, and historical perspectives on race, racial ideology, racism, and the development of biases. We will then utilize a scientific identity in part 2, learning research methods and evidence for the developmental trajectory of racial biases. In part 3, we will discuss applying our newly gained scientific knowledge and explore opportunities for reducing racial biases in early childhood. This class will include a combination of lectures, guest presentations, and student-driven small as well as large group discussions.",
    "prereq": {}
  },
  {
    "uid": "818365",
    "code": "CPSY3896",
    "subject": "CPSY",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship in Child Psychology",
    "fullname": "Internship in Child Psychology",
    "info": "Students secure an internship in the realm of child psychology/development. A student may only earn credit for a given internship through one course at a time. Corresponding online coursework includes written reflections, journals, and career development activities. Credits are variable based on hours at your site:\n\n- 1 credit - 45 hour minimum (average 3-4 hours per week)\n- 2 credit - 90 hour minimum (average 5-7 hours per week)\n- 3 credit - 135 hour minimum (average 8-9 hours per week)\n- 4 credit - 180 hour minimum (average 10-12 hours per week)\n\nStudents and their supervisors must submit a completed internship contract via Goldpass in order to register. http://goldpass.umn.edu/ Contact the CPSY advisor with any questions.",
    "prereq": {}
  },
  {
    "uid": "002358",
    "code": "CPSY4302",
    "subject": "CPSY",
    "number": "4302",
    "honors": false,
    "writing": false,
    "name": "Infant Development",
    "fullname": "Infant Development",
    "info": "Perceptual, motor, emotional, social, and cognitive development during the first two years of life; the developing infant in his or her social and physical environment.\n\nprereq: CPSY 2301 or equivalent or instructor consent",
    "prereq": {
      "or": [
        "002357"
      ]
    }
  },
  {
    "uid": "002359",
    "code": "CPSY4303",
    "subject": "CPSY",
    "number": "4303",
    "honors": false,
    "writing": false,
    "name": "Adolescent Psych",
    "fullname": "Adolescent Psychology",
    "info": "Overview of development in the teenage years/second decade of life. Interactions of adolescents with family, school, and society.\n\nprereq: PSY 1001 or equivalent",
    "prereq": {
      "or": [
        "006265"
      ]
    }
  },
  {
    "uid": "005205",
    "code": "CPSY4310",
    "subject": "CPSY",
    "number": "4310",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Dev Psych",
    "fullname": "Special Topics in Developmental Psychology",
    "info": "Description is specific to each topics title.",
    "prereq": {}
  },
  {
    "uid": "002361",
    "code": "CPSY4311",
    "subject": "CPSY",
    "number": "4311",
    "honors": false,
    "writing": false,
    "name": "Behavioral & Emotional Prob.",
    "fullname": "Behavioral and Emotional Problems of Children",
    "info": "Study abnormal psychology and atypical development in children and adolescents. Focus on behavioral and emotional problems, disorders and diagnoses, psychopathology contrasted to normal development. Understand symptoms, causes, course, and prevention of common disorders, excluding physical and sensory handicaps.\n\nprereq: CPSY 2301 / 3301 or equiv",
    "prereq": {
      "or": [
        "002357",
        "003450"
      ]
    }
  },
  {
    "uid": "002360",
    "code": "CPSY4313W",
    "subject": "CPSY",
    "number": "4313",
    "honors": false,
    "writing": true,
    "name": "Disabilities and Development",
    "fullname": "Disabilities and Development",
    "info": "Surveys all areas of exceptionality. Mental, hearing, vision, physical, speech, language handicaps. Learning disabilities. Autism. Emotional/behavior disorders. Giftedness. Study the related legal rights, policies, and education accommodations for students with disabilities.\n\nprereq: Psy 1001",
    "prereq": {
      "and": [
        "006265"
      ]
    }
  },
  {
    "uid": "820531",
    "code": "CPSY4314",
    "subject": "CPSY",
    "number": "4314",
    "honors": false,
    "writing": false,
    "name": "Trauma-Informed Care Practices",
    "fullname": "Trauma-Informed Care Practices in Early Childhood",
    "info": "The course offers a unique experience for students to dig deeply into current research about trauma, resilience, and child development. Students will also have the opportunity to explore how, as practitioners, our ideas about best practice and quality care must be shaped by and around what we are learning about the lasting impact of trauma. Throughout the course, students will explore how race, class, and gender influence and intersect with our understanding of “best practice” as we help students develop a trauma-informed approach to working with children and families. This course offers students the opportunity to learn how theory influences practice in a variety of community settings that serve diverse populations.\n\nStudents taking this course also have the option to enroll concurrently in CPSY 4315. CPSY 4315 is designed as a practicum experience to be taken concurrently with CPSY 4314. Students taking the course will be able to work in a community setting with children ages 0-5. Students will collaborate with teachers who are experts in working with children and families who have experienced trauma. CPSY 4315 offers students the opportunity to put theory into practice in a community setting that serves a diverse population.",
    "prereq": {}
  },
  {
    "uid": "820532",
    "code": "CPSY4315",
    "subject": "CPSY",
    "number": "4315",
    "honors": false,
    "writing": false,
    "name": "Prac. in Trauma-Informed Care",
    "fullname": "Practicum in Early Childhood Trauma-Informed Care",
    "info": "This course is designed as a field-based practicum to be taken concurrently CPSY 4314. Students may not register only for 4315. Students taking the course will be able to work in a community setting with children ages 0-5. Students will collaborate with teachers who are experts in working with children and families who have experienced trauma. The course, in conjunction with CPSY 4314, offers a unique experience for students to dig deeply into current research about trauma, resilience, and child development and put that knowledge to immediate use in a quality early childhood education environment. Students will also have the opportunity to explore how, as practitioners, our ideas about best practice and quality care must be shaped by and around what we are learning about the lasting impact of trauma. \n\nThroughout the course, students will explore how race, class, and gender influence and intersect with our understanding of “best practice” as we help students develop a trauma-informed approach to working with children and families. This course offers students the opportunity to put theory into practice in a community setting that serves a diverse population.",
    "prereq": {}
  },
  {
    "uid": "002369",
    "code": "CPSY4329",
    "subject": "CPSY",
    "number": "4329",
    "honors": false,
    "writing": false,
    "name": "Biol Foundations of Developmnt",
    "fullname": "Biological Foundations of Development",
    "info": "Evolutionary theory and behavioral genetics applied to understanding of development of human behavior; formation of species-typical adaptive behavior and individual differences in infancy, childhood, and adolescence. \n\nprereq: CPSY 2301 / 3301 or equiv",
    "prereq": {
      "or": [
        "002357",
        "003450"
      ]
    }
  },
  {
    "uid": "002371",
    "code": "CPSY4331",
    "subject": "CPSY",
    "number": "4331",
    "honors": false,
    "writing": false,
    "name": "Social & Personality Dev",
    "fullname": "Social and Personality Development",
    "info": "Development of social relations and personality; research, methodology, and contrasting theoretical perspectives. Survey of findings on interpersonal relationships, the concept of self, prosocial and antisocial behavior, and acquisition of social roles.\n\nprereq: CPSY 2301 / 3301 or equiv strongly recommended",
    "prereq": {
      "or": [
        "002357",
        "003450"
      ]
    }
  },
  {
    "uid": "002362",
    "code": "CPSY4334W",
    "subject": "CPSY",
    "number": "4334",
    "honors": false,
    "writing": true,
    "name": "Children, Youth in Society",
    "fullname": "Children, Youth in Society",
    "info": "Child development principles relative to social policy decision making. Issues in applying theories, findings to problems (e.g., media influences, mainstreaming, day care, child abuse, effects of peers).\n\nprereq: 2301",
    "prereq": {
      "and": [
        "002357"
      ]
    }
  },
  {
    "uid": "002366",
    "code": "CPSY4336",
    "subject": "CPSY",
    "number": "4336",
    "honors": false,
    "writing": false,
    "name": "Dev & Interpers Relationships",
    "fullname": "Development and Interpersonal Relationships",
    "info": "Processes and functions of interactions with personal relationships across the lifespan; analysis of theory and research on developmental changes and influences.",
    "prereq": {}
  },
  {
    "uid": "002363",
    "code": "CPSY4341",
    "subject": "CPSY",
    "number": "4341",
    "honors": false,
    "writing": false,
    "name": "Perceptual Development",
    "fullname": "Perceptual Development",
    "info": "Study how children learn to perceive and experience the world. Explore different approaches to studying brain function and the development of the sensory and perceptual systems and processes with focus on infant perception and the neurobiology of how the senses work. Cover a variety of developmental disorders of sensation and perception: learn about normal brain function by studying abnormal brain function.\n\nprereq: CPSY 2301 / 3301 or equiv",
    "prereq": {
      "or": [
        "002357",
        "003450"
      ]
    }
  },
  {
    "uid": "002367",
    "code": "CPSY4343",
    "subject": "CPSY",
    "number": "4343",
    "honors": false,
    "writing": false,
    "name": "Cognitive Development",
    "fullname": "Cognitive Development",
    "info": "Introduction to the scientific study of cognitive development (children's thinking) from infancy through adolescence. Focus on research and practical applications. Specific topic areas include infant perception and cognition, attention and memory development, language and symbolic thinking, social cognition, executive function.\n\nprereq: CPSY 2301 or 3301 or equivalent",
    "prereq": {
      "or": [
        "002357",
        "003450"
      ]
    }
  },
  {
    "uid": "002364",
    "code": "CPSY4345",
    "subject": "CPSY",
    "number": "4345",
    "honors": false,
    "writing": false,
    "name": "Language Dev & Communication",
    "fullname": "Language Development and Communication",
    "info": "How do children acquire language? Learn about acquisition of phonology (the sound system of the language), semantics (the meaning of units in the language), syntax (the structure of sentences), morphology (the structure of words, phrases, and sentences), and pragmatics (language use). Study English learning along with the acquisition of other spoken and signed languages. \n\nprereq: CPSY 2301 / 3301 or equiv ",
    "prereq": {
      "or": [
        "002357",
        "003450"
      ]
    }
  },
  {
    "uid": "790860",
    "code": "CPSY4347W",
    "subject": "CPSY",
    "number": "4347",
    "honors": false,
    "writing": true,
    "name": "Child Psychology Capstone",
    "fullname": "Child Psychology Capstone",
    "info": "Synthesize important themes and concepts from the CPSY undergraduate experience. Use knowledge of developmental psychology and research methods to complete various capstone assignments throughout the course. Students may find and evaluate high-quality empirical articles; write a literature review; create a hypothesis and design a behavioral coding system; work with peer research partners to collect data in the Lab School; and/or present work to peers and instructors in a professional format. Prereq: Senior and completion of CPSY 3308W (or approved equiv)",
    "prereq": {}
  },
  {
    "uid": "004897",
    "code": "CPSY4994",
    "subject": "CPSY",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Directed Research in Dvp",
    "fullname": "Directed Research in Developmental Psychology",
    "info": "Serve as an Research Assistant in an Institute of Child Development faculty lab.  Help plan/implement/document scientific studies and gain experience in research methodology. Duties vary based on lab and faculty projects that term, and are individually arranged with corresponding faculty and lab representatives.\n\nTo register: students must first secure their own placement in a faculty research lab; see ICD website and departmental advisor for assistance. Students then submit completed contract to CPSY advisor for a permission number to register.",
    "prereq": {}
  },
  {
    "uid": "004896",
    "code": "CPSY4996",
    "subject": "CPSY",
    "number": "4996",
    "honors": false,
    "writing": false,
    "name": "Field Study-Child Psychology",
    "fullname": "Field Study in Child Psychology",
    "info": "Students secure an internship / volunteer / work opportunity in the community with children. Corresponding online coursework includes written reflections, journals, and career development activities. Credits are variable based on hours at your site.\n\nStudents must submit a completed field study contract to the CPSY advisor in order to register.",
    "prereq": {}
  },
  {
    "uid": "817109",
    "code": "CPSY5171",
    "subject": "CPSY",
    "number": "5171",
    "honors": false,
    "writing": false,
    "name": "Apply Instr Mthds Elem School",
    "fullname": "Field Experience: Applying Instructional Methods in the Elementary School",
    "info": "Field Experience: Applying Instructional Methods in Elementary School is a semester long, full day experience during which teaching candidates gradually increase teaching responsibilities through observation and guided practice in an elementary (grade K-3) classroom, in a co-teaching model. The field experience is taken in connection with the Elementary Methods Teaching Block. Methods course teaching assignments are done during the field experience.",
    "prereq": {}
  },
  {
    "uid": "004356",
    "code": "CPSY5181",
    "subject": "CPSY",
    "number": "5181",
    "honors": false,
    "writing": false,
    "name": "Clinical Exp. in Elem Teaching",
    "fullname": "Clinical Experience in Elementary School Teaching",
    "info": "Students spend full days in the elementary classroom gradually assuming responsibility for teaching the class. Students prepare a portfolio based on criteria given. One seminar per week.",
    "prereq": {}
  },
  {
    "uid": "806417",
    "code": "CPSY5187",
    "subject": "CPSY",
    "number": "5187",
    "honors": false,
    "writing": false,
    "name": "Capstone Project: ECE",
    "fullname": "Capstone Project: Improvement of Teaching in Early Childhood Education",
    "info": "This is the capstone for teaching candidates in the M.Ed. in Early Childhood Education. Students will complete an in-depth reflective teaching portfolio and parallel assignments. The course requires demonstration of the linking of child development theory, knowledge of developmentally appropriate teaching, and reflective practice.\n\nprereq: Completion of all requirements for Early Childhood Teacher Licensure, other than CI 5181, which is taken concurrently.",
    "prereq": {}
  },
  {
    "uid": "004895",
    "code": "CPSY5241",
    "subject": "CPSY",
    "number": "5241",
    "honors": false,
    "writing": false,
    "name": "Field Exp in Early Childhood",
    "fullname": "Field Experience in Early Childhood Education",
    "info": "This course offers a great introduction to the early childhood experience for those interested in working with young children. This is a helpful first course to explore Early Childhood major (can also count in CPSY BA). Students will review early development and learn how this knowledge is applied in educational and early care settings. Students will spend time observing early childhood programs through field experiences around the city. \n\nprereq: CPSY 2/3301 or equiv.",
    "prereq": {
      "or": [
        "003450"
      ]
    }
  },
  {
    "uid": "016510",
    "code": "CPSY5251W",
    "subject": "CPSY",
    "number": "5251",
    "honors": false,
    "writing": true,
    "name": "Social/Phil Fndation Early Edu",
    "fullname": "Social and Philosophical Foundations of Early Childhood Education",
    "info": "This course traces the history of early childhood education from Plato to the present, as well as explores various program models and the standards movement, including the Minnesota Early Learning Indicators. The course includes lecture, discussion, videos and vignettes, assignments, and requires students to begin developing a personal teaching philosophy. It is also a writing intensive course which incorporates writing instruction and professional writing expectations throughout all course assignments and activities.\n\nprereq: CPSY 2/3301 or equiv.",
    "prereq": {
      "or": [
        "003450"
      ]
    }
  },
  {
    "uid": "015622",
    "code": "CPSY5252",
    "subject": "CPSY",
    "number": "5252",
    "honors": false,
    "writing": false,
    "name": "Soc/Emotional Learning in ECE",
    "fullname": "Facilitating Social and Emotional Learning in Early Childhood Education",
    "info": "This course explores social and emotional development throughout the early childhood (0-8) years. Explore the variety of ways that social interactions and emotional understanding occur in young children with a special emphasis on the role of adults in facilitating these processes. Students will encounter a blend of theory and application as they learn to promote children's mental health, understand special circumstances such as trauma, and respond to challenging behaviors across early learning settings.\n\nprereq: CPSY 2301 or equiv or inst consent. For Early Childhood or ECSE students.",
    "prereq": {
      "or": [
        "002357"
      ]
    }
  },
  {
    "uid": "015623",
    "code": "CPSY5253",
    "subject": "CPSY",
    "number": "5253",
    "honors": false,
    "writing": false,
    "name": "Cognitive/Lang Learning in ECE",
    "fullname": "Facilitating Cognitive and Language Learning in Early Childhood Education",
    "info": "This is a required methods course for students in the Early Childhood Education major (Licensure and Individualized-Studies Tracks) and the Early Childhood Education Initial Licensure Program. It is intended to prepare students to work with and teach typically and non-typically developing children from birth to age 8. Through lecture, videos, small group projects, hands-on exploration of materials and actual implementation of course principles with children, students will practice and learn to: -carefully observe children to identify their individual learning characteristics. -assess children’s developmental characteristics in the cognitive and language domains. -plan relevant and appropriate curriculum to foster growth and development in the areas of cognition, language, and literacy. -write goals and lesson plans focusing on the curriculum areas of math, science, language and literacy. -document and reflect on children’s learning and development. \n\nprereq: CPSY 2301 or equiv or inst consent. For Early Childhood or ECSE students.",
    "prereq": {
      "or": [
        "002357"
      ]
    }
  },
  {
    "uid": "806418",
    "code": "CPSY5254",
    "subject": "CPSY",
    "number": "5254",
    "honors": false,
    "writing": false,
    "name": "Creative/Motor Learning in ECE",
    "fullname": "Facilitating Creative and Motor Learning in Early Childhood Education",
    "info": "Learn how young children develop creativity and motor skills from birth - age 8.  Engage in hands-on exploration of creative classroom materials and reflection. Complete action-oriented and applied assignments with small groups of children in early childhood education settings.\n\nprereq: CPSY 2301 or equiv or inst consent. For Early Childhood and ECSE students. ",
    "prereq": {
      "or": [
        "002357"
      ]
    }
  },
  {
    "uid": "817261",
    "code": "CPSY5261",
    "subject": "CPSY",
    "number": "5261",
    "honors": false,
    "writing": false,
    "name": "Early Learning Infant Toddler",
    "fullname": "Early Learning in Infancy and Toddlerhood",
    "info": "This course provides an understanding of infant and toddler development. It offers multiple perspectives and current research related to the timetable of infant and toddler development, as well as the role of caregivers, environment, and culture in development. Special attention will be given to policies/programming that concern infants, toddlers, and their families. Students will be expected to understand the nuanced and varied ways in which development unfolds, including areas of exceptionalities, as well as explore the roles of professionals and community members in supporting infant and toddler development.",
    "prereq": {}
  },
  {
    "uid": "015624",
    "code": "CPSY5281",
    "subject": "CPSY",
    "number": "5281",
    "honors": false,
    "writing": false,
    "name": "Student Teaching in ECE",
    "fullname": "Student Teaching in Early Childhood Education",
    "info": "Student teaching plus weekly seminar for students pursuing the Early Childhood teaching licensure. Application of theory/research relating to teaching preschool children. Student teach either 5 mornings per week (7:45-12:30) for 8 credits or 3 afternoons per week (11:45-4:30) for 6 credits. In addition, ALL students participate in weekly (Fridays 12:30-2) seminars. Prereq: Early Childhood or ECSE student plus successful completion of CPSY 5241, 5252, 5253, and 5254.",
    "prereq": {}
  },
  {
    "uid": "811732",
    "code": "CPSY5301",
    "subject": "CPSY",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Advanced Developmental Psych",
    "fullname": "Advanced Developmental Psychology",
    "info": "This course is an exploration of life span development through the lenses of social, cultural, cognitive, biological, and learning theories and research. A primary emphasis of the class is on gaining better conceptual understanding of different perspectives on healthy development in order to support informed practical understanding of how to help children, adolescents, and adults progress through the developmental periods and to help them with the challenges they face\nacross their lifespan. \n\nThis course is intended for graduate students. Undergraduate students should take CPSY 2301 or 3301 and not also 5301.",
    "prereq": {}
  },
  {
    "uid": "816884",
    "code": "CPSY5302",
    "subject": "CPSY",
    "number": "5302",
    "honors": false,
    "writing": false,
    "name": "Cognitive and Biological Dev",
    "fullname": "Cognitive and Biological Development",
    "info": "This course concerns the development and function of thinking skills throughout the lifespan, touching upon several aspects of what makes humans unique. How are humans able to perceive, evaluate, interpret, infer, remember, symbolize, plan, evaluate, problem solve, and hypothesize? What influences the very emergence of such abilities and the nature of their function? What obstacles interfere with the development or the quality of cognitive processes? Brain development and other biological factors, and our relationships and other environmental factors influence our thinking and its development. Throughout this course, we will discuss how knowledge about cognitive development can influence our work with children, adolescents, and adults, in daily life, professional practice, and public policy. Among the many applications of our knowledge of cognitive development, in this course we will focus on select examples relevant to parenting, education, and media exposure, and on topics initiated by students. The course will address individual differences and cultural differences in cognitive development, and how knowledge about variation in \"typical\" cognitive development provides an important foundation for understanding atypical cognitive development.",
    "prereq": {}
  },
  {
    "uid": "816885",
    "code": "CPSY5303",
    "subject": "CPSY",
    "number": "5303",
    "honors": false,
    "writing": false,
    "name": "Social Emotional Development",
    "fullname": "Social and Emotional Development",
    "info": "What are the roots of becoming who we are, as individuals in society? What roles do others—parents, siblings, peers, teachers, and communities—play in the socialization of an individual, and how stable are the forces and outcomes of these influences? This course focuses on social development throughout the human lifespan, with an emphasis on how biology, culture, and relationships influence that development. Throughout this course, we will discuss how knowledge about social development can inform our interpretation of social issues and guide our reaction to them, in terms of behaviors, practices, and public policy. Among the many possible applications of social development, we focus in particular (but not exclusively) on positive psychology, widespread social problems such as poverty and social disparities, and prevention science. We emphasize individual differences in social development, and attend to the interplay between social development and cognition, learning, and biological development. ",
    "prereq": {}
  },
  {
    "uid": "816886",
    "code": "CPSY5304",
    "subject": "CPSY",
    "number": "5304",
    "honors": false,
    "writing": false,
    "name": "Rsrch Mthds Child Adolscnt Dev",
    "fullname": "Research Methods in Applied Child and Adolescent Development",
    "info": "Applied child and adolescent development research builds upon on traditions of general, clinical, developmental, and educational psychology research, while focusing on efforts to address social needs, social problems, and public policy. Knowledge of scientifically sound and effective approaches to studying social problems and solutions will support those individuals who lead, contribute to, or use research. That is, knowledge gained from this course will support your development as an investigator or research associate, and it will also empower your role as a savvy consumer of the research you intend to apply to practice or policy.",
    "prereq": {}
  },
  {
    "uid": "016727",
    "code": "CPSY5305",
    "subject": "CPSY",
    "number": "5305",
    "honors": false,
    "writing": false,
    "name": "Multidisc Persp",
    "fullname": "Multidisciplinary Perspectives on Aging",
    "info": "Sociological, psychological aspects of aging; theories of aging, death and bereavement; issues and problems of older adults in the U.S.; human services and their delivery systems (health, nutrition, long-term care, education); public policy and legislation; environment and housing; retirement.",
    "prereq": {}
  },
  {
    "uid": "816887",
    "code": "CPSY5306",
    "subject": "CPSY",
    "number": "5306",
    "honors": false,
    "writing": false,
    "name": "Ethics Prof Child Adolscnt Dev",
    "fullname": "Ethics and Professionalism in Applied Child and Adolescent Development",
    "info": "This course concerns ethical principles, issues, and codes relevant to research and practice in applied developmental psychology. These ethical considerations pertain to the work of professionals and researchers in communities, educational, medical, and social agencies that serve children, youth, families, and adults. Throughout the course, we will consider the general principles that guide ethical behaviors and decision-making across settings, unique issues that might arise in specific settings, and the roles served by formal codes of conduct. We also consider the roots of ethical thinking, behavior, and decision-making, and the social and cultural influences on an individual's developing sense of ethics.  ",
    "prereq": {}
  },
  {
    "uid": "816888",
    "code": "CPSY5310",
    "subject": "CPSY",
    "number": "5310",
    "honors": false,
    "writing": false,
    "name": "Current Issues Child Adol Dev",
    "fullname": "Current Issues in Applied Child and Adolescent Development",
    "info": "Applied Child and Adolescent Development (ACAD) evolved from social scientists\u0092 efforts to contribute to solving problems in society. At its inception in the early 1980\u0092s, Wertleib described the applied developmental scientist as \u0093\u0085being increasingly called upon to participate as social change agents and public policy advisors\u0085. (occupying) an important position in many health care, education, human service and public policy settings.\u0094 ACAD also focuses on positive psychology, supporting healthy development as a preventative vs. only reactive approach to positive change; and appreciates the reciprocal relation between research and practice. This seminar course provides students with a sample of the wide range of current issues faced by applied developmental scientists. ",
    "prereq": {}
  },
  {
    "uid": "817092",
    "code": "CPSY5360",
    "subject": "CPSY",
    "number": "5360",
    "honors": false,
    "writing": false,
    "name": "Topics in Developmental Psych",
    "fullname": "Special Topics in Developmental Psychology",
    "info": "Study in specialized areas of developmental psychology. Topics/credits vary.",
    "prereq": {}
  },
  {
    "uid": "796583",
    "code": "CPSY5413",
    "subject": "CPSY",
    "number": "5413",
    "honors": false,
    "writing": false,
    "name": "Early Childhd & Public Policy",
    "fullname": "Early Childhood and Public Policy",
    "info": "State, federal, and international policies and legislative activity touching first five years of a child's life. Family, community, and institutional roles in promoting children's social, cognitive, and emotional development. Issues related to health, mental health, poverty, developmental delays, and special needs.",
    "prereq": {}
  },
  {
    "uid": "797372",
    "code": "CPSY5414",
    "subject": "CPSY",
    "number": "5414",
    "honors": false,
    "writing": false,
    "name": "ILE in Early Chldhd & Publ Pol",
    "fullname": "Individualized Learning Experience in Early Childhood and Public Policy",
    "info": "Individualized, applied learning experience. Focuses on early childhood policy development, research, or evaluation. Students attend an early childhood policy lecture series and participate in small discussion groups and follow-up activities.\n\nprereq: Early Childhood Policy Certificate student, instr consent",
    "prereq": {}
  },
  {
    "uid": "800719",
    "code": "CPSY5501",
    "subject": "CPSY",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Early Child Mental Health I",
    "fullname": "Foundations in Infant and Early Childhood Mental Health I",
    "info": "History, theory, research, concepts, and issues in infant mental health. Issues pertinent to difficulties in development. Readings, visual material. Expert guest lectures.\n\nprereq: [Baccalaureate degree in an early-childhood-related field from an accredited U.S. institution or documented equiv], experience in early childhood [research or practice]",
    "prereq": {}
  },
  {
    "uid": "800907",
    "code": "CPSY5503",
    "subject": "CPSY",
    "number": "5503",
    "honors": false,
    "writing": false,
    "name": "Dev/Psychopthlgy in Early Chld",
    "fullname": "Development and Psychopathology in Early Childhood",
    "info": "History, theory, research, concepts, and issues in infant mental health. Typical development. Difficulties in development. Expert guest lectures. Readings, visual material. \n\nprereq: 5501 or enrolled in MA program or IECMH graduate minor",
    "prereq": {
      "or": [
        "800719"
      ]
    }
  },
  {
    "uid": "800908",
    "code": "CPSY5506",
    "subject": "CPSY",
    "number": "5506",
    "honors": false,
    "writing": false,
    "name": "Infant Observation Seminar I",
    "fullname": "Infant Observation Seminar I",
    "info": "How an infant develops in context of family relationships over a 9-12 month period. Students observe an infant for one hour a week, write a narrative, and discuss observations.",
    "prereq": {}
  },
  {
    "uid": "800909",
    "code": "CPSY5508",
    "subject": "CPSY",
    "number": "5508",
    "honors": false,
    "writing": false,
    "name": "Infant Observation Seminar II",
    "fullname": "Infant Observation Seminar II",
    "info": "How an infant develops in context of family relationships over a nine- to twelve-month period. Students observe an infant for one hour a week, write a narrative, and discuss observations.",
    "prereq": {}
  },
  {
    "uid": "800910",
    "code": "CPSY5511",
    "subject": "CPSY",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Infant Observation - III",
    "fullname": "Infant Observation Seminar III",
    "info": "How an infant develops in context of family relationships over 9-12 month period. Students observe an infant for one hour a week, write a narrative, and discuss observations.",
    "prereq": {}
  },
  {
    "uid": "800912",
    "code": "CPSY5513",
    "subject": "CPSY",
    "number": "5513",
    "honors": false,
    "writing": false,
    "name": "Early Childhood Assessment",
    "fullname": "Early Childhood Assessment",
    "info": "The course introduces processes and evidence-based methods of early childhood assessment and diagnosis from a developmental, multi-disciplinary framework.\n\nprereq: CPSY 5503 or instructor permission",
    "prereq": {
      "or": [
        "800907"
      ]
    }
  },
  {
    "uid": "800913",
    "code": "CPSY5515",
    "subject": "CPSY",
    "number": "5515",
    "honors": false,
    "writing": false,
    "name": "Assessment: NCAST",
    "fullname": "Assessment in Infant and Early Childhood Mental Health: NCAST",
    "info": "Achieving reliability in two observational measures of parent-child interaction: (1) nursing child assessment feeding (2) teaching Sscales. Discussion, lecture, videotapes, listening/observation tasks.\n\nprereq: [Baccalaureate degree in early-childhood-related field from accredited U.S. institution or documented equiv], [experience in early childhood research or practice]",
    "prereq": {}
  },
  {
    "uid": "800914",
    "code": "CPSY5518",
    "subject": "CPSY",
    "number": "5518",
    "honors": false,
    "writing": false,
    "name": "Prev/Intervention: Principles",
    "fullname": "Prevention and Intervention in Early Childhood: Principles",
    "info": "Students design prevention/intervention programs and apply evidence-based strategies in workplace/practicum settings. Readings, in-class reflective practice groups. \n\nprereq: CPSY 5513",
    "prereq": {
      "and": [
        "800912"
      ]
    }
  },
  {
    "uid": "800915",
    "code": "CPSY5521",
    "subject": "CPSY",
    "number": "5521",
    "honors": false,
    "writing": false,
    "name": "Prev/Interv: Practice & Ethics",
    "fullname": "Prevention and Intervention in Early Childhood: Practice and Ethics",
    "info": "This course is designed to prepare students to apply their knowledge of developmental science, infant mental health, and developmentally informed, dyadic intervention with young children and parents to program development, direct practice and program evaluation. Students will review the interdisciplinary nature of infant and early childhood practice and policy across multiple community settings. The course will examine IECMH intervention strategies in parent support programs, early care and education, home visiting, primary care, community adult mental health, and specialized programming for families experiencing complex challenges, such as parental incarceration, domestic violence, or homelessness. The course will examine professional and relational ethical codes of conduct across disciplines.  ",
    "prereq": {}
  },
  {
    "uid": "800917",
    "code": "CPSY5523",
    "subject": "CPSY",
    "number": "5523",
    "honors": false,
    "writing": false,
    "name": "Reflective Practice I",
    "fullname": "Reflective Practice I",
    "info": "The capacity to reflect on one’s own behavior, thoughts, feelings, and implicit biases, and those of others, is among the essential competencies of infant and early childhood professionals. Reflective practice is a distinctive component of professional training designed to facilitate the development of self-awareness, perspective-taking, and the ability to work effectively across disciplines, cultures, and contexts. This course offers students the opportunity to explore elements of reflective practice, experience, and build their own reflective capacity. Students will integrate these competencies and IECMH coursework with their professional experience and goals in order to provide high quality services to young children and their families and leadership in the field of infant mental health.",
    "prereq": {}
  },
  {
    "uid": "800918",
    "code": "CPSY5525",
    "subject": "CPSY",
    "number": "5525",
    "honors": false,
    "writing": false,
    "name": "Reflective Practice II",
    "fullname": "Reflective Practice II",
    "info": "The capacity to reflect on one’s own behavior, thoughts, feelings, and implicit biases, and those of others, is among the essential competencies of infant and early childhood professionals. Reflective practice is a distinctive component of professional training designed to facilitate the development of self-awareness, perspective-taking, and the ability to work effectively across disciplines, cultures, and contexts. This course builds on CPSY 5523 and continues to offer students the opportunity to explore elements of reflective practice, experience, and build their own reflective capacity. Students will integrate these competencies and IECMH coursework with their professional experience and goals in order to provide high quality services to young children and their families and leadership in the field of infant mental health.",
    "prereq": {}
  },
  {
    "uid": "816890",
    "code": "CPSY5601",
    "subject": "CPSY",
    "number": "5601",
    "honors": false,
    "writing": false,
    "name": "Child Life Theory and Practice",
    "fullname": "Child Life Theory, Practice and Program Development",
    "info": "With a strong foundation in the theory and science of child development, Child Life Specialists promote effective coping for children experiencing the stress and uncertainty of illness, injury, disability, and hospitalization. Child Life Specialists translate the theory of developmental science into practice and advocate for patient- and family-centered care in medical settings. This course will provide an overview of history, fundamental theories, relevant research, and application of the Child Life Professional Practice. The Official Documents of the Child Life Council (2011) will be analyzed as a source of guiding principles for professional practice. An introduction to Child Life program development is also examined in this course. This course must be taken prior to a child life internship.",
    "prereq": {}
  },
  {
    "uid": "816889",
    "code": "CPSY5602",
    "subject": "CPSY",
    "number": "5602",
    "honors": false,
    "writing": false,
    "name": "Dev Perspectives-Illness/Injry",
    "fullname": "Developmental Perspectives on Illness and Injury in Healthcare",
    "info": "With a strong foundation in the theory and science of child development, Child Life Specialists promote effective coping for children experiencing the stress and uncertainty of illness, injury, disability, and hospitalization. Child Life Specialists translate the theory of developmental science into practice and advocate for patient- and family-centered care in medical settings. This course will provide an overview of developmental theories as they apply to children and adolescents experiencing illness and injury in healthcare. Child Life preparation, relaxation interventions, and patient support practices for ill children will be examined. ",
    "prereq": {}
  },
  {
    "uid": "816892",
    "code": "CPSY5603",
    "subject": "CPSY",
    "number": "5603",
    "honors": false,
    "writing": false,
    "name": "Therapeutic Play for Chld Life",
    "fullname": "Therapeutic Play for Child Life Practice",
    "info": "With a strong foundation in the theory and science of child development, Child Life Specialists promote effective coping for children experiencing the stress and uncertainty of illness, injury, disability, and hospitalization. Child Life Specialists translate the theory of developmental science into practice and advocate for patient- and family-centered care in medical settings. This course will provide an overview of the theoretical framework of play across childhood development and its role within pediatric healthcare settings and Child Life practice. Students will gain a professional understanding of therapeutic play interventions essential for facilitation of children\u0092s coping and adjustment in various healthcare experiences.",
    "prereq": {}
  },
  {
    "uid": "816893",
    "code": "CPSY5604",
    "subject": "CPSY",
    "number": "5604",
    "honors": false,
    "writing": false,
    "name": "Therapeutic Relationships",
    "fullname": "Therapeutic Relationships: Supporting Children in Healthcare",
    "info": "With a strong foundation in the theory and science of child development, Child Life Specialists promote effective coping for children experiencing the stress and uncertainty of illness, injury, disability, and hospitalization. Child Life Specialists translate the theory of developmental science into practice and advocate for patient- and family-centered care in medical settings. This course will provide an overview of the role of Child Life professionals in therapeutic relationships with patients, caregivers and families.  The theoretical foundations of therapeutic relationships will be examined and students will gain a working knowledge of the philosophies and principles underpinning patient and family-centered care.",
    "prereq": {}
  },
  {
    "uid": "816894",
    "code": "CPSY5605",
    "subject": "CPSY",
    "number": "5605",
    "honors": false,
    "writing": false,
    "name": "Childhood Death/Bereavement",
    "fullname": "Childhood Death and Bereavement",
    "info": "With a strong foundation in the theory and science of child development, Child Life Specialists promote effective coping for children experiencing the stress and uncertainty of illness, injury, disability, and hospitalization. Child Life Specialists translate the theory of developmental science into practice and advocate for patient- and family-centered care in medical settings. This course will provide an overview of the fundamental theories of children\u0092s concept of death and the grief process across development. Students will gain an understanding of how Child Life Specialists collaborate with multidisciplinary care teams to support and provide culturally competent care to pediatric patients and their families at end-of-life and bereavement. ",
    "prereq": {}
  },
  {
    "uid": "817329",
    "code": "CPSY5981",
    "subject": "CPSY",
    "number": "5981",
    "honors": false,
    "writing": false,
    "name": "Cross-Cultural Tchg Exp Brazil",
    "fullname": "Cross-Cultural Experiences in Education and English Teaching in Brazil",
    "info": "This course provides an experiential introduction to the process of learning and teaching a second language to young children in an international setting.  Students will engage in inquiry, planning, classroom teaching and reflection as they participate on a team developing curriculum in a partial day English immersion classroom. Through readings, videos, a homestay experience, small group projects, classroom observations, and participation as part of a team of English teachers in Brazil, students will gain an introduction to Brazilian culture, learn the basics of the local education system, and experience firsthand what it is like to learn a new language. Students will next be exposed to some of the basic elements of early childhood second language teaching, will help to plan and co-deliver relevant and appropriate curriculum, write lesson plans and engage in reflective practice with their teaching team. Finally, because of the cultural immersion element of the class, students will be supported to 1) reflect on their personal cultural adjustment process, 2) develop an effective working relationship with their co-teachers, and 3) consider the ethical dilemma present in the provision of educational opportunity to Brazil\u0092s marginalized communities. ",
    "prereq": {}
  },
  {
    "uid": "816848",
    "code": "CPSY5991",
    "subject": "CPSY",
    "number": "5991",
    "honors": false,
    "writing": false,
    "name": "Independent Study in Child Dev",
    "fullname": "Independent Study in Child Development",
    "info": "Independent study arranged with child development faculty member.",
    "prereq": {}
  },
  {
    "uid": "812822",
    "code": "CPSY5996",
    "subject": "CPSY",
    "number": "5996",
    "honors": false,
    "writing": false,
    "name": "Field Exp Child Adolscnt Dev",
    "fullname": "Field Experience in Applied Child and Adolescent Development",
    "info": "Emphasizes field experiences focusing on the development of children and adolescents as individuals or members of groups; may include interactions with children and adolescents in natural settings, or research on applied topics or with atypical populations.",
    "prereq": {}
  },
  {
    "uid": "816423",
    "code": "CPSY8101",
    "subject": "CPSY",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "Grad Fellwshp Proposal Writing",
    "fullname": "Graduate Fellowship Proposal Writing Seminar",
    "info": "The primary purpose of this course is to prepare students to submit a competitive NSF Graduate Research Fellowship proposal. Students submitting to other organizations are welcome to join the course, but all of the assignments and focus will be on increasing NSF and predoctoral fellowship competitiveness. This course is intended primarily for doctoral students in their first or second year of study.",
    "prereq": {}
  },
  {
    "uid": "810926",
    "code": "CPSY8102",
    "subject": "CPSY",
    "number": "8102",
    "honors": false,
    "writing": false,
    "name": "Writing Dev Psych Grants",
    "fullname": "Writing Developmental Psych Grants for NIH and NSF",
    "info": "Research/identify potential funding sources at NIH/NSF, create right fit between proposals/agency program goals, address guideline of proposals, write effective key elements of proposal, understand review criteria, complete grant review, interpret feedback from reviews.\n\nprereq: Doctoral students in second year of study or beyond",
    "prereq": {}
  },
  {
    "uid": "003980",
    "code": "CPSY8301",
    "subject": "CPSY",
    "number": "8301",
    "honors": false,
    "writing": false,
    "name": "Dev Psych: Cognitive Processes",
    "fullname": "Developmental Psychology: Cognitive Processes",
    "info": "Perceptual, motor, cognitive, and language development, and biological bases of each. Conceptual framework of research issues.\n\nprereq: Doctoral student, instr consent",
    "prereq": {}
  },
  {
    "uid": "003982",
    "code": "CPSY8302",
    "subject": "CPSY",
    "number": "8302",
    "honors": false,
    "writing": false,
    "name": "Dev Psych-Soc & Emotional Proc",
    "fullname": "Developmental Psychology: Social and Emotional Processes",
    "info": "Normative issues and individual differences in social development from infancy through adolescence. Emphasizes developmental psychopathology, life span considerations.\n\nprereq: Doctoral student, instr consent",
    "prereq": {}
  },
  {
    "uid": "003992",
    "code": "CPSY8304",
    "subject": "CPSY",
    "number": "8304",
    "honors": false,
    "writing": false,
    "name": "Developmental Rsch Methods",
    "fullname": "Developmental Research Methods",
    "info": "Review of research strategies and designs for conducting research in developmental psychology, as well as strengths and weaknesses of each. Students will learn to (a) communicate about empirical research, (b) critically review methods used in empirical studies, and (c) design research to maximize knowledge gained, while recognizing its limitations.",
    "prereq": {}
  },
  {
    "uid": "810925",
    "code": "CPSY8307",
    "subject": "CPSY",
    "number": "8307",
    "honors": false,
    "writing": false,
    "name": "Prelim Seminar",
    "fullname": "Prelim Seminar",
    "info": "Prepare for written preliminary examination during summer of second year of doctoral study. Critically discuss issues/ themes in field using key readings suggested by faculty/past readings from core child development doctoral courses.\n\nprereq: Developmental Psychology PhD student in second year of study",
    "prereq": {}
  },
  {
    "uid": "003989",
    "code": "CPSY8311",
    "subject": "CPSY",
    "number": "8311",
    "honors": false,
    "writing": false,
    "name": "Landmark Issues in Ch Dev",
    "fullname": "Landmark Issues and Great Controversies in Child Development",
    "info": "History of developmental psychology and child development movement in context of conceptual/theoretical controversies. Presentations by students/instructor.\n\nprereq: CPsy doctoral student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004835",
    "code": "CPSY8321",
    "subject": "CPSY",
    "number": "8321",
    "honors": false,
    "writing": false,
    "name": "Seminar in Teaching Dev Psy",
    "fullname": "Seminar in Teaching Developmental Psychology",
    "info": "Apprentices attend weekly seminar meetings covering all aspects of university teaching. Planning course coverage, teaching techniques, developing learning activities and examinations. Preparation for CPSY 8322.\n\nprereq: Developmental psychology doctoral student or instr consent",
    "prereq": {}
  },
  {
    "uid": "806449",
    "code": "CPSY8322",
    "subject": "CPSY",
    "number": "8322",
    "honors": false,
    "writing": false,
    "name": "Teaching Developmental Psych",
    "fullname": "Apprenticeship in Teaching Developmental Psychology",
    "info": "Co-instruct a section of a CPSY undergraduate course. Plan syllabus, prepare/deliver lectures, devise active learning activities, prepare exams/assignments, and grade. Meet with apprenticeship supervisor to discuss teaching progress/issues.\n\nprereq: Developmental psychology doctoral student, CPSY 8321\n\nprereq: Child psychology doctoral student",
    "prereq": {
      "or": [
        "004835"
      ]
    }
  },
  {
    "uid": "788096",
    "code": "CPSY8333",
    "subject": "CPSY",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "003988",
    "code": "CPSY8360",
    "subject": "CPSY",
    "number": "8360",
    "honors": false,
    "writing": false,
    "name": "Special Topics: Dev Psych",
    "fullname": "Special Topics in Developmental Psychology",
    "info": "Intensive study in specialized areas of developmental psychology. Topics/credits vary.\n\nprereq: Doctoral student",
    "prereq": {}
  },
  {
    "uid": "788333",
    "code": "CPSY8444",
    "subject": "CPSY",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "004834",
    "code": "CPSY8606",
    "subject": "CPSY",
    "number": "8606",
    "honors": false,
    "writing": false,
    "name": "Adv. Dev. Psychopathology",
    "fullname": "Advanced Developmental Psychopathology",
    "info": "Alternative formulation of childhood disorders, emphasizing competency training rather than medical nosology.\n\nprereq: Doctoral student or instr consent",
    "prereq": {}
  },
  {
    "uid": "816424",
    "code": "CPSY8607",
    "subject": "CPSY",
    "number": "8607",
    "honors": false,
    "writing": false,
    "name": "Neurobiology of Stress/Emotion",
    "fullname": "Developmental Neurobiology of Stress and Emotion",
    "info": "Maladaptive responses to stress are components of both the etiology and expression of many psychiatric disorders. In addition, individuals differ in their stress vulnerability, with some seeming to thrive despite the odds, and others succumbing to even relatively mild adversity. These individual differences are likely the interactions of genes and experiences; early experiences may be particularly noteworthy.",
    "prereq": {}
  },
  {
    "uid": "816425",
    "code": "CPSY8608",
    "subject": "CPSY",
    "number": "8608",
    "honors": false,
    "writing": false,
    "name": "Clinical Intervn. Lifespan",
    "fullname": "Clinical Interventions Across the Lifespan",
    "info": "This course is designed to provide an overview of the historical foundations and contemporary applications of clinical interventions and psychotherapy; the design, conduct, and evaluation of clinical intervention research; fundamental elements of psychotherapy and the therapeutic process; the distal/proximal contexts in which clinical intervention research and psychotherapy practice is conducted; and common practical and ethical issues in clinical intervention research and psychotherapy practice. Although students who complete this course become familiar with major theoretical and applied approaches to clinical interventions and psychotherapy practice, the focus is not on gaining mastery in any particular psychotherapy approach. Instead, this course focuses on developing an understanding of fundamental principles of clinical interventions, therapeutic techniques, and psychotherapy practice, including the nature and underlying mechanisms of therapeutic change, research methods for evaluating the efficacy and effectiveness of clinical interventions and psychotherapy at the group and individual levels, a critical evaluation of contemporary psychotherapy approaches, and limitations in the current evidence base. In addition to readings and in-class discussions, students participate in in-person, group applications of basic clinical skills, including activities to help prepare them for beginning psychotherapy practice. This course thus provides a framework for understanding and applying the theories, principles, and methods of effective clinical interventions for students who will subsequently train in intervention-focused, in-person psychotherapy practica. ",
    "prereq": {}
  },
  {
    "uid": "810110",
    "code": "CPSY8660",
    "subject": "CPSY",
    "number": "8660",
    "honors": false,
    "writing": false,
    "name": "Advanced Developmental Psych",
    "fullname": "Advanced Developmental Psychology",
    "info": "Intensive study in advanced areas of developmental psychology. Topics/credits vary.\n\nprereq: Doctoral student",
    "prereq": {}
  },
  {
    "uid": "788458",
    "code": "CPSY8666",
    "subject": "CPSY",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788587",
    "code": "CPSY8777",
    "subject": "CPSY",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787844",
    "code": "CPSY8888",
    "subject": "CPSY",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "24 total credits required, preferably 12 cr/semester in the student's fourth of fifth year. Students should enroll in their advisor(s) section(s).",
    "prereq": {}
  },
  {
    "uid": "004891",
    "code": "CPSY8980",
    "subject": "CPSY",
    "number": "8980",
    "honors": false,
    "writing": false,
    "name": "Res.Sem-in CPsy",
    "fullname": "Research Seminar in Child Psychology",
    "info": "Participation in organized research group in developmental psychology.\n\nprereq: Doctoral student",
    "prereq": {}
  },
  {
    "uid": "004890",
    "code": "CPSY8993",
    "subject": "CPSY",
    "number": "8993",
    "honors": false,
    "writing": false,
    "name": "Dir Study in CPsy",
    "fullname": "Directed Study in Child Psychology",
    "info": "tbd\n\nprereq: Doctoral student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004892",
    "code": "CPSY8994",
    "subject": "CPSY",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Res Probs. in CPs",
    "fullname": "Research Problems in Child Psychology",
    "info": "Individual empirical investigation.\n\nprereq: Doctoral student or instr consent",
    "prereq": {}
  },
  {
    "uid": "005033",
    "code": "CPSY8996",
    "subject": "CPSY",
    "number": "8996",
    "honors": false,
    "writing": false,
    "name": "Dir Field Exp-CPsy",
    "fullname": "Directed Field Experiences in Child Psychology",
    "info": "Emphasizes field experiences focusing on intellectual and/or social development of children as individuals or members of groups; may include interactions with children in natural settings, or research on applied topics or with atypical populations.\n\nprereq: Doctoral student, instr consent",
    "prereq": {}
  }
]