[
  {
    "uid": "003578",
    "code": "CSCL1001W",
    "subject": "CSCL",
    "number": "1001",
    "honors": false,
    "writing": true,
    "name": "Intro to Cultural Studies",
    "fullname": "Introduction to Cultural Studies",
    "info": "Culture is a site of struggle, over meanings, values, history, and reality. This course introduces students to cultural studies as a conceptual, interpretive, and interdisciplinary approach to the role that culture plays in defining reality and to the possibilities for contesting those definitions. Through exploring the rituals and practices of culture that shape our perceptions of the world, often in ways we take for granted, the course seeks to develop a critical understanding of the relationships between individual and society, representation and reality, as well as theory and practice",
    "prereq": {}
  },
  {
    "uid": "009129",
    "code": "CSCL1101W",
    "subject": "CSCL",
    "number": "1101",
    "honors": false,
    "writing": true,
    "name": "Literature",
    "fullname": "Literature",
    "info": "What is literature? Today the term literature embraces all things printed, from fiction to nonfiction to advertising (yes, even your junk mail), from highbrow to low. This course will take a comparative view of the term literature as well as its ideas, practices, and forms. Given that literature historically has been tied to writing, to print, or to the book, what does it mean to study literature today—in an age when the book (and possibly print itself) may be vanishing?",
    "prereq": {}
  },
  {
    "uid": "009131",
    "code": "CSCL1201W",
    "subject": "CSCL",
    "number": "1201",
    "honors": false,
    "writing": true,
    "name": "Cinema",
    "fullname": "Cinema",
    "info": "Introduction to the critical study of the visual in modernity, presented through sustained analysis of the cinema and cinematic codes. Emphases on formal film analysis and major film movements and conventions in the international history of cinema. Students develop a vocabulary for formal visual analysis and explore major theories of the cinema. \n\n*Students will not receive credit for CSCL 1201W if they have already taken SCMC 1201W, CSCL 1201V, SCMC 1201V, ARTH 1921W, CSCL 1921W, CSCL 1201 or SCMC 1201",
    "prereq": {}
  },
  {
    "uid": "814322",
    "code": "CSCL1202W",
    "subject": "CSCL",
    "number": "1202",
    "honors": false,
    "writing": true,
    "name": "Media: Word, Image, Sound",
    "fullname": "Media: Word, Image, Sound",
    "info": "Introduction to the critical and theoretical study of media and technology from Aristotle to the modern world. The first half of the course emphasizes theoretical readings in dialogue with historical apparatuses (printing press, photography, radio, cinema, television) and various expressive objects (the bible, early film, ethnographic sound recordings). The second half turns to the modern culture industry since World War II, and introduces students to the critical study of mass culture, the concept of ideology, and of the relationship between corporate power and media conglomerates. ",
    "prereq": {}
  },
  {
    "uid": "003579",
    "code": "CSCL1301W",
    "subject": "CSCL",
    "number": "1301",
    "honors": false,
    "writing": true,
    "name": "Reading Culture",
    "fullname": "Reading Culture: Theory and Practice",
    "info": "Culture and cultural conflict. Reading cultural theory/texts such as film, literature, music, fashion, commercial art, and built environment.",
    "prereq": {}
  },
  {
    "uid": "009485",
    "code": "CSCL1401W",
    "subject": "CSCL",
    "number": "1401",
    "honors": false,
    "writing": true,
    "name": "Reading Literature",
    "fullname": "Reading Literature: Theory and Practice",
    "info": "How can we read/understand different ways that literature is meaningful? Emphasizes practice in reading a broad spectrum of world literature, literary theory.",
    "prereq": {}
  },
  {
    "uid": "016078",
    "code": "CSCL1501W",
    "subject": "CSCL",
    "number": "1501",
    "honors": false,
    "writing": true,
    "name": "Reading History",
    "fullname": "Reading History: Theory and Practice",
    "info": "What is history? How can we understand its meanings/uses? Emphasizes practice in reading cultural texts from various historical perspectives.",
    "prereq": {}
  },
  {
    "uid": "791124",
    "code": "CSCL1903",
    "subject": "CSCL",
    "number": "1903",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "790189",
    "code": "CSCL1904",
    "subject": "CSCL",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "788670",
    "code": "CSCL1905",
    "subject": "CSCL",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "788665",
    "code": "CSCL1907W",
    "subject": "CSCL",
    "number": "1907",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "796874",
    "code": "CSCL1909W",
    "subject": "CSCL",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "788667",
    "code": "CSCL1910W",
    "subject": "CSCL",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "817152",
    "code": "CSCL1911",
    "subject": "CSCL",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Poetry and Social Change",
    "fullname": "Poetry and Social Change",
    "info": "At a time when creative forms of resistance are playing an increasingly significant role in what happens in public and political worlds, questions of language, metaphor, and aesthetics have become relevant to those who think about social change. How can poetry be a force of social change? How can poetry be a vehicle that repairs or aids in the recovery of social violence? Poetry, which derives from the term \"poiesis,\" and means 'making' or 'creation,' is often seen as a means to express personal experience and as a way of generating new forms of collective imagination, but it is less often seen as something that can lead to social change or revolution. In this course, we will ask what makes a poem a poem and explore ideas about poetry's capacity for expression and activity, interpretation and change, thinking and acting. We'll read poetry that attempts to repair the damage wrought by political, environmental, and social destruction by looking at the role of poetry in social struggles.",
    "prereq": {}
  },
  {
    "uid": "817994",
    "code": "CSCL1912",
    "subject": "CSCL",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Fake News",
    "fullname": "Fake News",
    "info": "What is \"fake news\"? This term used to refer mainly to satires about the news, like The Daily Show and The Onion. Nowadays, \"fake news\" can mean absolutely anything from political humor, to profiteering click-bait, to blatant disinformation (i.e., \"alternative facts\"). Or, one can attempt to discredit fact-based reporting as \"fake news\" if you simply don't want to hear it. In this course, we will think about the problem of \"fake news\" in its radical range of connotations. First, we will study humorous genres of news reporting, including literary farce, corporate hoaxes, mockumentaries, political parody, \"truthiness\", and more. Second, we will investigate the history of journalism, from the nineteenth century crisis of \"yellow journalism\" to our present day, post-truth news media climate. For example, when did journalists begin to strive for ideals of objectivity, impartiality, and fact-based reporting? Finally, we will think philosophically about the very meaning of what is \"fake\" in relation to issues of truth, reality, authenticity, originality, mimesis, and representation.",
    "prereq": {}
  },
  {
    "uid": "819051",
    "code": "CSCL1913W",
    "subject": "CSCL",
    "number": "1913",
    "honors": false,
    "writing": true,
    "name": "Do We Live in Fictional World?",
    "fullname": "Do We Live in a Fictional World?",
    "info": "Most readers of Shakespeare know the line: “All the world’s a stage and all men and women merely players”. And, as a Spanish contemporary of his would add: Life Is A Dream. Surely, those celebrated writers are kidding, aren’t they?\n\nBefore one hastens to brush away such a persistent statements as mere metaphors, one might want to understand the reasons of their very persistence and weigh them against the uses of fiction in daily life. Indeed, there is no shortage of works, characters, images or practices that blur the boundaries between life and fiction. From the myth of Pandora to TV series such as Westworld, from Inception to commercial fiction, from childhood role plays to video games, from colonial expeditions and myths to cosplays it is the entire spectrum of our history, knowledge, actions, relations, leisure and even identities that are pervaded by fiction. The course aims at taking a fresh and critical look at fiction and its assumed opposition to reality and exploring the ways, big and small, in which fiction and narrative imagination shape our lives and the world we live in.",
    "prereq": {}
  },
  {
    "uid": "819880",
    "code": "CSCL1914W",
    "subject": "CSCL",
    "number": "1914",
    "honors": false,
    "writing": true,
    "name": "What is a Poem?",
    "fullname": "What is a Poem?",
    "info": "This is a course for people who love reading poetry as well as for people who would love to learn how to love reading poetry—and it should be much fun for both!  We will examine some of the basic issues in the study of poetry, such as the changing meanings of the term “poetry,” the distinction between epic poetry and lyric poetry, the importance of the question of love for poetry, and so on. We will study a great variety of poems from different historical periods, literary traditions, and cultural contexts across the globe (including pop songs and music videos by contemporary singers and bands, some of which will be selected by the students). Above all, this is a course in close reading: we will study in detail how poems work, what it is that they do, and why. Ultimately, the question we will attempt to answer is why it is that poetry always has been and still continues to be one of the fundamental forms of human expression. To this purpose, we will discuss how to conduct literary analysis and students will have the opportunity to try their hand at literary criticism, i.e., by writing essays focused on one single poem. (This course fulfills the Writing Intensive requirement).",
    "prereq": {}
  },
  {
    "uid": "820155",
    "code": "CSCL1915",
    "subject": "CSCL",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "Representation in Pandemics",
    "fullname": "Representation in the Time of Pandemics: Culture and Politics from AIDS to COVID-19.",
    "info": "This course starts from the premise that representation is where culture and politics meet, and it tests the hypothesis that pandemics radically transform representation. There are times in history when it takes a global pandemic to see the world in a different light: these are times when a pandemic makes us understand our place in the world differently. How and why do pandemics change the ways we represent the world and ourselves? Or, do they? To answer these questions, we will examine a great variety of representations of life, culture, and society in the time of pandemics: we will watch films, documentaries, and musicals; we will look at photography, paintings, memes, and other visual arts; we will read novels, poems, diaries, and autobiographies; we will study works of philosophy, essays of cultural criticism, and political commentary from various media sources. We will do all that by focusing on two current and ongoing pandemics—theHIV/AIDS pandemic and the SARS-CoV-2/COVID-19 pandemic. In particular, we will consider the cultural and political responses to the AIDS pandemic in the 1980s and 1990s and to the COVID-19 pandemic in 2020, both in the U.S. and worldwide: we will investigate how these pandemics are linked to systemic oppressions (e.g., racism, misogyny, xenophobia, homophobia, transphobia), how they have transformed the relation between our individual rights and our responsibilities to society, how they have impacted sex and love and friendship, how they have changed the way we think about life and death, how they have enabled new and different forms of sociality, communication, and representation. Ultimately, however, it is not only a matter of representing the world differently: it is also a question of changing it. This is where culture meets politics. The word “representation,” in fact, means not only cultural or aesthetic representation (e.g., as in the way a film represents an aspect of reality); it also means political representation (e.g., as in the way elected officials represent us in democratic governance). Pandemics radically transform representation in both these senses: they transform both culture and politics. In the end, thus, the fundamental question of the course is: how can our representations of the world help bring about the change we want in the world?",
    "prereq": {}
  },
  {
    "uid": "825154",
    "code": "CSCL1916",
    "subject": "CSCL",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "The Animal",
    "fullname": "The Animal",
    "info": "Animals are all around us who call ourselves human. We invite them into our homes, we kill them, we eat them, we go to great lengths to see them in the wild -- or we just go to the zoo, and watch, shoulder to shoulder, animals living less than wild lives. We also think a lot about animals, about what an animal is and in what ways humans are and are not animals. In this course we take up the question of the animal to examine how it has been conceived historically and how it is conceived today, and how those conceptions inform our treatment of animals. We will then ask what our ethical obligations are vis-à-vis the animals around us, and, finally, consider what the future will hold for the numerous species whose environments are disappearing. Students will finish the course with a keen eye for the ways that animals and ideas about them affect our world.",
    "prereq": {}
  },
  {
    "uid": "825208",
    "code": "CSCL1917",
    "subject": "CSCL",
    "number": "1917",
    "honors": false,
    "writing": false,
    "name": "Documenting the Present",
    "fullname": "Documenting the Present: History and Everyday Life in Literature, Film, and Photography",
    "info": "Often, we think of history as something that happened far away and in the past. But over the past year and a half, we have been living through history in the present tense, at the confluence of a deadly pandemic, seismic calls for racial justice, and a contentious U.S. presidential election. Minnesota, where George Floyd was murdered, has been at the heart of these events. In this seminar, we will explore how writers, filmmakers, and photographers have made sense of other historical events as they were occurring. We will ask how the “big” stories of history intertwine with the intimate details of everyday life; how writers and artists understand their present moments as “historical”; and how, over time, accounts of the present transform into canonical versions of historical events. ",
    "prereq": {}
  },
  {
    "uid": "825753",
    "code": "CSCL1918",
    "subject": "CSCL",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "The Hollywood Musical",
    "fullname": "The Hollywood Musical, in one term",
    "info": " Musicals, in theatrical form, span the globe and in cinema, date from the inception of recorded and projected sound. This course limits itself to the Hollywood Musical from 1927 onward, while staying in discussion with Bollywood musicals, Jacques Demy’s French musical masterpieces, the musicals of sub-Saharan Africa (Come Back Africa, Sanknofa, etc.) as well as examples including Carlos Saura’s Carmen. \nBecause of its clear stages, i.e. early/pre-code, classical, punk, and DV, Hollywood musicals map a clear line that is crucial  to know, to understand, to criticize and to deviate from in order to understand the genre’s discrete characteristics and how they interact world-wide..\nWe will study these stages and their filmic examples, with attention to how music has come to specifically affect the film industry in regard to politics, economics, gender, sexual orientation, age, class, and race.\n",
    "prereq": {}
  },
  {
    "uid": "826329",
    "code": "CSCL1919",
    "subject": "CSCL",
    "number": "1919",
    "honors": false,
    "writing": false,
    "name": "Silent Cinema",
    "fullname": "Silent Cinema",
    "info": "Have you ever seen a silent movie? In films made over a century ago, magicians juggle their own heads while playing the banjo, teenage pranksters electrocute the police, and hashish smokers are visited by tiny nicotine fairies. Over 80% of all silent films are lost forever. Miraculously, thousands of beautiful, weird, incredible silent films do survive, and they are enjoying a popular global resurgence in 2023! There are archival silent film festivals all over the world? from Italy to Mexico to Mumbai to Minneapolis. In this class, we will study the history of silent-era filmmaking (1890s-1920s) and its vast afterlife in the present. We will watch promiscuously across a range of genres, including slapstick comedy, melodrama, horror, travelogue, Italian? German Expressionism, Soviet montage, Japanese kabuki adaptations, and more. We will learn about how film developed its own language for telling stories through moving images, the work of archival film preservation, the craft of musical accompaniment, and the revival of silent film fan cultures today.",
    "prereq": {}
  },
  {
    "uid": "009479",
    "code": "CSCL1921W",
    "subject": "CSCL",
    "number": "1921",
    "honors": false,
    "writing": true,
    "name": "Intro Film Study",
    "fullname": "Introduction to Film Study",
    "info": "Fundamentals of film analysis and an introduction to the major theories of the cinema, presented through detailed interpretations of representative films from the international history of the cinema.",
    "prereq": {}
  },
  {
    "uid": "826341",
    "code": "CSCL1922",
    "subject": "CSCL",
    "number": "1922",
    "honors": false,
    "writing": false,
    "name": "Films Noir",
    "fullname": "Films Noir: History, Change, Sex, and Violence",
    "info": "This Freshman seminar enjoys and explores films noir through several theoretical models, and in our analyses of its fascinating historical, and our current, contexts. This is a course that is central to the CSCL and SCMC curricula, and it also offers compelling critical approaches through which we are able to receive, discuss, and write about film. Our design for this seminar aims toward students developing their own analytic voices and perspectives with which they may not only enter key debates in film studies, but that will apply to other courses and fields of cultural knowledge as well.Specifically, we will focus on the relationships between pulp fiction's social/economic emergence after World War II, and how this particular \"low\" literature altered and funded the French New Wave and Hollywood cinema, as well as echoing worldwide film trends in China, England, Japan, and other nations. In thinking of gender and race as well, these pulps generally broke into forms either in tandem with Melodrama or the lie within the tenets of the post-created genre, Film Noir. The complex interplay between Race, sexual orientation, and class, and between \"female\" models and \"masculine\" cinema delivers rich and generative material for understanding cinema within social history. ",
    "prereq": {}
  },
  {
    "uid": "827219",
    "code": "CSCL1923",
    "subject": "CSCL",
    "number": "1923",
    "honors": false,
    "writing": false,
    "name": "Barbie™",
    "fullname": "Barbie™ (the movie, the doll, the phenomenon)",
    "info": "This course takes the blockbuster Barbie movie as a jumping off point for exploring the history, meanings, identities, marketing, and social and creative practices associated with the iconic doll. We will consider how Barbie has changed over time, her relationship to femininity, feminism, and social differences, and her role in the lives of diverse women and girls. We will watch several fascinating documentaries and read scholarship on Barbie across disciplines, including gender studies, film studies, anthropology, art history, girlhood studies, and media and cultural studies.  Students will write reflection papers and short critiques, and will compete one or more creative assignments, such as a social media project or creating a “weird” barbie.",
    "prereq": {}
  },
  {
    "uid": "827234",
    "code": "CSCL1924",
    "subject": "CSCL",
    "number": "1924",
    "honors": false,
    "writing": false,
    "name": "Doing Race in Cinema",
    "fullname": "Doing Race in Cinema",
    "info": "This seminar uses film as a way to talk about how race, racism, and racial struggle have shaped American life. And it uses race as an analytic that can help us learn about the workings of film—as a way to ask why films look and sound the way they do, why films tell the kinds of stories they tell in the ways they tell them, and why films affect audiences so powerfully. We’ll watch and discuss a range of films that put racial identity and racial conflict in the foreground. This range will encompass recent Hollywood films, indie and experimental cinema, and examples of action/adventure, sci-fi, musical, and comedy; it’ll emphasize films by directors of color and women directors, and it’ll include movies by renowned figures like Spike Lee and the early Black American director Oscar Micheaux. Throughout our discussions we’ll be asking how films \"materialize\" racial, ethnic, gender, and national identities: how films can depict, perform, and help create these identities, and how they show what it’s like to \"live\" these identities.",
    "prereq": {}
  },
  {
    "uid": "017011",
    "code": "CSCL3000",
    "subject": "CSCL",
    "number": "3000",
    "honors": false,
    "writing": false,
    "name": "Topics",
    "fullname": "Topics",
    "info": "Selected topics.",
    "prereq": {}
  },
  {
    "uid": "814109",
    "code": "CSCL3005",
    "subject": "CSCL",
    "number": "3005",
    "honors": false,
    "writing": false,
    "name": "Seminar in Critical Thought",
    "fullname": "Seminar in Critical Thought",
    "info": "Exploration of concepts and problems foundational to the practice of critique. Focus on paradigmatic concerns and shifts underpinning humanistic inquiry, from the past to the present, such as representation, narrative, ideology, subjectivity, power and violence, and transformation. Groundwork for understanding the European critical tradition and key challenges from non-European sources.",
    "prereq": {}
  },
  {
    "uid": "791026",
    "code": "CSCL3111W",
    "subject": "CSCL",
    "number": "3111",
    "honors": false,
    "writing": true,
    "name": "Close Reading",
    "fullname": "Close Reading",
    "info": "History/theory of 'close reading' (i.e., the most intense encounter between reader and text) exemplified through critical texts. Students perform close readings of various texts.",
    "prereq": {}
  },
  {
    "uid": "791027",
    "code": "CSCL3117",
    "subject": "CSCL",
    "number": "3117",
    "honors": false,
    "writing": false,
    "name": "Concepts of Literary Study",
    "fullname": "Concepts of Literary Study",
    "info": "This course begins by asking what this strange thing we call literature is, this six-thousand year old form of writing that brings into existence, each time a work is read, a world that did not previously exist. Sometimes that world is one in which we long to live, sometimes it is dark and foreboding, all death and despair; sometimes we seek it out as an escape from our daily lives, sometimes we enter it to be able to better understand those same lives, to come back to them refreshed, not just emotionally but intellectually -- for if literature does involve an immersion in the not-actually-existent, a departure from the everyday world, it does so by engaging us from within the world and in such a way that it is able to recast our everyday world and make us think it in new ways. And literature does all this with that most everyday of things, language. By attending to the ways authors and scholars mobilise language’s expressive, analytic and conceptual resources, with this course we shall learn various methods of critically appreciating and engaging complex literature, while gaining insight into how the practices of literary criticism and theory relate to, and help us understand, the world in which we live, how language shapes and forms that world and literature’s unique place and role in that world and its forming.",
    "prereq": {}
  },
  {
    "uid": "003582",
    "code": "CSCL3120",
    "subject": "CSCL",
    "number": "3120",
    "honors": false,
    "writing": false,
    "name": "Poetry as Cult Crit",
    "fullname": "Poetry as Cultural Critique",
    "info": "Examines the status of \"poetry\" in several cultures of the Americas bringing together techniques of close reading and broad cultural inquiry.",
    "prereq": {}
  },
  {
    "uid": "791021",
    "code": "CSCL3122",
    "subject": "CSCL",
    "number": "3122",
    "honors": false,
    "writing": false,
    "name": "Movements and Manifestos",
    "fullname": "Movements and Manifestos",
    "info": "Movements that emerge when a group of writers, filmmakers, artists, composers,\nor musicians puts forth a new definition of literature, film, art, or music—and sets in motion new relations\n(aesthetic and social) of word, image, sound. Manifestos—statements of position—that articulate or\ncounter such definitions. Movements created by scholars or critics after the fact. Focuses on one or two\nrelated movements (e.g., romanticism and realism, surrealism and negritude, new wave and third cinema).",
    "prereq": {}
  },
  {
    "uid": "797088",
    "code": "CSCL3123",
    "subject": "CSCL",
    "number": "3123",
    "honors": false,
    "writing": false,
    "name": "Jews, Germans, Race, Memory",
    "fullname": "Jewish and German Writing at the Margins: Multilingualism, Race, Memory",
    "info": "How are minority stories, novels, and poems constructed at the margins of a majority culture's language? This course addresses this question by exploring the complexity of Jewish culture in modernity, with a focus on 20th and 21st century German and American literature. We will first tackle the open-ended and endlessly productive question of what is meant by Jewish culture. What is a Jewish writer and is there such a thing as Jewish writing? What makes a text ? How do Jewish authors challenge the assumptions of majority culture in their work? What role do multilingualism and translation play in the formation of Jewish cultures at the margins? We will trace the lines of affinity between the U.S. and Europe to explore the entangled histories of Germans and Jews, and between German Jews and Turkish Germans, as we look at works that challenge and expand the definition of Jewishness in the 20th century. Additional topics to be considered include how the legacies of American slavery and European colonialism shape our understandings of the Nazi genocide of the Jews, and whether Jewish writing should be understood under the rubric of whiteness? Moving beyond the approach to German Jewish literary studies anchored in Weimar Germany, we will explore the circulation of Jewish memory between Europe and the U.S. in the aftermath of the Holocaust. We will read works by, among others, Franz Kafka, Paul Celan, Gershon Scholem, Hannah Arendt, Benjamin Stein, Walter Benjamin, Barbara Honigmann, Hélène Cixous, Raymond Federman, W.G. Sebald, Allen Ginsberg, Adeena Karasick, Alfred Kazin, Saul Bellow, Philip Roth, Bernard Malamud, Avram Sutzkever, Zafer Senocak.\n\nprereq: No knowledge of German required; some work in German must be done in order to count this course toward a German minor or a German, Scandinavian, Dutch major.",
    "prereq": {}
  },
  {
    "uid": "797397",
    "code": "CSCL3130W",
    "subject": "CSCL",
    "number": "3130",
    "honors": false,
    "writing": true,
    "name": "Col/Postcolonial Lit & Theory",
    "fullname": "Colonial and Postcolonial Literatures and Theory: 1700 to the Present",
    "info": "Readings in colonial/postcolonial literatures/theory from at least two world regions: Africa, the Americas, the Arab world, Asia, Europe, and the Pacific. Cultural/psychological dynamics and political economy of world under empire, decolonization, pre- vs. post-coloniality, globalization.",
    "prereq": {}
  },
  {
    "uid": "819010",
    "code": "CSCL3141",
    "subject": "CSCL",
    "number": "3141",
    "honors": false,
    "writing": false,
    "name": "Classics of World Lit",
    "fullname": "Classics of World Literature",
    "info": "This will be an introduction to the concept of world literature – that is, literature from the Arab, Asian, African, Latin American and Oceanic worlds, not only the English-speaking countries of England and its former colonies.   And it will introduce students to some of the basic methods of comparative literary study such as close reading, genre analysis, etymology, stylistics, and translation.   We will discuss classic problems confronted within comparative literature such as collective authorship, the spirit of a people, the historical reconstruction of the past through the study of language, comparative cultural value, and the effects on language and learning prompted by technology (in the form, for example, of the “digital humanities”).   We will ask how comparative literature differs from other forms of literary study, but most of all concentrate on the low-tech (but not anti-technological) reading of literary texts – the student alone with a book in their hand -- while mastering as one’s own a handful of the enduring classics of world literature – books that have influenced many generations of thinkers and writers but that, oddly, are not typically covered in any college curriculum: not in English classes, humanities introductions, or general knowledge courses.   Our focus will be on books that happen both to be central to Western and world culture as part of the inheritance of its educated citizens, but also that happen to be lost at the same time, known about rather than known, invoked but not studied, quoted from but not generally understood.   We will be addressing books, in other words, that deeply inspired, but also shaped the thinking of many of the scientists, artists, and scholars of the past, and which were once common knowledge – the expected points of departure for all educated men and women.   In our own day, their influence has hardly waned – although not in their original form.  Modern film and television industries, for instance, rely heavily on their stories, even as philosophers and theologians cannot express themselves without drawing on their characters, languages, and plots.  Even the basic elements of advertising would be unthinkable without being able to draw on their repertoire of common stories, mythological settings, and cast of heroes.  In an age of radical departures and brave new worlds, we are interested here in invaluable traditions, which have not lost their relevance.  ",
    "prereq": {}
  },
  {
    "uid": "797790",
    "code": "CSCL3181",
    "subject": "CSCL",
    "number": "3181",
    "honors": false,
    "writing": false,
    "name": "East Asian Cinemas",
    "fullname": "East Asian Cinemas",
    "info": "East Asian cinemas. Structure/content of films from China, Japan, Hong Kong, Taiwan, Korea, Thailand, Vietnam. Historical representation, aesthetic strategies, narrative content. Race, class, gender, revolution, colonialism.",
    "prereq": {}
  },
  {
    "uid": "003580",
    "code": "CSCL3210",
    "subject": "CSCL",
    "number": "3210",
    "honors": false,
    "writing": false,
    "name": "Cinema and Ideology",
    "fullname": "Cinema and Ideology",
    "info": "The cinema as a social institution with emphasis on the complex relations it maintains with the ideological practices that define both the form and the content of its products. Specific films used to study how mass culture contributes to the process of shaping beliefs and identities of citizens.",
    "prereq": {}
  },
  {
    "uid": "003584",
    "code": "CSCL3211",
    "subject": "CSCL",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "Global & Transnational Cinemas",
    "fullname": "Global & Transnational Cinemas",
    "info": "This course explores Global and Transnational Cinemas as alternative traditions to the dominant Hollywood-centered accounts of film history. Students will grapple with the historical, social, and political motivations of cinematic projects that critique traditions of national cinema, or that resist the hegemonic force of neocolonial cultural centers. Italian Neo-realism and the French New Wave will be examined as movements that challenge politics and mass culture. Third Cinema in Latin America and pan-African cinematic movements will be examined through their struggles with both colonialism and the rise of post-colonial dictatorships. Indian and Japanese cinemas of the 50s & 60s will mark out new possibilities of filmmaking and distribution. Finally, counter-hegemonic and experimental movements in U.S.-based film, such as the L.A. Rebellion and Fluxus, will allow students to understand how opposition to Hollywood style could exist within the very centers of cultural power while also reaching out to larger global communities.",
    "prereq": {}
  },
  {
    "uid": "799619",
    "code": "CSCL3212W",
    "subject": "CSCL",
    "number": "3212",
    "honors": false,
    "writing": true,
    "name": "Documentary Cinema",
    "fullname": "Documentary Cinema: History and Politics",
    "info": "This course explores the ethics and aesthetics of documentary cinema, arguably the very first genre of film. We will track the way documentary has widened from largely instructional and experimental uses early in its history to become a distinct genre among today’s familiar feature films. We will screen early documentaries, which may include shocking ethnographies (Nanook of the North, The Mad Masters). Over the course of the term, the syllabus makes its way to recent exemplars of the genre (films may include: Amy, American Teen, I Am Not Your Negro, A Jihad for Love, Generation Wealth, Fetish, Blackfish and so on). One of our aims will be to explore students’ relations as viewers and documentarians themselves (via smartphones, Instagram, etc.) to this participatory, revelatory, and always controversial, politically fraught film practice. \n\nDocumentary Cinema includes both full class lectures and discussions as well as small group discussion of films and readings, and may include the opportunity for students to create their own personal documentary. Intellectually, the course balances out a study of the grammar of documentary as an artistic practice with explorations of the ways the genre reflects broader currents of cinematic and cultural history. By the end of the semester, students should have a stronger understanding of the ways documentary cinema opens our senses to the world around us.",
    "prereq": {}
  },
  {
    "uid": "816335",
    "code": "CSCL3220W",
    "subject": "CSCL",
    "number": "3220",
    "honors": false,
    "writing": true,
    "name": "Screen Cultures",
    "fullname": "Screen Cultures",
    "info": "Screens increasingly define the ways that we communicate with one another and how we encounter the world. This course will offer a critical, historical approach to the emergence of “screen cultures” from the beginning of photography and cinema to our own age of ubiquitous touch screen displays. We will pay a great deal of attention to the ways that such technologies drive our patterns of consumption and production as well as how they create and define our social environments.",
    "prereq": {}
  },
  {
    "uid": "790864",
    "code": "CSCL3221",
    "subject": "CSCL",
    "number": "3221",
    "honors": false,
    "writing": false,
    "name": "On Television",
    "fullname": "On Television",
    "info": "We will study writings on television and specific TV shows from a variety of angles to understand the rise of American broadcast technologies, how race and class are crafted on TV, representations of gender and the home, postmodernity and late capitalism, the rise and demise and of taste, global television and the public sphere, the production of “reality” in our present historical moment, and changes in televisual technologies. Throughout the course, we will also consider what constitutes television—the technology, the form, and the content—and learn to read these three facets of it concurrently.",
    "prereq": {}
  },
  {
    "uid": "003583",
    "code": "CSCL3231",
    "subject": "CSCL",
    "number": "3231",
    "honors": false,
    "writing": false,
    "name": "Comedy: Media/Politics/Society",
    "fullname": "Comedy: Media, Politics & Society",
    "info": "What makes some jokes so funny? And why do we laugh? In this course, we will approach the topic of comedy from every angle. We will study theories and philosophies of humor, and will survey many different forms of the genre—film, television, viral web videos, internet memes, stand-up, improv, sketch comedy, absurdist theater, and political satire. And, of course, we will write and perform our own comedy in the classroom. By studying the history and formations of comedy, we will think about how jokes can help us change the rules of everyday life and imagine a new way forward.",
    "prereq": {}
  },
  {
    "uid": "003581",
    "code": "CSCL3251",
    "subject": "CSCL",
    "number": "3251",
    "honors": false,
    "writing": false,
    "name": "Popular Music and Mass Culture",
    "fullname": "Popular Music and Mass Culture",
    "info": "This course investigates the ways popular music is imbricated with the our identities, social affiliations and attitudes towards others on the scale of millions of people—what we might call “mass culture.” We will explore how popular music produces emotion, a sense of intoxication, and erotic desire; how it can be linked with self-discipline, bodily exercise, state security, sovereign authority, patriotism, courage, punishment, and violence; and how music might be heard related to labor and work, consumerism and consumption, and capitalism more broadly. We will puzzle over the ways music can give coherence to a cultural group, accompany moral education and action, challenge or reinforce gender conventions, mobilize and disperse political resistance, or lead one into a trance of spiritual and religious ecstasy. While we will still attend to a variety of “purely” musical elements both large and small (chords, verses, choruses, singing styles, lyrics, etc.), our central focus will be on forming a more philosophical view of its functions within popular culture. Genres to be discussed include rock, pop, hip-hop, R&B, electronic dance music, performances of the national anthem, and experimental music.",
    "prereq": {}
  },
  {
    "uid": "812780",
    "code": "CSCL3281",
    "subject": "CSCL",
    "number": "3281",
    "honors": false,
    "writing": false,
    "name": "European Intellectual Hist I",
    "fullname": "European Intellectual History: The Early Modern Period, Antiquity to 1750",
    "info": "First of a two-semester course. European thought in its historical/cultural context. Emphasizes development of philosophical/scientific thought, its relation to thinking about the individual and the community. Readings from original sources.",
    "prereq": {}
  },
  {
    "uid": "812781",
    "code": "CSCL3282",
    "subject": "CSCL",
    "number": "3282",
    "honors": false,
    "writing": false,
    "name": "European Intellectual Hist II",
    "fullname": "European Intellectual History: The Modern Period, 1750-Present",
    "info": "Second of a two-semester course. European thought in its historical/cultural context. Emphasizes development of philosophical/scientific thought, its relation to thinking about the individual and the community. Readings are from original sources.",
    "prereq": {}
  },
  {
    "uid": "009202",
    "code": "CSCL3310W",
    "subject": "CSCL",
    "number": "3310",
    "honors": false,
    "writing": true,
    "name": "The Rhetoric of Everyday Life",
    "fullname": "The Rhetoric of Everyday Life",
    "info": "How discourse reproduces consciousness and persuades us to accept that consciousness and the power supporting it. Literary language, advertising, electronic media; film, visual and musical arts, built environment, and performance. Techniques for analyzing language, material culture, and performance. (previously 3173W)",
    "prereq": {}
  },
  {
    "uid": "010273",
    "code": "CSCL3322",
    "subject": "CSCL",
    "number": "3322",
    "honors": false,
    "writing": false,
    "name": "Visions of Nature",
    "fullname": "Visions of Nature: The Natural World and Political Thought",
    "info": "Scientific and cultural theory concerning the organization of nature, human nature, and their significance for development of ethics, religion, political/economic philosophy, civics, and environmentalism in Western/other civilizations.  ",
    "prereq": {}
  },
  {
    "uid": "003587",
    "code": "CSCL3323",
    "subject": "CSCL",
    "number": "3323",
    "honors": false,
    "writing": false,
    "name": "Science and Culture",
    "fullname": "Science and Culture",
    "info": "Science and technology engaged through historical and cultural manifestations from film, literature, and YouTube to scientific and philosophical essays. Relations among humanities, science, economics, politics, philosophy and history. Psychiatry and drugs, food and agriculture, sexuality, religion and science, climate change.",
    "prereq": {}
  },
  {
    "uid": "791020",
    "code": "CSCL3334",
    "subject": "CSCL",
    "number": "3334",
    "honors": false,
    "writing": false,
    "name": "Monsters, Robots, Cyborgs",
    "fullname": "Monsters, Robots, Cyborgs",
    "info": "Historical/critical reading of figures (e.g., uncanny double, monstrous aberration, technological hybrid) in mythology, literature, and film, from classical epic to sci-fi, cyberpunk, and Web. (previously 3461)",
    "prereq": {}
  },
  {
    "uid": "802075",
    "code": "CSCL3335",
    "subject": "CSCL",
    "number": "3335",
    "honors": false,
    "writing": false,
    "name": "Aliens: SciFi to Social Theory",
    "fullname": "Aliens: Science Fiction to Social Theory",
    "info": "In English, the word “alien” designates both immigrants from other countries and beings from other worlds. Aliens of all sorts are everywhere; they tend to provoke fascination, fantasy, and for many, fear and anxiety. But the deeper philosophical significance of aliens says as much about us as it does about them. In this course, we will explore these questions through a range of novels, films, and artworks from the 1890s to the present day, with an emphasis on science fiction and American popular culture.",
    "prereq": {}
  },
  {
    "uid": "003595",
    "code": "CSCL3350W",
    "subject": "CSCL",
    "number": "3350",
    "honors": false,
    "writing": true,
    "name": "Sexuality and Culture",
    "fullname": "Sexuality and Culture",
    "info": "Historical/critical study of forms of modern sexuality (heterosexuality, homosexuality, romance, erotic domination, lynching). How discourses constitute/regulate sexuality. Scientific/scholarly literature, religious documents, fiction, personal narratives, films, advertisements.",
    "prereq": {}
  },
  {
    "uid": "003597",
    "code": "CSCL3351W",
    "subject": "CSCL",
    "number": "3351",
    "honors": false,
    "writing": true,
    "name": "Body and Politics",
    "fullname": "The Body and the Politics of Representation",
    "info": "Western representation of the human body, 1500 to present. Body's appearance as a site and sight for production of social and cultural difference (race, ethnicity, class, gender).  Visual arts, literature, music, medical treatises, courtesy literature, erotica. (previously 3458W)",
    "prereq": {}
  },
  {
    "uid": "816405",
    "code": "CSCL3352W",
    "subject": "CSCL",
    "number": "3352",
    "honors": false,
    "writing": true,
    "name": "Queer Aesthetics & Critique",
    "fullname": "Queer Aesthetics & Queer Critique",
    "info": "Is there such a thing as global queer aesthetic? If so, how do various modes of representation and expression (novels, poetry, and sophisticated uses of language across film, television and video, digital media, pop music and punk) elaborate and enact queerness in particular material ways while also helping to create a larger, intermedial queer culture?\n",
    "prereq": {}
  },
  {
    "uid": "818200",
    "code": "CSCL3353",
    "subject": "CSCL",
    "number": "3353",
    "honors": false,
    "writing": false,
    "name": "Arts of Africa",
    "fullname": "Contemporary Sub-Saharan African Popular Art Forms",
    "info": "According to the US Population Reference Bureau, Africans will represent 21% of the world population in 2050, a higher percentage than Chinese or Indians. Other research and data agencies credit contemporary African societies with among the fastest rates of urban expansion in the world. Such stupendous demographic surge and breakneck acceleration of urban growth have engendered intense dislocation and cultural upheaval in populations caught between two competing narratives of social change: one of celebration; the other of crisis. This course explores contemporary sub-Saharan African popular cinema, popular music, TV/radio series, bus slogans, community theatre, graphic narratives, fashion, sports, and other forms of popular communication as signifiers of larger social, political, and economic processes. It examines popular cultural forms as constantly evolving expressions of social, political, and personal identities in an ever globalized and interconnected world. As sites where the tensions, frictions, collisions and notably, the productive creativities of the local and the global are circulated, negotiated and contested African popular cultures provide insights into a unique and increasingly crucial facet of contemporary African artistic practice as critical intervention. Through our discussion of art and gender, we will examine the gendering of specific popular forms, their role in hegemonic formations, as well as their subversion in resistant practices and discourses.",
    "prereq": {}
  },
  {
    "uid": "003588",
    "code": "CSCL3366W",
    "subject": "CSCL",
    "number": "3366",
    "honors": false,
    "writing": true,
    "name": "Landscape, Nature, Society",
    "fullname": "Landscape, Nature, Society",
    "info": "Importance of the concept of nature in Anglo-american culture in the period 160-1875. Focuses on role of property relations, travel and exploration, religion, and philosophy.  Topics include \"the Garden in the Wilderness,\" English landscape gardens, American painters of the West, and the sublime.",
    "prereq": {}
  },
  {
    "uid": "816406",
    "code": "CSCL3405",
    "subject": "CSCL",
    "number": "3405",
    "honors": false,
    "writing": false,
    "name": "Marx for Today",
    "fullname": "Marx for Today",
    "info": "A century and a half after the publication of Karl Marx’s Capital, Vol. 1 (1867), this course will reflect on the political urgency of our current moment in order to understand the relevance and complexity of Marx and the Marxist tradition. We will pursue an intensive study of primary readings written by Karl Marx himself, exploring the social, philosophical, and political history of Marxist thought and familiarizing ourselves with key concepts such as labor-power, primitive accumulation, the commodity, use value, exchange-value, surplus-value, crisis, money, and capital. As we study Marx as a theoretician, we will also examine his work as a political revolutionary, writer, and correspondent with many of the most important revolutionary figures of his day. Here we will foreground his analysis of the labor of enslaved Black persons in the plantation economies of the Southern United States—which he ties to the labor markets of capitalism in Europe—as well as his more explicit critiques of slavery and colonialism.\n\nFollowing this close reading of Marx and the Marxist tradition, we will consider the ways that critical thinkers and political activists, both in the United States and globally, continue to resist, create, and dream under the banner of Marxism throughout the twentieth century and into our own new century. We will center questions of racial justice through the writings of W. E. B. Du Bois and contemporary Marxist scholars of race, indigeneity, and diaspora, focusing on Du Bois’s attention to the links between race and social class in America. Alongside critical reappraisals of Marx’s thought, we shall think about the influence of Marx’s writings on political activists in the Black Panther Party and the American Indian Movement, and on American labor, as well as on South American revolutionaries like Carlos Marighella. We will then move to a study of Marxist feminism, linking race and gender in U.S. and global Marxisms through readings by Black Panther activist and intellectual Angela Davis, the social historian Nancy Fraser, and Italian Marxist feminist Silvia Federici. We will revisit the question of gender oppression and feminist resistance through a Marxist frame, with reference to the revival of socialist prospects in the work of Jodi Dean and Mackenzie Wark. Finally, we will examine the contemporary fight over reproductive rights and the history of the “Wages for Housework” movement.\nFrom these readings and conversations we will think about how Marx’s ideas and their larger legacy can help us to understand our current moment and our political, social, and ecological futures. In as much as this is a course on theoretical perspectives, it will also be one that seeks to use Marx, and the Marxist tradition, to develop critical perspectives and solutions to pressing issues of racial injustice, social inequality, and environmental devastation.",
    "prereq": {}
  },
  {
    "uid": "003590",
    "code": "CSCL3412W",
    "subject": "CSCL",
    "number": "3412",
    "honors": false,
    "writing": true,
    "name": "Psychoanalysis",
    "fullname": "Psychoanalysis",
    "info": "The work of Sigmund Freud has withstood years of controversy to install itself as foundational to the way we understand the relationship between individual desires, social structures, and cultural practices. This is in part because Freud’s writings were not restricted to the domain of psychology. His writings also renewed grand philosophical questions in ways that dramatically transformed them. He asked: What is a human subject? What are the causes of her actions? What are the nature and motivations of her engagement with others? In the many decades since his early publications, Freud’s key concepts like the ego, the superego, the id, the unconscious, and the significance of dreams and jokes have had an enduring influence in Western culture. This course introduces students to a range of psychoanalytic writings from Freud’s early theories of mental structure and human development to contemporary applications, re-workings, and critiques of psychoanalysis. We will discuss concepts like the unconscious, sexuality, disavowal, repression, neurosis, melancholia, the pleasure principle and the death drive. By the end of the course, we will have developed a sense of the uses and limitations of psychoanalysis for understanding pressing global issues such as sexual identification and its formation, racism, neo-fascism, extreme political division, war and nationalism, climate change, and the destruction of democratic ideals. Authors read may include Melanie Klein, Franz Fanon, Jacques Lacan, Julia Kristeva, David Eng, Slavoj Zizek, Henry Stack Sullivan, Kalpana Sheshadri- Crooks and Margaret Mahler. Readings will be complemented with short stories, literary excerpts, film clips, as well as discussion of current political issues.",
    "prereq": {}
  },
  {
    "uid": "003591",
    "code": "CSCL3413W",
    "subject": "CSCL",
    "number": "3413",
    "honors": false,
    "writing": true,
    "name": "Psych and Lit II",
    "fullname": "Psychoanalysis and Literature Part II: Post Freudian Criticism",
    "info": "Impact of psychoanalytic discourses on literary studies and vice versa. Archetypal of Jung; structural of Lacan; post-structural of Derrida and Kristeva; feminist psychoanalysis of Mitchell; self/object of Kernberg and Kohut; the unconscious and society of Deleuze and Guattari.",
    "prereq": {}
  },
  {
    "uid": "003593",
    "code": "CSCL3421",
    "subject": "CSCL",
    "number": "3421",
    "honors": false,
    "writing": false,
    "name": "Culture Mod Ident 1",
    "fullname": "Culture and the Production of Modern Identity I: 1600-1750",
    "info": "History of cultural, perceptual and/or conceptual changes in Western societies, 1600 to 1750, concerning new and conflicting understandings of the human imagination, subjectivity, identity, and the body; addressed through philosophy, literature, visual arts, music, pedagogical and medical treatises, and manners.",
    "prereq": {}
  },
  {
    "uid": "003594",
    "code": "CSCL3422",
    "subject": "CSCL",
    "number": "3422",
    "honors": false,
    "writing": false,
    "name": "Culture Mod Ident 2",
    "fullname": "Culture and the Production of Modern Identity II: 1750-1900",
    "info": "History of cultural, perceptual and/or conceptual changes in Western societies, 1750 to 1900, concerning new and conflicting understandings of the human imagination, subjectivity, identity, and the body; addressed\nthrough philosophy, literature, visual arts, music, pedagogical and medical treatises, and manners. ",
    "prereq": {}
  },
  {
    "uid": "003586",
    "code": "CSCL3425W",
    "subject": "CSCL",
    "number": "3425",
    "honors": false,
    "writing": true,
    "name": "Critical Theory & Soc Change",
    "fullname": "Critical Theory and Social Change",
    "info": "This course introduces students to influential thinkers in the field of critical theory, broadly conceived. Critical theory is similar to philosophy because it asks big questions that stretch the boundaries of human knowledge. But it is distinct in its focus on practical change—critical theory advocates for a more just and emancipated human world. Its key techniques are the diagnosis and critique of histories, systems, and ideologies of social power. Critical theory emerged from a group of Marxist intellectuals in the 1920s and 30s who were concerned about the rise of fascism, the staggering inequalities produced by industrial capitalism, the trauma of mass violence, and the numbing standardization of modern life. Since then, the field has expanded to encompass concerns about structural racism, gender inequality, the rise of neoliberalism, the expansion of modern carceral and mental health systems, and the ongoing inequities wrought by histories of slavery, colonization, and imperial conquest. Featured authors may include Sigmund Freud, W. E. B. Du Bois, Georg Simmel, Walter Benjamin, Max Horkheimer, Theodor Adorno, Frantz Fanon, Herbert Marcuse, Patricia Hill Collins, Malcom X, Jackie Wang, Angela Y. Davis, Sheldon George, Alfredo Carrasquillo, Joshua Javier Guzman, Willy Apollon, Jean Rouch, Michel-Rolph Trouillot, Saidiya Hartman, bell hooks, Édouard Glissant, Aurora Levins Morales, Michael Rothberg, Nelson Maldonado-Torres, Christopher Pexa, Yuichiro Onishi, Kwame Anthony Appiah, Lewis Gordon, and Barbara Christian.",
    "prereq": {}
  },
  {
    "uid": "003599",
    "code": "CSCL3472",
    "subject": "CSCL",
    "number": "3472",
    "honors": false,
    "writing": false,
    "name": "Gay Men, Homophobia in America",
    "fullname": "Gay Men and Homophobia in American Culture",
    "info": "The historical experience of gay men, the social construction of same-sex desire in American society since 1700, studied in a broad context of cultural history and discourse, including literature and the arts, journalism, science and medicine, religion, and law.",
    "prereq": {}
  },
  {
    "uid": "818543",
    "code": "CSCL3896",
    "subject": "CSCL",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "CSCL students who would like to pursue paid or unpaid internships can also earn credit toward their degree. This course includes a series of reflective assignments on the internship experience that help students develop their career goals, aspirations, and plans. CSCL students often find internships at media companies, advertising agencies, film festivals, arts institutions and galleries, publishing houses, non-profits, and community organizations. Typically a student’s work is supervised and evaluated by a site coordinator and the instructor works with a student on readings and assignments. Credits taken are determined by the number of weekly or total hours for onsite internship work, course readings, assignments, and meetings. The following are minimum hours and weekly averages based on a 16 week semester: 1 credit - 45-hour minimum (average 3-4 hours per week) 2 credit - 90-hour minimum (average 5-7 hours per week) 3 credit - 135-hour minimum (average 8-9 hours per week) 4 credit - 180-hour minimum (average 10-12 hours per week) There is also a deferred enrollment section of the course that allows students to take a summer internship followed by fall enrollment for credit. Students interested or registered in this section must contact the instructor at the start of their internship or during registration for more information. Students are also encouraged to apply for CLA Internship and Leadership Scholarships. For more information on this course or internship possibilities, please contact the Film Studies Coordinator (stou0046@umn.edu). Students can also use Goldpass to search for internship possibilities.",
    "prereq": {}
  },
  {
    "uid": "003601",
    "code": "CSCL3910",
    "subject": "CSCL",
    "number": "3910",
    "honors": false,
    "writing": false,
    "name": "Topics in CSCL",
    "fullname": "Topics in Cultural Studies and Comparative Literature",
    "info": "Topics vary by instructor and semester",
    "prereq": {}
  },
  {
    "uid": "791917",
    "code": "CSCL3920",
    "subject": "CSCL",
    "number": "3920",
    "honors": false,
    "writing": false,
    "name": "Topics Cinema, Media Culture",
    "fullname": "Topics in Cinema and Media Culture",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "003585",
    "code": "CSCL3979",
    "subject": "CSCL",
    "number": "3979",
    "honors": false,
    "writing": false,
    "name": "Cultural Pluralism",
    "fullname": "Issues in Cultural Pluralism",
    "info": "Critical/comparative basis for study of racial, ethnic, and cultural communities, primarily in the U.S. Perspectives on identity, citizenship, democracy, and power.",
    "prereq": {}
  },
  {
    "uid": "790349",
    "code": "CSCL3993",
    "subject": "CSCL",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "802184",
    "code": "CSCL4910",
    "subject": "CSCL",
    "number": "4910",
    "honors": false,
    "writing": false,
    "name": "Topics CSCL",
    "fullname": "Topics in Cultural Studies and Comparative Literature",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "008655",
    "code": "CSCL4990W",
    "subject": "CSCL",
    "number": "4990",
    "honors": false,
    "writing": true,
    "name": "Senior Seminar",
    "fullname": "Senior Seminar and Workshop",
    "info": "Student-defined, faculty-assisted collective research project devoted to the comparative, sociohistorical analysis of discursive practices and cultural artifacts. Limited to CSCL majors, this seminar/workshop offers an opportunity to apply skills and knowledge gained in previous classes, and to develop skills in research, critique, and presentation.",
    "prereq": {}
  },
  {
    "uid": "794411",
    "code": "CSCL4993",
    "subject": "CSCL",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual study.",
    "prereq": {}
  },
  {
    "uid": "008228",
    "code": "CSCL5147",
    "subject": "CSCL",
    "number": "5147",
    "honors": false,
    "writing": false,
    "name": "Teaching as Dialog",
    "fullname": "Teaching as Dialogue",
    "info": "Teaching and the teacher are the subject. Entering into dialogue is the method. Issues with the politics of teaching, the means of entering into dialogue, questions of judgment, and the idea of self-teaching as the goal of teaching.",
    "prereq": {}
  },
  {
    "uid": "003603",
    "code": "CSCL5154W",
    "subject": "CSCL",
    "number": "5154",
    "honors": false,
    "writing": true,
    "name": "Theories of Space",
    "fullname": "Theoretical Constructions of Space",
    "info": "Inquiry into theories of space drawn from various disciplines including anthropology, architecture, geography, history, landscape design, philosophy, planning, and sociology.  Focus on sociopolitical interests that are served and sustained; emphasis on opportunities and implications for personal identity.",
    "prereq": {}
  },
  {
    "uid": "003604",
    "code": "CSCL5256W",
    "subject": "CSCL",
    "number": "5256",
    "honors": false,
    "writing": true,
    "name": "Suburbia",
    "fullname": "Suburbia",
    "info": "Suburbia from origins in 18th-century England to the present. Historical changes and present challenges, especially in America. Ideology, mythology, planning, development, geography, transportation, the family. Specific sites and designs; representations in film, television, popular literature, and music.",
    "prereq": {}
  },
  {
    "uid": "812782",
    "code": "CSCL5281",
    "subject": "CSCL",
    "number": "5281",
    "honors": false,
    "writing": false,
    "name": "European Intellectual Hist I",
    "fullname": "European Intellectual History: The Early Modern Period, Antiquity to 1750",
    "info": "First of a two-semester course. European thought in its historical/cultural context. Emphasizes development of philosophical/scientific thought, its relation to thinking about the individual and the community. Readings from original sources.",
    "prereq": {}
  },
  {
    "uid": "812783",
    "code": "CSCL5282",
    "subject": "CSCL",
    "number": "5282",
    "honors": false,
    "writing": false,
    "name": "European Intellectual Hist II",
    "fullname": "European Intellectual History: The Modern Period, 1750-Present",
    "info": "Second of a two-semester course. European thought in its historical/cultural context. Emphasizes development of philosophical/scientific thought, its relation to thinking about the individual and the community. Readings are from original sources.",
    "prereq": {}
  },
  {
    "uid": "003606",
    "code": "CSCL5301",
    "subject": "CSCL",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Society Ideol & Art",
    "fullname": "Society, Ideology, and the Production of Art",
    "info": "Recent critical theories on the relation of the arts to social and ideological forces; selected artifices from Western culture (Renaissance to 20th century; high, popular, and mass culture).  Music, visual art, literature.",
    "prereq": {}
  },
  {
    "uid": "003607",
    "code": "CSCL5302",
    "subject": "CSCL",
    "number": "5302",
    "honors": false,
    "writing": false,
    "name": "Aesthetics & Valuation of Art",
    "fullname": "Aesthetics and the Valuation of Art",
    "info": "Society, ideology, and aesthetic value considered in light of recent critical theories of visual art, music, and literature. Meditations of place, social class, gender and ideology on aesthetic judgment in post-Renaissance Western culture.",
    "prereq": {}
  },
  {
    "uid": "825221",
    "code": "CSCL5303",
    "subject": "CSCL",
    "number": "5303",
    "honors": false,
    "writing": false,
    "name": "Sound Studies",
    "fullname": "Sound Studies",
    "info": "What is sound? Among the various ways of absorbing the world through the senses (looking, reading, watching, touching, tasting), what is unique to the actions of listening and hearing? And over the course of human history, how has sound been variously deployed, framed, and constructed? This course covers a diverse range of topics in the fast-developing interdisciplinary field of Sound Studies from the philosophy of sound to psychoanalytic theories of the voice, the gendered histories of telephones, accounts of radio and decolonization, film sound, sonic expressions of race, the politics of global popular music, mobile media technologies, and cutting-edge approaches to sound art.",
    "prereq": {}
  },
  {
    "uid": "808430",
    "code": "CSCL5305",
    "subject": "CSCL",
    "number": "5305",
    "honors": false,
    "writing": false,
    "name": "Vision and Visuality",
    "fullname": "Vision and Visuality: An Intellectual History",
    "info": "Central role of vision/visuality in modernity. Modern age as scopic regime. Ways that ideas/ideologies of perception have shaped aesthetic experience within social existence.",
    "prereq": {}
  },
  {
    "uid": "010880",
    "code": "CSCL5331",
    "subject": "CSCL",
    "number": "5331",
    "honors": false,
    "writing": false,
    "name": "Discourse of Novel",
    "fullname": "Discourse of the Novel",
    "info": "Comparative study of the novel, 18th century to present. Its relations to ordinary language practices, emergent reading publics, technologies of cultural dissemination, problems of subjectivity, and its role in articulating international cultural relations.",
    "prereq": {}
  },
  {
    "uid": "806566",
    "code": "CSCL5401",
    "subject": "CSCL",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Origins of Cultural Studies",
    "fullname": "Origins of Cultural Studies",
    "info": "Intellectual map of the creation of cultural studies as a unique approach to studying social meanings. Key figures and concepts, including nineteenth- and early twentieth century precursors.",
    "prereq": {}
  },
  {
    "uid": "801862",
    "code": "CSCL5411",
    "subject": "CSCL",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Avant-Garde Cinema",
    "fullname": "Avant-Garde Cinema",
    "info": "In 1939, the art critic Clement Greenberg defined avant-garde art in opposition to the “kitsch” of mass-produced culture. To what extent does this conception of the avant-garde apply to the cinema—an institution and art form that supposedly requires machines and industrial modes of production? This course introduces students to key works of avant-garde and experimental film made by artists working on the margins of commercial film and mainstream art institutions. From the first half of the twentieth century, we will consider influential films made under the banners of Futurism, Constructivism, Surrealism, and Dada, and discuss their complex relation to Hollywood commodities. In the postwar period, we will explore a range of increasingly global experimental film practices, from the queer underground cinema in Latin America to the use of film projection in avant-garde performance. We will examine these practices in light of larger debates about medium specificity as well as the aesthetics and politics of the personal vs. the structural. In the final unit, we will reflect on the way contemporary artists, scholars, and curators have assembled a tradition of avant-garde cinema in the age of new media, and contemplate new directions we want it to take.",
    "prereq": {}
  },
  {
    "uid": "801566",
    "code": "CSCL5413",
    "subject": "CSCL",
    "number": "5413",
    "honors": false,
    "writing": false,
    "name": "Cinema/Society in Arab World",
    "fullname": "Cinema and Society in the Arab World",
    "info": "Focuses on Egypt, Algeria, and Syria, against background of European colonialism, loss of Palestine, Arab-Israeli wars, rise of Arab nationalism, and Algerian War.",
    "prereq": {}
  },
  {
    "uid": "013863",
    "code": "CSCL5555",
    "subject": "CSCL",
    "number": "5555",
    "honors": false,
    "writing": false,
    "name": "Intro to Semiotics",
    "fullname": "Introduction to Semiotics",
    "info": "Problems of the nature of the sign; sign function; sign production; signifying systems as articulated in philosophy, linguistics, anthropology, psychoanalysis, and art theory.  Application of semiotics to various signifying practices (literature, cinema, daily life).",
    "prereq": {}
  },
  {
    "uid": "808431",
    "code": "CSCL5666",
    "subject": "CSCL",
    "number": "5666",
    "honors": false,
    "writing": false,
    "name": "Film Music",
    "fullname": "Film Music: Theory, History, Practice",
    "info": "Role of music in American/European film from early 20th century silent cinema to near present. Narrative features, shorts, documentary, horror, thriller, science fiction, comedy, cartoon. Film music as social/cultural practice and as part of political economy within culture industry.  ",
    "prereq": {}
  },
  {
    "uid": "003609",
    "code": "CSCL5711",
    "subject": "CSCL",
    "number": "5711",
    "honors": false,
    "writing": false,
    "name": "Sociocriticism",
    "fullname": "Sociocriticism",
    "info": "Sustained consideration of the modern tradition of sociological reflection on literature. Early and late Birmingham School, Frankfurt School, Bakhtin circle, and the various French initiatives associated with both Les Temps Modernes and Tel Quel.",
    "prereq": {}
  },
  {
    "uid": "003610",
    "code": "CSCL5751",
    "subject": "CSCL",
    "number": "5751",
    "honors": false,
    "writing": false,
    "name": "Concepts of Cinema",
    "fullname": "Basic Concepts of Cinema",
    "info": "Cinema as object of theoretical/historical analysis. Emphasizes concepts that have transformed scope/aim of film analysis since 1960s. Readings of filmic/theoretical texts.",
    "prereq": {}
  },
  {
    "uid": "009173",
    "code": "CSCL5771",
    "subject": "CSCL",
    "number": "5771",
    "honors": false,
    "writing": false,
    "name": "Concepts Lit Study",
    "fullname": "Basic Concepts of Literary Study",
    "info": "Examination of literary discourse as an object of theoretical and historical analysis. Emphasis on the concepts that have emerged to radically transform the scope and aim of literary analysis since the 1960s. Readings of literary and theoretical texts.",
    "prereq": {}
  },
  {
    "uid": "810472",
    "code": "CSCL5800",
    "subject": "CSCL",
    "number": "5800",
    "honors": false,
    "writing": false,
    "name": "Translation Studies",
    "fullname": "Translation Studies",
    "info": "Techniques of reading/translating prose texts in fields of cultural studies/comparative literature. Attention to grammar, syntax, lexicon.\n\nprereq: CSCL grad student",
    "prereq": {}
  },
  {
    "uid": "806567",
    "code": "CSCL5833",
    "subject": "CSCL",
    "number": "5833",
    "honors": false,
    "writing": false,
    "name": "Marx, Freud, Nietzsche",
    "fullname": "Marx, Freud, Nietzsche: Intellectual Foundations",
    "info": "Three thinkers who defined modernity: Marx, Freud, and Nietzsche. Central tenets of their thought/terms associated with their theories. Their careers portrayed against the background of their times; their place in intellectual history. ",
    "prereq": {}
  },
  {
    "uid": "003614",
    "code": "CSCL5835",
    "subject": "CSCL",
    "number": "5835",
    "honors": false,
    "writing": false,
    "name": "Wagner's Ring",
    "fullname": "Richard Wagner's \"Der Ring des Nibelungen\": Music, Myth, and Politics",
    "info": "Literary/musical analysis. Historical context of four works of Wagner's \"Ring.\" Critical assessment of Wagner's achievement/influence.",
    "prereq": {}
  },
  {
    "uid": "003615",
    "code": "CSCL5910",
    "subject": "CSCL",
    "number": "5910",
    "honors": false,
    "writing": false,
    "name": "Topics Cultrl Studies Comp Lit",
    "fullname": "Topics in Cultural Studies and Comparative Literature",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "009551",
    "code": "CSCL5993",
    "subject": "CSCL",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\n\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "818962",
    "code": "CSCL8001",
    "subject": "CSCL",
    "number": "8001",
    "honors": false,
    "writing": false,
    "name": "Basic Research Seminar I",
    "fullname": "Basic Research Seminar in Cultural Studies and Comparative Literature I",
    "info": "Key texts, positions, problematics in field of comparative critical theory. Historical precursors, influential contemporary debates, disciplinary genealogies.",
    "prereq": {}
  },
  {
    "uid": "819042",
    "code": "CSCL8002",
    "subject": "CSCL",
    "number": "8002",
    "honors": false,
    "writing": false,
    "name": "Basic Research Seminar 2",
    "fullname": "Basic Research Seminar in Comparative Literature II",
    "info": "Key texts, positions, problematics in field of comparative critical theory. Special attention to historical precursors, influential contemporary debates, disciplinary genealogies.",
    "prereq": {}
  },
  {
    "uid": "819429",
    "code": "CSCL8333",
    "subject": "CSCL",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "010794",
    "code": "CSCL8362",
    "subject": "CSCL",
    "number": "8362",
    "honors": false,
    "writing": false,
    "name": "Modernity",
    "fullname": "Modernity and Its Others",
    "info": "Dialectical interrogation of Western and non-Western theories of modernity.  Reckoning with differences and variations in its history, providing an account of the normative category of modernity (designated as European), and alternative articulations around the globe.",
    "prereq": {}
  },
  {
    "uid": "819386",
    "code": "CSCL8444",
    "subject": "CSCL",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788457",
    "code": "CSCL8666",
    "subject": "CSCL",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doctoral Pre-Thesis Credits",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral pre-thesis credits. Prereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined credits.",
    "prereq": {}
  },
  {
    "uid": "819776",
    "code": "CSCL8777",
    "subject": "CSCL",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit: Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "TBD",
    "prereq": {}
  },
  {
    "uid": "819209",
    "code": "CSCL8888",
    "subject": "CSCL",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit: Doctoral",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "818963",
    "code": "CSCL8901",
    "subject": "CSCL",
    "number": "8901",
    "honors": false,
    "writing": false,
    "name": "Introduction to the Profession",
    "fullname": "Intro to the Profession: Critical Methods of Research, Pedagogy, and Creative Work in the Humanities",
    "info": "Prepares graduate majors for teaching. Issues of pedagogy. Preparing syllabi for specific courses that graduate instructors teach. Required for students planning to teach in Department of Cultural Studies and Comparative Literature.\n\nPrereq: Grad comp lit major",
    "prereq": {}
  },
  {
    "uid": "820453",
    "code": "CSCL8902",
    "subject": "CSCL",
    "number": "8902",
    "honors": false,
    "writing": false,
    "name": "Methodologies Colloquium",
    "fullname": "Methodologies Colloquium",
    "info": "Presentations by CSCL faculty. Methods in relation to the field as a whole. Library component. Meetings with research librarians.\n\nprereq: CL/CSDS/CSCL grad major or instr consent",
    "prereq": {}
  },
  {
    "uid": "818964",
    "code": "CSCL8910",
    "subject": "CSCL",
    "number": "8910",
    "honors": false,
    "writing": false,
    "name": "Adv Topics in Comp Lit",
    "fullname": "Advanced Topics in Comparative Literature",
    "info": "Practical applications of specific methodologies and theories to a determined area. Topics vary by instructor and semester.",
    "prereq": {}
  },
  {
    "uid": "012815",
    "code": "CSCL8920",
    "subject": "CSCL",
    "number": "8920",
    "honors": false,
    "writing": false,
    "name": "Adv Topics Comp Lit",
    "fullname": "Advanced Topics in Comparative Literature",
    "info": "Practical applications of specific methodologies and theories to a determined area.  Topics vary by instructor and semester.",
    "prereq": {}
  },
  {
    "uid": "009539",
    "code": "CSCL8992",
    "subject": "CSCL",
    "number": "8992",
    "honors": false,
    "writing": false,
    "name": "Directed Reading",
    "fullname": "Directed Reading in Comparative Literature",
    "info": "prereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "819381",
    "code": "CSCL8993",
    "subject": "CSCL",
    "number": "8993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Catalog Description:\tDirected Study in Cultural Studies and Comparative Literature\n\nprereq: instr consent\n",
    "prereq": {}
  },
  {
    "uid": "012821",
    "code": "CSCL8994",
    "subject": "CSCL",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed Research in Cultural Studies and Comparative Literature\n\nprereq: instr consent",
    "prereq": {}
  }
]