[
  {
    "uid": "014550",
    "code": "CSE1",
    "subject": "CSE",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "Fund Eng Rev",
    "fullname": "Fundamentals of Engineering Review  (E.I.T. Refresher)",
    "info": "For engineering graduates who are preparing for the Engineer-in-Training examination, the first of two written exams required for registration as a professional engineer. Review of mathematics, chemistry, materials, statics, dynamics, strength of materials, thermodynamics, electric circuits, fluid mechanics, and engineering economics.\n\nprereq: Bachelor's degree in engineering",
    "prereq": {}
  },
  {
    "uid": "807166",
    "code": "CSE1001",
    "subject": "CSE",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "First Year Experience",
    "fullname": "First Year Experience",
    "info": "Resources and strategies for college success. Majors and career opportunities offered in the physical sciences, mathematics, and engineering. Personal responsibility, academic integrity, and level of academic rigor required for success. Personal action plan for achievement in CSE.\n\nprereq: CSE, fr",
    "prereq": {}
  },
  {
    "uid": "811041",
    "code": "CSE1002",
    "subject": "CSE",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "CSE First Year Global Seminar",
    "fullname": "CSE First Year Global Seminar - Taking CSE 1001 International!",
    "info": "The program will take place over 10 days in designated locations abroad. Daily activities will include site visits to relevant commercial and academic institutions. Significant cultural elements and activities will be a key component of this program as well. The specifics of each seminar will depend on the location and travel dates. Freshman global seminars are a chance for students to learn abroad during their first year in the College of Science and Engineering. These freshman Global Seminars are popular short-term study abroad programs customized for CSE students, tailored for their first year of study in CSE. Students get to know a faculty member and other students, earn one credit, and learn about a technical topic. Preparation begins prior to departure. Registration and billing during spring semester. Led by a faculty expert and a CSE professional staff member. There are no language prerequisites.\n\nprereq: CSE 1001 First Year Experience",
    "prereq": {
      "and": [
        "807166"
      ]
    }
  },
  {
    "uid": "815327",
    "code": "CSE1012",
    "subject": "CSE",
    "number": "1012",
    "honors": false,
    "writing": false,
    "name": "Project-based Inquiry",
    "fullname": "Project-based Inquiry",
    "info": "This experiential learning class introduces CSE freshmen to new skills that will be helpful in their coursework, extracurricular activities, and internships. Students develop these skills and then apply them in a team project. Different sections of the course are devoted to different skill-based themes (e.g., 3D printing, Microcontrollers and Sensors, and Eclipse-themed Stratospheric Ballooning). All sections follow the same format. In the first several weeks of the semester, students learn new skills by completing exercises and activities. Then, team projects begin. Student teams are given project constraints (i.e., size limitations, features) and then follow a series of design steps to create their projects. First, they define a problem or goal for their projects based on their interests and the skills they are learning. Next, they brainstorm possible ways to solve the problem or meet the goal and select one to pursue. Then, they create a prototype and test it. Based on the results, they redesign and refine their project as time allows, ultimately creating a final project. At critical points along this sequence, the teams document their work with project memos, a presentation about their prototype, and a final project report.",
    "prereq": {}
  },
  {
    "uid": "016098",
    "code": "CSE1101",
    "subject": "CSE",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Envir Issues Solns",
    "fullname": "Environmental Issues and Solutions",
    "info": "Open to students from all colleges. Importance of science in understanding/solving various environmental problems. Case studies. Laboratory exercises.\n\nprereq: High school chemistry or equiv, one yr high school algebra",
    "prereq": {}
  },
  {
    "uid": "798350",
    "code": "CSE1311",
    "subject": "CSE",
    "number": "1311",
    "honors": false,
    "writing": false,
    "name": "Engineering Basics",
    "fullname": "Engineering Basics",
    "info": "Philosophy, tools, practice. Role of engineering in society. Engineering's relationship to science. Modeling, mathematical analysis, software tools, hands-on design-and-build project. Students work in teams.",
    "prereq": {}
  },
  {
    "uid": "804896",
    "code": "CSE1411",
    "subject": "CSE",
    "number": "1411",
    "honors": false,
    "writing": false,
    "name": "CSE Exploring Careers",
    "fullname": "Exploring Careers in Science and Engineering",
    "info": "Assess fit for future careers by exploring interests, values and personality. Become familiar about career options in engineering, science, and related industries through informational interviewing and guest speakers. Gain techniques for obtaining experience in chosen field.",
    "prereq": {}
  },
  {
    "uid": "014716",
    "code": "CSE1413",
    "subject": "CSE",
    "number": "1413",
    "honors": false,
    "writing": false,
    "name": "CSE Career Prep",
    "fullname": "Preparing for Careers in Science and Engineering",
    "info": "Research companies, industries, careers related to major. Gain experience related to career objective. Discover resources for finding internships/full-time job opportunities. Gain interviewing skills. Develop resume/cover letter.",
    "prereq": {}
  },
  {
    "uid": "800753",
    "code": "CSE1511",
    "subject": "CSE",
    "number": "1511",
    "honors": false,
    "writing": false,
    "name": "PLTW: Engineering Design",
    "fullname": "PLTW: Introduction to Engineering Design",
    "info": "Students are introduced to the engineering design process, applying math, science, and engineering standards to identify and design solutions to a variety of real problems. They work both individually and in collaborative teams to develop and document design solutions using engineering notebooks and 3D modeling software.",
    "prereq": {}
  },
  {
    "uid": "800754",
    "code": "CSE1512",
    "subject": "CSE",
    "number": "1512",
    "honors": false,
    "writing": false,
    "name": "PLTW: Principles Engineering",
    "fullname": "PLTW: Principles of Engineering",
    "info": "Through problems that engage and challenge, students explore a broad range of engineering topics, including mechanisms, the strength of materials and structures, automation, and motion. Students develop skills in problem solving, research, and design while learning strategies for design process documentation, collaboration, and presentation.",
    "prereq": {}
  },
  {
    "uid": "800755",
    "code": "CSE1513",
    "subject": "CSE",
    "number": "1513",
    "honors": false,
    "writing": false,
    "name": "PLTW: Digital Electronics",
    "fullname": "PLTW: Digital Electronics",
    "info": "Open doors to understanding electronics and foundations in circuit design. Digital electronics is the foundation of all modern electronic devices such as cellular phones, MP3 players, laptop computers, digital cameras, high definition televisions, etc. Students learn the digital circuit design process to create circuits and present solutions that can improve people's lives.",
    "prereq": {}
  },
  {
    "uid": "800756",
    "code": "CSE1514",
    "subject": "CSE",
    "number": "1514",
    "honors": false,
    "writing": false,
    "name": "PLTW: Computer Integrated Mfg",
    "fullname": "PLTW: Computer Integrated Manufacturing",
    "info": "Manufacturing transforms ideas into products. This course provides an opportunity for students to develop a better understanding of this innovative and exciting industry. Students learn about manufacturing processes, product design, robotics, and automation. Students develop their knowledge and skills of Computer Aided Design and Manufacturing to produce products using a Computer Numerical Controlled (CNC) mill. Students apply the knowledge and skills gained in this course as they collaborate to design, build, and program factory system models.",
    "prereq": {}
  },
  {
    "uid": "800757",
    "code": "CSE1515",
    "subject": "CSE",
    "number": "1515",
    "honors": false,
    "writing": false,
    "name": "PLTW: Civil Engineering & Arch",
    "fullname": "PLTW: Overview of Civil Engineering and Architecture",
    "info": "Students learn the fundamentals of building design, site design, and development. They apply math, science, and standard engineering practices to design both residential and commercial projects and document their work using 3D architectural design software.",
    "prereq": {}
  },
  {
    "uid": "817872",
    "code": "CSE1516",
    "subject": "CSE",
    "number": "1516",
    "honors": false,
    "writing": false,
    "name": "PLTW: Computer Science",
    "fullname": "PLTW: Computer Science Principles",
    "info": "Students create apps for mobile devices, automate tasks in a variety of languages, find patterns in data, and interpret simulations. Students collaborate to create and present solutions that can improve people?s lives.",
    "prereq": {}
  },
  {
    "uid": "016672",
    "code": "CSE1901",
    "subject": "CSE",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar, Environment",
    "fullname": "Freshman Seminar, Environment",
    "info": "Topics vary. See Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "789631",
    "code": "CSE1904",
    "subject": "CSE",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Fr Sem: Global Perspective",
    "fullname": "Freshman Seminar: Global Perspective",
    "info": "Topics vary. See Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "016673",
    "code": "CSE1905",
    "subject": "CSE",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary. See class schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "789632",
    "code": "CSE1906",
    "subject": "CSE",
    "number": "1906",
    "honors": false,
    "writing": false,
    "name": "Fresh Semi-Env/WI",
    "fullname": "Freshman Seminar: Environment/Writing Intensive",
    "info": "Topics vary. See Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "016674",
    "code": "CSE1909W",
    "subject": "CSE",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar, IP/WI",
    "fullname": "Freshman Seminar, International Perspective/Writing Intensive",
    "info": "Topics vary. See Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "016675",
    "code": "CSE1910W",
    "subject": "CSE",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar, WI",
    "fullname": "Freshman Seminar, Writing Intensive",
    "info": "Topics vary. See Class Schedule.\n\nprereq: FYFR",
    "prereq": {}
  },
  {
    "uid": "810592",
    "code": "CSE2096",
    "subject": "CSE",
    "number": "2096",
    "honors": false,
    "writing": false,
    "name": "Field Study",
    "fullname": "Field Study; Internship, Industrial Assignment",
    "info": "Provide students participating in academic-related experience, limiting ability to enroll for full-time status during semester, ability to maintain active student status with University.",
    "prereq": {}
  },
  {
    "uid": "817500",
    "code": "CSE2501",
    "subject": "CSE",
    "number": "2501",
    "honors": false,
    "writing": false,
    "name": "Ireland: Career Readiness",
    "fullname": "Ireland: Career Readiness for the STEM Industry",
    "info": "In this global seminar, you will learn about Ireland, the STEM industry, what it takes to get and maintain a fulfilling career and more about you. You will discover the rich intellectual, cultural, and economic history of Ireland and how it shapes the business and organizational cultural of today. You will continue to develop your core career competencies through career and work related activities, such as business and organizational site visits, informational interviews, resume critiques, and interview practice. You will discover more about yourself and your own path toward career readiness.\n",
    "prereq": {}
  },
  {
    "uid": "810593",
    "code": "CSE4096",
    "subject": "CSE",
    "number": "4096",
    "honors": false,
    "writing": false,
    "name": "Field Study",
    "fullname": "Field Study; Internship, Industrial Assignment",
    "info": "Provide students participating in academic-related experience, limiting ability to enroll for full-time status during semester, ability to maintain active student status with University.",
    "prereq": {}
  },
  {
    "uid": "796078",
    "code": "CSE4101W",
    "subject": "CSE",
    "number": "4101",
    "honors": false,
    "writing": true,
    "name": "Comm Skill Prof. Prac",
    "fullname": "Communication Skills and Professional Practice",
    "info": "Non-technical skills/topics important in engineering/scientific work environment. Group/team dynamics, intellectual property, running meetings, professional ethics, effective communication, negotiation. Emphasizes realistic work scenarios requiring public speaking, teamwork, and writing.\n\nprereq: Upper div CSE or instr consent",
    "prereq": {}
  },
  {
    "uid": "825242",
    "code": "CSE4896",
    "subject": "CSE",
    "number": "4896",
    "honors": false,
    "writing": false,
    "name": "Co-op Industrial Assign I",
    "fullname": "Cooperative Industrial Assignment I",
    "info": "This course accompanies an industrial work assignment in engineering and applied science. It includes analysis of technical problems that require developing criteria, evaluating alternatives, and completing a final analysis. A final technical design report emphasizes design communication and describes the technical decision process, analysis, and final recommendations. This course is intended for any College of Science and Engineering student who has been admitted to their major and is participating in the co-op program. There are no specific prerequisites for this course, though it is expected that students taking this course have a background in science or engineering appropriate for their industrial co-op position. Registration is by permission only. Please submit your application to the Co-op Program via Handshake to initiate the course access process. Detailed instructions can be found on the co-op website (https://cse.umn.edu/coop/application-process). This is the first course in a two-semester sequence. CSE 4896 is offered in the summer and spring semesters. CSE 4996 is offered in the Summer and fall semesters. It is expected that students complete a co-op experience back-to-back (i.e. summer/fall or spring/summer). If your co-op plan differs from that, please email co-op@umn.edu to receive permission to take the courses in reverse order.",
    "prereq": {
      "or": [
        "825242",
        "825436"
      ]
    }
  },
  {
    "uid": "825436",
    "code": "CSE4996",
    "subject": "CSE",
    "number": "4996",
    "honors": false,
    "writing": false,
    "name": "Co-op Industrial Assign II",
    "fullname": "Cooperative Industrial Assignment II",
    "info": "This course accompanies an industrial work assignment in engineering and applied science. The course includes generation of a novel idea requiring developing criteria, evaluating alternatives, and completing a final analysis. A final invention disclosure report emphasizes innovation and communication and includes the technical creation process, hypothesis testing, analysis, and final recommendations. This is the second course in a two course series. While some content is similar between the courses, the first course focuses more on the design and problem solving in an industrial context, this course focuses on the idea creation process and intellectual property protection. This course also includes a section on diversity, equity and inclusion in corporate settings. This course is intended for any College of Science and Engineering student who has been admitted to their major and is participating in the CSE Co-op Program. There are no specific prerequisites for this course, though it is expected that students taking this course have a background in science or engineering appropriate for their industrial co-op position. Registration is by permission only. Please submit your application to the Co-op Program via Handshake to initiate the course access process. Detailed instructions can be found on the co-op website (https://cse.umn.edu/coop/application-process). This is the second course in a two semester sequence. CSE 4896 is offered in the summer and spring semesters. CSE 4996 is offered in the summer and fall semesters. It is expected that students complete a co-op experience back-to-back (ie. summer/fall or spring/summer). If your co-op plan differs from that, please email co-op@umn.edu to receive permission to take the courses in reverse order.",
    "prereq": {
      "or": [
        "825242",
        "825436"
      ]
    }
  },
  {
    "uid": "799457",
    "code": "CSE5101",
    "subject": "CSE",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Engrg Design for Teachers",
    "fullname": "Introduction to Engineering Design for Teachers",
    "info": "History, career opportunities, portfolios, visualization, geometry, modeling, construction, analysis, documentation. Part of Project Lead the Way curriculum.\nPrereq-college consent.",
    "prereq": {}
  },
  {
    "uid": "799434",
    "code": "CSE5102",
    "subject": "CSE",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Princ. Engrg for Teachers",
    "fullname": "Principles of Engineering for Teachers",
    "info": "Communication/documentation, design process, engineering systems, strength of materials, testing, reliability, statics/dynamics. Part of Project Lead the Way curriculum.\nPrereq-college consent.",
    "prereq": {}
  },
  {
    "uid": "800531",
    "code": "CSE5103",
    "subject": "CSE",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Digit Electronics for Teachers",
    "fullname": "Digital Electronics for Teachers",
    "info": "Fundamentals of digital electronics, number systems, gates, Boolean algebra, circuit design, adding, flip-flops, shift registers/counters, families/specifications, microprocessors, design topic. Part of Project Lead the Way curriculum.\nPrereq-college consent.",
    "prereq": {}
  },
  {
    "uid": "801363",
    "code": "CSE5104",
    "subject": "CSE",
    "number": "5104",
    "honors": false,
    "writing": false,
    "name": "Civil Engr & Arch",
    "fullname": "Civil Engineering and Architecture",
    "info": "Overview of civil engineering and architecture, their interrelationship/dependence on each other. Students use software to solve real world problems. Project/site planning. Project documentation/presentation. Part of Project Lead the Way.\nPrereq-college consent.",
    "prereq": {}
  },
  {
    "uid": "804150",
    "code": "CSE5105",
    "subject": "CSE",
    "number": "5105",
    "honors": false,
    "writing": false,
    "name": "Gate to Tech",
    "fullname": "Gateway to Technology",
    "info": "Activity-oriented middle school curriculum to help students in grades six-eight explore math, science, and technology. Five independent, nine-week units: design/modeling, automation/robotics, magic of electrons, science of technology, and flight/space.\nPrereq-college consent.",
    "prereq": {}
  }
]