[
  {
    "uid": "788984",
    "code": "EAS1462",
    "subject": "EAS",
    "number": "1462",
    "honors": false,
    "writing": false,
    "name": "East Asia 1600-2000",
    "fullname": "Introduction to East Asia in Modern Times: 1600-2000",
    "info": "Formation/decline of early modern Asian empires. Western imperialism, Asian nationalism. Social revolution, economic modernization, cultural change in China, Japan, Korea, Vietnam, 1600-2000.",
    "prereq": {}
  },
  {
    "uid": "826372",
    "code": "EAS1463",
    "subject": "EAS",
    "number": "1463",
    "honors": false,
    "writing": false,
    "name": "Intro to Imperialism in Asia",
    "fullname": "An Introduction to Imperialism in Asia, 1850-Present",
    "info": "Organized around a series of themes, this course will begin with a broad overview of imperialism in Asia before diving into economics of empire, technologies of imperialism, race and gender, nationalism and the end of empire, and neocolonialism. Throughout, the class will center the history of present-day China, India, Southeast Asia, and Japan, emphasizing whenever possible the perspectives of those impacted by empire rather than those perpetuating it. As such, assigned readings focus on primary sources supplemented by relevant secondary research, with optional readings providing significant breadth and depth for interested students seeking to delve further into their own interests or find new avenues of scholarly inquiry. All told, the histories included here represent some of the most significant events in recent centuries, but ones that often go overlooked in an academic context, covered only as a footnote in the histories of the West. Instead, this course will center the history of Asia and the voices of those impacted by imperialism, offering new perspectives on some of the most significant moments that shaped-and continue to shape-our contemporary world. \n\nDesigned as an introductory course for those unfamiliar with the history of Asia, this class approaches a broad geographic and temporal range through case studies, diving deeply into crucial historical moments rather than providing an exhaustive overview of more than two centuries of Western imperialism. Simultaneously, this class will introduce students to the process of historical analysis itself using a substantial focus on primary sources, instructional time spent in libraries and archives, and a well-supported, intensive research essay process as a way to encourage them to think critically about the historical project while also honing their own historiographical skills. Overall, students will leave this course with a strong foundation in the history of Asia and the history of Western imperialism along with real practice doing history, preparing them for their future within the Department of History, at the University of Minnesota, and beyond. ",
    "prereq": {}
  },
  {
    "uid": "791214",
    "code": "EAS3013",
    "subject": "EAS",
    "number": "3013",
    "honors": false,
    "writing": false,
    "name": "Intro East Asia Art",
    "fullname": "Introduction to East Asian Art",
    "info": "A selective examination of representative works of art produced in China, Korea, and Japan from the neolithic era  to modern times. Nearly every major type of object and all major styles are represented.",
    "prereq": {}
  },
  {
    "uid": "797049",
    "code": "EAS3211",
    "subject": "EAS",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "East Asia",
    "fullname": "East Asia",
    "info": "Physical and human geography of Japan, mainland China and Taiwan, North and South Korea; population pressure, economic and urban development, and international relations.",
    "prereq": {}
  },
  {
    "uid": "792086",
    "code": "EAS3461",
    "subject": "EAS",
    "number": "3461",
    "honors": false,
    "writing": false,
    "name": "Intro to E. Asia I",
    "fullname": "Introduction to East Asia I: The Imperial Age",
    "info": "Comparative survey of early history of China, Japan, Korea, and Vietnam; early Chinese thought; diffusion of Confucianism, Buddhism, and other values throughout East Asia; political and social history of region to 1600.",
    "prereq": {}
  },
  {
    "uid": "792085",
    "code": "EAS3462",
    "subject": "EAS",
    "number": "3462",
    "honors": false,
    "writing": false,
    "name": "East Asia from 1500-Present",
    "fullname": "From Subjects to Citizens: The History of East Asia From 1500 to the Present",
    "info": "How Asian states, societies, economies, and cultures linked with one another and with European powers. How period's historical effects still resonate. Covers India, China, Japan, Korea, and Indochina.  ",
    "prereq": {}
  },
  {
    "uid": "797060",
    "code": "EAS3464",
    "subject": "EAS",
    "number": "3464",
    "honors": false,
    "writing": false,
    "name": "China: Song -Ming",
    "fullname": "China in the Song, Yuan, and Ming Dynasties",
    "info": "China during the Song (976-1279), Yuan (1279-1368) and Ming (1368-1644) dynasties, political institutions and social structures. Attention to primary sources and how historians ask and answer questions about the past.",
    "prereq": {}
  },
  {
    "uid": "788967",
    "code": "EAS3465W",
    "subject": "EAS",
    "number": "3465",
    "honors": false,
    "writing": true,
    "name": "China in Ming&Qing",
    "fullname": "China in the Ming and Qing Dynasties",
    "info": "The political and social history of China from about 1600 until the end of the Qing dynasty in 1911. Topics include ethnicity, daily life, legal structures, city life, and peasantry.",
    "prereq": {}
  },
  {
    "uid": "792090",
    "code": "EAS3467W",
    "subject": "EAS",
    "number": "3467",
    "honors": false,
    "writing": true,
    "name": "State & Rev in Chin",
    "fullname": "State and Revolution in Modern China",
    "info": "Modern China's political evolution including the Taiping Rebellion, Republican Revolution, rise of Nationalist and Communist parties, Maoist era; reform under Deng Xiaping, and the emergence of democracy in Taiwan.",
    "prereq": {}
  },
  {
    "uid": "792088",
    "code": "EAS3468",
    "subject": "EAS",
    "number": "3468",
    "honors": false,
    "writing": false,
    "name": "Soc Change in China",
    "fullname": "Social Change in Modern China",
    "info": "Opium War and opening of Treaty Ports in 19th century; missionary activity and cultural influence; changes in education system; women's movement; early industrialization; socialism and collectivization after 1949; industrialization of Taiwan; PRC's entry into the world trading system.",
    "prereq": {}
  },
  {
    "uid": "792087",
    "code": "EAS3471",
    "subject": "EAS",
    "number": "3471",
    "honors": false,
    "writing": false,
    "name": "Modern Japan, Meiji-Present",
    "fullname": "Modern Japan, Meiji to the Present (1868-2000)",
    "info": "Japan's early development as industrial/imperial power after Meiji Restoration of 1868. Political developments in Taisho years: social, cultural, economic trends that supported them. Militarization/mobilization for war in 1930s. Japan's war with China, Pacific War with the United States. American occupation. Postwar economic recovery, high growth. Changing political/popular culture of 1980s, '90s. ",
    "prereq": {}
  },
  {
    "uid": "788803",
    "code": "EAS3472",
    "subject": "EAS",
    "number": "3472",
    "honors": false,
    "writing": false,
    "name": "Early Modern Japan",
    "fullname": "Early Modern Japan",
    "info": "Tradition/change in society/culture under Tokugawa shoguns (1600-1867). Growth of cities. Decline of samurai class. Response to Western intrusion. ",
    "prereq": {}
  },
  {
    "uid": "003391",
    "code": "EAS3473",
    "subject": "EAS",
    "number": "3473",
    "honors": false,
    "writing": false,
    "name": "Fmy, School, Work",
    "fullname": "Family, School, and Work in Modern Japanese History",
    "info": "Impact of economic, social, and cultural change on males and females in the family, the education system, the employment system from the 17th through 20th centuries.",
    "prereq": {}
  },
  {
    "uid": "797558",
    "code": "EAS3474",
    "subject": "EAS",
    "number": "3474",
    "honors": false,
    "writing": false,
    "name": "Rise of Mod Japan",
    "fullname": "The Rise of Modern Japan: 1850s to 1900s",
    "info": "The Meiji Revolution from Commodore Perry to the eve of World War I; origins of constitutional monarchy, industrial economy, Western influences, and modern cultural change.",
    "prereq": {}
  },
  {
    "uid": "806444",
    "code": "EAS3479",
    "subject": "EAS",
    "number": "3479",
    "honors": false,
    "writing": false,
    "name": "Chinese Cities and Urban Life",
    "fullname": "History of Chinese Cities and Urban Life",
    "info": "Introduction to traditional Chinese cities, modern transformation. Ideal city plan in Confucian classics compared with physical layout of major cities. Models about Chinese cities, influence of models on our understanding of Chinese history/society.",
    "prereq": {}
  },
  {
    "uid": "798450",
    "code": "EAS3671",
    "subject": "EAS",
    "number": "3671",
    "honors": false,
    "writing": false,
    "name": "Chinese Society",
    "fullname": "Contemporary Chinese Society: Mainland China, Hong Kong, Taiwan",
    "info": "Chinese society and culture, with focus on post-1949 mainland China, Taiwan, and Hong Kong. Chinese family, dating and marriage, rural and urban societies, population, work and occupation, socioeconomic development and inequalities, and impacts of post-1978 reforms.    ",
    "prereq": {}
  },
  {
    "uid": "016808",
    "code": "EAS3940",
    "subject": "EAS",
    "number": "3940",
    "honors": false,
    "writing": false,
    "name": "Topics-Asian History",
    "fullname": "Topics in Asian History",
    "info": "Selected topics in Asian history not covered in regular courses.",
    "prereq": {}
  },
  {
    "uid": "797799",
    "code": "EAS3970",
    "subject": "EAS",
    "number": "3970",
    "honors": false,
    "writing": false,
    "name": "Suppl. Disc. E Asian Studies",
    "fullname": "Supplemental Discussion in East Asian Studies",
    "info": "Extra discussion section with T.A.",
    "prereq": {}
  },
  {
    "uid": "798445",
    "code": "EAS4467",
    "subject": "EAS",
    "number": "4467",
    "honors": false,
    "writing": false,
    "name": "Japanese Politics",
    "fullname": "Politics and Market in Contemporary Japan",
    "info": "Study how Japan combined rapid economic development and relative social stability in the postwar period and  the problems Japan faces in today's \"globalized\" world. Focus on major economic and political actors including bureaucracy, business and labor, and the role of political and economic institutions. Assess strengths and weakness of the Japanese-style of capitalism.   ",
    "prereq": {}
  },
  {
    "uid": "797058",
    "code": "EAS4473W",
    "subject": "EAS",
    "number": "4473",
    "honors": false,
    "writing": true,
    "name": "Chinese Politics",
    "fullname": "Chinese Politics",
    "info": "Fundamental conflicts in Chinese society. Democracy movement, human rights, class divisions, gender struggles, environmental issues, capitalist vs. socialist development strategies. Chinese foreign relations. Domestic/foreign political issues in Taiwan.",
    "prereq": {}
  },
  {
    "uid": "008582",
    "code": "EAS4662",
    "subject": "EAS",
    "number": "4662",
    "honors": false,
    "writing": false,
    "name": "East Asian Develop",
    "fullname": "Comparative East Asian Development: A New Model for Growth and Prosperity?",
    "info": "Social and cultural reasons for the rapid growth and relative equity of Japan, South Korea, Taiwan, Hong Kong, Singapore and more recently, China. Relation of these examples to more general theories of development. ",
    "prereq": {}
  },
  {
    "uid": "016809",
    "code": "EAS5940",
    "subject": "EAS",
    "number": "5940",
    "honors": false,
    "writing": false,
    "name": "Topics-Asian Hist",
    "fullname": "Topics in Asian History",
    "info": "Selected topics such as cultural, economic, intellectual, political, and social history.",
    "prereq": {}
  },
  {
    "uid": "788101",
    "code": "EAS8333",
    "subject": "EAS",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)",
    "prereq": {}
  },
  {
    "uid": "788591",
    "code": "EAS8777",
    "subject": "EAS",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)",
    "prereq": {}
  }
]