[
  {
    "uid": "810201",
    "code": "ECDR1004",
    "subject": "ECDR",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Intermediate Spanish IV",
    "fullname": "Intermediate Spanish IV",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "810202",
    "code": "ECDR3001",
    "subject": "ECDR",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Social Determinants of Health",
    "fullname": "Social Determinants of Health - Ecuador Case Study",
    "info": "Inactive - Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "812095",
    "code": "ECDR3011W",
    "subject": "ECDR",
    "number": "3011",
    "honors": false,
    "writing": true,
    "name": "Spanish Grammar & Comp Workshp",
    "fullname": "Spanish Grammar and Composition Workshop",
    "info": "ECDR 3011W Spanish Grammar and Writing Workshop is an intensive writing course designed to develop and strengthen the understanding and management of language skills acquired in previous courses and to develop knowledge about various cultures in Latin America and Ecuador. This course seeks to integrate the skills of speaking, writing, reading and understanding the real world of Ecuadorian and Latin American culture through the analysis of texts of varied socio-cultural, economic, political and other learning resources. The reading and writing tasks of this course will allow students through the reading and analysis of different texts an approach to the reality of Ecuadorian and Latin American culture. Students will be exposed to learning in real contexts and to the appropriate use of vocabulary. During the course, each student will produce a series of original compositions with the objective of learning to write texts in a clear, precise and formal in Spanish using various rhetorical strategies. It is a course that will give students the possibility of acquiring basic guidelines to improve their style and composition.",
    "prereq": {}
  },
  {
    "uid": "812096",
    "code": "ECDR3015W",
    "subject": "ECDR",
    "number": "3015",
    "honors": false,
    "writing": true,
    "name": "Spanish Comp & Communication",
    "fullname": "Spanish Composition and Communication",
    "info": "ECDR Spanish 3015W is a Spanish course with an emphasis on Spanish Composition and Communication designed to develop and strengthen oral and written language and communication skills acquired in courses 1001 - 1004. This course seeks to integrate in real contexts the skills of speaking, writing, reading , listening and understanding of Spanish at a higher level.\n\nThis course will systematically expose students to a variety of texts within the context of Ecuador and Latin America that will enable them to improve their level of comprehension, analysis, discussion, reflection, enrich their vocabulary and accelerate their reading rhythm and comprehension.\n\nThe development of language skills will allow students to gain a better understanding of Ecuador: their culture, history, economy and politics.\n",
    "prereq": {}
  },
  {
    "uid": "810203",
    "code": "ECDR3021",
    "subject": "ECDR",
    "number": "3021",
    "honors": false,
    "writing": false,
    "name": "Advanced Spanish",
    "fullname": "Advanced Spanish",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "817475",
    "code": "ECDR3030W",
    "subject": "ECDR",
    "number": "3030",
    "honors": false,
    "writing": true,
    "name": "Intro to Latin-Amer Cultures",
    "fullname": "Introduction to Latin American Cultures",
    "info": "ECDR 3030W, Introduction to Latin American Cultures, is an intensive writing course designed to develop and strengthen the understanding and management of language skills acquired in previous courses and to develop knowledge about various cultures in Latin America and Ecuador. This course seeks to integrate the skills of speaking, writing, reading and understanding the real world of Ecuadorian and Latin American culture through the analysis of texts and other learning resources. Course 3030W will evaluate the concept of \"culture\" from an intercultural perspective taking into account the cultural diversity of Ecuador and Latin America. 3030W introduces students to key writing and cultural analysis skills. The writing tasks of this course will allow students to approach the reality of Ecuadorian and Latin American culture through the reading and analysis of different texts. Students will be exposed to learning in real contexts and to the appropriate use of vocabulary. At the end of the program students must demonstrate competence in the handling of components of cultural analysis and familiarity with research components in cultural topics. This course offers students a panoramic view of the Latin American and Ecuadorian narrative, placing it in their historical and cultural contexts so as to allow an analysis of the styles of the mixture of our peoples. It is a course that will provide students with the possibility of acquiring basic guidelines to identify literary styles and narrative strategies.\n",
    "prereq": {}
  },
  {
    "uid": "820496",
    "code": "ECDR4001",
    "subject": "ECDR",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Intl Dev: Human Rights",
    "fullname": "International Development: Human Rights: Policy & Practice",
    "info": "Students will critically analyze theories of development and the impact of development models throughout the world, but specifically Latin America and Ecuador. They will address development theories, assumptions of development, and alternatives to development through the lens of social services. This course starts by investigating the concept of globalization within international development and its prevalence in Latin America, and in particular Ecuador. There is an emphasis throughout the course on contrasting Western thinking with Andean thought processes and connecting the global to the local. The course will have a multidisciplinary approach, and will focus on how individuals, institutions, events, and ideas are connected.\n\nThis course will focus on the critical analysis of social problems and will address the issue of social services as instruments for social inclusion through the restitution of rights and empowerment. The concept of social exclusion (discrimination, inequality, inequity, poverty) will be discussed, as well as how development has led to social inclusion or exclusion, and how social services have contributed. The course will focus on the priority care groups—children and adolescents, women, older adults, and people with disabilities—and the policies, programs, and services for them in Ecuador today.",
    "prereq": {}
  },
  {
    "uid": "820497",
    "code": "ECDR4002",
    "subject": "ECDR",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Intl Dev: Entrepreneurship",
    "fullname": "International Development: Social Entrepreneurship & Microfinance",
    "info": "Students will critically analyze theories of development, and the impact of development models throughout the world, but specifically Latin America and Ecuador. They will address development theories, assumptions of development, and alternatives to development through the lens of social entrepreneurship. This course starts by investigating the concept of globalization within international development and its prevalence in Latin America, and in particular Ecuador. There is an emphasis throughout the course on contrasting Western thinking with Andean thought processes and connecting the global to the local. The course will have a multidisciplinary approach, and will focus on how individuals, institutions, events, and ideas are connected.\n\nStudents will identify the impacts of development on the Ecuadorian economy, specifically focusing on the concept of social entrepreneurship, which is recognized in the Ecuadorian constitution. They will study the history of this specific form of entrepreneurship, its relationship with local development, and as an alternate form of distribution and production of goods and services. Students will also analyze the economic impacts generated by these practices and how public, private, and community actors interface with this type of economy.",
    "prereq": {}
  },
  {
    "uid": "820498",
    "code": "ECDR4003",
    "subject": "ECDR",
    "number": "4003",
    "honors": false,
    "writing": false,
    "name": "Intl Dev: Public Health",
    "fullname": "International Development: Public Health & Traditional Andean Medicine",
    "info": "Students will critically analyze theories of development, and the impact of development models throughout the world, but specifically Latin America and Ecuador. They will address development theories, assumptions of development, and alternatives to development through the lens of social entrepreneurship. This course starts by investigating the concept of globalization within international development and its prevalence in Latin America, and in particular Ecuador. There is an emphasis throughout the course on contrasting Western thinking with Andean thought processes and connecting the global to the local. The course will have a multidisciplinary approach, and will focus on how individuals, institutions, events, and ideas are connected.\n\nStudents will begin to address social, economic, cultural, and environmental determinants of health as a mechanism for understanding the main health problems in Ecuador. There is an emphasis throughout the course on contrasting Western thinking and medicine with Andean worldviews and ancestral medicine. The course will discuss intercultural health processes to improve the health conditions of diverse cultural groups. The course will focus on the indigenous movement in Ecuador and the recovery of the Andean culture as it relates to health and traditional health practices. Understanding the new Ecuadorian constitution, which includes the right to health, will lead into discussions of the complex political and social dimensions of health. A comparative analysis of health reform processes in Ecuador and the United States will allow the students to identify the contrasting dimensions in the search to improve the collective health in both countries.",
    "prereq": {}
  },
  {
    "uid": "820499",
    "code": "ECDR4004",
    "subject": "ECDR",
    "number": "4004",
    "honors": false,
    "writing": false,
    "name": "Intl Dev: Envt Challenges",
    "fullname": "International Development: Environmental Challenges from the Andes to the Amazon",
    "info": "Students will critically analyze theories of development and the impact of development models throughout the world, but specifically Latin America and Ecuador. They will address development theories, assumptions of development, and alternatives to development through the lens of the environment and sustainability. This course starts by investigating the concept of globalization within international development and its prevalence in Latin America, and in particular Ecuador. There is an emphasis throughout the course on contrasting Western thinking with Andean thought processes and connecting the global to the local. The course will have a multidisciplinary approach, and will focus on how individuals, institutions, events, and ideas are connected.\n\nStudents will identify the impacts of development on environmental challenges in Ecuador, and the relationship between environment, use and management of natural resources, and local communities. Examination of cases that involve people’s rights over the environment, food sovereignty, water management, climate change, sustainable development, and local alternatives for natural resource management and conservation will be studied.",
    "prereq": {}
  },
  {
    "uid": "825435",
    "code": "ECDR4101",
    "subject": "ECDR",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Hist & Pol Context of Ecuador",
    "fullname": "Historical & Political Context of Ecuador",
    "info": "This course will begin with a historical review from the European conquest, moving to independence and the construction of a nation state, and finally the republican era until today. Main events and characteristics from each timeframe will be highlighted. Students will discuss the “discovery of America” from the Ecuadorian and South American context, as well as the process and impact of conquering this continent.\n\nHistory and politics will come together when discussing the 20th Century. Topics such as liberal revolution, plutocracy, the uprising known as the Juliana Revolution, the populist velasquista phenomenon, dictatorships, and the return to democracy will all be examined. Additionally, the central elements of the so-called Citizen Revolution will be addressed. Current events such as the government of Moreno and his turn to the right will be discussed as well as political opposition, main actors in the political sphere, etc. The current state will be analyzed based on identifying the main elements that shape the country’s cultural diversity, its nationalities, and peoples. A comparative analysis between the western culture and the Andean culture will be carried out.\n",
    "prereq": {}
  },
  {
    "uid": "825472",
    "code": "ECDR4201",
    "subject": "ECDR",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Research in Ecuador",
    "fullname": "Research in Ecuador",
    "info": "The goal of this course is to introduce the MSID student to various research concepts and practices, helping them select their study topic and title for their study, develop statements of problems and choose research questions and appropriate research design, study issues related to research ethics, develop their skills in choosing data collection instruments, and analyze the data they collect for their research. The course introduces various topics in the research cycle and provides a forum in which students can share with one another their research experience at each stage of the process.\n\nResearch projects in this course are ideally projects that fit with the development agency’s goals and activities; therefore, the student’s research interests are expected to blend with what is realistically happening at the development agency. Students must have approved proposals before proceeding on to their research sites. They will then collect necessary data and complete data analysis before heading back to Quito at the end of the six-week field period. It is likely that students will participate in field activities, meetings, and other forms of engagement that will be indirectly related to and could inform their research projects. Through hands-on experiences as well as readings, discussions, and written assignments, students will deepen their understanding of the host-country cultural context and development work from an international perspective, as well as critically examine their own worldview in order to develop, defend, and challenge their own values and beliefs.",
    "prereq": {}
  },
  {
    "uid": "825473",
    "code": "ECDR4896",
    "subject": "ECDR",
    "number": "4896",
    "honors": false,
    "writing": false,
    "name": "Internship in Ecuador",
    "fullname": "Internship in Ecuador",
    "info": "This course provides a cross-cultural experience of working on various development issues with a regional nonprofit organization. The course focuses on guiding students to understand their own identity as they integrate theory with reality by participation in local development sites. Students are prepared for entering into their community work through discussions on stakeholder and agency analysis, ethical considerations, culture specific gender and diversity context, and power and privilege. \n\nThe mentoring continues while students are at their internship placement as they come in contact with social actors, community organizations, and local and national authorities, in various regions of Quito at the marginal urban and rural levels. The students are urged to play an active role in their internships by providing suggestions and solutions, discussing alternatives, and investigating all areas of their internship placement to garner a holistic experience on the realities of development work. Through practical internship experiences as well as readings, discussions, and written assignments, students will deepen their understanding of the host-country cultural context and development work from an international perspective, as well as critically examine their own worldview in order to develop, defend, and challenge their own values and beliefs.",
    "prereq": {}
  }
]