[
  {
    "uid": "005109",
    "code": "EEB3001",
    "subject": "EEB",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Ecology and Society",
    "fullname": "Ecology and Society",
    "info": "Basic concepts in ecology. Organization, development, function of ecosystem. Population growth/regulation. Human effect on ecosystems.prereq: [Jr or sr] recommended; biological sciences students may not apply cr toward major",
    "prereq": {}
  },
  {
    "uid": "801874",
    "code": "EEB3002",
    "subject": "EEB",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Sex, Evolution, and Behavior",
    "fullname": "Sex, Evolution, and Behavior:  Examining Human Evolutionary Biology",
    "info": "Methods/theories to understand humans in evolutionary framework. What can be known only/primarily from evolutionary perspective. How evolutionary biology of humans might lead to better evolutionary theory. How physiology, development, behavior, and ecology coordinate/coevolve in humans.",
    "prereq": {}
  },
  {
    "uid": "797128",
    "code": "EEB3361",
    "subject": "EEB",
    "number": "3361",
    "honors": false,
    "writing": false,
    "name": "Visions of Nature",
    "fullname": "Visions of Nature: The Natural World and Political Thought",
    "info": "Theories about the organization of nature, human nature, and their significance for the development of ethics, religion, political and economic philosophy, civics, and environmentalism in Western and other civilizations.",
    "prereq": {}
  },
  {
    "uid": "812357",
    "code": "EEB3407",
    "subject": "EEB",
    "number": "3407",
    "honors": false,
    "writing": false,
    "name": "Ecology",
    "fullname": "Ecology",
    "info": "Principles of ecology from populations to ecosystems. Applications to human populations, disease, exotic organisms, habitat fragmentation, biodiversity, and global dynamics of the earth.",
    "prereq": {}
  },
  {
    "uid": "812591",
    "code": "EEB3408W",
    "subject": "EEB",
    "number": "3408",
    "honors": false,
    "writing": true,
    "name": "Ecology",
    "fullname": "Ecology",
    "info": "Principles of population growth/interactions, communities and ecosystem function applied to ecological issues. Regulation of populations, dynamics/impacts of disease, invasions by exotic organisms, biodiversity, global change. Lab. Scientific writing. Quantitative skill development (mathematical models, data analysis, statistics and some coding in R). prereq: [One semester college biology or instr consent], [MATH 1142 or MATH 1271 or Math 1272 or Math 1241 or Math 1242 or MATH 1281 or Math 1282 or equiv]",
    "prereq": {
      "and": [
        {
          "or": [
            "000119",
            "000120",
            "000121",
            "808276",
            "016334",
            "016336"
          ]
        }
      ]
    }
  },
  {
    "uid": "812358",
    "code": "EEB3409",
    "subject": "EEB",
    "number": "3409",
    "honors": false,
    "writing": false,
    "name": "Evolution",
    "fullname": "Evolution",
    "info": "Evolution has shaped all of life and continues to. This course explores processes that cause the genetic change of populations over generations and the outcomes of these processes.  Evolution is crucial for understanding of current societal issues including biodiversity conservation, genetic engineering, food security, and public health. Lab. \n\nprereq: one semester of college biology. ",
    "prereq": {}
  },
  {
    "uid": "812359",
    "code": "EEB3411",
    "subject": "EEB",
    "number": "3411",
    "honors": false,
    "writing": false,
    "name": "Intro Animal Behavior",
    "fullname": "Introduction to Animal Behavior",
    "info": "This course provides a broad introduction to animal behavior. As one of the most interdisciplinary fields in all of biology, understanding animal behavior requires an understanding of cell biology, physiology, genetics, development, ecology, endocrinology, evolution, learning theory, and even physics and economics! This course will draw on questions and methods from each of these disciplines to answer what on the surface appears to be a very simple question: “Why is that animal doing that?” The course will review such key topics as feeding behavior, reproductive behavior, perception, learning, animal conflict, social behavior, parental care, and communication. The lecture parallels a required laboratory. prereq: Undergrad biology course Credit granted for only one of the following: EEB 3411, EEB 3412W, EEB 3811W, EEB 5412",
    "prereq": {
      "or": [
        "812359",
        "812592",
        "787799",
        "825338"
      ]
    }
  },
  {
    "uid": "812592",
    "code": "EEB3412W",
    "subject": "EEB",
    "number": "3412",
    "honors": false,
    "writing": true,
    "name": "Intro to Animal Behavior (WI)",
    "fullname": "Introduction to Animal Behavior, Writing Intensive",
    "info": "EEB 3412W is a lecture/lab writing-intensive course. Why do animals behave the way they do? This question is relevant to conservation, agriculture, human health, veterinary medicine, developing artificial intelligence, and understanding the origins of human behavior. This writing intensive course provides a broad introduction to animal behavior. As one of the most interdisciplinary fields in all of biology, understanding animal behavior requires an understanding of cell biology, physiology, genetics, development, ecology, endocrinology, evolution, learning theory, and even physics and economics! This course will draw on questions and methods from each of these disciplines to answer what on the surface appears to be a very simple question: Why is that animal doing that? The course will review such key topics as feeding behavior, reproductive behavior, perception, learning, animal conflict, social behavior, parental care, and communication. Throughout the course, students will be immersed in the scientific process, reading scientific literature, thinking critically, formulating their own research questions, and answering them in an independent project. This is a writing intensive course that covers scientific process and how to formulate research questions. \n\nprereq: BIOL1951 or one of the following: BIOL1001, BIOL1003, BIOL1009, BIOL1012, BIOL1015, BIOL1052, BIOL1055, MATH1241, CHEM1081, CHEM1061, CHEM1071H, PHYS1221, PHYS1301W, PHYS1401V or instructor consent. Credit granted for only one of the following: EEB 3411, EEB 3412W or EEB 5412.",
    "prereq": {
      "or": [
        "817196",
        "005419",
        "803629",
        "005416",
        "805043",
        "816440",
        "804799",
        "809995",
        "808276",
        "815252",
        "807753",
        "817964",
        "002070",
        "812359",
        "812592",
        "825338"
      ]
    }
  },
  {
    "uid": "817535",
    "code": "EEB3500",
    "subject": "EEB",
    "number": "3500",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Ecology",
    "fullname": "Special Topics in Ecology, Evolution and Behavior",
    "info": "Special Topics in Ecology, Evolution and Behavior",
    "prereq": {}
  },
  {
    "uid": "818862",
    "code": "EEB3501",
    "subject": "EEB",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "EEB Seminar",
    "fullname": "EEB Seminar",
    "info": "Learn about recent developments in cutting-edge topics in the area of Ecology, Education and Behavior and engage with the EEB community of faculty, graduate students and post docs and observe professional norms in the field. Engage directly with practicing scientists and the primary literature from their work and learn how to give a scientific talk by observing and critically evaluating and discussing seminars.",
    "prereq": {}
  },
  {
    "uid": "818193",
    "code": "EEB3534",
    "subject": "EEB",
    "number": "3534",
    "honors": false,
    "writing": false,
    "name": "Biodiversity Science",
    "fullname": "Biodiversity Science: The origins, maintenance, consequences, detection & assessment of biodiversity",
    "info": "Biodiversity science is a rapidly expanding field of enquiry with increasing digital resources and global monitoring capabilities precisely at the moment in history that scientists recognize as the Sixth Extinction. In other words, we are currently facing a biodiversity crisis with threats to the Earth's biota not seen since the dinosaurs perished 65 million years ago. \"Biodiversity\" was coined by W.G. Rosen and E.O Wilson in the 1980s to describe the variation in all of life on Earth. The term is now widely used in both the scientific and popular literature and is at the center of scientific enquiry, conservation efforts, large-scale collaborative pursuits of technological advances to allow monitoring from space, and global assessments that interface with international policy. Biodiversity requires integration across multiple disciplines from evolution, to ecology, remote sensing, conservation biology, economics and the social sciences, including the environmental policy. Biodiversity science is thus inherently interdisciplinary. As a consequence, rarely does a single course provide students the opportunity to focus on this critical topic from multiple perspectives and dimensions. \n\nThis new course seeks to provide students intensive study of biodiversity from six perspectives: 1) the origins of biodiversity, including the processes of speciation and extinction over macroevolutionary timescales and those involved in generating biological variation at microevolutionary scales; 2) the ecological problem of species coexistence, given the nature of competitive interactions and biological filters with a focus on the interactions of individual species and major threats to biodiversity; 3) the consequences of biodiversity and biodiversity loss for ecosystem functions, focusing on ecosystem scale processes; 4) the services or benefits to humans attributed to biodiversity, including cultural benefits of biodiversity; here we discuss both practical and ethical arguments for sustaining biodiversity; 5) methods of detecting biodiversity including classic field biodiversity observations and taxonomic collections and emerging remote sensing methods that harness hyperspectral data and satellite imagery; and 6) scientific assessments of biodiversity that communicate the science of biodiversity to policymakers, particularly the Intergovernmental Platform on Biodiversity and Ecosystem Services (IPBES). The IPBES involves scientists from around the world and integrates indigenous and local knowledge (ILK). The United Nations and governments around the globe are sponsoring the IPBES, building on earlier assessments such as a prominent one in the UK. \n\nSeveral guest lecturers from across the University will participate in discussions and aid in development of computer labs (including Sharon Jansa (CBS), Keith Barker (CBS), Joe Knight (CFANS), and others).\n\nprereq: One semester college biology or instr consent, MATH 1142 or MATH 1271 or Math 1272 or Math 1241 or Math 1242 or MATH 1281 or Math 1282 or equiv",
    "prereq": {
      "or": [
        "000119",
        "000120",
        "000121",
        "808276",
        "016334",
        "016336"
      ]
    }
  },
  {
    "uid": "799430",
    "code": "EEB3603",
    "subject": "EEB",
    "number": "3603",
    "honors": false,
    "writing": false,
    "name": "Aquatic Environment",
    "fullname": "Science, Protection, and Management of Aquatic Environments",
    "info": "Fundamentals of aquatic ecology. Case study approach to water problems faced by society (e.g., eutrophication, climate change, invasive species, acid rain, wetland protection, biodiversity preservation). Science used to diagnose/remediate or remove problems. \nprereq: BIOL 1001 or 1009 or 1951 or equiv",
    "prereq": {
      "or": [
        "005419",
        "005416",
        "817196"
      ]
    }
  },
  {
    "uid": "818998",
    "code": "EEB3701",
    "subject": "EEB",
    "number": "3701",
    "honors": false,
    "writing": false,
    "name": "EEB Seminar",
    "fullname": "EEB Seminar",
    "info": "Learn about recent developments in cutting-edge topics in the area of Ecology, Education and Behavior and engage with the EEB community of faculty, graduate students and post docs and observe professional norms in the field. Engage directly with practicing scientists and the primary literature from their work and learn how to give a scientific talk by observing and critically evaluating and discussing seminars.",
    "prereq": {}
  },
  {
    "uid": "787798",
    "code": "EEB3807",
    "subject": "EEB",
    "number": "3807",
    "honors": false,
    "writing": false,
    "name": "Ecology",
    "fullname": "Ecology",
    "info": "Population growth/interactions. Ecosystem function applied to ecological issues. Regulation of human populations, dynamics/impacts of disease, invasions by exotic organisms, habitat fragmentation, biodiversity. Lab, field work.prereq: [One semester college biology], [MATH 1142 or MATH 1271 or MATH 1281 or equiv]",
    "prereq": {
      "and": [
        {
          "or": [
            "000119",
            "000120",
            "016334"
          ]
        }
      ]
    }
  },
  {
    "uid": "787799",
    "code": "EEB3811W",
    "subject": "EEB",
    "number": "3811",
    "honors": false,
    "writing": true,
    "name": "Animal Behavior in the Field",
    "fullname": "Animal Behavior in the Field",
    "info": "In this course we will learn general principles governing the evolution of animal behavior. Being conducted at a field station, the approach is hands-on experiential learning through the application of the scientific method to the study of animal behavior. Thus, we will learn animal behavior by becoming animal behaviorists. Animal behaviorists communicate to one another through written reports in peer-reviewed literature and through oral talks at meetings. We will do both of these. All of these experiences culminate in the design, execution, and presentation (written and oral) of an independent research project. Therefore, it is appropriate that this course is designated as writing-intensive. Writing comprises 90 points out of the course total of 140 points, representing 64% of the course grade. This is course meets two days per week from 8AM to 12N and from 1PM to 5PM over a 5-week period in May/June at the Itasca Biological Station and Labs. \n\nprereq: Undergrad biology course ",
    "prereq": {}
  },
  {
    "uid": "808155",
    "code": "EEB3851W",
    "subject": "EEB",
    "number": "3851",
    "honors": false,
    "writing": true,
    "name": "Health and Biodiversity",
    "fullname": "Health and Biodiversity",
    "info": "Basics of biodiversity, human/animal health, interdependence. Strategies for sustainable health.\n\nprereq: At least one year of college Biology or equivalent",
    "prereq": {}
  },
  {
    "uid": "794474",
    "code": "EEB3963",
    "subject": "EEB",
    "number": "3963",
    "honors": false,
    "writing": false,
    "name": "Modeling Nature",
    "fullname": "Modeling Nature and the Nature of Modeling",
    "info": "Hands-on modeling experiences in context of biological applications. Reviews calculus concepts.  Students carry out modeling steps, from developing the model, to analytical analysis, to developing computer code, to running the models.",
    "prereq": {}
  },
  {
    "uid": "005108",
    "code": "EEB4002",
    "subject": "EEB",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Minnesota Ecology",
    "fullname": "Ecology of Minnesota",
    "info": "How ecological systems are structured, work, and respond to what is done to/around them. Minnesota's ecosystems. Evaluating alternatives, making wise decisions, regarding Minnesota's ecology.",
    "prereq": {}
  },
  {
    "uid": "005199",
    "code": "EEB4014",
    "subject": "EEB",
    "number": "4014",
    "honors": false,
    "writing": false,
    "name": "Ecology of Vegetation",
    "fullname": "Ecology of Vegetation",
    "info": "Methods of describing, sampling, classifying vegetation. Spatial/temporal variation of vegetation, ecosystem properties on landscapes. Theory of structure/dynamics of terrestrial communities, ecosystems. Analysis of quantitative data. Field trips to local ecosystem types.",
    "prereq": {}
  },
  {
    "uid": "005196",
    "code": "EEB4016W",
    "subject": "EEB",
    "number": "4016",
    "honors": false,
    "writing": true,
    "name": "Ecological Biogeography",
    "fullname": "Ecological Biogeography",
    "info": "Biotic regions of world in general and North America in detail. Ecological principles of distribution, interpretations of regional/temporal patterns in distribution of vegetation, taxonomic groups of plants/animals.  Includes one weekend field trip.",
    "prereq": {}
  },
  {
    "uid": "796836",
    "code": "EEB4068",
    "subject": "EEB",
    "number": "4068",
    "honors": false,
    "writing": false,
    "name": "Plant Physiological Ecology",
    "fullname": "Plant Physiological Ecology",
    "info": "Plant function, its plasticity/diversity in an ecological context. Impact of environmental stresses on major physiological processes of plants, including photosynthesis, respiration, water uptake/transport, and nutrient uptake/assimilation. Lab, field trip to Cedar Creek.",
    "prereq": {}
  },
  {
    "uid": "005187",
    "code": "EEB4129",
    "subject": "EEB",
    "number": "4129",
    "honors": false,
    "writing": false,
    "name": "Mammalogy",
    "fullname": "Mammalogy",
    "info": "An overview of the biology of mammals of the world. The lecture covers a wide rang of topics including the evolution, biogeography, physiology, ecology, and behavior of mammals. The lab takes phylogenetic perspective and introduces the diversity of mammals, with a focus on evolutionary and functional significance of mammalian traits. \n\nprereq: One semester of college-level biology (BIOL 1951 or 1009). A course in Animal Diversity (e.g. BIOL 3012) is recommended but not required.",
    "prereq": {
      "and": [
        {
          "or": [
            "817196",
            "005416"
          ]
        },
        {
          "and": [
            "825762"
          ]
        }
      ]
    }
  },
  {
    "uid": "005119",
    "code": "EEB4134",
    "subject": "EEB",
    "number": "4134",
    "honors": false,
    "writing": false,
    "name": "Introduction to Ornithology",
    "fullname": "Introduction to Ornithology",
    "info": "Structure, evolution, classification, distribution, migration, ecology, habitats, identification of birds. Lecture, lab, weekly field walks. One weekend field trip.\n\nprereq: Biol 1001 or Biol 2012",
    "prereq": {
      "or": [
        "005419",
        "012868"
      ]
    }
  },
  {
    "uid": "005192",
    "code": "EEB4156",
    "subject": "EEB",
    "number": "4156",
    "honors": false,
    "writing": false,
    "name": "Ecol  Anim Physiol",
    "fullname": "Ecological Animal Physiology",
    "info": "Functional adaptation of animals to their environment based upon biochemical and biophysical principles.",
    "prereq": {}
  },
  {
    "uid": "791920",
    "code": "EEB4329",
    "subject": "EEB",
    "number": "4329",
    "honors": false,
    "writing": false,
    "name": "Primate Behavior",
    "fullname": "Primate Ecology and Social Behavior",
    "info": "Primates as model system to explore animal/human behavior. Factors influencing sociality/group composition. Mating systems. Prevalence of altruistic, cooperative, and aggressive behavior. Strength of social bonds in different species. Evolution of intelligence/culture.\n\nprereq: BIOL 1009 or BIOL 1951 or BIOL 3411 or ANTH 1001 or instr consent",
    "prereq": {
      "or": [
        "005416",
        "817196",
        "014289",
        "008711"
      ]
    }
  },
  {
    "uid": "807054",
    "code": "EEB4330W",
    "subject": "EEB",
    "number": "4330",
    "honors": false,
    "writing": true,
    "name": "Animal Communication",
    "fullname": "Animal Communication",
    "info": "Mechanisms of signal production/perception, signal propagation. How signals can convey information. How signalers, signals, receivers are adapted for communication by natural/sexual selection. \n\nprereq: (Biol 1951 or Biol 1951H or Biol 1009) and (EEB 3412W or EEB 3411 or EEB 3811W)",
    "prereq": {
      "and": [
        {
          "or": [
            "817196",
            "005416"
          ]
        },
        {
          "or": [
            "812592",
            "812359",
            "787799"
          ]
        }
      ]
    }
  },
  {
    "uid": "825856",
    "code": "EEB4332W",
    "subject": "EEB",
    "number": "4332",
    "honors": false,
    "writing": true,
    "name": "The Biology of Politics",
    "fullname": "The Biology of Politics",
    "info": "Survey of primary literature exploring the potential biological underpinnings of individual differences in political ideology. Students will critically examine peer-reviewed studies of behavioral genetics, physiology, neuroscience, animal behavior, and evolution to evaluate evidence for and against the claims that one’s political ideology is shaped by biology and that people holding conservative and liberal views may be biologically predisposed to experience and interact with the world differently. Students will examine how biological influences on cognition, social and moral attitudes, and behaviors relate to individual differences in political ideology, with the ultimate goal of assessing whether an understanding of the biology of politics is required to fully contextualize political discourse in a democracy.",
    "prereq": {}
  },
  {
    "uid": "005219",
    "code": "EEB4607",
    "subject": "EEB",
    "number": "4607",
    "honors": false,
    "writing": false,
    "name": "Plankton Ecology",
    "fullname": "Plankton Ecology",
    "info": "Planktonic bacteria, algae, and animals in lakes, reservoirs, and oceans with special attention to processes that cause variations of abundance. ",
    "prereq": {}
  },
  {
    "uid": "012847",
    "code": "EEB4609W",
    "subject": "EEB",
    "number": "4609",
    "honors": false,
    "writing": true,
    "name": "Ecosystem Ecology",
    "fullname": "Ecosystem Ecology",
    "info": "Regulation of energy and elements cycling through ecosystems. Dependence of cycles on kinds/numbers of species within ecosystems. Effects of human-induced global changes on functioning of ecosystems.",
    "prereq": {}
  },
  {
    "uid": "791065",
    "code": "EEB4611",
    "subject": "EEB",
    "number": "4611",
    "honors": false,
    "writing": false,
    "name": "Biogeochemical Processes",
    "fullname": "Biogeochemical Processes",
    "info": "Application of biochemistry, ecology, chemistry, and physics to environmental issues. Issues in biogeochemistry. Impact of humans on biogeochemical processes in soils, lakes, oceans, estuaries, forests, urban/managed ecosystems, and extreme environments (e.g., early Earth, deep sea vents, thermal springs).\n\nprereq: [BIOL 1009 or 2003] AND [CHEM 1081 or 1061 or 1071H] or instr consent",
    "prereq": {
      "or": [
        {
          "or": [
            "005416",
            "800457"
          ]
        },
        {
          "or": [
            "815252",
            "807753"
          ]
        }
      ]
    }
  },
  {
    "uid": "788945",
    "code": "EEB4631",
    "subject": "EEB",
    "number": "4631",
    "honors": false,
    "writing": false,
    "name": "Global Ecology",
    "fullname": "Global Ecology",
    "info": "Interactions between biosphere/lithosphere, atmosphere/oceans throughout Earth history. How climate is influenced on long time scales (evolution of photosynthesis) and on decadal time scales (forest clearance). Earth as an interacting ecosystem. Evaluating future effects of accumulating greenhouse gases.",
    "prereq": {}
  },
  {
    "uid": "788846",
    "code": "EEB4793W",
    "subject": "EEB",
    "number": "4793",
    "honors": false,
    "writing": true,
    "name": "Directed Studies: WI",
    "fullname": "Directed Studies: Writing Intensive",
    "info": "Writing Intensive Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. One main feature of this course is that the student will receive writing instruction and the written output of the course will be revised during the semester. The project needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, how writing instruction will take place, a timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. This course is graded S/N and approval of the DUGS is required before a grade of S can be given by the faculty mentor. \n\nprereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.",
    "prereq": {
      "or": [
        "788846",
        "788847",
        "005123",
        "005124"
      ]
    }
  },
  {
    "uid": "788847",
    "code": "EEB4794W",
    "subject": "EEB",
    "number": "4794",
    "honors": false,
    "writing": true,
    "name": "Directed Research: WI",
    "fullname": "Directed Research: Writing Intensive",
    "info": "Writing Intensive Directed Research is an individual-study, laboratory, or field research experience in which the student is mentored directly by a faculty member. This course is not for students starting out in research, it is intended for students who already have been working in the research group of the mentor and have developed an independent research project. In this course the student will receive writing instruction through a writing support course (corresponding to 1 credit in addition to the credits of directed research time) that will meet weekly throughout the semester. The written output usually is in the form of a scientific paper describing the results of the student's project. Written output of the course must be revised during the semester and a schedule for writing, assessment, and revision needs to be in place at the beginning of the semester. The project needs to be explained in the campus Directed Research contract and the project and participation in the writing support course agreed on by both the student and faculty mentor. The contract must be approved by the Director of Undergraduate Studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, agreement about how writing instruction will take place, confirmation of understanding of the timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course - near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. The DUGS can call for a final revision before a grade is given. This course is graded S/N by the writing support course instructor, and approval of both the DUGS and the research mentor is required before a grade of S can be given by the writing support course instructor.\n",
    "prereq": {}
  },
  {
    "uid": "797263",
    "code": "EEB4801",
    "subject": "EEB",
    "number": "4801",
    "honors": false,
    "writing": false,
    "name": "Field Limnology",
    "fullname": "Field Limnology",
    "info": "Description/analysis of lakes, streams. Lake origins, physics, chemistry, biology. How different forcings affect biological dynamics/interactions. Field work emphasizes comparative approach to differences in northern Minnesota's lakes, bogs, streams.",
    "prereq": {}
  },
  {
    "uid": "797292",
    "code": "EEB4809",
    "subject": "EEB",
    "number": "4809",
    "honors": false,
    "writing": false,
    "name": "Ecosystem Ecology",
    "fullname": "Field Ecosystem Ecology",
    "info": "Introduction to ecosystem ecology. Emphasizes field application of ecosystem theory/techniques. Material/energy flow through ecosystems. How factors such as natural disturbances and human activities affect ecosystems. Productivity and trophic transfers in lakes, prairies, and forests. Impacts of fire. Bison grazing on grasslands. Forest competition/regeneration. Atmospheric nitrogen deposition. Paleo-ecological techniques for understanding long-term ecosystem dynamics.",
    "prereq": {}
  },
  {
    "uid": "809307",
    "code": "EEB4811",
    "subject": "EEB",
    "number": "4811",
    "honors": false,
    "writing": false,
    "name": "Biogeochemical Processes",
    "fullname": "Biogeochemical Processes",
    "info": "Application of biochemistry, ecology, chemistry, physics to global biogeochemical cycles. Human impacts on biogeochemical cycles. Lab. Meets at Itasca Biological Station & Laboratories. Lodging/meal costs in addition to tuition.\n\nprereq: CHEM 2301, [PHYS 1201 or instr consent]",
    "prereq": {
      "and": [
        "002392",
        {
          "or": [
            "002068"
          ]
        }
      ]
    }
  },
  {
    "uid": "013705",
    "code": "EEB4814",
    "subject": "EEB",
    "number": "4814",
    "honors": false,
    "writing": false,
    "name": "Plant Communities",
    "fullname": "Plant Community Ecology",
    "info": "Communities represented in Itasca Park and vicinity with emphasis on vegetation, patterns of distributions of communities, their interaction with environment and dynamic relationships, methods of community, and description and analysis.",
    "prereq": {}
  },
  {
    "uid": "013706",
    "code": "EEB4817",
    "subject": "EEB",
    "number": "4817",
    "honors": false,
    "writing": false,
    "name": "Vertebrate Ecology",
    "fullname": "Vertebrate Ecology",
    "info": "Field studies on vertebrate populations, their relationships to local environments, habitat analysis, and ecological research methods. Students work individually or in teams to investigate behavioral/ecological aspects of selected vertebrates. Lectures, field trips.",
    "prereq": {}
  },
  {
    "uid": "797356",
    "code": "EEB4825",
    "subject": "EEB",
    "number": "4825",
    "honors": false,
    "writing": false,
    "name": "Animal Telemetry",
    "fullname": "Telemetry and Animal Behavior",
    "info": "Using latest techniques in radio telemetry to study animal behavior, especially animal movements and home ranges. Methods of attaching radio transmitters, locating radio-tagged animals, determining accuracy of positional data, calculating positions. Software for home range calculations/placement of data on a GIS base system.",
    "prereq": {}
  },
  {
    "uid": "013699",
    "code": "EEB4839",
    "subject": "EEB",
    "number": "4839",
    "honors": false,
    "writing": false,
    "name": "Field Mammalogy",
    "fullname": "Field Studies in Mammalogy",
    "info": "Techniques for studying small mammals. Lectures/field projects emphasize identification, distributions, community interactions, ecophysiology, population ecology.\n\nprereq: College-level biology course that includes study of animals or instr consent",
    "prereq": {}
  },
  {
    "uid": "787802",
    "code": "EEB4842",
    "subject": "EEB",
    "number": "4842",
    "honors": false,
    "writing": false,
    "name": "Arctic Field Ecology",
    "fullname": "Arctic Field Ecology",
    "info": "Arctic natural history/ecology explored via a four-week trip to Northwest Territories of Canada. Students travel by van, air, and inflatable canoes; design their own research projects; help with ongoing studies in landscape/riparian ecology; learn field skills/techniques associated with ecological studies in Arctic regions; and work directly with local Inuit people about traditional ecological knowledge.",
    "prereq": {}
  },
  {
    "uid": "013698",
    "code": "EEB4844",
    "subject": "EEB",
    "number": "4844",
    "honors": false,
    "writing": false,
    "name": "Field Ornithology",
    "fullname": "Field Ornithology",
    "info": "Biology of breeding birds through use of field techniques at Itasca Biological Station/Laboratories. Daily fieldwork emphasizes identification, behavioral observations, netting/censusing.\n\nprereq: One semester college biology or instr consent",
    "prereq": {}
  },
  {
    "uid": "005123",
    "code": "EEB4993",
    "subject": "EEB",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed Studies is an individual-study, literature-based investigation in which the student is mentored directly by a faculty member. The topic for the course needs to be explained in a Research/Directed Studies contract and agreed on by both the student and faculty mentor. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. prereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.",
    "prereq": {
      "or": [
        "788846",
        "788847",
        "005123",
        "005124"
      ]
    }
  },
  {
    "uid": "005124",
    "code": "EEB4994",
    "subject": "EEB",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed Research is an individual-study, laboratory or field investigation course. The research topic needs to be agreed on by both the student and the faculty mentor and explained in a Research/Directed Studies contract. The contract must be approved by the director of undergraduate studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, methodology to be used, and how the assessment of learning will be conducted. \nprereq: department consent, instructor consent, no more than 7 credits of 4793W, 4794W, 4993, 4994 counts towards CBS major requirements.",
    "prereq": {
      "or": [
        "788846",
        "788847",
        "005123",
        "005124"
      ]
    }
  },
  {
    "uid": "796072",
    "code": "EEB5001",
    "subject": "EEB",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Plant Communities",
    "fullname": "Spatiotemporal Dynamics of Plant Communities",
    "info": "Dynamic nature of plant communities in times of environmental changes. Emphasizes species invasion as key for structure/dynamics of plant assemblages. Observational, theoretical, and experimental studies on spatiotemporal dynamics of plant communities under various changes in biological/environmental conditions, including human-induced Global Warming.",
    "prereq": {}
  },
  {
    "uid": "005125",
    "code": "EEB5008",
    "subject": "EEB",
    "number": "5008",
    "honors": false,
    "writing": false,
    "name": "Paleoecology",
    "fullname": "Forest Response to Quaternary Climate Change",
    "info": "Forest responses to past climate change at the population, community, and ecosystem level.  Response to natural and human disturbance, range shifts and invasions. Limitations to the speed of response to rapid climate change.",
    "prereq": {}
  },
  {
    "uid": "005193",
    "code": "EEB5009",
    "subject": "EEB",
    "number": "5009",
    "honors": false,
    "writing": false,
    "name": "Quaternary History",
    "fullname": "Quaternary Vegetation History and Climate",
    "info": "History of vegetation/climate change in Quaternary period. Importance of mechanistic understanding on interpretation of historical events.  Vegetation distribution/climate. Mechanisms of climate change and long-term vegetation dynamics. Vegetation and climate reconstructions. Modeling in paleoecology and paleoclimatology. Case studies in North America and other parts of globe. Human impacts on vegetation and climate.",
    "prereq": {}
  },
  {
    "uid": "005197",
    "code": "EEB5011",
    "subject": "EEB",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Pollen Morphology",
    "fullname": "Pollen Morphology",
    "info": "Morphology and nomenclature of pollen grains and pteridophyte spores, survey of pollen and spores of major plant families, lab techniques.",
    "prereq": {}
  },
  {
    "uid": "013365",
    "code": "EEB5013",
    "subject": "EEB",
    "number": "5013",
    "honors": false,
    "writing": false,
    "name": "Plant Macrofossils",
    "fullname": "Quaternary Plant Macrofossils",
    "info": "Morphology of seeds, fruits, and other macroscopic remains likely to occur in Quaternary deposits, survey of fossils of major plant families, lab techniques.",
    "prereq": {}
  },
  {
    "uid": "005103",
    "code": "EEB5033",
    "subject": "EEB",
    "number": "5033",
    "honors": false,
    "writing": false,
    "name": "Pop and Quantitative Genetics",
    "fullname": "Population and Quantitative Genetics",
    "info": "Fundamentals of quantitative genetics. Genetic/environmental influences on expression of quantitative traits. Approaches to characterizing genetic basis of trait variation. Processes that lead to change in quantitative traits.  Applied/evolutionary aspects of quantitative genetic variation.",
    "prereq": {}
  },
  {
    "uid": "798876",
    "code": "EEB5042",
    "subject": "EEB",
    "number": "5042",
    "honors": false,
    "writing": false,
    "name": "Quantitative Genetics",
    "fullname": "Quantitative Genetics",
    "info": "Fundamentals of quantitative genetics. Genetic/environmental influences on expression of quantitative traits. Approaches to characterizing genetic basis of trait variation. Processes that lead to change in quantitative traits.   Applied/evolutionary aspects of quantitative genetic variation.\n\nprereq: [BIOL 4003 or GCD 3022] or instr consent; a course in statistics is\nrecommended",
    "prereq": {
      "or": [
        "009489",
        "006271"
      ]
    }
  },
  {
    "uid": "005084",
    "code": "EEB5051",
    "subject": "EEB",
    "number": "5051",
    "honors": false,
    "writing": false,
    "name": "Analysis of Populations",
    "fullname": "Analysis of Populations",
    "info": "Factors involved in the regulation, growth, and general dynamics of populations. Data needed to describe populations, population growth, population models, and regulatory mechanisms.",
    "prereq": {}
  },
  {
    "uid": "005203",
    "code": "EEB5053",
    "subject": "EEB",
    "number": "5053",
    "honors": false,
    "writing": false,
    "name": "Ecology Theory/Concepts",
    "fullname": "Ecology: Theory and Concepts",
    "info": "Classical and modern mathematical theories of population growth, interspecific interactions, ecosystem dynamics and functioning, with emphasis on underlying assumptions and on effects of added biological reality on robustness of predictions, stability, interspecific interactions, ecosystem structure and functioning.\n\nprereq: Biol 3407 or instr consent",
    "prereq": {
      "or": [
        "012848"
      ]
    }
  },
  {
    "uid": "800204",
    "code": "EEB5068",
    "subject": "EEB",
    "number": "5068",
    "honors": false,
    "writing": false,
    "name": "Plant Physiological Ecology",
    "fullname": "Plant Physiological Ecology",
    "info": "Plant function, its plasticity/diversity in ecological context.Impact of environmental stresses on major physiological processes of plants, including photosynthesis, respiration, water uptake/transport, and nutrient uptake/assimilation. Lab, field trip to Cedar Creek.\n\nprereq: BIOL 2022 or BIOL 3002 or BIOL 3407 or BIOL 3408W or instr consent",
    "prereq": {
      "or": [
        "012848",
        "799776"
      ]
    }
  },
  {
    "uid": "005099",
    "code": "EEB5122W",
    "subject": "EEB",
    "number": "5122",
    "honors": false,
    "writing": true,
    "name": "Plant/Microbe Interactions",
    "fullname": "Plant Interactions with Animals and Microbes",
    "info": "Ecological and environmental implications of mutualistic and antagonistic interactions between plants, animals and microbes at organismal, population, and community levels.",
    "prereq": {}
  },
  {
    "uid": "795004",
    "code": "EEB5146",
    "subject": "EEB",
    "number": "5146",
    "honors": false,
    "writing": false,
    "name": "Sci and Policy Global Env Chng",
    "fullname": "Science and Policy of Global Environmental Change",
    "info": "Critical issues underpinning global change and its biological implications. Current scientific literature in exploring evidence for human-induced global change and its potential effects on a wide range of biological processes. Emphasizes terrestrial ecosystems. Economic drivers, economic consequences. Local, national, and international laws and policies.\n\nprereq: Biol 3407 Biol 5407 or equiv",
    "prereq": {
      "or": [
        "012848",
        "013731"
      ]
    }
  },
  {
    "uid": "013587",
    "code": "EEB5221",
    "subject": "EEB",
    "number": "5221",
    "honors": false,
    "writing": false,
    "name": "Molecular  Evolution",
    "fullname": "Molecular Evolution",
    "info": "Molecular basis of evolutionary change. Selection, neutral evolutionary processes at molecular level. Evolution from gene to genome level: protein structure/function, multigene families, organelle genomes, genome organization. Lectures, current literature, workshops.\n\nprereq: [[BIOL 4003 or GCD 3022], grad student]] or instr consent",
    "prereq": {
      "or": [
        "009489",
        "006271"
      ]
    }
  },
  {
    "uid": "005163",
    "code": "EEB5321",
    "subject": "EEB",
    "number": "5321",
    "honors": false,
    "writing": false,
    "name": "Evol Social Behavior",
    "fullname": "Evolution of Social Behavior",
    "info": "Introduction to theories and concepts relating to behavior evolution, mating systems, and cooperative behavior in animals.",
    "prereq": {}
  },
  {
    "uid": "793982",
    "code": "EEB5322",
    "subject": "EEB",
    "number": "5322",
    "honors": false,
    "writing": false,
    "name": "Evolution and Animal Cognition",
    "fullname": "Evolution and Animal Cognition",
    "info": "Animal cognitive abilities. Learning, perception, memory, navigation, and communication from evolutionary/comparative perspective. Cognitive abilities as adaptations that solve specific environmental problems. Empirical methods for assessing cognitive abilities. Emphasizes parsimonious interpretations of data. Controversial topics such as animal intelligence, animal language and whether non-human animals have a \"theory of mind.\"\n\nprereq: Biol 3411 or Psy 3061 or instr consent",
    "prereq": {
      "or": [
        "014289",
        "006460"
      ]
    }
  },
  {
    "uid": "005165",
    "code": "EEB5323",
    "subject": "EEB",
    "number": "5323",
    "honors": false,
    "writing": false,
    "name": "Behavioral Mechanisms",
    "fullname": "Neural and Endocrine Mechanisms Underlying Vertebrate Behavior",
    "info": "Selected aspects of the physiological basis of vertebrate behavior with emphasis on neural and endocrine integration and the effects of evolutionary pressures on it. Hormones and sex behavior, sensory perception, neuroethology of communication.",
    "prereq": {}
  },
  {
    "uid": "005188",
    "code": "EEB5327",
    "subject": "EEB",
    "number": "5327",
    "honors": false,
    "writing": false,
    "name": "Behavioral Ecology",
    "fullname": "Behavioral Ecology",
    "info": "Evolutionary principles applied to aggressive competition, mate choice, cooperation, and parental investment. Optimization models used to examine foraging strategies, predator/prey interactions, and territoriality. Evolution of sex, sexual selection, dispersal. Evolutionary game theory.\n\nprereq: Biol 3411 or instr consent",
    "prereq": {
      "or": [
        "014289"
      ]
    }
  },
  {
    "uid": "013407",
    "code": "EEB5361",
    "subject": "EEB",
    "number": "5361",
    "honors": false,
    "writing": false,
    "name": "Visions of Nature",
    "fullname": "Visions of Nature: The Natural World and Political Thought",
    "info": "Theories about the organization of nature, human nature, and their significance for the development of ethics, religion, political and economic philosophy, civics, and environmentalism in Western and other civilizations. Graduate credit requires paper on conceptual topic on human ecology.",
    "prereq": {}
  },
  {
    "uid": "792262",
    "code": "EEB5371",
    "subject": "EEB",
    "number": "5371",
    "honors": false,
    "writing": false,
    "name": "Principles of Systematics",
    "fullname": "Principles of Systematics",
    "info": "Theoretical/practical procedures of biological systematics. Phylogeny reconstruction. Computer-assisted analyses, morphological and molecular approaches, species concepts/speciation, comparative methods, classification, historical biogeography, nomenclature, use/value of museums.\n\nprereq: Grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "820475",
    "code": "EEB5381",
    "subject": "EEB",
    "number": "5381",
    "honors": false,
    "writing": false,
    "name": "Sustainability Science",
    "fullname": "Sustainability Science: Interactions Between Human and Environmental Systems",
    "info": "This course addresses core ideas in sustainability science -- an emerging field of problem-driven research dealing with the interactions between human and environmental systems. The problem that motivates the course, and the field, is the challenge of sustainability: improving the well-being of present and future generations in ways that conserve the planet’s life support systems over the long term. The goal of the course is to introduce students interested in sustainability science to the field’s principle themes, cutting-edge findings, active debates, and unresolved research questions. To this end, participants will critically discuss a set of presentations and papers covering the field in a systematic way, drawing on and integrating contemporary research from earth systems science, resource economics, institutional analysis, ecology, geography, development studies, health sciences, engineering, and other disciplines.",
    "prereq": {}
  },
  {
    "uid": "812482",
    "code": "EEB5407",
    "subject": "EEB",
    "number": "5407",
    "honors": false,
    "writing": false,
    "name": "Ecology",
    "fullname": "Ecology",
    "info": "Principles of ecology from populations to ecosystems. Applications to human populations, disease, exotic organisms, habitat fragmentation, biodiversity, and global dynamics of the earth.",
    "prereq": {}
  },
  {
    "uid": "812685",
    "code": "EEB5409",
    "subject": "EEB",
    "number": "5409",
    "honors": false,
    "writing": false,
    "name": "Evolution",
    "fullname": "Evolution",
    "info": "Evolution has shaped all of life and continues to. This course explores the processes that cause the genetic change of populations over generations and the outcomes of these processes. Evolution is crucial for understanding of current societal issues including biodiversity conservation, genetic engineering, food security, and public health. Lab. ",
    "prereq": {}
  },
  {
    "uid": "825338",
    "code": "EEB5412",
    "subject": "EEB",
    "number": "5412",
    "honors": false,
    "writing": false,
    "name": "Intro to Animal Behavior",
    "fullname": "Introduction to Animal Behavior",
    "info": "EEB 5412 is a lecture-only course for graduate students. Why do animals behave the way they do? This question is relevant to conservation, agriculture, human health, veterinary medicine, developing artificial intelligence and understanding the origins of human behavior. This writing intensive course provides a broad introduction to animal behavior. As one of the most interdisciplinary fields in all of biology, understanding animal behavior requires an understanding of cell biology, physiology, genetics, development, ecology, endocrinology, evolution, learning theory, and even physics and economics! This course will draw on questions and methods from each of these disciplines to answer what on the surface appears to be a very simple question: Why is that animal doing that? The course will review such key topics as feeding behavior, reproductive behavior, perception, learning, animal conflict, social behavior, parental care, and communication. Throughout the course, students will be immersed in the scientific process, reading scientific literature, thinking critically, formulating their own research questions, and answering them in an independent project. This is a writing intensive course that covers scientific process and how to formulate research questions. \n\nprereq: graduate student Course credit granted for only one of the following:  EEB 3412W or EEB 5412",
    "prereq": {
      "or": [
        "812592",
        "825338"
      ]
    }
  },
  {
    "uid": "818194",
    "code": "EEB5534",
    "subject": "EEB",
    "number": "5534",
    "honors": false,
    "writing": false,
    "name": "Biodiversity Science",
    "fullname": "Biodiversity Science",
    "info": "Biodiversity science is a rapidly expanding field of inquiry with increasing digital resources and global monitoring capabilities precisely at the moment in history that scientists recognize as the Sixth Extinction. In other words, we are currently facing a biodiversity crisis with threats to the Earth's biota not seen since the dinosaurs perished 65 million years ago. \"Biodiversity\" was coined by W.G. Rosen and E.O Wilson in the 1980s to describe the variation in all of life on Earth. The term is now widely used in both the scientific and popular literature and is at the center of scientific enquiry, conservation efforts, large-scale collaborative pursuits of technological advances to allow monitoring from space, and global assessments that interface with international policy. Biodiversity requires integration across multiple disciplines from evolution, to ecology, remote sensing, conservation biology, economics, and the social sciences, including environmental policy. Biodiversity science is thus inherently interdisciplinary. As a consequence, rarely does a single course provide students the opportunity to focus on this critical topic from multiple perspectives and dimensions.\nThis course seeks to provide students intensive study of biodiversity from six perspectives: 1) the origins of biodiversity, including the processes of speciation and extinction over macroevolutionary timescales and those involved in generating biological variation at microevolutionary scales; 2) the ecological problem of species coexistence, given the nature of competitive interactions and biological filters with a focus on the interactions of individual species and major threats to biodiversity; 3) the consequences of biodiversity and biodiversity loss for ecosystem functions, focusing on ecosystem scale processes; 4) the services or benefits to humans attributed to biodiversity, including cultural benefits of biodiversity; here we discuss both practical and ethical arguments for sustaining biodiversity; 5) methods of detecting biodiversity including classic field biodiversity observations and taxonomic collections and emerging remote sensing methods that harness hyperspectral data and satellite imagery; and 6) scientific assessments of biodiversity that communicate the science of biodiversity to policymakers, particularly the Intergovernmental Platform on Biodiversity and Ecosystem Services (IPBES) and the Convention on Biological Diversity (CBD).\nSeveral guest lecturers from across the University will participate in discussions and aid in development of computer labs.",
    "prereq": {}
  },
  {
    "uid": "005215",
    "code": "EEB5601",
    "subject": "EEB",
    "number": "5601",
    "honors": false,
    "writing": false,
    "name": "Limnology",
    "fullname": "Limnology",
    "info": "Advanced introduction to description/analysis of interaction of physical, chemical, and biological factors that control functioning of life in lakes and other freshwater aquatic environments.\n\nprereq: Grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "005216",
    "code": "EEB5605",
    "subject": "EEB",
    "number": "5605",
    "honors": false,
    "writing": false,
    "name": "Limnology Laboratory",
    "fullname": "Limnology Laboratory",
    "info": "Field/lab methods to obtain information on environmental conditions in aquatic environments and measure abundance of aquatic organisms, especially plankton. Field/lab instruments, sampling devices, microscopy, water chemistry, data analysis.\n\nprereq: 3603 or instr consent",
    "prereq": {
      "or": [
        "799430"
      ]
    }
  },
  {
    "uid": "795008",
    "code": "EEB5609",
    "subject": "EEB",
    "number": "5609",
    "honors": false,
    "writing": false,
    "name": "Ecosystem Ecology",
    "fullname": "Ecosystem Ecology",
    "info": "Regulation of energy and elements cycling through ecosystems. Dependence of cycles on kinds/numbers of species within ecosystems. Effects of human-induced global changes on functioning of ecosystems.",
    "prereq": {}
  },
  {
    "uid": "818834",
    "code": "EEB5611",
    "subject": "EEB",
    "number": "5611",
    "honors": false,
    "writing": false,
    "name": "Biogeochemical Processes",
    "fullname": "Biogeochemical Processes",
    "info": "Application of biochemistry, ecology, chemistry, and physics to environmental issues. Issues in biogeochemistry. Impact of humans on biogeochemical processes in soils, lakes, oceans, estuaries, forests, urban/managed ecosystems, and extreme environments (e.g., early Earth, deep sea vents, thermal springs).\n\nprereq: graduate student",
    "prereq": {}
  },
  {
    "uid": "825548",
    "code": "EEB5851",
    "subject": "EEB",
    "number": "5851",
    "honors": false,
    "writing": false,
    "name": "Health and Biodiversity",
    "fullname": "Health and Biodiversity",
    "info": "Basics of biodiversity, human/animal health, interdependence. Strategies for sustainable health. \n\nprereq: BIOL 1001, 1009, 1951 or equiv.",
    "prereq": {
      "or": [
        "005419",
        "005416",
        "817196"
      ]
    }
  },
  {
    "uid": "005105",
    "code": "EEB5961",
    "subject": "EEB",
    "number": "5961",
    "honors": false,
    "writing": false,
    "name": "Decision Analysis",
    "fullname": "Decision Analysis and Modeling in Conservation Biology",
    "info": "Decision analysis/modeling in conservation biology. Techniques, concepts, software.",
    "prereq": {}
  },
  {
    "uid": "794475",
    "code": "EEB5963",
    "subject": "EEB",
    "number": "5963",
    "honors": false,
    "writing": false,
    "name": "Modeling Nature & Nature Model",
    "fullname": "Modeling Nature and the Nature of Modeling",
    "info": "Hands-on modeling experiences in context of biological applications. Reviews calculus concepts.  Students carry out modeling steps, from developing the model, to analytical analysis, to developing computer code, to running the models.",
    "prereq": {}
  },
  {
    "uid": "013783",
    "code": "EEB8010",
    "subject": "EEB",
    "number": "8010",
    "honors": false,
    "writing": false,
    "name": "Seminar Paleo",
    "fullname": "Seminar in Paleoecology",
    "info": "Reading and discussion of recent literature on Quaternary paleoecology.",
    "prereq": {}
  },
  {
    "uid": "011321",
    "code": "EEB8020",
    "subject": "EEB",
    "number": "8020",
    "honors": false,
    "writing": false,
    "name": "Community Ecol Sem",
    "fullname": "Community Ecology Seminar",
    "info": "Research topics in selected areas.",
    "prereq": {}
  },
  {
    "uid": "011322",
    "code": "EEB8050",
    "subject": "EEB",
    "number": "8050",
    "honors": false,
    "writing": false,
    "name": "Population Biol Sem",
    "fullname": "Population Biology Seminar",
    "info": "Research topics in selected areas.",
    "prereq": {}
  },
  {
    "uid": "005204",
    "code": "EEB8051",
    "subject": "EEB",
    "number": "8051",
    "honors": false,
    "writing": false,
    "name": "Empirical Ecol",
    "fullname": "Empirical Ecology",
    "info": "Overview of analytical methods in interpreting data collected from observational and experimental studies in ecology and related fields of evolution, behavior, and conservation biology. Univariate, bivariate, and multivariate methods, including computationally intensive methods, ordination, and hypothesis testing.",
    "prereq": {}
  },
  {
    "uid": "011323",
    "code": "EEB8060",
    "subject": "EEB",
    "number": "8060",
    "honors": false,
    "writing": false,
    "name": "Evolutionary Gen Sem",
    "fullname": "Evolutionary Genetics Seminar",
    "info": "Research topics in selected areas.",
    "prereq": {}
  },
  {
    "uid": "817430",
    "code": "EEB8100",
    "subject": "EEB",
    "number": "8100",
    "honors": false,
    "writing": false,
    "name": "EEB Department Seminar",
    "fullname": "EEB Department Seminar",
    "info": "This seminar series is focused on topics of general interest to faculty and students in EEB and often are presented by visiting scientists, including leaders in specific fields.",
    "prereq": {}
  },
  {
    "uid": "817439",
    "code": "EEB8150",
    "subject": "EEB",
    "number": "8150",
    "honors": false,
    "writing": false,
    "name": "EEB Lab Tours",
    "fullname": "EEB Lab Tours",
    "info": "Laboratory Tour seminar to acquaint incoming graduate students with the research of EEB graduate faculty, their postdocs and current graduate students. Faculty members will conduct lab tours in their laboratory and/or inform students about their research. This seminar will be organized by the DGS or a faculty member designated by the DGS.",
    "prereq": {}
  },
  {
    "uid": "817440",
    "code": "EEB8151",
    "subject": "EEB",
    "number": "8151",
    "honors": false,
    "writing": false,
    "name": "EEB Lab Tours",
    "fullname": "EEB Lab Tours",
    "info": "The goal of the Laboratory Tour seminar is to acquaint incoming graduate students with the research of EEB graduate faculty, their postdocs and current graduate students. Faculty members will conduct lab tours in their laboratory and/or inform students about their research. This seminar will be organized by the DGS or a faculty member designated by the DGS.",
    "prereq": {}
  },
  {
    "uid": "005102",
    "code": "EEB8162",
    "subject": "EEB",
    "number": "8162",
    "honors": false,
    "writing": false,
    "name": "Winter Ecol",
    "fullname": "Winter Ecology",
    "info": "Survival options and mechanisms of plants and animals during seasonal cold periods.",
    "prereq": {}
  },
  {
    "uid": "808878",
    "code": "EEB8200",
    "subject": "EEB",
    "number": "8200",
    "honors": false,
    "writing": false,
    "name": "Sustainability Science",
    "fullname": "Sustainability Science Distributed Graduate Seminar",
    "info": "Theories of sustainability science. Interactions between human/environmental systems. Improving present/future generations. Presentations/papers. Contemporary research from earth systems science, resource economics, institutional analysis, ecology, geography, development studies, health sciences, engineering.",
    "prereq": {}
  },
  {
    "uid": "808879",
    "code": "EEB8201",
    "subject": "EEB",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Grad. Foundations-EEB, Sem 1",
    "fullname": "Graduate Foundations in Ecology, Evolution and Behavior Semester 1",
    "info": "Foundational knowledge in ecology, evolution, behavior.\n\nprereq: Grad student in Ecology, Evolution and Behavior",
    "prereq": {}
  },
  {
    "uid": "808880",
    "code": "EEB8202",
    "subject": "EEB",
    "number": "8202",
    "honors": false,
    "writing": false,
    "name": "Grad. Foundations-EEB, Sem 2",
    "fullname": "Graduate Foundations in Ecology, Evolution and Behavior - Semester 2",
    "info": "Foundational knowledge in ecology, evolution, behavior. Second semester of two-semester sequence.\n\nprereq: 8601, EEB grad student",
    "prereq": {
      "and": [
        "800645"
      ]
    }
  },
  {
    "uid": "811535",
    "code": "EEB8301",
    "subject": "EEB",
    "number": "8301",
    "honors": false,
    "writing": false,
    "name": "Prelim Proposal Writing Sem",
    "fullname": "Prelim Proposal Writing Seminar",
    "info": "The purpose of this class is to learn about the structure and format of research proposals. This course helps prepare students for writing the written preliminary exam the following semester. prereq: EEB graduate Student",
    "prereq": {}
  },
  {
    "uid": "811536",
    "code": "EEB8302",
    "subject": "EEB",
    "number": "8302",
    "honors": false,
    "writing": false,
    "name": "EEB Written Prelim Workshop",
    "fullname": "EEB Written Prelim Workshop",
    "info": "Provide time for students to meet/discuss issues associated with writing written preliminary exam. Workshop sections of written preliminary exam with peers. Exam should be reviewed informally by committee/revised by student before final submission.\n\nprereq: EEB grad student",
    "prereq": {}
  },
  {
    "uid": "788106",
    "code": "EEB8333",
    "subject": "EEB",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "011324",
    "code": "EEB8360",
    "subject": "EEB",
    "number": "8360",
    "honors": false,
    "writing": false,
    "name": "Behav Biol Sem",
    "fullname": "Behavioral Biology Seminar",
    "info": "Research topics in selected areas.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788343",
    "code": "EEB8444",
    "subject": "EEB",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "807925",
    "code": "EEB8500",
    "subject": "EEB",
    "number": "8500",
    "honors": false,
    "writing": false,
    "name": "NSF GRF Proposal Writing",
    "fullname": "NSF GRF Graduate Research Fellowship Proposal Writing Seminar",
    "info": "Prepare EEB students to submit a competitive fellowship proposal to an external organization (e.g., NSF Graduate Research Fellowship program). In addition to  announced meeting time, students meet once a week in small groups to discuss proposals/provide each other with feedback.\n\nprereq: EEB grad student only",
    "prereq": {}
  },
  {
    "uid": "807926",
    "code": "EEB8550",
    "subject": "EEB",
    "number": "8550",
    "honors": false,
    "writing": false,
    "name": "Fellowship Proposal Writing",
    "fullname": "Graduate Research Fellowship Proposal Writing Seminar",
    "info": "How to submit competitive fellowship proposal to external organization (e.g., NSF Graduate Research Fellowship program). Besides scheduled class, students meet weekly in small groups to discuss proposals/give feedback.",
    "prereq": {}
  },
  {
    "uid": "800645",
    "code": "EEB8601",
    "subject": "EEB",
    "number": "8601",
    "honors": false,
    "writing": false,
    "name": "Intro to Stream Restoration",
    "fullname": "Introduction to Stream Restoration",
    "info": "Science/policy behind stream restoration. How to evaluating/critiquing a stream restoration project. Assimilate geomorphic, hydrologic, and ecological data at watershed and reach scales to plan a restoration project. Developing a monitoring/assessment program for an existing or future restoration project.\n\nprereq: Grad student in [CE or GEO or EEB or WRS or FW or BAE or FR or HORT or ENR or LA or SRSE] or instr consent",
    "prereq": {}
  },
  {
    "uid": "800653",
    "code": "EEB8602",
    "subject": "EEB",
    "number": "8602",
    "honors": false,
    "writing": false,
    "name": "Stream Restoration Practice",
    "fullname": "Stream Restoration Practice",
    "info": "Field experience, group design project. Students provide a stream restoration context for each other's elective coursework, complete critical assessments of stream restoration projects, and design a stream restoration site.\n\nprereq: CE 8601 or GEO 8601",
    "prereq": {
      "or": [
        "800645"
      ]
    }
  },
  {
    "uid": "005229",
    "code": "EEB8620",
    "subject": "EEB",
    "number": "8620",
    "honors": false,
    "writing": false,
    "name": "Advanced Limnol",
    "fullname": "Advanced Limnology",
    "info": "Selected topics, using current and classical literature. Seminar format. Term paper required.",
    "prereq": {}
  },
  {
    "uid": "016397",
    "code": "EEB8641",
    "subject": "EEB",
    "number": "8641",
    "honors": false,
    "writing": false,
    "name": "Spatial Ecology",
    "fullname": "Spatial Ecology",
    "info": "Introduction to spatial ecology. Role of space in population dynamics and interspecific interaction. Single species/multispecies models. Deterministic/stochastic theory. Modeling, effects of implicit/explicit space on competition, pattern formation, stability, diversity, and invasion. Reading/discussion of recent literature.\n\nprereq: [3407, 2 sem calculus] or instr consent",
    "prereq": {
      "and": [
        "812357"
      ]
    }
  },
  {
    "uid": "788468",
    "code": "EEB8666",
    "subject": "EEB",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788596",
    "code": "EEB8777",
    "subject": "EEB",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787855",
    "code": "EEB8888",
    "subject": "EEB",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "011413",
    "code": "EEB8980",
    "subject": "EEB",
    "number": "8980",
    "honors": false,
    "writing": false,
    "name": "Current Topics Seminar",
    "fullname": "Seminar on Current Topics",
    "info": "Current research in ecology, evolution, behavior.\n\nprereq: EEB grad student",
    "prereq": {}
  },
  {
    "uid": "011325",
    "code": "EEB8990",
    "subject": "EEB",
    "number": "8990",
    "honors": false,
    "writing": false,
    "name": "Graduate Seminar",
    "fullname": "Graduate Seminar",
    "info": "Research topics in selected areas.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "011327",
    "code": "EEB8991",
    "subject": "EEB",
    "number": "8991",
    "honors": false,
    "writing": false,
    "name": "I S Eco Evol Behavr",
    "fullname": "Independent Study: Ecology, Evolution, and Behavior",
    "info": "Individual research on a specialized topic.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "011328",
    "code": "EEB8994",
    "subject": "EEB",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "TBD\n\nprereq: instr consent",
    "prereq": {}
  }
]