[
  {
    "uid": "811778",
    "code": "EMS5500",
    "subject": "EMS",
    "number": "5500",
    "honors": false,
    "writing": false,
    "name": "Topics in Early Modern Studies",
    "fullname": "Topics in Early Modern Studies",
    "info": "Selected topics in early modern studies from various disciplinary perspectives/world regions.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "826834",
    "code": "EMS5774",
    "subject": "EMS",
    "number": "5774",
    "honors": false,
    "writing": false,
    "name": "The Body in Indian Art",
    "fullname": "The Body in Indian Art",
    "info": "This course explores the concept of embodiment and the nature of representation, from images of gods to human portraits, in Hindu, Jain, Buddhist, Muslim, and courtly contexts. We consider diverse media from ancient to modern periods, including painting, sculpture, photography, architecture, inscriptions, and literature.\n\nThis course explores the concept of embodiment in the diverse artistic traditions of South Asia. We will consider how ideas of representation of an individual have been understood and expressed differently across the history of South Asian art and religions. The course will consider the embodied representation of deities and semi-divine figures along with those of “real” people; we will consider, given the ontologies of such representations in their religious and cultural contexts. Representation of an individual – a portrait – is a foundational subject in the canon of art history. What does the very idea of a portrait mean so far outside the canon of (Western) art history? As we survey the diverse traditions and media of images of the body, we will be attentive to questions such as, does media make meaning for these types of images? Can a ‘portrait’ be textual? Is verisimilitude essential to the depiction of a person? In what ways are practices of depiction informed by other modes of image-making, such as images of religious devotion, and traditions of representation encountered through trade or gift? We will consider diverse media from Ancient India to the modern period, including painting, stone and metal sculpture, photography, architecture, inscriptions, and even a Sanskrit play.",
    "prereq": {}
  },
  {
    "uid": "804711",
    "code": "EMS8100",
    "subject": "EMS",
    "number": "8100",
    "honors": false,
    "writing": false,
    "name": "Workshop: Early Modern Studies",
    "fullname": "Workshop in Early Modern Studies",
    "info": "Lectures and workshops offered by various centers, departments, institutes, and libraries across disciplines on Twin Cities campus. Online reports and discussion.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "804712",
    "code": "EMS8250",
    "subject": "EMS",
    "number": "8250",
    "honors": false,
    "writing": false,
    "name": "Sem in Early Modern Studies",
    "fullname": "Seminar in Early Modern Studies",
    "info": "Current research and debates in early modern studies. Theoretical approaches to major questions shaping seminar's subject matter.",
    "prereq": {}
  },
  {
    "uid": "804713",
    "code": "EMS8500",
    "subject": "EMS",
    "number": "8500",
    "honors": false,
    "writing": false,
    "name": "Topics in Early Modern Studies",
    "fullname": "Topics in Early Modern Studies",
    "info": "Selected topics in early modern studies from various disciplinary perspectives and world regions.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "804714",
    "code": "EMS8993",
    "subject": "EMS",
    "number": "8993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Students work on tutorial basis. Guided individual reading or study.\n\nprereq: Grad student",
    "prereq": {}
  }
]