[
  {
    "uid": "004765",
    "code": "ENGW1101W",
    "subject": "ENGW",
    "number": "1101",
    "honors": false,
    "writing": true,
    "name": "Intro Creative Writ",
    "fullname": "Introduction to Creative Writing",
    "info": "In this course, we will explore the fundamentals of creative writing. We will start by looking at the building blocks of good imaginative writing: image, voice, character, setting, story, and revision. We will then move on to a more in-depth examination of three forms: literary nonfiction, fiction, and poetry. Students will learn how to read as writers, obtain an understanding and appreciation for imaginative writing, and gain a sense of themselves as creative writers. We will be trying many exercises and assignments, from brainstorming experiments to final drafts, so come ready to write.\n\nprereq: Students may not audit this course",
    "prereq": {}
  },
  {
    "uid": "004945",
    "code": "ENGW1102W",
    "subject": "ENGW",
    "number": "1102",
    "honors": false,
    "writing": true,
    "name": "Intro to Fiction Writing",
    "fullname": "Introduction to Fiction Writing",
    "info": "This is an introductory course in the art and craft of reading and writing fiction. Students will read and analyze contemporary and classic works of fiction while also constructing and revising their own fiction. Assigned works will include Black, Brown, Indigenous, and queer writers along with other writers reflecting a diversity of voices and perspectives throughout literary history. Students will be responsible for crafting original fiction, commenting on student work, workshop participation, attendance at a literary reading, short presentations and/or papers, and a final portfolio of fiction. ",
    "prereq": {}
  },
  {
    "uid": "004944",
    "code": "ENGW1103W",
    "subject": "ENGW",
    "number": "1103",
    "honors": false,
    "writing": true,
    "name": "Introduction to Poetry Writing",
    "fullname": "Introduction to Poetry Writing",
    "info": "This is an introductory course in the art and craft of reading and writing poetry. Students will read and analyze contemporary and classic works of poetry while also constructing and revising their own poetry. Assigned works will include Black, Brown, Indigenous, and queer writers along with other writers reflecting a diversity of voices and perspectives throughout literary history. Students will be responsible for crafting original poetry, commenting on student work, workshop participation, attendance at a literary reading, short presentations and/or papers, and a final portfolio of poetry.",
    "prereq": {}
  },
  {
    "uid": "004946",
    "code": "ENGW1104W",
    "subject": "ENGW",
    "number": "1104",
    "honors": false,
    "writing": true,
    "name": "Intro to Literary Nonfiction",
    "fullname": "Introduction to Literary Nonfiction Writing",
    "info": "This is an introductory course in the art and craft of reading and writing nonfiction. By the end of the semester, you should be familiar with nonfiction's many different forms: literary journalism, memoir, personal essay, and blendings of the three. You will read and analyze contemporary and classic works of nonfiction while also constructing and revising your own essays. Assigned works will include Black, Brown, Indigenous, and queer writers along with other writers reflecting a diversity of voices and perspectives throughout literary history. Students will be responsible for crafting original nonfiction, commenting on student work, workshop participation, attendance at a literary reading, short presentations and/or papers, and a final portfolio of nonfiction.",
    "prereq": {}
  },
  {
    "uid": "819906",
    "code": "ENGW1911W",
    "subject": "ENGW",
    "number": "1911",
    "honors": false,
    "writing": true,
    "name": "Creative Writing in Spain",
    "fullname": "Eat, Write, Learn: Creative Writing in Spain",
    "info": "This freshman seminar/writing class, which satisfies the Writing-Intensive requirement, focuses on travel writing, with spring break dedicated to an immersion experience in Toledo, a small medieval city in the center of Spain which has been declared, in its entirety, a national monument.  For centuries an historic, scholarly, and artistic center, Toledo was long famed for its religious tolerance, with Christian, Jewish, and Muslim populations coexisting within its walls. Class will begin in Minnesota with writing experiments, readings, and discussions: why do we travel and what do we gain from a journey into the unfamiliar? How have travelers past and present reacted to cultures and environments not their own? In preparation for spring break in Spain, students will respond to a variety of writing prompts and assignments: the travel memory, the food review, the creative tour guide, the work of ekphrasis, the annotated map, etc. Then, on arrival in Toledo, students will wander through tangled streets, cathedrals, fortresses, synagogues, and museums, keeping a detailed travel journal and taking notes for a final essay as they go. We'll benefit from guided tours of Spanish monuments and museums and take day trips to Madrid and to Segovia. Writing and revising will be emphasized throughout the semester as modes of discovery. No knowledge of Spanish is required for this class.",
    "prereq": {}
  },
  {
    "uid": "826547",
    "code": "ENGW1912W",
    "subject": "ENGW",
    "number": "1912",
    "honors": false,
    "writing": true,
    "name": "Science and Nature Writing",
    "fullname": "Wild Words: Science and Nature Writing in New Zealand",
    "info": "In this Freshman Seminar, which meets both LE theme and WI requirements, we will explore writing about science and nature in a variety of forms, from field journals and science interpretation to audio/video essays, profiles, and creative works inspired by the natural world. These varied writing assignments will allow students to develop the core writing skills of brainstorming, drafting, and revising as well as communicating ideas in different modes for different audiences. Useful for writers, science students, and those engaged with environment issues, and curious adventurers, the class begins after spring break and extends into May with a two-week immersion experience in New Zealand.An island nation of fiords and volcanoes that has followed a unique evolutionary path, New Zealand is the ideal place to read and write about the natural world. Populated by flightless birds and outsize insects, it has no native land mammals except bats. The country, also called Aotearoa, \"The Land of the Long White Cloud,\" is at the forefront of many scientific debates and challenges, including evolution on islands, the impacts and control of native species, climate change, and reintroduction biology. We will explore Wellington, the capital city, as well as Dunedin, the \"Wildlife Capital of New Zealand,\" a city rich in Maori and Scottish heritage, Victorian architecture, and literary tradition. We will meet with scientists and conservationists working on issues that face both New Zealand and the entire planet. In addition, we will take trips to Matui/Somes Island, a predator-free scientific reserve, the Museum of New Zealand (Te Papa Tongarewa), and the Otago Peninsula, home of colonies of little blue penguins and royal albatross.",
    "prereq": {}
  },
  {
    "uid": "827143",
    "code": "ENGW1913",
    "subject": "ENGW",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "YA Social Justice Novel",
    "fullname": "Writing and Reading the YA Social Justice Novel",
    "info": "What young adult novel would you write? In this course you will write short stories that you can turn into a novel over time. While the readings and class discussions will focus upon young adult novels involving social justice, it is up to you what kind of novel you would envision. We will also consider the role of art in society during a time when book bans are on the rise, including against many of the authors whose texts you will read. To keep your project going when class ends, you will also learn how to create a mood map, world-building document or another creative map that allows you to expand your vision.",
    "prereq": {}
  },
  {
    "uid": "827144",
    "code": "ENGW1914W",
    "subject": "ENGW",
    "number": "1914",
    "honors": false,
    "writing": true,
    "name": "Spellcraft",
    "fullname": "Spellcraft: The Magic of Poetry",
    "info": "One definition of a spell is: “Words that make something happen.” Another definition of a spell is: “Words arranged in a particular order to manifest power.” These definitions could also describe poetry. Because of these overlaps, many poets practice a form of divinatory poetics or imagine/invoke connection to more-than-human forces as inspiration, as part of their writing process and as an expression of their politics. In this class we will read and write poems that are diverse, powerful, and, yes, magical.",
    "prereq": {}
  },
  {
    "uid": "014507",
    "code": "ENGW3101",
    "subject": "ENGW",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Intermediate Creative Writing",
    "fullname": "Intermediate Creative Writing",
    "info": "For students with experience in creative writing. Exercises, experiments, assigned readings, and discussion of students' work.",
    "prereq": {}
  },
  {
    "uid": "004947",
    "code": "ENGW3102W",
    "subject": "ENGW",
    "number": "3102",
    "honors": false,
    "writing": true,
    "name": "Intermediate Fiction Writing",
    "fullname": "Intermediate Fiction Writing",
    "info": "This is an intermediate course in the art and craft of reading and writing fiction. Students will read and analyze contemporary and classic works of fiction while also constructing and revising their own fiction. Assigned works will include Black, Brown, Indigenous, female-identified and queer writers along with other writers reflecting a diversity of voices and perspectives throughout literary history. Students will be responsible for crafting original fiction, commenting on student work, workshop participation, attendance at a literary reading, short presentations and/or papers, and a final portfolio of fiction.\n\nprereq: [EngW 1101 , 1101W, 1102, 1102W, 1103, 1103W, 1104, 1104W,1911W, 1912W, 1913, 1914W, 1915W], students cannot audit course",
    "prereq": {
      "and": [
        "004765",
        "004945",
        "004944",
        "004946",
        "819906",
        "826547",
        "827143",
        "827144"
      ]
    }
  },
  {
    "uid": "014509",
    "code": "ENGW3103",
    "subject": "ENGW",
    "number": "3103",
    "honors": false,
    "writing": false,
    "name": "Advanced Fiction",
    "fullname": "Advanced Fiction Writing",
    "info": "Advanced workshop.",
    "prereq": {}
  },
  {
    "uid": "004948",
    "code": "ENGW3104W",
    "subject": "ENGW",
    "number": "3104",
    "honors": false,
    "writing": true,
    "name": "Intermediate Poetry Writing",
    "fullname": "Intermediate Poetry Writing",
    "info": "This is an intermediate course in the art and craft of reading and writing poetry. Students will read and analyze contemporary and classic works of poetry while also constructing and revising their own poetry. Assigned works will include Black, Brown, Indigenous, female-identified and queer writers along with other writers reflecting a diversity of voices and perspectives throughout literary history. Students will be responsible for crafting original poetry, commenting on student work, workshop participation, attendance at a literary reading, short presentations and/or papers, and a final portfolio of poetry.\n\nprereq: [EngW 1101 , 1101W, 1102, 1102W, 1103, 1103W, 1104, 1104W, 1911W, 1912W, 1913, 1914W, 1915W], students cannot audit course",
    "prereq": {
      "and": [
        "004765",
        "004945",
        "004944",
        "004946",
        "819906",
        "826547",
        "827143",
        "827144"
      ]
    }
  },
  {
    "uid": "014511",
    "code": "ENGW3105",
    "subject": "ENGW",
    "number": "3105",
    "honors": false,
    "writing": false,
    "name": "Advanced Poetry",
    "fullname": "Advanced Poetry Writing",
    "info": "Opportunity to explore new poetic possibilities and read widely in contemporary poetry/poetics. Advanced workshop.",
    "prereq": {}
  },
  {
    "uid": "004949",
    "code": "ENGW3106W",
    "subject": "ENGW",
    "number": "3106",
    "honors": false,
    "writing": true,
    "name": "Interm. Literary Nonfiction",
    "fullname": "Intermediate Literary Nonfiction Writing",
    "info": "This is an intermediate course in the art and craft of reading and writing nonfiction. By the end of the semester, you should be familiar with nonfiction's many different forms: literary journalism, memoir, personal essay, and blendings of the three. You will read and analyze contemporary and classic works of nonfiction while also constructing and revising your own essays. Assigned works will include Black, Brown, Indigenous, female-identified and queer writers along with other writers reflecting a diversity of voices and perspectives throughout literary history. Students will be responsible for crafting original nonfiction, commenting on student work, workshop participation, attendance at a literary reading, short presentations and/or papers, and a final portfolio of nonfiction.\n\nprereq: [EngW 1101 , 1101W, 1102, 1102W, 1103, 1103W, 1104, 1104W,1911W, 1912W, 1913, 1914W, 1915W], students cannot audit course",
    "prereq": {
      "and": [
        "004765",
        "004945",
        "004944",
        "004946",
        "819906",
        "826547",
        "827143",
        "827144"
      ]
    }
  },
  {
    "uid": "014513",
    "code": "ENGW3107",
    "subject": "ENGW",
    "number": "3107",
    "honors": false,
    "writing": false,
    "name": "Advanced Literary Nonfiction",
    "fullname": "Advanced Literary Nonfiction",
    "info": "Advanced workshop. Writing memoir, literary essays.",
    "prereq": {}
  },
  {
    "uid": "004950",
    "code": "ENGW3110",
    "subject": "ENGW",
    "number": "3110",
    "honors": false,
    "writing": false,
    "name": "Topics in Creative Writing",
    "fullname": "Topics in Creative Writing",
    "info": "Topics specified in Class Schedule.prereq: 1101 or 1102 or 1103 or 1104 or dept consent",
    "prereq": {
      "or": [
        "004765",
        "004945",
        "004944",
        "004946"
      ]
    }
  },
  {
    "uid": "827244",
    "code": "ENGW3111W",
    "subject": "ENGW",
    "number": "3111",
    "honors": false,
    "writing": true,
    "name": "Sci Fi  & Fantasy Writing",
    "fullname": "Science Fiction and Fantasy Writing",
    "info": "What fantastic world will you write? In this craft class, you will build a world, write a short story and expand it into a longer work of fiction up to twenty-five pages as is characteristic for the overall genre. Your work of fiction might be alternate history, apocalyptic fiction, cyberpunk, magical realism, speculative fiction, sword and sorcery or another subgenre. Along the way, your instructor will introduce you to classic and contemporary science fiction and fantasy short stories, including those written by Black, Brown, female-identified and/or queer writers. Each week, your instructor will also give mini-lectures about topics of interest and provide you with writing exercises and prompts that are peculiar to this genre.\n\nsoft prerequisite of one introductory creative writing class: ENGW 1101W, ENGW 1102W, ENGW 1103W, ENGW 1104W, ENGW 1911W, ENGW 1912W, ENGW 1913, ENGW 1914W, ENGW 1915W or instructor permission",
    "prereq": {
      "or": [
        "004765",
        "004945",
        "004944",
        "004946",
        "819906",
        "826547",
        "827143",
        "827144"
      ]
    }
  },
  {
    "uid": "817995",
    "code": "ENGW3801W",
    "subject": "ENGW",
    "number": "3801",
    "honors": false,
    "writing": true,
    "name": "Creative Writing in Spain",
    "fullname": "Eat, Write, Learn: Creative Writing in Spain",
    "info": "This undergraduate creative writing class which satisfies both the LE and the Writing-Intensive requirements focuses on the experience and the literary evocation of travel, with students based first in the capital, Madrid, and then in Toledo, a medieval city in the center of Spain. In Madrid, students will write about the Spanish tradition of eating twelve grapes at the stroke of midnight on New Year's eve; they will compare the characteristics of two different plazas; they will write poetry about art in the Prado Museum. In Toledo, they will wander through tangled streets, shops, cathedrals, fortresses, synagogues and museums, taking notes for poems, stories, and essays as they go. Madrid is a vibrant, modern European center; Toledo, a beautifully preserved city on a hill, has been declared, in its entirety, a national monument. For centuries an historic, scholarly and artistic center, Toledo was long famed for its religious tolerance, with Christian, Jewish, and Muslim populations coexisting within its walls. \n\nIn both locations, we will have guided tours of Spanish monuments and museums, and students will reflect on the experience of travel via many different types and styles of writing assignments: the daily post-card, the food review, the creative travel guide, the work of ekphrasis, the annotated map, the daily journal, etc.  Why do we travel and what do we gain from visiting cultures and environments that may be unfamiliar? Writing and revising will be emphasized as creative ways of reflecting on the phenomenon of departure and return.\n\n",
    "prereq": {}
  },
  {
    "uid": "825334",
    "code": "ENGW3885W",
    "subject": "ENGW",
    "number": "3885",
    "honors": false,
    "writing": true,
    "name": "Capstone in Creative Writing",
    "fullname": "Capstone Seminar in Creative Writing",
    "info": "This course is devoted to the writing of the senior paper in creative writing. To graduate with a BA in English, students with an interest in creative writing may choose to produce a substantial manuscript of poetry, literary fiction, or literary nonfiction rather than an extended, scholarly essay. In this advanced creative writing workshop, students receive instruction on writing this manuscript from tenured and tenure-track faculty in English. Class sessions typically include in-class writing exercises, which are then expanded into more finished works of poetry or prose reviewed by the faculty and discussed in workshops by the students themselves. Writing exercises and assignments lead, at the end of the semester, to a finished, thoroughly revised manuscript of at least 2,500 words. Faculty teach students to produce a significant body of poetry, fiction, or creative nonfiction though discussions of method, craft, and development; instruction in specific writing techniques; workshopping and revising drafts; solving problems; and creating a coherent and elegant final product. While the subjects about which students write vary depending on student interest and faculty expertise, at least 50 percent of the course grade is determined by students’ writing performance. The seminar also functions as a capstone experience that fulfills many of the Student Learning Outcomes for the English major and the capstone course for those who are pursuing a Minor in Creative Writing. \n\nPrerequisites for Admission: (1) English major status and completion of a Critical Theories and Methods course (ENGL 3001W, ENGL 3002, ENGL 4003) or approved transfer course with a minimum grade of C-minus; (2) completion of at least six credits of creative writing courses, including one intermediate (ENGW 3xxx-level) or advanced creative writing workshop, preferably in the genre of the ENGW 3885W workshop to which you are applying; and (3) submission of a creative writing sample. Admission is by permission of the instructor. Priority will be given to students with senior status who have completed the majority of the major requirements, as well as to students who plan to graduate in the term they are requesting to take the capstone seminar. ",
    "prereq": {}
  },
  {
    "uid": "007066",
    "code": "ENGW3960W",
    "subject": "ENGW",
    "number": "3960",
    "honors": false,
    "writing": true,
    "name": "Capstone Sem Creative Writing",
    "fullname": "Capstone Seminar in Creative Writing",
    "info": "This course is devoted to the writing of the senior paper in creative writing. To graduate with a BA in English, students with an interest in creative writing may choose to produce a substantial manuscript of poetry, literary fiction, or literary nonfiction rather than an extended, scholarly essay. In this advanced creative writing workshop, students receive instruction on writing this manuscript from tenured and tenure-track faculty in English. Class sessions typically include in-class writing exercises, which are then expanded into more finished works of poetry or prose reviewed by the faculty and discussed in workshops by the students themselves. Writing exercises and assignments lead, at the end of the semester, to a finished, thoroughly revised manuscript of at least 2,500 words. Faculty teach students to produce a significant body of poetry, fiction, or creative nonfiction though discussions of method, craft, and development; instruction in specific writing techniques; workshopping and revising drafts; solving problems; and creating a coherent and elegant final product. While the subjects about which students write vary depending on student interest and faculty expertise, at least 50 percent of the course grade is determined by students\u0092 writing performance. The senior seminar also functions as a capstone experience that fulfills many of the Student Learning Outcomes for the English major and the capstone course for those who are pursuing a Minor in Creative Writing. \n\nPrerequisites for Admission: Admission to ENGW 3960W requires: (1) English major status and completion of ENGL 3001W with a minimum grade of C-minus; (2) completion of at least six credits of creative writing courses, including one intermediate (ENGW 3xxx-level) or advanced creative writing workshop, preferably in the genre of the ENGW 3960W workshop to which you are applying; and (3) submission of a creative writing sample. Admission is by permission of the instructor. Priority will be given to students with senior status who have completed the majority of the major requirements, as well as to students who plan to graduate in the term they are requesting to take the senior seminar. \n",
    "prereq": {}
  },
  {
    "uid": "825563",
    "code": "ENGW3993",
    "subject": "ENGW",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study - Honors Thesis",
    "fullname": "Directed Study - Honors Thesis in Creative Writing",
    "info": "ENGW 3993 is a directed study that supports summa cum laude degree students beginning their honors theses in the Department of English, with a focus on creative writing. Students will complete ENGW 3993, the non-WI version, in the first semester for 2 credits followed consecutively by ENGW 3993W for 2 additional credits in the second semester, when the polished product is evaluated.\n\nSumma candidates also must register for HCOL 3101H or HCOL 3102H, which counts as the classroom experience required for the completion of the Honors thesis. \n\nThe thesis must be approximately 30 pages in length and may be scholarly, critical, or creative in nature.  If the candidate elects to submit a topic, such as poetry, that poses a problem with this length, they must obtain permission from the English honors adviser and from all of his or her readers to adjust the length of the completed thesis.\n\nSumma candidates must apply for permission to register for ENGW 3993 one year before their expected graduation term. They will work with their faculty advisor to complete the University's directed study contract to clarify expectations and form a written agreement about expected workload, credits, and basis for grading.\n\nPrereq: Honors candidacy in English, consent of English honors advisor",
    "prereq": {}
  },
  {
    "uid": "825512",
    "code": "ENGW3993W",
    "subject": "ENGW",
    "number": "3993",
    "honors": false,
    "writing": true,
    "name": "Directed Study- Honors Thesis",
    "fullname": "Directed Study- Honors Thesis in Creative Writing",
    "info": "ENGW 3993W is a directed study that supports summa cum laude degree students completing their honors theses in the Department of English, with a focus on creative writing. Students will complete ENGW 3993, the non-WI version, in the first semester for 2 credits followed consecutively by ENGW 3993W for 2 additional credits in the second semester, when the polished product is evaluated.\n\nSumma candidates also must register for HCOL 3101H or HCOL 3102H, which counts as the classroom experience required for the completion of the Honors thesis. \n\nThe thesis must be approximately 30 pages in length and may be scholarly, critical, or creative in nature.  If the candidate elects to submit a topic, such as poetry, that poses a problem with this length, they must obtain permission from the English honors adviser and from all of his or her readers to adjust the length of the completed thesis.\n\nSumma candidates must apply for permission to register for ENGW 3993W one year before their expected graduation term. You will work with your faculty advisor to complete the University's directed study contract to clarify expectations and form a written agreement about expected workload, credits, and basis for grading.\n\nPrereq: Honors candidacy in English, consent of English honors advisor",
    "prereq": {}
  },
  {
    "uid": "014096",
    "code": "ENGW4205",
    "subject": "ENGW",
    "number": "4205",
    "honors": false,
    "writing": false,
    "name": "Screenwriting",
    "fullname": "Screenwriting",
    "info": "An introductory workshop to screenwriting basics, including formatting, style, and structure. In-class and take-home exercises will assist the students in learning techniques for developing engaging characters, writing concise description and vivid dialogue, and outlining a usable plot.\n\nprereq: EngL 3001W or 3001V or EngW 3102 or 3104 or 3106 or 3110, or jr or sr in SCMC major or minor\n",
    "prereq": {
      "or": [
        "002446",
        "004947",
        "004948",
        "004949",
        "004950"
      ]
    }
  },
  {
    "uid": "004953",
    "code": "ENGW5102",
    "subject": "ENGW",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Graduate Fiction Writing",
    "fullname": "Graduate Fiction Writing",
    "info": "Advanced workshop for graduate students with considerable experience in writing fiction.",
    "prereq": {}
  },
  {
    "uid": "014510",
    "code": "ENGW5103",
    "subject": "ENGW",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Advanced Fiction",
    "fullname": "Advanced Fiction Writing",
    "info": "Advanced workshop for students with considerable experience in writing fiction.",
    "prereq": {}
  },
  {
    "uid": "004954",
    "code": "ENGW5104",
    "subject": "ENGW",
    "number": "5104",
    "honors": false,
    "writing": false,
    "name": "Graduate Poetry Writing",
    "fullname": "Graduate Poetry Writing",
    "info": "Advanced workshop for graduate students with considerable experience in writing poetry. Students will explore new poetic possibilities while studying contemporary poetry and poetics.",
    "prereq": {}
  },
  {
    "uid": "014512",
    "code": "ENGW5105",
    "subject": "ENGW",
    "number": "5105",
    "honors": false,
    "writing": false,
    "name": "Advanced Poetry",
    "fullname": "Advanced Poetry Writing",
    "info": "Advanced workshop for students with considerable experience in writing poetry. An opportunity to explore new poetic possibilities and to read widely in contemporary poetry and poetics.",
    "prereq": {}
  },
  {
    "uid": "004956",
    "code": "ENGW5106",
    "subject": "ENGW",
    "number": "5106",
    "honors": false,
    "writing": false,
    "name": "Grad Lit Nonfiction Writing",
    "fullname": "Graduate Literary Nonfiction Writing",
    "info": "Advanced workshop for graduate students with considerable experience in writing literary nonfiction.",
    "prereq": {}
  },
  {
    "uid": "014516",
    "code": "ENGW5107",
    "subject": "ENGW",
    "number": "5107",
    "honors": false,
    "writing": false,
    "name": "Advanced Nonfiction",
    "fullname": "Advanced Nonfiction Writing",
    "info": "Advanced workshop for students with considerable experience in writing literary nonfiction.",
    "prereq": {}
  },
  {
    "uid": "007136",
    "code": "ENGW5110",
    "subject": "ENGW",
    "number": "5110",
    "honors": false,
    "writing": false,
    "name": "Topics Adv Fiction",
    "fullname": "Topics in Advanced Fiction Writing",
    "info": "Special topics in fiction writing. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "004959",
    "code": "ENGW5120",
    "subject": "ENGW",
    "number": "5120",
    "honors": false,
    "writing": false,
    "name": "Top Adv Poetry",
    "fullname": "Topics in Advanced Poetry",
    "info": "Special topics in poetry writing. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "004960",
    "code": "ENGW5130",
    "subject": "ENGW",
    "number": "5130",
    "honors": false,
    "writing": false,
    "name": "Topics: Grad Creative Writing",
    "fullname": "Topics in Graduate Creative Writing",
    "info": "Workshop. Might include work in more than one genre.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "016080",
    "code": "ENGW5201",
    "subject": "ENGW",
    "number": "5201",
    "honors": false,
    "writing": false,
    "name": "Jour Memoir Writ",
    "fullname": "Journal and Memoir Writing",
    "info": "Using memory in writing, from brainstorming to drafting to revising, in several genres (poems, traditional memoir essays, fiction). How diverse cultures shape memory differently.",
    "prereq": {}
  },
  {
    "uid": "016274",
    "code": "ENGW5202",
    "subject": "ENGW",
    "number": "5202",
    "honors": false,
    "writing": false,
    "name": "Journal and Memoir Writing",
    "fullname": "Journal and Memoir Writing",
    "info": "Using memory in writing, from brainstorming to drafting to revision, in several genres (poems, traditional memoir essays, fiction). How diverse cultures shape memory differently.",
    "prereq": {}
  },
  {
    "uid": "004962",
    "code": "ENGW5204",
    "subject": "ENGW",
    "number": "5204",
    "honors": false,
    "writing": false,
    "name": "Playwriting",
    "fullname": "Playwriting",
    "info": "Advanced workshop. Contact creative writing program for specific description.",
    "prereq": {}
  },
  {
    "uid": "797288",
    "code": "ENGW5207",
    "subject": "ENGW",
    "number": "5207",
    "honors": false,
    "writing": false,
    "name": "Screenwriting II",
    "fullname": "Screen writing II",
    "info": "Story structure, dialogue, description. Students turn story created in 5205 into a fully realized screenplay.",
    "prereq": {}
  },
  {
    "uid": "007177",
    "code": "ENGW5210",
    "subject": "ENGW",
    "number": "5210",
    "honors": false,
    "writing": false,
    "name": "Top Adv Lit NonFict",
    "fullname": "Topics in Advanced Literary Nonfiction",
    "info": "Special topics in essay writing (e.g., arts reviewing, writing about public affairs, writing in personal voice). Topics specified in Class Schedule.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "004964",
    "code": "ENGW5310",
    "subject": "ENGW",
    "number": "5310",
    "honors": false,
    "writing": false,
    "name": "Reading as Writers",
    "fullname": "Reading as Writers",
    "info": "Special topics in reading fiction, literary nonfiction, poetry. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "787616",
    "code": "ENGW5501",
    "subject": "ENGW",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "MWP Invitational Institute",
    "fullname": "Minnesota Writing Project Invitational Institute",
    "info": "Emphasizes participants' teaching each other best practices in writing instruction. Participants attend a retreat before beginning.",
    "prereq": {}
  },
  {
    "uid": "787617",
    "code": "ENGW5502",
    "subject": "ENGW",
    "number": "5502",
    "honors": false,
    "writing": false,
    "name": "MWP Open Inst.",
    "fullname": "Minnesota Writing Project Open Institute",
    "info": "Summer workshop to refine skills in writing instruction.",
    "prereq": {}
  },
  {
    "uid": "016418",
    "code": "ENGW5606W",
    "subject": "ENGW",
    "number": "5606",
    "honors": false,
    "writing": true,
    "name": "Literary Aspects of Journalism",
    "fullname": "Literary Aspects of Journalism",
    "info": "This course combines a survey course with close readings to help students become more informed readers of key writers who have shaped long form journalism's traditions in Britain and the United States. Most of the course will focus on the 20th century, although we will consider key innovations from the 18th and 19th centuries; students will apply what they learn to a final project that examines a 21st century writer’s texts and contexts. The works in this course focus on what some have called “literary journalism,” which uses the tools of fiction—character and scenes, tropes, and varying points of view—to tell stories that are reported and true (in other words, that are verified and not invented). To understand the power of this work, and the dilemmas it presents, we’ll consider its common origin in both journalism and the novel in the 18th century and track its development through British and American writers as they told ground-level stories about London's poor, America's 19th century urban overcrowding, city streets, the inhumanity of nuclear war, the vulnerability of celebrities, political identity, the depths of artistic self-doubt, drug subcultures of the sixties, the geological fate of huge metropolitan areas and the racism at the heart of American life during civil rights era. We'll also ask critical questions about the conventions and ethics of doing this work, considering the sometimes-compromising role of journalist-confidant as well as the privilege of powerful publishing platforms to exclude diverse voices. By understanding how so-called literary journalism has endured or evolved, students are better able to appreciate the contributions of longform journalists today as they navigate the truths and fictions of today.",
    "prereq": {}
  },
  {
    "uid": "816003",
    "code": "ENGW5701",
    "subject": "ENGW",
    "number": "5701",
    "honors": false,
    "writing": false,
    "name": "Great River Review",
    "fullname": "Great River Review",
    "info": "Students will be assigned roles, both editorial and managerial, to assist in production of The Great River Review journal. They will explore and present on the history of the small magazine in American literature and meet with Twin Cities publishing professionals.",
    "prereq": {}
  },
  {
    "uid": "007179",
    "code": "ENGW5993",
    "subject": "ENGW",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Dir Study Writing",
    "fullname": "Directed Study in Writing",
    "info": "Projects in writing poetry, fiction, drama, and nonfiction, or study of ways to improve writing.\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "004967",
    "code": "ENGW8101",
    "subject": "ENGW",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "Rdng Across Genres",
    "fullname": "Reading Across Genres",
    "info": "Contemporary writing in fiction, poetry, creative nonfiction. Primarily reading course rather than writing course.\n\nprereq: Students may not audit this course",
    "prereq": {}
  },
  {
    "uid": "004968",
    "code": "ENGW8110",
    "subject": "ENGW",
    "number": "8110",
    "honors": false,
    "writing": false,
    "name": "Seminar: Writing of Fiction",
    "fullname": "Seminar: Writing of Fiction",
    "info": "Focuses on full-length book (e.g., novel, short story collection). Assignments in common. Individual project.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "004969",
    "code": "ENGW8120",
    "subject": "ENGW",
    "number": "8120",
    "honors": false,
    "writing": false,
    "name": "Seminar: Writing of Poetry",
    "fullname": "Seminar: Writing of Poetry",
    "info": "Focuses on exploration and practice of various styles. Assignments in common and individual project.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "004970",
    "code": "ENGW8130",
    "subject": "ENGW",
    "number": "8130",
    "honors": false,
    "writing": false,
    "name": "Seminar: Writing Lit Nonfictn",
    "fullname": "Seminar: Writing of Literary Nonfiction",
    "info": "Advanced workshop. Assignments in common and individual projects.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "007180",
    "code": "ENGW8140",
    "subject": "ENGW",
    "number": "8140",
    "honors": false,
    "writing": false,
    "name": "Thesis Seminar: Poetry",
    "fullname": "Thesis Seminar: Poetry",
    "info": "For students working on their creative project.\n\nprereq: Creative writing MFA student, instr consent",
    "prereq": {}
  },
  {
    "uid": "007181",
    "code": "ENGW8150",
    "subject": "ENGW",
    "number": "8150",
    "honors": false,
    "writing": false,
    "name": "Thesis Seminar: Fiction",
    "fullname": "Thesis Seminar: Fiction",
    "info": "Students work on creative project.\n\nprereq: Creative writing MFA student, instr consent",
    "prereq": {}
  },
  {
    "uid": "007182",
    "code": "ENGW8160",
    "subject": "ENGW",
    "number": "8160",
    "honors": false,
    "writing": false,
    "name": "Thesis Seminar: Nonfiction",
    "fullname": "Thesis Seminar: Nonfiction",
    "info": "Students work on their creative project.\n\nprereq: Creative writing MFA student, instr consent",
    "prereq": {}
  },
  {
    "uid": "792630",
    "code": "ENGW8170",
    "subject": "ENGW",
    "number": "8170",
    "honors": false,
    "writing": false,
    "name": "MFA Practicum: EngW 1101W",
    "fullname": "MFA Practicum: EngW 1101W",
    "info": "Teaching Practicum for Teaching Assistants assigned to EngW 1101W.\n\nprereq: Creative writing MFA student, instr consent",
    "prereq": {}
  },
  {
    "uid": "807384",
    "code": "ENGW8180",
    "subject": "ENGW",
    "number": "8180",
    "honors": false,
    "writing": false,
    "name": "Thesis Seminar: Multigenre",
    "fullname": "Thesis Seminar: Multi-Genre",
    "info": "Thesis preparation course for advanced graduate students in the creative writing MFA program.\n\nprereq: MFA creative writing program grad student",
    "prereq": {}
  },
  {
    "uid": "790861",
    "code": "ENGW8310",
    "subject": "ENGW",
    "number": "8310",
    "honors": false,
    "writing": false,
    "name": "Topics in Creative Writing",
    "fullname": "Topics in Creative Writing",
    "info": "Special topics in fiction, literary nonfiction, poetry. Topics specified in Class Schedule.\n\nprereq: [English or creative writing] grad major or dept consent",
    "prereq": {}
  },
  {
    "uid": "788108",
    "code": "ENGW8333",
    "subject": "ENGW",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "013321",
    "code": "ENGW8990",
    "subject": "ENGW",
    "number": "8990",
    "honors": false,
    "writing": false,
    "name": "MFA Creative Thesis",
    "fullname": "MFA Creative Thesis",
    "info": "For students working on their creative project.\n\nprereq: 8140, 8150, 8160, creative writing MFA student, instr consent",
    "prereq": {
      "and": [
        "007180",
        "007181",
        "007182"
      ]
    }
  }
]