[
  {
    "uid": "794877",
    "code": "ENTR3010",
    "subject": "ENTR",
    "number": "3010",
    "honors": false,
    "writing": false,
    "name": "Intro to Entrepreneurship",
    "fullname": "Introduction to Entrepreneurship",
    "info": "Fundamentals of entrepreneurship. Career paths, including new business start-ups, franchising, acquisitions (including family business succession), corporate venturing, and entrepreneurial services. Legal structures for new business formation, aspects of business law/business ethics.\n\nprereq: Mgmt 3001, 45 cr, CSOM student",
    "prereq": {
      "and": [
        "013133"
      ]
    }
  },
  {
    "uid": "016541",
    "code": "ENTR5519",
    "subject": "ENTR",
    "number": "5519",
    "honors": false,
    "writing": false,
    "name": "Artif Intelligence II (non-WI)",
    "fullname": "Artificial Intelligence II (non-WI)",
    "info": "Advanced topics in AI for solving complex problems. Machine learning (symbolic and neural networks approaches), genetic algorithms, reasoning with uncertainty, utility theory and decision theoretic methods, natural language processing, perception robotics, introduction to Prolog programming language.",
    "prereq": {}
  },
  {
    "uid": "016528",
    "code": "ENTR6010",
    "subject": "ENTR",
    "number": "6010",
    "honors": false,
    "writing": false,
    "name": "Opp Ident & Eval",
    "fullname": "Opportunity Identification and Evaluation",
    "info": "Developing the ability to spot, select, and evaluate business opportunities for new firm startups and corporate ventures. Core concepts, models, guidelines. Acquisiton of practical knowledge/skill through direct observation, interaction, and practice.\n\nprereq: MBA student",
    "prereq": {}
  },
  {
    "uid": "016530",
    "code": "ENTR6021",
    "subject": "ENTR",
    "number": "6021",
    "honors": false,
    "writing": false,
    "name": "Developing New Ventures",
    "fullname": "Developing New Ventures",
    "info": "This seven-week course is for students interested in learning how to design and pitch a new venture (ventures can include for-profit startups, nonprofit startups, or internal corporate product/service development initiatives).  Students work in teams to develop and write a business proposal for their “own” venture and consider the practical aspects associated with securing buy-in. Students will engage in all aspects of the proposal development process including designing, testing, validating, pitching, advancing/defending, iterating, and effectively implementing the proposal.  Students will also have the opportunity to observe, analyze, and learn from the development and implementation efforts of others.\n\n",
    "prereq": {}
  },
  {
    "uid": "016531",
    "code": "ENTR6022",
    "subject": "ENTR",
    "number": "6022",
    "honors": false,
    "writing": false,
    "name": "Imp, Business Plan",
    "fullname": "Implementing the Business Plan",
    "info": "An independent study course. Students work individually, under direction of instructor, implementing business plans developed in 6021.",
    "prereq": {}
  },
  {
    "uid": "016533",
    "code": "ENTR6023",
    "subject": "ENTR",
    "number": "6023",
    "honors": false,
    "writing": false,
    "name": "Fin Business Vent",
    "fullname": "Financing Business Ventures",
    "info": "This course in entrepreneurship focuses on the financial aspects of new business ventures. Topics covered in the course include:\nHow to (and how not to) Write a Funding Pitch,\nThe Landscape of Entrepreneurial Finance, \nBootstrapping,\nGetting Started with FFF and OPM,\nCreative Financing via Success Payments and Gainsharing,\nRollups and Building Towards Exit via Acquisition, and \nRaising Serious Money via Venture Capital and Private Placements\n\nprereq: MBA student",
    "prereq": {}
  },
  {
    "uid": "016529",
    "code": "ENTR6025",
    "subject": "ENTR",
    "number": "6025",
    "honors": false,
    "writing": false,
    "name": "Intro to Entrepreneurship",
    "fullname": "Introduction to Entrepreneurship",
    "info": "The course helps students develop insights on starting and sustaining a successful venture. The course focus is on opportunity identification and evaluation: Where do new venture ideas come from? How do you recognize a good business idea? How can a so-so idea be improved to be a good opportunity? Students will focus on five characteristics of a good entrepreneurial opportunity: Creating significant customer value, profit potential, profit durability, founder and team fit, and amenability to financing.\n\nprereq: MBA or Mgmt Sci MBA student",
    "prereq": {}
  },
  {
    "uid": "016535",
    "code": "ENTR6030",
    "subject": "ENTR",
    "number": "6030",
    "honors": false,
    "writing": false,
    "name": "Business Growth",
    "fullname": "Managing Business Growth",
    "info": "Opportunities/challenges of growing individual businesses/multi-business organizations. Elements of growth strategy for emerging/established businesses. Planning, implementing, and auditing growth strategies.  Attracting/deploying resources to fuel/facilitate growth. Models of business growth, factors affecting growth. Cases, exercises, group projects, guest speakers.",
    "prereq": {}
  },
  {
    "uid": "791215",
    "code": "ENTR6036",
    "subject": "ENTR",
    "number": "6036",
    "honors": false,
    "writing": false,
    "name": "Managing the Growing Business",
    "fullname": "Managing the Growing Business",
    "info": "Challenges posed by rapid growth/change in independent startups. Infrastructure development, radical changes in strategy, continuous needs for substantial additional resources. Emphasizes analysis of factors accelerating/impeding growth and review/creation of growth strategies. Integration of concepts from strategy, operations, marketing, finance, and human resource management.\n\nprereq: MBA or Mgmt Sci MBA student",
    "prereq": {}
  },
  {
    "uid": "791191",
    "code": "ENTR6037",
    "subject": "ENTR",
    "number": "6037",
    "honors": false,
    "writing": false,
    "name": "Corporate Venturing",
    "fullname": "Corporate Venturing",
    "info": "Entrepreneurial role of top management in maintaining/increasing stakeholder value through formation/acquisition of new businesses, products, or markets within established corporations. Strategic role of corporate venturing. Cases, guest speakers, group projects. \n\nprereq: MBA or Mgmt Sci MBA student",
    "prereq": {}
  },
  {
    "uid": "016536",
    "code": "ENTR6041",
    "subject": "ENTR",
    "number": "6041",
    "honors": false,
    "writing": false,
    "name": "Initiating New Product Design",
    "fullname": "Initiating New Product Design and Business Development",
    "info": "In this course students work on product development projects sponsored by client companies and/or entrepreneurs. Projects run all year, but students may enroll for either or both terms. Coursework includes a series of assignments concerned with identifying, researching, and specifying the market and technical parameters for a new product. Assignments feed into a series of deliverables that are presented to the client. Market research emphasizes interviews with prospective customers and experts as well as business model development. Technical solutions are developed through rapid prototyping and concept rendering. Project work iterates between attention to market and technical considerations. Fall & Spring terms offer similar content, although project scope narrows in the Spring term.\n\nprereq: MBA student or non-MBA with instructor + MBA program permission.\nOld:",
    "prereq": {}
  },
  {
    "uid": "812954",
    "code": "ENTR6042",
    "subject": "ENTR",
    "number": "6042",
    "honors": false,
    "writing": false,
    "name": "Implementing NewProduct Design",
    "fullname": "Implementing New Product Design and Business Development",
    "info": "Implementation of product development projects begun in the Fall term in Entr 6041. In this course students work on product development projects sponsored by client companies and/or entrepreneurs. Projects run all year, but students may enroll for either or both terms. Coursework includes a series of assignments concerned with identifying, researching, and specifying the market and technical parameters for a new product. Assignments feed into a series of deliverables that are presented to the client. Market research emphasizes interviews with prospective customers and experts as well as business model development. Technical solutions are developed through rapid prototyping and concept rendering. Project work iterates between attention to market and technical considerations. Fall & Spring terms offer similar content, although project scope narrows in the Spring term.\n\nprereq: MBA student or non-MBA with instructor + MBA program permission. ",
    "prereq": {}
  },
  {
    "uid": "794666",
    "code": "ENTR6080",
    "subject": "ENTR",
    "number": "6080",
    "honors": false,
    "writing": false,
    "name": "Technology Commercialization",
    "fullname": "Technology Commercialization for Scientists and Engineers",
    "info": "Theoretical knowledge and real-world examples of skills/knowledge required to commercialize scientific discoveries/engineering inventions. Commercializing technology process, including starting/running a new company.\n\nprereq: Registered Ph.D. student in [IT or College of Biological Sciences or College of Agriculture, Food and Environmental Sciences or Medical School], instr consent",
    "prereq": {}
  },
  {
    "uid": "014181",
    "code": "ENTR6082",
    "subject": "ENTR",
    "number": "6082",
    "honors": false,
    "writing": false,
    "name": "Business Formation",
    "fullname": "Business Formation: Opportunity Identification and Resource Assembly",
    "info": "Business formation from concept development through startup. Opportunity identification and qualification. Business concept, plan, forecast, budget. Resource markets and resource assembly. Problems/opportunities from concept stage through establishment of viable business. Cases, exercises, projects, speakers.\n\nprereq: CSOM grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "014182",
    "code": "ENTR6083",
    "subject": "ENTR",
    "number": "6083",
    "honors": false,
    "writing": false,
    "name": "Business Growth",
    "fullname": "Managing Business Growth",
    "info": "Opportunities and challenges of growing individual businesses and multi-business organizations. Elements and growth strategy for emerging and established businesses. Planning, implementing and auditing growth strategies. Attracting resources for growth. Models of business growth, factors affecting growth.\n\nprereq: CSOM grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "014183",
    "code": "ENTR6087",
    "subject": "ENTR",
    "number": "6087",
    "honors": false,
    "writing": false,
    "name": "New Prod/Bus Dev",
    "fullname": "New Product Design and Business Development",
    "info": "Nine month project course in designing new products and business plans through prototype stage. Teams of CSOM and CSE students work with personnel from sponsoring organizations. Weekly lectures and team meetings. Formal design reviews and presentations.\n\nprereq: Grad student in CSOM or CSE or instr consent",
    "prereq": {}
  },
  {
    "uid": "014185",
    "code": "ENTR6089",
    "subject": "ENTR",
    "number": "6089",
    "honors": false,
    "writing": false,
    "name": "Entr: Rsch Seminar",
    "fullname": "Research Seminar in Entrepreneurial Studies",
    "info": "Research into populations of individual new and growing businesses. Evaluation of existing studies, development of research questions; selection of research methods, information collection and analysis. Final report suitable for publication.\n\nprereq: CSOM grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "014186",
    "code": "ENTR6090",
    "subject": "ENTR",
    "number": "6090",
    "honors": false,
    "writing": false,
    "name": "Topics",
    "fullname": "Topics in Entrepreneurship",
    "info": "Selected topics in value creation; in business formation, growth, restructuring; in social and economic impact of new businesses, and entrepreneurship and public policy.\n\nprereq: CSOM grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "787804",
    "code": "ENTR6095",
    "subject": "ENTR",
    "number": "6095",
    "honors": false,
    "writing": false,
    "name": "Topics in Entrepreneurship",
    "fullname": "Topics in Entrepreneurship",
    "info": "Students work individually, under direction of instructor, on research projects involving issues of commercialization of technologies generated by University scientists, available at Office of Research and Technology Transfer Administration (ORTTA).\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "791228",
    "code": "ENTR6500",
    "subject": "ENTR",
    "number": "6500",
    "honors": false,
    "writing": false,
    "name": "New Bs Dev Enterprise",
    "fullname": "New Business Development Enterprise",
    "info": "Theoretical/real-world experience analyzing/developing new business opportunities. Students conduct \"due diligence\" activities, assess prospects of a business opportunity, and make recommendations to a governing board. Students are involved in detailed operations, including financial reporting, investor relations, investor solicitation, performance evaluation, marketing and sales, and operations. Two-semester course.",
    "prereq": {}
  },
  {
    "uid": "016537",
    "code": "ENTR6995",
    "subject": "ENTR",
    "number": "6995",
    "honors": false,
    "writing": false,
    "name": "Dir Study,Tech Tsfr",
    "fullname": "Directed Study in Technology Transfer",
    "info": "Students work individually, under direction of instructor, on research projects involving the issues of commercialization of technologies generated by University scientists and available at the Office of Research and Technology Transfer Administration (ORTTA).",
    "prereq": {}
  }
]