[
  {
    "uid": "817235",
    "code": "FDSY1016W",
    "subject": "FDSY",
    "number": "1016",
    "honors": false,
    "writing": true,
    "name": "Urban Ag in the Twin Cities",
    "fullname": "Growing Food & Building Community: Urban Agriculture in the Twin Cities",
    "info": "The capacity and support for urban agriculture is expanding globally. It is estimated that 25-30% of urban dwellers worldwide are involved in agriculture. In the future, we can expect that more of our food will be grown in urban centers. Urban farms and food businesses, food hubs, neighborhood community gardens, schoolyard and residential gardens are all part of the current urban food movement. As the first year colloquium for food systems majors, this course will integrate academic and orientation learning objectives and allow students to gain practice in systems thinking-- exhibited through in-class discussion and writing-- using urban agriculture as a framework. In this course, we will evaluate the direct and indirect benefits and challenges of urban agriculture by looking through environmental, political and social lenses. Class field trips and a service learning activity are used to demonstrate the various ways food is grown and how food may be used as a vehicle to achieve social goals. We will discuss a broad array of topics including horticultural production practices, soil health and environmental sustainability issues, social justice and food access, and public policy and regulations constraining urban farms, with an emphasis on the Minneapolis/St. Paul metro area. Students in this course will deepen their understanding of the complexity of urban food systems, while also recognize social differences of race, ethnicity and class; improve intercultural competence skills as a foundation for positive cross-cultural relationships; and gain an awareness of how urban agriculture can be a force for change.",
    "prereq": {}
  },
  {
    "uid": "815836",
    "code": "FDSY1901",
    "subject": "FDSY",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "815837",
    "code": "FDSY1902",
    "subject": "FDSY",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics vary.",
    "prereq": {}
  },
  {
    "uid": "817897",
    "code": "FDSY1903",
    "subject": "FDSY",
    "number": "1903",
    "honors": false,
    "writing": false,
    "name": "Guide to the Food System",
    "fullname": "An Eater's Guide to the Food System",
    "info": "In this course we will explore the plants that are the basis for our food system and how natural and human forces influence their abundance and quality. We will highlight sustainability through evaluation of environmental, economic, and social impacts on the food system and how consumers can effect change. Coursework will include assigned readings, discovery of new information shared with the class through written reviews and oral summaries, discussions, and hands-on plant growth and food production activities.",
    "prereq": {}
  },
  {
    "uid": "809738",
    "code": "FDSY2101",
    "subject": "FDSY",
    "number": "2101",
    "honors": false,
    "writing": false,
    "name": "Plant Production Systems",
    "fullname": "Plant Production Systems",
    "info": "How food production systems fit within overall food system. Fundamentals of soils, plant nutrition, plant production metabolites as they affect food production systems. Decisions that differentiate among conventional sustainable/organic systems.\n\nprereq: BIOL 1001 or BIOL 1009 or HORT 1001 or instr consent",
    "prereq": {
      "or": [
        "005419",
        "005416",
        "007885"
      ]
    }
  },
  {
    "uid": "811038",
    "code": "FDSY2102",
    "subject": "FDSY",
    "number": "2102",
    "honors": false,
    "writing": false,
    "name": "Agricultural Prod Systems",
    "fullname": "Diversity of Agricultural Production Systems",
    "info": "Examination of agricultural production systems, including organic, alternative, and conventional systems. History of production systems and their implications for producer lifestyles, social and natural environments, and economics at local to global scales.  Includes farm visits, producer interviews, group projects, and classroom presentations and debates in addition to lectures and readings. This multidisciplinary course is offered at the University of Minnesota-St. Paul campus, West Central Research and Outreach Center and the University of Minnesota-Morris campus.",
    "prereq": {}
  },
  {
    "uid": "819517",
    "code": "FDSY3093",
    "subject": "FDSY",
    "number": "3093",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nprereq: instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "819518",
    "code": "FDSY3094",
    "subject": "FDSY",
    "number": "3094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use the University-wide on-line directed research contract process in order to enroll.\n \nprereq: Instructor consent required. No more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "809739",
    "code": "FDSY4101",
    "subject": "FDSY",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Improving Food Systems Sustain",
    "fullname": "Holistic Approaches to Improving Food Systems Sustainability",
    "info": "Students in this capstone course address food system sustainability challenges both in the classroom and via service-learning, where they spend 45 hours engaged with a food justice-based community organization. Requires off-campus work at the community partner site. \n\nPrerequisites: FDSY 1016W and APEC 3202; or instructor consent",
    "prereq": {}
  }
]