[
  {
    "uid": "808380",
    "code": "FINA1905",
    "subject": "FINA",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary. See Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "016415",
    "code": "FINA3000",
    "subject": "FINA",
    "number": "3000",
    "honors": false,
    "writing": false,
    "name": "Fin Fundamentals",
    "fullname": "Finance Fundamentals",
    "info": "Introduction to financial management principles.  Money/capital markets, risk/return/valuation triad, capital budgeting, capital structure/financial leverage, cost of capital, financial performance measures, dividend policy, working-capital managment, international financial management/derivatives.",
    "prereq": {}
  },
  {
    "uid": "013118",
    "code": "FINA3001",
    "subject": "FINA",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Finance Fundamentals",
    "fullname": "Finance Fundamentals",
    "info": "Students will learn how competition for capital in Capital Markets establishes metrics and measures used to understand financial performance of the firm. The course introduces the finance view of the firm and the application of value creation principles to firm decision making. The course presents the centrality of cash flows, the theoretical foundations for Time Value of Money, decision tools for investment of capital, basic valuation of stocks and bonds, and the theoretical foundations for the impact of risk on the required return on investor capital.\n\nprereq: ACCT 2050 or ACCT 2051 or ACCT 2051H; SCO 2550 or BA 2551 or equivalent statistics course",
    "prereq": {
      "or": [
        "013103",
        "013805"
      ]
    }
  },
  {
    "uid": "016682",
    "code": "FINA3111",
    "subject": "FINA",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Finance Fundamentals",
    "fullname": "Finance Fundamentals",
    "info": "Introduction to financial management principles. Securities markets, time value of money, applied valuation for stocks/bonds, capital budgeting basics, net present value, risk/return, cost of capital, financial leverage.",
    "prereq": {}
  },
  {
    "uid": "013653",
    "code": "FINA4121",
    "subject": "FINA",
    "number": "4121",
    "honors": false,
    "writing": false,
    "name": "Financial Markets",
    "fullname": "Financial Markets and Interest Rates",
    "info": "This course provides a framework to understand how financial markets operate and how they establish the cost of capital demanded by investors through market interest rates. Course presents valuation models for bonds, the impact of the Federal Reserve on the level and term structure of interest rates, measures of interest rate risk, financing markets for securities and how these define the pricing of futures and forward contracts. \n\nprereq: FINA 3001 or FINA 3001H; CSOM mjr or NONM or Management minor or Math/Actuarial Science major. ",
    "prereq": {
      "or": [
        "013118"
      ]
    }
  },
  {
    "uid": "013654",
    "code": "FINA4122",
    "subject": "FINA",
    "number": "4122",
    "honors": false,
    "writing": false,
    "name": "Banks, Banking Srvcs & Fintech",
    "fullname": "Banks, Banking Services, and FinTech",
    "info": "This course examines the traditional economic functions of commercial banks, especially lending, savings and liquidity provision, and payment services. For each function, we will address key business risks, policy concerns, and the impact of competition both from traditional nonbank financial institutions and from “fintechs” seeking to leverage new information technology. \n\nprereq: FINA 3001 or FINA 3001H; CSOM mjr or NONM or Math/Actuarial Science major",
    "prereq": {
      "or": [
        "013118"
      ]
    }
  },
  {
    "uid": "826575",
    "code": "FINA4125",
    "subject": "FINA",
    "number": "4125",
    "honors": false,
    "writing": false,
    "name": "Blockchain, Cryptocurrencies",
    "fullname": "Blockchain, Cryptocurrencies & their Applications in Finance",
    "info": "If you have been following the popular press you know about Bitcoin, Ethereum, NFTs, and possibly ICOs. You have heard about blockchain and distributed ledgers. You might not know that the number of cryptocurrencies is fast increasing and might soon be about 1000 of them. Depending on that day’s price, there might be a 100 cryptos with a notional market cap above one billion and about 15 above 10 billion. You will learn that cryptocurrencies are extremely volatile. Is it all hype or this the shape of our future? Will this be another Tulip craze? How will they effect regular commerce? Are they just digital gold? How will governments step in to regulate them? Will Governments issue their own Digicoins?\nIn this course, we will not be able to answer all the above questions. However, you will gain a basic understanding of the new technology that is based on cryptography. We will discuss what it provides and where it is still lacking. We will revisit the role of money and what makes a currency successful. We will then examine the properties of cryptocurrencies and ask what it would take for them to be a store of value and/or a medium of exchange. To do this we will start with some fundamental concepts from cryptography that would allow you to understand the technology beyond some stretched analogies. We will discuss the economics of these currencies and the regulatory issues facing governments. We will then delve into the use cases: Primary markets (ICOs & venture capital), secondary markets and exchanges, smart contracts, and potentially settlement activities in clearing houses.\n\nprereq: FINA 3001 or FINA 3001H or APEC 3501; CSOM mjr or Math mjr or NONM",
    "prereq": {
      "or": [
        "013118",
        "006676"
      ]
    }
  },
  {
    "uid": "802591",
    "code": "FINA4221",
    "subject": "FINA",
    "number": "4221",
    "honors": false,
    "writing": false,
    "name": "Principle of Corporate Finance",
    "fullname": "Principles of Corporate Finance",
    "info": "This course evaluates how the financing choices the firm makes influence the creation of firm value and allocation of firm risks among investors.  Course presents the debt vs. equity trade-off, tax effects of financing, dividend vs. share repurchases, and the impact on managerial incentives and agency problems. \n\nprereq: FINA 3001 or FINA 3001H; CSOM mjr or NONM or Management minor or Math/Actuarial Science major.",
    "prereq": {
      "or": [
        "013118"
      ]
    }
  },
  {
    "uid": "809515",
    "code": "FINA4224",
    "subject": "FINA",
    "number": "4224",
    "honors": false,
    "writing": false,
    "name": "Real Options",
    "fullname": "Real Options: Valuing Strategic Flexibility",
    "info": "Financial options developed in derivatives course. How to apply them to some corporate settings where traditional DCF analysis cannot capture value of flexibility in project.\n\nprereq: 4422, 4522",
    "prereq": {
      "and": [
        "802598",
        "802589"
      ]
    }
  },
  {
    "uid": "802592",
    "code": "FINA4229",
    "subject": "FINA",
    "number": "4229",
    "honors": false,
    "writing": false,
    "name": "Corporate Cases Capstone",
    "fullname": "Corporate Cases Capstone",
    "info": "Cases of corporate investment decisions. Making capital budgeting decisions, targeting/evaluating firm performance.",
    "prereq": {}
  },
  {
    "uid": "819003",
    "code": "FINA4234",
    "subject": "FINA",
    "number": "4234",
    "honors": false,
    "writing": false,
    "name": "Mergers and Acq - In Action",
    "fullname": "Mergers and Acquisitions In Action – Process and Valuation",
    "info": "This action-based course will explore in an experiential way the methodology corporate managers employ and invest capital to achieve growth and a return to its shareholders through mergers and acquisitions. Starting with the strategic rationale and ending with the challenges of integration, this course will focus on the process used for identifying M&A targets and the methods used in practice to value these transactions. The objectives of the course will be to leverage skills mastered in the core curriculum: finance, marketing, accounting, and operations and other related courses that will help you in this class.  \nPrerequisite: Fina 4422 or 5322",
    "prereq": {}
  },
  {
    "uid": "013659",
    "code": "FINA4241",
    "subject": "FINA",
    "number": "4241",
    "honors": false,
    "writing": false,
    "name": "Corporate Financing",
    "fullname": "Corporate Financing Decisions",
    "info": "Theoretical/applied understanding of corporate financial decisions. Efficient markets, financial decisions, tax effects, managerial incentives, investment banking, effect of financing issues on investment decisions, basic options.",
    "prereq": {}
  },
  {
    "uid": "013658",
    "code": "FINA4242W",
    "subject": "FINA",
    "number": "4242",
    "honors": false,
    "writing": true,
    "name": "Corporate Investment Decisions",
    "fullname": "Corporate Investment Decisions",
    "info": "This case-based course provides the student with an opportunity to apply the concepts from previous finance coursework to a variety of decisions a firm would face when allocating capital to investment decisions. The focus is weighted toward combining the theory with the practice of valuation of investment opportunities through the use of group cases to give the student a sense of the strengths and weaknesses of such analysis. The course presents firm performance measurement metrics, APV & WACC based valuation, working capital management, making capital budgeting decisions, financial distress and capital structure, real options, and mergers and acquisitions. \n\nprereq: FINA 4121, 4321, 4422 or 5322, 4522, and CSOM major",
    "prereq": {
      "or": [
        "013653",
        "013656",
        "802598",
        "826255",
        "802589"
      ]
    }
  },
  {
    "uid": "013656",
    "code": "FINA4321",
    "subject": "FINA",
    "number": "4321",
    "honors": false,
    "writing": false,
    "name": "Portfolio Management",
    "fullname": "Portfolio Management and Performance Evaluation",
    "info": "This course uses statistics to demonstrate how the construction of portfolios of individual securities impacts the risk return trade-off for investors through diversification. Course presents models of pricing investor risk, impact of asset allocation on returns, active versus indexed portfolio management, and approaches to measure value added performance of investment portfolios.\n\nprereq:  FINA 3001 or FINA 3001H; CSOM mjr or NONM or Management minor",
    "prereq": {
      "or": [
        "013118"
      ]
    }
  },
  {
    "uid": "013657",
    "code": "FINA4322",
    "subject": "FINA",
    "number": "4322",
    "honors": false,
    "writing": false,
    "name": "Security Analysis",
    "fullname": "Security Analysis",
    "info": "Valuation of equity securities. Basic valuation principles. Relationships between various valuation approaches. Develops/applies tools for self-designed security selection rules.",
    "prereq": {}
  },
  {
    "uid": "809513",
    "code": "FINA4325",
    "subject": "FINA",
    "number": "4325",
    "honors": false,
    "writing": false,
    "name": "Behavioral Finance",
    "fullname": "Behavioral Finance",
    "info": "This course introduces students to how the application of psychology and realistic settings to guide and develop the alternative theories of financial market complements the traditional theoretical finance paradigm.  The student will use the insights of behavioral finance to shed light on trading patterns, behavior of asset prices, corporate finance and various other financial topics.\n\nprereq: 4321 or 4321H",
    "prereq": {
      "or": [
        "013656"
      ]
    }
  },
  {
    "uid": "802593",
    "code": "FINA4329",
    "subject": "FINA",
    "number": "4329",
    "honors": false,
    "writing": false,
    "name": "Security Analysis Capstone",
    "fullname": "Security Analysis Capstone",
    "info": "Valuation of equity securities. Principles. Relationship between various valuation approaches. Tools to test self-designed security selection rules.\n\nprereq: FINA 4121 or 4121H, 4321 or 4321H, 4422 or 5322, 4522, ACCT 5100 or ACCT 5101",
    "prereq": {
      "or": [
        "013653",
        "013656",
        "802598",
        "826255",
        "802589",
        "013961",
        "013815"
      ]
    }
  },
  {
    "uid": "802598",
    "code": "FINA4422",
    "subject": "FINA",
    "number": "4422",
    "honors": false,
    "writing": false,
    "name": "Financial Modeling",
    "fullname": "Financial Modeling",
    "info": "This applied course builds on principles from the prerequisite courses and provides students with significant practice building financial models to identify the free cash flow from and required investment in projects or firms for discounted cash flow and sensitivity analysis. Course presents net operating working capital requirements, Valuation with Free Cash Flow based methods, and the construction of three statement pro-forma cash flow projections.  \n\nprereq: Fina 4221 (can be concurrent),  Acct 5101 (can be concurrent), CSOM major",
    "prereq": {
      "or": [
        "802591",
        "013815"
      ]
    }
  },
  {
    "uid": "802589",
    "code": "FINA4522",
    "subject": "FINA",
    "number": "4522",
    "honors": false,
    "writing": false,
    "name": "Options & Derivatives I",
    "fullname": "Options & Derivatives I",
    "info": "This course provides a comprehensive introduction to derivative contracts and their pay-offs and basic pricing and how they are used to manage risk or speculate in financial markets. Course presents forward and futures contracts, option contracts, and swap contracts.\n\nprereq: CSOM mjr; FINA 3001 or FINA 3001H or APEC 3501; FINA 4121 or FINA 4121H; FINA 4321 or FINA 4321H",
    "prereq": {
      "or": [
        "013118",
        "006676",
        "013653",
        "013656"
      ]
    }
  },
  {
    "uid": "802594",
    "code": "FINA4523",
    "subject": "FINA",
    "number": "4523",
    "honors": false,
    "writing": false,
    "name": "Derivatives I",
    "fullname": "Derivatives I",
    "info": "Forwards/futures, options, swaps. Markets these derivatives trade in, their valuation, how they are used to speculate/manage risk in financial markets. Multi-period binomial model.",
    "prereq": {}
  },
  {
    "uid": "802595",
    "code": "FINA4529",
    "subject": "FINA",
    "number": "4529",
    "honors": false,
    "writing": false,
    "name": "Derivatives II Capstone",
    "fullname": "Derivatives II Capstone",
    "info": "Quantitatively advanced material such as Black-Scholes model for valuing option sensitivities (the Greeks). Value-at-risk methods. Valuation/uses of credit derivatives such as default swaps/collateralized debt obligations.\n\nprereq: FINA 4522",
    "prereq": {
      "and": [
        "802589"
      ]
    }
  },
  {
    "uid": "013655",
    "code": "FINA4541",
    "subject": "FINA",
    "number": "4541",
    "honors": false,
    "writing": false,
    "name": "Futures, Options",
    "fullname": "Futures, Options, and Other Derivative Securities",
    "info": "Foundations of stochastic cash flow representations, construction portfolios of futures/options, basic methods for valuing real/financial futures, swaps, options.",
    "prereq": {}
  },
  {
    "uid": "802614",
    "code": "FINA4621",
    "subject": "FINA",
    "number": "4621",
    "honors": false,
    "writing": false,
    "name": "The Global Economy (Macro)",
    "fullname": "The Global Economy (Macro)",
    "info": "The course is intended to help you develop a global perspective on the economy. You will\ndevelop a set of skills and concepts that will permit you to understand and to analyze the foundations of the economy at large. We want to understand the main drivers of economic growth over time and across countries. Key skills and conceptual take-aways from this course:\n1. Explain how an economy, firms, labor, and finance fit together.\n2. Able to use the Solow and Romer growth models: i) to understand long term growth, ii) to\npredict shock effects, iii) to measure TFP iv) to examine GDP differences across countries\n3. Understand labor market using supply and demand, and using the bathtub model\n4. Able to analytically derive the classical gains from free trade. Understand key benefits and\ndrawbacks to globalization.\nThe lectures are structured as Foundations, Growth, Labor, Globalization. We start by setting up a foundation that stresses the fact that things have to fit together coherently. We need to be careful about how we measure things. The role of firms and financial markets are frequently\nmisunderstood so we devote special effort to why these exist and what role they play.\n\nNext we turn to the overall evolution of the economy – sometimes called mega-trends. People open underestimate the amount of economic variation from one decade to the next and hence may not adequately prepare. A key purpose of this course is to help you understand key\ndrivers of economic growth, and the wealth difference across time and between countries. This will provide context for you to think about some potentially forthcoming major changes.  The role of labor deserves special attention since it connects directly to human beings. The\ntreatment of, and returns to labor are critical to human welfare. We will consider the labor market in general, unemployment, and inequality both within and across countries.\n\nFinally we will examine the role of globalization and international trade. We will formally develop the classical gains from free trade. We will also discuss the reasons for controversies surrounding trade and globalization.\n\nprereq: 3001 or 3001H, CSOM major or Math major/Act Sci, or Management minor.",
    "prereq": {
      "or": [
        "013118"
      ]
    }
  },
  {
    "uid": "802596",
    "code": "FINA4622",
    "subject": "FINA",
    "number": "4622",
    "honors": false,
    "writing": false,
    "name": "International Finance",
    "fullname": "International Finance",
    "info": "This course provides the student with an understanding of the nature and purposes of financial management in the international context for multinational enterprises and skills in international investment, financing techniques and exchange rate risks.  The student will examine barriers to international capital flows and some of the tools used to overcome these barriers. The course presents cost of capital in emerging economies and currency risk management.\n\nprereq: CSOM major, Fina 3001 or 3001H, 4121 or 4121H, 4221",
    "prereq": {
      "or": [
        "013118",
        "013653",
        "802591"
      ]
    }
  },
  {
    "uid": "013660",
    "code": "FINA4641",
    "subject": "FINA",
    "number": "4641",
    "honors": false,
    "writing": false,
    "name": "International Finance",
    "fullname": "International Finance and Risk Managment",
    "info": "Introduction to international dimensions of corporate financing, investment, risk management decisions. Foreign exchange markets, international financial systems, foreign exchange rate determination, measuring/managing currency risk, multinational capital budgeting, cost of capital in emerging economies.",
    "prereq": {}
  },
  {
    "uid": "802590",
    "code": "FINA4920",
    "subject": "FINA",
    "number": "4920",
    "honors": false,
    "writing": false,
    "name": "Finance Topics",
    "fullname": "FinanceTopics",
    "info": "Discussion and analysis of current topics and developments in Finance.",
    "prereq": {}
  },
  {
    "uid": "819482",
    "code": "FINA5125",
    "subject": "FINA",
    "number": "5125",
    "honors": false,
    "writing": false,
    "name": "Cryptocurrency, Blockchain",
    "fullname": "Cryptocurrency, Blockchain, and Their Business Applications",
    "info": "This course discusses cryptocurrencies (including Bitcoin, Ethereum, and others), blockchain, also referred to as distributed ledger technology (DLT), and their applications in various business sectors. The course first explains the history of cryptocurrency and the fundamentals of blockchain including cryptography and consensus mechanism. Although technical, this part is essential to establish a foundation to understand cryptocurrencies and blockchain. The rest of the course is on the applications of blockchain. We will discuss enterprise blockchain, smart contracts, and token offerings, e.g., initial coin offerings (ICOs) and securities token offering (STOs). We will have industry experts to give guest lectures on the realworld blockchain applications and interact with students. Finally, we will cover the valuation models for cryptoassets, the practical details of how to use cryptocurrency, and various investments related to blockchain. The goal of the course is to provide students with a basic set of skills to understand cryptocurrencies and blockchain and how businesses can use them. ",
    "prereq": {}
  },
  {
    "uid": "826255",
    "code": "FINA5322",
    "subject": "FINA",
    "number": "5322",
    "honors": false,
    "writing": false,
    "name": "Financial Modeling",
    "fullname": "Financial Modeling",
    "info": "Financial modeling tools to access financial data warehouses to build, estimate, maintain, and interpret comprehensive financial models that provide the framework for understanding businesses and their historical performance, plans/strategies, and market values. Financial analytics/modeling skills, including data mining of large standard financial databases (warehouses) (e.g. Capital IQ), and a manageable introduction to Excel VBA programming.\n\nprereq: FINA 3001 and admittance to Carlson Funds Enterprise",
    "prereq": {
      "and": [
        "013118"
      ]
    }
  },
  {
    "uid": "827159",
    "code": "FINA5323",
    "subject": "FINA",
    "number": "5323",
    "honors": false,
    "writing": false,
    "name": "Advanced Financial Modeling",
    "fullname": "Advanced Financial Modeling",
    "info": "This course builds the advanced financial modeling tools needed to build, operate, and understand the standard performance analysis,\nvaluation analysis, credit analysis, and M&A and LBO models that have become central to modern financial analysts.\n\nprereq: FINA 5322 and admittance to the Carlson Funds Enterprise",
    "prereq": {
      "and": [
        "826255"
      ]
    }
  },
  {
    "uid": "816785",
    "code": "FINA5422",
    "subject": "FINA",
    "number": "5422",
    "honors": false,
    "writing": false,
    "name": "Financial Econometrics I",
    "fullname": "Financial Econometrics and Computational Methods I",
    "info": "This course provides an introduction to the methods used in empirical finance. A review of statistics is followed by intensive instruction on matrix algebra that culminates in a fundamental understanding of linear regression, the basic empirical tool. Asset pricing theories are discussed and developed and then methods are derived to test them. The course will emphasize estimation and inference using computer-based applications.",
    "prereq": {}
  },
  {
    "uid": "816786",
    "code": "FINA5423",
    "subject": "FINA",
    "number": "5423",
    "honors": false,
    "writing": false,
    "name": "Financial Econometrics II",
    "fullname": "Financial Econometrics and Computational Methods II",
    "info": "This course builds on Financial Econometrics I and provides instruction on the econometrics used in empirical finance. Topics will include time series analysis, parametric models of volatility, evaluation of asset pricing theories, and models for risk management. The course will emphasize estimation and inference using computer-based applications.",
    "prereq": {}
  },
  {
    "uid": "818412",
    "code": "FINA5529",
    "subject": "FINA",
    "number": "5529",
    "honors": false,
    "writing": false,
    "name": "Derivatives II",
    "fullname": "Derivatives II",
    "info": "This course begins with a discussion of advanced derivative hedging techniques and proceeds to the economics and mechanics of advanced derivative securities, including interest rate derivatives, swaps, Asian options, and barrier options. The second phase of the course investigates mathematical techniques for stochastic and dynamic modeling of asset prices and derivative security values. Students must use these statistical modeling techniques and advanced programming software (Matlab, Python, R, etc) in a group project to price path dependent securities such as American style options.\n ",
    "prereq": {}
  },
  {
    "uid": "818413",
    "code": "FINA5920",
    "subject": "FINA",
    "number": "5920",
    "honors": false,
    "writing": false,
    "name": "Finance Topic",
    "fullname": "Finance Topic",
    "info": "Discussion and analysis of current topics and developments in Finance.\n ",
    "prereq": {}
  },
  {
    "uid": "825157",
    "code": "FINA6111",
    "subject": "FINA",
    "number": "6111",
    "honors": false,
    "writing": false,
    "name": "Financing;  Firm’s Lifecycle",
    "fullname": "Financing over a Firm’s Lifecycle",
    "info": " All companies—from small startups to large public companies—require funding in order to operate. This course provides an overview of the various sources of financing that a company can access throughout the different stages of its life, including debt and equity financing, Venture Capital, Private Equity, Initial Public Offerings, and others.\n\nprereq: MBA 6231 (previously MBA 6230)",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "825159",
    "code": "FINA6112",
    "subject": "FINA",
    "number": "6112",
    "honors": false,
    "writing": false,
    "name": "Private Equity",
    "fullname": "Private Equity",
    "info": "Private equity has emerged as an important force in our financial markets. This course will explore current issues and best practices ranging from early-stage financing with angel investors and Venture Capital to late-stage ?take-private? transactions such as leveraged buyouts.  ",
    "prereq": {}
  },
  {
    "uid": "825160",
    "code": "FINA6113",
    "subject": "FINA",
    "number": "6113",
    "honors": false,
    "writing": false,
    "name": "Public Equity",
    "fullname": "Public Equity",
    "info": "Early-stage financing is a critical success factor for growing businesses. This course will explore current issues and best practices for financing with public equity. Topics will include Initial Public Offerings (IPOs), Direct Listings and Special Purpose Acquisition Companies (SPAC), or Blank-check companies.",
    "prereq": {}
  },
  {
    "uid": "826742",
    "code": "FINA6114",
    "subject": "FINA",
    "number": "6114",
    "honors": false,
    "writing": false,
    "name": "Private & Public Equity Finan.",
    "fullname": "Private and Public Equity Financing",
    "info": "Financing is a critical success factor for growing businesses. We will follow the life cycle of a firm to discuss financing at different stages. This course will explore current issues and best practices for private and public equity ranging from early-stage financing with angel investors and Venture Capital to late stage “take-private” transactions such as leveraged buyouts. We will also explore topics including Initial Public Offerings (IPOs), Direct Listings, Special Purpose Acquisition Companies (SPACs) or “blank-check” companies and Seasoned Equity Offerings (SEOs). The course will utilize a combination of learning techniques including guest speakers, lectures, in class exercises and case studies.\n\nThis course was created to combine Fina 6112 and Fina 6113.",
    "prereq": {}
  },
  {
    "uid": "013661",
    "code": "FINA6121",
    "subject": "FINA",
    "number": "6121",
    "honors": false,
    "writing": false,
    "name": "Debt Markets",
    "fullname": "Debt Markets, Interest Rates, and Hedging",
    "info": "This class introduces the tools and concepts needed to analyze fixed income securities. Topics include the pricing and hedging of fixed-rate Treasuries, floating rate bonds, bonds with embedded options, defaultable bonds, mortgage-backed securities and their derivatives, inflation-indexed bonds, duration analysis, and the Federal Reserve’s impact on interest rates. This course is extremely computationally intensive. Most of the assignments entail statistical modeling via regression analysis on historical data such as the term structure of interest rates, credit spreads, and other fixed income instruments. We also investigate how well future interest rates can be forecasted using forward rates and other observables. Advanced mathematical techniques such as principal component analysis and attribution analysis are investigated. Stochastic modeling of interest rate dynamics via Brownian Motion and Monte Carlo analysis is also introduced. Every class begins by discussing current headline news regarding fixed income markets, and how they relate to the concepts being taught.\n\n\nprereq: MBA student, MBA 6231 (previously MBA 6230)",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "013662",
    "code": "FINA6122",
    "subject": "FINA",
    "number": "6122",
    "honors": false,
    "writing": false,
    "name": "Depository Institutions",
    "fullname": "Financial Management of Depository Institutions",
    "info": "Commercial banks, other depository institutions. Asset/liability management, risk management, geographic expansion, investment banking, public policy issues. Lectures, student presentations, project.\n\nprereq: MBA 6231 (previously MBA 6230), MBA student",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "817652",
    "code": "FINA6123",
    "subject": "FINA",
    "number": "6123",
    "honors": false,
    "writing": false,
    "name": "Financial Services Industry",
    "fullname": "Financial Services Industry",
    "info": "This course gives an overview of the U.S. financial services industry, emphasizing the overall environment, key institutional details, and underlying economic functions. After introducing financial markets and institutions and their functions, we look at the biggest sectors of this industry (banking, insurance, securities dealing, money management, etc.) in more depth. We conclude with a discussion of the impact of \"fintech\" on this sector.",
    "prereq": {}
  },
  {
    "uid": "820440",
    "code": "FINA6125",
    "subject": "FINA",
    "number": "6125",
    "honors": false,
    "writing": false,
    "name": "Cryptocurrency & Blockchain",
    "fullname": "Cryptocurrency, Blockchain, and Their Business Applications",
    "info": "This course discusses cryptocurrencies (including Bitcoin, Ethereum, and others), blockchain, also referred to as distributed ledger technology (DLT), and their applications in various business sectors. The course first explains the history of cryptocurrency, and the fundamentals of blockchain including cryptography and consensus mechanism. Although technical, this part is essential to establish a foundation to understand cryptocurrencies and blockchain. The rest of the course is on the applications of blockchain. We will discuss enterprise blockchain, smart contracts, and token offerings, e.g., initial coin offerings (ICOs) and securities token offering (STOs). We will have industry experts to give guest lectures on the real-world blockchain applications and interact with students. Finally, we will cover the valuation models for crypto assets, the practical details of how to use cryptocurrency, and various investments related to blockchain. The goal of the course is to provide students with a basic set of skills to understand cryptocurrencies and blockchain and how businesses can use them.",
    "prereq": {}
  },
  {
    "uid": "825143",
    "code": "FINA6211",
    "subject": "FINA",
    "number": "6211",
    "honors": false,
    "writing": false,
    "name": "Cash Flows and Project Select",
    "fullname": "Cash Flows and Project Selection",
    "info": "Managers are judged on their ability to select value-added projects; this is also one of the drivers of business value.  This course will explore the idea of ranking and selecting the best projects.  This will be accomplished through a study of cash flows and ranking metrics, including payback, internal rate of return, and net present value.   \n\nprereq: MBA 6231 (previously MBA 6230)",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "825144",
    "code": "FINA6212",
    "subject": "FINA",
    "number": "6212",
    "honors": false,
    "writing": false,
    "name": "Working Capital Management",
    "fullname": "Working Capital Management",
    "info": "Cash management is a major factor in the success or failure of a business.  Companies often find themselves short on cash even in a time of profitability.  Being able to manage a business through the cash cycle is a key factor in business success.  This course will explore current issues and best practices for working capital management.  \n\nPrereq: MBA 6231 (previously MBA 6230)",
    "prereq": {}
  },
  {
    "uid": "825156",
    "code": "FINA6213",
    "subject": "FINA",
    "number": "6213",
    "honors": false,
    "writing": false,
    "name": "Financial Capital Structure",
    "fullname": "Financial Capital Structure",
    "info": " This course focuses on one of the most fundamental corporate finance decisions, the determination of a firm’s financial capital structure, and its impact on firm risk, cost of capital, and firm value. The course also studies corporate bankruptcy and reorganization. Fina 6213 and FINA 6214 can have concurrent enrollment.\n\nprereq: MBA 6231 (previously MBA 6230)",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "825158",
    "code": "FINA6214",
    "subject": "FINA",
    "number": "6214",
    "honors": false,
    "writing": false,
    "name": "Business Valuation",
    "fullname": "Business Valuation",
    "info": "Description: Valuation is at the very core of finance. Valuation is about figuring out what we think an asset is worth to us, while pricing determines how much we pay for the asset. The two are not necessarily the same. This course introduces various methods for the valuation of a business or the equity of the business. FINA 6213 and FINA 6214 can have concurrent enrollment.\n\nprereq: MBA 6231 (previously MBA 6230) & FINA 6213",
    "prereq": {
      "and": [
        "014054",
        "825156"
      ]
    }
  },
  {
    "uid": "825483",
    "code": "FINA6215",
    "subject": "FINA",
    "number": "6215",
    "honors": false,
    "writing": false,
    "name": "The CFO Mindset:",
    "fullname": "The CFO Mindset: Finance, Strategy and Operations",
    "info": "Corporate governance is about the art and sciences of managing the interests of and the relationships among various corporate stakeholders: equity investors, debt investors, top management, and other employees.   \n\nprereq: MBA 6231 (previously MBA 6230)",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "809902",
    "code": "FINA6222",
    "subject": "FINA",
    "number": "6222",
    "honors": false,
    "writing": false,
    "name": "Mergers and Acquisitions",
    "fullname": "Mergers and Acquisitions",
    "info": "How corporate managers achieve growth through mergers/acquisitions. Examine buyer/seller motivations in context of M&A transactions/strategic alliances. Private equity, especially in context of corporate M&A transaction.\n\nprereq: MBA or Mgmt Sci MBA Student; MBA 6231 (previously MBA 6230), FINA 6241   OR   (FINA 6213 & FINA 6214)",
    "prereq": {
      "or": [
        "014054",
        "013667",
        {
          "and": [
            "825156",
            "825158"
          ]
        }
      ]
    }
  },
  {
    "uid": "013667",
    "code": "FINA6241",
    "subject": "FINA",
    "number": "6241",
    "honors": false,
    "writing": false,
    "name": "Corporate Financial Decisions",
    "fullname": "Corporate Financial Decisions and Analysis",
    "info": "Theoretical/applied understanding of corporate financial decisions. Adjusted present value, economic value added options. Impact of financing decisions on real asset valuation, managerial incentives, corporate strategy.\n\nprereq: MBA 6230, MBA student",
    "prereq": {}
  },
  {
    "uid": "013666",
    "code": "FINA6242",
    "subject": "FINA",
    "number": "6242",
    "honors": false,
    "writing": false,
    "name": "Adv Corp Financial Decisions",
    "fullname": "Advanced Corporate Finance Analysis and Decisions",
    "info": "Theory/practice of efficiently managing working capital, fixed assets. Emphasizes mergers/acquisitions, corporate restructuring, real options. Use of derivatives as financing tools, in deal structure.\n\nprereq: 6241, MBA student",
    "prereq": {
      "and": [
        "013667"
      ]
    }
  },
  {
    "uid": "013664",
    "code": "FINA6321",
    "subject": "FINA",
    "number": "6321",
    "honors": false,
    "writing": false,
    "name": "Portfolio Analysis",
    "fullname": "Portfolio Analysis and Management",
    "info": "Introduces analytical concepts used to manage security portfolios from perspective of an institutional investor. Market microstructure. Margin purchasing, short selling. Portfolio risk management, risk/return tradeoffs, strategic/tactical asset allocation, active versus passive management. Portfolio revision, performance evaluation.\n\nprereq: MBA 6121 (previously MBA 6120), MBA 6231 (previously MBA 6230), MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "013927",
        "014054"
      ]
    }
  },
  {
    "uid": "013665",
    "code": "FINA6322",
    "subject": "FINA",
    "number": "6322",
    "honors": false,
    "writing": false,
    "name": "Financial Modeling",
    "fullname": "Financial Modeling",
    "info": "Financial modeling tools to access financial data warehouses to build, estimate, maintain, and interpret comprehensive financial models that provide the framework for understanding businesses and their historical performance, plans/strategies, and market values. Financial analytics/modeling skills, including data mining of large standard financial databases (warehouses) (e.g. Capital IQ), and a manageable introduction to Excel VBA programming.\n\nprereq: MBA 6231 (previously MBA 6230), MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014054"
      ]
    }
  },
  {
    "uid": "789310",
    "code": "FINA6323",
    "subject": "FINA",
    "number": "6323",
    "honors": false,
    "writing": false,
    "name": "Adv. Financial Modeling",
    "fullname": "Advanced Financial Modeling",
    "info": "Advanced financial modeling tools to build, estimate, operate, audit, evaluate and understand business performance, and M&A, equity, and credit securities analysis models that have become central to sophisticated financial analysis of all operating businesses, transactions, and securities. How to analyze by way of financial models, screening (data mining) of large financial databases (warehouses). Adding to VBA programming skills required for advanced financial modeling.\n\nprereq: FINA 6322, MBA or Mgmt Sci MBA Student",
    "prereq": {
      "or": [
        "013665"
      ]
    }
  },
  {
    "uid": "793967",
    "code": "FINA6324",
    "subject": "FINA",
    "number": "6324",
    "honors": false,
    "writing": false,
    "name": "Securitization Markets",
    "fullname": "Securitization Markets",
    "info": "Splitting risks. Redirecting risks to investors able to analyze and take on those risks. Reasons for development of securitization. Products, their similarities in character. How to build simple models and analyze examples of actual securitized liabilities.\n\nprereq: FINA 6121, MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "013661"
      ]
    }
  },
  {
    "uid": "809334",
    "code": "FINA6325",
    "subject": "FINA",
    "number": "6325",
    "honors": false,
    "writing": false,
    "name": "Behavioral Finance",
    "fullname": "Behavioral Finance",
    "info": "Psychology/realistic settings that guide/develop alternative theories of financial market. How behavioral finance complements traditional paradigm on investors' trading patterns, behavior of asset prices, corporate finance, various Wall Street institutions/practices.\n\nprereq: MBA or Mgmt Sci MBA student",
    "prereq": {}
  },
  {
    "uid": "016810",
    "code": "FINA6341",
    "subject": "FINA",
    "number": "6341",
    "honors": false,
    "writing": false,
    "name": "World Economy",
    "fullname": "World Economy",
    "info": "Tools to predict/understand ramifications of major economic events.  Financial crises. Changes in monetary, fiscal, financial policies. Strategies for promoting long-run economic growth. Examples from U.S., Europe, Japan, developing countries.\n\nprereq: MBA 6231 (previously MBA 6230), MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014054"
      ]
    }
  },
  {
    "uid": "816973",
    "code": "FINA6404",
    "subject": "FINA",
    "number": "6404",
    "honors": false,
    "writing": false,
    "name": "Industry Vertical: Finance",
    "fullname": "Industry Vertical: Finance",
    "info": "Focus on firms engaged in three major sub areas of financial services including retail banking, investment, and international markets subsectors. Cases and live case studies to focus on firms ranging from Wells Fargo, Berkshire Hathaway, Cargill, and Piper Jaffray. Federal oversight focus includes the Security and Exchange Commission and the Department of Treasury.",
    "prereq": {}
  },
  {
    "uid": "013690",
    "code": "FINA6421",
    "subject": "FINA",
    "number": "6421",
    "honors": false,
    "writing": false,
    "name": "Topics in Corporate Finance",
    "fullname": "Topics in Corporate Finance",
    "info": "Advanced-level coverage of topics in corporate finance. Analytical foundations reviewed/expanded. Opportunities for applying concepts in complex settings. Major report or presentation.\n\nprereq: MBA 6231, MBA student",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "013691",
    "code": "FINA6422",
    "subject": "FINA",
    "number": "6422",
    "honors": false,
    "writing": false,
    "name": "Mergers and Acquisitions",
    "fullname": "Mergers and Acquisitions",
    "info": "Various means for corporate managers to achieve growth through mergers/acquisitions. Leverage skills mastered in core curriculum. Examine both buyer/seller motivations in context of M&A transactions/strategic alliances. Private equity in M&A marketplace.\n\nprereq: 6241, MBA student",
    "prereq": {
      "and": [
        "013667"
      ]
    }
  },
  {
    "uid": "787629",
    "code": "FINA6500",
    "subject": "FINA",
    "number": "6500",
    "honors": false,
    "writing": false,
    "name": "Active Fund Management",
    "fullname": "Active Fund Management",
    "info": "Lectures, assignments, modules, hands-on real-money experience through Golden Gopher Growth Fund or Golden Gopher Fixed Income Fund.\nPrereq-[6121 or 6321], 6322, 6323, Acct 6100, MBA student, approved application; [Acct 6160 or &Acct 6160] recommended; must be taken [fall, spring] or have written approval to enroll for only one sem.",
    "prereq": {}
  },
  {
    "uid": "825145",
    "code": "FINA6511",
    "subject": "FINA",
    "number": "6511",
    "honors": false,
    "writing": false,
    "name": "Options for Corporate Finance",
    "fullname": "Options for Corporate Finance",
    "info": "This course explores financial options from the perspective of a corporation, including what financial options are, how they work, and how they are frequently used to pay employees and managers. Further applications will be explored, including how options can be used as tools to better understand corporate financing and project selection decisions.\n\nprereq: MBA 6231 (previously MBA 6230)",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "013670",
    "code": "FINA6522",
    "subject": "FINA",
    "number": "6522",
    "honors": false,
    "writing": false,
    "name": "Intro to Deriv. & Fin Risk Mgt",
    "fullname": "Introduction to Derivatives and Financial Risk Management",
    "info": "This class provides an introduction to derivatives pricing models and their applications. Building on the insights from the binomial model and the Black-Scholes model, it covers dynamic replication and optimal risk management strategies. It also combines tools from derivatives pricing and the CAPM model to develop investment strategies that achieve the optimal risk and return trade-off. Students are required to use Excel, Matlab or other programming languages to build replicating portfolios and to construct optimal investment and risk management strategies. They are also required to use historical data to evaluate the effectiveness of these investment strategies.\n\nprereq: 6121, MBA student",
    "prereq": {
      "and": [
        "013661"
      ]
    }
  },
  {
    "uid": "013663",
    "code": "FINA6529",
    "subject": "FINA",
    "number": "6529",
    "honors": false,
    "writing": false,
    "name": "Adv. Topic Fx'd Income & Deriv",
    "fullname": "Advanced Topics in Fixed Income and Derivatives",
    "info": "Economics and mechanics of derivatives. First phase focuses on theoretical and institutional foundations for various derivatives instruments and markets. Second phase is practicum in which student groups build working models of derivatives.\n\nprereq: (credit will not be granted if already received for 6541)",
    "prereq": {}
  },
  {
    "uid": "825161",
    "code": "FINA6611",
    "subject": "FINA",
    "number": "6611",
    "honors": false,
    "writing": false,
    "name": "Finance for Multinationals",
    "fullname": "Finance for Multinationals",
    "info": "Virtually all companies—from small privately held companies to large public companies—are involved in international trade, even if only sourcing raw materials and components internationally.  The advent of robust e-commerce websites has further enabled companies of all sizes to actively participate in international trade.   \n\nThis course explores the nature, purposes, and risks of international trade by multinational companies, and the relevant capital budgeting processes and international financing tools needed to facilitate international trade. Students will gain skills in international investment analysis, capital financing techniques, capital budgeting for international projects, and international trade risk management. Students will examine barriers to international capital flows, and study the financial instruments used to overcome these barriers, focusing on the decisions made by multinational enterprises. \n\nPrereq: MBA 6231 (previously MBA 6230)\n",
    "prereq": {}
  },
  {
    "uid": "013669",
    "code": "FINA6621",
    "subject": "FINA",
    "number": "6621",
    "honors": false,
    "writing": false,
    "name": "International Finance",
    "fullname": "International Financial Management",
    "info": "Applying finance theory to multinational corporations' investment, financing, risk management, decisions. International financial system. Spot, forward, swaps, option markets for foreign exchange. Interest rate arbitrage, parity. Exchange rate risk analysis/forecast. Measuring/managing currency exposure. Long term financing with swaps. Multinational capital budgeting. Cost of capital for international projects.\n\nprereq: MBA 6231 (previously MBA 6230), MBA student",
    "prereq": {
      "and": [
        "014054"
      ]
    }
  },
  {
    "uid": "825863",
    "code": "FINA6623",
    "subject": "FINA",
    "number": "6623",
    "honors": false,
    "writing": false,
    "name": "Economic Booms and Busts",
    "fullname": "Economic Booms and Busts",
    "info": "The purpose of this course is to provide you with an understanding of the world economy through the impact of government policies in the economy. We focuses on using macro and international economics to analyze the world economy and the implications for business management. The course uses lectures and class discussion to familiarize students with macro and international economic tools with a goal of improving managerial decision-making. We focuses on understanding the role of government monetary policies, fiscal policies, trade policies, and exchange rate policy to impact on economy and study the linkage between economic analysis and strategic business management.",
    "prereq": {}
  },
  {
    "uid": "825864",
    "code": "FINA6624",
    "subject": "FINA",
    "number": "6624",
    "honors": false,
    "writing": false,
    "name": "Growth in the Global Economy",
    "fullname": "Growth in the Global Economy",
    "info": "The purpose of this course is to provide you with an understanding of the main drivers of economic growth across countries and over time. This will be done through the lens of macroeconomic analysis and policy debates. The class starts by covering the foundations: basic national income accounting, money, labor markets, and basic of international capital flows.  An important topic is long-run economic growth and how that helps us to understand differences over time and across countries.",
    "prereq": {}
  },
  {
    "uid": "016811",
    "code": "FINA6801",
    "subject": "FINA",
    "number": "6801",
    "honors": false,
    "writing": false,
    "name": "Finance Independent Study",
    "fullname": "Finance Independent Study",
    "info": "Independent study.\n\nprereq: MBA student, instr consent",
    "prereq": {}
  },
  {
    "uid": "826211",
    "code": "FINA6920",
    "subject": "FINA",
    "number": "6920",
    "honors": false,
    "writing": false,
    "name": "Topics in Finance",
    "fullname": "Topics in Finance",
    "info": "Discussion and analysis of current topics and developments in Finance.",
    "prereq": {}
  },
  {
    "uid": "004359",
    "code": "FINA8801",
    "subject": "FINA",
    "number": "8801",
    "honors": false,
    "writing": false,
    "name": "Theory of Cptl Mkts",
    "fullname": "Theory of Capital Markets",
    "info": "Expected utility theory, discrete theory, continuous theory, theory of the term structure, measures of risk, portfolio choice, aggregation and separation, linear pricing.",
    "prereq": {}
  },
  {
    "uid": "798147",
    "code": "FINA8802",
    "subject": "FINA",
    "number": "8802",
    "honors": false,
    "writing": false,
    "name": "Theory of Capital Markets I",
    "fullname": "Theory of Capital Markets I: Discrete Time",
    "info": "Modern asset pricing theory. Static/discrete time frameworks.\nFundamental asset pricing equation. Classical finance models: CAPM,\nconsumption-based CAPM, Complete markets, representative agent, Pareto\n\nprereq: [Econ 8101, Econ 8102, business admin PhD student] or instr consent",
    "prereq": {
      "and": [
        "008894",
        "008890"
      ]
    }
  },
  {
    "uid": "798148",
    "code": "FINA8803",
    "subject": "FINA",
    "number": "8803",
    "honors": false,
    "writing": false,
    "name": "Theory of Capital Markets II",
    "fullname": "Theory of Capital Markets II: Continuous Time",
    "info": "Continuous-time financial economics. Emphasizes mathematical/statistical tools. Ito processes, Girsanov’s theorem, risk-neutral pricing. How to formulate/analyze continuous-time models.\n\nprereq: [Econ 8101, Econ 8102, Bbsiness admin PhD student] or instr consent",
    "prereq": {
      "and": [
        "008894",
        "008890"
      ]
    }
  },
  {
    "uid": "798177",
    "code": "FINA8804",
    "subject": "FINA",
    "number": "8804",
    "honors": false,
    "writing": false,
    "name": "Adv Continuous Time Finance",
    "fullname": "Advanced Continuous Time Finance",
    "info": "Pricing of fixed income securities, optimal capital structure, general equilibrium. Classic/current papers in continuous-time literature.\n\nprereq: 8802, 8803",
    "prereq": {
      "and": [
        "798147",
        "798148"
      ]
    }
  },
  {
    "uid": "806670",
    "code": "FINA8810",
    "subject": "FINA",
    "number": "8810",
    "honors": false,
    "writing": false,
    "name": "Topics in Asset Pricing",
    "fullname": "Topics in Asset Pricing",
    "info": "Current topics in asset pricing literature. Students read papers on these topics, rederive the main results, identify the main assumptions and thus identify ideas on how to improve upon the current literature.\n\nprereq: Business admin PhD student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004313",
    "code": "FINA8811",
    "subject": "FINA",
    "number": "8811",
    "honors": false,
    "writing": false,
    "name": "Corporate Finance",
    "fullname": "Corporate Finance",
    "info": "Theoretical and empirical works in five major areas of corporate finance: capital structure, payout policy, mergers and corporate control, capital acquisition process, and corporate risk management. Theoretical frameworks are used to understand empirical evidence.",
    "prereq": {}
  },
  {
    "uid": "798149",
    "code": "FINA8812",
    "subject": "FINA",
    "number": "8812",
    "honors": false,
    "writing": false,
    "name": "Corporate Finance I",
    "fullname": "Corporate Finance I",
    "info": "Corporate control, managerial incentives, corporate governance, capital structure. What assets are collected within firm. What determines boundaries of firm. Empirical evidence in support of theoretical models. Modern theories of firm, based on incomplete contracts. How corporate finance decisions expand/limit scope of firm.\n\nprereq: [Econ 8103, Econ 8104, business admin PhD student] or instr consent",
    "prereq": {
      "and": [
        "008896",
        "008897"
      ]
    }
  },
  {
    "uid": "798151",
    "code": "FINA8813",
    "subject": "FINA",
    "number": "8813",
    "honors": false,
    "writing": false,
    "name": "Corporate Finance II",
    "fullname": "Corporate Finance II",
    "info": "Theoretical corporate finance. Initial public offering, dividend policy. Financial distress and its resolution. Financial intermediation, applications of auctions in finance.\n\nprereq: [8812, business admin PhD student] or instr consent",
    "prereq": {
      "and": [
        "798149"
      ]
    }
  },
  {
    "uid": "806671",
    "code": "FINA8820",
    "subject": "FINA",
    "number": "8820",
    "honors": false,
    "writing": false,
    "name": "Topics in Corporate Finance",
    "fullname": "Topics in Corporate Finance",
    "info": "Current topics in corporate finance literature. Students read current papers, rederive the main results, identify the main assumptions and thus identify ideas on how to improve on the current literature.\n\nprereq: Business admin PhD student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004358",
    "code": "FINA8821",
    "subject": "FINA",
    "number": "8821",
    "honors": false,
    "writing": false,
    "name": "Empir. Mthds in Fin",
    "fullname": "Empirical Methods in Finance",
    "info": "Introduction to commonly used econometric methods in the empirical financial markets area. Econometric tests of linear pricing models, tests of market efficiency, event studies.",
    "prereq": {}
  },
  {
    "uid": "798152",
    "code": "FINA8822",
    "subject": "FINA",
    "number": "8822",
    "honors": false,
    "writing": false,
    "name": "Empirical Methods in Finance",
    "fullname": "Empirical Methods in Finance",
    "info": "Empirical techniques in analysis of financial markets, how they are applied to actual market data. Statistical properties of asset returns, efficient markets hypothesis. Empirical tests of asset pricing models (CAPM, APT, Intertemporal CAPM, Consumption CAPM). Tests of conditional asset pricing models.\n\nprereq: 8802, 8803",
    "prereq": {
      "and": [
        "798147",
        "798148"
      ]
    }
  },
  {
    "uid": "798153",
    "code": "FINA8823",
    "subject": "FINA",
    "number": "8823",
    "honors": false,
    "writing": false,
    "name": "Empirical Corporate Finance",
    "fullname": "Empirical Corporate Finance",
    "info": "Current empirical research on corporate finance. Mergers/acquisitions, equity offerings, event studies, tests of market efficiency, impact of corporate governance, compensation policies, initial public offerings.\n\nprereq: 8802, 8803",
    "prereq": {
      "and": [
        "798147",
        "798148"
      ]
    }
  },
  {
    "uid": "799502",
    "code": "FINA8890",
    "subject": "FINA",
    "number": "8890",
    "honors": false,
    "writing": false,
    "name": "Seminar: Finance Topics",
    "fullname": "Seminar: Finance Topics",
    "info": "Current topics/problems of interest considered in depth. Topics vary.\n\nprereq: [[8802, 8812, 8822, 8823] or equiv], business admin student] or instr consent. No first year students to enroll.",
    "prereq": {
      "and": [
        "798147",
        "798149",
        "798152",
        "798153"
      ]
    }
  },
  {
    "uid": "004651",
    "code": "FINA8892",
    "subject": "FINA",
    "number": "8892",
    "honors": false,
    "writing": false,
    "name": "BFin Indep. Study",
    "fullname": "Independent Study in Finance",
    "info": "Problems or developments of special interest to the student.\n\nprereq: Business admin PhD student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004655",
    "code": "FINA8894",
    "subject": "FINA",
    "number": "8894",
    "honors": false,
    "writing": false,
    "name": "Dir. Rsrch in BFin",
    "fullname": "Directed Research in Finance",
    "info": "Individualized directed research on a project of interest to the student, approved and advised by faculty.\n\nprereq: Business admin PhD student specializing in finance or instr consent",
    "prereq": {}
  }
]