[
  {
    "uid": "793149",
    "code": "FLOR1001",
    "subject": "FLOR",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Beginning Italian",
    "fullname": "Beginning Italian",
    "info": "Listening, speaking, reading, communicative competence.",
    "prereq": {}
  },
  {
    "uid": "793150",
    "code": "FLOR1002",
    "subject": "FLOR",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Beginning Italian",
    "fullname": "Beginning Italian",
    "info": "This second beginning level course of Italian uses a communicative approach to help you quickly develop the ability to communicate in Italian in everyday practical situations as well as to acquire the skills necessary to read and write effectively in Italian. From the start, you will be expected to comprehend and produce some Italian by actively engaging in communicative activities that have real world relevance. Role-plays, pair and group work, and specific tasks and assignments carried out in and out of class will provide you with numerous opportunities for learning the language while interacting with locals and other learners in Italian. Listening, reading, speaking, and writing are integrated into all activities and are tested in compositions, oral presentations, grammar tests, and exams. Special emphasis is placed on the expansion of communicative functions and of the vocabulary. Finally, class and home assignments and projects will encourage you to become acquainted with various aspects of Florentine life and with the culture and society of Italy at large.",
    "prereq": {}
  },
  {
    "uid": "793151",
    "code": "FLOR1003",
    "subject": "FLOR",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "Intermediate Italian",
    "fullname": "Intermediate Italian",
    "info": "This communication-based intermediate course of Italian helps you develop the ability to communicate effectively in everyday, practical situations and to read authentic materials in Italian. The course reviews and completes all basic grammar structures, reinforces the mastering of these elements in real life situations, and expands your vocabulary and knowledge of more complex grammar and syntax structures. \n\nAs the language learning progresses, you will be expected to produce more Italian while actively engaging in communicative activities that have real world relevance both in and out of class, and practice all four linguistic abilities. \n\nYou will be encouraged though a variety of in- and out-of-class activities to explore the city of Florence and engage in guided interactions with the local culture. You will also be exposed to a variety of registers and uses of the language. Site visits and authentic materials in a variety of media are used extensively in order to facilitate your communication and comprehension skills and with the culture and society of Italy at large.\n",
    "prereq": {}
  },
  {
    "uid": "793152",
    "code": "FLOR1004",
    "subject": "FLOR",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Intermediate Italian",
    "fullname": "Intermediate Italian",
    "info": "This communication-based intermediate course of Italian helps you develop the ability to communicate effectively in everyday practical situations and to read authentic materials in Italian. The course reviews and completes all basic grammar structures, reinforces the mastering of these elements in real life situations, and expands your vocabulary and knowledge of more complex grammar and syntax structures. \n\nAs the language learning progresses, you will be expected to produce more Italian while actively engaging in communicative activities that have real world relevance both in and out of class, and practice all four linguistic abilities. \n\nYou will be encouraged though a variety of in- and out-of-class activities to explore the city of Florence and engage in guided interactions with the local culture. You will also be exposed to a variety of registers and uses of the language. Site visits and authentic materials in a variety of media are used extensively in order to facilitate your communication and comprehension skills with the culture and society of Italy at large.\n",
    "prereq": {}
  },
  {
    "uid": "793153",
    "code": "FLOR1101",
    "subject": "FLOR",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Drawing",
    "fullname": "Drawing",
    "info": "Figure/object drawing. Materials, techniques. ",
    "prereq": {}
  },
  {
    "uid": "793154",
    "code": "FLOR1102",
    "subject": "FLOR",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Watercolor",
    "fullname": "Watercolor",
    "info": "Concepts of color, form imagery, line, composition, volume, and space. Use of watercolor as medium.",
    "prereq": {}
  },
  {
    "uid": "807176",
    "code": "FLOR1201",
    "subject": "FLOR",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Beginning Drawing Studio",
    "fullname": "Beginning Drawing Studio",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "793155",
    "code": "FLOR1301",
    "subject": "FLOR",
    "number": "1301",
    "honors": false,
    "writing": false,
    "name": "Figurative Sculpture",
    "fullname": "Figurative Sculpture",
    "info": "Three-dimensional work in figurative sculpture through means of clay and wax.",
    "prereq": {}
  },
  {
    "uid": "798437",
    "code": "FLOR1302",
    "subject": "FLOR",
    "number": "1302",
    "honors": false,
    "writing": false,
    "name": "Oil Painting",
    "fullname": "Oil Painting",
    "info": "Beginning level oil painting for the Study Abroad in Florence program.",
    "prereq": {}
  },
  {
    "uid": "798438",
    "code": "FLOR1303",
    "subject": "FLOR",
    "number": "1303",
    "honors": false,
    "writing": false,
    "name": "Life Drawing",
    "fullname": "Life Drawing",
    "info": "Life-drawing course on the Study Abroad in Florence program.",
    "prereq": {}
  },
  {
    "uid": "806491",
    "code": "FLOR1401",
    "subject": "FLOR",
    "number": "1401",
    "honors": false,
    "writing": false,
    "name": "Intro. to Photojournalism",
    "fullname": "Introduction to Photojournalism",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "827302",
    "code": "FLOR1501",
    "subject": "FLOR",
    "number": "1501",
    "honors": false,
    "writing": false,
    "name": "Beginning Painting in Florence",
    "fullname": "Beginning Painting in Florence",
    "info": "This studio course introduces students to the principles of painting and develops their skills in composition, observation, and the use of color. The course will include sessions on technique, brushwork, color theory and the use of different media. During the first half of the course, assignments will concentrate on developing different skills and building techniques, using traditional and experimental approaches to painting. During the second half of the course, students will use these skills to develop their own work.\nStudents will explore the history of art in Florence in the many galleries and museums and will use this knowledge to inform their own work. The course will cover the technical developments of the Renaissance, including the study of perspective, line, and form. Through guided instructional sessions, students will gradually cultivate their unique artistic styles and engage in individual research, which may involve integrating themes and techniques from both modern and contemporary art. This study will be the basis for developing painting skills through engaging with, and responding to, the works and artists they study.\nThe course will also have a focus on developing skills for self and peer criticism to discuss the development of the work. Students will create a final piece supported by an Artist's Statement, a research breakdown outlining the evolution of the project's concept and technical development.",
    "prereq": {}
  },
  {
    "uid": "807177",
    "code": "FLOR3001",
    "subject": "FLOR",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Italian Renaissance Art",
    "fullname": "Italian Renaissance Art",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "807178",
    "code": "FLOR3002",
    "subject": "FLOR",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Women and Italian Politics",
    "fullname": "Women and Italian Politics",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "807179",
    "code": "FLOR3003",
    "subject": "FLOR",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Graphic Design & Visual Comm.",
    "fullname": "Graphic Design and Visual Communication",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "807180",
    "code": "FLOR3004",
    "subject": "FLOR",
    "number": "3004",
    "honors": false,
    "writing": false,
    "name": "Society in Photography",
    "fullname": "Photography: Exploring Society Through the Camera's Lens",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "807181",
    "code": "FLOR3005",
    "subject": "FLOR",
    "number": "3005",
    "honors": false,
    "writing": false,
    "name": "Hist. & Sociol. of Consumerism",
    "fullname": "History and Sociology of Modern Consumerism",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "807182",
    "code": "FLOR3006",
    "subject": "FLOR",
    "number": "3006",
    "honors": false,
    "writing": false,
    "name": "Cross Cultural Psychology",
    "fullname": "Cross Cultural Psychology",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "807824",
    "code": "FLOR3007",
    "subject": "FLOR",
    "number": "3007",
    "honors": false,
    "writing": false,
    "name": "Made in Italy: Retail Merch.",
    "fullname": "Made in Italy: Retail Merchandising in Florence",
    "info": "Study abroad course",
    "prereq": {}
  },
  {
    "uid": "808440",
    "code": "FLOR3008",
    "subject": "FLOR",
    "number": "3008",
    "honors": false,
    "writing": false,
    "name": "Entrepreneurship",
    "fullname": "Entrepreneurship: Small Businesses in Florence",
    "info": "Study abroad.",
    "prereq": {}
  },
  {
    "uid": "808632",
    "code": "FLOR3009",
    "subject": "FLOR",
    "number": "3009",
    "honors": false,
    "writing": false,
    "name": "Internships in Florence",
    "fullname": "Internships in Florence: A Comparative Approach to the Italian Workforce",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "809399",
    "code": "FLOR3010W",
    "subject": "FLOR",
    "number": "3010",
    "honors": false,
    "writing": true,
    "name": "Literature of Florence",
    "fullname": "Literary Representations of Florence: Space, Self & Other",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "809400",
    "code": "FLOR3011",
    "subject": "FLOR",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "Bookmaking in Florence",
    "fullname": "Bookmaking: The Art of the Book in Florence",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "817669",
    "code": "FLOR3012",
    "subject": "FLOR",
    "number": "3012",
    "honors": false,
    "writing": false,
    "name": "Florence and the Mediterranean",
    "fullname": "Florence and the Mediterranean: A Sea of Culture",
    "info": "During the Middle Ages and in the early Modern Age, three great civilizations clashed for the control of the Mediterranean basin: the Latin West, the Byzantine Empire, and the Muslim world. But the sea was not just a theatre of war, it was also a lively economic area, with trade routes crossing it from north to south, from east to west. Moreover, it was the place where different cultures met: This course will explore their reciprocal influence, with a special focus on art history and a mainly Italian and Florentine point of view. Topics will include: the impact of Islamic art on Western culture; the role of Byzantine art in the development of Florentine painting; the rediscovery of Greek classical culture and its importance in Renaissance civilization; the consequences of the fall of Constantinople and of the expansion of the Ottoman Empire. Students will explore Florentine churches, palaces, and museums in search of visual evidence of the links between the city and the diversity of Mediterranean culture.",
    "prereq": {}
  },
  {
    "uid": "826764",
    "code": "FLOR3013",
    "subject": "FLOR",
    "number": "3013",
    "honors": false,
    "writing": false,
    "name": "Contemp Italian Identities",
    "fullname": "Contemporary Italian Identities: Perspectives from Migrants, Women, & LGBTQIA+ Communities",
    "info": "Each of us is an autonomous individual pursuing personal objectives, yet we are also members of groups—groups that constrain us, guide us, and sustain us. Just as each of us influences the group and its members, so, too, do groups shape each one of us. The ethical principles of societies have been developed through group processes, and ethics play a crucial role in the contemporary world.\nUsing the lenses of social identity theory and community psychology, this course invites students to reflect critically on the ethical implications of what has and continues to constitute Italian-ness in light of new identities emerging in Italian society. We will do so by addressing “minority identities” in Italian society, starting with an overview of Italy’s colonial past and racial history up to the contemporary challenges that a multicultural Italy faces today. \n\nWhile learning about new Italian identities, we will discuss and reflect on the basic theories of community psychology (diversity, oppression and power, empowerment, being an agent of change, etc.), discussing the role that concepts such as gender, race, nation, culture, value/s, diversity, otherness, and intersectionality play in contemporary Italy. More specific topics, studied in the Florentine context, include the following:\n- Migrants in Italy: a “recent” phenomenon. We will talk about acculturation strategies, different cultural backgrounds, and the emerging of new identities.\n- History and actuality of LGBT+ people living in Italy. We will conduct an overview of the evolution of Italian culture and of the legislation concerning LGBT people, health services, and activism. \n- Women in Italy, between stereotypes and modernity. We will discuss how in many aspects of everyday life women still remain prisoners of stereotypes, despite major progress made in legislation and education.\n\nThis course aims to prepare students to become active and responsible citizens within their local, national, and world communities, encouraging them to develop, defend, or challenge their personal values and beliefs. To this purpose, they will engage in a series of conversations with local stakeholders in minority representation in Italy.",
    "prereq": {}
  },
  {
    "uid": "819810",
    "code": "FLOR3014",
    "subject": "FLOR",
    "number": "3014",
    "honors": false,
    "writing": false,
    "name": "Fashion & Arts Communication",
    "fullname": "Fashion & Arts Communication",
    "info": "This course was structured out of four core ideas: how fashion designers and artists communicate and market their art; how institutions communicate and market the fashion items and artworks they have on display; how the audience communicates their experience of fashion and of art and how this influences marketing and promotional strategies; and how these three processes are implemented through communication and marketing channels and for which purposes. The course will explore its core ideas integrating theoretical and experiential-learning approaches.\n\nStarting from the fundamentals of communication theory, with a focus on listening skills and effective storytelling, students will draw from case studies to understand the underlying core of communication activities in fashion and the arts. The promotional process in both industries will be analyzed in its main parts (research, planning, execution, evaluation), as well as in its ethical and legal implications.\n\nStudents will experiment with promotional tools to understand the connection between public relations and the media, and explore the blurred line between public relations and marketing when dealing with social media contents and strategic planning. Ultimately, they will learn the fundamentals to develop and design a communication campaign.\n",
    "prereq": {}
  },
  {
    "uid": "819811",
    "code": "FLOR3015",
    "subject": "FLOR",
    "number": "3015",
    "honors": false,
    "writing": false,
    "name": "Hist. of Food/Identity in Med.",
    "fullname": "Food & Identity in the Mediterranean: A Cultural History",
    "info": "This course is an investigation into how the identities of different peoples in the Mediterranean can be understood through the lens of the food they cultivate, trade, and eat. After an introduction to different definitions of identity, with a particular focus on the formation, maintenance, and evolution of group identity through cultural practices, the course will analyze the history and culture of food in different civilizations of the Mediterranean basin: Phoenicians, Ancient Hebrews, Greco-Romans, and others. Study of the different diets of the Byzantines and the Venetian merchants, and the influence of the spice trade and nascent Islam during the Middle Ages, will show how identities are formed, consolidated, and changed through food. The Renaissance, especially in Florence, will be the object of an in-depth analysis as a pivotal time in Western food culture and in the arts. The course will then investigate the relationship between Florentine and French elite identities via the birth of modern table manners (and dishes) and their connection with the rise of the first nation states. The last part of the course will consider modern states, migration, and how these interconnect with agricultural practices and industrial food processes that have changed the nature of food production in the Mediterranean.",
    "prereq": {}
  },
  {
    "uid": "819812",
    "code": "FLOR3016",
    "subject": "FLOR",
    "number": "3016",
    "honors": false,
    "writing": false,
    "name": "Photography for Social Media",
    "fullname": "Photography for Social Media",
    "info": "This course introduces students to the principles of photography for social media and how essential it is to learn about storytelling. Students will also learn about the power of imagery and its wider impact in the digital world. While an increasing amount of people carry around a phone every day, how many really know the potential of these powerful cameras, and how to use them to create and share images that make an impact with social media audiences?\nThe course will appeal to students majoring in communication, marketing, design, journalism, and sociology and to all students interested in learning practical skills in photography, including compositional and technical information about apps, smartphone settings, and gear. There will also be time dedicated to analyzing social media impact on data, privacy, image protection, and intellectual property. This is not a social media marketing course but is designed as a creative exploration that will help students develop their eye for exciting imagery and improve their shooting skills.",
    "prereq": {}
  },
  {
    "uid": "825396",
    "code": "FLOR3017W",
    "subject": "FLOR",
    "number": "3017",
    "honors": false,
    "writing": true,
    "name": "The Traveling Self",
    "fullname": "The Traveling Self: Writing Autobiography in Italy & Florence",
    "info": "“I did not then represent to myself towns, landscapes, monuments, as pictures more or less attractive, cut out here and there of a substance that was common to them all, but looked on each of them as on an unknown thing, essentially different from all the rest, a thing for which my soul thirsted and which it would benefit from knowing.”\n(Marcel Proust, Swann’s Way. In Search of Lost Time. Volume 1)\n\n“What I write about myself is never the last word: the more ‘sincere’ I am, the more interpretable I am.”\n(R. Barthes, Roland Barthes by Roland Barthes, trans. R. Howard, McMillan, London 1977)\n\nTravel experience in Italy has been for centuries an inspirational path for writers, novelists, and journalists from all over the world. The deep history and the most significant places in this relevant European country—connected both to the Northern cultures and at the crossroads with the Mediterranean ones—has prompted new narrative strategies, peculiar fictional characters, and innovative plots. Authors have been travelling the country by different means of transportation—carriages, trains, but also on foot—that have influenced their perspectives. They have walked into churches, squares, gardens, and museums to explore a flourishing collection of symbols and values from the past and to foresee the complexity of the future of Western civilization. They have tasted delicious and repellent flavors in Italian markets, shops, and restaurants and discussed Italian society and its issues. They have changed their personal mindsets, exploring new maps of their own cultural identity.\n\nTraveling abroad has always been, in fact, an experience of enrichment, enhancement, and transformation of a traveler’s identity and intimate self. Starting from this assumption, this creative writing course will use the narrative strategies offered by modern and contemporary autobiography to draw inspiration from the students’ Italian and European travel experience. At the same time, a “classic” field in literature and a flourishing contemporary trend, the genre of autobiography defies categories. It allows us to experiment with innovative forms—from diary to travelogue, from literary nonfiction to the so-called “autofiction”—that are also currently evolving under the influence of the social networks and the possibilities of augmented experience offered by the Web.",
    "prereq": {}
  },
  {
    "uid": "827303",
    "code": "FLOR3018",
    "subject": "FLOR",
    "number": "3018",
    "honors": false,
    "writing": false,
    "name": "History of Design in Italy",
    "fullname": "History of Design in Italy",
    "info": "This course introduces students to the history of design in Italy from the post-war period to the present day and explores the connection between design and the rebuilding of Italy and the Italian economy, following the devastations of World War II. The link between Italian design and Italian identity, and the concept of \"Made in Italy,\" will be explored through the study of design in different areas, including fashion, objects, transport, and furniture. \nBy looking at the impact of Italian design outside of Italy and the emergence of global companies, including the main fashion houses, the course leads students to understand the importance of design both as part of the Italian economy and as a lens through which the world views Italy.  \nFinally, through visits, lectures, case studies analyzed through a cross-cultural lens, and in-class discussions, the course aims at building awareness in students and inspire their creativity for new projects in an ever-changing world and society, with an eye on sustainability, ethics, design justice, and life cycle assessment in today’s market.",
    "prereq": {}
  },
  {
    "uid": "793156",
    "code": "FLOR3040",
    "subject": "FLOR",
    "number": "3040",
    "honors": false,
    "writing": false,
    "name": "Impact of Globaliz'n-Euro Mkts",
    "fullname": "The Impact of Globalization on European Markets",
    "info": "Theoretical analysis of international trade/commerce.",
    "prereq": {}
  },
  {
    "uid": "810336",
    "code": "FLOR3100",
    "subject": "FLOR",
    "number": "3100",
    "honors": false,
    "writing": false,
    "name": "Advanced Italian",
    "fullname": "Advanced Italian Grammar and Conversation",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "796761",
    "code": "FLOR3101",
    "subject": "FLOR",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Intermediate Drawing",
    "fullname": "Intermediate Drawing",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "796762",
    "code": "FLOR3102",
    "subject": "FLOR",
    "number": "3102",
    "honors": false,
    "writing": false,
    "name": "Intermediate Watercolor",
    "fullname": "Intermediate Watercolor",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "807183",
    "code": "FLOR3201",
    "subject": "FLOR",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Intermediate Drawing Studio",
    "fullname": "Intermediate Drawing Studio",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "801591",
    "code": "FLOR3210",
    "subject": "FLOR",
    "number": "3210",
    "honors": false,
    "writing": false,
    "name": "Renaissance Art History",
    "fullname": "Renaissance Art History",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "801592",
    "code": "FLOR3211",
    "subject": "FLOR",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "Contemporary Italian Lit.",
    "fullname": "Contemporary Italian Literature",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "801593",
    "code": "FLOR3212",
    "subject": "FLOR",
    "number": "3212",
    "honors": false,
    "writing": false,
    "name": "Medieval & Ren Italian Lit.",
    "fullname": "Medieval and Renaissance Italian Literature",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "793157",
    "code": "FLOR3213",
    "subject": "FLOR",
    "number": "3213",
    "honors": false,
    "writing": false,
    "name": "Italian Art:Antiquity-Baroque",
    "fullname": "History of Italian Art From Antiquity to the Baroque",
    "info": "Foundation in history of art though painting, sculpture, and architecture.",
    "prereq": {}
  },
  {
    "uid": "795821",
    "code": "FLOR3214",
    "subject": "FLOR",
    "number": "3214",
    "honors": false,
    "writing": false,
    "name": "Italian Art:Renaissance-20th C",
    "fullname": "History of Italian Art, From Early Renaissance to Early 20th Century",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "805899",
    "code": "FLOR3215",
    "subject": "FLOR",
    "number": "3215",
    "honors": false,
    "writing": false,
    "name": "Contemporary Italian Cinema",
    "fullname": "Italian Cinema: Contemporary Italy on the Screen",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "796763",
    "code": "FLOR3301",
    "subject": "FLOR",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Intrmd Figurative Sculpture",
    "fullname": "Intermediate Figurative Sculpture",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "798457",
    "code": "FLOR3302",
    "subject": "FLOR",
    "number": "3302",
    "honors": false,
    "writing": false,
    "name": "Intermediate Oil Painting",
    "fullname": "Intermediate Oil Painting",
    "info": "Intermediate level oil painting for Study Abroad in Florence program.",
    "prereq": {}
  },
  {
    "uid": "798458",
    "code": "FLOR3303",
    "subject": "FLOR",
    "number": "3303",
    "honors": false,
    "writing": false,
    "name": "Intermediate Life Drawing",
    "fullname": "Intermediate Life Drawing",
    "info": "Intermediate Level life drawing course for Study Abroad in Florence program.",
    "prereq": {}
  },
  {
    "uid": "793158",
    "code": "FLOR3332",
    "subject": "FLOR",
    "number": "3332",
    "honors": false,
    "writing": false,
    "name": "Understanding Modern Italy",
    "fullname": "Understanding Modern Italy: An Anthropology of Contemporary Italian Society",
    "info": "Italian culture/society through politics, economics, and cultural trends.",
    "prereq": {}
  },
  {
    "uid": "795822",
    "code": "FLOR3333",
    "subject": "FLOR",
    "number": "3333",
    "honors": false,
    "writing": false,
    "name": "Pol and Econ Hist of Europe",
    "fullname": "Political and Economic History of Europe in the 20th Century",
    "info": "Not printed in catalog.",
    "prereq": {}
  },
  {
    "uid": "798459",
    "code": "FLOR3334",
    "subject": "FLOR",
    "number": "3334",
    "honors": false,
    "writing": false,
    "name": "Great Works of Ital Lit",
    "fullname": "Great Works of Italian Literature",
    "info": "Great works of Italian authors from 14th-20th Centuries. Students look at how Italian masterpieces have effected European culture as a whole.",
    "prereq": {}
  },
  {
    "uid": "798460",
    "code": "FLOR3335",
    "subject": "FLOR",
    "number": "3335",
    "honors": false,
    "writing": false,
    "name": "Cross Cultural Psychology",
    "fullname": "Cross Cultural Psychology",
    "info": "Communication/culture. How they relate to one another. Students use Italy and its culture as backdrop for learning intercultural awareness. Students reflect on their experiences in the culture as they are experiencing them.",
    "prereq": {}
  },
  {
    "uid": "802958",
    "code": "FLOR3336",
    "subject": "FLOR",
    "number": "3336",
    "honors": false,
    "writing": false,
    "name": "Learning-Internships: Florence",
    "fullname": "Learning Through Internships: Florence",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "802959",
    "code": "FLOR3340",
    "subject": "FLOR",
    "number": "3340",
    "honors": false,
    "writing": false,
    "name": "Italian for Interns",
    "fullname": "Italian for Interns",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "802960",
    "code": "FLOR3342",
    "subject": "FLOR",
    "number": "3342",
    "honors": false,
    "writing": false,
    "name": "Understdg. Modern Italy (ITAL)",
    "fullname": "Understanding Modern Italy (taught in Italian)",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "802961",
    "code": "FLOR3344",
    "subject": "FLOR",
    "number": "3344",
    "honors": false,
    "writing": false,
    "name": "Great Works of Ital Lit (ITAL)",
    "fullname": "Italian-taught Great Works of Italian Literature",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "806492",
    "code": "FLOR3345",
    "subject": "FLOR",
    "number": "3345",
    "honors": false,
    "writing": false,
    "name": "The Global City: Florence",
    "fullname": "Analyzing and Exploring the Global City: Florence",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "815057",
    "code": "FLOR3346",
    "subject": "FLOR",
    "number": "3346",
    "honors": false,
    "writing": false,
    "name": "Sociology of Crime in Italy",
    "fullname": "Sociology of Crime: Mafia and the Media in Italy",
    "info": "Study abroad course",
    "prereq": {}
  },
  {
    "uid": "827301",
    "code": "FLOR3501",
    "subject": "FLOR",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Intermed Painting in Florence",
    "fullname": "Intermediate Painting in Florence",
    "info": "This studio course for intermediate students builds on foundational painting techniques and focuses on refining artistic expression and technical proficiency. Students will explore advanced composition strategies, deepen their observational skills, and experiment with sophisticated color theory applications to enhance their creative works. During the first half of the course assignments will concentrate on developing different skills and building techniques, using traditional and experimental approaches to painting. During the second half of the course students will use these skills to develop their own work.\nStudents will explore the history of art in Florence in the many galleries and museums and will use this knowledge to inform their own work. The course will cover the technical developments of the Renaissance, including the study of perspective, line, and form. Through guided instructional sessions, students will gradually cultivate their unique artistic styles and engage in individual research, which may involve integrating themes and techniques from both modern and contemporary art. This study will be the basis for developing painting skills through engaging with, and responding to, the works and artists they study.\nThe course will also have a focus on developing skills for self and peer criticism to discuss the development of the work. Students will create a final piece supported by an Artist's Statement, a research breakdown outlining the evolution of the project's concept and technical development.",
    "prereq": {}
  }
]