[
  {
    "uid": "009552",
    "code": "FREN1",
    "subject": "FREN",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "Reading French",
    "fullname": "Reading French in the Arts and Sciences",
    "info": "Basic reading knowledge of French language; intensive reading and translation of texts from a wide variety of disciplines. Students successfully completing the course obtain Language Certification in French which satisfies a Graduate School requirement.",
    "prereq": {}
  },
  {
    "uid": "797357",
    "code": "FREN100",
    "subject": "FREN",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "Reading French",
    "fullname": "Reading French in the Arts and Sciences",
    "info": "Basic reading knowledge of French language. Intensive reading/translation of texts from a wide variety of disciplines. Students successfully completing the course obtain language certification in French.",
    "prereq": {}
  },
  {
    "uid": "009591",
    "code": "FREN1001",
    "subject": "FREN",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Beginning French I",
    "fullname": "Beginning French I",
    "info": "Bonjour! Join us in learning the global language of diplomacy, culture, cuisine, and commerce!  French is spoken on five continents, in approximately 40 countries, and even in Maine and Louisiana. Studying French will deepen your understanding of world history and the relationships between different cultures around the globe and close to home. Studying the language of Les Misérables, Monet, and joie de vivre allows you to access some of the most amazing art, thought, and food on the planet!\n\nBeginning French (French 1001) is designed for students with little or no knowledge of the French language. It focuses on developing your intercultural, reading, listening, speaking, and writing skills. By the end of this course, you will be able to communicate about family, housing, and school. You will also gain familiarity with French-speaking communities around the world. The course features preparatory and practice activities outside of class designed to encourage analysis of language structure so that class time can be primarily devoted to meaningful interaction in French.",
    "prereq": {}
  },
  {
    "uid": "009592",
    "code": "FREN1002",
    "subject": "FREN",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Beginning French II",
    "fullname": "Beginning French II",
    "info": "Bienvenue en 1002! Ready to embark on a new journey to further develop your knowledge of the beautiful language of French? If you passed French 1001 or have taken the Entrance Proficiency Test (EPT) and were placed in 1002, this course is for you!\n\nWhile exploring topics such as French holidays and cultural celebrations and traditions, food, and ecology, you will further develop your listening, speaking, reading, and writing skills. You will also learn about the concept of laïcité, one of the pillars of French society, and the differences and similarities between the school systems in France and the U.S.\n\nPreparatory activities designed to encourage students to analyze grammar points need to be completed at home so that class time can be primarily devoted to meaningful interactions in French.\n\nprereq: C- or better in FREN 1001, or EPT (for students taking their first French course at the U)",
    "prereq": {
      "or": [
        "009591"
      ]
    }
  },
  {
    "uid": "009593",
    "code": "FREN1003",
    "subject": "FREN",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "Intermediate French I",
    "fullname": "Intermediate French I",
    "info": "Nous vous souhaitons la bienvenue dans le troisième semestre de français.  In this course, you will explore current issues such as the role technology plays in today's society and living a healthy lifestyle. Other themes include family, friends, and current social issues such as environment, energy, and immigration. Students will use film, excerpts of literature, and other authentic texts as part of the curriculum. Upon completion of the class, you will have more confidence in expressing past, future, and hypothetical events as well as your own opinions, feelings, and regrets.\n\nFrench 1003 is a five-credit course, so you should plan to spend an additional 10 hours a week on coursework outside the classroom. Upon successful completion of this course you will be able to enroll in French 1004.\n\nprereq: C- or better in FREN 1002 or 1022, or EPT (for students taking their first French course at the U)",
    "prereq": {
      "or": [
        "009592",
        "013834"
      ]
    }
  },
  {
    "uid": "009594",
    "code": "FREN1004",
    "subject": "FREN",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Intermediate French II",
    "fullname": "Intermediate French II",
    "info": "Vous êtes les bienvenus! Come join us in exploring some of the foundations of cultural identity. What does it mean to be \"French?\" What does it mean to be \"American?\" What are some things that people living within a particular culture have in common as a function of living in that culture? Where do personal and cultural identities intersect? We pay special attention to development of intercultural competence, comparing how food, child-rearing practices, elements of national identity, and diversity are treated in France and the US. We revisit many grammar concepts you have seen before, focusing on accuracy and extended language use. \n\nThis course will allow you to be much more confident in using comparisons, narrating (past and present), linking ideas together into longer discourse, describing, etc. Upon successful completion of this course, you should be solidly in the Intermediate ranges of proficiency in French, able to travel and/or use French for your own goals. You will also be prepared for more advanced study in French here or abroad (FREN 3015 and 3014 are options after this course).\n\nprereq: C- or better in FREN 1003, or EPT/LPE (for students taking their first French course at the U)",
    "prereq": {
      "or": [
        "009593"
      ]
    }
  },
  {
    "uid": "013834",
    "code": "FREN1022",
    "subject": "FREN",
    "number": "1022",
    "honors": false,
    "writing": false,
    "name": "Accelerated Beginning French",
    "fullname": "Accelerated Beginning French",
    "info": "Heureux de vous revoir! Because you have studied French before, you already know what a wonderful language it is. This course is designed to return you to studying the language of Les Misérables, Monet, and joie de vivre! French 1022 is an accelerated review of French 1001 followed by the material covered in French 1002. At the end of this course, you will be able to communicate about topics such as food, family, school, the environment, travel and much more.\n\nIf you have had a gap of more than a year since your last French class, you need to take the EPT to place into French 1022.  ",
    "prereq": {}
  },
  {
    "uid": "016276",
    "code": "FREN1102",
    "subject": "FREN",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Beginning French II",
    "fullname": "Beginning French II, Transition",
    "info": "Basic listening, speaking, reading, and writing skills.  Emphasizes communicative competence.  Cultural readings.",
    "prereq": {}
  },
  {
    "uid": "016275",
    "code": "FREN1103",
    "subject": "FREN",
    "number": "1103",
    "honors": false,
    "writing": false,
    "name": "Beginning French III",
    "fullname": "Beginning French III, Transition",
    "info": "Basic listening, speaking, reading, and writing skills.  Emphasizes communicative competence.  Cultural readings.",
    "prereq": {}
  },
  {
    "uid": "816012",
    "code": "FREN1501",
    "subject": "FREN",
    "number": "1501",
    "honors": false,
    "writing": false,
    "name": "Gateways to French Studies ENG",
    "fullname": "Gateways to French and Francophone Studies: English Only",
    "info": "What key moments in French and Francophone culture can help us understand our world today? What are French and Francophone Studies? This course taught in English answers these questions by letting you discover the diverse cultures of France and French-speaking countries (such as Senegal, Canada or Belgium), and the ways we study them in the humanities. You will encounter texts, visual material, films, music, and historical events from various eras and learn how to make sense of them. Faculty from the French program will come and share with you what they research and why. \n\nA portion of the semester will be devoted to one of two role-playing simulations. During these weeks, you will delve deeply into the material, researching your historical character and working with other students whose goals converge with yours to sway the opinions of your other classmates. Along the way, you will enhance your skills in public speaking and writing. \n\n(1) The French Revolution. Where did the notion of the social contract and human rights come from? What dilemmas did the people of France face in this turbulent attempt to transition from monarchy to a new form of government?\n\n(2) The 1889 Universal Exhibition in Paris, which was a focus of debates about art, esthetics and urbanism. Do you want to be a traditional painter, Van Gogh, an art critic, a woman patron, an anarchist, or a worker on the Eiffel Tower? How did each of these groups or individuals understand the role of art?\n\nYou can take French 1501 as a freestanding class or at the same time as a language class (FREN 1001-1004, depending on your level). The class is required for new majors and minors in French Studies, but you can take it simply to discover the fascinating cultures of French-speaking communities worldwide! \n\nNo prerequisites. All materials for French 1501 are in English, and students in all programs are welcome!",
    "prereq": {
      "or": [
        "816012"
      ]
    }
  },
  {
    "uid": "816013",
    "code": "FREN1502",
    "subject": "FREN",
    "number": "1502",
    "honors": false,
    "writing": false,
    "name": "Gateways to French Studies BIL",
    "fullname": "Gateways to French and Francophone Studies: Bilingual",
    "info": "What are French and Francophone Studies? What key moments in French and Francophone culture can help us understand our world today? This course taught in English answers these questions by letting you discover the diverse cultures of France and French-speaking countries (such as Senegal, Canada or Belgium), and the ways we study them in the humanities. You will encounter texts, visual material, films, music, and historical events from various eras and learn how to make sense of them. Faculty from the French program will come and share with you what they research and why. \n\nA portion of the semester will be devoted to one of two role-playing simulations. During these weeks, you will delve deeply into the material, researching your historical character and working with other students whose goals converge with yours to sway the opinions of your other classmates. Along the way, you will enhance your skills in public speaking and writing. \n\n(1) The French Revolution. Where did the notion of the social contract and human rights come from? What dilemmas did the people of France face in this turbulent attempt to transition from monarchy to a new form of government?\n\n(2) The 1889 art exhibition in Paris, which was a focus of debates about art, esthetics and urbanism. Do you want to be a traditional painter, Van Gogh, an art critic, a woman patron, an anarchist, or a worker on the Eiffel Tower?\n\nFrench 1502 is taught in English, but it includes some readings in French. In some semesters, it may also include occasional discussions or small group activities in French. \n\nYou can take French 1502 as a freestanding class or at the same time as a language class (FREN 3015-3016, depending on your level). The class is required for new majors and minors in French Studies, but you can take it simply to discover the fascinating cultures of French-speaking communities worldwide! \n\nprereq: FREN 1004 (or equivalent through the LPE)",
    "prereq": {
      "and": [
        "009594"
      ]
    }
  },
  {
    "uid": "795824",
    "code": "FREN1904",
    "subject": "FREN",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Freshman",
    "prereq": {}
  },
  {
    "uid": "793978",
    "code": "FREN1905",
    "subject": "FREN",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "799343",
    "code": "FREN1907W",
    "subject": "FREN",
    "number": "1907",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Freshman",
    "prereq": {}
  },
  {
    "uid": "811730",
    "code": "FREN1908W",
    "subject": "FREN",
    "number": "1908",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Freshman",
    "prereq": {}
  },
  {
    "uid": "795955",
    "code": "FREN1909W",
    "subject": "FREN",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Freshman",
    "prereq": {}
  },
  {
    "uid": "793979",
    "code": "FREN1910W",
    "subject": "FREN",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "820156",
    "code": "FREN1911",
    "subject": "FREN",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Globalizing the “Middle Ages”",
    "fullname": "Globalizing the “Middle Ages”",
    "info": "Students in this seminar will help develop “Medieval Studies” as a part of “Global Studies.” After learning how Medieval Studies was invented, developed, and utilized in the development of European power relations from the 14th through 21st centuries, students will read, view, and discuss material about other parts of the globe during the time corresponding to Europe’s Middle Ages (ca. 500- 1500 C.E.), envisaging how the integration of such material into “Medieval Studies” can change not only education, but also social and political encounters among peoples and nations today.",
    "prereq": {}
  },
  {
    "uid": "016081",
    "code": "FREN3010",
    "subject": "FREN",
    "number": "3010",
    "honors": false,
    "writing": false,
    "name": "French Expression",
    "fullname": "French Expression",
    "info": "Intensive work in oral/written communication.",
    "prereq": {}
  },
  {
    "uid": "009595",
    "code": "FREN3014",
    "subject": "FREN",
    "number": "3014",
    "honors": false,
    "writing": false,
    "name": "French Phonetics",
    "fullname": "French Phonetics",
    "info": "Survey of major institutions/components of modern French culture with special attention to lexical enrichment/pronunciation practice. Study of linguistic description of French sounds/transcription.\n\nprereq: 1004",
    "prereq": {
      "and": [
        "009594"
      ]
    }
  },
  {
    "uid": "009596",
    "code": "FREN3015",
    "subject": "FREN",
    "number": "3015",
    "honors": false,
    "writing": false,
    "name": "Adv Grammar & Communication",
    "fullname": "Advanced French Grammar and Communication",
    "info": "Taught entirely in French. Prerequisite: French 1004 or LPE.\n\nVoilà, c'est fait: You have completed French 1004 or passed the LPE. You are certified as an intermediate speaker of French.\n\nDon't lose your momentum! French 3015 allows you to start working toward a new goal: advanced proficiency in speaking, listening, reading, and writing French. Along with this higher proficiency comes a deeper understanding of French and Francophone culture around the world.\n\nIn this class, you will focus on grammar in context, reading longer, more complex texts in the original language. You will write short compositions that include various genres such as the first-person narrative, the business letter, and the essay. You will learn how to use the correction software Antidote as a means of perfecting your writing skills. In class, you will participate in group work to boost your oral comprehension skills and in writing workshops to boost your writing skills. Listening activities include a film, an audiobook, a song, and videos related to readings. Written exercises include translation, grammar, and vocabulary building.\n\nLiterary readings include excerpts from a medieval text (La légende de Tristan et Iseut), as well as four 20th-century texts (by Danielle Cadorette, Annie Ernaux, Albert Camus, and Pierre-Jakez Hélias). Journalists include Kamel Daoud (published in the Le Monde) and Fatym Layachi (published in the Moroccan newspaper Tel Quel). Based on these readings and discussions of the themes of friendship, family, education, work, technology, and bilingualism, you will explore notions of identity in the French and Francophone world.",
    "prereq": {}
  },
  {
    "uid": "009597",
    "code": "FREN3016",
    "subject": "FREN",
    "number": "3016",
    "honors": false,
    "writing": false,
    "name": "Advanced French Comp & Comm",
    "fullname": "Advanced French Composition and Communication",
    "info": "Taught entirely in French. \n\nIn this class, you will continue the work you began in FREN 3015, keeping your eyes on the goal of advanced proficiency. You will continue to focus on grammar in context, reading challenging texts in the original language. You will write short compositions that include various genres: a summary of an online article of your own choosing, an argumentative essay, and a film or literary analysis. You will perfect your use of the correction software Antidote as you move toward advanced proficiency in writing. In class, you will participate in group work to boost your oral comprehension skills and in writing workshops to boost your writing skills. Listening activities include several films, a song, and videos related to readings. Written exercises include translation, grammar, and vocabulary building.\n\nThis course explores identity in the French and Francophone world through the themes of youth, travel, immigration, and colonisation. Literary readings include excerpts from the 18th century (Voltaire and Louis Sébastien Mercier), the 20th century (Ying Chen and Driss Chraïbi), and the 21st century (Tahar Ben Jelloun, Abdellah Taïa, and Mina Oualdlhadj). Newspaper articles include the sociologist Edgar Morin (published in Le Monde) and the columnist Réda Allali (published in the Moroccan newspaper Tel Quel). But French 3016 adds new genres of writing as well. We will read selections from crime novels (René Frégni and Michel de Roy), a graphic novel (Marjane Satrapi), and science-fiction (Pierre Boulle). This course is a good stepping-stone for an advanced course in French and Francophone film as we read about and view samples of Algerian, Canadian, and French films. \n\nPrerequisite: FREN 3015.\n",
    "prereq": {}
  },
  {
    "uid": "811268",
    "code": "FREN3017W",
    "subject": "FREN",
    "number": "3017",
    "honors": false,
    "writing": true,
    "name": "Advanced Writing in French",
    "fullname": "Advanced Writing in French: Genre, Style, Rhetoric",
    "info": "Workshop in journalistic/literary prose writing in French. Theme of journalistic/literary readings varies. Article, editorial, review, essay, biography, tale, prose poem. Word order, sequence of tenses, indirect discourse, literary tenses. Overview of stylistics/use of rhetorical figures.\n\nprereq: 3016",
    "prereq": {
      "and": [
        "009597"
      ]
    }
  },
  {
    "uid": "009598",
    "code": "FREN3018",
    "subject": "FREN",
    "number": "3018",
    "honors": false,
    "writing": false,
    "name": "Oral Communication",
    "fullname": "French Oral Communication",
    "info": "Intensive work in oral expression, listening comprehension. Incorporates wide variety of cultural topics.\n\nprereq: 3014, 3015",
    "prereq": {
      "and": [
        "009595",
        "009596"
      ]
    }
  },
  {
    "uid": "009599",
    "code": "FREN3019",
    "subject": "FREN",
    "number": "3019",
    "honors": false,
    "writing": false,
    "name": "French Diction",
    "fullname": "French Diction and Speaking",
    "info": "The relationship between the written and the spoken word in French. Learn to read prose and poetry aloud from a text using appropriate French pronunciation, etc. Leads to play readings and possible performance.",
    "prereq": {}
  },
  {
    "uid": "009600",
    "code": "FREN3022",
    "subject": "FREN",
    "number": "3022",
    "honors": false,
    "writing": false,
    "name": "Business French",
    "fullname": "The Language and Culture of Business in France",
    "info": "Examines French business language as well as business practices and culture in France.  Includes cross-cultural analysis.\n\nprereq: 3015; completion of 3016 recommended",
    "prereq": {
      "and": [
        "009596",
        "009597"
      ]
    }
  },
  {
    "uid": "009601",
    "code": "FREN3101W",
    "subject": "FREN",
    "number": "3101",
    "honors": false,
    "writing": true,
    "name": "Methods in French Studies",
    "fullname": "Methods in French and Francophone Studies",
    "info": "Taught entirely in French. \n\nIn this course, you will delve deeply into original stories, lyrics, plays, and films in French, from around the world and across time. What verbal and visual codes carry meaning in a given culture? How do cultures create a space for the subject or the self?\n\nAs you discuss these questions, you will become a faster and more independent reader, gain sensitivity to the sonorities and rhythms of the French language and the nuances of sense it makes possible, and learn to perceive implicit meaning in texts. Theoretical readings and lessons in developing thesis statements and organizing arguments will enhance your ability to understand and create complex arguments in French.\n\nEach individual section of this course addresses these questions with a different selection of readings and films grouped around a specific theme, so please consult the Class Info page to find out more!\n\nnonfiction texts, cultural artifacts, and audio/visual media pertaining to France and Francophone communities across the centuries.\n\nprereq: 3016 or equiv",
    "prereq": {
      "or": [
        "009597"
      ]
    }
  },
  {
    "uid": "009602",
    "code": "FREN3111",
    "subject": "FREN",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Medieval Stories",
    "fullname": "Medieval Stories",
    "info": "Reading/discussion of major forms of medieval tale (comic, bawdy, moralizing, fantasy, historical) in modern French translation. Explores their relationship to development of French culture, especially urbanization, class relations, marriage, role of Church.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "811254",
    "code": "FREN3115",
    "subject": "FREN",
    "number": "3115",
    "honors": false,
    "writing": false,
    "name": "Saints & Soldiers of Med. Fr.",
    "fullname": "Saints and Soldiers of Medieval France",
    "info": "Representations of saints/soldiers in literature 1050-1250.  All texts read in modern French translation. Discussion of social function of literature. Relation between church/secular powers, ethics/politics, violence/sacred.\n\nprereq: 3101W",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "791139",
    "code": "FREN3140",
    "subject": "FREN",
    "number": "3140",
    "honors": false,
    "writing": false,
    "name": "Topics in Medieval/Renaissance",
    "fullname": "Topics in Medieval and Renaissance Literature",
    "info": "Different aspects of French literature/culture of medieval/Renaissance periods (11th-16th century). Content varies depending on instructor. Literary, historical, or social problem. Period, author, genre, or topic of interest. Readings may be literary, critical, cultural, historical, political, etc. Specific content posted in department and in Course Guide.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009603",
    "code": "FREN3170",
    "subject": "FREN",
    "number": "3170",
    "honors": false,
    "writing": false,
    "name": "Subj(s) Classicism",
    "fullname": "The Unruly Subject(s) of Classicism: Writing, History, Power in Ancien Ri??gime France",
    "info": "The formation of subjectivity in the literature and culture of 17th- and 18th-century France.  Aesthetics of classicism, consolidation of state power, and representations of the individual in theater, novel, and prose.",
    "prereq": {}
  },
  {
    "uid": "009604",
    "code": "FREN3172",
    "subject": "FREN",
    "number": "3172",
    "honors": false,
    "writing": false,
    "name": "Court Society",
    "fullname": "The Court Society: Literature, Culture, Spectacle",
    "info": "Examines the court and salon society in 17th-century France. The production of taste, sociability, and national identity is considered in literature, painting, architecture, and the plastic arts. \n\nprereq: FREN 3101W or instructor permission.",
    "prereq": {
      "or": [
        "009601"
      ]
    }
  },
  {
    "uid": "009606",
    "code": "FREN3181",
    "subject": "FREN",
    "number": "3181",
    "honors": false,
    "writing": false,
    "name": "Enlightenment in French Prose",
    "fullname": "Mapping Enlightenment in 17th- and 18th-Century French Prose",
    "info": "The themes, values, and critical strategies of the social and intellectual movement designated by the term Enlightenment. The legacy of the Enlightenment project will also be evaluated.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "791140",
    "code": "FREN3240",
    "subject": "FREN",
    "number": "3240",
    "honors": false,
    "writing": false,
    "name": "Topics in Ancien Regime Lit.",
    "fullname": "Topics in Ancien Regime Literature",
    "info": "Different aspects of French literature/culture from early modern period (17th/18th centuries). Content varies depending on instructor. Literary, historical, or social problems. Period, author, genre or topic of interest. Readings may be literary, critical, cultural, historical, political, etc. Specific content posted in department/Course Guide.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009605",
    "code": "FREN3250",
    "subject": "FREN",
    "number": "3250",
    "honors": false,
    "writing": false,
    "name": "Topics: French Poetry",
    "fullname": "Topics in French Poetry",
    "info": "The historical, political, and social contexts of the evolution of French poetry from its origins to the modern era. While studying primarily lyric poetry, epic and dramatic poetry may also be considered when appropriate.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009608",
    "code": "FREN3260",
    "subject": "FREN",
    "number": "3260",
    "honors": false,
    "writing": false,
    "name": "20C French Theatre",
    "fullname": "Dramas of Culture: 20th-Century French and Francophone Theater",
    "info": "Key movements, dramatists, and contexts of 20th-century French and Francophone theater.  Areas of study include naturalist and symbolist legacies as well as existentialist, avant-garde, and contemporary performance and drama.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009609",
    "code": "FREN3280",
    "subject": "FREN",
    "number": "3280",
    "honors": false,
    "writing": false,
    "name": "The Indispensables",
    "fullname": "The Indispensables: French Texts to 1789",
    "info": "Exposes students to some essential works in French which were characteristic in their time or influential later. Works of all genres will be read. The actual works read will differ according to instructor preference. Taught in French.",
    "prereq": {}
  },
  {
    "uid": "009612",
    "code": "FREN3310",
    "subject": "FREN",
    "number": "3310",
    "honors": false,
    "writing": false,
    "name": "Lit of Revolution",
    "fullname": "Literature of Revolution and Upheaval",
    "info": "A study of revolutionary movements in France seen through novels placed in historical context. Content may vary, but course will deal with radical historical, cultural and literary changes in France primarily in the modern period.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009607",
    "code": "FREN3321",
    "subject": "FREN",
    "number": "3321",
    "honors": false,
    "writing": false,
    "name": "Bourgeois Subject",
    "fullname": "Producing the Bourgeois Subject: The Sense of Self in 18th-Century French Literature",
    "info": "Examines the role of 18th-century literature in shaping the notion of self and social identity.  Attention is given to the novel and its relation to new reading practices and publics.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009610",
    "code": "FREN3330",
    "subject": "FREN",
    "number": "3330",
    "honors": false,
    "writing": false,
    "name": "Lit & 20th-Century France",
    "fullname": "Literature and the Making of Modern France: 20th-Century Perspectives",
    "info": "Developments of literary culture of 20th-century France in the context of historical events and social transformations.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "809938",
    "code": "FREN3333",
    "subject": "FREN",
    "number": "3333",
    "honors": false,
    "writing": false,
    "name": "The Idea of Paris",
    "fullname": "The Idea of Paris: Writing and Viewing the City",
    "info": "Meanings that Paris acquired in modern French cultural imagination, particularly as protean metaphor, myth or allegory for effects of urban, national, global modernity. Literature, painting, photography, film, architecture, urban theory from Enlightenment to present.\n\nprereq: 3101W",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "791141",
    "code": "FREN3340",
    "subject": "FREN",
    "number": "3340",
    "honors": false,
    "writing": false,
    "name": "Topics in Modern French Lit.",
    "fullname": "Topics in Modern French Literature",
    "info": "Modern French literature/culture, defining modern period as that of post-Revolution France. Content varies depending on instructor. Literary, historical, or social problem. Period, author, genre, or topic of interest. Specific content posted in department/in Course Guide.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "818589",
    "code": "FREN3345",
    "subject": "FREN",
    "number": "3345",
    "honors": false,
    "writing": false,
    "name": "The Holocaust in France",
    "fullname": "The Holocaust in France: Literature, History, Testimony",
    "info": "This course examines the event of the Holocaust (which we call \"Shoah\" in France since the 80s and especially since the film of the same name by Claude Lanzmann) in literature, film, and archives. France has a complex relationship with Jews since the Middle Ages. During the French Revolution (1789), then under the Empire (Napoleon Bonaparte, 1800-1815), the Jews benefitted from political emancipation. The Republic defended the equality of Jews before the law as French citizens. But France was also the country of political anti-Semitism and of the Dreyfus Affair (there were in the nineteenth century some very virulent anti-Semitic propaganda writers, for example Edouard Drumont, author of Jewish France, in 1880, just before the Dreyfus Affair). This history of the Jews in France culminates with the Vichy regime, the policy of collaboration with Nazi Germany, antisemitic writings and propaganda emanating from important writers such as Louis-Ferdinand Celine and politicians, and the deportation of part of the Jewish population to the extermination camps. How does this story affect fictional writing, and debates on how to represent this event? More than a course on the Holocaust, we explore the story of its reminiscence in French culture. It is not a history class, but a class in culture, literature, memory and testimony. \n\nprereq: FREN 3015; it is recommended that students have taken, or take concurrently, FREN 3101W.",
    "prereq": {
      "or": [
        "009596",
        "009601"
      ]
    }
  },
  {
    "uid": "016086",
    "code": "FREN3350",
    "subject": "FREN",
    "number": "3350",
    "honors": false,
    "writing": false,
    "name": "Topics in Literature",
    "fullname": "Topics in Literature",
    "info": "Focuses on a problem, period, author, or topic of interest. Specific content posted in department and listed in Course Guide.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009613",
    "code": "FREN3360",
    "subject": "FREN",
    "number": "3360",
    "honors": false,
    "writing": false,
    "name": "Coming of Age",
    "fullname": "Coming of Age",
    "info": "A study of the literature of education and of the process of youth coming to terms with society. Readings will vary and will be drawn from a number of time periods.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009611",
    "code": "FREN3370",
    "subject": "FREN",
    "number": "3370",
    "honors": false,
    "writing": false,
    "name": "Legal Issues, Novel",
    "fullname": "Legal Issues in French Novels Since the Revolution",
    "info": "The importance of legal issues in French novels. Analyze the impact of lawyers, judges, witnesses, the police, etc. on individuals and interpersonal relationships. Examine how novelists short-circuit the legal system and create alternative ways of settling disputes.",
    "prereq": {}
  },
  {
    "uid": "009614",
    "code": "FREN3371",
    "subject": "FREN",
    "number": "3371",
    "honors": false,
    "writing": false,
    "name": "Writing Crisis",
    "fullname": "Writing Crisis in (Post) Modern Times",
    "info": "Examines the meaning and purpose of the notion of crisis in French novels. How crises, be they personal, social or political, prompt writers to create new modes of (dis)connecting with other persons, institutions, and society.\n",
    "prereq": {}
  },
  {
    "uid": "009615",
    "code": "FREN3380",
    "subject": "FREN",
    "number": "3380",
    "honors": false,
    "writing": false,
    "name": "Lit in Modern Times",
    "fullname": "Modern Times: Literature of the 19th and 20th Centuries",
    "info": "Variously emphasizing the two centuries. Sample topics include: esthetic currents (Realism and the novel); cultural considerations (gendered representations); philosophical concerns (the relation of individuals to the social body in civil society).",
    "prereq": {}
  },
  {
    "uid": "009616",
    "code": "FREN3410",
    "subject": "FREN",
    "number": "3410",
    "honors": false,
    "writing": false,
    "name": "Topics: Quebecois Literature",
    "fullname": "Topics in Quebecois Literature",
    "info": "Study writing produced in Quebec as a literature of its own, not simply as a part of Canadian literature. Literature will be studied in relation to other North American literatures and to Francophone literature produced elsewhere in the world.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "816934",
    "code": "FREN3431",
    "subject": "FREN",
    "number": "3431",
    "honors": false,
    "writing": false,
    "name": "Gender in Francophone Lit/Film",
    "fullname": "Gender and Sexuality in Francophone Literature and Cinema",
    "info": "This course will introduce students to colonial and postcolonial representations of gender and sexuality in Francophone contexts. Through literary and cinematic works from the Caribbean, Maghreb, West Africa, and Quebec, we will examine constructions and deconstructions of gender roles and sexual norms in relation to other identity categories such as race, class, nation and religion. We will consider topics such as exotic portrayals of the other, repressive and rebellious eroticism, and ambivalent or unruly affirmations of identity. Taught in French. \n\nprereq: 3101W. All courses counted toward a major/minor must be taken on an A-F basis. ",
    "prereq": {
      "or": [
        "009601"
      ]
    }
  },
  {
    "uid": "803184",
    "code": "FREN3451",
    "subject": "FREN",
    "number": "3451",
    "honors": false,
    "writing": false,
    "name": "North African Cinema",
    "fullname": "North African Cinema",
    "info": "Cinemas of the Maghreb, the northern African nations of Morocco, Algeria, and Tunisia. Themes may include North African cities/communities; gender, class and ethnicity; and impact of globalization in migratory patterns. Films. Readings in philosophy, history, sociology, anthropology, and cultural critique.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "802110",
    "code": "FREN3471",
    "subject": "FREN",
    "number": "3471",
    "honors": false,
    "writing": false,
    "name": "Francophone African Lit & Cult",
    "fullname": "Topics in Francophone African Literature and Cultures",
    "info": "Issues relevant to cultures/societies of francophone Sub-Saharan Africa as reflected in literature, film, and cultural critique.\n\nprereq: 3101W",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "009618",
    "code": "FREN3479",
    "subject": "FREN",
    "number": "3479",
    "honors": false,
    "writing": false,
    "name": "Francophone Writers",
    "fullname": "Francophone Writers of the African Diaspora",
    "info": "Literature from Francophone North Africa, Africa, the Caribbean of the colonial and/or post-colonial eras, examined in its historical, cultural, or ideological contexts. Reading selections may include texts by immigrant or exiled writers in France.\n\nprereq: 3101",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "808266",
    "code": "FREN3500",
    "subject": "FREN",
    "number": "3500",
    "honors": false,
    "writing": false,
    "name": "Linguistic Analysis of French",
    "fullname": "Linguistic Analysis of French",
    "info": "Introduction to scientific study of French language. Concepts/terminology to describe nature/functioning of sounds, words, sentences/meaning, and variation. Taught in French.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009596"
      ]
    }
  },
  {
    "uid": "009619",
    "code": "FREN3501",
    "subject": "FREN",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Structure of French: Phonology",
    "fullname": "Structure of French: Phonology",
    "info": "Advanced study of sound system of contemporary French.\n\nprereq: 3015, [3014 or 3500 or Ling 3001 or instr consent]",
    "prereq": {
      "and": [
        "009596",
        {
          "or": [
            "009595",
            "808266",
            "010450"
          ]
        }
      ]
    }
  },
  {
    "uid": "009620",
    "code": "FREN3502",
    "subject": "FREN",
    "number": "3502",
    "honors": false,
    "writing": false,
    "name": "French Morph & Syn",
    "fullname": "Structure of French: Morphology and Syntax",
    "info": "Linguistic study of contemporary French word forms (inflectional and derivational morphology); introduction to French syntax (linguistic study of grammar) and characteristic syntactic constructions.",
    "prereq": {}
  },
  {
    "uid": "009621",
    "code": "FREN3521",
    "subject": "FREN",
    "number": "3521",
    "honors": false,
    "writing": false,
    "name": "History of French",
    "fullname": "History of the French Language",
    "info": "Origins/development of French language from Latin to contemporary French. Selected texts. Present stage/development.\n\nprereq: 3015, [3500 or Ling 3001 or instr consent]",
    "prereq": {
      "and": [
        "009596",
        {
          "or": [
            "808266",
            "010450"
          ]
        }
      ]
    }
  },
  {
    "uid": "009622",
    "code": "FREN3531",
    "subject": "FREN",
    "number": "3531",
    "honors": false,
    "writing": false,
    "name": "Sociolinguistics of French",
    "fullname": "Sociolinguistics of French",
    "info": "Explores variation in the use of French associated with factors such as medium (oral/written), style (formal/informal), region, social and economic groups.\n\nPrerequisite: FREN 3015 or equivalent; strongly recommended: FREN 3500 or LING 3001.",
    "prereq": {}
  },
  {
    "uid": "793980",
    "code": "FREN3541",
    "subject": "FREN",
    "number": "3541",
    "honors": false,
    "writing": false,
    "name": "Oral Discourse",
    "fullname": "Oral Discourse of French",
    "info": "Contemporary French discourse. Spontaneous, multi-speaker discourse. Readings. Syntactic analysis. Phonological/lexical particularities. Macro level analyses. Discourse analysis/conversation analysis.\n\nprereq: 3015, [3500 or Ling 3001 or instr consent]",
    "prereq": {
      "and": [
        "009596",
        {
          "or": [
            "808266",
            "010450"
          ]
        }
      ]
    }
  },
  {
    "uid": "816301",
    "code": "FREN3571",
    "subject": "FREN",
    "number": "3571",
    "honors": false,
    "writing": false,
    "name": "Old French in Action",
    "fullname": "Old French in Action: Medieval French Language through Songs, Tales, and Plays",
    "info": "This course introduces students to Old French grammar, vocabulary, and phonetics through language exercises and the reading and performance of original texts. Along the way, students will learn about the genres of medieval French literature, how these texts originally circulated, and how artists today work from medieval manuscripts to create new performances.\n\nCoursework will alternate between language lessons, oral and written exercises, the reading, translation, and discussion of Old French texts, and recitation and interpretive performance. \n\nThis course is designed for undergraduates and will be based entirely on material available in modern editions or online in print-like format. It will also make use of audio recordings. Graduate students, honors undergraduates, and other high-achieving juniors and seniors should register for French 5571, which covers the same material and also how to read and edit texts from medieval manuscripts.\n\nprereq: 3016. Class is conducted in modern French. No prior experience of the medieval language is expected.",
    "prereq": {
      "or": [
        "009597"
      ]
    }
  },
  {
    "uid": "009623",
    "code": "FREN3601",
    "subject": "FREN",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "French Civilization & Cltr 1",
    "fullname": "French Civilization and Culture I",
    "info": "Roman occupation of Gaul to 1715.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009596"
      ]
    }
  },
  {
    "uid": "009624",
    "code": "FREN3602",
    "subject": "FREN",
    "number": "3602",
    "honors": false,
    "writing": false,
    "name": "French Civ & Culture II",
    "fullname": "French Civilization and Culture II",
    "info": "1705 to present.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009596"
      ]
    }
  },
  {
    "uid": "804701",
    "code": "FREN3611",
    "subject": "FREN",
    "number": "3611",
    "honors": false,
    "writing": false,
    "name": "Speaking Love in Mdval France",
    "fullname": "Speaking of Love in Medieval France: Stories, Songs, and Letters",
    "info": "How did people talk about love in the Middle Ages? What songs did they sing about it? What stories did they tell? How did it define the self?\n\nIn this course, we will study troubadour songs, short tales, romances, and letters composed in twelfth-century France and Anglo-Norman England. We will examine their historical context: the patronage of Eleanor of Aquitaine and her family, the broader context of medieval court life, and the erudite circles that formed during the rise of the Parisian schools. Because what people say is determined by the language, motifs, and forms that they have available to them, we will discuss the transmission of ideas about love and the interpretation of exemplary figures (Tristan and Iseut, Lancelot and Guinevere). We will also consider the literary form of these texts in relation to their meaning. But at the heart of our inquiry will be the notion of the self. How did \"speaking of love\" allow medieval writers to cultivate their own subjectivity or individuality?\n\nTexts will include troubadour songs, the Lais of Marie de France, the romances of Tristan and Iseut by Thomas of England and Béroul, Chrétien de Troyes's Arthurian romances, and the letters of Abelard and Heloise. We will also study a film about Eleanor of Aquitaine and her family (The Lion in Winter, 1968) and a contemporary opera about a troubadour and his lady, Kaija Saariaho's L'Amour de loin (2000). \n\nFREN 3611 and 3711 meet together. Both FREN 3611 and 3711 are taught in English. Reading and writing assignments for FREN 3611 are in modern French. FREN 3611 may count towards the major or minor in French Studies. Reading and writing assignments for FREN 3711 are in English. FREN 3711 does not count towards the major or minor in French Studies. \n\nprereq: FREN 3015",
    "prereq": {
      "and": [
        "009596"
      ]
    }
  },
  {
    "uid": "810009",
    "code": "FREN3612",
    "subject": "FREN",
    "number": "3612",
    "honors": false,
    "writing": false,
    "name": "Reading Libertinism",
    "fullname": "Reading Libertinism",
    "info": "Underground, subversive, philosophical countercultures that push society to limits. Why society has underground, how it shapes understanding of individual responsibility. Shifting notions of acceptable/moral behavior. Philosophizing/imagining in creating society/values.\n\nprereq: 3015, 3101 strongly recommended",
    "prereq": {
      "and": [
        "009596",
        "009601"
      ]
    }
  },
  {
    "uid": "820220",
    "code": "FREN3614",
    "subject": "FREN",
    "number": "3614",
    "honors": false,
    "writing": false,
    "name": "Disabilities: Litr/Cultr/Art",
    "fullname": "Disabled Bodies, Minds and Selves in French Literature, Culture and Art",
    "info": "At any given moment in history, what are the socio-cultural forces that give rise to an understanding of physical difference? What forces enable self-expression, self-determination, and liberation from this understanding? This course explores the history of disability and the representations of disability in literature, art, and culture.  We will investigate theory and praxis of disability studies in France. Spanning the Renaissance to the present day, this course seeks to understand the experiences of disabled people and their communities in different periods, through a variety of genres and media, exploring medical histories, representation (for a public presumed to be able-bodied), memoir, activism, and art and literature by disabled people. ",
    "prereq": {}
  },
  {
    "uid": "825513",
    "code": "FREN3632",
    "subject": "FREN",
    "number": "3632",
    "honors": false,
    "writing": false,
    "name": "French Revolutn & Human Rights",
    "fullname": "Revolution and Human Rights: The French Revolution and its Legacy",
    "info": "What role did the French Revolution play in shaping how we think about the possibility of massive social change, justice, and rights today? How especially did 18th-century philosophy, culture, politics, and economics influence the development of what we call universal individual \"human rights.\" We also ask: could we have done better?  To do so, we will play \"Rousseau, Burke, and Revolution in France, 1791,\" a Reacting to the Past flipped-classroom role-playing game. Working individually and in teams, students will prepare speeches, produce pamphlets and newspapers, not only to learn about the stakes of this historical turning point and the philosophical debates surrounding it, but also to imagine changing it. We will also seek out and document the legacy of this Revolution in our lives and around the world today.  This class offers students the knowledge and skills to participate in substantive debate aimed at solving problems collectively, to effect change aligning with their beliefs and philosophies, and to reflect critically on historical legacy.\n\nprereq Fren 3015; Fren 3016 recommended",
    "prereq": {
      "and": [
        "009596",
        "009597"
      ]
    }
  },
  {
    "uid": "809377",
    "code": "FREN3636",
    "subject": "FREN",
    "number": "3636",
    "honors": false,
    "writing": false,
    "name": "Human Nature:Descartes to Sade",
    "fullname": "Human Nature from Descartes to Sade",
    "info": "Explores ethical dimensions of human nature/legacy from Descartes to Sade.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009596"
      ]
    }
  },
  {
    "uid": "009626",
    "code": "FREN3650",
    "subject": "FREN",
    "number": "3650",
    "honors": false,
    "writing": false,
    "name": "Topics: French/Franco Cultures",
    "fullname": "Topics in French/Francophone Cultures",
    "info": "French/francophone cultures in various historical, social, political, and geographical contexts.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009596"
      ]
    }
  },
  {
    "uid": "818599",
    "code": "FREN3661",
    "subject": "FREN",
    "number": "3661",
    "honors": false,
    "writing": false,
    "name": "Francophone North America",
    "fullname": "Francophone North America",
    "info": "Ce cours est une introduction aux différentes communautés francophones en Amérique du Nord.  Nous retracerons l?histoire de ces communautés au Canada, aux États-Unis et à Saint-Pierre et Miquelon (une collectivité d?outre-mer française) et examinerons les différentes manifestations des cultures francophones qui se sont développées: leur langue, leur musique, leurs traditions, leurs drapeaux, leur cuisine, leur littérature et leur cinéma. Nous explorerons aussi l?impact que ces cultures exercent sur une région majoritairement anglophone.  \n\nThis course is an introduction to the different Francophone communities in North America.  We will retrace the history of these communities in Canada, the United States, and Saint-Pierre et Miquelon (a French collectivité d?outre-mer), and examine the different manifestations of the Francophone cultures that developed: language, music, traditions, flags, cuisine, literature, and cinema.  We will also explore the impact that these cultures exert on a region predominantly English speaking.\n",
    "prereq": {}
  },
  {
    "uid": "820057",
    "code": "FREN3662",
    "subject": "FREN",
    "number": "3662",
    "honors": false,
    "writing": false,
    "name": "Francophone Louisiana",
    "fullname": "A Cultural and Linguistic Exploration of the Francophone Communities in Louisiana",
    "info": "The history of the French language in Louisiana is unique and fascinating. Educational initiatives in recent years have helped create a new generation of speakers, building hope that Louisiana French and its culture will continue to evolve and be present in \"The Pelican State.\" Through the study of sociolinguistic, literary, and historical documents, film and music of the region, we will explore the questions of language variation, features of Louisiana French, challenges speakers face, the impact of the arts and the role education plays in maintaining Louisiana French culture.\n \nThe best part of the course for many who have taken it before is the spring break trip to visit areas of Francophone Louisiana in person. Students who have traveled to Louisiana stated that they appreciated the opportunity to connect with real professionals actively working in the field of French language engagement, since these connections could benefit their own careers later on.\n \nPrerequisite: FREN 3015. Fees for the trip will be charged to your student account upon enrollment.",
    "prereq": {}
  },
  {
    "uid": "820058",
    "code": "FREN3663",
    "subject": "FREN",
    "number": "3663",
    "honors": false,
    "writing": false,
    "name": "Francophone Louisiana",
    "fullname": "A Cultural and Linguistic Exploration of the Francophone Communities in Louisiana",
    "info": "The history of the French language in Louisiana is unique and fascinating. Educational initiatives in recent years have helped create a new generation of speakers, building hope that Louisiana French and its culture will continue to evolve and be present in \"The Pelican State.\"  Through the study of sociolinguistic, literary, and historical documents, film and music of the region, we will explore the questions of language variation, features of Louisiana French, challenges speakers face, the impact of the arts and the role education plays in maintaining Louisiana French culture.\n \nStudents who have taken this course before stated an appreciation of a  Francophone Louisiana focus as it challenged their perceptions about how a Francophone society can interact with, value, and use the French language in daily life and in terms of constructing/ maintaining identity and traditions.  They also enjoyed discovering how a language variety (i.e. Louisiana French) can build a community and affect more than just linguistic aspects of life.\n\nPrerequisite: FREN 3015.",
    "prereq": {}
  },
  {
    "uid": "804549",
    "code": "FREN3671",
    "subject": "FREN",
    "number": "3671",
    "honors": false,
    "writing": false,
    "name": "Violence and the Spectacular",
    "fullname": "Theaters of Pain: Violence and the Spectacular in Premodern France",
    "info": "Why physical violence is intimately linked to spectacular representations. Theater as collective arena in which society attends to pressing problems. How/why repeated presence of violence was something meant to behold in early modern France and elsewhere.\n\nprereq: 3015, concurrent registration is required (or allowed) in 3016",
    "prereq": {
      "and": [
        "009596",
        "009597"
      ]
    }
  },
  {
    "uid": "810187",
    "code": "FREN3681",
    "subject": "FREN",
    "number": "3681",
    "honors": false,
    "writing": false,
    "name": "Literature and Transgression",
    "fullname": "Literature and Transgression",
    "info": "French literature/literary theory. Connection between literary act/transgression. Literati's fascination for transgression to French Revolution/Reign of Terror. Modern poetry in mid-19th century. Avant-garde movements of 20th century.\n\nprereq: 3015, 3016",
    "prereq": {
      "and": [
        "009596",
        "009597"
      ]
    }
  },
  {
    "uid": "009628",
    "code": "FREN3705",
    "subject": "FREN",
    "number": "3705",
    "honors": false,
    "writing": false,
    "name": "Atlantic Crossings",
    "fullname": "Atlantic Crossings: The French View Americans (and Vice Versa)",
    "info": "French perspectives on the United States and American perspectives on France in \"travel\" literature and film examined in their historical, political, and cultural contexts. Taught in English. Knowledge of French helpful but not necessary.",
    "prereq": {}
  },
  {
    "uid": "009625",
    "code": "FREN3706",
    "subject": "FREN",
    "number": "3706",
    "honors": false,
    "writing": false,
    "name": "Quebec in Translat",
    "fullname": "Quebec: Literature and Film in Translation",
    "info": "A survey of Quebec literature and film in English or with subtitles. Particular attention paid to cultural tensions as well as to the impact of women writers and filmmakers on each genre.\n",
    "prereq": {}
  },
  {
    "uid": "009627",
    "code": "FREN3710W",
    "subject": "FREN",
    "number": "3710",
    "honors": false,
    "writing": true,
    "name": "Reading Libertinage",
    "fullname": "Reading Libertinage: Dangerous Lessons in Translation",
    "info": "Libertinage and the libertine in French literature of 17th/18th centuries. Literary forms as ways to produce/question desire. Taught in English. All readings in English.",
    "prereq": {}
  },
  {
    "uid": "808344",
    "code": "FREN3711",
    "subject": "FREN",
    "number": "3711",
    "honors": false,
    "writing": false,
    "name": "Speaking Love in Mediev France",
    "fullname": "Speaking of Love in Medieval France: Stories, Songs, and Letters",
    "info": "How did people talk about love in the Middle Ages? What songs did they sing about it? What stories did they tell? How did it define the self?\n\nIn this course, we will study troubadour songs, short tales, romances, and letters composed in twelfth-century France and Anglo-Norman England. We will examine their historical context: the patronage of Eleanor of Aquitaine and her family, the broader context of medieval court life, and the erudite circles that formed during the rise of the Parisian schools. Because what people say is determined by the language, motifs, and forms that they have available to them, we will discuss the transmission of ideas about love and the interpretation of exemplary figures (Tristan and Iseut, Lancelot and Guinevere). We will also consider the literary form of these texts in relation to their meaning. But at the heart of our inquiry will be the notion of the self. How did \"speaking of love\" allow medieval writers to cultivate their own subjectivity or individuality?\n\nTexts will include troubadour songs, the Lais of Marie de France, the romances of Tristan and Iseut by Thomas of England and Béroul, Chrétien de Troyes's Arthurian romances, and the letters of Abelard and Heloise. We will also study a film about Eleanor of Aquitaine and her family (The Lion in Winter, 1968) and a contemporary opera about a troubadour and his lady, Kaija Saariaho's L'Amour de loin (2000). \n\nFREN 3611 and 3711 meet together. Both FREN 3611 and 3711 are taught in English. Reading and writing assignments for FREN 3611 are in modern French. FREN 3611 may count towards the major or minor in French Studies. Reading and writing assignments for FREN 3711 are in English. FREN 3711 does not count towards the major or minor in French Studies. ",
    "prereq": {}
  },
  {
    "uid": "806644",
    "code": "FREN3712",
    "subject": "FREN",
    "number": "3712",
    "honors": false,
    "writing": false,
    "name": "Reading Libertinism",
    "fullname": "Reading Libertinism",
    "info": "Underground, subversive, philosophical countercultures. How it shapes understanding of individual responsibility. Shifting notions of acceptable/moral behavior. Groups that limits of what is imaginable. Role of philosophizing/imagining in creating society/values.",
    "prereq": {}
  },
  {
    "uid": "825514",
    "code": "FREN3732",
    "subject": "FREN",
    "number": "3732",
    "honors": false,
    "writing": false,
    "name": "French Revolutn & Human Rights",
    "fullname": "Revolution and Human Rights: The French Revolution and its Legacy",
    "info": " What role did the French Revolution play in shaping how we think about the possibility of massive social change, justice, and rights today? How especially did 18th-century philosophy, culture, politics, and economics influence the development of what we call universal individual \"human rights.\" We also ask: could we have done better?  To do so, we will play \"Rousseau, Burke, and Revolution in France, 1791,\" a Reacting to the Past flipped-classroom role-playing game. Working individually and in teams, students will prepare speeches, produce pamphlets and newspapers, not only to learn about the stakes of this historical turning point and the philosophical debates surrounding it, but also to imagine changing it. We will also seek out and document the legacy of this Revolution in our lives and around the world today.  This class offers students the knowledge and skills to participate in substantive debate aimed at solving problems collectively, to effect change aligning with their beliefs and philosophies, and to reflect critically on historical legacy\n\nNo prerequisites. All materials for Fren 3732 are in English, and students in all programs are welcome! ",
    "prereq": {
      "or": [
        "825514"
      ]
    }
  },
  {
    "uid": "795826",
    "code": "FREN3733",
    "subject": "FREN",
    "number": "3733",
    "honors": false,
    "writing": false,
    "name": "The Idea of Paris",
    "fullname": "The Idea of Paris",
    "info": "Meanings of Paris acquired in modern French cultural imagination, particularly as protean metaphor, myth or allegory for effects of urban, national, global modernity. Literature, painting, photography, film, architecture,  urban theory from Enlightenment to present.",
    "prereq": {}
  },
  {
    "uid": "809376",
    "code": "FREN3736",
    "subject": "FREN",
    "number": "3736",
    "honors": false,
    "writing": false,
    "name": "Human Nature from Descartes",
    "fullname": "Human Nature from Descartes to Sade",
    "info": "Explores ethical dimensions of human nature history/legacy from Descartes to Sade.",
    "prereq": {}
  },
  {
    "uid": "818590",
    "code": "FREN3745",
    "subject": "FREN",
    "number": "3745",
    "honors": false,
    "writing": false,
    "name": "The Holocaust in France",
    "fullname": "The Holocaust in France: Literature, History, Testimony",
    "info": "This course examines the event of the Holocaust (which we call \"Shoah\" in France since the '80s and especially since the film of the same name by Claude Lanzmann) in literature, film, and archives. France has a complex relationship with Jews since the Middle Ages. During the French Revolution (1789), then under the Empire (Napoleon Bonaparte, 1800-1815), the Jews benefitted from political emancipation. The Republic defended the equality of Jews before the law as French citizens. But France was also the country of political anti-Semitism and of the Dreyfus Affair (there were in the nineteenth century some very virulent anti-Semitic propaganda writers, for example Edouard Drumont, author of Jewish France, in 1880, just before the Dreyfus Affair). This history of the Jews in France culminates with the Vichy regime, the policy of collaboration with Nazi Germany, antisemitic writings and propaganda emanating from important writers such as Louis-Ferdinand Celine and politicians, and the deportation of part of the Jewish population to the extermination camps. How does this story affect fictional writing, and debates on how to represent this event? More than a course on the Holocaust, we explore the story of its reminiscence in French culture. It is not a history class, but a class in culture, literature, memory, and testimony. FREN 3345 and 3745 meet together. Both FREN 3345 and 3745 are taught in English. Reading and writing assignments for FREN 3345 are in modern French. FREN 3345 may count towards the major or minor in French Studies. Reading and writing assignments for FREN 3745 are in English. FREN 3745 does not count towards the major or minor in French Studies. Prerequisite: None",
    "prereq": {}
  },
  {
    "uid": "790094",
    "code": "FREN3750",
    "subject": "FREN",
    "number": "3750",
    "honors": false,
    "writing": false,
    "name": "Topic Fr/Francophone Lit & Cul",
    "fullname": "Topics in French or Francophone Literature and Culture",
    "info": "Theme, problem, period, or topic of interest in French or Francophone literature or culture. See Class Schedule. Taught in English.\n\nprereq: Non-French major; knowledge of French helpful",
    "prereq": {}
  },
  {
    "uid": "810188",
    "code": "FREN3781",
    "subject": "FREN",
    "number": "3781",
    "honors": false,
    "writing": false,
    "name": "Literature and Transgression",
    "fullname": "Literature and Transgression",
    "info": "French literature/literary theory. Connection between literary act/transgression. Literati's fascination for transgression to French Revolution/Reign of Terror. Modern poetry in mid-19th century. Avant-garde movements of 20th century. Taught in English.",
    "prereq": {}
  },
  {
    "uid": "818690",
    "code": "FREN3850",
    "subject": "FREN",
    "number": "3850",
    "honors": false,
    "writing": false,
    "name": "Topics: French/Franco Media",
    "fullname": "Topics in French and Francophone Media",
    "info": "Topics in French and Francophone media. Content varies by instructor; topics may include studies in French and/or Francophone cinema, film, theater, television, and/or other media.prereq: FREN 3015.",
    "prereq": {
      "and": [
        "009596"
      ]
    }
  },
  {
    "uid": "818849",
    "code": "FREN3852",
    "subject": "FREN",
    "number": "3852",
    "honors": false,
    "writing": false,
    "name": "Memory in French/Franc Cinema",
    "fullname": "Memory in French and Francophone Cinema",
    "info": "This course will examine cinema’s privileged relationship with memory. Our itinerary will take us through key French and Francophone films, asking how these works record, construct and deconstruct “individual” and “collective” memories. Topics will include bearing witness to the traumas of war, genocide and colonization; commemorating resistance and fostering emancipation; interventions in identity politics; (re)partitions of rural and urban spaces; and the elusive divide between fiction, documentary and memoir. Students will be expected to master a vocabulary for the formal analysis of film. \n\nprereq: Students should have completed FREN 3016 with a minimum grade of B.",
    "prereq": {
      "and": [
        "009597"
      ]
    }
  },
  {
    "uid": "826447",
    "code": "FREN3861",
    "subject": "FREN",
    "number": "3861",
    "honors": false,
    "writing": false,
    "name": "Francophone World in Film",
    "fullname": "The Francophone World in Film : West and Central Africa and the French Caribbean",
    "info": "This course focuses on films representing peoples and cultures from Francophone Africa south of Sahara, the French Caribbean as well as black populations in France. It explores historical developments, cultures, and current issues facing the above populations through a set of contemporary films that stand out both for their exceptional aesthetic quality as well as their remarkable ability to confront pressing political and social issues. We will first discuss the ways in which visual media from the west have contributed to creating and perpetuating dominant tropes concerning black peoples, looking especially at the contribution of colonial imagery to the creation of such perceptions. We will subsequently examine the emergence of film-making in Africa before focusing on films by black directors from West and Central Africa, France, and the French Caribbean. Issues explored include migration, race, the colonial legacy, postcolonial identities, gender, sexuality, globalization, and development. The course is taught in French.\n\nprereq: FREN 3016",
    "prereq": {
      "and": [
        "009597"
      ]
    }
  },
  {
    "uid": "810702",
    "code": "FREN3896",
    "subject": "FREN",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "French-Speaking Internship",
    "fullname": "Internship in a French-Speaking Milieu",
    "info": "\t\nVolunteer or paid work in French-speaking milieu, undertaken at initiative of individual students. Work under direction of work supervisor/advisor chosen from among regular or adjunct faculty. Complete two-three written assignments designed to enhance language/field-specific learning. prereq: 3016, 3014 [3018 strongly recommended], [3022 strongly recommended for students undertaking internships in business, government, or law]",
    "prereq": {
      "and": [
        "009597",
        "009595",
        {
          "and": [
            "009598"
          ]
        },
        {
          "or": [
            "009600"
          ]
        }
      ]
    }
  },
  {
    "uid": "789496",
    "code": "FREN3995",
    "subject": "FREN",
    "number": "3995",
    "honors": false,
    "writing": false,
    "name": "Directed Teaching",
    "fullname": "Directed Teaching",
    "info": "Directed teaching.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "798791",
    "code": "FREN4001",
    "subject": "FREN",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Beg French for Grad Research I",
    "fullname": "Beginning French for Graduate Student Research I",
    "info": "Bonjour! Join us in learning the global language of diplomacy, culture, cuisine, and commerce! French  is spoken on five continents, in approximately 40 countries, and even in Maine and Louisiana. Studying French will deepen your understanding of world history and the relationships between different cultures around the globe and close to home. Studying the language of Les Misérables, Monet, and joie de vivre allows you to access some of the most amazing art, thought, and food on the planet!\n\nBeginning French (French 1001) is designed for students with little or no knowledge of the French language. It focuses on developing your intercultural, reading, listening, speaking, and writing skills. By the end of this course, you will be able to communicate about family, housing, and school. You will also gain familiarity with French-speaking communities around the world. The course features preparatory and practice activities outside of class designed to encourage analysis of language structure so that class time can be primarily devoted to meaningful interaction in French.",
    "prereq": {}
  },
  {
    "uid": "798792",
    "code": "FREN4002",
    "subject": "FREN",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Beg French Grad Research II",
    "fullname": "Beginning French for Graduate Student Research II",
    "info": "Bienvenue en 4002! Ready to embark on a new journey to further develop your knowledge of the beautiful language of French? If you passed French 1001/4001 or have taken the Entrance Proficiency Test (EPT) and were placed in 1002, this course is for you!\n\nWhile exploring topics such as French holidays and cultural celebrations and traditions, food, and ecology, you will further develop your listening, speaking, reading, and writing skills. You will also learn about the concept of laïcité, one of the pillars of French society, and the differences and similarities between the school systems in France and the US.\n\nPreparatory activities designed to encourage students to analyze grammar points need to be completed at home so that class time can be primarily devoted to meaningful interactions in French.\n\nprereq: FREN 1001/4001 or equivalent.",
    "prereq": {
      "or": [
        "009591",
        "798791"
      ]
    }
  },
  {
    "uid": "798793",
    "code": "FREN4003",
    "subject": "FREN",
    "number": "4003",
    "honors": false,
    "writing": false,
    "name": "Int French for Grad Research I",
    "fullname": "Int French for Grad Research I",
    "info": "Nous vous souhaitons la bienvenue dans le troisième semestre de français. In this course, you will explore current issues such as the role technology plays in today's society and living a healthy lifestyle. Other themes include family, friends, and current social issues such as environment, energy, and immigration. Students will use film, excerpts of literature, and other authentic texts as part of the curriculum. Upon completion of the class, you will have more confidence in expressing past, future, and hypothetical events as well as your own opinions, feelings, and regrets.\n\nFrench 4003 is a five-credit course, so you should plan to spend an additional 10 hours a week on coursework outside the classroom. Upon successful completion of this course you will be able to enroll in French 4004.\n\nprereq: C- or better in FREN 1002/4002 or 1022/4022, or EPT (for students taking their first French course at the U)",
    "prereq": {
      "or": [
        "009592",
        "798792",
        "013834",
        "800834"
      ]
    }
  },
  {
    "uid": "798794",
    "code": "FREN4004",
    "subject": "FREN",
    "number": "4004",
    "honors": false,
    "writing": false,
    "name": "Int French Grad Research II",
    "fullname": "Intermediate French for Graduate Student Research II",
    "info": "Vous êtes les bienvenus! Come join us in exploring some of the foundations of cultural identity. What does it mean to be \"French?\" What does it mean to be \"American?\" What are some things that people living within a particular culture have in common as a function of living in that culture? Where do personal and cultural identities intersect? We pay special attention to development of Intercultural Competence, comparing how food, child-rearing practices, elements of national identity, and diversity are treated in France and the US. We revisit many grammar concepts you have seen before, focusing on accuracy and extended language use. This course will allow you to be much more confident in using comparisons, narrating (past and present), linking ideas together into longer discourse, describing, etc. Upon successful completion of this course, you should be solidly in the Intermediate ranges of proficiency in French, able to travel and/or use French for your own goals. You will also be prepared for more advanced study in French here or abroad.\n\nprereq: C- or better in FREN 1003/4003, or EPT/LPE (for students taking their first French course at the U)",
    "prereq": {
      "or": [
        "009593",
        "798793"
      ]
    }
  },
  {
    "uid": "800834",
    "code": "FREN4022",
    "subject": "FREN",
    "number": "4022",
    "honors": false,
    "writing": false,
    "name": "Accel Beg French Grad Research",
    "fullname": "Accelerated Beginning French for Graduate Student Research",
    "info": "Heureux de vous revoir! Because you have studied French before, you already know what a wonderful language it is. This course is designed to return you to studying the language of Les Misérables, Monet, and joie de vivre!  French 1022 is an accelerated review of French 1001/4001 followed by the material covered in French 1002/4002. At the end of this course, you will be able to communicate about topics such as food, family, school, the environment, travel and much more.\n\nIf you have had a gap of more than a year since your last French class, you need to take the EPT to place into French 1022.\n\nprereq: 1001/4001 or equivalent",
    "prereq": {
      "or": [
        "009591",
        "798791"
      ]
    }
  },
  {
    "uid": "009631",
    "code": "FREN4101W",
    "subject": "FREN",
    "number": "4101",
    "honors": false,
    "writing": true,
    "name": "Capstone Seminar French Stud",
    "fullname": "Capstone Seminar in French and Francophone Studies",
    "info": "Course for French and FRIT majors only, to be taken during the final semester.\n\nThis is the capstone experience of the major in French and Francophone or FRIT Studies. Building on your prior coursework, your linguistic expertise in French, and your analytical skills, it gives you the opportunity to do independent, original work on a topic of particular interest to you. \n\nThis project is designed to bridge two upper-division French courses: a 3-credit elective of your own choice in the areas of literature, culture, or linguistics (i.e., one of your required electives numbered 31xx?36xx) and the Senior Project Course itself (4101W/V). The elective provides background in the general field of research, while French 4101W/V allows you to learn the basics of research and advanced academic writing while working with a faculty member and a group of peers involved in similar projects.\n\nprereq: French 3101W and at least three electives completed.",
    "prereq": {
      "and": [
        "009601"
      ]
    }
  },
  {
    "uid": "807439",
    "code": "FREN4109",
    "subject": "FREN",
    "number": "4109",
    "honors": false,
    "writing": false,
    "name": "Senior Project",
    "fullname": "Senior Project in French and Francophone Studies",
    "info": "Research paper based on one written for previous course or expansion of project undertaken in concurrent course.",
    "prereq": {}
  },
  {
    "uid": "807579",
    "code": "FREN4109W",
    "subject": "FREN",
    "number": "4109",
    "honors": false,
    "writing": true,
    "name": "Capstone Ind Stud French Stud",
    "fullname": "Capstone Independent Study in French and Francophone Studies",
    "info": "Completion of research paper based on paper written for previous course or expansion of project undertaken in concurrent course.\n\nprereq: instr consent, [completion of most major coursework or permission of DUS]",
    "prereq": {}
  },
  {
    "uid": "009632",
    "code": "FREN4510",
    "subject": "FREN",
    "number": "4510",
    "honors": false,
    "writing": false,
    "name": "Topics, Linguistics",
    "fullname": "Topics in French Linguistics",
    "info": "Topics from French syntax, pragmatics, discourse analysis, or sociolinguistics.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009596"
      ]
    }
  },
  {
    "uid": "009633",
    "code": "FREN4993",
    "subject": "FREN",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Designed to meet unique requirements agreed upon by a faculty member and a student. Individual contracts are drawn up listing contact hours, number of credits, written and other work required. Each contract will vary.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009635",
    "code": "FREN5250",
    "subject": "FREN",
    "number": "5250",
    "honors": false,
    "writing": false,
    "name": "Poetic Promenades",
    "fullname": "Promenades Poetiques: The Subject in Motion",
    "info": "The search for the subject in poetry and poetic prose as revealed through the motif of the \"promenade\" and experimentation with literary forms.\n\nprereq: 3111 or above",
    "prereq": {
      "or": [
        "009602"
      ]
    }
  },
  {
    "uid": "009634",
    "code": "FREN5260",
    "subject": "FREN",
    "number": "5260",
    "honors": false,
    "writing": false,
    "name": "Returns of Tragedy",
    "fullname": "The Returns of Tragedy",
    "info": "Tragedy as dramatic form in relation to social order, myth and history, and theatre.",
    "prereq": {}
  },
  {
    "uid": "818513",
    "code": "FREN5265",
    "subject": "FREN",
    "number": "5265",
    "honors": false,
    "writing": false,
    "name": "Grad Proseminar French Studies",
    "fullname": "Graduate Proseminar in French Studies",
    "info": "This course introduces new graduate students to the goals, skills, practices, standards and other components of academic careers in the fields of French and Francophone studies, mostly in the US context. It is an introduction to all major aspects of our profession. The seminar combines readings, lectures and presentations by the instructor and guest lecturers, collective discussions, individual and group research, and writing assignments. The final product of the seminar is a talk ready to be delivered at a graduate or national conference, or a book review or short article ready to be submitted for publication.",
    "prereq": {}
  },
  {
    "uid": "010426",
    "code": "FREN5270",
    "subject": "FREN",
    "number": "5270",
    "honors": false,
    "writing": false,
    "name": "Change, French Texts",
    "fullname": "\"To Change or not to Change?\": Speculations on (Post) Modern French Texts",
    "info": "Meaning/purpose of change in French novels. How multiplicity of causes produces major changes in individual's personal/public life. Financial/intellectual speculation.\n",
    "prereq": {}
  },
  {
    "uid": "009636",
    "code": "FREN5301",
    "subject": "FREN",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Crit Iss Fr Studies",
    "fullname": "Critical Issues in French Studies",
    "info": "Introduces the methods of interpretation and critical debates that have shaped and continue to define the discipline of French studies. Provides a practical introduction to graduate-level literary research.\n\nprereq: Grad or instr consent",
    "prereq": {}
  },
  {
    "uid": "788225",
    "code": "FREN5350",
    "subject": "FREN",
    "number": "5350",
    "honors": false,
    "writing": false,
    "name": "Topics in Lit and Culture",
    "fullname": "Topics in Literature and Culture",
    "info": "Problem, period, author, or topic of interest. See Class Schedule.\n\nprereq: 3101 or equiv",
    "prereq": {
      "or": [
        "009601"
      ]
    }
  },
  {
    "uid": "819833",
    "code": "FREN5410",
    "subject": "FREN",
    "number": "5410",
    "honors": false,
    "writing": false,
    "name": "Topics: Quebecois Literature",
    "fullname": "Topics in Quebecois Literature",
    "info": "Study writing produced in Quebec as a literature of its own, not simply as a part of Canadian literature. Literature will be studied in relation to other North American literatures and to Francophone literature produced elsewhere in the world.",
    "prereq": {}
  },
  {
    "uid": "825071",
    "code": "FREN5431",
    "subject": "FREN",
    "number": "5431",
    "honors": false,
    "writing": false,
    "name": "Gender in Francophone Lit/Film",
    "fullname": "Gender and Sexuality in Francophone Literature and Cinema",
    "info": "This course will introduce students to colonial and postcolonial representations of gender and sexuality in Francophone contexts. Through literary and cinematic works from the Caribbean, Maghreb, West Africa, and Quebec, we will examine constructions and deconstructions of gender roles and sexual norms in relation to other identity categories such as race, class, nation and religion. We will consider topics such as exotic portrayals of the other, repressive and rebellious eroticism, and ambivalent or unruly affirmations of identity. Taught in French. ",
    "prereq": {}
  },
  {
    "uid": "009637",
    "code": "FREN5470",
    "subject": "FREN",
    "number": "5470",
    "honors": false,
    "writing": false,
    "name": "Post/Colonial Francophone Lit",
    "fullname": "Post/Colonial Francophone Literatures",
    "info": "Francophone literature from North Africa, Africa, and the Caribbean of the colonial and/or post-colonial eras in the light of relevant literary and cultural theories.\n\nprereq: 3111 or above",
    "prereq": {
      "or": [
        "009602"
      ]
    }
  },
  {
    "uid": "009638",
    "code": "FREN5501",
    "subject": "FREN",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Structure of French: Phonology",
    "fullname": "Structure of French: Phonology",
    "info": "Advanced study of sound system of contemporary French.\n\nprereq: [Ling 3001 or Ling 5001], grad student",
    "prereq": {
      "or": [
        "010450",
        "016263"
      ]
    }
  },
  {
    "uid": "009639",
    "code": "FREN5502",
    "subject": "FREN",
    "number": "5502",
    "honors": false,
    "writing": false,
    "name": "French Morph & Syn",
    "fullname": "Structure of French: Morphology and Syntax",
    "info": "Linguistic study of contemporary French word forms (inflectional and derivational morphology); introduction to French syntax (linguistic study of grammar) and characteristic syntactic constructions.",
    "prereq": {}
  },
  {
    "uid": "009573",
    "code": "FREN5531",
    "subject": "FREN",
    "number": "5531",
    "honors": false,
    "writing": false,
    "name": "Sociolinguistics of French",
    "fullname": "Sociolinguistics of French",
    "info": "Explores variation in the use of French associated with factors such as medium (oral/written), style (formal/informal), region, social, and economic groups.\n\nprereq: Graduate student status and advanced proficiency in French",
    "prereq": {}
  },
  {
    "uid": "793981",
    "code": "FREN5541",
    "subject": "FREN",
    "number": "5541",
    "honors": false,
    "writing": false,
    "name": "Oral Discourse",
    "fullname": "Oral Discourse of French",
    "info": "Nature of contemporary spoken French discourse. Focuses on spontaneous, multi-speaker discourse. Readings include examples of various linguistic approaches to such discourse. Emphasizes syntactic analysis. Phonological/lexical particularities. 'Macro' level analyses such as discourse analysis and conversation analysis.\n\nprereq: 3015, grad student; Ling 5001 recommended",
    "prereq": {
      "and": [
        "009596",
        "016263"
      ]
    }
  },
  {
    "uid": "816062",
    "code": "FREN5571",
    "subject": "FREN",
    "number": "5571",
    "honors": false,
    "writing": false,
    "name": "Old French in Action",
    "fullname": "Old French in Action: Medieval French Language through Songs, Tales, and Plays",
    "info": "This course introduces students to Old French grammar, vocabulary, and phonetics through language exercises and the reading and performance of original texts. Along the way, students will learn about the genres of medieval French literature, how these texts originally circulated, and how artists today work from medieval manuscripts to create new performances.\n\nCoursework will alternate between language lessons, oral and written exercises, the reading, translation, and discussion of Old French texts, and recitation and interpretive performance. \n\nFrench 5571 is designed for graduate students, honors undergraduates, and other high-achieving juniors and seniors with particular interest in medieval language, literature, and culture. It covers the same material as French 3571 and also how to read and edit texts from medieval manuscripts.\n\nClass is conducted in modern French. No prior experience of the medieval language is expected.\n\nprereq: French 3016.",
    "prereq": {
      "and": [
        "009597"
      ]
    }
  },
  {
    "uid": "820217",
    "code": "FREN5614",
    "subject": "FREN",
    "number": "5614",
    "honors": false,
    "writing": false,
    "name": "Disabilities: Litr/Cultr/Art",
    "fullname": "Disabled Bodies, Minds and Selves in French Literature, Culture and Art",
    "info": "At any given moment in history, what are the socio-cultural forces that give rise to an understanding of physical difference? What forces enable self-expression, self-determination, and liberation from this understanding? This course explores the history of disability and the representations of disability in literature, art, and culture. We will investigate theory and praxis of disability studies in France. Spanning the Renaissance to the present day, this course seeks to understand the experiences of disabled people and their communities in different periods, through a variety of genres and media, exploring medical histories, representation (for a public presumed to be able-bodied), memoir, activism, and art and literature by disabled people.",
    "prereq": {}
  },
  {
    "uid": "820458",
    "code": "FREN5852",
    "subject": "FREN",
    "number": "5852",
    "honors": false,
    "writing": false,
    "name": "Memory in French/Franc Cinema",
    "fullname": "Memory in French and Francophone Cinema",
    "info": "This course will examine cinema's privileged relationship with memory. Our itinerary will take us through key French and Francophone films, asking how these works record, construct and deconstruct individual and collective memories. Topics will include bearing witness to the traumas of war, genocide and colonization; commemorating resistance and fostering emancipation; interventions in identity politics; (re)partitions of rural and urban spaces; and the elusive divide between fiction, documentary and memoir. Students will be expected to master a vocabulary for the formal analysis of film. \n\nprereq: Students should have completed FREN 3016 with a minimum grade of B.",
    "prereq": {
      "and": [
        "009597"
      ]
    }
  },
  {
    "uid": "789497",
    "code": "FREN5995",
    "subject": "FREN",
    "number": "5995",
    "honors": false,
    "writing": false,
    "name": "Directed Teaching",
    "fullname": "Directed Teaching",
    "info": "Directed teaching.",
    "prereq": {}
  },
  {
    "uid": "009579",
    "code": "FREN8110",
    "subject": "FREN",
    "number": "8110",
    "honors": false,
    "writing": false,
    "name": "Topics in Early Medieval Lit",
    "fullname": "Topics in Early Medieval French Literature",
    "info": "Introduction to epic, romance, allegory, and theater in Old French readings (12th-13th centuries). Specific topics/texts studied vary. Taught in French.",
    "prereq": {}
  },
  {
    "uid": "009577",
    "code": "FREN8111",
    "subject": "FREN",
    "number": "8111",
    "honors": false,
    "writing": false,
    "name": "Intro: Old French",
    "fullname": "Introduction to Old French",
    "info": "Studies in medieval French: instruction in reading Old French, sources of bibliography, and topics in medieval studies (language and literature). Taught in French.",
    "prereq": {}
  },
  {
    "uid": "009580",
    "code": "FREN8114",
    "subject": "FREN",
    "number": "8114",
    "honors": false,
    "writing": false,
    "name": "Troubadours and Old Occitan",
    "fullname": "Troubadour Lyric and Old Occitan Language",
    "info": "Language and literature of Old Occitan (Old Proven[c]al), chiefly troubadours' songs. Some language instruction, reading of lyrics, consideration of social context, introduction to scholarly tradition. Knowledge of French, Spanish, Italian, or Latin desirable. Taught in English.",
    "prereq": {}
  },
  {
    "uid": "009586",
    "code": "FREN8120",
    "subject": "FREN",
    "number": "8120",
    "honors": false,
    "writing": false,
    "name": "Topics in Later Medieval Lit",
    "fullname": "Topics in Later Medieval French Literature",
    "info": "Problems presented by texts written in France ca. 1300-1500. Evolution of Middle French language. Specific topics/texts vary. Taught in French.\n\nprereq: 8110 or instr consent",
    "prereq": {
      "or": [
        "009579"
      ]
    }
  },
  {
    "uid": "809501",
    "code": "FREN8125",
    "subject": "FREN",
    "number": "8125",
    "honors": false,
    "writing": false,
    "name": "Medieval Short Narrative",
    "fullname": "Short Narrative in the Middle Ages",
    "info": "Short forms of medieval narrative. Examples from French literary production within context of socioeconomic history from ca. 1100 to ca. 1550.\n\nprereq: grad student",
    "prereq": {}
  },
  {
    "uid": "804277",
    "code": "FREN8190",
    "subject": "FREN",
    "number": "8190",
    "honors": false,
    "writing": false,
    "name": "Old French Workshop",
    "fullname": "Old French Workshop",
    "info": "Workshop runs concurrently with seminars on Old French literature. Advanced practicum in reading Old French, with discussions of the particularities of seminar texts and formal, aesthetic, and hermeneutic issues directly related to the original language. Students read portions of texts in Old French and prepare an original translation. The workshop is not an introduction to Old French\n\nStudents planning to make medieval French literature their research field should register for the workshop each time it is offered.\n\nprereq: French 5571 or other prior course on Old French language, concurrent registration in the related Ph.D. seminar.",
    "prereq": {
      "or": [
        "816062"
      ]
    }
  },
  {
    "uid": "818691",
    "code": "FREN8200",
    "subject": "FREN",
    "number": "8200",
    "honors": false,
    "writing": false,
    "name": "Topics Early Modern Lit & Cult",
    "fullname": "Topics in Early Modern French & Francophone Literatures and Cultures",
    "info": "Critical issues relating to the early modern period in French and Francophone literatures and cultures. Content varies by instructor.",
    "prereq": {}
  },
  {
    "uid": "009582",
    "code": "FREN8210",
    "subject": "FREN",
    "number": "8210",
    "honors": false,
    "writing": false,
    "name": "Narrative, History, and Memory",
    "fullname": "Narrative, History, and Memory: Topics",
    "info": "Significance of narrative paradigm in literature, history, and cultural memory. Specific topics/texts treated vary. Taught in French.\n",
    "prereq": {}
  },
  {
    "uid": "009583",
    "code": "FREN8220",
    "subject": "FREN",
    "number": "8220",
    "honors": false,
    "writing": false,
    "name": "Staging the Common",
    "fullname": "Staging the Common",
    "info": "Developments in 20th-century drama/performance in relation to French theatrical tradition. Post-1945 avant-garde innovation, interculturalism in contemporary theater. Specific topics/texts vary. Taught in French.",
    "prereq": {}
  },
  {
    "uid": "809368",
    "code": "FREN8230",
    "subject": "FREN",
    "number": "8230",
    "honors": false,
    "writing": false,
    "name": "Criticism and Thought",
    "fullname": "Critical Issues: Criticism and Thought",
    "info": "Critical issues relating to works in criticism/thought related to French/Francophone literature, philosophy or culture.",
    "prereq": {}
  },
  {
    "uid": "809369",
    "code": "FREN8240",
    "subject": "FREN",
    "number": "8240",
    "honors": false,
    "writing": false,
    "name": "French and Francophone Cinema",
    "fullname": "Critical Issues: French and Francophone Cinema",
    "info": "Critical issues relating to French/Francophone cinema.",
    "prereq": {}
  },
  {
    "uid": "009585",
    "code": "FREN8250",
    "subject": "FREN",
    "number": "8250",
    "honors": false,
    "writing": false,
    "name": "Crit Issues: Poetry",
    "fullname": "Critical Issues: Poetry",
    "info": "Significant critical issues relating to poetic writing of selected authors or periods.",
    "prereq": {}
  },
  {
    "uid": "009574",
    "code": "FREN8260",
    "subject": "FREN",
    "number": "8260",
    "honors": false,
    "writing": false,
    "name": "Crit Issues: Theatr",
    "fullname": "Critical Issues: Theatre",
    "info": "Significant critical issues relating to dramatic writing of selected authors or periods.",
    "prereq": {}
  },
  {
    "uid": "009576",
    "code": "FREN8270",
    "subject": "FREN",
    "number": "8270",
    "honors": false,
    "writing": false,
    "name": "Critical Issues: Prose",
    "fullname": "Critical Issues: Prose",
    "info": "Significant critical issues relating to prose writing of selected authors or periods.",
    "prereq": {}
  },
  {
    "uid": "009581",
    "code": "FREN8271",
    "subject": "FREN",
    "number": "8271",
    "honors": false,
    "writing": false,
    "name": "Ancien Regime",
    "fullname": "The Novel of the Ancien Regime",
    "info": "Considers major novels of the 17th and 18th centuries in connection with developments in such areas as esthetic theory, intellectual currents, social transformations, and reading practices.",
    "prereq": {}
  },
  {
    "uid": "813300",
    "code": "FREN8280",
    "subject": "FREN",
    "number": "8280",
    "honors": false,
    "writing": false,
    "name": "Ethics and Aesthetics",
    "fullname": "Ethics and Aesthetics in French and Francophone Writing",
    "info": "Issues related to the articulation of ethics, politics, and aesthetics in French/Francophone literature and culture.",
    "prereq": {}
  },
  {
    "uid": "009575",
    "code": "FREN8290",
    "subject": "FREN",
    "number": "8290",
    "honors": false,
    "writing": false,
    "name": "Crit Issues: Author",
    "fullname": "Critical Issues: Perspectives on an Author",
    "info": "In-depth study of major author's writing, critical tradition this writing has occasioned, and theoretical issues upon which this writing may be brought to bear.",
    "prereq": {}
  },
  {
    "uid": "010305",
    "code": "FREN8291",
    "subject": "FREN",
    "number": "8291",
    "honors": false,
    "writing": false,
    "name": "Genet's Writings",
    "fullname": "Jean Genet's Writings and French Institutions",
    "info": "Jean Genet's writings at the crossroads of several disciplines (politics, psychoanalysis, religion, and law). Genet's novels, dramas, and political essays explore the power of institutional settings and strategies imagined by individuals to short-circuit their impact.",
    "prereq": {}
  },
  {
    "uid": "788113",
    "code": "FREN8333",
    "subject": "FREN",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "009903",
    "code": "FREN8371",
    "subject": "FREN",
    "number": "8371",
    "honors": false,
    "writing": false,
    "name": "The Rule of Reason",
    "fullname": "The Rule of Reason, The Reign of Madness: Readings in Early Modern France",
    "info": "Relationship between construction of reason and madness in philosophy, legitimation of political rule, and the institution of literature in early modern France.\n",
    "prereq": {}
  },
  {
    "uid": "009588",
    "code": "FREN8410",
    "subject": "FREN",
    "number": "8410",
    "honors": false,
    "writing": false,
    "name": "Topics in Quebecois Lit",
    "fullname": "Topics in Quebecois Literature",
    "info": "Quebecois in relation to other North American literatures and to Francophone literature produced elsewhere in the world. Specific topics/texts vary. Taught in French.",
    "prereq": {}
  },
  {
    "uid": "791055",
    "code": "FREN8420",
    "subject": "FREN",
    "number": "8420",
    "honors": false,
    "writing": false,
    "name": "Crit Issues: Francophone Lit",
    "fullname": "Critical Issues: Francophone Literature",
    "info": "Critical issues relating to literature of Francophone world. Specific topics/texts vary. Taught in French.",
    "prereq": {}
  },
  {
    "uid": "788349",
    "code": "FREN8444",
    "subject": "FREN",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "009587",
    "code": "FREN8521",
    "subject": "FREN",
    "number": "8521",
    "honors": false,
    "writing": false,
    "name": "History of French",
    "fullname": "History of the French Language",
    "info": "History of French from its origins in Latin to the present day. Aspects of diachronic phonology (sound change), morphology, syntax. Taught in French.",
    "prereq": {}
  },
  {
    "uid": "788473",
    "code": "FREN8666",
    "subject": "FREN",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {
      "or": [
        "009552"
      ]
    }
  },
  {
    "uid": "788600",
    "code": "FREN8777",
    "subject": "FREN",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {
      "or": [
        "009552"
      ]
    }
  },
  {
    "uid": "797770",
    "code": "FREN8812",
    "subject": "FREN",
    "number": "8812",
    "honors": false,
    "writing": false,
    "name": "Dissertation Writing Seminar",
    "fullname": "Seminar: Dissertation Preparation and Writing",
    "info": "Initiates dissertation writing process after preliminary exams. Students work with faculty mentors, peer writing groups to develop productive writing/revising strategies. Issues related to professional research/writing. Conceptualizing the dissertation. Developing chapter outlines. Using feedback. Producing a chapter draft.\n\nprereq: Completion of doctoral prelims",
    "prereq": {}
  },
  {
    "uid": "787861",
    "code": "FREN8888",
    "subject": "FREN",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: max 18 cr per semester or summer, 24 cr required",
    "prereq": {
      "or": [
        "009552"
      ]
    }
  },
  {
    "uid": "805038",
    "code": "FREN8888W",
    "subject": "FREN",
    "number": "8888",
    "honors": false,
    "writing": true,
    "name": "Thesis Credit: Doct Sem",
    "fullname": "Thesis Credit Dissertation Seminar",
    "info": "A means for students to make progress on the dissertation in a structured setting. Brings together students writing on related topics. Credits are applied to doctoral thesis credits. Contact instructor for description.\n\nprereq: Doctoral student who has passed oral prelims",
    "prereq": {}
  },
  {
    "uid": "009590",
    "code": "FREN8980",
    "subject": "FREN",
    "number": "8980",
    "honors": false,
    "writing": false,
    "name": "Dir Teaching",
    "fullname": "Directed Teaching",
    "info": "tbd",
    "prereq": {}
  },
  {
    "uid": "009589",
    "code": "FREN8992",
    "subject": "FREN",
    "number": "8992",
    "honors": false,
    "writing": false,
    "name": "Directed Readings",
    "fullname": "Directed Readings for Graduate Students",
    "info": "tbd\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "013196",
    "code": "FREN8994",
    "subject": "FREN",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "tbd\n\nprereq: instr consent; may be taken as tutorial with instr consent",
    "prereq": {}
  }
]