[
  {
    "uid": "797730",
    "code": "FSCN1001",
    "subject": "FSCN",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Orientation to the Majors",
    "fullname": "Orientation to the Majors: Food Science and Nutrition",
    "info": "Advising, student opportunities, networking, what kinds of jobs will be available after graduating.",
    "prereq": {}
  },
  {
    "uid": "007540",
    "code": "FSCN1011",
    "subject": "FSCN",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Science of Food & Cooking",
    "fullname": "Science of Food and Cooking",
    "info": "Souffles, custards, sauces, coffee brewing, candy making used to examine physics/chemistry of heat transfer, foams, gels, emulsions, extractions, crystallization.",
    "prereq": {}
  },
  {
    "uid": "790543",
    "code": "FSCN1012",
    "subject": "FSCN",
    "number": "1012",
    "honors": false,
    "writing": false,
    "name": "Sports Nutrition",
    "fullname": "Sports Nutrition",
    "info": "Physiological function and metabolic fate of all six classes of nutritients ingested by active individuals to improve athletic performance. Impact on physiology of ergogenic aids and various dietary supplements. Overview of these components in fulfilling energy/recovery needs for continual/progressive athletic performance. Web-based course.",
    "prereq": {}
  },
  {
    "uid": "791324",
    "code": "FSCN1013",
    "subject": "FSCN",
    "number": "1013",
    "honors": false,
    "writing": false,
    "name": "Dietary Supplements",
    "fullname": "Dietary Supplements: scientific, regulatory, and cultural aspects",
    "info": "Dietary supplements are commonplace in modern life, especially in the United States, furthermore the dietary supplement industry is a multi billion dollar industry with relatively little government oversight and regulation. Many factors have spurred the use of dietary supplements such as changes in dietary patterns, growing focus on preventative healthcare, marketing & social media (e.g., celebrity and athletic endorsements & consumer anecdotes), and increased accessibility through e-commerce, but there has been little philosophical work on the ethical issues surrounding these. This course is designed to encourage students to critically examine and reflect on these factors as well as dietary supplement use across cultures and the appropriation of traditional medicines and knowledge for commercial gains. Students will also evaluate information on dietary supplements for performance, strength, weight loss, and the treatment of diseases or delay of disease onset and assess the ethical decision making related to the marketing and use of supplements for these purposes.",
    "prereq": {}
  },
  {
    "uid": "794239",
    "code": "FSCN1090",
    "subject": "FSCN",
    "number": "1090",
    "honors": false,
    "writing": false,
    "name": "Topics",
    "fullname": "Topics",
    "info": "Topics in Food Science/Nutrition. Different courses semester to semester depending on what is offered. First runs of new courses, special topics, visiting lecturers may be hosted.",
    "prereq": {}
  },
  {
    "uid": "007467",
    "code": "FSCN1102",
    "subject": "FSCN",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Food:Safety, Risks & Tech",
    "fullname": "Food: Safety, Risks, and Technology",
    "info": "Introduction to inherent risks/safety of food supply. Use of public policy and food technology to reduce risks. Microbiological, chemical, and environmental hazards, government/industry controls.",
    "prereq": {}
  },
  {
    "uid": "007468",
    "code": "FSCN1112",
    "subject": "FSCN",
    "number": "1112",
    "honors": false,
    "writing": false,
    "name": "Principles of Nutrition",
    "fullname": "Principles of Nutrition",
    "info": "This course explores fundamental concepts of nutrition, nutrient functions, human nutritional requirements, and food sources. We will learn about evaluating nutrition information and food safety, and investigate the role of nutrition in chronic disease, public policy, and the environment.\n\nNutrition is both a science and social science. This class involves social aspects, but mainly concerns the biochemistry and physiology of how food is processed in the body. The chapters on carbohydrates, lipids, proteins, and metabolism especially built on biology and physiology. \n\nCourse topics include: 1. essential nutrients (macro-and-micro-nutrients) needed from the diet; 2. major functions of nutrients and physiological changes with deficiency or excess; 3. digestion, absorption, and metabolism of nutrients; 4. weight management; 5. scientific method and nutrition; 6. life cycle issues; 7. food safety issues 8. nutrition for sports\n\nPrerequisites: High school biology and chemistry",
    "prereq": {}
  },
  {
    "uid": "797130",
    "code": "FSCN1511",
    "subject": "FSCN",
    "number": "1511",
    "honors": false,
    "writing": false,
    "name": "Food An Products for Consumers",
    "fullname": "Food Animal Products for Consumers",
    "info": "The compositional variation, processing, selection, storage, cookery, palatability, nutritional value, and safety of red meat, poultry, fish, and dairy products.",
    "prereq": {}
  },
  {
    "uid": "796313",
    "code": "FSCN1902",
    "subject": "FSCN",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Ways of Knowing and Science",
    "fullname": "Ways of Knowing and Science",
    "info": "In this seminar, students will experience diverse ways of knowing through field trips, class discussion, and assignments. Experience is often the best teacher. Through direct experience and involvement with another culture, you will encounter different worldview orientations and ways of seeing and making meaning in the world. The seminar will focus specifically on different cultural orientations to understanding food, health, and wellness relationships.",
    "prereq": {}
  },
  {
    "uid": "798790",
    "code": "FSCN1904",
    "subject": "FSCN",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Topics:  Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics vary.",
    "prereq": {}
  },
  {
    "uid": "806766",
    "code": "FSCN1905",
    "subject": "FSCN",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Antioxidants: How They Protect",
    "fullname": "Antioxidants: How They Protect Your Food and Body",
    "info": "This course will review how changes take place in food and biological systems in the absence and presence of antioxidants. We will concentrate on what antioxidants are, how they act, and how they protect food from deterioration and the body from deteriorative changes. ",
    "prereq": {}
  },
  {
    "uid": "818815",
    "code": "FSCN1906",
    "subject": "FSCN",
    "number": "1906",
    "honors": false,
    "writing": false,
    "name": "Farm to Table: Food Access",
    "fullname": "Farm to Someone Else's Table: Making food accessible for all students",
    "info": "OverviewThis course explores a potential theory of gradually changing the food system to better include meaningful and relevant practical, healthy, affordable, desirable (PHAD) foods that will enhance the nutrition of the general population and ultimately enhance public health. We will foster essential leadership qualities, skills, and knowledge to work toward collective solutions around adaptive challenges. We will create a valid, reliable, and sustainable process for the development of practical, healthier, affordable, and desirable foods.",
    "prereq": {}
  },
  {
    "uid": "809277",
    "code": "FSCN2001",
    "subject": "FSCN",
    "number": "2001",
    "honors": false,
    "writing": false,
    "name": "Cooking: Health & Environment",
    "fullname": "A Food Systems Approach to Cooking for Health and the Environment",
    "info": "This is a fun, hands-on cooking class. It is also an Experiential Learning (EL) course which meets the EL requirement for all CFANS students. This lecture /lab format course will give students the confidence to cook healthful whole foods as they learn about the food system. Subject matter will be taught from an interdisciplinary perspective. Concepts covered include fundamental concepts of nutrition, food sources, food safety, the food system; skills/resources for food choices based on nutritional, environmental, local and global societal implications. We will examine the ethical and civic themes that guide food choices. We will discuss and write about how environmental, cultural, social, and health issues impact personal food choices.  \n\nprereq: [soph, jr, sr] or instructor consent",
    "prereq": {}
  },
  {
    "uid": "810983",
    "code": "FSCN2002",
    "subject": "FSCN",
    "number": "2002",
    "honors": false,
    "writing": false,
    "name": "Cooking on a Student's Budget",
    "fullname": "Healthy Foods, Healthy Lives - Cooking on a Student's Budget",
    "info": "Skills/tools necessary to be comfortable/confident home cooks, knowledgeable about preparation of nutritional/safely prepared foods. Food safety, basic nutrition, technique instruction, budgeting, time management, menu design, measuring, cooking methods, preservation.",
    "prereq": {}
  },
  {
    "uid": "007542",
    "code": "FSCN2021",
    "subject": "FSCN",
    "number": "2021",
    "honors": false,
    "writing": false,
    "name": "Introductory Microbiology",
    "fullname": "Introductory Microbiology",
    "info": "How microbes impact our world in deadly/life-saving ways. Roles of bacteria, fungi, and viruses as agents of human diseases; in food spoilage/food borne diseases; and in food preservation/health promotion. Preventing plant diseases, food/drug production, cleaning up oil spills. Genetic engineering.",
    "prereq": {}
  },
  {
    "uid": "820476",
    "code": "FSCN2512",
    "subject": "FSCN",
    "number": "2512",
    "honors": false,
    "writing": false,
    "name": "Food Customs and Culture",
    "fullname": "Food Customs and Culture",
    "info": "Account of traditional and contemporary food customs and culture. Practice of food choice, preparation, and preservation in the context of worldview, perspectives on diet and health, and belief systems of communities and societies around the world. Major emphasis on US cultures including Native American, Hispanic American, European American, African American, and Asian American. Development of cultural self-understanding and intercultural awareness via food and food habits-related experiences and reflections. ",
    "prereq": {}
  },
  {
    "uid": "007469",
    "code": "FSCN3102",
    "subject": "FSCN",
    "number": "3102",
    "honors": false,
    "writing": false,
    "name": "Introduction to Food Science",
    "fullname": "Introduction to Food Science",
    "info": "Introduction to chemical/physical properties of foods. Evaluating interaction/reaction of foods due to formulation, processing, preparation.\n\nprereq: CHEM 1022 or [CHEM 1062 and CHEM 1066]",
    "prereq": {
      "or": [
        "002385",
        {
          "and": [
            "807756",
            "807754"
          ]
        }
      ]
    }
  },
  {
    "uid": "807818",
    "code": "FSCN3301",
    "subject": "FSCN",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Food Choices",
    "fullname": "Food Choices: Healing the Earth, Healing Ourselves",
    "info": "Link between our food/diet, agricultural practices, and health of planet. Food security. Cultural/personal context of food choices. Ways that food is produced, especially industrial monoculture. Food choices and the earth's bio diversity. Land use, water use, pollution, energy needs, climate change. Alternatives: organic/sustainable, fair trade. Economic policies/choices. Global tradeoffs.\n\nprereq: Jr or sr or grad student",
    "prereq": {}
  },
  {
    "uid": "808515",
    "code": "FSCN3480",
    "subject": "FSCN",
    "number": "3480",
    "honors": false,
    "writing": false,
    "name": "Topics in FScN",
    "fullname": "Topics in Food Science and Nutrition",
    "info": "Lectures by visiting scholar or regular staff member. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "007479",
    "code": "FSCN3612",
    "subject": "FSCN",
    "number": "3612",
    "honors": false,
    "writing": false,
    "name": "Life Cycle Nutrition",
    "fullname": "Life Cycle Nutrition",
    "info": "FSCN 3612 focuses on nutritional requirements and common issues during different stages of the life cycle,\nincluding pregnancy, lactation, childhood, adulthood, and aging.\n\nThere are no required courses for this class; however, it is best to take a basic nutrition class beforehand,\nsuch as FSCN 1112 Principles of Nutrition or an equivalent.",
    "prereq": {}
  },
  {
    "uid": "007481",
    "code": "FSCN3614",
    "subject": "FSCN",
    "number": "3614",
    "honors": false,
    "writing": false,
    "name": "Nutrition Ed & Counseling",
    "fullname": "Nutrition Education and Counseling",
    "info": "Effective communication and counseling skills are essential for all food and nutrition professionals, whether working in clinical, community, or food service settings. This course will teach necessary concepts and skills for entry-level dietitians, such as educational theory, basic counseling techniques, and health disparities and health literacy. You will develop skills and explore these concepts through application: by practicing in small group breakout sessions and by completing written assignments. You will also reflect on the nature of dietetics as a helping profession and your role in supporting clients who want to make lifestyle changes. There are no required prerequisites courses for FSCN 3614. However, it is recommended that students take an introductory nutrition course, such as FSCN 1112 (Principles of Nutrition) or equivalent in order to be prepared.",
    "prereq": {
      "or": [
        "007481",
        "007468"
      ]
    }
  },
  {
    "uid": "007482",
    "code": "FSCN3615",
    "subject": "FSCN",
    "number": "3615",
    "honors": false,
    "writing": false,
    "name": "Soc-Cult Aspects of Food Nutr",
    "fullname": "Sociocultural Aspects of Food, Nutrition, and Health",
    "info": "Sociocultural aspects of regional/cultural diversity in food preferences and food behavior, food habits, demographics, lifestyles, food consumption, and expenditures. Effect of socioeconomic status, religious beliefs, age, and cultural meaning of foods on food choices.  ",
    "prereq": {}
  },
  {
    "uid": "007529",
    "code": "FSCN3662",
    "subject": "FSCN",
    "number": "3662",
    "honors": false,
    "writing": false,
    "name": "Intro to Dietetic Practice",
    "fullname": "Introduction to Dietetic Practice",
    "info": "Introduction to the practice of dietetics in medical centers, residential care centers, ambulatory care clinics, and community service agencies.",
    "prereq": {}
  },
  {
    "uid": "809971",
    "code": "FSCN3667",
    "subject": "FSCN",
    "number": "3667",
    "honors": false,
    "writing": false,
    "name": "ProfessionsDietetics/Nutrition",
    "fullname": "The Professions of Dietetics and Nutrition",
    "info": "An overview of the dietetics and nutrition profession: career options; portfolio development; professional materials and resources; credentialing; and professional topics. Preparation for the next steps toward becoming a registered dietitian. prereq: Sophomore or Junior in the Nutrition Major. Admitted to (or planning to apply to) the Didactic Program in Dietetics (DPD) sub-plan of the Nutrition major.  Strongly recommended to be taken as Sophomore or Junior",
    "prereq": {}
  },
  {
    "uid": "007485",
    "code": "FSCN3731",
    "subject": "FSCN",
    "number": "3731",
    "honors": false,
    "writing": false,
    "name": "Food Service Oper Mgmt Lab",
    "fullname": "Food Service Operations Management Laboratory",
    "info": "Experience in managing a food service operation. On- and off-campus commercial and institutional restaurants used as labs. Required field trips.\n\nprereq: [3102 or concurrent registration is required (or allowed) in  3102], [3732 or concurrent registration is required (or allowed) in  3732]",
    "prereq": {
      "and": [
        {
          "or": [
            "007469"
          ]
        },
        {
          "or": [
            "007487"
          ]
        }
      ]
    }
  },
  {
    "uid": "007487",
    "code": "FSCN3732",
    "subject": "FSCN",
    "number": "3732",
    "honors": false,
    "writing": false,
    "name": "Food Service Operations Mgmt",
    "fullname": "Food Service Operations Management",
    "info": "Planning, preparing, delivering, serving, managing foods served away from home.",
    "prereq": {}
  },
  {
    "uid": "007530",
    "code": "FSCN3796",
    "subject": "FSCN",
    "number": "3796",
    "honors": false,
    "writing": false,
    "name": "Field Exp Food Service Mgmt",
    "fullname": "Field Experience in Food Service Management",
    "info": "Supervised food service production/management experience in a community or health care facility.  ",
    "prereq": {}
  },
  {
    "uid": "819514",
    "code": "FSCN3993",
    "subject": "FSCN",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.\n",
    "prereq": {}
  },
  {
    "uid": "819515",
    "code": "FSCN3994",
    "subject": "FSCN",
    "number": "3994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries\nout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use the\nUniversity-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.\n",
    "prereq": {}
  },
  {
    "uid": "007545",
    "code": "FSCN4096",
    "subject": "FSCN",
    "number": "4096",
    "honors": false,
    "writing": false,
    "name": "PEP: Internship",
    "fullname": "Professional Experience Program: Internship",
    "info": "Apply knowledge from Food Science BS or Nutrition BS program to real-life problems in professional internship. Performance evaluated for credit.\n\nprereq: To register, students must fill out FScN Internship Agreement form, available at http://fscn.cfans.umn.edu. Contact fscnug@umn.edu with questions.",
    "prereq": {}
  },
  {
    "uid": "792300",
    "code": "FSCN4103",
    "subject": "FSCN",
    "number": "4103",
    "honors": false,
    "writing": false,
    "name": "World Food Problems",
    "fullname": "World Food Problems",
    "info": "A multidisciplinary look at problems and possible solutions in food production, storage, and utilization in developing countries. Presentations and discussions introduce conflicting views of population, use of technology, and ethical and cultural values of people in various parts of the world. ",
    "prereq": {}
  },
  {
    "uid": "007470",
    "code": "FSCN4111",
    "subject": "FSCN",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "Food Chemistry",
    "fullname": "Food Chemistry",
    "info": "Study of chemical structures and functional properties of food components in relation to their roles as parts of complex biochemical systems and as modified by environmental and processing factors.",
    "prereq": {}
  },
  {
    "uid": "802983",
    "code": "FSCN4112",
    "subject": "FSCN",
    "number": "4112",
    "honors": false,
    "writing": false,
    "name": "Food Chem & Functional Foods",
    "fullname": "Food Chemistry and Functional Foods",
    "info": "Most-important food constituents, their occurrence, structures, functional properties, and health benefits. Proteins, lipids, carbohydrates, water. Vitamins, minerals, enzymes, phytochemicals, food additives, contaminants.\n\nprereq: FSCN 3102, BIOC 3021",
    "prereq": {
      "and": [
        "007469",
        "014290"
      ]
    }
  },
  {
    "uid": "819581",
    "code": "FSCN4113",
    "subject": "FSCN",
    "number": "4113",
    "honors": false,
    "writing": false,
    "name": "Food Ingredient Functionality",
    "fullname": "Ingredient Functionality and Applications in Food",
    "info": "The course covers the practical use of various ingredients in different food matrices, with a focus on ingredient functionality, interactions, and substitutions. The emphasis will be on demonstrating the use of different ingredients to achieve a desired product quality, while addressing trends such diet restrictions, healthy foods, clean label, fair trade, sustainable sourcing, cost-optimization, among others. Other emphases will include ingredient handling, processing and stability. The course will be organized based on different food systems such as confectionery, baked products, fried foods, dairy and imitation dairy, etc. ",
    "prereq": {}
  },
  {
    "uid": "007472",
    "code": "FSCN4121",
    "subject": "FSCN",
    "number": "4121",
    "honors": false,
    "writing": false,
    "name": "Food Microbiology",
    "fullname": "Food Microbiology",
    "info": "Microorganisms involved in food-borne disease, food fermentations, and food spoilage. Methods for their control/detection. Food microbiology. Foodborne pathogens. Microbial food spoilage. Control of microorganisms in food.\n\nprereq: BIOC 3021, [2021 or VBS 2032 or MICB 3301]",
    "prereq": {
      "and": [
        "014290",
        {
          "or": [
            "007542",
            "012976",
            "008659"
          ]
        }
      ]
    }
  },
  {
    "uid": "007473",
    "code": "FSCN4122",
    "subject": "FSCN",
    "number": "4122",
    "honors": false,
    "writing": false,
    "name": "Food Fermentations & Biotech",
    "fullname": "Food Fermentations and Biotechnology",
    "info": "Major food fermentations important for food industry. Microbiological components. Impact of biotechnology on food production. Genetic tools. Improvement of microbes used in food production by biotechnological approaches.\n\nprereq: [MICB 3301, BIOL 4003] or instr consent",
    "prereq": {
      "and": [
        "008659",
        "009489"
      ]
    }
  },
  {
    "uid": "809969",
    "code": "FSCN4123",
    "subject": "FSCN",
    "number": "4123",
    "honors": false,
    "writing": false,
    "name": "Molecular Bio for Applied Sci",
    "fullname": "Molecular Biology for Applied Scientists",
    "info": "Basics of molecular biology. Origins of molecular biology from discovery to ad of gene cloning/sequencing technologies. PCR, DNA fingerprinting, metagenomics. Synthetic biology for biotechnological production of novel peptides/ proteins.\n\nprereq: [BioC 3021 and MicB 3301] or FScN 2021 or instr consent",
    "prereq": {
      "or": [
        {
          "and": [
            "014290",
            "008659"
          ]
        },
        "007542"
      ]
    }
  },
  {
    "uid": "013271",
    "code": "FSCN4131",
    "subject": "FSCN",
    "number": "4131",
    "honors": false,
    "writing": false,
    "name": "Food Quality",
    "fullname": "Food Quality",
    "info": "This course is designed to give students an overview of the management systems, statistical procedures, and regulatory requirements involved with producing quality food and ingredients. The course material includes risk assessment and management, good manufacturing practices, hazard analysis critical control point (HACCP), statistical methods for process control, total quality management, and food and drug laws. The course is intended primarily for upper-division undergraduates majoring in food science.\n\nprereq: jr or sr",
    "prereq": {}
  },
  {
    "uid": "007543",
    "code": "FSCN4210",
    "subject": "FSCN",
    "number": "4210",
    "honors": false,
    "writing": false,
    "name": "Topics in Food Sci & Nutrition",
    "fullname": "Topics in Food Science and Nutrition",
    "info": "Indepth investigation of specific topic in nutrition/food science not yet covered by other courses, topic announced in advance.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "007544",
    "code": "FSCN4291",
    "subject": "FSCN",
    "number": "4291",
    "honors": false,
    "writing": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Individual lab or library research in an area related to food science or nutrition.\n\nprereq: Undergrads, instr consent",
    "prereq": {}
  },
  {
    "uid": "802984",
    "code": "FSCN4311",
    "subject": "FSCN",
    "number": "4311",
    "honors": false,
    "writing": false,
    "name": "Chem Reactions in Food Systems",
    "fullname": "Chemical Reactions in Food Systems",
    "info": "Chemical structure of major food constituents, carbohydrates, lipid, and proteins. Reaction/interaction pathways. Function within complex food matrix under various storage/processing conditions.\n\nprereq: 4112, 4312W",
    "prereq": {
      "and": [
        "802983",
        "007537"
      ]
    }
  },
  {
    "uid": "007537",
    "code": "FSCN4312W",
    "subject": "FSCN",
    "number": "4312",
    "honors": false,
    "writing": true,
    "name": "Food Analysis",
    "fullname": "Food Analysis",
    "info": "The course covers major analytical tools needed for any investigation in food science and technology, whether by the food industry, governmental agencies, or universities. Specifically, the course covers: application of quantitative and qualitative physical, chemical, and instrumental methods used for analysis and examination of food constituents, ingredients, and products; sensory evaluation techniques; and evaluation of methods and interpretation of results. The course covers methods used for: compositional analysis of foods; chemical characterization of foods and food constituents; and spectroscopic, chromatographic, and spectrometric analysis used for the detection, identification, and quantification of food macro- and micro- components. In this course the students will learn to identify the appropriate methods of analysis based on the investigation purpose, either nutrition labeling, quality control, product development, or scientific research.\n\nprereq: FSCN 4112",
    "prereq": {
      "and": [
        "802983"
      ]
    }
  },
  {
    "uid": "007538",
    "code": "FSCN4331",
    "subject": "FSCN",
    "number": "4331",
    "honors": false,
    "writing": false,
    "name": "Food Process Engineering I",
    "fullname": "Food Process Engineering I",
    "info": "Specific applications of engineering principles (e.g., heat/mass transfer, kinetics, thermodynamics) to unit operations in food production.",
    "prereq": {}
  },
  {
    "uid": "007539",
    "code": "FSCN4332",
    "subject": "FSCN",
    "number": "4332",
    "honors": false,
    "writing": false,
    "name": "Food Processing Operations",
    "fullname": "Food Processing Operations",
    "info": "Engineering principles applied to commonly used food processing operations. Blanching, pasteurization, sterilization, frying, baking, milling, extrusion. Meat processing, water treatment, waste management.\n\nPrerequisite: BBE 4744",
    "prereq": {}
  },
  {
    "uid": "014067",
    "code": "FSCN4333",
    "subject": "FSCN",
    "number": "4333",
    "honors": false,
    "writing": false,
    "name": "Math Applications in Food Sci",
    "fullname": "Mathematical Applications in Food Science",
    "info": "Criteria and basis for use of applied mathematical analysis in food science. Draws on examples from reaction kinetics, enzyme kinetics, predictive microbiology, and food engineering.",
    "prereq": {}
  },
  {
    "uid": "825254",
    "code": "FSCN4334",
    "subject": "FSCN",
    "number": "4334",
    "honors": false,
    "writing": false,
    "name": "Food Processing Fundamentals I",
    "fullname": "Food Processing Fundamentals I",
    "info": "Food processing fundamentals (add heat, remove heat, remove water, add barriers and add preservatives). Overview of mass and energy balances for food process design, fundamentals of fluid flow, heat transfer as applied to food process unit operations such as pumping, heat exchangers, thermal processing, dehydration, refrigeration, freezing, and extrusion. ",
    "prereq": {}
  },
  {
    "uid": "825255",
    "code": "FSCN4335",
    "subject": "FSCN",
    "number": "4335",
    "honors": false,
    "writing": false,
    "name": "Food Processing Fundamentals 2",
    "fullname": "Food Processing Fundamentals II",
    "info": "Food processing fundamentals (add heat, remove heat, remove water, add barriers, and add preservatives). Overview energy requirement in food processing, food process plant design, mass transfer fundamentals, mass transfer operations including size reduction, agglomeration, membrane filtration, and packaging. Energy in food processing and pilot plant design. Wastewater treatment.",
    "prereq": {}
  },
  {
    "uid": "010029",
    "code": "FSCN4342",
    "subject": "FSCN",
    "number": "4342",
    "honors": false,
    "writing": false,
    "name": "Properties of Water in Foods",
    "fullname": "Properties of Water in Foods",
    "info": "Principles of processing, handling, and storing frozen, dry, and intermediate moisture biological materials (foods, drugs, biologics). Emphasizes physio-chemical properties of water in food.",
    "prereq": {}
  },
  {
    "uid": "010041",
    "code": "FSCN4343",
    "subject": "FSCN",
    "number": "4343",
    "honors": false,
    "writing": false,
    "name": "Processing of Dairy Products",
    "fullname": "Processing of Dairy Products",
    "info": "Demonstration/application of basic concepts of food engineering/processing, food chemistry, and food microbiology to production of fluid, fermented, concentrated, and dehydrated dairy products.",
    "prereq": {}
  },
  {
    "uid": "010044",
    "code": "FSCN4344",
    "subject": "FSCN",
    "number": "4344",
    "honors": false,
    "writing": false,
    "name": "Tech of Fermented Dairy Prod",
    "fullname": "Technology of Fermented Dairy Products",
    "info": "Integration of chemical, microbiological, and physical principles involved in the manufacture and storage of cheeses and fermented milks.",
    "prereq": {}
  },
  {
    "uid": "788448",
    "code": "FSCN4345",
    "subject": "FSCN",
    "number": "4345",
    "honors": false,
    "writing": false,
    "name": "Flavor Technology",
    "fullname": "Flavor Technology",
    "info": "Flavor/off-flavor development in foods. Industrial production of food flavorings, their proper application to food systems.\n\nprereq: 4112, 4121, 4331",
    "prereq": {
      "and": [
        "802983",
        "007472",
        "007538"
      ]
    }
  },
  {
    "uid": "789263",
    "code": "FSCN4346",
    "subject": "FSCN",
    "number": "4346",
    "honors": false,
    "writing": false,
    "name": "Func. Foods: Regs. & Tech.",
    "fullname": "Functional Foods: Regulations and Technology",
    "info": "Overview of application of regulatory principles, food science, nutritional science to development of nutraceuticals, functional foods, dietary supplements. Scientific basis, technologies, legal requirements, animal/clinical evaluation, consumer usage versus need. Review of products available in world market, with focus on the United States. ",
    "prereq": {}
  },
  {
    "uid": "801945",
    "code": "FSCN4349",
    "subject": "FSCN",
    "number": "4349",
    "honors": false,
    "writing": false,
    "name": "Food Science Capstone",
    "fullname": "Food Science Capstone",
    "info": "Planning of process or product development project. Defining goals, preparing/following time line, reviewing literature, coordinating with experts, procuring supplies, writing progress reports. Determining ingredient specifications, lab/pilot plant production. Chemical, microbiological, sensory testing. Oral/written presentations.\n\nprereq: 4112, 4121, 4131, 4312, 4332, BBE 4744, Food Science Major, senior",
    "prereq": {
      "or": [
        "802983",
        "007472",
        "013271",
        "007537",
        "007539",
        "795357"
      ]
    }
  },
  {
    "uid": "809740",
    "code": "FSCN4481",
    "subject": "FSCN",
    "number": "4481",
    "honors": false,
    "writing": false,
    "name": "Sensory Eval. of Food Quality",
    "fullname": "Sensory Evaluation of Food Quality",
    "info": "Fundamentals of sensory perception. Test designs and methods used in studying sensory qualities of foods and consumer responses to foods.\n\nprereq: 3102, Stat 3011",
    "prereq": {
      "and": [
        "007469",
        "001618"
      ]
    }
  },
  {
    "uid": "819598",
    "code": "FSCN4482",
    "subject": "FSCN",
    "number": "4482",
    "honors": false,
    "writing": false,
    "name": "Sensory Eval of Food Quality",
    "fullname": "Sensory Evaluation of Food Quality",
    "info": "Fundamentals of sensory perception.  Test designs and methods used in studying the sensory qualities of foods and consumer responses to foods.\nThis course includes six, 1-hour tasting sessions, six, 1-hour data analysis sessions and weekly 50-minute classroom activities. \n",
    "prereq": {}
  },
  {
    "uid": "007531",
    "code": "FSCN4596",
    "subject": "FSCN",
    "number": "4596",
    "honors": false,
    "writing": false,
    "name": "Field Exp: Community Nutrition",
    "fullname": "Field Experience: Community Nutrition",
    "info": "Application of nutrition knowledge in the solution of problems related to health promotion. Assigned readings, discussion, and experiences in community agencies.",
    "prereq": {}
  },
  {
    "uid": "007490",
    "code": "FSCN4612W",
    "subject": "FSCN",
    "number": "4612",
    "honors": false,
    "writing": true,
    "name": "Advanced Human Nutrition",
    "fullname": "Advanced Human Nutrition",
    "info": "\t\nAdvanced study of digestion/absorption of nutrients. Research techniques in nutrition, including human/epidemiological studies. Health promotion, disease prevention theories. Non-Enforced \n\nPrerequisites: FSCN 1112, CHEM 1062 and CHEM 1066 Enforced Prerequisites (students cannot register without the following): BioC 3021 or PHSL 3051 or ANSC 3301 or BIOL 3211 or Instructor Consent",
    "prereq": {}
  },
  {
    "uid": "007492",
    "code": "FSCN4613",
    "subject": "FSCN",
    "number": "4613",
    "honors": false,
    "writing": false,
    "name": "Experimental Nutrition",
    "fullname": "Experimental Nutrition",
    "info": "This is a laboratory course focused on biochemical methods for determining nutritional status. This course uses biological samples from the students themselves as the source material. In this course, students will develop a better understanding of the usefulness and limitations of the biochemical methods, as well as the principles behind the procedures and instruments used. Students will also expand their nutrition knowledge, improve their lab skills, develop their scientific writing abilities, and exercise their problem solving skills.\n\nPrerequisites: BIOC 3021, STAT 3011, Nutrition Major, or Instructor Consent",
    "prereq": {}
  },
  {
    "uid": "007494",
    "code": "FSCN4614W",
    "subject": "FSCN",
    "number": "4614",
    "honors": false,
    "writing": true,
    "name": "Community Nutrition",
    "fullname": "Community Nutrition",
    "info": "Nutrition risks associated with different age, sex, ethnic, and socioeconomic groups. Community needs assessment. Program planning and evaluation. Programs developed to address the needs and interests of people at different stages of the life cycle, ethnic or cultural backgrounds, and literacy levels.",
    "prereq": {}
  },
  {
    "uid": "797585",
    "code": "FSCN4621",
    "subject": "FSCN",
    "number": "4621",
    "honors": false,
    "writing": false,
    "name": "Nutrition and Metabolism",
    "fullname": "Nutrition and Metabolism",
    "info": "Carbohydrate, lipid, protein metabolism. Uses systems/holistic approach to emphasize how metabolic pathways interrelate. \n\nprereq: FSCN 4612, BIOC 3021; ANSC 3301 or PHSL 3051",
    "prereq": {
      "or": [
        "007490",
        "014290",
        "009261",
        "010566"
      ]
    }
  },
  {
    "uid": "804467",
    "code": "FSCN4622",
    "subject": "FSCN",
    "number": "4622",
    "honors": false,
    "writing": false,
    "name": "Nutritional Toxicology",
    "fullname": "Nutritional Toxicology, the basic science of diet-related toxicants",
    "info": "Concepts of toxicology. Molecular mechanism behind dietary chemical-induced toxicities. Impact/risk of dietary chemicals for human health.\n\nprereq: BIOC 3021; designed for students majoring in [nutrition or food science or toxicology ]",
    "prereq": {
      "or": [
        "014290"
      ]
    }
  },
  {
    "uid": "803574",
    "code": "FSCN4664",
    "subject": "FSCN",
    "number": "4664",
    "honors": false,
    "writing": false,
    "name": "Senior Capstone",
    "fullname": "Senior Capstone: Becoming a Registered Dietitian",
    "info": "Preparation for advancement in career as registered dietitian, including completion of dietetic internship application. Current issues in dietetics.\n\nprereq: [4665 or concurrent registration is required (or allowed) in 4665], Nutrition/dietetics subplan of nutrition major or instr consent",
    "prereq": {}
  },
  {
    "uid": "007497",
    "code": "FSCN4666",
    "subject": "FSCN",
    "number": "4666",
    "honors": false,
    "writing": false,
    "name": "Medical Nutrition Therapy II",
    "fullname": "Medical Nutrition Therapy II",
    "info": "Nutrition care process, with a focus on pathophysiology, management, and nutrition care of diabetes mellitus, cardiovascular disorders, renal disorders, and obesity.\n\nprereq: FSCN 4665, FSCN 4612, PHSL 3051, BIOC 3021",
    "prereq": {
      "and": [
        "007490",
        "010566",
        "014290"
      ]
    }
  },
  {
    "uid": "007532",
    "code": "FSCN4696",
    "subject": "FSCN",
    "number": "4696",
    "honors": false,
    "writing": false,
    "name": "Field Exp: Medical Nutrition I",
    "fullname": "Field Experience: Medical Nutrition Therapy I",
    "info": "Application of nutrition knowledge in the solution of problems related to disease and injury; assigned readings, discussions, and experience in medical centers and long-term care facilities. Emphasis on nutrition support; gastrointestinal, immune and respiratory disorders, and cancer.",
    "prereq": {}
  },
  {
    "uid": "007500",
    "code": "FSCN4732",
    "subject": "FSCN",
    "number": "4732",
    "honors": false,
    "writing": false,
    "name": "Food and Nutrition Management",
    "fullname": "Food and Nutrition Management",
    "info": "Financial and human resource management applied to a variety of business and institutional settings. Field trips may be required.\n\nprereq: 3732",
    "prereq": {
      "and": [
        "007487"
      ]
    }
  },
  {
    "uid": "007536",
    "code": "FSCN4796",
    "subject": "FSCN",
    "number": "4796",
    "honors": false,
    "writing": false,
    "name": "Field Exp Food Nutr & Mgmt",
    "fullname": "Field Experience in Food and Nutrition Management",
    "info": "Application of principles of food service management to problems in community, commercial, or health care facilities.  ",
    "prereq": {}
  },
  {
    "uid": "007534",
    "code": "FSCN4896",
    "subject": "FSCN",
    "number": "4896",
    "honors": false,
    "writing": false,
    "name": "Field Exp: Medical Nutr II",
    "fullname": "Field Experience: Medical Nutrition Therapy II",
    "info": "Application of nutrition knowledge to problems related to health/disease. Readings, discussions, experience in medical centers. Emphasizes cardiovascular, endocrine, urinary tract, energy imbalance; eating disorders.",
    "prereq": {}
  },
  {
    "uid": "007535",
    "code": "FSCN4996",
    "subject": "FSCN",
    "number": "4996",
    "honors": false,
    "writing": false,
    "name": "Field Exp: Medical Nutr III",
    "fullname": "Field Experience: Medical Nutrition Therapy III",
    "info": "Application of nutrition knowledge to problems related to health/disease, clinical management experience in medical centers. Emphasizes pediatrics, home health care, staff relief.",
    "prereq": {}
  },
  {
    "uid": "806570",
    "code": "FSCN5101",
    "subject": "FSCN",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Food Regulation in the U.S.",
    "fullname": "Food Regulation in the United States",
    "info": "U.S. system of regulation of food product formulation, manufacturing, labeling and advertising, including insight into the manner in which regulation and the underlying food laws are affected by scientific developments and changing societal values and concerns.\n\nprereq: [[Grad or sr] food science or nutrition major] or instr consent",
    "prereq": {}
  },
  {
    "uid": "809741",
    "code": "FSCN5122",
    "subject": "FSCN",
    "number": "5122",
    "honors": false,
    "writing": false,
    "name": "Food Fermentations and Biotech",
    "fullname": "Food Fermentations and Biotechnology",
    "info": "Major food fermentations important for today's food industry, with particular focus on microbiological components. Fermentations cover all major commodity food groups of dairy, cereal, meat, vegetables, fruits.\n\nprereq: MICB 3301, BIOL 4003",
    "prereq": {
      "and": [
        "008659",
        "009489"
      ]
    }
  },
  {
    "uid": "809742",
    "code": "FSCN5123",
    "subject": "FSCN",
    "number": "5123",
    "honors": false,
    "writing": false,
    "name": "Molecular Bio for Applied Sci",
    "fullname": "Molecular Biology for Applied Scientists",
    "info": "Half semester course. Two hours per week for 8 weeks.\nBasics of molecular biology/how it has been used for biotechnological applications. Origins of molecular biology from discovery of DNA as inheritance material within cells to advent of gene cloning/sequencing technologies.\n\nprereq: MicB 3301 or FScN 2021 or instr consent",
    "prereq": {
      "or": [
        "008659",
        "007542"
      ]
    }
  },
  {
    "uid": "809743",
    "code": "FSCN5131",
    "subject": "FSCN",
    "number": "5131",
    "honors": false,
    "writing": false,
    "name": "Food Quality - Grad",
    "fullname": "Food Quality for Graduate Credit",
    "info": "Management systems, statistical procedures, regulatory requirements involved with producing quality food/ingredients. Risk assessment/management, good manufacturing practices, hazard analysis critical control point (HACCP), statistical methods for process control, total quality management, food/drug laws.\n\nPrereq: Food Science Grad Student\nStudent may select grading basis if instructor approves. A-F registration is required for class to count toward degree.",
    "prereq": {}
  },
  {
    "uid": "809744",
    "code": "FSCN5312",
    "subject": "FSCN",
    "number": "5312",
    "honors": false,
    "writing": false,
    "name": "Food Analysis",
    "fullname": "Food Analysis",
    "info": "Analytical tools needed for investigation in Food Science/Technology, whether by food industry, governmental agencies, or universities. Application of quantitative/ qualitative physical, chemical/instrumental methods used for analysis/examination of food constituents. Sensory evaluation techniques, evaluation of methods/interpretation of results.\n\nprereq: 4112, STAT 3011",
    "prereq": {
      "and": [
        "802983",
        "001618"
      ]
    }
  },
  {
    "uid": "825928",
    "code": "FSCN5334",
    "subject": "FSCN",
    "number": "5334",
    "honors": false,
    "writing": false,
    "name": "Food Process. Fundamentals I",
    "fullname": "Food Processing Fundamentals I",
    "info": "Food processing fundamentals (add heat, remove heat, remove water, add barriers and add preservatives) Overview of mass and energy balances for food process design, fundamentals of fluid flow, heat transfer as applied to food process unit operations such as pumping, heat exchangers, thermal processing, dehydration, refrigeration, freezing and extrusion. \n\nTwo lecture periods (50 min each) and one laboratory (105 min each) period each week.  \n",
    "prereq": {}
  },
  {
    "uid": "825929",
    "code": "FSCN5335",
    "subject": "FSCN",
    "number": "5335",
    "honors": false,
    "writing": false,
    "name": "Food Process. Fundamentals II",
    "fullname": "Food Processing Fundamentals II",
    "info": "Food processing fundamentals (add heat, remove heat, remove water, add barriers and add preservatives) Overview, energy requirement in food processing, food process plant design, mass transfer fundamentals, mass transfer operations including size reduction, agglomeration, membrane filtration and packaging. Energy in food processing and pilot plant design. Wastewater treatment.\n\nTwo lecture periods (50 min each) and one laboratory (105 min each) period each week.  ",
    "prereq": {}
  },
  {
    "uid": "010009",
    "code": "FSCN5411",
    "subject": "FSCN",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Food Biotechnology",
    "fullname": "Food Biotechnology",
    "info": "Genetic tools as applied to food biotechnology. Improvement of microbes used in food production by modern biotechnological approaches. Discuss need for stringent regulation of modern biotechnology as well as ethical and legal issues.",
    "prereq": {}
  },
  {
    "uid": "010012",
    "code": "FSCN5421",
    "subject": "FSCN",
    "number": "5421",
    "honors": false,
    "writing": false,
    "name": "Introduction to Food Law",
    "fullname": "Introduction to Food Law",
    "info": "Analysis of the federal legal requirements affecting the production processing, packaging, marketing, and distribution of food and food products using case law studies and regulatory history.",
    "prereq": {}
  },
  {
    "uid": "010023",
    "code": "FSCN5431",
    "subject": "FSCN",
    "number": "5431",
    "honors": false,
    "writing": false,
    "name": "Physiochemistry of Food",
    "fullname": "Physiochemistry of Food",
    "info": "Surface phenomena, colloidal interactions, liquid dispersions, gels, emulsions and foams, and functionality of food macromolecules in these systems.",
    "prereq": {}
  },
  {
    "uid": "010031",
    "code": "FSCN5441",
    "subject": "FSCN",
    "number": "5441",
    "honors": false,
    "writing": false,
    "name": "Intro New Product Development",
    "fullname": "Introduction to New Product Development",
    "info": "This course is designed to give students an overview of the product development process including management systems, team dynamics, technical problem solving, idea generation, and differences between different categories of food R&D.  \n\nPrerequisites: FSCN 4112",
    "prereq": {}
  },
  {
    "uid": "010033",
    "code": "FSCN5451",
    "subject": "FSCN",
    "number": "5451",
    "honors": false,
    "writing": false,
    "name": "Quantitative Analysis",
    "fullname": "Structure and Function in Foods: Quantitative Analysis",
    "info": "Introduction to various procedures for analysis of structure and organization in raw and processed food.",
    "prereq": {}
  },
  {
    "uid": "011487",
    "code": "FSCN5461",
    "subject": "FSCN",
    "number": "5461",
    "honors": false,
    "writing": false,
    "name": "Food Packaging",
    "fullname": "Food Packaging",
    "info": "Materials, principles, and procedures of packaging as they apply to food products. Emphasis is on consumer products, but the principles also apply to bulk and institutional foods and ingredients.\n\nprereq: 1102, 3102, Phys 1102 or Phys 1302",
    "prereq": {
      "or": [
        "007467",
        "007469",
        "002067",
        "002071"
      ]
    }
  },
  {
    "uid": "790779",
    "code": "FSCN5471",
    "subject": "FSCN",
    "number": "5471",
    "honors": false,
    "writing": false,
    "name": "Advanced Food Chemistry",
    "fullname": "Advanced Food Chemistry",
    "info": "Chemical reactions taking place in formation, stability, and degradation of important food constituents. Examples of reactions for major chemical changes occurring in food systems.",
    "prereq": {}
  },
  {
    "uid": "010011",
    "code": "FSCN5481",
    "subject": "FSCN",
    "number": "5481",
    "honors": false,
    "writing": false,
    "name": "Sensory Eval of Food Quality",
    "fullname": "Sensory Evaluation of Food Quality",
    "info": "Fundamentals of sensory perception. Test designs and methods in studying sensory qualities of foods. Issues in sensory evaluation. Group research project.\n\nprereq: 3102, STAT 3011",
    "prereq": {
      "and": [
        "007469",
        "001618"
      ]
    }
  },
  {
    "uid": "010049",
    "code": "FSCN5511",
    "subject": "FSCN",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Meat Poulty Seafd Protein Proc",
    "fullname": "Meat, Poultry, and Seafood Protein Processing",
    "info": "Industrial processing of meat, poultry, and seafood products with emphasis on protein systems: comminuted products, nutraceutical products, thermal processing optimization, pasteurization, least cost analysis, and color stability.",
    "prereq": {}
  },
  {
    "uid": "010051",
    "code": "FSCN5521",
    "subject": "FSCN",
    "number": "5521",
    "honors": false,
    "writing": false,
    "name": "Flavor Technology",
    "fullname": "Flavor Technology",
    "info": "Overview of flavor chemistry/related technology. Analytical techniques, mechanisms of flavor development (chemical/ biogenesis), off-flavors, industrial production/application of food flavorings.\n\nprereq: 4112",
    "prereq": {
      "and": [
        "802983"
      ]
    }
  },
  {
    "uid": "010064",
    "code": "FSCN5531",
    "subject": "FSCN",
    "number": "5531",
    "honors": false,
    "writing": false,
    "name": "Grains: Cereal Chem & Tech",
    "fullname": "Grains: Introduction to Cereal Chemistry and Technology",
    "info": "Origins, structure, biochemistry, and cellular properties of major cereal grains as they relate to primary processing (milling) and secondary processing (production of cereal products).\n\nprereq: Biol 1009, Chem 1022 or Graduate Student ",
    "prereq": {
      "or": [
        "005416",
        "002385"
      ]
    }
  },
  {
    "uid": "810306",
    "code": "FSCN5541",
    "subject": "FSCN",
    "number": "5541",
    "honors": false,
    "writing": false,
    "name": "Dairy Product Chem and Tech",
    "fullname": "Dairy Product Chemistry and Technology",
    "info": "Designed for upper division Food Science undergraduate/graduate students. Physiology of milk production in ruminants. Resulting composition. Chemical, physical, microbiological properties of milk components. How milk products are manufactured.\n\nprereq: 3102, 4112, Food Science major, upper division undergraduate or graduate student",
    "prereq": {
      "or": [
        "007469",
        "802983"
      ]
    }
  },
  {
    "uid": "798716",
    "code": "FSCN5601",
    "subject": "FSCN",
    "number": "5601",
    "honors": false,
    "writing": false,
    "name": "Management of Eating Disorders",
    "fullname": "Management of Eating Disorders",
    "info": "Etiology, occurrence, course, treatment, prevention of eating disorders from multidisciplinary perspective. Roles and responsibilities of eating disorder treatment team members of varying types across various treatment milieus.\n\nPrereq: Junior, senior or graduate student in nutrition or health related program or instructor consent.",
    "prereq": {}
  },
  {
    "uid": "007502",
    "code": "FSCN5621W",
    "subject": "FSCN",
    "number": "5621",
    "honors": false,
    "writing": true,
    "name": "Nutrition and Metabolism",
    "fullname": "Nutrition and Metabolism",
    "info": "Carbohydrate, lipid, and protein metabolism. Uses \"systems\" or \"holistic\" approach to emphasize how metabolic pathways interrelate.",
    "prereq": {}
  },
  {
    "uid": "007503",
    "code": "FSCN5622",
    "subject": "FSCN",
    "number": "5622",
    "honors": false,
    "writing": false,
    "name": "Vitamin & Mineral Biochem",
    "fullname": "Vitamin and Mineral Biochemistry",
    "info": "Nutritional, biochemical, and physiological aspects of vitamins/essential minerals in human/experimental-animal models.",
    "prereq": {}
  },
  {
    "uid": "007505",
    "code": "FSCN5623W",
    "subject": "FSCN",
    "number": "5623",
    "honors": false,
    "writing": true,
    "name": "Regulation of Energy Balance",
    "fullname": "Regulation of Energy Balance",
    "info": "Regulation of energy balance in humans, including regulation of food intake and of energy expenditure.",
    "prereq": {}
  },
  {
    "uid": "787713",
    "code": "FSCN5631",
    "subject": "FSCN",
    "number": "5631",
    "honors": false,
    "writing": false,
    "name": "Dietary Supplements",
    "fullname": "Dietary Supplements: Regulatory, Scientific, and Cultural Perspectives",
    "info": "Concepts/principles of dietary supplements-RDA, dose-response, risk assessment. Laws/regulations, their interpretation concerning dietary supplements. Vitamins/minerals. Philosophy/use of botanicals/nutraceuticals in Western medicine in contrast to other cultures. Use of herbal supplements in Western medicine.",
    "prereq": {}
  },
  {
    "uid": "819591",
    "code": "FSCN5993",
    "subject": "FSCN",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.\n",
    "prereq": {}
  },
  {
    "uid": "819592",
    "code": "FSCN5994",
    "subject": "FSCN",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries\nout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment.Students enrolling in a directed research will be required to use the\nUniversity-wide on-line directed research contract process in order to enroll.\n \nPrereq: department consent, instructor consent, no more than 6 credits of directed research counts towards CFANS major requirements.\n",
    "prereq": {}
  },
  {
    "uid": "818891",
    "code": "FSCN8001",
    "subject": "FSCN",
    "number": "8001",
    "honors": false,
    "writing": false,
    "name": "Food Science Grad Orientation",
    "fullname": "Orientation to the Food Science Graduate Program",
    "info": "This course will serve as an orientation to the Food Science Graduate Program. Topics will include planning your degree completion; using library resources to conduct and write a literature review; understanding research ethics; critically reviewing literature; improving soft skills, being aware of extracurricular activities, internships, and career options for graduate students; and a presentation of your research topic.",
    "prereq": {}
  },
  {
    "uid": "011155",
    "code": "FSCN8211",
    "subject": "FSCN",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Risk Analysis",
    "fullname": "Risk Analysis in Food Science and Nutrition",
    "info": "Risks and benefits in various areas of the field (e.g., food preservatives and supplements).",
    "prereq": {}
  },
  {
    "uid": "011161",
    "code": "FSCN8212",
    "subject": "FSCN",
    "number": "8212",
    "honors": false,
    "writing": false,
    "name": "Nutr & Exer Metab",
    "fullname": "Advances in Nutrition: Nutrition and Exercise Metabolism",
    "info": "Seminar examines topics related to effects of diet on exercise metabolism.",
    "prereq": {}
  },
  {
    "uid": "011162",
    "code": "FSCN8213",
    "subject": "FSCN",
    "number": "8213",
    "honors": false,
    "writing": false,
    "name": "Food Lipids",
    "fullname": "Food Lipids: Biological and Toxicological Aspects",
    "info": "Lipids, including chemical reactions of nutritional and toxicological significance, lipid stability in foods, antioxidants, health aspects, and lipid oxidation products, including oxysterols, cytobiology, atherogenicity, membrane effects, and biological properties.",
    "prereq": {}
  },
  {
    "uid": "820047",
    "code": "FSCN8224",
    "subject": "FSCN",
    "number": "8224",
    "honors": false,
    "writing": false,
    "name": "Advanced Food Processing",
    "fullname": "Advanced Food Processing",
    "info": "Research advances in food process design and development in conventional food process operations, such as thermal processing, refrigeration, and freezing, and also in novel food process operations, such as high pressure processing, pulsed electric field processing, ultrasound assisted processing, etc. – Process simulation for food processing system optimizations and procedures for optimizing formulations. \n\nTwo lecture periods (75 min each) each week.  \n",
    "prereq": {}
  },
  {
    "uid": "008171",
    "code": "FSCN8310",
    "subject": "FSCN",
    "number": "8310",
    "honors": false,
    "writing": false,
    "name": "General Seminar",
    "fullname": "General Seminar",
    "info": "Presentations by faculty, graduate students, and outside speakers.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008173",
    "code": "FSCN8311",
    "subject": "FSCN",
    "number": "8311",
    "honors": false,
    "writing": false,
    "name": "Chem Reactions in Foods",
    "fullname": "Chemical Reactions in Food",
    "info": "Chemistry of formation, stability, and degradation of important food constituents. Major chemical changes occurring in food systems. Examples of food components/reactions.",
    "prereq": {}
  },
  {
    "uid": "008180",
    "code": "FSCN8312",
    "subject": "FSCN",
    "number": "8312",
    "honors": false,
    "writing": false,
    "name": "Issues in Food Micro",
    "fullname": "Issues in Food Microbiology",
    "info": "Issues in food microbiology, dairy starter cultures, food fermentations, or aspects of food biotechnology.",
    "prereq": {}
  },
  {
    "uid": "008175",
    "code": "FSCN8313",
    "subject": "FSCN",
    "number": "8313",
    "honors": false,
    "writing": false,
    "name": "Food Proc Engineering",
    "fullname": "Food Process Engineering",
    "info": "Basic concepts of engineering in a food processing system. Current advances in food processing technology.",
    "prereq": {}
  },
  {
    "uid": "008179",
    "code": "FSCN8314",
    "subject": "FSCN",
    "number": "8314",
    "honors": false,
    "writing": false,
    "name": "Food Materials Science",
    "fullname": "Food Materials Science",
    "info": "Principles of materials science as applied to food processing and product development. Overview of phase transitions, phase and state diagrams of food materials. Discussion of the glassy state in foods, the role of water as plasticizer, and the implications for shelf life and texture. Crystallization in foods. Introduction to molecular dynamics and transport phenomena. Mechanical properties and rheology of concentrated food systems. Application to processes such as freezing, drying, extrusion, spray drying, freeze drying, agglomeration, baking. Use in product development: ice cream and other frozen foods; extruded cereal and protein-based foods; food powders for application in dairy, culinary, instant beverages, nutritional products; cereal bars; baked goods, pasta, etc. Integration and extension of foundational concepts in selected topics, such as in encapsulation and controlled release of bioactives in food, food powders, films and coatings.",
    "prereq": {}
  },
  {
    "uid": "008174",
    "code": "FSCN8315",
    "subject": "FSCN",
    "number": "8315",
    "honors": false,
    "writing": false,
    "name": "Qual Mgmt: C,T,I",
    "fullname": "Quality Management: Concepts, Tools, and Implementation",
    "info": "Quality assurance of foods, including basic concepts and definitions, quality management strategies and interacting factors, and management tools such as GMP, HACCP, and ISO9000.",
    "prereq": {}
  },
  {
    "uid": "008181",
    "code": "FSCN8316",
    "subject": "FSCN",
    "number": "8316",
    "honors": false,
    "writing": false,
    "name": "Nutr for Food Scien",
    "fullname": "Nutrition for Food Scientists",
    "info": "Nutrition topics for food science students.",
    "prereq": {}
  },
  {
    "uid": "008183",
    "code": "FSCN8317",
    "subject": "FSCN",
    "number": "8317",
    "honors": false,
    "writing": false,
    "name": "ResTechniques FS",
    "fullname": "Instrumental Research Techniques in Food Science",
    "info": "How to apply instrumental research techniques to problem solving in food science.",
    "prereq": {}
  },
  {
    "uid": "008185",
    "code": "FSCN8318",
    "subject": "FSCN",
    "number": "8318",
    "honors": false,
    "writing": false,
    "name": "Current Issues in FS",
    "fullname": "Current Issues in Food Science",
    "info": "Current issues in Food Science and how they impact the food industry.",
    "prereq": {}
  },
  {
    "uid": "008189",
    "code": "FSCN8320",
    "subject": "FSCN",
    "number": "8320",
    "honors": false,
    "writing": false,
    "name": "Adv Top Food Sci",
    "fullname": "Advanced Topics in Food Science",
    "info": "Recent research or special topics.",
    "prereq": {}
  },
  {
    "uid": "008190",
    "code": "FSCN8330",
    "subject": "FSCN",
    "number": "8330",
    "honors": false,
    "writing": false,
    "name": "Research Topics",
    "fullname": "Research Topics",
    "info": "Seminar in which faculty member or group of faculty/graduate students discuss research progress or review/discuss current research literature.",
    "prereq": {}
  },
  {
    "uid": "008192",
    "code": "FSCN8331",
    "subject": "FSCN",
    "number": "8331",
    "honors": false,
    "writing": false,
    "name": "Food Proteins",
    "fullname": "Food Proteins",
    "info": "Protein biochemistry as applied to food systems/processing. Forces that determine protein structure. Isolation/characterization of food proteins. Structure/function relationships in handling/processing food protein systems.\n\nprereq: 4112, 4312",
    "prereq": {
      "and": [
        "802983",
        "007537"
      ]
    }
  },
  {
    "uid": "009948",
    "code": "FSCN8332",
    "subject": "FSCN",
    "number": "8332",
    "honors": false,
    "writing": false,
    "name": "Micro Start Culture",
    "fullname": "Microbial Starter Cultures",
    "info": "Microbiology, physiology, and genetics of lactic acid bacteria used in food fermentations.",
    "prereq": {}
  },
  {
    "uid": "788114",
    "code": "FSCN8333",
    "subject": "FSCN",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "009954",
    "code": "FSCN8334",
    "subject": "FSCN",
    "number": "8334",
    "honors": false,
    "writing": false,
    "name": "Reaction Kinetics",
    "fullname": "Reaction Kinetics of Food Deterioration",
    "info": "Basis for use of applied chemical kinetics to deteriorative reactions occurring in processing and storage of foods and drugs. Systems include enzymatic reactions, lipid oxidation, nonenzymatic browning, acid base catalysis, and microbial growth and death. Application of these kinetics to study of accelerated shelf-life testing of foods, drugs, and biologics.\n\nprereq: Chem 3501",
    "prereq": {
      "and": [
        "002397"
      ]
    }
  },
  {
    "uid": "009957",
    "code": "FSCN8335",
    "subject": "FSCN",
    "number": "8335",
    "honors": false,
    "writing": false,
    "name": "Carbohydrate Chem",
    "fullname": "Carbohydrate Chemistry in Food and Nutrition",
    "info": "Carbohydrates as food components, their use as food ingredients. Reactions of mono/di/polysaccharides during food processing. Biosynthesis of carbohydrates, their metabolism. Methods in carbohydrate analysis.\n\nprereq: 4112",
    "prereq": {
      "and": [
        "802983"
      ]
    }
  },
  {
    "uid": "009965",
    "code": "FSCN8336",
    "subject": "FSCN",
    "number": "8336",
    "honors": false,
    "writing": false,
    "name": "Lipid Chemistry",
    "fullname": "Lipid Chemistry and Rancidity of Foods",
    "info": "Chemistry of food lipid oxidation/rancidification. Protective functions of antioxidants.\n\nprereq: 4112",
    "prereq": {
      "and": [
        "802983"
      ]
    }
  },
  {
    "uid": "009949",
    "code": "FSCN8337",
    "subject": "FSCN",
    "number": "8337",
    "honors": false,
    "writing": false,
    "name": "Flavor Chemistry",
    "fullname": "Flavor Chemistry",
    "info": "Chemistry involved in formation, analysis, and release of flavoring materials in foods.\n\nprereq: 4111",
    "prereq": {
      "and": [
        "007470"
      ]
    }
  },
  {
    "uid": "792963",
    "code": "FSCN8338",
    "subject": "FSCN",
    "number": "8338",
    "honors": false,
    "writing": false,
    "name": "Antioxidants in Food",
    "fullname": "Antioxidants in Food: Practical Applications",
    "info": "Mechanisms of antioxidant activities in food systems. Free radical scavengers, hydroperoxide stabilizers, synergists, metal chelators, singlet oxygen quenchers, substance reducing hydroperoxides. Practical applications of antioxidants in various food systems, effect of antioxidants on health/diseases.\n\nprereq: 4111, Bioc 3021, food chemistry, organic chemistry, biochemistry",
    "prereq": {
      "or": [
        "007470",
        "014290"
      ]
    }
  },
  {
    "uid": "008191",
    "code": "FSCN8391",
    "subject": "FSCN",
    "number": "8391",
    "honors": false,
    "writing": false,
    "name": "Ind Study Food Sci",
    "fullname": "Independent Study: Food Science",
    "info": "Includes written reports.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788350",
    "code": "FSCN8444",
    "subject": "FSCN",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788474",
    "code": "FSCN8666",
    "subject": "FSCN",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788601",
    "code": "FSCN8777",
    "subject": "FSCN",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787863",
    "code": "FSCN8888",
    "subject": "FSCN",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  }
]