[
  {
    "uid": "004766",
    "code": "GEOG1301W",
    "subject": "GEOG",
    "number": "1301",
    "honors": false,
    "writing": true,
    "name": "Our Globalizing World",
    "fullname": "Our Globalizing World",
    "info": "Introduction to geographical understandings of globalization and of connections/differences between places.",
    "prereq": {}
  },
  {
    "uid": "798882",
    "code": "GEOG1372",
    "subject": "GEOG",
    "number": "1372",
    "honors": false,
    "writing": false,
    "name": "Global Cities",
    "fullname": "Geography of Global Cities",
    "info": "Urban forms/processes. Uses key global cities as examples.  Political, historical, and economic contexts of cities. Planning ideologies. Globalization. Race/segregation. Population growth. Environmental problems. Current issues in global urbanization.",
    "prereq": {}
  },
  {
    "uid": "007396",
    "code": "GEOG1403",
    "subject": "GEOG",
    "number": "1403",
    "honors": false,
    "writing": false,
    "name": "Biogeography",
    "fullname": "Biogeography of the Global Garden",
    "info": "The geography of biodiversity and productivity, from conspicuous species to those that cause human disease and economic hardship. The roles played by evolution and extinction, fluxes of energy, water, biochemicals, and dispersal. Experiments demonstrating interactions of managed and unmanaged biotic with the hydrologic cycle, energy budgets, nutrient cycles, the carbon budget, and soil processes. ",
    "prereq": {}
  },
  {
    "uid": "792462",
    "code": "GEOG1425",
    "subject": "GEOG",
    "number": "1425",
    "honors": false,
    "writing": false,
    "name": "Intro to Weather and Climate",
    "fullname": "Introduction to Weather and Climate",
    "info": "A pre-calculus introduction to the nature of the atmosphere and its behavior. Topics covered include atmospheric composition, structure, stability, and motion; precipitation processes, air masses, fronts, cyclones, and anticyclones; general weather patterns; meteorological instruments and observation; weather map analysis; and weather forecasting.",
    "prereq": {}
  },
  {
    "uid": "011258",
    "code": "GEOG1426",
    "subject": "GEOG",
    "number": "1426",
    "honors": false,
    "writing": false,
    "name": "Meteorology-Lab",
    "fullname": "Introduction to Meteorology Laboratory",
    "info": "Offered in conjunction with 1425. Weather observation, meteorological instrumentation. Statistical analysis of weather observations, climatological data. Map analysis, weather forecasting.",
    "prereq": {}
  },
  {
    "uid": "007678",
    "code": "GEOG1502",
    "subject": "GEOG",
    "number": "1502",
    "honors": false,
    "writing": false,
    "name": "Mapping Our World",
    "fullname": "Mapping Our World",
    "info": "Learn how maps and other spatial technologies like phones, drones, and GPS work. Use web-based tools to make maps for class, jobs, and fun. Explore how mapping is a useful lens through which to view interactions between technology and society, and see how mapping technology saves lives, rigs elections, and spies on people.",
    "prereq": {}
  },
  {
    "uid": "805657",
    "code": "GEOG1901",
    "subject": "GEOG",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "795956",
    "code": "GEOG1904",
    "subject": "GEOG",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Course Guide.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "796165",
    "code": "GEOG1905",
    "subject": "GEOG",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "789721",
    "code": "GEOG1906W",
    "subject": "GEOG",
    "number": "1906",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "799115",
    "code": "GEOG1910W",
    "subject": "GEOG",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "817035",
    "code": "GEOG1911",
    "subject": "GEOG",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Digital Earth",
    "fullname": "Digital Earth",
    "info": "In today’s digital and data-intensive era, geospatial technologies have become an integral part of everyday life. Searching for business locations\nand driving directions using web and mobile maps, or using location-based services offered with smart phones (e.g. Uber) has become routine. Geospatial technologies enable us to capture, store, process, and display a vast amount of geographic information about the Earth and the environment. The term Digital Earth is a visionary concept for creating a digital, multi-resolution, three-dimensional representation of the Earth, storing and managing access to geospatial data and everything that is known about the planet. This course primarily aims to familiarize students\nwith the basic concepts of geospatial technologies and datasets used to create a Digital Earth. Students will develop skills needed to locate, gather, manipulate, process, visualize, and use geospatial data. ",
    "prereq": {}
  },
  {
    "uid": "817145",
    "code": "GEOG1912",
    "subject": "GEOG",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Climate Change and Minnesota",
    "fullname": "Climate Change and Minnesota",
    "info": "Climate change is perhaps one of the world's most pressing challenges both at present and in the near future. Human-induced increases in greenhouse gases are widely thought to be responsible for increasing atmospheric temperatures with cascading effects on quality of life, water scarcity, biodiversity, security, and rising sea levels. This seminar explores the science behind climate change and its current and future impacts on Minnesota. The seminar also uses the subject matter as a vehicle to introduce college freshmen to critical thinking and writing. My approach teaching considers the impacts of a changing climate on Minnesota while developing specific skills students need to excel at the University of Minnesota. Of particular importance is the development of critical thinking skills needed to weigh the arguments of a complex and crucial topic often argued in the twenty-four hour news cycle, blogosphere, or on social media. This course assumes no prior knowledge of climate science and will be presented at a level appropriate to a first-year student at the University of Minnesota.",
    "prereq": {}
  },
  {
    "uid": "817041",
    "code": "GEOG1913",
    "subject": "GEOG",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "Living with Innovation",
    "fullname": "Living with Innovation",
    "info": "Technology has significantly improved lives across the globe: we have seen the cost of goods fall due to mass production; people have become more connected through revolutionary developments in transport and electronic communication; health has improved through better sanitation, pharmaceuticals, and surgical techniques. Yet there are still challenges for the future in terms of feeding a growing world population and coming to terms with climate changes.The solutions will be through new developments, innovations, in bio-, nano-, info-, and energy-technologies. These are already bringing benefits but also possible risks. For example, the benefits of genetic engineering for improved food security are obvious and yet there is a fear that it will lead to   ?frankenfoods?.  Similarly, artificial intelligence (AI) has the potential to take over boring and repetitive jobs in the work place but in so doing could put millions out of work, and some even fear robots threatening human existence. This seminar will examine the idea that living with innovation depends on developing policies that properly manage risks in an informed way, by trying to anticipate and assess them rather than just to avoid them. Risk assessment is a scientific approach that combines an understanding of threat, exposure and vulnerability ? recognizing uncertainties in all the elements ? to estimate the likelihood of impacts.Risk management policy often has to balance the risks from emerging technologies with their benefits. Historically the risks that have arisen from innovation have been small compared with benefits so decisions have been relatively easy. However, some of the risks from the new generation of emerging technologies have potentially big consequence, e.g. in the development of bioweapons, misuse of geo-engineering to unilaterally alter climate, cyberwar, and killer robots. These present special challenges for policy to ensure that we enjoy the benefits of the technology while keeping catastrophic threats acceptably low ? and will form a basis of small group discussions as part of the seminar. An underlying message from the seminar will be that making the right connections between science and policy is a key part of living with innovation.",
    "prereq": {}
  },
  {
    "uid": "819813",
    "code": "GEOG1914",
    "subject": "GEOG",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "Latinx Life/Justice in Cities",
    "fullname": "The Border Crossed Us: Latinx Life and Justice in the City",
    "info": "For decades now Latinx immigrant rights activists have chanted, “We didn’t cross the border, the border crossed us” – exposing how the U.S. imposed a southern border that seized massive swaths of Mexican territory and continues to supersede its borders through military interventions across Latin America that force people to leave. The crisis we are witnessing at the U.S.-Mexico border is not new and is historically rooted in U.S. imperialism and colonialism. Yet, Latinx migrants continue to move, live and collectively organize to build a more socially just world across U.S. cities. \n\nThis seminar will examine the multifaceted dimensions of the Latinx urban experience in the U.S., with a special focus on the Twin Cities context. Drawing on diverse scholarship across urban geography, Latinx Studies and feminist theory, we will explore why Latinx people are here? What challenges they face? How they make home across and beyond borders? And how they mobilize for social justice in the city? Students will have the opportunity to learn from local Latinx community-based organizations working on various issues from migrant rights, housing justice and food justice. Students will also have the opportunity to go on several field trips to learn about Latinx life and activism in the Twin Cities. ",
    "prereq": {}
  },
  {
    "uid": "819947",
    "code": "GEOG1915",
    "subject": "GEOG",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "Gullah/Geechee Nation",
    "fullname": "Cultural heritage and environmental change in Gullah/Geechee Nation",
    "info": "Sea level rise and climate change pose serious challenges for the well-being of people living along the coast. When responding to these challenges, communities, scientists, and governments have to take account of the way in which some communities have deep cultural ties to the land they inhabit. Co-taught by Queen Quet, the Chieftess and Head of State of the Gullah/Geechee Nation and Kate Derickson, faculty in Geography and long time collaborator of Queen Quet’s, this course will explore the thorny challenges at the intersection of cultural heritage and environmental change by engaging with the case of the Gullah/Geechee people. \n\nThe Gullah/Geechee people are descended from freed and escaped enslaved Africans brought to the Southeast coast and the Sea Islands in part due to their knowledge of agriculture to be enslaved on rice, cotton, and indigo plantations. Today, many Gullah/Geechee people still live on the same land that their ancestors were enslaved on. Their ancestors bought this land during Reconstruction and continued to practice traditional farming and it and traditional fishing in the surrounding waterways. The Gullah/Geechee culture is inextricably tied to the land and the water of the Sea Islands and the coast, a connection that has to be accounted for in efforts to mitigate the effects of climate change and inform future planning and community development in the region.\n\nStudents will spend the course in a virtual “studio” setting on campus once weekly - learning, discussing, and exploring the history and culture of the Gullah/Geechee people and the causes and consequences of environmental change in the region. We will also explore different models, ethics, and approaches to engaged scholarship. Students will be divided into groups with a region of Gullah/Geechee Nation to focus on. Each group will produce a StoryMap with archival data, photos, and other relevant data and information collected during and after the field trip. Training in building StoryMaps will be provided. Grades will be assessed on an individual and group basis.",
    "prereq": {}
  },
  {
    "uid": "825213",
    "code": "GEOG1916",
    "subject": "GEOG",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Social Justice & Twin Cities",
    "fullname": "Social Justice and the Twin Cities",
    "info": "This seminar will explore the interconnected histories, geographies, and politics of the Twin Cities – Minneapolis and St. Paul, Minnesota. Drawing on urban geography, urban studies, feminist, and critical race theory literatures, we will examine how settler colonialism, anti-Black racism, and other intersecting forces of oppression shape how urban spaces are formed and experienced in the Twin Cities. We will also closely examine how different urban actors, from local grassroots collectives, non-profit organizations, and city governments, have sought to address social and racial inequities and work towards social change. Furthermore, we will deeply engage with the longstanding histories and presents of Black, Indigenous, and Latinx social justice activism in the Twin Cities. Students will have the opportunity to learn from local community organizers and activists and go on a field trip to learn about social justice and social change in the Twin Cities.\n\n\n",
    "prereq": {}
  },
  {
    "uid": "004192",
    "code": "GEOG1973",
    "subject": "GEOG",
    "number": "1973",
    "honors": false,
    "writing": false,
    "name": "Geography of the Twin Cities",
    "fullname": "Geography of the Twin Cities",
    "info": "The University of Minnesota sits in the middle of a fascinating city, and in this class you will explore parts of that city in-depth. You will learn about the human geography of the Twin Cities, how they have developed in the past, and how they are changing. You will examine the settlement, economic change, social practices, and political events that have shaped the Twin Cities, learning how to look at this place through multiple and contesting perspectives. \n\nThrough a combination of in-depth field work, applied research, readings, and discussion, you will learn about urban concepts like immigration, Native populations, poverty, homelessness, segregation, redlining, suburbanization, shifts in retail and jobs, zoning, transit, metropolitan governance, urban renewal, and more. The goal is to foster your critical reflection on important, contemporary challenges facing our metropolitan region, and develop a new way to look at your present home.",
    "prereq": {}
  },
  {
    "uid": "792381",
    "code": "GEOG281",
    "subject": "GEOG",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "Sem: Africa",
    "fullname": "Sem: Africa",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "004506",
    "code": "GEOG3001",
    "subject": "GEOG",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Geog Inquiry",
    "fullname": "Geographic Inquiry and Human Development",
    "info": "Principles of geographic inquiry applied to understanding development. Climate formation; vegetation, soils; natural resources; cultural systems; production systems; demographic change; settlement and communications systems; cultural diffusion; political systems, nations, geopolitics; flows of goods, people, money; contrasting development visions; development inequalities.",
    "prereq": {}
  },
  {
    "uid": "003455",
    "code": "GEOG3101",
    "subject": "GEOG",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Geography of the United States",
    "fullname": "Geography of the United States",
    "info": "How do we understand the United States? Who are we as a nation? How did we get that way? This course takes a distinctly geographic approach to these questions, one that is interested in how socio-cultural, political-economic, and biophysical forces intersect in the shaping of America as a place. In this class, we will explore the kind of social and technological innovations and transformations that have made the American present. We will look at how the decisions of the past have shaped both the possibilities and problems of the present in order to help us grapple with the complexities of building the kinds of futures we want to live in. Rather than approaching this as an inevitable story of triumphant progress, we will pay attention to the erasures, exploitation, and violence that were part of these transformations. It is only through grappling with these complexities that we can work towards a future that works.\n\nThis course is designed for any student who is interested in making sense of the country we live in and feels invested in its future. Through the use of case studies, we will explore some of the essential issues facing modern America including immigration and sense of place, agriculture, and water in the Great Plains and the American West, and the intertwined future of American urbanism and the automobile industry as well as a few others. Students can expect to build skills in integrative thinking as they explore problems at the intersection of a variety of human and natural systems as well as an appreciation for how complexity shapes the production of and solution for contemporary socio-environmental problems.\n",
    "prereq": {}
  },
  {
    "uid": "008396",
    "code": "GEOG3102",
    "subject": "GEOG",
    "number": "3102",
    "honors": false,
    "writing": false,
    "name": "US and Canada",
    "fullname": "Geography of the United States and Canada",
    "info": "Analysis of ethical dilemmas and policy issues that arise as a result of the diverse ways in which different groups of people interact with the complexities of the natural environment in various regions of the United States and Canada.",
    "prereq": {}
  },
  {
    "uid": "007474",
    "code": "GEOG3111",
    "subject": "GEOG",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Minnesota",
    "fullname": "Geography of Minnesota",
    "info": "The evolution of Minnesota and its current geographical characteristics. The state is a unique political entity that possesses similarities with other states because of  the homogenizing influence of the federal government.",
    "prereq": {}
  },
  {
    "uid": "820166",
    "code": "GEOG3121",
    "subject": "GEOG",
    "number": "3121",
    "honors": false,
    "writing": false,
    "name": "Geography of Latin America",
    "fullname": "Geography of Latin America",
    "info": "This course will look at historical and contemporary Latin America to give students an idea about the varied political, economic, and cultural practices in the Caribbean, Central America, and South America. Readings will focus mostly on the experiences and struggles of Afro-Latin, indigenous, and working-class populations in Latin America, in order that we might learn about the region from otherwise marginalized viewpoints. Course assignments will ask students to critically reflect on the power relations that shaped and continue to shape the region. Course topics include colonialism, state formation, present-day territorial contestation, and the current political shifts that dominate the news headlines across the region. At the end of the semester students will have a solid understanding of the forces responsible for conditions in present-day Latin America.",
    "prereq": {}
  },
  {
    "uid": "788067",
    "code": "GEOG3141",
    "subject": "GEOG",
    "number": "3141",
    "honors": false,
    "writing": false,
    "name": "Africa",
    "fullname": "Africa",
    "info": "Regional differentiation of human groups and environments; culture contact and problems of underdeveloped countries south of the Sahara.",
    "prereq": {}
  },
  {
    "uid": "789895",
    "code": "GEOG3145",
    "subject": "GEOG",
    "number": "3145",
    "honors": false,
    "writing": false,
    "name": "The Islamic World",
    "fullname": "The Islamic World: A Global Introduction",
    "info": "The Islamic World provides a comprehensive introduction on Islam from its inception to today. The course’s journey begins with Islam’s dawn in the small desert oasis of Mecca in the Arabian peninsula over 14 centuries ago to today when it is a worldwide faith. One hundred years from its inception, Islam spread to what is today Syria, Iraq, the Horn of Africa, North Africa, and across the Mediterranean Sea. Central Asia, the Indian subcontinent, and Anatolia (Turkey) came under the sway of Islam leading to the emergence of three major Islamic civilization that dominated and enlightened the old world for several centuries. This era came to an end with the rise of Capitalist Europe and its colonization of much of the world including Muslim societies. Like many colonized peoples, Muslims threw the yoke of colonialism and joined the postcolonial World. Beyond this historical geographic survey, the course examines the Muslim World’s relationships with the West, democracy, and development. It will also explore how Muslim and Islam engage the seemingly contemporary topics such as human rights, gender relations, the monumental environmental crisis of our time, the war on terror and the terror of war, and the Palestinian-Israeli conflict. Soo Dhawoow (Welcome).",
    "prereq": {}
  },
  {
    "uid": "787788",
    "code": "GEOG3158",
    "subject": "GEOG",
    "number": "3158",
    "honors": false,
    "writing": false,
    "name": "Southern Africa",
    "fullname": "Southern Africa: Apartheid and Beyond",
    "info": "Historical geography. Clash of economic/cultural systems. Colonization, destruction of traditional political economy, settlement, dispossession. Capitalist agriculture, racist economy. Mining, consolidation of racist political economy. Migration/labor. Resistance to colonialism/apartheid. Independence/development north of Limpopo river. Regional implications of struggle against apartheid. Development in post-apartheid Southern Africa. ",
    "prereq": {}
  },
  {
    "uid": "004200",
    "code": "GEOG3161",
    "subject": "GEOG",
    "number": "3161",
    "honors": false,
    "writing": false,
    "name": "Europe",
    "fullname": "How the World Made Europe",
    "info": "It is impossible to think about the contemporary world without the lasting impact Europe has had on it. But what are the deeper reasons for Europe to emerge as a dominant region from the late Middle Ages onwards? Why has Europe recently found itself in profound economic and political, even existential crisis? Historical geography provides answers. Divided by landscape, language, religion, and war, European empires imposed the state-form, capitalism, and their cultures on the rest of the world. European societies even became the supposed standard for how all humanity is meant to live. But there have always been cracks in this success story. The project of the European Union promised peace and prosperity for half a billion people but faces unprecedented challenges, from Brexit, the Ukraine war, and the return of state racism to climate change and covid. This course will guide you through Europe?s general historical characteristics to understand how it shaped globalization.",
    "prereq": {}
  },
  {
    "uid": "004195",
    "code": "GEOG3181",
    "subject": "GEOG",
    "number": "3181",
    "honors": false,
    "writing": false,
    "name": "Russia & Environs",
    "fullname": "Russia and Environs",
    "info": "Physical and human geography of Russia and former Soviet republics. Legacy of central planning on regional economies, city systems and city structure. Economic and cultural links among regions and republics. Conflicts rooted in religion, ethnicity and tradition. Relations with nearby states and regions. Physical environmental problems.",
    "prereq": {}
  },
  {
    "uid": "004174",
    "code": "GEOG3211",
    "subject": "GEOG",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "East Asia",
    "fullname": "East Asia",
    "info": "Physical and human geography of Japan, mainland China and Taiwan, North and South Korea; population pressure, economic and urban development, and international relations.",
    "prereq": {}
  },
  {
    "uid": "792484",
    "code": "GEOG3212",
    "subject": "GEOG",
    "number": "3212",
    "honors": false,
    "writing": false,
    "name": "Producing India",
    "fullname": "Producing India",
    "info": "Colonial rule, anti-/post-colonial nationalisms. State, modernization, domestic/international conflicts. Development planning. Rural/urban transformations, emerging ecologies. Population, poverty, migrations. Media, post-colonial politics. Contested imaginations of \"India.\"",
    "prereq": {}
  },
  {
    "uid": "004177",
    "code": "GEOG3215",
    "subject": "GEOG",
    "number": "3215",
    "honors": false,
    "writing": false,
    "name": "China",
    "fullname": "Geography of China",
    "info": "Physical, human, and historical geography of greater China: mainland China and Taiwan; demographic transition; national minorities, economic and urban development, and international relations.",
    "prereq": {}
  },
  {
    "uid": "004551",
    "code": "GEOG3331",
    "subject": "GEOG",
    "number": "3331",
    "honors": false,
    "writing": false,
    "name": "Geography of the World Economy",
    "fullname": "Geography of the World Economy",
    "info": "An invisible, not-quite-dead, not-quite-alive entity—the coronavirus—forced us, rudely and tragically, to reckon with space. As we try and maintain social distance from other bodies, wear masks to disrupt the virus’ pathways of diffusion, confront shortages in grocery stores, home supply outlets, and car dealerships, adjust to interruptions in many services, and either choose to, or are forced to stay at home, in our cities, in our countries, we are thinking and acting spatially. And we are reminded that “stuff”—food, medicines, toilet paper—reaches us often through geographically extensive and logistically intricate webs of economic production and distribution.\n\nWe will learn what it means to think geographically about the capitalist economy as a spatial, relational formation. In doing so, we will challenge dominant ways of understanding and analyzing the economy, and of what counts as economic. We will also examine two simultaneous aspects of the world economy—fixity and flow. On the one hand, the economy propels and is propelled by flows—of goods, of services, of people, of labor, and of finance. On the other hand, physical infrastructures are rooted in place on the earth. After all, even the digital worlds of Facebook, Google, and Amazon are enabled by vast server farms. The course will also highlight the production and proliferation of inequalities—between social groups, states, countries, and regions—in and by the world economy. In fact, we will ask: Is economic unevenness a mere byproduct of capitalist economic growth, or the condition of possibility for it? Finally, we will discuss the relationships between global phenomena and local events. Crises like global climate change, overflows of waste matter, COVID19, and the 2008 financial meltdown make it clear that the global and the local are intimately entangled. Not only do global events impact individual livelihoods, including yours and mine, but economic jitters in one place can escalate, sending shockwaves across the world.\n",
    "prereq": {}
  },
  {
    "uid": "820459",
    "code": "GEOG3341",
    "subject": "GEOG",
    "number": "3341",
    "honors": false,
    "writing": false,
    "name": "Black Geographies",
    "fullname": "Black Geographies",
    "info": "This course will engage the sub-discipline of Black Geographies by looking at Geographical literature on the question of Blackness as well as case studies on the ways in which Afro-descendant populations make place. Course readings and films will attend to Blackness as it manifests across the African Diaspora, with specific focus on the Americas. We will discuss the experiences and struggles of enslaved Africans in the Americas, struggles against slavery, the ways in which we can understand histories of Blackness, and different forms of struggle employed by Afro-descendant populations today. At the end of the semester students will have a solid grounding in the literature around Black Geographies, as well as a nuanced understanding of the different ways in which Black populations analyze and create space.\n",
    "prereq": {}
  },
  {
    "uid": "007399",
    "code": "GEOG3355",
    "subject": "GEOG",
    "number": "3355",
    "honors": false,
    "writing": false,
    "name": "Environ Quality",
    "fullname": "Environmental Quality",
    "info": "The quality of the human environment depends on 1) how humans make decisions about how to act, 2) how they act, and 3) how they evaluate both. In the United States, this process is best described as .disjointed incrementalism. in which governments, organizations, and individuals play distinct and important roles.",
    "prereq": {}
  },
  {
    "uid": "003840",
    "code": "GEOG3361W",
    "subject": "GEOG",
    "number": "3361",
    "honors": false,
    "writing": true,
    "name": "Geography and Public Policy",
    "fullname": "Geography and Public Policy",
    "info": "Nature/effects of federal policy in the United States. How documents produced as policy are crafted/implemented. Policies relating to food/agriculture, forestry, wildlife, and transportation.",
    "prereq": {}
  },
  {
    "uid": "003844",
    "code": "GEOG3362",
    "subject": "GEOG",
    "number": "3362",
    "honors": false,
    "writing": false,
    "name": "Geog & Real Estate",
    "fullname": "Geography and Real Estate",
    "info": "Through lectures involving professionals working in the real estate business, field trips, and personal research the course examines the nature and history of real property (\"land\") ownership in the United States with special reference to Minnesota. The focus will be on the mechanistic, legalistic, and historic characteristics of ownership rather than the uses to which real property has been put or the philosophical, sociological, or economic aspects of ownership or use. More attention will be paid to the published and unpublished primary materials that characterize the nature of land ownership than to the secondary literature.",
    "prereq": {}
  },
  {
    "uid": "004213",
    "code": "GEOG3371W",
    "subject": "GEOG",
    "number": "3371",
    "honors": false,
    "writing": true,
    "name": "Cities, Citizens & Communities",
    "fullname": "Cities, Citizens, and Communities",
    "info": "Introduction to cities and suburbs as unique crossroads of cultural, social, and political processes. Competing/conflicting visions of city life, cultural diversity, and justice. Focuses on the American city. ",
    "prereq": {}
  },
  {
    "uid": "004770",
    "code": "GEOG3373",
    "subject": "GEOG",
    "number": "3373",
    "honors": false,
    "writing": false,
    "name": "Changing Form of City",
    "fullname": "Changing Form of the City",
    "info": "Urban origins, ancient cultures/cities, the medieval city, rediscovery of planning, colonial cities. Industrialization and urban expansion. Speculative cities, utopian cities, planning triumphs/disasters. Cities as reflections of society, culture, the past.",
    "prereq": {}
  },
  {
    "uid": "004771",
    "code": "GEOG3374W",
    "subject": "GEOG",
    "number": "3374",
    "honors": false,
    "writing": true,
    "name": "The City in Film",
    "fullname": "The City in Film",
    "info": "Cinematic portrayal of changes in 20th-century cities worldwide including social and cultural conflict, political and economic processes, changing gender relationships, rural versus urban areas, and population and development issues (especially as they affect women and children).",
    "prereq": {}
  },
  {
    "uid": "004216",
    "code": "GEOG3375",
    "subject": "GEOG",
    "number": "3375",
    "honors": false,
    "writing": false,
    "name": "Minority Settlement",
    "fullname": "Minority Settlement in America",
    "info": "Comparative analysis of minorities in American cities, including migration patterns, residential patterns, socioeconomic characteristics, public and private community enterprises, and class in urban structure.",
    "prereq": {}
  },
  {
    "uid": "787789",
    "code": "GEOG3376",
    "subject": "GEOG",
    "number": "3376",
    "honors": false,
    "writing": false,
    "name": "Political Ecology",
    "fullname": "Political Ecology",
    "info": "Environmental problems and political economic processes are intimately connected. The latter shape where and how people encounter nature, who has access to resources, and which communities are exposed to or protected from environmental harms. In this course, you will join others in examining how environmental problems are produced and how people organize to address them. Through readings, video, film, and lectures you will learn to identify the racial and class dimensions of environmental change. You will also understand the goals and principles of the environmental justice movement and explore inspiring struggles to build socially just ecological relations. Over the course of the semester you will acquire robust analytical and theoretical tools for understanding the political and ecological dimensions of racial capitalism and settler colonialism and learn how alternative social and ecological worlds might be generated and sustained.",
    "prereq": {}
  },
  {
    "uid": "797496",
    "code": "GEOG3377",
    "subject": "GEOG",
    "number": "3377",
    "honors": false,
    "writing": false,
    "name": "Music in the City",
    "fullname": "Music in the City",
    "info": "Why is music so central to the life of the city? Throughout the ages, throughout the world, music seems to have a special power to fill urban space with meaning. This is mostly why the music industry is always desperately trying to chase the new ways music is produced and consumed. Much about the rapid changes in the industry can be linked to changes taking place in the geography of cities and globalization. Through music, people feel connected to landscapes,  neighborhoods, buildings, and identities. Music gives value to places, so helps cement us/them divisions, a process easily seen (heard) in national anthems. This course tries to understand how the interplay exactly occurs between sounds, places, and differences through case studies from many genres. The course makes use of a large range of media and learning styles. Themes include the transnational circuits of reggae, the class backgrounds of punk, Motown and civil rights, psychedelic counterculture, underground electronic music, and the ambivalent identities of Minneapolis's very own Prince.",
    "prereq": {}
  },
  {
    "uid": "004217",
    "code": "GEOG3378",
    "subject": "GEOG",
    "number": "3378",
    "honors": false,
    "writing": false,
    "name": "The Third World",
    "fullname": "The Third World: Development, poverty, possibility",
    "info": "Processes underlying socioeconomic change in the Third World. Evolving global economy, internal spatial/socioeconomic conditions. Theories of modernization, development, and underdevelopment.",
    "prereq": {}
  },
  {
    "uid": "003560",
    "code": "GEOG3379",
    "subject": "GEOG",
    "number": "3379",
    "honors": false,
    "writing": false,
    "name": "Env &Livelihoods, Global South",
    "fullname": "Environment and Livelihoods in the Global South",
    "info": "Environmental destruction of our planet over the last three centuries has been a product of radical political and economic shifts in the world. This course examines how our world’s economic and political systems, and the livelihoods they engender in the Global South, have produced catastrophic local and global environmental conditions. What we produce, sell, buy, how we consume goods, and how we dispose of the waste are at the heart of the world’s deteriorating environmental conditions. The current global world order has produced a world in which overconsumption and poverty have led to an environmental disaster that is endangering all species. Example of the topics we will explore include the state of global fisheries and forests, the struggle over scarce water resources, and the responsibility each of us has as an individual and a citizen in reversing the lone planet’s ability to support the lives of all humans and other species.\n\nprereq: Soph or jr or sr",
    "prereq": {}
  },
  {
    "uid": "004202",
    "code": "GEOG3381W",
    "subject": "GEOG",
    "number": "3381",
    "honors": false,
    "writing": true,
    "name": "World Population",
    "fullname": "Population in an Interacting World",
    "info": "Comparative analysis and explanation of trends in fertility, mortality, internal and international migration in different parts of the world; world population problems; population policies; theories of population growth; impact of population growth on food supply and the environment.",
    "prereq": {}
  },
  {
    "uid": "803695",
    "code": "GEOG3388",
    "subject": "GEOG",
    "number": "3388",
    "honors": false,
    "writing": false,
    "name": "Geographies of Travel/Tourism",
    "fullname": "Going Places: Geographies of Travel and Tourism",
    "info": "Are you wondering whether you will be able to travel as you did a few years ago? One of the largest industries, tourism, is in a profound crisis. This course understands tourism in relation to other kinds of mobility, like shopping, colonialism, trafficking, migration, and pilgrimage. As the negative environmental and health impacts of tourism have become obvious, significant demands have emerged on its practices and policies. Investigating the landscapes and economies of cars, planes, beaches, parks, malls, and museums, we come to appreciate the unique challenges tourism poses for global citizenship and the planet. To gain a critical geographical understanding of mobility, we engage a range of ethical frameworks such as human rights, feminism, social justice, and utilitarianism. Our final destination is an informed and critical ethics of travel in the age of pandemics and climate change.",
    "prereq": {}
  },
  {
    "uid": "007402",
    "code": "GEOG3401W",
    "subject": "GEOG",
    "number": "3401",
    "honors": false,
    "writing": true,
    "name": "Env Systems and Global Change",
    "fullname": "Geography of Environmental Systems and Global Change",
    "info": "This course provides a basic foundation in environmental science and global change. Conceptualizing the environment as composed of “systems” (as in the course name) is a common framework in the environmental sciences because it puts the focus on interactions and connections. The “systems” we focus on in this class are the atmosphere (climate), the hydrosphere (water), the biosphere (plants), and the geosphere (land), along with their connections with human activities and decision making.\n\nWe approach the study of environmental systems through the lens of global climate change, which has the potential for far-reaching consequences that extend across environmental systems. You'll recognize how climate processes lead to the spatial patterns of climate that influence human activity (e.g., agriculture, recreation) and infrastructure (e.g., levees, building codes). You'll also learn how soils, landforms, and ecosystems affect and are affected by changes in climate and by decisions humans make about how to live on, and use, the land. Achieving consensus among us as to what should be done in response to environmental change (whether or not those changes are caused by humans) is not a goal of this course; rather, the goal is for you to feel equipped to critically evaluate the range of potential solutions, trade offs, and ethical questions that surround environmental issues.\n\nYou’ll practice what you learn in this course by writing a “consultant report” on the likely impacts of climate change on the human and environmental systems of a location of your choosing. You’ll draw on scholarly research, government documents, and your own analyses to create your report, which is written for a non-expert audience. This kind of writing is a common expectation of environmental scientists, consultants, or policymakers. A series of focused “writing workshops” will support the research and writing process and the development of your final consultant report.",
    "prereq": {}
  },
  {
    "uid": "005370",
    "code": "GEOG3411W",
    "subject": "GEOG",
    "number": "3411",
    "honors": false,
    "writing": true,
    "name": "Geog of Health & Health Care",
    "fullname": "Geography of Health and Health Care",
    "info": "Application of human ecology, spatial analysis, political economy, and other geographical approaches to analyze problems of health and health care. Topics include distribution and diffusion of disease; impact of environmental, demographic, and social change on health; distribution, accessibility, and utilization of health practitioners and facilities.",
    "prereq": {}
  },
  {
    "uid": "825350",
    "code": "GEOG3421",
    "subject": "GEOG",
    "number": "3421",
    "honors": false,
    "writing": false,
    "name": "Climatology",
    "fullname": "Climatology",
    "info": "This is a course on general climatology and the physical fundamentals of climate change that are most relevant to biophysical and socio-environmental processes.  It is geared towards students in geography, environmental science, and the liberal arts and humanities who need a foundational understanding of climatology to grapple with social and biophysical dimensions of climate change. In a conceptual but not heavily quantitative framework, course activities (readings, discussion, lectures, computer labs), the course provides a broad-level overview of the physical processes that underlie Earth's climate system and lead to climate variations at global, regional, and local scales, as well as a survey of contemporary topics in climate change science. Course themes include: Earth's atmosphere and ocean; global energy and water balances; general and secondary circulation; controls on regional climate; climate data collection and interpretation; coupled modes of climate variability and related teleconnections; paleoclimatology; climate change; extreme events; climate modeling frameworks; observed and anticipated climate change impacts.\n\n",
    "prereq": {}
  },
  {
    "uid": "816903",
    "code": "GEOG3423",
    "subject": "GEOG",
    "number": "3423",
    "honors": false,
    "writing": false,
    "name": "Urban Climatology",
    "fullname": "Urban Climatology",
    "info": "Most of us live in cities and thus in urban-modified climates. In this course you’ll learn how and why cities can affect their immediate – and possibly regional and global – environments. You’ll also get experience with urban climate research via a project we will develop together as a class. You’ll draw on public documents and research papers, collect and analyze data, and collaborate with your colleagues (and your instructor) to bring the project to completion. The research and problem-solving skills you develop or refine in this course are ones you can draw on in your other courses and in your post-graduate career.\n\n",
    "prereq": {}
  },
  {
    "uid": "003842",
    "code": "GEOG3431",
    "subject": "GEOG",
    "number": "3431",
    "honors": false,
    "writing": false,
    "name": "Plant & Animal Geog",
    "fullname": "Plant and Animal Geography",
    "info": "The landscape is shaped by complex interactions among plants, animals, and the physical environment. Where, when, and why different organisms live and interact where they do is influenced by myriad interacting forces. This course aims to provide an opportunity to investigate some specific patterns on the landscape by examining changes over time and space, and among communities comprised of multiple species assemblages. In this course, we will explore a variety of topics, depending on student interests and skills, that relate to biogeography and interactions among the landscape and people. We will examine the different factors that influence population change and examine species interactions, including concepts of keystone species, disturbance/landscape ecology, and species conservation approaches. Principally, we will complete readings and activities that touch on emerging issues in biogeography such as pathways to improving public land management, the incorporation of Traditional Ecological Knowledge (TEK) into ecological restoration plans, wilderness and federal lands policy, and the increasing challenge of invasive species.",
    "prereq": {}
  },
  {
    "uid": "791216",
    "code": "GEOG3441",
    "subject": "GEOG",
    "number": "3441",
    "honors": false,
    "writing": false,
    "name": "Quaternary Landscape Evolution",
    "fullname": "Quaternary Landscape Evolution",
    "info": "Roles of climate change, geomorphic history, vegetation change, and soil development in evolution of landscape patterns during Quaternary Period. Emphasizes North America.",
    "prereq": {}
  },
  {
    "uid": "004167",
    "code": "GEOG3511",
    "subject": "GEOG",
    "number": "3511",
    "honors": false,
    "writing": false,
    "name": "Principles of Cartography",
    "fullname": "Principles of Cartography",
    "info": "GEOG 3511/5511 is a basic introduction to cartography—the  art, science, and technology of maps and map making.  Our primary emphasis will be on map making, with lesser emphasis on cartographic research and the history of cartography. Lectures will focus on modern cartographic design principles, how they were  developed, and how they might be changing. Lab assignments help develop skills using digital tools for producing effective maps. The course has several specific learning objectives:  \n• use software to create maps that communicate their  subjects appropriately and effectively using sound  cartographic design principles \n• acquire or produce a base map that is appropriate in  scale, projection, and generalization \n• select and aggregate data appropriately to represent  on a map using a suitable symbolization strategy\n • gain an understanding of how current changes in  technology impact maps and map making \n• understand how fundamental design decisions  might differ for printed maps and web/mobile maps\n• understand how contemporary GIS and cartography  are interrelated, including the use of GIS becoming  ubiquitous and map making becoming increasingly available to anyone \n• gain an appreciation for the 3,500+ year history of  maps! \n\nprereq: 3 cr in geog or instr consent",
    "prereq": {}
  },
  {
    "uid": "806526",
    "code": "GEOG3521",
    "subject": "GEOG",
    "number": "3521",
    "honors": false,
    "writing": false,
    "name": "Digital Planet",
    "fullname": "Digital Planet: Understanding Your World in the Information Age",
    "info": "Mobile geospatial information technologies--\nfrom cell phone tracking/vehicle navigation to virtual globe mapping. Potentials, limits, and concerns about\ntheir use and ongoing developments. Use GPS and video to produce a GeoDiary. Surveillance, cyberspace, and\nmore common geospatial applications, especially those relying on mobile devices.",
    "prereq": {}
  },
  {
    "uid": "806393",
    "code": "GEOG3523",
    "subject": "GEOG",
    "number": "3523",
    "honors": false,
    "writing": false,
    "name": "Digital Mapping",
    "fullname": "Digital Mapping: Introduction to Making Online Maps for the Humanities and Sciences",
    "info": "Digital technologies with an emphasis on creating online maps and using digital geobrowser technologies. Google Earth, NASA WorldWind. Quantum GIS, GPS software/hardware. Manipulating data, preparing analysis, and making online interactive maps, called mashups.",
    "prereq": {}
  },
  {
    "uid": "007663",
    "code": "GEOG3531",
    "subject": "GEOG",
    "number": "3531",
    "honors": false,
    "writing": false,
    "name": "Spatial Analysis",
    "fullname": "Numerical Spatial Analysis",
    "info": "\"Everything is related to everything else, but near things are more related than distant things.\" The First Law of Geography proposed by Waldo Tobler implies the complex yet fascinating nature of the geospatial world. Spatial analysis in order to understand geographic numbers is becoming increasingly necessary to support knowledge discovery and decision-making. The objective of this course is to teach the fundamental theory and quantitative methods within the scope of geospatial analysis. The course starts with basic statistics, matrix, the background of spatial analysis, and exploratory spatial data analysis. Then, we will dive into the special nature of our spatial world, with fundamental geographic ideas and theories being introduced. The focus will be on numerical methods and models including descriptive statistics, pattern analysis, interpolation, and regression models. Finally, some advanced topics regarding spatial complexities and spatial networks will be introduced to arouse further interest in this realm. To sum, this is an introductory course that makes use of quantitative analytics such as linear algebra, statistics, and econometrics for spatial data analysis. By taking this course you will: -quantitatively understand critical concepts behind geospatial processes, such as scale, spatial weights, spatial autocorrelation, spatial dependence, spatial pattern. -learn key methods of analyzing spatial data: e.g., point pattern analysis, spatial autocorrelation statistics, spatial prediction, and spatial regression. -examine the lectured methods/models with data from geographic scenarios using Python and related programming packages. \n\nprereq: high-school algebra; Basic stats and linear algebra recommended",
    "prereq": {}
  },
  {
    "uid": "817762",
    "code": "GEOG3541",
    "subject": "GEOG",
    "number": "3541",
    "honors": false,
    "writing": false,
    "name": "Principles of Geocomputing",
    "fullname": "Principles of Geocomputing",
    "info": "The availability of computing infrastructures such as high-performance and cloud computing, high-speed networks, and rich data has led to a new scientific paradigm using computational approaches, termed computational science. Geocomputation is the \"application of a computational science paradigm to study a wide range of problems in geographical and earth systems (the geo) contexts\" (Openshaw, 2014). This course will introduce students to geocomputation as well as related areas including big spatial data, and cyberinfrastructure. Students will engage in hands-on exercises learning principles and best-practices in geocomputing. The ability to program is an essential skill for GIScientists. Learning to program takes time and a lot of practice, and in this course students will learn how to develop programs in the Python programming language to solve geospatial problems.",
    "prereq": {}
  },
  {
    "uid": "007166",
    "code": "GEOG3561",
    "subject": "GEOG",
    "number": "3561",
    "honors": false,
    "writing": false,
    "name": "Principles of GIS",
    "fullname": "Principles of Geographic Information Science",
    "info": "Introduction to study of geographic information systems (GIS) for geography and non-geography students. Topics include GIS application domains, data models and sources, analysis methods, and output techniques. Lectures, readings, and hands-on experience with GIS software.\n\nprereq: soph., jr. sr.",
    "prereq": {}
  },
  {
    "uid": "814049",
    "code": "GEOG3573",
    "subject": "GEOG",
    "number": "3573",
    "honors": false,
    "writing": false,
    "name": "Intro to Digital Mapping",
    "fullname": "Introduction to Digital Mapping: ArcGIS Basis",
    "info": "Desktop mapping functions using ArcGIS software. Application of systems to display/analysis of geographical data.",
    "prereq": {}
  },
  {
    "uid": "827172",
    "code": "GEOG3581",
    "subject": "GEOG",
    "number": "3581",
    "honors": false,
    "writing": false,
    "name": "Field GIS",
    "fullname": "Field GIS",
    "info": "In this field-based course, students will be directly exploring principles of field scientific inquiry (circle of scientific logic) starting with exploring the landscape through field observations and converting those field observations into environmental geographic field research questions. What is it? What is significant about this location? Where is it located in relation to biophysical features? Why is it located here not in another location? How is this location related to other locations and its surrounding environments? Through these observations and research questions the process will guide students in building not only curiosity and better focused exploration and investigation of the landscape, but it will lead into the skill of building a hypothesis and answering a research question.\nStudents carry out a variety of field measurements, identification, and analysis of environmental/geographic information to demonstrate how to solve environmental problems and make reasoned decisions. This hands-on course, through the circle of scientific logic process, introduces and implements field research techniques used in environmental and geographical sciences. Emphasis is placed on both theoretical and practical application of fundamental field methods.\nThis course supports the integration of geospatial technologies for field research measurements. Geospatial technologies are a range of modern tools supporting geographic research, mapping, and analysis. Geospatial technologies are comprised of techniques such as Geographic Information System (GIS), Remote Sensing (RS), and Global Positioning System (GPS). This outdoor course will provide fundamental information on geospatial technologies and other environmental measurement tools and introduce students to resources that geospatial/environmental scientists use to collect spatial data and non-spatial in the field.  Students will be transferring field data to and from desktop systems and will develop skills integrating field data with GIS and RS applications. Students will learn different image-based sampling methods and conduct field validation of data.\n\nUsing what they have learned throughout the course, each student or group of students will design and carry out an independent field data driven research project and present the results along with a research presentation and paper in class at the end of the semester. ",
    "prereq": {}
  },
  {
    "uid": "827094",
    "code": "GEOG3582",
    "subject": "GEOG",
    "number": "3582",
    "honors": false,
    "writing": false,
    "name": "GIS for Public Health",
    "fullname": "Geographic Information Systems for Public Health",
    "info": "This course teaches the use of Geographic Information System (GIS) and its applications to public health. Through lectures, student-led discussions, and laboratory exercises, students will explore how GIS can be used to understand the relationships between people, their changing physical and social environments, and their health. Throughout the course, students will engage commonly used geospatial methods applied in public health for mapping and analyzing geographic variation.\n\nIn particular, we will cover the following topics: health-related events, identifying disease clusters, investigating environmental health problems, and understanding the spread of communicable and infectious diseases such as West Nile and Lyme disease. Upon the successful completion of this course, students will be able to have sufficient background to become expert users of GIS applications in health-related fields. ",
    "prereq": {}
  },
  {
    "uid": "013757",
    "code": "GEOG3605",
    "subject": "GEOG",
    "number": "3605",
    "honors": false,
    "writing": false,
    "name": "Perspectives on Planning",
    "fullname": "Geographic Perspectives on Planning",
    "info": "“We shape our buildings. Thereafter, our buildings shape us.” Winston Churchill.\n\nPlans and planning have been at the center of a struggle over our cities. The discipline evolved around critical urban problems and challenges — poverty, disease, art, democracy, mobility — and has continued to change along with our understanding of justice, value, and social good. \n\nThis course is going to dive into the history and present debates in urban planning, and will include two fieldwork activities that contrast planning and practice in Minneapolis. We will look at why the discipline of urban planning was created, how it has evolved, what tools planners use, how it works legally (e.g. zoning) and politically (e.g. public meetings). At the end of the semester, you will have a good grasp of the history of planning in cities, why most plans fail, and the central importance of planning to capitalism, democracy, and combating larger social problems. \n",
    "prereq": {}
  },
  {
    "uid": "009926",
    "code": "GEOG3671",
    "subject": "GEOG",
    "number": "3671",
    "honors": false,
    "writing": false,
    "name": "Chinese Society",
    "fullname": "Contemporary Chinese Society: Mainland China, Hong Kong, Taiwan",
    "info": "With a focus on post-1949 mainland China, Taiwan, and Hong Kong, students will be introduced to the Chinese family, dating and marriage, rural and urban societies, population, work and occupation, socioeconomic development and inequalities, and impacts of post-1978 reforms.",
    "prereq": {}
  },
  {
    "uid": "804671",
    "code": "GEOG3839",
    "subject": "GEOG",
    "number": "3839",
    "honors": false,
    "writing": false,
    "name": "Introduction to Dendro",
    "fullname": "Introduction to Dendrochronology",
    "info": "Examination of past landscape histories are critical for assessing how environments change and identifying causal mechanisms. Tree-rings, the annual growth rings formed by trees growing in temperate regions, are an instrumental tool for elucidating changes over time. As biological entities, tree-rings are recorders of changes in their surroundings. The application of tree-rings to understand environmental change is called dendrochronology. Dendrochronology has played an important role in understanding past climates, disturbance regimes, and the history of Indigenous peoples (to name just a few applications). Its use has been critical to understanding pressing environmental issues such as 20th century global warming, the impacts of fire suppression on forested landscapes, the loss of the Black Forest in Europe (pollution), and the use/abandonment of archaeological sites (the Anasazi and Ojibwe). It is an exceedingly interesting analytical tool that has unique applications, but it isn’t as simple as counting the rings of trees to determine an age. In this course we will focus on the biology, theoretical principles, and operational techniques of dendrochronology and apply this knowledge toward understanding forest change. By the end of the course students will be able to conduct basic dendrochronological research and appreciate the advantages and limitations of this important tool. My aim is to expose you to the foundational science behind the field, provide you with some simple tools, and introduce you to the variety of applications to which tree-ring analysis can be applied by doing some dendrochronological research. We will apply the tools of dendrochronology toward understanding forest dynamics in a specific landscape to examine fire and tree growth patterns and the influence of climate and people on the forested environment. This course will be a mixture of lecture and hands-on data analysis. The primary approach for this course is the development of a group research project utilizing data that is either collected in the field for a specific purpose or the use of data that is already archived. \n\nprereq: [1403, [BIOL 1001 or BIOL 1009 or equiv]] or instr consent",
    "prereq": {
      "and": [
        "007396",
        {
          "or": [
            "005419",
            "005416"
          ]
        }
      ]
    }
  },
  {
    "uid": "818539",
    "code": "GEOG3896",
    "subject": "GEOG",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer.  Typically the student\u0092s work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": {}
  },
  {
    "uid": "013332",
    "code": "GEOG3900",
    "subject": "GEOG",
    "number": "3900",
    "honors": false,
    "writing": false,
    "name": "Topics in Geography",
    "fullname": "Topics in Geography",
    "info": "Special topics/regions covered by visiting professors in their research fields.",
    "prereq": {}
  },
  {
    "uid": "016660",
    "code": "GEOG3973",
    "subject": "GEOG",
    "number": "3973",
    "honors": false,
    "writing": false,
    "name": "Geography of the Twin Cities",
    "fullname": "Geography of the Twin Cities",
    "info": "The University of Minnesota sits in the middle of a fascinating city, and in this class you will explore parts of that city in-depth. You will learn about the human geography of the Twin Cities, how they have developed in the past, and how they are changing. You will examine the settlement, economic change, social practices, and political events that have shaped the Twin Cities, learning how to look at this place through multiple and contesting perspectives. \n\nThrough a combination of in-depth field work, applied research, readings, and discussion, you will learn about urban concepts like immigration, Native populations, poverty, homelessness, segregation, redlining, suburbanization, shifts in retail and jobs, zoning, transit, metropolitan governance, urban renewal, and more. The goal is to foster your critical reflection on important, contemporary challenges facing our metropolitan region, and develop a new way to look at your present home.",
    "prereq": {}
  },
  {
    "uid": "005372",
    "code": "GEOG3985W",
    "subject": "GEOG",
    "number": "3985",
    "honors": false,
    "writing": true,
    "name": "Sr Project Seminar",
    "fullname": "Senior Project Seminar",
    "info": "Complete the research/writing of senior project.\n\nprereq: [jr or sr], instr consent",
    "prereq": {}
  },
  {
    "uid": "825775",
    "code": "GEOG3991",
    "subject": "GEOG",
    "number": "3991",
    "honors": false,
    "writing": false,
    "name": "Geography Capstone",
    "fullname": "Geography Capstone",
    "info": "The goals of this course are to help you reflect on your path through your Geography BA or BS major, assess the knowledge and skills you developed during your degree program, recognize how your knowledge and skills support your personal and professional interests and goals, and articulate the value of a geographic perspective for tackling complex social and environmental issues. The course is only open to students in their senior year.",
    "prereq": {}
  },
  {
    "uid": "010576",
    "code": "GEOG3992",
    "subject": "GEOG",
    "number": "3992",
    "honors": false,
    "writing": false,
    "name": "Directed Reading",
    "fullname": "Directed Reading",
    "info": "Guided individual reading.\nPrereq-instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "010575",
    "code": "GEOG3993",
    "subject": "GEOG",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual study.\nPrereq-instr consent, dept consent, college consent. ",
    "prereq": {}
  },
  {
    "uid": "010577",
    "code": "GEOG3994",
    "subject": "GEOG",
    "number": "3994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Individual guided research.\nPrereq instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "804404",
    "code": "GEOG3995",
    "subject": "GEOG",
    "number": "3995",
    "honors": false,
    "writing": false,
    "name": "Community Service Learning",
    "fullname": "Community Service Learning supplemental credit",
    "info": "Community service learning component added to course.\n\nprereq: [concurrent registration is required (or allowed) in 3xxx or concurrent registration is required (or allowed) in 5xxx] geography course with structured community service learning component, instr consent",
    "prereq": {}
  },
  {
    "uid": "809027",
    "code": "GEOG3996",
    "subject": "GEOG",
    "number": "3996",
    "honors": false,
    "writing": false,
    "name": "Senior Proj Directed Research",
    "fullname": "Senior Project Directed Research",
    "info": "Individual guided research course taken in fulfillment of the senior project requirement.\nPrereq instr consent,dept consent,college consent.",
    "prereq": {}
  },
  {
    "uid": "809029",
    "code": "GEOG3997",
    "subject": "GEOG",
    "number": "3997",
    "honors": false,
    "writing": false,
    "name": "Senior Project",
    "fullname": "Senior Project",
    "info": "Senior Project add-on credit. Must be taken concurrently with required or elective course related to area of specialization.\nPrereq instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "004554",
    "code": "GEOG4001",
    "subject": "GEOG",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Geographic Inquiry",
    "fullname": "Modes of Geographic Inquiry",
    "info": "Examination of competing approaches to the study of geography. Environmental determinism; regional tradition; scientific revolution; behavioral geography; modeling and quantitative geography; radical geography; interpretive and qualitative approaches; feminist and postmodern geography; ecological thinking and complexity; geographic ethics.",
    "prereq": {}
  },
  {
    "uid": "787907",
    "code": "GEOG4002W",
    "subject": "GEOG",
    "number": "4002",
    "honors": false,
    "writing": true,
    "name": "Env. Thought and Practice",
    "fullname": "Environmental Thought and Practice",
    "info": "Changing conceptions of nature, culture, and environment in Western social/political thought. How our understanding of humans/nonhumans has been transformed by scientific and technological practices. Interdisciplinary, reading intensive.\n\nprereq: Jr or sr",
    "prereq": {}
  },
  {
    "uid": "005374",
    "code": "GEOG4121W",
    "subject": "GEOG",
    "number": "4121",
    "honors": false,
    "writing": true,
    "name": "Latin America",
    "fullname": "Latin America",
    "info": "Interplay of natural environment and history in shaping contemporary Latin America. Political ecology of natural resources, food supply and distribution, urbanization and the informal economy, migration, ethnicity, and the role of the state and international agencies in domestic economies.",
    "prereq": {}
  },
  {
    "uid": "009808",
    "code": "GEOG4382",
    "subject": "GEOG",
    "number": "4382",
    "honors": false,
    "writing": false,
    "name": "Cont Immig Amer",
    "fullname": "Contemporary Immigrant America",
    "info": "Analysis and explanation of contemporary immigration trends; immigration policies; immigrant rights; immigrant integration and adaptation; ethnic group formation; ethnic identities; ethnic neighborhoods and communities; second generation; immigrant women; ethnic conflict; xenophobic reactions. Community Service Learning component for 2 extra credits. ",
    "prereq": {}
  },
  {
    "uid": "792924",
    "code": "GEOG4700",
    "subject": "GEOG",
    "number": "4700",
    "honors": false,
    "writing": false,
    "name": "Community Service Learning",
    "fullname": "Community Service Learning",
    "info": "Community service, readings, written assignments, class\nactivities that promote reflection/synthesis. Students interrogate what they learn in more traditional geography\ncourses and confirm/question their understanding of geographic themes and their own role as social actors.",
    "prereq": {}
  },
  {
    "uid": "792165",
    "code": "GEOG5101",
    "subject": "GEOG",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Water Resources",
    "fullname": "Water Resources, Individuals and Institutions",
    "info": "How water resources are controlled by natural system functions, user actions, and the influence of social and political institutions. Explore how these three levels of control vary in space and time, paying particular attention to the complexities of each of these controls and the feedbacks among them.",
    "prereq": {}
  },
  {
    "uid": "004218",
    "code": "GEOG5143",
    "subject": "GEOG",
    "number": "5143",
    "honors": false,
    "writing": false,
    "name": "West Africa",
    "fullname": "Geography of West Africa",
    "info": "West Africa from Senegal to Cameroon; social geography of resource use, population, settlement, economic development, and international relations.",
    "prereq": {}
  },
  {
    "uid": "004558",
    "code": "GEOG5181",
    "subject": "GEOG",
    "number": "5181",
    "honors": false,
    "writing": false,
    "name": "Russia & Environs",
    "fullname": "Russia and Environs",
    "info": "Physical and human geography of Russia and former Soviet republics. Legacy of central planning on regional economies, city systems and city structure. Economic and cultural links among regions and republics. Conflicts rooted in religion, ethnicity and tradition. Relations with nearby states and regions. Physical environmental problems.",
    "prereq": {}
  },
  {
    "uid": "004175",
    "code": "GEOG5211",
    "subject": "GEOG",
    "number": "5211",
    "honors": false,
    "writing": false,
    "name": "East Asia",
    "fullname": "East Asia",
    "info": "Meets concurrently with Geog 3211 (see description). Open to graduate students in East Asian Studies and other disciplines who wish to study the region from a geographical perspective. An additional research paper is required from the 5211 students.",
    "prereq": {}
  },
  {
    "uid": "004178",
    "code": "GEOG5215",
    "subject": "GEOG",
    "number": "5215",
    "honors": false,
    "writing": false,
    "name": "China",
    "fullname": "Geography of China",
    "info": "Meets concurrently with Geog 3215 (see description). Open to graduate students in East Asian Studies and other disciplines who wish to study the region from a geographical perspective. An additional research paper is required from the 5215 students.",
    "prereq": {}
  },
  {
    "uid": "004197",
    "code": "GEOG5371W",
    "subject": "GEOG",
    "number": "5371",
    "honors": false,
    "writing": true,
    "name": "American Cities I",
    "fullname": "American Cities I: Population and Housing",
    "info": "Emergence of North American cities; residential building cycles, density patterns; metropolitan housing stocks, supply of housing services; population and household types; neighborhood-level patterns of housing use; housing prices; intraurban migration; housing submarkets inside metro areas; emphasis on linking theory, method, case studies.",
    "prereq": {}
  },
  {
    "uid": "004198",
    "code": "GEOG5372W",
    "subject": "GEOG",
    "number": "5372",
    "honors": false,
    "writing": true,
    "name": "American Cities II",
    "fullname": "American Cities II: Land Use, Transportation, and the Urban Economy",
    "info": "Urban economy, its locational requirements. Central place theory. Transportation, urban land use: patterns/conflicts. Industrial/commercial land blight. Real estate redevelopment. Historic preservation. Emphasizes links between land use, transportation policy, economic development, local fiscal issues. U.S.-Canadian contrasts.",
    "prereq": {}
  },
  {
    "uid": "004772",
    "code": "GEOG5374",
    "subject": "GEOG",
    "number": "5374",
    "honors": false,
    "writing": false,
    "name": "The City in Film",
    "fullname": "The City in Film",
    "info": "Cinematic portrayal of changes in 20th-century cities worldwide. Social/cultural conflict, political/economic processes, changing gender relationships, rural versus urban areas, population/development issues (especially as they affect women/children). Meets concurrently with 3374. Additional weekly meeting discusses films, readings. Project on a topic selected in consultation with instructor.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "797497",
    "code": "GEOG5377",
    "subject": "GEOG",
    "number": "5377",
    "honors": false,
    "writing": false,
    "name": "Music in the City",
    "fullname": "Music in the City: Sounds and Bodies in Different Places",
    "info": "Geographical conceptions of place, space, embodiment, and identity. Case studies of music.",
    "prereq": {}
  },
  {
    "uid": "003557",
    "code": "GEOG5385",
    "subject": "GEOG",
    "number": "5385",
    "honors": false,
    "writing": false,
    "name": "Globalization and Development",
    "fullname": "Globalization and Development: Political Economy",
    "info": "Nature/scope of modern world system (capitalism), its impact on regional development processes. Roles of state and of international financial institutions.\n\nprereq: Sr or grad or instr consent",
    "prereq": {}
  },
  {
    "uid": "003517",
    "code": "GEOG5393",
    "subject": "GEOG",
    "number": "5393",
    "honors": false,
    "writing": false,
    "name": "Rural Landscapes",
    "fullname": "Rural Landscapes and Environments",
    "info": "Analysis of three principal components of rural landscape (form of land surface, plant life that cloaks it, structures that people have placed upon it). Structures associated with agriculture, including mining, forestry, resort areas, and small towns.",
    "prereq": {}
  },
  {
    "uid": "795762",
    "code": "GEOG5401W",
    "subject": "GEOG",
    "number": "5401",
    "honors": false,
    "writing": true,
    "name": "Env Systems and Global Change",
    "fullname": "Geography of Environmental Systems and Global Change",
    "info": "This course provides a basic foundation in environmental science and global change. Conceptualizing the environment as composed of “systems” (as in the course name) is a common framework in the environmental sciences because it puts the focus on interactions and connections. The “systems” we focus on in this class are the atmosphere (climate), the hydrosphere (water), the biosphere (plants), and the geosphere (land), along with their connections with human activities and decision-making.\n\nWe approach the study of environmental systems through the lens of global climate change, which has the potential for far-reaching consequences that extend across environmental systems. You'll recognize how climate processes lead to the spatial patterns of climate that influence human activity (e.g., agriculture, recreation) and infrastructure (e.g., levees, building codes). You'll also learn how soils, landforms, and ecosystems affect and are affected by changes in climate and by decisions humans make about how to live on, and use, the land. Achieving consensus among us as to what should be done in response to environmental change (whether or not those changes are caused by humans) is not a goal of this course; rather, the goal is for you to feel equipped to critically evaluate the range of potential solutions, trade offs, and ethical questions that surround environmental issues.\n\nYou’ll practice what you learn in this course by writing a “consultant report” on the likely impacts of climate change on the human and environmental systems of a location of your choosing. You’ll draw on scholarly research, government documents, and your own analyses to create your report, which is written for a non-expert audience. This kind of writing is a common expectation of environmental scientists, consultants, or policymakers. A series of focused “writing workshops” will support the research and writing process and the development of your final consultant report.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "009825",
    "code": "GEOG5411W",
    "subject": "GEOG",
    "number": "5411",
    "honors": false,
    "writing": true,
    "name": "Geog of Health",
    "fullname": "Geography of Health and Health Care",
    "info": "Application of human ecology, spatial analysis, political economy, and other geographical approaches to analyze problems of health and health care. Topics include distribution and diffusion of disease; impact of environmental, demographic, and social change on health; distribution, accessibility, and utilization of health practitioners and facilities.",
    "prereq": {}
  },
  {
    "uid": "795138",
    "code": "GEOG5421",
    "subject": "GEOG",
    "number": "5421",
    "honors": false,
    "writing": false,
    "name": "Intro Atmospheric Science",
    "fullname": "Introduction to Atmospheric Science",
    "info": "Calculus-based introduction to atmospheric dynamics, radiation, thermodynamics, chemical composition, and cloud processes.  Applications to climate, meteorology, the hydrologic cycle, air quality, and biogeochemical cycles.\n\nprereq: Familiarity with fundamentals of physics, calculus, and statistics, including differential and integral calculus and basic differential equations and basic thermodynamics, mechanics, and the electromagnetic spectrum",
    "prereq": {}
  },
  {
    "uid": "003845",
    "code": "GEOG5423",
    "subject": "GEOG",
    "number": "5423",
    "honors": false,
    "writing": false,
    "name": "Climate Models",
    "fullname": "Climate Models and Modeling",
    "info": "Survey of development and research with simple and complex (three-dimensional) climate models. Environmental processes and their numerical representation in climate models; evaluation of model sensitivity and accuracy; coupling between atmosphere, biosphere, hydrosphere, and cryosphere; assessment of model predictions for climate change.\n\nprereq: 3401 or instr consent",
    "prereq": {
      "or": [
        "007402"
      ]
    }
  },
  {
    "uid": "004870",
    "code": "GEOG5426",
    "subject": "GEOG",
    "number": "5426",
    "honors": false,
    "writing": false,
    "name": "Climatic Variations",
    "fullname": "Climatic Variations",
    "info": "Theories of climatic fluctuations and change at decadal to centuries time scales; analysis of temporal and spatial fluctuations especially during the period of instrumental record.\n\nprereq: 1425 or 3401 or instr consent",
    "prereq": {
      "or": [
        "792462",
        "007402"
      ]
    }
  },
  {
    "uid": "790494",
    "code": "GEOG5431",
    "subject": "GEOG",
    "number": "5431",
    "honors": false,
    "writing": false,
    "name": "Plant and Animal Geography",
    "fullname": "Plant and Animal Geography",
    "info": "Introduction to biogeography. Focuses on patterns of plant/animal distributions at different scales over time/space. Evolutionary, ecological, and applied biogeography. Paleobiogeography, vegetation-environment relationships, vegetation dynamics/disturbance ecology, human impact on plants/animals, nature conservation. Discussions, group/individual projects, local field trips.",
    "prereq": {}
  },
  {
    "uid": "004111",
    "code": "GEOG5441",
    "subject": "GEOG",
    "number": "5441",
    "honors": false,
    "writing": false,
    "name": "Landscape Evolution",
    "fullname": "Quaternary Landscape Evolution",
    "info": "Roles of climate change, geomorphic history, vegetation change, and soil development in the evolution of landscape patterns during the Quaternary Period, with emphasis on North America.",
    "prereq": {}
  },
  {
    "uid": "004032",
    "code": "GEOG5444",
    "subject": "GEOG",
    "number": "5444",
    "honors": false,
    "writing": false,
    "name": "Water Resources",
    "fullname": "Water Resources, Individuals and Institutions",
    "info": "Socio-cultural, legal, and economic forces that affect use of water resources by individuals/institutions. Historical trends in water policy, resulting water laws in the United States. Institutional structures whereby water resources are managed at federal, state, and local levels.",
    "prereq": {}
  },
  {
    "uid": "006313",
    "code": "GEOG5511",
    "subject": "GEOG",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Principles of Cartography",
    "fullname": "Principles of Cartography",
    "info": "GEOG 3511/5511 is a basic introduction to cartography—the  art, science, and technology of maps and map making.  Our primary emphasis will be on map making, with lesser emphasis on cartographic research and the history of cartography. Lectures will focus on modern cartographic design principles, how they were  developed, and how they might be changing. Lab assignments help develop skills using digital tools for producing effective maps. The course has several specific learning objectives:  \n• use software to create maps that communicate their  subjects appropriately and effectively using sound  cartographic design principles \n• acquire or produce a base map that is appropriate in  scale, projection, and generalization \n• select and aggregate data appropriately to represent  on a map using a suitable symbolization strategy\n • gain an understanding of how current changes in  technology impact maps and map making \n• understand how fundamental design decisions  might differ for printed maps and web/mobile maps\n• understand how contemporary GIS and cartography  are interrelated, including the use of GIS becoming  ubiquitous and map making becoming increasingly available to anyone \n• gain an appreciation for the 3,500+ year history of  maps!",
    "prereq": {}
  },
  {
    "uid": "013368",
    "code": "GEOG5512",
    "subject": "GEOG",
    "number": "5512",
    "honors": false,
    "writing": false,
    "name": "Cart Topics",
    "fullname": "Cartography: Topics",
    "info": "Selected topics include  the system of cartographic communication, map design, map reading, map analysis, history of cartography.\n\nprereq: 3511 or 3531 or instr consent",
    "prereq": {
      "or": [
        "004167",
        "007663"
      ]
    }
  },
  {
    "uid": "007163",
    "code": "GEOG5530",
    "subject": "GEOG",
    "number": "5530",
    "honors": false,
    "writing": false,
    "name": "Cart Internship",
    "fullname": "Cartography Internship",
    "info": "Provides intensive hands-on experience in contemporary map production and design, ranging from GIS applications to digital prepress.  Strong computer skills essential.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "790731",
    "code": "GEOG5531",
    "subject": "GEOG",
    "number": "5531",
    "honors": false,
    "writing": false,
    "name": "Numerical Spatial Analysis",
    "fullname": "Numerical Spatial Analysis",
    "info": "Applied/theoretical aspects of geographical quantitative methods for spatial analysis. Emphasizes analysis of geographical data for spatial problem solving in human/physical areas.",
    "prereq": {}
  },
  {
    "uid": "826773",
    "code": "GEOG5533",
    "subject": "GEOG",
    "number": "5533",
    "honors": false,
    "writing": false,
    "name": "Advanced Spatial Analysis",
    "fullname": "Advanced Spatial Analysis",
    "info": "What happens north, south, east, or west is very likely to be dependent on what is happening here. The uniqueness of geospatial information coming from both physical and human geography requires specialized theories and methods to tackle. Spatial analysis provides ways to approach complex spatial effects and to support geographic knowledge discovery. In this course, we will dive into several major topics in the field of quantitative spatial analysis, ranging from spatial statistics, point patterns, clustering, and spatial interpolation, to spatial regression analysis. Through in-person modules (lectures, reading activities, and labs) and a case study project, students will develop an in-depth understanding of spatial principles such as autocorrelation, scale, distance, and spatial associations. This is an advanced course for spatial analysis and geospatial data science that makes use of specialized linear algebra, statistical modeling, and computational skills.\n\nStudents need a basic background in statistics to succeed in the course. If you have this background but have not taken one of the listed prerequisite courses, please contact the instructor for a permission number.",
    "prereq": {}
  },
  {
    "uid": "817684",
    "code": "GEOG5541",
    "subject": "GEOG",
    "number": "5541",
    "honors": false,
    "writing": false,
    "name": "Principles of Geocomputing",
    "fullname": "Principles of Geocomputing",
    "info": "The availability of computing infrastructures such as high-performance and cloud computing, high-speed networks, and rich data has led to a new scientific paradigm using computational science. Geocomputation is the \"application of a computational science paradigm to study a wide range of problems in geographical and earth systems (the geo) contexts\" (Openshaw, 2014). This course will introduce students to geocomputation as well as related areas including big spatial data, and cyberinfrastructure. Students will engage in hands-on-exercises learning principles and best-practices in geocomputing. The ability to program is an essential skill for GIScientists. Learning to program takes time and a lost of practice, and in this course students will learn how to develop programs in the Python programming language to solve geospatial problems.",
    "prereq": {}
  },
  {
    "uid": "817747",
    "code": "GEOG5543",
    "subject": "GEOG",
    "number": "5543",
    "honors": false,
    "writing": false,
    "name": "Advanced Geocomputing",
    "fullname": "Advanced Geocomputing",
    "info": "The availability of computing infrastructures such as high-performance and cloud computing, highspeed networks, and rich data has led to a new scientific paradigm using computational approaches, termed computational science. Geocomputation is the \"application of a computational science paradigm to study a wide range of problems in geographical and earth systems (the geo) contexts\" (Openshaw, 2014). This course will delve into advanced topics in geocomputation as well as related areas ranging from geographic information and spatial big data to cyberinfrastructure and parallel computation. Students will engage in hands-on exercises learning principles and best practices in geocomputing while using cutting-edge computational infrastructures.",
    "prereq": {}
  },
  {
    "uid": "009057",
    "code": "GEOG5561",
    "subject": "GEOG",
    "number": "5561",
    "honors": false,
    "writing": false,
    "name": "Principles of GIS",
    "fullname": "Principles of Geographic Information Science",
    "info": "Introduction to the study of geographic information systems (GIS) for geography and non-geography students. Topics include GIS application domains, data models and sources, analysis methods and output techniques. Lectures, reading, and hands-on experience with GIS software.\n\nprereq: grad",
    "prereq": {}
  },
  {
    "uid": "007167",
    "code": "GEOG5562",
    "subject": "GEOG",
    "number": "5562",
    "honors": false,
    "writing": false,
    "name": "GIS Development Practicum",
    "fullname": "GIS Development Practicum",
    "info": "Algorithms/data structures for digital cartographic data, topological relationships, surface modeling, and interpolation. Map projections, geometric transformations, numerical generalization, raster/vector processing. Hands-on experience with software packages.\n\nprereq: GIS 5571 or instr consent",
    "prereq": {
      "or": [
        "009847"
      ]
    }
  },
  {
    "uid": "007168",
    "code": "GEOG5563",
    "subject": "GEOG",
    "number": "5563",
    "honors": false,
    "writing": false,
    "name": "Advanced GIS",
    "fullname": "Advanced Geographic Information Science",
    "info": "Advanced study of geographic information systems (GIS). Topics include spatial data models, topology, data encoding, data quality, database management, spatial analysis tools and visualization techniques. Hands-on experience using an advanced vector GIS package.\n\nprereq: B or better in 3561 or 5561 or instr consent",
    "prereq": {
      "or": [
        "007166",
        "009057"
      ]
    }
  },
  {
    "uid": "007660",
    "code": "GEOG5564",
    "subject": "GEOG",
    "number": "5564",
    "honors": false,
    "writing": false,
    "name": "Urban GIS",
    "fullname": "Urban Geographic Information Science and Analysis",
    "info": "Core concepts in urban geographic information science including sources for urban geographical and attribute data (including census data), urban data structures (focusing on the TIGER data structure), urban spatial analyses (including location-allocation models), geodemographic analysis, network analysis, and the display of urban data.\n\nprereq: 3561 or 5561",
    "prereq": {
      "or": [
        "007166",
        "009057"
      ]
    }
  },
  {
    "uid": "004102",
    "code": "GEOG5565",
    "subject": "GEOG",
    "number": "5565",
    "honors": false,
    "writing": false,
    "name": "Human-Environment Systems",
    "fullname": "Geographical Analysis of Human-Environment Systems",
    "info": "Applications of geographic information systems and other spatial analysis tools to analysis of environmental systems patterns, dynamics, and interactions. Focuses on global to landscape databases developed to analyze atmospheric, hydrospheric, geomorphic, pedologic, biologic, and human landuse systems.\n\nprereq: 3561 or 5561 or FR 4131 or LA 5573 or one intro GIS course or grad student or instr consent",
    "prereq": {
      "or": [
        "007166",
        "009057",
        "013085"
      ]
    }
  },
  {
    "uid": "003939",
    "code": "GEOG5588",
    "subject": "GEOG",
    "number": "5588",
    "honors": false,
    "writing": false,
    "name": "Advanced Geovisualization",
    "fullname": "Advanced Geovisualization",
    "info": "The generation and use of geographic information has become an integral part of our daily life, science, and technology. This has led to increasing interest in the design and development of interactive maps and dynamic geographic visualizations in 2D, 3D, and Web environments. The Advanced Geovisualization course intends to equip students with the knowledge and advanced technical skills needed to design and implement effective maps and create dynamic and interactive visualizations using geospatial data sets.",
    "prereq": {}
  },
  {
    "uid": "007276",
    "code": "GEOG5605W",
    "subject": "GEOG",
    "number": "5605",
    "honors": false,
    "writing": true,
    "name": "Perspectives on Planning",
    "fullname": "Geographical Perspectives on Planning",
    "info": "Open to graduate students and undergraduates wishing Honors credits. Includes one additional weekly seminar-style meeting and a bibliography project on a topic selected in consultation with the instructor. Meets with 3605. ",
    "prereq": {}
  },
  {
    "uid": "013734",
    "code": "GEOG5701",
    "subject": "GEOG",
    "number": "5701",
    "honors": false,
    "writing": false,
    "name": "Field Research",
    "fullname": "Field Research",
    "info": "Field investigation in physical, cultural, and economic geography; techniques of analysis and presentation; reconstruction of environments.",
    "prereq": {}
  },
  {
    "uid": "007699",
    "code": "GEOG5724",
    "subject": "GEOG",
    "number": "5724",
    "honors": false,
    "writing": false,
    "name": "Meanings of Place",
    "fullname": "Meanings of Place",
    "info": "Analysis of the messages and meanings of our natural and built surroundings. Considers place-based responses to urban and rural settings based on aesthetic, historic, social, personal, and design perspectives. Uses extensive project and field work components and involves significant writing.",
    "prereq": {}
  },
  {
    "uid": "003884",
    "code": "GEOG5775",
    "subject": "GEOG",
    "number": "5775",
    "honors": false,
    "writing": false,
    "name": "Geog Education",
    "fullname": "Geographic Education",
    "info": "Teaching geography from middle school up; pedagogical use of geographical themes; methods for effective teaching of multiple cognitive domains -- facts, theories, analytical skills, and evaluations; designing audio-visual aids, independent projects, simulations, etc. to meet National Standards in geography.",
    "prereq": {}
  },
  {
    "uid": "806345",
    "code": "GEOG5839",
    "subject": "GEOG",
    "number": "5839",
    "honors": false,
    "writing": false,
    "name": "Introduction to Dendro",
    "fullname": "Introduction to Dendrochronology",
    "info": "Examination of past landscape histories are critical for assessing how environments change and identifying causal mechanisms. Tree-rings, the annual growth rings formed by trees growing in temperate regions, are an instrumental tool for elucidating changes over time. As biological entities, tree-rings are recorders of changes in their surroundings. The application of tree-rings to understand environmental change is called dendrochronology. Dendrochronology has played an important role in understanding past climates, disturbance regimes, and the history of Indigenous peoples (to name just a few applications). Its use has been critical to understanding pressing environmental issues such as 20th century global warming, the impacts of fire suppression on forested landscapes, the loss of the Black Forest in Europe (pollution), and the use/abandonment of archaeological sites (the Anasazi and Ojibwe). It is an exceedingly interesting analytical tool that has unique applications, but it isn’t as simple as counting the rings of trees to determine an age. In this course we will focus on the biology, theoretical principles, and operational techniques of dendrochronology and apply this knowledge toward understanding forest change. By the end of the course students will be able to conduct basic dendrochronological research and appreciate the advantages and limitations of this important tool. My aim is to expose you to the foundational science behind the field, provide you with some simple tools, and introduce you to the variety of applications to which tree-ring analysis can be applied by doing some dendrochronological research. We will apply the tools of dendrochronology toward understanding forest dynamics in a specific landscape to examine fire and tree growth patterns and the influence of climate and people on the forested environment. This course will be a mixture of lecture and hands-on data analysis. The primary approach for this course is the development of a group research project utilizing data that is either collected in the field for a specific purpose or the use of data that is already archived. \n\nprereq: [1403, [BIOL 1001 or BIOL 1009 or equiv]] or instr consent",
    "prereq": {
      "and": [
        "007396",
        {
          "or": [
            "005419",
            "005416"
          ]
        }
      ]
    }
  },
  {
    "uid": "013333",
    "code": "GEOG5900",
    "subject": "GEOG",
    "number": "5900",
    "honors": false,
    "writing": false,
    "name": "Topics in Geography",
    "fullname": "Topics in Geography",
    "info": "Special topics and regions. Course offered by visiting professors in their research fields.",
    "prereq": {}
  },
  {
    "uid": "791602",
    "code": "GEOG8001",
    "subject": "GEOG",
    "number": "8001",
    "honors": false,
    "writing": false,
    "name": "Geographic Thought",
    "fullname": "Problems in Geographic Thought",
    "info": "Currents of geographic thought in biophysical, GIS, human, cultural, and human-environment subfields. Focuses on concepts/paradigms through which geographers have attempted to unify/codify the discipline, around which debate has flourished, and about which interdisciplinary histories can be traced.",
    "prereq": {}
  },
  {
    "uid": "791603",
    "code": "GEOG8002",
    "subject": "GEOG",
    "number": "8002",
    "honors": false,
    "writing": false,
    "name": "Research Methods in Geography",
    "fullname": "Research Methods in Geography",
    "info": "Seminar. Overview of research designs/methods in geography. Relationships between different research paradigms (modes of inquiry), research designs, and methods. Critical readings. Analyses of research projects.",
    "prereq": {}
  },
  {
    "uid": "004036",
    "code": "GEOG8005",
    "subject": "GEOG",
    "number": "8005",
    "honors": false,
    "writing": false,
    "name": "Prosem: Popn",
    "fullname": "Proseminar: Population Geography",
    "info": "Conceptual literature and empirical studies on fertility, mortality, and migrations in different parts of the world.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004037",
    "code": "GEOG8006",
    "subject": "GEOG",
    "number": "8006",
    "honors": false,
    "writing": false,
    "name": "Prosem:Res Meth Geography",
    "fullname": "Proseminar: Research Methods in Geography",
    "info": "Introduction to research design, strategies, methods of data collection, analysis, interpretation, and representation in contemporary geographic research.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "003733",
    "code": "GEOG8007",
    "subject": "GEOG",
    "number": "8007",
    "honors": false,
    "writing": false,
    "name": "Develpment & Chg",
    "fullname": "Proseminar: Theories of Development and Change",
    "info": "Recent research themes and questions in geography and related social sciences on Third World development; development theories, conceptually grounded case studies, and grassroots-based research.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004039",
    "code": "GEOG8020",
    "subject": "GEOG",
    "number": "8020",
    "honors": false,
    "writing": false,
    "name": "Economic Geog",
    "fullname": "Research Seminar: Economic Geography",
    "info": "Contemporary research. Advanced topics, which vary with interests of faculty offering course.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004033",
    "code": "GEOG8101",
    "subject": "GEOG",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "Nature & Society",
    "fullname": "Proseminar: Nature and Society",
    "info": "Interconnectedness of environment and people, nature and society. Conceptual literature and empirical studies in human/cultural/political ecology.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004030",
    "code": "GEOG8102",
    "subject": "GEOG",
    "number": "8102",
    "honors": false,
    "writing": false,
    "name": "Prosem: Spatial Dev",
    "fullname": "Proseminar: The State, the Economy, and Spatial Development",
    "info": "Introduction to research in economic, political, and urban geography: conceptual research addressing interrelationship between political and economic processes and spatial dynamics of urban and regional development; empirical research documenting nature and extent of this interrelationship at different spatial scales.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004035",
    "code": "GEOG8103",
    "subject": "GEOG",
    "number": "8103",
    "honors": false,
    "writing": false,
    "name": "Prosem: Physical",
    "fullname": "Proseminar: Physical Geography",
    "info": "Historical development of research in physical geography, current research trends, and transfer of current research to undergraduate education.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004034",
    "code": "GEOG8105",
    "subject": "GEOG",
    "number": "8105",
    "honors": false,
    "writing": false,
    "name": "Prosem: Historical",
    "fullname": "Proseminar: Historical Geography",
    "info": "Introduction to conceptual research and empirical studies.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004045",
    "code": "GEOG8106",
    "subject": "GEOG",
    "number": "8106",
    "honors": false,
    "writing": false,
    "name": "Social & Cultural",
    "fullname": "Seminar: Social and Cultural Geography",
    "info": "Role of space and place in constitution of social and cultural life, social relations, and social identities; class, space, and place; geography of race and racism; environmental racism; geography of gender and sexuality; nationalism, national identity, and territory.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "003745",
    "code": "GEOG8107",
    "subject": "GEOG",
    "number": "8107",
    "honors": false,
    "writing": false,
    "name": "Geog Writing",
    "fullname": "Geographic Writing",
    "info": "Analysis of organization and presentation of geographic research. Critiques of selected examples of geographic writing.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004040",
    "code": "GEOG8120",
    "subject": "GEOG",
    "number": "8120",
    "honors": false,
    "writing": false,
    "name": "Sem: Historical",
    "fullname": "Seminar: Historical Geography",
    "info": "Contemporary research. Advanced topics, which vary with interests of faculty offering course.",
    "prereq": {}
  },
  {
    "uid": "795388",
    "code": "GEOG8200",
    "subject": "GEOG",
    "number": "8200",
    "honors": false,
    "writing": false,
    "name": "Seminar: Urban Geography",
    "fullname": "Seminar: Urban Geography",
    "info": "Contemporary research. Topics vary with the interests of faculty.",
    "prereq": {}
  },
  {
    "uid": "792925",
    "code": "GEOG8201",
    "subject": "GEOG",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Geography of Minnesota",
    "fullname": "Explorations in the Geography of Minnesota",
    "info": "Physical environment, agriculture, forestry, mining, land survey, population, recreation, cities/towns, transportation. Sources of information about the state. Students make short oral/written reports. Might provide springboard for a Plan B paper, thesis, or dissertation. Two or three Saturday field trips.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004048",
    "code": "GEOG8211",
    "subject": "GEOG",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Federal Policy Research",
    "fullname": "Federal Policy Research",
    "info": "U.S. environmental policies at federal/state level. Policy formulation, implementation, and evaluation. This seminar provides students with the necessary information to carry out independent research into public policy and will add unfamiliar sources to their research bibliographies. Descriptive and analytical rather than theoretical, and illustrative rather than comprehensive, it gives both social scientists and biophysical scientists additional perspective to their personal research and adds an important dimension to their analysis. It will allow them to find, describe, critically review, and communicate those aspects of federal policy of concern. Students are encouraged to choose areas of policy coinciding with their areas of research.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "003734",
    "code": "GEOG8212",
    "subject": "GEOG",
    "number": "8212",
    "honors": false,
    "writing": false,
    "name": "Africa",
    "fullname": "Africa",
    "info": "Advanced topics. Topics vary with interests of faculty offering course.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004042",
    "code": "GEOG8213",
    "subject": "GEOG",
    "number": "8213",
    "honors": false,
    "writing": false,
    "name": "East Asia/China",
    "fullname": "East Asia and China",
    "info": "Contemporary research, advanced topics. Topics vary with interests of faculty offering course.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004043",
    "code": "GEOG8214",
    "subject": "GEOG",
    "number": "8214",
    "honors": false,
    "writing": false,
    "name": "South Asia",
    "fullname": "South Asia",
    "info": "Advanced topics. Topics vary with interests of faculty offering course.",
    "prereq": {}
  },
  {
    "uid": "003723",
    "code": "GEOG8220",
    "subject": "GEOG",
    "number": "8220",
    "honors": false,
    "writing": false,
    "name": "Agrarian Change & Rural Dev",
    "fullname": "Agrarian Change and Rural Development",
    "info": "Contours of agricultural/rural development in Third World. Theories of agrarian transformation and of rural development. Role of agriculture in economic development. Peasant economy. Nature/role of state intervention in rural sector.",
    "prereq": {}
  },
  {
    "uid": "004038",
    "code": "GEOG8230",
    "subject": "GEOG",
    "number": "8230",
    "honors": false,
    "writing": false,
    "name": "Theoretical Geog",
    "fullname": "Theoretical Geography",
    "info": "Advanced topics. Topics vary with interests of faculty offering course. Contemporary theoretical/philosophical themes transcending subdisciplines of human/physical geography.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004050",
    "code": "GEOG8240",
    "subject": "GEOG",
    "number": "8240",
    "honors": false,
    "writing": false,
    "name": "Medical Geog",
    "fullname": "Medical Geography",
    "info": "Geographic inquiry concerning selected problems of health and health care.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004051",
    "code": "GEOG8260",
    "subject": "GEOG",
    "number": "8260",
    "honors": false,
    "writing": false,
    "name": "Sem: Physical Geography",
    "fullname": "Seminar: Physical Geography",
    "info": "Topics of contemporary research. Topics vary with interests of faculty offering course.",
    "prereq": {}
  },
  {
    "uid": "003730",
    "code": "GEOG8270",
    "subject": "GEOG",
    "number": "8270",
    "honors": false,
    "writing": false,
    "name": "Sem: Climatatology",
    "fullname": "Seminar: Climatology",
    "info": "Sample topics: climate modeling; climatic variability; climate change and predictability; severe local storms; drought; energy balance; urban climate; statistical climatology.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "794087",
    "code": "GEOG8280",
    "subject": "GEOG",
    "number": "8280",
    "honors": false,
    "writing": false,
    "name": "Biogeography",
    "fullname": "Biogeography",
    "info": "Forest dynamics, dendrochronology, tree rings and climate, environmental disturbance, paleobiogeography, field/lab methods in biogeography.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004052",
    "code": "GEOG8290",
    "subject": "GEOG",
    "number": "8290",
    "honors": false,
    "writing": false,
    "name": "Seminar in GIS & Cartography",
    "fullname": "Seminar in GIS and Cartography",
    "info": "Selected concepts/methods. Topics, which vary yearly, include spatial analysis methods in GIS; advanced visualization methods; data quality and error propagation in GIS; generalization methods in GIS and cartography; role of time in GIS; interactive/animated cartography; incorporation of uncertainty.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004053",
    "code": "GEOG8291",
    "subject": "GEOG",
    "number": "8291",
    "honors": false,
    "writing": false,
    "name": "Sem in GIS, Tech & Society",
    "fullname": "Seminar in GIS, Technology, and Society",
    "info": "Relationships between practice of GIS and political, economic, legal, institutional structures of society. Effects of GIS on society. Nontraditional spaces in GIS. GIS and local decision making. Privacy issues.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "794088",
    "code": "GEOG8292",
    "subject": "GEOG",
    "number": "8292",
    "honors": false,
    "writing": false,
    "name": "GIS & Spatial Analysis",
    "fullname": "Seminar in GIS: Spatial Analysis and Modeling",
    "info": "Overview of Geographic Information Systems (GIS) and spatial analysis/modeling of human/environmental systems. Spatial statistics, modeling spatiotemporal processes, simulation techniques, visualization, complex systems/complexity. Guidance in thesis/dissertation research.\n\nprereq: 3511 [or equiv statistics course], [3561 or 5561 or equiv intro GIS course] or instr consent",
    "prereq": {
      "or": [
        "004167",
        {
          "or": [
            "007166",
            "009057"
          ]
        }
      ]
    }
  },
  {
    "uid": "817262",
    "code": "GEOG8293",
    "subject": "GEOG",
    "number": "8293",
    "honors": false,
    "writing": false,
    "name": "CyberGIS",
    "fullname": "CyberGIS",
    "info": "Just as physical infrastructure provides services such as electricity, plumbing, and road networks to communities across the world, cyberinfrastructure has emerged to provide computational services and capabilities to scientific communities. Cyberinfrastructure integrates high-performance computing, digital sensors, virtual organizations, and software tools and services to facilitate computationally-intensive and collaborative scientific research. CyberGIS, broadly defined as cyberinfrastructure-based geographic information systems, integrates cyberinfrastructure, geographic information systems (GIS), and spatial analysis to enable collaborative geographic problem solving.\n\nThis course will delve into advanced topics within the context of cyberGIS and related technologies. Particular emphasis will be placed on raster data processing including a broad introduction to raster data, cartographic modeling, and raster data manipulation. We will situate raster data processing in the broader context of geographic information science and cyberGIS focusing on the how synthesizing computational thinking and spatial thinking influence methodological approaches. \n\nStudents will be expected to draw on their own experiences and backgrounds to enhance\ndiscussions, labs, and research projects. Students will gain hands-on experience developing methods to analyze and manipulate raster data.\n",
    "prereq": {}
  },
  {
    "uid": "817665",
    "code": "GEOG8294",
    "subject": "GEOG",
    "number": "8294",
    "honors": false,
    "writing": false,
    "name": "Spatiotemp Modeling Simulation",
    "fullname": "Spatiotemporal Modeling and Simulation",
    "info": "Many geographic, societal, and environmental phenomena as well as biological and ecological systems involve dynamic processes that are changing in space and time. Examples include hurricanes, animal migrations, spread of diseases, human mobility and population dynamics. Movement is a key to understanding the underlying mechanisms of these dynamic processes. Today, the availability of an unprecedented amount of movement observations at ne spatial and temporal granularities has resulted in substantial advances in GISciences approaches for the analysis, modeling, and simulation of movement and its patterns. Spatiotemporal models and simulation techniques are often used to analyze and better understand the patterns of spatiotemporal processes, and to assess their behavioral responses in varying environmental conditions. This seminar introduces students to the concepts of spatiotemporal processes and patterns. We review existing methods for modeling and simulation of spatiotemporal phenomena, especially movement. Students will develop computational skills to model a phenomena of their choice and create simulations.",
    "prereq": {}
  },
  {
    "uid": "794089",
    "code": "GEOG8301",
    "subject": "GEOG",
    "number": "8301",
    "honors": false,
    "writing": false,
    "name": "Advanced Qualitative Methods",
    "fullname": "Advanced Qualitative Methods",
    "info": "Techniques available to scholars who use qualitative methods. Participant observation. Formal/informal interviews: life/oral histories, focus interviews. Documentary and material culture analysis. Practical experience, theoretical/ethical questions. ",
    "prereq": {}
  },
  {
    "uid": "003719",
    "code": "GEOG8302",
    "subject": "GEOG",
    "number": "8302",
    "honors": false,
    "writing": false,
    "name": "Research Proposal Development",
    "fullname": "Research Proposal Development",
    "info": "Students in geography and related social sciences are guided in key steps to effective research proposal writing. prereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004046",
    "code": "GEOG8320",
    "subject": "GEOG",
    "number": "8320",
    "honors": false,
    "writing": false,
    "name": "Space and Place",
    "fullname": "Seminar: Considering Space and Place",
    "info": "Aspects of place analysis/place description from variety of analytical and perceptual perspectives.",
    "prereq": {}
  },
  {
    "uid": "003744",
    "code": "GEOG8330",
    "subject": "GEOG",
    "number": "8330",
    "honors": false,
    "writing": false,
    "name": "Rural Geog",
    "fullname": "Seminar: Rural Geography",
    "info": "Sources of data and other information necessary for an understanding of rural areas in the United States.",
    "prereq": {}
  },
  {
    "uid": "788119",
    "code": "GEOG8333",
    "subject": "GEOG",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Masters",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "791057",
    "code": "GEOG8336",
    "subject": "GEOG",
    "number": "8336",
    "honors": false,
    "writing": false,
    "name": "Development Theory & the State",
    "fullname": "Development Theory and the State",
    "info": "Why certain interventionist states in third world countries have been able to guide their economies to overcome legacy of underdevelopment while most have failed to induce development. Internal/external conditions that facilitated such departure from underdevelopment. Comparative national/provincial case studies: Taiwan, South Korea, Botswana, Brazil, India. Applying theoretical approaches to policy issues.",
    "prereq": {}
  },
  {
    "uid": "004047",
    "code": "GEOG8340",
    "subject": "GEOG",
    "number": "8340",
    "honors": false,
    "writing": false,
    "name": "Sem: Land Use",
    "fullname": "Seminar: Land Use Planning",
    "info": "Topics of contemporary research, which vary with interests of faculty offering course.",
    "prereq": {}
  },
  {
    "uid": "004049",
    "code": "GEOG8350",
    "subject": "GEOG",
    "number": "8350",
    "honors": false,
    "writing": false,
    "name": "Sem: World Popn",
    "fullname": "Seminar: World Population",
    "info": "Contemporary research in world population development and problems. Topics vary with interests of faculty offering course.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "794672",
    "code": "GEOG8405",
    "subject": "GEOG",
    "number": "8405",
    "honors": false,
    "writing": false,
    "name": "Grad Student Prof Development",
    "fullname": "Seminar: Graduate Student Professional Development",
    "info": "Strategies for success in graduate program. Preparation for a career as a geographer. Completing/defending the dissertation. Publishing, job search, tenure process, oral presentations, non-academic career paths.\n\nprereq: Geography grad student",
    "prereq": {}
  },
  {
    "uid": "794090",
    "code": "GEOG8420",
    "subject": "GEOG",
    "number": "8420",
    "honors": false,
    "writing": false,
    "name": "Teaching Practicum",
    "fullname": "Teaching Practicum",
    "info": "Teaching methodologies, learning objectives, course content, classroom techniques, student/course evaluation. Specific application to instruction in Geography.\n\nprereq: [Geog or MGIS] grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "788355",
    "code": "GEOG8444",
    "subject": "GEOG",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788479",
    "code": "GEOG8666",
    "subject": "GEOG",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788606",
    "code": "GEOG8777",
    "subject": "GEOG",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "004054",
    "code": "GEOG8800",
    "subject": "GEOG",
    "number": "8800",
    "honors": false,
    "writing": false,
    "name": "Sem: Geog Thgt",
    "fullname": "Seminar: Development of Geographic Thought",
    "info": "Topics vary with interests of faculty offering course.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "787874",
    "code": "GEOG8888",
    "subject": "GEOG",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "004055",
    "code": "GEOG8970",
    "subject": "GEOG",
    "number": "8970",
    "honors": false,
    "writing": false,
    "name": "Directed Readings",
    "fullname": "Directed Readings",
    "info": "tbd\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "004056",
    "code": "GEOG8980",
    "subject": "GEOG",
    "number": "8980",
    "honors": false,
    "writing": false,
    "name": "Topics: Geography",
    "fullname": "Topics: Geography",
    "info": "Seminar offered by visiting or regular faculty. Topics vary with interests of faculty.prereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004057",
    "code": "GEOG8990",
    "subject": "GEOG",
    "number": "8990",
    "honors": false,
    "writing": false,
    "name": "Research Prob",
    "fullname": "Research Problems in Geography",
    "info": "Individual research projects.\n\nprereq: dept consent",
    "prereq": {}
  }
]