[
  {
    "uid": "802650",
    "code": "GERO5100",
    "subject": "GERO",
    "number": "5100",
    "honors": false,
    "writing": false,
    "name": "Topics in Gerontology",
    "fullname": "Topics in Gerontology",
    "info": "Timely topics related to the biology, sociology, and psychology of aging and applied aging services.",
    "prereq": {}
  },
  {
    "uid": "805593",
    "code": "GERO5101",
    "subject": "GERO",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Milestones Biology of Aging",
    "fullname": "Milestones in the Biology of Aging",
    "info": "Biological research in aging. Original literature, including seminal, historical background papers. Progress in field of biogerontology research.\n\nprereq: NIA training grant Functional Proteomics of Aging [grad student or postdoc fellow] or biology research grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "816260",
    "code": "GERO5102",
    "subject": "GERO",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Hot Topics: Biology of Aging",
    "fullname": "Hot Topics in the Biology of Aging",
    "info": "The goals of the course include providing the students with an essential understanding of the contemporary issues in biogerontology, including analysis of ethics issues in the field.\n\nThis course is open to graduate students and post-doctoral fellows involved in the NIA training grant Functional Proteomics of Aging. others may enroll with instr permission.",
    "prereq": {}
  },
  {
    "uid": "816667",
    "code": "GERO5103",
    "subject": "GERO",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Aging and Society",
    "fullname": "Aging and Society",
    "info": "Examines the broad range of topics and issues related to aging, and how the process of aging is shaped by social context and relationships in connection with individual factors, including family, the economy, health care, and the political system. Students in Master's or doctoral programs most likely to benefit. Students new to the field of aging studies are recommended to begin with GERO 5105/PubH 6883: Multidisciplinary Perspectives in Aging.",
    "prereq": {}
  },
  {
    "uid": "010619",
    "code": "GERO5105",
    "subject": "GERO",
    "number": "5105",
    "honors": false,
    "writing": false,
    "name": "Perspectives on Aging",
    "fullname": "Multidisciplinary Perspectives on Aging",
    "info": "Obtain a broad understanding of the multidisciplinary perspectives, theoretical underpinnings, and advancements in the study of aging (\"gerontology\"), in the inter-related domains of clinical geriatrics, psychology, sociology, and policy as related to aging.",
    "prereq": {}
  },
  {
    "uid": "787852",
    "code": "GERO5110",
    "subject": "GERO",
    "number": "5110",
    "honors": false,
    "writing": false,
    "name": "Biology of Aging",
    "fullname": "Biology of Aging",
    "info": "Biological changes that occur with aging. Methods for studying aging, descriptions of population aging, theories on how/why we age. Process of aging in each body system, variation between individuals/populations.  Clinical implications of biological changes with age. Guest lecturers from different disciplines.",
    "prereq": {}
  },
  {
    "uid": "794607",
    "code": "GERO5111",
    "subject": "GERO",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Studying Aging/Chronic Ilness",
    "fullname": "Studying Aging and Chronic Illness",
    "info": "Methodological issues unique to studies of older populations. Focuses on measurement of epidemiological characteristics. Health conditions/disorders of older Americans.\n\nprereq: Introductory course in epidemiology or instr consent",
    "prereq": {}
  },
  {
    "uid": "799912",
    "code": "GERO5112",
    "subject": "GERO",
    "number": "5112",
    "honors": false,
    "writing": false,
    "name": "Aging, Policy and Demography",
    "fullname": "Aging: Policy and Demography",
    "info": "Issues in population aging. Current aging policies in the United States. Data sources for aging policy analysis. Formal demographic concepts on aging.",
    "prereq": {}
  },
  {
    "uid": "802310",
    "code": "GERO5115",
    "subject": "GERO",
    "number": "5115",
    "honors": false,
    "writing": false,
    "name": "Introduction to Geriatrics",
    "fullname": "Introduction to Geriatrics",
    "info": "Online course. Major topics in geriatrics. How to diagnose/treat conditions common in caring for older people.",
    "prereq": {}
  },
  {
    "uid": "825237",
    "code": "GERO5117",
    "subject": "GERO",
    "number": "5117",
    "honors": false,
    "writing": false,
    "name": "Adult Development and Aging",
    "fullname": "Adult Development and Aging",
    "info": "This course examines the dynamic interaction of individual development and aging. Students will review the principal theories applied to understand individual development and aging, and explore methodological issues in adult development and aging; cognitive aging; social and health factors that influence developmental trajectories in aging and vice versa; and psychopathological issues in aging. It is recommended that those new to the field of aging students take PubH 6883/GERO 5105: Multidisciplinary Perspectives in Aging prior to taking this course. This course fulfills the Behavioral and Social Sciences concentration area requirement of the Gerontology Minor. ",
    "prereq": {}
  },
  {
    "uid": "807136",
    "code": "GERO5125",
    "subject": "GERO",
    "number": "5125",
    "honors": false,
    "writing": false,
    "name": "Gerontology Service Learning",
    "fullname": "Gerontology Service Learning",
    "info": "At least 100 hours of service to seniors or organizations serving seniors required. Longitudinal one-on-one relationship with at least two seniors. Service activities may include: friendly visiting, escorting seniors to medical appointments, chore services, teaching health education to groups of seniors and staff, participating in social or recreational activities with seniors, assisting with immunization and screening programs, assisting seniors with selection of health plans, or providing volunteer home health aide or nursing assistant services or emergency non-medical response under the supervision of a nurse.  Students may use up to 25 percent of their service time for project that benefits the campus as a whole. Reading, monthly class discussions, a term paper and weekly self-reflection",
    "prereq": {}
  },
  {
    "uid": "799566",
    "code": "GERO5191",
    "subject": "GERO",
    "number": "5191",
    "honors": false,
    "writing": false,
    "name": "Independent Study: Gerontology",
    "fullname": "Independent Study: Gerontology",
    "info": "Independent study: gerontology.\n\nprereq: Approval of [adviser, DGS] for gerontology minor",
    "prereq": {}
  },
  {
    "uid": "825507",
    "code": "GERO5518",
    "subject": "GERO",
    "number": "5518",
    "honors": false,
    "writing": false,
    "name": "Equity and Long-Term Care Qlty",
    "fullname": "Equity and Long-Term Care Quality",
    "info": "The objective of this course is to help students gain a deeper understanding of long-term care quality with a focus on equity. We will\npay particular attention to post-acute care settings, care integration across settings, the role of the workforce, and equity considerations\nacross all these topics. Post-acute care settings reviewed will include home care, assisted living, alternative care arrangements, nursing\nhomes, and hospice. There are no required prerequisites but students are encouraged to take a course on U.S. health care (e.g., PubH 6556, Health and Health Systems) prior to taking the course. Cross-listed with: PubH 6518",
    "prereq": {
      "or": [
        {
          "and": [
            "014122"
          ]
        },
        "825504"
      ]
    }
  },
  {
    "uid": "010617",
    "code": "GERO8020",
    "subject": "GERO",
    "number": "8020",
    "honors": false,
    "writing": false,
    "name": "Gero Seminar",
    "fullname": "Seminar in Gerontology",
    "info": "Meets weekly. Students present and discuss new or completed research projects on aging; conduct formal reviews using NIH formats; critique published papers using formal review criteria employed by gerontologic journals; become familiar with large database in aging and describe how that database has been used in research for secondary analyses.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "810442",
    "code": "GERO8021",
    "subject": "GERO",
    "number": "8021",
    "honors": false,
    "writing": false,
    "name": "App of Proteomics to Aging",
    "fullname": "Application of Proteomics to Aging",
    "info": "Proteomic technology in aging research. Faculty/student led discussions on topics relevant proteomic research. Overview of special techniques/analytical approaches complementary to proteomics, hands-on experience with data analysis, discussion of literature.\n\nprereq: [Grad students, post-doctoral fellows involved in National Institutes on Aging training grant Functional Proteomics of Aging] or grad students or post-doctoral fellows with instr consent",
    "prereq": {}
  },
  {
    "uid": "810443",
    "code": "GERO8022",
    "subject": "GERO",
    "number": "8022",
    "honors": false,
    "writing": false,
    "name": "Fostering Career Aging Rsrch",
    "fullname": "Fostering a Career in Aging Research",
    "info": "Prepare pre-doctoral students/post-doctoral fellows for next step in academic career. Student/faculty led discussions on preparing for job interviews, including composing CV/cover letter, preparing grant applications/manuscripts, developing course syllabus based on biology of aging.\n\nprereq: Grad students/post-doctoral fellows involved in National Institutes on Aging training grant Functional Proteomics of Aging or grad students or post-doctoral fellows with instr consent",
    "prereq": {}
  },
  {
    "uid": "811202",
    "code": "GERO8023",
    "subject": "GERO",
    "number": "8023",
    "honors": false,
    "writing": false,
    "name": "Aging Policy Seminar",
    "fullname": "Aging Policy Seminar",
    "info": "Topics chosen to match student interest. Potential issues include Medicare, Medicaid, Social Security, policies about long-term care, preventive care for older people, employment discrimination, ethical topics. Run seminar on topic of choice, write follow-up paper.\n\nprereq: Grad student or instr consent [recommended to have taken GERO 5105]",
    "prereq": {
      "and": [
        "010619"
      ]
    }
  }
]