[
  {
    "uid": "825286",
    "code": "GHSR6713",
    "subject": "GHSR",
    "number": "6713",
    "honors": false,
    "writing": false,
    "name": "Global Local",
    "fullname": "Global Health In Local Contexts",
    "info": "Global Health in Local Contexts: A Transnational Experiential Course on the Social Determinants, Health Equity, and Leading Change will immerse students in the study of health equity, the social and structural determination of health, the principles and practice of global health in local settings, and leading change. The discipline of social medicine provides a theoretical and practical framework to explore these topics. Social medicine is an approach to health that recognizes the centrality of the social and structural determination of health, integrates social theory to understand social forces that marginalize and harm communities, and builds collective power to challenge oppression and support the struggle for social justice. The course uses an experiential and inter-professional model; global, collaborative participation will promote understanding of the ways in which globally-connected social forces impact experience in local settings in similar and different ways.",
    "prereq": {}
  },
  {
    "uid": "825964",
    "code": "GHSR6715",
    "subject": "GHSR",
    "number": "6715",
    "honors": false,
    "writing": false,
    "name": "India: Global Hlth & Leadrship",
    "fullname": "India: Global Health, Globalization, & Leadership",
    "info": "This course will provide a global health learning experience with field observations in Mysuru (Mysore), India. Participants will learn about health and health care delivery in the context of globalization in India. The course is meant to convey the significance of the social determinants of health in a globalized world. The course will emphasize the leadership skills needed to function in the fields of global health and development and includes an intensive leadership workshop. Additionally, participants will collaboratively observe the grassroot level activities in public health, health care delivery, and other community activities.",
    "prereq": {}
  },
  {
    "uid": "826260",
    "code": "GHSR6723",
    "subject": "GHSR",
    "number": "6723",
    "honors": false,
    "writing": false,
    "name": "Ecuador: Enviro Detrmts Health",
    "fullname": "Ecuador: Social, Environmental, and Cultural Determinants of Health",
    "info": "In this 2-week course in Quito, Ecuador, participants will learn about the public health and health care infrastructure in Ecuador, including western and Indigenous health practices. Students will experience the social and cultural determinants of health in the Ecuadorian context enriched by short-term observational field visits addressing key health topics in urban, rural, and Indigenous settings in Andean Ecuador. This course seeks to foster team-based education and cross-disciplinary collaboration in global health through a combination of lectures and discussions, guided reflection, structured field site observation, case-studies with analysis, readings, literature review, and group work. ",
    "prereq": {}
  },
  {
    "uid": "826394",
    "code": "GHSR6725",
    "subject": "GHSR",
    "number": "6725",
    "honors": false,
    "writing": false,
    "name": "Global Health Ethics",
    "fullname": "Global Health Ethics",
    "info": "This course will look at the current state of global health and the ethical frameworks that need to be considered in global health engagements. The course will open with a review of the history of global health. Various ethical frameworks including development ethics and public health ethics will be reviewed. Students will also engage in discussions on ethical issues in pandemics, disasters, and global aid. Lastly the class will engage in application of ethical frameworks using case scenarios pertinent to global health. The course will also feature guest speakers with personal experience in global health. The course will feature a mixture of in-class lectures, readings, discussions, case studies, and presentations. ",
    "prereq": {}
  }
]