[
  {
    "uid": "801278",
    "code": "GIS5530",
    "subject": "GIS",
    "number": "5530",
    "honors": false,
    "writing": false,
    "name": "GIS Internship",
    "fullname": "GIS Internship",
    "info": "Practical hands-on experience using GIS to solve problems in a real-world work environment.\n\nprereq: instr consent, strong GIS/mapping skills",
    "prereq": {}
  },
  {
    "uid": "795389",
    "code": "GIS5555",
    "subject": "GIS",
    "number": "5555",
    "honors": false,
    "writing": false,
    "name": "Basic Spatial Analysis",
    "fullname": "Basic Spatial Analysis",
    "info": "How to use spatial data to answer questions on a wide array of social, natural, and information science issues. Exploratory data analysis/visualization. Spatial autocorrelation analysis/regression.\n\nprereq: [STAT 3001 or equiv, MGIS student] or instr consent",
    "prereq": {}
  },
  {
    "uid": "009847",
    "code": "GIS5571",
    "subject": "GIS",
    "number": "5571",
    "honors": false,
    "writing": false,
    "name": "Intermed. Spatial Data Science",
    "fullname": "Intermediate Spatial Data Science Applied with ArcGIS",
    "info": "This is the first of a two-course series focused on teaching skills in spatial data science with emphasis on the Esri ecosystem of geospatial technologies. Students will gain the baseline skills required to build end-to-end data integration pipelines and perform reproducible deterministic spatial analyses. By the end of the course, students will be able to build geospatial workflows and data systems that can address intermediate-level spatial analysis problems.\n\nprereq: [GEOG 5561 or equiv, status in MGIS program, familiarity with computer operating systems] or instr consent",
    "prereq": {
      "or": [
        "009057"
      ]
    }
  },
  {
    "uid": "009995",
    "code": "GIS5572",
    "subject": "GIS",
    "number": "5572",
    "honors": false,
    "writing": false,
    "name": "Advanced Spatial Data Science",
    "fullname": "Advanced Spatial Data Science Applied with ArcGIS",
    "info": "This is the second of a two-course series focused on teaching advanced skills in spatial data science with emphasis on the Esri ecosystem of geospatial technologies. Students will further develop the skills required to build end-to-end data integration pipelines in the cloud, build automated quality assurance and quality control procedures for data, and run and validate stochastic simulation models. By the end of the course, students will be able to build geospatial workflows and data systems, basic stochastic simulation models, store results and model validation steps in a database, and create professional-level communication maps and graphs.\n\nprereq: [5571, [GEOG 5561 or equiv], in MGIS program] or instr consent",
    "prereq": {
      "and": [
        "009847",
        {
          "or": [
            "009057"
          ]
        }
      ]
    }
  },
  {
    "uid": "009996",
    "code": "GIS5573",
    "subject": "GIS",
    "number": "5573",
    "honors": false,
    "writing": false,
    "name": "Intro to Digital Mapping",
    "fullname": "Introduction to Digital Mapping: ArcGIS Basics",
    "info": "Desktop mapping functions using ArcGIS software. Application of systems to display/analysis of geographical data.\n\nprereq: [GEOG 5561 or equiv, in MGIS program] or instr consent",
    "prereq": {
      "or": [
        "009057"
      ]
    }
  },
  {
    "uid": "010005",
    "code": "GIS5574",
    "subject": "GIS",
    "number": "5574",
    "honors": false,
    "writing": false,
    "name": "Web GIS and Services",
    "fullname": "Web GIS and Services",
    "info": "Plan, design, develop, publish web-based GIS solution. Build websites, prepare data for web. Commercial software, Open Source software, volunteer geographic information, open GIS standards/developing web GIS application. Hands-on experience with variety of web GIS technologies/software.\n\nprereq: [GEOG 5561 or equiv, in MGIS program] or instr consent",
    "prereq": {
      "or": [
        "009057"
      ]
    }
  },
  {
    "uid": "010013",
    "code": "GIS5575",
    "subject": "GIS",
    "number": "5575",
    "honors": false,
    "writing": false,
    "name": "Practical Surveying for GIS",
    "fullname": "Practical Surveying for GIS",
    "info": "Surveying techniques/relationship of GPS to GIS professionals. Geodesy, data adjustment, datums, ellipsoids, coordinate systems, transformations.\n\nprereq: GEOG 5561 or equiv in MGIS program or instr consent",
    "prereq": {
      "or": [
        "009057"
      ]
    }
  },
  {
    "uid": "010018",
    "code": "GIS5576",
    "subject": "GIS",
    "number": "5576",
    "honors": false,
    "writing": false,
    "name": "Spatial Digital Humanities",
    "fullname": "Spatial Digital Humanities",
    "info": "Introduction to Spatial Digital Humanities GIS 5576 is a basic overview of desktop GIS (both Esri and open source), as well as an introduction to a number of other mapping techniques (such as Esri Maps for Office, ArcGIS Online, web mapping basics, georeferencing historical maps, etc) in addition to digital scholarship techniques. Course objectives include: understanding the basics of mapping and geospatial information using GIS;  documenting and managing spatial data using coherent/standardized methods;  understanding several spatial analysis methods that are relevant to student research area; and applying spatial research methods into student research. ",
    "prereq": {}
  },
  {
    "uid": "015593",
    "code": "GIS5577",
    "subject": "GIS",
    "number": "5577",
    "honors": false,
    "writing": false,
    "name": "Spatial Database Design",
    "fullname": "Spatial Database Design and Administration",
    "info": "This semi-synchronous online graduate level course is aimed at students who have a foundation in GIS and spatial analysis methods and applications, and are interested in expanding their knowledge into the area spatial database design and spatial analysis. The course covers the following topics: 1) SQL and spatial-SQL queries, database design, and ArcServer Administration. This is an applied course and the objective is to introduce the fundamentals of databases, learn about how spatial data is treated into databases and apply spatial analysis methods. Students taking the class will have moderate to advanced understanding of GIS classes, but do not have much exposure to databases.",
    "prereq": {}
  },
  {
    "uid": "793876",
    "code": "GIS5578",
    "subject": "GIS",
    "number": "5578",
    "honors": false,
    "writing": false,
    "name": "GIS Programming",
    "fullname": "GIS Programming",
    "info": "This Python-focused GIS course is intended for students who have some Python programming experience, or have experience with other programming language(s) and knowledge transferable to Python. Following a review of Python basics, students will use Python modules for spatial data management, mapping, and analysis, including ArcGIS's ArcPy package; work with classes in Python; develop custom modules; and create development environments. A semester-long programming project applying Python skills to a GIS challenge is a significant component of the course.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "016088",
    "code": "GIS5590",
    "subject": "GIS",
    "number": "5590",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics in GIS",
    "info": "Topics vary according to curricular needs, technological developments in field.",
    "prereq": {}
  },
  {
    "uid": "788121",
    "code": "GIS8333",
    "subject": "GIS",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "790565",
    "code": "GIS8501",
    "subject": "GIS",
    "number": "8501",
    "honors": false,
    "writing": false,
    "name": "GIS Project Management",
    "fullname": "GIS Project Management and Professional Development",
    "info": "Project management/professional development. Portfolio creation, career exploration, degree program planning. GIS project management through lectures, class exercises, guest speakers.\n\nprereq: MGIS student or instr consent",
    "prereq": {}
  },
  {
    "uid": "789907",
    "code": "GIS8990",
    "subject": "GIS",
    "number": "8990",
    "honors": false,
    "writing": false,
    "name": "Research Problems in GIS",
    "fullname": "Research Problems in GIS",
    "info": "Project of sufficient scope/complexity to document student's ability to apply spatial analysis and visualization techniques to real-world problems. Supervised by faculty member.\n\nprereq: MGIS student, instr consent",
    "prereq": {}
  }
]