[
  {
    "uid": "787790",
    "code": "GLOS1015W",
    "subject": "GLOS",
    "number": "1015",
    "honors": false,
    "writing": true,
    "name": "Globalization",
    "fullname": "Globalization: Issues and Challenges",
    "info": "Increased global interconnections over past 50 years. Impact of information revolution on human rights, economic inequality, ecological challenges, and decolonization. Comparative cases from Asia, Africa, Latin America, or Middle East.",
    "prereq": {}
  },
  {
    "uid": "826676",
    "code": "GLOS1105",
    "subject": "GLOS",
    "number": "1105",
    "honors": false,
    "writing": false,
    "name": "Climate Crisis-Climate Justice",
    "fullname": "From Climate Crisis to Climate Justice",
    "info": "This course will explore one of our biggest threats today, global climate crisis, and understand it as deeply entangled with other pressing concerns such as deepening social inequality, racial and gender injustice, food insecurity and environmental devastation, war and violence. We will understand it as a global problem with different regional specificities and histories, learning from a multitude of perspectives, sciences, voices, and experiences. The course will explore how working to collectively resolve this environmental issue requires a multi-pronged approach that enables peoples around the world to imagine--and strive for--a world that reverses the course of history, moving from climate crisis to justice.",
    "prereq": {}
  },
  {
    "uid": "798784",
    "code": "GLOS1112",
    "subject": "GLOS",
    "number": "1112",
    "honors": false,
    "writing": false,
    "name": "Social Justice Across Borders",
    "fullname": "Social Justice Across Borders",
    "info": "Students will explore the ideas and practices of social justice movements and how those movements shape people’s lived experiences in the world.  This class will consider examples of effective cause-based movements to advance fairness and dignity on topics such as workers? rights, environmental justice, racial and gender equality, and human rights. Students will work together on a current social justice issue -- with both local and global implications -- designing their own responses to that issue.  Through this hands-on case study, we will unpack the tools and strategies of social justice movements, use interdisciplinary perspectives to investigate structural causes and key actors, imagine what change would look like and identify tactics for bringing about that change. Community activists, artists, and advocates will be regular visitors to the class and available to students.",
    "prereq": {}
  },
  {
    "uid": "790893",
    "code": "GLOS1200",
    "subject": "GLOS",
    "number": "1200",
    "honors": false,
    "writing": false,
    "name": "Global Studies Practicum",
    "fullname": "Global Studies Practicum",
    "info": "Exploratory experience in one part of the world as an integral feature of an undergraduate education and as preparation for learning the language of the area visited.",
    "prereq": {}
  },
  {
    "uid": "016584",
    "code": "GLOS1201",
    "subject": "GLOS",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Exploring Global Studies",
    "fullname": "Exploring Global Studies",
    "info": "Global studies, study abroad, and experiential learning. International film series, discussions with faculty, exposure to international media resources. Introduction to special language learning opportunities. Tied to Global Studies House residential experience.",
    "prereq": {}
  },
  {
    "uid": "801567",
    "code": "GLOS1600",
    "subject": "GLOS",
    "number": "1600",
    "honors": false,
    "writing": false,
    "name": "Topics in Global Studies",
    "fullname": "Topics in Global Studies",
    "info": "Topics vary every semester. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "798883",
    "code": "GLOS1672",
    "subject": "GLOS",
    "number": "1672",
    "honors": false,
    "writing": false,
    "name": "Global Cities",
    "fullname": "Geography of Global Cities",
    "info": "Urban forms/processes. Uses key global cities as examples.  Political, historical, and economic contexts of cities. Planning ideologies. Globalization. Race/segregation. Population growth. Environmental problems. Current issues in global urbanization.",
    "prereq": {}
  },
  {
    "uid": "793877",
    "code": "GLOS1902",
    "subject": "GLOS",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "793596",
    "code": "GLOS1904",
    "subject": "GLOS",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "794254",
    "code": "GLOS1905",
    "subject": "GLOS",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "788160",
    "code": "GLOS1909W",
    "subject": "GLOS",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "Topics: Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "809754",
    "code": "GLOS1910W",
    "subject": "GLOS",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "817061",
    "code": "GLOS1911",
    "subject": "GLOS",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Human Rights Strategy",
    "fullname": "Human Rights Strategy",
    "info": "In 1948, the Universal Declaration of Human Rights called on the world's nations to respect the \"inherent dignity and \"the equal inalienable rights\" of all people. But while the declaration helped globalize human rights, the world continues to experience genocide, torture, slavery, discrimination, economic destitution, and the wide-scale displacement of people. Is it possible to reduce - or to bring an end - to these gross violations of human rights? The course seeks to imagine new strategies to address current-day human rights challenges. In the process of conceptualizing unique strategies, students examine the complex social forces that impede human rights. Students will write a strategy paper on a contemporary human rights challenge, develop a unique non-governmental organization (NGO), and participate in a simulation of the United Nations Security Council.",
    "prereq": {}
  },
  {
    "uid": "825756",
    "code": "GLOS1916",
    "subject": "GLOS",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Do the Right Thing",
    "fullname": "Do the Right Thing: Ethics and You",
    "info": "This class will examine the struggles we all have in everyday life to \"do the right thing.\" Almost every area of life confronts us with the question, \"What should I do here?\" \"What is the right thing to do?\" \"What is the good thing to do?\" \n\nTo this extent our class is about ethics, that sphere of philosophy that inquires into the conduct of human beings as they encounter the world. Using different kinds of material—newspaper columns, film, and academic studies—we will examine the dilemmas that people have in making ethical decisions. Our goal is not to define a fixed guide to ethics as much as it is to acquaint students with questions about conduct as they appear in a variety of contexts of everyday life. We will ask what makes some situations clear and others ethically complex. We will also consider what happens when different scales of values confront each other in everyday life. Students will conclude the class able to notice and analyze ethical dilemmas and empowered to sort through them.",
    "prereq": {}
  },
  {
    "uid": "819881",
    "code": "GLOS1917",
    "subject": "GLOS",
    "number": "1917",
    "honors": false,
    "writing": false,
    "name": "The Politics of Non-violence",
    "fullname": "The Politics of Non-violence",
    "info": "What sets non-violence apart from other forms of political resistance is its peculiarly democratic nature. To begin with, its practitioners adhere to the principle of respecting the humanity and equality of those whom they fight against. Moreover, as Gandhi notes, it is democratic in the sense that while it requires immense self- discipline, it is nevertheless a universally available weapon. This course provides a historical exploration of some of the concepts and practices of non-violence.  The questions we shall be exploring are: Why is it only in the twentieth century that non-violence as a political ideology can be articulated?  What is the violence that non-violence eschews?  Why is the language of self-transformation and self-sacrifice so important to non-violent movements?  What specific practices of non-violence does non-violence involve?  Why do some of the most powerful practitioners of non-violence, such as Gandhi or MLK, describe their practices in religious terms?  When can non-violent politics reinforce existing injustices, or unwittingly collude in more subtle forms of violence?  When do non-violent movements succeed, and what would count as “success” for non-violent politics?   What role can and does it play in the contemporary world, which has been transformed by social media, deeper state penetration, and more intense social divisions, and where mobilizations such as BLM, the Arab Spring, or the Umbrella movement still draw on the concepts and practices of non-violence? We shall be reading both some of the most famous practitioners and thinkers of non-violence, and some of their trenchant critics—Thoreau, Gandhi, MLK, Arendt, Fanon, Thurman, Mandela, amongst others. ",
    "prereq": {}
  },
  {
    "uid": "826511",
    "code": "GLOS1918",
    "subject": "GLOS",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "A Changing Climate and You",
    "fullname": "Your Place in a Changing Climate: Minnesota and Beyond",
    "info": "This seminar focuses on how the impacts and responses to a changing climate are felt locally in our campus and community while nevertheless being connected to global networks of technology, information, and human migration. Through a range of sources, including fiction, film, policy documents, and environmental planning studies, the seminar will study how the impacts of ecological crisis are represented while highlighting how advocacy takes shape locally, nationally, and globally. The seminar will include several short field trips and visits from local leaders as students study the challenges and opportunities that result from adaptation in energy production, transit design, food cultivation and distribution, and the way the future is imagined and linked to habits and dependencies that made modernity possible.  ",
    "prereq": {}
  },
  {
    "uid": "788231",
    "code": "GLOS3003",
    "subject": "GLOS",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Cultural Anthropology",
    "fullname": "Cultural Anthropology",
    "info": "Marxist/feminist theories of culture. Culture and language/discourse. Psychological anthropology. Culture and transnational processes. May include field research, politics of ethnographic knowledge.",
    "prereq": {}
  },
  {
    "uid": "805502",
    "code": "GLOS3031",
    "subject": "GLOS",
    "number": "3031",
    "honors": false,
    "writing": false,
    "name": "After Communism",
    "fullname": "Altering States: After Communism",
    "info": "Post-socialist transitions in Central/Eastern Europe from anthropological perspective. Daily life under socialism. Collapse of socialist rule in relation to key areas of social life such as gender, identity, nationalism, and ethnicity.",
    "prereq": {}
  },
  {
    "uid": "012845",
    "code": "GLOS3102",
    "subject": "GLOS",
    "number": "3102",
    "honors": false,
    "writing": false,
    "name": "Resrch Methods",
    "fullname": "Research Methods in International Relations",
    "info": "Provides skills for the competitive work place and academic research. Information resources and methods for researching topics in international relations including both traditional print and new electronic forms of information.",
    "prereq": {}
  },
  {
    "uid": "787995",
    "code": "GLOS3103",
    "subject": "GLOS",
    "number": "3103",
    "honors": false,
    "writing": false,
    "name": "Empire and Modernity",
    "fullname": "Empire and Modernity",
    "info": "How modern world has been constituted by colonial encounter. Role of colonialism in construction of west. Images of non-western societies. Modernity in colonial/postcolonial societies. Problems/potential of universal categories such as democracy, gender, history, human rights. Globalization at the margins.",
    "prereq": {}
  },
  {
    "uid": "817151",
    "code": "GLOS3105",
    "subject": "GLOS",
    "number": "3105",
    "honors": false,
    "writing": false,
    "name": "Exploring the World: Research",
    "fullname": "Exploring the World: The Practice of Interdisciplinary Research",
    "info": "This class introduces Global Studies students to some of the major disciplines and methods used to make knowledge about the social world.  The course first addresses fascinating philosophical questions, such as how is knowledge a social product?  How are knowing and understanding different?  How might we think of ignorance, too, as something constructed?  We then turn from theory to practice, and to the question, how can we frame our questions, and enact our research in humble and ethically principled ways?  Students will respond to this task by designing collaborative research projects.  They will first identify and define a real world issue; they will review different disciplines' methods for defining and approaching the issue, and then they will jointly create a collaborative research design. The course will help Global Studies students understand the interdisciplinary nature of the Global Studies major, and it will help them begin to think about the goals, interests, and methods of their senior projects.",
    "prereq": {}
  },
  {
    "uid": "804101",
    "code": "GLOS3143",
    "subject": "GLOS",
    "number": "3143",
    "honors": false,
    "writing": false,
    "name": "Place, Community, Culture",
    "fullname": "Place, Community, Culture",
    "info": "Students in the Global Studies program study not only the powerful political institutions and economic processes that shape our world, they also acquire the  skills to perceive and investigate their own place and identities, and to interpret creative work that express different ways of being. In GLOS 3143 'Place, Community, Culture' students will explore their own locations, identities, and experiences in the context of our fraught and ethically complex times. The emphasis is on practice, on seeing one's own life as something to be enriched by seeing and feeling the world in new ways. Students will encounter a mix of philosophical works, artistic texts (novels, films, poetry,  painting, music, and other forms of media) and scholarly texts that together will help students expand their ingrained and conditioned ways of seeing the world. Class themes might include self and other, community and alienation, place and placelessness, home and homelessness. Students will examine the place of ethics and politics in the negotiation of their identities and  experiences. Assignments might include essays that ask students to interpret  artistic works that present different avenues of insight, or creative assignments that ask you to reflect on your own experiences in relation to course readings and themes. Students will conclude the class more confident of their ability to notice and negotiate the dilemmas they will encounter in their personal and professional lives.",
    "prereq": {}
  },
  {
    "uid": "009237",
    "code": "GLOS3144",
    "subject": "GLOS",
    "number": "3144",
    "honors": false,
    "writing": false,
    "name": "Knowledge and Power",
    "fullname": "Knowledge, Power, and the Politics of Representation in Global Studies",
    "info": "This course provides an introductory overview of core theories and concepts that prepare students for successful completion of the Global Studies curriculum. In this half of the Global Studies core course sequence, students will investigate questions pertaining to how representations of the modern world in popular media and academic writing contribute to, reaffirm, and often challenge relations of inequality and division tied to such categories as ethnicity, gender, and race. Drawing on a wide range of interdisciplinary sources including magazines, novels, films, and digital media, these questions may include: How do cultural representations of the Global South reinforce European imperial and colonial projects? What role do mass-market magazines and newspapers have in constructing difference and producing stereotypes that justify imperialist attitudes? How does the development of technologies, from railroads to the internet, affect collective experiences of time and space? How is 'fake news' and intentional misrepresentation a threat to democracy and to the ecological security of the Earth? Students will meet twice a week for lecture and attend a weekly recitation section, with assignments that include short writing exercises and/or weekly Canvas posts and a midterm and final examination. This course will show how the politics of representation and knowledge production relate to changing formations of power, while giving students the conceptual vocabulary and critical skills to prepare for subsequent Global Studies courses.      \n \nPrereq: soph, jr, or sr",
    "prereq": {}
  },
  {
    "uid": "009239",
    "code": "GLOS3145",
    "subject": "GLOS",
    "number": "3145",
    "honors": false,
    "writing": false,
    "name": "Global Mod, Nat-State, Capital",
    "fullname": "Global Modernity, the Nation-State, and Capitalism",
    "info": "This course provides an introductory overview of core theories and concepts that prepare students for successful completion of the Global Studies curriculum. In this half of the Global Studies core course sequence, students will investigate questions pertaining to the emergence of global modernity, capitalism, and the nation-state, with particular focus on theoretical concepts and institutional forms. Drawing on a wide range of interdisciplinary sources including critical theory, philosophy, and texts from the social sciences, these questions may include: How did reason and culture emerge as key concepts in modernity, and how were they associated with transformations in time and space? How did the nation-state become a dominant political unit in the West, and how do postcolonial African states challenge its structure? What is the relationship between the Western liberal tradition, secularity, and violence? What are the histories and internal dynamics of the capitalist economy? Students will meet twice a week for lecture and attend a weekly recitation section, with assignments that include short writing exercises, a group project, and midterm and final examinations. This course will contextualize and trouble aspects of the global that are easily abstracted and taken for granted, while giving students the conceptual vocabulary and critical skills to prepare for subsequent Global Studies courses.      \n \nPrereq: soph, jr, or sr\nUnits: 3.00",
    "prereq": {}
  },
  {
    "uid": "817858",
    "code": "GLOS3152W",
    "subject": "GLOS",
    "number": "3152",
    "honors": false,
    "writing": true,
    "name": "Global Avant-Gardes",
    "fullname": "Global Avant-Gardes: Theatre, Music, Modernity",
    "info": "What does it mean to be an avant-garde artist in the Global South? In postcolonial Africa and Asia, where arts were linked to national modernization projects, artists have played a key role in shaping citizens' identity, alongside schools and universities. While participating in modernizing projects, avant-garde artists maintained independence from state institutions and voiced criticism of dictators. This course examines avant-garde performance in several locations of the Global South, analyzing dramas of national history, modernist music, activist theater, cosmopolitan dance, transnational cultural circuits, and politically radical performances. \n\nReading historical, social, and performance studies, we will develop methods for analyzing performances that aim to make transformative social interventions. These include textual analysis, ethnography, performance analysis, and tracking transnational cultural exchange. You will apply select methods in your final research paper, which centers on an avant gardist cultural phenomenon in the contemporary Global South.",
    "prereq": {}
  },
  {
    "uid": "795326",
    "code": "GLOS3212",
    "subject": "GLOS",
    "number": "3212",
    "honors": false,
    "writing": false,
    "name": "Globalization and Inequality",
    "fullname": "Globalization, Markets, and Inequality",
    "info": "Globalization of American business/culture, uneven relationships between developed/underdeveloped national economies, social/economic consequences of market economies and free trade. Focuses on growing inequalities in global economy. Wall Street and transnational corporations, sweatshops, consumer culture, brand-name global marketing, mass downsizings.",
    "prereq": {}
  },
  {
    "uid": "816882",
    "code": "GLOS3215",
    "subject": "GLOS",
    "number": "3215",
    "honors": false,
    "writing": false,
    "name": "Supercapitalism Global Economy",
    "fullname": "Supercapitalism: Labor, Consumption & the Environment in the New Global Economy",
    "info": "From the jeans you buy online to the place mats you purchase at Target, most of the items we consume are made somewhere else. Global production networks link consumers of fresh green beans in Britain with growers, pickers, and packers in Zambia. And it isn't only products that move around the globe; so do people. Thanks to immense economic inequalities, wealthy families in the global North enjoy the cheap labor of Eastern European, Filipino, and Honduran nannies, house cleaners, and gardeners. How did this global economy come to be, how has it impacted workers, consumers, and ecosystems, and what are its ethical and political implications? This course focuses on the changes that have occurred over the last 70 years in the realms of labor, consumption, and the environment. We'll examine the movement away from regulated national economies to an integrated global economy; changing patterns and organization of production, distribution, consumption, and waste disposal; and new forms of capital-labor-state relations. Some of the topics we explore include the global trade in body parts; the rise of shareholder capitalism; the new \"platform\" economy; the growing insecurity of work; and the environmental changes global capitalism has wrought. We end by considering alternatives to the \"business-as-usual\" (BAU) economy.",
    "prereq": {}
  },
  {
    "uid": "808739",
    "code": "GLOS3219",
    "subject": "GLOS",
    "number": "3219",
    "honors": false,
    "writing": false,
    "name": "History of Capitalism",
    "fullname": "History of Capitalism: Uneven Development Since 1500",
    "info": "Causes of economic inequities in contemporary world. Long-term economic developments in cases taken from Africa, Asia, Europe, and North/South America. Various theoretical approaches to study of economic development. Introduction to key concepts.",
    "prereq": {}
  },
  {
    "uid": "825226",
    "code": "GLOS3225",
    "subject": "GLOS",
    "number": "3225",
    "honors": false,
    "writing": false,
    "name": "The Power of the 1%",
    "fullname": "The Power of the 1%: Global Philanthropy and the Making of a New World",
    "info": "Philanthropy has come to play an increasingly important role in the economy and society, on both a national and global level. Americans gave away $450 billion in 2019, or a little over 2 percent of our country's GDP (Giving USA 2020). A few mega-philanthropists, such as Bill Gates, Warren Buffett, Michael Bloomberg and others donated mind-boggling sums of money. These individuals and their foundations are having a significant impact around the world, changing the way public education is carried out in many countries, how global health priorities are defined, how public policies are made, and how African agricultural systems are organized. \n\nForbes magazine reports that there are 1,645 billionaires in the world today, 80% more than a decade ago. While some observers look positively on this philanthropic outpouring, others suggest it may be eroding democracy. In this course, we study philanthropy from a variety of perspectives, exploring who gives away money and why, how this \"gift\" impacts givers, receivers, and taxpayers, and what the relationship is between global philanthropy and power.  Specific topics include the history of foundations; religion and charity; philanthropy and politics; consumption-based giving (or \"brand aid\"), and philanthropy and social policy. We'll examine case studies such as the Gates Foundation's role in African agriculture. Students will do \"participant observation\" in a local charity, and a research project on the philanthropic foundation or giving practice of their choice.",
    "prereq": {}
  },
  {
    "uid": "810010",
    "code": "GLOS3231",
    "subject": "GLOS",
    "number": "3231",
    "honors": false,
    "writing": false,
    "name": "Geography of the World Economy",
    "fullname": "Geography of the World Economy",
    "info": "Geographical distribution of resources affecting development. Location of agriculture, industry, services. Agglomeration of economic activities, urbanization, regional growth. International trade. Changing global development inequalities. Impact on nations, regions, cities.",
    "prereq": {}
  },
  {
    "uid": "810574",
    "code": "GLOS3278",
    "subject": "GLOS",
    "number": "3278",
    "honors": false,
    "writing": false,
    "name": "Tigers and Dragons",
    "fullname": "Tigers and Dragons:  The Rise of the East Asian Economies, 1930-Present",
    "info": "Rise of East Asian Economies, 1930-Present.",
    "prereq": {}
  },
  {
    "uid": "787996",
    "code": "GLOS3301",
    "subject": "GLOS",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Environment & Empire",
    "fullname": "Environment & Empire",
    "info": "Key issues in environmental history. Global/colonial processes that have made the modern environment. Global spread of diseases, modern remaking of world?s flora/fauna, idea of nature. New technologies and the environment. Conservationist ideology.\n\nprereq: [3101, 3144] or instr consent",
    "prereq": {
      "and": [
        "009237"
      ]
    }
  },
  {
    "uid": "788681",
    "code": "GLOS3302",
    "subject": "GLOS",
    "number": "3302",
    "honors": false,
    "writing": false,
    "name": "Debating Development",
    "fullname": "Debating \"Development\": Contested Visions",
    "info": "Radical critiques of idea/practice of \"development.\" Debates over development. Vocabularies (Marxist, feminist, post-structuralist, ecological) that drive the debates.\n\nprereq: [3101, 3144] or instr consent",
    "prereq": {
      "and": [
        "009237"
      ]
    }
  },
  {
    "uid": "796108",
    "code": "GLOS3303",
    "subject": "GLOS",
    "number": "3303",
    "honors": false,
    "writing": false,
    "name": "Envt Development in 3rd World",
    "fullname": "Environment and Development in the Third World",
    "info": "Concepts for analyzing relations between capitalist development and environment in Third World. Historical geography of capitalist development. Case studies. Likelihood of social/environmental sustainability.\n\nprereq: Soph or jr or sr",
    "prereq": {}
  },
  {
    "uid": "800687",
    "code": "GLOS3304",
    "subject": "GLOS",
    "number": "3304",
    "honors": false,
    "writing": false,
    "name": "Frameworks of Sustainability",
    "fullname": "Sustainable People, Sustainable Planet",
    "info": "Introduction to interdisciplinary sustainability studies minor. Scientific, cultural, ethical, and economic concepts that affect environmental sustainability and global economic justice. Key texts. Participatory classroom environment.",
    "prereq": {}
  },
  {
    "uid": "800628",
    "code": "GLOS3305",
    "subject": "GLOS",
    "number": "3305",
    "honors": false,
    "writing": false,
    "name": "Environment, Capital, Medicine",
    "fullname": "Science for Sale: Environment, Capital, and Medicine",
    "info": "This class uses a social justice lens to explore the interrelations of scientific discoveries, unequal global economies, and commodification. We will look at practices, new technologies, and policies that are trenchant for the negative impacts they have on environments broadly defined, and for human and non-human populations.  We will ask how these practices, technologies, and policies - and the social and economic contexts that produce them - variably impact the health, well being, and valuation of particular populations.  In a series of interconnected themes, we will examine what factors produce food insecurity and for whom; where and why pollution of resources such as water happens; the history and current state of antibiotic resistance; climate change and its various effects; and how new technologies can be life-saving and life-denying according to the ways national and global policies determine who gains access and who does not.  We will also look at the innovative ways grassroots movements tackle issues confronting particular groups, what constitutes positive social change and by whose definition, and potential ways forward. Final projects focus on website construction or policy documents that have application beyond the classroom.\n\nPrereq:  soph or jr or sr",
    "prereq": {}
  },
  {
    "uid": "810678",
    "code": "GLOS3322W",
    "subject": "GLOS",
    "number": "3322",
    "honors": false,
    "writing": true,
    "name": "Social Movements",
    "fullname": "Social Movements, Protests, and Change",
    "info": "Origins, dynamics, consequences of social movements. Challenges facing movement organizations. Relationship between movements/political institutions. Role of movements in bringing about social change. Theoretical issues, case studies.",
    "prereq": {}
  },
  {
    "uid": "788986",
    "code": "GLOS3401W",
    "subject": "GLOS",
    "number": "3401",
    "honors": false,
    "writing": true,
    "name": "International Human Rights Law",
    "fullname": "International Human Rights Law",
    "info": "This course presents an introductory overview of the idea of human rights, its social and legal foundations and contemporary global issues.  In the class, students will learn about the laws and procedures designed to protect the human rights of individuals and groups, with a special focus on the United Nations system. The course explores the conceptual underpinnings of human rights such as who is eligible to have rights, where those rights come from and who is responsible for guaranteeing them.  Students will learn about how international laws are made and interpreted, and will consider the geo-political context which shapes human rights laws and procedures. Because of the evolving nature of the laws and issues in this field, students are encouraged to think analytically and ethically about how to address the many human rights challenges in the world today.  The course will cover current human rights issues, including the right to health care, housing and other economic and social rights; and the right to life, freedom from torture and other civil and political rights. The course is writing intensive. The required paper for the class is a model complaint to the United Nations about a country and issue of the student's choosing. The class invites discussion and uses class exercises to engage students in the course material by shaping arguments for various legal fora. ",
    "prereq": {}
  },
  {
    "uid": "792485",
    "code": "GLOS3403",
    "subject": "GLOS",
    "number": "3403",
    "honors": false,
    "writing": false,
    "name": "Arab-Israeli Conflict",
    "fullname": "Israel, Palestine, and the Arab-Israeli Conflict",
    "info": "Introduction to Israeli and Palestinian culture, politics, and society and to central historical events of Israeli/Palestinian conflict. Zionist ideology, Palestinian resistance, refugee issues, militarism, human rights. Gender and nationalism. Historical progression from late 19th century to present, including Middle East Peace Process, Al Aqsa Intifada, and Israeli administration.",
    "prereq": {}
  },
  {
    "uid": "818780",
    "code": "GLOS3407",
    "subject": "GLOS",
    "number": "3407",
    "honors": false,
    "writing": false,
    "name": "Global Islamophobia",
    "fullname": "Global Islamophobia",
    "info": "Throughout the world, anti-Muslim activists and politicians have been increasingly attacking Muslims and Islam. And, international organizations have reported human rights violations against Muslims worldwide. Recently, in the United States, there have been calls to ban Muslims, as well as register American Muslims. In France, Muslim women are prohibited to wear a headscarf in high school. And in Myanmar, a genocide against Muslim minorities is currently underway. While anti-Islamic discourses have a long history in many societies worldwide (including Muslim-majority countries), the course seeks to explore the global rise of these discourses since September 11, 2001. The course examines the cultural, political, and historical origins of Islamophobic discourses that cast Muslims as \"violent,\" \"hateful,\" and \"uncivilized.\" Class sessions will include some lecture but will be largely discussion based. Assignments will ask students to think and write critically about course concepts, debate and participate in simulation exercises, and reflect on personal thoughts and feelings about course content.",
    "prereq": {}
  },
  {
    "uid": "793160",
    "code": "GLOS3410",
    "subject": "GLOS",
    "number": "3410",
    "honors": false,
    "writing": false,
    "name": "Global & Local Studies",
    "fullname": "Interactive Global and Local Studies",
    "info": "Global studies topics studied through their local manifestations in the Twin Cities or Minnesota, and internationally through linked communication with classes at cooperating universities in other countries. Students communicate with counterparts abroad through e-mail to develop comparative/interactive elements in their studies. Sample topics: role of the river in local history, grain storage and processing, manufacturing and trade, growth of the metropolitan area.",
    "prereq": {}
  },
  {
    "uid": "813763",
    "code": "GLOS3412",
    "subject": "GLOS",
    "number": "3412",
    "honors": false,
    "writing": false,
    "name": "What is Equality?",
    "fullname": "What is Equality?",
    "info": "Course explores debates about equality. Equality has many dimensions--e.g.: economic, social, political. These forms cannot be reconciled. Liberal democracies affirm the principle of political equality but defend, even in principle, social and economic inequalities. Animal rights add another wrinkle: very few of those who fight for these rights would claim political equality for animals. ",
    "prereq": {}
  },
  {
    "uid": "797764",
    "code": "GLOS3415W",
    "subject": "GLOS",
    "number": "3415",
    "honors": false,
    "writing": true,
    "name": "Global Institutions of Power",
    "fullname": "Global Institutions of Power: World Bank, International Monetary Fund, and World Trade Organization",
    "info": "This course will introduce students to some of the world's most powerful global institutions -- such as the World Bank (IBRD), the International Monetary Fund (IMF), the World Trade Organization (WTO), the United Nations, and affiliated agencies such as UNHCR (for refugee support). We will follow their efforts to promote a style of global development practices -- large-scale capital lending and global expertise building -- that has crystallized into a common understanding of how global north-south dynamics should progress.  Cases pursued in class may include their lending and debt policies, dam building and energy projects, climate resilience and water loans, and the ways they mediate free trade agreements among competing countries. We will also hear from the multitude of voices, theories, and practices that offer alternative visions as to how peoples strive to produce a more just, socially equitable, and climate-safe world.  We will use books, articles, films, in-class debates, case study exploration, small-group projects, and guest speakers to create a lively discussion-based classroom environment.",
    "prereq": {}
  },
  {
    "uid": "801994",
    "code": "GLOS3422",
    "subject": "GLOS",
    "number": "3422",
    "honors": false,
    "writing": false,
    "name": "20th C Eur1945-61",
    "fullname": "20th-Century Europe From the End of World War II to the End of the Cold War: 1945-91",
    "info": "Social, economic, political, and cultural impacts of WWII. Division of Europe, communist regimes in Eastern Europe, cooperation in Western Europe, impacts of modernization. End of Cold War.",
    "prereq": {}
  },
  {
    "uid": "813542",
    "code": "GLOS3487",
    "subject": "GLOS",
    "number": "3487",
    "honors": false,
    "writing": false,
    "name": "The Vietnam Wars",
    "fullname": "The Vietnam Wars: French Colonialism and U.S. Intervention in Indochina",
    "info": "French conquest. Colonial bureaucratic/economic transformations. Nationalist responses. First Indochina War. Emergence of nation-state. U.S. intervention. Impact of Vietnam War on current politics of Laos, Cambodia, and Thailand, and on Southeast Asia.",
    "prereq": {}
  },
  {
    "uid": "787997",
    "code": "GLOS3602",
    "subject": "GLOS",
    "number": "3602",
    "honors": false,
    "writing": false,
    "name": "Other Worlds",
    "fullname": "Other Worlds: Globalization and Culture",
    "info": "'Globalization' and 'Culture' are both terms that have been defined and understood in a variety of ways and the significance of which continues to be debated to the present, both inside and outside the academy.  Globalization has been talked about both as an irresistible historical force, tending toward the creation of an increasingly interconnected, or, as is sometimes claimed, an increasingly homogeneous world, and as a set of processes, the outcome of which remains open-ended and uncertain, as likely to produce new kinds of differences as universal sameness.  Culture meanwhile has been variously defined as that which distinguishes humans from other species (and which all humans therefore share) and as that which divides communities of humans from one another on the basis of different beliefs, customs, values etc. This course reflects on some of the possible meanings of both \"Globalization\" and \"Culture\" and asks what we can learn by considering them in relation to one another.  How do the phenomena associated with globalization, such as increasing flows of people, capital, goods and information across increasing distances challenge our understandings of culture, including the idea that the world is composed of so many discrete and bounded \"cultures\"? At the same time, does culture and its associated expressive forms, including narrative fiction, poetry and film, furnish us with new possibilities for thinking about globalization?  Does global interconnection produce a single, unified world, or multiple worlds?  Are the movements of people, goods, ideas and information across distances associated with new developments caused by contemporary globalization, or have they been going on for centuries or even millennia? Might contemporary debates about climate change and environmental crisis compel us to consider these phenomena in new ways?  The course addresses these questions as they have been discussed by scholars from a variety of disciplines and as they have been imagined by artists, poets, novelists and filmmakers. In doing so, it considers whether the distinctiveness of present day globalization is to be sought in part in the new forms of imagining and creative expression to which it has given rise.\n",
    "prereq": {}
  },
  {
    "uid": "789308",
    "code": "GLOS3605",
    "subject": "GLOS",
    "number": "3605",
    "honors": false,
    "writing": false,
    "name": "Printing Press to Internet",
    "fullname": "From Printing Press to Internet: Media, Communications, and History",
    "info": "Print public sphere in 17th, early 18th century. Political conflicts over freedom of press in 18th, 19th century. Emergence of advertising, public relations industries in 20th century. Significance of broadcast, computer network technologies for democratic political systems.",
    "prereq": {}
  },
  {
    "uid": "825950",
    "code": "GLOS3606",
    "subject": "GLOS",
    "number": "3606",
    "honors": false,
    "writing": false,
    "name": "Art and Incarceration",
    "fullname": "Art and Incarceration: Prison Voices and Visions",
    "info": "Prisons are noisy places: clanking of metal, echoing voices, violence, laughter, and all the sounds of people living their lives in overcrowded congregate facilities without privacy or control over their surroundings.  But the sounds of prisons -- the voices, the stories - are not often heard outside the prison walls.  This course is meant to provide a corrective - a small corrective - to that silence.  In GLOS 3606, Art and Incarceration: Prison Voices and Visions, we will read, view, and listen to creative work by incarcerated artists from around the world, and we will consider: \n\n(1) what these artists have to say about the(ir) world(s), \n\n(2) how art provides a space for resistance and survival within the walls of the prison, and (3) how the conditions of incarceration impact the creative process and affect our access to this important body of work.\n\nBecause the purpose of this course is to amplify and analyze the voices and visions of incarcerated artists, this course requires substantial reading, viewing, and listening. There are weekly writing assignments, but they are short and informal.  There are no longer papers.  There is a final take-home essay exam. ",
    "prereq": {}
  },
  {
    "uid": "795830",
    "code": "GLOS3607",
    "subject": "GLOS",
    "number": "3607",
    "honors": false,
    "writing": false,
    "name": "Gender and Global Health",
    "fullname": "Gender and the Global Politics of Health",
    "info": "Politics, global processes, and social relations that shape health/disease patterns world wide. Case studies, including HIV/AIDS in Africa, diabetes and health care in the U.S., new reproductive technologies, and access to food. How gender, poverty, geographic/social location, citizenship, sexuality, and other factors help determine degree of vulnerability to disease or right to health.",
    "prereq": {}
  },
  {
    "uid": "811133",
    "code": "GLOS3609",
    "subject": "GLOS",
    "number": "3609",
    "honors": false,
    "writing": false,
    "name": "Novels and Nations",
    "fullname": "Novels and Nations",
    "info": "How do emerging and postcolonial nations enlist fiction in their claims to sovereignty and autonomy? How do the novel's literary techniques and strategies perform a unique brand of political and social critique vis a vis nations and nationalisms? We will focus on novels from a variety of national contexts from the Global North and South to show how literary analysis can be a companion to the social sciences in illuminating the historical and social contexts of the nation-state. In addition, we will consider the function of literature in allowing stateless nations to imagine a shared connection. We will also focus on the inner workings of the novel in order to understand the conventions and mechanisms of the genre and how it interconnects with related forms such as cinema, performance, and the visual arts.  ",
    "prereq": {}
  },
  {
    "uid": "819455",
    "code": "GLOS3611",
    "subject": "GLOS",
    "number": "3611",
    "honors": false,
    "writing": false,
    "name": "Stories, Bodies, Movements",
    "fullname": "Stories, Bodies, Movements",
    "info": "For most of us, stories seem to simply 'happen.' We listen to stories, we tell stories, we are moved by stories, and we retell stories. However, every act of telling stories involves making decisions or moves, and each re-telling of a familiar story may either give birth to new meanings, nuances, and affects, or, it may erase their possibility. Thus, each storyteller can be seen as a translator of stories with a responsibility to retell stories ethically. It is precisely through these translational acts that all politics become politics of storytelling. In this course, we will consider the ways in which the politics of the global and the intimate derive their meanings, effects, and affects from the circulation, transaction, and re-tellings of stories within and across borders.  We will ask how a praxis of ethical engagement with politics can be imagined as a praxis of receiving and retelling stories. By immersing ourselves in the process of remembering, telling, listening, trimming, interweaving, distilling, and performing stories, we will consider how ethical receiving and retelling of stories involves continuous revising, repositioning, and re-theorizing of such vexed and entangled terrains and terminologies as identity, community, rights, and justice, as well as the contingent meanings of knowledge, truth, and ethics.\n\nThis course engages this terrain through a mode of active learning in which all the participants will read and reflect, listen and discuss, tell and retell, watch and play, move and perform collectively. By becoming aware of the ways in which our minds-bodies-souls are inserted in the receiving and translation of stories, we will grapple together with the ways in which our bodies--as our embodiments--help to relationally shape not only our own performances but also our responses to the performances of other living and moving bodies around us. \n\nWe will learn from writings, film, songs, and plays by writers, artists, activists, and thinkers from a range of historical and contemporary locations and struggles. These include: Marie Lily Cerat, W. E. B. Du Bois, Suheir Hammad, Sterlin Harjo, Naeem Inayatullah, June Jordan, AnaLouise Keating, Kauanui, J. Kehaulani, Audre Lorde, Viet Thanh Nguyen, Middle East Research and Information Project, Alok Rai, Nina Simone, Leanne Betasamosake Simpson, Sangtin Writers, Standing Rock Collective, Eve Tuck, Patrick Wolfe, and K. Wayne Yang. Many of the 'Acts' in this course will be co-facilitated with local or international artists and writers.   \n\nGrading Basis: A/F. The course requires all the participants to do sustained work and deep reflections, enjoy the process of imagining and creating with peers in a non-competitive environment.\n\nprereq: GLOS 3611 is for jr or sr only. People from all kinds of locations and journeys are invited to join us in this collective exploration. For further information, email: nagar@umn.edu.\n",
    "prereq": {
      "or": [
        "819455"
      ]
    }
  },
  {
    "uid": "825643",
    "code": "GLOS3612",
    "subject": "GLOS",
    "number": "3612",
    "honors": false,
    "writing": false,
    "name": "Tourism/Ecology/Arts Indonesia",
    "fullname": "Global Tourism, Ecology, and the Creative Arts in Indonesia",
    "info": "Students in this course will study cultural traditions, the creative industry and tourism in Indonesia as an important part of the economy of the global south. The course will be held on the sites of dance performances, temples, heritage houses, and other cultural sites. Artists, cultural practitioners, cultural ministry officers, and policy makers for the tourism industry will serve as guest lecturers throughout. The course will be centered on creative intervention through the tourism industry and the arts and the particularity of creative impulse, gender difference, value of tradition, and modernity as a concept in Balinese culture.",
    "prereq": {}
  },
  {
    "uid": "797823",
    "code": "GLOS3613W",
    "subject": "GLOS",
    "number": "3613",
    "honors": false,
    "writing": true,
    "name": "The Politics of Eating",
    "fullname": "Stuffed and Starved: The Politics of Eating",
    "info": "This course takes a cross-cultural, historical, and transnational perspective to the study of the global food system. Themes explored include: different cultural and social meanings attached to food; social class and consumption; the global food economy; global food chains; work in the food sector; the alternative food movement; food justice; environmental consequences of food production.",
    "prereq": {}
  },
  {
    "uid": "011150",
    "code": "GLOS3620",
    "subject": "GLOS",
    "number": "3620",
    "honors": false,
    "writing": false,
    "name": "For Lang News Cov",
    "fullname": "Foreign Language News Coverage of International Events",
    "info": "Compares coverage of current news in selected foreign language newspapers with coverage in a U.S. paper such as The New York Times.\n\nprereq: Completion of college language requirement in language used for course",
    "prereq": {}
  },
  {
    "uid": "792071",
    "code": "GLOS3634",
    "subject": "GLOS",
    "number": "3634",
    "honors": false,
    "writing": false,
    "name": "Chicana and Chicano History I",
    "fullname": "Chicana and Chicano History I",
    "info": "Experiences of people of Mexican descent in the United States. Important eras in histories of Mexico, the United States, and Mexican Americans. Central role of Chicana/os in U.S. history, culture, and politics. Topics include race, ethnicity, gender, sexuality, immigration, migration.",
    "prereq": {}
  },
  {
    "uid": "814451",
    "code": "GLOS3637W",
    "subject": "GLOS",
    "number": "3637",
    "honors": false,
    "writing": true,
    "name": "Modern Indian Literature",
    "fullname": "Modern Indian Literature",
    "info": "Survey of 20th century literature from South Asian countries, including India, Pakistan, and Sri Lanka. All readings in English. Focuses on colonialism, post-colonialism, power, and representation.",
    "prereq": {}
  },
  {
    "uid": "796076",
    "code": "GLOS3641",
    "subject": "GLOS",
    "number": "3641",
    "honors": false,
    "writing": false,
    "name": "Cent Asian Culture & Lit",
    "fullname": "Central Asian Culture and Literature",
    "info": "Dynamics of life in contemporary Afghanistan, Iran, and Central Asia. Emphasizes role of ethnicity/ideology. Central Asian fiction illustrates impact of sovietization on Islamic traditions of region.",
    "prereq": {}
  },
  {
    "uid": "796144",
    "code": "GLOS3643",
    "subject": "GLOS",
    "number": "3643",
    "honors": false,
    "writing": false,
    "name": "Islam and the West",
    "fullname": "Islam and the West",
    "info": "Cultural/intellectual trends that have defined fundamental differences between Islam and the West. Development of historical, philosophical, and intellectual mindset of both spheres. Factors that have contributed and continue to contribute to tension, anxiety, and hatred between the Muslim world and Europe and the United States.",
    "prereq": {}
  },
  {
    "uid": "791341",
    "code": "GLOS3645",
    "subject": "GLOS",
    "number": "3645",
    "honors": false,
    "writing": false,
    "name": "Islamic World",
    "fullname": "Islamic World",
    "info": "Foundation of Islam in Arabian Peninsula, its spread to Asia and Africa. Islamic civilization, influence on Europe before rise of capitalism. Rise of Capitalist Europe, colonization of Islamic World Islamic resurgence and post-colonial World. State-society and development. Culture/conflict in Moslem societies. Gender and Islam. Islamic World and the West. Moslems in North America and Europe. Case studies.",
    "prereq": {}
  },
  {
    "uid": "807152",
    "code": "GLOS3681",
    "subject": "GLOS",
    "number": "3681",
    "honors": false,
    "writing": false,
    "name": "Gender in the Islamic World",
    "fullname": "Gender and the Family in the Islamic World",
    "info": "This course explores the experiences of Muslim women and Muslim families from a historical and comparative perspective. Expanding the discussion on Muslim women's lives and experiences beyond the Middle East, by also centralizing on the experiences of Muslim women and families outside of this geographical area highlights the complex and diverse everyday experiences of Muslim women around the world. This wider lens exposes the limitations intrinsic in the stereotypical representation of Muslims in general and Muslim women in particular. We will explore the intricate web of gender and family power relations, and how these are contested and negotiated in these societies. Some of the themes the course explores include the debates on Muslim women and colonial representations, sexual politics, family, education and health, women and paid work, gender and human rights, and Islamic feminisms debates.\n\nprereq: At least soph; 1001 recommended",
    "prereq": {}
  },
  {
    "uid": "797538",
    "code": "GLOS3701W",
    "subject": "GLOS",
    "number": "3701",
    "honors": false,
    "writing": true,
    "name": "World Population",
    "fullname": "Population in an Interacting World",
    "info": "Comparative analysis/explanation of trends in fertility, mortality, internal and international migration in different parts of the world; world population problems; population policies; theories of population growth; impact of population growth on food supply and the environment.",
    "prereq": {}
  },
  {
    "uid": "809925",
    "code": "GLOS3705",
    "subject": "GLOS",
    "number": "3705",
    "honors": false,
    "writing": false,
    "name": "Migrations: People in Motion",
    "fullname": "Migrations: People in Motion",
    "info": "Students in this course will tackle debates related to migration from a variety of disciplinary perspectives and will compare and connect diverse migration trends around the world (Asia, Africa, Latin America, and North America). Students will critically engage with various paradigms on the geopolitical, racial, and gender power dynamics that anchor migration processes and outcomes. Why would the movement of individuals from some parts of the world (often from the least developed regions to the highly developed Western nations) create such strong and highly charged debates? How are cross border social and economic relations of individuals and households maintained and perpetuated? What are particular governments doing to either encourage or hinder these movements? How are current migrations different from earlier eras? Is this gendered, and if so, how and why? The objective of this course is to explore the above questions through academic and policy published literature.  \n\nprereq: soph, jr, or sr",
    "prereq": {}
  },
  {
    "uid": "827051",
    "code": "GLOS3706",
    "subject": "GLOS",
    "number": "3706",
    "honors": false,
    "writing": false,
    "name": "Criminalization of Migration",
    "fullname": "Criminalization of Migration: Borders, Crossings, Detention",
    "info": "Somali British poet Warsan Shire’s 2009 poem “Home” beseeches readers to “understand/ that no one puts their children in a boat/ unless the water is safer than the land.”  The poem went viral in 2015, shared widely by those attempting to counter the virulent anti-migrant rhetoric animating political discourse and elections in the US and around the world.  The rise in authoritarianism and racist nationalisms, especially in Europe and in settler states, is evident in policies such as the US “Remain in Mexico” policy, the EU’s increased externalization of immigration enforcement and policies of deterrence, and Australia’s mandatory offshore detention. But this anti-migrant turn is not new, and this course argues that the criminalization of migration and migrants (and of the mobility of indigenous people across state borders - even when those borders divide their nations) has a long history that is deeply ingrained in our most fundamental understandings of the state, borders, and belonging. In this interdisciplinary course, students will both unpack that history and engage - through literature and film - migrant voices that contest the dehumanization and criminalization of their lives and communities, speaking back not only to the most aggressive forms of xenophobia, but to the more widely held opinion that there are “good immigrants” and “bad immigrants.” We will approach these topics through three key concepts: borders, crossings, and detention. ",
    "prereq": {}
  },
  {
    "uid": "819082",
    "code": "GLOS3707",
    "subject": "GLOS",
    "number": "3707",
    "honors": false,
    "writing": false,
    "name": "Surplus Value/Surplus Humanity",
    "fullname": "Disposable People?: Surplus Value, Surplus Humanity",
    "info": "The world today confronts a volatile scenario shaped by three intertwined political-economic processes: First, growth in surplus value or corporate profits fueled by monopoly capitalism, wage stagnation, and automation-driven improvements in productivity; second, growth in surplus or discarded matter fueled by rising consumerism and planned obsolescence in products and services; and finally, growth in surplus humanity or under-employed, unwanted populations fueled by structural transformations in the world economy with declining opportunities for good quality jobs. The combined result manifests as widening economic inequality between the 'haves' and 'have nots'; a politically volatile situation of racialized polarization in which huge numbers of people in entire regions, countries, or sectors of the globe, have little, declining, or no access to secure waged work; and an ecological crisis where the planet finds itself ill equipped to handle growing quantities of waste matter, including greenhouse gases. Our primary focus in the course will be to understand populations that are \"cast out\" of society, the forces that produce this condition, the mechanisms of rule by which surplus populations are managed, and the way people live and cope with their superfluity.\n\nClass sessions are a combination of lectures, debates, student-led discussions, and audio-visual materials. 60-70 pages of weekly reading, bi-weekly commentaries, take-home midterms, short presentation, and final paper.",
    "prereq": {}
  },
  {
    "uid": "826815",
    "code": "GLOS3800",
    "subject": "GLOS",
    "number": "3800",
    "honors": false,
    "writing": false,
    "name": "Topics in GLOS Abroad",
    "fullname": "Topics in Global Studies Abroad",
    "info": "Topics shell for GLOS study abroad courses. ",
    "prereq": {}
  },
  {
    "uid": "788987",
    "code": "GLOS3896",
    "subject": "GLOS",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Global Studies Internship",
    "fullname": "Global Studies Internship",
    "info": "Hands-on experience at Twin Cities organizations working at the nexus of the local and the global. Work 100 hours in non-governmental organization. Substantive coursework in Global Studies is required. prereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "011145",
    "code": "GLOS3900",
    "subject": "GLOS",
    "number": "3900",
    "honors": false,
    "writing": false,
    "name": "Topics: Global Studies",
    "fullname": "Topics in Global Studies",
    "info": "Topics vary each semester. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "792971",
    "code": "GLOS3906",
    "subject": "GLOS",
    "number": "3906",
    "honors": false,
    "writing": false,
    "name": "FLIP Completion",
    "fullname": "Foreign Language Immersion Program Completion",
    "info": "Credit attached to Foreign Language Immersion Program.",
    "prereq": {}
  },
  {
    "uid": "013623",
    "code": "GLOS3910",
    "subject": "GLOS",
    "number": "3910",
    "honors": false,
    "writing": false,
    "name": "Topics: East Asian Studies",
    "fullname": "Topics in East Asian Studies",
    "info": "Selected topics in East Asian Studies not covered in regular courses. Topics reflect instructor interests.",
    "prereq": {}
  },
  {
    "uid": "816044",
    "code": "GLOS3911",
    "subject": "GLOS",
    "number": "3911",
    "honors": false,
    "writing": false,
    "name": "Chinese Society",
    "fullname": "Contemporary Chinese Society: Culture, Networks, & Inequality in China",
    "info": "Introduces students to sociological perspectives and analyses of cultures, social networks, and socioeconomic inequalities in post-1980 China. In addition to lectures, the instructor will show video clips about various backgrounds of China and group discussions will be organized to exchange opinions about issues of common interest. Students will gain a basic understanding of how Chinese society operates today. \n\nrrereq: SOC 1001 recommended",
    "prereq": {}
  },
  {
    "uid": "013624",
    "code": "GLOS3920",
    "subject": "GLOS",
    "number": "3920",
    "honors": false,
    "writing": false,
    "name": "Topics: European Studies",
    "fullname": "Topics in European Studies",
    "info": "Topics vary. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "796077",
    "code": "GLOS3921",
    "subject": "GLOS",
    "number": "3921",
    "honors": false,
    "writing": false,
    "name": "Europe",
    "fullname": "Europe: A Geographic Perspective",
    "info": "Comparative analysis/explanation of Europe's physical, demographic, ethnic/cultural, economic, political, and urban landscapes. European integration: European Union, transformation of Eastern Europe.",
    "prereq": {}
  },
  {
    "uid": "013625",
    "code": "GLOS3930",
    "subject": "GLOS",
    "number": "3930",
    "honors": false,
    "writing": false,
    "name": "Topics: Latin American Studies",
    "fullname": "Topics in Latin American Studies",
    "info": "Topics vary. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "810722",
    "code": "GLOS3934",
    "subject": "GLOS",
    "number": "3934",
    "honors": false,
    "writing": false,
    "name": "Wom/Gen Lat Am Hist",
    "fullname": "Women and Gender in Latin American History",
    "info": "Changing gender norms in Latin America as compared with lives of women/men of diverse classes/ethnic groups. How women responded to their position in society, on continuum from accommodation to resistance.",
    "prereq": {}
  },
  {
    "uid": "013626",
    "code": "GLOS3940",
    "subject": "GLOS",
    "number": "3940",
    "honors": false,
    "writing": false,
    "name": "Topic: Middle East",
    "fullname": "Topics in Middle Eastern Studies",
    "info": "Description varies with topic title.",
    "prereq": {}
  },
  {
    "uid": "810679",
    "code": "GLOS3942",
    "subject": "GLOS",
    "number": "3942",
    "honors": false,
    "writing": false,
    "name": "Hist of Mod Israel/Palestine",
    "fullname": "History of Modern Israel/Palestine: Society, Culture, and Politics",
    "info": "History of Zionism/Israel. Arab-Jewish conflict, tensions between religious/secular Jews. Relationships between Mizrahi, Ashkenazi, Russian, Ethiopian, Arab citizens. Israeli cultural imagery. Newsreels, political posters, television shows, films, popular music.",
    "prereq": {}
  },
  {
    "uid": "013627",
    "code": "GLOS3950",
    "subject": "GLOS",
    "number": "3950",
    "honors": false,
    "writing": false,
    "name": "Topic:Russian Area",
    "fullname": "Topics in Russian Area Studies",
    "info": "Description varies with topic title.",
    "prereq": {}
  },
  {
    "uid": "013628",
    "code": "GLOS3960",
    "subject": "GLOS",
    "number": "3960",
    "honors": false,
    "writing": false,
    "name": "Topics: South Asian Studies",
    "fullname": "Topics in South Asian Studies",
    "info": "Topics vary. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "016877",
    "code": "GLOS3961",
    "subject": "GLOS",
    "number": "3961",
    "honors": false,
    "writing": false,
    "name": "Cult/Soc of India",
    "fullname": "Culture and Society of India",
    "info": "Contemporary society and culture in South Asia from an anthropological perspective with reference to nationalism; postcolonial identities; media and public culture; gender, kinship and politics; religion; ethnicity; and the Indian diaspora.",
    "prereq": {}
  },
  {
    "uid": "809484",
    "code": "GLOS3969",
    "subject": "GLOS",
    "number": "3969",
    "honors": false,
    "writing": false,
    "name": "Democracy & politics in India",
    "fullname": "Democracy and popular politics in India",
    "info": "Democracy is not only a political order; it is also a popular culture and politics.  This course explores three tumultuous moments of this politics and culture in India: the pluralist nationalism which characterized Gandhian nonviolence and the Indian constitution, the majoritarianism that was often this pluralism's undertow, and Hindutva or Hindu supremacism, the now dominant populist ideology.",
    "prereq": {}
  },
  {
    "uid": "801324",
    "code": "GLOS3970",
    "subject": "GLOS",
    "number": "3970",
    "honors": false,
    "writing": false,
    "name": "Topics: African Area Studies",
    "fullname": "Topics in African Area Studies",
    "info": "Topics vary. See Class Schedule.  ",
    "prereq": {}
  },
  {
    "uid": "818201",
    "code": "GLOS3978",
    "subject": "GLOS",
    "number": "3978",
    "honors": false,
    "writing": false,
    "name": "Arts of Africa",
    "fullname": "Contemporary Sub-Saharan African Popular Art forms",
    "info": "According to the US Population Reference Bureau, Africans will represent 21% of the world population in 2050, a higher percentage than Chinese or Indians. Other research and data agencies credit contemporary African societies with among the fastest rates of urban expansion in the world. Such stupendous demographic surge and breakneck acceleration of urban growth have engendered intense dislocation and cultural upheaval in populations caught between two competing narratives of social change: one of celebration; the other of crisis. This course explores contemporary sub-Saharan African popular cinema, popular music, TV/radio series, bus slogans, community theatre, graphic narratives, fashion, sports, and other forms of popular communication as signifiers of larger social, political, and economic processes. It examines popular cultural forms as constantly evolving expressions of social, political, and personal identities in an ever globalized and interconnected world. As sites where the tensions, frictions, collisions and notably, the productive creativities of the local and the global are circulated, negotiated and contested African popular cultures provide insights into a unique and increasingly crucial facet of contemporary African artistic practice as critical intervention. Through our discussion of art and gender, we will examine the gendering of specific popular forms, their role in hegemonic formations, as well as their subversion in resistant practices and discourses.",
    "prereq": {}
  },
  {
    "uid": "011151",
    "code": "GLOS3981W",
    "subject": "GLOS",
    "number": "3981",
    "honors": false,
    "writing": true,
    "name": "Capstone Seminar",
    "fullname": "Capstone Seminar",
    "info": "In the Capstone Seminar, students will write a 25-30 page undergraduate thesis on a self-defined topic related to their thematic and/or regional concentration. The course is designed to support academic research and writing in an interdisciplinary field, and to provide students a space to synthesize what they have learned in the classroom, through study abroad, in internships, and from life experiences. Students can expect lecture, class discussion, small-group work and peer review, and one-on-one meetings with the instructor. \n\nPrereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "013629",
    "code": "GLOS3993",
    "subject": "GLOS",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\nPrereq instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "792288",
    "code": "GLOS3999",
    "subject": "GLOS",
    "number": "3999",
    "honors": false,
    "writing": false,
    "name": "Communism,Post-C,Future,EC Eur",
    "fullname": "Communism, Post-Communism & Future of East Central Europe",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "807573",
    "code": "GLOS4104",
    "subject": "GLOS",
    "number": "4104",
    "honors": false,
    "writing": false,
    "name": "Crime and Human Rights",
    "fullname": "Crime and Human Rights",
    "info": "This course addresses serious violations of humanitarian and human rights law, efforts to criminalize those violations (laws and institutions), and consequences of these efforts. Special attention will be paid to the impact interventions have on representations and memories of atrocities on responses and the future of cycles of violence. Case studies on Holocaust, Balkan wars, Darfur, My Lai massacre, etc. Criminal justice, truth commissions, vetting, compensation programs.\n\nprereq: SOC 1001, at least one 3xxx SOC or GLOS course recommended, Sociology and Global Studies majors/minors must register A-F",
    "prereq": {
      "or": [
        "002943"
      ]
    }
  },
  {
    "uid": "796042",
    "code": "GLOS4221",
    "subject": "GLOS",
    "number": "4221",
    "honors": false,
    "writing": false,
    "name": "Globalize This!",
    "fullname": "Globalize This! Understanding Globalization Through Sociology",
    "info": "From the city streets of Bangalore to the high plateaus of La Paz to the trading floors of New York City, people from around the world are becoming increasingly interdependent, creating new and revitalizing old forms of power and opportunity, exploitation and politics, social organizing and social justice. This course offers an overview of the processes that are forcing and encouraging people’s lives to intertwine economically, politically, and culturally.\n\nSOC majors/minors must register A-F.",
    "prereq": {}
  },
  {
    "uid": "806953",
    "code": "GLOS4305",
    "subject": "GLOS",
    "number": "4305",
    "honors": false,
    "writing": false,
    "name": "Environmental Soc",
    "fullname": "Environment & Society: An Enduring Conflict",
    "info": "Examines the interaction between human society and the natural environment, focusing on the contemporary and global situation. Takes the perspective of environmental sociology concerning the short-range profit-driven and ideological causes of ecological destruction. Investigates how society is reacting to that increasing destruction. prereq: SOC 1001 or environmental course or instr consent",
    "prereq": {
      "or": [
        "002943"
      ]
    }
  },
  {
    "uid": "798456",
    "code": "GLOS4311",
    "subject": "GLOS",
    "number": "4311",
    "honors": false,
    "writing": false,
    "name": "Power, Justice & Environment",
    "fullname": "Power, Justice & the Environment",
    "info": "This course introduces students to the theoretical and historical foundations of environmental racism and environmental inequality more broadly. We will examine and interrogate both the social scientific evidence concerning these phenomena and the efforts by community residents, activists, workers, and governments to combat it. We will consider the social forces that create environmental inequalities so that we may understand their causes, consequences, and the possibilities for achieving environmental justice\n\nprereq: SOC 1001 recommended",
    "prereq": {
      "and": [
        "002943"
      ]
    }
  },
  {
    "uid": "814708",
    "code": "GLOS4315",
    "subject": "GLOS",
    "number": "4315",
    "honors": false,
    "writing": false,
    "name": "Memory Politics after Genocide",
    "fullname": "Never Again! Memory & Politics after Genocide",
    "info": "Course focuses on the social repercussions and political consequences of large-scale political violence, such as genocide, war crimes, and crimes against humanity. Students learn how communities and states balance the demands for justice and memory with the need for peace and reconciliation and addresses cases from around the globe and different historical settings. \n\nprereq: SOC 1001 or 1011V recommended, A-F required for Majors/Minors.",
    "prereq": {
      "or": [
        "002943"
      ]
    }
  },
  {
    "uid": "820262",
    "code": "GLOS4319",
    "subject": "GLOS",
    "number": "4319",
    "honors": false,
    "writing": false,
    "name": "Global Antisemitism",
    "fullname": "\"Jews will not replace us!\" Global Antisemitism from its Origins to the Present",
    "info": "This course will explore the topic of antisemitism, its history and cultural logic, and the relation to other forms of exclusion tied to race, religion, and citizenship in modern times. Starting with the history of Jewish emancipation in Europe and the subsequent debates about the \"Jewish Question,\" students will learn to identify the key features of political antisemitism and the ways that antisemitism has been explained by different social theories, including Marxism, Functionalism, and Critical theory. The course will examine the differences and continuities between older theological forms of anti-Judaism and modern antisemitism, the connections between antisemitism, nativism, and xenophobia in the US and globally, and engage with current debates regarding the correlation between anti-Zionism and antisemitism. We will also explore Jewish social, political, and ideological responses to antisemitism in Europe and the US, from the Holocaust to the present.\n\nPre-reqs: sophomore or above.",
    "prereq": {}
  },
  {
    "uid": "808525",
    "code": "GLOS4344",
    "subject": "GLOS",
    "number": "4344",
    "honors": false,
    "writing": false,
    "name": "Europe and its Margins",
    "fullname": "Europe and its Margins",
    "info": "This course explores some of the forms of human imagining (literary, artistic, political, social scientific) engendered by the notoriously hard to define entity known as \"Europe.\"  It does so by focusing on regions and populations that have been thought of at various times as marking Europe's inner and outer cultural and/or geographical limits.  Topics addressed include: the relationship between physical geography, cultural memory, and the formation (or subversion) of identity claims; the reconfigured political landscapes of post-socialism and European integration; immigration, refugee flows, and the rise of far-right ethno-nationalisms; and the effects of pandemics past and present.\n\nprereq: One course in [ANTH or GLOS]",
    "prereq": {}
  },
  {
    "uid": "800654",
    "code": "GLOS4406",
    "subject": "GLOS",
    "number": "4406",
    "honors": false,
    "writing": false,
    "name": "Sociology of International Law",
    "fullname": "Sociology of International Law: Human Rights & Trafficking",
    "info": "This course takes a sociological approach to international law, considering how history, institutions, power, and interests shape the phenomenon. What is international law, where does it come from, and how does it work? What does international law tell us about globalization and nation-states? Does it make a difference in the world? Does it have a real impact on the day-to-day lives of individuals? When is it followed; when is it ignored? This course takes a broad sociological view of international law. We analyze the actors and processes that constitute international law and then focus on particular substantive areas, including human rights, economic development,environmental concerns, trafficking, and drug interdiction.\n\nprereqs: 1001 or 3101 or 3102 or instr consent; soc majors/minors must register A-F",
    "prereq": {
      "or": [
        "012845"
      ]
    }
  },
  {
    "uid": "826444",
    "code": "GLOS4461",
    "subject": "GLOS",
    "number": "4461",
    "honors": false,
    "writing": false,
    "name": "Ethnic and Racial Conflict",
    "fullname": "Sociology of Ethnic and Racial Conflict",
    "info": "\"I can't breathe.\" The last words of George Floyd. Words that traumatized a nation, and the world. While the death of George Floyd galvanized peoples worldwide to speak out against discrimination and inequality, well before his death studies suggested that ethnic and racial discrimination and conflict re-occur on an ongoing basis. From the events of the Holocaust - to the genocide against the Rohingya in Myanmar - to the torture of Uighurs in China - to the Atlantic slave trade - we explore how identities are formed - and thereafter - how those same identities are deployed - to exclude and marginalize - with targeted precision. Across the world, we examine how racial bias and racial animus contribute to slavery, torture, mass displacement, economic destitution, and genocide.\n",
    "prereq": {}
  },
  {
    "uid": "010559",
    "code": "GLOS4504W",
    "subject": "GLOS",
    "number": "4504",
    "honors": false,
    "writing": true,
    "name": "Senior Project",
    "fullname": "Senior Project",
    "info": "Research methods, writing skills, and bibliography related to field of study.",
    "prereq": {}
  },
  {
    "uid": "016409",
    "code": "GLOS4607",
    "subject": "GLOS",
    "number": "4607",
    "honors": false,
    "writing": false,
    "name": "Field Study in Interntl Dev",
    "fullname": "Field Study in Internaionatl Development",
    "info": "Field research project combined with grassroots internship in a host-country development agency or project through Minnesota Studies in International development.",
    "prereq": {}
  },
  {
    "uid": "790010",
    "code": "GLOS4609",
    "subject": "GLOS",
    "number": "4609",
    "honors": false,
    "writing": false,
    "name": "MSID Directed Research",
    "fullname": "MSID Directed Research",
    "info": "Research project based on field work in Ecuador, India, Kenya, or Senegal through Minnesota Studies in International Development program.",
    "prereq": {}
  },
  {
    "uid": "016412",
    "code": "GLOS4801",
    "subject": "GLOS",
    "number": "4801",
    "honors": false,
    "writing": false,
    "name": "Internatl Dev: Theory/Practice",
    "fullname": "International Development: Critical Perspectives on Theory and Practice",
    "info": "Interdisciplinary approaches to development. Assumptions, competing paradigms, analysis of policies, projects, problems. Globalization, societal crisis, indigenous alternatives to dominant paradigm. Partially taught in separate sections to deepen understanding of particular topic (e.g., environment, health, education).",
    "prereq": {}
  },
  {
    "uid": "016411",
    "code": "GLOS4802",
    "subject": "GLOS",
    "number": "4802",
    "honors": false,
    "writing": false,
    "name": "Cross-Cult Prspectives on Work",
    "fullname": "Cross-Cultural Perspectives on Work",
    "info": "Intercultural communication concepts/skills. US cultural/value system. Stages of adjustment. Coping strategies for crossing cultural boundaries. Host-country cultural characteristics. Emphasizes work, family, community, views of development.",
    "prereq": {}
  },
  {
    "uid": "016410",
    "code": "GLOS4803",
    "subject": "GLOS",
    "number": "4803",
    "honors": false,
    "writing": false,
    "name": "MSID Country Analysis",
    "fullname": "MSID Country Analysis",
    "info": "Multidisciplinary study of host country. Emphasizes social sciences and history, especially concepts/information regarding development issues.",
    "prereq": {}
  },
  {
    "uid": "016408",
    "code": "GLOS4805",
    "subject": "GLOS",
    "number": "4805",
    "honors": false,
    "writing": false,
    "name": "Com Intern in the Global South",
    "fullname": "Community Internships in the Global South",
    "info": "Grassroots internship with a host-country development agency or project through Minnesota Studies in International Development. Community characteristics, development strategies/problems, organizational structure/culture, cross-cultural communication issues.",
    "prereq": {}
  },
  {
    "uid": "789982",
    "code": "GLOS4806",
    "subject": "GLOS",
    "number": "4806",
    "honors": false,
    "writing": false,
    "name": "Topic: Developmnt Case Studies",
    "fullname": "Topics: Case Studies in International Development",
    "info": "Development issues illustrated in students. local-level projects through MSID. Focuses on a particular sector as it relates to development of country. Sample topics: environment and development; health and development; education, literacy, and development; women and development.",
    "prereq": {}
  },
  {
    "uid": "789983",
    "code": "GLOS4807",
    "subject": "GLOS",
    "number": "4807",
    "honors": false,
    "writing": false,
    "name": "Applied Field Methods",
    "fullname": "Applied Field Methods",
    "info": "Application of selected field research methods in rural/urban\nsettings in Asia, Africa, and Latin America. Analysis of practical,\nethical, and theoretical issues raised through small field assignments\nand individual research projects.",
    "prereq": {}
  },
  {
    "uid": "016587",
    "code": "GLOS4808",
    "subject": "GLOS",
    "number": "4808",
    "honors": false,
    "writing": false,
    "name": "MSID Directed Research",
    "fullname": "MSID Directed Research",
    "info": "Research project based on field work in Ecuador, India, Kenya, or Senegal through Minnesota Studies in International Development (MSID).",
    "prereq": {}
  },
  {
    "uid": "797833",
    "code": "GLOS4809",
    "subject": "GLOS",
    "number": "4809",
    "honors": false,
    "writing": false,
    "name": "Adv Intl Dev Internship",
    "fullname": "Advanced International Development Internship",
    "info": "Study abroad course for Minnesota Studies in International Development.",
    "prereq": {}
  },
  {
    "uid": "788063",
    "code": "GLOS4900",
    "subject": "GLOS",
    "number": "4900",
    "honors": false,
    "writing": false,
    "name": "Senior Sem in Global Studies",
    "fullname": "Senior Seminar in Global Studies",
    "info": "Globalization, nationalism, colonialism, cultural production, environmental sustainability, globalization of economy, migration, diasporas, global conflict/cooperation, human rights. Theoretical debates, cutting edge scholarship, research projects. Capstone course.\n\nprereq: [3144 or 3145 or global studies major] or instr consent",
    "prereq": {
      "or": [
        "009237",
        "009239"
      ]
    }
  },
  {
    "uid": "796102",
    "code": "GLOS4910",
    "subject": "GLOS",
    "number": "4910",
    "honors": false,
    "writing": false,
    "name": "Topics in Global Studies",
    "fullname": "Topics in Global Studies",
    "info": "Topics vary every semester. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "016878",
    "code": "GLOS4940",
    "subject": "GLOS",
    "number": "4940",
    "honors": false,
    "writing": false,
    "name": "Topics: Asian History",
    "fullname": "Topics in Asian History",
    "info": "Selected topics in Asian history not covered in regular courses.",
    "prereq": {}
  },
  {
    "uid": "016807",
    "code": "GLOS4960",
    "subject": "GLOS",
    "number": "4960",
    "honors": false,
    "writing": false,
    "name": "Adv Topics: S Asian Studies",
    "fullname": "Advanced Topics in South Asian Studies",
    "info": "Topics vary. See Class Schedule.\n\nprereq: Jr or sr or grad or instr consent",
    "prereq": {}
  },
  {
    "uid": "788156",
    "code": "GLOS5103",
    "subject": "GLOS",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Empire and Modernity",
    "fullname": "Empire and Modernity",
    "info": "How modern world has been constituted by colonial encounter. Role of colonialism in construction of west. Images of non-western societies. Modernity in colonial/postcolonial societies. Problems/potential of universal categories such as democracy, gender, history, human rights. Globalization at the margins.",
    "prereq": {}
  },
  {
    "uid": "816449",
    "code": "GLOS5104",
    "subject": "GLOS",
    "number": "5104",
    "honors": false,
    "writing": false,
    "name": "Crime and Human Rights",
    "fullname": "Crime and Human Rights",
    "info": "This course addresses serious violations of humanitarian and human rights law, efforts to criminalize those violations (laws and institutions), and consequences of these efforts. Special attention will be paid to the impact interventions have on representations and memories of atrocities on responses and the future of cycles of violence. Case studies on Holocaust, Balkan wars, Darfur, My Lai massacre, etc. Criminal justice, truth commissions, vetting, compensation programs.\n\nprereq: at least one 3xxx SOC or GLOS course recommended",
    "prereq": {}
  },
  {
    "uid": "795139",
    "code": "GLOS5114",
    "subject": "GLOS",
    "number": "5114",
    "honors": false,
    "writing": false,
    "name": "US-Mex.Perspectives",
    "fullname": "International Perspectives: U.S.-Mexico Border Cultures",
    "info": "The relations of Mexico and the United States from an international perspective with a central focus on the cultural interchange in the border lands between the two countries. Uses both literary and historical materials.",
    "prereq": {}
  },
  {
    "uid": "817859",
    "code": "GLOS5152W",
    "subject": "GLOS",
    "number": "5152",
    "honors": false,
    "writing": true,
    "name": "Global Avant-Gardes",
    "fullname": "Global Avant-Gardes: Theatre, Music, Modernity",
    "info": "What does it mean to be an avant-garde artist in the Global South? In postcolonial Africa and Asia, where arts were linked to national modernization projects, artists have played a key role in shaping citizens' identity, alongside schools and universities. While participating in modernizing projects, avant-garde artists maintained independence from state institutions and voiced criticism of dictators. This course examines avant-garde performance in several locations of the Global South, analyzing dramas of national history, modernist music, activist theater, cosmopolitan dance, transnational cultural circuits, and politically radical performances. \n\nReading historical, social, and performance studies, we will develop methods for analyzing performances that aim to make transformative social interventions. These include textual analysis, ethnography, performance analysis, and tracking transnational cultural exchange. You will apply select methods in your final research paper, which centers on an avant gardist cultural phenomenon in the contemporary Global South.",
    "prereq": {}
  },
  {
    "uid": "816465",
    "code": "GLOS5171",
    "subject": "GLOS",
    "number": "5171",
    "honors": false,
    "writing": false,
    "name": "Sociology of International Law",
    "fullname": "Sociology of International Law: Human Rights & Trafficking",
    "info": "This course takes a sociological approach to international law, considering how history, institutions, power, and interests shape the phenomenon. What is international law, where does it come from, and how does it work? What does international law tell us about globalization and nation-states? Does it make a difference in the world? Does it have a real impact on the day-to-day lives of individuals? When is it followed; when is it ignored? This course takes a broad sociological view of international law. We analyze the actors and processes that constitute international law and then focus on particular substantive areas, including human rights, economic development,environmental concerns, trafficking, and drug interdiction.\n\nprereqs: Graduate student or instructor consent",
    "prereq": {}
  },
  {
    "uid": "788157",
    "code": "GLOS5301",
    "subject": "GLOS",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Environment & Empire",
    "fullname": "Environment & Empire",
    "info": "Key issues in environmental history. Emphasizes global/colonial processes that have made modern environment. Global spread of diseases, modern remaking of world?s flora/fauna, idea of nature. New technologies and the environment. Conservationist ideology.\n\nprereq: [3101, 3144] or instr consent",
    "prereq": {
      "and": [
        "009237"
      ]
    }
  },
  {
    "uid": "816524",
    "code": "GLOS5315",
    "subject": "GLOS",
    "number": "5315",
    "honors": false,
    "writing": false,
    "name": "Memory Politics after Genocide",
    "fullname": "Never Again! Memory & Politics after Genocide",
    "info": "Course focuses on the social repercussions and political consequences of large-scale political violence, such as genocide, war crimes, and crimes against humanity. Students learn how communities and states balance the demands for justice and memory with the need for peace and reconciliation and addresses cases from around the globe and different historical settings.\n\nprereq: SOC 1001 or 1011V recommended, A-F required for Majors/Minors.",
    "prereq": {
      "or": [
        "002943"
      ]
    }
  },
  {
    "uid": "802005",
    "code": "GLOS5403",
    "subject": "GLOS",
    "number": "5403",
    "honors": false,
    "writing": false,
    "name": "Human Rights Advocacy",
    "fullname": "Human Rights Advocacy",
    "info": "Theoretical basis of human rights movement. Organizations, strategies, tactics, programs. Advocacy: fact-finding, documentation, campaigns, trial observations. Forensic science. Human rights education, medical/psychological treatment. Research project or background for case study.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "793161",
    "code": "GLOS5410",
    "subject": "GLOS",
    "number": "5410",
    "honors": false,
    "writing": false,
    "name": "Global & Local Studies",
    "fullname": "Interactive Global and Local Studies",
    "info": "Global studies topics, locally in the Twin Cities and Minnesota, and internationally through linked communication with classes at cooperating universities in other countries. Students communicate with counterparts abroad through e-mail to develop comparative/interactive elements. Possible topics: role of river in local history, grain storage/processing, manufacturing/trade, growth of metropolitan area.",
    "prereq": {}
  },
  {
    "uid": "813764",
    "code": "GLOS5412",
    "subject": "GLOS",
    "number": "5412",
    "honors": false,
    "writing": false,
    "name": "What is Equality?",
    "fullname": "What is Equality?",
    "info": "Course explores debates about equality. Equality has many dimensions--e.g.: economic, social, political. These forms cannot be reconciled. Liberal democracies affirm the principle of political equality but defend, even in principle, social and economic inequalities. Animal rights add another wrinkle: very few of those who fight for these rights would claim political equality for animals.\n\nprereq: prereq Grad or advanced undergrad with instr consent",
    "prereq": {}
  },
  {
    "uid": "826276",
    "code": "GLOS5500",
    "subject": "GLOS",
    "number": "5500",
    "honors": false,
    "writing": false,
    "name": "Graduate Topic: Global Studies",
    "fullname": "Graduate Topics in Global Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "826998",
    "code": "GLOS5537",
    "subject": "GLOS",
    "number": "5537",
    "honors": false,
    "writing": false,
    "name": "Business and Human Rights",
    "fullname": "Business and Human Rights",
    "info": "This seminar will explore the growing area of law and advocacy around business and human rights (BHR).  The course will cover the following: 1) We will examine the development and content of international human rights standards pertaining to corporations and corporate officers, such as international, national, regional, and state laws including trafficking, due diligence, trade, finance, investment, and procurement laws and principles including the UN Guiding Principles on Human Rights and Business; 2) We will next focus on types of implementation and points of intervention on BHR issues: a) civil litigation, criminal prosecution, and voluntary grievance mechanisms, b) internal corporate policies, c) socially responsible investment shareholder advocacy and divestment, d) civil society reporting and documentation, and e) strengthening laws and international standard-setting mechanisms. To examine these questions, we will use case studies across various industries that focus on issues including supply chains and labor conditions, environmental practices, and violations by security forces employed by multinational corporations; 3) The readings and seminars will encourage students to explore the debates about the most effective ways for businesses to protect and advance respect for human rights, prevent violations, and provide redress to victims of violations that occur as a result of their actions/inaction and defend themselves when they are falsely accused; 4) A research paper due at the end of the semester will encourage students to integrate different arguments and course materials, conduct related independent research and develop their own arguments. We will use a combination of discussions, collaborative exercises, and conversations with guest speakers working in different aspects of business and human rights work.",
    "prereq": {}
  },
  {
    "uid": "788159",
    "code": "GLOS5602",
    "subject": "GLOS",
    "number": "5602",
    "honors": false,
    "writing": false,
    "name": "Other Worlds",
    "fullname": "Other Worlds: Globality and Culture",
    "info": "Interconnectedness of world. Considering not one world, but many. Colonialism, consumption, diasporic conditions, global media, nationalism, supra-national governance. How globality is experienced/contested locally/specifically.\n\nprereq: [3101, 3144, grad student] or instr consent",
    "prereq": {
      "and": [
        "009237"
      ]
    }
  },
  {
    "uid": "789309",
    "code": "GLOS5603",
    "subject": "GLOS",
    "number": "5603",
    "honors": false,
    "writing": false,
    "name": "Postsocialist Transformations",
    "fullname": "Socialist/Post-socialist Transformations",
    "info": "Transformations underway in post-socialist societies of Eastern Europe, former Soviet Union. Ramifications of abandonment of state socialism, introduction of market relations. Effect of former system, new market system on cultural institutions/identities.",
    "prereq": {}
  },
  {
    "uid": "819599",
    "code": "GLOS5611",
    "subject": "GLOS",
    "number": "5611",
    "honors": false,
    "writing": false,
    "name": "Stories, Bodies, Movements",
    "fullname": "Stories, Bodies, Movements",
    "info": "For most of us, stories seem to simply 'happen.' We listen to stories, we tell stories, we are moved by stories, and we retell stories. However, every act of telling stories involves making decisions or moves, and each re-telling of a familiar story may either give birth to new meanings, nuances, and affects, or, it may erase their possibility. Thus, each storyteller can be seen as a translator of stories with a responsibility to retell stories ethically. It is precisely through these translational acts that all politics become politics of storytelling. In this course, we will consider the ways in which the politics of the global and the intimate derive their meanings, effects, and affects from the circulation, transaction, and re-tellings of stories within and across borders.  We will ask how a praxis of ethical engagement with politics can be imagined as a praxis of receiving and retelling stories. By immersing ourselves in the process of remembering, telling, listening, trimming, interweaving, distilling, and performing stories, we will consider how ethical receiving and retelling of stories involves continuous revising, repositioning, and re-theorizing of such vexed and entangled terrains and terminologies as identity, community, rights, and justice, as well as the contingent meanings of knowledge, truth, and ethics.\n\nThis course engages this terrain through a mode of active learning in which all the participants will read and reflect, listen and discuss, tell and retell, watch and play, move and perform collectively. By becoming aware of the ways in which our minds-bodies-souls are inserted in the receiving and translation of stories, we will grapple together with the ways in which our bodies--as our embodiments--help to relationally shape not only our own performances but also our responses to the performances of other living and moving bodies around us. \n\nWe will learn from writings, film, songs, and plays by writers, artists, activists, and thinkers from a range of historical and contemporary locations and struggles. These include: Marie Lily Cerat, W. E. B. Du Bois, Suheir Hammad, Sterlin Harjo, Naeem Inayatullah, June Jordan, AnaLouise Keating, Kauanui, J. Kehaulani, Audre Lorde, Viet Thanh Nguyen, Middle East Research and Information Project, Munshi Premchand, Alok Rai, Nina Simone, Leanne Betasamosake Simpson, Sangtin Writers, Standing Rock Collective, Eve Tuck, Patrick Wolfe, and K. Wayne Yang. Many of the 'Acts' in this course will be co-facilitated with local or international artists and writers.\n\nGrading Basis: A/F. The course requires all the participants to do sustained work and deep reflections, enjoy the process of imagining and creating with peers in a non-competitive environment.\n\nPrereq:  For graduate students only, or with instructor consent.  People from all kinds of locations and journeys are invited to join us in this collective exploration. For further information, email: nagar@umn.edu.",
    "prereq": {}
  },
  {
    "uid": "795327",
    "code": "GLOS5643",
    "subject": "GLOS",
    "number": "5643",
    "honors": false,
    "writing": false,
    "name": "Colonialism and Culture",
    "fullname": "Colonialism and Culture",
    "info": "Making of culture as colonial/anthropological object of knowledge. Relationship between colonial knowledge/formation of academic disciplines (especially anthropology). Colonial/postcolonial transformations of colony, nation, and metropole.",
    "prereq": {}
  },
  {
    "uid": "793208",
    "code": "GLOS5801",
    "subject": "GLOS",
    "number": "5801",
    "honors": false,
    "writing": false,
    "name": "Internatl Dev: Theory/Practice",
    "fullname": "International Development: Critical Perspectives on Theory and Practice",
    "info": "Interdisciplinary approaches to development. Assumptions, competing paradigms, analysis of policies, projects, problems. Globalization, societal crisis, indigenous alternatives to dominant paradigm. Partially taught in separate sections to deepen understanding of particular topic (e.g., environment, health, education).",
    "prereq": {}
  },
  {
    "uid": "793209",
    "code": "GLOS5802",
    "subject": "GLOS",
    "number": "5802",
    "honors": false,
    "writing": false,
    "name": "Cross-Cult Prspectives on Work",
    "fullname": "Cross-Cultural Perspectives on Work",
    "info": "Intercultural communication concepts/skills. U.S. cultural/value system. Stages of adjustment. Coping strategies for crossing cultural boundaries. Host-country cultural characteristics. Emphasizes work, family, community, views of development.",
    "prereq": {}
  },
  {
    "uid": "793210",
    "code": "GLOS5803",
    "subject": "GLOS",
    "number": "5803",
    "honors": false,
    "writing": false,
    "name": "MSID Country Analysis",
    "fullname": "MSID Country Analysis",
    "info": "Multidisciplinary study of host country. Emphasizes social sciences and history, especially concepts/information regarding development issues.",
    "prereq": {}
  },
  {
    "uid": "793211",
    "code": "GLOS5805",
    "subject": "GLOS",
    "number": "5805",
    "honors": false,
    "writing": false,
    "name": "Com Intern in the Global South",
    "fullname": "Community Internships in the Global South",
    "info": "Grassroots internship with a host-country development agency or project through Minnesota Studies in International Development. Community characteristics, development strategies/problems, organizational structure/culture, cross-cultural communication issues.",
    "prereq": {}
  },
  {
    "uid": "793212",
    "code": "GLOS5806",
    "subject": "GLOS",
    "number": "5806",
    "honors": false,
    "writing": false,
    "name": "Topic: Developmnt Case Studies",
    "fullname": "Topics: Case Studies in International Development",
    "info": "Development issues illustrated in students. local-level projects through MSID. Focuses on a particular sector as it relates to development of country. Sample topics: environment and development; health and development; education, literacy, and development; women and development.",
    "prereq": {}
  },
  {
    "uid": "793213",
    "code": "GLOS5807",
    "subject": "GLOS",
    "number": "5807",
    "honors": false,
    "writing": false,
    "name": "Applied Field Methods",
    "fullname": "Applied Field Methods",
    "info": "Application of selected field research methods in rural/urban settings in Asia, Africa, and Latin America. Analysis of practical, ethical, and theoretical issues raised through small field assignments and individual research projects.",
    "prereq": {}
  },
  {
    "uid": "793214",
    "code": "GLOS5808",
    "subject": "GLOS",
    "number": "5808",
    "honors": false,
    "writing": false,
    "name": "MSID Directed Research",
    "fullname": "MSID Directed Research",
    "info": "Research project based on field work in Ecuador, India, Kenya, or Senegal through Minnesota Studies in International Development (MSID).",
    "prereq": {}
  },
  {
    "uid": "797834",
    "code": "GLOS5809",
    "subject": "GLOS",
    "number": "5809",
    "honors": false,
    "writing": false,
    "name": "Adv Intl Dev Internship",
    "fullname": "Advanced International Development Internship",
    "info": "Study abroad course for Minnesota Studied in International Development.",
    "prereq": {}
  },
  {
    "uid": "011146",
    "code": "GLOS5900",
    "subject": "GLOS",
    "number": "5900",
    "honors": false,
    "writing": false,
    "name": "Topics: Global Studies",
    "fullname": "Topics in Global Studies",
    "info": "Proseminar. Selected issues in global studies. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "013631",
    "code": "GLOS5910",
    "subject": "GLOS",
    "number": "5910",
    "honors": false,
    "writing": false,
    "name": "Topic: East Asian Studies",
    "fullname": "Topics in East Asian Studies",
    "info": "Description varies with topic title.",
    "prereq": {}
  },
  {
    "uid": "013632",
    "code": "GLOS5920",
    "subject": "GLOS",
    "number": "5920",
    "honors": false,
    "writing": false,
    "name": "Topic: European St",
    "fullname": "Topics in European Studies",
    "info": "Description varies with topic title.",
    "prereq": {}
  },
  {
    "uid": "013633",
    "code": "GLOS5930",
    "subject": "GLOS",
    "number": "5930",
    "honors": false,
    "writing": false,
    "name": "Topic: Latin America",
    "fullname": "Topics in Latin American Studies",
    "info": "Description varies with topic title.",
    "prereq": {}
  },
  {
    "uid": "013635",
    "code": "GLOS5940",
    "subject": "GLOS",
    "number": "5940",
    "honors": false,
    "writing": false,
    "name": "Topic: Middle East",
    "fullname": "Topics in Middle Eastern Studies",
    "info": "Description varies with topic title.",
    "prereq": {}
  },
  {
    "uid": "013636",
    "code": "GLOS5950",
    "subject": "GLOS",
    "number": "5950",
    "honors": false,
    "writing": false,
    "name": "Topic: Russian Area",
    "fullname": "Topics in Russian Area Studies",
    "info": "Description varies with topic title.",
    "prereq": {}
  },
  {
    "uid": "013637",
    "code": "GLOS5960",
    "subject": "GLOS",
    "number": "5960",
    "honors": false,
    "writing": false,
    "name": "Topic: S Asian St",
    "fullname": "Topics in South Asian Studies",
    "info": "Description varies with topic title.",
    "prereq": {}
  },
  {
    "uid": "013638",
    "code": "GLOS5993",
    "subject": "GLOS",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study. Open to qualified students for one or more semesters.",
    "prereq": {}
  },
  {
    "uid": "013639",
    "code": "GLOS5994",
    "subject": "GLOS",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Qualified students work on a tutorial basis.\nPrereq instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "013641",
    "code": "GLOS8061",
    "subject": "GLOS",
    "number": "8061",
    "honors": false,
    "writing": false,
    "name": "Scope & Methods",
    "fullname": "Scope and Methods of Area Studies",
    "info": "Introduction to subfields, problems, and methodologies. Scholarly norms and ethics of cross-cultural academic research.",
    "prereq": {}
  }
]