[
  {
    "uid": "007068",
    "code": "GWSS1001",
    "subject": "GWSS",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Gender, Power, Everyday Life",
    "fullname": "Gender, Power, and Everyday Life",
    "info": "U.S. multi-/cross-cultural studies of contemporary social, cultural, and personal conditions of women's lives.",
    "prereq": {}
  },
  {
    "uid": "007071",
    "code": "GWSS1002",
    "subject": "GWSS",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Politics of Sex",
    "fullname": "Politics of Sex",
    "info": "Introductory survey of historical, cultural, psychological, and sociopolitical dimensions of analyzing gender/sexuality. Norms/deviances pertaining to gender/sexuality as differently enacted/understood by social groups in different time-/place-specific locations.",
    "prereq": {}
  },
  {
    "uid": "016934",
    "code": "GWSS1003W",
    "subject": "GWSS",
    "number": "1003",
    "honors": false,
    "writing": true,
    "name": "Women Write the World",
    "fullname": "Women Write the World",
    "info": "Concepts in literary studies. Poems, plays, short stories, novels, essays, letters by women from different parts of world. Focuses on lives, experiences, and literary expression of women, including basic concepts of women's studies.",
    "prereq": {}
  },
  {
    "uid": "805368",
    "code": "GWSS1004",
    "subject": "GWSS",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Screening Sex",
    "fullname": "Screening Sex: Visual and Popular Culture",
    "info": "Film history and theory; feminist critique of popular culture. \n",
    "prereq": {}
  },
  {
    "uid": "805369",
    "code": "GWSS1005",
    "subject": "GWSS",
    "number": "1005",
    "honors": false,
    "writing": false,
    "name": "Engaging Justice",
    "fullname": "Engaging Justice",
    "info": "U.S./cross-cultural studies of social movements/political organizing around justice/equality.",
    "prereq": {}
  },
  {
    "uid": "806571",
    "code": "GWSS1006",
    "subject": "GWSS",
    "number": "1006",
    "honors": false,
    "writing": false,
    "name": "Skin, Sex, and Genes",
    "fullname": "Skin, Sex, and Genes",
    "info": "Interdisciplinary course that explores the tense relationships between science, medicine, and gender and sexuality.",
    "prereq": {}
  },
  {
    "uid": "808858",
    "code": "GWSS1007",
    "subject": "GWSS",
    "number": "1007",
    "honors": false,
    "writing": false,
    "name": "Intro to GLBT Studies",
    "fullname": "Introduction to GLBT Studies",
    "info": "History of contemporary GLBT-identified communities. Terms of theoretical debates regarding sexual orientation, identity, experience. Analyzes problems produced/insights gained by incorporating GLBT issues into specific academic, social, cultural, political discourses.",
    "prereq": {}
  },
  {
    "uid": "826679",
    "code": "GWSS1042",
    "subject": "GWSS",
    "number": "1042",
    "honors": false,
    "writing": false,
    "name": "Engaging with Queer Cinema",
    "fullname": "Engaging with Queer Cinema",
    "info": "What codes are at work that make a film Queer? In Queer Cinema, you will be an interpretive artist and active spectator as we analyze and consider subversive cinema from across nations and historical periods. Sometimes these films will be obviously queer or trans. However, queer and trans film is often coded or distorted, especially in response to legal or societal censorship or disapproval. As a result, Queer directors and writers sometimes speak in a liberatory way to particular oppressed/silenced groups on the level of coded content, but if the content is consumed out of context of the code, the experience of a film may be contradictory, even offensive. Consequently, we'll be looking for the queer subversions within the distortions.",
    "prereq": {}
  },
  {
    "uid": "788861",
    "code": "GWSS1902",
    "subject": "GWSS",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics/description vary. See Class Schedule, Course Guide.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "791250",
    "code": "GWSS1904",
    "subject": "GWSS",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "791434",
    "code": "GWSS1905",
    "subject": "GWSS",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics/description vary. See Class Schedule, Course Guide.\n\nprereq: freshman",
    "prereq": {}
  },
  {
    "uid": "799385",
    "code": "GWSS1910W",
    "subject": "GWSS",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "Freshman Seminar",
    "fullname": "Topics: Freshman Seminar",
    "info": "Topics specified in Course Guide.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "817052",
    "code": "GWSS1911",
    "subject": "GWSS",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Black Looks: Race & Gender",
    "fullname": "Black Looks: Race, Gender and Representation",
    "info": "This seminar explores the writing of bell hooks, one of the foremost feminist thinkers alive today. We begin with her earliest writings that expose the inherent racism of white middle-class feminism and its institutionalization in predominantly white university settings. We go on to examine her autobiographic writings that illuminate the intersections between place, identity, and black subjectivity. We will also study and debate her incisive critiques of portrayed blackness in American popular culture including film, television, and literature. ",
    "prereq": {}
  },
  {
    "uid": "818056",
    "code": "GWSS1912",
    "subject": "GWSS",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "The Spill: A Black Fem Oracle",
    "fullname": "The Spill: A Black Feminist Oracle",
    "info": "This is an interactive semester long experience in Black feminist theory and praxis grounded in the theoretical interventions and poetic implications of the work of Hortense J. Spillers. Hortense J. Spillers has influenced generations of scholars with her foundational essays, collected in the volume Black, White and In Color: Essays on American Culture. \n\nSome of the questions that the class will come back to again and again include: What constitutes freedom? What am I escaping? How am I contained and constrained? Where and when am I overflowing? To whom am I accountable? What nourishes me? What feeds my community? Where do words fail? Does love prevail? What is the purpose and place of critique? What are the contours of collaboration? What is my role in this community? What am I learning and unlearning with and from my family of origin? This course is a Black feminist space of inquiry and is open to all students who are excited about and committed to engaging and prioritizing Black feminist modes of thinking, creating and collaborating.",
    "prereq": {}
  },
  {
    "uid": "818892",
    "code": "GWSS1913",
    "subject": "GWSS",
    "number": "1913",
    "honors": false,
    "writing": false,
    "name": "Ending Sexual Violence",
    "fullname": "Ending Sexual Violence at the University of Minnesota",
    "info": "The 2015 College Student Health Survey, administered by Boynton Health at the University of Minnesota found that there has been an increase in the number of women and men who reported they have been a victim/survivor of sexual assault. Approximately one in three (32.4%) female students at the University of Minnesota–Twin Cities report experiencing a sexual assault within their lifetime, with 8.9% reporting having been assaulted within the past 12 months. This is an increase over previous surveys, including a 2013 survey in which 22 percent reported sexual assault in their lifetime. Male students at the college have experienced sexual assault at lower rates, with 10.7% reporting an assault within their lifetime and 2.7% reporting an assault within the past 12 months. Recently released research (Eisenberg, Lust, Mathiason & Porta, 2017) based on this very same annual surveillance program has found that rates of sexual assault victimization were considerably higher among LGBTQ students than heterosexual students.  \nThis interactive seminar asks and attempts to answer: what would it take to end sexual violence for everyone at the University of Minnesota? We will explore this question in the feminist criminology, public health, and anti-sexual violence movement literatures.  In addition, we will learn from guest speakers—student activists, sexual assault advocates, Title IX coordinators, researchers, Sexual Assault Nurse Examiners, transformative justice collective members, etc.—who are working tirelessly both on- and off-campus to end both sexual violence and the “rape culture” that sustains it.  ",
    "prereq": {}
  },
  {
    "uid": "818922",
    "code": "GWSS1914",
    "subject": "GWSS",
    "number": "1914",
    "honors": false,
    "writing": false,
    "name": "Queer & Feminist Imperialism",
    "fullname": "Debbie Do-Gooder and the White Savior Cat: Humanitarianism or Queer & Feminist Imperialism?",
    "info": "Why do we, as Americans, have the urge to help people in the “Third World”? Do people in the “Third World” need saving? What do Debbie Do-Gooders, some human rights activists, and  white savior cats have in common? How does the “Third World” become the “Third World”? What is humanitarianism and how is it different from imperialism? How do we support local movements without becoming queer, non-binary, and/or feminist imperialists? What constitutes queer and feminist liberation? Can the subaltern cat meow? These are some of the questions that we try to answer in this freshman seminar. We will watch films, music videos, read stories and poetry, come up with white savior cat memes, and listen to people who work in feminist, queer, and trans organizations in different parts of the world to learn about queer and feminist activism, and to unlearn Eurocentrism.",
    "prereq": {}
  },
  {
    "uid": "819948",
    "code": "GWSS1915",
    "subject": "GWSS",
    "number": "1915",
    "honors": false,
    "writing": false,
    "name": "Trauma &the White Racial Frame",
    "fullname": "Trauma and the White Racial Frame:   Disrupting Whiteness and White Body Supremacy in Everyday Life",
    "info": "This class will trace trauma as it was passed down from one European body to another beginning with Middle Ages, imported to the New World by Colonists, then based down by many generations of people including African Americans, First-Nations peoples, and white Americans. One of the basic premises of this course is that psychosocial wounds of white body supremacy in the  United States impedes ethical reasoning and decision making in society. Consequently, most Americans routinely reinforce the power of whiteness and white supremacy to detriment of other members of society, the social environments that people interact in, and society as a whole. This course will educate students about the socio-cultural wounds of racial trauma in the United States, toward the aim of, building personal and interpersonal resilience at school, work, and other settings. Students will develop skills to recognize and disrupt white body supremacy in order to foster racial justice, equity, and diversity in broader society.\n",
    "prereq": {}
  },
  {
    "uid": "825258",
    "code": "GWSS1916",
    "subject": "GWSS",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Gender, Race and Debt",
    "fullname": "Life and Debt: Gender, Race and Debt",
    "info": "This course borrows its title from the film ?Life and Debt? by Stephanie Black, based on the essay ?A Small Place? by Jamaica Kincaid. The film examines the deployment of credit and debt to establish and maintain hierarchies of power and wealth among nations. The course will explore the ways allocations of credit and debt are used to create, transform, or maintain gender roles and hierarchies, racial hierarchies, and other power relations, as well as economic relationships, at various scales, from global to the most local and interpersonal. This course thus provides students with the opportunity to situate one of the most difficult features of contemporary life ? debt ? in a larger context.",
    "prereq": {}
  },
  {
    "uid": "818057",
    "code": "GWSS1917",
    "subject": "GWSS",
    "number": "1917",
    "honors": false,
    "writing": false,
    "name": "Inequality & American Dream",
    "fullname": "Inequality and the American Dream",
    "info": "Increasing and intensifying inequality is perhaps the most pressing socio-economic problem of our time. A significant threat to democracy, the American dream, and national values of diversity and inclusion, wealth inequality today has not only surpassed that of the Great Depression but also grafted onto longstanding, intersectional cleavages of race, gender, indigeneity, class, and sexuality. The richest one percent have captured nearly 60 percent of all income gains from 1977 to 2000, and in 2010, the top 20 percent of households owned almost 90 percent of all privately held wealth in the United States, while the net worth of the bottom 40 percent was negative. Simultaneously, much of the current political polarization, cultures of resentment, and rise in scapegoating and racist anti-immigrant actions have also been attributed to the attendant consequences of rising inequality, anxiety, and insecurity. \n\nAnd yet, many social critics argue that instead of addressing the key causes of inequality and the crisis of the American dream, the powerful in society have seized on these conditions to mobilize an avalanche of discontent among sectors of the downwardly mobile in a way that often obscures the key reasons for their predicament and scapegoats those at the social margins. Given this context, it is imperative to better understand and analyze the histories, cultural assumptions, and hierarchies that have produced contemporary inequality. How did we get to this point? What are the consequences, and what might we expect in the future? This set of seminars asks these hard questions and engages in precisely this exploration.  \n\nThese four freshman seminars (AFRO 1917, ANTH 1917, GWSS 1917, HIST 1917) will occasionally meet together, and will bring together scholars across multiple disciplines (African American Studies, Anthropology, Feminist Studies, History, and beyond) who are substantively engaged with scholarship on class, race, indigeneity, gender, and sexuality. We believe that this cross-fertilization is critical because the fault-lines of inequality have precisely cohered to these structural formations and categories of analysis.\n",
    "prereq": {}
  },
  {
    "uid": "826352",
    "code": "GWSS1918",
    "subject": "GWSS",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "Stories, Body, Movement",
    "fullname": "Stories, Body, Movement",
    "info": "This class is dedicated to ways of knowing about creative imagination through Stories, Gender identities, and Dance / Performance that reflects experience and response to understanding place / space. Centered on migration, displacement, and travel, this class engages different modalities in human expression, bodily creative exploration, and critical engagement with events.Stories articulate experience, memory, and creative imagination, reception, and interpretation. Often stories capture the emotion: depiction of struggles and narration of resilience and resistance from human experiences and this includes displacement. Movement in this class is a form of an embodiment of creative tools that reflect human imagination (i.e., Dance), but also about human historicity and relationality in global spaces. The class will read a variety of writing and see performances from Asia, the Middle East, Africa, and some parts of the US.",
    "prereq": {}
  },
  {
    "uid": "007069",
    "code": "GWSS3002W",
    "subject": "GWSS",
    "number": "3002",
    "honors": false,
    "writing": true,
    "name": "Gender, Race, & Class in U.S.",
    "fullname": "Gender, Race, and Class in the U.S.",
    "info": "Comparative study of women, gender, race, class, sexuality in two or more ethnic cultures throughout U.S.",
    "prereq": {}
  },
  {
    "uid": "007070",
    "code": "GWSS3003",
    "subject": "GWSS",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Gender and Global Politics",
    "fullname": "Gender and Global Politics",
    "info": "Similarities/differences in women's experiences throughout world, from cross-cultural/historical perspective. Uses range of reading materials/media (feminist scholarship, fiction, film, news media, oral history, autobiography).",
    "prereq": {}
  },
  {
    "uid": "008034",
    "code": "GWSS3004W",
    "subject": "GWSS",
    "number": "3004",
    "honors": false,
    "writing": true,
    "name": "Feminist Debates",
    "fullname": "Point/Counterpoint: Contemporary Feminist Debates",
    "info": "Contemporary debates of concern to many women. Abortion, affirmative action, marriage rights, welfare rights, sex education, children's rights, date rape. In-depth study of several issues. Debate pros/cons of relevant perspectives. Includes honors recitation.",
    "prereq": {}
  },
  {
    "uid": "818654",
    "code": "GWSS3047W",
    "subject": "GWSS",
    "number": "3047",
    "honors": false,
    "writing": true,
    "name": "Sex, Gender & Sexuality",
    "fullname": "Anthropology of Sex, Gender and Sexuality",
    "info": "This course explores the concepts of \"sex,\" \"gender,\" and \"sexuality\" through the scholarship of feminist anthropology, queer anthropology, and their antecedents.  Students will read ethnographies that grapple with the contingent and shifting formations of these social constructions - when they emerge, disentangle, re-entangle, submerge, etc. The course will highlight the roles of imperialism, (settler) colonialism, capitalism, racism, heteropatriarchy, ableism, and other forms of social power in shaping these formations as well at the social categories - \"sex,\" \"gender,\" and \"sexuality\" - themselves.",
    "prereq": {}
  },
  {
    "uid": "007072",
    "code": "GWSS3102W",
    "subject": "GWSS",
    "number": "3102",
    "honors": false,
    "writing": true,
    "name": "Feminist Thought and Theory",
    "fullname": "Feminist Thought and Theory",
    "info": "Substantively, this course surveys the rich and varied history of influential feminist ideas. These ideas propel us to think critically about sex, gender, sexuality, and the categories that intersect with them; these ideas provide us with language to express ourselves more critically and creatively; these ideas enable us to rethink relationships of power and forge coalition-al values and connections across difference. This course also holds the field of feminism accountable for its influence, in hopes of contributing to more liberating feminist theories. Methodologically, this course develops students’ skills in tracking arguments, understanding commonly used theoretical terms, learning how to apply theory to real life situations, and honing students’ theoretical writing.",
    "prereq": {}
  },
  {
    "uid": "007087",
    "code": "GWSS3190",
    "subject": "GWSS",
    "number": "3190",
    "honors": false,
    "writing": false,
    "name": "Topics: Theory & Knowledge",
    "fullname": "Topics: Theory, Knowledge, and Power",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "797045",
    "code": "GWSS3201",
    "subject": "GWSS",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Soc of Gender",
    "fullname": "Sociology of Gender",
    "info": "Organization, culture, and dynamics of gender relations. Gender/racial inequalities in workplace. Relationships between gender/race, gender/culture. Sexuality, gendered politics, women's movement.\n\nprereq: 1001 or 1002 or instr consent",
    "prereq": {
      "or": [
        "007068",
        "007071"
      ]
    }
  },
  {
    "uid": "007075",
    "code": "GWSS3202",
    "subject": "GWSS",
    "number": "3202",
    "honors": false,
    "writing": false,
    "name": "Biology of Women",
    "fullname": "Biology of Women",
    "info": "Biological aspects of female life from early development to old age. Biology of sex differences/sexuality, menarche/menstrual cycles,  gestation/parturition, female-specific diseases/conditions, menopause/aging. Ways of knowing biology of female body. Includes lab.",
    "prereq": {}
  },
  {
    "uid": "007095",
    "code": "GWSS3203W",
    "subject": "GWSS",
    "number": "3203",
    "honors": false,
    "writing": true,
    "name": "Blood, Bodies and Science",
    "fullname": "Blood, Bodies and Science",
    "info": "This course examines the contemporary politics of health and medicine from a critical race theory, disability-oriented, and feminist/queer/trans perspective. Who is understood to be deserving of health and medical care? Who should decide how to govern the provision of care? Who, if anyone should profit from life-saving medical treatment or medicines? How did we come to have the health system we have now? How have Black, Indigenous, immigrant, and people of color communities fought for access to equitable health care in the context of the racial history of medicine and health? Struggles for justice and equity in health and medicine are integrally related to the question of how society treats people who are in need of care. Topics include the history of DIY health movements; trans health care bans; the science and history of pandemics, including Covid and HIV; the history of health insurance; struggles for global equity in vaccines and pharmaceuticals; disability; reproductive justice movements; and the history of eugenics.",
    "prereq": {}
  },
  {
    "uid": "010737",
    "code": "GWSS3204",
    "subject": "GWSS",
    "number": "3204",
    "honors": false,
    "writing": false,
    "name": "Women Psychologies",
    "fullname": "Women's Psychologies:  Feminist and Multicultural Perspectives",
    "info": "Examines culture, gender, ethnicity, class, sexual identity, and age as factors that influence women's diverse psychologies.",
    "prereq": {}
  },
  {
    "uid": "817462",
    "code": "GWSS3205",
    "subject": "GWSS",
    "number": "3205",
    "honors": false,
    "writing": false,
    "name": "Life for Sale: Global Debates",
    "fullname": "Life for Sale: Global Debates on Environment, Science and Society",
    "info": "This class uses a social justice lens to explore the interrelations of scientific discoveries, unequal global economies, and commodification. We will look at practices, new technologies, and policies that are trenchant for the negative impacts they have on environments broadly defined, and for human and non-human populations.  We will ask how these practices, technologies, and policies - and the social and economic contexts that produce them - variably impact the health, well being, and valuation of particular populations.  In a series of interconnected themes, we will examine what factors produce food insecurity and for whom; where and why pollution of resources such as water happens; the history and current state of antibiotic resistance; climate change and its various effects; and how new technologies can be life-saving and life-denying according to the ways national and global policies determine who gains access and who does not.  We will also look at the innovative ways grassroots movements tackle issues confronting particular groups, what constitutes positive social change and by whose definition, and potential ways forward.\n\nPrereq:  soph or jr or sr",
    "prereq": {}
  },
  {
    "uid": "007097",
    "code": "GWSS3206",
    "subject": "GWSS",
    "number": "3206",
    "honors": false,
    "writing": false,
    "name": "Women and Madness",
    "fullname": "Women and Madness in History and Literature",
    "info": "The representation of madness and how it intersects with gender as well as class, race, sexual orientation, and nationality.",
    "prereq": {}
  },
  {
    "uid": "795369",
    "code": "GWSS3207",
    "subject": "GWSS",
    "number": "3207",
    "honors": false,
    "writing": false,
    "name": "Gender and Global Health",
    "fullname": "Gender and the Global Politics of Health",
    "info": "Politics, global processes, and social relations that shape health/disease patterns world wide. Case studies, including HIV/AIDS in Africa, diabetes and health care in the U.S., new reproductive technologies, and access to food. How gender, poverty, geographic/social location, citizenship, sexuality, and  other factors help determine degree of vulnerability to disease or right to health.\n",
    "prereq": {}
  },
  {
    "uid": "816466",
    "code": "GWSS3208",
    "subject": "GWSS",
    "number": "3208",
    "honors": false,
    "writing": false,
    "name": "Transgender Health",
    "fullname": "Transgender Health",
    "info": "Transgender Health is an online, 3 credit, 8-week course, in which we will learn how the social categories of sex and gender transform our understanding of health and medicine. This course offers feminist perspectives on transgender health care and considers how health care and social services professionals serve (or fail to serve) the diverse needs of transgender patients and clients. Students will engage with literature from feminist and queer studies, the media, public health, medicine, social work, and legal studies.",
    "prereq": {}
  },
  {
    "uid": "818583",
    "code": "GWSS3212",
    "subject": "GWSS",
    "number": "3212",
    "honors": false,
    "writing": false,
    "name": "Chicana Feminism",
    "fullname": "Chicana Feminism: La Chicana in Contemporary Society",
    "info": "Scholarly/creative work of Chicanas or politically defined women of Mexican American community. Interdisciplinary. Historical context, cultural process, and autoethnography.\n",
    "prereq": {}
  },
  {
    "uid": "812955",
    "code": "GWSS3215",
    "subject": "GWSS",
    "number": "3215",
    "honors": false,
    "writing": false,
    "name": "Bod That Mtr: Fem Disabi Stud",
    "fullname": "Bodies That Matter: Feminist Approaches to Disability Studies",
    "info": "The COVID-19 pandemic has made questions of disability and ableism central and visible for all of us as never before. Dis/ability is not a physical or mental defect but a form of social meaning mapped to certain bodies in larger systems of power and privilege. Feminist approaches explore dis/ability as a vector of oppression intersecting and constituted through race, class, gender, sexuality, and citizenship. The course examines ideologies of ableism and the material realities of such oppression, and works toward imagining and constructing a more just and equitable society. As health care is differentially distributed or limited for people who are sickened by COVID-19, we see that systems of social and economic power determine the life chances of those who claim, or are claimed by disability. Meanwhile, people with disabilities have developed many daily life strategies that can be models for everyone coping with the pandemic.",
    "prereq": {}
  },
  {
    "uid": "817146",
    "code": "GWSS3218",
    "subject": "GWSS",
    "number": "3218",
    "honors": false,
    "writing": false,
    "name": "Politics of Reproduction",
    "fullname": "Politics of Reproduction",
    "info": "We often think of reproduction solely in terms of physiological events like pregnancy, delivery, or menstruation that occur in (or to) individual female bodies. Additionally, physicians and demographers appear to be the primary professional experts when it comes to managing and quantifying such reproductive events.  In contrast, this class grapples with reproduction as a social and biological set of meanings and processes through which racial, gender, sexual, and socio-economic inequalities have been amplified, reconfigured, and contested across time and space. We trace how control over reproduction has been critical to a variety of professional, economic and political endeavors, including the rise and consolidation of disciplines like obstetrics-gynecology and demography; the maintenance of white privilege in colonial spaces and the metropole; post-World War II techno-scientific projects of \"development\" in the global South; and the emergence of the welfare state. The course identifies inequalities along the lines of race, class, gender, sexuality, and nationality in reproductive experiences and outcomes in a wide range of countries, including Cameroon, China, Cuba, Sudan, Soviet Russia, Romania, Zimbabwe, India, Senegal, Burkina Faso, South Africa, Nigeria, and the US. We locate individually embodied reproductive meanings and practices related to pregnancy, delivery, abortion, post-abortion care, contraception, sterilization, surrogacy, and child care in regional, national and global political economies. In other words, we investigate continuities and disruptions in reproductive politics between the individual body and the social body; the past, present and future; and local and global arenas. By exploring how reproduction operates domestically and globally as a mechanism of governance and social and economic stratification, we also consider possibilities for reproductive justice. ",
    "prereq": {}
  },
  {
    "uid": "007102",
    "code": "GWSS3290",
    "subject": "GWSS",
    "number": "3290",
    "honors": false,
    "writing": false,
    "name": "Topics",
    "fullname": "Topics",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "007077",
    "code": "GWSS3301W",
    "subject": "GWSS",
    "number": "3301",
    "honors": false,
    "writing": true,
    "name": "Women Writers",
    "fullname": "Women Writers",
    "info": "Complexities of women's roles and way women writers have used various genres of literature to articulate personal and social struggles. Fiction, poetry, drama, critical nonfiction texts. Fidelity/betrayal within relationships and societal perceptions. What images of femininity do these writers convey? How do formal and stylistic devices transform meaning? ",
    "prereq": {}
  },
  {
    "uid": "007078",
    "code": "GWSS3302",
    "subject": "GWSS",
    "number": "3302",
    "honors": false,
    "writing": false,
    "name": "Women and the Arts",
    "fullname": "Women and the Arts",
    "info": "Study of women in the arts, as represented and as participants (creators, audiences). Discussion of at least two different art forms and works from at least two different U.S. ethnic or cultural communities.",
    "prereq": {}
  },
  {
    "uid": "007120",
    "code": "GWSS3303W",
    "subject": "GWSS",
    "number": "3303",
    "honors": false,
    "writing": true,
    "name": "Writing Differences",
    "fullname": "Writing Differences: Literature by U.S. Women of Color",
    "info": "Interpret/analyze poetry, fiction, and drama of U.S. women minority writers. Relationship of writer's history, ethnicity, race, class, and gender to her writings.",
    "prereq": {}
  },
  {
    "uid": "811514",
    "code": "GWSS3304",
    "subject": "GWSS",
    "number": "3304",
    "honors": false,
    "writing": false,
    "name": "Novels and Nations",
    "fullname": "Novels and Nations",
    "info": "Explore intricacies of web of fiction without losing sight of structures that hold it up.",
    "prereq": {}
  },
  {
    "uid": "792186",
    "code": "GWSS3305",
    "subject": "GWSS",
    "number": "3305",
    "honors": false,
    "writing": false,
    "name": "Queer Cinema",
    "fullname": "Queer Cinema",
    "info": "What \"queer\" and \"queering\" signify in relation to cinema. Directors, films, styles, genres of queer cinema. Ways in which traditional narrative codes are challenged/repackaged. Ideological dimensions. Impact of political climate. Readings, screenings, discussions, assignments.",
    "prereq": {}
  },
  {
    "uid": "007121",
    "code": "GWSS3306",
    "subject": "GWSS",
    "number": "3306",
    "honors": false,
    "writing": false,
    "name": "Pop Culture Women",
    "fullname": "Pop Culture Women",
    "info": "Contemporary U.S. feminism as political/intellectual movement. Ways in which movement has been represented in popular culture.",
    "prereq": {}
  },
  {
    "uid": "007079",
    "code": "GWSS3307",
    "subject": "GWSS",
    "number": "3307",
    "honors": false,
    "writing": false,
    "name": "Feminist Film Studies",
    "fullname": "Feminist Film Studies",
    "info": "Construction of different notions of gender in film, social uses of these portrayals. Lectures on film criticism, film viewings, class discussions.",
    "prereq": {}
  },
  {
    "uid": "007127",
    "code": "GWSS3308W",
    "subject": "GWSS",
    "number": "3308",
    "honors": false,
    "writing": true,
    "name": "Women's Contemp Fiction",
    "fullname": "Women's Contemporary Fiction",
    "info": "Themes and features of style and content related to changes in women's roles in novels and short stories by English-language women writers of the late 20th century.  Significance of race, sexual orientation, class, and age in the conditions of women's lives and their portrayal in literature.",
    "prereq": {}
  },
  {
    "uid": "813706",
    "code": "GWSS3309",
    "subject": "GWSS",
    "number": "3309",
    "honors": false,
    "writing": false,
    "name": "Bollywood: Pop Hindi Cinema",
    "fullname": "Bollywood: Popular Hindi Cinema",
    "info": "Course provides a guide to the cultural, social and political significance of popular Hindi cinema, outlining the history and structure of the Bombay film industry, and its impact on global popular culture.",
    "prereq": {}
  },
  {
    "uid": "801655",
    "code": "GWSS3351",
    "subject": "GWSS",
    "number": "3351",
    "honors": false,
    "writing": false,
    "name": "Women and Diasporas",
    "fullname": "Women and Diasporas in Modern History",
    "info": "Comparing diasporas across time. Focuses on gendering of lives/identities of people whose identities continue to be shaped by forced/free migrations of past 500 years.",
    "prereq": {}
  },
  {
    "uid": "007130",
    "code": "GWSS3390",
    "subject": "GWSS",
    "number": "3390",
    "honors": false,
    "writing": false,
    "name": "Topics: Visual/Cultural/Lit",
    "fullname": "Topics in Visual, Cultural, and Literary Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "811684",
    "code": "GWSS3402",
    "subject": "GWSS",
    "number": "3402",
    "honors": false,
    "writing": false,
    "name": "Pleasure, Intimacy & Violence",
    "fullname": "Pleasure, Intimacy and Violence",
    "info": "Gender/sexual violence to poststructural, anti­racist theories/debates about social construction of sexuality. How intimacy/violence are co­-constituted within normative frameworks of U.S. governmentality. Writings by black feminist criminologists who have linked incarceration, welfare reform, other forms of state regulation to deeply \nsystemic forms of violence against people of color.",
    "prereq": {}
  },
  {
    "uid": "007104",
    "code": "GWSS3403W",
    "subject": "GWSS",
    "number": "3403",
    "honors": false,
    "writing": true,
    "name": "Jewish Women in the US",
    "fullname": "Jewish Women in the United States",
    "info": "History of American Jewish women. Uses literary/religious texts, primary documents, films, and histories to analyze Jewish women's experiences in the United States and their transformation of Judaism, political activism, and their role in the bourgeois family. How they are represented, how they represent themselves. Interdisciplinary approach.",
    "prereq": {}
  },
  {
    "uid": "013418",
    "code": "GWSS3404",
    "subject": "GWSS",
    "number": "3404",
    "honors": false,
    "writing": false,
    "name": "Transnational Sexualities",
    "fullname": "Transnational Sexualities",
    "info": "Lesbian/gay lives throughout world. Culturally-specific/transcultural aspects of lesbian/gay identity formation, political struggles, community involvement, and global networking. Lesbian/gay life in areas other than Europe and the United States.",
    "prereq": {}
  },
  {
    "uid": "007106",
    "code": "GWSS3405",
    "subject": "GWSS",
    "number": "3405",
    "honors": false,
    "writing": false,
    "name": "Lat Am Women's Live",
    "fullname": "Latin American Women's Lives",
    "info": "An interdisciplinary approach to understanding women's lives in Latin America.  Use of ethnography, history, poetry, fiction, and \"testimonio\" to understand the conditions of women's lives in Latin America.  ",
    "prereq": {}
  },
  {
    "uid": "015404",
    "code": "GWSS3406",
    "subject": "GWSS",
    "number": "3406",
    "honors": false,
    "writing": false,
    "name": "Gender, Labor, and Politics",
    "fullname": "Gender, Labor, and Politics",
    "info": "Historical developments/contemporary manifestations of women's participation in labor force/global economy. Gender as condition for creation/maintenance of exploitable category of workers. How women's choices are shaped in various locations. Women's labor organizing.\n\nGWSS / Gender, Women, and Sexuality Studies / Gender Studies ",
    "prereq": {}
  },
  {
    "uid": "792076",
    "code": "GWSS3407",
    "subject": "GWSS",
    "number": "3407",
    "honors": false,
    "writing": false,
    "name": "Women in Early Amer",
    "fullname": "Women in Early and Victorian America: 1600-1890",
    "info": "Varied experiences of women in American history from European settlement in North America to the end of the 19th century.  ",
    "prereq": {}
  },
  {
    "uid": "792083",
    "code": "GWSS3408",
    "subject": "GWSS",
    "number": "3408",
    "honors": false,
    "writing": false,
    "name": "Women Mod America",
    "fullname": "Women in Modern America",
    "info": "History of women in the United States from 1890 to present. Women's changing roles in politics, in labor force, in family, and in popular culture. Work, family, sexuality, gender ideologies, women's right struggles. Different experiences of women based on race, class, religion, and region.",
    "prereq": {}
  },
  {
    "uid": "016185",
    "code": "GWSS3409W",
    "subject": "GWSS",
    "number": "3409",
    "honors": false,
    "writing": true,
    "name": "Asian American Women Culture",
    "fullname": "Asian American Women's Cultural Production",
    "info": "This course explores cultural texts produced by and about Asian American women and queers. It wrestles with the complexities of a historical moment in which Asian American women are both increasingly visible in pop culture and increasingly visible targets of violence. We will push beyond judgments of “positive” or “negative” representations of Asian Americans and instead explore the political dimensions of these cultural representations—that is, how they animate, reference, or repress longer histories of migration, war, labor, and empire. We will approach the categories of both “Asian American” and “women” less as static identities and more as shifting political coalitions that bring together diverse groups of people whose experience of gender, sexuality, race, and class deviates from the norm of white, heterosexual, and cisgender American citizenship. In tracking (and at times celebrating) these deviations, we will ask: how might film, TV, literature, art, and theory help illuminate Asian American feminist politics?",
    "prereq": {}
  },
  {
    "uid": "015925",
    "code": "GWSS3410",
    "subject": "GWSS",
    "number": "3410",
    "honors": false,
    "writing": false,
    "name": "Chicana Studies: La Chicana",
    "fullname": "Chicana Studies: La Chicana in Contemporary Society",
    "info": "Scholarly/creative work of Chicanas or politically defined women of Mexican American community. Interdisciplinary. Historical context, cultural process, autoethnography.",
    "prereq": {}
  },
  {
    "uid": "015926",
    "code": "GWSS3411",
    "subject": "GWSS",
    "number": "3411",
    "honors": false,
    "writing": false,
    "name": "Las Mujeres",
    "fullname": "Las Mujeres",
    "info": "Focus on Chicanas; women of the Mexican-American community. Exploration of racial, economic, political, and gender issues of concern to all Mexican Americans and diverse Latino cultures. ",
    "prereq": {}
  },
  {
    "uid": "788734",
    "code": "GWSS3412",
    "subject": "GWSS",
    "number": "3412",
    "honors": false,
    "writing": false,
    "name": "American Indian Women",
    "fullname": "American Indian Women: Ethnographic and Ethnohistorical Perspectives",
    "info": "Comparative survey of ethnographic/ethnohistorical writings by/about American Indian women.",
    "prereq": {}
  },
  {
    "uid": "789080",
    "code": "GWSS3413",
    "subject": "GWSS",
    "number": "3413",
    "honors": false,
    "writing": false,
    "name": "Women/Gender Latin Amer Hist",
    "fullname": "Women and Gender in Latin American History",
    "info": "Changing gender norms in Latin America over time as compared with lives of women/men of diverse classes, ethnic groups. How women responded to their position in society, on continuum from accomodation to resistance.",
    "prereq": {}
  },
  {
    "uid": "790184",
    "code": "GWSS3414",
    "subject": "GWSS",
    "number": "3414",
    "honors": false,
    "writing": false,
    "name": "Women in Medieval Europe",
    "fullname": "Women in Medieval Europe",
    "info": "Women's role in family, politics, religion, work, and social movements. Representations of women in religious texts, art, literature, scientific studies, and law. Methods/approaches to study of women's history.",
    "prereq": {}
  },
  {
    "uid": "802080",
    "code": "GWSS3415",
    "subject": "GWSS",
    "number": "3415",
    "honors": false,
    "writing": false,
    "name": "Dom Violence/Sexual Assault",
    "fullname": "Feminist Perspectives on Domestic Violence and Sexual Assault",
    "info": "History of and contemporary thinking about public policies and legal remedies directed toward domestic violence and sexual assault. How notions of public/private spheres and social constructions of gender roles, agency, and bodies contribute to attitudes/responses.",
    "prereq": {}
  },
  {
    "uid": "802451",
    "code": "GWSS3469",
    "subject": "GWSS",
    "number": "3469",
    "honors": false,
    "writing": false,
    "name": "Women and Family in China",
    "fullname": "History of Women and family in China, 1600-2000",
    "info": "Marriage/family life, foot binding, cult of women's chastity. Women in nationalist/communist revolutions. Gender relations in post-socialist China. Effect of ideologies (Confucianism, nationalism, socialism) on women/family life. Differences between ideology and social practice.",
    "prereq": {}
  },
  {
    "uid": "007111",
    "code": "GWSS3490",
    "subject": "GWSS",
    "number": "3490",
    "honors": false,
    "writing": false,
    "name": "Topics: Pol Econ/Global Study",
    "fullname": "Topics in Political Economy and Global Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "809940",
    "code": "GWSS3501",
    "subject": "GWSS",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "GLBT Social Movements in U.S.",
    "fullname": "Gay, Lesbian, Bisexual and Transgender Social Movements in the United States",
    "info": "Interdisciplinary course. Development of GLBT social movements using social movement theory/service learning.",
    "prereq": {}
  },
  {
    "uid": "816664",
    "code": "GWSS3502",
    "subject": "GWSS",
    "number": "3502",
    "honors": false,
    "writing": false,
    "name": "Transgender Studies Now",
    "fullname": "Transgender Studies Now",
    "info": "Transgender studies transforms ideas about gender, sexuality, identity, and biology. We look at knowledge is made about transgender life across disciplines and media: film, fiction, and the internet, as well as medicine, history, anthropology, and gender studies. Also asks how transgender social practices and community politics are embedded in dynamics of race, class, sexuality, nationality and ability.",
    "prereq": {}
  },
  {
    "uid": "794514",
    "code": "GWSS3503",
    "subject": "GWSS",
    "number": "3503",
    "honors": false,
    "writing": false,
    "name": "Women and the Law",
    "fullname": "Women and the Law",
    "info": "Legal system as it relates to women: historical legal approach to issues related to constitutional rights of women.",
    "prereq": {}
  },
  {
    "uid": "817290",
    "code": "GWSS3505W",
    "subject": "GWSS",
    "number": "3505",
    "honors": false,
    "writing": true,
    "name": "Girls, Girlhood, & Resistance",
    "fullname": "Girls, Girlhood, and Resistance",
    "info": "A critical engagement with what constitutes \"girlhood\" and \"resistance\" through comparative analyses of girls' resistance and activism across North America.",
    "prereq": {}
  },
  {
    "uid": "817833",
    "code": "GWSS3515",
    "subject": "GWSS",
    "number": "3515",
    "honors": false,
    "writing": false,
    "name": "Cmparativ Indigenous Feminisms",
    "fullname": "Comparative Indigenous Feminisms",
    "info": "The course will examine the relationship between Western feminism and indigenous feminism as well as the interconnections between women of color feminism and indigenous feminism. In addition to exploring how indigenous feminists have theorized from 'the flesh' of their embodied experience of colonialism, the course will also consider how indigenous women are articulating decolonization and the embodiment of autonomy through scholarship, cultural revitalization, and activism.",
    "prereq": {}
  },
  {
    "uid": "813865",
    "code": "GWSS3549",
    "subject": "GWSS",
    "number": "3549",
    "honors": false,
    "writing": false,
    "name": "U.S. Women's Legal History",
    "fullname": "U.S. Women's Legal History",
    "info": "Women's legal status, from colonial era through 20th century. Women's citizenship, civil rights. Marriage, divorce, and child custody. Reproductive/physical autonomy/integrity. Economic/educational equality.\n\nprereq: Soph or jr or sr",
    "prereq": {}
  },
  {
    "uid": "007116",
    "code": "GWSS3590",
    "subject": "GWSS",
    "number": "3590",
    "honors": false,
    "writing": false,
    "name": "Topics: Change/Activism/Policy",
    "fullname": "Topics: Social Change, Activism, Law, and Policy Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "819566",
    "code": "GWSS3611",
    "subject": "GWSS",
    "number": "3611",
    "honors": false,
    "writing": false,
    "name": "Stories, Bodies, Movements",
    "fullname": "Stories, Bodies, Movements",
    "info": "For most of us, stories seem to simply 'happen.' We listen to stories, we tell stories, we are moved by stories, and we retell stories. However, every act of telling stories involves making decisions or moves, and each re-telling of a familiar story may either give birth to new meanings, nuances, and affects, or, it may erase their possibility. Thus, each storyteller can be seen as a translator of stories with a responsibility to retell stories ethically. It is precisely through these translational acts that all politics become politics of storytelling. In this course, we will consider the ways in which the politics of the global and the intimate derive their meanings, effects, and affects from the circulation, transaction, and re-tellings of stories within and across borders.  We will ask how a praxis of ethical engagement with politics can be imagined as a praxis of receiving and retelling stories. By immersing ourselves in the process of remembering, telling, listening, trimming, interweaving, distilling, and performing stories, we will consider how ethical receiving and retelling of stories involves continuous revising, repositioning, and re-theorizing of such vexed and entangled terrains and terminologies as identity, community, rights, and justice, as well as the contingent meanings of knowledge, truth, and ethics.\n\nThis course engages this terrain through a mode of active learning in which all the participants will read and reflect, listen and discuss, tell and retell, watch and play, move and perform collectively. By becoming aware of the ways in which our minds-bodies-souls are inserted in the receiving and translation of stories, we will grapple together with the ways in which our bodies--as our embodiments--help to relationally shape not only our own performances but also our responses to the performances of other living and moving bodies around us. \n\nWe will learn from writings, film, songs, and plays by writers, artists, activists, and thinkers from a range of historical and contemporary locations and struggles. These include: Marie Lily Cerat, W. E. B. Du Bois, Suheir Hammad, Sterlin Harjo, Naeem Inayatullah, June Jordan, AnaLouise Keating, Kauanui, J. Kehaulani, Audre Lorde, Viet Thanh Nguyen, Middle East Research and Information Project, Alok Rai, Nina Simone, Leanne Betasamosake Simpson, Sangtin Writers, Standing Rock Collective, Eve Tuck, Patrick Wolfe, and K. Wayne Yang. Many of the 'Acts' in this course will be co-facilitated with local or international artists and writers.   \n\nThere are no prerequisites for this course. We invite people from all kinds of locations and journeys to join us in this collective exploration. For further information, email: nagar@umn.edu.\n\nGrading Basis: A/F. The course requires all the participants to do sustained work and deep reflections, enjoy the process of imagining and creating with peers in a non-competitive environment.",
    "prereq": {}
  },
  {
    "uid": "825642",
    "code": "GWSS3612",
    "subject": "GWSS",
    "number": "3612",
    "honors": false,
    "writing": false,
    "name": "Tourism/Ecology/Arts Indonesia",
    "fullname": "Global Tourism, Ecology and the Creative Arts in Indonesia",
    "info": "Students in this course will study cultural traditions, the creative industry, and tourism in Indonesia as an important part of the economy of the global south . The course will be held on the sites of dance performances, temples, heritage houses, and other cultural sites. Artists, cultural practitioners, cultural ministry officers, and policy makers for the tourism industry will serve as guest lecturers throughout. The course will be centered on creative intervention through the tourism industry and the arts and the particularity of creative impulse, gender difference, value of tradition, and modernity as a concept in Balinese culture.",
    "prereq": {}
  },
  {
    "uid": "810315",
    "code": "GWSS3615W",
    "subject": "GWSS",
    "number": "3615",
    "honors": false,
    "writing": true,
    "name": "Women in European History",
    "fullname": "Women in European History: 1500 to the Present",
    "info": "History of women in Western Europe from early modern period to present. Changes crucial to women's lives. Family/kinship structure, control over property, organization of work, religious ideas/practices, education, politics, beliefs/attitudes about female body.",
    "prereq": {}
  },
  {
    "uid": "818183",
    "code": "GWSS3626W",
    "subject": "GWSS",
    "number": "3626",
    "honors": false,
    "writing": true,
    "name": "Witches, Seers and Saints",
    "fullname": "Witches, Seers and Saints: Women, Gender and Religion in the US",
    "info": "This course examines the development and ramifications of gender ideologies within several religious groups in North America from the colonial period to the present and explores women's strategies that have contributed to and resisted these ideologies.",
    "prereq": {}
  },
  {
    "uid": "806954",
    "code": "GWSS3681",
    "subject": "GWSS",
    "number": "3681",
    "honors": false,
    "writing": false,
    "name": "Gender in the Islamic World",
    "fullname": "Gender and the Family in the Islamic World",
    "info": "This course explores the experiences of Muslim women and Muslim families from a historical and comparative perspective. Expanding the discussion on Muslim women's lives and experiences beyond the Middle East, by also centralizing on the experiences of Muslim women and families outside of this geographical area highlights the complex and diverse everyday experiences of Muslim women around the world. This wider lens exposes the limitations intrinsic in the stereotypical representation of Muslims in general and Muslim women in particular. We will explore the intricate web of gender and family power relations, and how these are contested and negotiated in these societies. Some of the themes the course explores include the debates on Muslim women and colonial representations, sexual politics, family, education and health, women and paid work, gender and human rights, and Islamic feminisms debates.\n\nprereq: At least soph; 1001 recommended",
    "prereq": {
      "and": [
        "007068"
      ]
    }
  },
  {
    "uid": "796131",
    "code": "GWSS3690",
    "subject": "GWSS",
    "number": "3690",
    "honors": false,
    "writing": false,
    "name": "Topics: US Women,Society,Race",
    "fullname": "Topics: Women, Society, and Race in the United States",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "818536",
    "code": "GWSS3896",
    "subject": "GWSS",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer.  Typically the student\u0092s work is supervised and evaluated by a site coordinator or instructor",
    "prereq": {}
  },
  {
    "uid": "010561",
    "code": "GWSS3980",
    "subject": "GWSS",
    "number": "3980",
    "honors": false,
    "writing": false,
    "name": "Dir Instruction",
    "fullname": "Directed Instruction",
    "info": "Directed Instruction",
    "prereq": {}
  },
  {
    "uid": "010560",
    "code": "GWSS3993",
    "subject": "GWSS",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "TBD\nPrereq instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "010562",
    "code": "GWSS3994",
    "subject": "GWSS",
    "number": "3994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "TBD\nPrereq instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "805787",
    "code": "GWSS4001",
    "subject": "GWSS",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Nations, Empires, Feminisms",
    "fullname": "Nations, Empires, Feminisms",
    "info": "Feminist critiques of the nation-state and citizenship, political economy and development, globalization, and/or empire and colonialism. Overview of the broader literature and an interrogation of specific attendant questions (such as how do feminists theorize state violence; what are feminist and queer critiques of U.S. empire; and how do feminists theorize globalization from above and below). ",
    "prereq": {}
  },
  {
    "uid": "805788",
    "code": "GWSS4002",
    "subject": "GWSS",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Politics of Engagement",
    "fullname": "Politics of Engagement and Social Justice",
    "info": "Ways in which feminist scholars have thought about and worked to complicate the opposition between theory and praxis. Diverse efforts by intellectuals situated within the Western academy to produce scholarship that is committed to deinstitutionalizing knowledge production and relevant to political struggles confronted by their own material and institutional inequalities.",
    "prereq": {}
  },
  {
    "uid": "805789",
    "code": "GWSS4003",
    "subject": "GWSS",
    "number": "4003",
    "honors": false,
    "writing": false,
    "name": "Science, Bodies, Technologies",
    "fullname": "Science, Bodies, Technologies",
    "info": "Feminist approaches to scientific methods and practices. Relationship between scientific practices and social relations, emphasizing the larger social, political, and economic context in which scientific knowledge production takes place. How scientific knowledge structures relationships of power and inequality, and constructs understandings of bodies and identities. Ways in which science shapes meanings of sex, race, gender and sexuality.",
    "prereq": {}
  },
  {
    "uid": "806333",
    "code": "GWSS4004",
    "subject": "GWSS",
    "number": "4004",
    "honors": false,
    "writing": false,
    "name": "Queering Desire",
    "fullname": "Queering Desire",
    "info": "Core perspectives of queer theory. Recent extensions and manifestations. ",
    "prereq": {}
  },
  {
    "uid": "797096",
    "code": "GWSS4102",
    "subject": "GWSS",
    "number": "4102",
    "honors": false,
    "writing": false,
    "name": "Women,Gender, & Sci",
    "fullname": "Women, Gender, and Science",
    "info": "Three intersecting themes analyzed from 1700s to the present:  women in science, sexual and gendered concepts in modern sciences, and impact of science on conceptions of sexuality and gender in society.",
    "prereq": {}
  },
  {
    "uid": "801709",
    "code": "GWSS4103",
    "subject": "GWSS",
    "number": "4103",
    "honors": false,
    "writing": false,
    "name": "Transnational Feminist Theorie",
    "fullname": "Transnational Feminist Theories",
    "info": "Western/non-Western feminist theories in conversation. Historical, cultural, political context. Relation of theory to activism.",
    "prereq": {}
  },
  {
    "uid": "818999",
    "code": "GWSS4107",
    "subject": "GWSS",
    "number": "4107",
    "honors": false,
    "writing": false,
    "name": "Feminist Methods",
    "fullname": "Feminist Methods",
    "info": "This course considers the relationship between theory and research in feminist studies. Students review and examine the key issues of feminist scholarship. Methods and methodologies are learned through developing a research proposal for the senior capstone.\n",
    "prereq": {}
  },
  {
    "uid": "008052",
    "code": "GWSS4108",
    "subject": "GWSS",
    "number": "4108",
    "honors": false,
    "writing": false,
    "name": "Senior Capstone: Writing",
    "fullname": "Senior Capstone: Writing",
    "info": "The GWSS 4108 is the capstone of a GWSS major’s education in GWSS and an opportunity for them to produce a thorough and significant research project. While the final version of the project can take several different forms, each one requires the student to do a deep examination of your topic. GWSS 4108 is a 3-credit class that allows students the opportunity to be surrounded by other GWSS majors as you work through their projects collaboratively. This class allows students to keep organized and on track with their projects, be a part of a writing and research community, and have their work read and critiqued by others so their end results are nuanced, polished pieces of writing and research.",
    "prereq": {}
  },
  {
    "uid": "007118",
    "code": "GWSS4109",
    "subject": "GWSS",
    "number": "4109",
    "honors": false,
    "writing": false,
    "name": "Field Learning",
    "fullname": "Field Learning",
    "info": "Projects that involve an internship or learning practicum.",
    "prereq": {}
  },
  {
    "uid": "796251",
    "code": "GWSS4122",
    "subject": "GWSS",
    "number": "4122",
    "honors": false,
    "writing": false,
    "name": "Philosophy & Feminist Theory",
    "fullname": "Philosophy and Feminist Theory",
    "info": "Encounters between philosophy/feminism. Gender's influence in traditional philosophical problems/methods. Social role of theorist/theorizing as they relate to politics of feminism. This course surveys central debates in feminist philosophy, with a focus on the methods and virtues of resistance. Along the way, we will consider the question of how we should live in an oppressive society. Topics may include intimidation, gaslighting, silencing, epistemic injustice, emotional labor, intersectionality, resistance, anger, and violence. \n\nprereq: 8 crs in [philosophy or women's studies] or instr consent",
    "prereq": {}
  },
  {
    "uid": "013404",
    "code": "GWSS4190",
    "subject": "GWSS",
    "number": "4190",
    "honors": false,
    "writing": false,
    "name": "Topics: Theory & Knowledge",
    "fullname": "Topics: Theory, Knowledge, and Power",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "007100",
    "code": "GWSS4201",
    "subject": "GWSS",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Older Woman",
    "fullname": "The Older Woman:  A Feminist Perspective",
    "info": "Myths and realities surrounding conceptualizations of older women in public, private, personal, social, sexual, professional, and \ncommunity interactions.\n\nprereq: 12 cr in WoSt or substantial work in psych or soc sci",
    "prereq": {}
  },
  {
    "uid": "817247",
    "code": "GWSS4204",
    "subject": "GWSS",
    "number": "4204",
    "honors": false,
    "writing": false,
    "name": "Sex, Love, & Disability",
    "fullname": "Sex, Love, & Disability",
    "info": "In America's cultural imagination, people with disabilities are figured either as childlike and asexual, or improperly hypersexual. For disabled people (or anyone perceived as disabled) this paradox has meant denial of sexual agency and gender expression, histories of forced sterilization and institutionalization, sociopolitical marginalization, and great risk of sexual violence (and even death). In this course, we'll examine this history to better understand our contemporary present. We'll analyze constructions of disability and sexuality as they are interwoven with gender, class, race, and citizenship. We will ask: What might it mean to desire disability? Is there a disability sexual culture? Do disabled people queer sex, or does sexuality queer disability? What is the relationship between GLBTQ and disability rights and liberation movements? Drawing from feminist, queer, and disability studies, we'll answer these questions (and more) by examining how the imagined able-bodymind structures our understanding of gender/sexuality, and how disability sexual cultures resist these norms. ",
    "prereq": {}
  },
  {
    "uid": "811063",
    "code": "GWSS4232",
    "subject": "GWSS",
    "number": "4232",
    "honors": false,
    "writing": false,
    "name": "Chicana Gender and Sexuality",
    "fullname": "Chicana/o - Latina/o Gender and Sexuality Studies",
    "info": "Critical thinking of Chicanas/os, Latinas/os around construction of gender. Politics of sexual identity. How self is gendered in relationship to sexual, racial, class, national identities under different social structural conditions. Way in which \"borders\" that define/confine sexual norms shift over time.",
    "prereq": {}
  },
  {
    "uid": "013412",
    "code": "GWSS4290",
    "subject": "GWSS",
    "number": "4290",
    "honors": false,
    "writing": false,
    "name": "Topics: Bio/ Hlth/ Environ",
    "fullname": "Topics:  Biology, Health, and Environmental Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "810072",
    "code": "GWSS4303W",
    "subject": "GWSS",
    "number": "4303",
    "honors": false,
    "writing": true,
    "name": "Writing Differences",
    "fullname": "Writing Differences: Literature by U.S. Women of Color",
    "info": "Interpret/analyze poetry, fiction, drama of U.S. women minority writers. Relationship of writer's history, ethnicity, race, class, gender to writings.",
    "prereq": {}
  },
  {
    "uid": "013414",
    "code": "GWSS4390",
    "subject": "GWSS",
    "number": "4390",
    "honors": false,
    "writing": false,
    "name": "Topics: Visual/ Cultural/ Lit",
    "fullname": "Topics: Visual, Cultural, and Literary Studies",
    "info": "Topics specified in Class Schedule.\n\nprereq: Sr or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "007129",
    "code": "GWSS4401",
    "subject": "GWSS",
    "number": "4401",
    "honors": false,
    "writing": false,
    "name": "Chicana/Latina CS",
    "fullname": "Chicana/Latina Cultural Studies",
    "info": "Readings in Chicana/Latina cultural studies. TV, film, art, music, dance, theatre, literature. Identity/sexuality. Production of culture/theory. ",
    "prereq": {}
  },
  {
    "uid": "007073",
    "code": "GWSS4402",
    "subject": "GWSS",
    "number": "4402",
    "honors": false,
    "writing": false,
    "name": "History of Western Feminisms",
    "fullname": "Rebels, Radicals, and Revolutionaries: History of Western Feminisms",
    "info": "Survey of main currents in history of western feminist thought, politics, and social movements from 1770s to present. ",
    "prereq": {}
  },
  {
    "uid": "013402",
    "code": "GWSS4403",
    "subject": "GWSS",
    "number": "4403",
    "honors": false,
    "writing": false,
    "name": "Queering Theory",
    "fullname": "Queering Theory",
    "info": "This course will give you a solid theoretical foundation in the field of queer studies in addition to explaining its relation to other scholarly traditions, including (but not limited to) feminist theory, GLBT studies, literary studies, psychoanalysis, and postmodernism. Over the course of the semester you will examine the historical forces that birthed queer politics and theory, become conversant in its conceptual basis, interrogate and analyze its various uses and applications, and finally apply it in your own arguments.  \n\nprereq: Any GWSS or GLBT course",
    "prereq": {}
  },
  {
    "uid": "799060",
    "code": "GWSS4404",
    "subject": "GWSS",
    "number": "4404",
    "honors": false,
    "writing": false,
    "name": "Gender, Nation & Latin Am Lit",
    "fullname": "Gender, Nation, and Literature in Latin America",
    "info": "Latin American literature/film concerning gendered nature of Latin American politics, society, and history. Texts by (mostly) women writers/filmmakers. Texts are in English but available in Spanish or Portuguese.\n\nprereq: [1001 or course on feminist theory], [jr or sr]",
    "prereq": {
      "and": [
        {
          "or": [
            "007068"
          ]
        }
      ]
    }
  },
  {
    "uid": "809361",
    "code": "GWSS4406",
    "subject": "GWSS",
    "number": "4406",
    "honors": false,
    "writing": false,
    "name": "Black Feminist Thought",
    "fullname": "Black Feminist Thought in the American and African Diasporas",
    "info": "Critically examine spatiality of African descendant women in Americas/larger black diaspora. Writings from black feminist/queer geographies, history, contemporary cultural criticism. Recent black feminist theorizing.",
    "prereq": {}
  },
  {
    "uid": "803457",
    "code": "GWSS4415",
    "subject": "GWSS",
    "number": "4415",
    "honors": false,
    "writing": false,
    "name": "Transnational Body Politics",
    "fullname": "Transnational Body Politics",
    "info": "Our bodies are always already modified. How we shape our bodies can express our deepest feelings about who we are. Body modification can also represent cultural and subcultural identifications or expectations based on gender, race, class, and sexuality. But what we do with our bodies is never separate from the politics of cultural difference and fluctuating ideas of what is acceptable or unacceptable, civilized or uncivilized. These ideas are historically and culturally specific. This course looks at body modification on a transnational scale to ask how we come to know what differentiates \"mutilation\" from \"correction.\" We ask how feminist, queer, and critical race theories illuminate these debates, reading across historical, anthropological, medical and literary texts. Weekly topics include gender, race and cosmetic surgery; skin whitening technologies; transnational gender reassignment; surgical tourism; female genital cutting; piercing, tattooing and scarification; the cultural politics of hair; and body modification in the context of transnational feminized labor.",
    "prereq": {}
  },
  {
    "uid": "013419",
    "code": "GWSS4490",
    "subject": "GWSS",
    "number": "4490",
    "honors": false,
    "writing": false,
    "name": "Topics:Politics/ Global Study",
    "fullname": "Topics:  Political Economy and Global Studies",
    "info": "Topics specified in Class Schedule.\n\nprereq: Sr or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "007114",
    "code": "GWSS4502",
    "subject": "GWSS",
    "number": "4502",
    "honors": false,
    "writing": false,
    "name": "Gender and Public Policy",
    "fullname": "Gender and Public Policy",
    "info": "Public policy issues, processes, and histories as these affect women-, children-, and gender-related issues.",
    "prereq": {}
  },
  {
    "uid": "007108",
    "code": "GWSS4504",
    "subject": "GWSS",
    "number": "4504",
    "honors": false,
    "writing": false,
    "name": "Women and  Legislative Process",
    "fullname": "Women and the Legislative Process",
    "info": "Current/historical roles, impacts, and interactions of women as legislators, constituents, and professional or citizen lobbyists in state/national legislatures. Unique contributions, issues, challenges of women. Ways in which gender is operative in legislative process.",
    "prereq": {}
  },
  {
    "uid": "007119",
    "code": "GWSS4505",
    "subject": "GWSS",
    "number": "4505",
    "honors": false,
    "writing": false,
    "name": "Legislative Internship",
    "fullname": "Legislative Internship",
    "info": "Discussion group and learning community for students working as interns for a Minnesota legislator during the year's legislative session.",
    "prereq": {}
  },
  {
    "uid": "013421",
    "code": "GWSS4590",
    "subject": "GWSS",
    "number": "4590",
    "honors": false,
    "writing": false,
    "name": "Topics: Change/Activism/Policy",
    "fullname": "Topics: Social Change, Activism, Law, and Policy Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "809010",
    "code": "GWSS4621W",
    "subject": "GWSS",
    "number": "4621",
    "honors": false,
    "writing": true,
    "name": "Rhet of Feminism",
    "fullname": "Rhetoric of Feminism",
    "info": "History/criticism of rhetoric of feminism from 19th century to present.",
    "prereq": {}
  },
  {
    "uid": "796132",
    "code": "GWSS4690",
    "subject": "GWSS",
    "number": "4690",
    "honors": false,
    "writing": false,
    "name": "Topics: US Women/Society/Race",
    "fullname": "Topics:  Women, Society, and Race in the United States",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "796133",
    "code": "GWSS4790",
    "subject": "GWSS",
    "number": "4790",
    "honors": false,
    "writing": false,
    "name": "Topics: Sexuality Studies",
    "fullname": "Topics: Sexuality Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "007089",
    "code": "GWSS4900W",
    "subject": "GWSS",
    "number": "4900",
    "honors": false,
    "writing": true,
    "name": "WoSt Seminar",
    "fullname": "Women's Studies Seminar",
    "info": "Includes a component on research methods/writing. Capstone experience. Culminates in a 20-25 page paper.",
    "prereq": {}
  },
  {
    "uid": "014393",
    "code": "GWSS4980",
    "subject": "GWSS",
    "number": "4980",
    "honors": false,
    "writing": false,
    "name": "Directed Instruction",
    "fullname": "Directed Instruction",
    "info": "Guided individual reading or study. ",
    "prereq": {}
  },
  {
    "uid": "014392",
    "code": "GWSS4993",
    "subject": "GWSS",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "TBD\n\nprereq: Filled out student/faculty contract, instr consent, dept consent, college consent",
    "prereq": {}
  },
  {
    "uid": "014394",
    "code": "GWSS4994",
    "subject": "GWSS",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Guided individual reading or study. ",
    "prereq": {}
  },
  {
    "uid": "009442",
    "code": "GWSS5101",
    "subject": "GWSS",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Fem Approaches to Ethnography",
    "fullname": "Feminist Approaches to Ethnography",
    "info": "Preparation for feminist ethnographic research in the social sciences. Using recent works by feminist ethnographers, focus is on the methods, politics, and ethics, as well as gender, race, class, and cross-cultural issues pertaining to fieldwork.",
    "prereq": {}
  },
  {
    "uid": "007080",
    "code": "GWSS5102",
    "subject": "GWSS",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Fem Apprch to Hist",
    "fullname": "Feminist Approaches to History",
    "info": "Analysis and practice of feminist history. Theories, methods, and sources that address the interrelationship of gender, race, class, and sexuality.\n\nprereq: 8 cr WoSt or grad or instr consent",
    "prereq": {}
  },
  {
    "uid": "007085",
    "code": "GWSS5103",
    "subject": "GWSS",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Feminist Pedagogies",
    "fullname": "Feminist Pedagogies",
    "info": "Theory and practice of feminist pedagogies by comparing and evaluating various multicultural feminist theories of education/teaching and the application of specific theories, techniques, and teaching strategies.\n\nprereq: grad or instr consent",
    "prereq": {}
  },
  {
    "uid": "795437",
    "code": "GWSS5104",
    "subject": "GWSS",
    "number": "5104",
    "honors": false,
    "writing": false,
    "name": "Transnational Feminist Theory",
    "fullname": "Transnational Feminist Theory",
    "info": "Third World and transnational feminisms. Interrogating the categories of \"women,\" \"feminism,\" and \"Third World.\"  Varieties of power/oppression that women have endured/resisted, including colonization, nationalism, globalization, and capitalism. Concentrates on postcolonial context.",
    "prereq": {}
  },
  {
    "uid": "007083",
    "code": "GWSS5105W",
    "subject": "GWSS",
    "number": "5105",
    "honors": false,
    "writing": true,
    "name": "Gen Rhet Sci/Tech",
    "fullname": "Gendered Rhetoric of Science and Technology",
    "info": "How cultural gender roles are affected by science and technology as well as influence scientific and technological thinking and communication strategies.\n",
    "prereq": {}
  },
  {
    "uid": "007093",
    "code": "GWSS5107",
    "subject": "GWSS",
    "number": "5107",
    "honors": false,
    "writing": false,
    "name": "Gender, Culture, and Science",
    "fullname": "Gender, Culture, and Science",
    "info": "Critical study of some of the major papers concerning the relations of gender and scientific inquiry produced in the past 20 years.",
    "prereq": {}
  },
  {
    "uid": "796252",
    "code": "GWSS5122",
    "subject": "GWSS",
    "number": "5122",
    "honors": false,
    "writing": false,
    "name": "Philosophy & Feminist Theory",
    "fullname": "Philosophy and Feminist Theory",
    "info": "Encounters between philosophy/feminism. Gender's influence in traditional philosophical problems/methods. Social role of theorist/theorizing as they relate to politics of feminism. This course surveys central debates in feminist philosophy, with a focus on the methods and virtues of resistance. Along the way, we will consider the question of how we should live in an oppressive society. Topics may include intimidation, gaslighting, silencing, epistemic injustice, emotional labor, intersectionality, resistance, anger, and violence. \n\nprereq: 8 crs in [philosophy or women's studies] or instr consent",
    "prereq": {}
  },
  {
    "uid": "007086",
    "code": "GWSS5190",
    "subject": "GWSS",
    "number": "5190",
    "honors": false,
    "writing": false,
    "name": "Topics: Theory & Knowledge",
    "fullname": "Topics: Theory, Knowledge, and Power",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "007094",
    "code": "GWSS5201",
    "subject": "GWSS",
    "number": "5201",
    "honors": false,
    "writing": false,
    "name": "Glob Pol Sexuality",
    "fullname": "Global Processes and the Politics of Sexuality",
    "info": "Comparative examination of the social construction of sexuality. Formal/informal norms/regulations, categories of deviance, representation of sex in the media/arts, role of sexuality in relation to agency/subjectivity.\n\nprereq: 12 cr WoSt or feminist studies grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "007098",
    "code": "GWSS5203",
    "subject": "GWSS",
    "number": "5203",
    "honors": false,
    "writing": false,
    "name": "Women and Madness",
    "fullname": "Women and Madness in History and Literature",
    "info": "The representation of madness and how it intersects with gender as well as class, race, sexual orientation, and nationality.  ",
    "prereq": {}
  },
  {
    "uid": "007103",
    "code": "GWSS5290",
    "subject": "GWSS",
    "number": "5290",
    "honors": false,
    "writing": false,
    "name": "Biology, Health, & Environment",
    "fullname": "Topics: Biology, Health, and Environmental Studies",
    "info": "Topics specified in class schedule.",
    "prereq": {}
  },
  {
    "uid": "016875",
    "code": "GWSS5300",
    "subject": "GWSS",
    "number": "5300",
    "honors": false,
    "writing": false,
    "name": "Communication and Gender",
    "fullname": "Communication and Gender",
    "info": "How gender affects verbal communication. Development of analytical skills through readings, exercises, research that raise awareness of the power of language and the influence of gender prescriptions.",
    "prereq": {}
  },
  {
    "uid": "007131",
    "code": "GWSS5390",
    "subject": "GWSS",
    "number": "5390",
    "honors": false,
    "writing": false,
    "name": "Topics: Visual/ Cultural/ Lit",
    "fullname": "Topics: Visual, Cultural, and Literary Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "008154",
    "code": "GWSS5403",
    "subject": "GWSS",
    "number": "5403",
    "honors": false,
    "writing": false,
    "name": "Chicana/Latina Feminisms",
    "fullname": "Chicana/Latina Feminisms",
    "info": "The historical and social development of Chicana and Latina feminisms in general and their various specific types.  ",
    "prereq": {}
  },
  {
    "uid": "007126",
    "code": "GWSS5404",
    "subject": "GWSS",
    "number": "5404",
    "honors": false,
    "writing": false,
    "name": "Working Class Women",
    "fullname": "Working Class Women's Cultures",
    "info": "Myths and realities surrounding working class women and their cultures.  Use sociological and literary material in an effort to learn about working class women and to hear their own voices.\n\nprereq: 12 cr WoSt or instr consent",
    "prereq": {}
  },
  {
    "uid": "015928",
    "code": "GWSS5405",
    "subject": "GWSS",
    "number": "5405",
    "honors": false,
    "writing": false,
    "name": "Chicanas: Women and Work",
    "fullname": "Chicanas: Women and Work",
    "info": "Chicanas, their various relationships to family/community. Local, national, and global work forces. Questions/issues related to growing integration of world.s systems of production.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "809367",
    "code": "GWSS5406",
    "subject": "GWSS",
    "number": "5406",
    "honors": false,
    "writing": false,
    "name": "Black Feminist Thought",
    "fullname": "Black Feminist Thought in the American and African Diasporas",
    "info": "Critically examines spatiality of African descendant women in Americas/larger black diaspora. Writings from black feminist/queer geographies, history, contemporary cultural criticism. Recent black feminist theorizing.",
    "prereq": {}
  },
  {
    "uid": "007112",
    "code": "GWSS5490",
    "subject": "GWSS",
    "number": "5490",
    "honors": false,
    "writing": false,
    "name": "Topics: Politics/ Global Study",
    "fullname": "Topics: Political Economy and Global Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "007113",
    "code": "GWSS5501",
    "subject": "GWSS",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Women and the Law",
    "fullname": "Women and the Law",
    "info": "Legal system as it relates to women: historical legal approach to issues related to constitutional rights of women.",
    "prereq": {}
  },
  {
    "uid": "816830",
    "code": "GWSS5502",
    "subject": "GWSS",
    "number": "5502",
    "honors": false,
    "writing": false,
    "name": "Gender and Public Policy",
    "fullname": "Gender and Public Policy",
    "info": "Public policy issues, processes, and histories as these affect women-, children-, and gender-related issues.",
    "prereq": {}
  },
  {
    "uid": "803161",
    "code": "GWSS5503",
    "subject": "GWSS",
    "number": "5503",
    "honors": false,
    "writing": false,
    "name": "Queering Theory",
    "fullname": "Queering Theory",
    "info": "This course will give you a solid theoretical foundation in the field of queer studies in addition to explaining its relation to other scholarly traditions, including (but not limited to) feminist theory, GLBT studies, literary studies, psychoanalysis, and postmodernism. Over the course of the semester you will examine the historical forces that birthed queer politics and theory, become conversant in its conceptual basis, interrogate and analyze its various uses and applications, and finally apply it in your own arguments.  \n\nprereq: Any GWSS or GLBT course",
    "prereq": {}
  },
  {
    "uid": "007115",
    "code": "GWSS5590",
    "subject": "GWSS",
    "number": "5590",
    "honors": false,
    "writing": false,
    "name": "Topics: Change/Activism/Policy",
    "fullname": "Topics: Social Change, Activism, Law, and Policy Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "796134",
    "code": "GWSS5690",
    "subject": "GWSS",
    "number": "5690",
    "honors": false,
    "writing": false,
    "name": "Topics: US Women/Society/Race",
    "fullname": "Topics: Women, Society, and Race in the United States",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "796135",
    "code": "GWSS5790",
    "subject": "GWSS",
    "number": "5790",
    "honors": false,
    "writing": false,
    "name": "Topics: Sexuality Studies",
    "fullname": "Topics: Sexuality Studies",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "010397",
    "code": "GWSS5993",
    "subject": "GWSS",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": " TBD",
    "prereq": {}
  },
  {
    "uid": "014395",
    "code": "GWSS5994",
    "subject": "GWSS",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Dir Instruction",
    "fullname": "Directed Instruction",
    "info": "TBD",
    "prereq": {}
  },
  {
    "uid": "014396",
    "code": "GWSS5995",
    "subject": "GWSS",
    "number": "5995",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "TBD",
    "prereq": {}
  },
  {
    "uid": "008159",
    "code": "GWSS8101",
    "subject": "GWSS",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "Intell Hist Feminis",
    "fullname": "Intellectual History of Feminism",
    "info": "Major trends in feminist intellectual history from 14th century to the present, especially in the United States and Europe.",
    "prereq": {}
  },
  {
    "uid": "013405",
    "code": "GWSS8102",
    "subject": "GWSS",
    "number": "8102",
    "honors": false,
    "writing": false,
    "name": "AdvStudiesSexuality",
    "fullname": "Advanced Studies in Sexuality",
    "info": "Contemporary theoretical scholarship/research on selected issues related to sexuality, gender, and the body.\n\nprereq: Priority given to feminist studies grad students",
    "prereq": {}
  },
  {
    "uid": "007090",
    "code": "GWSS8103",
    "subject": "GWSS",
    "number": "8103",
    "honors": false,
    "writing": false,
    "name": "Femin Thry of Knowl",
    "fullname": "Feminist Theories of Knowledge",
    "info": "Interdisciplinary seminar. Feminist approaches to knowledge and to criticism of paradigms of knowledge operative in the disciplines. Feminist use of concepts of subjectivity, objectivity, and intersubjectivity. Feminist empiricism, standpoint theory, and contextualism. Postmodern and postcolonial theorizing.",
    "prereq": {}
  },
  {
    "uid": "809316",
    "code": "GWSS8107",
    "subject": "GWSS",
    "number": "8107",
    "honors": false,
    "writing": false,
    "name": "Fem Pedagogies",
    "fullname": "Feminist Pedagogies",
    "info": "Explore feminist theories/critical approaches to pedagogy. Develop teaching philosophy statement, design syllabus, practice teach/learn problem-solving strategies for classroom.\n\nprereq: Feminist Studies grad student [Maj or Minor] or instr consent",
    "prereq": {}
  },
  {
    "uid": "008157",
    "code": "GWSS8108",
    "subject": "GWSS",
    "number": "8108",
    "honors": false,
    "writing": false,
    "name": "Genealogies of Feminist Theory",
    "fullname": "Genealogies of Feminist Theory",
    "info": "Two-semester seminar. First term: debates in gender theory; intersections of gender theory with critical race theory, post-colonial theory, sexuality theory; social class analysis. Second term: inter-/multi-disciplinary feminist research methodologies from humanities/social sciences.\n\nprereq: The course is open to non-GWSS majors and minors (one semester only). The course is one of the 4 required courses for GWSS majors.",
    "prereq": {}
  },
  {
    "uid": "008158",
    "code": "GWSS8109",
    "subject": "GWSS",
    "number": "8109",
    "honors": false,
    "writing": false,
    "name": "Fem Know Product",
    "fullname": "Feminist Knowledge Production",
    "info": "Two-semester interdisciplinary seminar. First term: debates in gender theory; gender theory, critical race theory, post-colonial theory, sexuality theory, social class analysis. Second term: inter-/multi-disciplinary feminist research methods from humanities/social sciences.\n\nprereq: Feminist studies PhD or grad minor student or instr consent",
    "prereq": {}
  },
  {
    "uid": "825235",
    "code": "GWSS8111",
    "subject": "GWSS",
    "number": "8111",
    "honors": false,
    "writing": false,
    "name": "Transnational Feminist Theory",
    "fullname": "Transnational Feminist Theories",
    "info": "This course takes a transnational feminist approach to studies of gender, sexuality, and feminist theories, methods, & praxis in order to highlight linkages and relations of power between sociocultural, political, economic, and affective structures that construct gender and sexuality in different locations acorss geopolitical contexts. By interrogating naturalized categories such as “women,” “feminism,” and “queer,” students learn to think beyond the binaries of “Third world/ First world,” “West/East,” “native/diasporic,” “citizen/non-citizen,” “U.S./transnational,” and “North/South.” The course gives the students the necessary background in transnational feminist theories and methods and helps them develop relational and decolonial approaches that highlight temporal and spatial connectivities between past and present discourses and practices of settler colonialism, slavery, colonialism, nationalism, racism, imperialism, global capitalism, and neoliberalism.\n",
    "prereq": {}
  },
  {
    "uid": "007092",
    "code": "GWSS8201",
    "subject": "GWSS",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Thy & Mtd Soc Sci",
    "fullname": "Feminist Theory and Methods in the Social Sciences",
    "info": "Seminar on recent theories, including feminist versions of positivist, interpretivist, critical theoretical, and postmodernist models of social science knowledge. Methodologies congenial to feminist practices of inquiry, including use of narrative in theory, feminist ethnography, discourse analysis, and comparative methods in history. ",
    "prereq": {}
  },
  {
    "uid": "010563",
    "code": "GWSS8210",
    "subject": "GWSS",
    "number": "8210",
    "honors": false,
    "writing": false,
    "name": "Sem: Feminist Theory & Praxis",
    "fullname": "Seminar: Feminist Theory & Praxis",
    "info": "Topics in feminist theory.",
    "prereq": {}
  },
  {
    "uid": "013413",
    "code": "GWSS8220",
    "subject": "GWSS",
    "number": "8220",
    "honors": false,
    "writing": false,
    "name": "Seminar: Sci, Tech & Env Just",
    "fullname": "Seminar: Science, Technology & Environmental Justice",
    "info": "Topics related to science, technology, environmental justice.",
    "prereq": {}
  },
  {
    "uid": "013415",
    "code": "GWSS8230",
    "subject": "GWSS",
    "number": "8230",
    "honors": false,
    "writing": false,
    "name": "Sem: Cult Critis & Media",
    "fullname": "Seminar: Cultural Criticism and Media Studies",
    "info": "Topics in literature, film, art.",
    "prereq": {}
  },
  {
    "uid": "013423",
    "code": "GWSS8250",
    "subject": "GWSS",
    "number": "8250",
    "honors": false,
    "writing": false,
    "name": "Sem: Nation, State, Citizen",
    "fullname": "Seminar: Nation, State, and Citizenship",
    "info": "Topics related to nation, state, citizenship.",
    "prereq": {}
  },
  {
    "uid": "810085",
    "code": "GWSS8260",
    "subject": "GWSS",
    "number": "8260",
    "honors": false,
    "writing": false,
    "name": "Sem: Race, Represent & Resist",
    "fullname": "Seminar: Race, Representation and Resistance",
    "info": "Race, racialization, racial justice as related to representation/struggles for social/economic justice. Intersectional analysis of power, politics, ideology/identity. Queer of color critique, women of color feminisms, critical sex/body positive approaches.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "811511",
    "code": "GWSS8270",
    "subject": "GWSS",
    "number": "8270",
    "honors": false,
    "writing": false,
    "name": "Seminar: Theories of Body",
    "fullname": "Seminar: Theories of Body",
    "info": "How body is configured in many social arenas. Legal decisions, public policy, medical research, cultural customs. Examine how attitudes toward male/female bodies influence social myths/discourses about social policy/change.",
    "prereq": {}
  },
  {
    "uid": "007091",
    "code": "GWSS8301",
    "subject": "GWSS",
    "number": "8301",
    "honors": false,
    "writing": false,
    "name": "Feminist Lit Critic",
    "fullname": "Feminist Literary Criticism",
    "info": "Recent developments and major issues in feminist studies of literature. Introduction to array of scholars and scholarship in field of feminist literary theory and criticism, emphasizing broad range of feminist textual analysis taking place in various University departments.\n",
    "prereq": {}
  },
  {
    "uid": "788289",
    "code": "GWSS8333",
    "subject": "GWSS",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "009445",
    "code": "GWSS8401",
    "subject": "GWSS",
    "number": "8401",
    "honors": false,
    "writing": false,
    "name": "Gender, Space, Resi",
    "fullname": "Gender, Space, and Resistance",
    "info": "Identity politics, social movements, and development politics; complex interrelationships among gender, space, and resistance. Social nature of place and space; sociopolitical and economic processes by which gendered, raced, and classed differences are constituted, reinforced, and resisted in and through space, place, and social networks.  ",
    "prereq": {}
  },
  {
    "uid": "788425",
    "code": "GWSS8444",
    "subject": "GWSS",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "013420",
    "code": "GWSS8490",
    "subject": "GWSS",
    "number": "8490",
    "honors": false,
    "writing": false,
    "name": "Seminar: Trans/Postcol/Diaspor",
    "fullname": "Seminar: Transnational, Postcolonial, Diaspora",
    "info": "Graduate topics in comparative/global studies. ",
    "prereq": {}
  },
  {
    "uid": "788545",
    "code": "GWSS8666",
    "subject": "GWSS",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "787947",
    "code": "GWSS8888",
    "subject": "GWSS",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "010396",
    "code": "GWSS8993",
    "subject": "GWSS",
    "number": "8993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "TBD",
    "prereq": {}
  },
  {
    "uid": "014397",
    "code": "GWSS8994",
    "subject": "GWSS",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Dir Instruction",
    "fullname": "Directed Instruction",
    "info": "TBD",
    "prereq": {}
  },
  {
    "uid": "014398",
    "code": "GWSS8995",
    "subject": "GWSS",
    "number": "8995",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "TBD",
    "prereq": {}
  },
  {
    "uid": "014400",
    "code": "GWSS8996",
    "subject": "GWSS",
    "number": "8996",
    "honors": false,
    "writing": false,
    "name": "Feminist Studies Colloquium",
    "fullname": "Feminist Studies Colloquium",
    "info": "TBD\n\nprereq: Grad major or minor in feminist studies",
    "prereq": {}
  },
  {
    "uid": "790402",
    "code": "GWSS8997",
    "subject": "GWSS",
    "number": "8997",
    "honors": false,
    "writing": false,
    "name": "Dissertation Seminar",
    "fullname": "Dissertation Seminar",
    "info": "Conceptualizing the research problem for the dissertation and structuring the process of writing a chapter of it.\n\nprereq: GWSS or AMST doctoral student beginning dissertation work\n\n",
    "prereq": {}
  },
  {
    "uid": "805600",
    "code": "GWSS8998",
    "subject": "GWSS",
    "number": "8998",
    "honors": false,
    "writing": false,
    "name": "Professional Development",
    "fullname": "Professional Development",
    "info": "Workshop addressing one of a variety of professional development issues including, but not limited to, grant writing, book reviewing, revising term papers for publication, course development, writing and presenting conference papers, preparing to enter the job market (writing a c.v./application letter, preparing for interviews, job talk). \nPrereq Grad student.",
    "prereq": {}
  }
]