[
  {
    "uid": "007885",
    "code": "HORT1001",
    "subject": "HORT",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Plant Propagation",
    "fullname": "Plant Propagation",
    "info": "Principles and techniques of propagating plants by seeds, cuttings, grafts, buds, layers, and division. Lectures on principles; labs on practice of various propagating techniques.",
    "prereq": {}
  },
  {
    "uid": "013986",
    "code": "HORT1002",
    "subject": "HORT",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Home Horticulture",
    "fullname": "Home Horticulture",
    "info": "Fundamental concepts of plant identification, growth, and culture with practical applications to home landscape, floral design, house plants, fruit, flower, and vegetable gardening.",
    "prereq": {}
  },
  {
    "uid": "016095",
    "code": "HORT1003",
    "subject": "HORT",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "Organic Gardening",
    "fullname": "Organic Gardening: From Balconies to Backyards",
    "info": "This fully online course focuses on the principles and practices of growing fruits, vegetables, and herbs with an ecological approach. You'll explore basic botany, soils and compost, species and variety selection, planning and design, container gardening, pest management, season extension, and more so you can approach your gardening projects with confidence.\n\nWe will begin by taking a look at the fundamentals of organic gardening, then move onto an overview of basic plant science principles. Following this introduction, course content will focus on how these principles can be applied practically in the planning and management of an organic garden, whether that be in your yard, on your patio, or at a school or community site. \n\nThis course isn’t so much about memorizing facts as it is about you becoming a well-informed gardener who can make educated decisions and seek out reliable answers to questions or problems that might come up. \n\nThe course is presented entirely online and makes extensive use of discussions, interactive activities, worksheets, and multimedia projects that get you immersed in a host of gardening topics. Short video segments in each module highlight key topics and provide information to guide you as you work through the readings, activities, and assignments.",
    "prereq": {}
  },
  {
    "uid": "796109",
    "code": "HORT1004",
    "subject": "HORT",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Build Hort Learn Community",
    "fullname": "Building Your Horticulture Learning Community",
    "info": "How to use personal, departmental, college, and University resources to increase learning. Building collegial relationships with other incoming students to form a \"student learning community\" that will support personal/professional growth.",
    "prereq": {}
  },
  {
    "uid": "006927",
    "code": "HORT1011",
    "subject": "HORT",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Herbaceous Landscape Plants",
    "fullname": "Herbaceous Landscape Plants",
    "info": "Taxonomy, identification, ecology, and landscape uses of annuals, perennials, wildflowers, ferns, tender/hardy bulbs, and tropicals/sub-tropicals used in interior landscapes.",
    "prereq": {}
  },
  {
    "uid": "007012",
    "code": "HORT1012",
    "subject": "HORT",
    "number": "1012",
    "honors": false,
    "writing": false,
    "name": "Woody Landscape Plants",
    "fullname": "Woody Landscape Plants",
    "info": "Taxonomy, identification, ecology, and landscape uses of trees, shrubs, vines, groundcovers, and evergreens. Lecture and lab.",
    "prereq": {}
  },
  {
    "uid": "007737",
    "code": "HORT1013",
    "subject": "HORT",
    "number": "1013",
    "honors": false,
    "writing": false,
    "name": "Floral Design",
    "fullname": "Floral Design",
    "info": "Design for use in commercial flower shops and at home. Principles and elements of design. Wedding arrangements. Corsages. Decorative use of dried materials.",
    "prereq": {}
  },
  {
    "uid": "007772",
    "code": "HORT1014",
    "subject": "HORT",
    "number": "1014",
    "honors": false,
    "writing": false,
    "name": "Our Edible Landscapes",
    "fullname": "Our Edible Landscapes",
    "info": "This asynchronous online course explores how technology, society, and culture influence the selection, cultivation, and consumption of food plants. We will examine how these factors interact to shape the landscapes that sustain us. ",
    "prereq": {}
  },
  {
    "uid": "796837",
    "code": "HORT1015",
    "subject": "HORT",
    "number": "1015",
    "honors": false,
    "writing": false,
    "name": "Plant Families Plant People",
    "fullname": "Plant Families for Plant People",
    "info": "The most recent surveys reveal there are 347,298 vascular plant species in the world! During this course, you will acquire the skills that will allow you to identify many plants you encounter day-to-day in Minnesota and around the world. By the end of the term, you will have been introduced to over 150 woody and herbaceous plants and learned the key distinguishing features for identifying some of the most important ones. You will be introduced to plant families that are important from a human perspective, where in the world they are most commonly found, some of the problems they can experience or create, and some of the ways they are used by humans.",
    "prereq": {}
  },
  {
    "uid": "794871",
    "code": "HORT1031",
    "subject": "HORT",
    "number": "1031",
    "honors": false,
    "writing": false,
    "name": "Vines and Wines",
    "fullname": "Vines and Wines:  Introduction to Viticulture and Enology",
    "info": "This course is an introduction to the principles of growing grapes (viticulture), making wine (enology), and an appreciation of the historical, geographical, and sensory diversity of wine. The course is taught in part with 20-50 minute online lectures; usually 2 or 3 of these are covered each week. The class also meets once a week for a combination lecture and wine tasting/sensory session. Guest lecturers will be involved to explore certain aspects of the course including grape vine biology, morphology, genetics and breeding, as well as sensory evaluation and wine components, and the subject of soils and so-call “terroir” or regional identity, including the relation between grape cultivar, soil, climate, and cultural practices. Prerequisite: Enrollees must be 21 yrs of age by date of 1st class meeting Enrollment Restrictions: Open enrollment to undergraduate students ONLY; graduate students, masters students, and others will need instructor permission.",
    "prereq": {}
  },
  {
    "uid": "801946",
    "code": "HORT1061",
    "subject": "HORT",
    "number": "1061",
    "honors": false,
    "writing": false,
    "name": "The Sustainable Lawn",
    "fullname": "The Sustainable Lawn",
    "info": "Common turfgrasses. How to manage home lawn in sustainable way. Maintaining quality turf areas with reduced inputs.",
    "prereq": {}
  },
  {
    "uid": "806979",
    "code": "HORT1090",
    "subject": "HORT",
    "number": "1090",
    "honors": false,
    "writing": false,
    "name": "Topics In Horticulture",
    "fullname": "Topics In Horticulture",
    "info": "Topics vary with instructor. \n\nprereq: instr consent or department permission",
    "prereq": {}
  },
  {
    "uid": "819056",
    "code": "HORT1113",
    "subject": "HORT",
    "number": "1113",
    "honors": false,
    "writing": false,
    "name": "Floral Design",
    "fullname": "Floral Design",
    "info": "Design for use in commercial flower shops and at home. Principles and elements of design. Wedding arrangements. Corsages. Decorative use of dried materials.",
    "prereq": {}
  },
  {
    "uid": "808035",
    "code": "HORT1901",
    "subject": "HORT",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "The Ten Plants that Changed MN",
    "fullname": "The Ten Plants that Changed Minnesota",
    "info": "This course will focus on the impact of the ten plants that have made the most difference in Minnesota. These plants changed the history of the state and had a major impact on the economy, culture, health, food, arts, and the environment. The weekly class will include student-led environmental discussions, guest lectures, and independent and small-group research that will result in written communications and website information especially related to the ten plants and their environmental impact in Minnesota. Students will be provided with transportation for four or five classes from the Minneapolis campus to the Arboretum, which will leave at approximately 5:00 p.m. from the Minneapolis Student Center. A portion of the class at the Arboretum will be learning about the Arboretum and its role in public education and the university.",
    "prereq": {}
  },
  {
    "uid": "817902",
    "code": "HORT1902",
    "subject": "HORT",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Buzz: How Plants Enrich Lives",
    "fullname": "Buzz: How Plants Enrich Our Lives",
    "info": "In this course we will use Tom Standage's book, The History of the\nWorld in Six Glasses, to think about how plants play a pivotal role in human history, past and current. We will highlight how plants make substances such as caffeine, and the impact those compounds have had on human civilization. Coursework will include assigned readings, discovery of new information shared with the class through written reviews and oral summaries, and student-led discussions.",
    "prereq": {}
  },
  {
    "uid": "803331",
    "code": "HORT1905",
    "subject": "HORT",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "800612",
    "code": "HORT1906W",
    "subject": "HORT",
    "number": "1906",
    "honors": false,
    "writing": true,
    "name": "Freshmen Seminar",
    "fullname": "Freshmen Seminar",
    "info": "Current issues in plant science.",
    "prereq": {}
  },
  {
    "uid": "806020",
    "code": "HORT1942",
    "subject": "HORT",
    "number": "1942",
    "honors": false,
    "writing": false,
    "name": "The American Lawn",
    "fullname": "The American Lawn",
    "info": "This course will examine the American lawn in terms of its history, impact on society and the environment, and future. We will examine both the environmental and economic impact of lawns. We will also discuss several technologies related to the lawn and how they affect society. Some of the topics we will cover include low-input lawns, pesticide fate, nutrient run-off, genetically modified lawn grasses, and mowing technology. Students will explore these topics through field trips, readings, class discussions, and interactions with people working in areas related to the American lawn. Writing and in-class presentations will give students opportunities to improve critical communication skills. Students will be exposed to important technologies, learn about the science behind the technologies, and discuss how these technologies can impact society.",
    "prereq": {}
  },
  {
    "uid": "803572",
    "code": "HORT2031",
    "subject": "HORT",
    "number": "2031",
    "honors": false,
    "writing": false,
    "name": "Organic Horticulture",
    "fullname": "Organic Horticulture and Sustainable Food Systems",
    "info": "Basics of organic food. Growing small-scale organic fruits/vegetables. National Organic Program, importance of organic certification. Role of organics in food security and potential to feed world. Lecture, class discussion, guest speakers and field trips.",
    "prereq": {}
  },
  {
    "uid": "801927",
    "code": "HORT2121",
    "subject": "HORT",
    "number": "2121",
    "honors": false,
    "writing": false,
    "name": "Agricultural Biochemistry",
    "fullname": "Agricultural Biochemistry",
    "info": "Chemical/biochemical foundation for agricultural disciplines. Concepts in organic, analytical, and biological chemistry. Chemistry, metabolism, and development of plants. \n\nPrerequisites: [CHEM 1015, CHEM 1017] or [CHEM 1061, CHEM 1065] *Note for those students considering graduate school - We highly recommend you consult your academic advisor for appropriate chemistry coursework.",
    "prereq": {}
  },
  {
    "uid": "800012",
    "code": "HORT3000",
    "subject": "HORT",
    "number": "3000",
    "honors": false,
    "writing": false,
    "name": "Hort Global Seminar",
    "fullname": "Horticulture Global Seminar",
    "info": "Three-week travel course. In-depth study of particular topic in horticulture in a foreign country. Lectures and field trips for 15 days, with weekends free.",
    "prereq": {}
  },
  {
    "uid": "818686",
    "code": "HORT3001",
    "subject": "HORT",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Food Justice in Twin Cities",
    "fullname": "Food Justice in the Twin Cities",
    "info": "This course is for Accepted Markhart Scholars ONLY. If you aren't a Markhart Scholar, you cannot enroll in this course. Community Engaged Learning in Horticulture is a community-engagement-based course designed to allow students to create significant connections within the community while seeking out efficient, new ways to address food justice within the thread of food systems and horticulture. Students will work one-on-one with community members and the instructor to identify areas of potential improvement in food system justice, creating a final project with real-world applicability.",
    "prereq": {}
  },
  {
    "uid": "007621",
    "code": "HORT3002W",
    "subject": "HORT",
    "number": "3002",
    "honors": false,
    "writing": true,
    "name": "Greenhouse Management",
    "fullname": "Greenhouse Management",
    "info": "Worldwide floricultural production. Selection of greenhouse site, construction, heating, and cooling. Greenhouse cost accounting/analysis. Root media, sanitation, water, fertilization, chemical growth regulation, temperature, light, and marketing. Lab in greenhouse operations, field trips.",
    "prereq": {}
  },
  {
    "uid": "016091",
    "code": "HORT3018",
    "subject": "HORT",
    "number": "3018",
    "honors": false,
    "writing": false,
    "name": "Landscape Operations",
    "fullname": "Landscape Operations",
    "info": "Demonstration/hands-on experience with landscape operations.  Planting, mulching, staking, pruning, fertilizing, large tree care, seeding, sodding, aerifying, calibrating, irrigating, surveying.  Discussion/laboratory.  Team taught by faculty, staff, and industry professionals.",
    "prereq": {}
  },
  {
    "uid": "007717",
    "code": "HORT3090",
    "subject": "HORT",
    "number": "3090",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Approved field, lab, or greenhouse experiences in application of horticultural information/practices.\n\nprereq: Nonfr, instr consent",
    "prereq": {}
  },
  {
    "uid": "819519",
    "code": "HORT3093",
    "subject": "HORT",
    "number": "3093",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; e.g., literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide online directed study contract process in order to enroll.\n \nInstructor consent required. No more than 6 credits of directed study counts towards CFANS major requirements.\n",
    "prereq": {}
  },
  {
    "uid": "819520",
    "code": "HORT3094",
    "subject": "HORT",
    "number": "3094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries out a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use the University-wide online directed research contract process in order to enroll.\n \nInstructor consent required. No more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "801460",
    "code": "HORT3131",
    "subject": "HORT",
    "number": "3131",
    "honors": false,
    "writing": false,
    "name": "Organic Farm Plan, Grow, Mkt",
    "fullname": "Student Organic Farm Planning, Growing, and Marketing",
    "info": "Organic fruit and vegetable production has been one of the fastest growing segments of the US economy for almost two decades, stimulating an overwhelming number of biological and ecological innovations to produce food using organic approaches. This course aims to increase student's knowledge of ecological concepts as applied to managing organic systems, with an emphasis on soil nutrient cycles and plant-soil-microbe interactions that serve as the cornerstone of organic systems. Students in this course will learn tools needed to manage an organic diversified vegetable operation. The course consists of two components. The lecture session is designed to help students think about concepts and principles that are useful in planning and managing production strategies on organic farms. We spend a significant amount of our time reviewing soil nutrient cycling and its critical importance for organic farms, including how to effectively use soil and organic nutrient inputs such as cover crops, manure and fertilizers, to provide vegetable crops with the nutrients they need to grow. We also learn about successful marketing strategies for organic produce. Finally, near the end of the semester we will discuss pest management, including both weeds and disease/insect pests, and compare different tillage options available to organic producers. What we learn is then applied to planning next year's season of the UMN student organic farm. Throughout, we will use case studies, guest speakers, games, and active learning discussion approaches to move these classroom sessions \"beyond the lecture\" and allow students to engage with the material in a meaningful way. The lab is designed to allow a space to put into action some of the concepts students learn in lecture, including soil organic matter analysis, microgreen propagation, calculation of organic fertilizer rates, and operation of driven and walk-behind tractors.\n\nprereq: Agro 1101 or 1103 or Biol 1001 or 1009 or Hort 1001",
    "prereq": {
      "or": [
        "007688",
        "007579",
        "005419",
        "005416",
        "007885"
      ]
    }
  },
  {
    "uid": "808163",
    "code": "HORT3480",
    "subject": "HORT",
    "number": "3480",
    "honors": false,
    "writing": false,
    "name": "Topics in Sust Horticulture",
    "fullname": "Topics in Sustainable Horticulture",
    "info": "Various topics",
    "prereq": {}
  },
  {
    "uid": "796893",
    "code": "HORT4000",
    "subject": "HORT",
    "number": "4000",
    "honors": false,
    "writing": false,
    "name": "International Exp Hort Sci",
    "fullname": "International Experiences in Horticultural Science",
    "info": "Perspectives in horticultural science/cultural diversity through various international settings. Preparation for international study tour of one to three weeks.",
    "prereq": {}
  },
  {
    "uid": "818982",
    "code": "HORT4011",
    "subject": "HORT",
    "number": "4011",
    "honors": false,
    "writing": false,
    "name": "Common Medicinal Plants",
    "fullname": "Common Medicinal Plants: Classification, Identification and Application",
    "info": "Medicine and food share the same origin. There is a significantly increasing use of herbs in cooking as people keep seeking diverse food sources for health benefits. Accordingly, the number of herbal farms has been kept raising in the past decades, in which highly demanded herbs are grown as specialty crops. More and more herbs are distributed through grocery stores; many of the herbs, however, are still collected from the wild, which lead to medical cases involving in herb adulteration, contamination, or just simple misidentification. The goal of this course is to provide information of classifying, identifying and applying Herbs and herbal products for human health. This course focuses on the classification and identification of approximately 120 common medicinal plants, which covers 20 key medicinal plant families. With over 50 dry herbal samples being distributed to the class, participants of the class have the opportunity to learn essential skills of identifying and practicing fresh herbs and the processed herbal products. The information of herbal names (English, Chinese, scientific, and pharmaceutical names), morphology, properties (flavors), therapeutic actions, dosages, chemical components and cautions is provided for each herb. In addition, the knowledge of traditional Chinese medicine and herb uses, systems and methods for Chinese herbal classification, identification will also be introduced. Together, this course is set to provide useful information to students who study plant science, agriculture, pharmacy, and food systems.",
    "prereq": {}
  },
  {
    "uid": "796854",
    "code": "HORT4015",
    "subject": "HORT",
    "number": "4015",
    "honors": false,
    "writing": false,
    "name": "Adv Woody & Herb Plant Topics",
    "fullname": "Advanced Woody and Herbaceous Plant Topics",
    "info": "Species, cultivars, identification, and use for each genus of one group of plants.",
    "prereq": {}
  },
  {
    "uid": "007158",
    "code": "HORT4021",
    "subject": "HORT",
    "number": "4021",
    "honors": false,
    "writing": false,
    "name": "Landscape Design and Implem I",
    "fullname": "Landscape Design and Implementation I",
    "info": "Sustainability in all phases of landscape development. Lab includes design, implementation, and management of actual landscape.",
    "prereq": {}
  },
  {
    "uid": "797571",
    "code": "HORT4022",
    "subject": "HORT",
    "number": "4022",
    "honors": false,
    "writing": false,
    "name": "CAD for Landscapes",
    "fullname": "Applications in Computer-aided Design for Landsapes",
    "info": "Computer-aided design, related software programs for developing landscape design solutions. Real-life applications. Students produce base plans, concept, draft designs, and completed landscape design.",
    "prereq": {}
  },
  {
    "uid": "800594",
    "code": "HORT4023",
    "subject": "HORT",
    "number": "4023",
    "honors": false,
    "writing": false,
    "name": "Land Design & Implem II",
    "fullname": "Landscape Design and Implementation II",
    "info": "Residential, commercial, and recreational sites.   Architectural/graphic techniques, plan drawings, sections elevations, perspectives, working drawings. Grading. Site manipulation, including surveying, irrigation, and drainage.  Development of business/grounds management plans. Landscape estimating/bidding.",
    "prereq": {}
  },
  {
    "uid": "007006",
    "code": "HORT4051",
    "subject": "HORT",
    "number": "4051",
    "honors": false,
    "writing": false,
    "name": "Potted Plant Production",
    "fullname": "Potted Plant Production",
    "info": "Problem-solving and management practices for propagation, production, and use of floral crops. Emphasizes potted plants, hydroponics. Growing, marketing, and using floral crops to modify the environment. Lecture, lab, field trips.",
    "prereq": {}
  },
  {
    "uid": "007989",
    "code": "HORT4061W",
    "subject": "HORT",
    "number": "4061",
    "honors": false,
    "writing": true,
    "name": "Turfgrass Management",
    "fullname": "Turfgrass Management",
    "info": "Biology of turfgrasses, ecology of landscape systems. Installation, management, and culture of turfgrass communities and landscape plant systems. Sod production, industrial grounds, lawn care, park/recreation areas, athletic field/business management. Case studies.\n\nprereq: 1001 or instr consent",
    "prereq": {
      "or": [
        "007885"
      ]
    }
  },
  {
    "uid": "797572",
    "code": "HORT4062",
    "subject": "HORT",
    "number": "4062",
    "honors": false,
    "writing": false,
    "name": "Turfgrass Weed & Disease Sci",
    "fullname": "Turfgrass Weed and Disease Science",
    "info": "Turfgrass weed/disease problems. How to deal with these problems using an integrated approach. Biology, identifying features, and management strategies for several turfgrass diseases/weeds. How to apply IPM principles to turfgrass weed/disease problems.",
    "prereq": {}
  },
  {
    "uid": "800604",
    "code": "HORT4063",
    "subject": "HORT",
    "number": "4063",
    "honors": false,
    "writing": false,
    "name": "Turfgrass Science",
    "fullname": "Turfgrass Science",
    "info": "Ecology, physiology, and theory of turf population dynamics. Specialized management situations such as golf course, commercial sod production, and fine turf athletic settings.\n\nprereq: 4061",
    "prereq": {
      "and": [
        "007989"
      ]
    }
  },
  {
    "uid": "007339",
    "code": "HORT4071W",
    "subject": "HORT",
    "number": "4071",
    "honors": false,
    "writing": true,
    "name": "Biotech appl to Plant Improvmn",
    "fullname": "Applications of Biotechnology to Plant Improvement",
    "info": "This online course with required synchronous meetings is designed to provide a foundation in the theory and application of plant biotechnology used in crop improvement. The online lecture meets twice per week to introduce and discuss the basic concepts of plant genetics, molecular biology, DNA manipulation, plant tissue culture, gene introduction, and analysis of gene expression. The diversity of perspectives surrounding the application of biotechnology to plant improvement will be discussed. Course content consists of lecture, reading assignments, practice writing, peer review, discussions, and group work. \n\nprereq: [Biol 1009 or equiv or grad student], instr consent",
    "prereq": {
      "or": [
        "005416"
      ]
    }
  },
  {
    "uid": "007677",
    "code": "HORT4072",
    "subject": "HORT",
    "number": "4072",
    "honors": false,
    "writing": false,
    "name": "Growing Plants Organically",
    "fullname": "Growing Plants Organically: What It Means to Be Green",
    "info": "Science/ethics of organic cultivation. What is meant by \"green\" from legal, scientific, and ethical perspective. Original literature on organic practice. Written report, student-lead class discussion.",
    "prereq": {}
  },
  {
    "uid": "007718",
    "code": "HORT4092",
    "subject": "HORT",
    "number": "4092",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Horticulture",
    "fullname": "Special Topics in Horticulture",
    "info": "Topics of public and scientific interest in horticulture. Content varies each semester, inquire at department office before registration. Lab fees may be assessed.",
    "prereq": {}
  },
  {
    "uid": "007875",
    "code": "HORT4096",
    "subject": "HORT",
    "number": "4096",
    "honors": false,
    "writing": false,
    "name": "Prof Exp Program: Internship",
    "fullname": "Professional Experience Program: Internship",
    "info": "Professional experience in horticulture firms or government agencies attained through supervised practical experience. Students evaluate reports and consult with faculty advisers and employers.\n\nprereq: CFANS undergrad, completed internship contract prior to employment",
    "prereq": {}
  },
  {
    "uid": "806621",
    "code": "HORT4096W",
    "subject": "HORT",
    "number": "4096",
    "honors": false,
    "writing": true,
    "name": "Professional Experience Intern",
    "fullname": "Professional Experience Internship",
    "info": "This course provides an opportunity for professional experience in plant science and food systems achieved through a supervised practical experience. Students must complete a non-credit prerequisite Canvas module on pre-and reflection during the summer internship experience. Upon successful completion of this prerequisite, students will receive a permission number to register for HORT 4096W in the fall. In 4096W, students will produce a final publication that is focused on writing for lay audiences. This writing project will start toward the end of the internship and end at the conclusion of the 7-week online fall course.\n\nprereq: CFANS undergrad",
    "prereq": {
      "or": [
        "806621"
      ]
    }
  },
  {
    "uid": "816941",
    "code": "HORT4111",
    "subject": "HORT",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "Prairie Perennials and Grasses",
    "fullname": "Prairie Perennials and Grasses",
    "info": "Students will learn to identify over 100 plants, predominately native fall perennials and grasses at the Minnesota Landscape Arboretum. Class meeting dates at the Arboretum are listed in the Class Detail under Class Search.\n\nprereq: HORT 1015",
    "prereq": {
      "or": [
        "796837"
      ]
    }
  },
  {
    "uid": "817123",
    "code": "HORT4112",
    "subject": "HORT",
    "number": "4112",
    "honors": false,
    "writing": false,
    "name": "Flowering Trees and Shrubs",
    "fullname": "Flowering Trees and Shrubs",
    "info": "Need an excuse to spend a few hours outside at the height of the spring flowering season? Want to spend more time amidst the expansive and beautiful University of Minnesota Landscape Arboretum plant collections? Do you want to be able to identify more woody landscape plants, in flower? Here's your chance to expand your plant identification skills and learn the names and flowering characteristics for approximately 150 woody landscape plants. Flowering Trees and Shrubs is a practitioners course, designed to give you a hands-on opportunity to learn to identify woody landscape trees, shrubs, ground covers, and vines, including the common and scientific names for each. We will study the plants as family assemblages, noting features common to each family which will assist you in identifying unknown plants in Minnesota and other geographical locations in the future. In addition to identification; common landscape uses, cultural specificities,problems, and notable cultivars will be highlighted.",
    "prereq": {}
  },
  {
    "uid": "817086",
    "code": "HORT4113",
    "subject": "HORT",
    "number": "4113",
    "honors": false,
    "writing": false,
    "name": "Plant ID for the Home & Garden",
    "fullname": "Identifying Plants for the Home and Garden: Garden, Annual, and Potted Plants",
    "info": "There are many strange and usual plants that are grown as horticulture crops, ornamentals, or collectable plants. Venus fly traps, bulbs, orchids, vines, cacti and succulents. Students will learn how to identify these crops, learn their common and scientific names, and how these plants have adapted physiologically to survive stressful conditions. At least 100 different crops will be covered during this course (approximately 20 per class). Students will be expected to be able to identify these plants from images, whole plants, and/or plant parts. Information will be presented and/or learned using lectures, field trips, exercises, and homework, and a course project. Students will also grow potted herbs/vegetables crops as part of this class.",
    "prereq": {}
  },
  {
    "uid": "816940",
    "code": "HORT4114",
    "subject": "HORT",
    "number": "4114",
    "honors": false,
    "writing": false,
    "name": "Spring Flowering Bulbs",
    "fullname": "Spring Flowering Bulbs",
    "info": "Geophytes are early harbingers of spring. In this course, we will examine the variety of herbaceous perennial spring-flowering crops with underground storage organs (geophytes). As spring progresses, different genera and species predominate in the flowering landscape. In contrast, greenhouse production of potted plant and cut flower geophytic crops can be simultaneous rather than sequential. This course will consist of hands-on taxonomic identification of geophyte crops, their uses in landscape design, and production essentials. The course will be hands-on, experiential learning with many visits of outdoor landscape, gardens, production greenhouses, and interiorscapes.\n\nprereq: HORT 1015",
    "prereq": {
      "or": [
        "796837"
      ]
    }
  },
  {
    "uid": "800595",
    "code": "HORT4141W",
    "subject": "HORT",
    "number": "4141",
    "honors": false,
    "writing": true,
    "name": "Sched Crops-Protected Envrmts",
    "fullname": "Scheduling Crops for Protected Environments",
    "info": "The purpose of this course is to acquaint students with the identification, scheduling, and cultural requirements of commercially produced vegetables, herbs, ornamental flowers, and foliage plants, gain experience in growing them, and conduct experiments to understand current problems. The course builds on knowledge obtained in Hort 1001 or Hort 1015, by adding in additional factors of plant growth coupled with scheduling and growing of crops which commercial growers would experience. The role of ornamental plants in the human environment will be discussed, with special emphasis on future issues. Writing is an integral component of this course; one major paper is revised and expanded multiple times plus other course writing fulfill the writing intensive requirement. Through the use of interactive learning, field trips, written assignments, and in-class discussions, students learn crop requirements and the interactions between the marketing distribution system of breeders, producers, distributors, growers, retailers, and consumers. \n\nprereq: HORT 1001/6011 or PMB 2022 or BIOL 1009.  HORT 1015 preferred but not required. ",
    "prereq": {
      "or": [
        "007885",
        "806582",
        "005418",
        "005416",
        "796837"
      ]
    }
  },
  {
    "uid": "797069",
    "code": "HORT4401",
    "subject": "HORT",
    "number": "4401",
    "honors": false,
    "writing": false,
    "name": "Plant Genetics & Breeding",
    "fullname": "Plant Genetics and Breeding",
    "info": "Principles of plant genetics and environmental variation. Applications of genetics to crop evolution and breeding of self-pollinated, cross-pollinated, and asexually propagated crops. Investigation of hybridization, variation, and selection.\n\nprereq: Biol 1009 or equiv or grad, instr consent",
    "prereq": {
      "or": [
        "005416"
      ]
    }
  },
  {
    "uid": "802115",
    "code": "HORT4461",
    "subject": "HORT",
    "number": "4461",
    "honors": false,
    "writing": false,
    "name": "Horticultural Marketing",
    "fullname": "Horticultural Marketing",
    "info": "Major areas in horticultural marketing. Difference between horticultural products and commercial commodities. Core marketing components that should be used by every small horticultural business. Approaches to consumer research.",
    "prereq": {}
  },
  {
    "uid": "809775",
    "code": "HORT4601",
    "subject": "HORT",
    "number": "4601",
    "honors": false,
    "writing": false,
    "name": "Aquaponics: fish and plants",
    "fullname": "Aquaponics: Integrated fish and plant food systems",
    "info": "Advanced training/experience at intersection of biology, engineering, economics, policy, culture, environment. Emphasis on experiential learning, i.e., system design/maintenance, community engagement.\n\nprereq: Biol 1001 or Biol 1009",
    "prereq": {
      "or": [
        "005419",
        "005416"
      ]
    }
  },
  {
    "uid": "810656",
    "code": "HORT4850",
    "subject": "HORT",
    "number": "4850",
    "honors": false,
    "writing": false,
    "name": "Pollinator Protection Mgm Land",
    "fullname": "Pollinator Protection in Managed Landscapes",
    "info": "Importance of pollinators in agricultural/other natural landscapes. Risks to pollinators. Ways risks can be reduced, minimized, or overcome. Ways public policy has impacted pollinators/how future policy decisions will affect pollinator protection efforts.\n\nprereq: [1001 or AGRO 1101 or BIOL 1009 or BIOL 1001 or ENT 1001 or PLPA 1005], 30 credits completed (non-freshman status)",
    "prereq": {
      "and": [
        {
          "or": [
            "007885",
            "007688",
            "005416",
            "005419",
            "815591",
            "793529"
          ]
        }
      ]
    }
  },
  {
    "uid": "007987",
    "code": "HORT5007",
    "subject": "HORT",
    "number": "5007",
    "honors": false,
    "writing": false,
    "name": "Advanced Plant Propagation",
    "fullname": "Advanced Plant Propagation",
    "info": "Control of growth/development in sexual/asexual reproduction of plants. Effects of environment, plant growth substances. Protocols on dormancy, origin, development of adventitious structures. Specialized propagation techniques. Lecture, lab.\n\nprereq:  HORT1001/6011 or PMB 2022",
    "prereq": {
      "or": [
        "007885",
        "806582",
        "005418"
      ]
    }
  },
  {
    "uid": "792710",
    "code": "HORT5009",
    "subject": "HORT",
    "number": "5009",
    "honors": false,
    "writing": false,
    "name": "Pest in Hort: Use and Abuse",
    "fullname": "Pesticides in Horticulture: Their Use and Abuse",
    "info": "History of and practical information about pesticides used by horticulture industry. Pesticide modes of action. Use, application methods, environmental effects. Final three weeks devoted to labs on practical mixing/delivery systems.",
    "prereq": {}
  },
  {
    "uid": "806867",
    "code": "HORT5011",
    "subject": "HORT",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Med Plts: Class, I.D. App",
    "fullname": "Common Medicinal Plants: Classification, Identification, and Application",
    "info": "More than 200 common medicinal plants from 80 plant families. Medicinal plant identification/classification. Methods/philosophy of applying herbs for health and disease prevention. Practice with about 90 herb samples.",
    "prereq": {}
  },
  {
    "uid": "807945",
    "code": "HORT5012",
    "subject": "HORT",
    "number": "5012",
    "honors": false,
    "writing": false,
    "name": "Med Plts: Grow & Proces",
    "fullname": "Common Medicinal Plants: Growing and Processing",
    "info": "How to grow, process, store 40 common herbs/herbal products.",
    "prereq": {}
  },
  {
    "uid": "016094",
    "code": "HORT5018",
    "subject": "HORT",
    "number": "5018",
    "honors": false,
    "writing": false,
    "name": "Land Operations & Mgmt",
    "fullname": "Landscape Operations and Management",
    "info": "Business, managerial, and technical aspects of landscape management relative to environmental horticulture and green industry. Tasks associated with maintaining turf and woody/herbaceous plants in landscape. Relationship of those tasks to preparation/justification of labor, equipment, and supply budgets. Labs, demonstrations, hands-on experiences asociated with science and technically-based landscape maintenance/operations.",
    "prereq": {}
  },
  {
    "uid": "007065",
    "code": "HORT5021",
    "subject": "HORT",
    "number": "5021",
    "honors": false,
    "writing": false,
    "name": "Landscape Design  & Implem II",
    "fullname": "Landscape Design and Implementation II",
    "info": "Residential, commercial, and recreational sites. Architectural/graphic techniques, plan drawings, sections elevations, perspectives, working drawings. Grading. Site manipulation, including surveying, irrigation, and drainage. Development of business/grounds management plans. Landscape estimating/bidding.",
    "prereq": {}
  },
  {
    "uid": "013987",
    "code": "HORT5022",
    "subject": "HORT",
    "number": "5022",
    "honors": false,
    "writing": false,
    "name": "Plant Science for Teachers",
    "fullname": "Topics in Plant Science for Teachers",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "014025",
    "code": "HORT5023",
    "subject": "HORT",
    "number": "5023",
    "honors": false,
    "writing": false,
    "name": "Public Garden Management",
    "fullname": "Public Garden Management",
    "info": "Overview of knowledge/skills necessary to manage a public garden. History of public gardens. Development of mission and vision. Planning and design. Operations. Education and research. Fund raising, business management, personnel, marketing, conservation.",
    "prereq": {}
  },
  {
    "uid": "016096",
    "code": "HORT5024",
    "subject": "HORT",
    "number": "5024",
    "honors": false,
    "writing": false,
    "name": "Landscape Development",
    "fullname": "Landscape Development",
    "info": "Hands-on experience in landscape development. Plan takeoffs, site evaluation/preparation, planting, installation/construction, equipment operation, hard-good/plant handling.",
    "prereq": {}
  },
  {
    "uid": "007765",
    "code": "HORT5031",
    "subject": "HORT",
    "number": "5031",
    "honors": false,
    "writing": false,
    "name": "Fruit Prod & Vit Loc & Org Mkt",
    "fullname": "Fruit Production and Viticulture for Local and Organic Markets",
    "info": "Principles of fruit production. Temperature fruit crops. Integrated management of fruit cropping systems. Site selection, cultural management practices, taxonomic classification, physiological/environmental control of plant development. Writing.\n\nprereq: [1001, 3005] or instr consent",
    "prereq": {
      "and": [
        "007885"
      ]
    }
  },
  {
    "uid": "788226",
    "code": "HORT5032",
    "subject": "HORT",
    "number": "5032",
    "honors": false,
    "writing": false,
    "name": "Organic Vegetable Production",
    "fullname": "Organic Vegetable Production",
    "info": "Integrated management of vegetable cropping. Site selection/environment, seed/stand establishment, cultural management, commodity use, handling. Types of vegetable cultivars. Breeding, physiological/environmental control.",
    "prereq": {}
  },
  {
    "uid": "825346",
    "code": "HORT5033",
    "subject": "HORT",
    "number": "5033",
    "honors": false,
    "writing": false,
    "name": "Fruit Veg for Local Org Market",
    "fullname": "Growing Fruit & Vegetables for Local and Organic Markets",
    "info": "This course will focus on production of fruits and vegetables for local and organic markets in the Upper Midwest. Most fruit and vegetable growers in Minnesota operate diversified production systems for local and organic markets (fresh market - not processing), and so we explore production within this specific framework. Examples from large-scale systems will also be highlighted in order to compare and contrast different production features and challenges. We will explore the specialty crop industry, trends, consumer behavior, and marketing, including organic regulations and certification programs. We will explore fruit and vegetable production within the framework of sustainable agriculture, which encompasses agricultural productivity, economic viability, environmental conservation, and social equity, and how this relates to the regulatory framework supporting organic certification. The format of this class is 70% discussion, 30% lecture.\n\nPrerequisites: SOIL 2125 and [HORT 1001 or AGRO 1101 or BIOL 1009 or BIOL 1001 or another applicable biological science equivalent]",
    "prereq": {}
  },
  {
    "uid": "007615",
    "code": "HORT5041",
    "subject": "HORT",
    "number": "5041",
    "honors": false,
    "writing": false,
    "name": "Nursery Production & Mgmt II",
    "fullname": "Nursery Production and Management II",
    "info": "An in-depth look at nursery practices including innovative production systems. Specific crop schedules, using technical and economic data for production. Pest management and regulations for the nursery industry.",
    "prereq": {}
  },
  {
    "uid": "007612",
    "code": "HORT5041W",
    "subject": "HORT",
    "number": "5041",
    "honors": false,
    "writing": true,
    "name": "Nur Mgmt",
    "fullname": "Nursery Management",
    "info": "Production, maintenance, and marketing of woody ornamental plants. Establishment/management of nursery or garden centers. Lab, field trips.",
    "prereq": {}
  },
  {
    "uid": "016097",
    "code": "HORT5042",
    "subject": "HORT",
    "number": "5042",
    "honors": false,
    "writing": false,
    "name": "Nursery Operations",
    "fullname": "Nursery Operations",
    "info": "Hands-on experience in nursery production. Propagating, growing, and harvesting plants. Operating the equipment commonly used in nurseries.",
    "prereq": {}
  },
  {
    "uid": "007011",
    "code": "HORT5051",
    "subject": "HORT",
    "number": "5051",
    "honors": false,
    "writing": false,
    "name": "Plant Prod II",
    "fullname": "Plant Production II",
    "info": "Propagation, production, and use of floral crops. Bedding plants, perennials, and cut flowers. Growing, marketing, and using herbaceous plants. Cultural practices. Manipulation of environment for growth/quality. Lab, field trips.\n\nprereq: 1001, 1015",
    "prereq": {
      "and": [
        "007885",
        "796837"
      ]
    }
  },
  {
    "uid": "790353",
    "code": "HORT5052",
    "subject": "HORT",
    "number": "5052",
    "honors": false,
    "writing": false,
    "name": "Specialty  GH Crop Prod.",
    "fullname": "Specialty Greenhouse Crop Production",
    "info": "Media management, insect/disease control, management of annual versus perennial plant production systems. Soil modification, seed germination, transplanting, scheduling, weed control, fertilization/irrigation. Environment management, hydroponic solution management, pest management in closed environment. Post-harvest management/care, drying/dying procedures. Consumer surveys at Minneapolis and St. Paul farmers' markets.",
    "prereq": {}
  },
  {
    "uid": "810661",
    "code": "HORT5058",
    "subject": "HORT",
    "number": "5058",
    "honors": false,
    "writing": false,
    "name": "Plant Cytogenetics",
    "fullname": "Plant Cytogenetics",
    "info": "Hybrid science of plant cytology/genetics. History, concepts, current research, technological development in plant cytogenetics. Function, movement, number/structure of chromosomes. Methods/application of chromosome modification in plant improvement.\n\nprereq: [HORT/AGRO 4401, BIOL 4003] or instr consent",
    "prereq": {
      "or": [
        "007652",
        "009489"
      ]
    }
  },
  {
    "uid": "810662",
    "code": "HORT5059",
    "subject": "HORT",
    "number": "5059",
    "honors": false,
    "writing": false,
    "name": "Pl Cytogenetics Lab",
    "fullname": "Plant Cytogenetics Lab",
    "info": "Consolidate knowledge of plant cytogenetics by practicing  series of microscopy/computational technologies. Examine number, movement, structure/structure modification of chromosomes. Application in plant improvement.\n\nprereq: [HORT/AGRO 4401, BIOL 4004] or instr consent",
    "prereq": {
      "or": [
        "007652",
        "010881"
      ]
    }
  },
  {
    "uid": "007990",
    "code": "HORT5061",
    "subject": "HORT",
    "number": "5061",
    "honors": false,
    "writing": false,
    "name": "Advanced Turfgrass Science",
    "fullname": "Advanced Turfgrass Science",
    "info": "For advanced students in turf with career objectives in professional turf management. Emphasis on ecology, physiology, theory of turf population dynamics and specialized management situations such as golf course, commercial sod production, and fine turf athletic settings.\n\nprereq: 4061",
    "prereq": {
      "and": [
        "007989"
      ]
    }
  },
  {
    "uid": "007013",
    "code": "HORT5071",
    "subject": "HORT",
    "number": "5071",
    "honors": false,
    "writing": false,
    "name": "Ecological Restoration",
    "fullname": "Ecological Restoration",
    "info": "Each ecosystem restoration is the product of a myriad of decisions made in response to existing site conditions (biotic and abiotic), anticipated effects from the surrounding landscape, predictions about future events, logistical realities, and, of course, desired conditions. During this course, you will learn about the ecological and social factors that affect ecosystem recovery and how people intervene to reverse ecosystem degradation. The course includes examples from ecosystems around the world, with emphasis on those found in the Midwestern US. Field trips. \n\nPREREQUISITES: This course presumes previous courses in basic ecology and plant science.",
    "prereq": {}
  },
  {
    "uid": "007719",
    "code": "HORT5090",
    "subject": "HORT",
    "number": "5090",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "In-depth exploration of concepts, technology, materials, or programs in specific area to expand professional competency/self-confidence. Planning, organizing, implementing, and evaluating knowledge obtained from formal education and from experience.\n\nprereq: 8 cr upper div Hort courses, instr consent",
    "prereq": {}
  },
  {
    "uid": "819583",
    "code": "HORT5093",
    "subject": "HORT",
    "number": "5093",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment.  Students enrolling in a directed study will be required to use the University-wide on-line directed study contract process in order to enroll.\n \nInstructor consent required. No more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "819584",
    "code": "HORT5094",
    "subject": "HORT",
    "number": "5094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "An opportunity in which a student designs and carries\nout a directed research project under the direction of a faculty member. Directed research may be taken for variable credit and special permission is needed for enrollment. Students enrolling in a directed research will be required to use the University-wide online directed research contract process in order to enroll.\n \nInstructor consent required. No more than 6 credits of directed research counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "825744",
    "code": "HORT5114",
    "subject": "HORT",
    "number": "5114",
    "honors": false,
    "writing": false,
    "name": "Know & Name Plants We Eat",
    "fullname": "Knowing and Naming the Plants We Eat",
    "info": "The 1-credit course HORT 5114 “Knowing and naming the plants we eat” focuses on identification, taxonomy and characteristics of plants, and plant parts commonly contributing to human diets.  Course modules emphasize culinary fruits, vegetables and herbs plus grains, pulses and oilseeds grown for food use.  This online course meets synchronously for lecture and discussion on Wednesdays from 5pm to 6pm.  Weekly lectures are posted online for asynchronous study.  Students develop a portfolio of their course work where they document and reflect upon characteristics and taxonomic relationships among the plants addressed in this course. As a 5xxx-level course, students with less than 60 credits completed in their program (typically underclassmen) will need to request a permission number to enroll. \nprereqs: junior or senior; Biol 1001 or Biol 1009 or HORT 1001 or HORT 1015",
    "prereq": {
      "or": [
        "005419",
        "005416",
        "007885",
        "796837"
      ]
    }
  },
  {
    "uid": "801461",
    "code": "HORT5131",
    "subject": "HORT",
    "number": "5131",
    "honors": false,
    "writing": false,
    "name": "Organic Farm Plan, Grow, Mkt",
    "fullname": "Student Organic Farm Planning, Growing, and Marketing",
    "info": "Students plan/implement cropping/marketing strategies for organic produce/flowers from Student Organic Farm on St. Paul campus.\n\nprereq: AGRO 1101 or AGRO 1103 or BIOL 1001 or BIOL 1009 or HORT 1001 ",
    "prereq": {
      "or": [
        "007688",
        "007579",
        "005419",
        "005416",
        "007885"
      ]
    }
  },
  {
    "uid": "013997",
    "code": "HORT5183",
    "subject": "HORT",
    "number": "5183",
    "honors": false,
    "writing": false,
    "name": "Water, Minerals & Translocate",
    "fullname": "Water, Minerals, and Translocation",
    "info": "Transport processes in plants including water and nutrient absorption and distribution, effects of and adaptations to water and nutrient stress, functions of mineral nutrients, and translocation of photosynthates.",
    "prereq": {}
  },
  {
    "uid": "820569",
    "code": "HORT5480",
    "subject": "HORT",
    "number": "5480",
    "honors": false,
    "writing": false,
    "name": "Topics in Horticultural Scienc",
    "fullname": "Topics in Horticultural Science",
    "info": "Topics vary. ",
    "prereq": {}
  },
  {
    "uid": "007876",
    "code": "HORT5990",
    "subject": "HORT",
    "number": "5990",
    "honors": false,
    "writing": false,
    "name": "Special Wrkshp in Horticulture",
    "fullname": "Special Workshop in Horticulture",
    "info": "Workshops on a variety of topics in horticulture offered in locations other than the Twin Cities campus. See Class Schedule or department for current offerings.",
    "prereq": {}
  },
  {
    "uid": "014022",
    "code": "HORT6001",
    "subject": "HORT",
    "number": "6001",
    "honors": false,
    "writing": false,
    "name": "MAg Proj Plan",
    "fullname": "Master of Agriculture Project Planning",
    "info": "Plan integrating capstone project.",
    "prereq": {}
  },
  {
    "uid": "014023",
    "code": "HORT6002",
    "subject": "HORT",
    "number": "6002",
    "honors": false,
    "writing": false,
    "name": "Problem Solving in Hort",
    "fullname": "Problem Solving in Horticulture",
    "info": "This course is intended to be a capstone experience that integrates the knowledge gained from coursework, personal research, and the student's academic and professional experiences. Enrollment is usually limited to students who have completed 18 or more credit hours of their required 30 credits and accounts for 2 of the minimum 30 credits required for the degree. These credits are not considered part of the horticulture core course requirements; an additional 15 credits in Horticulture are required for the MPS Hort degree. \n\nprereq: HORT 6101 and completion of 18 or more credits towards Master of Professional Studies in Horticulture Degree. ",
    "prereq": {
      "or": [
        "825629"
      ]
    }
  },
  {
    "uid": "788227",
    "code": "HORT6003",
    "subject": "HORT",
    "number": "6003",
    "honors": false,
    "writing": false,
    "name": "MPS-Hort: Internship",
    "fullname": "Masters of Professional Studies in Horticulture Professional Experience Program: Internship",
    "info": "Professional experience in horticulture firms or government agencies attained through supervised practical experience. Students evaluate reports, consult with faculty advisers and with employers. Students must complete internship contract. \n\nprereq: Masters of Professional Studies in Horticulture student and HORT 6101, or instructor consent. ",
    "prereq": {
      "or": [
        "825629"
      ]
    }
  },
  {
    "uid": "806582",
    "code": "HORT6011",
    "subject": "HORT",
    "number": "6011",
    "honors": false,
    "writing": false,
    "name": "Plant Propagation",
    "fullname": "Plant Propagation",
    "info": "Principles/techniques of propagating plants by seeds, cuttings, grafts, buds, layers, and division.  Lectures on principles, labs on practice of various propagating techniques. Reading/discussion of related primary literature.\n\nprereq: Master of Professional Studies or instr consent",
    "prereq": {}
  },
  {
    "uid": "825629",
    "code": "HORT6101",
    "subject": "HORT",
    "number": "6101",
    "honors": false,
    "writing": false,
    "name": "Intro to MPS in Horticulture",
    "fullname": "Introduction to the MPS in Horticulture Program",
    "info": "This course will introduce you to the MPS Horticulture Program, along with the resources available at the University that can help you successfully complete your MPS degree. In addition, you will learn more about the research, teaching, and outreach occurring in the Department of Horticultural Science and begin to plan for your required capstone project that occurs at the end of your degree program. We will meet online each week via Zoom. Our class time will be used in several ways including large and small group discussions, guest speakers, and workshops.\n\nprereq: MPS in Horticulture Student",
    "prereq": {}
  },
  {
    "uid": "819198",
    "code": "HORT6141",
    "subject": "HORT",
    "number": "6141",
    "honors": false,
    "writing": false,
    "name": "Sched Crops-Protected Envrmts",
    "fullname": "Scheduling Crops for Protected Environments",
    "info": "The purpose of this course is to acquaint students with the identification, scheduling and cultural requirements of commercially produced potted plants, gain experience in growing them, and conduct experiments to understand current problems. The course builds on knowledge obtained in Hort 1001 or Hort 1015, by adding in additional factors of plant growth coupled with scheduling and growing a of crops which commercial growers would experience. The role of ornamental plants in the human environment will be discussed, with special emphasis on future issues. Writing is an integral component of this course; one major paper is revised and expanded multiple times plus other course writing fulfill the writing intensive requirement. Through the use of interactive learning, field trips, written assignments, and in-class discussions students learn crop requirements and the interactions between the marketing distribution system of breeders, producers, distributors, growers, retailers, and consumers.\n\nprereq: Graduate student. HORT 1001/6011 or PMB 2022 or BIOL 1009. ",
    "prereq": {
      "or": [
        "007885",
        "806582",
        "005418",
        "005416"
      ]
    }
  },
  {
    "uid": "797085",
    "code": "HORT8005",
    "subject": "HORT",
    "number": "8005",
    "honors": false,
    "writing": false,
    "name": "Supervised Teaching",
    "fullname": "Supervised Classroom or Extension Teaching Experience",
    "info": "Classroom or extension teaching experience in one of the following departments: Agronomy and Plant Genetics; Biosystems and Agricultural Engineering; Horticultural Science; Plant Pathology; or Soil, Water, and Climate. Participation in discussions about effective teaching to strengthen skills and develop personal teaching philosophy.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "007747",
    "code": "HORT8007",
    "subject": "HORT",
    "number": "8007",
    "honors": false,
    "writing": false,
    "name": "Ext Hort Practicum",
    "fullname": "Extension Horticulture Practicum",
    "info": "Selected activities that may include development of an extension fact sheet, assistance in Dial-U Clinic, or preparation of a workshop or short course.\n\nprereq: 9 grad cr in [ag or bio] science,  instr consent",
    "prereq": {}
  },
  {
    "uid": "007983",
    "code": "HORT8023",
    "subject": "HORT",
    "number": "8023",
    "honors": false,
    "writing": false,
    "name": "Evol Crop Plts",
    "fullname": "Evolution of Crop Plants",
    "info": "Origin, distribution, and evolution of cultivated plants; implication of the effects of evolutionary processes on crop breeding for needs of people today.\n\nprereq: 9 grad cr in ag or bio sciences",
    "prereq": {}
  },
  {
    "uid": "007748",
    "code": "HORT8040",
    "subject": "HORT",
    "number": "8040",
    "honors": false,
    "writing": false,
    "name": "Hort Seminar",
    "fullname": "Horticultural Seminar",
    "info": "Reports and discussions of problems and investigational work.",
    "prereq": {}
  },
  {
    "uid": "007788",
    "code": "HORT8044",
    "subject": "HORT",
    "number": "8044",
    "honors": false,
    "writing": false,
    "name": "Manip Pl Grwth Repr",
    "fullname": "Manipulation of Plant Growth and Reproduction",
    "info": "Impact of environmental and genetic factors on crop growth, development, and reproduction. Emphasis on whole plant physiology and plant response to the environment as determined by genotype and its manipulation for the purpose of producing a crop.  Lectures, discussion of current literature, and projects.\n\nprereq: PBio 5412",
    "prereq": {}
  },
  {
    "uid": "007739",
    "code": "HORT8045",
    "subject": "HORT",
    "number": "8045",
    "honors": false,
    "writing": false,
    "name": "Pl Resp Env Stress",
    "fullname": "Plant Responses to Environmental Stresses",
    "info": "Examined from molecular to organismal levels.",
    "prereq": {}
  },
  {
    "uid": "007750",
    "code": "HORT8090",
    "subject": "HORT",
    "number": "8090",
    "honors": false,
    "writing": false,
    "name": "Grad Hort Res",
    "fullname": "Graduate Horticultural Research",
    "info": "Conduct literature, lab, and/or field research with horticultural plants and cropping systems.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "819752",
    "code": "HORT8093",
    "subject": "HORT",
    "number": "8093",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "A course in which a student designs and carries out a directed study on selected topics or problems under the direction of a faculty member; eg, literature review. Directed study courses may be taken for variable credit and special permission is needed for enrollment. Graduate students enrolling in a directed study will need to follow the designated graduate student directed study enrollment procedure found on the Plant Science and Food Systems websites (plantscience.umn.edu and foodsystems.umn.edu). \n\nPrereq: department consent, instructor consent, no more than 6 credits of directed study counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "819753",
    "code": "HORT8094",
    "subject": "HORT",
    "number": "8094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "A course in which a student designs and carries out a directed research on selected topics or problems under the direction of a faculty member; eg, literature review. Directed research courses may be taken for variable credit and special permission is needed for enrollment. Graduate students enrolling in a directed research will need to follow the designated graduate student directed research enrollment procedure found on the Plant Science and Food Systems websites (plantscience.umn.edu and foodsystems.umn.edu). \n\nPrereq: department consent, instructor consent, no more than 6 credits of directed research or directed study counts towards CFANS major requirements.",
    "prereq": {}
  },
  {
    "uid": "792075",
    "code": "HORT8201",
    "subject": "HORT",
    "number": "8201",
    "honors": false,
    "writing": false,
    "name": "Adv Pl Br",
    "fullname": "Advanced Plant Breeding",
    "info": "Principles/current methods in breeding agronomic/horticultural crops. Use of genotype/environment data to increase genetic gain, population improvement, parent building, alternative selection strategies, breeding for special traits, new approaches.\n\nprereq: STAT 5301 or equiv",
    "prereq": {}
  },
  {
    "uid": "788991",
    "code": "HORT8270",
    "subject": "HORT",
    "number": "8270",
    "honors": false,
    "writing": false,
    "name": "Grad Seminar",
    "fullname": "Graduate Seminar",
    "info": "Reports/discussions on problems, investigation work.\n\nprereq: Grad major in [hort or applied plant sciences or ent or agro or plnt brdg or plnt path or soil] or instr consent",
    "prereq": {}
  },
  {
    "uid": "788992",
    "code": "HORT8280",
    "subject": "HORT",
    "number": "8280",
    "honors": false,
    "writing": false,
    "name": "Topics: Applied Plant Sciences",
    "fullname": "Current Topics in Applied Plant Sciences",
    "info": "Topics presented by faculty or visiting scientists.\n\nprereq: Grad major in [hort or applied plnt sciences or ent or agro or plnt brdg or plnt path or soil] or instr consent",
    "prereq": {}
  },
  {
    "uid": "797089",
    "code": "HORT8305",
    "subject": "HORT",
    "number": "8305",
    "honors": false,
    "writing": false,
    "name": "Plant Envir Physiol",
    "fullname": "Physiological Ecology of Plants in Natural and Managed Ecosystems",
    "info": "Introduction to plants and their reactions and responses in managed and natural ecosystems, including carbon and nitrogen allocation, root biology, microbial interaction, secondary metabolism, and plant response to biotic and abiotic stress.",
    "prereq": {}
  },
  {
    "uid": "797177",
    "code": "HORT8900",
    "subject": "HORT",
    "number": "8900",
    "honors": false,
    "writing": false,
    "name": "Advanced Discussions",
    "fullname": "Advanced Discussions",
    "info": "Special workshops or courses in applied plant sciences.\n\nprereq: instr consent",
    "prereq": {}
  }
]