[
  {
    "uid": "814449",
    "code": "HSCI1011",
    "subject": "HSCI",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Digital World",
    "fullname": "Digital World",
    "info": "Essential knowledge and critical perspective to understand today's Digital World. The history and social impact of the digital revolution, including security, surveillance, \"virtual reality,\" and the future of the Internet.",
    "prereq": {}
  },
  {
    "uid": "799020",
    "code": "HSCI1212",
    "subject": "HSCI",
    "number": "1212",
    "honors": false,
    "writing": false,
    "name": "Life on Earth: Evol & Ecology",
    "fullname": "Life on Earth: Origins, Evolution & Ecology",
    "info": "How have people explained where life came from and how it has developed over time? We examine controversies over life's origins, the Holocene extinction, human population growth, the Dust Bowl and soil conservation, DDT and falcon repatriation, and disease and responses to pandemics. Evolution, natural theology. Ecosystems.",
    "prereq": {}
  },
  {
    "uid": "799021",
    "code": "HSCI1214W",
    "subject": "HSCI",
    "number": "1214",
    "honors": false,
    "writing": true,
    "name": "Life on Earth",
    "fullname": "Life on Earth: Origins, Evolution & Ecology",
    "info": "How have people explained where life came from and how it has developed over time? We examine controversies over life?s origins, the Holocene extinction, human population growth, the Dust Bowl and soil conservation, DDT and falcon repatriation, and disease and responses to pandemics.",
    "prereq": {}
  },
  {
    "uid": "818058",
    "code": "HSCI1555",
    "subject": "HSCI",
    "number": "1555",
    "honors": false,
    "writing": false,
    "name": "UMN Cabinet of Curiosities",
    "fullname": "Campus Obscura: A University of Minnesota Cabinet of Curiosities",
    "info": "Exploring museums and special collections on campus, this course will analyze the importance of material objects--maps, rare books, artifacts, instruments, specimens, manuscripts--in writing history, producing public exhibits, and creating identities. The University of Minnesota provides a rich resource for such exploration of objects that, collectively, have and continue to shape its history. Among other places, students will visit the Wangensteen Historical Library of Biology and Medicine, the Goldstein Museum of Design, the University Archives, and the Conservatory on the Saint Paul campus where experts will guide them in examining specific specimens and artifacts. Students will write short response papers at each visit, often on an object of their choice. The final collaborative group project will be based on one particular object (or group of objects) studied in detail by each student that will then become part of a digital StoryMap of the campus.",
    "prereq": {}
  },
  {
    "uid": "819127",
    "code": "HSCI1585",
    "subject": "HSCI",
    "number": "1585",
    "honors": false,
    "writing": false,
    "name": "History of Earth/Enviro Sci",
    "fullname": "Mammoths, Minerals, Monoculture: History of Earth and Environmental Science",
    "info": "This course investigates the many ways people across the globe have sought to understand the environment and the earth from antiquity to the present.  We will study the context in which the modern earth and environmental sciences emerged, asking throughout the semester what knowledge traditions contributed to the development of the sciences we know today.  We will investigate the historical perspectives that shaped three intersecting themes throughout the semester: the questions of geological time and of change in the study of the earth; human use of natural resources in industry and agriculture; and understandings of the earth and environment as a global system.   We will examine secondary historical scholarship and primary sources from North and South America, Africa, Europe, and Asia in order to better understand the religious and philosophical stakes of earth and environmental science, the role of empire and state building in the development of geoscience, and the interrelationship of science and industry.  ",
    "prereq": {}
  },
  {
    "uid": "009150",
    "code": "HSCI1714",
    "subject": "HSCI",
    "number": "1714",
    "honors": false,
    "writing": false,
    "name": "Stone to Steam Engines",
    "fullname": "Stone Tools to Steam Engines: Technology and History to 1750",
    "info": "Technology is an enormous force in our society, and has become so important that in many ways it seems to have a life of its own. This course uses historical case studies to demonstrate that technology is not autonomous, but a human activity, and that people and societies made choices about the technologies they developed and used. It asks how technological differences between nations influenced their different courses of development, and why some societies seemed to advance while others did not. We ask how technological choices can bring about consequences greater than people expected, and how we might use this knowledge in making our own technological choices. In particular, we explore the historical background, development, and character of the most widespread technological systems the world has known, from prehistoric stone tool societies, through Egypt and the pyramids, ancient Greece and Rome, the explosion of Islam, and the dynamic and often violent technologies of medieval Europe.",
    "prereq": {}
  },
  {
    "uid": "009151",
    "code": "HSCI1715",
    "subject": "HSCI",
    "number": "1715",
    "honors": false,
    "writing": false,
    "name": "Mdrn Tech: Waterwheels to Web",
    "fullname": "History of Modern Technology: Waterwheels to the Web",
    "info": "This course explores the many technological systems that have come to span our globe, alongside the widespread persistence of traditional technologies. We start with the earliest glimmerings of modernity and industrialization, and move on in time to the building of global technological networks. How have people changed their worlds through technologies like steam engines and electronics?  Is it a paradox that many traditional agricultural and household technologies have persisted? How have technologies of war remade the global landscape? We ask how business and government have affected technological entrepreneurs, from railroads to technologies of global finance. We end by considering the tension between technologies that threaten our global environment and technologies that offer us hopes of a new world.",
    "prereq": {}
  },
  {
    "uid": "008876",
    "code": "HSCI1814",
    "subject": "HSCI",
    "number": "1814",
    "honors": false,
    "writing": false,
    "name": "Hist Sci to Newton",
    "fullname": "Revolutions in Science: The Babylonians to Newton",
    "info": "Development and changing nature of sciences in their cultural context. Babylonian/Greek science. Decline/transmission of Greek science. Scientific Revolution (1500-1700) from Copernicus to Newton.",
    "prereq": {}
  },
  {
    "uid": "008879",
    "code": "HSCI1815",
    "subject": "HSCI",
    "number": "1815",
    "honors": false,
    "writing": false,
    "name": "Mdrn Sci: Atoms, Genes, Quanta",
    "fullname": "Making Modern Science: Atoms, Genes and Quanta",
    "info": "How scientists like Darwin and Einstein taught us to think about nature; everything from space, time and matter to rocks, plants, and animals.",
    "prereq": {}
  },
  {
    "uid": "790172",
    "code": "HSCI1905",
    "subject": "HSCI",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics vary. See Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "818059",
    "code": "HSCI1955",
    "subject": "HSCI",
    "number": "1955",
    "honors": false,
    "writing": false,
    "name": "Einstein's Universe",
    "fullname": "Einstein's Universe",
    "info": "In this seminar we examine the life and work of Albert Einstein (1879-1955). The use of mathematics will be kept to a minimum. You will need no more than some basic high-school algebra and geometry. We begin by studying the special theory of relativity (1905) and some of its famous predictions such as time dilation, the twin paradox, and E=mc2. While working our way through this material, we will also look at elements of nineteenth-century physics that played a role in the development of special relativity. We continue to pursue a historical approach when we turn to the general theory of relativity (1915), the theory that makes gravity part of (curved) space-time. We trace the development of this theory from 1907 till about 1920. Einstein worked intensively on this theory living in Berlin during the first World War (1914-1918). For this period, we shall also take a close look at Einstein's personal life and at his tentative first appearances on the political stage. Finally, we cover Einstein's role in the development of quantum physics, both his early pioneering efforts in this field and his later opposition to quantum mechanics as formulated in the mid-20s. By the end of the course you should have a good understanding of some of Einstein's most revolutionary ideas, of how he arrived at them, at what personal price, and in what broader socio-political and cultural context.",
    "prereq": {}
  },
  {
    "uid": "009374",
    "code": "HSCI3211",
    "subject": "HSCI",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "History of Biology",
    "fullname": "Biology and Culture in the 19th and 20th Centuries",
    "info": "Changing conceptions of life and aims and methods of biology; changing relationships between biology and the physical and social sciences; broader intellectual and cultural dimensions of developments in biology.",
    "prereq": {}
  },
  {
    "uid": "009377",
    "code": "HSCI3242",
    "subject": "HSCI",
    "number": "3242",
    "honors": false,
    "writing": false,
    "name": "Navigating a Darwinian World",
    "fullname": "Navigating a Darwinian World",
    "info": "In this course we grapple with the impact of Darwin's theory of evolution in the scientific community and beyond. We'll examine and engage the controversies that have surrounded this theory from its inception in the 19th century through its applications in the 21st. What made Darwin a Victorian celebrity, a religious scourge, an economic sage and a scientific hero? We'll look closely at the early intellectual influences on theory development; study the changing and dynamic relationship between science and religion; and critically analyze the application of Darwin's theory to questions of human nature and behavior.",
    "prereq": {}
  },
  {
    "uid": "009376",
    "code": "HSCI3244",
    "subject": "HSCI",
    "number": "3244",
    "honors": false,
    "writing": false,
    "name": "Nature's History",
    "fullname": "Nature's History: Science, Humans, and the Environment",
    "info": "We examine environmental ideas, sustainability, conservation history; critique of the human impact on nature; empire and power in the Anthropocene; how the science of ecology has developed; and modern environmental movements around the globe. Case studies include repatriation of endangered species; ecology and evolutionary theory; ecology of disease; and climate change.",
    "prereq": {}
  },
  {
    "uid": "817860",
    "code": "HSCI3246",
    "subject": "HSCI",
    "number": "3246",
    "honors": false,
    "writing": false,
    "name": "(Un)Natural Disasters",
    "fullname": "History of (Un)Natural Disasters",
    "info": "Earthquakes, hurricanes, tsunamis, wildfires, epidemic disease, and technological failures? This course will examine large scale natural events in American and world history, the social, technological, and environmental conditions that underlie them, and their historical consequences. Human societies have long been embedded in physical landscapes where they are subject to specific environmental conditions and physical risks: eight thousand-year-old wall paintings in Turkey depict the eruption of Hasan Dag volcano over the city of Catal Huyuk, for example. But then and now, it takes a certain combination of social conditions and environmental events to create a natural disaster. In this course, we will use historical natural disasters to explore the interconnections between the structures and ideas of human society and environmental forces. Humans have not been simply the random victims of natural disasters; where and how they chose to live influenced the impact of any disastrous event. Examining these events in a historical context will help us see the social, technological, scientific, and environmental systems that have been constantly interacting, but which are normally taken for granted until they break down.",
    "prereq": {}
  },
  {
    "uid": "009215",
    "code": "HSCI3331",
    "subject": "HSCI",
    "number": "3331",
    "honors": false,
    "writing": false,
    "name": "Tech Amer Culture",
    "fullname": "Technology and American Culture",
    "info": "American culture(s) and technology, pre-Columbian times to present. Artisanal, biological, chemical, communications, energy, environment, electronic, industrial, military, space and transportation technologies explained in terms of economic, social, political and scientific causes/effects.",
    "prereq": {}
  },
  {
    "uid": "009218",
    "code": "HSCI3332",
    "subject": "HSCI",
    "number": "3332",
    "honors": false,
    "writing": false,
    "name": "Science Shaping America",
    "fullname": "Science in the Shaping of America",
    "info": "Science played a central role in taking scattered imperial colonies in North America to world power in just four centuries. This course investigates people, policies, and knowledge-making in a culture whose diversity was a critical part of its expanding capacities. It begins by examining the differences in ways of knowing as well as shared knowledge between Native Americans and Europeans and concludes by discussing how a powerful nation's science and technology shaped international relations. Class, race, ethnicity, and gender provided for a range of perspectives that contributed to science alongside social and economic developments. Online assignments, films and images, along with primary and secondary source readings provide the basis for class discussion.",
    "prereq": {}
  },
  {
    "uid": "805300",
    "code": "HSCI3333W",
    "subject": "HSCI",
    "number": "3333",
    "honors": false,
    "writing": true,
    "name": "Am Sci & Tech in Past Century",
    "fullname": "Issues in American Science and Technology in the Past Century",
    "info": "Historical approach to understanding science and technology. Intellectual, political, and social contexts. Decision-making by practitioners on issues of importance to the profession and the community. Topics relating to popular science, science, and warfare.",
    "prereq": {}
  },
  {
    "uid": "009294",
    "code": "HSCI3401",
    "subject": "HSCI",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Ethics in Science/Technology",
    "fullname": "Ethics in Science and Technology",
    "info": "In addition to examining the idea of ethics itself, this course will examine the ethical questions embodied in specific historical events, technological systems, and scientific enterprises. Commonly, technology is assumed to be the best engineered solution for a particular goal and (good) science is supposed to be objective; however, this is never truly the case, values and moral choices underlie all of our systems for understanding and interacting with the world around us. These values and choices are almost always contentious. Through a series of historical case studies we will grapple with the big issues of right and wrong and the role of morality in a technological world.  Our goal will be to learn to question and think critically about the things we create, the tools we use, and the ideology and practice of science.",
    "prereq": {}
  },
  {
    "uid": "807051",
    "code": "HSCI3421",
    "subject": "HSCI",
    "number": "3421",
    "honors": false,
    "writing": false,
    "name": "Engineering Ethics",
    "fullname": "Engineering Ethics",
    "info": "Ethical issues in engineering research and engineers' public responsibility/practice, using historical cases; historical development of engineering as a vocation/profession; ethical implications of advanced engineering systems such as nuclear weaponry and networked communications. ",
    "prereq": {}
  },
  {
    "uid": "810255",
    "code": "HSCI3611",
    "subject": "HSCI",
    "number": "3611",
    "honors": false,
    "writing": false,
    "name": "Enlightenment, Rev, Mod Sci",
    "fullname": "Enlightenment, Revolution, and the Rise of Modern Science",
    "info": "Understanding the origins of our own culture of Modern Science in the Enlightenment of the eighteenth century. Newton's ambiguous legacy; science as wonder and spectacle; automata and monsters; early theories of sex and gender; empire and scientific expeditions; reshaping the environment; inventing human sciences; Frankenstein and the limits of science and reason.",
    "prereq": {}
  },
  {
    "uid": "797187",
    "code": "HSCI3714",
    "subject": "HSCI",
    "number": "3714",
    "honors": false,
    "writing": false,
    "name": "Stone to Steam Engines",
    "fullname": "Stone Tools to Steam Engines: Technology and History to 1750",
    "info": "Technology is an enormous force in our society, and has become so important that in many ways it seems to have a life of its own. This course uses historical case studies to demonstrate that technology is not autonomous, but a human activity, and that people and societies made choices about the technologies they developed and used. It asks how technological differences between nations influenced their different courses of development, and why some societies seemed to advance while others did not. We ask how technological choices can bring about consequences greater than people expected, and how we might use this knowledge in making our own technological choices. In particular, we explore the historical background, development, and character of the most widespread technological systems the world has known, from prehistoric stone tool societies, through Egypt and the pyramids, ancient Greece and Rome, the explosion of Islam, and the dynamic and often violent technologies of medieval Europe.",
    "prereq": {}
  },
  {
    "uid": "797106",
    "code": "HSCI3715",
    "subject": "HSCI",
    "number": "3715",
    "honors": false,
    "writing": false,
    "name": "Mdrn Tech: Waterwheels to Web",
    "fullname": "History of Modern Technology: Waterwheels to the Web",
    "info": "This course explores the many technological systems that have come to span our globe, alongside the widespread persistence of traditional technologies. We start with the earliest glimmerings of modernity and industrialization, and move on in time to the building of global technological networks. How have people changed their worlds through technologies like steam engines and electronics? Is it a paradox that many traditional agricultural and household technologies have persisted? How have technologies of war remade the global landscape? We ask how business and government have affected technological entrepreneurs, from railroads to technologies of global finance. We end by considering the tension between technologies that threaten our global environment and technologies that offer us hopes of a new world.",
    "prereq": {}
  },
  {
    "uid": "797100",
    "code": "HSCI3814",
    "subject": "HSCI",
    "number": "3814",
    "honors": false,
    "writing": false,
    "name": "Hist Sci to Newton",
    "fullname": "Revolutions in Science: The Babylonians to Newton",
    "info": "Development and changing nature of sciences in their cultural context. Babylonian/Greek science. Decline/transmission of Greek science. Scientific Revolution (1500-1700) from Copernicus to Newton.",
    "prereq": {}
  },
  {
    "uid": "797101",
    "code": "HSCI3815",
    "subject": "HSCI",
    "number": "3815",
    "honors": false,
    "writing": false,
    "name": "Mdrn Sci: Atoms, Genes, Quanta",
    "fullname": "Making Modern Science: Atoms, Genes and Quanta",
    "info": "How scientists like Darwin and Einstein taught us to think about nature; everything from space, time and matter to rocks, plants, and animals.",
    "prereq": {}
  },
  {
    "uid": "009213",
    "code": "HSCI4050",
    "subject": "HSCI",
    "number": "4050",
    "honors": false,
    "writing": false,
    "name": "Spec. Topics HisSci",
    "fullname": "Special Topics in History of Science",
    "info": "Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "009212",
    "code": "HSCI4060",
    "subject": "HSCI",
    "number": "4060",
    "honors": false,
    "writing": false,
    "name": "Spec.Topics Hist of Technology",
    "fullname": "Special Topics in History of Technology",
    "info": "Topics specified in Class Schedule",
    "prereq": {}
  },
  {
    "uid": "009135",
    "code": "HSCI4111",
    "subject": "HSCI",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "Hist 19th-C Phys",
    "fullname": "History of 19th-Century Physics",
    "info": "Legacy of 17th-century experimental and theoretical physics.  Experimental and theoretical discoveries in 19th-century physics (light, atomic theory, heat, thermodynamics and statistical mechanics, electromagnetism) within the context of educational, institutional, and political developments in Europe and the United States.\n",
    "prereq": {}
  },
  {
    "uid": "009137",
    "code": "HSCI4121W",
    "subject": "HSCI",
    "number": "4121",
    "honors": false,
    "writing": true,
    "name": "Hist 20th-C Phys",
    "fullname": "History of 20th-Century Physics",
    "info": "The transition from classical to modern physics (relativity, quantum) and its architects (from Planck and Einstein to Heisenberg and Schrödinger). The WWII bomb projects in the US and in Germany. Post-war developments (solid state, particle physics).\n\nPrereq: calculus or permission from the instructor.",
    "prereq": {}
  },
  {
    "uid": "011217",
    "code": "HSCI4125",
    "subject": "HSCI",
    "number": "4125",
    "honors": false,
    "writing": false,
    "name": "Nuclear Age",
    "fullname": "The Nuclear Age",
    "info": "Discoveries of X-rays, radiation, the atom and its nucleus, and subatomic particles. Development of nuclear weapons/power. Nuclear legacies of Hiroshima, Eniwetak, Chernobyl, and the cold war.",
    "prereq": {}
  },
  {
    "uid": "009298",
    "code": "HSCI4302",
    "subject": "HSCI",
    "number": "4302",
    "honors": false,
    "writing": false,
    "name": "Hist. High-Tech.",
    "fullname": "History of High-Technology Weapons",
    "info": "Ancient missile launchers, gunpowder, cannons, and their role in expansion of West. Influence of arms-making on American system of manufacture. Naval warfare, air power, nuclear weapons, ICBMs, chemical/biological warfare, stealth/smart weapons.",
    "prereq": {}
  },
  {
    "uid": "008824",
    "code": "HSCI4321",
    "subject": "HSCI",
    "number": "4321",
    "honors": false,
    "writing": false,
    "name": "Hist of Computing",
    "fullname": "History of Computing",
    "info": "Developments in the last 150 years; evolution of hardware and software; growth of computer and semiconductor industries and their relation to other business areas; changing relationships resulting from new data-gathering and analysis techniques; automation; social and ethical issues.  ",
    "prereq": {}
  },
  {
    "uid": "008630",
    "code": "HSCI4455",
    "subject": "HSCI",
    "number": "4455",
    "honors": false,
    "writing": false,
    "name": "Women,Gender, & Science",
    "fullname": "Women, Gender, and Science",
    "info": "Three intersecting themes analyzed from 1700s to the present: women in science, sexual and gendered concepts in modern sciences, and impact of science on conceptions of sexuality and gender in society.",
    "prereq": {}
  },
  {
    "uid": "016259",
    "code": "HSCI5211",
    "subject": "HSCI",
    "number": "5211",
    "honors": false,
    "writing": false,
    "name": "History of Biology",
    "fullname": "Biology and Culture in the 19th and 20th Centuries",
    "info": "Changing conceptions of life and aims and methods of biology; changing relationships between biology and the physical and social sciences; broader intellectual and cultural dimensions of developments in biology.",
    "prereq": {}
  },
  {
    "uid": "797114",
    "code": "HSCI5242",
    "subject": "HSCI",
    "number": "5242",
    "honors": false,
    "writing": false,
    "name": "Navigating a Darwinian World",
    "fullname": "Navigating a Darwinian World",
    "info": "In this course we grapple with the impact of Darwin's theory of evolution in the scientific community and beyond. We'll examine and engage the controversies that have surrounded this theory from its inception in the 19th century through its applications in the 21st. What made Darwin a Victorian celebrity, a religious scourge, an economic sage and a scientific hero? We'll look closely at the early intellectual influences on theory development; study the changing and dynamic relationship between science and religion; and critically analyze the application of Darwin's theory to questions of human nature and behavior.",
    "prereq": {}
  },
  {
    "uid": "014533",
    "code": "HSCI5244",
    "subject": "HSCI",
    "number": "5244",
    "honors": false,
    "writing": false,
    "name": "Nature's History",
    "fullname": "Nature's History: Science, Humans, and the Environment",
    "info": "We examine environmental ideas, sustainability, conservation history; critique of the human impact on nature; empire and power in the Anthropocene; how the science of ecology has developed; and modern environmental movements around the globe. Case studies include repatriation of endangered species; ecology and evolutionary theory; ecology of disease; and climate change.",
    "prereq": {}
  },
  {
    "uid": "817570",
    "code": "HSCI5246",
    "subject": "HSCI",
    "number": "5246",
    "honors": false,
    "writing": false,
    "name": "(Un)Natural Disasters History",
    "fullname": "History of (Un)Natural Disasters",
    "info": "Earthquakes, hurricanes, tsunamis, wildfires, epidemic disease, and technological failures. This course will examine large scale natural events in American and world history, the social, technological, and environmental conditions that underlie them, and their historical consequences. Human societies have long been embedded in physical landscapes where they are subject to specific environmental conditions and physical risks: eight thousand-year-old wall paintings in Turkey depict the eruption of Hasan Dag volcano over the city of Catal Huyuk, for example. But then and now, it takes a certain combination of social conditions and environmental events to create a natural disaster. In this course, we will use historical natural disasters to explore the interconnections between the structures and ideas of human society and environmental forces. Humans have not been simply the random victims of natural disasters; where and how they chose to live influenced the impact of any disastrous event. Examining these events in a historical context will help us see the social, technological, scientific, and environmental systems that have been constantly interacting, but which are normally taken for granted until they break down.",
    "prereq": {}
  },
  {
    "uid": "016261",
    "code": "HSCI5331",
    "subject": "HSCI",
    "number": "5331",
    "honors": false,
    "writing": false,
    "name": "Tech Amer Culture",
    "fullname": "Technology and American Culture",
    "info": "Development of American technology in its cultural/intellectual context from 1790 to present. Transfer of technology to America. Establishment of an infrastructure promoting economic growth. Social response to technological developments.",
    "prereq": {}
  },
  {
    "uid": "016262",
    "code": "HSCI5332",
    "subject": "HSCI",
    "number": "5332",
    "honors": false,
    "writing": false,
    "name": "Science Shaping America",
    "fullname": "Science in the Shaping of America",
    "info": "The British colonies of North America were founded in precisely the same centuries as a revolution in European\u0092s understanding of nature, transformed by the ideas of Galileo, Newton, and Linnaeus and by the technologies of the industrial revolution. Native Americans and African Americans had their own knowledge of nature, and their close understanding intersected with the increasingly scientific techniques brought with European settlers and enhanced the survival and intellectual capacities of the newcomers. By demonstrating the diversity of scientists in the ever changing demographics of an immigrant nation, the course argues that this diversity and the capacities of newcomers contributed to the national success in science and engineering. The engagement with science at points were used to try to limit access by women or African-Americans, but sciences was also used to discredit false theories through ever expanding emphasis on empiricism as well as attention to the social and economic consequences of innovation. The goal is to demonstrate those historical linkages in particular places and institutions as they influenced and reinforced specific scientific work, while, at the same time, being attentive to how scientific ideas and practices were shaped by American culture.",
    "prereq": {}
  },
  {
    "uid": "009295",
    "code": "HSCI5401",
    "subject": "HSCI",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Ethics Sci/Tech",
    "fullname": "Ethics in Science and Technology",
    "info": "Historical issues involving ethics in science. Ethical problems posed by modern science/technology, including nuclear energy, chemical industry, and information technologies.",
    "prereq": {}
  },
  {
    "uid": "011197",
    "code": "HSCI5411",
    "subject": "HSCI",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Early Mod Art & Sci",
    "fullname": "Art and Science in Early Modern Europe",
    "info": "Interaction of art and science, from Renaissance to 19th century. Development of linear perspective, color theory, artistic practice, and scientific illustration/representation. ",
    "prereq": {}
  },
  {
    "uid": "807170",
    "code": "HSCI5421",
    "subject": "HSCI",
    "number": "5421",
    "honors": false,
    "writing": false,
    "name": "Engineering Ethics",
    "fullname": "Engineering Ethics",
    "info": "Engineering ethics in historical context, including the rise of professional engineering societies; ethical problems in engineering research and engineers' public responsibility; ethical implications of advanced engineering systems such as the production of nuclear weapons; development of codes of ethics in engineering.",
    "prereq": {}
  },
  {
    "uid": "810256",
    "code": "HSCI5611",
    "subject": "HSCI",
    "number": "5611",
    "honors": false,
    "writing": false,
    "name": "Enlightenment, Rev, Mod Sci",
    "fullname": "Enlightenment, Revolution, and the Rise of Modern Science",
    "info": "Understanding the origins of our own culture of Modern Science in the Enlightenment of the eighteenth century. Newton's ambiguous legacy; science as wonder and spectacle; automata and monsters; early theories of sex and gender; empire and scientific expeditions; reshaping the environment; inventing human sciences; Frankenstein and the limits of science and reason.",
    "prereq": {}
  },
  {
    "uid": "009211",
    "code": "HSCI5993",
    "subject": "HSCI",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Guided individual reading or study.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009210",
    "code": "HSCI5994",
    "subject": "HSCI",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "TBD\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009162",
    "code": "HSCI8111",
    "subject": "HSCI",
    "number": "8111",
    "honors": false,
    "writing": false,
    "name": "Historiography",
    "fullname": "Historiography of Science and Technology",
    "info": "Review of methods and historiography. Tools needed to perform creative work in the field. Models of historical practice, different schools of history, work of representative historians of science and technology.",
    "prereq": {}
  },
  {
    "uid": "799082",
    "code": "HSCI8112",
    "subject": "HSCI",
    "number": "8112",
    "honors": false,
    "writing": false,
    "name": "Historiography",
    "fullname": "Historiography of Science, Technology, and Medicine",
    "info": "Models of practice, different schools. Work of representative historians of science, technology, and medicine.",
    "prereq": {}
  },
  {
    "uid": "799476",
    "code": "HSCI8113",
    "subject": "HSCI",
    "number": "8113",
    "honors": false,
    "writing": false,
    "name": "Research Methods",
    "fullname": "Research Methods in the History of Science, Technology, and Medicine",
    "info": "Introduction to sources, methods, and problems of research in history of science, technology, and medicine. Preparation of major research paper under faculty supervision.",
    "prereq": {}
  },
  {
    "uid": "008846",
    "code": "HSCI8124",
    "subject": "HSCI",
    "number": "8124",
    "honors": false,
    "writing": false,
    "name": "Ancient Science",
    "fullname": "Foundations for Research in Ancient Science",
    "info": "Development of natural/mathematical science in ancient Near East and Classical Greece.\n\nprereq: Grad HSci major or minor or instr consent",
    "prereq": {}
  },
  {
    "uid": "016473",
    "code": "HSCI8125",
    "subject": "HSCI",
    "number": "8125",
    "honors": false,
    "writing": false,
    "name": "Sci. Revolution",
    "fullname": "Foundations for Research in the Scientific Revolution",
    "info": "Development of sciences/natural philosophy, 1500-1725.\n\nprereq: Grad HSci major or minor or instr consent",
    "prereq": {}
  },
  {
    "uid": "799076",
    "code": "HSCI8131",
    "subject": "HSCI",
    "number": "8131",
    "honors": false,
    "writing": false,
    "name": "Industrial Revolutions",
    "fullname": "Industrial Revolutions",
    "info": "Development of industrial society, from 1700 through 1850.  Emphasizes developments in mechanical/engineering sciences. Scientific, economic, political, and social dimensions of industrialization.",
    "prereq": {}
  },
  {
    "uid": "788128",
    "code": "HSCI8333",
    "subject": "HSCI",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "008868",
    "code": "HSCI8421",
    "subject": "HSCI",
    "number": "8421",
    "honors": false,
    "writing": false,
    "name": "Soc Cult Stud Sci",
    "fullname": "Social and Cultural Studies of Science",
    "info": "Review of recent work; theoretical and methodological differences among practitioners; selected responses from historians and philosophers of science.  ",
    "prereq": {}
  },
  {
    "uid": "008227",
    "code": "HSCI8441",
    "subject": "HSCI",
    "number": "8441",
    "honors": false,
    "writing": false,
    "name": "Women Sci: Hist Per",
    "fullname": "Women in Science: Historical Perspectives",
    "info": "Key literature dealing with patterns of participation in science and medicine since the 18th century. The ways in which modern science is perceived to be gendered, particularly in its practice and in ways that seem to influence theory and applications.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788363",
    "code": "HSCI8444",
    "subject": "HSCI",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788487",
    "code": "HSCI8666",
    "subject": "HSCI",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788612",
    "code": "HSCI8777",
    "subject": "HSCI",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required (Plan A only)",
    "prereq": {}
  },
  {
    "uid": "802194",
    "code": "HSCI8830",
    "subject": "HSCI",
    "number": "8830",
    "honors": false,
    "writing": false,
    "name": "Topics in HSciTechMed",
    "fullname": "Topics in the History of Science, Technology, and Medicine",
    "info": "Historical literature of topics common to history of science, technology, and medicine.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "787882",
    "code": "HSCI8888",
    "subject": "HSCI",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "008430",
    "code": "HSCI8900",
    "subject": "HSCI",
    "number": "8900",
    "honors": false,
    "writing": false,
    "name": "Sem:Early Phys Sci",
    "fullname": "Seminar: History of Early Physical Science",
    "info": "For advanced graduate students; topics in development of natural and mathematical science before 1800.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008431",
    "code": "HSCI8910",
    "subject": "HSCI",
    "number": "8910",
    "honors": false,
    "writing": false,
    "name": "Sem: Mod Phys Sci",
    "fullname": "Seminar: History of Modern Physical Sciences",
    "info": "For advanced graduate students; topics in development of physical sciences since 1800.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008433",
    "code": "HSCI8920",
    "subject": "HSCI",
    "number": "8920",
    "honors": false,
    "writing": false,
    "name": "Sem: Bio Sciences",
    "fullname": "Seminar: History of Biological Sciences",
    "info": "For advanced graduate students; topics in development of natural, biological, and medical sciences from Aristotle to the present.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008434",
    "code": "HSCI8930",
    "subject": "HSCI",
    "number": "8930",
    "honors": false,
    "writing": false,
    "name": "Sem: Technology",
    "fullname": "Seminar: History of Technology",
    "info": "For advanced graduate students; topics in development of technology from ancient times to the present.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008435",
    "code": "HSCI8940",
    "subject": "HSCI",
    "number": "8940",
    "honors": false,
    "writing": false,
    "name": "Sem: SciTech Amer",
    "fullname": "Seminar: History of Science and Technology in the Americas",
    "info": "For advanced graduate students; topics in development of science and technology, emphasizing the United States and Canada.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "008436",
    "code": "HSCI8950",
    "subject": "HSCI",
    "number": "8950",
    "honors": false,
    "writing": false,
    "name": "Sem: SciTechCultSet",
    "fullname": "Seminar: Science and Technology in Cultural Settings",
    "info": "For advanced graduate students; topics in development of science and technology in or across specific geographic regions or particular cultures.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009205",
    "code": "HSCI8993",
    "subject": "HSCI",
    "number": "8993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "TBD\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "009204",
    "code": "HSCI8994",
    "subject": "HSCI",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "TBD",
    "prereq": {}
  }
]