[
  {
    "uid": "812238",
    "code": "IBH6002",
    "subject": "IBH",
    "number": "6002",
    "honors": false,
    "writing": false,
    "name": "Portfolio Review",
    "fullname": "Portfolio Review",
    "info": "Required one credit registration for portfolio completion. Permission to register for IBH 6002 is dependent on submission of the Portfolio.",
    "prereq": {}
  },
  {
    "uid": "808442",
    "code": "IBH6021",
    "subject": "IBH",
    "number": "6021",
    "honors": false,
    "writing": false,
    "name": "Client Centered Care",
    "fullname": "Methods and Models III: Synthesis Seminar in Client Centered Care",
    "info": "Chronic substance use disorders or co-occurring combination. Applying step-wise, individualized, recovery oriented evidence-based practices for risk reduction, relapse prevention, recovery maintenance. Use case studies to evaluate/apply risk reduction/personalized interventions.",
    "prereq": {}
  },
  {
    "uid": "813208",
    "code": "IBH6022",
    "subject": "IBH",
    "number": "6022",
    "honors": false,
    "writing": false,
    "name": "Found. of Psych. Assessment",
    "fullname": "Foundations of Psychological Assessment",
    "info": "Course focuses on major concepts and principles of educational and psychological assessment and the use of standardized instruments with differing populations.",
    "prereq": {}
  },
  {
    "uid": "808443",
    "code": "IBH6031",
    "subject": "IBH",
    "number": "6031",
    "honors": false,
    "writing": false,
    "name": "Trauma and Anxiety",
    "fullname": "Methods and Models IV: Trauma and Anxiety, Assessment and Treatment Intervention",
    "info": "Basic/applied research on trauma/anxiety. Assessing/treating anxiety/post-trauma reactions in adults. Definition of anxiety, traumatic events. Assessment methods, PTSD assessment interview. Theory/techniques of evidence-based treatments. Field placement component. ",
    "prereq": {}
  },
  {
    "uid": "812237",
    "code": "IBH6032",
    "subject": "IBH",
    "number": "6032",
    "honors": false,
    "writing": false,
    "name": "Adv. Multicultural Practice",
    "fullname": "Advanced Multicultural Practice",
    "info": "Incorporate various sources of knowledge/content to provide deepening perspective on multiple layers of diversity/counseling individuals with substance use/co-occurring mental health disorders. Aspects of various cultural experiences (i.e., race/ethnicity, class status, sexual/affectional orientation, gender, religion) as they impinge upon client, counselor, counseling relationship.\n\nprereq: ADDS 5081 or equivalent",
    "prereq": {}
  },
  {
    "uid": "818913",
    "code": "IBH6036",
    "subject": "IBH",
    "number": "6036",
    "honors": false,
    "writing": false,
    "name": "Trauma Focused Approaches",
    "fullname": "Trauma Focused Approaches and Crisis Intervention",
    "info": "This course will give students a foundation for assessing and treating post-trauma responses in various populations through the exploration of current theory, conceptualization, and models related to trauma and crisis intervention. Major treatment approaches to be covered will include Stress-Inoculation Therapy (SIT), Cognitive Processing Therapy (CPT), Seeking Safety, and Eye-Movement Desensitization and Reprocessing (EMDR). Special emphasis will be given to survivors of various types of trauma (e.g. Historical trauma, Abuse/Neglect) and Post-Traumatic Stress Disorder (PTSD). ",
    "prereq": {}
  },
  {
    "uid": "808469",
    "code": "IBH6041",
    "subject": "IBH",
    "number": "6041",
    "honors": false,
    "writing": false,
    "name": "PET for PTSD",
    "fullname": "Prolonged Exposure Therapy for PTSD",
    "info": "Advanced practice methods and interventions for working with trauma and co-occurring disorders. Emerging and evidence-based practices presented, practiced, and applied.",
    "prereq": {}
  },
  {
    "uid": "808470",
    "code": "IBH6051",
    "subject": "IBH",
    "number": "6051",
    "honors": false,
    "writing": false,
    "name": "Advanced Group Practice",
    "fullname": "Advanced Group Practice",
    "info": "Advanced Group Practice is a graduate level course designed to allow students to apply previously learned group theories and concepts in an experiential environment. Students will explore a variety of theoretical orientations (cognitive behavioral therapy, existentialism, psychodynamic, and person centered) through readings, short papers, and in-class group exercises, in addition to participating in structured inpatient group experience. Students will be expected to lead groups with a peer co-leader in class and co-lead therapeutic groups with the instructor outside of class. An important emphasis of this course will be in-class processing of group leadership skills, interventions, group dynamics, ethical dilemmas, documentation of process notes, and reactions to clients within the groups. ",
    "prereq": {}
  },
  {
    "uid": "808471",
    "code": "IBH6061",
    "subject": "IBH",
    "number": "6061",
    "honors": false,
    "writing": false,
    "name": "Applied Advanced Diagnostics I",
    "fullname": "Applied Advanced Diagnostics I",
    "info": "Diagnosing individuals with chronic/persistent mental health disorders, personality disorders, associated substance use disorders. Case studies, field placement with multidisciplinary team.",
    "prereq": {}
  },
  {
    "uid": "809838",
    "code": "IBH6062",
    "subject": "IBH",
    "number": "6062",
    "honors": false,
    "writing": false,
    "name": "Applied Adv Diagnostics II",
    "fullname": "Applied Advanced Diagnostics II",
    "info": "Applied Advanced Diagnostics II.\n\nprereq: 6061, must be admitted IBH student",
    "prereq": {
      "and": [
        "808471"
      ]
    }
  },
  {
    "uid": "808444",
    "code": "IBH6071",
    "subject": "IBH",
    "number": "6071",
    "honors": false,
    "writing": false,
    "name": "Advanced Professional Issues",
    "fullname": "Advanced Professional Issues: Ethics",
    "info": "Develop ethical decision model that incorporates five moral principles. ACA/NAADAC codes of ethics/statutes/regulations that apply to mental health/substance abuse counseling. Case studies.",
    "prereq": {}
  },
  {
    "uid": "808446",
    "code": "IBH6091",
    "subject": "IBH",
    "number": "6091",
    "honors": false,
    "writing": false,
    "name": "Career and Mental Health",
    "fullname": "Intersection of Career and Mental Health",
    "info": "Vocational choice theory, lifestyle choices, occupational/educational information, career exploration, assessment tools. Diverse populations/ethical standards. Employment/career concerns for persons with mental health, substance use, previously incarcerated.",
    "prereq": {}
  },
  {
    "uid": "809290",
    "code": "IBH6112",
    "subject": "IBH",
    "number": "6112",
    "honors": false,
    "writing": false,
    "name": "Management and Administration",
    "fullname": "Mental Health and Addiction Management and Administration",
    "info": "State/regulatory standards rules/statutes. Health care financing/reimbursement. prereq: ADDS 5091 or ADDS 4001",
    "prereq": {
      "or": [
        "794984"
      ]
    }
  },
  {
    "uid": "812230",
    "code": "IBH6121",
    "subject": "IBH",
    "number": "6121",
    "honors": false,
    "writing": false,
    "name": "Portfolio Development",
    "fullname": "Professional Seminar 2: Portfolio Development",
    "info": "The purpose of this seminar is to provide the groundwork for the development of the professional portfolio and should be taken 1 to 2 semesters before you plan to register for the IBH 8002 portfolio. Discussion and practice will focus on the main components to be included in the student's professional portfolio such as professional statements and clinical competencies.IBH 6121 should be taken after completion of 50 credits. ",
    "prereq": {}
  },
  {
    "uid": "809861",
    "code": "IBH6222",
    "subject": "IBH",
    "number": "6222",
    "honors": false,
    "writing": false,
    "name": "Adolescents Co-occurring",
    "fullname": "Adolescents and Co-occurring Substance Use and Mental Health Disorders",
    "info": "Adolescents differ from adults physiologically, cognitively, and emotionally. Therefore, it is important for professionals who come into regular contact with this population to be familiar with the developmental issues and current trends in adolescent substance use. It is also essential to be able to recognize the risk and protective factors, biopsychosocial effects, and signs of potential substance use problems in adolescents.",
    "prereq": {}
  },
  {
    "uid": "809862",
    "code": "IBH6224",
    "subject": "IBH",
    "number": "6224",
    "honors": false,
    "writing": false,
    "name": "Spirituality in Practice",
    "fullname": "Integrating Spirituality in Counseling Practice",
    "info": "Knowledge/skills of counseling students/practitioners in professional competencies for addressing spiritual/religious issues. Lecture, discussion, experiential exercises/readings to advance cognitive, interpersonal/practical skills. Treatment of persons with co-occurring disorders.",
    "prereq": {}
  },
  {
    "uid": "809863",
    "code": "IBH6226",
    "subject": "IBH",
    "number": "6226",
    "honors": false,
    "writing": false,
    "name": "Intro to Vital Involvement",
    "fullname": "Introduction to Vital Involvement Practice (VIP)",
    "info": "Students will understand how to utilize VIP principles to help empower clients in living their everyday lives in ways that achieve personal goals, promote health, exercise strengths, prevent problems, and contribute to the community.",
    "prereq": {}
  },
  {
    "uid": "809864",
    "code": "IBH6227",
    "subject": "IBH",
    "number": "6227",
    "honors": false,
    "writing": false,
    "name": "Supervision Models and Methods",
    "fullname": "Supervision Models and Methods in Integrated Behavioral Health",
    "info": "This course will provide an overview of the practice of supervision and will identify its role in meeting the current demands of the practice environment. The course is based on sound practice principles and will offer a comprehensive framework for understanding the administrative, educational, and supportive functions of supervision. The main topics covered in this course are supervisory techniques and relationship; styles and methods of supervision; legal, ethical, and theoretical issues related to clinical supervision and consultation.",
    "prereq": {}
  },
  {
    "uid": "809867",
    "code": "IBH6228",
    "subject": "IBH",
    "number": "6228",
    "honors": false,
    "writing": false,
    "name": "Program Administration",
    "fullname": "Mental Health and Addiction Program Administration",
    "info": "Most often, good employees or strong counselors are promoted into leadership positions with an assumption that a good clinician is a good leader. This course will review strategies to develop strong leaders along with understanding of the importance of regulations and accreditation standards in creating consistent practice and consistency across all treatment programs.\n\nStudents will obtain an introductory understanding of leadership skills and begin using evidence-based leadership. Students will review and apply Department of Human Service Statutes and Joint Commission Standards. Students will learn how to read budgets and complete a review and analysis of assigned budgets.",
    "prereq": {}
  },
  {
    "uid": "809868",
    "code": "IBH6229",
    "subject": "IBH",
    "number": "6229",
    "honors": false,
    "writing": false,
    "name": "Crisis Assessment and Mgmt",
    "fullname": "Crisis Assessment and Management",
    "info": "Observe/participate with five different levels of crisis intervention settings. Chemical dependency evaluation,  hospital emergency department, mental health urgent care, mental health clinic, community mobile crisis intervention.\n\nprereq: [AddS 5091 or AddS 4001], dept consent, background check",
    "prereq": {
      "or": [
        "794984"
      ]
    }
  },
  {
    "uid": "809869",
    "code": "IBH6230",
    "subject": "IBH",
    "number": "6230",
    "honors": false,
    "writing": false,
    "name": "Clinical Application in PET",
    "fullname": "Clinical Application in Prolonged Exposure Therapy",
    "info": "Clinical Application in Prolonged Exposure Therapy.",
    "prereq": {}
  },
  {
    "uid": "810668",
    "code": "IBH6231",
    "subject": "IBH",
    "number": "6231",
    "honors": false,
    "writing": false,
    "name": "Management of Eating Disorders",
    "fullname": "Management of Eating Disorders",
    "info": "Etiology, occurrence, course, treatment, prevention of eating disorders from multidisciplinary perspective. Roles/responsibilities of eating disorder treatment team members of varying types across various treatment milieus.",
    "prereq": {}
  },
  {
    "uid": "817190",
    "code": "IBH6232",
    "subject": "IBH",
    "number": "6232",
    "honors": false,
    "writing": false,
    "name": "Sexual Health and Gender",
    "fullname": "Sexual Health and Gender",
    "info": "This is a graduate level course that is meant to broaden your understanding of issues regarding sexual health and gender that you may encounter in the therapy session. A large part of this course is focused on increasing your comfort and competence in having conversations about sexual health and gender with your clients, as well as knowing when to intervene and when to refer. Additional attention will be given to developing and keeping appropriate boundaries with clients when addressing issues of sexual health and gender. Theoretical frameworks regarding human sexuality, sexual disorders, normative vs. non-normative sexual behavior, issues of gender identity and expression, and applicable therapeutic interventions will be discussed. Specific focus will also be given to the co-occurrence of sexual and gender concerns with mental health and substance use disorders, including discussions regarding prevalence and potential presentations. Please be aware that in the process of this course, you will be asked to engage in dialogue about and reflect upon your own beliefs and values around issues of sex, sexuality, relationships, gender identity, etc. It is expected that you be willing to challenge yourself to critically examine course discussions and materials, particularly as they may apply to your future work as a counselor.\n\nThis  course  combines  the  use  of  lectures,  group  discourse,  group  presentations,  clinical role-plays, readings, self-reflective activities, and additional experiential exercises to aid you in expanding your knowledge base and competence in managing these issues as they may arise in the therapy session.\n",
    "prereq": {}
  },
  {
    "uid": "816771",
    "code": "IBH6233",
    "subject": "IBH",
    "number": "6233",
    "honors": false,
    "writing": false,
    "name": "DBT Skills Training",
    "fullname": "DBT Skills Training: Group Practices and Treatment Modalities",
    "info": "This course focuses on teaching the delivery of Dialectical Behavior Therapy (DBT) Treatment: Skills Training in a group format. This opportunity allows students to learn the skills taught in a DBT Program as well as learn the treatment components involved in a behavioral therapy orientation. Students will explore the core skill of mindfulness, behavioral therapy, dialectics, and cognitive behavioral therapy in a group and experiential format. Students will be expected to participate in weekly group discussion and assignments. Discussion will assist students with learning how this treatment is delivered to clients. Weekly assignments will provide experiential learning of skills group and mindfulness, the foundation skill in a DBT Program.",
    "prereq": {}
  },
  {
    "uid": "817192",
    "code": "IBH6234",
    "subject": "IBH",
    "number": "6234",
    "honors": false,
    "writing": false,
    "name": "Counseling Grief and Loss",
    "fullname": "Counseling Grief and Loss",
    "info": "This course will provide students with an overview of current conceptualizations of grief and loss. It will prepare students with specialized knowledge and skills for understanding and identifying the process/progress of how people deal with loss. Special attention will be given to theoretical foundations of grief and loss, different types of loss, impact of loss, and cultural considerations. Additional strategies will be presented for intervening with those who have been impacted by loss.",
    "prereq": {}
  },
  {
    "uid": "827079",
    "code": "IBH6301",
    "subject": "IBH",
    "number": "6301",
    "honors": false,
    "writing": false,
    "name": "Career Counseling Prof Devlp",
    "fullname": "Career Counseling and Professional Development",
    "info": "This course is designed to engage you in an exploration of career development and its importance to mental health. The relationship between an individual and their work/career is explored in the context of vocational theories and decision-making models. The course includes an introduction to assessment tools and techniques commonly used in career counseling. Attention is given to the interrelationships and influence of family, gender, lifespan, and diversity in career development and to the application of theory to practice. Students will also reflect on their own personal and professional career development. ",
    "prereq": {}
  },
  {
    "uid": "817929",
    "code": "IBH6305",
    "subject": "IBH",
    "number": "6305",
    "honors": false,
    "writing": false,
    "name": "Counseling Theories",
    "fullname": "Applications of Counseling Theories",
    "info": "This course introduces students to foundational and modern counseling theories with an emphasis on critical analysis, intentional integration of theoretical perspectives, and application to clinical practice. Theory is applied to clinical practice as it informs case conceptualization, role of the therapeutic relationship, and specific clinical interventions and processes. Emphasis is placed on critically analyzing theories for socio-cultural attunement and the realities of working with diverse populations and presenting concerns. Individual and systemic perspectives are explored, and students will have in-depth application experience through ongoing role-plays in which they will further develop basic counseling skills and practice applying interventions learned in the course. Emphasis will also be placed on self-of-the-counselor awareness as students work to identify theories that align with their personal approaches to counseling. As a summative assessment, students will develop their own integrated approach to counseling informed by theories.",
    "prereq": {}
  },
  {
    "uid": "808441",
    "code": "IBH6311",
    "subject": "IBH",
    "number": "6311",
    "honors": false,
    "writing": false,
    "name": "Differential Diagnosis",
    "fullname": "Differential Diagnosis",
    "info": "This course is designed to provide students with exposure and experience with the current standard used in diagnosing mental disorders, including co-occurring diagnosis, utilizing the DSM 5-TR. Considering the diversity of biological, psychological, social, and spiritual dimensions of each person, students will be challenged to approach the assessment and diagnosis of individuals with mental and emotional disorders in a holistic approach. Students will gain a familiarity with various diagnostic criteria and applications of diagnosis criteria through case examples and case studies.",
    "prereq": {}
  },
  {
    "uid": "808447",
    "code": "IBH6315",
    "subject": "IBH",
    "number": "6315",
    "honors": false,
    "writing": false,
    "name": "Family Dynamics in Counseling",
    "fullname": "Family Dynamics in Counseling",
    "info": "This course provides an introduction to family counseling and therapy with an emphasis on developing systemic case conceptualization skills and counseling skills for sessions with multiple, interconnected participants. Students learn major theories in Family Therapy including, Family Systems Theory, Bowen Intergenerational Family Systems Theory, Strategic Family Therapy, Structural Family Therapy, Experiential Family Therapy, Psychodynamic Family Therapy, Narrative Therapy, Solution-Focused Brief Family Therapy, and Internal Family Systems Theory. Students are introduced to clinical implications for working with romantic partners and parent-child dyads, with specific attention to working with adolescents and their families. Clinical skills are taught with an emphasis on understanding healthy and symptomatic family functioning and development across the life course.",
    "prereq": {}
  },
  {
    "uid": "827096",
    "code": "IBH6321",
    "subject": "IBH",
    "number": "6321",
    "honors": false,
    "writing": false,
    "name": "Trauma and Crisis Intervention",
    "fullname": "Trauma and Crisis Intervention",
    "info": "This course will give students a foundation for assessing and treating post-trauma responses in various populations through the exploration of current theory, conceptualization, and models related to trauma and crisis intervention. The course covers numerous types of traumatic events, impact, assessment, and common elements in treatment approaches for trauma. The course will prepare students to work with clients who have experienced trauma, utilize crisis intervention strategies, and understand psychological first aid. Special attention will be on evidence-based approaches such as Prolonged Exposure Therapy (PE), Eye movement desensitization and reprocessing (EMDR), Trauma-focused Cognitive Behavioral Therapy (TF-CBT), and others throughout the semester. ",
    "prereq": {}
  },
  {
    "uid": "827098",
    "code": "IBH6325",
    "subject": "IBH",
    "number": "6325",
    "honors": false,
    "writing": false,
    "name": "Applications of Assessment",
    "fullname": "Applications of Assessment",
    "info": "This course will examine the principles of assessment in a counseling context, including concepts necessary for the selection, administration, scoring, and interpretation of tests. Assessment is an essential part of counseling. To prepare future counselors to regularly assess their clients through informal information-gathering, standardized testing is part of the diagnostic process. To effectively select, administer, and interpret formal and informal instruments, counselors must understand both ethical and cultural factors and fundamental concepts of reliability, validity, and applicability. This course will prepare students to complete diagnostic assessments.",
    "prereq": {}
  },
  {
    "uid": "808445",
    "code": "IBH6331",
    "subject": "IBH",
    "number": "6331",
    "honors": false,
    "writing": false,
    "name": "Human Lifespan Development",
    "fullname": "Human Lifespan Development",
    "info": "Human Lifespan Development is designed to introduce students to human development across the lifespan with an emphasis on developmental implications for clinical diagnosis, case conceptualization, and treatment. The course examines the characteristic changes in human development from conception to death and the influence of  biophysical, psychological, family, and social factors on individual development. Fundamental theories, critical perspectives, and recent research will be examined. Students will practice advocacy skills in this course in an attempt to expand optimal developmental conditions, wellness, and resilience for all people. This course combines the use of reading, video, lecture, discussion, and interactive activities to advance students' understanding of development and ability to apply knowledge of human development to clinical work.",
    "prereq": {}
  },
  {
    "uid": "827170",
    "code": "IBH6905",
    "subject": "IBH",
    "number": "6905",
    "honors": false,
    "writing": false,
    "name": "Practicum",
    "fullname": "Practicum",
    "info": "ADDS/IBH 6905 is a summative course experience that brings together content area knowledge acquired in courses in the program and applies it to clinical practice for the first time. The first half of the course will provide the groundwork for the development of one’s professional portfolio, a reflective collection and analysis of work completed in the program. The portfolio will serve to synthesize foundational knowledge and self-reflective development as a future clinician. The second half of the course will bridge the gap between content knowledge and clinical application and will equip students with practical knowledge related to the clinical realities of substance use and mental health treatment and provide supervision of the first 100 hours of internship. This comprehensive course is designed to help students develop and refine counseling skills and foster the growth of a professional counselor identity. With a focus on the Twelve Core Functions of substance use disorder counseling and direct client service, including a minimum of 40 hours of direct service experience, participants will advance their proficiency in evidence-based practices. Working under the guidance of licensed counselors in the behavioral and mental health field, students will accrue clinical hours at sites dedicated to professional counseling for emotional, behavioral, and mental disorders, including substance-use disorders. ",
    "prereq": {}
  },
  {
    "uid": "809391",
    "code": "IBH6910",
    "subject": "IBH",
    "number": "6910",
    "honors": false,
    "writing": false,
    "name": "Topics in IBH",
    "fullname": "Topics in Integrated Behavioral Health",
    "info": "Topics in Integrated Behavioral Health.",
    "prereq": {}
  },
  {
    "uid": "809283",
    "code": "IBH6950",
    "subject": "IBH",
    "number": "6950",
    "honors": false,
    "writing": false,
    "name": "Topics: Multicultural Practice",
    "fullname": "Topics in Multicultural Practice",
    "info": "Topics in multicultural practice.",
    "prereq": {}
  },
  {
    "uid": "808449",
    "code": "IBH6993",
    "subject": "IBH",
    "number": "6993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study in Integrated Behavioral Health",
    "info": "Directed study.\n\nprereq: Must be admitted IBH student, dept consent",
    "prereq": {}
  },
  {
    "uid": "808450",
    "code": "IBH6994",
    "subject": "IBH",
    "number": "6994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research in Integrated Behavioral Health",
    "info": "Directed research.\n\nprereq: Must be admitted IBH student, dept consent",
    "prereq": {}
  },
  {
    "uid": "808451",
    "code": "IBH6996",
    "subject": "IBH",
    "number": "6996",
    "honors": false,
    "writing": false,
    "name": "Counseling Internship",
    "fullname": "Counseling Internship",
    "info": "IBH 6996 Counseling Internship is a comprehensive course designed to help students develop and refine counseling skills, foster their growth as an early clinician, and will build off of previous applied work via course experiences, employment, or volunteer work. This is the final course in a series of courses preparing and experiencing applied clinical work.Participants will advance their proficiency in the use of evidence-based practices. Working under the guidance of licensed clinicians in the behavioral and mental health field, students will accrue clinical hours at sites dedicated to professional counseling for emotional, behavioral, and mental disorders, including substance-use disorders. During the clinical placement, students will actively observe and co-facilitate both individual and group counseling sessions, tailored to their developmental level and supervised by a field supervisor. Alongside weekly onsite supervision, participants will engage in 2-hour weekly seminar sessions with a faculty member. Students are required to maintain a detailed log of their clinical hours, subject to verification by the onsite supervisor. Furthermore, students will participate in evaluations conducted by both onsite and faculty supervisors, assessing their knowledge, skills, and professional dispositions. Clear communication of individual licensing needs is the responsibility of each student, facilitated through ongoing dialogue with the course instructor.",
    "prereq": {}
  }
]