[
  {
    "uid": "827198",
    "code": "ICP1201",
    "subject": "ICP",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Mil Medic to Med School: Sem I",
    "fullname": "Military Medic to Medical School: Seminar I",
    "info": "This seminar course is required for students in the Military Medic to Medical School (MM2MS) Program. The primary takeaway of this course is preparation for the transition from students' military experiences to medical school and the civilian healthcare setting. Through this process, students will demonstrate their critical thinking and analytical skills, build skills needed to be successful in medical school, and complete the application to medical school. In doing so, students will contextualize their experiences to support them in establishing or reaffirming a plan for the next steps of entry into medical school and the healthcare workforce.",
    "prereq": {}
  },
  {
    "uid": "827199",
    "code": "ICP1202",
    "subject": "ICP",
    "number": "1202",
    "honors": false,
    "writing": false,
    "name": "Mil Medic to Med Schl: Sem II",
    "fullname": "Military Medic to Medical School: Seminar II",
    "info": "This seminar course is the second of two required courses for students in the Military Medic to Medical School (MM2MS) Program. The primary takeaway of this course is preparation for the transition from students' military experiences to medical school and the civilian healthcare setting. Through this process, students will demonstrate their critical thinking and analytical skills and build skills needed to be successful in medical school. In doing so, students will contextualize their experiences to support them in establishing or reaffirming a plan for the next steps of entry into medical school and the healthcare workforce.",
    "prereq": {}
  },
  {
    "uid": "793698",
    "code": "ICP3000",
    "subject": "ICP",
    "number": "3000",
    "honors": false,
    "writing": false,
    "name": "Career Skills",
    "fullname": "Career Skills in the Professional Environment",
    "info": "Career planning and job search processes appropriate to business/professional careers in corporate culture.\n\nprereq: 60 cr",
    "prereq": {}
  },
  {
    "uid": "014629",
    "code": "ICP3093",
    "subject": "ICP",
    "number": "3093",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Independent, directed study.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "810225",
    "code": "ICP3101W",
    "subject": "ICP",
    "number": "3101",
    "honors": false,
    "writing": true,
    "name": "Proposal Development",
    "fullname": "Proposal Development",
    "info": "A required course for Inter-College Program (ICP) and Health and Wellbeing Sciences (HWS) students. Provides the opportunity to explore together the three sections of the individualized degree proposal: Goals, Background, and Course of Study. Students will derive content for the proposal, select curriculum, and prepare developmental drafts and a final draft for program/departmental review. Peer review, discussion, and writing exercises will enhance the proposal development process and the final product. \n\nprereq:  Admission to the Inter-College Program or Health and Wellbeing Sciences major",
    "prereq": {}
  },
  {
    "uid": "807759",
    "code": "ICP3201",
    "subject": "ICP",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Career and Internship Prep",
    "fullname": "Career and Internship Preparation",
    "info": "Self exploration, networking, industry research, job/internship search, resumes, cover letters, interviewing, salary negotiation, goal setting.\n\nprereq: Soph or jr or sr or grad student",
    "prereq": {}
  },
  {
    "uid": "826923",
    "code": "ICP4101",
    "subject": "ICP",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Senior Experience",
    "fullname": "Senior Experience",
    "info": "This course is for students in their final year of either the Inter-College Program or the Health and Wellbeing Sciences major. The primary takeaway of this course is an e-portfolio, for which students will revisit and synthesize the most meaningful of their academic artifacts and experiences. Through this process, students will demonstrate their recently acquired critical thinking and analytical skills. They will contextualize these experiences to establish or reaffirm a plan to launch them into the next phase of career and academic development.  Students must have a fully approved proposal and degree plan.",
    "prereq": {}
  }
]