[
  {
    "uid": "007597",
    "code": "ID1202",
    "subject": "ID",
    "number": "1202",
    "honors": false,
    "writing": false,
    "name": "Career Ex II",
    "fullname": "Career Exploration II",
    "info": "Intended for freshmen or sophomores. A practical introduction to how classes, research projects, internships, community service, work experience, and travel play major roles in your future success. Internship/career search strategies and tools are taught including resume writing, networking, and internet research.",
    "prereq": {}
  },
  {
    "uid": "006692",
    "code": "ID3211",
    "subject": "ID",
    "number": "3211",
    "honors": false,
    "writing": false,
    "name": "Internship",
    "fullname": "Internship: Perspectives on Work",
    "info": "Combines practical experience in an internship with reflection upon work in our society. Organizational structure, work as a cultural phenomenon, history of concepts of work, relationship of work to broader demands of citizenship.",
    "prereq": {}
  },
  {
    "uid": "006693",
    "code": "ID3301",
    "subject": "ID",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Intro to Marxism",
    "fullname": "Introduction to Marxism",
    "info": "Marxist philosophy as a worldview and methodology for study of processes in nature, society, and thought; linkage between technological development and evolution of class-divided societies; economic theory of capitalism and socialism; transition to socialism theory and practice; racism, sexism, homophobia, and national conflicts; aesthetics.\n",
    "prereq": {}
  },
  {
    "uid": "007753",
    "code": "ID3311",
    "subject": "ID",
    "number": "3311",
    "honors": false,
    "writing": false,
    "name": "Museum Exhibits",
    "fullname": "Museum Exhibits: From Initial Vision to Practical Implementation",
    "info": "Introduces students to museum exhibit development culminating in the students designing a science exhibit. Study content research, educational strategies of informal science education, design, production stages, marketing, and evaluation. Multidisciplinary involving teachers in graphic art, biology, communication, marketing, science education, and others. ",
    "prereq": {}
  },
  {
    "uid": "787711",
    "code": "ID3321",
    "subject": "ID",
    "number": "3321",
    "honors": false,
    "writing": false,
    "name": "AIDS/HIV: Ethical Issues",
    "fullname": "AIDS/HIV: Ethical Issues",
    "info": "Multidisciplinary examination of AIDS/HIV in cultural context. Ethical issues in educational, medical, and political responses to AIDS. Community resources available to people with HIV. Local debates about who gets what services. Required group service project in the community.",
    "prereq": {}
  },
  {
    "uid": "007752",
    "code": "ID3395",
    "subject": "ID",
    "number": "3395",
    "honors": false,
    "writing": false,
    "name": "OMSAA: Pre Law Pgm",
    "fullname": "OMSSA: Pre-Law Program",
    "info": "Non published course.  OMSAA program for selected students to participate in a summer exchange program with William Mitchell Law School.",
    "prereq": {}
  },
  {
    "uid": "800796",
    "code": "ID3401",
    "subject": "ID",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Breakthrough Teaching Immersio",
    "fullname": "Reflections on Teaching: Breakthrough Summer Internship",
    "info": "St. Paul summer internship program. Concepts of education practice, experience related to those concepts. Emphasizes issues related to student success, access in education at all levels, and personal growth.",
    "prereq": {}
  },
  {
    "uid": "006689",
    "code": "ID3501",
    "subject": "ID",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Comm, Serv, Self",
    "fullname": "Community, Service, and Self: Dynamics of Gender, Race, and Class",
    "info": "First half of a year-long course designed to complement students' volunteer experience in local communities. Examine community development and \"community service\" theory across cultures while applying them to direct service experience. Students volunteer 2-3 hours per week.  \n",
    "prereq": {}
  },
  {
    "uid": "006690",
    "code": "ID3502",
    "subject": "ID",
    "number": "3502",
    "honors": false,
    "writing": false,
    "name": "Comm, Serv, Self",
    "fullname": "Community, Service, and Self: Dynamics of Gender, Race, and Class",
    "info": "Second half of a year-long course designed to complement students' volunteer experience in local communities. Examine community development and \" community service\" theory across cultures while applying them to direct service experience. Students volunteer 2-3 hours per week.   ",
    "prereq": {}
  },
  {
    "uid": "008045",
    "code": "ID3551",
    "subject": "ID",
    "number": "3551",
    "honors": false,
    "writing": false,
    "name": "Community Seminar",
    "fullname": "Community Leadership Seminar: Leadership,Ethics, and Community Building in Nonprofits",
    "info": "Cross-disciplinary course. Ethical leadership, community building, professional development.",
    "prereq": {}
  },
  {
    "uid": "804677",
    "code": "ID3552",
    "subject": "ID",
    "number": "3552",
    "honors": false,
    "writing": false,
    "name": "Community Internship",
    "fullname": "Community Leadership Internship: Leadership,Ethics, and Community Building in Nonprofits",
    "info": "Cross disciplinary course. Combines theoretical work in seminar with internship at local community, for 15-weeks, 12-15 hours/week.  ",
    "prereq": {}
  },
  {
    "uid": "800401",
    "code": "ID3561",
    "subject": "ID",
    "number": "3561",
    "honors": false,
    "writing": false,
    "name": "Literature in Social Context",
    "fullname": "HECUA Off Campus Programs: Literature in Political, Social, and Historical Contexts",
    "info": "Role of creative writers and literature in effecting social change.\n\nprereq: concurrent registration is required (or allowed) in 3562, concurrent registration is required (or allowed) in 3563, dept consent",
    "prereq": {
      "and": [
        "800402",
        "800403"
      ]
    }
  },
  {
    "uid": "800402",
    "code": "ID3562W",
    "subject": "ID",
    "number": "3562",
    "honors": false,
    "writing": true,
    "name": "Creative Writing Workshop",
    "fullname": "HECUA Off Campus Programs: Writing for Social Change: Creative Writing Workshop",
    "info": "Testing theoretical perspectives of literature and social change by writing fiction, poetry, and creative nonfiction.\n\nprereq: concurrent registration is required (or allowed) in 3561, concurrent registration is required (or allowed) in 3563, dept consent",
    "prereq": {
      "and": [
        "800401",
        "800403"
      ]
    }
  },
  {
    "uid": "800403",
    "code": "ID3563",
    "subject": "ID",
    "number": "3563",
    "honors": false,
    "writing": false,
    "name": "WSC Internship Seminar",
    "fullname": "HECUA Off-Campus Study Program: WSC Internship Seminar",
    "info": "Project-based internship with professional-level responsibilities. Opportunities to integrate experience with two companion courses.\n\nprereq: concurrent registration is required (or allowed) in 3561, concurrent registration is required (or allowed) in 3562, dept consent",
    "prereq": {
      "and": [
        "800401",
        "800402"
      ]
    }
  },
  {
    "uid": "803899",
    "code": "ID3564",
    "subject": "ID",
    "number": "3564",
    "honors": false,
    "writing": false,
    "name": "Environment and Agriculture",
    "fullname": "HECUA Off-Campus Study Program: Environment and Agriculture: Sustainable Food Systems",
    "info": "Connection between the environment and agriculture. Firsthand experience of food systems. Environmental, economic, political, social, and cultural issues that define modern farming. Seminars, field study trips, extended visits to sustainable Minnesota farms.",
    "prereq": {}
  },
  {
    "uid": "803046",
    "code": "ID3565",
    "subject": "ID",
    "number": "3565",
    "honors": false,
    "writing": false,
    "name": "Envr & Agriculture Internship",
    "fullname": "HECUA Off-Campus Study Program: Environment and Agriculture: Sustainable Food Systems Internship",
    "info": "Students devote summer to practice of sustainable farming.",
    "prereq": {}
  },
  {
    "uid": "803047",
    "code": "ID3575",
    "subject": "ID",
    "number": "3575",
    "honors": false,
    "writing": false,
    "name": "Race in America Internship",
    "fullname": "HECUA Race in America Internship Seminar",
    "info": "Internship.",
    "prereq": {}
  },
  {
    "uid": "007643",
    "code": "ID3590",
    "subject": "ID",
    "number": "3590",
    "honors": false,
    "writing": false,
    "name": "Field Study & Intrn",
    "fullname": "Field Study and Internship",
    "info": "(Not to be printed in bulletin) A registration mechanism for students pursuing field study and internships through either other educational institutions or through private, non-credit granting agencies.  Limited to students whose study is approved by U of M faculty, who certify likely departmental credit for successfully completed study as specified by agreement forms signed by both student and faculty.",
    "prereq": {}
  },
  {
    "uid": "810002",
    "code": "ID3595W",
    "subject": "ID",
    "number": "3595",
    "honors": false,
    "writing": true,
    "name": "HECUA: A&J Agroecosystems",
    "fullname": "HECUA Off-Campus Study Program: Agriculture and Justice Agroecosystems in Context",
    "info": "Through interdisciplinary/field-based methods, including farm stay/subsequent creation of \"whole farm plan,\" students learn theory/practice of fundamental agroecological principles. Define, assess, interpret factors that contribute to greater sustainability of agroecosystems.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "810003",
    "code": "ID3596",
    "subject": "ID",
    "number": "3596",
    "honors": false,
    "writing": false,
    "name": "HECUA: Justice & Food System",
    "fullname": "HECUA Off-Campus Study Program: Agriculture and Justice - Justice and the U.S. Food System",
    "info": "Complexities of food system. Roots of land ownership/labor practices in U.S., unpacking economics/policies. Considering one's own role in creating sustainable future. Participatory Action Research projects place students at organizations working for food justice in Twin Cities.\n\nprereq: concurrent registration is required (or allowed) in 3595, dept consent",
    "prereq": {
      "and": [
        "810002"
      ]
    }
  },
  {
    "uid": "810014",
    "code": "ID3597",
    "subject": "ID",
    "number": "3597",
    "honors": false,
    "writing": false,
    "name": "HECUA: A&J Internship (4 cr)",
    "fullname": "HECUA Off-Campus Study Program: Agriculture and Justice Food Systems Internship (4 cr)",
    "info": "Minimum of 160 hours on substantive, mission-related projects at community-based organizations dedicated to food justice/food sovereignty in Twin Cities/greater Minnesota. Through written assignments/critical reflection, HECUA faculty link internship back to theoretical frames.\n\nprereq: 3555, 3556, instr consent",
    "prereq": {}
  },
  {
    "uid": "810004",
    "code": "ID3598",
    "subject": "ID",
    "number": "3598",
    "honors": false,
    "writing": false,
    "name": "HECUA: A&J Internship (8 cr)",
    "fullname": "HECUA Off-Campus Study Program: Agriculture and Justice - Food Systems Internship (8 cr)",
    "info": "Minimum of 300 hours on substantive, mission-related projects at community-based organizations dedicated to food justice/food sovereignty in Twin Cities/greater Minnesota. Through written assignments/critical reflection, HECUA faculty link internship back to theoretical frames.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "804085",
    "code": "ID3896",
    "subject": "ID",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship Reflection",
    "fullname": "Internship Reflection: Making Meaning of Your Experience",
    "info": "Allows students to examine, reflect on, and construct meaning from their internship experience through self assessment of personal and career needs and goals,  examination of what it means to be a \"professional\" and operate within professional environments, evaluation of performance and accomplishments, articulation of knowledge and skills via effective resume writing.\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "806145",
    "code": "ID3900",
    "subject": "ID",
    "number": "3900",
    "honors": false,
    "writing": false,
    "name": "U YMCA Collegiate Allies",
    "fullname": "University YMCA Collegiate Allies",
    "info": "Contextualize learning through multiple settings of real life experiences. Students are engaged in seminar topics that help them to find significant meaning and understanding of themselves and others in multicultural environments. Community service activities, connecting knowledge and practice, and reflecting on how experiences have informed them in becoming effective and engaged citizens and lifelong learners.\n\nprereq: Active participation in a U YWCA program, instr consent",
    "prereq": {}
  },
  {
    "uid": "806706",
    "code": "ID3960",
    "subject": "ID",
    "number": "3960",
    "honors": false,
    "writing": false,
    "name": "Interdepartmental Study Topics",
    "fullname": "Interdepartmental Study Topics",
    "info": "Selected interdepartmental topics not covered in regular courses.",
    "prereq": {}
  },
  {
    "uid": "007640",
    "code": "ID3993",
    "subject": "ID",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Guided individual reading or study.\n\nprereq: instr consent, dept consent, college consent.",
    "prereq": {}
  },
  {
    "uid": "007471",
    "code": "ID4325",
    "subject": "ID",
    "number": "4325",
    "honors": false,
    "writing": false,
    "name": "Garb, Govt, & Globe",
    "fullname": "Garbage, Government, and the Globe",
    "info": "Interdisciplinary analysis of how garbage affects the economy, politics, environment, and health. Movement of toxic materials through the environment; management of solid wastes, global environment, and human ecology;  environmental effects on economic competitiveness both domestically and internationally.",
    "prereq": {}
  }
]