[
  {
    "uid": "815260",
    "code": "IMBA6004",
    "subject": "IMBA",
    "number": "6004",
    "honors": false,
    "writing": false,
    "name": "Negotiations",
    "fullname": "Negotiations",
    "info": "Art and science of securing agreements between two or more parties who are interdependent and seek to maximize their own outcomes. Individual, group, and organizational behavior. Theory and process of negotiations applied to problems faced by managers/professionals.",
    "prereq": {}
  },
  {
    "uid": "815261",
    "code": "IMBA6030",
    "subject": "IMBA",
    "number": "6030",
    "honors": false,
    "writing": false,
    "name": "Financial Accounting",
    "fullname": "Financial Accounting",
    "info": "Students learn about the accounting system used by firms to measure and report their economic performance and financial position to external parties. Students analyze corporate financial reports to discover the impact of significant economic events. Discussions and cases focus on the role of financial reporting standards in informing financial intermediaries and contributing to the efficient allocation of capital in a modern economy.",
    "prereq": {}
  },
  {
    "uid": "816033",
    "code": "IMBA6110",
    "subject": "IMBA",
    "number": "6110",
    "honors": false,
    "writing": false,
    "name": "Leading Others",
    "fullname": "Leading Others",
    "info": "Achieving organizational goals by leading in ways that create motivation, engagement, commitment, positive social interactions, and job performance. Understanding and managing the characteristics of organizations, work groups, and individuals. The role of group dynamics, decision making, cooperation, conflict, and power in leading others.",
    "prereq": {}
  },
  {
    "uid": "815262",
    "code": "IMBA6120",
    "subject": "IMBA",
    "number": "6120",
    "honors": false,
    "writing": false,
    "name": "Data Analysis & Statistics",
    "fullname": "Data Analysis & Statistics",
    "info": "Concepts and principles of business statistics, data analysis and presentation of results. Topics: exploratory data analysis, basic inferential procedures, statistical process control, time series and regression analysis, and analysis of variance. These methods are selected for their relevance to managerial decision making and problem solving.",
    "prereq": {}
  },
  {
    "uid": "815263",
    "code": "IMBA6140",
    "subject": "IMBA",
    "number": "6140",
    "honors": false,
    "writing": false,
    "name": "Managerial Economics",
    "fullname": "Managerial Economics",
    "info": "How markets work, how positive economic rents (profits) are made, and how strategic behavior affects profits. Four major topical areas include market micro-structure, industrial structure, uncertainty, and incentives and firm governance.",
    "prereq": {}
  },
  {
    "uid": "815264",
    "code": "IMBA6210",
    "subject": "IMBA",
    "number": "6210",
    "honors": false,
    "writing": false,
    "name": "Marketing Management",
    "fullname": "Marketing Management",
    "info": "Management of the marketing function; understanding the basic foundational marketing concepts and skills in strategy development and planning of operational and strategic levels pertaining to product offering decisions, distribution channels, pricing and communication.",
    "prereq": {}
  },
  {
    "uid": "815265",
    "code": "IMBA6220",
    "subject": "IMBA",
    "number": "6220",
    "honors": false,
    "writing": false,
    "name": "Supply Chain Management",
    "fullname": "Supply Chain Management",
    "info": "An orientation to a supply chain paradigm. Domestic and global perspectives will be examined. Tools used in operations and optimization will be discussed in the context of linking consumers to technology providers and manufacturers on rapid and distributed global platform.",
    "prereq": {}
  },
  {
    "uid": "815266",
    "code": "IMBA6230",
    "subject": "IMBA",
    "number": "6230",
    "honors": false,
    "writing": false,
    "name": "Financial Management",
    "fullname": "Financial Management",
    "info": "Tools and concepts of financial management. Emphasizes use by financial and non-financial managers to measure creation of value within an organization. Evaluating businesses and business opportunities, identifying financial requirements and sources.\n\nprereq: 6030",
    "prereq": {
      "and": [
        "815261"
      ]
    }
  },
  {
    "uid": "815274",
    "code": "IMBA6240",
    "subject": "IMBA",
    "number": "6240",
    "honors": false,
    "writing": false,
    "name": "Data Analytics",
    "fullname": "Data Analytics",
    "info": "It is critical for contemporary managers to understand how the convergence of mobility, analytics, social media, cloud computing, and embedded devices are transforming firms, industries, markets and society. Using the foundation of data-driven business analytics this course provides the tools and frameworks for competing in the digital age. Students will learn general state-of-the-art analytics skills in the context of new platform-based business models, digital search, big-data, social networks, social media, and open innovation that pervade competition in the digital age. Includes fundamentals of predictive modeling, large scale A/B testing, social networks analysis, and an exposure to the work-horse tools of data-driven classification and prediction to explore patterns in rich datasets (e.g., k-nearest neighbors, classification trees, design of recommendation systems). Using case studies in the digital domain, the methods taught have a wide range of applicability across functions and verticals in modern business environments. Prereq: IMBA student.",
    "prereq": {}
  },
  {
    "uid": "815268",
    "code": "IMBA6300",
    "subject": "IMBA",
    "number": "6300",
    "honors": false,
    "writing": false,
    "name": "Strategic Management",
    "fullname": "Strategic Management",
    "info": "Introduction to the concepts and techniques used to create and implement a sense of corporate direction; choices about products and markets that involve the integration of different functional areas; positioning a business to increase returns for shareholders and stakeholders; the skills involved in identifying issues, evaluating options, and implementing business plans.",
    "prereq": {}
  },
  {
    "uid": "815269",
    "code": "IMBA6315",
    "subject": "IMBA",
    "number": "6315",
    "honors": false,
    "writing": false,
    "name": "Business Ethics",
    "fullname": "The Ethical Environment of Business",
    "info": "Analysis of ethical dilemmas and development of appropriate responses; relationship of ethical management to the law; implications for corporate profitability; managing shareholders vs. managing stakeholders; issues such as protection of the environment, workplace safety, product liability, regulation, and fiduciary obligations.",
    "prereq": {}
  },
  {
    "uid": "815267",
    "code": "IMBA6401",
    "subject": "IMBA",
    "number": "6401",
    "honors": false,
    "writing": false,
    "name": "Ind Overview & Business Law",
    "fullname": "Industry Overview & Business Law",
    "info": "A comprehensive survey of the major U.S.-regulated and highly profitable industries including\u0097but not exclusive to\u0097the technology, energy, finance and healthcare industries. The course will focus on the legislative and regulatory process that provide oversight to major verticals. Antitrust and competition policy enforces by the Department of Justice and the Federal Trade Commission will be explored.\n\nprereq: Industry MBA Student",
    "prereq": {}
  },
  {
    "uid": "815270",
    "code": "IMBA6402",
    "subject": "IMBA",
    "number": "6402",
    "honors": false,
    "writing": false,
    "name": "Industry Vertical: Technology",
    "fullname": "Industry Vertical: Technology",
    "info": "This course focuses on firms engaged in three major sub areas of technology including e-commerce, defense, and manufacturing subsectors. Cases and live case studies to focus on firms ranging from 3M, Lockheed, Amazon, and Google. Federal agency oversight focus includes the Departments of Defense, Transportation, Commerce, and Education.",
    "prereq": {}
  },
  {
    "uid": "815271",
    "code": "IMBA6403",
    "subject": "IMBA",
    "number": "6403",
    "honors": false,
    "writing": false,
    "name": "Industry Vertical: Energy",
    "fullname": "Industry Vertical: Energy",
    "info": "Focus on firms engaged in three major sub areas of financial services including retail banking, investment, and international markets subsectors. Cases and live case studies to focus on firms ranging from Wells Fargo, Berkshire Hathaway, Cargill, and Piper Jaffray. Federal oversight focus includes the Security and Exchange Commission and the Department of Treasury.",
    "prereq": {}
  },
  {
    "uid": "815272",
    "code": "IMBA6404",
    "subject": "IMBA",
    "number": "6404",
    "honors": false,
    "writing": false,
    "name": "Industry Vertical: Finance",
    "fullname": "Industry Vertical: Finance",
    "info": "Focus on firms engaged in three major sub areas of financial services including retail banking, investment, and international markets subsectors. Cases and live case studies to focus on firms ranging from Wells Fargo, Berkshire Hathaway, Cargill, and Piper Jaffray. Federal oversight focus includes the Security and Exchange Commission and the Department of Treasury.",
    "prereq": {}
  },
  {
    "uid": "815273",
    "code": "IMBA6405",
    "subject": "IMBA",
    "number": "6405",
    "honors": false,
    "writing": false,
    "name": "Industry Vertical: Health",
    "fullname": "Industry Vertical: Health",
    "info": "Focus on firms engaged in three major sub areas of health including health care delivery, medical technology, and health insurance. Cases and live case studies to focus on firms ranging from United Health Group, Pfizer, Medtronic, and the Mayo Clinic. Federal oversight focus includes the Department of Health and Human Services, the Veteran Administration, and Office of Personal Management.",
    "prereq": {}
  },
  {
    "uid": "815275",
    "code": "IMBA6465",
    "subject": "IMBA",
    "number": "6465",
    "honors": false,
    "writing": false,
    "name": "Leadership",
    "fullname": "Leadership",
    "info": "Understanding effective leadership. Identifying personal leadership strengths and vulnerabilities through feedback. Developing leadership skills through practice as informed by theory and evidence. Exercises, role play. Creating customized leadership development plan.",
    "prereq": {}
  },
  {
    "uid": "815276",
    "code": "IMBA6500",
    "subject": "IMBA",
    "number": "6500",
    "honors": false,
    "writing": false,
    "name": "Virtual Team Project",
    "fullname": "Virtual Team Project",
    "info": "The Virtual Team Project (VTP) provides Carlson School MBA students with the unique opportunity to work in a collaborative team environment across professions, industries, and markets. As participants in the VTP, students develop advanced skills in teamwork, cross-cultural collaboration, and business plan development within a dynamic environment shaped by academic rigor and the demands of real-world international business.",
    "prereq": {}
  },
  {
    "uid": "815277",
    "code": "IMBA6501",
    "subject": "IMBA",
    "number": "6501",
    "honors": false,
    "writing": false,
    "name": "Industry MBA Capstone",
    "fullname": "Industry MBA Capstone",
    "info": "Tying together foundational concepts of business with deep knowledge of specific industry, students will collaborate across teams, faculty, and a selected corporate partner and enter in to \u0093War Games\u0094 scenarios. Teams will represent corporate decision makers and act as stakeholders for an all out, winner take all, strategic battle comprised within each of the industry verticals.",
    "prereq": {}
  }
]