[
  {
    "uid": "011204",
    "code": "ITAL100",
    "subject": "ITAL",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "Reading  Italian",
    "fullname": "Reading Italian in the Arts and Sciences",
    "info": "Designed to teach a basic reading knowledge of the Italian language; full time is devoted to intensive reading and translation of texts from a wide variety of disciplines and to the teaching of translation techniques. ",
    "prereq": {}
  },
  {
    "uid": "009572",
    "code": "ITAL1001",
    "subject": "ITAL",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Beginning Italian I",
    "fullname": "Beginning Italian I",
    "info": "Ciao! Join us in learning Italian, the language of Dante, DaVinci, and la dolce vita! This melodic language spoken throughout the world in fields including music, fashion, cuisine, and fast automobiles will enrich you as a citizen of the world and allow you access to some of the most amazing art and culture on the planet! \n\nBeginning Italian, Italian 1001, is a proficiency-based course designed for students with little or no knowledge of the Italian language focusing on developing your intercultural, reading, listening, speaking, and writing skills. Preparatory activities designed to encourage students to analyze grammatical points in question need to be completed before class so class time can be primarily devoted to meaningful interactions in Italian. To further increase your confidence in communicating in Italian, you will also participate in several one-to-one online exchange with native speakers of Italian throughout the semester. Upon successful completion of this course, you will be able to enroll in Italian 1002. Expect an average of 1.5 hours of outside preparation for each class session hour.",
    "prereq": {}
  },
  {
    "uid": "010002",
    "code": "ITAL1002",
    "subject": "ITAL",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Beginning Italian II",
    "fullname": "Beginning Italian II",
    "info": "Bentornati! Ready to embark on a new journey to further develop your knowledge of our beautiful romance language, Italian? If you passed Italian 1001 or you have obtained DLI’s consent, this course is for you! You will further develop your skills in Italian as you examine topics such as haute couture or alta moda and the phenomenon of Made in Italy, as well as music, from opera to hip hop. You will also learn about holidays, cultural celebration, and differences and similarities between the scholastic and healthcare systems in Italy and the US. Throughout the semester your learning will be continually enhanced by regular conversations with your Tandem partner in Italy. Preparatory activities designed to encourage students to analyze grammatical points in question need to be completed before class so class time can be primarily devoted to meaningful interactions in Italian. Italian 1002 is a five-credit course, so you should plan to spend an additional 10-15 hours a week on coursework outside the classroom. Upon successful completion of this course you will be able to enroll in Italian 1003.   \n\nprereq: 1001 or instr consent",
    "prereq": {
      "or": [
        "009572"
      ]
    }
  },
  {
    "uid": "010010",
    "code": "ITAL1003",
    "subject": "ITAL",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "Intermediate Italian I",
    "fullname": "Intermediate Italian I",
    "info": "BENVENUTI AL 3º SEMESTRE D'ITALIANO! Throughout the semester in Italian 1003, you will be able to consider your own point of view while learning about various Italian perspectives as we examine topics ranging from housing and historical and contemporary urban design to responsible tourism, linguistic variety, and social problems. Upon completion of this course, you will be able to use Italian to communicate in everyday situations to share personal information about yourself, express your opinions, wishes and desires, make suggestions and give advice, as well as appropriately use active vocabulary. You will continue to acquire basic cross-cultural pragmatic information to help you manage conversations in a culturally appropriate manner, and once again, you will expand your cultural knowledge by talking face to face with your Italian Tandem partner several times over the semester. As with other Italian language course, preparatory activities designed to encourage you to analyze grammatical points in question need to be completed before class so class time can be primarily devoted to meaningful interactions in Italian. Upon successful completion of this course you will be able to enroll in Italian 1004.",
    "prereq": {}
  },
  {
    "uid": "010021",
    "code": "ITAL1004",
    "subject": "ITAL",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Intermediate Italian II",
    "fullname": "Intermediate Italian II",
    "info": "Benvenuti! We invite you to join us in learning the language spoken by one of the most beloved countries and leading destinations for learning abroad in the world! Italy, the cradle of the Renaissance and home to some of the most beautiful art and architecture on earth, boasts the world's seventh largest economy, a renowned creative design and fashion industry, as well as a rich and diverse history and heritage. In this course, you will engage directly with Italian culture and society through a variety of learning portals, including authentic short films and literature, in-class debates and presentations, and an array of assessment methods. Throughout the semester, vital current issues such the impact of technology, justice and politics, and changing inter-generational and interpersonal dynamics will be discussed within a comparative lens, inviting you to reflect on how your own experiences contrast with a sample of those within the Italian culture (Italy). The fourth semester of Italian is designed using a proficiency-based approach to help you develop the ability to communicate effectively in Italian in everyday situations that have real world relevance. Listening, reading, speaking, and writing are integrated into all activities and assessments. By means of self-study preparatory activities designed to encourage students to analyze grammatical points in question before class, so class time can be devoted to meaningful, dynamic interactions with classmates and your teacher in Italian. To further increase your confidence in communicating in Italian, you will also be able to participate in several one-to-one online exchanges with native speakers of Italian throughout the semester. You may end up with a lifelong friend in Italy! \n\nUpon successful completion of this course students will be able to demonstrate proficiency by successful completion of the Italian Language Proficiency Exam (LPE) and/or enroll in Italian 3015.\n\nprereq: ITAL 1003",
    "prereq": {
      "and": [
        "010010"
      ]
    }
  },
  {
    "uid": "792737",
    "code": "ITAL1022",
    "subject": "ITAL",
    "number": "1022",
    "honors": false,
    "writing": false,
    "name": "Accelerated Beginning Italian",
    "fullname": "Accelerated Beginning Italian",
    "info": "This is a fast-paced course that covers the first two semesters of Italian in one semester. Students will be able to move more quickly toward proficiency in Italian to fulfill requirements and/or enroll in advanced Italian courses or expand research options. At the end of this course, you will be able to communicate about topics such as past times, food, family, school, health, sports and much more.",
    "prereq": {}
  },
  {
    "uid": "009556",
    "code": "ITAL1737",
    "subject": "ITAL",
    "number": "1737",
    "honors": false,
    "writing": false,
    "name": "Friends",
    "fullname": "Friends and Countrymen",
    "info": "Study of the problematic relation between friendship and citizenship as formulated by Dante in the \"Inferno\" and as we may interpret it in analyzing today's civic issues. Attention to Dante's reliance on and implicit critique of Aristotle's \"Nicomachean Ethics\".  Taught in English.",
    "prereq": {}
  },
  {
    "uid": "793883",
    "code": "ITAL1837",
    "subject": "ITAL",
    "number": "1837",
    "honors": false,
    "writing": false,
    "name": "Imagining Italy Through Film",
    "fullname": "Imagining Italy: Italian and Italian-American Culture, History, and Society through Film",
    "info": "Weekly guest lectures and critical readings expand from different disciplinary perspectives upon issues raised by films. Urban life, religion, nationalism, opera, violence, leisure, food, fascism, terrorism, family, emigration/immigration, ethnicity, Mediterranean culture.",
    "prereq": {}
  },
  {
    "uid": "808243",
    "code": "ITAL1904",
    "subject": "ITAL",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "818809",
    "code": "ITAL1911",
    "subject": "ITAL",
    "number": "1911",
    "honors": false,
    "writing": false,
    "name": "Community/Media/Activism",
    "fullname": "Community/Media/Activism: Building Resilience Through Cinema",
    "info": "\"Community/Media/Activism: Building Resilience through Cinema\" challenges first-year students to think beyond the borders of a field, an area of study, and the classroom space by engaging with local communities and learn through service. After learning about the importance of media for social justice and acquiring elements of media literacy, students will collaborate with a community partner on a film project advocating its mission. \n\nDuring the first 10 weeks of instruction, \"Community/Media/Activism\" will explore—through screenings, filmmakers’ masterclasses, invited community speakers, experiential assignments—how, in Italy, film and media have been deployed to favor political change, inclusivity, and diversity; to fight for social and ecological justice; to expose unseen and unheard stories; to question prejudices that have to do with race, gender, class, body shape, and cognitive abilities.\n\nThe last five weeks of class will run as a media lab where students under the mentorship of a local media-activist will work on a short film that relies on the strategies and practices unpacked during the course.",
    "prereq": {}
  },
  {
    "uid": "825860",
    "code": "ITAL1912",
    "subject": "ITAL",
    "number": "1912",
    "honors": false,
    "writing": false,
    "name": "Rome at the Movies",
    "fullname": "Rome at the Movies / At the Movies in Rome: Cinema, Global Politics, and a City",
    "info": "In ITAL1912, you will learn to analyze forms of cultural expression in their historical, social, and cultural context, considering the ways in which film and media construct experiences of spaces, places, communities, and histories that have important consequences in real life. Your Canvas posts, reaction papers, assignments, and exams will all require this kind of analysis, which is an essential component of any Liberal Education. But key to a Liberal Education in our globalized society is also the ability to create media products that are respectful and inclusive, which is a skill that you will also acquire during this course by means of tutorials, workshops, and hands-on experiential learning assignments. Since ITAL1912 deals extensively with the world beyond the United States; requires you to situate Italian and European contemporary histories within the context of global post-war culture, society, and politics; examines issues like racism and sexism through a comparative framework; and invites you to reflect on the shifting relations between media, identity, ideology, and power, it satisfies the requirements for the Global Perspectives Theme. This freshman seminar will offer you the unique opportunity to embark on an exciting cinematic journey through the city of St Peter's Basilica, the Colosseum, la dolce vita, and so much more. By watching and discussing the most iconic representations of contemporary Rome in film and by going to the movies together, we will learn about Italy's rich history and culture but also tackle bigger philosophical and political questions from a global perspective. What is a city? Do cities have identities? How can the vibe of a city be conveyed on screen? How do film and media shape spaces and make places? By telling fictional stories about a city, how do movies or television bear witness to—and simultaneously intervene into—real historical dynamics? How do movies create connections between people from diverse backgrounds, while also establishing borders within public spaces and hierarchies regarding whom the city belongs to? By exposing unseen and unheard stories, by featuring bodies and subjects that media traditionally shuns, can fiction films and documentaries be deployed to favor political change, inclusivity, and diversity? We will tackle these questions through screenings, readings, class discussion, on-site visits, guest lectures, practical assignments, experiential activities, tutorials, and masterclasses. Learning from the works, we tackle how to use film and media to foster more welcoming and inclusive arrangements of community and belonging. By the end of the semester, you will have learned why media representation matters for politics and history, while also having acquired the skill-set necessary to capture the complex reality of a city in a way that is conducive to social justice and political progress.",
    "prereq": {}
  },
  {
    "uid": "009557",
    "code": "ITAL3015",
    "subject": "ITAL",
    "number": "3015",
    "honors": false,
    "writing": false,
    "name": "Reading, Conversation, & Comp",
    "fullname": "Reading, Conversation, and Composition",
    "info": "How can a society manage an aging population? What steps can be taken to promote integration and overcome differences? Is technology helping or hindering our interpersonal relationship? Is history doomed to repeat itself? You are about to embark into a rewarding journey to further deepen your Italian experience while developing your critical thinking skills. This class will increase your appreciation of Italian culture through engagement with articles, short films, and literary extracts (of authors such as Nobel's prize Dario Fo, Salgari, and Natalia Ginzburg) on contemporary cultural topics ranging from social problems to the use and misuse of technology to the impact of historical events on people’s everyday lives. This intensive, intermediate course is designed for students who have passed Italian 1004 and have mastered basic Italian grammar. ",
    "prereq": {}
  },
  {
    "uid": "009559",
    "code": "ITAL3201",
    "subject": "ITAL",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Read Ital Text",
    "fullname": "Reading Italian Texts: Poetics, Rhetoric, Theory",
    "info": "A basic course in understanding the rhetorical and poetic aspects of language and literature; interpretive methods and theoretical concepts.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009557"
      ]
    }
  },
  {
    "uid": "009757",
    "code": "ITAL3203",
    "subject": "ITAL",
    "number": "3203",
    "honors": false,
    "writing": false,
    "name": "Italian Travelers",
    "fullname": "Italian Travelers: Borders and Travelers",
    "info": "Examines literary representations of travel, migration, immigration, exile, and tourism in Italy from the Enlightenment to the present.\n\nTaught in English",
    "prereq": {}
  },
  {
    "uid": "009560",
    "code": "ITAL3209",
    "subject": "ITAL",
    "number": "3209",
    "honors": false,
    "writing": false,
    "name": "Lit of Medieval City-States",
    "fullname": "Literature of Medieval City-States",
    "info": "The beginnings of Italian vernacular literature in the context of the city-states of the 11th to 14th centuries.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009557"
      ]
    }
  },
  {
    "uid": "009561",
    "code": "ITAL3219",
    "subject": "ITAL",
    "number": "3219",
    "honors": false,
    "writing": false,
    "name": "Lit of Despotism",
    "fullname": "Literature of the Despotisms",
    "info": "Prose, verse, and drama of Italy under the Signorie and foreign invaders, 1400-1650.",
    "prereq": {}
  },
  {
    "uid": "009558",
    "code": "ITAL3301",
    "subject": "ITAL",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Ital Dial and Lit",
    "fullname": "Italian Dialects and Their Literature",
    "info": "Study of selected Italian dialects and dialect texts in their cultural and historical settings. ",
    "prereq": {}
  },
  {
    "uid": "009743",
    "code": "ITAL3305",
    "subject": "ITAL",
    "number": "3305",
    "honors": false,
    "writing": false,
    "name": "Self in Modern Italian Theater",
    "fullname": "Staging the Self: Theater and Drama in Modern Italy",
    "info": "Theatrical representations of the self in modern Italy. Particular attention given to issues of identity, gender, and class in theatrical works ranging from Alfieri's Mirra, Pirandello's Enrico IV to Dacia Maraini's Clyteminestra.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009557"
      ]
    }
  },
  {
    "uid": "801595",
    "code": "ITAL3459W",
    "subject": "ITAL",
    "number": "3459",
    "honors": false,
    "writing": true,
    "name": "Senior Project",
    "fullname": "Senior Project",
    "info": "Research/writing on issue/theme in Italian studies. Projects range from scholarly paper to artistic/creative writing or musical composition, photography, poetry, or fiction. Research/analytical component.\n\nprereq: completion of pre-requisite for major (3015) and eight electives for the sum of 30 credits",
    "prereq": {
      "or": [
        "009557"
      ]
    }
  },
  {
    "uid": "009562",
    "code": "ITAL3501",
    "subject": "ITAL",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "World in City",
    "fullname": "The World in the City: Italy 1100-1660",
    "info": "The culture and civilization of Italian cities in medieval and early modern periods. ",
    "prereq": {}
  },
  {
    "uid": "009768",
    "code": "ITAL3502",
    "subject": "ITAL",
    "number": "3502",
    "honors": false,
    "writing": false,
    "name": "Mod Italy & Culture",
    "fullname": "Making of Modern Italy: From the Enlightenment to the Present.",
    "info": "Italian literary, cultural, and symbolic practices from the Enlightenment to the present.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009557"
      ]
    }
  },
  {
    "uid": "795409",
    "code": "ITAL3550",
    "subject": "ITAL",
    "number": "3550",
    "honors": false,
    "writing": false,
    "name": "Topics in 19th Century Italy",
    "fullname": "Topics in 19th Century Italy",
    "info": "Literature/culture of Italy in 19th century. Content varies depending on instructor. Literary, critical, cultural, historical, or social issues. Specific author, genre, or topic of interest. Readings. Specific content posted in department/listed in Course Guide.\n\nprereq: 3015 or instr consent",
    "prereq": {
      "or": [
        "009557"
      ]
    }
  },
  {
    "uid": "809315",
    "code": "ITAL3637",
    "subject": "ITAL",
    "number": "3637",
    "honors": false,
    "writing": false,
    "name": "Ancient Rome to Renaissance",
    "fullname": "From Ancient Rome to Renaissance Florence: Siena on the \"French Road\"",
    "info": "Roman antiquity, Middle Ages, Renaissance. Economic/ commercial history. Role of Italian trade with East/France. Italian culture from time of Caesars through medieval city-states/standard-setting culture of Italian Renaissance.",
    "prereq": {}
  },
  {
    "uid": "795805",
    "code": "ITAL3640",
    "subject": "ITAL",
    "number": "3640",
    "honors": false,
    "writing": false,
    "name": "Topics in Italian Studies",
    "fullname": "Topics in Italian Studies",
    "info": "Topics of interest in studies of Italian or Italian American culture of 20th century. Literary, critical, cultural, historical, or social issues, a specific author, a genre, or other topic. Content varies by instructor, see Course Guide.\n\nprereq: 3015 or instr consent",
    "prereq": {
      "or": [
        "009557"
      ]
    }
  },
  {
    "uid": "818312",
    "code": "ITAL3647",
    "subject": "ITAL",
    "number": "3647",
    "honors": false,
    "writing": false,
    "name": "Urban Transformation in Italy",
    "fullname": "Urban Transformation in Italy",
    "info": "Building on our study of urban living, neighborhood cultures and traditions, and the decentralized nature of Italian geopolitics in ITAL 1003 and 1004, this global seminar will further explore the history, politics, aesthetics, and current status of urban revitalization, Italian-style, providing a lens through which we can understand the diversity of Italian culture today. While concentrated largely on residential neighborhoods within the Capital, Rome, the seminar includes a three-day excursion to Matera and Alberobello, the former in the central-southern region of Basilicata and the latter in southeastern Puglia, enabling students to consider the implications of two Southern Italian local economies largely dependent on tourism for survival and ponder the sustainability of each area. The seminar culminates in an extended day-long excursions to Naples, which contains the only continually inhabited city center in Italy, and will present a counter-example to the processes of revitalization and neighborhood transition witnessed in Rome and elsewhere, as well as provide an opportunity to synthesize information gathered thus far and apply it in a different context.",
    "prereq": {}
  },
  {
    "uid": "009776",
    "code": "ITAL3806",
    "subject": "ITAL",
    "number": "3806",
    "honors": false,
    "writing": false,
    "name": "Italian Film and Literature",
    "fullname": "Negotiating the Terms: Italian Film and Literature",
    "info": "Examines cinematic representations of Italian literary texts; introduces the basic tools of literary and film analysis; discusses how both media impact Italian culture. Taught in English.",
    "prereq": {}
  },
  {
    "uid": "797890",
    "code": "ITAL3837",
    "subject": "ITAL",
    "number": "3837",
    "honors": false,
    "writing": false,
    "name": "Imagining Italy Through Film",
    "fullname": "Imagining Italy: Italian and Italian-American Culture, History, and Society through Film",
    "info": "Weekly guest lectures and critical readings expand from different disciplinary perspectives upon issues raised by films. Urban life, religion, nationalism, opera, violence, leisure, food, fascism, terrorism, family, emigration/immigration, ethnicity, Mediterranean culture.",
    "prereq": {}
  },
  {
    "uid": "810568",
    "code": "ITAL3850",
    "subject": "ITAL",
    "number": "3850",
    "honors": false,
    "writing": false,
    "name": "Topics in Italian Cinema",
    "fullname": "Topics in Italian Cinema",
    "info": "Examine theme, problem, style, period, or filmmaker in Italian cinema history. Attention devoted to locating Italian visual culture within context of wider transnational political/artistic networks. Content varies depending on year/instructor.\n\nprereq: 3015 or instr consent",
    "prereq": {
      "or": [
        "009557"
      ]
    }
  },
  {
    "uid": "818534",
    "code": "ITAL3896",
    "subject": "ITAL",
    "number": "3896",
    "honors": false,
    "writing": false,
    "name": "Internship for Academic Credit",
    "fullname": "Internship for Academic Credit",
    "info": "An applied learning experience in an agreed-upon, short-term, supervised workplace activity, with defined goals, which may be related to a student's major field or area of interest. The work can be full or part time, paid or unpaid, primarily in off-campus environments. Internships integrate classroom knowledge and theory with practical application and skill development in professional or community settings. The skills and knowledge learned should be transferable to other employment settings and not simply to advance the operations of the employer. Typically the student's work is supervised and evaluated by a site coordinator or instructor.",
    "prereq": {}
  },
  {
    "uid": "798800",
    "code": "ITAL4001",
    "subject": "ITAL",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Beg Italian Grad Research I",
    "fullname": "Beginning Italian for Graduate Research I",
    "info": "Ciao! Join us in learning Italian, the language of Dante, DaVinci, and la dolce vita! This melodic language spoken throughout the world in fields including music, fashion, cuisine, and fast automobiles will enrich you as a citizen of the world and allow you access to some of the most amazing art and culture on the planet! \n\nBeginning Italian, Italian 4001, is a proficiency-based course designed for students with little or no knowledge of the Italian language focusing on developing your intercultural, reading, listening, speaking, and writing skills. Preparatory activities designed to encourage students to analyze grammatical points in question need to be completed before class so class time can be primarily devoted to meaningful interactions in Italian. To further increase your confidence in communicating in Italian, you will also participate in several one-to-one online exchange with native speakers of Italian throughout the semester. Upon successful completion of this course, you will be able to enroll in Italian 4002. Expect an average of 1.5 hours of outside preparation for each class session hour.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "798801",
    "code": "ITAL4002",
    "subject": "ITAL",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Beg Italian Grad Research II",
    "fullname": "Beginning Italian for Graduate Research II",
    "info": "Bentornati! Ready to embark on a new journey to further develop your knowledge of our beautiful romance language, Italian? If you passed Italian 1001 or you have obtained DLI's consent, this course is for you! You will further develop your skills in Italian as you examine topics such as haute couture or alta moda and the phenomenon of Made in Italy, as well as music, from opera to hip hop. You will also learn about holidays, cultural celebration, and differences and similarities between the scholastic and healthcare systems in Italy and the US. Throughout the semester your learning will be continually enhanced by regular conversations with your Tandem partner in Italy. Preparatory activities designed to encourage students to analyze grammatical points in question need to be completed before class so class time can be primarily devoted to meaningful interactions in Italian. Italian 4002 is a five-credit course, so you should plan to spend an additional 10-15 hours a week on coursework outside the classroom. Upon successful completion of this course you will be able to enroll in Italian 4003.   \n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "798802",
    "code": "ITAL4003",
    "subject": "ITAL",
    "number": "4003",
    "honors": false,
    "writing": false,
    "name": "Int Italian Grad Research I",
    "fullname": "Intermediate Italian for Graduate Research I",
    "info": "BENVENUTI AL 3º SEMESTRE D'ITALIANO! Throughout the semester in Italian 1003, you will be able to consider your own point of view while learning about various Italian perspectives as we examine topics ranging from housing and historical and contemporary urban design to responsible tourism, linguistic variety, and social problems. Upon completion of this course, you will be able to use Italian to communicate in everyday situations to share personal information about yourself, express your opinions, wishes and desires, make suggestions and give advice, as well as appropriately use active vocabulary. You will continue to acquire basic cross-cultural pragmatic information to help you manage conversations in a culturally appropriate manner, and once again, you will expand your cultural knowledge by talking face to face with your Italian Tandem partner several times over the semester. As with other Italian language course, preparatory activities designed to encourage you to analyze grammatical points in question need to be completed before class so class time can be primarily devoted to meaningful interactions in Italian. Upon successful completion of this course you will be able to enroll in Italian 4004.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "798803",
    "code": "ITAL4004",
    "subject": "ITAL",
    "number": "4004",
    "honors": false,
    "writing": false,
    "name": "Int Italian Grad Research II",
    "fullname": "Intermediate Italian for Graduate Research II",
    "info": "Benvenuti! We invite you to join us in learning the language spoken by one of the most beloved countries and leading destinations for learning abroad in the world! Italy, the cradle of the Renaissance and home to some of the most beautiful art and architecture on earth, boasts the world's seventh largest economy, a renowned creative design and fashion industry, as well as a rich and diverse history and heritage. In this course, you will engage directly with Italian culture and society through a variety of learning portals, including authentic short films and literature, in-class debates and presentations, and an array of assessment methods. Throughout the semester, vital current issues such the impact of technology, justice and politics, and changing inter-generational and interpersonal dynamics will be discussed within a comparative lens, inviting you to reflect on how your own experiences contrast with a sample of those within the Italian culture (Italy). The fourth semester of Italian is designed using a proficiency-based approach to help you develop the ability to communicate effectively in Italian in everyday situations that have real world relevance. Listening, reading, speaking, and writing are integrated into all activities and assessments. By means of self-study preparatory activities designed to encourage students to analyze grammatical points in question before class, so class time can be devoted to meaningful, dynamic interactions with classmates and your teacher in Italian. To further increase your confidence in communicating in Italian, you will also be able to participate in several one-to-one online exchanges with native speakers of Italian throughout the semester. You may end up with a lifelong friend in Italy! \n\nUpon successful completion of this course students will be able to demonstrate proficiency by successful completion of the Italian Language Proficiency Exam (LPE) and/or enroll in Italian 3015.",
    "prereq": {}
  },
  {
    "uid": "818154",
    "code": "ITAL4022",
    "subject": "ITAL",
    "number": "4022",
    "honors": false,
    "writing": false,
    "name": "Accel Beg Ital Grad Research",
    "fullname": "Accelerated Beginning Italian for Graduate Research",
    "info": "This is a fast-paced course that covers the first two semesters of Italian in one semester. Students will be able to move more quickly toward proficiency in Italian to fulfill requirements and/or enroll in advanced Italian courses or expand research options. At the end of this course, you will be able to communicate about topics such as past times, food, family, school, health, sports and much more.",
    "prereq": {}
  },
  {
    "uid": "009563",
    "code": "ITAL4303",
    "subject": "ITAL",
    "number": "4303",
    "honors": false,
    "writing": false,
    "name": "Drama Spect Italy",
    "fullname": "Drama and Spectacle in Italy, 1200-1770",
    "info": "Italian drama, festival and spectacle from the medieval sacred plays to the reform of the theater by Goldoni.",
    "prereq": {}
  },
  {
    "uid": "009564",
    "code": "ITAL4307",
    "subject": "ITAL",
    "number": "4307",
    "honors": false,
    "writing": false,
    "name": "Novellistica",
    "fullname": "Novellistica",
    "info": "Introduction to historical, formal and theoretical study of the Italian novella genre (including such alternative forms as the \u0093racconto\u0094) and the impact of this genre on world literature. The study of the birth and development of the novella genre in Italian. Readings from and discussion of novellas and tales from: The Novellino, Boccaccio, Sacchetti, Bandello, Bigolini, Basile, Verga, Deledda, Moravia, Morante, Calvino, Ferrante\n\nprereq: 3015, 3201 or permission from the Italian DUS",
    "prereq": {
      "or": [
        "009557",
        "009559"
      ]
    }
  },
  {
    "uid": "009565",
    "code": "ITAL4993",
    "subject": "ITAL",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Study",
    "fullname": "Directed Study",
    "info": "Meets unique requirements decided on by faculty member and student. Individual contracts list contact hours, number of credits, written and other work required.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "793376",
    "code": "ITAL5201",
    "subject": "ITAL",
    "number": "5201",
    "honors": false,
    "writing": false,
    "name": "Read Ital Text",
    "fullname": "Reading Italian Texts: Poetics, Rhetoric, Theory",
    "info": "Rhetorical/poetic aspects of language and literature. Interpretive methods, theoretical concepts.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "793377",
    "code": "ITAL5203",
    "subject": "ITAL",
    "number": "5203",
    "honors": false,
    "writing": false,
    "name": "Ital Trav",
    "fullname": "Italian Travelers: From the Enlightenment to the Present",
    "info": "Examines literary representations of travel, migration, immigration, exile, and tourism in Italy, from Enlightenment to present.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "009566",
    "code": "ITAL5209",
    "subject": "ITAL",
    "number": "5209",
    "honors": false,
    "writing": false,
    "name": "Trecento Lit",
    "fullname": "Trecento Literature: Ruling the Canon",
    "info": "Works of Boccaccio and Petrarch and their role in establishing the canon of Italian vernacular literature. Taught in English also as MeSt 5610.",
    "prereq": {}
  },
  {
    "uid": "009814",
    "code": "ITAL5289",
    "subject": "ITAL",
    "number": "5289",
    "honors": false,
    "writing": false,
    "name": "Italian Women Writers",
    "fullname": "The Narrow Door: Women Writers and Feminist Practices in Italian Literature and Culture",
    "info": "Focuses on issues of gender, sexual difference, equality, and emancipation raised by Italian women writers and thinkers from the 19th century to the present. ",
    "prereq": {}
  },
  {
    "uid": "793564",
    "code": "ITAL5305",
    "subject": "ITAL",
    "number": "5305",
    "honors": false,
    "writing": false,
    "name": "Self in Modern Italian Theater",
    "fullname": "Staging the Self: Theater and Drama in Modern Italy",
    "info": "Theatrical representations of the self in modern Italy. Focuses on issues of identity, gender, and class in theatrical works ranging from Alfieri's Mirra, Pirandello's Enrico IV to Dacia Maraini's Clyteminestra.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "009567",
    "code": "ITAL5321",
    "subject": "ITAL",
    "number": "5321",
    "honors": false,
    "writing": false,
    "name": "Ital Ren Epic",
    "fullname": "Italian Renaissance Epic",
    "info": "Study of the narrative poems of Boiardo, Ariosto, and Tasso in the context of the fashioning of early modern Europe.",
    "prereq": {}
  },
  {
    "uid": "009823",
    "code": "ITAL5337",
    "subject": "ITAL",
    "number": "5337",
    "honors": false,
    "writing": false,
    "name": "Nation & Narration",
    "fullname": "Nation and Narration: Writings in the 19th Century",
    "info": "Introduces the construction of modern Italian national identity by examining the role that literature plays in this process. Works by Manzoni, Foscolo, Leopardi, Gioia, Verga, Serao, and Deledda studied in the context of a range of sociopolitical and cultural issues.\n\nprereq: 3015",
    "prereq": {
      "and": [
        "009557"
      ]
    }
  },
  {
    "uid": "009568",
    "code": "ITAL5401",
    "subject": "ITAL",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Mondo Dante",
    "fullname": "Mondo di Dante",
    "info": "Intensive reading of Dante's Inferno, Purgatorio, and Vita Nuova with emphasis on Dante's linguistic and cultural contributions.\n\nprereq: 3015, 3201 or instr consent",
    "prereq": {
      "or": [
        "009557",
        "009559"
      ]
    }
  },
  {
    "uid": "793448",
    "code": "ITAL5502",
    "subject": "ITAL",
    "number": "5502",
    "honors": false,
    "writing": false,
    "name": "Mod Italy & Culture",
    "fullname": "Making of Modern Italy: From the Enlightenment to the Present",
    "info": "Italian literary, cultural, and symbolic practices, from Enlightenment to present.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "796431",
    "code": "ITAL5550",
    "subject": "ITAL",
    "number": "5550",
    "honors": false,
    "writing": false,
    "name": "Topics in 19th Century Italy",
    "fullname": "Topics in 19th Century Italy",
    "info": "Explores the literature and culture of Italy in the 19th century. Content will vary depending on the instructor. Topics and readings may include literary, critical, cultural, historical, and/or social issues, a specific author, a genre, or other topics of interest for the period. Specific content will be posted in the department and listed in the Course Guide.\n\nprereq: Ital 3015 or instr consent",
    "prereq": {
      "or": [
        "009557"
      ]
    }
  },
  {
    "uid": "009569",
    "code": "ITAL5609",
    "subject": "ITAL",
    "number": "5609",
    "honors": false,
    "writing": false,
    "name": "World of Dante",
    "fullname": "World of Dante",
    "info": "Taught in English. Intensive reading of Dante's Inferno, Purgatorio, and Vita Nuova with emphasis on the personal, poetic, and political stakes of the journey of Dante's pilgrim through hell to the earthly paradise.\n",
    "prereq": {}
  },
  {
    "uid": "796461",
    "code": "ITAL5640",
    "subject": "ITAL",
    "number": "5640",
    "honors": false,
    "writing": false,
    "name": "Topics in Italian Studies",
    "fullname": "Topics in Italian Studies",
    "info": "Topics of interest in studies of Italian and/or Italian American culture of the 20th century. Topics and readings may include literary, critical, cultural, historical, and/or social issues, a specific author, a genre, or other topics . Content varies by instructor. Specific content posted in the department and in the Course Guide.\n\nprereq: Ital 3015",
    "prereq": {
      "and": [
        "009557"
      ]
    }
  },
  {
    "uid": "793378",
    "code": "ITAL5806",
    "subject": "ITAL",
    "number": "5806",
    "honors": false,
    "writing": false,
    "name": "Ital Film and Lit",
    "fullname": "Negotiating the Terms: Italian Film and Literature",
    "info": "Cinematic representations of Italian literary texts. Basic tools of literary/film analysis. How both media impact Italian culture. Taught in English.",
    "prereq": {}
  },
  {
    "uid": "009570",
    "code": "ITAL5970",
    "subject": "ITAL",
    "number": "5970",
    "honors": false,
    "writing": false,
    "name": "Dir Read",
    "fullname": "Directed Readings",
    "info": "Meets unique requirements decided on by faculty member and student. Individual contracts list contact hours, number of credits, written and other work required.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788131",
    "code": "ITAL8333",
    "subject": "ITAL",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Masters",
    "fullname": "FTE: Masters",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788616",
    "code": "ITAL8777",
    "subject": "ITAL",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required (Plan A only)",
    "prereq": {}
  },
  {
    "uid": "009571",
    "code": "ITAL8992",
    "subject": "ITAL",
    "number": "8992",
    "honors": false,
    "writing": false,
    "name": "Dir Read",
    "fullname": "Directed Readings",
    "info": "Requirements decided on by faculty member and student: contact hours, number of credits, written/other work.\n\nprereq: instr consent",
    "prereq": {}
  }
]