[
  {
    "uid": "016709",
    "code": "KIN1050",
    "subject": "KIN",
    "number": "1050",
    "honors": false,
    "writing": false,
    "name": "Beg. Military Fitness Training",
    "fullname": "Beginning Military Physical Fitness Training",
    "info": "The Army's model of physical fitness training is used to address five aspects of fitness in the context of running, weight training, strength exercise, circuit training, and team sport activities. Students are organized into groups of similar fitness levels.  Do not register for this course if you have a permanent medical condition that prevents you from doing push-ups, sit-ups, or running.",
    "prereq": {}
  },
  {
    "uid": "016710",
    "code": "KIN1375",
    "subject": "KIN",
    "number": "1375",
    "honors": false,
    "writing": false,
    "name": "Play Behavior",
    "fullname": "Play Behavior",
    "info": "Overview of play behavior across species, cultures, social settings. Relationship of play between physical/psychological development, role of sports/games in play, design of toys/playgrounds.",
    "prereq": {}
  },
  {
    "uid": "004468",
    "code": "KIN1871",
    "subject": "KIN",
    "number": "1871",
    "honors": false,
    "writing": false,
    "name": "Survey of KIN, PAHP, and SMGT",
    "fullname": "Survey of Kinesiology, Physical Activity, Health Promotion, and Sport Management",
    "info": "This course is an introduction to the human movement and physical activity-related academic disciplines and professional practices of kinesiology, physical activity and health promotion, and sport management. Main topics include (a) understanding the pervasiveness, importance, and benefits of human movement and physical activity in our lives, (b) areas of scholarly study of the history of physical activity, philosophy of physical activity, sport and exercise psychology, sport sociology, motor behavior, biomechanics, exercise physiology; health promotion; sport management), (c) career opportunities as a human movement or physical activity-related professional, and (d) understanding of the requirements, experience, and education needed to obtain a career.",
    "prereq": {}
  },
  {
    "uid": "800703",
    "code": "KIN1902",
    "subject": "KIN",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Freshman Sem,CulturalDiversity",
    "fullname": "Freshman Seminar: Cultural Diversity",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "808179",
    "code": "KIN1904",
    "subject": "KIN",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "An Olympic Impact on the World",
    "fullname": "An Olympic Impact on the World",
    "info": "In the late nineteenth century, Baron Pierre de Coubertin, a French aristocrat, worked tirelessly to revive the Olympic Games from Greek history.  Through Baron de Coubertin?s efforts the first Olympic Games of the modern era took place in 1896 in Athens, Greece. From a small sporting event that hosted a little over 300 athletes from 13 countries the Olympic Games have grown over the last 120 years to one of the most viewed sporting events in the world.  Today, the Olympic Games hosts over 10,0000 athletes from over 200 countries. The International Olympic Committee (IOC), which runs the Olympic Games, is now one of the most powerful and richest sporting organizations in the world.  The Olympic Games have had a profound impact on the world we live in and they provide us with a platform for examining changes in the world?s cultural, economic, social and political processes over the last 120 years. This course explores the impact of the Olympic Games on the world?s cultural, social and political processes. In addition, this course will explore the impact of hosting the Olympic Games on that host city and the country?s economy.  Finally, this course will explore the changes in sport that have occurred during this time span. \n\n",
    "prereq": {}
  },
  {
    "uid": "800704",
    "code": "KIN1905",
    "subject": "KIN",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "005047",
    "code": "KIN1989",
    "subject": "KIN",
    "number": "1989",
    "honors": false,
    "writing": false,
    "name": "Health and Society",
    "fullname": "Health and Society",
    "info": "Major factors influencing human health, including behavior, the physical and social environments, policy, and economics. Opportunities for citizen participation in addressing each factor are explored, focusing on health topics such as nutrition and violence.",
    "prereq": {}
  },
  {
    "uid": "005054",
    "code": "KIN1993",
    "subject": "KIN",
    "number": "1993",
    "honors": false,
    "writing": false,
    "name": "Directed Study PreKin",
    "fullname": "Directed Study for Pre-Kinesiology Students",
    "info": "Students interested in the field of kinesiology have the opportunity to earn credit while working in a lab or field research setting to carry out scholarly or creative activities while under the guidance of a School of Kinesiology faculty member.  Students can assist with faculty scholarship or carry out projects of their own.\n\nTo earn credit in this course, students must talk with the faculty member and then fill out a Directed Activity Contract (z.umn.edu/Directed_Activity) online.  This contract is an agreement between the student and teaching faculty member and should establish expectations, credits, and the grading basis for the work.",
    "prereq": {}
  },
  {
    "uid": "004284",
    "code": "KIN3001",
    "subject": "KIN",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Lifetime Health & Wellness",
    "fullname": "Lifetime Health and Wellness",
    "info": "Overview of health/wellness. Physical, emotional, intellectual, spiritual, social, environmental, and financial health. Influence of societal changes on general health/wellness of diverse populations.",
    "prereq": {}
  },
  {
    "uid": "788993",
    "code": "KIN3027",
    "subject": "KIN",
    "number": "3027",
    "honors": false,
    "writing": false,
    "name": "Human Anatomy",
    "fullname": "Human Anatomy for Kinesiology, Physical Activity, and Health Promotion",
    "info": "Kinesiology 3027 is a 4-credit introduction to human anatomy with two 50-min lectures and one 100-min lab per week. Upon completing this course, students will be able to use proper anatomical terminology and identify the majority of the human anatomical structures and their functions. The lecture series is organized around an organ systems approach and currently follows the text of Human Anatomy. The lectures are divided into basic anatomy and human development principles and the major anatomical systems: skin, musculoskeletal, cardiovascular, respiratory, renal, neurological, endocrine, immune, and digestive. Each section proceeds an anatomic description from the microscopic or cellular level to the key features of tissues that aggregate into organ anatomy (bottom up). The kinetic anatomy perspective describes organ systems' dynamic and functional characteristics based on their component organ anatomy and interactions (top-down). The context for course material covered will reflect a kinesiology focus on human movement in exercise and sports. This will better prepare students for graduate school courses in the health sciences, movement sciences, and Athletic Training. In addition, students will be encouraged to learn their anatomy as a health and preventive medicine skill. The laboratory component is divided into two; one identifies cells, tissues, and bones and the different bone parts. These activities are performed in the Human Performance Teaching Laboratory (HPTL) in Mariucci Arena 141. Laboratory activities include using light microscopes to identify cells and tissues and working with individual bones and intact skeletons. The second component is the cadaver lab at the Anatomy Bequest Program. Students will have the opportunity to visualize and identify anatomical structures in cadavers and cadavers specimens during these labs. The cadaver labs provide students with the three-dimensional organization of the human anatomy and the association with neighboring anatomical structures. The instructors will demonstrate the functional anatomical aspects and clinical anatomical correlations. Students are able to further complement their understanding of human anatomy by using anatomy and physiology virtual labs.",
    "prereq": {}
  },
  {
    "uid": "016711",
    "code": "KIN3050",
    "subject": "KIN",
    "number": "3050",
    "honors": false,
    "writing": false,
    "name": "Adv. Military Fitness Training",
    "fullname": "Advanced Military Physical Fitness Training",
    "info": "The Army's model of physical fitness training is used to address five aspects of fitness in the context of running, weight training, strength exercise, circuit training, and team sport activities. Students are organized into groups of similar fitness levels.  Do not register for this course if you have a permanent medical condition that prevents you from doing push-ups, sit-ups, or running.\n\nprereq: 3 cr of 1050 or instr consent",
    "prereq": {
      "or": [
        "016709"
      ]
    }
  },
  {
    "uid": "016496",
    "code": "KIN3070",
    "subject": "KIN",
    "number": "3070",
    "honors": false,
    "writing": false,
    "name": "Topics in Mgmt: Evol Am Mgmt",
    "fullname": "Topics in Management: Evolution of American Management",
    "info": "Introduction to history/development of American management as it underlies current management ideas/practice. Business organization, finance/marketing, management methods, education for management. Reading/in-class discussion of business cases and of past/present management literature.",
    "prereq": {}
  },
  {
    "uid": "011125",
    "code": "KIN3111",
    "subject": "KIN",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Human Anatomy",
    "fullname": "Human Anatomy",
    "info": "Beginning anatomy course for nonkinesiology students pursuing coaching licensure or for nonprofessional students interested in an exercise science approach to anatomy. Focus on a regional approach to muscle, nerve, and circulatory anatomy of the limbs and trunk and a systematic anatomy approach for circulatory, respiratory, digestive, urinary, and nervous systems. Students are encouraged to voluntarily attend arranged demonstrations of human cadaver dissections.",
    "prereq": {}
  },
  {
    "uid": "004830",
    "code": "KIN3112",
    "subject": "KIN",
    "number": "3112",
    "honors": false,
    "writing": false,
    "name": "Introduction to Biomechanics",
    "fullname": "Introduction to Biomechanics",
    "info": "This course introduces basic concepts about the mechanics of human movement. The first part of the course will introduce students to various aspects of functional anatomy and provide an overview of the major neural systems that control the human body and its movement. The second part introduces principles of the physics of human movement, while the final part provides examples of how this knowledge can be applied for the rehabilitation, engineering, and sport sciences. The lecture portion of the course is accompanied by a weekly lab that provides tutorials as well as hands-on experiences in small groups where students learn to  collect biomechanical data such as motion capture or electromyographic recordings. \n\nPrior to the start of class, students must be Kinesiology B.S. majors and have successfully completed human anatomy and physics with a lab. It is preferred, not required, that students have also completed human physiology. To request a permission number, contact the Kinesiology B.S. advisor.\n\nprereq: [PHYS 1101W or PHYS 1201W or PHYS 1221 or PHYS 1301W or PHYS 1401V or 1107], [KIN 3027 or KIN 3111 or ANAT 3001 or ANAT 3601 or ANAT 3611 or ANAT 3651 or ANAT 3658H or INMD 3001 or INMD 3601]; KIN 3385 recommended",
    "prereq": {
      "and": [
        {
          "or": [
            "002066",
            "002068",
            "817964",
            "002070",
            "798903"
          ]
        },
        {
          "or": [
            "788993",
            "011125",
            "788155",
            "800844",
            "789897",
            "826066"
          ]
        },
        "005270"
      ]
    }
  },
  {
    "uid": "004837",
    "code": "KIN3113",
    "subject": "KIN",
    "number": "3113",
    "honors": false,
    "writing": false,
    "name": "First Responder:Coaches&AthTrn",
    "fullname": "First Responder for Coaches and Athletic Trainers",
    "info": "Emergency medicine for coaches/athletic trainers. Patient assessment, airway management, CPR, splinting, spinal immobilization. Emphasizes critical thinking skills in emergency settings. Certifications: AHA-BLS, First Responder. Taught by a multidisciplinary faculty of health care professionals.",
    "prereq": {}
  },
  {
    "uid": "004448",
    "code": "KIN3114",
    "subject": "KIN",
    "number": "3114",
    "honors": false,
    "writing": false,
    "name": "Prev/Care: Athletic Injuries",
    "fullname": "Prevention and Care of Athletic Injuries",
    "info": "Principles in athletic training for prevention/care of injury. Taping/bracing techniques. Lab.\n\nprereq: Students are encouraged to have taken an anatomy course.",
    "prereq": {}
  },
  {
    "uid": "004084",
    "code": "KIN3126W",
    "subject": "KIN",
    "number": "3126",
    "honors": false,
    "writing": true,
    "name": "Sport & Exercise Psychology",
    "fullname": "Sport and Exercise Psychology",
    "info": "Thoughts, feelings, and behaviors of people in physical activity contexts. Foundations approach to theory/research in sport and exercise psychology.\n\nprereq: Kin major or instr consent",
    "prereq": {}
  },
  {
    "uid": "003858",
    "code": "KIN3131W",
    "subject": "KIN",
    "number": "3131",
    "honors": false,
    "writing": true,
    "name": "Hist/Phil of Sport",
    "fullname": "History and Philosophy of Sport",
    "info": "Introductory description and interpretation of the historical and philosophical development of physical education and sport from primitive societies to 20th century civilization.\n\nprereq: Kin major or instr consent",
    "prereq": {}
  },
  {
    "uid": "005055",
    "code": "KIN3132",
    "subject": "KIN",
    "number": "3132",
    "honors": false,
    "writing": false,
    "name": "Intro to Motor Development",
    "fullname": "Introduction to Motor Development Across the Lifespan",
    "info": "Developmental aspects of human movement behavior/learning. Life span change of motor skills.\n\nprereq: Kin major or instr consent",
    "prereq": {}
  },
  {
    "uid": "003727",
    "code": "KIN3135",
    "subject": "KIN",
    "number": "3135",
    "honors": false,
    "writing": false,
    "name": "Intro Motor Learning & Control",
    "fullname": "Introduction to Motor Learning and Control",
    "info": "Main theoretical ideas/research that have advanced motor control/learning over last three decades.",
    "prereq": {}
  },
  {
    "uid": "004258",
    "code": "KIN3136",
    "subject": "KIN",
    "number": "3136",
    "honors": false,
    "writing": false,
    "name": "Mental Skills Trning for Sport",
    "fullname": "Mental Skills Training for Sport",
    "info": "Experientially-based course. Using mental skills training strategies (e.g., imagery, goal setting, relaxation, cognitive restructuring, motivation) for enhancing sport performance and personal growth of athletes.",
    "prereq": {}
  },
  {
    "uid": "003860",
    "code": "KIN3143",
    "subject": "KIN",
    "number": "3143",
    "honors": false,
    "writing": false,
    "name": "Organization & Admin of Sport",
    "fullname": "Organization and Administration of Sport",
    "info": "How to organize/administer sports/activities. Practice/class organization, meet/game organization, facility/equipment needs, finances.\n\nprereq: Kin major or instr consent",
    "prereq": {}
  },
  {
    "uid": "004836",
    "code": "KIN3168",
    "subject": "KIN",
    "number": "3168",
    "honors": false,
    "writing": false,
    "name": "Soccer Coaching Theory & Skill",
    "fullname": "Soccer Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach soccer.\n\nprereq: [Enrolled in coaching program or KIN major or instr consent], skills sufficient for participating in drills/game/match/contest for demonstration/teaching purposes",
    "prereq": {}
  },
  {
    "uid": "004773",
    "code": "KIN3169",
    "subject": "KIN",
    "number": "3169",
    "honors": false,
    "writing": false,
    "name": "Volleyball Coaching Theory",
    "fullname": "Volleyball Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach volleyball.\n\nprereq: [Enrolled in coaching program or KIN major or instr consent], skills sufficient for participating in drills/game/match/contest for demonstration/teaching purposes",
    "prereq": {}
  },
  {
    "uid": "004520",
    "code": "KIN3171",
    "subject": "KIN",
    "number": "3171",
    "honors": false,
    "writing": false,
    "name": "Baseball Coaching Theory & Dev",
    "fullname": "Baseball Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach baseball.\n\nprereq: [Enrolled in coaching program or KIN major or instr consent], skills sufficient for participating in drills/game/match/contest for demonstration/teaching purposes",
    "prereq": {}
  },
  {
    "uid": "004486",
    "code": "KIN3172",
    "subject": "KIN",
    "number": "3172",
    "honors": false,
    "writing": false,
    "name": "Basketball Coaching Theory",
    "fullname": "Basketball Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach basketball.\n\nprereq: [Enrolled in coaching program or KIN major or instr consent], skills sufficient for participating in drills/game/match/contest for demonstration/teaching purposes",
    "prereq": {}
  },
  {
    "uid": "004439",
    "code": "KIN3173",
    "subject": "KIN",
    "number": "3173",
    "honors": false,
    "writing": false,
    "name": "Football Coaching Theory & Dev",
    "fullname": "Football Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach football.\n\nprereq: [Enrolled in coaching program or KIN major or instr consent], skills sufficient for participating in drills/game/match/contest for demonstration/teaching purposes",
    "prereq": {}
  },
  {
    "uid": "004521",
    "code": "KIN3174",
    "subject": "KIN",
    "number": "3174",
    "honors": false,
    "writing": false,
    "name": "Golf Coaching Theory and Dev",
    "fullname": "Golf Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach golf.",
    "prereq": {}
  },
  {
    "uid": "004441",
    "code": "KIN3175",
    "subject": "KIN",
    "number": "3175",
    "honors": false,
    "writing": false,
    "name": "Gymnastics Coaching Theory",
    "fullname": "Gymnastics Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach gymnastics.",
    "prereq": {}
  },
  {
    "uid": "004442",
    "code": "KIN3176",
    "subject": "KIN",
    "number": "3176",
    "honors": false,
    "writing": false,
    "name": "Ice Hockey Coaching Theory",
    "fullname": "Ice Hockey Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach ice hockey.",
    "prereq": {}
  },
  {
    "uid": "004522",
    "code": "KIN3177",
    "subject": "KIN",
    "number": "3177",
    "honors": false,
    "writing": false,
    "name": "Swimming & Diving Coaching",
    "fullname": "Swimming and Diving Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach swimming and diving.",
    "prereq": {}
  },
  {
    "uid": "003676",
    "code": "KIN3178",
    "subject": "KIN",
    "number": "3178",
    "honors": false,
    "writing": false,
    "name": "Tennis Coaching Theory and Dev",
    "fullname": "Tennis Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach tennis.\n\nprereq: [Enrolled in coaching program or KIN major or instr consent], skills sufficient for participating in drills/game/match/contest for demonstration/teaching purposes",
    "prereq": {}
  },
  {
    "uid": "004440",
    "code": "KIN3179",
    "subject": "KIN",
    "number": "3179",
    "honors": false,
    "writing": false,
    "name": "Track & Field Coaching Theory",
    "fullname": "Track and Field Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach track and field.\n\nprereq: [Enrolled in coaching program or KIN major or instr consent], skills sufficient for participating in drills/game/match/contest for demonstration/teaching purposes",
    "prereq": {}
  },
  {
    "uid": "004889",
    "code": "KIN3181",
    "subject": "KIN",
    "number": "3181",
    "honors": false,
    "writing": false,
    "name": "Wrestling Coaching Theory",
    "fullname": "Wrestling Coaching Theory and Skill Development",
    "info": "Coaching theory and skill development necessary to coach wrestling.",
    "prereq": {}
  },
  {
    "uid": "801778",
    "code": "KIN3184",
    "subject": "KIN",
    "number": "3184",
    "honors": false,
    "writing": false,
    "name": "Lacrosse Coaching",
    "fullname": "Lacrosse Coaching Theory and Skill Development",
    "info": "Coaching theory/skill development necessary to coach lacrosse. Proficiency for being able to adequately demonstrate/teach lacrosse skills.",
    "prereq": {}
  },
  {
    "uid": "825690",
    "code": "KIN3254",
    "subject": "KIN",
    "number": "3254",
    "honors": false,
    "writing": false,
    "name": "Empowering Kenyan Youth",
    "fullname": "Empowering Kenyan Youth Through Physical Activity and Sport",
    "info": "This is a non-embedded study abroad course that takes place in Kenya during the May or Summer term.\n\nRegular participation in physical activity and sport is essential for positive health outcomes and is a tool readily utilized to empower youth. However, cultural and environmental circumstances can either facilitate or challenge opportunities and efforts among youth. This study abroad global seminar will explore first-hand the Kenyan culture and the unique chances for physical activity and movement made available to Kenyan youth, both males and females. Students will be introduced to different individual and community organizations’ efforts to provide activity opportunities to youth. They will interact with these organizations to learn how physical activity and sport extends beyond just bodily movement and exercise, but provides long-term opportunities for youth. Students will actively learn about the myriad of personal, social, cultural, and environmental challenges that face Kenyan youth to engage in sports and physical activity and how youth navigate these challenges. Students will engage in several service projects and discuss activity in the context of Kenyan culture, while remaining cognizant of their own American culture. All of this work will be completed in the context of exploring the distinctive and specific elements of the Kenyan culture compared to the US culture.\n\nStudents enrolled in the course will travel throughout Kenya (capital city of Nairobi to rural, mountainous Iten to centrally-located Mt. Kenya to the coastal area of Mombasa) to experience physical activity and sport from various perspectives including: primary aged children engaged in ballet and football (soccer); high school aged students recruited to participate in sport at prestigious boarding schools; adult athletes who have been engaged in activity since childhood and now handling family life with the love of their sport; and elite runners whose lives revolve around eating, sleeping, and training; \n",
    "prereq": {}
  },
  {
    "uid": "003689",
    "code": "KIN3327",
    "subject": "KIN",
    "number": "3327",
    "honors": false,
    "writing": false,
    "name": "Teaching PE in Elem School",
    "fullname": "Teaching Physical Education in the Elementary School",
    "info": "KIN 3327 addresses inquiry, research, and reflection through class projects, reading assignments, discussions, and team-teaching. Inquiry is addressed as classroom teachers review several sources in order to formulate a philosophy about physical education and its importance in the lives of the students they teach. Research takes place as students delve into current curriculum practices, methodology and strategies as well as knowledge of age level characteristics and developmentally appropriate activities. Reflection is twofold as student’s team-teach a variety of lessons. Students must present post reflective comments on their own teaching as well as offering positive comment as peers present physical education lessons.\n\nThis course is activity based and is designed to give the classroom teacher the ability to teach elementary physical education with age appropriate, energizing activities. We will be utilizing the classroom and the gymnasium for instruction and team-teaching. Gymnasium classes will be active, experiencing current curriculum ideas and methodology. As classroom teachers, please realize the importance of physical education to the total school curriculum including the health, social, and emotional benefits for the child.",
    "prereq": {}
  },
  {
    "uid": "005270",
    "code": "KIN3385",
    "subject": "KIN",
    "number": "3385",
    "honors": false,
    "writing": false,
    "name": "Human Physiology",
    "fullname": "Human Physiology",
    "info": "This four-credit course is divided into two weekly 75-minute lectures and one 60 minute lab session once per week. \n\nUpon completion of this course, the student will be able to describe the function of the different organs and systems in the body, explain the biophysical mechanisms and describe the interactions and feedback processes to achieve a steady-state. This course provides the biological principles for how the body works, from the function of intracellular organelles to the interactions between systems and the role of each organ. It explains the relationship between structure and function and describes the development of diseases when the physiological systems become impaired. \n\nThis course in human physiology builds on knowledge obtained using the basic sciences of math, chemistry, and physics. Thus, understanding some of these sciences' basic principles is essential to fully understanding the physiological principles during this course. \n\nThe lab component of this course takes place at the Human Performance Teaching Laboratory (HPTL). Lab activities are an interactive component of the course. During labs, students will perform a series of experiments, record data, and will provide a physiological interpretation for the results. \n\nThe combination of lecture material and laboratory experience will allow students to understand disease mechanisms, comprehend the strategies to prevent and treat the most frequent medical conditions, and live a healthy life. The instructor's goal is not just to teach the most up-to-date knowledge on human physiology but also to arouse your curiosity so you continue learning beyond this course. \n\nprereq: [KIN 3027 or ANAT 3001 or ANAT 3601 or ANAT 3611 or ANAT 3651 or ANAT 3658H ] and [Kin or Physical Activity and Health Promotion Major] or instr consent",
    "prereq": {
      "or": [
        {
          "or": [
            "788993",
            "788155",
            "800844",
            "789897",
            "826066"
          ]
        }
      ]
    }
  },
  {
    "uid": "789643",
    "code": "KIN3505",
    "subject": "KIN",
    "number": "3505",
    "honors": false,
    "writing": false,
    "name": "Intro Human-Centered Design",
    "fullname": "Intro to Human-Centered Design",
    "info": "Application of design to meet human needs. Design of fabricated products, tools/machines, software/hardware interfaces, art/culture, living environments, and complex sociotechnical systems.",
    "prereq": {}
  },
  {
    "uid": "004524",
    "code": "KIN3696",
    "subject": "KIN",
    "number": "3696",
    "honors": false,
    "writing": false,
    "name": "Sup Practical Exper",
    "fullname": "Supervised Practical Experience",
    "info": "On-the-job supervised practical experience in the fields of sport and exercise under a specialist in a particular area of study or emphasis.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "816434",
    "code": "KIN3720",
    "subject": "KIN",
    "number": "3720",
    "honors": false,
    "writing": false,
    "name": "Int'l Studies in Kinesiology",
    "fullname": "International Studies in Kinesiology",
    "info": "Topics from research exploration, to academic and engagement activities. Delivered in an international setting. Course requirements are determined by instructor(s) and reflect advanced undergraduate rigor.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004316",
    "code": "KIN3981",
    "subject": "KIN",
    "number": "3981",
    "honors": false,
    "writing": false,
    "name": "Research Methods in KIN",
    "fullname": "Research Methods in Kinesiology",
    "info": "How to understand/interpret/read research. Research question, study design, quantitative/qualitative methods. Instrumentation, statistical methods, study limitations/implications. Critiquing peer-reviewed articles. Designing a research study.",
    "prereq": {}
  },
  {
    "uid": "810410",
    "code": "KIN3982",
    "subject": "KIN",
    "number": "3982",
    "honors": false,
    "writing": false,
    "name": "Research Methods",
    "fullname": "Research Methods in Kinesiology, Physical Activity, Health Promotion, and Sport",
    "info": "This course is designed to prepare students to read, understand, interpret, evaluate, and critique research with a specific emphasis on research in the kinesiology discipline and relevance of research methods in students' everyday lives. The course will cover reviewing research articles and their relation to study design and methods. Other topics include ethical considerations in research, quantitative and qualitative design, sampling, measurement validity and reliability, and basic statistics for analyzing research questions. Students will write a literature review on a topic of interest and design a research study.\n\nprereq: Kinesiology Major or Physical Activity and Health Promotion Major or Sport Management Major",
    "prereq": {}
  },
  {
    "uid": "004991",
    "code": "KIN3993",
    "subject": "KIN",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Study Kinesiology",
    "fullname": "Directed Study in Kinesiology",
    "info": "Students have the opportunity to earn credit while working in a lab or field research setting to carry out scholarly or creative activities while under the guidance of kinesiology faculty members.  Students can assist with faculty scholarship or carry out projects of their own.\n\nTo earn credit in this course, students must talk with the faculty member and then fill out a Directed Activity Contract (z.umn.edu/Directed_Activity) online.  This contract is an agreement between the student and faculty member and should establish expectations, credits, and the grading basis for the work.",
    "prereq": {}
  },
  {
    "uid": "825230",
    "code": "KIN4028",
    "subject": "KIN",
    "number": "4028",
    "honors": false,
    "writing": false,
    "name": "Impact of the LA Olympics",
    "fullname": "The Impact of the Olympic Games on Los Angeles",
    "info": "This course is an upper-level undergraduate course designed for students to examine the impact of the Olympic Games on  Los Angeles, California, and the United States. The city of Los Angeles, California is about to host the Summer Olympic  Games for the third time (e.g., 1932, 1984 & 2028). The first Los Angeles Olympic Games were held in 1932 and Los Angeles was just starting to be a city of influence in the United States. A number of countries voiced an objection to the Olympic Games being held in Los Angeles. However, the 1932 Los Angeles Summer Olympic Games proved to be a success. These Olympic Games proved that Los Angeles was an emerging city not only in the United States but in the world. The second Los Angeles Summer Olympics were held in 1984 and followed the 1980 Moscow Summer Olympics, which the United States and other countries boycotted. In retaliation, the Soviet Union as well as other communist countries boycotted the 1984 Los Angeles Summer Olympics.  Even with the boycott the 1984 Los Angeles Summer Olympic Games were a huge success. They demonstrated that the Olympic Games could be hosted and not create a financial calamity for the hosting city, but actually create a legacy for the hosting city to build upon. In 2028 Los Angeles will host the Summer Olympic Games for a third time, joining London, England and  Paris, France as the only cities to host the Summer Olympics three times. What will happen to Los Angeles and the United States after they host the 2028 Summer Olympic Games? Will the 2028 Summer Olympic Games be as successful as the previous two Los Angeles Summer Olympic Games? This course will explore the impact of each of these Summer  Olympic Games as well as contributions that these Olympic Games have had not only on society in the United States but also the world. In addition, this course will explore the changes in sport that have occurred during this time span in the United States as well as the world. \n",
    "prereq": {}
  },
  {
    "uid": "002538",
    "code": "KIN4133",
    "subject": "KIN",
    "number": "4133",
    "honors": false,
    "writing": false,
    "name": "Perceptual-Motor Control Learn",
    "fullname": "Perceptual-Motor Control and Learning",
    "info": "Concepts/principles of coordination/control of perceptually guided movement. Constraints imposed by properties of environment, body (including the nervous system), and goals of behavior. Why we move the way that we do.",
    "prereq": {}
  },
  {
    "uid": "805741",
    "code": "KIN4134",
    "subject": "KIN",
    "number": "4134",
    "honors": false,
    "writing": false,
    "name": "The Aging Motor System",
    "fullname": "The Aging Motor System",
    "info": "Impact of aging on the motor system and its influence on activities of daily living (ADL); posture, falls, participation in physical activity, performance operating personal transportation systems. Effects of aging (behavioral and biological) on coordination/control and its related perceptual-cognitive correlates.",
    "prereq": {}
  },
  {
    "uid": "803936",
    "code": "KIN4136",
    "subject": "KIN",
    "number": "4136",
    "honors": false,
    "writing": false,
    "name": "Embodied Cognition",
    "fullname": "Embodied Cognition",
    "info": "Introduction to relations between physical behavior/mental activity. Cognitive, emotional, social aspects. Concepts of embodied cognition, their relation to traditional concepts of mind/body. Lifespan development, empirical research.\n\nprereq: 3132 or 3135 or instr consent",
    "prereq": {
      "or": [
        "005055",
        "003727"
      ]
    }
  },
  {
    "uid": "802085",
    "code": "KIN4214",
    "subject": "KIN",
    "number": "4214",
    "honors": false,
    "writing": false,
    "name": "Health Promotion",
    "fullname": "Health Promotion",
    "info": "This course is an introduction to the professional and academic field of health promotion and is designed to give students a working knowledge of health promotion concepts and methods and their application to health and health behaviors. Special emphasis will be placed on the philosophical and theoretical foundations of health promotion, specific theories of health promotion, and select health habits and the individual and environmental forces related to these behaviors. Students will also establish a foundation for developing health promotion programs for disease prevention and will focus on the process involved in developing and evaluating health promotion programs. Examples of prevention programs will be presented and evaluated including various aspects of physical activity (i.e., intrapersonal, interpersonal, community, environmental). Topics in the course focus not only on evidence-based strategies but also on key approaches to program development, implementation, and evaluation. This course is designed for declared Kinesiology B.S. and Health and Wellness Promotion Minor students in their third or fourth year of study.",
    "prereq": {}
  },
  {
    "uid": "004545",
    "code": "KIN4385",
    "subject": "KIN",
    "number": "4385",
    "honors": false,
    "writing": false,
    "name": "Exercise Physiology",
    "fullname": "Exercise Physiology",
    "info": "Information and learning experiences presented in this class will cover specific areas within the discipline of Exercise Physiology. This course is designed for the advanced undergraduate student in Kinesiology, as well as advanced students in such complementary areas as public health, nutrition, physiology, biology, biochemistry, or any sport‑ related areas. It creates a great opportunity to combine the science of biological, biochemistry, physics and physiology with the study of health, fitness, wellness, human performance, and sport. Emphasis is placed on basic human physiological systems and the responses of those systems to the challenge of physical activity: from moderate to extreme intensities. The biochemical bases of these responses will be presented. Historical, psychological, sociological, and philosophical implications of these topics will be integrated into many of the lecture/discussions. In addition to lecture information, students will be provided a \"hands on,\" small group laboratory experience that is carefully orchestrated to track lecture material and presentations.\n\nprereq: KIN 3385 or PHSL 3051 and Kinesiology Major or Physical Activity and Health Promotion Major",
    "prereq": {
      "or": [
        "005270",
        "010566"
      ]
    }
  },
  {
    "uid": "805772",
    "code": "KIN4441",
    "subject": "KIN",
    "number": "4441",
    "honors": false,
    "writing": false,
    "name": "Movement Neuroscience",
    "fullname": "Movement Neuroscience",
    "info": "Neural basis of human motor function. Neuroanatomy and neurophysiology of motor control and learning. Seminar for students in kinesiology, neuroscience, physical therapy, physiology, psychology, bioengineering, and human movement science.\n\nPrerequisite: Completion of human physiology and anatomy is recommended.",
    "prereq": {}
  },
  {
    "uid": "796986",
    "code": "KIN4520",
    "subject": "KIN",
    "number": "4520",
    "honors": false,
    "writing": false,
    "name": "Current Topics in Kinesiology",
    "fullname": "Current Topics in Kinesiology",
    "info": "Issues in kinesiology or in areas not normally available through regular curriculum offerings.\n\nprereq: Upper div in KIN or REC or SMGT or coaching or instr consent",
    "prereq": {}
  },
  {
    "uid": "800558",
    "code": "KIN4641",
    "subject": "KIN",
    "number": "4641",
    "honors": false,
    "writing": false,
    "name": "Training Theory I",
    "fullname": "Training Theory & Analytics I for Exercise & Sport Performance",
    "info": "This course prepares students to understand and systematically design training & conditioning programs for health and/or performance. The course addresses general training principles, such as periodization, adaptation, accommodation, specificity, and overload, and explores how an understanding of the 3 energy systems responsible for producing energy for exercise (the aerobic, anaerobic glycolytic, and ATP-PCr systems) can be applied to training and conditioning. Additional topics include the muscular and neuromuscular systems, physiological, and performance adaptations, repeated sprint ability, energy system interaction, measurement and evaluation of fitness, and strategies for maximizing adaptation to training. Students will gain an understanding of physiological adaptations and apply them to improving health and performance in sport and physical fitness. Enforced \n\nprereq: Enrolled in Kinesiology Major, Physical Activity and Health Promotion Major, Sports Coaching Minor, Physical Activity and Promotion Minor, Sport and Exercise Science M.Ed, Physical Activity and Health M.Ed, or Integrated Degree Program",
    "prereq": {}
  },
  {
    "uid": "818318",
    "code": "KIN4687",
    "subject": "KIN",
    "number": "4687",
    "honors": false,
    "writing": false,
    "name": "Prin & Theory Sports Coaching",
    "fullname": "Principles and Theory of Sports Coaching",
    "info": "This course introduces students to theoretical and applied aspects of sports coaching. Through active participation students will learn how to create a positive sporting environment by utilizing athlete-centered coaching strategies. Students will also learn how to evaluate and improve their own coaching performance by applying reflective and evaluative skills. Topics covered include coaching, training and management principles, coaching pedagogy, coaching science, planning, skill learning and sports psychology. At the completion of this course student will be more confident and knowledgeable in their coaching practice and have a foundation of a personal coaching philosophy. In summary, the approach in this course is toward teaching the student the theory, principles, concepts, and practices that can be applied in the dynamic, ever changing, challenging, and rewarding field of coaching.\n",
    "prereq": {}
  },
  {
    "uid": "800613",
    "code": "KIN4697",
    "subject": "KIN",
    "number": "4697",
    "honors": false,
    "writing": false,
    "name": "Student Coaching & Seminar",
    "fullname": "Student Coaching and Seminar",
    "info": "Student coaching practicum under supervision of mentor. Seminar classes. Development of integrative project.\n\nprereq: [Coaching minor or certificate] student, GPA of at least 2.50",
    "prereq": {}
  },
  {
    "uid": "801379",
    "code": "KIN4741",
    "subject": "KIN",
    "number": "4741",
    "honors": false,
    "writing": false,
    "name": "Training Theory 2",
    "fullname": "Training Theory & Analytics 2 for Sport Performance",
    "info": "Course prepares students to systematically design training & conditioning programs for performance, specific to speed, power, reaction & agility. This course utilizes periodization models with expected physiological & neuromuscular adaptations to maximize human performance in sport, dance, public safety and military elites.\n\nprereq: KIN 4641, [upper level undergrad or M.Ed. or grad student]",
    "prereq": {
      "and": [
        "800558"
      ]
    }
  },
  {
    "uid": "005281",
    "code": "KIN5001",
    "subject": "KIN",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Found HF/E",
    "fullname": "Foundations of Human Factors/Ergonomics",
    "info": "Variability in human performance as influenced by interaction with designs of machines and tools, computers and software, complex technological systems, jobs and working conditions, organizations, and sociotechnical institutions. Emphasizes conceptual, empirical, practical aspects of human factors/ergonomic science.",
    "prereq": {}
  },
  {
    "uid": "001000",
    "code": "KIN5103",
    "subject": "KIN",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Dev/Adapt Phys Ed",
    "fullname": "Developmental/Adapted Physical Education",
    "info": "Introduction to physical education for students with disabilities, emphasizing conceptual, organizational, and administrative issues. Topics include historical and legal foundations, service components, individualized education plans, professional roles, and assessment of movement skills.",
    "prereq": {}
  },
  {
    "uid": "002539",
    "code": "KIN5104",
    "subject": "KIN",
    "number": "5104",
    "honors": false,
    "writing": false,
    "name": "Phys Act Pers Dis",
    "fullname": "Physical Activities for Persons with Disabilities",
    "info": "Different approaches to providing physical education service and related \nmovement interventions for persons with disabilities. Topics: movement behavior foundations, movement skill progressions, unique considerations for specific impairments, and sport for persons with disabilities",
    "prereq": {}
  },
  {
    "uid": "004838",
    "code": "KIN5106",
    "subject": "KIN",
    "number": "5106",
    "honors": false,
    "writing": false,
    "name": "Adapted Aquatics",
    "fullname": "Adapted Aquatics",
    "info": "Introduction to adapted aquatics for students in kinesiology and leisure studies, physical therapy, and those interested in working with people with disabilities. Topics: teaching approaches, programming, accommodations/adaptations, assessments, individualized plans. Activities: pool sessions with/without clients, groups, site observations.",
    "prereq": {}
  },
  {
    "uid": "004764",
    "code": "KIN5111",
    "subject": "KIN",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Sports Facilities",
    "fullname": "Sports Facilities",
    "info": "Steps in planning/building facilities for athletics, physical education, and sport for college, professional, and public use.\n\nprereq: Kin or Rec grad student or MEd student",
    "prereq": {}
  },
  {
    "uid": "790624",
    "code": "KIN5115",
    "subject": "KIN",
    "number": "5115",
    "honors": false,
    "writing": false,
    "name": "Event Management in Sport",
    "fullname": "Event Management in Sport",
    "info": "Techniques/principles of planning, funding, and managing sport events. Collegiate championships, non-profit events, benefits, professional events.\n\nprereq: Grad student, instr consent",
    "prereq": {}
  },
  {
    "uid": "003725",
    "code": "KIN5121",
    "subject": "KIN",
    "number": "5121",
    "honors": false,
    "writing": false,
    "name": "Basic Sci to Kin",
    "fullname": "Application of Basic Sciences to Kinesiology",
    "info": "Examination of how knowledge from the basics of science can lead to differing perspectives from which to approach questions directed to kinesiological inquiry.",
    "prereq": {}
  },
  {
    "uid": "004547",
    "code": "KIN5122",
    "subject": "KIN",
    "number": "5122",
    "honors": false,
    "writing": false,
    "name": "Applied Exercise Physiology",
    "fullname": "Applied Exercise Physiology",
    "info": "Mechanisms of cardiorespiratory and muscular responses to exercise; application of exercise physiology to assessment of work capacity, athletic conditioning, and requirements of human powered vehicles; low to moderate exercise as an intervention in lowering risk for common health problems.",
    "prereq": {}
  },
  {
    "uid": "803937",
    "code": "KIN5123",
    "subject": "KIN",
    "number": "5123",
    "honors": false,
    "writing": false,
    "name": "Physical Activity Intervention",
    "fullname": "Motivational Interventions in Physical Activity",
    "info": "This course prepares students to critically evaluate theory, motivational interventions, and psychological principles related to physical activity. Environmental and policy influences on physical activity behavior and intervention components, design, and evaluation will be discussed. The influence of physical activity on mental health, self-perceptions, stress, anxiety, depression, emotional well-being, cognitive function, and health-related quality of life will be reviewed. This course will help students to better understand and modify exercise behavior and review the most commonly studied psychosocial influences and consequences of physical activity. This class integrates theoretical principles and the latest research with intervention strategies that students can apply in real-world settings. \n",
    "prereq": {}
  },
  {
    "uid": "003726",
    "code": "KIN5124",
    "subject": "KIN",
    "number": "5124",
    "honors": false,
    "writing": false,
    "name": "Human Factors",
    "fullname": "Human Factors Physiology",
    "info": "In-depth view of the concepts, problems, and issues associated with ergonomic applications to improving the design and operation of human work spaces.",
    "prereq": {}
  },
  {
    "uid": "816906",
    "code": "KIN5125",
    "subject": "KIN",
    "number": "5125",
    "honors": false,
    "writing": false,
    "name": "Adv in Phys Activity & Health",
    "fullname": "Advances in Physical Activity and Health",
    "info": "This course exposes students with accurate and up-to-date information regarding physical activity as it relates to health in the United States. It is intended to enhance students’ ability to identify important issues pertinent to physical activity and health, as well as develop and maintain a physically active lifestyle.",
    "prereq": {}
  },
  {
    "uid": "000186",
    "code": "KIN5126",
    "subject": "KIN",
    "number": "5126",
    "honors": false,
    "writing": false,
    "name": "Social Psych of Sport & P A",
    "fullname": "Social Psychology of Sport & Physical Activity",
    "info": "Theory/research on social influences, individual differences, motivational processes. How sport/physical activity contribute to psycho-social development. Social psychological factors influencing physical activity beliefs/behaviors.\n\nprereq: 3126W or equiv or grad student or instr consent",
    "prereq": {
      "or": [
        "004084"
      ]
    }
  },
  {
    "uid": "001093",
    "code": "KIN5136",
    "subject": "KIN",
    "number": "5136",
    "honors": false,
    "writing": false,
    "name": "Psych of Coaching",
    "fullname": "Psychology of Coaching",
    "info": "Psychological dimensions of coaching across age levels, including coaching philosophy, leadership, communication skills, motivation, and mental skills training for performance enhancement.",
    "prereq": {}
  },
  {
    "uid": "002550",
    "code": "KIN5141",
    "subject": "KIN",
    "number": "5141",
    "honors": false,
    "writing": false,
    "name": "Nutrition & Exerc. for Health",
    "fullname": "Nutrition and Exercise for Health Promotion and Disease Prevention",
    "info": "Requirements/physiologic roles of nutrients/physical activity in promotion of health. Assessment of energy requirements. RDAs, food composition/safety, weight management. Prevention of chronic diseases. Coronary heart disease.\n\nprereq: FScN 1112 or equiv",
    "prereq": {
      "or": [
        "007468"
      ]
    }
  },
  {
    "uid": "797824",
    "code": "KIN5142",
    "subject": "KIN",
    "number": "5142",
    "honors": false,
    "writing": false,
    "name": "Applied Nutrition for Sport",
    "fullname": "Applied Nutrition for Sport Performance and Optimal Health",
    "info": "This course is designed for students interested in nutrition as it relates to health, exercise and athletic training. Evidenced based information is used to apply current nutrition concepts to improve health, physical and athletic performance. Case studies as well as personal data are employed throughout course to support concepts of lecture.",
    "prereq": {}
  },
  {
    "uid": "004743",
    "code": "KIN5152",
    "subject": "KIN",
    "number": "5152",
    "honors": false,
    "writing": false,
    "name": "Curriculum Development in PE",
    "fullname": "Curriculum Development in Physical Education",
    "info": "Trends, issues, and challenges in early childhood/K-12 physical education. Potential effect on curriculum.\n\nprereq: initial licensure/MEd phys ed student",
    "prereq": {}
  },
  {
    "uid": "004523",
    "code": "KIN5171",
    "subject": "KIN",
    "number": "5171",
    "honors": false,
    "writing": false,
    "name": "Foundations of Kinesiology",
    "fullname": "Foundations of Kinesiology",
    "info": "Introduction to the emerging field of kinesiology, broadly conceived as the study of human movement. Development and emergence of the term kinesiology and the scholarly, political, and educational ramifications of its development.",
    "prereq": {}
  },
  {
    "uid": "800882",
    "code": "KIN5181",
    "subject": "KIN",
    "number": "5181",
    "honors": false,
    "writing": false,
    "name": "Understanding Kin Research",
    "fullname": "Understanding Kinesiology Research",
    "info": "Prepares students to critically analyze research specific to kinesiology. Ethics, measurement, experimental and qualitative design, and physical activity epidemiology research will be reviewed. The application of research to practice will be emphasized. \n\nThis course is designed for School of Kinesiology M.Ed Students. Undergraduates, M.S. M.A., and Ph.D. students should consult with their academic advisor before registering for this course. Recommended prerequisite: introductory statistics",
    "prereq": {}
  },
  {
    "uid": "003731",
    "code": "KIN5196",
    "subject": "KIN",
    "number": "5196",
    "honors": false,
    "writing": false,
    "name": "Practicum: Dev/Adapted PE",
    "fullname": "Practicum: Developmental/Adapted Physical Education",
    "info": "Observation of, participation in physical education instruction for students with disabilities. Current issues in developmental/adapted physical education. Exchange of ideas/problems.\n\nprereq: [5103 or 5104], instr consent",
    "prereq": {
      "or": [
        "001000",
        "002539"
      ]
    }
  },
  {
    "uid": "808165",
    "code": "KIN5201",
    "subject": "KIN",
    "number": "5201",
    "honors": false,
    "writing": false,
    "name": "Health Education Foundations",
    "fullname": "Health Education Foundations",
    "info": "Foundations, conceptual framework, and personal philosophy of health. Analysis of individual, school, and community health information. Environmental/social aspects that contribute to healthy living.",
    "prereq": {}
  },
  {
    "uid": "808166",
    "code": "KIN5202",
    "subject": "KIN",
    "number": "5202",
    "honors": false,
    "writing": false,
    "name": "Current Issues in Health",
    "fullname": "Current Issues in Health",
    "info": "Critical thinking for health issues in research/media. Issues specific to conflict, stress, public policy, and communication. Projects, debates.",
    "prereq": {}
  },
  {
    "uid": "808167",
    "code": "KIN5203",
    "subject": "KIN",
    "number": "5203",
    "honors": false,
    "writing": false,
    "name": "Hlth Media Cons. & Comm.",
    "fullname": "Health Media, Consumerism, and Communication",
    "info": "Effects of media, consumerism, technology, and health related issues. Students form/defend opinions on positive/negative aspects of how health information is disseminated and how individual health decisions are made. ",
    "prereq": {}
  },
  {
    "uid": "808187",
    "code": "KIN5204",
    "subject": "KIN",
    "number": "5204",
    "honors": false,
    "writing": false,
    "name": "Methods in Health Education",
    "fullname": "Methods in Health Education",
    "info": "Background knowledge/skills to deliver comprehensive health education program. Techniques, skills, and methods for teaching active learning projects. Lessons/units in health curriculum discussed/demonstrated. Focuses on grades 5-12.\n\nprereq: Health licensure student or instr consent",
    "prereq": {}
  },
  {
    "uid": "808188",
    "code": "KIN5205",
    "subject": "KIN",
    "number": "5205",
    "honors": false,
    "writing": false,
    "name": "Health Education Curriculum",
    "fullname": "Health Education Curriculum",
    "info": "Curriculum development in health education.  Trends in society. How they impact teaching of health curriculum. Culminates in written curriculum for grades 5-12.\n\nprereq: Health licensure student or instr consent",
    "prereq": {}
  },
  {
    "uid": "016712",
    "code": "KIN5235",
    "subject": "KIN",
    "number": "5235",
    "honors": false,
    "writing": false,
    "name": "Advanced Biomechanics II",
    "fullname": "Advanced Biomechanics II:  Kinetics",
    "info": "Kinetic aspects of human movement (single/multi-joint torques, simple inverted pendulum models, mass-spring systems). Analysis of experimental data and of computer simulations.  Lectures, seminars, lab.\n\nprereq: [3112 or equiv], PMed 5135, undergrad college physics, intro calculus",
    "prereq": {
      "or": [
        "004830"
      ]
    }
  },
  {
    "uid": "003949",
    "code": "KIN5328",
    "subject": "KIN",
    "number": "5328",
    "honors": false,
    "writing": false,
    "name": "Int'l Sprt: Olym Games Impact",
    "fullname": "International Sport: The Impact of the Olympic Games",
    "info": "In the late nineteenth century, Baron Pierre de Coubertin, a French aristocrat, worked tirelessly to revive the Olympic Games from Greek history.  Through Baron de Coubertin's efforts, the first Olympic Games of the modern era took place in 1896 in Athens, Greece. From a small sporting event that hosted a little over 300 athletes from 13 countries the Olympic Games have grown over the last 120 years to one of the most viewed sporting events in the world.  Today, the Olympic Games hosts over 10,000 athletes from over 200 countries. The International Olympic Committee (IOC), which runs the Olympic Games, is now one of the most powerful and richest sporting organizations in the world.  The Olympic Games have had a profound impact on the world we live in and they provide us with a platform for examining changes in the world's cultural, economic, social and political processes over the last 120 years. This course explores the impact of a specific Olympic Game(s) held on that host city's culture, economy and political landscape. In addition, this course will explore that Olympic Games(s) impact on the world's cultural, social and political processes. ",
    "prereq": {}
  },
  {
    "uid": "004529",
    "code": "KIN5365",
    "subject": "KIN",
    "number": "5365",
    "honors": false,
    "writing": false,
    "name": "HP Program Design",
    "fullname": "Health Promotion Program Design and Implementation",
    "info": "Study of behavioral change methodology and theory related to nutrition, weight control, exercise, stress management, healthy lifestyles, and lifetime health. Application of these concepts in health promotion settings including work sites, managed care organizations, clinics, fitness centers, and educational institutes.",
    "prereq": {}
  },
  {
    "uid": "003888",
    "code": "KIN5371",
    "subject": "KIN",
    "number": "5371",
    "honors": false,
    "writing": false,
    "name": "Sport and Society",
    "fullname": "Sport and Society",
    "info": "Sport, sporting processes, social influences, systems. Structures that have effected and exist within/among societies, nations, and cultures. Contemporary issues such as social differentiation, violence, and honesty.\n\nprereq: [3126W, grad student] or instr consent",
    "prereq": {
      "and": [
        "004084"
      ]
    }
  },
  {
    "uid": "004085",
    "code": "KIN5375",
    "subject": "KIN",
    "number": "5375",
    "honors": false,
    "writing": false,
    "name": "Youth Sport Science",
    "fullname": "Youth Sport Science",
    "info": "Cognitive, behavioral, and biological factors having important implications for competitive sport participants from early childhood through high school age. Emphasis on translating sport science research into practical implications for youth sport coaches, teachers, and administrators.",
    "prereq": {}
  },
  {
    "uid": "002549",
    "code": "KIN5385",
    "subject": "KIN",
    "number": "5385",
    "honors": false,
    "writing": false,
    "name": "Healthy Aging & Disease Preven",
    "fullname": "Exercise for Healthy Aging & Disease Prevention and Management",
    "info": "Exercise testing/prescription with modifications required because of special considerations associated with aging, gender differences, or presence of medical conditions.\n\nprereq: Physiology or biology undergrad",
    "prereq": {}
  },
  {
    "uid": "790627",
    "code": "KIN5421",
    "subject": "KIN",
    "number": "5421",
    "honors": false,
    "writing": false,
    "name": "Sport Finance",
    "fullname": "Sport Finance",
    "info": "Introduction to financial analysis in sport. Cash flow statements, budgeting issues, traditional/innovative revenue producing strategies available to sport organizations. Discussion, practical analysis of current market.\n\nprereq: Grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "790618",
    "code": "KIN5435",
    "subject": "KIN",
    "number": "5435",
    "honors": false,
    "writing": false,
    "name": "Exercise Science Laboratory",
    "fullname": "Advanced Theory and Techniques of Exercise Science",
    "info": "Theoretical constructs, in-depth description of procedures used in exercise science research and clinical settings. Laboratory exercises, lectures.\n\nprereq: [3385, 4385, Kin major] or instr consent",
    "prereq": {
      "or": [
        "005270",
        "004545"
      ]
    }
  },
  {
    "uid": "802295",
    "code": "KIN5441",
    "subject": "KIN",
    "number": "5441",
    "honors": false,
    "writing": false,
    "name": "Applied Sport Science Research",
    "fullname": "Applied Sport Science Research",
    "info": "Introduction to varied contributions of sport sciences to athletic performance. Evaluation of historical research's contributions toward modern day research questions.",
    "prereq": {}
  },
  {
    "uid": "004786",
    "code": "KIN5461",
    "subject": "KIN",
    "number": "5461",
    "honors": false,
    "writing": false,
    "name": "Issues in the Sport Industry",
    "fullname": "Issues in the Sport Industry",
    "info": "Critical analysis of management issues within sport industry. Strategic management, corporate social responsibility, human resource management/diversity, governance, sport globalization, sport development.\n\nprereq: postbac or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "790619",
    "code": "KIN5485",
    "subject": "KIN",
    "number": "5485",
    "honors": false,
    "writing": false,
    "name": "Exercise Test and Prescription",
    "fullname": "Exercise Testing and Prescription",
    "info": "This course will provide an introduction to exercise testing and prescription including basic placement of EKG placement and interpretation of an electrocardiogram. Students will also learn the basics of gas exchange and fitness test and the use of this information in the prescription of exercise in a variety of populations as well as use of electrocardiogram in clinical exercise testing and exercise prescription.  \n\nprereq: [3385, 4385] or instr consent",
    "prereq": {
      "and": [
        "005270",
        "004545"
      ]
    }
  },
  {
    "uid": "789644",
    "code": "KIN5505",
    "subject": "KIN",
    "number": "5505",
    "honors": false,
    "writing": false,
    "name": "Human-Ctr Design - Prin & Apps",
    "fullname": "Human-Centered Design - Principles and Applications",
    "info": "Application of design to meet human needs. Design of fabricated products, tools/machines, software/hardware interfaces, art/culture, living environments, and complex sociotechnical systems.",
    "prereq": {}
  },
  {
    "uid": "004609",
    "code": "KIN5511",
    "subject": "KIN",
    "number": "5511",
    "honors": false,
    "writing": false,
    "name": "Sport and Gender",
    "fullname": "Sport and Gender",
    "info": "Critically examines women's involvement in/contributions to sport, physical activity, and leisure.",
    "prereq": {}
  },
  {
    "uid": "806837",
    "code": "KIN5585",
    "subject": "KIN",
    "number": "5585",
    "honors": false,
    "writing": false,
    "name": "Pediatric Health & Disease",
    "fullname": "Pediatric Physiology and Health: Concepts and Applications",
    "info": "Current understanding of pediatric medicine and exercise physiology. Use of physical activity and weight management in the treatment of various diseases (i.e, obesity) that affect children and adolescents.\n\nprereq: 3385 or 4385",
    "prereq": {
      "or": [
        "005270",
        "004545"
      ]
    }
  },
  {
    "uid": "790629",
    "code": "KIN5601",
    "subject": "KIN",
    "number": "5601",
    "honors": false,
    "writing": false,
    "name": "Sport Mgt Ethics and Policy",
    "fullname": "Sport Management Ethics and Policy",
    "info": "How to critically analyze ethical concepts that underpin or inform sport policies and evaluate sport policies from a normative point of view. Selected sport policy issues are used to illustrate relevance of ethical considerations in policy development and to explore the ethical implications of sport policy.\n\nprereq: MEd or grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004449",
    "code": "KIN5621",
    "subject": "KIN",
    "number": "5621",
    "honors": false,
    "writing": false,
    "name": "Adv Ath Train: Eval",
    "fullname": "Advanced Athletic Training: Evaluation of Athletic Injury",
    "info": "Theory, principles, techniques to recognize/evaluate athletic injury to all major body parts.",
    "prereq": {}
  },
  {
    "uid": "004832",
    "code": "KIN5622",
    "subject": "KIN",
    "number": "5622",
    "honors": false,
    "writing": false,
    "name": "Ther Mod in Ath Trn",
    "fullname": "Therapeutic Modalities in Athletic Training",
    "info": "Theoretically based guide for the use of therapeutic modalities for the management of athletic injuries in a practical setting.  ",
    "prereq": {}
  },
  {
    "uid": "790630",
    "code": "KIN5631",
    "subject": "KIN",
    "number": "5631",
    "honors": false,
    "writing": false,
    "name": "Programming & Promo in Sport",
    "fullname": "Programming and Promotion in Sport",
    "info": "Introduction to marketing concepts as they apply to sport industry. Consumer behavior, market research, marketing mix, corporate sponsorship, licensing. Discussion, practical application.\n\nprereq: Kin or Rec grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "800776",
    "code": "KIN5641",
    "subject": "KIN",
    "number": "5641",
    "honors": false,
    "writing": false,
    "name": "Scientific Training in Sport",
    "fullname": "Scientific Theory and Application of Training and Conditioning in Sport",
    "info": "Current scientific literature on physiological adaptation through training/conditioning for sport. Applying methods in research journals to improve physiological adaptation through training/conditioning with sport specificity.\n\nprereq: 4385 or SPST 3641 or SPST 4641 or exercise physiology course or instr consent",
    "prereq": {
      "or": [
        "004545",
        "800558"
      ]
    }
  },
  {
    "uid": "814432",
    "code": "KIN5643",
    "subject": "KIN",
    "number": "5643",
    "honors": false,
    "writing": false,
    "name": "Applied Movement Analysis",
    "fullname": "Applied Motion Capture and Movement Analysis Technology",
    "info": "Course provides students with the knowledge and tools to effectively analyze human movement patterns in a wide variety of field-based settings, such as \nassessing sport skill performance or measuring movement deficits after injury. Students will comprehend the basic, underlying components of movement and movement deficits.\n\nIt is strongly suggested students have taken Physics, Biomechanics, and Human Anatomy.\n\nCredit will not be received if taken KIN 5720: Special Topics in Kinesiology with the topic title, Sport Movement Analysis.",
    "prereq": {}
  },
  {
    "uid": "789557",
    "code": "KIN5696",
    "subject": "KIN",
    "number": "5696",
    "honors": false,
    "writing": false,
    "name": "Practicum in Kinesiology",
    "fullname": "Practicum in Kinesiology",
    "info": "Practical experience in kinesiology under supervision of a University faculty member and an agency supervisor.\n\nprereq: [Kin MEd or grad student], instr consent",
    "prereq": {}
  },
  {
    "uid": "003677",
    "code": "KIN5697",
    "subject": "KIN",
    "number": "5697",
    "honors": false,
    "writing": false,
    "name": "Student Teaching: Coaching",
    "fullname": "Student Teaching: Coaching",
    "info": "Student coaching experience under supervision of a mentor coach.",
    "prereq": {}
  },
  {
    "uid": "015654",
    "code": "KIN5720",
    "subject": "KIN",
    "number": "5720",
    "honors": false,
    "writing": false,
    "name": "Topics in Kinesiology",
    "fullname": "Special Topics in Kinesiology",
    "info": "Current issues in the broad field and subfields in kinesiology, or related coursework in areas not normally available through regular offerings.",
    "prereq": {}
  },
  {
    "uid": "003728",
    "code": "KIN5722",
    "subject": "KIN",
    "number": "5722",
    "honors": false,
    "writing": false,
    "name": "Human Factors Psychology",
    "fullname": "Human Factors Psychology",
    "info": "Psychological principles that underlie human interactions with technological systems. Techniques/methodologies to assess faulty/incorrect system design. Emphasizes human-centered approaches. Rigorous evaluation of human-machine interaction.",
    "prereq": {}
  },
  {
    "uid": "004086",
    "code": "KIN5723",
    "subject": "KIN",
    "number": "5723",
    "honors": false,
    "writing": false,
    "name": "Psych of Sport Injury & Rehab",
    "fullname": "Psychology of Sport Injury and Rehabilitation",
    "info": "Psychosocial bases of risk factors preceding sport injury, responses to the occurrence of sport injury, and the rehabilitation process. Lecture, discussion, guest lecture, interviews, and presentation experience.\n\nprereq: Intro psych course",
    "prereq": {}
  },
  {
    "uid": "004168",
    "code": "KIN5725",
    "subject": "KIN",
    "number": "5725",
    "honors": false,
    "writing": false,
    "name": "Org and Mgmt of Spt",
    "fullname": "Organization and Management of Physical Education and Sport",
    "info": "Comprehensive analysis of organization and management of physical education and sport in educational settings. Focus on management and planning processes, management skills, functions, roles, decision making, leadership, shared systems, and organizational motivation. For physical education teachers, coaches, community sport administrators.\n\nprereq: Grad/initial licensure or instr consent",
    "prereq": {}
  },
  {
    "uid": "004747",
    "code": "KIN5726",
    "subject": "KIN",
    "number": "5726",
    "honors": false,
    "writing": false,
    "name": "PE-Team & Trek",
    "fullname": "Physical Education--Teaming and Trekking",
    "info": "Development of cooperative and team-building activities, group planning, and leadership skills in preparation for a two-day trip in a state park using practiced outdoor skills of camping, canoeing, and backpacking. Must be comfortable in water.",
    "prereq": {}
  },
  {
    "uid": "004748",
    "code": "KIN5727",
    "subject": "KIN",
    "number": "5727",
    "honors": false,
    "writing": false,
    "name": "PE - An Adventure",
    "fullname": "Physical Education--An Adventure Experience",
    "info": "Group and individual initiatives in an experientially based program emphasizing participation in leadership, group cooperation, problem solving, low ropes, climbing walls, sensible risk taking, and trust-oriented activities.",
    "prereq": {}
  },
  {
    "uid": "825954",
    "code": "KIN5736",
    "subject": "KIN",
    "number": "5736",
    "honors": false,
    "writing": false,
    "name": "Sport Performance Psychology",
    "fullname": "Sport Performance Psychology",
    "info": "This course will focus on psychological skills, methods, and self-regulatory skills in sport and exercise, and how sport psychologists, coaches, therapists, athletes, and fitness specialists use these skills and methods to positively affect sport and exercise participation, performance, motivation, and enjoyment. The psychological skills and methods will be presented via discussion of underlying theory (e.g., the performance/arousal relationship) and specific intervention techniques (e.g., goal setting, imagery). Theoretical frameworks for sport and exercise-related educational counseling (e.g., self- regulation) across a variety of contexts will be discussed. This course will also address ethical and legal considerations for consulting in the sport and exercise settings. Finally, students will learn about the requirements to attain AASP certification.",
    "prereq": {}
  },
  {
    "uid": "787628",
    "code": "KIN5740",
    "subject": "KIN",
    "number": "5740",
    "honors": false,
    "writing": false,
    "name": "Topics: Coaching Sports",
    "fullname": "Topics: Coaching of Individual, Dual, or Team Sports",
    "info": "Instruction at the advanced level, including analyses of skills, game strategies, specific techniques of coaching, and methods of training and conditioning.",
    "prereq": {}
  },
  {
    "uid": "004235",
    "code": "KIN5801",
    "subject": "KIN",
    "number": "5801",
    "honors": false,
    "writing": false,
    "name": "Legal Aspects of Sport/PA",
    "fullname": "Legal Aspects of Sport and Physical Activity",
    "info": "Legal issues related to sport and physical activity settings and facilities in public/private sectors\n\n\n",
    "prereq": {}
  },
  {
    "uid": "804925",
    "code": "KIN5804",
    "subject": "KIN",
    "number": "5804",
    "honors": false,
    "writing": false,
    "name": "NCAA Compliance",
    "fullname": "National Collegiate Athletic Association (NCAA) Compliance",
    "info": "Governance structure, policies, and procedures in intercollegiate athletics. Careers in college athletics as coach, administrator, athletic trainer, counselor, etc.\n\nprereq: [Upper div undergrad or grad student] in KIN, instr consent",
    "prereq": {}
  },
  {
    "uid": "802294",
    "code": "KIN5841",
    "subject": "KIN",
    "number": "5841",
    "honors": false,
    "writing": false,
    "name": "Elite Performance",
    "fullname": "Elite Performance and Environmental Considerations",
    "info": "An examination of elite athletic performance and the effects of environmental conditions on sport performance. Topics include altitude, heat and humidity, cold, wind, and other high stress environments. Students will investigate strategies such as nutrition/dehydration, training, and acclimatization.\n\nprereq: KIN 4385 or 4641 or instr consent  suggested",
    "prereq": {
      "or": [
        "004545",
        "800558"
      ]
    }
  },
  {
    "uid": "016713",
    "code": "KIN5941",
    "subject": "KIN",
    "number": "5941",
    "honors": false,
    "writing": false,
    "name": "Clinical Movement Neuroscience",
    "fullname": "Clinical Movement Neuroscience",
    "info": "Various neural subsystems involved in controlling human motor function. How injury and disease of the nervous system affects motor behavior. Possibilities for rehabilitation and treatment. Lectures, seminars, class presentations.\n\nprereq: [3027 or ANAT 3001 or ANAT 3601 or ANAT 3611 or equiv], [PHSL 3051 or equiv], [4441]",
    "prereq": {
      "and": [
        {
          "or": [
            "788993",
            "788155",
            "800844",
            "789897"
          ]
        },
        {
          "or": [
            "010566"
          ]
        },
        {
          "and": [
            "805772"
          ]
        }
      ]
    }
  },
  {
    "uid": "004787",
    "code": "KIN5981",
    "subject": "KIN",
    "number": "5981",
    "honors": false,
    "writing": false,
    "name": "Rsrch Mthdlgy Kin & Sprt Mgmt",
    "fullname": "Research Methodology in Kinesiology and Sport Management",
    "info": "Defines/reviews various types of research in exercise/sport science, and physical education. Qualitative research, field studies, and methods of introspection as alternative research strategies to traditional scientific paradigm.",
    "prereq": {}
  },
  {
    "uid": "797371",
    "code": "KIN5987",
    "subject": "KIN",
    "number": "5987",
    "honors": false,
    "writing": false,
    "name": "Grant Writing for Health Sci",
    "fullname": "Professional Skills and Grant Writing for Health Sciences",
    "info": "Introduction to structure/function of different organizations (e.g., NIH, AHA). Writing/reviewing grants/manuscripts. Preparing for a job in academia.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "005053",
    "code": "KIN5992",
    "subject": "KIN",
    "number": "5992",
    "honors": false,
    "writing": false,
    "name": "Readings in Kinesiology",
    "fullname": "Readings in Kinesiology",
    "info": "Independent study under tutorial guidance.\n\nprereq: [KIN upper div undergrad or MEd or grad student], instr consent",
    "prereq": {}
  },
  {
    "uid": "005051",
    "code": "KIN5995",
    "subject": "KIN",
    "number": "5995",
    "honors": false,
    "writing": false,
    "name": "Research Problems-Applied Kin",
    "fullname": "Research Problems in Applied Kinesiology",
    "info": "Selected topics in physical activity and human performance.\n\nprereq: [Kin upper div undergrad or MEd or grad student], 15 cr of major coursework [including 4981 or 5981], instr consent",
    "prereq": {
      "or": [
        {
          "or": [
            "004787"
          ]
        }
      ]
    }
  },
  {
    "uid": "004740",
    "code": "KIN6151",
    "subject": "KIN",
    "number": "6151",
    "honors": false,
    "writing": false,
    "name": "Theor Foundations of CI in PE",
    "fullname": "Theoretical Foundations of Curriculum and Instruction in Physical Education",
    "info": "Selection of effective instructional strategies/assessment. Design, progression, and presentation of tasks in physical education curriculum.\n\nprereq: initial licensure/MEd phys ed student",
    "prereq": {}
  },
  {
    "uid": "808189",
    "code": "KIN6201",
    "subject": "KIN",
    "number": "6201",
    "honors": false,
    "writing": false,
    "name": "Clinical Exper I: Health Ed",
    "fullname": "Clinical Experience I: Health Education",
    "info": "Half-day supervised teaching in urban or suburban middle or high school health education setting.",
    "prereq": {}
  },
  {
    "uid": "808190",
    "code": "KIN6202",
    "subject": "KIN",
    "number": "6202",
    "honors": false,
    "writing": false,
    "name": "Clinical Experience II: Health",
    "fullname": "Clinical Experience II: Health Education",
    "info": "Full-day supervised teaching in urban or suburban middle or high school health education setting.\n\nprereq: Health licensure student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004741",
    "code": "KIN6521",
    "subject": "KIN",
    "number": "6521",
    "honors": false,
    "writing": false,
    "name": "Pedagogy I:  Elem Phys Ed",
    "fullname": "Pedagogy I: Elementary Physical Education",
    "info": "Instructional components/knowledge structures for teaching/learning process of K-6 physical educator in diverse settings.\n\nprereq: initial licensure/MEd phys ed student",
    "prereq": {}
  },
  {
    "uid": "004742",
    "code": "KIN6522",
    "subject": "KIN",
    "number": "6522",
    "honors": false,
    "writing": false,
    "name": "Pedagogy II:  Sec Phys Ed",
    "fullname": "Pedagogy II: Secondary Physical Education",
    "info": "Instructional components for teaching/learning process of grades 6-12 physical educator in diverse settings.\n\nprereq: initial licensure/MEd phys ed student",
    "prereq": {}
  },
  {
    "uid": "004744",
    "code": "KIN6596",
    "subject": "KIN",
    "number": "6596",
    "honors": false,
    "writing": false,
    "name": "Clinical Exp I:  Phys Ed",
    "fullname": "Clinical Experience I: Physical Education",
    "info": "Half-day supervised teaching in an urban elementary school physical education setting.\n\nprereq: 6151, 6521, 6522, initial licensure/MEd phys ed student or instr consent",
    "prereq": {
      "or": [
        "004740",
        "004741",
        "004742"
      ]
    }
  },
  {
    "uid": "004745",
    "code": "KIN6597",
    "subject": "KIN",
    "number": "6597",
    "honors": false,
    "writing": false,
    "name": "Clinical Exp II:  Phys Ed",
    "fullname": "Clinical Experience II:  Physical Education",
    "info": "Half-day supervised teaching in urban or suburban elementary, middle, or high school physical education setting.\n\nprereq: 6596, initial licensure/MEd phys ed student or instr consent",
    "prereq": {
      "or": [
        "004744"
      ]
    }
  },
  {
    "uid": "004746",
    "code": "KIN6598",
    "subject": "KIN",
    "number": "6598",
    "honors": false,
    "writing": false,
    "name": "Clinical Exp III:  Phys Ed",
    "fullname": "Clinical Experience III:  Physical Education",
    "info": "Supervised teaching in urban or suburban elementary, middle, or high school physical education setting.\n\nprereq: [6597, init licensure/MEd phys ed student] or instr consent",
    "prereq": {
      "or": [
        "004745"
      ]
    }
  },
  {
    "uid": "801064",
    "code": "KIN8001",
    "subject": "KIN",
    "number": "8001",
    "honors": false,
    "writing": false,
    "name": "Topics HF/E",
    "fullname": "Special Topics: Human Factors/Ergonomics",
    "info": "Human factors/ergonomics. Interaction of performance/behavior with design factors in performance environment. Concepts, methods, empirical findings, different systems applications, current research. Topics vary.\n\nprereq: Enrollment in good standing, grad HumF minor",
    "prereq": {}
  },
  {
    "uid": "801065",
    "code": "KIN8002",
    "subject": "KIN",
    "number": "8002",
    "honors": false,
    "writing": false,
    "name": "Prosem HF/E",
    "fullname": "Proseminar in Human Factors/Ergonomics",
    "info": "Issues/concerns tailored to interests of faculty/students regarding human factors/ergonomics. Interaction of performance/behavior with design factors in performance environment.\n\nprereq: Enrollment in good standing, grad HumF minor",
    "prereq": {}
  },
  {
    "uid": "825698",
    "code": "KIN8010",
    "subject": "KIN",
    "number": "8010",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Kinesiology",
    "fullname": "Special Topics in Kinesiology",
    "info": "Current issues in the broad field and subfields in kinesiology, or related coursework in areas not normally available through regular offerings.",
    "prereq": {}
  },
  {
    "uid": "007804",
    "code": "KIN8122",
    "subject": "KIN",
    "number": "8122",
    "honors": false,
    "writing": false,
    "name": "Seminar: Exercise Physiology",
    "fullname": "Seminar: Exercise Physiology",
    "info": "Classic/contemporary literature in exercise physiology/allied disciplines. Contributions of major leaders in field. Opportunities for interdisciplinary research. Spring semester students/faculty in exercise science present original research.\n\nprereq: 5122 or equiv or instr consent",
    "prereq": {
      "or": [
        "004547"
      ]
    }
  },
  {
    "uid": "004088",
    "code": "KIN8126",
    "subject": "KIN",
    "number": "8126",
    "honors": false,
    "writing": false,
    "name": "Sports Medicine Psychology",
    "fullname": "Sports Medicine Psychology",
    "info": "Advanced seminar course. Multidisciplinary contributors to sports medicine psychology. Theory, research, and practice in the behavioral/social aspects of injury prevention/experiences among physically active populations across the life span.\n\nprereq: Grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "799091",
    "code": "KIN8128",
    "subject": "KIN",
    "number": "8128",
    "honors": false,
    "writing": false,
    "name": "Seminar: Sport Management",
    "fullname": "Doctoral Sport Management Seminar",
    "info": "Analysis of current literature, theoretical constructs, research methodology and design relative to sport management. Focuses on student-selected topics, research problems.\n\nprereq: PhD student, instr consent",
    "prereq": {}
  },
  {
    "uid": "002548",
    "code": "KIN8132",
    "subject": "KIN",
    "number": "8132",
    "honors": false,
    "writing": false,
    "name": "Sem: Motor Develop",
    "fullname": "Seminar: Motor Development",
    "info": "Contemporary research literature on motor skill development from before birth to senescence. Emphasizes interaction between physical/environmental/performer constraints. Coordination/control of movement.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "003661",
    "code": "KIN8135",
    "subject": "KIN",
    "number": "8135",
    "honors": false,
    "writing": false,
    "name": "Sem: Mot Con Lrng",
    "fullname": "Seminar: Motor Control and Learning",
    "info": "Advanced reading/discussion of research on motor control, motor learning, human performance.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "805742",
    "code": "KIN8136",
    "subject": "KIN",
    "number": "8136",
    "honors": false,
    "writing": false,
    "name": "Developmental Sport Psychology",
    "fullname": "Developmental Sport and Exercise Psychology",
    "info": "Sport and exercise psychology from a life span developmental perspective. Theoretical perspectives, self-perceptions, social influences, emotional development, motivational processes, self-regulation, development of expertise, moral development, sport injury, and gender and cultural diversity.\n\nprereq: Grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "792027",
    "code": "KIN8211",
    "subject": "KIN",
    "number": "8211",
    "honors": false,
    "writing": false,
    "name": "Seminar: Perception and Action",
    "fullname": "Seminar: Perception and Action",
    "info": "Survey of theory/research on use of perceptual information for control of action. Behavioral research on perceptual guidance of daily activities (e.g., standing, walking, driving). Perceptual control in context of expertise (e.g., sports). Perceptual-motor development.\n\nprereq: grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "816490",
    "code": "KIN8285",
    "subject": "KIN",
    "number": "8285",
    "honors": false,
    "writing": false,
    "name": "Cellular Molecular Physiology",
    "fullname": "Cellular and Molecular Exercise Physiology",
    "info": "This course emphasizes the cellular and molecular mechanisms in response to acute and chronic physical exercise. Biochemical pathways of regulating energy metabolism during exercise, change of gene expression as adaptation to altered diet, environmental factors and aging, and cellular oxidative-antioxidant homeostatsis will be the main foci. The course will expose graduate students and advanced undergraduate students to current topics of biomedical issues affecting human health and wellbeing, modern techniques of exercise science research, and important research articles in literature.\n\nprereq: KIN 3385: Human Physiology and KIN 4385: Exercise Physiology; KIN 5122: Applied Exercise Physiology; college level chemistry. Suggested: organic chemistry, or instr consent\n\nCredits will not be given if taken as KIN 5720 with the same title.",
    "prereq": {
      "or": [
        "005270",
        "004545",
        "004547",
        "015654"
      ]
    }
  },
  {
    "uid": "788134",
    "code": "KIN8333",
    "subject": "KIN",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788369",
    "code": "KIN8444",
    "subject": "KIN",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "004842",
    "code": "KIN8607",
    "subject": "KIN",
    "number": "8607",
    "honors": false,
    "writing": false,
    "name": "Sem:IntlComp PE/Spt",
    "fullname": "Seminar: International and Comparative Physical Education and Sport",
    "info": "Comparative analysis of selected physical education and sport delivery systems, structures, sport policies, and management of practices and systems of selected countries. Sociocultural impact and issues concerning conduct of sport.",
    "prereq": {}
  },
  {
    "uid": "788492",
    "code": "KIN8666",
    "subject": "KIN",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; Dept consent required; No grade associated; 4 completions allowed; up to 24 combined cr.",
    "prereq": {}
  },
  {
    "uid": "004089",
    "code": "KIN8696",
    "subject": "KIN",
    "number": "8696",
    "honors": false,
    "writing": false,
    "name": "Intern Sport Psych",
    "fullname": "Internship: Applied Sport Psychology",
    "info": "Supervised internship; emphasis on educational sport psychology approaches to athletic performance enhancement and psychological adjustment to sport injury.\n\nprereq: 5126, 8126, Kin PhD student, instr consent",
    "prereq": {
      "and": [
        "000186",
        "004088"
      ]
    }
  },
  {
    "uid": "788619",
    "code": "KIN8777",
    "subject": "KIN",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required (Plan A only)",
    "prereq": {}
  },
  {
    "uid": "787887",
    "code": "KIN8888",
    "subject": "KIN",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "005056",
    "code": "KIN8980",
    "subject": "KIN",
    "number": "8980",
    "honors": false,
    "writing": false,
    "name": "Grad Res Sem Kin",
    "fullname": "Graduate Research Seminar in Kinesiology",
    "info": "Reporting/discussion of student/faculty research activity.\n\nprereq: KIN M.S. or Ph.D. or SMGT M.A. or instr consent",
    "prereq": {}
  },
  {
    "uid": "005052",
    "code": "KIN8995",
    "subject": "KIN",
    "number": "8995",
    "honors": false,
    "writing": false,
    "name": "Research Problems-Kinesiology",
    "fullname": "Research Problems in Kinesiology",
    "info": "Individual scholarly research.\n\nprereq: Kin Ph.D. student or SMGT grad student or instr consent",
    "prereq": {}
  }
]