[
  {
    "uid": "818865",
    "code": "LANG100",
    "subject": "LANG",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "Italian for Reading Knowledge",
    "fullname": "Italian for Reading Knowledge",
    "info": "This is an online CourseShare course received from Indiana University. This course provides a concise overview of grammar as well as reading and translation practice for graduate students who wish to read Italian. The course is primarily intended to help graduate students acquire and practice the tools they need to use Italian documents in their own research.This course enables students to acquire and increase reading precision and fluency through the study of grammar and vocabulary; the discussion of various strategies for understanding texts on the basis of fragmentary structural and content-related information; and regular reading and translation of original, edited and unedited texts from different sources. The class is conducted mainly in English; listening, speaking, and writing skills are developed minimally.\n",
    "prereq": {}
  },
  {
    "uid": "816582",
    "code": "LANG1021",
    "subject": "LANG",
    "number": "1021",
    "honors": false,
    "writing": false,
    "name": "Beginning Czech I",
    "fullname": "Beginning Czech I",
    "info": "CourseShare course hosted by Indiana University. Received via video conferencing. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "820394",
    "code": "LANG1022",
    "subject": "LANG",
    "number": "1022",
    "honors": false,
    "writing": false,
    "name": "Beginning Czech II",
    "fullname": "Beginning Czech II",
    "info": "Beginning Czech II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This is an online course. It is intended for students who completed Beginning Czech I. Heritage speakers and those with prior knowledge of Czech should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "818612",
    "code": "LANG1031",
    "subject": "LANG",
    "number": "1031",
    "honors": false,
    "writing": false,
    "name": "Beginning Danish I",
    "fullname": "Beginning Danish I",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "820559",
    "code": "LANG1032",
    "subject": "LANG",
    "number": "1032",
    "honors": false,
    "writing": false,
    "name": "Beginning Danish II",
    "fullname": "Beginning Danish II",
    "info": "LANG 1032 - Beginning Danish II is a Big Ten Academic Alliance CourseShare course. The instructor is at the university of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. If is intended for students who have completed Beginning I. Heritage speakers and those with prior knowledge of Danish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "817359",
    "code": "LANG1051",
    "subject": "LANG",
    "number": "1051",
    "honors": false,
    "writing": false,
    "name": "Beginning Indonesian I",
    "fullname": "Beginning Indonesian I",
    "info": "LANG 1051 - Beginning Indonesian I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage speakers and those with prior knowledge of Indonesian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "816586",
    "code": "LANG1061",
    "subject": "LANG",
    "number": "1061",
    "honors": false,
    "writing": false,
    "name": "Beginning Persian I",
    "fullname": "Beginning Persian I",
    "info": " Beginning Persian I is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This is a hybrid course partially received via video conferencing. It is intended for beginners. Heritage speakers and those with prior knowledge of Persian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n\n",
    "prereq": {}
  },
  {
    "uid": "816799",
    "code": "LANG1062",
    "subject": "LANG",
    "number": "1062",
    "honors": false,
    "writing": false,
    "name": "Beginning Persian II",
    "fullname": "Beginning Persian II",
    "info": "Beginning Persian II is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This is a hybrid course partially received via video conferencing. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Persian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "816569",
    "code": "LANG1071",
    "subject": "LANG",
    "number": "1071",
    "honors": false,
    "writing": false,
    "name": "Beginning Polish I",
    "fullname": "Beginning Polish I",
    "info": "Beginning Polish I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for beginners. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "816845",
    "code": "LANG1072",
    "subject": "LANG",
    "number": "1072",
    "honors": false,
    "writing": false,
    "name": "Beginning Polish II",
    "fullname": "Beginning Polish II",
    "info": "Beginning Polish II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This is an online course. It is intended for students who completed Beginning Polish I. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "819447",
    "code": "LANG1073",
    "subject": "LANG",
    "number": "1073",
    "honors": false,
    "writing": false,
    "name": "Beginning Polish I",
    "fullname": "Beginning Polish I",
    "info": "CourseShare course hosted by the University of Chicago. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.\n",
    "prereq": {}
  },
  {
    "uid": "819696",
    "code": "LANG1074",
    "subject": "LANG",
    "number": "1074",
    "honors": false,
    "writing": false,
    "name": "Beginning Polish II",
    "fullname": "Beginning Polish II",
    "info": "Beginning Polish II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. If is intended for students who have completed LANG 1073. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "819689",
    "code": "LANG1075",
    "subject": "LANG",
    "number": "1075",
    "honors": false,
    "writing": false,
    "name": "Beginning Polish III",
    "fullname": "Beginning Polish III",
    "info": "Beginning Polish III  is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. If is intended for students who have completed LANG 1074. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n\n",
    "prereq": {}
  },
  {
    "uid": "820300",
    "code": "LANG1081",
    "subject": "LANG",
    "number": "1081",
    "honors": false,
    "writing": false,
    "name": "Beginning Sanskrit I",
    "fullname": "Beginning Sanskrit I",
    "info": " Beginning Sanskrit I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for beginners. Students with prior knowledge of Sanskrit should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "826921",
    "code": "LANG1082",
    "subject": "LANG",
    "number": "1082",
    "honors": false,
    "writing": false,
    "name": "Beginning Sanskrit II",
    "fullname": "Beginning Sanskrit II",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Sanskrit should contact the Language Center at elsie@umn.edu for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826920",
    "code": "LANG1083",
    "subject": "LANG",
    "number": "1083",
    "honors": false,
    "writing": false,
    "name": "Beginning Sanskrit III",
    "fullname": "Beginning Sanskrit III",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Sanskrit should contact the Language Center at elsie@umn.edu for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "817360",
    "code": "LANG1101",
    "subject": "LANG",
    "number": "1101",
    "honors": false,
    "writing": false,
    "name": "Beginning Modern Tibetan I",
    "fullname": "Beginning Modern Tibetan I",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "817600",
    "code": "LANG1102",
    "subject": "LANG",
    "number": "1102",
    "honors": false,
    "writing": false,
    "name": "Beginning Modern Tibetan II",
    "fullname": "Beginning Modern Tibetan II",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "816587",
    "code": "LANG1111",
    "subject": "LANG",
    "number": "1111",
    "honors": false,
    "writing": false,
    "name": "Beginning Turkish I",
    "fullname": "Beginning Turkish I",
    "info": "Beginning Turkish I is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage learners or students with prior experience with Turkish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "819697",
    "code": "LANG1112",
    "subject": "LANG",
    "number": "1112",
    "honors": false,
    "writing": false,
    "name": "Beginning Turkish II",
    "fullname": "Beginning Turkish II",
    "info": "Beginning Turkish II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course connects via video conferencing technology, and there is a fixed time and location. It is intended for students who completed Beginning Turkish I. Heritage speakers and those with prior knowledge of Turkish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "816588",
    "code": "LANG1121",
    "subject": "LANG",
    "number": "1121",
    "honors": false,
    "writing": false,
    "name": "Beginning Vietnamese I",
    "fullname": "Beginning Vietnamese I",
    "info": "Online CourseShare course hosted by Michigan State University. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "816772",
    "code": "LANG1122",
    "subject": "LANG",
    "number": "1122",
    "honors": false,
    "writing": false,
    "name": "Beginning Vietnamese II",
    "fullname": "Beginning Vietnamese II",
    "info": "Online CourseShare course hosted by Michigan State University. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "817920",
    "code": "LANG1131",
    "subject": "LANG",
    "number": "1131",
    "honors": false,
    "writing": false,
    "name": "Beginning Yiddish I",
    "fullname": "Beginning Yiddish I",
    "info": "LANG 1131 - Beginning Yiddish I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. Heritage learners or students with prior experience with Yiddish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820552",
    "code": "LANG1132",
    "subject": "LANG",
    "number": "1132",
    "honors": false,
    "writing": false,
    "name": "Beginning Yiddish II",
    "fullname": "Beginning Yiddish II",
    "info": "Beginning Yiddish II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. Heritage learners or students with prior experience with Yiddish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "818382",
    "code": "LANG1141",
    "subject": "LANG",
    "number": "1141",
    "honors": false,
    "writing": false,
    "name": "Beginning Yoruba I",
    "fullname": "Beginning Yoruba I",
    "info": "LANG 1141 - Beginning Yoruba I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for beginners. Heritage speakers and those with prior knowledge of Yoruba should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820521",
    "code": "LANG1142",
    "subject": "LANG",
    "number": "1142",
    "honors": false,
    "writing": false,
    "name": "Beginning Yoruba II",
    "fullname": "Beginning Yoruba II",
    "info": "LANG 1142 Beginning Yoruba II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This is an online course. It is intended for students who completed Intermediate I. Heritage speakers and those with prior knowledge of Yoruba should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "817361",
    "code": "LANG1161",
    "subject": "LANG",
    "number": "1161",
    "honors": false,
    "writing": false,
    "name": "Beginning Hungarian I",
    "fullname": "Beginning Hungarian I",
    "info": "CourseShare course hosted by Indiana University. Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "816916",
    "code": "LANG1162",
    "subject": "LANG",
    "number": "1162",
    "honors": false,
    "writing": false,
    "name": "Beginning Hungarian II",
    "fullname": "Beginning Hungarian II",
    "info": "CourseShare course hosted by Indiana University. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "816806",
    "code": "LANG1171",
    "subject": "LANG",
    "number": "1171",
    "honors": false,
    "writing": false,
    "name": "Beginning Aramaic I",
    "fullname": "Beginning Aramaic I",
    "info": "CourseShare course hosted by Penn State University. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "818850",
    "code": "LANG1181",
    "subject": "LANG",
    "number": "1181",
    "honors": false,
    "writing": false,
    "name": "Beginning Filipino I",
    "fullname": "Beginning Filipino I",
    "info": "CourseShare course hosted by Rutgers University. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.\n",
    "prereq": {}
  },
  {
    "uid": "816964",
    "code": "LANG1182",
    "subject": "LANG",
    "number": "1182",
    "honors": false,
    "writing": false,
    "name": "Beginning Filipino II",
    "fullname": "Beginning Filipino II",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "818960",
    "code": "LANG1191",
    "subject": "LANG",
    "number": "1191",
    "honors": false,
    "writing": false,
    "name": "Beginning Romanian I",
    "fullname": "Beginning Romanian I",
    "info": "CourseShare course hosted by Ohio State University. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "820236",
    "code": "LANG1201",
    "subject": "LANG",
    "number": "1201",
    "honors": false,
    "writing": false,
    "name": "Beginning Basque I",
    "fullname": "Beginning Basque I",
    "info": "LANG 1201 - Beginning Basque I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Illinois but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who have previously studied a different Romance language, such as French, Italian, or Spanish. Heritage learners or students with priority experience with Basque should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "820553",
    "code": "LANG1202",
    "subject": "LANG",
    "number": "1202",
    "honors": false,
    "writing": false,
    "name": "Beginning Basque II",
    "fullname": "Beginning Basque II",
    "info": "Beginning Basque II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Basque should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820554",
    "code": "LANG1203",
    "subject": "LANG",
    "number": "1203",
    "honors": false,
    "writing": false,
    "name": "Beginning Basque III",
    "fullname": "Beginning Basque III",
    "info": "Beginning Basque III is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who have completed the previous course. Heritage speakers and those with prior knowledge of Basque should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "818041",
    "code": "LANG1211",
    "subject": "LANG",
    "number": "1211",
    "honors": false,
    "writing": false,
    "name": "Beginning Maya I",
    "fullname": "Beginning Maya I",
    "info": "CourseShare course hosted by Indiana University. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.\n",
    "prereq": {}
  },
  {
    "uid": "819001",
    "code": "LANG1231",
    "subject": "LANG",
    "number": "1231",
    "honors": false,
    "writing": false,
    "name": "Beginning Modern Greek I",
    "fullname": "Beginning Modern Greek I",
    "info": "CourseShare course hosted by Rutgers University. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "819499",
    "code": "LANG1232",
    "subject": "LANG",
    "number": "1232",
    "honors": false,
    "writing": false,
    "name": "Beginning Modern Greek II",
    "fullname": "Beginning Modern Greek II",
    "info": "CourseShare course hosted by Rutgers University . Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "819925",
    "code": "LANG1251",
    "subject": "LANG",
    "number": "1251",
    "honors": false,
    "writing": false,
    "name": "Beginning Haitian Creole I",
    "fullname": "Beginning Haitian Creole I",
    "info": "LANG 1251 - Beginning Haitian Creole I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for beginners. Heritage speakers and those with prior knowledge of Haitian Creole should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820451",
    "code": "LANG1252",
    "subject": "LANG",
    "number": "1252",
    "honors": false,
    "writing": false,
    "name": "Beginning Haitian Creole II",
    "fullname": "Beginning Haitian Creole II",
    "info": "Beginning Haitian Creole II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for students who completed Beginning Haitian Creole I. Heritage speakers and those with prior knowledge of Haitian Creole should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820307",
    "code": "LANG1261",
    "subject": "LANG",
    "number": "1261",
    "honors": false,
    "writing": false,
    "name": "Beginning Ukrainian  I",
    "fullname": "Beginning Ukrainian  I",
    "info": "Beginning Ukrainian I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage learners or students with prior experience with Ukrainian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance. Please note the special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "820522",
    "code": "LANG1262",
    "subject": "LANG",
    "number": "1262",
    "honors": false,
    "writing": false,
    "name": "Beginning Ukrainian II",
    "fullname": "Beginning Ukrainian II",
    "info": "Beginning Ukrainian II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who have completed the previous course. Heritage learners or students with prior experience with Ukrainian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820328",
    "code": "LANG1271",
    "subject": "LANG",
    "number": "1271",
    "honors": false,
    "writing": false,
    "name": "Reading French for Research",
    "fullname": "Reading French for Research Purposes",
    "info": "Reading French for Research Purposes is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. This intensive course is designed to take students with a basic knowledge of French to the level of reading proficiency needed for research. To that end, students will work on grammar, vocabulary, and reading strategies. Students will read a range of scholarly texts, a number of which will be directly drawn from their respective areas of research. Please contact the Language Center at elsie@umn.edu or 612-626-6017with questions.",
    "prereq": {}
  },
  {
    "uid": "820395",
    "code": "LANG1272",
    "subject": "LANG",
    "number": "1272",
    "honors": false,
    "writing": false,
    "name": "French for Reading Knowledge",
    "fullname": "French for Reading Knowledge",
    "info": "French for Reading Knowledge is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It includes Intensive grammar and reading for graduate students and undergraduates with little or no experience in French. Readings from appropriate texts in the humanities, sciences, social sciences.. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions.",
    "prereq": {}
  },
  {
    "uid": "820525",
    "code": "LANG1273",
    "subject": "LANG",
    "number": "1273",
    "honors": false,
    "writing": false,
    "name": "French for Reading Knowledge",
    "fullname": "French for Reading Knowledge",
    "info": "French for Reading Knowledge is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is designed to help students with little or no previous French training learn how to read French quickly and efficiently. In addition to the textbook, using a variety of resources to practice reading French, including newspaper articles, classic French texts, and film. The course is taught synchronously as a series of reading/translation workshops during which the class works together to develop their reading skills. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions.",
    "prereq": {}
  },
  {
    "uid": "820316",
    "code": "LANG1281",
    "subject": "LANG",
    "number": "1281",
    "honors": false,
    "writing": false,
    "name": "German for Reading Knowledge",
    "fullname": "German for Reading Knowledge",
    "info": "German for Reading Knowledge is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for beginners. Heritage learners or students with prior experience with German should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825872",
    "code": "LANG1301",
    "subject": "LANG",
    "number": "1301",
    "honors": false,
    "writing": false,
    "name": "Beginning Quechua I",
    "fullname": "Beginning Quechua I",
    "info": "LANG 1301 – Beginning Quechua Is a Big Ten Academic Alliance CourseShare course. The instructor is at Ohio State University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for true beginners. Heritage speakers and those with prior knowledge of Quechua should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825248",
    "code": "LANG1311",
    "subject": "LANG",
    "number": "1311",
    "honors": false,
    "writing": false,
    "name": "Italian for Reading Knowledge",
    "fullname": "Italian for Reading Knowledge",
    "info": "LANG 1311 Italian for Reading Knowledge is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. Italian for Reading Knowledge course is an engaging and non-intimidating approach to language learning. This is an online, dynamic language immersion course, intended to progressively build your reading knowledge of Italian while teaching you about life and culture in Italian speaking countries. This course is designed to build on and expand your confidence with Italian, presenting vocabulary and phrases in meaningful and motivating content. In addition, your understanding of sentence structure and use of verbs will be reinforced. You will end this course with the ability to read and translate Italian texts. There will be weekly Zoom meeting sessions, which are not yet scheduled. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions.\n",
    "prereq": {}
  },
  {
    "uid": "825769",
    "code": "LANG1313",
    "subject": "LANG",
    "number": "1313",
    "honors": false,
    "writing": false,
    "name": "Beginning Italian II",
    "fullname": "Beginning Italian II",
    "info": "LANG 1313 - Beginning Italian II is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for students who completed the previous course in the sequence, Registration is by permission only. Please contact the Language Center at elsie@umn.edu or 612-626-6017 to request permission to join this class.",
    "prereq": {}
  },
  {
    "uid": "820452",
    "code": "LANG1321",
    "subject": "LANG",
    "number": "1321",
    "honors": false,
    "writing": false,
    "name": "Spanish for Reading Knowledge",
    "fullname": "Spanish for Reading Knowledge",
    "info": " Spanish for Reading Knowledge is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is designed for non-Spanish speakers, including those students who have studied only a modicum of Spanish in their careers. This course aims to help students to acquire reading skills in Spanish, understand texts of moderate difficulty, and acquire basic translation skills in order to translate & analyze texts, receive grammatical tools to understand how Spanish works and how to understand the meaning of Spanish-language texts, and read and analyze written work such as newspapers, magazines, critical works, and research articles. This course includes a mix of synchronous and asynchronous time. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions. ",
    "prereq": {}
  },
  {
    "uid": "820396",
    "code": "LANG1331",
    "subject": "LANG",
    "number": "1331",
    "honors": false,
    "writing": false,
    "name": "Beginning Syriac I",
    "fullname": "Beginning Syriac I",
    "info": "Beginning Syriac I is a Big Ten Academic Alliance CourseShare course. The instructor is at Penn State University, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. This course is a basic introduction to Syriac. Syriac is a dialect of the Aramaic language that began in the first century AD/CE. It is best known for its use in the Christian churches of the East. Besides early translations of the Bible, Syriac texts include religious poetry, theological and philosophical works, and lives of the Eastern saints. Syriac was also an essential link in the chain of transmission of Greek philosophy into the Middle Ages, as well as literary works from India. Registration is by permission only. Please contact the Language Center at elsie@umn.edu or 612-626-6017 to request permission to join this class.",
    "prereq": {}
  },
  {
    "uid": "826023",
    "code": "LANG1341",
    "subject": "LANG",
    "number": "1341",
    "honors": false,
    "writing": false,
    "name": "Beginning Thai I",
    "fullname": "Beginning Thai I",
    "info": "LANG 1341 - Beginning Thai I Is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage speakers and those with prior knowledge of Thai should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "826301",
    "code": "LANG1342",
    "subject": "LANG",
    "number": "1342",
    "honors": false,
    "writing": false,
    "name": "Beginning Thai II",
    "fullname": "Beginning Thai II",
    "info": "Beginning Thai II Is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who took the previous course. Heritage speakers and those with prior knowledge of Thai should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825122",
    "code": "LANG1351",
    "subject": "LANG",
    "number": "1351",
    "honors": false,
    "writing": false,
    "name": "Beg Bosnia-Croatian-Serbian I",
    "fullname": "Beginning BCS (Bosnian, Croatian, Serbian) I",
    "info": "LANG 1351 - Beginning BCS (Bosnian, Croatian, Serbian) I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage speakers and those with prior knowledge of Bosnian, Croatian and/or Serbian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "825565",
    "code": "LANG1352",
    "subject": "LANG",
    "number": "1352",
    "honors": false,
    "writing": false,
    "name": "Beginning BCS II",
    "fullname": "Beginning BCS (Bosnian, Croatian, Serbian) II",
    "info": "LANG 1352 - Beginning BCS (Bosnian, Croatian, Serbian) IIis a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Bosnian, Croatian, and/or Serbian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "827320",
    "code": "LANG1353",
    "subject": "LANG",
    "number": "1353",
    "honors": false,
    "writing": false,
    "name": "Beg Bosnia-Croatian-Serbian I",
    "fullname": "Beginning BCS (Bosnian, Croatian, Serbian) I",
    "info": "LANG 1353 - Beginning BCS (Bosnian, Croatian, Serbian) I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage speakers and those with prior knowledge of Bosnian, Croatian and/or Serbian should contact the Language Center at elsie@umn.edu for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825442",
    "code": "LANG1371",
    "subject": "LANG",
    "number": "1371",
    "honors": false,
    "writing": false,
    "name": "Beginning Kinyarwanda I",
    "fullname": "Beginning Kinyarwanda I",
    "info": "LANG 1371 - Beginning Kinyarwanda I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage speakers and those with prior knowledge of Kinyarwanda should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825566",
    "code": "LANG1372",
    "subject": "LANG",
    "number": "1372",
    "honors": false,
    "writing": false,
    "name": "Beginning Kinyarwanda II",
    "fullname": "Beginning Kinyarwanda II",
    "info": "LANG 1372 - Beginning Kinyarwanda II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Kinyarwanda should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "825830",
    "code": "LANG1381",
    "subject": "LANG",
    "number": "1381",
    "honors": false,
    "writing": false,
    "name": "Beginning Marathi I",
    "fullname": "Beginning Marathi I",
    "info": "LANG 1381 - Beginning Marathi I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for beginners. Students with prior knowledge of Marathi should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825991",
    "code": "LANG1421",
    "subject": "LANG",
    "number": "1421",
    "honors": false,
    "writing": false,
    "name": "Beginning Tamil I",
    "fullname": "Beginning Tamil I",
    "info": "LANG 1421 Beginning Tamil I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for beginners. Students with prior knowledge of Tamil should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826150",
    "code": "LANG1422",
    "subject": "LANG",
    "number": "1422",
    "honors": false,
    "writing": false,
    "name": "Beginning Tamil II",
    "fullname": "Beginning Tamil II",
    "info": "LANG 1422 - Beginning Tamil II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Tamil should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "826151",
    "code": "LANG1423",
    "subject": "LANG",
    "number": "1423",
    "honors": false,
    "writing": false,
    "name": "Beginning Tamil III",
    "fullname": "Beginning Tamil III",
    "info": "LANG 1423 - Beginning Tamil III is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Tamil should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826059",
    "code": "LANG1431",
    "subject": "LANG",
    "number": "1431",
    "honors": false,
    "writing": false,
    "name": "Beginning Armenian I",
    "fullname": "Beginning Armenian I",
    "info": "LANG 1431 - Beginning Armenian I  is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for beginners. Students with prior knowledge of Armenian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826859",
    "code": "LANG1432",
    "subject": "LANG",
    "number": "1432",
    "honors": false,
    "writing": false,
    "name": "Beginning Armenian II",
    "fullname": "Beginning Armenian II",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Armenian should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start and end dates. ",
    "prereq": {}
  },
  {
    "uid": "826857",
    "code": "LANG1433",
    "subject": "LANG",
    "number": "1433",
    "honors": false,
    "writing": false,
    "name": "Beginning Armenian III",
    "fullname": "Beginning Armenian III",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Armenian should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start and end dates. ",
    "prereq": {}
  },
  {
    "uid": "827285",
    "code": "LANG1471",
    "subject": "LANG",
    "number": "1471",
    "honors": false,
    "writing": false,
    "name": "Beginning Burmese I",
    "fullname": "Beginning Burmese I",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage learners or students with prior experience with Burmese should contact the Language Center at elsie@umn.edu for placement assistance. Please note the special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "827287",
    "code": "LANG1481",
    "subject": "LANG",
    "number": "1481",
    "honors": false,
    "writing": false,
    "name": "Beginning Akan I",
    "fullname": "Beginning Akan I",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for beginners. Heritage learners or students with prior experience with an Akan language like Twi should contact the Language Center at elsie@umn.edu for placement assistance. Please note the special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "827284",
    "code": "LANG1651",
    "subject": "LANG",
    "number": "1651",
    "honors": false,
    "writing": false,
    "name": "Islam",
    "fullname": "Islam",
    "info": "This course aims to provide students with a working knowledge of the religion and civilization of Islam. In addition to identifying the core beliefs, practices, scriptures, and sentiments that have defined Muslim communities, we will look at those issues that have formed the focal point of ongoing debate and disagreement in the history of Islamic thought. We will also visit a number of the “major” communities in their historical encounter with Islam. The course will conclude with an examination of the encounter between Islam and modernity, and Islam in the West (specifically, the U.S.). This is a CourseShare course received from Michigan State University. Please note the special start and end dates. ",
    "prereq": {}
  },
  {
    "uid": "816583",
    "code": "LANG2011",
    "subject": "LANG",
    "number": "2011",
    "honors": false,
    "writing": false,
    "name": "Accelerated Catalan I",
    "fullname": "Accelerated Catalan I",
    "info": "CourseShare course hosted by the University of Chicago. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "816807",
    "code": "LANG2012",
    "subject": "LANG",
    "number": "2012",
    "honors": false,
    "writing": false,
    "name": "Accelerated Catalan II",
    "fullname": "Accelerated Catalan II",
    "info": "CourseShare course hosted by the University of Chicago. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "816584",
    "code": "LANG2021",
    "subject": "LANG",
    "number": "2021",
    "honors": false,
    "writing": false,
    "name": "Intermediate Czech I",
    "fullname": "Intermediate Czech I",
    "info": "CourseShare course hosted by Indiana University. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "816808",
    "code": "LANG2022",
    "subject": "LANG",
    "number": "2022",
    "honors": false,
    "writing": false,
    "name": "Intermediate Czech II",
    "fullname": "Intermediate Czech II",
    "info": "CourseShare course hosted by Indiana University. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "820158",
    "code": "LANG2031",
    "subject": "LANG",
    "number": "2031",
    "honors": false,
    "writing": false,
    "name": "Intermediate Danish I",
    "fullname": "Intermediate Danish I",
    "info": " Intermediate Danish I is a Big Ten Academic Alliance CourseShare course. The instructor is at the university of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. If is intended for students who have completed Beginning II. Heritage speakers and those with prior knowledge of Danish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820555",
    "code": "LANG2032",
    "subject": "LANG",
    "number": "2032",
    "honors": false,
    "writing": false,
    "name": "Intermediate Danish II",
    "fullname": "Intermediate Danish II",
    "info": " Intermediate Danish I is a Big Ten Academic Alliance CourseShare course. The instructor is at the university of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for students who have completed the previous course. Heritage speakers and those with prior knowledge of Danish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "826627",
    "code": "LANG2051",
    "subject": "LANG",
    "number": "2051",
    "honors": false,
    "writing": false,
    "name": "Intermediate Indonesian I",
    "fullname": "Intermediate Indonesian I",
    "info": "This is a CourseShare course received from the University of Wisconsin-Madison. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Indonesian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820523",
    "code": "LANG2052",
    "subject": "LANG",
    "number": "2052",
    "honors": false,
    "writing": false,
    "name": "Intermediate Indonesian II",
    "fullname": "Intermediate Indonesian II",
    "info": "LANG 2052 Intermediate Indonesian II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This is an online course. It is intended for students who completed Intermediate I. Heritage speakers and those with prior knowledge of Indonesian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "816589",
    "code": "LANG2061",
    "subject": "LANG",
    "number": "2061",
    "honors": false,
    "writing": false,
    "name": "Intermediate Persian I",
    "fullname": "Intermediate Persian I",
    "info": "LANG 2061 - Intermediate Persian I is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the Beginning sequence. Heritage speakers and those with prior knowledge of Persian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "817601",
    "code": "LANG2062",
    "subject": "LANG",
    "number": "2062",
    "honors": false,
    "writing": false,
    "name": "Intermediate Persian II",
    "fullname": "Intermediate Persian II",
    "info": "LANG 2062 - Intermediate Persian II is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Persian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "816590",
    "code": "LANG2071",
    "subject": "LANG",
    "number": "2071",
    "honors": false,
    "writing": false,
    "name": "Intermediate Polish I",
    "fullname": "Intermediate Polish I",
    "info": " LANG 2071 - Intermediate Polish I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received remotely. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "818441",
    "code": "LANG2072",
    "subject": "LANG",
    "number": "2072",
    "honors": false,
    "writing": false,
    "name": "Intermediate Polish II",
    "fullname": "Intermediate Polish II",
    "info": "LANG 2072 - Intermediate Polish II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received remotely. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820556",
    "code": "LANG2073",
    "subject": "LANG",
    "number": "2073",
    "honors": false,
    "writing": false,
    "name": "Accel Polish Heritage Students",
    "fullname": "Accelerated Polish for Heritage Speakers",
    "info": "LANG 2073 - Accelerated Polish for Heritage Speakers is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This online course is designed for heritage speakers of Polish as well as for students with an advanced oral proficiency but little formal training in the language. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions or for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "827311",
    "code": "LANG2081",
    "subject": "LANG",
    "number": "2081",
    "honors": false,
    "writing": false,
    "name": "Intermediate Sanskrit I",
    "fullname": "Intermediate Sanskrit I",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who took the previous course. Students with prior knowledge of Sanskrit should contact the Language Center at elsie@umn.edu for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "818116",
    "code": "LANG2101",
    "subject": "LANG",
    "number": "2101",
    "honors": false,
    "writing": false,
    "name": "Intermediate Modern Tibetan I",
    "fullname": "Intermediate Modern Tibetan I",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "818497",
    "code": "LANG2102",
    "subject": "LANG",
    "number": "2102",
    "honors": false,
    "writing": false,
    "name": "Intermediate Modern Tibetan II",
    "fullname": "Intermediate Modern Tibetan II",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "819264",
    "code": "LANG2111",
    "subject": "LANG",
    "number": "2111",
    "honors": false,
    "writing": false,
    "name": "Intermediate Turkish I",
    "fullname": "Intermediate Turkish I",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.\n",
    "prereq": {}
  },
  {
    "uid": "826261",
    "code": "LANG2112",
    "subject": "LANG",
    "number": "2112",
    "honors": false,
    "writing": false,
    "name": "Intermediate Turkish II",
    "fullname": "Intermediate Turkish II",
    "info": "LANG 2112 - Intermediate Turkish II is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage learners or students with prior experience with Turkish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "817332",
    "code": "LANG2121",
    "subject": "LANG",
    "number": "2121",
    "honors": false,
    "writing": false,
    "name": "Intermediate Vietnamese I",
    "fullname": "Intermediate Vietnamese I",
    "info": "Online CourseShare course hosted by Michigan State University. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "817602",
    "code": "LANG2122",
    "subject": "LANG",
    "number": "2122",
    "honors": false,
    "writing": false,
    "name": "Intermediate Vietnamese II",
    "fullname": "Intermediate Vietnamese II",
    "info": "Online CourseShare course hosted by Michigan State University. Please email the CLA Language Center at elsie@umn.edu for more information.\n",
    "prereq": {}
  },
  {
    "uid": "825485",
    "code": "LANG2123",
    "subject": "LANG",
    "number": "2123",
    "honors": false,
    "writing": false,
    "name": "Intermediate Vietnamese",
    "fullname": "Intermediate Vietnamese",
    "info": "LANG 2123 Intermediate Vietnameseis a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for intermediate-level students, and registration is by permission only. Heritage learners or students with prior experience with Vietnamese should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825686",
    "code": "LANG2124",
    "subject": "LANG",
    "number": "2124",
    "honors": false,
    "writing": false,
    "name": "Intermediate Vietnamese II",
    "fullname": "Intermediate Vietnamese II",
    "info": "LANG 2124 Intermediate Vietnameseis II a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for intermediate-level students, and registration is by permission only. Heritage learners or students with prior experience with Vietnamese should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825216",
    "code": "LANG2131",
    "subject": "LANG",
    "number": "2131",
    "honors": false,
    "writing": false,
    "name": "Intermediate Yiddish I",
    "fullname": "Intermediate Yiddish I",
    "info": "LANG  2131 - Intermediate Yiddish I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage learners or students with prior experience with Yiddish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820308",
    "code": "LANG2133",
    "subject": "LANG",
    "number": "2133",
    "honors": false,
    "writing": false,
    "name": "Holocaust Lit in Yiddish",
    "fullname": "Holocaust Literature in Yiddish",
    "info": " Holocaust Literature in Yiddish is a Big Ten Academic Alliance CourseShare course. The instructor is at the Rutgers University but you enroll and receive credit for it at the University of Minnesota. This course is received online and has no scheduled meeting times. This class is by permission only. To enroll, you must also be registered for LANG 3751 Holocaust Literature in Translation and have a background in Yiddish. Contact the Language Center at elsie@umn.edu or 612-626-6017 to request permission to enroll.\n",
    "prereq": {}
  },
  {
    "uid": "825443",
    "code": "LANG2141",
    "subject": "LANG",
    "number": "2141",
    "honors": false,
    "writing": false,
    "name": "Intermediate Yoruba I",
    "fullname": "Intermediate Yoruba I",
    "info": "LANG 2141 Intermediate Yoruba I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received remotely. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Yoruba should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826262",
    "code": "LANG2142",
    "subject": "LANG",
    "number": "2142",
    "honors": false,
    "writing": false,
    "name": "Intermediate Yoruba II",
    "fullname": "Intermediate Yoruba II",
    "info": "LANG 2142 Intermediate Yoruba II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received remotely. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Yoruba should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826024",
    "code": "LANG2161",
    "subject": "LANG",
    "number": "2161",
    "honors": false,
    "writing": false,
    "name": "Intermediate Hungarian I",
    "fullname": "Intermediate Hungarian I",
    "info": "LANG 2161 - Intermediate Hungarian Is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Hungarian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826268",
    "code": "LANG2162",
    "subject": "LANG",
    "number": "2162",
    "honors": false,
    "writing": false,
    "name": "Intermediate Hungarian II",
    "fullname": "Intermediate Hungarian II",
    "info": "LANG 2162 - Intermediate Hungarian II Is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Hungarian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "818851",
    "code": "LANG2181",
    "subject": "LANG",
    "number": "2181",
    "honors": false,
    "writing": false,
    "name": "Intermediate Filipino I",
    "fullname": "Intermediate Filipino I",
    "info": "CourseShare course hosted by Rutgers University. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "826922",
    "code": "LANG2182",
    "subject": "LANG",
    "number": "2182",
    "honors": false,
    "writing": false,
    "name": "Intermediate Filipino II",
    "fullname": "Intermediate Filipino II",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for student who completed the previous course. Students with prior knowledge of Filipino should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start/end dates.",
    "prereq": {}
  },
  {
    "uid": "817863",
    "code": "LANG2192",
    "subject": "LANG",
    "number": "2192",
    "honors": false,
    "writing": false,
    "name": "Intermediate Romanian II",
    "fullname": "Intermediate Romanian II",
    "info": "CourseShare course hosted by Ohio State University. Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.\n",
    "prereq": {}
  },
  {
    "uid": "817932",
    "code": "LANG2201",
    "subject": "LANG",
    "number": "2201",
    "honors": false,
    "writing": false,
    "name": "Accelerated Basque I",
    "fullname": "Accelerated Basque I",
    "info": "CourseShare course hosted by the University of Illinois Urbana-Champaign. Received via video conferencing. This course requires intermediate-level proficiency in Spanish, French or another Romance language. Please email the Language Center at elsie@umn.edu for permission to register.",
    "prereq": {}
  },
  {
    "uid": "819372",
    "code": "LANG2231",
    "subject": "LANG",
    "number": "2231",
    "honors": false,
    "writing": false,
    "name": "Intermediate Modern Greek I",
    "fullname": "Intermediate Modern Greek I",
    "info": "Intermediate Modern Greek I is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for for students who have completed the beginning sequence. Heritage speakers and those with prior knowledge of Modern Greek should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "819500",
    "code": "LANG2232",
    "subject": "LANG",
    "number": "2232",
    "honors": false,
    "writing": false,
    "name": "Intermediate Modern Greek II",
    "fullname": "Intermediate Modern Greek II",
    "info": "CourseShare course hosted by Rutgers University. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "826597",
    "code": "LANG2251",
    "subject": "LANG",
    "number": "2251",
    "honors": false,
    "writing": false,
    "name": "Intermediate Haitian Creole I",
    "fullname": "Intermediate Haitian Creole I",
    "info": "Intermediate Haitian Creole I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received remotely. It is intended for students who completed Beginning Haitian Creole II. Heritage speakers and those with prior knowledge of Haitian Creole should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance. Please note special start and dates.",
    "prereq": {}
  },
  {
    "uid": "826797",
    "code": "LANG2252",
    "subject": "LANG",
    "number": "2252",
    "honors": false,
    "writing": false,
    "name": "Intermediate Haitian Creole II",
    "fullname": "Intermediate Haitian Creole II",
    "info": "Intermediate Haitian Creole II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received remotely. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Haitian Creole should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start and dates. ",
    "prereq": {}
  },
  {
    "uid": "820044",
    "code": "LANG2261",
    "subject": "LANG",
    "number": "2261",
    "honors": false,
    "writing": false,
    "name": "Intermediate Ukrainian I",
    "fullname": "Intermediate Ukrainian I",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage learners or students with prior experience with Ukrainian should contact the Language Center at elsie@umn.edu for placement assistance. Please note the special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "825217",
    "code": "LANG2331",
    "subject": "LANG",
    "number": "2331",
    "honors": false,
    "writing": false,
    "name": "Intermediate Syriac I",
    "fullname": "Intermediate Syriac I",
    "info": "LANG 2331 Intermediate Syriac I is a Big Ten Academic Alliance CourseShare course. The instructor is at Penn State University, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. This course is a continuation of Beginning Syriac. Syriac is a dialect of the Aramaic language that began in the first century AD/CE. It is best known for its use in the Christian churches of the East. Besides early translations of the Bible, Syriac texts include religious poetry, theological and philosophical works, and lives of the Eastern saints. Syriac was also an essential link in the chain of transmission of Greek philosophy into the Middle Ages, as well as literary works from India. Registration is by permission only. Please contact the Language Center at elsie@umn.edu or 612-626-6017 to request permission to join this class.\n",
    "prereq": {}
  },
  {
    "uid": "825773",
    "code": "LANG2351",
    "subject": "LANG",
    "number": "2351",
    "honors": false,
    "writing": false,
    "name": "Intermediate BCS I",
    "fullname": "Intermediate BCS (Bosnian, Croatian, Serbian) I",
    "info": "LANG 2351 - Intermediate BCS (Bosnian, Croatian, Serbian) I s a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Bosnian, Croatian, and/or Serbian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825218",
    "code": "LANG2361",
    "subject": "LANG",
    "number": "2361",
    "honors": false,
    "writing": false,
    "name": "Intermediate Biblical Hebrew I",
    "fullname": "Intermediate Biblical Hebrew I",
    "info": "LANG 2361 Intermediate Biblical Hebrew I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed a Beginning Biblical Hebrew sequence, and is being offered in place of HEBR 3101. Heritage learners or students with prior experience with Biblical Hebrew should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "825219",
    "code": "LANG2362",
    "subject": "LANG",
    "number": "2362",
    "honors": false,
    "writing": false,
    "name": "Intermediat Biblical Hebrew II",
    "fullname": "Intermediate Biblical Hebrew II",
    "info": "Intermediate Biblical Hebrew II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course, and is being offered in place of HEBR 3102. Heritage learners or students with prior experience with Biblical Hebrew should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "825495",
    "code": "LANG2381",
    "subject": "LANG",
    "number": "2381",
    "honors": false,
    "writing": false,
    "name": "Intermediate Marathi I",
    "fullname": "Intermediate Marathi I",
    "info": "LANG 2381 - Intermediate Marathi I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for students at the intermediate level. Students with prior knowledge of Marathi should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "825656",
    "code": "LANG2382",
    "subject": "LANG",
    "number": "2382",
    "honors": false,
    "writing": false,
    "name": "Intermediate Marathi II",
    "fullname": "Intermediate Marathi II",
    "info": "LANG 2382 -  Intermediate Marathi II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for students who completed the previous course Students with prior knowledge of Marathi should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825657",
    "code": "LANG2383",
    "subject": "LANG",
    "number": "2383",
    "honors": false,
    "writing": false,
    "name": "Intermediate Marathi III",
    "fullname": "Intermediate Marathi III",
    "info": "LANG 2383 -  Intermediate Marathi III is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for students who completed the previous course Students with prior knowledge of Marathi should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826711",
    "code": "LANG2421",
    "subject": "LANG",
    "number": "2421",
    "honors": false,
    "writing": false,
    "name": "Intermediate Tamil I",
    "fullname": "Intermediate Tamil I",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for student who completed the previous course. Students with prior knowledge of Tamil should contact the Language Center at elsie@umn.edu for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826881",
    "code": "LANG2422",
    "subject": "LANG",
    "number": "2422",
    "honors": false,
    "writing": false,
    "name": "Intermediate Tamil II",
    "fullname": "Intermediate Tamil II",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Tamil should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start/end dates.",
    "prereq": {}
  },
  {
    "uid": "826880",
    "code": "LANG2423",
    "subject": "LANG",
    "number": "2423",
    "honors": false,
    "writing": false,
    "name": "Intermediate Tamil III",
    "fullname": "Intermediate Tamil III",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Tamil should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start/end dates.",
    "prereq": {}
  },
  {
    "uid": "826707",
    "code": "LANG2431",
    "subject": "LANG",
    "number": "2431",
    "honors": false,
    "writing": false,
    "name": "Intermediate Armenian I",
    "fullname": "Intermediate Armenian I",
    "info": "This a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Armenian should contact the Language Center at elsie@umn.edu for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826858",
    "code": "LANG2432",
    "subject": "LANG",
    "number": "2432",
    "honors": false,
    "writing": false,
    "name": "Intermediate Armenian II",
    "fullname": "Intermediate Armenian II",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Armenian should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start and end dates. ",
    "prereq": {}
  },
  {
    "uid": "826856",
    "code": "LANG2433",
    "subject": "LANG",
    "number": "2433",
    "honors": false,
    "writing": false,
    "name": "Intermediate Armenian III",
    "fullname": "Intermediate Armenian III",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Armenian should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start and end dates. ",
    "prereq": {}
  },
  {
    "uid": "816840",
    "code": "LANG3011",
    "subject": "LANG",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "Catalan Culture and Society",
    "fullname": "Catalan Culture and Society: Art, Music, and Cinema",
    "info": "CourseShare course hosted by the University of Chicago. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "817348",
    "code": "LANG3012",
    "subject": "LANG",
    "number": "3012",
    "honors": false,
    "writing": false,
    "name": "Adv Catalan Lang, Soc, Culture",
    "fullname": "Advanced Catalan: Language, Society and Culture",
    "info": "Online CourseShare course hosted by the University of Chicago. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "819380",
    "code": "LANG3013",
    "subject": "LANG",
    "number": "3013",
    "honors": false,
    "writing": false,
    "name": "Adv Catalan Lang, Culture II",
    "fullname": "Advanced Catalan: Language, Society and Culture II",
    "info": "CourseShare course hosted by the University of Chicago. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "820237",
    "code": "LANG3014",
    "subject": "LANG",
    "number": "3014",
    "honors": false,
    "writing": false,
    "name": "Reading Catalan for Research",
    "fullname": "Reading Catalan for Research Purposes",
    "info": " Reading Catalan for Research Purposes is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota. This fast-paced online course prepares students to read and do research using texts in Catalan. Students will work on grammar, vocabulary, and reading skills, and they will also get introduced to some translation strategies. Part of the texts students will work on will be academic texts in their respective areas of research. Please contact the Language Center at elsie@umn.edu or 612-626-6017 for placement.",
    "prereq": {}
  },
  {
    "uid": "825873",
    "code": "LANG3031",
    "subject": "LANG",
    "number": "3031",
    "honors": false,
    "writing": false,
    "name": "Advanced Danish I",
    "fullname": "Advanced Danish I",
    "info": "LANG 3031 - Advanced Danish I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received via online. It is intended for students who have completed the previous course. Heritage speakers and those with prior knowledge of Danish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "816613",
    "code": "LANG3051",
    "subject": "LANG",
    "number": "3051",
    "honors": false,
    "writing": false,
    "name": "Advanced Indonesian I",
    "fullname": "Advanced Indonesian I",
    "info": "This is a CourseShare course received from the University of Wisconsin-Madison. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Indonesian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826855",
    "code": "LANG3052",
    "subject": "LANG",
    "number": "3052",
    "honors": false,
    "writing": false,
    "name": "Advanced Indonesian II",
    "fullname": "Advanced Indonesian II",
    "info": "This is a CourseShare course received from the University of Wisconsin-Madison. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Students with prior knowledge of Indonesian should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "825249",
    "code": "LANG3061",
    "subject": "LANG",
    "number": "3061",
    "honors": false,
    "writing": false,
    "name": "Advanced Persian I",
    "fullname": "Advanced Persian I",
    "info": "LANG 3061 - Advanced Persian I is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the Intermediate sequence. Heritage speakers and those with prior knowledge of Persian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825604",
    "code": "LANG3062",
    "subject": "LANG",
    "number": "3062",
    "honors": false,
    "writing": false,
    "name": "Advanced Persian II",
    "fullname": "Advanced Persian II",
    "info": "LANG 3062 - Advanced Persian II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Maryland, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Persian should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start/end dates.",
    "prereq": {}
  },
  {
    "uid": "818920",
    "code": "LANG3071",
    "subject": "LANG",
    "number": "3071",
    "honors": false,
    "writing": false,
    "name": "Advanced Polish I",
    "fullname": "Advanced Polish I",
    "info": "\nAdvanced Polish I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for students who have completed Intermediate Polish II or equivalent. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826854",
    "code": "LANG3072",
    "subject": "LANG",
    "number": "3072",
    "honors": false,
    "writing": false,
    "name": "Advanced Polish II",
    "fullname": "Advanced Polish II",
    "info": "Advanced Polish II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who have completed the previous course. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start and end dates. ",
    "prereq": {}
  },
  {
    "uid": "817502",
    "code": "LANG3111",
    "subject": "LANG",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Advanced Turkish I",
    "fullname": "Advanced Turkish I",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage learners or students with prior experience with Turkish should contact the Language Center at elsie@umn.edu for placement assistance. Please note the special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "816591",
    "code": "LANG3113",
    "subject": "LANG",
    "number": "3113",
    "honors": false,
    "writing": false,
    "name": "Advanced Turkish and Azeri I",
    "fullname": "Advanced Turkish and Azeri I",
    "info": "CourseShare course hosted by University of Wisconsin-Madison. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "818919",
    "code": "LANG3121",
    "subject": "LANG",
    "number": "3121",
    "honors": false,
    "writing": false,
    "name": "Advanced Vietnamese I",
    "fullname": "Advanced Vietnamese I",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "819672",
    "code": "LANG3122",
    "subject": "LANG",
    "number": "3122",
    "honors": false,
    "writing": false,
    "name": "Advanced Vietnamese II",
    "fullname": "Advanced Vietnamese II",
    "info": "Advanced Vietnamese II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course connects via video conferencing technology, and there is a fixed time and location. It is intended for students who completed Advanced I. Heritage speakers and those with prior knowledge of Vietnamese should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "827239",
    "code": "LANG3123",
    "subject": "LANG",
    "number": "3123",
    "honors": false,
    "writing": false,
    "name": "Advanced Vietnamese I",
    "fullname": "Advanced Vietnamese I",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at Michigan State University but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage learners or students with prior experience with Vietnamese should contact the Language Center at elsie@umn.edu for placement assistance. Please note the special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "826696",
    "code": "LANG3161",
    "subject": "LANG",
    "number": "3161",
    "honors": false,
    "writing": false,
    "name": "Advanced Hungarian I",
    "fullname": "Advanced Hungarian I",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Hungarian should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826795",
    "code": "LANG3162",
    "subject": "LANG",
    "number": "3162",
    "honors": false,
    "writing": false,
    "name": "Advanced Hungarian II",
    "fullname": "Advanced Hungarian II",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous course. Heritage speakers and those with prior knowledge of Hungarian should contact the Language Center at elsie@umn.edu for placement assistance. Please note special start/end dates. ",
    "prereq": {}
  },
  {
    "uid": "825250",
    "code": "LANG3231",
    "subject": "LANG",
    "number": "3231",
    "honors": false,
    "writing": false,
    "name": "Advanced Modern Greek I",
    "fullname": "Advanced Modern Greek I",
    "info": "LANG 3231 - Advanced Modern Greek I is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the Intermediate sequence. Heritage speakers and those with prior knowledge of Modern Greek should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820557",
    "code": "LANG3232",
    "subject": "LANG",
    "number": "3232",
    "honors": false,
    "writing": false,
    "name": "Adv Hebrew II: Israeli Music",
    "fullname": "Advanced Hebrew II: Israeli Music",
    "info": " Advanced Hebrew II: Israeli Music is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. This course is intended for students at the advanced level. Heritage learners or students with prior experience with Hebrew should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825623",
    "code": "LANG3233",
    "subject": "LANG",
    "number": "3233",
    "honors": false,
    "writing": false,
    "name": "Advanced Modern Greek II",
    "fullname": "Advanced Modern Greek II",
    "info": "LANG 3233 - Advanced Modern Greek II is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed the previous sequence. Heritage speakers and those with prior knowledge of Modern Greek should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825639",
    "code": "LANG3234",
    "subject": "LANG",
    "number": "3234",
    "honors": false,
    "writing": false,
    "name": "Adv Hebrew: Ethics, Relig, Med",
    "fullname": "Advanced Hebrew: Ethics, Religion and Medicine",
    "info": "LANG 3234 - Advanced Hebrew: Ethics, Religion and Medicine is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. This course is intended for students at the advanced level. Heritage learners or students with prior experience with Hebrew should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "825640",
    "code": "LANG3235",
    "subject": "LANG",
    "number": "3235",
    "honors": false,
    "writing": false,
    "name": "Adv Hebrew:  Popular Culture",
    "fullname": "Advanced Hebrew: Hebrew Via Popular Culture",
    "info": "LANG 3235 -  Advanced Hebrew: Hebrew Via Popular Culture is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. This course is intended for students at the advanced level. Heritage learners or students with prior experience with Hebrew should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n\n",
    "prereq": {}
  },
  {
    "uid": "826224",
    "code": "LANG3271",
    "subject": "LANG",
    "number": "3271",
    "honors": false,
    "writing": false,
    "name": "Intro to Mediev French & Hist",
    "fullname": "Intro to Medieval French & Hist of French Lang",
    "info": "LANG 3271 -  Intro to Medieval French & Hist of French Lang is a Big Ten Academic Alliance CourseShare course. The instructor is at Ohio State University but you enroll and receive credit for it at the University of Minnesota. This course is received online. Journey in time through the history of the French language. Don’t think “damsels in distress”—medieval French was full of intelligent women characters and we will read some of their stories. Don’t think dusty and irrelevant-- surveying changes in the evolution from Latin to modern forms will deepen your understanding of pronunciation (AKA phonology), grammar and word forms (morphology), how French spelling got to be so peculiar, and give you transferable translation skills. This course is intended for students who have completed at least two upper-level French courses and is by permission only. Contact the Language Center at elsie@umn.edu. \n",
    "prereq": {}
  },
  {
    "uid": "825251",
    "code": "LANG3311",
    "subject": "LANG",
    "number": "3311",
    "honors": false,
    "writing": false,
    "name": "Writing Workshop in Italian",
    "fullname": "Writing Workshop in Italian",
    "info": "LANG 3311 - Writing Workshop in Italian is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota.  This course is received online.  It is an advanced course intended for students who completed an intermediate Italian sequence, Registration is by permission only. Please contact the Language Center at elsie@umn.edu or 612-626-6017 to request permission to join this class.",
    "prereq": {}
  },
  {
    "uid": "825525",
    "code": "LANG3341",
    "subject": "LANG",
    "number": "3341",
    "honors": false,
    "writing": false,
    "name": "Advanced Thai I",
    "fullname": "Advanced Thai I",
    "info": "LANG 3341 -  Advanced Thai I is a Big Ten Academic Alliance CourseShare course. The instructor is at Michigan State University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for advanced learners. Please contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "826302",
    "code": "LANG3342",
    "subject": "LANG",
    "number": "3342",
    "honors": false,
    "writing": false,
    "name": "Intermediate Thai II",
    "fullname": "Intermediate Thai II",
    "info": "Intermediate Thai II Is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who took the previous course. Heritage speakers and those with prior knowledge of Thai should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "825831",
    "code": "LANG3381",
    "subject": "LANG",
    "number": "3381",
    "honors": false,
    "writing": false,
    "name": "Advanced Marathi I",
    "fullname": "Advanced Marathi I",
    "info": "LANG 3381 - Advanced Marathi I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Chicago but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for students who completed the previous course. Please contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825658",
    "code": "LANG3401",
    "subject": "LANG",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Regional Cultures of Brazil",
    "fullname": "Regional Cultures of Brazil",
    "info": "LANG 3401 - Regional Cultures of Brazil is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Illinois but you enroll and receive credit for it at the University of Minnesota This integrated skills language course will have students navigate Brazil from end to end, with the goal of exploring historical and cultural aspects of Brazil that aren’t always covered in the media. From myths and legends, to culinary adventures, traditional music, and more, this course will cover the five geographic regions of Brazil and touch on the Brazilian diaspora around the world. This class is intended for advanced students of Portuguese. ",
    "prereq": {}
  },
  {
    "uid": "826283",
    "code": "LANG3461",
    "subject": "LANG",
    "number": "3461",
    "honors": false,
    "writing": false,
    "name": "Moroccan Arabic",
    "fullname": "Moroccan Arabic",
    "info": "Moroccan Arabicis a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University but you enroll and receive credit for it at the University of Minnesota. This course is received online. This class aims at introducing learners to the variety of Arabic spoken in Morocco and the culture of the country. The course is organized around specific themes intended to facilitate\ncommunication when learners travel to Morocco. At least one year of instruction in standard Arabic is required. Please contact the Language Center at elsie@umn.edu with questions.",
    "prereq": {}
  },
  {
    "uid": "826814",
    "code": "LANG3462",
    "subject": "LANG",
    "number": "3462",
    "honors": false,
    "writing": false,
    "name": "Moroccan Arabic II",
    "fullname": "Moroccan Arabic II",
    "info": "Moroccan Arabic II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University but you enroll and receive credit for it at the University of Minnesota. This course is received online. The advanced level will build on the materials covered in the basic level course and provide more depth. This course is intended for students who completed the previous course. Please contact the Language Center at elsie@umn.edu with questions.",
    "prereq": {}
  },
  {
    "uid": "816618",
    "code": "LANG3501",
    "subject": "LANG",
    "number": "3501",
    "honors": false,
    "writing": false,
    "name": "Intro to Korean Civilization",
    "fullname": "Introduction to Korean Civilization",
    "info": "CourseShare course hosted by the University of Michigan Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "816800",
    "code": "LANG3502",
    "subject": "LANG",
    "number": "3502",
    "honors": false,
    "writing": false,
    "name": "Introduction to Korean History",
    "fullname": "Introduction to Korean History",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "817189",
    "code": "LANG3503",
    "subject": "LANG",
    "number": "3503",
    "honors": false,
    "writing": false,
    "name": "Traditional Korean Poetry Sijo",
    "fullname": "Traditional Korean Poetry: Sijo",
    "info": "CourseShare course hosted by Rutgers University. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "817921",
    "code": "LANG3504",
    "subject": "LANG",
    "number": "3504",
    "honors": false,
    "writing": false,
    "name": "Korean Lang, Culture, Society",
    "fullname": "Korean Language in Culture and Society",
    "info": "CourseShare course hosted by the University of Iowa. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "818498",
    "code": "LANG3505",
    "subject": "LANG",
    "number": "3505",
    "honors": false,
    "writing": false,
    "name": "Controversies in Contemp Korea",
    "fullname": "Controversies in Contemporary Korea",
    "info": "CourseShare course hosted by the University of Michigan. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information. \n",
    "prereq": {}
  },
  {
    "uid": "819926",
    "code": "LANG3506",
    "subject": "LANG",
    "number": "3506",
    "honors": false,
    "writing": false,
    "name": "Koreas: Korean War to the 21C",
    "fullname": "The Koreas: Korean War to the 21st Century",
    "info": "LANG 3506  - The Koreas: Korean War to the 21st Century is a Big Ten Academic Alliance Korean e-school CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing.  Korea has always been part and parcel of key trends and phenomena in East Asia and the world. Students who take this course will explore the transformations, the setbacks, and the dynamism that have characterized modern Korean history, with a focus on post-1945 South Korea and North Korea. By exploring society and culture, we will delve into the resilience of Korean people as they lived through a turbulent history marked by national division and the Korean War, Cold War-era development and competition, democratization, and popular memory and nostalgia. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions. \n\n",
    "prereq": {}
  },
  {
    "uid": "825123",
    "code": "LANG3507",
    "subject": "LANG",
    "number": "3507",
    "honors": false,
    "writing": false,
    "name": "Korean Lang & Contemp Culture",
    "fullname": "Korean Language and Contemporary Pop Culture",
    "info": "LANG 3507 - Korean Language and Contemporary Pop Culture is a Big Ten Academic Alliance Korean e-school CourseShare course. The instructor is at the University of Iowa, but you enroll and receive credit for it at the University of Minnesota. This course is received online. The purpose of this course is to introduce students to the various sociolinguistic phenomena in contemporary Korean society. The course will address topics such as general linguistic characteristics of Korean, Confucianism and honorifics, language changes, gender differences, generation differences and Korean contacts with Chinese, Japanese and English etc. In particular, the discussions will focus on various linguistic phenomena found in contemporary pop culture such as Korean movies, dramas, K-pops, and commercials. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions. ",
    "prereq": {}
  },
  {
    "uid": "825252",
    "code": "LANG3508",
    "subject": "LANG",
    "number": "3508",
    "honors": false,
    "writing": false,
    "name": "Seoul: Hist of Urbanism & Dev",
    "fullname": "Making Places in Seoul: History of Urbanism and Development",
    "info": "LANG 3508 - Making Places in Seoul: History of Urbanism and Development is a Big Ten Academic Alliance Korean e-school CourseShare course. The instructor is at Ohio State University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. This is an intermediary course for undergraduate and graduate students who are interested in urban cultures of South Korea. There is no prerequisite, although background knowledge about Korean  language, geography, history, and culture is highly desirable. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions.\n",
    "prereq": {}
  },
  {
    "uid": "826152",
    "code": "LANG3509",
    "subject": "LANG",
    "number": "3509",
    "honors": false,
    "writing": false,
    "name": "Korea Jeju Island Environment",
    "fullname": "Environment and Identity on Korea's Jeju Island",
    "info": "Rocks, Wind, and Women: Environment and Identity on Korea's Jeju Island is a Big Ten Academic Alliance Korean e-school CourseShare course. The instructor is at the University of Michigan, but you enroll and receive credit for it at the University of Minnesota. This course is received online. This is an intermediary course for undergraduate and graduate students. that examines the geology and biodiversity of  Korea's Jeju in conjunction with its culture, politics, and history to form an understanding of this beautiful and deceptively complicated island’s place in the modern world. There is no prerequisite. Please contact the Language Center at elsie@umn.edu or 612-626-6017 with questions.\n",
    "prereq": {}
  },
  {
    "uid": "826796",
    "code": "LANG3511",
    "subject": "LANG",
    "number": "3511",
    "honors": false,
    "writing": false,
    "name": "Everyday Life Discourse: Korea",
    "fullname": "Discourse in Everyday Life in Korea: Shaping Culture, Ideology, and Identity",
    "info": "This is a Big Ten Academic Alliance Korean e-school CourseShare course. The instructor is at Penn State University but you enroll and receive credit for it at the University of Minnesota. This course is received online. This is an introductory level course designed to familiarize students with the concepts of discourse and genre and to understand both as social practice, all with a primary focus on Korean exemplars of discourse and genre. There is no prerequisites. Please contact the Language Center at elsie@umn.edu with questions. Please note special start/end dates.",
    "prereq": {}
  },
  {
    "uid": "827078",
    "code": "LANG3512",
    "subject": "LANG",
    "number": "3512",
    "honors": false,
    "writing": false,
    "name": "Sociology of Contemp Korea",
    "fullname": "Sociology of Contemporary Korea",
    "info": "This course explores contemporary South Korean society through the lens of international migration from and to the Korean peninsular. Prior knowledge of Korea’s history, language, culture, and politics would be beneficial, but is not required. This is a CourseShare course received from the University of Michigan. Please note the special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "817555",
    "code": "LANG3601",
    "subject": "LANG",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "Sami Culture, Yesterday, Today",
    "fullname": "Sami Culture, Yesterday, and Today",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "817616",
    "code": "LANG3651",
    "subject": "LANG",
    "number": "3651",
    "honors": false,
    "writing": false,
    "name": "Islamic Studies Seminar: Rumi",
    "fullname": "Islamic Studies Seminar: Rumi, Sufi Poet",
    "info": "CourseShare course hosted by Rutgers University through the Digital Islamic Studies Curriculum (DISC). Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "818389",
    "code": "LANG3701",
    "subject": "LANG",
    "number": "3701",
    "honors": false,
    "writing": false,
    "name": "The New Scramble for Africa",
    "fullname": "The New Scramble for Africa",
    "info": "Online CourseShare course hosted by Rutgers University. Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.\n",
    "prereq": {}
  },
  {
    "uid": "820309",
    "code": "LANG3751",
    "subject": "LANG",
    "number": "3751",
    "honors": false,
    "writing": false,
    "name": "Holocaust Literature",
    "fullname": "Holocaust Literature in Translation",
    "info": "Holocaust Literature in Translation is a Big Ten Academic Alliance CourseShare course. The instructor is at the Rutgers University but you enroll and receive credit for it at the University of Minnesota. This course is received online and has no scheduled meeting times. There is a one-credit additional optional class associated with htis course, LANG 2133, which is by permission only. Contact the Language Center at elsie@umn.edu or 612-626-6017 with questions. \n",
    "prereq": {}
  },
  {
    "uid": "825489",
    "code": "LANG4071",
    "subject": "LANG",
    "number": "4071",
    "honors": false,
    "writing": false,
    "name": "Beginning Polish I",
    "fullname": "Beginning Polish I",
    "info": "LANG 4071 - Beginning Polish I is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for beginners. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n\n",
    "prereq": {}
  },
  {
    "uid": "825526",
    "code": "LANG4072",
    "subject": "LANG",
    "number": "4072",
    "honors": false,
    "writing": false,
    "name": "Beginning Polish II",
    "fullname": "Beginning Polish II",
    "info": "LANG 4072 - Beginning Polish II is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University, but you enroll and receive credit for it at the University of Minnesota. This course is received via video conferencing. It is intended for beginners. Heritage speakers and those with prior knowledge of Polish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "819523",
    "code": "LANG4111",
    "subject": "LANG",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "Beginning Turkish I",
    "fullname": "Beginning Turkish I Grad Research",
    "info": "This is a Big Ten Academic Alliance CourseShare course. The instructor is at Rutgers University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for graduate student beginners to the lanuguage. Heritage learners or students with prior experience with Turkish should contact the Language Center at elsie@umn.edu for placement assistance. Please note the special start and end dates.",
    "prereq": {}
  },
  {
    "uid": "819694",
    "code": "LANG4112",
    "subject": "LANG",
    "number": "4112",
    "honors": false,
    "writing": false,
    "name": "Beginning Turkish II",
    "fullname": "Beginning Turkish II Grad Research",
    "info": "Beginning Turkish II is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course connects via video conferencing technology, and there is a fixed time and location. It is intended for students who completed Beginning Turkish I. Heritage speakers and those with prior knowledge of Turkish should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "816951",
    "code": "LANG4171",
    "subject": "LANG",
    "number": "4171",
    "honors": false,
    "writing": false,
    "name": "Beg Aramaic I Grad Research",
    "fullname": "Beginning Aramaic I for Grad Research",
    "info": "CourseShare course hosted by Penn State University. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "825481",
    "code": "LANG5010",
    "subject": "LANG",
    "number": "5010",
    "honors": false,
    "writing": false,
    "name": "Graduate Language Study",
    "fullname": "Graduate Language Study",
    "info": "Graduate language study enrollment option for a CourseShare language course received from a Big Ten university. Enrollment is restricted to graduate students, and by permission only. Please contact the Language Center at elsie@umn.edu, 612-626-6017, with questions. ",
    "prereq": {}
  },
  {
    "uid": "819744",
    "code": "LANG5011",
    "subject": "LANG",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Topics in Catalan Study",
    "fullname": "Topics in Catalan Study: Representations of Violence",
    "info": "Topics in Catalan Study: Representations of Violence is a Big Ten Academic Alliance CourseShare course. The instructor is at Indiana University but you enroll and receive credit for it at the University of Minnesota. This course will be received via video conferencing at a scheduled time. This class is intended for advanced Catalan students and permission is required. Please contact the Language Center at elsie@umn.edu or 612-626-6017 for enrollment assistance.  ",
    "prereq": {}
  },
  {
    "uid": "816614",
    "code": "LANG5051",
    "subject": "LANG",
    "number": "5051",
    "honors": false,
    "writing": false,
    "name": "Advanced Indonesian III",
    "fullname": "Advanced Indonesian III",
    "info": "CourseShare course hosted by University of Wisconsin-Madison. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "816585",
    "code": "LANG5111",
    "subject": "LANG",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Advanced Turkish and Azeri III",
    "fullname": "Advanced Turkish and Azeri III",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "816791",
    "code": "LANG5112",
    "subject": "LANG",
    "number": "5112",
    "honors": false,
    "writing": false,
    "name": "Advanced Turkish and Azeri IV",
    "fullname": "Advanced Turkish and Azeri IV",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Email the CLA Language Center at elsie@umn.edu for more information. ",
    "prereq": {}
  },
  {
    "uid": "819391",
    "code": "LANG5121",
    "subject": "LANG",
    "number": "5121",
    "honors": false,
    "writing": false,
    "name": "Advanced Vietnamese III",
    "fullname": "Advanced Vietnamese III",
    "info": "CourseShare course hosted by the University of Wisconsin-Madison. Received via video conferencing. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "819671",
    "code": "LANG5122",
    "subject": "LANG",
    "number": "5122",
    "honors": false,
    "writing": false,
    "name": "Advanced Vietnamese IV",
    "fullname": "Advanced Vietnamese IV",
    "info": "Advanced Vietnamese IV  is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course connects via video conferencing technology, and there is a fixed time and location. It is intended for students who completed Advanced III. Heritage speakers and those with prior knowledge of Vietnamese should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "820317",
    "code": "LANG5123",
    "subject": "LANG",
    "number": "5123",
    "honors": false,
    "writing": false,
    "name": "Advanced Vietnamese V",
    "fullname": "Advanced Vietnamese V",
    "info": "Advanced Vietnamese Directed Study is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for advanced-level students by permission only. Heritage learners or students with prior experience with Vietnamese should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825059",
    "code": "LANG5124",
    "subject": "LANG",
    "number": "5124",
    "honors": false,
    "writing": false,
    "name": "Advanced Vietnamese VI",
    "fullname": "Advanced Vietnamese VI",
    "info": "LANG 5124 Advanced Vietnamese VI is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for advanced-level students by permission only. Heritage learners or students with prior experience with Vietnamese should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825496",
    "code": "LANG5125",
    "subject": "LANG",
    "number": "5125",
    "honors": false,
    "writing": false,
    "name": "Adv Vietnamese Translation I",
    "fullname": "Advanced Vietnamese Special Translation I",
    "info": "LANG 5125 - Advanced Vietnamese Special Translation Iis a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota.  This course is received online. It is intended for advanced-level students by permission only. Heritage learners or students with prior experience with Vietnamese should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "818416",
    "code": "LANG5221",
    "subject": "LANG",
    "number": "5221",
    "honors": false,
    "writing": false,
    "name": "Intro Egyptian & Hieroglyph I",
    "fullname": "Introduction to Middle Egyptian & Hieroglyphics I",
    "info": "CourseShare course hosted by Penn State University. Received via video conferencing. Although there are no prerequisites, previous education in Ancient Egyptian history and civilization is recommended. This course is offered as a basic introduction to that stage in the evolution of the Egyptian language known as \"Middle Egyptian\" (used as a vernacular c. 2300 - 1700 B.C., and as a \"literary\" dialect c. 2200 - 1350 B.C.) as revealed and written in the hieroglyphic script. Please email the Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "826271",
    "code": "LANG5230",
    "subject": "LANG",
    "number": "5230",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Hebrew",
    "fullname": "Special Topics in Hebrew Studies",
    "info": "Catalog Description: LANG 5230 -  Special Topics in Hebrew Studies is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan, but you enroll and receive credit for it at the University of Minnesota. It is an advanced online Hebrew language course with specific topics that vary by semester. It is intended for students who have completed the intermediate Hebrew sequence or have advanced-level proficiency in Hebrew. ",
    "prereq": {}
  },
  {
    "uid": "818448",
    "code": "LANG5231",
    "subject": "LANG",
    "number": "5231",
    "honors": false,
    "writing": false,
    "name": "Hebrew: Israeli Innovation",
    "fullname": "Special Topics in Hebrew Studies: Israeli Innovation and Entrepreneurship",
    "info": "LANG 5231 Hebrew: Israeli Innovation is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan, but you enroll and receive credit for it at the University of Minnesota. It is an advanced online Hebrew language course dealing with Israeli technology and entrepreneurship. It is intended for students who have completed the intermediate Hebrew sequence.\nPlease contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "819684",
    "code": "LANG5232",
    "subject": "LANG",
    "number": "5232",
    "honors": false,
    "writing": false,
    "name": "Hebrew: Gender and Identity",
    "fullname": "Special Topics in Hebrew Studies: Gender and Identity in Israeli Culture",
    "info": "Special Topics in Hebrew Studies: Gender and Identity in Israeli Culture is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Maryland but you enroll and receive credit for it at the University of Minnesota. It is a fully online course. A grade of at least [C- or S] in HEBR 3012 or instructor consent is required. Please contact the Language Center at elsie@umn.edu or 612-626-6017 for enrollment assistance.  ",
    "prereq": {}
  },
  {
    "uid": "826225",
    "code": "LANG5271",
    "subject": "LANG",
    "number": "5271",
    "honors": false,
    "writing": false,
    "name": "Intro to Medieval French",
    "fullname": "Intro to Medieval French & Hist of French Lang",
    "info": "LANG 5271 -  Intro to Medieval French & Hist of French Lang is a Big Ten Academic Alliance CourseShare course. The instructor is at Ohio State University but you enroll and receive credit for it at the University of Minnesota. This course is received online. Journey in time through the history of the French language. Don’t think “damsels in distress”—medieval French was full of intelligent women characters and we will read some of their stories. Don’t think dusty and irrelevant-- surveying changes in the evolution from Latin to modern forms will deepen your understanding of pronunciation (AKA phonology), grammar and word forms (morphology), how French spelling got to be so peculiar, and give you transferable translation skills. This course is intended for students who have completed at least two upper-level French courses and is by permission only. Contact the Language Center at elsie@umn.edu. ",
    "prereq": {}
  },
  {
    "uid": "826884",
    "code": "LANG5272",
    "subject": "LANG",
    "number": "5272",
    "honors": false,
    "writing": false,
    "name": "Occitan & Occitania",
    "fullname": "Occitan & Occitania",
    "info": "Discover the region of Occitania in the south of France, where for centuries people spoke and wrote Occitan AKA Provençal or “langue d’oc.” This romance language at the crossroads of French, Italian, Catalan, and Spanish has been suppressed for centuries, yet remnants still survive and groups are fighting to preserve it. This course is taught  in French and is recommended for those interested in translation, the broader culture and history of France, medieval studies, or romance languages. It requires graduate status OR the equivalent or two 3000-level French courses OR permission of instructor (students with proficiency in any Romance language will be welcome).\nThis is a CourseShare course received from Ohio State University. The instructor is at Ohio State University, but you enroll and receive credit for it at the University of Minnesota. This course is received online. Please note special start/end dates. Please email elsie@umn.edu to request a permission number.",
    "prereq": {}
  },
  {
    "uid": "825947",
    "code": "LANG5341",
    "subject": "LANG",
    "number": "5341",
    "honors": false,
    "writing": false,
    "name": "Advanced Thai III",
    "fullname": "Advanced Thai III",
    "info": "LANG 5341 - Advanced Thai III is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Wisconsin-Madison, but you enroll and receive credit for it at the University of Minnesota. This course is received via online. It is intended for students who have completed the previous course. Heritage speakers and those with prior knowledge of Thai should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.",
    "prereq": {}
  },
  {
    "uid": "825259",
    "code": "LANG5361",
    "subject": "LANG",
    "number": "5361",
    "honors": false,
    "writing": false,
    "name": "Intermediate Biblical Hebrew I",
    "fullname": "Intermediate Biblical Hebrew Grad I",
    "info": "LANG 5361 Intermediate Biblical Hebrew Grad I is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Michigan but you enroll and receive credit for it at the University of Minnesota. This course is received online. It is intended for students who completed a Beginning Biblical Hebrew sequence, and is being offered in place of HEBR 4104. Heritage learners or students with prior experience with Biblical Hebrew should contact the Language Center at elsie@umn.edu or 612-626-6017 for placement assistance.\n",
    "prereq": {}
  },
  {
    "uid": "825652",
    "code": "LANG5401",
    "subject": "LANG",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Regional Cultures of Brazil",
    "fullname": "Regional Cultures of Brazil Graduate",
    "info": "LANG 5401 - Regional Cultures of Brazil is a Big Ten Academic Alliance CourseShare course. The instructor is at the University of Illinois but you enroll and receive credit for it at the University of Minnesota This integrated skills language course will have students navigate Brazil from end to end, with the goal of exploring historical and cultural aspects of Brazil that aren’t always covered in the media. From myths and legends, to culinary adventures, traditional music, and more, this course will cover the five geographic regions of Brazil and touch on the Brazilian diaspora around the world. This class is intended for graduate students who are advanced students of Portuguese. \n",
    "prereq": {}
  },
  {
    "uid": "825687",
    "code": "LANG5411",
    "subject": "LANG",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Introduction to Akkadian",
    "fullname": "Introduction to Akkadian",
    "info": "Introduction to Akkadian is a Big Ten Academic Alliance CourseShare course. The instructor is at Penn State University but you enroll and receive credit for it at the University of Minnesota. This course is received online. This course aims at familiarizing students with the basics of Akkadian grammar and enabling them to read a variety of genres. Students will be introduced to the grammar of Old Babylonian as well as to the basics of cuneiform writing. Please contact the Language Center at elsie@umn.edu with questions. \n",
    "prereq": {}
  },
  {
    "uid": "826218",
    "code": "LANG5451",
    "subject": "LANG",
    "number": "5451",
    "honors": false,
    "writing": false,
    "name": "Introduction to Sumerian",
    "fullname": "Introduction to Sumerian",
    "info": "LANG 5451: Introduction to Sumerian is a Big Ten Academic Alliance CourseShare course. The instructor is at Penn State University but you enroll and receive credit for it at the University of Minnesota. This course is received online. This course aims at familiarizing students with the basics of Sumerian grammar and enabling them to read royal inscriptions from the Early Dynastic and Ur III periods (third\nmillennium B.C.E.), as well as providing them with a preliminary introduction to various literary and non-literary texts. It is recommended for students who have previously studied a classical language. Please contact the Language Center at elsie@umn.edu with questions.",
    "prereq": {}
  },
  {
    "uid": "827316",
    "code": "LANG5501",
    "subject": "LANG",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "South Korean History & Society",
    "fullname": "South Korean History & Society",
    "info": "This graduate seminar offers an introduction to South Korean history and society, beginning with the liberation and division of the country in 1945 and working through to the late twentieth and early twenty-first centuries. This is a CourseShare course received from Indiana University. Please note the special start and end dates. ",
    "prereq": {}
  },
  {
    "uid": "817617",
    "code": "LANG5651",
    "subject": "LANG",
    "number": "5651",
    "honors": false,
    "writing": false,
    "name": "Islamic Studies Seminar: Rumi",
    "fullname": "Islamic Studies Seminar: Rumi, Sufi Poet",
    "info": "CourseShare course hosted by Rutgers University through the Digital Islamic Studies Curriculum (DISC). Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.",
    "prereq": {}
  },
  {
    "uid": "818613",
    "code": "LANG5702",
    "subject": "LANG",
    "number": "5702",
    "honors": false,
    "writing": false,
    "name": "Development of African Studies",
    "fullname": "Development of African Studies",
    "info": "CourseShare course hosted by the University of Iliinois. Received via video conferencing. Please email the CLA Language Center at elsie@umn.edu for more information.\n",
    "prereq": {}
  }
]