[
  {
    "uid": "827292",
    "code": "LGTT3993",
    "subject": "LGTT",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Teaching with Tech",
    "fullname": "Directed Teaching with Technology",
    "info": "LGTT 3993 Directed Teaching with Technology, a variable credit directed study course (1-3 credits) taught by current Language Center instructors in tandem with a departmental language instructor and in collaboration with technologists and coordinators. The faculty for your course will provide you with an individualized contract and a syllabus for the term. This syllabus will outline your expectations for the class. This agreement must be approved by the Language Center Director. The number of credits awarded by the directed study will range from 1-3 depending on the number of contact hours per week between the instructor and student (i.e. meeting for 50 minutes per week for 1 credit, 100 minutes for 2 credits, 150 minutes for 3 credits). Contact hours may be in person or remote. The minimum expectation of your effort is 42 hours per credit. In order to enroll in the directed study, you will be required to fill out and use the campus-wide directed research/studies contract. \n\nThis course provides mentorship opportunities for undergraduate students in a highly contextualized experiential learning context and will increase students’ opportunities for success, retention, and skills development.\n\nThe contract will vary based on the language class format, number of credits, and your personal goals, but the course will include the following:\n\nCurated educational materials on language pedagogy and teaching with technology; documentation on the specific technology required for the class; structured, targeted training sessions; mentorship through the development of a capstone project or teaching portfolio; and opportunities for engagement with other learners and professionals in training.\n\nAt the end of the semester, you will submit a capstone project or teaching portfolio. The course grade will be based on participation and the quality of the project or portfolio, with rating criteria outlined in the individual contract.  ",
    "prereq": {}
  },
  {
    "uid": "010822",
    "code": "LGTT5101",
    "subject": "LGTT",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Technology & Language Teaching",
    "fullname": "Applications of Technology in Language Teaching",
    "info": "Explore uses of technology in language teaching;  theoretical background, demonstrations, and applications.",
    "prereq": {}
  },
  {
    "uid": "017026",
    "code": "LGTT5110",
    "subject": "LGTT",
    "number": "5110",
    "honors": false,
    "writing": false,
    "name": "Tech & Second Lang Classroom",
    "fullname": "Technology in the Second Language Classroom",
    "info": "Examine, evaluate, and use technology in language teaching. Theoretical background, demonstration, hands-on exploration.",
    "prereq": {}
  },
  {
    "uid": "818897",
    "code": "LGTT5111",
    "subject": "LGTT",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "The Web for Language Learning",
    "fullname": "Using the Web for Communicative Language Learning",
    "info": "This is a fully online course that is intended for K­16 second language instructors who are looking for ways to increase their knowledge of web applications and ways to incorporate them into their second language curriculum to encourage student communication and collaboration. Participants can expect to learn effective ways to incorporate current web technology into their curriculum to promote written and spoken language comprehension and production, and interpersonal communication. The course will address lesson planning, implementation, and assessment issues related to using these tools in second language learning.",
    "prereq": {}
  },
  {
    "uid": "016656",
    "code": "LGTT5611",
    "subject": "LGTT",
    "number": "5611",
    "honors": false,
    "writing": false,
    "name": "Tech in Sec Lang Instruction",
    "fullname": "Technology in Second Language Instruction",
    "info": "Using audio, video, and computer technology in second language teaching/learning in classroom, independent study, and distance education environments.",
    "prereq": {}
  },
  {
    "uid": "789462",
    "code": "LGTT5710",
    "subject": "LGTT",
    "number": "5710",
    "honors": false,
    "writing": false,
    "name": "Topics: Language Teach & Tech",
    "fullname": "Special Topics in Language Teaching and Technology",
    "info": "Examine, evaluate, apply specific area of technology to K-higher education, second/foreign language teaching/learning in classroom, independent study, distance education environments.",
    "prereq": {}
  },
  {
    "uid": "798394",
    "code": "LGTT5738",
    "subject": "LGTT",
    "number": "5738",
    "honors": false,
    "writing": false,
    "name": "Web-based Language Instruction",
    "fullname": "Web-based Second Language Instruction: Issues, Models, and Designs",
    "info": "Issues, models, and designs related to Web-based second language instruction in K-Higher Education settings.   Evaluating course Web sites. Pedagogical value of Web technology. Applying technology in creating course Web sites.",
    "prereq": {}
  },
  {
    "uid": "826601",
    "code": "LGTT5993",
    "subject": "LGTT",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Individual reading/study, with guidance of a faculty member, on topics not covered in regular courses.\nPrerequisite-instructor consent, department consent.",
    "prereq": {}
  },
  {
    "uid": "825707",
    "code": "LGTT8999",
    "subject": "LGTT",
    "number": "8999",
    "honors": false,
    "writing": false,
    "name": "Advanced Teaching Methods",
    "fullname": "Advanced Teaching Methods: Integrating Language and Disciplinary Content",
    "info": "This course explores theoretical and practical approaches to cultivating students' advanced literacies in a second language through the integration of language proficiency development and the study of disciplinary content in upper-level literature, linguistics, and culture courses.\n\nStudents must have passed FRIT 5999 or GSD 5103 or SPPT 5999 or have permission from the instructor in order to take this course.",
    "prereq": {}
  }
]