[
  {
    "uid": "819790",
    "code": "MABA6121",
    "subject": "MABA",
    "number": "6121",
    "honors": false,
    "writing": false,
    "name": "Practical Stats for Bus Apps",
    "fullname": "Practical Statistics for Business Applications",
    "info": "Concepts/principles of business statistics, data analysis, and presentation of results. Topics include exploratory data analysis, basic inferential procedures, statistical process control, time series/regression analysis, and analysis of variance. These methods are selected for their relevance to managerial decision making and problem-solving.\n",
    "prereq": {}
  },
  {
    "uid": "825688",
    "code": "MABA6131",
    "subject": "MABA",
    "number": "6131",
    "honors": false,
    "writing": false,
    "name": "Math ESNTLS for Bus Analytics",
    "fullname": "Mathematics Essentials for Business Analytics",
    "info": "Fundamentals of decision analysis, optimization, linear and integer programming, risk analysis, heuristics, simulation, decision technologies.",
    "prereq": {}
  },
  {
    "uid": "819784",
    "code": "MABA6141",
    "subject": "MABA",
    "number": "6141",
    "honors": false,
    "writing": false,
    "name": "Ethics, Data Priv, and Gov",
    "fullname": "Ethics, Data Privacy, and Governance",
    "info": "Introduction to the legal, policy, and ethical implications of data, including privacy, surveillance, security, classification, discrimination, etc. Examines legal, policy, ethical, and governance issues throughout the full data-science life cycle - collection, storage, processing, analysis, and use.\n",
    "prereq": {}
  },
  {
    "uid": "819785",
    "code": "MABA6251",
    "subject": "MABA",
    "number": "6251",
    "honors": false,
    "writing": false,
    "name": "AI for Comp Advantage",
    "fullname": "AI for Competitive Advantage",
    "info": "Case-, technical-, and discussion-based introduction to strategic use of artificial intelligence for firm strategy. Topics include: business value, impact, benefits, and limitations. Course is equally divided by cases, discussion, lecture, and technical demonstration.",
    "prereq": {}
  },
  {
    "uid": "819791",
    "code": "MABA6311",
    "subject": "MABA",
    "number": "6311",
    "honors": false,
    "writing": false,
    "name": "Prog for Bus Analytics",
    "fullname": "Programming for Business Analytics",
    "info": "Introduction to Python with a focus on steps of using data for decision making; topics include: data acquisition, parsing, handling missing data, summarization, augmenting, transformation, subsetting, sampling, aggregation, and merging. \n\nprereq: Programming experience\n",
    "prereq": {}
  },
  {
    "uid": "819792",
    "code": "MABA6321",
    "subject": "MABA",
    "number": "6321",
    "honors": false,
    "writing": false,
    "name": "Data Management and Big Data",
    "fullname": "Data Management and Big Data",
    "info": "Fundamentals of database modeling and design; extract, transform, and load; data pre-processing, quality, integration, and stewardship issues; advances in database and storage technologies for unstructured and big data.\n",
    "prereq": {}
  },
  {
    "uid": "819793",
    "code": "MABA6341",
    "subject": "MABA",
    "number": "6341",
    "honors": false,
    "writing": false,
    "name": "Data Visualization",
    "fullname": "Data Visualization",
    "info": "The use of visualization for exploring (and communicating with) data: discover patterns, answer questions, convey findings, drive decisions, and provide persuasive evidence.   The students will have practical, hands-on experience with interactive data visualization using modern, state-of-the-art software on real-world datasets.",
    "prereq": {}
  },
  {
    "uid": "819794",
    "code": "MABA6411",
    "subject": "MABA",
    "number": "6411",
    "honors": false,
    "writing": false,
    "name": "Exploratory Data Analytics",
    "fullname": "Exploratory Data Analytics",
    "info": "Fundamentals of data exploration; detecting relationships and patterns in data; cluster analysis, hierarchical and partition-based clustering techniques; rule induction from data.",
    "prereq": {}
  },
  {
    "uid": "819795",
    "code": "MABA6421",
    "subject": "MABA",
    "number": "6421",
    "honors": false,
    "writing": false,
    "name": "Predictive Analytics",
    "fullname": "Predictive Analytics",
    "info": "Fundamentals of predictive modeling and data mining; assessing performance of predictive models; machine learning and statistical classification and prediction; logistic regression; decision trees, random forests; k- nearest neighbor techniques, naïve Bayesian classifiers, neural networks.\n",
    "prereq": {}
  },
  {
    "uid": "819796",
    "code": "MABA6431",
    "subject": "MABA",
    "number": "6431",
    "honors": false,
    "writing": false,
    "name": "Adv Topics on Bus Analytics",
    "fullname": "Advanced Topics on Business Analytics",
    "info": "Analysis of time series data; understanding its components including trend, seasonality, autocorrelation, and stationarity; model interpretation and forecasting; traditional statistical and modern machine-learning views of temporal dependency; combining time series analysis with other business analytical tools to discover hidden knowledge and gain competitive advantages ahead of time.",
    "prereq": {}
  },
  {
    "uid": "819797",
    "code": "MABA6441",
    "subject": "MABA",
    "number": "6441",
    "honors": false,
    "writing": false,
    "name": "Causal Inference, Econ and Exp",
    "fullname": "Causal Inference via Econometrics and Experimentation",
    "info": "Controlled experiments in business settings, experiment design, A/B testing; specialized statistical methodologies; fundamentals of econometrics, instrumental variable regression, propensity score matching.",
    "prereq": {}
  },
  {
    "uid": "819798",
    "code": "MABA6451",
    "subject": "MABA",
    "number": "6451",
    "honors": false,
    "writing": false,
    "name": "Prescriptive Analytics",
    "fullname": "Prescriptive Analytics",
    "info": "Fundamentals of decision analysis, optimization, linear and integer programming, risk analysis, heuristics, simulation, decision technologies.",
    "prereq": {}
  },
  {
    "uid": "825191",
    "code": "MABA6490",
    "subject": "MABA",
    "number": "6490",
    "honors": false,
    "writing": false,
    "name": "Topics in Applied BA",
    "fullname": "Special Topics in Applied Business Analytics",
    "info": "Discussion and analysis of topics and developments in applied business analytics.",
    "prereq": {}
  },
  {
    "uid": "819786",
    "code": "MABA6511",
    "subject": "MABA",
    "number": "6511",
    "honors": false,
    "writing": false,
    "name": "Experiential Learning",
    "fullname": "Experiential Learning",
    "info": "Hands-on, integrative application of analytics methodologies, techniques, and tools learned throughout the program in the context of a specific analytics problem. Introduction to agile project management. Experience with the entire data analytics cycle, starting from business and data understanding as well as data cleaning and integration and ending with the development and presentation of results, interpretations, insights, and recommendations.",
    "prereq": {}
  }
]