[
  {
    "uid": "811151",
    "code": "MADR1002",
    "subject": "MADR",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Beginning Spanish",
    "fullname": "Beginning Spanish",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811357",
    "code": "MADR1003",
    "subject": "MADR",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "Intermediate Spanish III",
    "fullname": "Intermediate Spanish III",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811334",
    "code": "MADR1004",
    "subject": "MADR",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Intermediate Spanish IV",
    "fullname": "Intermediate Spanish IV",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "819276",
    "code": "MADR1401",
    "subject": "MADR",
    "number": "1401",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": {}
  },
  {
    "uid": "819277",
    "code": "MADR1402",
    "subject": "MADR",
    "number": "1402",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": {}
  },
  {
    "uid": "819278",
    "code": "MADR1403",
    "subject": "MADR",
    "number": "1403",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.\n",
    "prereq": {}
  },
  {
    "uid": "819279",
    "code": "MADR1404",
    "subject": "MADR",
    "number": "1404",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.\n",
    "prereq": {}
  },
  {
    "uid": "819280",
    "code": "MADR1405",
    "subject": "MADR",
    "number": "1405",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.\n",
    "prereq": {}
  },
  {
    "uid": "811335",
    "code": "MADR3001",
    "subject": "MADR",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Financial Management",
    "fullname": "Financial Management",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811336",
    "code": "MADR3002",
    "subject": "MADR",
    "number": "3002",
    "honors": false,
    "writing": false,
    "name": "Ecology of Spain",
    "fullname": "Ecology of Spain",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811337",
    "code": "MADR3003",
    "subject": "MADR",
    "number": "3003",
    "honors": false,
    "writing": false,
    "name": "Philosophy of Religion",
    "fullname": "Philosophy of Religion",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811338",
    "code": "MADR3004",
    "subject": "MADR",
    "number": "3004",
    "honors": false,
    "writing": false,
    "name": "Mgmt & Organizational Behavior",
    "fullname": "Management and Organizational Behavior",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811339",
    "code": "MADR3005",
    "subject": "MADR",
    "number": "3005",
    "honors": false,
    "writing": false,
    "name": "Mgmt/Ethics in Cross-Cult Cont",
    "fullname": "Management and Ethics in a Cross-Cultural Context",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811340",
    "code": "MADR3006",
    "subject": "MADR",
    "number": "3006",
    "honors": false,
    "writing": false,
    "name": "World Religions",
    "fullname": "World Religions",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811341",
    "code": "MADR3007",
    "subject": "MADR",
    "number": "3007",
    "honors": false,
    "writing": false,
    "name": "Contemporary Moral Problems",
    "fullname": "Contemporary Moral Problems: Ethics",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811342",
    "code": "MADR3008",
    "subject": "MADR",
    "number": "3008",
    "honors": false,
    "writing": false,
    "name": "Fundamentals of Marketing",
    "fullname": "Fundamentals of Marketing",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811343",
    "code": "MADR3009",
    "subject": "MADR",
    "number": "3009",
    "honors": false,
    "writing": false,
    "name": "Political Hist Comptemp Spain",
    "fullname": "Political History of Contemporary Spain",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811345",
    "code": "MADR3011",
    "subject": "MADR",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "International Media",
    "fullname": "International Media",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "811346",
    "code": "MADR3012",
    "subject": "MADR",
    "number": "3012",
    "honors": false,
    "writing": false,
    "name": "Internships in Spain",
    "fullname": "Internships in Spain",
    "info": "Study abroad course.",
    "prereq": {}
  },
  {
    "uid": "812405",
    "code": "MADR3013",
    "subject": "MADR",
    "number": "3013",
    "honors": false,
    "writing": false,
    "name": "Spanish Civilization",
    "fullname": "Spanish Civilization",
    "info": "This course aims to offer a general view of Spanish culture and society through readings, lectures, and cultural activities. This semester will focus on a few topics portraying the transformations experienced in the country during the last years: the political system, social and economic problems, multi-ethnic society, new role of women, new family models, and present image of Spain. We will combine lectures, PowerPoint presentations, videos, discussions of required readings, and group debates. Being in Spain gives you a great opportunity to widen your approach to culture through language, and one of the aims of this class is to help you achieve this goal. All students are expected to come to all sessions prepared, with all indicated assignments completed beforehand.",
    "prereq": {}
  },
  {
    "uid": "812745",
    "code": "MADR3014",
    "subject": "MADR",
    "number": "3014",
    "honors": false,
    "writing": false,
    "name": "Corporate Soc Responsibility",
    "fullname": "Corporate Social Responsibility",
    "info": "Study abroad course",
    "prereq": {}
  },
  {
    "uid": "813519",
    "code": "MADR3015",
    "subject": "MADR",
    "number": "3015",
    "honors": false,
    "writing": false,
    "name": "Modern Masters",
    "fullname": "Modern Masters: Goya, Picasso, Miro and Dali",
    "info": "study abroad course",
    "prereq": {}
  },
  {
    "uid": "813520",
    "code": "MADR3016",
    "subject": "MADR",
    "number": "3016",
    "honors": false,
    "writing": false,
    "name": "Topics in Intl Marketing",
    "fullname": "Topics in International Marketing",
    "info": "Study abroad course",
    "prereq": {}
  },
  {
    "uid": "813521",
    "code": "MADR3017",
    "subject": "MADR",
    "number": "3017",
    "honors": false,
    "writing": false,
    "name": "Spanish Conversation",
    "fullname": "Spanish Conversation",
    "info": "Study abroad course",
    "prereq": {}
  },
  {
    "uid": "814236",
    "code": "MADR3018",
    "subject": "MADR",
    "number": "3018",
    "honors": false,
    "writing": false,
    "name": "Intro to Biological Psychology",
    "fullname": "Introduction to Biological Psychology",
    "info": "The course is equivalent to PSY 3061. It begins with brief overviews of the structure of the central nervous system, basic principles of nervous conduction and synaptic transmission, neurotransmitter systems, and basic techniques used in biological psychology research. We will then review current knowledge on the biological substrates of a range of\nbehaviors and mental processes, including perception, memory, emotion, and sleep. The course will also examine the biological basis of a variety of neuropsychological disorders and forms of mental illness, including addiction, depression, and anxiety. Finally, the course will take advantage of its location in Madrid to understand biological psychology within a\nSpanish cultural and scientific context.",
    "prereq": {}
  },
  {
    "uid": "817465",
    "code": "MADR3019",
    "subject": "MADR",
    "number": "3019",
    "honors": false,
    "writing": false,
    "name": "Culture, Globalization & Media",
    "fullname": "Culture, Globalization & Media",
    "info": "The aim of this course is to introduce the notion of \"culture\" as the set of mental, socially mediated constructs employed by individuals and groups to interpret reality. From that basis, this course examines the set of conflicts currently underway both within Western societies—as seen, for instance, in the \"Culture Wars\" as well as in the latest US presidential election—as well as the tensions between the Western and non-Western cultures—such as those of India, China, and the Arab worlds—with an emphasis in the role played by the media and the cultural industries.",
    "prereq": {}
  },
  {
    "uid": "811344",
    "code": "MADR3021",
    "subject": "MADR",
    "number": "3021",
    "honors": false,
    "writing": false,
    "name": "Art at the Prado Museum",
    "fullname": "Art at the Prado Museum",
    "info": "The aim of this course is to make students familiar with the most relevant and internationally outstanding Spanish and European artists within the Prado Museum Permanent Collections. The course will help students to fully understand and assimilate art history fundamental concepts and movements such as Renaissance, Baroque, and Neoclassicism, with a specific concentration on Spanish masters such as El Greco, Velázquez, and Goya. Simultaneously, it will help students confront Spain\u0092s and Europe most controversial history: from the dark Medieval Ages to the beginning of the 19th Century. Two observations will be fundamental to our investigations. \n\nThe first is that art history involves the study not simply of formal concepts. A work of art has a physical presence that is offered by the artist but his/her ideas, convictions, and claims are shaped in large measure by specific social circumstances. The relevance of the latter are those that turn an artwork into a masterpiece. Thus, techniques and styles of representation are just the beginning of art history research. \n\nThe second observation has to do with the relationship between art and culture: Art does not simply (or passively) reflect a given culture, but rather actively participates in its formation and development. A work of art, then, is the deepest expression of a social, religious, political, as well as intellectual context. Thus, thorough the artworks\u0092 analysis, students will develop critical and intellectual thinking by the means of observation, research, and interpretation.\n",
    "prereq": {}
  },
  {
    "uid": "818009",
    "code": "MADR3022",
    "subject": "MADR",
    "number": "3022",
    "honors": false,
    "writing": false,
    "name": "Spanish Civilization - ENG",
    "fullname": "Spanish Civilization - ENG",
    "info": "This course aims to offer a general view of Spanish culture and society through readings, lectures and cultural activities. This semester we will focus on a few topics portraying the transformations experienced in the country during the last years: the political system, the social and economic problems, the multi-ethnic society, the new role of women, the new family models and the present image of Spain. \n\nWe will combine lectures, power point presentations, videos, discussions of required readings, group debates. Being in Spain gives the student a great opportunity to widen his/her approach to culture through language and one of the aims of this class is to help them to achieve this goal.\n\nAll students are expected to come to all sessions prepared for them. All indicated assignments are to be completed beforehand.\n",
    "prereq": {}
  },
  {
    "uid": "818758",
    "code": "MADR3023",
    "subject": "MADR",
    "number": "3023",
    "honors": false,
    "writing": false,
    "name": "Human Neuroanatomy",
    "fullname": "Human Neuroanatomy",
    "info": "This course provides a broad introduction to the nervous system with an emphasis on the human nervous system. It will introduce the structure and function of neurons, the main anatomical units of the nervous system, and the main functional systems. We will approach functional systems through an understanding of the anatomical circuitry. We will study the fundamental concepts of neural communication early in the course and re-examine them later in the course relative to specific functional systems. Although the major focus will be the normal nervous system, we will introduce common diseases for each main topic. Students will gain an understanding of the nature of many common neurological diseases, which will provide further insight into how the normal nervous system functions. Through the assigned readings, lectures, and exercises, students are expected to gain an understanding of the neural circuitry and information processing responsible for the diverse range of human behaviors.",
    "prereq": {}
  },
  {
    "uid": "819549",
    "code": "MADR3024",
    "subject": "MADR",
    "number": "3024",
    "honors": false,
    "writing": false,
    "name": "Spanish for the Workplace",
    "fullname": "Spanish for the Workplace",
    "info": "This course is designed and customized for students during their academic stay abroad in the city of Madrid. The course is specifically designed to improve students’ oral and written business communication skills through language immersion and study of the local cultural and work environment. In addition to academic study, the course will provide an overview of Spanish social culture as it applies to the professional workplace, focusing on specific fields of expertise that are of interest to the students.\n",
    "prereq": {}
  },
  {
    "uid": "819550",
    "code": "MADR3025",
    "subject": "MADR",
    "number": "3025",
    "honors": false,
    "writing": false,
    "name": "Goya, Picasso, Dalí & Miró",
    "fullname": "Modern Masters: Goya, Picasso, Dalí & Miró",
    "info": "The aim of this course is to make students familiar with the most relevant and internationally outstanding Spanish Modern artists:  Goya, Picasso, Dalí & Miró. With a specific concentration on these Spanish masters, the course will bring students to fully understand and assimilate such fundamental concepts and movements of art history as Impressionism, Cubism, Surrealism, Abstraction, and Minimalism. Simultaneously, it will explore one of the most controversial periods of Spanish and European history, from the 19th through the dawn of the 20th Century. Two observations will be fundamental to our investigations.  \n\nThe first is that art history involves the study of more than simply formal concepts. A work of art has a physical presence that is offered by the artist, but his/her ideas, convictions, and claims are shaped in large measure by specific social circumstances. The relevance of the latter are those that turn an artwork into a masterpiece. Thus, techniques and styles of representation are just the beginning of art history research.\n\nThe second observation has to do with the relationship between art and culture. Art does not simply (or passively) reflect a given culture, but rather actively participates in its formation and development. A work of art, then, is the deepest expression of a social, religious, political, and  intellectual context. Thus, through the analysis of works of art, students will develop critical and intellectual thinking by the means of observation, research, and interpretation.",
    "prereq": {}
  },
  {
    "uid": "819551",
    "code": "MADR3026",
    "subject": "MADR",
    "number": "3026",
    "honors": false,
    "writing": false,
    "name": "Made in Spain: Design and Qual",
    "fullname": "100% Made in Spain: Design and Quality",
    "info": "This course focuses on the aesthetic and cultural changes in consumers and the ability of the Made in Spain managers to fine tune their marketing, communications, branding, and retailing efforts to an increasingly fast-paced environment. The course provides students with an extensive preparation on what are the most important asset of Made in Spain products: their ability to represent a paradigm shift. The course explores the evolutionary phenomena of the four F's (fashion and footwear, food and wines, furniture and building materials, and fabricated metal products and machinery) as well as design, renewable energy, railway construction, e-commerce, and other industrial sectors. The course will lead students to understand the evolutionary strategic Made in Spain management and philosophy.\n\nThe Spain Brand has appreciably revalued in the last four years (Repsol, Telefónica, Acciona, Endesa), thanks above all to the presence of Spanish products throughout the world and in all areas of activity, of which we lead in at least a dozen.\n\nThe internationalization accomplished by Spanish companies has allowed them to have a leading position (among the first ten countries in the world) in the food industry, fashion, gastronomy, technology, research, renewable energy, railway construction, organ transplantation, and sports.\n\nFrom Antoni Gaudí to the Culdesac studio, including Óscar Tusquets and Nani Marquina, Spain has always been a benchmark for quality design with international projection. This course looks at Made in Spain from both an economic and business point of view and shows a brief tour of the world of national designers and some of its most emblematic pieces.\n\nThe Spanish fashion industry plays a fundamental role in economic development, with around 19,500 companies that make a contribution to GDP of 2.8%, and in the context of a highly competitive globalized market. As a result, Spain achieves the fifth place in importance in Europe after Italy, Germany, the United Kingdom, and France, both in production volume and in employment. This is due in large part to the design of products with high added value, leather and footwear accessories, and the use of modern marketing and distribution techniques that have revolutionized the sector.\n",
    "prereq": {}
  },
  {
    "uid": "819552",
    "code": "MADR3027",
    "subject": "MADR",
    "number": "3027",
    "honors": false,
    "writing": false,
    "name": "Contemp Span Hist through Film",
    "fullname": "Contemporary Spanish History through Film",
    "info": "Spanish cinema provides an excellent route for understanding social and political change throughout the 20th and 21st Centuries. As the most important artistic medium of modernity, cinema allows one to construct and deconstruct many myths and identities. This course will analyze the most relevant Spanish film productions primarily as socio-historical documents (content). Topics in Spain may include the Republic and Civil War (Fernán Gómez and Buñuel), the ’60s comic criticism of dictatorship (García Berlanga), and censorship (Lazaga), the transition to democracy (Garci and Almodóvar), and the new ’90s cinema (Amenábar, de la Iglesia, Medem, Coixet, and Bollaín).",
    "prereq": {}
  },
  {
    "uid": "817363",
    "code": "MADR3031",
    "subject": "MADR",
    "number": "3031",
    "honors": false,
    "writing": false,
    "name": "Intro Sensation and Perception",
    "fullname": "Introduction to Sensation and Perception",
    "info": "To develop an understanding of the psychological, biological, and physical bases of sensory experience in humans and animals. First we will consider the philosophical questions that humans have long posed about perception, and study the methods and techniques scientists use to try to answer them. We will study the sensory pathways, fundamental perceptual processing, and higher-level meaning-making, emphasizing the senses of vision and hearing. We will more briefly consider the orienting senses, skin senses, chemical senses (smell and taste), and the perception of time.\n\nStudents must have successfully completed an introductory psychology course as a prerequisite.",
    "prereq": {}
  },
  {
    "uid": "817466",
    "code": "MADR3032",
    "subject": "MADR",
    "number": "3032",
    "honors": false,
    "writing": false,
    "name": "Learning and Behavior",
    "fullname": "Learning and Behavior",
    "info": "This course will cover methods and findings of research on learning and behavioral change. Additionally, students will learn about twentieth-century theoretical perspectives, including contemporary models. There will be an emphasis on animal learning behavior and behavioral psychology.",
    "prereq": {}
  },
  {
    "uid": "826634",
    "code": "MADR3081W",
    "subject": "MADR",
    "number": "3081",
    "honors": false,
    "writing": true,
    "name": "Program Design & Development",
    "fullname": "Program Design & Development",
    "info": "Principles of programming design/analysis. Concepts in software development. Uses a programming project to illustrate key ideas in program design/development, data structures, debugging, files, I/O, testing, and coding standards.\nThis course covers skills, tools, and theory related to becoming a good software developer. The course will prepare students to succeed in 4xxx- and 5xxx-level programming intensive courses, especially those that are programming-intensive and/or use C/C++.",
    "prereq": {}
  },
  {
    "uid": "817565",
    "code": "MADR3206",
    "subject": "MADR",
    "number": "3206",
    "honors": false,
    "writing": false,
    "name": "Health Psychology",
    "fullname": "Health Psychology",
    "info": "Recent advances in psychological, medical, and physiological research have led to a new way of thinking about health and illness and understanding that our health is not only the product of biological processes but also of psychological, behavioral and social processes. Health psychology is a relatively young field of study that examines the relationship between psychology and health. The course highlights differences between health psychology and the biomedical model and examines the kinds of questions asked by health psychologists like: How our personality may affect our health? What does stress do to our health? What psychological and social factors cause people to behave in unhealthy ways? What can psychologists do to help cure illness? Are there ethnic and gender variations in health? Does it matter how your doctor talks to you?",
    "prereq": {}
  },
  {
    "uid": "818125",
    "code": "MADR3301",
    "subject": "MADR",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Cross-Cultural Psychology",
    "fullname": "Cross-Cultural Psychology",
    "info": "This course's aim is to understand how cultural factors influence human behavior and development. Additionally, the course may discuss interaction between different cultures and how to solve the difficulties that may arise during the acculturation process. The course studies the vision and treatment of mental disorders in different cultures, especially the differences and similarities between Spanish and North American cultures. It will also analyze and compare mental health systems of both countries.\n",
    "prereq": {}
  },
  {
    "uid": "819281",
    "code": "MADR3401",
    "subject": "MADR",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": {}
  },
  {
    "uid": "819282",
    "code": "MADR3402",
    "subject": "MADR",
    "number": "3402",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": {}
  },
  {
    "uid": "819283",
    "code": "MADR3403",
    "subject": "MADR",
    "number": "3403",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": {}
  },
  {
    "uid": "819284",
    "code": "MADR3404",
    "subject": "MADR",
    "number": "3404",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": {}
  },
  {
    "uid": "819285",
    "code": "MADR3405",
    "subject": "MADR",
    "number": "3405",
    "honors": false,
    "writing": false,
    "name": "Carlos III U. of Madrid Course",
    "fullname": "Carlos III University of Madrid Course",
    "info": "This is a course shell that will be used on the Study & Intern Abroad in Madrid study abroad program to represent a course taken at Carlos III University of Madrid. The specific course title will appear for each student in the Notes field directly underneath this course on their transcript.",
    "prereq": {}
  },
  {
    "uid": "817597",
    "code": "MADR3604",
    "subject": "MADR",
    "number": "3604",
    "honors": false,
    "writing": false,
    "name": "Intro to Psychopathology",
    "fullname": "Introduction to Psychopathology",
    "info": "This course will provide an introduction and broad background on the assessment, phenomenology, and theorized causes of psychological disorders. Students will learn the classification system used in the DSM-5, as well as etiological and treatment-related information. During this course, students will be responsible for learning basic descriptive psychopathology as well as emerging brain-based markers of mental disorders. ",
    "prereq": {}
  },
  {
    "uid": "818929",
    "code": "MADR3711",
    "subject": "MADR",
    "number": "3711",
    "honors": false,
    "writing": false,
    "name": "Psychology in the Workplace",
    "fullname": "Psychology in the Workplace",
    "info": "Application of psychological theory/research to recruitment, personnel selection, training/development, job design, work group design, work motivation, leadership, performance assessment, job satisfaction measurement\n\nIndustrial / Organizational Psychology is the application of the scientific study of human behavior and thinking to work organizations. I/O Psychology is both an academic discipline and a professional discipline; thus, in this class we focus on both research and the application of research findings to practical problems in the workplace. I/O Psychologist are concerned with the recruitment, selection, training, motivation, and job performance of individual at work. They are also involved in issues such as teamwork, leadership, and job attitudes. \n",
    "prereq": {}
  },
  {
    "uid": "826588",
    "code": "MADR4041",
    "subject": "MADR",
    "number": "4041",
    "honors": false,
    "writing": false,
    "name": "Algorithms & Data Structures",
    "fullname": "Algorithms & Data Structures",
    "info": "Rigorous analysis of algorithms/implementation. Algorithm analysis, sorting algorithms, binary trees, heaps, priority queues, heapsort, balanced binary search trees, AVL trees, hash tables and hashing, graphs, graph traversal, single source shortest path, minimum cost spanning trees. \n\nIt is a useful course for students who desire to learn some core material in computing. It covers important data structures and algorithms, as well as analysis of algorithms, and algorithm paradigms such as greedy algorithms and divide-and-conquer. \n\nIt is 4 credits, with 3 hours/week in lecture, and 1 hour/week in discussion. Discussion can be used for problem solving and review, or more in-depth discussion of topics and examples given in lecture. Since many students struggle with topics like analyzing algorithms, identifying what algorithms/data structures are appropriate to use in given situations, etc., the practice given in discussion can be valuable. ",
    "prereq": {}
  },
  {
    "uid": "826603",
    "code": "MADR4511W",
    "subject": "MADR",
    "number": "4511",
    "honors": false,
    "writing": true,
    "name": "Intro: Artificial Intelligence",
    "fullname": "Introduction to Artificial Intelligence",
    "info": "This course provides a technical introduction of fundamental concepts of artificial intelligence (AI) and their applications to real-world problems. Topics include: history of AI, agents, search (search space, uninformed and informed search, constraint satisfaction, game playing), knowledge representation (logical encodings of domain knowledge, logical reasoning systems), planning, and an introduction to machine learning. The course is suitable for students who want to explore the field of artificial intelligence and build the foundations for more advanced work in AI.",
    "prereq": {}
  },
  {
    "uid": "826589",
    "code": "MADR4611",
    "subject": "MADR",
    "number": "4611",
    "honors": false,
    "writing": false,
    "name": "Programming Graphics & Games",
    "fullname": "Programming Interactive Computer Graphics  & Games",
    "info": "Computer graphics is an exciting field within computer science that has seen dramatic recent growth. The impact of graphics on our culture and on our daily lives is far-reaching, as we can see through applications in art, design, education, games, movies, science, and medicine. This course covers the tools and techniques used today for programming games and other interactive computer graphics applications. Some of the core concepts covered include: event loops, rendering and animation, polygonal models, texturing, and physical simulation. This is a heavy programming course, and there is an emphasis on graphics toolkits. Other topics briefly covered include the history and future of computer games technologies and the social impact of interactive computer graphics.",
    "prereq": {}
  },
  {
    "uid": "814315",
    "code": "MADR4901",
    "subject": "MADR",
    "number": "4901",
    "honors": false,
    "writing": false,
    "name": "Research Lab in Psychology",
    "fullname": "Research Laboratory in Psychology",
    "info": "Study abroad course",
    "prereq": {}
  }
]