[
  {
    "uid": "805976",
    "code": "MBS6001",
    "subject": "MBS",
    "number": "6001",
    "honors": false,
    "writing": false,
    "name": "Intro to Research Bio Sciences",
    "fullname": "Introduction to Research in the Biological Sciences",
    "info": "This course introduces students in the MBS program to resources available to them at the University of Minnesota and in the College of Continuing and Professional Studies. Students will prepare and deliver a scientific presentation and write a critical analysis of a topic in their planned area of concentration. Students also will explore ethical issues in the biological sciences and learn how to avoid plagiarism. This is a hybrid course that includes both online activities and classroom meetings. Required of all MBS students.",
    "prereq": {}
  },
  {
    "uid": "805977",
    "code": "MBS6002",
    "subject": "MBS",
    "number": "6002",
    "honors": false,
    "writing": false,
    "name": "Final Project Plan B MBS Stdnt",
    "fullname": "Final Project Course for Plan B MBS Students",
    "info": "MBS 6002 is the final project course for Plan B MBS students who register for this course during their last term in the MBS program.\n\nWhile registered in MBS 6002 students will complete their Plan B project and paper, and the final oral defense will be held in front of a committee of three faculty members. A final grade will be assigned after the student has successfully passed the oral defense and submitted a final version of the Plan B paper to the MBS office.\n \nStudents intending to register for MBS 6002 need to fill out a Plan B Final Project contract form with their research mentor and submit it to their MBS academic advisor for approval before receiving a permission number to register.\n\nThis is a three-credit course that is graded S/N.\n\n",
    "prereq": {}
  },
  {
    "uid": "809107",
    "code": "MBS6003",
    "subject": "MBS",
    "number": "6003",
    "honors": false,
    "writing": false,
    "name": "Capstone Plan C MBS Students",
    "fullname": "Capstone Course for Plan C MBS Students",
    "info": "MBS 6003 is the capstone course for students Plan C MBS students who register for this course during their last term in the MBS program.\n\nIn MBS 6003 students will complete and defend their Plan C capstone paper. The capstone paper is an in depth and critical analysis of cutting edge research in the biological sciences that explicitly incorporates the training and experiences students had during the MBS program. The course also requires an oral presentation of the paper.\n\nStudents intending to register for MBS 6003 must contact their advisor well in advance to discuss their plans and receive approval. A meeting with the course instructor is encouraged before receiving a permission number to register.\n\nThis is a three-credit hybrid course that includes both online activities and classroom meetings. The course is graded S/N. \n",
    "prereq": {}
  },
  {
    "uid": "819940",
    "code": "MBS6101",
    "subject": "MBS",
    "number": "6101",
    "honors": false,
    "writing": false,
    "name": "Scientific Literature Workshop",
    "fullname": "Scientific Literature Workshop",
    "info": "MBS 6101 Scientific Literature Workshop gives students an introduction to writing in the sciences with an emphasis on working with sources. Students will learn to read scientific literature like writers, developing an understanding of the goals, formal requirements, and ethical decision-making involved in scientific writing. By reflecting on the purpose of writing in the sciences, analyzing published examples and participating in discussions, as well as creating brief writing assignments, students will learn the important elements of scientific writing and become better prepared for the scientific writing process, both in an academic and a professional setting. \n",
    "prereq": {}
  },
  {
    "uid": "806651",
    "code": "MBS6110",
    "subject": "MBS",
    "number": "6110",
    "honors": false,
    "writing": false,
    "name": "Graduate Seminar Series",
    "fullname": "Graduate Seminar Series",
    "info": "Required for all MBS Plan C students. In MBS 6110, students attend bioscience seminars of their choosing during the semester, write a summary analysis of each seminar to share with other students in the class, and peer review another student’s seminar experience. Seminar reports and peer reviews are submitted to the online course site. Seminars are an essential part of the research mission of the University, and of professional communication across the scientific community. Participation in research seminars allows students to advance their understanding of current questions and ongoing research within their own particular area of interest, or to explore other areas of research within the biological sciences. This is a one-credit course graded as S/N.",
    "prereq": {}
  },
  {
    "uid": "805917",
    "code": "MBS6993",
    "subject": "MBS",
    "number": "6993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed Studies\n\nprereq: dept consent",
    "prereq": {}
  },
  {
    "uid": "805918",
    "code": "MBS6994",
    "subject": "MBS",
    "number": "6994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Directed research.\n\nprereq: dept consent",
    "prereq": {}
  }
]