[
  {
    "uid": "792488",
    "code": "MCOM5400",
    "subject": "MCOM",
    "number": "5400",
    "honors": false,
    "writing": false,
    "name": "Storytelling for Business",
    "fullname": "Presentation Skills and Storytelling for Business",
    "info": "Memo writing, oral presentations, and team communication required of HR professional. Emphasizes hands-on, experiential learning, including videotaping.prereq: HRIR student",
    "prereq": {}
  },
  {
    "uid": "792632",
    "code": "MCOM5500",
    "subject": "MCOM",
    "number": "5500",
    "honors": false,
    "writing": false,
    "name": "Executive Image Communications",
    "fullname": "Enhancing Your Executive Image in Business Communications",
    "info": "Techniques to project executive presence in all business communications.\n\nprereq: MBA student",
    "prereq": {}
  },
  {
    "uid": "792489",
    "code": "MCOM5515",
    "subject": "MCOM",
    "number": "5515",
    "honors": false,
    "writing": false,
    "name": "Management Communication",
    "fullname": "Management Communication: Writing for Influence",
    "info": "Many professionals find writing difficult, intimidating, and/or time-consuming. Some believe AI offers hope for quickly generating acceptable content, and it can do so in some cases, but AI only helps when a user can steer an algorithm with a strategic mindset and a strong sense of quality control.  At the same time, a constantly growing body of research shows that strong writing skills are still essential for long-term career advancement and daily influence.  In MCOM 5515, students study and produce an array of common written forms to practice and develop persuasive techniques that complement and enhance principles of efficient professional writing. Focusing on techniques that make writing less intimidating and more influential, course work is designed to help you identify patterns in your own writing so you can improve or alter your current approach to drafting and revision, further developing your own process for producing communication that is audience-targeted and action-oriented. The course integrates learning through small and large group discussions, in-class and out-of-class assignments, and formal deconstruction of reading materials. For many assignments, students are asked to customize requirements to their own real-world circumstances, with the final goal of creating portfolios of written work to use in their own careers.prereq: MBA student",
    "prereq": {}
  },
  {
    "uid": "792490",
    "code": "MCOM5520",
    "subject": "MCOM",
    "number": "5520",
    "honors": false,
    "writing": false,
    "name": "Pers Writing in Bus:Non-Native",
    "fullname": "Persuasive Writing in Business: Non-Native Speakers of English",
    "info": "Writing to motivate/affect change. Form/content, techniques of persuasion.  Producing polished text. Writing with power.",
    "prereq": {}
  },
  {
    "uid": "792491",
    "code": "MCOM5535",
    "subject": "MCOM",
    "number": "5535",
    "honors": false,
    "writing": false,
    "name": "Strat, Skills for Mgrl Present",
    "fullname": "Strategies and Skills for Managerial Presentations",
    "info": "Delivering key messages with clarity/confidence, regardless of audience or setting. Maximizing impact as a speaker, seated/standing. Personal communication style and audience. Tailoring message. Handling questions/answers. Using audio/visual tools. Presenting as a team.\n\nprereq: MBA or Mgmt Science MBA student",
    "prereq": {}
  },
  {
    "uid": "792492",
    "code": "MCOM5540",
    "subject": "MCOM",
    "number": "5540",
    "honors": false,
    "writing": false,
    "name": "Mgrl Presentations:Non-Native",
    "fullname": "Strategies and Skills for Managerial Presentations: Non-Native Speakers of English",
    "info": "Delivering key messages with clarity/confidence, regardless of audience or setting. Maximizing impact as a speaker, seated/standing. Personal communication style and audience. Tailoring message. Handling questions/answers. Using audio/visual tools. Presenting as a team.",
    "prereq": {}
  }
]