[
  {
    "uid": "805907",
    "code": "MDP5001",
    "subject": "MDP",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Ways of Sustainable Dev",
    "fullname": "Ways of Knowing for Sustainable Development",
    "info": "Complexities of interdisciplinary study of development and a range of ways of knowing the field of development studies and sustainability. Approaches practiced by physical, biological, social science, and humanities scholars. \"Ways of knowing\" in different cultures/groups and from a variety of situated perspectives. Key issues and concepts and key methodological challenges facing us as we engage in interdisciplinary and international development study and practice. Sustainable livelihoods. Team taught when possible by faculty from biological, social sciences, and humanities, or at minimum will include guest lecturers who can offer a range of disciplinary perspectives on questions of development.\n\nprereq: Grad MDP major or instr consent",
    "prereq": {}
  },
  {
    "uid": "806014",
    "code": "MDP5002",
    "subject": "MDP",
    "number": "5002",
    "honors": false,
    "writing": false,
    "name": "Program Development Workshop",
    "fullname": "Program Development Workshop",
    "info": "Research/writing skills to support work in international development. Discussion of basic qualitative research methods/data analysis. Qualitative/quantitative data, collaborative research/analysis. Relationship between research/policy.\n\nprereq: MDP grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "806204",
    "code": "MDP5003",
    "subject": "MDP",
    "number": "5003",
    "honors": false,
    "writing": false,
    "name": "Field Study Seminar",
    "fullname": "Field Study Pre-Departure Seminar",
    "info": "Preparation for international field experience. Identify arrangements for summer field experience in consultation with faculty leader of seminar/MDP advisers. Feedback on colleagues' plans.\n\nprereq: MDP grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "808504",
    "code": "MDP5004",
    "subject": "MDP",
    "number": "5004",
    "honors": false,
    "writing": false,
    "name": "International Field Experience",
    "fullname": "International Field Experience",
    "info": "International field experience.\n\nprereq: MDP grad student or instr consent",
    "prereq": {}
  },
  {
    "uid": "817436",
    "code": "MDP5005",
    "subject": "MDP",
    "number": "5005",
    "honors": false,
    "writing": false,
    "name": "Qualitative Methods: Dev Prac",
    "fullname": "Qualitative Methods for Development Practice",
    "info": "Course introduces students to qualitative inquiry and analysis in the field of international and/or sustainable development practice. It provides students  with first hand experience in research design for development practice applications, including data collection and analysis. The course includes lectures, discussions, presentations, and project based learning. It is considered introductory as a single semester is insufficient to introduce, design, and conduct a comprehensive qualitative inquiry and analysis.   ",
    "prereq": {}
  },
  {
    "uid": "807412",
    "code": "MDP5100",
    "subject": "MDP",
    "number": "5100",
    "honors": false,
    "writing": false,
    "name": "Capstone Prep Workshop",
    "fullname": "Capstone Prep Workshop",
    "info": "This project-focused seminar meets once at the beginning of the fall semester to collect observations, reflections and insights from the summer field placements. Then, throughout the fall semester, the seminar will meet periodically to stage the spring capstone course. Staging includes a capstone overview session, presentation of projects, team selection process and initial client engagements, the latter being particularly important for teams aspiring to travel during the winter or spring breaks. ",
    "prereq": {}
  },
  {
    "uid": "807819",
    "code": "MDP5200",
    "subject": "MDP",
    "number": "5200",
    "honors": false,
    "writing": false,
    "name": "Capstone Workshop",
    "fullname": "Capstone Workshop in Development Practice",
    "info": "Learning from field experiences. Analytical/practical skills developed in academic training. Apply skill/experiences to \"real world\" problem provided by local or international development-focused organization. Reflective practice.\n\nprereq: MDP grad student or instr consent",
    "prereq": {}
  }
]