[
  {
    "uid": "819982",
    "code": "MED7009",
    "subject": "MED",
    "number": "7009",
    "honors": false,
    "writing": false,
    "name": "Immigrant/Refugee Health & DR",
    "fullname": "Immigrant/Refugee Health and Disaster Response",
    "info": "Credit cannot be given if you took INMD 7011. \n\nThis course comprises two main topic areas: Immigrant/Refugee Health and Disaster Response. The Immigrant/Refugee Health topic prepares physicians and other health care providers to care for immigrants, refugees, and other mobile populations. Allow 24.5 hours, including additional time for bonus materials. \n\nThis course is composed of five sections: Understanding Globally Mobile Populations, Clinical Issues in the Care of Mobile Populations, Health Systems Issues, Psychosocial Issues, and Cross-Cultural Issues in End of Life and Advance Care Planning (Honoring Choices Across Cultures). The Disaster Response topic prepares physicians and other health care providers to practice medicine during disaster response and in settings with limited resources. Allow 26 hours, including additional time for bonus materials. This course is composed of five sections: Disaster Relief, Medical Relief Missions, Clinical Medicine In Resource Limited Settings, Pediatrics in Resource Limited Settings, and OB/GYN in Resource Limited Settings. \n\nLearning Objectives: By the end of this course, students will be able to: Care for a multicultural patient population, including treating diseases seen in new arrivals and long-term foreign-born residents. Identify key issues in local and global health equity and barriers to care for immigrants and refugees. Describe best practices in clinical care and health systems interventions designed to reduce disparities in care and service for immigrants and refugees. Discuss how to apply the LEARN model of patient-centered communication to advance care planning and advance directives. Explain a framework for providing culturally-competent health care during disaster response and in resource-limited settings. Improve expertise in clinical care in low-resource settings including short-term relief work. \n\nCourse Expectations: For Immigrant/Refugee Health: 24.5 hours total of online, self-directed learning and For Disaster Response: 26 hours total of online, self-directed learning Assessments: Online discussion participation. Quizzes, final test.",
    "prereq": {}
  },
  {
    "uid": "819983",
    "code": "MED7010",
    "subject": "MED",
    "number": "7010",
    "honors": false,
    "writing": false,
    "name": "Pub. Hlth, Noncom Dis, Trvl Md",
    "fullname": "Public Health and Noncommunicable Diseases and Travel Medicine",
    "info": "Credit cannot be given if you took INMD 7011. \n\nThis course comprises two main topic areas: Public Health and Noncommunicable diseases and Travel Medicine. The Public Health and Noncommunicable diseases topic prepares physicians and other health care providers to provide care for immigrants, refugees, and other mobile populations in several sub-specialties, including cardiology, hematology, oncology, and surgery. Allow 36 hours, including additional time for bonus materials. \n\nThis course is composed of seven sections: Public Health, Environmental Health, Nutrition, Heart and Kidney Disease, Hematology and Oncology, Other Medical Specialties, and Dermatology. The Travel Medicine topic prepares physicians and other health care providers to care for people traveling to (or living in) developing countries and other settings where resources are limited. Allow 21.5 hours, including additional time for bonus materials. This course is composed of five sections: Travel Preparation, Environmental Distress, Special Travel Populations, Travel Activities, and Post-travel Evaluation and Cases.\n\nLearning Objectives: By the end of this course students will be able to: Describe the role of international organizations in public health. State key principles and practices in international public health and epidemiology. Recognize the epidemiology, diagnosis and treatment of non-infectious illness such as hematology, oncology, trauma, cardiology and other specialties in low-resource settings. Provide pre-travel advice and care for patients planning to travel to developing countries. Diagnose and treat individuals who become ill during overseas travel or residence. Provide post-travel evaluation and care for patients returning from travel to developing countries. Diagnose and treat individuals living in the tropics and sub-tropics who are ill. \n\nCourse Expectations: For Public Health: 36 hours total of online, self-directed learning For Travel Medicine: 21.5 hours total of online, self-directed learning Assessments: Online discussion participation. Quizzes, final test",
    "prereq": {}
  },
  {
    "uid": "819985",
    "code": "MED7012",
    "subject": "MED",
    "number": "7012",
    "honors": false,
    "writing": false,
    "name": "Neglected/Tropical Illnesses",
    "fullname": "Neglected/Tropical Illnesses",
    "info": "This course comprises four main topic areas: Parasitic Infections, Tropical Bacterial, Mycobacterial, and Fungal Infections, Tropical Viral Infections, and Tropical Dermatology.\nThe Parasitic Infections topic prepares physicians and other health care providers to diagnose and treat people with parasitic infections. Allow 32.5 hours, including additional time for bonus materials. This course is composed of six sections: \nNeglected Tropical Diseases,\nMalaria,\nOther Protozoa,\nNematodes, Cestodes, and Trematodes,\nInsect and Vector-Borne Diseases, and\nClinical Case Vignettes.\nThe Tropical Bacterial, Mycobacterial, and Fungal Infections topic prepares physicians and other health care providers to diagnose and treat people with bacterial, TB, and fungal infections. Allow 26.75 hours, including additional time for bonus materials. This course is composed of five sections: \nTuberculosis,\nBacterial Infections I,\nBacterial Infections II,\nFungal Infections, and\nClinical Case Vignettes.\nThe Tropical Viral Infections topic prepares physicians and other health care providers to diagnose and treat people with viral infections. Allow 25.75 hours, including additional time for bonus materials. This course is composed of five sections: \nHIV,\nHepatitis and Other Enteral Viruses,\nViral Illnesses I,\nViral Illnesses II, and\nClinical Case Vignettes.\nThe Tropical Dermatology topic provides an overview of skin diseases seen in the tropics with emphasis on diagnoses that are common or of medical/public health importance. The diseases are organized by presenting complaint. This is designed to reflect how we, as clinicians, evaluate patients: by clinical presentation rather than by etiology of disease.\nThe course is divided into 7 sections. The first section is a review of the terminology used to describe skin diseases; these are essential to know before proceeding with the rest of the course. The next six sections are organized by presentation of illness:\nItch in the Tropics,\nPigmentary Disorders,\nEnlarged Limbs,\nCutaneous Nodules,\nFever and Rash, and\nCutaneous Ulcers.\nFor each disease, the key clinical findings, etiology, diagnosis and management are discussed. \nLearning Objectives:\nBy the end of this course students will be able to:\nRecognize the epidemiology, pathophysiology, clinical presentation, and diagnosis and treatment of under-represented tropical infectious parasitic diseases.\nDescribe the epidemiology, pathophysiology, clinical presentation, and diagnosis and treatment of under-represented tropical bacterial, mycobacterial, and fungal infectious diseases.\nRecognize the epidemiology, pathophysiology, clinical presentation, and diagnosis and treatment of under-represented tropical viral infectious diseases.\nRecognize infectious and non-infectious skin diseases that affect persons in low to middle income countries and mobile populations such as refugees, immigrants, and travelers.\nFormulate differential diagnosis of these skin diseases based on clinical presentation.\nExplain the utility of bedside diagnostic tests in dermatology to support a diagnosis.\nCourse Expectations:\nParasitic Infections: 32.5 hours total of online, self-directed learning,\nTropical Bacterial, Mycobacterial, and Fungal Infections: 26.75 hours total of online, self-directed learning,\nTropical Viral Infections: 25.75 hours total of online, self-directed learning, and\nTropical Dermatology: 5 hours total of online, self-directed learning.\nAssessments:\nOnline discussion participation. Quizzes, final test.\n",
    "prereq": {}
  },
  {
    "uid": "820224",
    "code": "MED7018",
    "subject": "MED",
    "number": "7018",
    "honors": false,
    "writing": false,
    "name": "Literature in a Time of Plague",
    "fullname": "The Wisdom of Literature in a Time of Plague",
    "info": "For as long as we have roamed the earth, plagues have bedeviled humanity. And their consequences have been nearly immeasurable.  \n\nFrom emotional upheaval to economic hardship, from unwanted illness to untimely death, infections have shattered and molded what it means to be human. Plagues have also shaped our literature. While it is essential that we consult the latest research in infection control and treatment, we are wise to read classic and modern literature for the profound insight it has to offer. From Camus’ The Plague to Crichton’s The Andromeda Strain, from Shakespeare’s King Lear to Dante’s Divine Comedy, this rotation offers timeless readings from classic and modern literature. Not only will we study and discuss literary reflections on plagues, but more importantly we will broadly consider our reaction to times of great trial. As physicians and human beings, what is our duty (or vocation) in deeply uncertain times? How are we to comprehend and cope with suffering? Where will we find the profound and subtle graces amidst public and personal calamity? In the end, what does great literature have to teach us? For medical students and clinicians navigating the COVID-19 pandemic, to answer these questions is to better prepare ourselves to serve our patients while sustaining ourselves with the deeper reasons behind our work. \n\nOver four weeks, readings in great literature (books, essays, and excerpts) will be assigned weekly. Readings should be read and students should be prepared to discuss them in advance of each small group discussion. Weekly small group Zoom discussion (assigned group of 4-5) will happen on Thursdays from ---- to -----. Weekly large group Zoom discussion (entire class) will happen on Friday from ---- to ----.  Friday’s class will more deeply consider the course material and  be one part didactic and another, conversational. \n\nWeek One - The Literature of Plagues\nWeek Two - On Duty\nWeek Three - On Suffering\nWeek Four - On Grace\n\nprereq: Completion of MS3 required clerkships, exceptions at discretion of course director\n",
    "prereq": {}
  },
  {
    "uid": "820302",
    "code": "MED7019",
    "subject": "MED",
    "number": "7019",
    "honors": false,
    "writing": false,
    "name": "Global Pediatric Educ Series",
    "fullname": "Global Pediatric Education Series for Medical Students",
    "info": "Global health has long been a priority at the University of Minnesota. This online course is designed to equip providers interested specifically in pediatrics with the knowledge that they need to practice in an under-resourced setting. This course, updated in 2019, consists of 29 pre-recorded lectures, each approximately 1 hour or less focusing on pediatric specific topics comprising 4 modules: Fundamentals of Global Child Health, Disease Identification and Management, Clinical Pearls and Preparing for work Abroad, and Global Pediatrics at home.  ",
    "prereq": {}
  },
  {
    "uid": "013067",
    "code": "MED7201",
    "subject": "MED",
    "number": "7201",
    "honors": false,
    "writing": false,
    "name": "Clinical Medicine",
    "fullname": "Clinical Medicine",
    "info": "Clinical medicine.",
    "prereq": {}
  },
  {
    "uid": "013068",
    "code": "MED7202",
    "subject": "MED",
    "number": "7202",
    "honors": false,
    "writing": false,
    "name": "Clinical Conference",
    "fullname": "Clinical Conference",
    "info": "Clinical conference.",
    "prereq": {}
  },
  {
    "uid": "013069",
    "code": "MED7203",
    "subject": "MED",
    "number": "7203",
    "honors": false,
    "writing": false,
    "name": "Clinical Radiology Conference",
    "fullname": "Clinical Radiology Conference",
    "info": "Clinical radiology conference.",
    "prereq": {}
  },
  {
    "uid": "013070",
    "code": "MED7204",
    "subject": "MED",
    "number": "7204",
    "honors": false,
    "writing": false,
    "name": "Pathology Conference",
    "fullname": "Pathology Conference",
    "info": "Pathology conference. ",
    "prereq": {}
  },
  {
    "uid": "799384",
    "code": "MED7300",
    "subject": "MED",
    "number": "7300",
    "honors": false,
    "writing": false,
    "name": "Global Health",
    "fullname": "Global Health",
    "info": "Global nature of health and health care. Global health by systems (cardiology, GI, oncology, etc.). Tropical infectious diseases, public health. Refugee/migrant health, cross cultural health care, travel medicine. All core required topics for ASTMH certification. Case-based lectures. Lab component during modules 4-7.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "011337",
    "code": "MED7500",
    "subject": "MED",
    "number": "7500",
    "honors": false,
    "writing": false,
    "name": "Medicine Clerkship",
    "fullname": "Medicine Clerkship",
    "info": "Med 7500 emphasizes diagnostic approach to patient problems and acquisition of core knowledge and skills. The student is part of a patient care team and evaluates and follows at least two new patients per week. Required conferences and tutorial sessions related to the student's patients and to basic problems in internal medicine are organized for the student at each site. ",
    "prereq": {}
  },
  {
    "uid": "011338",
    "code": "MED7501",
    "subject": "MED",
    "number": "7501",
    "honors": false,
    "writing": false,
    "name": "Sub-internship in Crit. Care",
    "fullname": "Sub-internship in Critical Care",
    "info": "Second part of the required 12 weeks of experience in internal medicine started in Medicine 7500. Medicine 7501 is a \"sub-internship\" in which the student takes direct responsibility for patient care. Therapeutic decision making and care planning are emphasized. The student is part of a patient care team and assumes responsibility for the evaluation and care of three new patients per week. Acute care tutorials with learning objectives and suggested readings are an important part of the course. Self-directed learning tools are available.\n\nprereq: 7500",
    "prereq": {
      "and": [
        "011337"
      ]
    }
  },
  {
    "uid": "820012",
    "code": "MED7502",
    "subject": "MED",
    "number": "7502",
    "honors": false,
    "writing": false,
    "name": "Medicine Clerkship A",
    "fullname": "Medicine Clerkship Part A",
    "info": "Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. \n\nCatalog Description:  The MED 7500 (Medicine Externship I, or \"Med I\") is the core clinical clerkship that provides the critical foundations for not only adult inpatient medicine but also for the care of the acutely ill patient. Students will be part of inpatient care teams that will include interns, residents, and faculty.\n\nStudents will learn through case discussions and presentations, didactics, independent study, and in the daily care of their patients. Students are expected to care for their patients as their primary point of contact, to begin to assume the responsibility for caring for, and coordinating care for, their patients.\n\nIn addition, students on MED 7500 are expected to develop the basic skills of patient care in an academic environment. These skills include working across disciplines and professions on a health care team, effectively documenting and relaying patient care information between other care providers, and learning how to gather information to create a well-formulated assessment and plan. The skills learned on MED 7500 provide the foundation for patient care that students will use across disciplines for the remainder of medical school, into residency, and beyond.",
    "prereq": {}
  },
  {
    "uid": "820013",
    "code": "MED7503",
    "subject": "MED",
    "number": "7503",
    "honors": false,
    "writing": false,
    "name": "Medicine Clerkship B",
    "fullname": "Medicine Clerkship Part B",
    "info": "Course created specifically to accommodate clinical setting restrictions due to COVID-19 from spring 2020 to spring 2021. Part A of this course covers the virtual coursework while Part B covers the clinical component. Both parts A and B must be completed for the clerkship requirement to be considered fulfilled. \n\nCatalog Description:  The MED 7500 (Medicine Externship I, or \"Med I\") is the core clinical clerkship that provides the critical foundations for not only adult inpatient medicine but also for the care of the acutely ill patient. Students will be part of inpatient care teams that will include interns, residents, and faculty.\n\nStudents will learn through case discussions and presentations, didactics, independent study, and in the daily care of their patients. Students are expected to care for their patients as their primary point of contact, to begin to assume the responsibility for caring for, and coordinating care for, their patients.\n\nIn addition, students on MED 7500 are expected to develop the basic skills of patient care in an academic environment. These skills include working across disciplines and professions on a health care team, effectively documenting and relaying patient care information between other care providers, and learning how to gather information to create a well-formulated assessment and plan. The skills learned on MED 7500 provide the foundation for patient care that students will use across disciplines for the remainder of medical school, into residency, and beyond.",
    "prereq": {}
  },
  {
    "uid": "011339",
    "code": "MED7505",
    "subject": "MED",
    "number": "7505",
    "honors": false,
    "writing": false,
    "name": "Infec Disease Res",
    "fullname": "Infectious Disease Research",
    "info": "Although much of medical school consists of assimilating large amounts of information and learning how to apply facts to the diagnosis, treatment, and prevention of certain illnesses, much of this information is \"soft,\" and revisions are almost continuously being made. This course permits the student to participate in the process and better understand its limitations. The object of study may be a clinical or laboratory problem dealing with the diagnosis, treatment, natural history, or epidemiology of infections. Studies regarding antibiotic action, resistance testing, toxicity, host defenses, viral infections, and mechanisms of pathogenicity are especially encouraged. ",
    "prereq": {}
  },
  {
    "uid": "011340",
    "code": "MED7507",
    "subject": "MED",
    "number": "7507",
    "honors": false,
    "writing": false,
    "name": "Oncology Res",
    "fullname": "Research in Oncology",
    "info": "The student is involved in ongoing laboratory studies in an area under active investigation by a faculty member in oncology. Topics may include, but are not limited to, studies of cell differentiation, cell signaling and G-proteins, neutrophil membrane biochemistry and function, molecular biology of gene expression in hematopoietic and tumor cells, regulation of cellular genes by CMV, mechanisms of action by interferons, biology of breast carcinoma, chromatin structure, and regulation of histo-compatibility antigen gene expression in tumor cells. In addition to hands-on laboratory research, the student participates in research of relevant scientific literature and is encouraged to participate in regular research conferences. ",
    "prereq": {}
  },
  {
    "uid": "011343",
    "code": "MED7509",
    "subject": "MED",
    "number": "7509",
    "honors": false,
    "writing": false,
    "name": "Imm-Rheu Res",
    "fullname": "Research in Immunology--Rheumatology",
    "info": "Under the direct supervision of a faculty member, the student plans and carries out a well-defined project in immunobiology. The student is expected to review the subject area of the project, interpret relevant literature, plan and carry out experiments, interpret these experiments (including statistical evaluation of the data), and prepare a written report of the project. \n\nOpportunities available in genetics of systemic lupus, apoptosis in immune system, molecular and cellular biology of lymphocytes, the establishment of immune self tolerance and inter play of viral infection and autoimmunity. ",
    "prereq": {}
  },
  {
    "uid": "011362",
    "code": "MED7511",
    "subject": "MED",
    "number": "7511",
    "honors": false,
    "writing": false,
    "name": "Gastroenterology Research",
    "fullname": "Gastroenterology Research",
    "info": "The student works with a staff member in the gastroenterology section and carries on an active research program under the direction of the staff. Time will be available to attend various clinical functions of the GI section.",
    "prereq": {}
  },
  {
    "uid": "011344",
    "code": "MED7512",
    "subject": "MED",
    "number": "7512",
    "honors": false,
    "writing": false,
    "name": "Hem/Onc/Transplant Research",
    "fullname": "Hematology/Oncology/Transplantation Research (H.O.T. Research)",
    "info": "The student will plan and execute a project under the supervision of a faculty member in H.O.T. Division of Medicine. Cancer biology, stem cell, endothelial cell cancer, and sickle cell biology, coagulation abnormalities, and gene regulation are areas of opportunity. This course may also include shadowing a faculty member in clinic and production of a case report. ",
    "prereq": {}
  },
  {
    "uid": "820221",
    "code": "MED7513",
    "subject": "MED",
    "number": "7513",
    "honors": false,
    "writing": false,
    "name": "Med-Ped Primary Care",
    "fullname": "Community-Based Internal Medicine-Pediatric Primary Care During a Pandemic",
    "info": "The global coronavirus pandemic has changed how we provide primary care to our communities. It has accelerated the adoption of Telehealth and redefined the patients seen for in-person visits. In this rotation fourth year medical students will work with Internal Medicine-Pediatric physicians at a community clinic to provide both virtual and in-person primary care. Visits may range from management of chronic conditions, to acute issues, to well care for children. They will also be involved in pre-visit planning and follow-up care for patients.\n\nprereq: Completion of MS3 year, interest in Internal Medicine-Pediatrics\n\n\n\n\n",
    "prereq": {}
  },
  {
    "uid": "011345",
    "code": "MED7518",
    "subject": "MED",
    "number": "7518",
    "honors": false,
    "writing": false,
    "name": "Diabetes & Endocrinology Res",
    "fullname": "Diabetes & Endocrinology Research",
    "info": "The student plans and executes a research project under the supervision of a faculty member in the section of diabetes, endocrinology, and metabolism. ",
    "prereq": {}
  },
  {
    "uid": "011346",
    "code": "MED7521",
    "subject": "MED",
    "number": "7521",
    "honors": false,
    "writing": false,
    "name": "Infectious Disease",
    "fullname": "Infectious Disease",
    "info": "The student functions as integral member of the clinical infectious diseases team during this elective. They will evaluate patients, participate in all discussions, and explore the literature on problems relating to patients they have seen.",
    "prereq": {}
  },
  {
    "uid": "011347",
    "code": "MED7522",
    "subject": "MED",
    "number": "7522",
    "honors": false,
    "writing": false,
    "name": "Gastroenterology",
    "fullname": "Gastroenterology",
    "info": "The student, as a member of the G.I. consult team, does work ups and attends teaching rounds on patients with gastrointestinal disease, attends gastrointestinal conferences (clinic, x-ray, pathology), gain outpatient clinical experience, and becomes familiar with special diagnostic techniques, such as endoscopy, liver biopsy, and small intestinal biopsy. Night call is not required. ",
    "prereq": {}
  },
  {
    "uid": "011348",
    "code": "MED7523",
    "subject": "MED",
    "number": "7523",
    "honors": false,
    "writing": false,
    "name": "Diabetes, Endo & Metabolism",
    "fullname": "Diabetes, Endocrinology, & Metabolism",
    "info": "This elective rotation is a four (4) week introductory, structured clinical experience under direct supervision designed to provide the student experience diagnosing, treating, and caring for patients with endocrine disorders.",
    "prereq": {}
  },
  {
    "uid": "011374",
    "code": "MED7524",
    "subject": "MED",
    "number": "7524",
    "honors": false,
    "writing": false,
    "name": "Cardio Elec",
    "fullname": "Cardiovascular Medicine",
    "info": "A six-week exposure to acute and consultative cardiology with an emphasis on angina, acute myocardial infarction, heart failure, arrhythmias, and ECG interpretation.\n\nprereq: One med clin clkshp",
    "prereq": {}
  },
  {
    "uid": "011349",
    "code": "MED7525",
    "subject": "MED",
    "number": "7525",
    "honors": false,
    "writing": false,
    "name": "Cardiovascular Medicine",
    "fullname": "Cardiovascular Medicine",
    "info": "The student participates in the evaluation and management of the acute and chronic cardiovascular disease problems as they occur in both the inpatient consultation service and the outpatient setting. Supervised electrocardiographic interpretation sessions are available to allow development of skills in electrocardiography. The student attends cardiovascular clinical conferences as well as informal didactic teaching conferences.\n\nprereq: Med Student Yr 3 or 4/at least one other medicine elective",
    "prereq": {}
  },
  {
    "uid": "011350",
    "code": "MED7526",
    "subject": "MED",
    "number": "7526",
    "honors": false,
    "writing": false,
    "name": "Oncology",
    "fullname": "Oncology",
    "info": "As members of the oncology clinic team, students will do patient evaluations and followups in the oncology clinics, and participate in oncology conferences. Emphasis is on the clinical evaluation and management of new cancer patients.",
    "prereq": {}
  },
  {
    "uid": "820048",
    "code": "MED7527",
    "subject": "MED",
    "number": "7527",
    "honors": false,
    "writing": false,
    "name": "Infectious Diseases (Virtual)",
    "fullname": "Infectious Diseases (Virtual Course)",
    "info": "This course familiarizes students through clinical discussion of real-life\ncases of major infectious disease problems. Students will meet with the clerkship director to\ndiscuss interesting and relevant cases that have been previously presented in ID\nconferences. Students will also discuss differential diagnoses and workup of infectious\ndiseases. Students will understand how to develop a framework for systematic diagnosis and\nmanagement of major infectious diseases problems.",
    "prereq": {}
  },
  {
    "uid": "011363",
    "code": "MED7528",
    "subject": "MED",
    "number": "7528",
    "honors": false,
    "writing": false,
    "name": "Hematology",
    "fullname": "Hematology",
    "info": "This rotation will involve the opportunity to directly learn about diagnosis and management of classical and malignant hematology disorders in both inpatient and outpatient setting. The student will act as a subintern with initial responsibility to conduct history and physical exams on hospitalized patients for whom hematology consultations have been requested.",
    "prereq": {}
  },
  {
    "uid": "802244",
    "code": "MED7530",
    "subject": "MED",
    "number": "7530",
    "honors": false,
    "writing": false,
    "name": "Cardiology Research Elective",
    "fullname": "Cardiology Research Elective",
    "info": "Students work with faculty member on original or ongoing research project, review subject area, and help plan/execute research work. Topics include basic lab research and projects in clinical cardiology.",
    "prereq": {}
  },
  {
    "uid": "011364",
    "code": "MED7531",
    "subject": "MED",
    "number": "7531",
    "honors": false,
    "writing": false,
    "name": "Rheumatology",
    "fullname": "Rheumatology",
    "info": "Musculoskeletal complaints are among the most common problems that present to primary care physicians and arthritis and related diseases are a major cause of disability and loss of work in our society. It is thus essential that physicians involved in primary care develop skill in recognition and treatment of common rheumatologic diseases and ability to recognize and refer rare or more complicated problems.",
    "prereq": {}
  },
  {
    "uid": "011365",
    "code": "MED7532",
    "subject": "MED",
    "number": "7532",
    "honors": false,
    "writing": false,
    "name": "Pulmonary Disease",
    "fullname": "Pulmonary Disease",
    "info": "This elective is designed to expand students' understanding of respiratory pathophysiology as they acquire new skills in the diagnosis and management of pulmonary diseases.",
    "prereq": {}
  },
  {
    "uid": "011366",
    "code": "MED7533",
    "subject": "MED",
    "number": "7533",
    "honors": false,
    "writing": false,
    "name": "Clin Allergy Elec",
    "fullname": "Clinical Allergy",
    "info": "Practical aspects of allergic/immunologic work ups, treatments. Content modified depending upon individual student needs; special programs (e.g., laboratory methods) arranged depending upon student needs. Clinical material provided through Fairview-University, Regions, VA Hospitals, inpatient consultations, offices of practicing allergists in Twin Cities area. Lectures, seminars, discussions.",
    "prereq": {}
  },
  {
    "uid": "011367",
    "code": "MED7534",
    "subject": "MED",
    "number": "7534",
    "honors": false,
    "writing": false,
    "name": "Allergy Res",
    "fullname": "Research in Allergy",
    "info": "The student works with a staff member. He/she may choose to participate in ongoing research within our program or in an original investigative project of the student's design. He/she is expected to review the subject area of the investigation as well as plan, perform, interpret his/her studies, and make a presentation as well as a written report on the project. ",
    "prereq": {}
  },
  {
    "uid": "808969",
    "code": "MED7535",
    "subject": "MED",
    "number": "7535",
    "honors": false,
    "writing": false,
    "name": "Clin Allergy, Asthma & Immun",
    "fullname": "Clinical Allergy, Asthma and Immunology Elective Rotation",
    "info": "Manage adults/children with atopic dermatitis, contact dermatitis, urticaria, angioedema, food allergies, asthma, chronic cough, dysfunctional breathing, hypersensitivity pneumonias, allergic bronchopulmonary aspergillosis allergic rhinoconjunctivitis, nonallergic rhinitis, nasal polyps, sinusitis, eosinophilic esophagitis/gastritis, food protein intolerances, anaphylaxis, recurrent infections, venom allergy.\n\nprereq: It is recommended but not required that third and fourth year medical students should have at least one primary care rotation finished. Knowledge of how to perform full medical history and exam is required.",
    "prereq": {}
  },
  {
    "uid": "818764",
    "code": "MED7540",
    "subject": "MED",
    "number": "7540",
    "honors": false,
    "writing": false,
    "name": "Internal Medicine Research",
    "fullname": "Internal Medicine Research Elective",
    "info": "Academic credit (1 credit per week \"non-hands-on\") will be awarded for satisfactory completion of a research project at the University of Minnesota Medical Center or one of our affiliate sites within the Department of Medicine. Year 3 and 4 medical students can take up to 12 weeks of research credit total throughout their 3rd and 4th year, although the preferred total amount of time is 8 weeks or less. If more than 8 weeks of credit are requested, both the advisor and the Director of Integrated Education - Clinical must approve.\n\nThe student must have a research mentor prearranged, submit a short (limited to several paragraphs in length) description of the research through the application; and must have signature of the mentor at least 6 weeks in advance of taking the course. No retroactive credit will be approved.",
    "prereq": {}
  },
  {
    "uid": "798205",
    "code": "MED7542",
    "subject": "MED",
    "number": "7542",
    "honors": false,
    "writing": false,
    "name": "Inpatient Palliative Medicine",
    "fullname": "Rotation in Inpatient Palliative Medicine",
    "info": "The course is intended to introduce students to the field of palliative care. The rotation will be based out of University of Minnesota Medical Center. Primarily students will spend the rotation working on the inpatient palliative care consult team, seeing inpatient consults with physicians and other practitioners on the multidisciplinary team, including advanced practice providers, social workers, and spiritual health providers. Students planning on attending any type of residency program are encouraged to register, as training in palliative care concepts is relevant to all areas of medicine.",
    "prereq": {}
  },
  {
    "uid": "011368",
    "code": "MED7548",
    "subject": "MED",
    "number": "7548",
    "honors": false,
    "writing": false,
    "name": "Clin Genetics Elec",
    "fullname": "Clinical Genetics",
    "info": "Designed for students interested in clinical pediatrics and medicine as well as academic genetics. The student builds basic genetic skills by participating as a member of the combined medicine/pediatrics clinical genetics group at the Fairview-University Medical Center. The activities include weekly hospital rounds, genetics clinic and genetics conference, and hospital consultations when requested. The student evaluates patients with different types of genetic problems and discusses these cases fully. During the second three weeks of the rotation, the student is expected to prepare one topic for genetics conference. ",
    "prereq": {}
  },
  {
    "uid": "011369",
    "code": "MED7554",
    "subject": "MED",
    "number": "7554",
    "honors": false,
    "writing": false,
    "name": "Electrolyte Elec",
    "fullname": "Fluid Electrolyte Acid-Base Metabolism",
    "info": "The student serves as a member of a consulting team that evaluates patients with A/B and F/E abnormalities associated with a variety of medical and surgical diseases. Several tutorials are held each week. Topics of fluid and electrolytes, year 2, are reviewed and expanded upon with more advanced material and emphasis on clinical application. The student also participates in the regular activities of the nephrology consultation service. The student evaluates and follows patients with different disorders affecting the kidney; in particular those with acute and chronic renal failure with their attendant fluid and electrolyte problems.\n\nprereq: 7500 or instr consent",
    "prereq": {
      "or": [
        "011337"
      ]
    }
  },
  {
    "uid": "797525",
    "code": "MED7555",
    "subject": "MED",
    "number": "7555",
    "honors": false,
    "writing": false,
    "name": "Med Rural  Ambulatory Elective",
    "fullname": "Medicine Rural Ambulatory Elective",
    "info": "Out-patient practice of primary care internal medicine.",
    "prereq": {}
  },
  {
    "uid": "011371",
    "code": "MED7556",
    "subject": "MED",
    "number": "7556",
    "honors": false,
    "writing": false,
    "name": "Nephrology",
    "fullname": "Nephrology",
    "info": "This course is an exposure to Nephrology for medical students. Activities may include performing consultations in the inpatient setting, seeing patients in nephrology clinic, observing renal biopsies and attending case conferences and teaching conferences.",
    "prereq": {}
  },
  {
    "uid": "011381",
    "code": "MED7561",
    "subject": "MED",
    "number": "7561",
    "honors": false,
    "writing": false,
    "name": "Outptnt & Clinical Nephrology",
    "fullname": "Outpatient & Clinical Nephrology",
    "info": "Focus is on renal problems common to a community clinic and hospital practice. Renal clinics are held four days a week. Inpatient consultation is done daily. Didactic lectures are given. This experience is appropriate for the student interested in primary care.",
    "prereq": {}
  },
  {
    "uid": "011382",
    "code": "MED7562",
    "subject": "MED",
    "number": "7562",
    "honors": false,
    "writing": false,
    "name": "Nephrology",
    "fullname": "Nephrology",
    "info": "The student spends four weeks on the renal consult service. They attend the departmental teaching conferences, including the renal pathology and clinical nephrology conferences held every week. They work closely with the medicine residents and fellows. They are expected to present the cases for their patients, including clinical and lab data, and assessment of problems to the attending physician on rounds.",
    "prereq": {}
  },
  {
    "uid": "011497",
    "code": "MED7573",
    "subject": "MED",
    "number": "7573",
    "honors": false,
    "writing": false,
    "name": "Acute Care Elec",
    "fullname": "Acute Care Internal Medicine",
    "info": "This course provides an opportunity to acquire skills in the diagnosis and treatment of acute conditions encountered in internal medicine. The student works with attending physicians and medical residents to evaluate patients (including many with undiagnosed illnesses) in both the ER and urgent care on Monday through Friday (8:30 A.M. to 5:00 PM).  Learning is enhanced by a daily didactic curriculum.\n\nprereq: 7500, Med 7501",
    "prereq": {
      "and": [
        "011337",
        "011338"
      ]
    }
  },
  {
    "uid": "011388",
    "code": "MED7579",
    "subject": "MED",
    "number": "7579",
    "honors": false,
    "writing": false,
    "name": "Critical Care Elec",
    "fullname": "Critical Care/MICU",
    "info": "Evaluation of performance is based on abilities in eliciting a history, conducting an appropriate physical exam, use of lab and imaging studies, breadth and depth of knowledge base, differential diagnosis, formulation of a treatment program, verbal and written presentation, patient relationship, interaction with colleagues and other hospital staff, and on overall\nprofessionalism.\n\nprereq: 7501 or instr consent",
    "prereq": {
      "or": [
        "011338"
      ]
    }
  },
  {
    "uid": "011387",
    "code": "MED7582",
    "subject": "MED",
    "number": "7582",
    "honors": false,
    "writing": false,
    "name": "ICU Elec",
    "fullname": "Medical Intensive Care Unit--Regions Medical Center",
    "info": "Key principles of diagnosis/management of critical illness. Emphasizes cardiopulmonary assessment/management. Using mechanical ventilation, hemodynamic monitoring as focal points. One-month clinical rotation.",
    "prereq": {}
  },
  {
    "uid": "011389",
    "code": "MED7583",
    "subject": "MED",
    "number": "7583",
    "honors": false,
    "writing": false,
    "name": "Clin Oncology Elec",
    "fullname": "Fundamentals of Clinical Oncology",
    "info": "This multidisciplinary course provides an introduction to the fundamentals of clinical oncology (adult and pediatric) and is designed for the medical student interested in entering any specialty. Emphasis is placed on understanding important concepts of oncology, acquiring practical skills relevant to the diagnosis and treatment of the common malignancies, and gaining confidence in providing psychosocial support to patients and families. The student follows newly diagnosed patients as they go through\ntheir initial evaluation/staging tests for malignancy and participate in planning treatments. Approximately two hours a day is devoted to conferences and tutorial sessions developed specifically for the student enrolled in this course.\n\nprereq: 7500 or Ped 7501",
    "prereq": {
      "or": [
        "011337",
        "011612"
      ]
    }
  },
  {
    "uid": "011501",
    "code": "MED7595",
    "subject": "MED",
    "number": "7595",
    "honors": false,
    "writing": false,
    "name": "Musculoskeletal Elec",
    "fullname": "Musculoskeletal Problems in Primary Care Practice",
    "info": "The focus of this course is on the evaluation of various common musculoskeletal problems likely to be encountered in a primary care practice. Emphasis is placed on the proper musculoskeletal examination, basic joint aspiration and injection techniques, as well as developing better interpretive skills in reviewing laboratory values and bone/joint radiographs. In addition to attending patient clinics daily, the student is part of interactive conferences and didactic sessions covering various rheumatologic/medical orthopedic topics. Teaching methods include the use of patient instructors, videotapes, polarized microscopy, labeled skeleton, and computer teaching programs. The student works with full-time staff including Drs. Thomas Bloss, David Rhude, Peter Schlesinger, and the course director, Tom Stillman.\n\nprereq: 7500",
    "prereq": {
      "and": [
        "011337"
      ]
    }
  },
  {
    "uid": "011392",
    "code": "MED7596",
    "subject": "MED",
    "number": "7596",
    "honors": false,
    "writing": false,
    "name": "Occup Health Elec",
    "fullname": "Occupational Health",
    "info": "This course consists of conferences, clinical experience in occupational health, and optional visits to local workplaces. The conferences include a review of common occupational diseases and an introduction to occupational health law and policy through case presentations by students, and discussion with faculty and residents in occupational medicine. ",
    "prereq": {}
  },
  {
    "uid": "012187",
    "code": "MED7598",
    "subject": "MED",
    "number": "7598",
    "honors": false,
    "writing": false,
    "name": "Biomedical Ethics",
    "fullname": "Biomedical Ethics",
    "info": "In this independent study course, the student is expected to identify a particular health care ethics problem from either the clinical or public policy perspective.  Each student will write a substantive paper based upon their arranged practicum experience.",
    "prereq": {}
  },
  {
    "uid": "015963",
    "code": "MED7599",
    "subject": "MED",
    "number": "7599",
    "honors": false,
    "writing": false,
    "name": "Bioethics Theory",
    "fullname": "Bioethics Theory",
    "info": "In this independent study course, the student is expected to attend interdisciplinary seminars on basic issues in bioethics, and to write one substantive paper on a bioethical problem.\n\nprereq: Students must meet with instructor prior to enrolling in course",
    "prereq": {}
  },
  {
    "uid": "015964",
    "code": "MED7601",
    "subject": "MED",
    "number": "7601",
    "honors": false,
    "writing": false,
    "name": "Res Renal Dis and Hypertension",
    "fullname": "Research in Renal Diseases and Hypertension",
    "info": "This course addresses a research topic developed by the student and his/her preceptor. Topics include clinical and basic research problems in nephrology.  Faculty of the Division of Renal Diseases and Hypertension are available as preceptors for this course.",
    "prereq": {}
  },
  {
    "uid": "788168",
    "code": "MED7602",
    "subject": "MED",
    "number": "7602",
    "honors": false,
    "writing": false,
    "name": "Advanced Physical Diagnosis",
    "fullname": "Advanced Physical Diagnosis and Medical Decision Making",
    "info": "This course focuses on building upon the clinical skills learned in the first three years of medical school and incorporating an evidence-based approach to making high-value, patient-centered medical decisions. Students work with a variety of expert faculty to hone physical examination skills and learn critical article appraisal and presentation skills through small group work. Students will also gain an introduction to the use of point-of-care ultrasound as part of the physical examination.",
    "prereq": {}
  },
  {
    "uid": "808123",
    "code": "MED7603",
    "subject": "MED",
    "number": "7603",
    "honors": false,
    "writing": false,
    "name": "Palliative Medicine",
    "fullname": "Palliative Medicine",
    "info": "This hospital-based elective offers the opportunity to learn the scope of practice of Internal Medicine's newest subspecialty: palliative medicine. The student will function as a sub-intern under the direct supervision of board-certified hospice and palliative medicine physicians, caring for the broad range of problems managed by palliative medicine consultants.",
    "prereq": {}
  },
  {
    "uid": "794635",
    "code": "MED7604",
    "subject": "MED",
    "number": "7604",
    "honors": false,
    "writing": false,
    "name": "Ultrasound and Hospitalist Med",
    "fullname": "Ultrasound and Hospitalist Medicine",
    "info": "Students function as sub-interns under supervision of experienced hospitalists in caring for problems as primary caregiver/consultant. Care of hospitalized patients with broad mix of medical problems, in ICU/non-ICU settings. Students work with palliative medicine consult team in managing patients with advanced illness, care focused on pain management and complex medical decision making. Faculty present core topics in hospitalist/palliative medicine. Periodic topic presentations by students.",
    "prereq": {}
  },
  {
    "uid": "803491",
    "code": "MED7605",
    "subject": "MED",
    "number": "7605",
    "honors": false,
    "writing": false,
    "name": "Hospital Medicine Elective",
    "fullname": "Regions Hospital Hospital Medicine Elective",
    "info": "Students work alongside staff. Students choose from medicine inpatient service, surgical co-management service, hospital medicine palliative care team, progressive care unit, and evening admission team.\n\nprereq: 7500",
    "prereq": {
      "and": [
        "011337"
      ]
    }
  },
  {
    "uid": "798891",
    "code": "MED7607",
    "subject": "MED",
    "number": "7607",
    "honors": false,
    "writing": false,
    "name": "Global Health Course",
    "fullname": "Global Health Course",
    "info": "The entire course consists of a combination of in-person and online modules. Each module of the course has been designed as a stand-alone curriculum and may be taken independently of the other modules.",
    "prereq": {}
  },
  {
    "uid": "802522",
    "code": "MED7608",
    "subject": "MED",
    "number": "7608",
    "honors": false,
    "writing": false,
    "name": "Global Health Course",
    "fullname": "Global Health Course",
    "info": "Global health by systems (cardiology, GI, oncology). Tropical infectious diseases and public health. Refugee/migrant health. Cross cultural health care. Travel medicine. Topics for ASTMH certification. Case-based lectures, lab.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "797526",
    "code": "MED7666",
    "subject": "MED",
    "number": "7666",
    "honors": false,
    "writing": false,
    "name": "Med Peds Ambulatory Elective",
    "fullname": "Medicine Pediatrics Ambulatory Elective",
    "info": "Out-patient practice of primary care internal medicine and pediatrics.",
    "prereq": {}
  },
  {
    "uid": "803492",
    "code": "MED7700",
    "subject": "MED",
    "number": "7700",
    "honors": false,
    "writing": false,
    "name": "Primary Care Selective - Med",
    "fullname": "Primary Care Selective - Medicine",
    "info": "Four-week ambulatory experience. Focuses on both specialty-specific areas and process-of-care in ambulatory setting.",
    "prereq": {}
  },
  {
    "uid": "803493",
    "code": "MED7701",
    "subject": "MED",
    "number": "7701",
    "honors": false,
    "writing": false,
    "name": "Primary Care Selective - M/P",
    "fullname": "Primary Care Selective - Medicine/Pediatrics",
    "info": "Four-week ambulatory experience. Focuses on both specialty-specific areas and process-of-care in ambulatory setting.",
    "prereq": {}
  },
  {
    "uid": "811241",
    "code": "MED7703",
    "subject": "MED",
    "number": "7703",
    "honors": false,
    "writing": false,
    "name": "Patient Safety",
    "fullname": "Patient Safety",
    "info": "Two-week long elective incorporating reading, case analysis, consultation, simulation, presentations, projects in patient safety. Educate medical students at University of Minnesota in multidisciplinary patient safety principles/practices.",
    "prereq": {}
  },
  {
    "uid": "817894",
    "code": "MED7800",
    "subject": "MED",
    "number": "7800",
    "honors": false,
    "writing": false,
    "name": "Acting Intern IM Primary Care",
    "fullname": "Acting Internship Internal Medicine - Primary Care and Beyond",
    "info": "This course centers around 4 main areas:  Patient Care, “Hot Topics”, Advocacy and Self-Reflection.  PCB offers students the opportunity to hone their clinical skills via direct patient encounters in the outpatient setting.  ",
    "prereq": {}
  },
  {
    "uid": "820203",
    "code": "MED7850",
    "subject": "MED",
    "number": "7850",
    "honors": false,
    "writing": false,
    "name": "Acting Intern Internal Med",
    "fullname": "Acting Intern Internal Medicine",
    "info": "The Acting Internship in Internal Medicine is an opportunity for students to serve patients in a general inpatient setting. Acting internship students will take on the responsibility of an acting intern on the internal medicine inpatients team. They will collaborate with and medicine interns and medical students in their foundational training. They will be supervised by medicine senior residents and faculty attendings.\n\nprereq: Med 7500 or Med 7502 and Med 7503\n",
    "prereq": {
      "or": [
        "011337",
        "820012",
        "820013"
      ]
    }
  },
  {
    "uid": "814338",
    "code": "MED7900",
    "subject": "MED",
    "number": "7900",
    "honors": false,
    "writing": false,
    "name": "Sub-internship in Crit. Care",
    "fullname": "Sub-internship in Critical Care",
    "info": "Second part of the required 12 weeks of experience in internal medicine started in Medicine 7500. Medicine 7900 is a \"sub-internship\" in which the student takes direct responsibility for patient care. Therapeutic decision making and care planning are emphasized. The student is part of a patient care team and assumes responsibility for the evaluation and care of three new patients per week. Acute care tutorials with learning objectives and suggested readings are an important part of the course. Self-directed learning tools are available.",
    "prereq": {}
  },
  {
    "uid": "805673",
    "code": "MED7910",
    "subject": "MED",
    "number": "7910",
    "honors": false,
    "writing": false,
    "name": "Internal Medicine Residency",
    "fullname": "Internal Medicine Residency",
    "info": "Internal medicine residency.",
    "prereq": {}
  },
  {
    "uid": "805674",
    "code": "MED7920",
    "subject": "MED",
    "number": "7920",
    "honors": false,
    "writing": false,
    "name": "Medicine-Pediatric Residency",
    "fullname": "Medicine-Pediatric Residency",
    "info": "Medicine-pediatric residency.",
    "prereq": {}
  },
  {
    "uid": "805675",
    "code": "MED7930",
    "subject": "MED",
    "number": "7930",
    "honors": false,
    "writing": false,
    "name": "Internal Medicine Fellowship",
    "fullname": "Internal Medicine Fellowship",
    "info": "Internal medicine fellowship.",
    "prereq": {}
  }
]