[
  {
    "uid": "826866",
    "code": "MIMB6872",
    "subject": "MIMB",
    "number": "6872",
    "honors": false,
    "writing": false,
    "name": "Human Resource Management",
    "fullname": "Human Resource Management",
    "info": "Strategies for effective management. Analysis of cross-cultural differences in values, norms, practices. How they affect organizational behavior/performance. Implications for designing HR practices in multinational organizations/international contexts.",
    "prereq": {}
  },
  {
    "uid": "826867",
    "code": "MIMB6873",
    "subject": "MIMB",
    "number": "6873",
    "honors": false,
    "writing": false,
    "name": "Information Tech & Solutions",
    "fullname": "Information Systems and Information Resources Management",
    "info": "Current/emerging technologies in modern net-enhanced organizations. Internet/Web technologies, including internet fundamentals, web communications, web 2.0/social media, information security, cloud computing, IT-driven innovation, emerging IT trends.",
    "prereq": {}
  },
  {
    "uid": "826868",
    "code": "MIMB6874",
    "subject": "MIMB",
    "number": "6874",
    "honors": false,
    "writing": false,
    "name": "Accounting",
    "fullname": "Accounting",
    "info": "Basic principles of financial accounting, involving the consecution/interpretation of corporate financial statements.",
    "prereq": {}
  },
  {
    "uid": "826869",
    "code": "MIMB6875",
    "subject": "MIMB",
    "number": "6875",
    "honors": false,
    "writing": false,
    "name": "Organizational Behavior",
    "fullname": "Management and Organizational Behavior",
    "info": "Organizational behavior offers a framework for the systematic study of how people behave in organizational settings and involves individual, group, and organizational characteristics that affect people and their behavior at work. In this course we consider how individual workers respond to their job and organization (attitudes and motivation), interpersonal processes and how to make them more effective (decision making, conflict management, teamwork), and the role organizational culture in shaping individual and group behavior. Topics come together as we consider how to effectively lead organizational change. ",
    "prereq": {}
  },
  {
    "uid": "826870",
    "code": "MIMB6876",
    "subject": "MIMB",
    "number": "6876",
    "honors": false,
    "writing": false,
    "name": "Managerial Economics",
    "fullname": "Managerial Economics",
    "info": "Introduction to some parts of microeconomics that are useful for managers with attention to the circumstances that give rise to firm profitability. The first half of the course covers supply and demand, price elasticity, and market equilibrium. The second part of the course covers firms with differentiated products and market power with particular focus on pricing models such as segmentation, bundling, and two part tariffs. Pricing models involve profit maximization and associated conceptual tools. The course touches on game theory and strategic interaction among small numbers of firms and ends with a discussion of market failure and the business opportunities that they sometimes create. The course also emphasizes links to other parts of the core business curriculum. The course makes extensive reference to statistical empirical examples.",
    "prereq": {}
  },
  {
    "uid": "826871",
    "code": "MIMB6877",
    "subject": "MIMB",
    "number": "6877",
    "honors": false,
    "writing": false,
    "name": "Financial Management",
    "fullname": "Financial Management",
    "info": "This course is required for all MIMBA students because of the financial implications of decisions across all departments and disciplines in business. Managerial decisions can be broken down into two main categories: how to raise capital and how to employ capital. The decisions managers make in this context can add or destroy value. With this context in mind, the course provides students with an understanding of financial markets and the main types of securities that are issued by corporations. The course will leverage basic statistics in understanding of risk of a security as a stand-alone investment and as part of a well-diversified portfolio to provide an understanding of how risk affects required returns of investors. The course emphasizes the concept of time value of money as a basis for decision making. Managers make decisions that affect the cash flows of the firm; the course provides students with a context for thinking about forecasting cash flows, discounting cash flows, and assessing whether the decisions they are considering are value-added for the firm.",
    "prereq": {}
  },
  {
    "uid": "826874",
    "code": "MIMB6878",
    "subject": "MIMB",
    "number": "6878",
    "honors": false,
    "writing": false,
    "name": "Strategic Management",
    "fullname": "Strategic Management",
    "info": "This course focuses on the competitive strategy of the firm, examining how firms achieve and maintain superior profitability relative to their competitors in the long run, and the firm's role in building a more just and sustainable world. Starting from overall industry analysis, we cover how firms position themselves to succeed in various competitive contexts based on their resources and capabilities. We then analyze how firms innovate and adapt their capabilities over time, especially in the digital age. We extend our analysis to the scope choices of the firm and discuss how firms can successfully compete across multiple countries and businesses. Throughout the course, case discussions examine and simulate the process through which strategic decisions are made and carried out. Students are placed in the role of decision-makers and frequently asked to analyze the key choices they must make to define, reinforce, and successfully implement the firm's strategy.",
    "prereq": {}
  },
  {
    "uid": "826872",
    "code": "MIMB6879",
    "subject": "MIMB",
    "number": "6879",
    "honors": false,
    "writing": false,
    "name": "Anatomy & Physiology for Mgrs",
    "fullname": "Anatomy and Physiology for Managers",
    "info": "Overview of medical vocabulary/physiology of major body systems. Understanding current clinical practice. Market opportunities of major body systems and medical technology innovation.",
    "prereq": {}
  },
  {
    "uid": "819436",
    "code": "MIMB6881",
    "subject": "MIMB",
    "number": "6881",
    "honors": false,
    "writing": false,
    "name": "Marketing",
    "fullname": "Marketing",
    "info": "Management of the marketing function; understanding the basic foundational marketing concepts and skills in strategy development and planning of operational and strategic levels pertaining to product offering decisions, distribution channels, pricing and communication.",
    "prereq": {}
  },
  {
    "uid": "820339",
    "code": "MIMB6882",
    "subject": "MIMB",
    "number": "6882",
    "honors": false,
    "writing": false,
    "name": "Ethics and Leadership",
    "fullname": "Ethics and Leadership",
    "info": "This course has twin objectives: challenge participants to think about the ethical implications of the day-to-day conduct of business organizations; and explore how the relationship between corporate leaders and their followers can become mutually stimulating—raising them both to higher levels. It will focus on: ethics of corporate decisions; corporate social responsibility; corporate governance; sources of leadership power & influence; and leadership styles.",
    "prereq": {}
  },
  {
    "uid": "819437",
    "code": "MIMB6883",
    "subject": "MIMB",
    "number": "6883",
    "honors": false,
    "writing": false,
    "name": "Global Healthcare Marketplace",
    "fullname": "The Global Healthcare Marketplace",
    "info": "Survey of multitrillion dollar medical industry, this course covers physician and hospital services, insurance, pharmaceuticals, medical devices, information technology, and industry scale, interactions, opportunities, and barriers.",
    "prereq": {}
  },
  {
    "uid": "819438",
    "code": "MIMB6884",
    "subject": "MIMB",
    "number": "6884",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Industry",
    "fullname": "Pharmaceutical Industry",
    "info": "Focusing on the unique characteristics of the pharmaceutical industry, including its market, regulation, and policy issues, this course leverages interdisciplinary perspectives and industry leader involvement to develop student skill sets. This course is a joint venture of the Carlson School of Management and the College of Pharmacy at the University of Minnesota. In addition to academic faculty from these schools, the course also engages the participation of key leaders in the pharmaceutical industry and the health sector in general.",
    "prereq": {}
  },
  {
    "uid": "819439",
    "code": "MIMB6885",
    "subject": "MIMB",
    "number": "6885",
    "honors": false,
    "writing": false,
    "name": "IT in Health Care",
    "fullname": "Information Technology in Health Care",
    "info": "This course prepares future health service managers to harness the resources of the emerging health information age. The course will focus on 1) the theory and conceptual base for healthcare information technology (IT), 2) applications of current and developing health IT applications and 3) approaches to evaluate the effectiveness of health IT systems. This course provides a theoretical and conceptual base for managers, creators, and evaluators of healthcare information technology, including the application of current and evolving technology systems. Special attention is paid to the design and evaluation of common data structures.",
    "prereq": {}
  },
  {
    "uid": "819440",
    "code": "MIMB6886",
    "subject": "MIMB",
    "number": "6886",
    "honors": false,
    "writing": false,
    "name": "Med Tech Eval and Research",
    "fullname": "Medical Technology Evaluation and Market Research",
    "info": "Leaders from medical industry companies participate in this hands-on experience in creating a value proposition for new medical technologies.",
    "prereq": {}
  },
  {
    "uid": "819441",
    "code": "MIMB6887",
    "subject": "MIMB",
    "number": "6887",
    "honors": false,
    "writing": false,
    "name": "Medical Device Industry",
    "fullname": "Medical Device Industry",
    "info": "This course, with the insight of industry leaders, addresses public-private sector interactions and the business, public policy, regulatory, and technology management issues that concern medical device and biotechnology companies. This course covers the unique business, market, public policy, regulatory, and technology management issues of the medical device industry--including growing interaction and overlap with the pharmaceutical industry, biotechnology industry, information technology industry, and (more recently) wearable technology. Students successfully completing this course will understand: the historical development, importance, and future direction of the medical device industry; FDA issues, policies and strategies, public and private sector insurance coverage and reimbursement; interaction between public policies and private sector actions; intellectual property (IP) and liability issues concerning medical technology; and key issues relating to the start-up and management of new medical technology firms.",
    "prereq": {}
  },
  {
    "uid": "819442",
    "code": "MIMB6888",
    "subject": "MIMB",
    "number": "6888",
    "honors": false,
    "writing": false,
    "name": "R&D of Medical Technology",
    "fullname": "Research and Development of Medical Technology",
    "info": "Understand the production healthcare research and development that exist to analyze how the components along the care continuum, currently fit together and more importantly explore how they can be reconfigured and re-engineered to create value.",
    "prereq": {}
  },
  {
    "uid": "819443",
    "code": "MIMB6889",
    "subject": "MIMB",
    "number": "6889",
    "honors": false,
    "writing": false,
    "name": "Law and Intellectual Property",
    "fullname": "Health Law and Intellectual Property Strategy",
    "info": "This course will survey fundamental healthcare laws that apply to a wide variety of healthcare businesses, and will assess their impact on those business’s strategy and operations. The goal is to enable current and prospective managers and leaders in the healthcare space to be aware of and thus able to proactively manage potential legal issues. Intellectual property as a core tenant of medical innovation will be a focus of the class.",
    "prereq": {}
  },
  {
    "uid": "819444",
    "code": "MIMB6890",
    "subject": "MIMB",
    "number": "6890",
    "honors": false,
    "writing": false,
    "name": "Data Driven Project Work",
    "fullname": "Data Driven Project Work",
    "info": "This course is designed to provide students with an understanding of and an ability to apply exploratory data analysis, basic inferential procedures, and regression in a generic industry as well as medical industry and healthcare management setting.",
    "prereq": {}
  },
  {
    "uid": "820340",
    "code": "MIMB6891",
    "subject": "MIMB",
    "number": "6891",
    "honors": false,
    "writing": false,
    "name": "Med. Industry Valuation Lab",
    "fullname": "Medical Industry Valuation Laboratory",
    "info": "Hands on experience in succinctly evaluating the value of a new technology by considering market size and potential, intellectual property, and return on investment. Intercollegiate teams create rapid production market analysis of promising medical technologies and services to determine potential for success in market. Exposure to University innovations, venture firms, inventors. The Medical Industry Valuation Laboratory will produce medical innovation valuations for clients for high value economic development and professional training purposes using an interdisciplinary team of faculty, students, and industry leaders.",
    "prereq": {}
  },
  {
    "uid": "819445",
    "code": "MIMB6892",
    "subject": "MIMB",
    "number": "6892",
    "honors": false,
    "writing": false,
    "name": "MIMBA Tuition - 1st Half",
    "fullname": "MIMBA Tuition - 1st Half",
    "info": "Course created for purpose of charging tuition. Half of the cost of tuition is charged upfront and nonrefundable before the first year, and half before the second year.",
    "prereq": {}
  },
  {
    "uid": "819446",
    "code": "MIMB6893",
    "subject": "MIMB",
    "number": "6893",
    "honors": false,
    "writing": false,
    "name": "MIMBA Tuition 2nd Half",
    "fullname": "MIMBA Tuition 2nd Half",
    "info": "Course created for purpose of charging tuition. Half of the cost of tuition is charged upfront and nonrefundable before the first year, and half before the second year.",
    "prereq": {}
  },
  {
    "uid": "826635",
    "code": "MIMB6894",
    "subject": "MIMB",
    "number": "6894",
    "honors": false,
    "writing": false,
    "name": "Supply Chain and Operations",
    "fullname": "Supply Chain and Operations",
    "info": "Supply chain and operations are at the core of how organizations deliver value to their customers. Effectively matching supply and demand is key to the success of any organization and world-class operations can lead to a significant and enduring competitive advantage. In contrast, poorly managed operations and supply chains can result in low customer satisfaction and diminished profit margins, ultimately leading to company failure in the long run. The specific questions this course will address include:  How can supply chain and operations help firms succeed? What are the issues and trade-offs confronting supply chain and operations managers?",
    "prereq": {}
  },
  {
    "uid": "826636",
    "code": "MIMB6895",
    "subject": "MIMB",
    "number": "6895",
    "honors": false,
    "writing": false,
    "name": "Data Analysis",
    "fullname": "Data Analysis",
    "info": "The medical industry generates and uses one of the largest collection of digital data of any market sector. Concepts/ principles of business statistics, data analysis, and presentation of results will be examined in this course. Our topics include: exploratory data analysis and graphics, basic inferential procedures including estimation and hypothesis testing, correlation, bivariate and multiple regression analysis, forecasting and predictive modeling using regression, and introduction to the design of experiments. These methods are selected for their relevance to managerial decision making and problem solving.",
    "prereq": {}
  }
]