[
  {
    "uid": "826604",
    "code": "MKTG1011",
    "subject": "MKTG",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Art & Science of Storytelling",
    "fullname": "The Art and Science of Storytelling",
    "info": "Abraham Lincoln professed that, ?People are more influenced and informed through a story than in any other way.? This course is part storytelling workshop and part communication science. Focusing on the popular ?Moth? style of storytelling, students will unearth personal stories. They will receive coaching as they develop their stories and then practice sharing them in a supportive space. This course will build confidence in public speaking and enable students to become more compelling communicators. ",
    "prereq": {}
  },
  {
    "uid": "818155",
    "code": "MKTG1916",
    "subject": "MKTG",
    "number": "1916",
    "honors": false,
    "writing": false,
    "name": "Brands and Storytelling",
    "fullname": "Happily Ever After: Brands and Storytelling in Ireland",
    "info": "Since the beginning of time, human beings have been captivated by stories. Stories engage, persuade, and motivate. Storytelling is widely used in business. In marketing, some of the strongest brands leverage their heritage; others have powerful origin or founder stories at their core. Advertisers routinely employ storytelling techniques as a way to attract a customer's attention and keep it. Ireland is a country with a rich storytelling tradition. Irish culture, history, and music abound with myth, lore, and legend. This course is intended to explore the components of effective storytelling and the many methods of storytelling including written, oral, music, film, and digital media to investigate the role of storytelling in business and culture.\n\nNOTES:\nThis course involves a study abroad component to Ireland during Spring Break 2019. Please note that you must also apply and confirm your spot for this seminar through the Learning Abroad Center. For more information, visit: https://umabroad.umn.edu/programs/europe/brands-story-ireland/ or contact Amy at garw0005@umn.edu.",
    "prereq": {}
  },
  {
    "uid": "819949",
    "code": "MKTG1918",
    "subject": "MKTG",
    "number": "1918",
    "honors": false,
    "writing": false,
    "name": "Happiness in Consumption",
    "fullname": "Finding Happiness In The Age Of Consumption",
    "info": "In today’s culture of consumption, free choice, and materialism, the pursuit of happiness through the “good life” seems to be an attainable goal. Retail therapy uplifts our spirits. Finding the best deals gives us a sense of accomplishment. Online shopping makes it ever so easy to instantly gratify our desires. Enjoyment through food, travel, and novel experiences is more accessible than ever. A wide variety of entertainment and social connections are available, literally, at the tip of our fingers. Still, we feel empty, wanting, and dissatisfied time and again. We continue to experience boredom, unhappiness, and loneliness. Why this paradox? This question has spurred recent research in consumer behavior, decision making, and psychology. \nIn this seminar, we will explore some of the latest scientific findings as well as selected perspectives from ancient philosophy to help us understand this phenomenon and build a happier and better life. We will tackle questions such as, how can we experience more happiness in our lives? Can we increase the level of enjoyment we experience through our consumption activities? How can we make happiness last longer? What are some effective ways of reducing boredom and dealing with negative emotions? How can we increase our wellbeing through our daily work and activities in college? Most importantly, we will develop a tool kit to help us on our journey to happiness and success. \n",
    "prereq": {}
  },
  {
    "uid": "013127",
    "code": "MKTG3001",
    "subject": "MKTG",
    "number": "3001",
    "honors": false,
    "writing": false,
    "name": "Principles  of Mktg",
    "fullname": "Principles of Marketing",
    "info": "Introduction to terms, concepts, and skills for analyzing marketing problems. Factors outside the organization affecting its product, pricing, promotion, and distribution decisions. Cases from actual organizations.\n\nprereq: ECON 1101 or ECON 1165",
    "prereq": {
      "or": [
        "009920",
        "825772"
      ]
    }
  },
  {
    "uid": "816784",
    "code": "MKTG3005",
    "subject": "MKTG",
    "number": "3005",
    "honors": false,
    "writing": false,
    "name": "Analytical Tools for Bus Probs",
    "fullname": "Introduction to Applying Analytical Tools for Solving Business Problems",
    "info": "The ability to make intelligent business decisions based on large data and information is becoming increasingly important for businesses and managers. This course provides a practitioner-oriented introduction of applying analytical tools in business setting. This class entails hands-on computer exercises on real data sets to apply various analytical techniques in common business applications. This course assumes that students have knowledge of fundamental analytical tools and statistical methods. The class emphasizes understanding model assumptions to help students with appropriate model selection; interpreting results in order to make optimal business decisions; designing experiments in a business setting and analyzing the experimental data to advance business objectives.\n\nprereq: SCO 2550 or equivalent statistics course",
    "prereq": {}
  },
  {
    "uid": "013768",
    "code": "MKTG3011",
    "subject": "MKTG",
    "number": "3011",
    "honors": false,
    "writing": false,
    "name": "Marketing Research",
    "fullname": "Marketing Research",
    "info": "This course focuses on managing the entire marketing research process, which involves collecting and analyzing relevant, timely, and accurate information to gain customer insights and drive effective marketing decision making. Students learn fundamental techniques of data collection and analysis to solve specific marketing problems. The class offers hands-on learning-by-doing opportunities through group projects for students to practice every stage of marketing research. \n\nprereqs: 3001 and BA 2551 or SCO 2550 or equivalent statistics course\n\n",
    "prereq": {
      "or": [
        "013127",
        "013805"
      ]
    }
  },
  {
    "uid": "013775",
    "code": "MKTG3041",
    "subject": "MKTG",
    "number": "3041",
    "honors": false,
    "writing": false,
    "name": "Buyer Behavior",
    "fullname": "Buyer Behavior",
    "info": "Application of behavioral sciences to buyer behavior. Perception, attitudes, learning, persuasion, motivation, decision-making, social/cultural influences, managerial implications.\n\nprereq: 3001",
    "prereq": {
      "and": [
        "013127"
      ]
    }
  },
  {
    "uid": "016620",
    "code": "MKTG3111",
    "subject": "MKTG",
    "number": "3111",
    "honors": false,
    "writing": false,
    "name": "Principles of Mktg",
    "fullname": "Principles of Marketing",
    "info": "Introduction to terms, concepts, and skills useful in analyzing marketing problems. Factors outside the organization affecting its product, pricing, promotion, and distribution decisions. Cases from actual organizations. Written marketing plan, done individually or as a team.",
    "prereq": {}
  },
  {
    "uid": "013773",
    "code": "MKTG4020",
    "subject": "MKTG",
    "number": "4020",
    "honors": false,
    "writing": false,
    "name": "Adv. Logistics",
    "fullname": "Advanced Logistics and Supply Chain Management",
    "info": "Flow of physical product through channels of distribution. Linkages between controlling physical flows and major functions of firm (e.g., finance, marketing, operations). Emphasizes organizing interactions between firms, developing an integrative supply chain management strategy.",
    "prereq": {}
  },
  {
    "uid": "013774",
    "code": "MKTG4031",
    "subject": "MKTG",
    "number": "4031",
    "honors": false,
    "writing": false,
    "name": "Sales Management",
    "fullname": "Sales Management",
    "info": "Hiring, motivating, performance enhancement. Customer relationship management, data analysis, quantitative methods. Developing metrics to evaluate individual/group performance in attaining an organization's strategic goals.\n\nprereq: MKTG 3040 or 3041",
    "prereq": {
      "or": [
        "013775"
      ]
    }
  },
  {
    "uid": "013776",
    "code": "MKTG4051",
    "subject": "MKTG",
    "number": "4051",
    "honors": false,
    "writing": false,
    "name": "Advertising and Promotion",
    "fullname": "Advertising and Promotion",
    "info": "Managing/integrating communication aspects of marketing. Advertising, sales promotion, public relations. Setting objectives, selecting media. Measuring effectiveness. Sales promotion techniques. Issues in global IMC.\n\nprereq: MKTG 3011 and MKTG 3041 (or 3010 & 3040) or instructor approval",
    "prereq": {
      "or": [
        "013768",
        "013775"
      ]
    }
  },
  {
    "uid": "013777",
    "code": "MKTG4061",
    "subject": "MKTG",
    "number": "4061",
    "honors": false,
    "writing": false,
    "name": "Marketing Channels",
    "fullname": "Marketing Channels",
    "info": "Today, a brand’s marketing channel strategy directly impacts its brand value. And if designed properly, a channel strategy acts as a key differentiator for any organization. In this class, we will study how to select the right channel partners, and properly motivate their actions. We will also explore the connections between marketing channels and supply chains.  By the end of the course you will see how organizations create significant brand value via their marketing channels.  \n\nprereq: MKTG 3011 and MKTG 3041 (or 3010 & 3040) or instructor approval ",
    "prereq": {
      "or": [
        "013768",
        "013775"
      ]
    }
  },
  {
    "uid": "013778",
    "code": "MKTG4070",
    "subject": "MKTG",
    "number": "4070",
    "honors": false,
    "writing": false,
    "name": "International Mktg",
    "fullname": "International Marketing",
    "info": "Managing international marketing functions. Identifying marketing-based international business opportunities; understanding cultural factors in buyer behavior, constructing and evaluating global and culturally adjusted marketing strategies.",
    "prereq": {}
  },
  {
    "uid": "816782",
    "code": "MKTG4072",
    "subject": "MKTG",
    "number": "4072",
    "honors": false,
    "writing": false,
    "name": "Marketing-in-Action: Practicum",
    "fullname": "Marketing-in-Action: Marketing Practicum",
    "info": "This course focuses on what marketers do in real-life. Each week begins with guidance on approaching a typical task, then developing recommendations by working in groups during class with ongoing feedback from the instructor, and concluding with a short presentation. Weekly topics may include identifying marketing challenges (ala Shark Tank), segmenting customers, pricing a product, and developing an advertising plan. The course concludes with a multi-week, interactive simulation in which students compete in groups as they manage a product.\n\nprereq: MKTG 3001 and BA 2551 or SCO 2550 or equivalent statistics course",
    "prereq": {
      "or": [
        "013127",
        "013805"
      ]
    }
  },
  {
    "uid": "816783",
    "code": "MKTG4074",
    "subject": "MKTG",
    "number": "4074",
    "honors": false,
    "writing": false,
    "name": "Data-Driven Marketing",
    "fullname": "Data-Driven Marketing",
    "info": "This course emphasizes various analytical techniques and statistical models with hands-on applications of marketing data and software tool kits. The course will cover classic marketing topics such as segmentation, positioning, new product development, advertising, and pricing. It will focus on how to choose and apply the most effective statistical tool to analyze questions on marketing topics and then translate the information from analysis into data-driven decisions. The goal is to increase students' comfort level of analyzing large marketing databases and help understand how a scientific approach can enhance marketing decision making by converting data into insights.\n\nprereq: Mktg 3011 (or 3010)",
    "prereq": {
      "and": [
        "013768"
      ]
    }
  },
  {
    "uid": "818308",
    "code": "MKTG4076",
    "subject": "MKTG",
    "number": "4076",
    "honors": false,
    "writing": false,
    "name": "Digital Marketing",
    "fullname": "Digital Marketing",
    "info": "The Internet and digital technologies have continued to alter the way consumers search information, make transactions, and share experiences, as well as the way firms market towards and engage with consumers. In today's digital era, it is imperative for marketers to understand how to gain a competitive edge by leveraging digital media to set targeting strategies and implement the marketing mix. This course will provide a structured framework to introduce students to the most up-to-date tactics, applications, and trends in digital marketing. The course is organized around three main sections developed by the instructor:\n\n- Internet marketing, which explores the impact of Internet on (1) consumer behaviors and (2) advertising\nstrategies.\n- Social marketing, which focuses on (1) the formation of online social networks and (2) social media\nanalytics.\n- Mobile marketing, which examines (1) location-based targeting and (2) the management of omni-channel\nmarketing.\n\nprereq: Mktg 3011 (or 3010)",
    "prereq": {
      "and": [
        "013768"
      ]
    }
  },
  {
    "uid": "013779",
    "code": "MKTG4081W",
    "subject": "MKTG",
    "number": "4081",
    "honors": false,
    "writing": true,
    "name": "Marketing Strategy",
    "fullname": "Marketing Strategy",
    "info": "Determining product markets where organizations should compete based on ability to create/maintain competitive advantage. External environment of business. Constructing/evaluating global marketing strategies. Largely case-based. This is the capstone course in the Marketing major. \n\nprereq: Mktg 3011, Mktg 3041, (or Mktg 3010 & Mktg 3040) and 8 Mktg elective credits",
    "prereq": {
      "and": [
        "013768",
        "013775"
      ]
    }
  },
  {
    "uid": "802444",
    "code": "MKTG4082W",
    "subject": "MKTG",
    "number": "4082",
    "honors": false,
    "writing": true,
    "name": "Brand Management",
    "fullname": "Brand Management",
    "info": "How do firms build great brands, such as Apple and Nike? How do firms leverage their popular brands to expand into new markets, new products, and new countries? This course focuses on questions like these to help students understand how to use brand strategies to successfully build, measure, and manage brands. Students participate in a course-long project to research and evaluate brand strategies used by a brand of their choosing. The course includes lectures, cases, and project check-ins between group members and their instructor. \n\nprereq: Mktg 3010/3011 and Mktg 3040/3041",
    "prereq": {
      "or": [
        "013768",
        "013775"
      ]
    }
  },
  {
    "uid": "817690",
    "code": "MKTG4085",
    "subject": "MKTG",
    "number": "4085",
    "honors": false,
    "writing": false,
    "name": "Nudge: Improving Decisions",
    "fullname": "Nudge: Improving Decisions about Health, Wealth, and Happiness",
    "info": "People do surprising and funny things. Business leaders, policy makers, and scientists long have been interested in why people do what they do, and for a long time that interest has fallen under the rubric of a \"rational man\" model. It is now clear that the rational model is imperfect, at best. This course takes a look at the less rational side of life, studying the shortcuts, the low road, and the error-prone processes that enable people to feel, decide, and act efficiently--despite costs to rationality. For most of the past 200 years, most of what organizations, politicians, and well-meaning people did in order to make consumers change their behavior consisted of what might be called \"shoves\"--heavy-handed, choice-restricting, highly-incentivized, information-dense treatments that basically told consumers what to do (or else!). Those, by and large, do not work. Not only do they not work, but they are also costly and can even make the unwanted behavior emerge even more than before the shove by creating boomerang or counterproductive effects. prereq: MKTG 3001",
    "prereq": {
      "and": [
        "013127"
      ]
    }
  },
  {
    "uid": "826785",
    "code": "MKTG4086",
    "subject": "MKTG",
    "number": "4086",
    "honors": false,
    "writing": false,
    "name": "Pursuit of Happiness",
    "fullname": "Pursuit of Happiness in the Age of Consumption",
    "info": "Much of consumption behavior is prompted by the pursuit of happiness. In today’s culture of consumption, free choice, and materialism, the pursuit of happiness through the “good life” seems to be an attainable goal. Retail therapy uplifts our spirits. A wide variety of entertainment and social connections are available, literally, at the tip of our fingers. Still, the happiness we experience is short-lived at best. We continue to experience boredom, unhappiness, and loneliness. Why this paradox? This question has spurred recent research in consumer behavior, decision making, and psychology.\n\nIn this course, we will explore some of the latest scientific findings as well as selected perspectives from philosophy to help us understand this phenomenon and build a better life.  We will tackle questions such as, how can we increase the level of enjoyment we experience through our consumption activities? How can we make positive emotions last longer?  How can we better manage negative emotions? What are some effective ways of reducing boredom? How can we increase our wellbeing through our daily consumption and other activities? How can we, as marketers, enhance the wellbeing of our consumers? \n\nThe course will rely heavily on scientific research from consumer behavior, decision making, psychology, and neuroscience. It will also incorporate some elements of Eastern and Western philosophy. Through a mix of lecture, videos, readings, reflections, and exercises, we will engage in meaningful discussion of the topics, and develop a toolkit to help us on our journey to joy.",
    "prereq": {}
  },
  {
    "uid": "013780",
    "code": "MKTG4090",
    "subject": "MKTG",
    "number": "4090",
    "honors": false,
    "writing": false,
    "name": "Marketing Topics",
    "fullname": "Marketing Topics",
    "info": "Selected topics and problems of current interest considered in depth. Class discussion and course projects.",
    "prereq": {}
  },
  {
    "uid": "014155",
    "code": "MKTG6020",
    "subject": "MKTG",
    "number": "6020",
    "honors": false,
    "writing": false,
    "name": "Adv Logistics",
    "fullname": "Advanced Logistics and Supply Chain Management",
    "info": "Analyzes flow of physical product through channels of distribution. Linkages between process of controlling physical flows, major functions of firm (e.g., finance, marketing, operations). Managing logistical interactions between firms to develop integrative supply chain management strategy. Simulation exercise.\n\nprereq: MBA 6210, MBA student",
    "prereq": {}
  },
  {
    "uid": "014156",
    "code": "MKTG6051",
    "subject": "MKTG",
    "number": "6051",
    "honors": false,
    "writing": false,
    "name": "MKTG Research-Rapid Insights",
    "fullname": "Marketing Research - Rapid Insights",
    "info": "Focus on developing rapid and actionable insights, by learning to form testable hypotheses, collect relevant data quickly, and perform fundamental analytics. Techniques will include survey design, sample design, online data collection, descriptive statistics, and tests for statistical significance. By the end of class, students will be able to provide convincing recommendations for common marketing and analytics-driven decisions.\n\nprereq: MBA 6210/6211, MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "816819",
    "code": "MKTG6052",
    "subject": "MKTG",
    "number": "6052",
    "honors": false,
    "writing": false,
    "name": "MKTG Analytics: Mgrl Decisions",
    "fullname": "Marketing Analytics: Managerial Decisions",
    "info": "Modern marketers use data to drive decisions. This course teaches students a suite of statistics analytic tools to make strategic decisions. Focusing on learning how to apply specific analytic tools to different managerial challenges, students will learn how to leverage data to perform market analyses, segmentation and targeting, customer value assessment, brand management, new product development, among other tasks. Students will be able to apply the learned skills to their work immediately to produce data-driven insights and develop strategic recommendations. The course is also helpful for students who are interested in STEM to improve their stats modeling and other relevant skills. ",
    "prereq": {}
  },
  {
    "uid": "014163",
    "code": "MKTG6055",
    "subject": "MKTG",
    "number": "6055",
    "honors": false,
    "writing": false,
    "name": "Buyer Behavior",
    "fullname": "Buyer Behavior",
    "info": "This course provides a deep understanding of consumer motivation and psychology to predict behavior in the marketplace. It covers both rational and irrational influences that impact consumers at different stages of the decision-making process. The course gives students the tools to provide insightful, data-driven recommendations by thoroughly understanding the customer.\n\nprereq: MBA 6210/6211, MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "014164",
    "code": "MKTG6062",
    "subject": "MKTG",
    "number": "6062",
    "honors": false,
    "writing": false,
    "name": "Marketing Channels",
    "fullname": "Marketing Channels",
    "info": "This class focuses on designing go-to-market routes that align with customer purchase journeys, including the selection of channel partners, and fashioning the right channel incentives. We will pay particular attention to contemporary challenges arising from channel fragmentation and addition of online routes-to-market.\n\nprereq: MBA 6210/6211, MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "790667",
    "code": "MKTG6065",
    "subject": "MKTG",
    "number": "6065",
    "honors": false,
    "writing": false,
    "name": "Strategic Supply Chain Mgmt",
    "fullname": "Strategic Supply Chain Management",
    "info": "Internal/inter-organizational design, strategic sourcing, alliances/partnerships, impact of technology on supply chain effectiveness. Managing flows, creating/sharing customer value, measuring competitive impact from supply chain excellence.\n\nprereq: [6060 or OMS 6056, or IDSc 6442 or IDSc 6423], 2nd yr MBA student",
    "prereq": {
      "or": [
        "016581",
        "789844"
      ]
    }
  },
  {
    "uid": "014166",
    "code": "MKTG6072",
    "subject": "MKTG",
    "number": "6072",
    "honors": false,
    "writing": false,
    "name": "International Mktg",
    "fullname": "International Marketing",
    "info": "Today’s explosion in global e-commerce and logistics networks means most organizations now face an opportunity to broaden their customer bases and strengthen their brands. At the same time, these firms may face a new set of global competitors including state-supported, foreign companies, or current competitors who have transformed into global marketers. This case-based course arms the learner with a set of frameworks to adapt and lead in today’s global marketing arena. The course culminates in a student-designed, real-world, “Glocal” marketing plan that launches an offering into an international market. \n\nprereq: MBA 6210/6211, MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "790668",
    "code": "MKTG6073",
    "subject": "MKTG",
    "number": "6073",
    "honors": false,
    "writing": false,
    "name": "MKTG in High Tech Settings",
    "fullname": "Marketing in High Tech Settings",
    "info": "This class will focus on contemporary markets where the products and services are built on a significant base of intellectual property. Using cases and readings, we will examine major issues such as a) diffusion of multiple generations (e.g., iPhone 7 8, 10. etc.), b) backwards and forward compatibility choices (e.g., Windows XP, 7 and 10), c) revenue model decisions (e.g., license a drug patent versus launching the realized drug) and d) user-centered design (e.g., Nest versus Honeywell thermostats).\n\nprereq:  MBA 6211 (or MBA 6210 pre-F22) or equiv; MBA student or dept consent",
    "prereq": {
      "or": [
        "014152",
        {
          "or": [
            "792587"
          ]
        }
      ]
    }
  },
  {
    "uid": "014168",
    "code": "MKTG6074",
    "subject": "MKTG",
    "number": "6074",
    "honors": false,
    "writing": false,
    "name": "Prod,Serv Policy",
    "fullname": "Product and Service Policy",
    "info": "Product, service line management. Modifying lines, adding to lines through new product development. Product/brand management organizational structure.",
    "prereq": {}
  },
  {
    "uid": "014170",
    "code": "MKTG6075",
    "subject": "MKTG",
    "number": "6075",
    "honors": false,
    "writing": false,
    "name": "Pricing Strategy",
    "fullname": "Pricing Strategy",
    "info": "Marketing begins and ends with the buyer. A marketing perspective on Pricing Strategy focuses on the study of delivering value to buyers in a manner that exceeds the value proposition of marketplace rivals, using both internal and external resources. The purpose of this course is to present a framework and provide analytical tools that can help you handle these pricing challenges. From determining consumer needs to assuring customer satisfaction, a clear understanding of buyer behavior is critical to the successful formulation and implementation of pricing strategy. The profitability of Pricing strategies that account for the competitive environment and the role of collaborators whose interests are aligned with that of the organization are an integral over-arching umbrella that informs the course. There are a wealth of analytical tools used in pricing ranging from Economic Value Analysis, to Break-Even Analysis, to estimation of Demand and Elasticity, to Customer Lifetime Value analyses, to game theoretic analyses of competitive dynamics. This course is designed to provide prospective managers the intellectual and analytical tools necessary to design actionable pricing strategies. There will be a strong emphasis on managerial action, and multiple theoretical perspectives will be discussed.\n\nprereq: MBA 6210/6211, MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "014175",
    "code": "MKTG6076",
    "subject": "MKTG",
    "number": "6076",
    "honors": false,
    "writing": false,
    "name": "Sales Management",
    "fullname": "Sales Management",
    "info": "Management of personal selling. Sales force organization, effort allocation, personnel selection, motivation, compensation, performance evaluation.",
    "prereq": {}
  },
  {
    "uid": "014177",
    "code": "MKTG6078",
    "subject": "MKTG",
    "number": "6078",
    "honors": false,
    "writing": false,
    "name": "Advertising & Promotion",
    "fullname": "Advertising & Promotion",
    "info": "Managing communication. Advertising, sales promotion, public relations, direct marketing. Setting communications objectives and budgets, media selection, creative strategy, sales promotion techniques.\n\nprereq: MBA 6210",
    "prereq": {}
  },
  {
    "uid": "789464",
    "code": "MKTG6080",
    "subject": "MKTG",
    "number": "6080",
    "honors": false,
    "writing": false,
    "name": "Internet Marketing",
    "fullname": "Internet Marketing",
    "info": "Concepts, processes, decisions associated with marketing through the Internet. Emphasizes profitability. Customer persuasion, building a customer base digitally, pricing, customer retention, channel/distribution issues.\n\nprereq: MBA 6210, MBA student",
    "prereq": {}
  },
  {
    "uid": "790669",
    "code": "MKTG6082",
    "subject": "MKTG",
    "number": "6082",
    "honors": false,
    "writing": false,
    "name": "Brand Strategy",
    "fullname": "Brand Strategy",
    "info": "Leaders now realize that brands are one of the most valuable assets they possess. Those leaders who can successfully build, leverage, and protect brands are highly sought after. And today’s brand principles must apply to product branding, personal branding, service branding, place branding, online branding, co-branding, and luxury branding. This course provides learners with frameworks and practical brand knowledge to launch and leverage successful brands in all these disciplines. \n\nprereq: MBA 6210/6211, MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "819820",
    "code": "MKTG6083",
    "subject": "MKTG",
    "number": "6083",
    "honors": false,
    "writing": false,
    "name": "Customer Analytics",
    "fullname": "Customer Analytics",
    "info": "Customer Analytics addresses how to use data to learn about and market to individual customers. Marketing is evolving from an art to a science. Many firms have extensive data about consumers' choices and how they react to marketing campaigns, but few firms have the expertise to intelligently act on such information. In this course, students will learn the scientific approaches to analyze and act on customer information. While students will employ quantitative methods in the course, the goal is not to produce experts in statistics; rather, students will gain the competency and working experience to interact with and manage a marketing analytics team. Students gain a working knowledge of linear regression, logit analysis, RFM analysis, tools for market forecasting, pricing optimization, behavior targeting and an introduction to machine learning, recommendations systems, and digital analytics. The course uses a combination of lectures, cases, and exercises to learn the material. This course takes a hands-on approach with real-world databases and equips students with tools that can be used immediately on the job.",
    "prereq": {}
  },
  {
    "uid": "812609",
    "code": "MKTG6084",
    "subject": "MKTG",
    "number": "6084",
    "honors": false,
    "writing": false,
    "name": "Persuasion and Influence",
    "fullname": "Persuasion and Influence",
    "info": "Successful marketers, leaders and communicators must not only make the right decisions-they must also influence others. Successfully managing other people depends on managing the influence process. Doing this effectively requires understanding the psychology of persuasion. This course is about the science of influence & persuasion. Through deeper understanding of human psychology, you will learn scientifically-tested and practical tools to become more influential in your dealings with consumers, clients, coworkers, & managers. Through a mix of lecture, discussion, reading, reflection, and experiential exercises, you will master the tools to be able to mobilize others by strategically crafting your communications.\n\nprereq: MBA 6210/6211, MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "815447",
    "code": "MKTG6085",
    "subject": "MKTG",
    "number": "6085",
    "honors": false,
    "writing": false,
    "name": "Nudge: Improving Decisions",
    "fullname": "Nudge: Improving Decisions about Health, Wealth and Happiness",
    "info": "People do surprising and funny things. Business leaders, policy makers, and scientists long have been interested in why people do what they do, and for a long time that interest has fallen under the rubric of a \"rational man\" model. It is now clear that the rational model is imperfect, at best. This course takes a look at the less rational side of life, studying the shortcuts, the low road, and the error-prone processes that enable people to feel, decide, and act efficiently--despite costs to rationality.\nFor most of the past 200 years, most of what organizations, politicians, and well-meaning people did in order to make consumers change their behavior consisted of what might be called \"shoves\"--heavy-\nhanded, choice-restricting, highly-incentivized, information-dense treatments that basically told consumers what to do (or else!). Those, by and large, do not work. Not only do they not work, they are costly and can even make the unwanted behavior emerge even more than before the shove by creating boomerang or counterproductive effects.",
    "prereq": {}
  },
  {
    "uid": "815448",
    "code": "MKTG6086",
    "subject": "MKTG",
    "number": "6086",
    "honors": false,
    "writing": false,
    "name": "Digital Marketing",
    "fullname": "Digital Marketing",
    "info": "Marketing practices have dramatically shifted with the rise of social media and the proliferation of devices, platforms, and applications. This rapidly changing environment presents new opportunities and challenges for marketers. Through a combination of case studies, best practice examples, current news items, and assignments, students learn how the elements of a digital strategy work together with traditional media to attract prospective customers. Specifically, students learn best practices for social media marketing, content marketing, organic and paid search, search engine optimization, e-mail marketing, landing pages and display advertising. Students discuss strategies for reputation management in a world where information is disseminated virally and discover how social media monitoring and data analysis can be used to improve marketing and product development activities. The importance of establishing digital marketing goals and analytics is covered as well as how to measure return on investment for digital activities.  Additional focus on analytics through certification assignments, in google analytics and ad search. Exploration of return on marketing measurement and evaluation of digital tactics.",
    "prereq": {}
  },
  {
    "uid": "818835",
    "code": "MKTG6087",
    "subject": "MKTG",
    "number": "6087",
    "honors": false,
    "writing": false,
    "name": "Power of Story",
    "fullname": "Power of Story",
    "info": "Abraham Lincoln professed that “People are more influenced and informed through a story than in any other way.” This course is about harnessing the power of story to become a more influential communicator. Whether you’re presenting data or a new idea, this course will prepare you to overcome challenges such as: How do you get (and maintain) attention? How can you convey complex information quickly? How do you make a broad, abstract idea concrete and tangible enough for people to understand? How do you provide credibility for your idea without resorting to dry statistics?\n\nThis course = communication science + storytelling workshop. It involves many exercises, activities, and practicing your skills. By focusing on personal storytelling, Power of Story is aimed at those who seek to resonate with others through clear and captivating communication.\n\nPrereq: MBA 6301 (previously MBA 6300), CSOM graduate student",
    "prereq": {}
  },
  {
    "uid": "014179",
    "code": "MKTG6088",
    "subject": "MKTG",
    "number": "6088",
    "honors": false,
    "writing": false,
    "name": "Strategic Marketing",
    "fullname": "Strategic Marketing",
    "info": "This course looks at strategic decision-making, trade-offs and resource allocation in markets, methods for creating advantage at both the industry and the firm level, the impacts of strategic decisions, and appropriate investment and performance management frameworks. Utilizing an integrated approach to the use of marketing tools and concepts in the formulation and execution of the marketing plan. The material is presented with case studies, lectures, readings, and guest speakers. Focusing on development of framework for strategic marketing planning based on market insights, customer behavior, market segmentation, product positioning, customer experience, market responsiveness, and competitive reaction. The course is designed to be essential for students interested in careers in marketing management, brand management, product management, strategic consulting, and leadership development programs.\n\nprereq: MBA 6210/6211, MBA or Mgmt Sci MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "014180",
    "code": "MKTG6090",
    "subject": "MKTG",
    "number": "6090",
    "honors": false,
    "writing": false,
    "name": "Marketing Topics",
    "fullname": "Marketing Topics",
    "info": "Selected topics/problems of current interest considered in depth. \n\nprereq: MBA 6210/6211, MBA student",
    "prereq": {
      "or": [
        "014152"
      ]
    }
  },
  {
    "uid": "803164",
    "code": "MKTG6101",
    "subject": "MKTG",
    "number": "6101",
    "honors": false,
    "writing": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "Independent directed reading/research.",
    "prereq": {}
  },
  {
    "uid": "801171",
    "code": "MKTG6801",
    "subject": "MKTG",
    "number": "6801",
    "honors": false,
    "writing": false,
    "name": "Independent Study",
    "fullname": "Independent Study",
    "info": "3/18/21 Course is updated to \"inactive\" after not having offered it for several years ",
    "prereq": {}
  },
  {
    "uid": "803944",
    "code": "MKTG8809",
    "subject": "MKTG",
    "number": "8809",
    "honors": false,
    "writing": false,
    "name": "Consumer Beh Resrch Methds",
    "fullname": "Consumer Behavior Research Methods",
    "info": "Seminar. Topics related to conceptual theories/arguments about experimental design and statistical analysis of experiments. How to design experimental research for testing hypotheses and drawing conclusions.\n\nprereq: Doctoral student or [masters programs student, instr consent]",
    "prereq": {}
  },
  {
    "uid": "803945",
    "code": "MKTG8810",
    "subject": "MKTG",
    "number": "8810",
    "honors": false,
    "writing": false,
    "name": "Consumer Behavior Topics",
    "fullname": "Consumer Behavior Special Topics",
    "info": "Topics related to the fundamentals of consumer behavior such as attitudes, behavioral research methods, branding, consumer well-being, decision making, information processing, and perceptions. See \"Class Notes\" for details. prereq: Doctoral student or [master's program student, instr consent]",
    "prereq": {}
  },
  {
    "uid": "004614",
    "code": "MKTG8811",
    "subject": "MKTG",
    "number": "8811",
    "honors": false,
    "writing": false,
    "name": "Consumer Att&Persuasion I",
    "fullname": "Consumer Attitudes and Persuasion I",
    "info": "Reading, discussing, and evaluating theories of consumer attitudes and persuasion. Theoretical analysis, rather than practitioner focus.\n\nprereq: [[MBA 6210 or equiv], business admin PhD student] or instr consent",
    "prereq": {}
  },
  {
    "uid": "803946",
    "code": "MKTG8812",
    "subject": "MKTG",
    "number": "8812",
    "honors": false,
    "writing": false,
    "name": "Consumer Att&Persuasion II",
    "fullname": "Consumer Attitudes and Persuasion II",
    "info": "Science of persuasion. Principles of stickiness--universal principles that lead messages to succeed rather than fail.  Principles of influence--universal psychological principles that motivate a person to say \"yes.\"\n\nprereq: Doctoral student or instr consent",
    "prereq": {}
  },
  {
    "uid": "803947",
    "code": "MKTG8813",
    "subject": "MKTG",
    "number": "8813",
    "honors": false,
    "writing": false,
    "name": "Consumer Judg. & Dec. Making I",
    "fullname": "Consumer Judgment and Decision Making I",
    "info": "Different theoretical approaches taken in judgment and decision-making research. Heuristics/biases, affect in decision making, judgments/decisions over time.\n\nprereq: Doctoral student or [master's program student, instr consent]",
    "prereq": {}
  },
  {
    "uid": "803952",
    "code": "MKTG8814",
    "subject": "MKTG",
    "number": "8814",
    "honors": false,
    "writing": false,
    "name": "Decision Making & Emotions",
    "fullname": "Decisions Making, Emotions and Unconscious Processes",
    "info": "Decision biases, emotion theories and how they relate to decision making, unconscious processes, and measurements of these processes. \n\nprereq: Doctoral student or [master's program student, instr consent]",
    "prereq": {}
  },
  {
    "uid": "004615",
    "code": "MKTG8831",
    "subject": "MKTG",
    "number": "8831",
    "honors": false,
    "writing": false,
    "name": "Inter-Org Relations",
    "fullname": "Seminar: Inter-Organizational Relations",
    "info": "From an efficiency perspective, inter-organizational networks involved in task of moving goods and services from point of production to point of consumption. Literature covering the functional, institutional, analytical, and methodological traditions, as well as the behavioral school of thought and transaction cost and relational contracting.\n\nprereq: business admin PhD student or instr consent",
    "prereq": {}
  },
  {
    "uid": "015421",
    "code": "MKTG8841",
    "subject": "MKTG",
    "number": "8841",
    "honors": false,
    "writing": false,
    "name": "Msmt  Theory & Methods Seminar",
    "fullname": "Seminar: Theory and Methods of Measurement",
    "info": "Issues surrounding validity and reliability of measures developed as key indicators of constructs in a behavioral context. Various methods of measurement such as indicators of reliability, Multi-Trait Multi-Method, exploratory factor analysis, and confirmatory factor analysis using Lisrel. ",
    "prereq": {}
  },
  {
    "uid": "803953",
    "code": "MKTG8842",
    "subject": "MKTG",
    "number": "8842",
    "honors": false,
    "writing": false,
    "name": "Quantitative Modeling I",
    "fullname": "Quantitative Modeling I",
    "info": "Advanced readings seminar. Quantitative research in marketing. Topics from theoretical/empirical research in marketing, econometrics, and industrial organization. Classic/contemporary articles.\n\nprereq: Doctoral student or [master's program student, instr consent]",
    "prereq": {}
  },
  {
    "uid": "803954",
    "code": "MKTG8843",
    "subject": "MKTG",
    "number": "8843",
    "honors": false,
    "writing": false,
    "name": "Empirical Quant Models",
    "fullname": "Empirical Quantitative Models",
    "info": "Advanced readings seminar. Quantitative research in marketing. Topics from theoretical/empirical research streams in marketing, econometrics, and industrial organization. Classic/contemporary articles.\n\nprereq: Doctoral student or [master's program student, instr consent]",
    "prereq": {}
  },
  {
    "uid": "004616",
    "code": "MKTG8851",
    "subject": "MKTG",
    "number": "8851",
    "honors": false,
    "writing": false,
    "name": "Mktg Mgmt/Strategy I",
    "fullname": "Seminar: Marketing Management and Strategy I",
    "info": "Topics in marketing management and formulation and implementation of marketing strategies. Diversity of thought, within marketing and strategic management literature.\n\nprereq: [[MBA 6210 or equiv], business admin PhD student] or instr consent",
    "prereq": {}
  },
  {
    "uid": "806821",
    "code": "MKTG8852",
    "subject": "MKTG",
    "number": "8852",
    "honors": false,
    "writing": false,
    "name": "Mktg Mgmt/Strategy II",
    "fullname": "Marketing Management & Strategy II",
    "info": "PhD seminar. Role of branding within the organization, its business strategy, and its success. Brand management. Critically evaluate fundamental ideas and more recent developments.\n\nprereq: Business admin PhD student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004618",
    "code": "MKTG8890",
    "subject": "MKTG",
    "number": "8890",
    "honors": false,
    "writing": false,
    "name": "Marketing Topics",
    "fullname": "Seminar: Marketing Topics",
    "info": "Current topics and problems of interest considered in depth. Topics vary with each offering.\n\nprereq: Business admin PhD student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004627",
    "code": "MKTG8892",
    "subject": "MKTG",
    "number": "8892",
    "honors": false,
    "writing": false,
    "name": "Readings in Mktg",
    "fullname": "Readings in Marketing",
    "info": "Readings useful to student's individual program and objectives that are not available in regular courses.\n\nprereq: MBA 6210 or equiv, business admin PhD student or instr consent",
    "prereq": {}
  },
  {
    "uid": "004628",
    "code": "MKTG8894",
    "subject": "MKTG",
    "number": "8894",
    "honors": false,
    "writing": false,
    "name": "Research in Mktg",
    "fullname": "Graduate Research in Marketing",
    "info": "Individual research on an approved topic appropriate to student's program and objectives.\n\nprereq: MBA 6210 or equiv, business admin PhD student or instr consent",
    "prereq": {}
  }
]