[
  {
    "uid": "801207",
    "code": "MM3001W",
    "subject": "MM",
    "number": "3001",
    "honors": false,
    "writing": true,
    "name": "Manufacturing in Global Econ",
    "fullname": "Manufacturing in the Global Economy",
    "info": "In this course, you'll find out just how innovative, strategic, and creative manufacturing is. The course is a great elective for students seeking a better understanding of the core sector in both U.S. and international economies. The overall objective of MM 3001W is to explore different facets of manufacturing in today's global economy, and the three dimensions of the high-performance manufacturing organization (HPMO) model--leadership, product quality, and innovation--are paramount in that exploration. You'll take a look at past and current Minnesota manufacturing companies (3M and Red Wing Shoes, for example) that are surviving and thriving in today's economy, and also learn why some of those Minnesota companies have failed. As a writing intensive course, MM 3001W also prepares students to be successful writers, both in their coursework at the University of Minnesota and in their future careers, as special attention will be paid to real-world writing applications, skills, and processes. \nPrerequisites:  None.",
    "prereq": {}
  },
  {
    "uid": "808505",
    "code": "MM3205",
    "subject": "MM",
    "number": "3205",
    "honors": false,
    "writing": false,
    "name": "Engineering for Mfg Ops",
    "fullname": "Engineering for Manufacturing Operations",
    "info": "What makes a factory run? In this course, you'll learn all about those intricacies and gain the tools and skills required to create high-output systems that can reliably function day in, day out. You will do most of your learning through creative exercises. For example, you'll take apart a flashlight to create the tools needed for manufacturing, and you'll validate a piece of equipment while toasting a loaf of bread. Your final project will be designing and manufacturing your own holiday card. Since the best learning happens when there's flexibility to fail, the instructor creates assignments that have a little ambiguity to them. (Students can even turn in homework twice to improve their grade, if needed.) By the end of this course, you'll have the confidence to work effectively across silos, and you'll have a wealth of career advice from an instructor with over 20 years' experience leading teams at Fortune 500 companies. Prerequisite: None",
    "prereq": {}
  },
  {
    "uid": "811446",
    "code": "MM3305",
    "subject": "MM",
    "number": "3305",
    "honors": false,
    "writing": false,
    "name": "Advanced 3D Printing",
    "fullname": "Advanced 3D Printing for Innovative Business Practices",
    "info": "Revolutionize your world with speed and creativity. Three-D printing and additive manufacturing are changing how we work and how manufacturing itself happens. In this course, you'll hone the ability to innovate and to lead others in discovery. The first half of the semester is spent learning how to use additive technology and the second half how it can be applied to real-world industries. By the end of the course, you'll use computer-aided design and the U of M's 3D printing lab to build your own solution to a problem. Join this community of forward-thinking makers and tap some of the most high-tech resources at the U. Prerequisites: None",
    "prereq": {}
  },
  {
    "uid": "791368",
    "code": "MM4001",
    "subject": "MM",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "MFG COST ACTG,  ANYL & CTRL",
    "fullname": "Manufacturing Cost Accounting, Analysis, and Control",
    "info": "Basic accounting concepts. Financial statements. Analysis/control of current assets. Income tax planning. Cost analysis. Standard costs for product costing. Time value of money. Quantifying risk/uncertainty. Utility theory, cost of capital, capital structure. Capital budgeting under capital rationing. Management decisions, investment.",
    "prereq": {}
  },
  {
    "uid": "791369",
    "code": "MM4011",
    "subject": "MM",
    "number": "4011",
    "honors": false,
    "writing": false,
    "name": "VR and Simulation in Mfg",
    "fullname": "Virtual Reality and Simulation in Manufacturing",
    "info": "Virtual reality meets manufacturing in this course for creative problem solvers. By mastering the use of simulation software (Simio), you'll be able to assess product flow along an assembly line and suggest sequences that dramatically improve efficiency, thereby cutting costs. The skill set students acquire in this course has opened innumerable doors for job seekers because visual representations provide hard evidence that certain models will be successful. Learn how to simulate many different processes at once and be introduced to augmented and virtual reality, new technologies that are being introduced to speed up the development of manufacturing lines. This course will enhance any career path that involves operations and efficiency.\nPrerequisite: None",
    "prereq": {}
  },
  {
    "uid": "791370",
    "code": "MM4012",
    "subject": "MM",
    "number": "4012",
    "honors": false,
    "writing": false,
    "name": "Adv Mfg: Appl Process and Tech",
    "fullname": "Advanced Manufacturing: Applied Process and Technology",
    "info": "Prepare to take a deep dive into the nitty-gritty as well as the art of manufacturing. You will study the myriad details that comprise the manufacturing process, tracing how raw materials are transformed into sophisticated devices in the most efficient ways. You will learn three important things that can be applied directly to any job: 1) how to deconstruct the value-added steps of a manufacturing assembly, 2) how to construct a process flow diagram, and 3) how to perform a process capability study. If you want to gain expertise in how factory work is planned, measured, studied, improved, and optimized, then you've come to the right place. Beyond this, you will also walk away with an understanding that manufacturers are true artisans whose expertise shapes our world in countless ways. \nprereq: A course such as MM 3001W, or relevant manufacturing experience.",
    "prereq": {
      "or": [
        "801207"
      ]
    }
  },
  {
    "uid": "801208",
    "code": "MM4035",
    "subject": "MM",
    "number": "4035",
    "honors": false,
    "writing": false,
    "name": "Global Supply Chain Management",
    "fullname": "Global Supply Chain Management",
    "info": "A supply chain is the process that ensures that any particular thing gets made and distributed efficiently and with high quality. It comprises diverse suppliers, all of whom have a different role to play. You will learn about the complex ballet that ties these suppliers together into a larger system and schedule—a supply chain. Through weekly online group work and real-life case study analysis, you will come to understand the value of interrelationships between product development, purchasing, manufacturing, customer service, and distribution. Your subject matter will be the real-world function of supply chains for familiar products, and by the end of the course, you will know how to think about effective supply chains. You’ll also have opportunities to do a complete analysis of a real organization as well as interview a professional who works with supply chains on a daily basis. prereq: None.",
    "prereq": {}
  },
  {
    "uid": "808506",
    "code": "MM4039",
    "subject": "MM",
    "number": "4039",
    "honors": false,
    "writing": false,
    "name": "The Science of Sourcing",
    "fullname": "The Science of Sourcing: Partnerships for Success",
    "info": "Learn how to maneuver with ease inside the complex network of global manufacturing and outsourcing. The Science of Sourcing is all about setting up a sourcing strategy that hinges on two things: core competencies of your business and, of course, customer satisfaction. By the end of this course, you'll be able to do three things really well: 1) identify which products or processes should be outsourced, 2) perform estimates for cost and comparison of outsourcing options, and finally, 3) execute step-by-step outsourcing as you choose suppliers. You’ll also be exposed to the art of managing an outsourced manufacturer relationship, which includes contracts and performance metrics. It's all about upholding quality and value. Prerequisite: A course such as MM 3001W, or relevant manufacturing experience.",
    "prereq": {}
  },
  {
    "uid": "801209",
    "code": "MM4045",
    "subject": "MM",
    "number": "4045",
    "honors": false,
    "writing": false,
    "name": "Product Life Cycle and Reg",
    "fullname": "The Product Life Cycle in a Regulated Industry",
    "info": "There's much to learn when it comes to designing, developing, manufacturing, and selling something, but this course skillfully covers it all while teaching how to successfully commercialize a product. Students will delve into real-world analysis of product regulation of any kind--from a box of cereal to a medical device. After this course, you’ll be able to a) improve efficiency in any part of a product's life cycle, b) develop soft skills needed to clearly communicate your ideas for improvement, and c) fully wrap your brain around human factors and customer requirements that must be considered before the product's development is complete. This material has endless applications in the workplace.\nprereq:  None.\n",
    "prereq": {}
  },
  {
    "uid": "015094",
    "code": "MM4102",
    "subject": "MM",
    "number": "4102",
    "honors": false,
    "writing": false,
    "name": "Optimizing Operations Mgmt",
    "fullname": "Optimizing Operations Management",
    "info": "In this course, students learn how to put the pieces of the manufacturing puzzle together--they delve into the details of an organization's operations strategy and develop an understanding of how the system works, from product concept to finished reality. Emphasis is placed on learning valuable techniques for improving organizational performance, which include computer-enhanced problem solving and decision making. You will develop critical thinking skills that allow you to think holistically about how to create order out of chaos in an operations unit. Through weekly online group work assignments; opportunities to give dynamic multimedia group presentations; interviewing a real-world operations manager; and mastering the stages of forming, storming, norming, and performing, you will leave feeling prepared to take on whatever operations management challenges come your way. prerequisite: None.",
    "prereq": {}
  },
  {
    "uid": "809853",
    "code": "MM4193",
    "subject": "MM",
    "number": "4193",
    "honors": false,
    "writing": false,
    "name": "Capstone Directed Study",
    "fullname": "Capstone Directed Study",
    "info": "You've learned a lot so far in the Manufacturing Operations Management program. Now it's time to use all that hard-earned knowledge as you embark on your capstone project. A culminating experience using all the skills and concepts you're familiar with, the capstone is an opportunity for you to identify a specific problem, question, or course of study pertaining to manufacturing operations.  This will be your primary focus over the length of the course. Working with your capstone adviser, you will develop a project requiring 135 hours or more of research and work. You will then generate data and use appropriate models to create comprehensive reports and solutions to the project you've chosen, and you will present your findings at the end of the semester. The capstone course is a great option for students who are already employed full-time and wish to select a project that's somehow connected to their employment.\n\nprereq: MM major or minor or certificate, departmental approval",
    "prereq": {}
  },
  {
    "uid": "791387",
    "code": "MM4201",
    "subject": "MM",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Quality Engineering and Mgmt",
    "fullname": "Quality Engineering and Management",
    "info": "Quality makes or breaks an organization. Without continuous quality improvement, performance fails, sales drop, and organizations die. This course delves into three essential truths: 1) the customer is the ultimate judge of quality; 2) every process has variation, which must be fully understood before it can be improved; and 3) a lean, mean, structured plan will make problem solving a cinch when it comes to process improvement. Students will learn more than just the technical aspects of quality management; they will also learn the history and modern application of quality, quality management tool interfaces, and what it takes to be a leader in quality as a profession. prereq: none, but knowledge of statistics will be very helpful.",
    "prereq": {}
  },
  {
    "uid": "808507",
    "code": "MM4311",
    "subject": "MM",
    "number": "4311",
    "honors": false,
    "writing": false,
    "name": "Sustainable Lean Manufacturing",
    "fullname": "Sustainable Lean Manufacturing: Eliminating the Waste",
    "info": "One of the most important skills you can cultivate in manufacturing (or really any line of work) is the ability to clear away the clutter and streamline the process. Sustainable Lean Manufacturing teaches students three things: 1) wasted time, effort, and money exist in every process involving a product or service; 2) it’s possible to clearly see and identify where waste occurs; and 3) there’s a surefire set of tools and techniques to make a process less wasteful and more efficient. Bottom line: students leave this course viewing everyday life with a different perspective, knowing there’s always room for improvement in workflow. prereq: None",
    "prereq": {}
  },
  {
    "uid": "804481",
    "code": "MM4550",
    "subject": "MM",
    "number": "4550",
    "honors": false,
    "writing": false,
    "name": "SpecialTopics in Manufacturing",
    "fullname": "Special Topics in Manufacturing",
    "info": "Seminar. Timely issues/themes in manufacturing.",
    "prereq": {}
  },
  {
    "uid": "791389",
    "code": "MM4596",
    "subject": "MM",
    "number": "4596",
    "honors": false,
    "writing": false,
    "name": "Internship",
    "fullname": "Internship",
    "info": "An MM internship provides students with the opportunity to gain hands-on experience working with professionals in a manufacturing setting and get an insider's view of manufacturing operations management in the workplace. In consultation with a faculty adviser, students apply classroom learning and prepare for the transition from school to full-time MM employment. Students seeking credit for the internship are expected to find employment that primarily draws upon the intern's academic knowledge in management level tasks and allows for new learning in these areas. \n\nprereq: [MM major or minor or certificate or instr consent], dept consent",
    "prereq": {}
  }
]