[
  {
    "uid": "819425",
    "code": "MSBA6111",
    "subject": "MSBA",
    "number": "6111",
    "honors": false,
    "writing": false,
    "name": "Business Essentials",
    "fullname": "Business Essentials for Analytics Professionals",
    "info": "This course aims to increase the business acumen of students by exploring fundamental concepts in core business disciplines such as strategy, financial accounting, marketing, and operations through the lens of data analytics. The course showcases how the strategic use of data and analytics drives innovation and value across these key business areas. Through the use of business cases and real-world applications, students will gain insight into effectively using data analytics to collaborate with key functional areas of an organization in order to make informed business decisions.",
    "prereq": {}
  },
  {
    "uid": "811243",
    "code": "MSBA6121",
    "subject": "MSBA",
    "number": "6121",
    "honors": false,
    "writing": false,
    "name": "Intro to Stats for Scientists",
    "fullname": "Introduction to Statistics for Data Scientists",
    "info": "This course is designed to develop statistical thinking, i.e., understanding variation and using data to identify possible sources of variation. Specific techniques include basic descriptive and inferential procedures and regression modeling. The emphasis is on understanding such analysis for their relevance to decision making. ",
    "prereq": {}
  },
  {
    "uid": "819426",
    "code": "MSBA6131",
    "subject": "MSBA",
    "number": "6131",
    "honors": false,
    "writing": false,
    "name": "Intro to Business Analytics",
    "fullname": "Introduction to Business Analytics in R",
    "info": "Introduction to key processes, building blocks, and use cases of business analytics through R, including data acquisition, engineering, visualization, basic concepts of exploratory and predictive analytics, and lifecycle of business analytics projects.",
    "prereq": {}
  },
  {
    "uid": "816435",
    "code": "MSBA6141",
    "subject": "MSBA",
    "number": "6141",
    "honors": false,
    "writing": false,
    "name": "Ethics and Data Privacy",
    "fullname": "Ethics and Data Privacy",
    "info": "Explore the moral, social, ethical, and legal ramifications of the choices made at the different stages of the data analysis pipeline, from data collection and storage to analysis and use. Students will learn the basics of ethical thinking in data science, understand the history of ethical dilemmas in scientific work, study issues of fairness, transparency, and algorithmic bias associated with machine learning, and explore the distinct challenges associated with ethics and privacy in modern data science. \n",
    "prereq": {}
  },
  {
    "uid": "827253",
    "code": "MSBA6155",
    "subject": "MSBA",
    "number": "6155",
    "honors": false,
    "writing": false,
    "name": "Generative AI for Business",
    "fullname": "Generative AI for Business Applications",
    "info": "Generative AI will give students an understanding of the transformative paradigm of Generative AI—its applications, limitations, ethical and social implications, and how it can unlock previously inaccessible value. This course is designed to prepare students for the generative AI related choices they will face as leaders and managers. Through this course, students will develop a robust understanding of the technology and an experience in working with popular generative AI tools such as ChatGPT and Midjourney. We will examine the six new superpowers of Gen AI and see how they can create business value through use cases.\n\nprereq: MSBA 6311, MSBA 6421, or instructor consent\n",
    "prereq": {
      "or": [
        "810882",
        "810888"
      ]
    }
  },
  {
    "uid": "810881",
    "code": "MSBA6250",
    "subject": "MSBA",
    "number": "6250",
    "honors": false,
    "writing": false,
    "name": "Analytics for Comp. Adv. II",
    "fullname": "Analytics for Competitive Advantage II",
    "info": "Case/discussion-based introduction to variety of analytics-related issues/examples in business. Business value, impact, benefits/limitations, as well as ethical, legal, privacy issues. Use of case studies, examples, guest speakers.",
    "prereq": {}
  },
  {
    "uid": "816002",
    "code": "MSBA6255",
    "subject": "MSBA",
    "number": "6255",
    "honors": false,
    "writing": false,
    "name": "Analytics for Comp. Adv. I",
    "fullname": "Analytics for Competitive Advantage I",
    "info": "Quantitative problem solving formulation and solving skills.",
    "prereq": {}
  },
  {
    "uid": "810882",
    "code": "MSBA6311",
    "subject": "MSBA",
    "number": "6311",
    "honors": false,
    "writing": false,
    "name": "Programming for Data Science",
    "fullname": "Programming for Data Science",
    "info": "According to recent industry surveys, Python is one of the most popular tools used by organizations data analysis. We will explore the emerging popularity of Python for tasks such as general purpose computing, data analysis, website scraping, and data visualization. You will first learn the basics of the Python language.  Participants will then learn how to apply functionality from powerful and popular data science-focused libraries. In addition, we will learn advanced programming techniques such as lambda functions and closures. We will spend most of our class time completing practical hands-on exercises.",
    "prereq": {}
  },
  {
    "uid": "810883",
    "code": "MSBA6321",
    "subject": "MSBA",
    "number": "6321",
    "honors": false,
    "writing": false,
    "name": "Data Mgmt, DB & Data Warehsing",
    "fullname": "Data Management, Databases, and Data Warehousing",
    "info": "Fundamentals of database modeling/design, normalization. Extract, transform, load. Data cubes/setting up data warehouse. Data pre-processing, quality, integration/stewardship issues. Advances in database/storage technologies.",
    "prereq": {}
  },
  {
    "uid": "810884",
    "code": "MSBA6331",
    "subject": "MSBA",
    "number": "6331",
    "honors": false,
    "writing": false,
    "name": "Big Data Analytics",
    "fullname": "Big Data Analytics",
    "info": "The course covers the utilization of big data tools, cloud computing platforms, and MLOps practices to efficiently process, manage, and analyze massive datasets, emphasizing the development of robust data pipelines and the deployment of machine learning operations for real-world applications. Students gain practical experience in harnessing the power of distributed computing frameworks, scalable data storage and processing tools, and cloud services to address the challenges posed by the growing volume and complexity of contemporary data science. Topics include: Hadoop MapReduce, Hive, Spark, Streaming Analytics, Cloud Computing, NoSQL, and MLOps.\n \nprereq: MSBA 6311, MSBA 6321, or instructor consent",
    "prereq": {
      "or": [
        "810882",
        "810883"
      ]
    }
  },
  {
    "uid": "827252",
    "code": "MSBA6335",
    "subject": "MSBA",
    "number": "6335",
    "honors": false,
    "writing": false,
    "name": "Comm for Analytics Profession",
    "fullname": "Effective Communication for Analytics Professionals",
    "info": "In today's data-driven business landscape, the ability to communicate complex analytical insights effectively is paramount. This specialized course is tailored for Master of Science in Business Analytics students, equipping them with the essential skills to convey data-driven findings with clarity, impact, and persuasion. It covers topics including data storytelling, visual communication, presentation techniques, and stakeholder engagement strategies.",
    "prereq": {}
  },
  {
    "uid": "827249",
    "code": "MSBA6341",
    "subject": "MSBA",
    "number": "6341",
    "honors": false,
    "writing": false,
    "name": "Responsible AI",
    "fullname": "Responsible AI",
    "info": "In an era where artificial intelligence plays an increasingly pivotal role in  business analytics, responsible AI practices are imperative. This advanced course will equip students with the knowledge, skills, and ethical mindset needed to develop AI solutions that are not only technologically proficient but also responsible, fair, and transparent. It covers topics such as ethical AI, algorithm fairness and bias mitigation, and explainable AI.\n\nprereq: MSBA 6421 or instructor consent",
    "prereq": {
      "or": [
        "810888"
      ]
    }
  },
  {
    "uid": "810885",
    "code": "MSBA6345",
    "subject": "MSBA",
    "number": "6345",
    "honors": false,
    "writing": false,
    "name": "Consult Prob-Solv & Agile Mgmt",
    "fullname": "Consultative Problem-Solving & Agile Management for Analytics Projects",
    "info": "Consultative problem-solving techniques, including using collaborative frameworks to bring strategic thinking skills to analytics projects. Project management skills with a focus on the Agile mindset and the implementation of Scrum practices using tools such as Jira and Confluence. Teams will apply these skills in real-time through the Business Analytics Experiential Learning Project which will be run in conjunction with this course.",
    "prereq": {}
  },
  {
    "uid": "827257",
    "code": "MSBA6351",
    "subject": "MSBA",
    "number": "6351",
    "honors": false,
    "writing": false,
    "name": "RecSys and Applications",
    "fullname": "Recommender System Techniques and Applications",
    "info": "With the fast evolution of machine learning and the advent of generative AI, the development of recommender systems is greatly enhanced and their applications in online platforms are becoming imperative. This course introduces techniques for recommender systems and its application in a wide range of business settings such as movie recommendation, click-through-rate prediction, online dating, buyer-seller and producer-distributor matching, fashion outfit composition, and product sales forecasting. We first introduce the notion of personalization and latent representation. Then we discuss canonical recommender systems, context-aware recommender systems, deep-learning-empowered recommender systems, and recommendations with auxiliary information. Finally, we demonstrate the applications of recommender systems in several business settings, where business analysts will be equipped with recognize and disentangle complex online platform matching problems with the techniques of recommender systems.\n\nprereq: MSBA 6131, MSBA 6421, or instructor consent",
    "prereq": {
      "or": [
        "819426",
        "810888"
      ]
    }
  },
  {
    "uid": "814379",
    "code": "MSBA6355",
    "subject": "MSBA",
    "number": "6355",
    "honors": false,
    "writing": false,
    "name": "Building and Managing Teams",
    "fullname": "Building and Managing Teams",
    "info": "Examine individual, group and organizational aspects of team effectiveness; learn and practice basic skills central to team management; develop appreciation for team leadership function; learn the tools for effective team decision making and conflict management; develop general diagnostic skills for assessment of team issues within and across organizations and national boundaries.",
    "prereq": {}
  },
  {
    "uid": "810887",
    "code": "MSBA6411",
    "subject": "MSBA",
    "number": "6411",
    "honors": false,
    "writing": false,
    "name": "Exploratory Data Analytics",
    "fullname": "Exploratory Data Analytics",
    "info": "This course introduces the fundamentals of exploratory business analytics. Students will learn to detect relationships and patterns in both structured and unstructured data via a variety of exploratory techniques such as data visualization, clustering, dimensionality reduction, topic modeling, anomaly detection, deep neural networks, and generative AI. The course integrates theoretical discussion and hands-on practice using Python, with an emphasis on real-world problem solving and effective technical/managerial communication.\n\nprereq: MSBA 6121, MSBA 6311, or instructor consent",
    "prereq": {
      "or": [
        "811243",
        "810882"
      ]
    }
  },
  {
    "uid": "810888",
    "code": "MSBA6421",
    "subject": "MSBA",
    "number": "6421",
    "honors": false,
    "writing": false,
    "name": "Predictive Analytics",
    "fullname": "Predictive Analytics",
    "info": "Fundamentals of predictive modeling and machine learning, assessing the performance of predictive models: logistic regression, decision trees, naïve Bayesian classifiers, support vector machine, ensemble learning, deep neural network, and their applications in structured and unstructured data.",
    "prereq": {}
  },
  {
    "uid": "811000",
    "code": "MSBA6431",
    "subject": "MSBA",
    "number": "6431",
    "honors": false,
    "writing": false,
    "name": "Times Series Forecasting",
    "fullname": "Time Series Analysis and Forecasting",
    "info": "A wide variety of data science tasks, ranging from financial stock market trading to inventory management to sales planning, requires understanding time trends and issuing time forecasts. These types of tasks leverage repeatedly measured data records across a span of time, called time series. In this course, we will introduce techniques for time series analysis and forecasting and their applications in business settings, including thorough discussion of canonical ARIMA models and brief introduction to deep-learning-based models such as recurrent neural networks and transformers.\n\nprereq: MSBA 6121, MSBA 6131, or instructor consent",
    "prereq": {
      "or": [
        "811243",
        "819426"
      ]
    }
  },
  {
    "uid": "811001",
    "code": "MSBA6441",
    "subject": "MSBA",
    "number": "6441",
    "honors": false,
    "writing": false,
    "name": "Inference via Ecnmtrcs Exprmnt",
    "fullname": "Causal Inference via Econometrics and Experimentation",
    "info": "Controlled experiments in business settings, experiment design, A/B testing. Specialized statistical methodologies. Fundamentals of econometrics, instrument variable regression, propensity score matching.\n\nprereq: MSBA 6121, MSBA 6311, or instructor consent",
    "prereq": {
      "or": [
        "811243",
        "810882"
      ]
    }
  },
  {
    "uid": "811002",
    "code": "MSBA6451",
    "subject": "MSBA",
    "number": "6451",
    "honors": false,
    "writing": false,
    "name": "Prescriptive Analytics",
    "fullname": "Prescriptive Analytics",
    "info": "This course explores optimization techniques in business analytics, providing students with the skills to formulate, solve, and interpret prescriptive models for optimal decision-making, resource allocation, and process improvement in complex organizational settings.\n\nprereq: MSBA 6131 or instructor consent",
    "prereq": {
      "or": [
        "819426"
      ]
    }
  },
  {
    "uid": "820231",
    "code": "MSBA6461",
    "subject": "MSBA",
    "number": "6461",
    "honors": false,
    "writing": false,
    "name": "Advanced AI for NLP",
    "fullname": "Advanced AI for Natural Language Processing",
    "info": "This course covers several topics in natural language understanding using machine learning and artificial intelligence. Students are introduced to foundational natural language processing techniques (e.g., text pre-processing and bag of words representation) and more advanced topics in natural language understanding, such as representation learning, sequential models, transformer models, and large language models (e.g., ChatGPT), along with their business applications. The course combines theoretical discussions of concepts and techniques and hands-on practices in Python, leveraging popular packages such as Tensorflow or Pytorch. The overall objective is to develop a foundation for understanding and leveraging modern AI tools and techniques for language-understanding.\n\nprereq: MSBA 6131 or instructor consent",
    "prereq": {
      "or": [
        "819426"
      ]
    }
  },
  {
    "uid": "812404",
    "code": "MSBA6511",
    "subject": "MSBA",
    "number": "6511",
    "honors": false,
    "writing": false,
    "name": "BA Experiential Learning",
    "fullname": "Business Analytics Experiential Learning",
    "info": "This course involves hands-on application of the analytics methodologies, techniques, and tools learned throughout the program to a real-world problem (such as consulting for a real-world business client in the area of marketing, strategy, operation/supply chain, information technology, finance, accounting, or human resources) as well as the development and presentation of results, interpretations, insights, and recommendations.\n\nprereq: MSBA 6321, MSBA 6411, MSBA 6421, or instructor consent",
    "prereq": {
      "or": [
        "810883",
        "810887",
        "810888"
      ]
    }
  },
  {
    "uid": "817193",
    "code": "MSBA6515",
    "subject": "MSBA",
    "number": "6515",
    "honors": false,
    "writing": false,
    "name": "Capstone Project in Analytics",
    "fullname": "Capstone Project in Analytics",
    "info": "Hands-on, integrative application of analytics methodologies, techniques, and tools learned throughout the program in the context of a specific analytics problem. Experience with the entire data analytics cycle, starting from business and data understanding as well as data cleaning and integration and ending with the development and presentation of results, interpretations, insights, and recommendations.",
    "prereq": {}
  }
]