[
  {
    "uid": "818381",
    "code": "MSF5529",
    "subject": "MSF",
    "number": "5529",
    "honors": false,
    "writing": false,
    "name": "Derivatives II",
    "fullname": "Derivatives II",
    "info": " Quantitatively advanced material such as Black-Scholes model for valuing option sensitivities (the Greeks). Value-at-risk methods. Valuation/uses of credit derivatives such as default swaps/collateralized debt obligations.",
    "prereq": {}
  },
  {
    "uid": "815351",
    "code": "MSF6021",
    "subject": "MSF",
    "number": "6021",
    "honors": false,
    "writing": false,
    "name": "Communications for Finance",
    "fullname": "Communications for Finance",
    "info": "This course covers guidelines and practical skill development for writing well-organized, professional documents and delivering confident, credible, and dynamic presentations. Students will practice designing and delivering effective messages including reader-friendly documents and PowerPoint using a professional writing style and document design. Through discussion and practice, students will also learn to deliver poised, formal and informal presentations to small and large groups both individually and in teams.   \n\nprereq: Summer Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "815352",
    "code": "MSF6022",
    "subject": "MSF",
    "number": "6022",
    "honors": false,
    "writing": false,
    "name": "Financial Statement Analysis",
    "fullname": "Financial Statement Analysis",
    "info": "This course teaches how to analyze financial statements, and it covers the following topics: overview of business activities and financial statements; profitability analysis and interpretation; credit risk analysis and interpretation; revenue recognition and operating income; asset recognition and operating assets; and inter-corporate entities. \n\nprereq: Summer Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "815353",
    "code": "MSF6031",
    "subject": "MSF",
    "number": "6031",
    "honors": false,
    "writing": false,
    "name": "Financial Accounting",
    "fullname": "Financial Accounting",
    "info": "This course provides students with a deep understanding of financial accounting fundamentals so that they can make decisions based on reported financials. Students will learn how a firm's operating activities, its investments, and financing transactions are recorded in the income statement, balance sheet, and statement of cash flows. Students will develop some skills needed to analyze financial statements that would later be used.",
    "prereq": {}
  },
  {
    "uid": "815354",
    "code": "MSF6121",
    "subject": "MSF",
    "number": "6121",
    "honors": false,
    "writing": false,
    "name": "Fixed Income and Securities",
    "fullname": "Fixed Income and Securities",
    "info": "This class provides an introduction to fixed income markets. Topics include the price/yield relation, no-arbitrage pricing of stripped coupon bonds, the duration/convexity approximation, the term structure of interest rates, defaultable bonds, mortgage-backed securities, inflation protected securities, bonds with embedded options, swap rates, the Fed Funds rate, repurchase agreements, and attribution analysis.  \n\nprereq: Fall A Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "815355",
    "code": "MSF6221",
    "subject": "MSF",
    "number": "6221",
    "honors": false,
    "writing": false,
    "name": "Finance I: Risk, Return, Value",
    "fullname": "Finance I: Risk, Return, Value",
    "info": "This course is the first course in a three-course sequence to introduce the ideas of corporate finance. This course will focus on an overview of corporate finance in the firm, the valuation principle, the time value of money, interest rates, valuing bonds, risk and return, and estimating the cost of capital.",
    "prereq": {}
  },
  {
    "uid": "815356",
    "code": "MSF6222",
    "subject": "MSF",
    "number": "6222",
    "honors": false,
    "writing": false,
    "name": "Finance II:  Cash Flow",
    "fullname": "Finance II:  Cash Flows, Managerial Decisions, and Project Valuation",
    "info": "This course is the second course in a three-course sequence to introduce the ideas of corporate finance. Section I will introduce capital budgeting. Students will use the cost of capital learned at the end of the first course in conjunction with an introduction to the calculation of cash flows and the use of decision rules for project selection. Section II will move into stock valuation and company valuation based upon the dividend discount model and enterprise model of valuation; students will also be exposed to other valuation methods. Section III will introduce the effect of capital structure on company valuation, starting with perfect markets and introducing the opposing effects of taxation and financial distress on valuation. Students will complete a case to demonstrate understanding of the core concepts from the first three sections; the case is a continuing case with each week building on the prior week's work. Section IV will provide an introduction to financial options and option valuation.",
    "prereq": {}
  },
  {
    "uid": "815357",
    "code": "MSF6223",
    "subject": "MSF",
    "number": "6223",
    "honors": false,
    "writing": false,
    "name": "Corp & Entrepreneurial Finance",
    "fullname": "Corporate and Entrepreneurial Finance",
    "info": "This course is the last of a three-course sequence that introduces the ideas of corporate finance. It focuses on the three major decisions of a firm: the financing decision, the capital structure decision, and the payout decision. There is also an introduction to corporate valuation. This course uses a balanced mix of lectures and case studies, and emphasizes the use of real world data.  \n\nprereq: Summer Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "817797",
    "code": "MSF6224",
    "subject": "MSF",
    "number": "6224",
    "honors": false,
    "writing": false,
    "name": "Corp Finance Analysis & Decis.",
    "fullname": "Corporate Finance Analysis and Decisions",
    "info": "Theoretical/applied understanding of corporate financial decisions. Adjusted present value, economic value added options. Impact of financing decisions on real asset valuation, managerial incentives, corporate strategy.",
    "prereq": {}
  },
  {
    "uid": "815358",
    "code": "MSF6321",
    "subject": "MSF",
    "number": "6321",
    "honors": false,
    "writing": false,
    "name": "Quantitative Port. Analysis",
    "fullname": "Quantitative Portfolio Analysis",
    "info": "This course develops and examines models for portfolio decisions by investors and the pricing of securities in capital markets. We will develop portfolio theory along the way and also study the extensive empirical work that characterizes movements in security prices and evaluates alternative asset pricing models. Topics include the mean variance portfolio analysis, the capital asset pricing model, arbitrage pricing theory, the empirical performance of asset pricing model (market anomalies), multi-factor asset pricing models, time varying risk and returns, and portfolio performance evaluation, including style and attribution analysis. Extensive use of the computer will be required. \n\nprereq: Fall A Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "815359",
    "code": "MSF6322",
    "subject": "MSF",
    "number": "6322",
    "honors": false,
    "writing": false,
    "name": "Corporate Valuation & Modeling",
    "fullname": "Corporate Valuation and Modeling",
    "info": "This course develops the financial modeling principles and tools needed to build, operate, and understand the standard business performance, M&A, equity, and credit models that have become central to modern financial decision making. The course develops a deep understanding of financial models so they can be used to analyze a wide range of financial issues.  Finance concepts introduced in other courses are reinforced by having students build them into models and by having students interpret the results produced by those models. Students build a financial model on their own, learn to use a fully developed financial model and use models repeatedly to evaluate and plan performance, to estimate value added from projects, operating strategies and financing proposals and to estimate the value of securities. This course extensively uses VBA macros, sensitivity tables and scenario analyses. \n  \nprereq: Fall A Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "815360",
    "code": "MSF6421",
    "subject": "MSF",
    "number": "6421",
    "honors": false,
    "writing": false,
    "name": "Computing for Finance",
    "fullname": "Computing for Finance: Excel/VBA I & II",
    "info": "This course first introduces students to specific software (e.g., Excel VBA, ModelRisk Monte Carlo simulator) and databases (e.g., Bloomberg, Factset, CRSP, Compustat) that will be used throughout the MS program. It then focuses on the use of Excel for many topics in finance, including modern portfolio theory, optimal portfolio analysis and binomial option pricing.  This course often takes the material being learned in the \"Fundamentals of Finance\" course to motivate specific examples.",
    "prereq": {}
  },
  {
    "uid": "815361",
    "code": "MSF6422",
    "subject": "MSF",
    "number": "6422",
    "honors": false,
    "writing": false,
    "name": "Financial Econometrics",
    "fullname": "Financial Econometrics and Computational Methods I",
    "info": "This course provides an introduction to the methods used in empirical finance. A review of statistics is followed by intensive instruction on matrix algebra that culminates in a fundamental understanding of linear regression, the basic empirical tool. Asset pricing theories are discussed and developed and then methods are derived to test them. The course will emphasize estimation and inference using computer-based applications.  \n\nprereq: Summer Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "815362",
    "code": "MSF6423",
    "subject": "MSF",
    "number": "6423",
    "honors": false,
    "writing": false,
    "name": "Financial Econometrics II",
    "fullname": "Financial Econometrics and Computational Methods II",
    "info": "This course builds on Financial Econometrics I and provides instruction on the econometrics used in empirical finance. Topics will include time series analysis, parametric models of volatility, evaluation of asset pricing theories, and models for risk management. The course will emphasize estimation and inference using computer-based applications.    \n\nprereq: Fall A Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "818817",
    "code": "MSF6424",
    "subject": "MSF",
    "number": "6424",
    "honors": false,
    "writing": false,
    "name": "Machine Learning for Finance",
    "fullname": "Introduction to Machine Learning for Finance",
    "info": "Machine learning methods are now widely used in finance. This class covers fundamental methods. Particular attention will be devoted to the use in asset pricing and credit assessment.\n\nA real project has several steps: 1) data collection, 2) data management, 3) exploratory data analysis, 4) learning and predicting, 5) communicating results. The lectures focus on techniques for step 4. The homework provides hands-on practice including the other steps.\n",
    "prereq": {}
  },
  {
    "uid": "815363",
    "code": "MSF6522",
    "subject": "MSF",
    "number": "6522",
    "honors": false,
    "writing": false,
    "name": "Derivatives and Risk Managment",
    "fullname": "Derivatives and Risk Management",
    "info": "This class provides an introduction to derivatives markets. This course is designed to achieve two main objectives. First, provide students with a rigorous framework used in valuing derivative contracts. This will include an in-depth treatment on the two work horses of the binomial model and the Black-Sholes-Merton model. Second, apply the framework to understand a wide variety of issues related to risk management and investment decisions.   \n\nprereq: Fall A Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "815364",
    "code": "MSF6621",
    "subject": "MSF",
    "number": "6621",
    "honors": false,
    "writing": false,
    "name": "Finance within Macroeconomy",
    "fullname": "Finance within the Macroeconomy",
    "info": "This course is intended to provide you with an understanding of modern macroeconomics. We are particularly interest in how financial markets and institutions fit into the overall macro system. By the time that the term is over you will have a much stronger sense of the ongoing macroeconomic news and policy discussion. Having a sense of this material is often helpful in job interviews as well. \n\nprereq: Fall A Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "816567",
    "code": "MSF6801",
    "subject": "MSF",
    "number": "6801",
    "honors": false,
    "writing": false,
    "name": "Finance Independent Study",
    "fullname": "Finance Independent Study Masters Program",
    "info": "Independent Study.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "815368",
    "code": "MSF6821",
    "subject": "MSF",
    "number": "6821",
    "honors": false,
    "writing": false,
    "name": "Experiential Learning",
    "fullname": "Experiential Learning",
    "info": "This course is the first half of the experiential learning segment of this program. Students will be partitioned into groups to investigate a particular project. The students will identify the most crucial issues associated with the project, collect the necessary data that will be used to analyze the issue at hand, and determine the quantitative tools that will be required to analyze the relevant issues.  \n\nprereq: completion of Fall Cohort.",
    "prereq": {}
  },
  {
    "uid": "815365",
    "code": "MSF6822",
    "subject": "MSF",
    "number": "6822",
    "honors": false,
    "writing": false,
    "name": "Experiential Learning II",
    "fullname": "Experiential Learning II:  Financial Data Analysis",
    "info": "This course is the second half of the experiential learning segment of this program. With all the preparation done in the previous class, the students now turn to quantitatively and qualitatively analyzing their project. Near the end of the term, the student groups will present their findings to local industry professionals.  \n\nprereq: Fall A Cohort Completion",
    "prereq": {}
  },
  {
    "uid": "817926",
    "code": "MSF6921",
    "subject": "MSF",
    "number": "6921",
    "honors": false,
    "writing": false,
    "name": "Introduction to Python",
    "fullname": "Introduction to Python",
    "info": "This course is focused on analyzing economic and financial data using Python. You will learn how to access powerful and popular libraries for data access, analysis, and visualization. We will spend most of our class time completing practical, hands-on exercises.",
    "prereq": {}
  }
]