[
  {
    "uid": "820135",
    "code": "MSMK6051",
    "subject": "MSMK",
    "number": "6051",
    "honors": false,
    "writing": false,
    "name": "Marketing Intelligence",
    "fullname": "Marketing Intelligence",
    "info": "Methods for collecting/analyzing data to solve marketing problems. Survey research techniques. Research design, secondary/primary data collection, sample design, data analysis. Application of techniques to marketing problems, marketing research projects.\n\n",
    "prereq": {}
  },
  {
    "uid": "820134",
    "code": "MSMK6052",
    "subject": "MSMK",
    "number": "6052",
    "honors": false,
    "writing": false,
    "name": "MKTG Analytics:Decision Making",
    "fullname": "Marketing Analytics:Decision Making",
    "info": "This course focuses on learning how to use quantitative analysis tools to solve real-life problems in business. Rather than developing complicated mathematical models, the course aims at learning how to apply analytic techniques to a typical business decision problem, obtaining business management insights, and developing recommendations. The lecture and group activities will be topic-driven and sample topics include market analysis, targeting, customer value assessment, and new product development. Considering the popularity and convenience of it in business decisions, Excel will be the main software for the course, with occasional application of SPSS for a few specific functions.",
    "prereq": {}
  },
  {
    "uid": "820140",
    "code": "MSMK6053",
    "subject": "MSMK",
    "number": "6053",
    "honors": false,
    "writing": false,
    "name": "MKTG Analytics:Insights",
    "fullname": "Marketing Analytics:Insights",
    "info": "Customer Analytics addresses how to use data to learn about and market to individual customers. Marketing is evolving from an art to a science. Many firms have extensive data about consumers' choices and how they react to marketing campaigns, but few firms have the expertise to intelligently act on such information. In this course, students will learn the scientific approaches to analyze and act on customer information. While students will employ quantitative methods in the course, the goal is not to produce experts in statistics; rather, students will gain the competency and working experience to interact with and manage a marketing analytics team. The course uses a combination of lectures, cases, and exercises to learn the material. This course takes a hands-on approach with real-world databases and equips students with tools that can be used immediately on the job.",
    "prereq": {}
  },
  {
    "uid": "820136",
    "code": "MSMK6055",
    "subject": "MSMK",
    "number": "6055",
    "honors": false,
    "writing": false,
    "name": "Buyer Behavior",
    "fullname": "Buyer Behavior",
    "info": "Application of behavioral sciences to understanding buyer behavior. Perceptions, memory, affect, learning, persuasion, motivation, behavioral decision theory, social/cultural influences, and managerial implications. Emphasizes class discussion.",
    "prereq": {}
  },
  {
    "uid": "820137",
    "code": "MSMK6076",
    "subject": "MSMK",
    "number": "6076",
    "honors": false,
    "writing": false,
    "name": "Customer Relationship Mgmt",
    "fullname": "Customer Relationship Management",
    "info": "Management of personal selling. Sales force organization, effort allocation, personnel selection, motivation, compensation, performance evaluation.",
    "prereq": {}
  },
  {
    "uid": "820138",
    "code": "MSMK6078",
    "subject": "MSMK",
    "number": "6078",
    "honors": false,
    "writing": false,
    "name": "Advertising and Promotion",
    "fullname": "Advertising and Promotion",
    "info": "Managing communication. Advertising, sales promotion, public relations, direct marketing. Setting communications objectives and budgets, media selection, creative strategy, sales promotion techniques.",
    "prereq": {}
  },
  {
    "uid": "825124",
    "code": "MSMK6082",
    "subject": "MSMK",
    "number": "6082",
    "honors": false,
    "writing": false,
    "name": "Brand Strategy",
    "fullname": "Brand Strategy",
    "info": "Management of brands/brand equity in modern business enterprises. Measuring brand equity. Building brand equity. Leveraging brand equity through brand extensions/alliances. Lectures, case studies, group brand projects.",
    "prereq": {}
  },
  {
    "uid": "820149",
    "code": "MSMK6086",
    "subject": "MSMK",
    "number": "6086",
    "honors": false,
    "writing": false,
    "name": "Digital Marketing",
    "fullname": "Digital Marketing",
    "info": "Marketing practices have dramatically shifted with the rise of social media and the proliferation of devices, platforms, and applications. This rapidly changing environment presents new opportunities and challenges for marketers. Through a combination of case studies, best practice examples, current news items, and assignments, students learn how the elements of a digital strategy work together with traditional media to attract prospective customers. Specifically, students learn best practices for social media marketing, content marketing, organic and paid search, search engine optimization, e-mail marketing, landing pages, and display advertising. Students discuss strategies for reputation management in a world where information is disseminated virally and discover how social media monitoring and data analysis can be used to improve marketing and product development activities. The importance of establishing digital marketing goals and analytics is covered as well as how to measure return on investment for digital activities. ",
    "prereq": {}
  },
  {
    "uid": "820139",
    "code": "MSMK6088",
    "subject": "MSMK",
    "number": "6088",
    "honors": false,
    "writing": false,
    "name": "Strategic Marketing",
    "fullname": "Strategic Marketing",
    "info": "Determining product-markets where organization should compete. Sustainable competitive advantage. Matching marketing strategy with environment. Coordinating marketing, other business functions. Organizing marketing function/management. [with Simulation]",
    "prereq": {}
  },
  {
    "uid": "820096",
    "code": "MSMK6205",
    "subject": "MSMK",
    "number": "6205",
    "honors": false,
    "writing": false,
    "name": "Business Fundamentals for MKTG",
    "fullname": "Business Fundamentals for Marketing",
    "info": "This course focuses on fundamental business topics and knowledge central for marketers. These include understanding the fundamentals of finance, accounting, management, and operations. After taking this course students will understand business financials and the role of marketing with a larger business organization.\n",
    "prereq": {}
  },
  {
    "uid": "820141",
    "code": "MSMK6211",
    "subject": "MSMK",
    "number": "6211",
    "honors": false,
    "writing": false,
    "name": "Marketing Management",
    "fullname": "Marketing Management",
    "info": "Management of the marketing function; understanding the basic foundational marketing\nconcepts and skills in strategy development and planning of operational and strategic\nlevels pertaining to product offering decisions, distribution channels, pricing and\ncommunication.",
    "prereq": {}
  },
  {
    "uid": "820097",
    "code": "MSMK6281",
    "subject": "MSMK",
    "number": "6281",
    "honors": false,
    "writing": false,
    "name": "Customer Experience Management",
    "fullname": "Customer Experience Management",
    "info": "This course focuses on qualitative marketing research. Skills include strategic observation, interviewing, focus groups, and customer journey mapping. After taking this course, students will be able to understand how to effectively gather information to understand customer experience. ",
    "prereq": {}
  },
  {
    "uid": "820099",
    "code": "MSMK6505",
    "subject": "MSMK",
    "number": "6505",
    "honors": false,
    "writing": false,
    "name": "Enterprise Project",
    "fullname": "Enterprise Project",
    "info": "This course centers on doing a real marketing project for a real company. Guided by faculty, this hands-on course is like a capstone experience that enables students to integrate all their skills into an applied deliverable project for an actual organization. After taking this course, students will be prepared to work effectively in an organization in a marketing function. ",
    "prereq": {}
  },
  {
    "uid": "820098",
    "code": "MSMK6901",
    "subject": "MSMK",
    "number": "6901",
    "honors": false,
    "writing": false,
    "name": "Project Management",
    "fullname": "Project Management",
    "info": "This course focuses on effective project management skills. Skills include working in groups, managing tasks and timelines, and effective communication. After taking this course students will be prepared to effectively work in groups on business projects. ",
    "prereq": {}
  }
]