[
  {
    "uid": "803566",
    "code": "NSCI1001",
    "subject": "NSCI",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Fundamental Neurosci",
    "fullname": "Fundamental Neuroscience: Understanding Ourselves",
    "info": "Assessing objectively the neuroscience information presented to public at-large across various media outlets. Explaining the potential importance of these discoveries.",
    "prereq": {}
  },
  {
    "uid": "814050",
    "code": "NSCI1002",
    "subject": "NSCI",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Social Neuroscience",
    "fullname": "Social Neuroscience: Understanding Others",
    "info": "The field of neuroscience makes a special contribution to our understanding of the human condition, as it can both help us understand ourselves and also how we interact in a world of other individuals. Historically, there has been a dichotomy between disciplines that identify the abstract principles of the social world we live in and the biology of the organ (i.e., the central nervous system) we use to identify and coordinate those abstract principles as we function in our daily lives. By merging these disciplines and studying our interactions with the world on many layers of analysis, from genes to social dynamics, we can develop a richer understanding of who we are as people.\n\nprereq: None",
    "prereq": {}
  },
  {
    "uid": "817437",
    "code": "NSCI2001",
    "subject": "NSCI",
    "number": "2001",
    "honors": false,
    "writing": false,
    "name": "Human Neuroanatomy w/out lab",
    "fullname": "Human Neuroanatomy (without a lab)",
    "info": "This course will provide a broad introduction to the nervous system with an emphasis on the human nervous system. The course will introduce the structure and function of neurons, the major anatomical parts of the nervous system and the main functional systems. Functional systems will be approached through an understanding of the anatomical circuitry. The fundamental concepts of neurochemical communication studied in general terms in the first part of the course will be re-examined relative to specific functional systems later in the course. Although the major focus of the course will be on the normal nervous system, common diseases will be introduced for each main topic. Students will gain an understanding of the nature of many neurological diseases, which will provide further insight into how the normal nervous system functions. The neuronal substrates of learning/memory, addiction and drug actions will be examined. Through the lectures, discussions and other resources, students will be expected to gain an understanding of the neural circuitry and information processing responsible for the diverse range of human behaviors.\n\nThe material covered in Nsci 2001 and 2100 is very similar. N2100 is taught only fall semester. It is a traditional lecture course that includes a weekly laboratory. The faculty believe that the laboratory is a valuable part of the course. N2001 is taught only spring semester for those who cannot take the fall course. It does not have a lab, but has the advantage of a flipped format. In N2001, students will be expected to watch the assigned lectures prior to coming to class. Class time will be spent on exercises and discussions that use the material presented in the online lectures. Students who take one of these two courses will not be allowed to take the other course.\n\nFor more information, see http://mcloonlab.neuroscience.umn.edu/2001/index.htm\n\n",
    "prereq": {}
  },
  {
    "uid": "808052",
    "code": "NSCI2101",
    "subject": "NSCI",
    "number": "2101",
    "honors": false,
    "writing": false,
    "name": "Human Neuroanatomy",
    "fullname": "Human Neuroanatomy",
    "info": "This course will provide a broad introduction to the nervous system with an emphasis on the human nervous system. The course will introduce the structure and function of neurons, the major anatomical parts of the nervous system and the main functional systems. Functional systems will be approached through an understanding of the anatomical circuitry. The fundamental concepts of neurochemical communication studied in general terms in the first part of the course will be re-examined relative to specific functional systems later in the course. Although the major focus of the course will be on the normal nervous system, common diseases will be introduced for each main topic. Students will gain an understanding of the nature of many neurological diseases, which will provide further insight into how the normal nervous system functions. The neuronal substrates of learning/memory, addiction and drug actions will be examined. Through the lectures, laboratory exercises and other resources, students will be expected to gain an understanding of the neural circuitry and information processing responsible for the diverse range of human behaviors. \nThe material covered in Nsci 2001 and 2100 is very similar. N2100 is taught only fall semester. It is a traditional lecture course that includes a weekly laboratory. The faculty believe that the laboratory is a valuable part of the course. N2001 is taught only spring semester for those who cannot take the fall course. It does not have a lab, but has the advantage of a flipped format. In N2001, students will be expected to watch the assigned lectures prior to coming to class. Class time will be spent on exercises and discussions that use the material presented in the online lectures. Students who take one of these two courses will not be allowed to take the other course. \n\nFor more information, see http://mcloonlab.neuroscience.umn.edu/2100/index.htm\n",
    "prereq": {}
  },
  {
    "uid": "807869",
    "code": "NSCI3001W",
    "subject": "NSCI",
    "number": "3001",
    "honors": false,
    "writing": true,
    "name": "Neuroscience and Society",
    "fullname": "Neuroscience and Society",
    "info": "Ethical implications. Readings, personal reflections, class discussions, debates, and formal writing. Development of logical arguments, writing skills, oral presentation skills, and teamwork. Students present/argue both their own personal views and those of others. What it is like to have altered mentation, i.e. a brain disease or disability. Readings/multimedia reports from primary neuroscience literature as well as philosophy, policy, and law literature and popular media.",
    "prereq": {}
  },
  {
    "uid": "790199",
    "code": "NSCI3101",
    "subject": "NSCI",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "Neurobio I: Mol Cell Systems",
    "fullname": "Neurobiology I: Molecules, Cells, and Systems",
    "info": "This course discusses the basic principles of cellular and molecular neurobiology and nervous systems. The main topics include: Organization of simple networks, neural systems and behavior; how the brain develops and the physiology and communication of neurons and glia; the molecular and genetic basis of cell organization; ion channel structure and function; the molecular basis of synaptic receptors; transduction mechanisms and second messengers; intracellular regulation of calcium; neurotransmitter systems, including excitation and inhibition, neuromodulation, system regulation, and the cellular basis of learning, memory, and cognition. The course is intended for students majoring in neuroscience, but is open to all students with the required prerequisites.\n\nThis course is offered in person in the fall and spring semesters and online ONLY in the summer semester. The online summer section covers the same material at the same depth and breadth as the in person fall and spring sections of the course.  However, the summer session is 13 weeks (fall and spring are 14 weeks), so the summer course will progress at a slightly faster pace.  This is a 3 credit course, so it is expected that students will spend about 150 hours working on course material.  This means that the average student can expect to spend ~12 hrs/week on the course. How much time individual students need to spend working on course material will depend on their learning styles.\n",
    "prereq": {}
  },
  {
    "uid": "790201",
    "code": "NSCI3102W",
    "subject": "NSCI",
    "number": "3102",
    "honors": false,
    "writing": true,
    "name": "Neurobiol II: Perception Behav",
    "fullname": "Neurobiology II: Perception and Behavior",
    "info": "This is the second of the introductory neurobiology courses. It introduces fundamental concepts in systems and behavioral neuroscience with emphasis on the neural circuits underlying perception and sensorimotor integration. Lectures will examine the neural basis of specific behaviors arising from the oculomotor, visual and auditory systems and notes are available on Canvas. Topics include: retinal processing, functional organization in the cerebral cortex, neural circuit development, language, reward, and addiction. Students must learn to read scientific papers, and to understand the main ideas well enough to synthesize them and communicate them both orally and in writing. The course is writing intensive: exams are in essay and short answer format, and a 10-15 page term paper is required. The course is required for students majoring in neuroscience. The course consists of two hours of lecture and one hour of discussion per week.",
    "prereq": {}
  },
  {
    "uid": "810860",
    "code": "NSCI3505W",
    "subject": "NSCI",
    "number": "3505",
    "honors": false,
    "writing": true,
    "name": "Mind and Brain",
    "fullname": "Mind and Brain",
    "info": "This course is intended as an introduction to the new views on the relationship between mind and brain.  Over the last several decades, a new view of cognition and neural processing has been developed based on the concepts of al¬gorithm, representation, computation, and information processing.  Within this theoretical frame¬work, psychological constructs are computational processes occur¬ring across physical neural systems.  We will take a neuroscience and psychological perspective in which the physical neuroscience instantiates but does not diminish the psychological constructs.  Although our conceptual framework will be computational, this course will not require or expect any mathematical or computer background. \n \nAt the completion of this class, you will understand the implications of the physical nature of the brain – how mentation is explicable from physical processes, and how decision-making arises from those same physical processes.  Importantly, you will also understand the limitations of current knowledge and the methodologies being used to push those limitations.  This class is not intended as a final step in this understanding, but as a first step into these issues.  At the conclusion of the class, you should have sufficient understanding to continue more in-depth reading and study in these issues.  \n\nThere are no official prerequisites.  However, I have found that students who have EITHER a strong computational background (computer science, mathematics, economics, physics) OR have taken an introductory neuroscience course (e.g. Nsci 2100) have done better in the class than students with no background.  However, I have seen students come in with very little background and do well in the class if they engage with the class and work hard.",
    "prereq": {}
  },
  {
    "uid": "820477",
    "code": "NSCI3700",
    "subject": "NSCI",
    "number": "3700",
    "honors": false,
    "writing": false,
    "name": "Neuroscience Journal Club",
    "fullname": "Neuroscience Journal Club",
    "info": "In this journal club, students will read and discuss original scientific research articles. Each section will focus on a topic chosen by the instructor and each class meeting will focus on a different research article on the chosen topic. Topics may take a historical perspective (e.g. Ground breaking articles in addiction research) or focus on timely issues (e.g. Neuroethics: How do recent advances in neuroscience influence of legal system?). Students will take turns being the presenter, which includes presenting background material relevant to the article and as well as leading a critical discussion of the research findings and interpretation of the data.",
    "prereq": {}
  },
  {
    "uid": "803723",
    "code": "NSCI4101",
    "subject": "NSCI",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Developmental Neuroscience",
    "fullname": "Development of the Nervous System: Cellular and Molecular Mechanisms",
    "info": "This course will extend students’ understanding of fundamental concepts of biology and neuroscience through study of the cellular and molecular mechanisms that underlie development of the nervous system. Neurodevelopment provides a context in which to study processes active in many biological functions and diseases. Students will learn about each of the major cellular processes involved in development of the nervous system such as cell division and cell migration, and will learn about the function of molecules and signaling pathways active in each process. Human developmental pathologies will be studied as a means to better understand normal developmental processes. Some lectures will focus on current research, and students will be expected to read some scientific literature. ",
    "prereq": {}
  },
  {
    "uid": "790200",
    "code": "NSCI4105",
    "subject": "NSCI",
    "number": "4105",
    "honors": false,
    "writing": false,
    "name": "Neurobiology Laboratory I",
    "fullname": "Neurobiology Laboratory I",
    "info": "Principles, methods, and laboratory exercises for investigating neural mechanisms and examining experimental evidence.",
    "prereq": {}
  },
  {
    "uid": "791010",
    "code": "NSCI4115",
    "subject": "NSCI",
    "number": "4115",
    "honors": false,
    "writing": false,
    "name": "Neurobiology Laboratory II",
    "fullname": "Neurobiology Laboratory II",
    "info": "Principles, methods, and laboratory exercises for investigating neural mechanisms and examining experimental evidence.",
    "prereq": {}
  },
  {
    "uid": "016344",
    "code": "NSCI4150",
    "subject": "NSCI",
    "number": "4150",
    "honors": false,
    "writing": false,
    "name": "Adv Topics Neuroscience",
    "fullname": "Advanced Topics in Neuroscience",
    "info": "In-depth study of aspects of neurodevelopment, neurochemistry/molecular neuroscience, sensory systems, motor control, and behavioral neuroscience. Primarily for undergraduates majoring in neuroscience or related areas.",
    "prereq": {}
  },
  {
    "uid": "792286",
    "code": "NSCI4167",
    "subject": "NSCI",
    "number": "4167",
    "honors": false,
    "writing": false,
    "name": "Neuroscience in the Community",
    "fullname": "Neuroscience in the Community",
    "info": "A service learning experience in which a student is paired with a middle school science teacher who has completed the BrainU program in neuroscience. Student observes and assists in implementing previously developed neuroscience educational activities and designs and implements a new classroom activity to teach concepts of neuroscience to middle school learners.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "818443",
    "code": "NSCI4201",
    "subject": "NSCI",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Neuroscience of Drug Abuse",
    "fullname": "Neuroscience of Drug Abuse",
    "info": "The use and abuse of illicit drugs is an ongoing and insidious world problem. Neuroscience research has contributed importantly to understanding drug abuse as a disease of the nervous system. The goal of this course will be to provide a clinical characterization of drug abuse from a human perspective. From there animal models of drug use and addiction will be discussed as a basis for research examining cellular and molecular mechanisms of the effects of drugs on the nervous system. As all drugs of abuse have a common neurobiology, that neurobiology will be examined from a circuit perspective that will include the underlying molecular control. Collectively students should develop a comprehensive view of the problem of drug addiction including prospects for the development of neurobiologically-based therapeutics.",
    "prereq": {}
  },
  {
    "uid": "825424",
    "code": "NSCI4444",
    "subject": "NSCI",
    "number": "4444",
    "honors": false,
    "writing": false,
    "name": "Learning and Memory",
    "fullname": "Learning and Memory",
    "info": "Students in this class will evaluate current cellular and systems-level neuroscience concepts of learning and memory and will explore how our contemporary understanding of neuroscience could, should or does influence educational practice and policy.",
    "prereq": {}
  },
  {
    "uid": "818444",
    "code": "NSCI4501",
    "subject": "NSCI",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Neurodegenerative Diseases",
    "fullname": "Neurodegenerative Diseases, Mechanisms to Therapies",
    "info": "With a rapid increase in population aging in western educated industrialized rich democratic (WEIRD) societies, neurodegenerative disorders such as Alzheimer\u0092s disease have become an alarming health priority due to the current absence of disease-modifying therapies. The objective of this course is to acquire a fundamental appreciation for the most common degenerative disorders of the nervous system as well as to integrate central notions shared across these diseases and emerging concepts in the field",
    "prereq": {}
  },
  {
    "uid": "788854",
    "code": "NSCI4793W",
    "subject": "NSCI",
    "number": "4793",
    "honors": false,
    "writing": true,
    "name": "Directed Studies: WI",
    "fullname": "Directed Studies: Writing Intensive",
    "info": "Individual study of selected topics. Emphasis on readings, use of scientific literature. Writing intensive.\n\nprereq: instr consent, dept consent; no more than 7 cr of [4793, 4794, 4993, 4994] may count toward major requirements",
    "prereq": {
      "and": [
        "788854",
        "788855",
        "015456",
        "015458"
      ]
    }
  },
  {
    "uid": "788855",
    "code": "NSCI4794W",
    "subject": "NSCI",
    "number": "4794",
    "honors": false,
    "writing": true,
    "name": "Directed  Research: WI",
    "fullname": "Directed Research: Writing Intensive",
    "info": "Writing Intensive Directed Research is an individual-study, laboratory or field research experience in which the student is mentored directly by a faculty member. This course is not for students starting out in research. It is intended for students who already have been working in the research group of the mentor and have developed an independent research project. In this course the student will receive writing instruction through a writing support course (corresponding to 1 credit in addition to the credits of directed research time) that will meet weekly throughout the semester. The written output usually is in the form of a scientific paper describing the results of the student's project. Written output of the course must be revised during the semester and a schedule for writing, assessment, and revision needs to be in place at the beginning of the semester. The project needs to be explained in the campus Directed Research contract and the project and participation in the writing support course agreed on by both the student and faculty mentor. The contract must be approved by the Director of Undergraduate Studies (DUGS) for the major before the student is allowed to register. The contract includes a description of learning objectives for the course, agreement about how writing instruction will take place, confirmation of understanding of the timeline for when student writing will be handed in and how it will be assessed, methodology to be used by the student, and how assessment of learning will be conducted by the mentor. Additional oversight is established for this course - near the end of the semester the written output is submitted to the DUGS for the major. The DUGS is responsible to determine that the writing meets standards set by the CBS Education Policy Committee for quality of writing, appropriate citation of literature, well-constructed figures, tables, and legends (if present), appropriate use and interpretation of statistics (if present), conclusions that are supported by evidence, and well-formatted references. The DUGS can call for a final revision before a grade is given. This course is graded S/N by the writing support course instructor, and approval of both the DUGS and the research mentor is required before a grade of S can be given by the writing support course instructor.\n\nThis course is for non-Honors students. Students should register for the number of research credits they intend to pursue plus 1 cr for the writing support component (for example: 2-4 cr of research + 1 cr writing support = 3-5 cr).\n\nprereq: department consent, instructor consent, no more than a total of 7 credits of 4793W, 4794W, 4993, 4994 combined can count towards CBS major requirements.\n",
    "prereq": {
      "or": [
        "788854",
        "788855",
        "015456",
        "015458"
      ]
    }
  },
  {
    "uid": "015456",
    "code": "NSCI4993",
    "subject": "NSCI",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Individual study of selected topics with emphasis on selected readings and use of scientific literature.\n\nprereq: instr consent, dept consent; max of 7 cr of 4993 and/or 4994 may count toward major requirements",
    "prereq": {
      "or": [
        "015456",
        "015458"
      ]
    }
  },
  {
    "uid": "015458",
    "code": "NSCI4994",
    "subject": "NSCI",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Directed  Research",
    "fullname": "Directed Research",
    "info": "Lab or field investigation of selected areas of research.\n\nprereq: instr consent, dept consent; max of 7 cr of 4993 and/or 4994 may count toward major requirements",
    "prereq": {
      "or": [
        "015456",
        "015458"
      ]
    }
  },
  {
    "uid": "791109",
    "code": "NSCI5101",
    "subject": "NSCI",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Neurobio I: Mol Cell Systems",
    "fullname": "Neurobiology I: Molecules, Cells, and Systems",
    "info": "This course discusses the basic principles of cellular and molecular neurobiology and nervous systems. The main topics include: Organization of simple networks, neural systems and behavior; how the brain develops and the physiology and communication of neurons and glia; the molecular and genetic basis of cell organization; ion channel structure and function; the molecular basis of synaptic receptors; transduction mechanisms and second messengers; intracellular regulation of calcium; neurotransmitter systems, including excitation and inhibition, neuromodulation, system regulation and the cellular basis of learning, memory and cognition. The course is intended for students majoring in neuroscience, but is open to all students with the required prerequisites.",
    "prereq": {}
  },
  {
    "uid": "789428",
    "code": "NSCI5110",
    "subject": "NSCI",
    "number": "5110",
    "honors": false,
    "writing": false,
    "name": "Dental Neuroscience",
    "fullname": "Dental Neuroscience for Graduate Students",
    "info": "Structure/function of human nervous system. Lectures and reading assignments emphasize topics pertinent to dentistry.\n\nprereq: Credit will not be granted if credit has been received for: : 6110; BioC 3021, Biol 4004, instr consent; intended for grad students who require a comprehensive grad-level neuroscience course",
    "prereq": {
      "or": [
        "014017",
        "014290",
        "010881"
      ]
    }
  },
  {
    "uid": "789800",
    "code": "NSCI5111",
    "subject": "NSCI",
    "number": "5111",
    "honors": false,
    "writing": false,
    "name": "Medical Neuroscience",
    "fullname": "Medical Neuroscience for Graduate Students",
    "info": "Survey of molecular, cellular, and systems neuroscience as related to medicine. Lecture/lab.\n\nprereq: Credit will not be granted if credit has been received for: : 6111; BioC 3021, Biol 4004, instr consent; intended for grad students who require a comprehensive medically-oriented neuroscience course",
    "prereq": {
      "or": [
        "012638",
        "014290",
        "010881"
      ]
    }
  },
  {
    "uid": "813368",
    "code": "NSCI5300",
    "subject": "NSCI",
    "number": "5300",
    "honors": false,
    "writing": false,
    "name": "Biol Microscopy & Imaging",
    "fullname": "Biological Microscopy & Digital Imaging",
    "info": "Optical microscopy is among the most powerful available to biologists. Course introduces graduate students and advanced undergrad/honors students to its uses, to the principles that underlie its use and to the appropriate use of resulting digital images. Students ideally will have access to a microscope in a research laboratory.\n\nRequired Prerequisites: None.  \nRecommended Prerequisites: PHYS 1101 or PHYS 1201 or PHYS 1301 or PHYS 1401",
    "prereq": {}
  },
  {
    "uid": "818393",
    "code": "NSCI5501",
    "subject": "NSCI",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Neurodegenerative Diseases",
    "fullname": "Neurodegenerative Diseases, Mechanisms to Therapies",
    "info": "With a rapid increase in population aging in western educated industrialized rich democratic (WEIRD) societies, neurodegenerative disorders such as Alzheimer?s disease have become an alarming health priority due to the current absence of disease-modifying therapies. The objective of this course is to acquire a fundamental appreciation for the most common degenerative disorders of the nervous system as well as to integrate central notions shared across these diseases and emerging concepts in the field.",
    "prereq": {}
  },
  {
    "uid": "826037",
    "code": "NSCI5505",
    "subject": "NSCI",
    "number": "5505",
    "honors": false,
    "writing": false,
    "name": "Mind and Brain",
    "fullname": "Mind and Brain",
    "info": "This course is intended as an introduction to the new views on the relationship between mind and brain. Over the last several decades, a new view of cognition and neural processing has been developed based on the concepts of algorithm, representation, computation, and information processing. Within this theoretical framework, psychological constructs are computational processes occurring across physical neural systems.  We will take a neuroscience and psychological perspective in which the physical neuroscience instantiates but does not diminish the psychological constructs. Although our conceptual framework will be computational, this course will not require or expect any mathematical or computer background. \n \nAt the completion of this class, you will understand the implications of the physical nature of the brain, how mentation is explicable from physical processes, and how decision-making arises from those same physical processes. Importantly, you will also understand the limitations of current knowledge and the methodologies being used to push those limitations. This class is not intended as a final step in this understanding, but as a first step into these issues. At the conclusion of the class, you should have sufficient understanding to continue more in-depth reading and study in these issues.  \n\nThere are no official prerequisites. However, I have found that students who have EITHER a strong computational background (computer science, mathematics, economics, physics) OR have taken an introductory neuroscience course (e.g. NSCI 2100) have done better in the class than students with no background. However, I have seen students come in with very little background and do well in the class if they engage with the class and work hard.",
    "prereq": {}
  },
  {
    "uid": "796727",
    "code": "NSCI5540",
    "subject": "NSCI",
    "number": "5540",
    "honors": false,
    "writing": false,
    "name": "Biomedical Neuroscience",
    "fullname": "Advanced Survey of Biomedical Neuroscience",
    "info": "Current topics in biomedical neuroscience. Supporting, fundamental concepts. Intensive, one week course.",
    "prereq": {}
  },
  {
    "uid": "819632",
    "code": "NSCI5551",
    "subject": "NSCI",
    "number": "5551",
    "honors": false,
    "writing": false,
    "name": "Stats for Systems Neuroscience",
    "fullname": "Statistical Foundations of Systems Neuroscience",
    "info": "The purpose of this course is to provide the student with a familiarity with the mathematical and statistical techniques to practice contemporary systems neuroscience. Topics are chosen with a focus on current areas of active research, as well as problems that have driven the field over the past twenty years. The class will combine lectures with discussions of important systems neuroscience papers, and will move at a fast pace. It is intended for graduate students and ambitious undergraduates.\n\nOne major difference between this course and other math and statistics courses is the focus on systems neuroscience. Our examples will come from the Systems Neuroscience field. Our research priorities will come from Systems Neuroscience and our Friday paper discussions will draw exclusively from scholarly papers in Systems Neuroscience. \n",
    "prereq": {}
  },
  {
    "uid": "793452",
    "code": "NSCI5913",
    "subject": "NSCI",
    "number": "5913",
    "honors": false,
    "writing": false,
    "name": "BrainU 101",
    "fullname": "BrainU 101: Neuroscience in the Classroom",
    "info": "Two-week summer workshop. Week one focuses on training teachers in neuroscience through lectures, activities, and discussion sessions. Week two focuses on designing inquiry-based classroom investigations based on neuroscience education given during week one. Follow-up activities held during the academic year include BrainU staff/faculty classroom presentations and use of training materials.\n\nprereq: [Elementary or middle school or high school or preservice] teacher, instr consent, application",
    "prereq": {}
  },
  {
    "uid": "793453",
    "code": "NSCI5914",
    "subject": "NSCI",
    "number": "5914",
    "honors": false,
    "writing": false,
    "name": "BrainU 202",
    "fullname": "BrainU 202: Neuroscience in the Classroom",
    "info": "One-week summer workshop. Focuses on critiquing previously implemented neuroscience class activities, developing assessment tools, learning peer mentoring, and expanding neuroscience content knowledge. Follow-up activities held during academic year include BrainU staff/faculty classroom presentations, use of training materials, and peer mentoring sessions.",
    "prereq": {}
  },
  {
    "uid": "793454",
    "code": "NSCI5915",
    "subject": "NSCI",
    "number": "5915",
    "honors": false,
    "writing": false,
    "name": "BrainU 303",
    "fullname": "BrainU 303: Neuroscience in the Classroom",
    "info": "One-week summer workshop. Focuses on critiquing previously implemented neuroscience class activities and assessment tools, and expanding neuroscience content knowledge. Follow-up activities held during academic year include BrainU 303 participants. use of training materials and implementation of neuroscience investigations.",
    "prereq": {}
  },
  {
    "uid": "803907",
    "code": "NSCI5916",
    "subject": "NSCI",
    "number": "5916",
    "honors": false,
    "writing": false,
    "name": "BrainU 101",
    "fullname": "BrainU 101: Neuroscience in the Classroom",
    "info": "Four-weekend workshop. Concepts in neuroscience. Neurobiology of learning. Effects of drugs. Lectures, activities, discussion, designing investigations. In 2009-10, held in Winona. In 2010-11, held in Duluth.\n\nprereq: instr consent; intended for high school teachers",
    "prereq": {}
  },
  {
    "uid": "014017",
    "code": "NSCI6110",
    "subject": "NSCI",
    "number": "6110",
    "honors": false,
    "writing": false,
    "name": "Dental Neuroscience",
    "fullname": "Neuroscience for Dental Students",
    "info": "Structure/function of the human nervous system. Lectures, reading assignments.\n\nprereq: Credit will not be granted if credit has been received for: : 5110; Dental student",
    "prereq": {
      "or": [
        "789428"
      ]
    }
  },
  {
    "uid": "012638",
    "code": "NSCI6111",
    "subject": "NSCI",
    "number": "6111",
    "honors": false,
    "writing": false,
    "name": "Medical Neuroscience",
    "fullname": "Medical Neuroscience",
    "info": "Survey of molecular, cellular, systems neuroscience as related to medicine. Lecture/lab.\n\nprereq: med student",
    "prereq": {}
  },
  {
    "uid": "792936",
    "code": "NSCI6112",
    "subject": "NSCI",
    "number": "6112",
    "honors": false,
    "writing": false,
    "name": "Medical Neuroscience",
    "fullname": "Medical Neuroscience for Professional Students",
    "info": "Molecular, cellular, and systems neuroscience as related to medicine. Lecture, lab.\n\nprereq: BioC 3021, Biol 4004, instr consent; intended for non-medical professional students",
    "prereq": {
      "or": [
        "014290",
        "010881"
      ]
    }
  }
]