[
  {
    "uid": "826296",
    "code": "OBIO1",
    "subject": "OBIO",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "Rigor & Reproducibility",
    "fullname": "Principles of Scientific Rigor and Reproducibility",
    "info": "This course explores topics surrounding rigor and reproducibility in research that are critical for success in obtaining funding and publications. \n\nprereq: Graduate student in Oral Biology, Dental specialist, or instr consent",
    "prereq": {}
  },
  {
    "uid": "010349",
    "code": "OBIO5001",
    "subject": "OBIO",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Research Methods",
    "fullname": "Methods in Research and Writing",
    "info": "Skills necessary to begin a research project, including literature review, hypothesis formation, research design, and writing.  Each student develops a research protocol.",
    "prereq": {}
  },
  {
    "uid": "819434",
    "code": "OBIO5010",
    "subject": "OBIO",
    "number": "5010",
    "honors": false,
    "writing": false,
    "name": "Molecular Virology",
    "fullname": "Molecular Virology",
    "info": "This course provides graduate students and upper-level undergraduate students with a knowledge base for understanding the molecular aspects of replication strategies utilized in virus replication. Topics for the course will focus on the molecular aspects of virus replication for the major virus families (e.g., arenaviruses, bacteriophages, flaviviruses, herpesviruses, orthomyxoviruses, picornaviruses, and retroviruses) as well as virus evolution, structure, and taxonomy.",
    "prereq": {}
  },
  {
    "uid": "819435",
    "code": "OBIO5020",
    "subject": "OBIO",
    "number": "5020",
    "honors": false,
    "writing": false,
    "name": "Virus Pathogenesis",
    "fullname": "Virus Pathogenesis and Host Interactions",
    "info": "This course provides graduate students and upper-level undergraduate students with a knowledge base for understanding virus pathogenesis and host interactions. Topics for the course will focus on the molecular, cellular, and organismal aspects of virus pathogenesis and host interactions. The concepts of cellular pathogenesis, tissue tropism, portals of entry, local replication and virus spread, virus dissemination, and congenital infections will be covered. A particular emphasis will be placed on virus pathogenesis of the major virus families (e.g., arenaviruses, bacteriophages, flaviviruses, herpesviruses, orthomyxoviruses, picornaviruses, and retroviruses) and virus-host cell interactions that can restrict virus replication and are responsible for immunity will be discussed.",
    "prereq": {}
  },
  {
    "uid": "816897",
    "code": "OBIO5050",
    "subject": "OBIO",
    "number": "5050",
    "honors": false,
    "writing": false,
    "name": "Evolution of Emerging Viruses",
    "fullname": "Evolution of Emerging Viruses",
    "info": "This course is designed to provide graduate students and undergraduate students with junior or senior standing a knowledge base for understanding how HIV and other emerging viruses (e.g., Ebola, influenza, SARS, West Nile virus, hantavirus, hepatitis C) evolve and become public health threats. Topics for the course will focus on the biochemical, molecular, cellular, clinical, and epidemiological aspects of emerging viruses, with an emphasis on how each plays a role in virus evolution and emergence. This course will emphasize HIV as a key example of an emerging virus disease that has had a profound impact on human health.  ",
    "prereq": {}
  },
  {
    "uid": "826032",
    "code": "OBIO6500",
    "subject": "OBIO",
    "number": "6500",
    "honors": false,
    "writing": false,
    "name": "Research in Oral Biology",
    "fullname": "Research Topics in Oral Health & Biology",
    "info": "This course introduces graduate students and dental residents to research areas in oral health and biology through faculty experts.  Students  learn to critically read and review research articles. \nPrereq: Graduate student in Oral Biology, Dental specialist, or instr consent\n",
    "prereq": {}
  },
  {
    "uid": "826300",
    "code": "OBIO8001",
    "subject": "OBIO",
    "number": "8001",
    "honors": false,
    "writing": false,
    "name": "Rigor & Reproducibility",
    "fullname": "Principles of Scientific Rigor and Reproducibility",
    "info": "This course explores topics surrounding rigor and reproducibility in research that are critical for success in obtaining funding and publications.   \n\nprereq: Graduate student in Oral Biology, Dental specialist, or instr consent",
    "prereq": {}
  },
  {
    "uid": "010354",
    "code": "OBIO8011",
    "subject": "OBIO",
    "number": "8011",
    "honors": false,
    "writing": false,
    "name": "Oral Biology",
    "fullname": "Oral Biology",
    "info": "Salivary secretions, composition and function, orofacial development, anatomy/genetics. Oral aspects of inflammation, wound healing, and immunology. Plaque formation, composition, metabolism, and clinical control. Biochemistry of connective/mineralized tissues. Neurobiology/pathophysiology of orofacial pain/sensations.",
    "prereq": {}
  },
  {
    "uid": "804274",
    "code": "OBIO8012",
    "subject": "OBIO",
    "number": "8012",
    "honors": false,
    "writing": false,
    "name": "Skeletal Biology",
    "fullname": "Basic Concepts in Skeletal Biology",
    "info": "Cells (osteoblasts, osteoclasts, chrondrocytes) that make up skeleton. Transcription/signaling networks that regulate cell growth/differentiation. Mechanisms of bone remodeling. Regulation of bone by such agents such as hormones.\nPrereq Grad student or instr consent.",
    "prereq": {}
  },
  {
    "uid": "810435",
    "code": "OBIO8018",
    "subject": "OBIO",
    "number": "8018",
    "honors": false,
    "writing": false,
    "name": "Oral Pathobiology",
    "fullname": "Topics in Oral Pathobiology",
    "info": "Clinical understanding of oral disease. Correlates about underlying basic mechanisms in microbiology, immunology, cancer biology, developmental biology, neuroscience. Dialog between clinic/bench to improve preventative/treatment modalities.\n\nprereq: All students must be degree-seeking graduate students or dental fellows and should hold a PhD or DDS. instr consent for 4th year dental students and PhD students. CDE available for practitioners.",
    "prereq": {}
  },
  {
    "uid": "825646",
    "code": "OBIO8020",
    "subject": "OBIO",
    "number": "8020",
    "honors": false,
    "writing": false,
    "name": "Virus Pathogenesis",
    "fullname": "Virus Pathogenesis and Host Interactions",
    "info": "This course provides graduate students  with a knowledge base for understanding virus pathogenesis and host interactions. Topics for the course will focus on the molecular, cellular, and organismal aspects of virus pathogenesis and host interactions. The concepts of cellular pathogenesis, tissue tropism, portals of entry, local replication and virus spread, virus dissemination, and congenital infections will be covered. A particular emphasis will be placed on virus pathogenesis of the major virus families (e.g.,\narenaviruses, bacteriophages, flaviviruses, herpesviruses, orthomyxoviruses, picornaviruses, and retroviruses) and virus-host cell interactions that can restrict virus replication and are responsible for immunity will be discussed.",
    "prereq": {}
  },
  {
    "uid": "010591",
    "code": "OBIO8021",
    "subject": "OBIO",
    "number": "8021",
    "honors": false,
    "writing": false,
    "name": "Oral Micro",
    "fullname": "Oral Microbiology",
    "info": "Role of indigenous human oral microflora in health/disease. Colonization of oral cavity. Role of specific pathogens in development of dental caries and periodontal diseases. Infections of dental pulp and periapical tissues. Oral manifestations of viral/fungal infections. Microbial considerations in specialty areas of dental practice.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "010612",
    "code": "OBIO8022",
    "subject": "OBIO",
    "number": "8022",
    "honors": false,
    "writing": false,
    "name": "Oral Neuroscience",
    "fullname": "Oral Neuroscience",
    "info": "Background lectures and student presentations on current research topics to evaluate questions in general motor/sensory function related to oral/nasal structures. Taste, smell, and other chemical senses as they relate to those structures.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "010365",
    "code": "OBIO8023",
    "subject": "OBIO",
    "number": "8023",
    "honors": false,
    "writing": false,
    "name": "Masticatory Physiol",
    "fullname": "Physical Biology of the Oral Cavity",
    "info": "Structure/function of load-bearing components of human masticatory system from biophysical point of view. Mandibular form/movement. Infrastructure of hard tissues as related to occlusal wear and masticatory efficiency. Role of saliva and salivary pellicle in reduction of interocclusal friction. Computer simulation of jaw mechanics.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "010380",
    "code": "OBIO8024",
    "subject": "OBIO",
    "number": "8024",
    "honors": false,
    "writing": false,
    "name": "Gen & Hum Dis",
    "fullname": "Genetics and Human Disease",
    "info": "Principles of medical genetics. Emphasizes oral diseases. Twins, chromosomes, recombinant DNA, major gene traits, genes in populations, chromosomal abnormalities, complex traits, facial clefts, dental caries, periodontal diseases.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "010390",
    "code": "OBIO8025",
    "subject": "OBIO",
    "number": "8025",
    "honors": false,
    "writing": false,
    "name": "Cariology",
    "fullname": "Topics in Cariology",
    "info": "Lectures, assigned readings, and discussions of basic epidemiological, biological, and chemical aspects of dental caries. Etiology, epidemiology, and pathogenesis of dental caries. Influence of dietary, salivary, plaque, and microbial factors on caries process.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "010373",
    "code": "OBIO8026",
    "subject": "OBIO",
    "number": "8026",
    "honors": false,
    "writing": false,
    "name": "Saliva; Secretions",
    "fullname": "Salivary Glands and Secretions",
    "info": "Salivary gland structure/development. Mechanisms/control of macromolecule/electrolyte secretion. Salivary protein structure/function, interactions with bacteria. Salivary pellicle, salivary gland disease. Clinical studies, readings, student presentations. Each student develops a research proposal.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "010403",
    "code": "OBIO8027",
    "subject": "OBIO",
    "number": "8027",
    "honors": false,
    "writing": false,
    "name": "Biomaterials in Regen. Dent.",
    "fullname": "Biomaterials in Regenerative Dentistry",
    "info": "Describes most modern research strategies that are being developed by interdisciplinary groups to obtain revolutionary materials for its use in tissue engineering and regenerative medicine. The central role of biotechnology, nanotechnology, and biomimetics in these research strategies is highlighted. Focus on dental applications is provided.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "010586",
    "code": "OBIO8028",
    "subject": "OBIO",
    "number": "8028",
    "honors": false,
    "writing": false,
    "name": "Cell/Micro Adhesion",
    "fullname": "Molecular Basis of Cellular and Microbial Adhesion",
    "info": "Biochemical basis of adhesion phenomena. Cells of immune system, development of organs, tissue formation, bacterial colonization of the human.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "010407",
    "code": "OBIO8030",
    "subject": "OBIO",
    "number": "8030",
    "honors": false,
    "writing": false,
    "name": "Seminar",
    "fullname": "Oral Biology Seminar",
    "info": "Faculty and student discussion of current topics in oral biology.\n\nprereq: Dental specialist or oral research trainee or instr consent",
    "prereq": {}
  },
  {
    "uid": "825429",
    "code": "OBIO8050",
    "subject": "OBIO",
    "number": "8050",
    "honors": false,
    "writing": false,
    "name": "Evolution of Emerging Viruses",
    "fullname": "Evolution of Emerging Viruses",
    "info": "This course is designed to provide PhD-level graduate students a knowledge base for understanding how HIV and other emerging viruses (e.g., Ebola, influenza, SARS, West Nile virus, hantavirus, hepatitis C) evolve and become public health threats. Topics for the course will focus on the biochemical, molecular, cellular, clinical, and epidemiological aspects of emerging viruses, with an emphasis on how each plays a\nrole in virus evolution and emergence. This course will emphasize HIV as a key example of an emerging virus disease that has had a profound impact on human health. MS-level and advanced undergraduate students should register for OBIO 5050.",
    "prereq": {}
  },
  {
    "uid": "010571",
    "code": "OBIO8093",
    "subject": "OBIO",
    "number": "8093",
    "honors": false,
    "writing": false,
    "name": "Tutorial",
    "fullname": "Tutorial in Oral Biology",
    "info": "Semester-long apprenticeship with faculty members to familiarize students with faculty research interests. Individual study of selected topics.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "010573",
    "code": "OBIO8094",
    "subject": "OBIO",
    "number": "8094",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "tbd\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "788252",
    "code": "OBIO8333",
    "subject": "OBIO",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "795245",
    "code": "OBIO8371",
    "subject": "OBIO",
    "number": "8371",
    "honors": false,
    "writing": false,
    "name": "Mucosal Immunobiology",
    "fullname": "Mucosal Immunobiology",
    "info": "Host immune processes at body surfaces. Innate/adaptive immunity at mucosal surfaces. Interactions/responses of various mucosal tissues to pathogens. Approaches to target protective vaccination to mucosal tissues. Lectures, journal.\n\nprereq: MICa 8001 or equiv or instr consent",
    "prereq": {}
  },
  {
    "uid": "788384",
    "code": "OBIO8444",
    "subject": "OBIO",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788506",
    "code": "OBIO8666",
    "subject": "OBIO",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "tbd\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {
      "or": [
        "826296"
      ]
    }
  },
  {
    "uid": "788634",
    "code": "OBIO8777",
    "subject": "OBIO",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {
      "or": [
        "826296"
      ]
    }
  },
  {
    "uid": "787901",
    "code": "OBIO8888",
    "subject": "OBIO",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {
      "or": [
        "826296"
      ]
    }
  }
]