[
  {
    "uid": "816765",
    "code": "OLPD1231",
    "subject": "OLPD",
    "number": "1231",
    "honors": false,
    "writing": false,
    "name": "Technological Change & Work",
    "fullname": "Technological Change and Workplace Learning: Past and Present",
    "info": "Within the historical context of the United States over the past 150 years, this course examines how we learn to be \"good workers.\" The impact of multiple technological changes on workplace learning and broader American society is the main thematic focus of the course. In other words, how have various technologies continually re-made workers and disciplined them into being \"good workers\"?",
    "prereq": {}
  },
  {
    "uid": "787862",
    "code": "OLPD1301W",
    "subject": "OLPD",
    "number": "1301",
    "honors": false,
    "writing": true,
    "name": "Personal Leadership in the U",
    "fullname": "Personal Leadership in the University",
    "info": "Students examine their own views of leadership, differences between personal/positional leadership, leadership ethics/values, and their own leadership strengths/skills.",
    "prereq": {}
  },
  {
    "uid": "806143",
    "code": "OLPD1302",
    "subject": "OLPD",
    "number": "1302",
    "honors": false,
    "writing": false,
    "name": "Personal Leadership in the U",
    "fullname": "Personal Leadership in the University",
    "info": "Students examine own views of leadership, differences between personal/positional leadership, leadership ethics/values, leadership strengths/skills.",
    "prereq": {}
  },
  {
    "uid": "819730",
    "code": "OLPD1303",
    "subject": "OLPD",
    "number": "1303",
    "honors": false,
    "writing": false,
    "name": "Lead in Organizational Context",
    "fullname": "Leadership in the Organizational Context",
    "info": "Life - like leadership - is full of paradoxes.  We are all individuals.  At the same time, we are all part of families, communities, institutions, structures, and systems.  To understand and practice effective leadership, we must make sense of our lives - including our unique identities and experiences - within these broader organizational and societal contexts.  We must think critically about how power flows through society, and how it shapes agency, opportunities and wellbeing for individuals and communities.  And we must think creatively and critically about how leadership can help promote equity, justice, and human flourishing.\nIn this course, we focus on organizations as a core context for leadership.  Organizations are everywhere -  some formal, some informal.  For example, we are all part of an educational organization: the University of Minnesota.  We all interact with governmental organizations at national, state, and local levels.  We may belong to community, religious, or cultural organizations.  We might work - now or in the future - for a corporation, a nonprofit, or a cooperative.  We may belong to an advocacy organization that works for social change.\nTo study leadership within these various types of organizations, we must also turn inward to examine our own identities, social locations, and experiences.  We draw on concepts and theories - from the fields of leadership development, organizational studies, sociology, and psychology - to analyze our lived experiences within broader contexts, and better understand the behaviors of individuals and groups within organizations.\nThis course will require active engagement with course materials, your classmates, and class projects.  Our class sessions will include group activities, student-driven discussions, and the occasional mini-lecture.  We will explore case studies and individual narratives as touchstones for applying theory to real world contexts.  Over the semester, you will complete both individual and group assignments, including reflective writing and class facilitation.  Ultimately, this course is a \"learning lab\" where we have the chance to practice being how we would like the world to be.\nOld: Students examine own views of leadership, differences between ",
    "prereq": {}
  },
  {
    "uid": "798593",
    "code": "OLPD1324",
    "subject": "OLPD",
    "number": "1324",
    "honors": false,
    "writing": false,
    "name": "Intercultural Service Learning",
    "fullname": "Intercultural Communication and Service Learning: Interdisciplinary Approaches to Public Engagement",
    "info": "Cross-cultural competence. Social/economic issues in the United States and abroad. Major theories, concepts, and models in intercultural/multicultural education. Classroom, research, and service learning activities.",
    "prereq": {}
  },
  {
    "uid": "016708",
    "code": "OLPD1380",
    "subject": "OLPD",
    "number": "1380",
    "honors": false,
    "writing": false,
    "name": "Special Topics in Leadership",
    "fullname": "Special Topics in Leadership",
    "info": "For topic, see Class Schedule.",
    "prereq": {}
  },
  {
    "uid": "816483",
    "code": "OLPD1461",
    "subject": "OLPD",
    "number": "1461",
    "honors": false,
    "writing": false,
    "name": "Presentations in Work Settings",
    "fullname": "Presentations in Work Settings: Business & Marketing Education and Human Resource Development",
    "info": "This course prepares students to present information and hone their messages based on audience need in a variety of business, leadership, and workplace contexts. Students interested in majoring in Business and Marketing Education (BME), Human Resource Development (HRD), and other majors can take this course in order to develop the disciplinary practices used in training and development, as well as business and industry to convey vital and timely messages.",
    "prereq": {}
  },
  {
    "uid": "002450",
    "code": "OLPD1496",
    "subject": "OLPD",
    "number": "1496",
    "honors": false,
    "writing": false,
    "name": "Supv Career & Tech Ed Teaching",
    "fullname": "Supervised Career and Technical Education Teaching",
    "info": "Supervised teaching for beginning teachers, or teaching activities for preservice teachers.\n\nprereq: college consent",
    "prereq": {}
  },
  {
    "uid": "002380",
    "code": "OLPD1801",
    "subject": "OLPD",
    "number": "1801",
    "honors": false,
    "writing": false,
    "name": "Intro: Career & Tech Ed Teach.",
    "fullname": "Introduction to Career and Technical Education Teaching",
    "info": "Entry-level skills to function as a teacher. Philosophy of career/technical education, planning of instruction, instructional methods, student evaluation, working with students who have special needs, ancillary duties of career/technical education faculty. Emphasizes microteaching and feedback.\n\nprereq: Occupationally certifiable individual",
    "prereq": {}
  },
  {
    "uid": "800651",
    "code": "OLPD1905",
    "subject": "OLPD",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar",
    "fullname": "Freshman Seminar",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "817209",
    "code": "OLPD1908W",
    "subject": "OLPD",
    "number": "1908",
    "honors": false,
    "writing": true,
    "name": "Reflections of Justice and Law",
    "fullname": "Reflections of Justice, Images of the Law in Literature, Film, and Popular Culture",
    "info": "This writing intensive freshman seminar will explore the treatment of legal themes in films, literary texts,\nand popular culture. We will look at the law through stories, cinema, television and other mediums to\nconsider the following questions: Do these portrayals of \"the law\" enhance or inhibit our understanding of\nhow the law \"works\" in our everyday lives, thus impacting our participation as citizens? Do literature,\nfilm and other media accurately reflect both our legal system and how lawyers are trained and the work\nthat they do, or do they rely upon outdated, stereotypical, or sensationalized portrayals? We will also\nconsider whether literature, film, and popular culture can actually be useful in helping us better\ncomprehend the complexities and ethics of the law in all of its often frustrating ambiguity. Students will\nhave the opportunity to develop their skills in research, analysis, oral communication, and creativity\nthrough writing formal papers, participating in and leading class discussions, making presentations,\nwriting stories and poems, and completing a group project. At the end of this course, you will be better\nable to analyze complex social problems and make informed decisions regarding the important legal and\nethical issues we face as a society. In that way, this course meets an important central goal of a liberal\neducation: to help you become a more informed, aware, and engaged citizen. ",
    "prereq": {}
  },
  {
    "uid": "798999",
    "code": "OLPD1909W",
    "subject": "OLPD",
    "number": "1909",
    "honors": false,
    "writing": true,
    "name": "FreshmanSem, Int'l Perspect",
    "fullname": "Freshman Seminar: International Perspectives and Writing Intensive",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "805205",
    "code": "OLPD1942",
    "subject": "OLPD",
    "number": "1942",
    "honors": false,
    "writing": false,
    "name": "Freshman Seminar: Tech/Society",
    "fullname": "Freshman Seminar: Technology and Society",
    "info": "Interdisciplinary seminar. Topics specified in Class Schedule.\n\nprereq: Fr",
    "prereq": {}
  },
  {
    "uid": "805773",
    "code": "OLPD2811",
    "subject": "OLPD",
    "number": "2811",
    "honors": false,
    "writing": false,
    "name": "Societies of the Future: Work",
    "fullname": "Societies of the Future: Changing Work Contexts",
    "info": "Ongoing evolution of social contexts and work through the interdisciplinary lens of future studies.",
    "prereq": {}
  },
  {
    "uid": "797881",
    "code": "OLPD3201",
    "subject": "OLPD",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Adult Education Overview",
    "fullname": "Adult Education Overview",
    "info": "Theory/practice of adult learning/development.",
    "prereq": {}
  },
  {
    "uid": "796722",
    "code": "OLPD3202",
    "subject": "OLPD",
    "number": "3202",
    "honors": false,
    "writing": false,
    "name": "Intro to Strat. for Tch Adults",
    "fullname": "Introduction to Strategies for Teaching Adults",
    "info": "Theories of adult learning, learning/teaching styles, methods/perspectives of teaching, applications of teaching in various settings.",
    "prereq": {}
  },
  {
    "uid": "792895",
    "code": "OLPD3301",
    "subject": "OLPD",
    "number": "3301",
    "honors": false,
    "writing": false,
    "name": "Understanding Southeast Asia",
    "fullname": "Understanding Southeast Asia: an Intercultural/Interdisciplinary Policy Perspective",
    "info": "Contemporary southeast Asia. Complexities/diversity of region. Interdisciplinary orientation. Humanities and social science material. Case studies, critical incidents.",
    "prereq": {}
  },
  {
    "uid": "787870",
    "code": "OLPD3302",
    "subject": "OLPD",
    "number": "3302",
    "honors": false,
    "writing": false,
    "name": "Ldership, You & Your Community",
    "fullname": "Leadership, You, and Your Community",
    "info": "How do effective leaders create positive systemic change within complex systems?  What is community and how does it shape the work of leadership? Students examine leadership from a multi-dimensional and multicultural perspective and critically examine leadership theories in authentic, complex community settings.",
    "prereq": {}
  },
  {
    "uid": "793974",
    "code": "OLPD3303",
    "subject": "OLPD",
    "number": "3303",
    "honors": false,
    "writing": false,
    "name": "Intro to Women in Leadership",
    "fullname": "Introduction to Women in Leadership",
    "info": "Sex discrimination, female career patterns, women leaders, inclusive conceptualizations of managerial/administrative theory.",
    "prereq": {}
  },
  {
    "uid": "794082",
    "code": "OLPD3304",
    "subject": "OLPD",
    "number": "3304",
    "honors": false,
    "writing": false,
    "name": "Strat Ldrship Future Societies",
    "fullname": "Strategic Leadership for Future Societies",
    "info": "Emerging leadership implications of selected short-/long-range trends. Construction of context-relevant effective leadership scenarios for selected institutions in real/hypothetical societies.",
    "prereq": {}
  },
  {
    "uid": "793975",
    "code": "OLPD3305",
    "subject": "OLPD",
    "number": "3305",
    "honors": false,
    "writing": false,
    "name": "Ldrshp through Film/Literature",
    "fullname": "Learning About Leadership Through Film and Literature",
    "info": "Readings from leadership studies, literature, and film. Ethical dilemmas. Different styles of leadership and their consequences. Intersection of public/private in exercising leadership. Competing loyalties/pressures felt by leaders/followers. Fundamental questions about nature/desirability of leadership.",
    "prereq": {}
  },
  {
    "uid": "790716",
    "code": "OLPD3306",
    "subject": "OLPD",
    "number": "3306",
    "honors": false,
    "writing": false,
    "name": "Ldrship Minor Field Experience",
    "fullname": "Leadership Minor: Field Experience",
    "info": "Students apply and integrate leadership theory in a community experience, think critically about their positional leadership roles, extrapolate the experience to future leadership issues within their specific fields, and work through challenges of positional leadership.",
    "prereq": {}
  },
  {
    "uid": "801244",
    "code": "OLPD3307",
    "subject": "OLPD",
    "number": "3307",
    "honors": false,
    "writing": false,
    "name": "History of U.S. Higher Ed",
    "fullname": "History of U.S. Higher Education",
    "info": "U.S. higher education, from ancient roots to present. Equality of opportunity, faculty autonomy, curriculum, institutional governance. Students use multidisciplinary tools to study and derive meaning from past.",
    "prereq": {}
  },
  {
    "uid": "818648",
    "code": "OLPD3308",
    "subject": "OLPD",
    "number": "3308",
    "honors": false,
    "writing": false,
    "name": "Data-Driven Decision-Making",
    "fullname": "Data-Driven Decision-Making in BME and HRD",
    "info": "Living in the age of technology has implications for everyone in Business & Marketing Education (BME) and Human Resource Development (HRD). Technology that makes it possible to collect huge amounts of data has given more individuals and organizations the power and responsibility to analyze data and make decisions based on this data. The amount of data being collected on our preferences, attitudes, and behaviors will only increase in the future, and this rich data can be used towards a variety of ends. \n\nIn this course, we will use quantitative methods to uncover the information in large data sets and then consider how individuals and organizations are able to gain a competitive advantage by acting on this information. Topics covered in this course include:\n- Critical analysis of complex issues related to BME and HRD in organizations.\n- Major techniques of quantitative data analyses used in BME and HRD. \n- How to use of Excel and Excel Add-in Tools to conduct data analyses.\n- How to make effective decisions based on quantitative information in BME and HRD situations.\n- Effective reporting of quantitative results to meet the expectations of stakeholders.",
    "prereq": {}
  },
  {
    "uid": "000982",
    "code": "OLPD3310",
    "subject": "OLPD",
    "number": "3310",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics for Undergraduates",
    "info": "Inquiry into special topics related to organizational leadership, policy/development.",
    "prereq": {}
  },
  {
    "uid": "805770",
    "code": "OLPD3318",
    "subject": "OLPD",
    "number": "3318",
    "honors": false,
    "writing": false,
    "name": "Intro to Project Management",
    "fullname": "Introduction to Project Management",
    "info": "Project management for business and industry. Project lifecycles, deliverables, and processes as they are commonly used in the workplace.",
    "prereq": {}
  },
  {
    "uid": "794257",
    "code": "OLPD3320",
    "subject": "OLPD",
    "number": "3320",
    "honors": false,
    "writing": false,
    "name": "Study Abroad: Pre-departure",
    "fullname": "Maximizing Study Abroad Through Culture and Language Strategies: Pre-Departure Preparation",
    "info": "Preparation for overseas sojourn: understanding culture, ways cultures differ in values, seeing oneself as a member of a culture or cultures.",
    "prereq": {}
  },
  {
    "uid": "790753",
    "code": "OLPD3321",
    "subject": "OLPD",
    "number": "3321",
    "honors": false,
    "writing": false,
    "name": "Hist Foundations Modern Educ",
    "fullname": "Introduction to Historical Foundations of Modern Education",
    "info": "Analysis/interpretation of important elements in modern education derived from pre-classical sources: Greeks, Romans, Middle Ages, Renaissance, Reformation, Enlightenment, Industrial Revolution.",
    "prereq": {}
  },
  {
    "uid": "790754",
    "code": "OLPD3323",
    "subject": "OLPD",
    "number": "3323",
    "honors": false,
    "writing": false,
    "name": "History Western Educ Thought",
    "fullname": "Introduction to History of Western Educational Thought",
    "info": "Great educational classics of Western civilization: Plato, Aristotle, Quintilian, Montaigne, Milton, Locke, Rousseau, others.",
    "prereq": {}
  },
  {
    "uid": "809481",
    "code": "OLPD3324W",
    "subject": "OLPD",
    "number": "3324",
    "honors": false,
    "writing": true,
    "name": "Writing in the Workplace",
    "fullname": "Writing in the Workplace for Education and Human Development Majors",
    "info": "Explore professional communication. Research/analysis writing. Memos, reports, proposals, human resource-related documentation, letters or announcements, presentations.\n\nprereq: 60+ undergraduate credits, declared major",
    "prereq": {}
  },
  {
    "uid": "803297",
    "code": "OLPD3336",
    "subject": "OLPD",
    "number": "3336",
    "honors": false,
    "writing": false,
    "name": "Religion, Ethics, and Ed Pol",
    "fullname": "Religion, Ethics, and Educational Policy",
    "info": "American religious pluralism in relationship to ethics and educational policy. History of religious belief/expression in K-12 and higher education. Students interact with community leaders. Legal issues, religion/science, sexuality, religious alternatives, policy topics.",
    "prereq": {}
  },
  {
    "uid": "794259",
    "code": "OLPD3340",
    "subject": "OLPD",
    "number": "3340",
    "honors": false,
    "writing": false,
    "name": "Study Abroad: Re-entry",
    "fullname": "Maximizing Study Abroad Through Culture and Language Strategies: Re-Entry",
    "info": "Reflect upon personal study abroad experience through readings/activities to ease transition back into the United States and to maximize learning from study abroad experience.",
    "prereq": {}
  },
  {
    "uid": "819976",
    "code": "OLPD3350",
    "subject": "OLPD",
    "number": "3350",
    "honors": false,
    "writing": false,
    "name": "Topics in Professional Sales",
    "fullname": "Special Topics in Professional Sales",
    "info": "In this course, students will learn how to understand and incorporate advanced professional selling topics into practical experiences in professional sales. Students will improve their ability to communicate effectively and identify, define, and solve problems through role-play simulations that incorporates topics such as Understanding Objections, Understanding Sales Differentiators, Networking, CRM and Strategic Relationships, and Sales Management. In addition, students will gain understanding of the sales cycle and how to successfully navigate buyer interactions for business relationships. Students will also describe how internships and introspective assessments can foster greater career progression in professional sales.",
    "prereq": {}
  },
  {
    "uid": "808462",
    "code": "OLPD3381",
    "subject": "OLPD",
    "number": "3381",
    "honors": false,
    "writing": false,
    "name": "Intercultural Competence",
    "fullname": "Developing Intercultural Competence",
    "info": "Past/current research on intercultural leadership. Students share their understanding/experiences within intercultural framework.  ",
    "prereq": {}
  },
  {
    "uid": "827255",
    "code": "OLPD3382",
    "subject": "OLPD",
    "number": "3382",
    "honors": false,
    "writing": false,
    "name": "Taste of South Korea",
    "fullname": "Taste of South Korea: Culture, Language, & Education",
    "info": "This course explores different aspects of the South Korean culture, language, and education. The course will examine the historical background of Korean education and its impact on current social, political, and educational policies. The course will also expose students to South Korean cultural practices and language with the intent of developing student’s cultural competence. Culture and community engagement are a core part of the learning experience in this course. ",
    "prereq": {}
  },
  {
    "uid": "805412",
    "code": "OLPD3401",
    "subject": "OLPD",
    "number": "3401",
    "honors": false,
    "writing": false,
    "name": "Teaching Marketing Promotion",
    "fullname": "Teaching Marketing Promotion",
    "info": "Materials, methods, and approaches to teaching marketing promotion. Advertising, promotion, public relations, direct selling, visual merchandising, and direct marketing.",
    "prereq": {}
  },
  {
    "uid": "002451",
    "code": "OLPD3411",
    "subject": "OLPD",
    "number": "3411",
    "honors": false,
    "writing": false,
    "name": "Explor Tech Systems",
    "fullname": "Exploring Technology Systems",
    "info": "Communication, information, construction, manufacturing, design, technical drawing, biotechnology, energy, power, and transportation technologies.  Students develop problem solving and manipulative skills as well as understanding of the principles and processes through hands-on activities in a multiple activity laboratory.",
    "prereq": {}
  },
  {
    "uid": "792252",
    "code": "OLPD3412",
    "subject": "OLPD",
    "number": "3412",
    "honors": false,
    "writing": false,
    "name": "Tech Drawing/Prod Technology",
    "fullname": "Technical Drawing and Production Technologies",
    "info": "Instruction and laboratory experiences in technical drawing and design technologies; production technologies related to construction and manufacturing. Students will develop manipulative skills and techniques and an understanding of principles and processes of the technologies through hands-on work and lab activities.",
    "prereq": {}
  },
  {
    "uid": "002382",
    "code": "OLPD3413",
    "subject": "OLPD",
    "number": "3413",
    "honors": false,
    "writing": false,
    "name": "Manufacturing Technology",
    "fullname": "Manufacturing Technology",
    "info": "Manufacturing concepts, principles, and applications. Automated manufacturing, including computer integrated manufacturing and robotics. Design, operation, and management of manufacturing systems/products. Lab.",
    "prereq": {}
  },
  {
    "uid": "002452",
    "code": "OLPD3414",
    "subject": "OLPD",
    "number": "3414",
    "honors": false,
    "writing": false,
    "name": "Construction Technology",
    "fullname": "Construction Technology",
    "info": "Introduction to principles, concepts, and techniques involved in civil, commercial, and residential construction. Laboratory experiences in planning, designing, organizing, producing, and testing structures.",
    "prereq": {}
  },
  {
    "uid": "002455",
    "code": "OLPD3422",
    "subject": "OLPD",
    "number": "3422",
    "honors": false,
    "writing": false,
    "name": "Communication/Info Technology",
    "fullname": "Communication and Information Technology",
    "info": "Information/communication systems, electronic publishing, printing technology, broadcast/recording technologies, telephone/online communication, photography, multimedia, and computer technology. Lab.",
    "prereq": {}
  },
  {
    "uid": "002456",
    "code": "OLPD3423",
    "subject": "OLPD",
    "number": "3423",
    "honors": false,
    "writing": false,
    "name": "Energy/Power/Transportatn Tech",
    "fullname": "Energy, Power, and Transportation Technology",
    "info": "Mechanical, fluid, and electrical power/technologies associated with transportation of people/materials. Lecture, lab. ",
    "prereq": {}
  },
  {
    "uid": "805413",
    "code": "OLPD3424",
    "subject": "OLPD",
    "number": "3424",
    "honors": false,
    "writing": false,
    "name": "Sales Training",
    "fullname": "Sales Training",
    "info": "Strategies and techniques for developing effective sales people. A review of review practices related to sales management, business development, selling strategies, and learning objectives essential to developing the skills, knowledge, and abilities to create a competent sales force.",
    "prereq": {}
  },
  {
    "uid": "826585",
    "code": "OLPD3425",
    "subject": "OLPD",
    "number": "3425",
    "honors": false,
    "writing": false,
    "name": "Practicum in Profes Sales Edu",
    "fullname": "Practicum in Professional Sales Education",
    "info": "The Practicum in Professional Sales Education course is for undergraduate students looking to obtain the Sales Certificate through the College of Education and Human Development. This course is the first of two practical courses for the Sales Certificate. Students will learn how to understand and incorporate emerging topics in professional sales into practical experiences, including how to execute the sales cycle used by sales professionals, as well as other emerging topics such as: building Rapport, determining buyers needs and motivations, preparing for a career in sales, resume development and DISC profile assessments, communicating value propositions, and handling objections. This course will require active engagement with course materials, classmates, and class projects. The class sessions include group activities, role plays and simulations, and briefing/debriefing\nsessions to prepare and discuss each week’s topics and activities. Over the semester, students will complete both individual and group assignments, including reflective writing and class lesson facilitation. Ultimately, the practicum is a “laboratory” where students will have the opportunity to engage with sales knowledge and career competencies using real world simulations.",
    "prereq": {}
  },
  {
    "uid": "826586",
    "code": "OLPD3426",
    "subject": "OLPD",
    "number": "3426",
    "honors": false,
    "writing": false,
    "name": "Advan Practi in Prof Sales Edu",
    "fullname": "Advanced Practicum in Professional Sales Education",
    "info": "The Advanced Practicum in Professional Sales Education course is for undergraduate students looking to obtain the Sales Certificate offered through the College of Education and Human Development. This course is the second of two practical courses for the Sales Certificate, encouraging students to engage more deeply on topics covered in the first practicum course. Students in the advanced section take on a leadership role, learning how to best teach, instruct, coach, and mentor others, specifically those in the first practicum section. Students will participate in Role-play simulations as practicum, as well as provide structured support and\nfeedback to other students in the course leveraging their advanced expertise within the discipline. Additionally, students will describe how internships, or other work experiences, and introspective assessments can foster career progression in professional sales.\nThis course requires active engagement with course materials, classmates, and group projects, all through a leadership and instructional lens as an experienced sales professional. Individually,\nstudents will engage with reflective writing and class facilitation. As a group leader, Advanced Practicum students will engage their peers in discussions and mentorship to provide critical feedback and support in developing their sales acumen week to week. Over the course of the semester, the “laboratory” for learning occurs during the required simulations and role plays, as well as their guidance of others in developing their sales knowledge and career competencies to leverage in the real world.",
    "prereq": {}
  },
  {
    "uid": "002457",
    "code": "OLPD3451",
    "subject": "OLPD",
    "number": "3451",
    "honors": false,
    "writing": false,
    "name": "Technical Development:Advanced",
    "fullname": "Technical Development: Advanced",
    "info": "Work experience in business/industry.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "002477",
    "code": "OLPD3461",
    "subject": "OLPD",
    "number": "3461",
    "honors": false,
    "writing": false,
    "name": "Prof Sales Mgmt",
    "fullname": "Professional Sales Management",
    "info": "Examination of the sales manager's role in training and mentoring sales representatives in strategic selling, customer-oriented service, and problem-solving tactics. Includes recruitment, hiring, training, and retention of a sales force.",
    "prereq": {}
  },
  {
    "uid": "002458",
    "code": "OLPD3493",
    "subject": "OLPD",
    "number": "3493",
    "honors": false,
    "writing": false,
    "name": "Directed Study BME",
    "fullname": "Directed Study in Business & Marketing Education",
    "info": "Open to qualified students. Opportunity to pursue study not available through regular coursework. In consultation with instructor, develop prospectus/complete progress reports/ final report on project.\n\nprereq: BME major, instr consent",
    "prereq": {}
  },
  {
    "uid": "806568",
    "code": "OLPD3496",
    "subject": "OLPD",
    "number": "3496",
    "honors": false,
    "writing": false,
    "name": "Profession & Practice of BME",
    "fullname": "Profession and Practice of Business and Marketing Education",
    "info": "Application of theory to practice related to BME core coursework with integrative paper.\n\nprereq: Undergrad student, BME major, OLPD 3318, OLPD 3401, OLPD 3424, and OLPD 4426 completed or in progress.",
    "prereq": {
      "or": [
        "805770",
        "805412",
        "805413",
        "805414"
      ]
    }
  },
  {
    "uid": "794250",
    "code": "OLPD3601",
    "subject": "OLPD",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "Introduction to HRD",
    "fullname": "Introduction to Human Resource Development",
    "info": "Human resource development theories, principles, concepts, and practices.",
    "prereq": {}
  },
  {
    "uid": "796769",
    "code": "OLPD3609",
    "subject": "OLPD",
    "number": "3609",
    "honors": false,
    "writing": false,
    "name": "Profession & Pract of BME/HRD",
    "fullname": "Profession and Practice of Business and Marketing Education and Human Resource Development",
    "info": "This course is designed to provide Undergraduate Business and Marketing Education (BME) & Human Resource Development (HRD) students with the tools necessary to develop a career management plan to become successful business and marketing professionals and/or human resource development professionals.\n\nprereq: Admitted BME major or Admitted HRD major",
    "prereq": {}
  },
  {
    "uid": "796737",
    "code": "OLPD3621",
    "subject": "OLPD",
    "number": "3621",
    "honors": false,
    "writing": false,
    "name": "Intro Training & Development",
    "fullname": "Introduction to Training and Development",
    "info": "Processes to carry out theoretically sound training/development practices, within the context of systemic relationship with host organization or system.",
    "prereq": {}
  },
  {
    "uid": "796770",
    "code": "OLPD3641",
    "subject": "OLPD",
    "number": "3641",
    "honors": false,
    "writing": false,
    "name": "Intro to Org Develop",
    "fullname": "Introduction to Organization Development",
    "info": "Organization development theories, principles, concepts, and practices. How development is used to direct change in an organization.",
    "prereq": {}
  },
  {
    "uid": "791002",
    "code": "OLPD3661",
    "subject": "OLPD",
    "number": "3661",
    "honors": false,
    "writing": false,
    "name": "Instr. Methods for Bus. & Ind.",
    "fullname": "Instructional Methods for Business and Industry",
    "info": "Theory/practice in instructional methods/techniques for career and technical education (CTE) instructors and for human resources and development (HRD) professionals. Focus on how to deliver instruction using various teaching methodologies, select appropriate methodologies, and plan for their delivery.",
    "prereq": {}
  },
  {
    "uid": "810117",
    "code": "OLPD3693",
    "subject": "OLPD",
    "number": "3693",
    "honors": false,
    "writing": false,
    "name": "Directed Study HRD",
    "fullname": "Directed Study: Human Resource Development",
    "info": "Open to qualified students. Opportunity to pursue study not available through regular coursework. In consultation with instructor, student develops prospectus/completes progress reports/final report on project.\n\nprereq: HRD major, instr consent",
    "prereq": {}
  },
  {
    "uid": "791016",
    "code": "OLPD3801",
    "subject": "OLPD",
    "number": "3801",
    "honors": false,
    "writing": false,
    "name": "Found. of Career & Tech Educ.",
    "fullname": "Foundations of Philosophy and Practice of Career and Technical Education",
    "info": "Introduction to contemporary career/technical education. Purposes/goals, governance structure, historical perspectives, industry-education relationship, current education practices. Possible future trends and their implications. Development of a personal philosophy of career/technical education.",
    "prereq": {}
  },
  {
    "uid": "796740",
    "code": "OLPD3805",
    "subject": "OLPD",
    "number": "3805",
    "honors": false,
    "writing": false,
    "name": "Intro to Strat. Plng thru  HR",
    "fullname": "Introduction to Strategic Planning Through Human Resources",
    "info": "Processes organizations use when engaged in strategic planning. How to participate in planning, implementing, and evaluating strategic initiatives to improve performance.\n\nprereq: 3601 or HRD 3001",
    "prereq": {
      "or": [
        "794250"
      ]
    }
  },
  {
    "uid": "791003",
    "code": "OLPD3808",
    "subject": "OLPD",
    "number": "3808",
    "honors": false,
    "writing": false,
    "name": "Found. of Stud.& Trainee Asses",
    "fullname": "Foundations of Student and Trainee Assessment",
    "info": "Developing tests of knowledge, affect, and processes for programs focused on instruction of skills associated with business/industry. Developing learning-progress reporting systems. Evaluating instructional effectiveness. Applying tests and other evaluation instruments to assess/report learning in business/industry and in career/technical education fields.",
    "prereq": {}
  },
  {
    "uid": "805410",
    "code": "OLPD3820",
    "subject": "OLPD",
    "number": "3820",
    "honors": false,
    "writing": false,
    "name": "Prin of Super. Mgmt.",
    "fullname": "Principles of Supervisory Management",
    "info": "Introduction to the principles of supervision in education, business, industry, government, and service organizations.",
    "prereq": {}
  },
  {
    "uid": "792250",
    "code": "OLPD3821",
    "subject": "OLPD",
    "number": "3821",
    "honors": false,
    "writing": false,
    "name": "Comm Energy Power Trans/Ma",
    "fullname": "Communication, Energy and Power, Transportation and Machinery Technologies",
    "info": "Instruction and laboratory experiences in communication, information, power, energy, and transportation technologies. Topics include power systems; transportation systems; information and communication systems; graphic communication and computer applications.",
    "prereq": {}
  },
  {
    "uid": "805781",
    "code": "OLPD3828",
    "subject": "OLPD",
    "number": "3828",
    "honors": false,
    "writing": false,
    "name": "Diversity in the Workplace",
    "fullname": "Diversity in the Workplace",
    "info": "Diversity, equity, and inclusion in the workplace. Issues of recruitment, selection, management, learning, leadership, and performance.",
    "prereq": {}
  },
  {
    "uid": "791004",
    "code": "OLPD3829",
    "subject": "OLPD",
    "number": "3829",
    "honors": false,
    "writing": false,
    "name": "Fnds of Cse Dev. for Bus & Ind",
    "fullname": "Foundations of Course Development for Business and Industry",
    "info": "Designing instructional programs/courses focused on helping learners develop desired competence. Designing instruction for performance-based training and vocational/technical education. Developing course syllabus components that clarify broad course expectations. Developing academic/community-based elements that complement course goals.",
    "prereq": {}
  },
  {
    "uid": "791005",
    "code": "OLPD3861",
    "subject": "OLPD",
    "number": "3861",
    "honors": false,
    "writing": false,
    "name": "Fnd Instruc Meth for Bus/Ind",
    "fullname": "Foundations of Instructional Methods for Business and Industry",
    "info": "Theory/practice in instructional methods/techniques for career/technical education (CTE) instructors and for human resources and development (HRD) professionals. How to deliver instruction using various teaching methodologies, select appropriate methodologies, and plan for their delivery.",
    "prereq": {}
  },
  {
    "uid": "806530",
    "code": "OLPD4301",
    "subject": "OLPD",
    "number": "4301",
    "honors": false,
    "writing": false,
    "name": "Global Youth Comm Engagement",
    "fullname": "Global Youth Leadership and Community Engagement",
    "info": "Six-credit course over three semesters. Students take courses at the U of M (spring and fall) and at FLASCO University in Buenos Aires, Argentina, (four weeks in August). Theory and practice of youth-engagement/empowerment to address issues that affect their lives, their communities, and the broader global society.",
    "prereq": {}
  },
  {
    "uid": "787904",
    "code": "OLPD4303W",
    "subject": "OLPD",
    "number": "4303",
    "honors": false,
    "writing": true,
    "name": "Leadership-Global Citizenship",
    "fullname": "Leadership for Global Citizenship",
    "info": "Leadership theory, community building, social change, interdisciplinary approaches to complex global issues. Students finalize portfolios, submit scholarly products to demonstrate understanding of personal/positional leadership in changing global context. Capstone course.",
    "prereq": {}
  },
  {
    "uid": "805771",
    "code": "OLPD4318",
    "subject": "OLPD",
    "number": "4318",
    "honors": false,
    "writing": false,
    "name": "Advanced Project Management",
    "fullname": "Advanced Project Management",
    "info": "The focus of this course is project management for business and industry. Students will learn advanced aspects and techniques in project management, project lifecycles, deliverables, and processes as they are commonly used in the workplace.\n\nWhat does this mean for this class? This course is, in part, a continuation of the content learned in OLPD 3318, including a deeper dive into some areas and an introduction to new areas that we didn't have time to cover in 3318. Students will have the opportunity to learn and use an enterprise-level project management software package, will gain new experience in procurement management, budget management, quality management, and communication management, and will practice the skills needed to assess and take over an in-progress project.\n\nprereq: 3318 or EDPA 3218",
    "prereq": {
      "or": [
        "805770"
      ]
    }
  },
  {
    "uid": "806514",
    "code": "OLPD4400",
    "subject": "OLPD",
    "number": "4400",
    "honors": false,
    "writing": false,
    "name": "Small bus/entre educ",
    "fullname": "Education for Small Business Entrepreneurship",
    "info": "Process of starting a small business. Helps students identify the skills necessary to operate the business.",
    "prereq": {}
  },
  {
    "uid": "806512",
    "code": "OLPD4401",
    "subject": "OLPD",
    "number": "4401",
    "honors": false,
    "writing": false,
    "name": "E-Marketing",
    "fullname": "E-Marketing",
    "info": "Basic understanding and personal experience with how e-marketing can be used as part of an overall marketing and promotion plan.",
    "prereq": {}
  },
  {
    "uid": "806572",
    "code": "OLPD4421",
    "subject": "OLPD",
    "number": "4421",
    "honors": false,
    "writing": false,
    "name": "Practicum Nonprofit Orgs",
    "fullname": "Practicum in Nonprofit Organizations",
    "info": "This course will provide students the opportunity to develop and implement critical aspects of a nonprofit organization from board selection, training, fundraising, event marketing and management, and conducting outreach programs. Students will have the opportunity to develop a variety of job functions including: sales, marketing, e-marketing, operations, management, accounting, administration, purchasing, procurement, fundraising, pre-event planning, and post-event evaluation.",
    "prereq": {}
  },
  {
    "uid": "805414",
    "code": "OLPD4426",
    "subject": "OLPD",
    "number": "4426",
    "honors": false,
    "writing": false,
    "name": "Strategic CRM",
    "fullname": "Strategic Customer Relationship Management",
    "info": "Principles of customer relationship management, brand identity, and integrated marketing communications. Comprehensive framework for how organizations interact with their various publics to create goodwill/loyalty.",
    "prereq": {}
  },
  {
    "uid": "805767",
    "code": "OLPD4496",
    "subject": "OLPD",
    "number": "4496",
    "honors": false,
    "writing": false,
    "name": "Applied Experience in BME",
    "fullname": "Applied Experience in Business & Marketing Education",
    "info": "Application of theory to practice related to BME core coursework with integrative paper. Work, internship, study abroad, research, field experience, service learning, etc. can all fulfill this degree requirement. Contact OLPD Program Advisors for more information.\n\nprereq: BME major, ugrd, [3496 or concurrent registration is required (or allowed) in 3496]",
    "prereq": {
      "or": [
        "806568"
      ]
    }
  },
  {
    "uid": "805440",
    "code": "OLPD4602",
    "subject": "OLPD",
    "number": "4602",
    "honors": false,
    "writing": false,
    "name": "Managing Wk Teams",
    "fullname": "Managing Work Teams",
    "info": "Frameworks and strategies for developing effective work teams. Skill development in facilitating resolution of conflicts in organizations. Foundational information as well as practical applications for participants to become small team leaders.",
    "prereq": {}
  },
  {
    "uid": "805774",
    "code": "OLPD4608",
    "subject": "OLPD",
    "number": "4608",
    "honors": false,
    "writing": false,
    "name": "Intro Int'l HRD",
    "fullname": "Introduction to International Human Resource Development",
    "info": "International/cross-cultural aspects of HRD. Practices/impact of economic, social, and cultural influences on HRD programs/interventions.\n\nprereq: 3601 or HRD 3001 or 3620 or HRD 3201 or 3640 or HRD 3301",
    "prereq": {
      "or": [
        "794250",
        "797881",
        "792895"
      ]
    }
  },
  {
    "uid": "805441",
    "code": "OLPD4627",
    "subject": "OLPD",
    "number": "4627",
    "honors": false,
    "writing": false,
    "name": "Mgmt/Super T&D",
    "fullname": "Management and Supervisory Training and Development",
    "info": "Problems, practices, programs, and methodologies relating to the training and development of managers and supervisors, including needed competencies, needs assessment, delivery modes, and evaluation.",
    "prereq": {}
  },
  {
    "uid": "805451",
    "code": "OLPD4696",
    "subject": "OLPD",
    "number": "4696",
    "honors": false,
    "writing": false,
    "name": "Bsnss Mrktng Ed/Human Rsrc Dev",
    "fullname": "Applied Experience in Business Marketing Education & Human Resource Development",
    "info": "OLPD 4696, the Applied Experience course, is designed as a culminating learning experience for students nearing graduation. It affords students an opportunity to seek out practical work experience related to their area of concentration in business and marketing or human resource development. An essential part of an Applied Experience is the opportunity to use the knowledge acquired in the classroom in practical applications in the workplace. Problem-solving and creative thinking in the workplace supports the retention and mastery of information gained in the classroom.\n\nTo be successful, the Applied Experience in BME/HRD should focus on a specific project(s) or task(s) that lend to analysis and resolution over the course of 6 to 14 weeks. A typical Applied Experience in BME/HRD involves 160 hours of work for 4 credits including all the course work listed on this syllabus (20 hr) during a single semester (45 hours per credit). The Applied Experience in BME/HRD is not credit for work. Students must be engaged in specific activities/duties related to their area of concentration related to the field of business and marketing or human resource development. Each activity is expected to relate to a BME/HRD theory, a career competency area, or professional skill. The student and the employment supervisor will be asked to sign a contract stipulating to the internship objective and activities; the contract must also be approved by the instructor.\n\nprereq: OLPD ugrd student in BME/HRD,  BME compl 3 of the 4 cores: OLPD 3318, 3401, 3424, 4426. HRD compl 4 of the 4 cores: OLPD 3601, 3202, 3621, 3641. Completed or permission to be concurrently registered for OLPD 3609.\n",
    "prereq": {
      "or": [
        "805770",
        "805412",
        "805413",
        "805414",
        "794250",
        "796722",
        "796737",
        "796770",
        "796769"
      ]
    }
  },
  {
    "uid": "806511",
    "code": "OLPD4870",
    "subject": "OLPD",
    "number": "4870",
    "honors": false,
    "writing": false,
    "name": "Human Rights in Org Leadership",
    "fullname": "Introduction to Integrating Human Rights into Organizational Leadership",
    "info": "Forum to explore local and international policies/practices for integrating human rights into organizational leadership and management. ",
    "prereq": {}
  },
  {
    "uid": "808138",
    "code": "OLPD5000",
    "subject": "OLPD",
    "number": "5000",
    "honors": false,
    "writing": false,
    "name": "Culture, Schools, Communities",
    "fullname": "Cultures, Schools, and Communities (Human Relations)",
    "info": "Addressing social/cultural dimensions of education. Challenges/dilemmas facing contemporary educators. Speakers, simulations, presentations, professional learning communities, field assignments.",
    "prereq": {}
  },
  {
    "uid": "000865",
    "code": "OLPD5001",
    "subject": "OLPD",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Formal Organizations in Educ",
    "fullname": "Formal Organizations in Education",
    "info": "Classical/current theories of organizations. Applications to education and related fields.",
    "prereq": {}
  },
  {
    "uid": "811366",
    "code": "OLPD5002",
    "subject": "OLPD",
    "number": "5002",
    "honors": false,
    "writing": false,
    "name": "Priv Colleges as Formal Orgs",
    "fullname": "Private Colleges as Formal Organizations",
    "info": "Provide certificate students with introduction to contemporary thinking on organizations/administration.  Primary focus on organizational theory.\n\nprereq: Bachelors degree must be completed before starting this course.",
    "prereq": {}
  },
  {
    "uid": "817618",
    "code": "OLPD5003",
    "subject": "OLPD",
    "number": "5003",
    "honors": false,
    "writing": false,
    "name": "Immigrant Student Experience",
    "fullname": "Borderland, Education Policy, Immigrant Expereince",
    "info": "Borderland, Education Policy and Immigrant Student Experience brings to focus the history of individual, institutional (educational) and cultural forms of marginalization and discrimination of immigrant communities from US history. This class includes a Spring Break trip to Tucson and the Sonora Desert led by the non-profit Borderlinks (www.borderlinks.org). Service learning opportunities may include water drops in the desert, interpreting for newly arrived migrants and serving as a supportive witness for migrants at deportation court. Both in Minnesota and Tucson, participants will dialogue with local stakeholders, advocates and agents of change including migrants, activists, border patrol, ranchers, faith communities, lawyers and lawmakers. Students will also have the opportunity to compare and contrast US immigrant issues with those across the globe.  ",
    "prereq": {}
  },
  {
    "uid": "002240",
    "code": "OLPD5005",
    "subject": "OLPD",
    "number": "5005",
    "honors": false,
    "writing": false,
    "name": "School and Society",
    "fullname": "School and Society",
    "info": "Readings in history, philosophy, social sciences, and law revealing diverse educational values in a pluralistic society. Multiple expectations of schools. Civil liberties, rights, community. Varying cultural backgrounds of students, family circumstances, exceptional needs.\n\nprereq: Jr or sr or MEd/initial licensure student or CLA music ed major or preteaching major or instr consent",
    "prereq": {}
  },
  {
    "uid": "002242",
    "code": "OLPD5009",
    "subject": "OLPD",
    "number": "5009",
    "honors": false,
    "writing": false,
    "name": "Human Relations",
    "fullname": "Human Relations: Applied Skills for School and Society",
    "info": "Issues of prejudice/discrimination in terms of history, power, social perception. Knowledge/skills acquisition in cooperative learning, multicultural education, group dynamics, social influence, leadership, judgment/decision making, prejudice reduction, conflict resolution, teaching in diverse educational settings.\n\nprereq: MEd/init lic or CLA music ed or preteaching or instr consent",
    "prereq": {}
  },
  {
    "uid": "808129",
    "code": "OLPD5010",
    "subject": "OLPD",
    "number": "5010",
    "honors": false,
    "writing": false,
    "name": "CULTURES, SCHOOLS,COMMUNITIES",
    "fullname": "Cultures, Schools, and Communities (Human Relations)",
    "info": "Addressing social/cultural dimensions of education. Challenges/dilemmas facing contemporary educators. Speakers, simulation, presentations, professional learning communities, field assignments.\n\nprereq: Enrolled in initial licensure program",
    "prereq": {}
  },
  {
    "uid": "802392",
    "code": "OLPD5011",
    "subject": "OLPD",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Leading Organizational Change",
    "fullname": "Leading Organizational Change: Theory and Practice",
    "info": "How theory is incorporated, affects the change process, and can improve schools/institutions of higher education. Characteristics that impact change processes/outcomes. Leadership/policy effects.",
    "prereq": {}
  },
  {
    "uid": "808137",
    "code": "OLPD5020",
    "subject": "OLPD",
    "number": "5020",
    "honors": false,
    "writing": false,
    "name": "CULTURES, SCHOOLS,COMMUNITIES",
    "fullname": "Cultures, Schools, and Communities (Human Relations)",
    "info": "Addressing social/cultural dimensions of education. Challenges/dilemmas facing contemporary educators. Speakers, simulation, presentations, professional learning communities, field assignments.\n\nprereq: Enrolled in teacher initial licensure program",
    "prereq": {}
  },
  {
    "uid": "790755",
    "code": "OLPD5021",
    "subject": "OLPD",
    "number": "5021",
    "honors": false,
    "writing": false,
    "name": "Historicl Foundations Modrn Ed",
    "fullname": "Historical Foundations of Modern Education",
    "info": "Analysis and interpretation of important elements in modern education derived from pre-classical sources: Greeks, Romans, Middle Ages, Renaissance, Reformation, Enlightenment, and Industrial Revolution.",
    "prereq": {}
  },
  {
    "uid": "790756",
    "code": "OLPD5023",
    "subject": "OLPD",
    "number": "5023",
    "honors": false,
    "writing": false,
    "name": "History Western Educ Thought",
    "fullname": "History of Western Educational Thought",
    "info": "Great educational classics of Western civilization: Plato, Aristotle, Quintilian, Montaigne, Milton, Locke, Rousseau, and others.\n\n",
    "prereq": {}
  },
  {
    "uid": "000985",
    "code": "OLPD5024",
    "subject": "OLPD",
    "number": "5024",
    "honors": false,
    "writing": false,
    "name": "History of Ideas in Amer Educ",
    "fullname": "History of Ideas in American Education",
    "info": "Readings in American cultural development related to education, including: Franklin, Jefferson, Mann, B.T. Washington, W.E.B. DuBois, Dewey. Special reference to the emerging system of public education in changing contexts, agrarian to urban-industrial, moderate pluralism to intense diversity.\n",
    "prereq": {}
  },
  {
    "uid": "000984",
    "code": "OLPD5028",
    "subject": "OLPD",
    "number": "5028",
    "honors": false,
    "writing": false,
    "name": "Educ Imagery-Europe & America",
    "fullname": "Education Imagery in Europe and America",
    "info": "Images and ideas of education expressed in the visual arts of Western \ncivilization (antiquity to 20th century) in relation to concurrent educational thought and practice; symbolism, myth, propaganda, didacticism, genre, caricature.",
    "prereq": {}
  },
  {
    "uid": "000989",
    "code": "OLPD5032",
    "subject": "OLPD",
    "number": "5032",
    "honors": false,
    "writing": false,
    "name": "Comparative Philosophies of Ed",
    "fullname": "Comparative Philosophies of Education",
    "info": "Exploration of the principal philosophies in educational thought today, e.g., realism, idealism, pragmatism, and postmodernism. Practice in philosophical critique.\n",
    "prereq": {}
  },
  {
    "uid": "001748",
    "code": "OLPD5033",
    "subject": "OLPD",
    "number": "5033",
    "honors": false,
    "writing": false,
    "name": "Fndns of Ind/Org Career Dev",
    "fullname": "Foundations of Individual/Organizational Career Development",
    "info": "Introduction to individual and organizational career development theory and practice. Examines critical issues in work patterns, work values, and workplaces in a changing global society, with implications for career planning, development, and transitions, emphasizing personal and organizational change. For nonmajors: serves students in adult ed, HRD, IR, college student advising, and other related fields.",
    "prereq": {}
  },
  {
    "uid": "000991",
    "code": "OLPD5036",
    "subject": "OLPD",
    "number": "5036",
    "honors": false,
    "writing": false,
    "name": "Ethics,Morality,Values in Educ",
    "fullname": "Ethics, Morality, and Values in Education",
    "info": "Application to key issues of professional practice. Moral education, virtues, principles.",
    "prereq": {}
  },
  {
    "uid": "000990",
    "code": "OLPD5041",
    "subject": "OLPD",
    "number": "5041",
    "honors": false,
    "writing": false,
    "name": "Sociology of Education",
    "fullname": "Sociology of Education",
    "info": "Structures and processes within educational institutions; linkages between educational organizations and their social contexts, particularly related to educational change.",
    "prereq": {}
  },
  {
    "uid": "000992",
    "code": "OLPD5044",
    "subject": "OLPD",
    "number": "5044",
    "honors": false,
    "writing": false,
    "name": "Intro to Economics of Educ",
    "fullname": "Introduction to the Economics of Education",
    "info": "Costs and economic benefits of education, with a focus on K-12; educational markets, prices, and production relationships; investment and cost-benefit analysis.",
    "prereq": {}
  },
  {
    "uid": "004471",
    "code": "OLPD5048",
    "subject": "OLPD",
    "number": "5048",
    "honors": false,
    "writing": false,
    "name": "Cross-Cultrl Perspectvs Ldrshp",
    "fullname": "Cross-Cultural Perspectives on Leadership",
    "info": "Introduction to cultural variables of leadership that influence functioning of cross-cultural groups. Lectures, case studies, discussion, problem-solving, simulations. Intensive workshop.",
    "prereq": {}
  },
  {
    "uid": "000986",
    "code": "OLPD5052",
    "subject": "OLPD",
    "number": "5052",
    "honors": false,
    "writing": false,
    "name": "Ethnic Groups & Communities",
    "fullname": "Ethnic Groups and Communities: Families, Children, and Youth",
    "info": "Roles of young people in widely varied North American communities. Comparative aspects of youth commitment to society, economic value of youth, youth-adult conflict, youth roles in family. Well-defined analyses of contextual roles. Complexity of policy for appropriate educational/community development.",
    "prereq": {}
  },
  {
    "uid": "000987",
    "code": "OLPD5056",
    "subject": "OLPD",
    "number": "5056",
    "honors": false,
    "writing": false,
    "name": "Case Studies - Policy Research",
    "fullname": "Case Studies for Policy Research",
    "info": "This course introduces students to knowledge and skills appropriate for the conduct of rigorous case study research in educational, organizational, and other social settings. Underlying purposes and assumptions of case study methods will be examined as well as a variety of methodological approaches. The course focuses on the use of qualitative and mixed-methods approaches as these are the predominant strategies employed in contemporary case study research. Accordingly, it emphasizes links between research purposes, the conceptualization of case study projects, and the development of researchable questions. It also takes up a variety of ethical and political issues related to working with participants during the research process, as\nwell as contemporary trustworthiness criteria for case study reports. The bulk of the course is given to training in observation, generating field notes, interviewing, collecting material cultural artifacts, using surveys, and analyzing, interpreting, and writing up case study data. The first segment of the course focuses on a critical discussion of research paradigms and epistemological assumptions of a variety of case study approaches. Students choose and critique a published case study from their field of interest. The second part of the course is devoted to a very small scale\ncase study project which students design and carry out themselves. This project is supported by relevant readings and in-class activities (including peer review) related to the actual conduct of case study research.",
    "prereq": {}
  },
  {
    "uid": "798286",
    "code": "OLPD5057",
    "subject": "OLPD",
    "number": "5057",
    "honors": false,
    "writing": false,
    "name": "Research in Int'l Education",
    "fullname": "Research in International Education",
    "info": "Key skills/proficiencies for rigorous graduate research.  Quantitative/qualitative/mixed methods. How to be a critical consumer of policy-related, comparative/intercultural research. Conducting cross-cultural/comparative research. Related ethical issues.",
    "prereq": {}
  },
  {
    "uid": "000988",
    "code": "OLPD5061",
    "subject": "OLPD",
    "number": "5061",
    "honors": false,
    "writing": false,
    "name": "Ethnographic Research Methods",
    "fullname": "Ethnographic Research Methods",
    "info": "This course introduces students to knowledge and skills appropriate for the conduct of ethnographic research.  Underlying purposes, assumptions, and distinctive characteristics of ethnographic methods will be examined as well as appropriate exemplars.  Accordingly, the course emphasizes links between research purposes, the conceptualization of ethnographic projects and the development of researchable questions.   The course also takes up a variety of ethical and political issues related to working with participants during the research process, as well as contemporary trustworthiness criteria for ethnographic written accounts.  The bulk of the course is given to training in observation, generating field notes, developing interview questions, interviewing, collecting material cultural artifacts, using surveys, and analyzing, interpreting, and writing up ethnographic data.  The first part of the course focuses on a critical discussion of ethnographic research purposes, epistemological assumptions, and essential features.  Students choose and explore a published ethnographic study from their field of interest.  The second part of the course is devoted to a very small scale ethnographic project which students design and carry out themselves.  This project is supported by relevant readings and in-class activities (including peer review) related to the actual conduct of ethnographic research.    \n\n",
    "prereq": {}
  },
  {
    "uid": "003188",
    "code": "OLPD5080",
    "subject": "OLPD",
    "number": "5080",
    "honors": false,
    "writing": false,
    "name": "Special Topics: OLPD",
    "fullname": "Special Topics: Organizational Leadership, Policy, & Development",
    "info": "Topical issues in organizational leadership, policy, development.",
    "prereq": {}
  },
  {
    "uid": "004785",
    "code": "OLPD5087",
    "subject": "OLPD",
    "number": "5087",
    "honors": false,
    "writing": false,
    "name": "MA Research Seminar",
    "fullname": "MA Research Seminar",
    "info": "OLPD 5087, MA Research Seminar, is intended to support OLPD Masters students working on their plan A or plan B papers. The course will focus on conducting effective research and developing the writing skills and habits needed to support the development and completion of the paper, including setting individual and realistic goals to further the project. Class time will include review and discussion of research strategies and practice, expectations for graduate level writing, in-class research and writing time, reviewing and commenting on work in progress in small groups, and review of proper APA style documentation and practices. ",
    "prereq": {}
  },
  {
    "uid": "003190",
    "code": "OLPD5095",
    "subject": "OLPD",
    "number": "5095",
    "honors": false,
    "writing": false,
    "name": "Problems: OLPD",
    "fullname": "Problems: Organizational Leadership, Policy, and Development",
    "info": "Course or independent study on specific topic within department program emphasis.",
    "prereq": {}
  },
  {
    "uid": "003189",
    "code": "OLPD5096",
    "subject": "OLPD",
    "number": "5096",
    "honors": false,
    "writing": false,
    "name": "Internship: OLPD",
    "fullname": "Internship: Organizational Leadership, Policy, and Development",
    "info": "Internship in elementary, secondary, general, postsecondary administration, or other approved field related setting.",
    "prereq": {}
  },
  {
    "uid": "000648",
    "code": "OLPD5102",
    "subject": "OLPD",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Knowledge Construct/Apps Int'l",
    "fullname": "Knowledge Constructions and Applications in International Development Contexts",
    "info": "Interrelationships of knowledge capital (noetic symbolic resources) and culture through intrinsic, cross/multicultural perspectives. Distinguishing knowledge from information/data. National/international developments occurring along basic/applied knowledge paths.",
    "prereq": {}
  },
  {
    "uid": "000646",
    "code": "OLPD5103",
    "subject": "OLPD",
    "number": "5103",
    "honors": false,
    "writing": false,
    "name": "Comparative Education",
    "fullname": "Comparative Education",
    "info": "Examination of systems and philosophies of education globally with emphasis upon African, Asian, European, and North American nations. Foundations of comparative study with selected case studies.",
    "prereq": {}
  },
  {
    "uid": "791030",
    "code": "OLPD5104",
    "subject": "OLPD",
    "number": "5104",
    "honors": false,
    "writing": false,
    "name": "Educ & Sustain Develop Goals",
    "fullname": "Education and the Sustainable Development Goals",
    "info": "This course provides a critical analysis of strategies used to improve educational outcomes worldwide. This course examines contemporary trends in educational policy, development, and practice, focusing on how’s and why’s of educational change. Empirical studies, organizational reports, and student experiences all inform class discussion.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "809888",
    "code": "OLPD5107",
    "subject": "OLPD",
    "number": "5107",
    "honors": false,
    "writing": false,
    "name": "Gender, Educ, Int'l Develop",
    "fullname": "Gender, Education, and International Development",
    "info": "Role of gender/gender relations in international development/education. Interdisciplinary body of literature from development studies, political science, economics, anthropology, cultural studies, gender/women's studies. ",
    "prereq": {}
  },
  {
    "uid": "000651",
    "code": "OLPD5121",
    "subject": "OLPD",
    "number": "5121",
    "honors": false,
    "writing": false,
    "name": "Educ Reform in Intl Context",
    "fullname": "Educational Reform in International Context",
    "info": "Critical policy analysis of educational innovation and reform in selected countries. Use theoretical perspectives and a variety of policy analysis approaches to examine actual educational reforms and their implementation.",
    "prereq": {}
  },
  {
    "uid": "825948",
    "code": "OLPD5122",
    "subject": "OLPD",
    "number": "5122",
    "honors": false,
    "writing": false,
    "name": "Indigenous Edu Res Pol & Pract",
    "fullname": "Indigenous Education: Research, Policy, and Practice",
    "info": "This course examines the relationship between Indigenous communities (broadly defined and in relation with more than humans), cultural practices, knowledges, and in and out-of-school education.\n\nWe pay particular attention to local Indigenous educational experiences and in broader global contexts, which are examined using chronological (histories/time), thematic (topical yet interconnected ideas), and vital approaches (issues requiring urgent attention and their interventions), including analysis of trajectories of Indigenous education, the expansion of mass schooling, education/language ideologies and policies, and resistance, innovation, and Indigenous-driven resurgence through educational design. The course assumes Indigenous education as part of an array of anti- and decolonial strategies for Indigenous self-determination that is inextricable from good human-earth relations; thus, as a class, we take a holistic and connective approach towards understanding education as part of Indigenous knowledge systems.\n\nThe course also assumes diverse forms and definitions of education and epistemologies (the study of knowledge/how we know what we know) proposed by Indigenous and critical scholars. We therefore examine a) the formal schooling of Indigenous children historically designed by non-Indigenous groups, b) education as ancestral birthright/Indigenous socialization and nature-mediated (Kawagley, 2006), and c) education as advancing Indigenous sovereign pedagogies (Goodyear-Ka’ōpua, 2013). Further, the course expands understanding of the links and disruptions between different educational practices, in and out-of-school and across diverse geographies, communities, and ideas and practices of peoplehood—from U.S. American Indian and Alaska Native communities to Indigenous communities in the highland Andes to Pacific Island Nations and beyond.\n\nCentral to student work in this course is learning how Indigenous communities shape learning experiences according to place relations and how Indigenous knowledge systems are foundational in this work. Three organizing concepts assist in this course’s design, reflected through readings and lectures: We pay attention to patterns in policies impacting Indigenous peoples with special attention to explicit environmental/land, language, and educational development; we consider the role of families, communities, and place-based pedagogies in formal and out-of-school education; and we exercise creative educational proposals for Indigenous self-determination and self-development that are linked with Indigenous educational research. Students are asked to carefully examine contexts of the education of Indigenous peoples under local, national and transnational pressures and amidst other variables, specifically economic and political shifts, environmental development-degradation, and climate change and to offer their own proposals toward transformative Indigenous education design and research agendas that inform educational development in and with Indigenous peoples—meaning, the course is most interested in cultivating dialogue and exchanging ideas because there are no singular, closed, or universal solutions to Indigenous environmental challenges and educational design as interventions.\n\nFor students interested in topics related to identified course themes, please note that the course has a strong environmental and land-based foundation and is linked with these keywords: Indigenous Knowledge Systems, land kinship, place-based education and more than human relations, nature-mediated education, Traditional Ecological Knowledge, Indigenous community-based education, Indigenous language reclamation, and decolonial educational research and design. Students are invited to cultivate their own focal areas in relation to prior knowledge and current study interests.",
    "prereq": {}
  },
  {
    "uid": "000652",
    "code": "OLPD5124",
    "subject": "OLPD",
    "number": "5124",
    "honors": false,
    "writing": false,
    "name": "Critical Issues in Intl Educ",
    "fullname": "Critical Issues in International Education and Educational Exchange",
    "info": "Analysis of comprehensive policy-oriented frameworks for international\neducation; practices of U.S. and other universities; conceptual development of international education and its practical application to programs, to employment choices, and to pedagogy.",
    "prereq": {}
  },
  {
    "uid": "000650",
    "code": "OLPD5128",
    "subject": "OLPD",
    "number": "5128",
    "honors": false,
    "writing": false,
    "name": "Anthropology of Education",
    "fullname": "Anthropology of Education",
    "info": "Insights from educational anthropology for educators to address issues of culture, ethnicity, and power in schools.",
    "prereq": {}
  },
  {
    "uid": "004438",
    "code": "OLPD5132",
    "subject": "OLPD",
    "number": "5132",
    "honors": false,
    "writing": false,
    "name": "Intercultural Educ & Training",
    "fullname": "Intercultural Education and Training: Theory and Application",
    "info": "Introduction to the field of intercultural education and related field of multicultural education; analyzes the field through a critical lens; examines diverse meanings of education, including cultural knowledge.",
    "prereq": {}
  },
  {
    "uid": "798375",
    "code": "OLPD5134",
    "subject": "OLPD",
    "number": "5134",
    "honors": false,
    "writing": false,
    "name": "Futures Research, Ed Leaders",
    "fullname": "Futures Research for Educational Leaders",
    "info": "Perspectives/methods of futures research. Historical/antecedent and contemporary influences on futures research. Futures sesearch as social technology vs social (inexact) science. Primary toolbox of futures Research. Emerging potentials of futures research.",
    "prereq": {}
  },
  {
    "uid": "798376",
    "code": "OLPD5136",
    "subject": "OLPD",
    "number": "5136",
    "honors": false,
    "writing": false,
    "name": "Scenario, Story Planning",
    "fullname": "Scenario and Story Planning for Educational Innovators",
    "info": "How to create/use strategic scenarios/stories to anticipate/shape forces/events that could impact future educational design, policy, practice, and administration.  Designing, analyzing, comparing multiple scenarios/stories under different initial conditions, including assumptions, information content, and contexts.",
    "prereq": {}
  },
  {
    "uid": "799234",
    "code": "OLPD5141",
    "subject": "OLPD",
    "number": "5141",
    "honors": false,
    "writing": false,
    "name": "ComparativeYouthPolicy/Ldrship",
    "fullname": "Global Youth Policy and Leadership: Comparative Youth Policy and Leadership",
    "info": "Comparative approach to public responses at  global level to youth development and leadership issues. Social systems such as education, health, employment, and recreation. Role of individuals, communities, governments, and international organizations in providing programs/services.",
    "prereq": {}
  },
  {
    "uid": "799236",
    "code": "OLPD5142",
    "subject": "OLPD",
    "number": "5142",
    "honors": false,
    "writing": false,
    "name": "Youth Futures in Int'l Context",
    "fullname": "Youth Futures in International and Global Contexts",
    "info": "Strategic trends in global youth development. Implications. Reconciling trends with normative scenarios with respect to presence, absence, and projected likelihood of suitable policies, workable collaborations, and funding.\n\nprereq: CIDE student or instr consent",
    "prereq": {}
  },
  {
    "uid": "800749",
    "code": "OLPD5144",
    "subject": "OLPD",
    "number": "5144",
    "honors": false,
    "writing": false,
    "name": "CulturalModels/Simulation/Game",
    "fullname": "Cultural Models, Simulations, and Games",
    "info": "Use of dynamic educational models, simulations, and games in international education/development courses. Storytelling, simulated intercultural encounters, imagination, knowledge construction/applications, time, ethics, computer simulations, games, systems.",
    "prereq": {}
  },
  {
    "uid": "003292",
    "code": "OLPD5200",
    "subject": "OLPD",
    "number": "5200",
    "honors": false,
    "writing": false,
    "name": "Special Topics",
    "fullname": "Special Topics in Adult Education",
    "info": "Exploration of issues, methods, and knowledge in areas of adult education. Content varies.",
    "prereq": {}
  },
  {
    "uid": "003052",
    "code": "OLPD5201",
    "subject": "OLPD",
    "number": "5201",
    "honors": false,
    "writing": false,
    "name": "Strategies",
    "fullname": "Strategies for Teaching Adults",
    "info": "Psychological theories of adult learning; learning styles and personality types; teaching styles; group and team learning; moderating and study circles; teaching technologies and distance learning; gender, race, and cultural communication. Applications of strategies.\n\nprereq: Grad student only",
    "prereq": {}
  },
  {
    "uid": "003172",
    "code": "OLPD5202",
    "subject": "OLPD",
    "number": "5202",
    "honors": false,
    "writing": false,
    "name": "Adult  Lrng & Devp",
    "fullname": "Perspectives of Adult Learning and Development",
    "info": "Emphasis on major adult development theorists, theories, and current applications. Transformative learning, self-directed learning, experiential learning, and cooperative learning provide theoretical framework for exploring physiological, psychological, sociological, and cultural aspects of adult development through the life span.",
    "prereq": {}
  },
  {
    "uid": "003047",
    "code": "OLPD5203",
    "subject": "OLPD",
    "number": "5203",
    "honors": false,
    "writing": false,
    "name": "Methods Ad Literacy",
    "fullname": "Methods of Teaching Adult Literacy",
    "info": "Approaches to teaching reading, writing, and mathematics to adults.  Technology as a teaching tool. Teaching students with disabilities. Cultural/gender differences. English as second language. Evaluation of commercial materials/software.",
    "prereq": {}
  },
  {
    "uid": "003319",
    "code": "OLPD5204",
    "subject": "OLPD",
    "number": "5204",
    "honors": false,
    "writing": false,
    "name": "Program Design",
    "fullname": "Designing the Adult Education Program",
    "info": "Designing and implementing educational programs for adults. Application of concepts, theories, and models in different adult learning situations.",
    "prereq": {}
  },
  {
    "uid": "795494",
    "code": "OLPD5211",
    "subject": "OLPD",
    "number": "5211",
    "honors": false,
    "writing": false,
    "name": "Intro to Undereducated Adult",
    "fullname": "Introduction to the Undereducated Adult",
    "info": "Definitions of literacy in workplace, community, and family. Issues: \npoverty/welfare, ethnicity, cultural diversity, social class, language/learning, immigrants.",
    "prereq": {}
  },
  {
    "uid": "795495",
    "code": "OLPD5212",
    "subject": "OLPD",
    "number": "5212",
    "honors": false,
    "writing": false,
    "name": "Adult Lit. in the Workplace",
    "fullname": "Introduction to Adult Literacy in the Workplace",
    "info": "Review workplace literacy programs, funding, program planning, and needs assessment. Reaching/recruiting workers. Role of employers and the unions. Writing for low literacy employees.\n\nprereq: 5211 or ADED 5211",
    "prereq": {
      "or": [
        "795494"
      ]
    }
  },
  {
    "uid": "795499",
    "code": "OLPD5213",
    "subject": "OLPD",
    "number": "5213",
    "honors": false,
    "writing": false,
    "name": "Adult Lit. in the Community",
    "fullname": "Introduction to Adult Literacy in the Community",
    "info": "Community programs in United States. Literacy building. Family literacy skills. Correctional education in reintegrating offenders back into community. Integrating people with disabilities through community literacy programs. Literacy/development in developing countries. Reaching/recruiting indigenous, migrant, immigrant groups. Social action approaches to literacy education.\n\nprereq: 5211 or ADED 5211",
    "prereq": {
      "or": [
        "795494"
      ]
    }
  },
  {
    "uid": "003332",
    "code": "OLPD5220",
    "subject": "OLPD",
    "number": "5220",
    "honors": false,
    "writing": false,
    "name": "Cont Prof Ed",
    "fullname": "Continuing Education for Professionals",
    "info": "Analysis of philosophies, issues, policies, trends, professional needs and statutory requirements in continuing professional education programs. Role of the program director and organization.",
    "prereq": {}
  },
  {
    "uid": "795503",
    "code": "OLPD5224",
    "subject": "OLPD",
    "number": "5224",
    "honors": false,
    "writing": false,
    "name": "Formal Assessment of Adult Lit",
    "fullname": "Formal Assessment of Adult Literacy",
    "info": "Assessment of adult English/literacy skills for work, family, community, and continuing education. Formal testing policy, techniques, standardized tests. Assumptions about testing, cultural bias, and interpretation of formal tests. Test preparation programs.\n\nprereq: 5211 or ADED 5211",
    "prereq": {
      "or": [
        "795494"
      ]
    }
  },
  {
    "uid": "795504",
    "code": "OLPD5225",
    "subject": "OLPD",
    "number": "5225",
    "honors": false,
    "writing": false,
    "name": "Informal Assessment: Adult Lit",
    "fullname": "Informal Assessment of Adult Literacy",
    "info": "Informal assessment of adult English/literacy skills for work, family, community, and further education. Informal testing techniques, setting educational goals, formal versus informal assessment.\n\nprereq: 5211 or ADED 5211",
    "prereq": {
      "or": [
        "795494"
      ]
    }
  },
  {
    "uid": "795505",
    "code": "OLPD5226",
    "subject": "OLPD",
    "number": "5226",
    "honors": false,
    "writing": false,
    "name": "Advanced Assessment: Adult Lit",
    "fullname": "Advanced Assessment of Adult Literacy",
    "info": "Applications/case studies. Educational planning for work, family, community.\n\nprereq: 5211 or ADED 5211",
    "prereq": {
      "or": [
        "795494"
      ]
    }
  },
  {
    "uid": "795506",
    "code": "OLPD5233",
    "subject": "OLPD",
    "number": "5233",
    "honors": false,
    "writing": false,
    "name": "Methods of Tch. Beg. Adult Lit",
    "fullname": "Methods of Teaching Beginning Adult Literacy",
    "info": "Learning English/literacy as an adult. Initial approaches to teaching reading, writing, and communications skills. Theories of learning/curriculum design. Technology as teaching tool. Teaching students with disabilities or with cultural/gender differences.\n\nprereq: 5211 or ADED 5211",
    "prereq": {
      "or": [
        "795494"
      ]
    }
  },
  {
    "uid": "795522",
    "code": "OLPD5234",
    "subject": "OLPD",
    "number": "5234",
    "honors": false,
    "writing": false,
    "name": "Meth. of Tch. Inter. Adult Lit",
    "fullname": "Methods of Teaching Intermediate Adult Literacy",
    "info": "Learning English/literacy as an adult. Approaches to teaching reading, writing, and communications skills. Communication/comprehension in oral/written English. English reading/oral communication skills for workplace. Evaluating commercial materials/software.\n\nprereq: [5211 or ADED 5211], [5233 or ADED 5233]",
    "prereq": {
      "and": [
        {
          "or": [
            "795494"
          ]
        },
        {
          "or": [
            "795506"
          ]
        }
      ]
    }
  },
  {
    "uid": "795523",
    "code": "OLPD5235",
    "subject": "OLPD",
    "number": "5235",
    "honors": false,
    "writing": false,
    "name": "Meth. of Tch. Adv. Adult Lit.",
    "fullname": "Methods of Teaching Advanced Adult Literacy",
    "info": "Approaches to teaching reading, writing, study, communication skills. Preparing students for college/continuing education. English in workplace/on Internet. Problem solving, analytical thinking. Technology as teaching tool. Evaluating commercial material/software.\n\nprereq: 5211 or ADED 5211",
    "prereq": {
      "or": [
        "795494"
      ]
    }
  },
  {
    "uid": "002679",
    "code": "OLPD5251",
    "subject": "OLPD",
    "number": "5251",
    "honors": false,
    "writing": false,
    "name": "Int  Adult Literacy",
    "fullname": "Introduction to Adult Literacy",
    "info": "Definitions of literacy: workplace, community and family. Issues: poverty, welfare, ethnicity, cultural diversity, social class, language and learning, immigrants. Review of literacy programs, funding, and professionalization. Reaching/recruiting undereducated adults. Role of family, schools, community, and state/local government. New social action approaches required for licensure.",
    "prereq": {}
  },
  {
    "uid": "003054",
    "code": "OLPD5252",
    "subject": "OLPD",
    "number": "5252",
    "honors": false,
    "writing": false,
    "name": "Assess Ad Literacy",
    "fullname": "Assessment of Adult Literacy",
    "info": "Assessment of adult literacy problems as they affect work, family, and community. Setting educational goals. Formal versus informal assessment. Case studies. Educational planning.",
    "prereq": {}
  },
  {
    "uid": "003274",
    "code": "OLPD5296",
    "subject": "OLPD",
    "number": "5296",
    "honors": false,
    "writing": false,
    "name": "Field Exper ADED",
    "fullname": "Field Experience in Adult Education",
    "info": "Supervised fieldwork and practice. Presentations and evaluations of adult education practices.",
    "prereq": {}
  },
  {
    "uid": "000948",
    "code": "OLPD5301",
    "subject": "OLPD",
    "number": "5301",
    "honors": false,
    "writing": false,
    "name": "Contexts of Lrning:Hist,Contem",
    "fullname": "Contexts of Learning: Historical, Contemporary, and Projected",
    "info": "Contextual understanding of education as a social institution. Education is studied as one institution among the several that constitute its dynamic context.  \n",
    "prereq": {}
  },
  {
    "uid": "000950",
    "code": "OLPD5302",
    "subject": "OLPD",
    "number": "5302",
    "honors": false,
    "writing": false,
    "name": "EducPol:Context,Inquiry,Issues",
    "fullname": "Educational Policy: Context, Inquiry, and Issues",
    "info": "Review of social science concepts/research in considering educational policies/issues, process of inquiry that affect policy development, implementation, evaluation. Focus on pre-K-12. Role of educational leaders, administrators.",
    "prereq": {}
  },
  {
    "uid": "000952",
    "code": "OLPD5303",
    "subject": "OLPD",
    "number": "5303",
    "honors": false,
    "writing": false,
    "name": "Managing the Learning Org",
    "fullname": "Managing the Learning Organization",
    "info": "Examines schools, colleges, and other human service organizations centered on learning. Focuses on perspectives and skills needed to manage organizations effectively.\n\n",
    "prereq": {}
  },
  {
    "uid": "000954",
    "code": "OLPD5304",
    "subject": "OLPD",
    "number": "5304",
    "honors": false,
    "writing": false,
    "name": "Educational Leadership",
    "fullname": "Educational Leadership for Equity, Opportunity, and Outcome",
    "info": "Implications of multiple contexts in which leadership occurs. Role of followers. Complexities of collaborative structures and of shared governance.",
    "prereq": {}
  },
  {
    "uid": "793631",
    "code": "OLPD5306",
    "subject": "OLPD",
    "number": "5306",
    "honors": false,
    "writing": false,
    "name": "Staff Tech Devt & Support",
    "fullname": "Staff Technology Development and Support",
    "info": "How to lead an organization in designing, implementing, evaluating, improving, and sharing approaches to staff development. Technology-related development. Facilitating staff development through use of technology.",
    "prereq": {}
  },
  {
    "uid": "793643",
    "code": "OLPD5307",
    "subject": "OLPD",
    "number": "5307",
    "honors": false,
    "writing": false,
    "name": "School Management & Technol",
    "fullname": "School Management and Technology",
    "info": "Various organizational/management issues impacted by information technology. Focuses on hardware, software, and database technologies designed to facilitate management/operations of school organizations.",
    "prereq": {}
  },
  {
    "uid": "793661",
    "code": "OLPD5308",
    "subject": "OLPD",
    "number": "5308",
    "honors": false,
    "writing": false,
    "name": "Emerging Issues School Technol",
    "fullname": "Emerging Issues and School Technology",
    "info": "Needs of schools/administrators to remain on forefront of information technologies. Focuses on anticipated technological trends years/decades ahead.",
    "prereq": {}
  },
  {
    "uid": "819088",
    "code": "OLPD5309",
    "subject": "OLPD",
    "number": "5309",
    "honors": false,
    "writing": false,
    "name": "Responsive School Leadership",
    "fullname": "Culturally Responsive School Leadership",
    "info": "This course will cover the histories, contexts, and major strands of culturally responsive school leadership. Module 1 begins with an overview of some of the primary sources of oppression in the West and the Global South. Here, we cover material on varying epistemologies, the nature of bias, critical self-reflection, and schools, space, and identity. In Module 2, we will examine how these oppressive practices and systems exist in the modern era. We look then at how they enter institutions and how they are reproduced. This includes an examination of various types of bigotry and discrimination in school. In Module 3, we begin to look at how these histories and complex, dynamic systems of power, privilege, and oppression enter and express in schools and communities. We move from the individual to the collective as we explore the many divides between school and community people and perspectives. In Modules 4 and 5, we finally look at emancipatory, liberatory, and culturally responsive models of schooling.  In this last part of the course, we look at how community-based and indigenous knowledge can be used to inform schooling. Here, we dig deep into culturally responsive leadership practice, spending time unpacking 4 major strands of culturally responsive school leadership. We look at how curriculum, instructional leadership, PDs, and other resources are structured to improve equity in a building. We take up the community-based approaches to education. \n",
    "prereq": {}
  },
  {
    "uid": "793663",
    "code": "OLPD5310",
    "subject": "OLPD",
    "number": "5310",
    "honors": false,
    "writing": false,
    "name": "Data-Driven Decision-Making I",
    "fullname": "Data-Driven Decision Making I",
    "info": "Data-driven decision making for schools/administrators. Focuses on data collection/analysis needs of educational organizations and on use of appropriate software/databases to collect, manage, analyze, and report school information.\n\nprereq: Broadband Internet access, a newer computer",
    "prereq": {}
  },
  {
    "uid": "793671",
    "code": "OLPD5311",
    "subject": "OLPD",
    "number": "5311",
    "honors": false,
    "writing": false,
    "name": "Data-Driven Decision-Making II",
    "fullname": "Data-driven Decision Making II",
    "info": "Continuation of 5310. Data-driven decision making for schools/administrators. Hands-on training in students' own organizations in using technology to analyze data to make educational decisions.\n\nprereq: [5310 or EdPA 5310], broadband Internet access, newer computer",
    "prereq": {
      "or": [
        "793663"
      ]
    }
  },
  {
    "uid": "793673",
    "code": "OLPD5312",
    "subject": "OLPD",
    "number": "5312",
    "honors": false,
    "writing": false,
    "name": "School Tech Policy Issues",
    "fullname": "School Technology Policy Issues",
    "info": "Various state/national policy issues related to educational technology. Focuses on \"digital divide\" in schools/communities, federal educational technology policy initiatives, and state/federal educational technology legislation.",
    "prereq": {}
  },
  {
    "uid": "793678",
    "code": "OLPD5313",
    "subject": "OLPD",
    "number": "5313",
    "honors": false,
    "writing": false,
    "name": "Legal Ethcl Issues School Tech",
    "fullname": "Legal and Ethical Issues in School Technology",
    "info": "Social, legal, and ethical issues related to school technology. How to model responsible decision-making related to these issues.",
    "prereq": {}
  },
  {
    "uid": "793679",
    "code": "OLPD5314",
    "subject": "OLPD",
    "number": "5314",
    "honors": false,
    "writing": false,
    "name": "School Tech Safety & Security",
    "fullname": "School Technology Safety and Security",
    "info": "School safety/security issues impacted by information technology. Network/data security. Physical safety of students, employees, and facilities. Computer recycling/disposal. Appropriate ergonomic environments for students/employees.",
    "prereq": {}
  },
  {
    "uid": "793682",
    "code": "OLPD5315",
    "subject": "OLPD",
    "number": "5315",
    "honors": false,
    "writing": false,
    "name": "School Tech Ldrshp Project",
    "fullname": "School Technology Leadership Multimedia Project",
    "info": "Students focus on individualized school technology leadership topic of choice, deliver a multimedia presentation of project results. Regular consultation with faculty, peer mentors, and outside mentors.",
    "prereq": {}
  },
  {
    "uid": "000965",
    "code": "OLPD5321",
    "subject": "OLPD",
    "number": "5321",
    "honors": false,
    "writing": false,
    "name": "The Principal as Leader",
    "fullname": "The Principal as Leader of High-Performing Schools",
    "info": "Theory and practice for educational leadership that is specifically applied to the principalship. Overview competencies in AR 3512 required for MN K-12 principal licensure. Examines roles of the principal as a leader and manager.\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.\n\n",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "788917",
    "code": "OLPD5322",
    "subject": "OLPD",
    "number": "5322",
    "honors": false,
    "writing": false,
    "name": "Leaders in the Superintendency",
    "fullname": "Leaders in the Superintendency and Central Office",
    "info": "Role/responsibility of superintendent in school district. Real life experiences, leadership potential as CEO. Purposes, power, politics, practices of position. Interplay of internal school forces, community forces. Leadership in public, high-profile appointment. Addresses competencies required under MN AR 3512 for administrative licensure.\n\nGrad students working on K-12 Administrative Licensure, MA, MED or PHD \n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "793804",
    "code": "OLPD5323",
    "subject": "OLPD",
    "number": "5323",
    "honors": false,
    "writing": false,
    "name": "Women in Leadership",
    "fullname": "Women in Leadership",
    "info": "Women in leadership, in context of larger systems and their own lives. Supporting equity/equality across areas of difference.\n\nprereq: Technology access",
    "prereq": {}
  },
  {
    "uid": "000963",
    "code": "OLPD5324",
    "subject": "OLPD",
    "number": "5324",
    "honors": false,
    "writing": false,
    "name": "Strategic Financial Planning",
    "fullname": "Strategic Financial Planning and Policy for Educational Leaders",
    "info": "State-local school finance systems, budgeting, governmental fund accounting. Interpretation of financial information. Addresses competencies required under MN AR 3512 for administrative licensure\n\nGrad students working on K-12 Administrative Licensure, MA, MED or PHD\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "793976",
    "code": "OLPD5325",
    "subject": "OLPD",
    "number": "5325",
    "honors": false,
    "writing": false,
    "name": "Analytical Tools Ed Ldrshp",
    "fullname": "Analytical Tools for Educational Leadership",
    "info": "Technological/analytical tools associated with data-driven decision-making processes in K-12 school environments.",
    "prereq": {}
  },
  {
    "uid": "793977",
    "code": "OLPD5326",
    "subject": "OLPD",
    "number": "5326",
    "honors": false,
    "writing": false,
    "name": "Data Analysis Ed Ldrshp",
    "fullname": "Data Analysis for Educational Leadership",
    "info": "Advanced technological/analytical tools associated with data-driven decision-making processes in K-12 school environments.",
    "prereq": {}
  },
  {
    "uid": "000969",
    "code": "OLPD5328",
    "subject": "OLPD",
    "number": "5328",
    "honors": false,
    "writing": false,
    "name": "Intro to Educational Planning",
    "fullname": "Introduction to Educational Planning",
    "info": "Principles, tools, comparative practices, and emerging issues in K-12 and higher education settings; decision making models; strategic and project planning; barriers to effectiveness; and change management processes. ",
    "prereq": {}
  },
  {
    "uid": "000959",
    "code": "OLPD5332",
    "subject": "OLPD",
    "number": "5332",
    "honors": false,
    "writing": false,
    "name": "Personal Leadrsh & Priv Colleg",
    "fullname": "Personal Leadership and the Private College",
    "info": "Recognize/develop leadership skills and competencies necessary for team work, consensus building, group leadership within private colleges. Blend practice/theoretical perspectives to develop leadership competencies of students.\n\nprereq: Must have Bachelors degree awarded prior to taking this course.",
    "prereq": {}
  },
  {
    "uid": "000960",
    "code": "OLPD5336",
    "subject": "OLPD",
    "number": "5336",
    "honors": false,
    "writing": false,
    "name": "Laboratory in Decision Making",
    "fullname": "Laboratory in Decision Making",
    "info": "Contributions of recent research and theory to effective administration. Analysis of administrative behavior in realistic settings; relations of administration to human behavior.",
    "prereq": {}
  },
  {
    "uid": "003187",
    "code": "OLPD5344",
    "subject": "OLPD",
    "number": "5344",
    "honors": false,
    "writing": false,
    "name": "School Law",
    "fullname": "School Law",
    "info": "Legal foundations of elementary/secondary education. Statutory themes, relevant case law, emergent policy issues. Implications for educational organizations and for administrative practice. Addresses competencies required under MN AR 3512 for administrative licensure.\n\nGrad students working on K-12 Administrative Licensure, MA, MED or PHD\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.\n",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "016085",
    "code": "OLPD5346",
    "subject": "OLPD",
    "number": "5346",
    "honors": false,
    "writing": false,
    "name": "Politics of Education",
    "fullname": "Politics of Education",
    "info": "Political dimensions of policy formulation/implementation in education. Use of power/influence in shaping educational policies and in resolving conflicts over educational issues. Analysis of consequences/cross-impacts.\n\nprereq: postbac, MEd, or grad student",
    "prereq": {}
  },
  {
    "uid": "000967",
    "code": "OLPD5348",
    "subject": "OLPD",
    "number": "5348",
    "honors": false,
    "writing": false,
    "name": "Leaders of Human Resources Adm",
    "fullname": "Leaders of Human Resources Administration",
    "info": "Skills for administrator/leader. Human resources administration, employee recruitment, selection, orientation/support, supervision, performance appraisal of school district personnel. Addresses competencies required under MN AR 3512 for administrative licensure.\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "000962",
    "code": "OLPD5361",
    "subject": "OLPD",
    "number": "5361",
    "honors": false,
    "writing": false,
    "name": "Project in Teacher Leadership",
    "fullname": "Project in Teacher Leadership",
    "info": "Create, implement, evaluate, and present a leadership project designed to\ninitiate positive change in educational environments. Review of related literature, proposal development, project development, implementation and evaluation, critical reflection, sharing learning outcomes.  .  If Administrative Licensure candidate see advisor.\n\nprereqs: Grad students working on K-12 Administrative Licensure and/or Master in Education (Leadership in Education)",
    "prereq": {}
  },
  {
    "uid": "000970",
    "code": "OLPD5364",
    "subject": "OLPD",
    "number": "5364",
    "honors": false,
    "writing": false,
    "name": "Context/Practice Ed Leadership",
    "fullname": "Context and Practice of Educational Leadership",
    "info": "Current research/practice on educational leadership. Focuses on creating school cultures conducive to continuous improvement/change. Strategies for personal/organizational leadership in PK-12 settings.",
    "prereq": {}
  },
  {
    "uid": "000966",
    "code": "OLPD5368",
    "subject": "OLPD",
    "number": "5368",
    "honors": false,
    "writing": false,
    "name": "Leadership Special Ed Srvcs",
    "fullname": "Leadership for Special Education Services",
    "info": "Legislative, procedural, executive, and judicial actions that affect services, families, and children with special needs at federal, state, and local levels. Overview of cultural competence, conflict management, due process, supplemental programs. Addresses competencies required under MN AR 3512 for administrative licensure\n\nGrad students working on K-12 Administrative Licensure and/or Master in Education (Leadership in Education)\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "000958",
    "code": "OLPD5372",
    "subject": "OLPD",
    "number": "5372",
    "honors": false,
    "writing": false,
    "name": "Youth in Modern Society",
    "fullname": "Youth in Modern Society",
    "info": "Youth in advanced societies and as a social entity; functions and roles in industrial society, family, education, politics and government, economy and work, welfare and religion; organizations, social movements, and subcultures; empirical research and cross-cultural perspectives.",
    "prereq": {}
  },
  {
    "uid": "788908",
    "code": "OLPD5374",
    "subject": "OLPD",
    "number": "5374",
    "honors": false,
    "writing": false,
    "name": "Lrdshp for Professional Dev",
    "fullname": "Leadership for Professional Development",
    "info": "Designing, implementing, evaluating staff development in preK-12 settings. Research-based standards for effective staff development. Need for embedded time for collaborative learning, evaluating staff/student outcomes.\n\nprereq: Postbaccaleaureate, at least 3 yrs teaching experience",
    "prereq": {}
  },
  {
    "uid": "801775",
    "code": "OLPD5375",
    "subject": "OLPD",
    "number": "5375",
    "honors": false,
    "writing": false,
    "name": "Special Education Finance",
    "fullname": "Special Education Finance: Program Models, Policy, and Law",
    "info": "How special education revenue is a resource to accomplish student-related objectives. Revenue sources, compliance, budget monitoring. Key policy, case law, program models from perspective of director of special education.\n\nprereq: Grad students working on K-12 Administrative Licensure and/or Master in Education (Leadership in Education)",
    "prereq": {}
  },
  {
    "uid": "801608",
    "code": "OLPD5376",
    "subject": "OLPD",
    "number": "5376",
    "honors": false,
    "writing": false,
    "name": "Leading School Tax Elections",
    "fullname": "Leading School Tax Elections",
    "info": "Comprehensive planning model for conducting school tax elections. Emphasizes systems, strategies, and campaign tactics.",
    "prereq": {}
  },
  {
    "uid": "801609",
    "code": "OLPD5377",
    "subject": "OLPD",
    "number": "5377",
    "honors": false,
    "writing": false,
    "name": "Community Ed Finance & Law",
    "fullname": "Leadership in Community Education Finance and Law",
    "info": "Statute 124D and its relationship to each of the categories of community education: early childhood, family education, adult basic education, and ALC funding.  Revenues and expenditures,  UFARS, and how to access information.  Organize financial and legal data for presentation. The course will be approached from the frame of resource development.  \n\nPrereqs: OLPD 5385, OLPD 5386",
    "prereq": {}
  },
  {
    "uid": "000972",
    "code": "OLPD5381",
    "subject": "OLPD",
    "number": "5381",
    "honors": false,
    "writing": false,
    "name": "Search for Children&Youth Pol",
    "fullname": "The Search for Children and Youth Policy in the U.S.",
    "info": "Review of contemporary policy issues affecting children and youth \nin the U.S. and South Africa; identify national standards, norms \nand principles of youth development; conflicting expectations \nfacing policy-makers; and search for the critical content of youth policy.",
    "prereq": {}
  },
  {
    "uid": "796071",
    "code": "OLPD5384",
    "subject": "OLPD",
    "number": "5384",
    "honors": false,
    "writing": false,
    "name": "Special Ed Law for Leaders",
    "fullname": "Special Education Law for Leaders",
    "info": "Competencies of leadership, policy, and political influence. Legal/regulatory applications focusing on special education law.  Addresses competencies required under MN AR 3512 for administrative licensure\n\nprereq: Grad students working on K-12 Administrative Licensure and/or Master in Education (Leadership in Education)",
    "prereq": {}
  },
  {
    "uid": "794267",
    "code": "OLPD5385",
    "subject": "OLPD",
    "number": "5385",
    "honors": false,
    "writing": false,
    "name": "Licensure Seminar",
    "fullname": "Licensure Seminar: Program Policies and Inclusionary Leadership",
    "info": "Overview of the rules and requirements of the U of M and MN AR, completion of the required individual pre-assessment, development of the learner’s individualized program plan.  Discussion of beliefs and values that guide administrative leadership, and completion of the Intercultural Conflict Style Inventory.  ",
    "prereq": {}
  },
  {
    "uid": "794260",
    "code": "OLPD5386",
    "subject": "OLPD",
    "number": "5386",
    "honors": false,
    "writing": false,
    "name": "Leadership Portfolio Seminar",
    "fullname": "Leadership Portfolio Seminar",
    "info": "Development of electronic administrative licensure portfolio to use throughout Administrative Licensure program. Address competencies as mandated in the LEAPS Act. Addresses competencies required under MN AR 3512 for administrative licensure.\n\nprereq: OLPD 5385 or concurrent registration is required.",
    "prereq": {
      "or": [
        "794267"
      ]
    }
  },
  {
    "uid": "794261",
    "code": "OLPD5387",
    "subject": "OLPD",
    "number": "5387",
    "honors": false,
    "writing": false,
    "name": "Leadership for Tchg & Lrng",
    "fullname": "Leadership for Teaching and Learning",
    "info": "Multiple aspects of administrating teaching/learning. Administration of teaching/learning as system in inclusive schools. Questions administrator must ask as leader of learning for students/adults. Addresses competencies required under MN AR 3512 for administrative licensure.\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "794268",
    "code": "OLPD5388",
    "subject": "OLPD",
    "number": "5388",
    "honors": false,
    "writing": false,
    "name": "Ldrship-Master(ful) Scheduling",
    "fullname": "Leadership for Master(ful) Scheduling",
    "info": "Work of high-performing professional learning communities. Implications for moving from building master schedule to leadership for master(ful) scheduling of time, space, motion, people. Addresses competencies required under MN AR 3512 for administrative licensure.\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "794269",
    "code": "OLPD5389",
    "subject": "OLPD",
    "number": "5389",
    "honors": false,
    "writing": false,
    "name": "Community Education Leadership",
    "fullname": "Community Education Leadership",
    "info": "Competencies of leadership, community relations, communication, community assessment, program development, program evaluation. Philosophy/administration of community/alternative education programs. Addresses competencies required under MN AR 3512 for administrative licensure.\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "000976",
    "code": "OLPD5396",
    "subject": "OLPD",
    "number": "5396",
    "honors": false,
    "writing": false,
    "name": "Field Exper in PK-12 Admin",
    "fullname": "Field Experience in PK-12 Administration: Authentic Practice in Leadership",
    "info": "Field experience or internship arranged for students seeking licensure as PK-12 principal/superintendent. Content/credit depend on licensure requirements specified in individual field experience agreement\n\nprereqs: OLPD 5385 Licensure Seminar: Program Policies and Inclusionary Leadership or concurrent registration and OLPD 5386 Leadership Portfolio or concurrent registration.",
    "prereq": {
      "or": [
        "794267",
        "794260"
      ]
    }
  },
  {
    "uid": "002411",
    "code": "OLPD5401",
    "subject": "OLPD",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Tech Prob Solv",
    "fullname": "Technological Problem Solving",
    "info": "Capstone technology education course. Students research problems relative to various technological systems, develop solutions. ",
    "prereq": {}
  },
  {
    "uid": "790612",
    "code": "OLPD5402",
    "subject": "OLPD",
    "number": "5402",
    "honors": false,
    "writing": false,
    "name": "ED & HRD through Tourism",
    "fullname": "Education and Human Resource Development Through Tourism",
    "info": "Policies/practices of education and human resource development in tourism industry.",
    "prereq": {}
  },
  {
    "uid": "790615",
    "code": "OLPD5403",
    "subject": "OLPD",
    "number": "5403",
    "honors": false,
    "writing": false,
    "name": "Tourism Studies Capstone Sem.",
    "fullname": "Tourism Studies Capstone Seminar",
    "info": "Students present, critique, and discuss implications of supporting programs for tourism.\n\nprereq: Tourism studies major",
    "prereq": {}
  },
  {
    "uid": "790611",
    "code": "OLPD5404",
    "subject": "OLPD",
    "number": "5404",
    "honors": false,
    "writing": false,
    "name": "The Business of Tourism",
    "fullname": "The Business of Tourism",
    "info": "Introduction to major theories, concepts, skills, and techniques influencing tourism business/industry.",
    "prereq": {}
  },
  {
    "uid": "002428",
    "code": "OLPD5405",
    "subject": "OLPD",
    "number": "5405",
    "honors": false,
    "writing": false,
    "name": "Critical Issues BIE",
    "fullname": "Critical Issues in Business and Industry",
    "info": "Identification and analysis of major current issues in business and industry education.",
    "prereq": {}
  },
  {
    "uid": "002505",
    "code": "OLPD5410",
    "subject": "OLPD",
    "number": "5410",
    "honors": false,
    "writing": false,
    "name": "Intro to Bus & Mktg Educ",
    "fullname": "Introduction to Business and Marketing Education",
    "info": "Conceptual models of business/marketing education useful in design/delivery of business/marketing education programs in secondary/postsecondary schools, adult education settings, and business/industry.",
    "prereq": {}
  },
  {
    "uid": "004905",
    "code": "OLPD5411",
    "subject": "OLPD",
    "number": "5411",
    "honors": false,
    "writing": false,
    "name": "Teach Mktg Promo",
    "fullname": "Teaching Marketing Promotion",
    "info": "Materials, methods, and approaches to teaching marketing promotion. Covers the basic elements of the marketing mix: advertising, promotion, public relations, direct selling, visual merchandising, and direct marketing.",
    "prereq": {}
  },
  {
    "uid": "005237",
    "code": "OLPD5421",
    "subject": "OLPD",
    "number": "5421",
    "honors": false,
    "writing": false,
    "name": "Voc Guid in BIE",
    "fullname": "Vocational Guidance in Business and Industry Education",
    "info": "Self assessment, use of occupational and labor market information, job seeking skills, work and work satisfaction. For industrial teachers and trainers in school and industry settings.",
    "prereq": {}
  },
  {
    "uid": "002417",
    "code": "OLPD5425",
    "subject": "OLPD",
    "number": "5425",
    "honors": false,
    "writing": false,
    "name": "Foundations of Industrial Educ",
    "fullname": "Foundations of Industrial Education",
    "info": "Social, economic, psychological, philosophical, legislative, and pedagogical foundations of industrial education in the United States. Comparison with selected foreign countries. Analysis of contemporary trends against backdrop of early foundations.",
    "prereq": {}
  },
  {
    "uid": "002425",
    "code": "OLPD5440",
    "subject": "OLPD",
    "number": "5440",
    "honors": false,
    "writing": false,
    "name": "Bus & Ind Obs & Sem",
    "fullname": "Business and Industry Observation and Seminar",
    "info": "Current operating practices and career opportunities in business and industry. Planned experiences in work environments and related seminars.",
    "prereq": {}
  },
  {
    "uid": "002418",
    "code": "OLPD5444",
    "subject": "OLPD",
    "number": "5444",
    "honors": false,
    "writing": false,
    "name": "Fac Mgmt BIE",
    "fullname": "Facilities Management in Business and Industry",
    "info": "Planning, evaluating, and managing industrial education shop and lab facilities.",
    "prereq": {}
  },
  {
    "uid": "002427",
    "code": "OLPD5452",
    "subject": "OLPD",
    "number": "5452",
    "honors": false,
    "writing": false,
    "name": "Mthds Tchg Bus & Mktg Concepts",
    "fullname": "Methods of Teaching Business and Marketing Concepts",
    "info": "Recent research/developments in teaching business concepts related to economics, business organization/management, business law, entrepreneurship, marketing, international business, information systems, accounting, risk management, and personal finance.",
    "prereq": {}
  },
  {
    "uid": "002468",
    "code": "OLPD5454",
    "subject": "OLPD",
    "number": "5454",
    "honors": false,
    "writing": false,
    "name": "Tech/Dev/Spec",
    "fullname": "Technical Development: Specialized",
    "info": "Students select/study technical processes/principles based on subjects they plan to teach, integrate specialized technical instruction in advanced/emerging areas.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "002512",
    "code": "OLPD5457",
    "subject": "OLPD",
    "number": "5457",
    "honors": false,
    "writing": false,
    "name": "Mthds Tchg Bus & Mktg Emplymt",
    "fullname": "Methods of Teaching Business Employment and Marketing Employment",
    "info": "Recent research/developments in teaching for business employment. Administrative support positions, accounting/information processing, marketing, sales, computer operations, other occupations using desktop computing.",
    "prereq": {}
  },
  {
    "uid": "002504",
    "code": "OLPD5465",
    "subject": "OLPD",
    "number": "5465",
    "honors": false,
    "writing": false,
    "name": "Curr Dev/Tech Educ",
    "fullname": "Curriculum Development in Technology Education",
    "info": "Conceptualization and derivation of content for the K-12 technology curriculum. Comparison of U.S. approaches to technology curriculum with selected countries.",
    "prereq": {}
  },
  {
    "uid": "789771",
    "code": "OLPD5475",
    "subject": "OLPD",
    "number": "5475",
    "honors": false,
    "writing": false,
    "name": "Curriculum Development for BME",
    "fullname": "Curriculum Development for Business and Marketing Education",
    "info": "Introduction to conceptual models for design/delivery of business/marketing education programs in secondary/postsecondary schools, in adult education settings, and in business/industry. Preparing programs of instruction for secondary/postsecondary level. Making decisions regarding course content.",
    "prereq": {}
  },
  {
    "uid": "002419",
    "code": "OLPD5476",
    "subject": "OLPD",
    "number": "5476",
    "honors": false,
    "writing": false,
    "name": "Field Based Proj: BIE",
    "fullname": "Field Based Projects in Business and Industry",
    "info": "Curricular, instructional, developmental, or evaluative problems and projects applicable to local school or business and industry situations.",
    "prereq": {}
  },
  {
    "uid": "002460",
    "code": "OLPD5480",
    "subject": "OLPD",
    "number": "5480",
    "honors": false,
    "writing": false,
    "name": "Special Topics in BIE",
    "fullname": "Special Topics in Business and Industry Education",
    "info": "Content varies by offering.",
    "prereq": {}
  },
  {
    "uid": "002521",
    "code": "OLPD5493",
    "subject": "OLPD",
    "number": "5493",
    "honors": false,
    "writing": false,
    "name": "Dir Study: BIE",
    "fullname": "Directed Study in Business and Industry",
    "info": "In-depth individual inquiry in the content areas related to business and industry.",
    "prereq": {}
  },
  {
    "uid": "002474",
    "code": "OLPD5496",
    "subject": "OLPD",
    "number": "5496",
    "honors": false,
    "writing": false,
    "name": "Occupational Experience in BIE",
    "fullname": "Occupational Experience in Business and Industry",
    "info": "Observation/employment in business/industry to develop technical/occupational competencies. Includes 100 clock hours of supervised work experience per credit.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "000942",
    "code": "OLPD5501",
    "subject": "OLPD",
    "number": "5501",
    "honors": false,
    "writing": false,
    "name": "Principles & Methods of Eval",
    "fullname": "Principles and Methods of Evaluation",
    "info": "Introduction to program evaluation. Planning an evaluation study, collecting and analyzing information, reporting results; evaluation strategies; overview of the field of program evaluation.",
    "prereq": {}
  },
  {
    "uid": "808490",
    "code": "OLPD5502",
    "subject": "OLPD",
    "number": "5502",
    "honors": false,
    "writing": false,
    "name": "Evaluation theory for practice",
    "fullname": "Comparative evaluation theory for practice",
    "info": "This class will give students the foundation in evaluation theory necessary for high-quality and ethical practice in evaluation, consulting, or other forms of organizational change\n\nRecommend 5501 or equivalent (can be taken concurrently)",
    "prereq": {}
  },
  {
    "uid": "000946",
    "code": "OLPD5521",
    "subject": "OLPD",
    "number": "5521",
    "honors": false,
    "writing": false,
    "name": "Cost&Econ Analysis in Ed Eval",
    "fullname": "Cost and Economic Analysis in Educational Evaluation",
    "info": "Use and application of cost-effectiveness, cost-benefit, cost-utility, and cost-feasibility in evaluation of educational problems and programs.",
    "prereq": {}
  },
  {
    "uid": "000947",
    "code": "OLPD5524",
    "subject": "OLPD",
    "number": "5524",
    "honors": false,
    "writing": false,
    "name": "Evaluation Colloquium",
    "fullname": "Evaluation Colloquium",
    "info": "Informal seminar of faculty/students. Issues/problems of program evaluation.\n\nprereq: [5501 or EDPA], [5501 or EPSY 5243]",
    "prereq": {
      "and": [
        {
          "or": [
            "000942"
          ]
        },
        {
          "or": [
            "000942",
            "792018"
          ]
        }
      ]
    }
  },
  {
    "uid": "800853",
    "code": "OLPD5528",
    "subject": "OLPD",
    "number": "5528",
    "honors": false,
    "writing": false,
    "name": "Focus Group Research",
    "fullname": "Focus Group Interviewing Research Methods",
    "info": "Students get an overview of the critical features of designing and conducting focus group interviews. Students practice moderating skills and then develop questions for a focus group project.",
    "prereq": {}
  },
  {
    "uid": "003630",
    "code": "OLPD5602",
    "subject": "OLPD",
    "number": "5602",
    "honors": false,
    "writing": false,
    "name": "Econ Found of HRD",
    "fullname": "Economic Foundation of Human Resource Development",
    "info": "Introduction to economics as core discipline supporting theory/practice of human resource development.\n\nprereq: 5601 or HRD 5101",
    "prereq": {}
  },
  {
    "uid": "003632",
    "code": "OLPD5603",
    "subject": "OLPD",
    "number": "5603",
    "honors": false,
    "writing": false,
    "name": "Mthds Tchg Bus & Mktg Emplymt",
    "fullname": "Methods of Teaching Business Employment and Marketing Employment",
    "info": "Recent research/developments in teaching for business employment. Administrative support positions, accounting/information processing, marketing, sales, computer operations, other occupations using desktop computing.",
    "prereq": {}
  },
  {
    "uid": "003634",
    "code": "OLPD5604",
    "subject": "OLPD",
    "number": "5604",
    "honors": false,
    "writing": false,
    "name": "Systems Foundation of HR Dev",
    "fullname": "Systems Foundation of Human Resource Development",
    "info": "Introduction to system theory as a core discipline supporting the theory and practice of human resource development.\n\nprereq: 5601",
    "prereq": {}
  },
  {
    "uid": "003636",
    "code": "OLPD5605",
    "subject": "OLPD",
    "number": "5605",
    "honors": false,
    "writing": false,
    "name": "Strategic Plan/HR",
    "fullname": "Strategic Human Resource Development",
    "info": "Strategic nature of organizations. How HRD can align its goals with those of organization. Strategic planning, systems thinking. Ways HRD managers can become strategic players in organization.\n\nprereq: 5607 or 5615 or HRD 5201 or with instructor's permission",
    "prereq": {
      "or": [
        "002535",
        "003643",
        "003052"
      ]
    }
  },
  {
    "uid": "002535",
    "code": "OLPD5607",
    "subject": "OLPD",
    "number": "5607",
    "honors": false,
    "writing": false,
    "name": "Organization Development",
    "fullname": "Organization Development",
    "info": "Introduction to major concepts, skills, and techniques for organization development/change.\n\nprereq: Grad student only",
    "prereq": {}
  },
  {
    "uid": "002531",
    "code": "OLPD5611",
    "subject": "OLPD",
    "number": "5611",
    "honors": false,
    "writing": false,
    "name": "Fac & Mtg Skills",
    "fullname": "Facilitation and Meeting Skills",
    "info": "Introduction to the disciplines of planning and running effective meetings.  Tools and methods for meeting management and evaluation are presented within the context of organization development.",
    "prereq": {}
  },
  {
    "uid": "002530",
    "code": "OLPD5612",
    "subject": "OLPD",
    "number": "5612",
    "honors": false,
    "writing": false,
    "name": "Intl HRD",
    "fullname": "International Human Resource Development",
    "info": "Problems, practices, programs, theories, and methodologies in human resource development as practiced internationally.\n\nprereq: Grad students only; ugrd seniors with instr consent",
    "prereq": {}
  },
  {
    "uid": "795572",
    "code": "OLPD5613",
    "subject": "OLPD",
    "number": "5613",
    "honors": false,
    "writing": false,
    "name": "Survey of Research Methods",
    "fullname": "Survey of Research Methods and Emerging Research in Human Resource Development",
    "info": "Role of research in HRD. Standards/criteria for evaluating research, critique of conference research papers, identification of emerging research themes. Offered in conjunction with the annual conference of Academy of HRD.\n\nprereq: [Registered, in attendance] at conference of Academy of HRD",
    "prereq": {}
  },
  {
    "uid": "003643",
    "code": "OLPD5615",
    "subject": "OLPD",
    "number": "5615",
    "honors": false,
    "writing": false,
    "name": "Training & Development of HR",
    "fullname": "Training and Development of Human Resources",
    "info": "Training/development of human resources in organizations. Process phases of analysis, design, development, implementation, and evaluation.\n\nprereq: Grad student only",
    "prereq": {}
  },
  {
    "uid": "003647",
    "code": "OLPD5616",
    "subject": "OLPD",
    "number": "5616",
    "honors": false,
    "writing": false,
    "name": "Instructional Desi for e-Learn",
    "fullname": "Instructional Design for e-Learning",
    "info": "Major concepts, skills, and techniques for giving and receiving training on the Internet.\n\nprereq: Grad student only",
    "prereq": {}
  },
  {
    "uid": "002527",
    "code": "OLPD5619",
    "subject": "OLPD",
    "number": "5619",
    "honors": false,
    "writing": false,
    "name": "Plg & Dec-Mkg",
    "fullname": "Planning and Decision-Making Skills",
    "info": "Introduction to the disciplines of planning and decision making typically used in process improvement interventions. Tools and methods for facilitating group decisions and problem solving.",
    "prereq": {}
  },
  {
    "uid": "792052",
    "code": "OLPD5625",
    "subject": "OLPD",
    "number": "5625",
    "honors": false,
    "writing": false,
    "name": "Technical Skills Training",
    "fullname": "Technical Skills Training",
    "info": "Analyzing technical skills training practices in business and industry.  Systems and process analysis and trouble-shooting of work behavior; design methods and developing training materials.",
    "prereq": {}
  },
  {
    "uid": "002532",
    "code": "OLPD5670",
    "subject": "OLPD",
    "number": "5670",
    "honors": false,
    "writing": false,
    "name": "Special Topics in HRD",
    "fullname": "Special Topics in Human Resource Development",
    "info": "Issues, methods, and knowledge in HRD areas. Topics vary.",
    "prereq": {}
  },
  {
    "uid": "003638",
    "code": "OLPD5696",
    "subject": "OLPD",
    "number": "5696",
    "honors": false,
    "writing": false,
    "name": "Internship:  HRD",
    "fullname": "Internship: Human Resource Development",
    "info": "Students apply/contract for human resource development positions.\n\nprereq: [[3901 or HRD 3601, [3696 or HRD 3196], [3620 or 3640 or HRD 3201 or HRD 3301], [3202 or ADED 3101], undergrad] or [[5607 or 5615 or HRD 5201 or HRD 5301], [5801 or WHRE 5001], grad student]], instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "794250",
            {
              "or": [
                "797881",
                "792895"
              ]
            },
            {
              "or": [
                "796722"
              ]
            }
          ]
        },
        {
          "or": [
            "002535",
            "003643",
            "003052",
            "000948"
          ]
        },
        {
          "or": [
            "792074",
            "000865"
          ]
        }
      ]
    }
  },
  {
    "uid": "003642",
    "code": "OLPD5697",
    "subject": "OLPD",
    "number": "5697",
    "honors": false,
    "writing": false,
    "name": "International Field Study: HRD",
    "fullname": "International Field Study in Human Resource Development",
    "info": "Engage in international travel/study for one week with an HRD faculty leader. Visit a variety of sites in business and industry to become aware of how HRD is practiced outside the United States.\n\nprereq: 5001",
    "prereq": {
      "and": [
        "000865"
      ]
    }
  },
  {
    "uid": "000929",
    "code": "OLPD5701",
    "subject": "OLPD",
    "number": "5701",
    "honors": false,
    "writing": false,
    "name": "U.S. Higher Education",
    "fullname": "U.S. Higher Education",
    "info": "U.S. higher/postsecondary education in historical/contemporary perspective. Emphasizes structure, history, and purposes of system as a whole.",
    "prereq": {}
  },
  {
    "uid": "819086",
    "code": "OLPD5702",
    "subject": "OLPD",
    "number": "5702",
    "honors": false,
    "writing": false,
    "name": "Higher Ed in Global Contexts",
    "fullname": "Higher Education in Global Contexts",
    "info": "This course is an introductory overview of higher education in the international context and the processes of internationalization in which higher education institutions engage. It addresses contemporary issues facing regions, countries, and higher education institutions across the world and focuses on how higher education institutions approach their global work. The outcomes sought for students in this course include the following:\nUnderstanding of broad historical events, including the political, cultural, religious, psychological, and economic factors that shaped higher education in regions and countries across the world;\nKnowledge about the role of the federal government in shaping the structure of the higher education system in specific countries;\nUnderstanding of the process of internationalization as it relates to institutions across the world;\nIdentification of the motivating factors that influence international activity related to higher education institutions;\nIdentification of the cultural and sociopolitical factors that drive internationalization in higher education institutions.\n\nNo single course can address all of the topics related to international higher education. In this course, the following seven primary questions serve as the focus for an analysis of international higher education: \n1) What are the most significant historical factors that shaped higher education in a specific country, and to what extent do those country-specific historical factors help understand higher education in the region? \n2) What is the role of the federal government in a country, and to what extent are within-country differences analogous to differences among states in the United States? \n3) How is higher education financed within a country, and are there regional economic forces that affect countries in the region? \n4) What is the structure of higher education in the country (e.g., public institutions, private non-profit institutions, and for-profit institutions)? \n5) What sociocultural, political, and institutional aspects of institutions’ global initiatives.\n",
    "prereq": {}
  },
  {
    "uid": "825125",
    "code": "OLPD5703",
    "subject": "OLPD",
    "number": "5703",
    "honors": false,
    "writing": false,
    "name": "Col Stud Ment Hlth & Wellbeing",
    "fullname": "College Student Mental Health and Wellbeing",
    "info": "College counseling centers across the U.S. report that the number of students with significant mental health and wellness issues is an increasing concern. For example, 21 percent of counseling center students present with severe mental health concerns, while another 40 percent of students exhibit mild mental health problems. These numbers will be exacerbated as a result of the ongoing Covid-19 pandemic. An unknown number of students receive support from college staff who work in student support roles.  \n\nCollege Student Mental Health and Wellness, will critically explore research and practice describing the mental and emotional concerns of students on college campuses and the types of interventions designed to address them. Topics in the course will include – but will not be limited to – types of mental health concerns, ways in which multicultural issues influence how students express mental health concerns, working with students in crisis, structures of referral sources, ethical and legal issues, managing mental health in Covid-19, and self-care for those working with these students on college campuses.  \n\nComponents on effective strategies for providing psychological support will assist students in the development of their communication skills.  We will also explore a range of wellness issues that intersect with mental health and wellness concerns.  Note:  this class will focus on the exploration of mental health issues from higher education and student affairs perspectives (e.g. how can higher education professionals and student affairs staff best support students with mental health concerns across individual and institutional levels?).\n",
    "prereq": {}
  },
  {
    "uid": "000932",
    "code": "OLPD5704",
    "subject": "OLPD",
    "number": "5704",
    "honors": false,
    "writing": false,
    "name": "College Students Today",
    "fullname": "College Students Today",
    "info": "Issues involving population of students in colleges/universities. College student development theory, students' expectations/interests. How college affects student outcomes. Role of curricular/extracurricular activities. Student-faculty interaction.",
    "prereq": {}
  },
  {
    "uid": "809337",
    "code": "OLPD5709",
    "subject": "OLPD",
    "number": "5709",
    "honors": false,
    "writing": false,
    "name": "Critical Issues Higher Educ",
    "fullname": "Critical Issues in Higher Education",
    "info": "Issues/opportunities facing American higher education. Financial, demographic, athletics, for-profit, changing public opinion. Framework for analysis.",
    "prereq": {}
  },
  {
    "uid": "803116",
    "code": "OLPD5712",
    "subject": "OLPD",
    "number": "5712",
    "honors": false,
    "writing": false,
    "name": "Col Stud Dev Theory & Pract",
    "fullname": "College Student Development Theory and Practice",
    "info": "Multicultural student development theories/theorists. Implications for teaching/learning. Students reflect on The Student Personnel Point of View and Learning Reconsidered: Campus-wide Focus on the Student Experience and other collaborative efforts.",
    "prereq": {}
  },
  {
    "uid": "000933",
    "code": "OLPD5721",
    "subject": "OLPD",
    "number": "5721",
    "honors": false,
    "writing": false,
    "name": "Race & Ethnicity in Higher Ed",
    "fullname": "Race and Ethnicity in Higher Education",
    "info": "Review of research. Theoretical frameworks, methodological perspectives, and research strategies used to study students, staff, and faculty. Historical perspectives.",
    "prereq": {}
  },
  {
    "uid": "000937",
    "code": "OLPD5724",
    "subject": "OLPD",
    "number": "5724",
    "honors": false,
    "writing": false,
    "name": "Leadrshp/Admin Student Affairs",
    "fullname": "Leadership and Administration of Student Affairs",
    "info": "Scope, administration, coordination, and evaluation of programs in college and university student affairs.",
    "prereq": {}
  },
  {
    "uid": "790720",
    "code": "OLPD5727",
    "subject": "OLPD",
    "number": "5727",
    "honors": false,
    "writing": false,
    "name": "Dev Ed Prog & Postsec Students",
    "fullname": "Developmental Education Programs and Postsecondary Students",
    "info": "Focuses on populations served by developmental education programs in the United States and abroad. Defines developmental education. Historical perspective for need for developmental education, student development theories that guide practice in developmental education. Identifying student needs. Model programs, best practices for student retention. Current issues/trends in field.",
    "prereq": {}
  },
  {
    "uid": "000935",
    "code": "OLPD5728",
    "subject": "OLPD",
    "number": "5728",
    "honors": false,
    "writing": false,
    "name": "Two-Year Postsec Institutions",
    "fullname": "Two-Year Postsecondary Institutions",
    "info": "Present status, development, functions, organization, curriculum, and trends in postsecondary, but nonbaccalaureate, institutions.  ",
    "prereq": {}
  },
  {
    "uid": "000936",
    "code": "OLPD5732",
    "subject": "OLPD",
    "number": "5732",
    "honors": false,
    "writing": false,
    "name": "Law & Postsecndry Institutions",
    "fullname": "The Law and Postsecondary Institutions",
    "info": "Analysis of court opinions and federal regulations affecting postsecondary educational institutions.",
    "prereq": {}
  },
  {
    "uid": "790721",
    "code": "OLPD5734",
    "subject": "OLPD",
    "number": "5734",
    "honors": false,
    "writing": false,
    "name": "Institutional Research",
    "fullname": "Institutional Research in Postsecondary Education",
    "info": "Scope, role, administration, research strategies, and evaluation of institutional research in postsecondary institutions. Methodologies, disciplinary foundations of research. Use of institutional, state, and national databases in addressing institutional missions/functions.\n\nprereq: [5701, [EPSY 5231 or EPSY 8261], grad student] or instr consent",
    "prereq": {
      "and": [
        "000929",
        {
          "or": [
            "002018",
            "002261"
          ]
        }
      ]
    }
  },
  {
    "uid": "809338",
    "code": "OLPD5736",
    "subject": "OLPD",
    "number": "5736",
    "honors": false,
    "writing": false,
    "name": "Public Engagement & Higher Ed",
    "fullname": "Public Engagement and Higher Education",
    "info": "Study/practice of public engagement in higher education.  Civic roles of post-secondary education institutions.",
    "prereq": {}
  },
  {
    "uid": "794083",
    "code": "OLPD5795",
    "subject": "OLPD",
    "number": "5795",
    "honors": false,
    "writing": false,
    "name": "Plan B Research Design",
    "fullname": "Plan B Research Design",
    "info": "Foundation to design Plan B research project relevant to student's professional interests. Literature review strategies to establish conceptual framework for project. Relates research question to design alternatives and to associated qualitative/quantitative analysis techniques. Issues such as human subjects and APA guidelines for preparing research papers.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "803112",
    "code": "OLPD5796",
    "subject": "OLPD",
    "number": "5796",
    "honors": false,
    "writing": false,
    "name": "PsTL Practicum",
    "fullname": "Supervised Practicum in Multicultural Postsecondary Teaching and Learning",
    "info": "Postsecondary teaching experience in supervised settings. Weekly group supervision session. Classroom experiences, learning centers, and other postsecondary teaching venues.\n\nprereq: Grad student in PsTL certificate program or admitted to PsTL master's program",
    "prereq": {}
  },
  {
    "uid": "792074",
    "code": "OLPD5801",
    "subject": "OLPD",
    "number": "5801",
    "honors": false,
    "writing": false,
    "name": "Survey: HRD & AdEd",
    "fullname": "Survey: Human Resource Development and Adult Education",
    "info": "Overview of fields of human resource development and adult education. Societal context, theories, processes, definitions, philosophies, goals, sponsoring agencies, professional roles, participants, and resources. Unique characteristics and ways fields overlap and enhance one another.\n\nprereq: Grad student only",
    "prereq": {}
  },
  {
    "uid": "003392",
    "code": "OLPD5802",
    "subject": "OLPD",
    "number": "5802",
    "honors": false,
    "writing": false,
    "name": "Think,Learn,Teach-WHRE",
    "fullname": "Thinking, Learning, and Teaching in Work and Human Resource Education",
    "info": "Nature of thinking/learning in everyday life contexts of  work and human resource education. Theory/practice relevant to stimulating/supporting thinking/learning in/for these contexts.",
    "prereq": {}
  },
  {
    "uid": "005269",
    "code": "OLPD5803",
    "subject": "OLPD",
    "number": "5803",
    "honors": false,
    "writing": false,
    "name": "Intro to Lead. & Admin in WHRE",
    "fullname": "Introduction to Leadership and Administration of WHRE",
    "info": "Finance, public relations, communications, legal aspects, leadership, personnel policies/management, program planning/development, evaluation. Inter-institutional collaboration of work and human resource education programs in school-based settings.",
    "prereq": {}
  },
  {
    "uid": "003409",
    "code": "OLPD5804",
    "subject": "OLPD",
    "number": "5804",
    "honors": false,
    "writing": false,
    "name": "Leadership in OLPD",
    "fullname": "Leadership in OLPD",
    "info": "Leadership, leadership roles/responsibilities. Application to Organizational Leadership, Policy, Development.",
    "prereq": {}
  },
  {
    "uid": "003397",
    "code": "OLPD5805",
    "subject": "OLPD",
    "number": "5805",
    "honors": false,
    "writing": false,
    "name": "Fam & Work Rela",
    "fullname": "Family and Work Relationships",
    "info": "Examination of the interactions of work and family to prepare professionals to improve work and family relationships.",
    "prereq": {}
  },
  {
    "uid": "003462",
    "code": "OLPD5806",
    "subject": "OLPD",
    "number": "5806",
    "honors": false,
    "writing": false,
    "name": "Phil.& Pract. Career & Tech Ed",
    "fullname": "Philosophy and Practice of Career and Technical Education",
    "info": "Purposes/goals of contemporary career/technical education. Governance structure, historical perspectives, industry-education relationship, current education practices. Possible future trends and their implications. Development of a personal philosophy of career/technical education.",
    "prereq": {}
  },
  {
    "uid": "797924",
    "code": "OLPD5807",
    "subject": "OLPD",
    "number": "5807",
    "honors": false,
    "writing": false,
    "name": "Organizational Learning",
    "fullname": "Organizational Learning",
    "info": "Theoretical, empirical, and practical aspects of learning in organizations. Historical context. Definitions, theories, and applications of organizational learning. Learning organization, knowledge management, intellectual capital.",
    "prereq": {}
  },
  {
    "uid": "790678",
    "code": "OLPD5808",
    "subject": "OLPD",
    "number": "5808",
    "honors": false,
    "writing": false,
    "name": "Student & Trainee Assessment",
    "fullname": "Student and Trainee Assessment",
    "info": "Developing learning progress reporting systems/tests for skills instruction in business/industry. Evaluating instructional effectiveness. Applying tests/evaluation instruments to assess/report learning. Students develop each type of test and evaluation plan for a course.",
    "prereq": {}
  },
  {
    "uid": "004930",
    "code": "OLPD5810",
    "subject": "OLPD",
    "number": "5810",
    "honors": false,
    "writing": false,
    "name": "Educating Special Populations",
    "fullname": "Educating Special Populations in Work and Human Resource Education Settings",
    "info": "Identifying/accommodating in work and human resource education settings educational traits of students with disabilities and disadvantaging conditions.",
    "prereq": {}
  },
  {
    "uid": "002378",
    "code": "OLPD5811",
    "subject": "OLPD",
    "number": "5811",
    "honors": false,
    "writing": false,
    "name": "Ed for Work",
    "fullname": "Education for Work",
    "info": "Examination of contextual bases underlying education for work; implications for practice.",
    "prereq": {}
  },
  {
    "uid": "792132",
    "code": "OLPD5812",
    "subject": "OLPD",
    "number": "5812",
    "honors": false,
    "writing": false,
    "name": "Consulting for Org Change",
    "fullname": "Consulting for Organization Change",
    "info": "This course is an introduction to major theories, concepts, skills, and techniques of consulting for industry, education, and government",
    "prereq": {}
  },
  {
    "uid": "004940",
    "code": "OLPD5813",
    "subject": "OLPD",
    "number": "5813",
    "honors": false,
    "writing": false,
    "name": "Enhancing Work-Based Learning",
    "fullname": "Enhancing Work-based Learning Through Collaboration",
    "info": "Interagency planning issues/practices relating to special populations for educational, business, and human service organization personnel, family members, and advocates.",
    "prereq": {}
  },
  {
    "uid": "790918",
    "code": "OLPD5814",
    "subject": "OLPD",
    "number": "5814",
    "honors": false,
    "writing": false,
    "name": "Devel Writing &College Student",
    "fullname": "Developmental Writing and the College Student: Theory and Practice",
    "info": "Basic grounding in theory/practice of college-level developmental writing instruction. History of \"basic writing,\" development of notions of \"academic discourse,\" error/grammar in student writing, best classroom practices, current issues.",
    "prereq": {}
  },
  {
    "uid": "790919",
    "code": "OLPD5815",
    "subject": "OLPD",
    "number": "5815",
    "honors": false,
    "writing": false,
    "name": "Research/Postsecondary Dev Ed",
    "fullname": "Research in Postsecondary Developmental Education",
    "info": "Strategies for conducting three types of research that are central to developmental education: placement test validation, program evaluation, and classroom research. Students read examples and learn what constitutes best practices in each type.",
    "prereq": {}
  },
  {
    "uid": "795640",
    "code": "OLPD5816",
    "subject": "OLPD",
    "number": "5816",
    "honors": false,
    "writing": false,
    "name": "Distance Lrng in AdEd & Trng",
    "fullname": "Distance Learning in Adult Education and Training",
    "info": "Distance learning concepts, theory, history, present practice, delivery systems, course design, major issues, future directions.",
    "prereq": {}
  },
  {
    "uid": "004979",
    "code": "OLPD5819",
    "subject": "OLPD",
    "number": "5819",
    "honors": false,
    "writing": false,
    "name": "Eval & Using Research",
    "fullname": "Evaluating and Using Research in Organizations and Education",
    "info": "Role of educational research in professional practice. Problems of practice for research. Alternative modes of research. Synthesis/application of results of research.\n\nprereq: Grad student",
    "prereq": {}
  },
  {
    "uid": "002370",
    "code": "OLPD5821",
    "subject": "OLPD",
    "number": "5821",
    "honors": false,
    "writing": false,
    "name": "Service Learning",
    "fullname": "Learning Through Service",
    "info": "Service as philosophy and as method of learning. Theory/practice of service in school-based, work-based, and community-based organizations.",
    "prereq": {}
  },
  {
    "uid": "003405",
    "code": "OLPD5822",
    "subject": "OLPD",
    "number": "5822",
    "honors": false,
    "writing": false,
    "name": "Work-Based Learning Practices",
    "fullname": "Work-Based Learning Practices",
    "info": "Learning in context. Curricular integration. Educational systems articulation. Educational partnerships. Best practices in school-/work-/service-based learning/connecting activities. Building community support. Leadership relating to active, community-based learning.",
    "prereq": {}
  },
  {
    "uid": "003404",
    "code": "OLPD5823",
    "subject": "OLPD",
    "number": "5823",
    "honors": false,
    "writing": false,
    "name": "Work-Based Learning Policies",
    "fullname": "Work-Based Learning Policies",
    "info": "Aims/purposes of federal, state, and local policies, related to work-based learning.",
    "prereq": {}
  },
  {
    "uid": "005089",
    "code": "OLPD5824",
    "subject": "OLPD",
    "number": "5824",
    "honors": false,
    "writing": false,
    "name": "Diversity & Org Transform:OLPD",
    "fullname": "Diversity and Organizational Transformation in Organizational Leadership, Policy, and Development",
    "info": "Developing models for understanding impact of diversity on individual, organizational, community outcomes. Discuss organizational change in relation to diversity.",
    "prereq": {}
  },
  {
    "uid": "004942",
    "code": "OLPD5825",
    "subject": "OLPD",
    "number": "5825",
    "honors": false,
    "writing": false,
    "name": "Diversity Issues/Practice:OLPD",
    "fullname": "Diversity Issues and Practices in Organizational Leadership, Policy, and Development Settings",
    "info": "Nature of diverse populations, their unique learning/training needs. Exemplary programs. Collaborative efforts among persons representing work and human resource education settings.",
    "prereq": {}
  },
  {
    "uid": "005093",
    "code": "OLPD5827",
    "subject": "OLPD",
    "number": "5827",
    "honors": false,
    "writing": false,
    "name": "ProgPlan-Improv/SpecPopulation",
    "fullname": "Program Planning and Improvement for Special Populations in Work and Human Resource Education",
    "info": "Concepts, issues, and practices related to the design, implementation, and evaluation of efforts focused on developing new programs or modifying existing programs, in work and human resource education settings, for individuals with special learning needs.",
    "prereq": {}
  },
  {
    "uid": "790679",
    "code": "OLPD5829",
    "subject": "OLPD",
    "number": "5829",
    "honors": false,
    "writing": false,
    "name": "Course Develop. for Bus & Ind",
    "fullname": "Course Development for Business and Industry",
    "info": "Designing instructional programs/courses that help learners develop desired competence. Designing instruction for performance based training and vocational/technical education. Developing course syllabus components that clarify course expectations. Developing academic/community-based elements that complement course goals. Reflect on and compare performance-based instruction with other curriculum models for the field.",
    "prereq": {}
  },
  {
    "uid": "003342",
    "code": "OLPD5831",
    "subject": "OLPD",
    "number": "5831",
    "honors": false,
    "writing": false,
    "name": "Info Resources",
    "fullname": "Information Resources in Education",
    "info": "Sources of knowledge and search strategies for accessing library, electronic, institutional, and informal resources of interest to educators.",
    "prereq": {}
  },
  {
    "uid": "003435",
    "code": "OLPD5832",
    "subject": "OLPD",
    "number": "5832",
    "honors": false,
    "writing": false,
    "name": "Planning WHRE",
    "fullname": "Planning WHRE",
    "info": "Educational planning. Evaluation of work and human resource education in formal/informal settings.",
    "prereq": {}
  },
  {
    "uid": "002947",
    "code": "OLPD5833",
    "subject": "OLPD",
    "number": "5833",
    "honors": false,
    "writing": false,
    "name": "Coord Techniques for WHRE",
    "fullname": "Coordination Techniques for Work and Human Resource Education",
    "info": "Purposes of cooperative work and community education. Responsibilities of instructor coordinator. guidance, selection, placement, supervision, and evaluation of students. Articulation of related instruction. Training sponsor identification, orientation, development, and evaluation. Program management.",
    "prereq": {}
  },
  {
    "uid": "002526",
    "code": "OLPD5841",
    "subject": "OLPD",
    "number": "5841",
    "honors": false,
    "writing": false,
    "name": "Evaluation of OLPD",
    "fullname": "Evaluation of OLPD",
    "info": "Designing/conducting project, program, systems evaluations in work/human resource education contexts/settings.",
    "prereq": {}
  },
  {
    "uid": "792054",
    "code": "OLPD5842",
    "subject": "OLPD",
    "number": "5842",
    "honors": false,
    "writing": false,
    "name": "Global Prog Del Techniques Ex",
    "fullname": "Global Program Delivery Techniques and Technology of Extension",
    "info": "Special educational activities and teaching and communications methods and techniques for youth and adults, ranging from outreach to extension services, with an emphasis on youth and adult education programs in different global settings.",
    "prereq": {}
  },
  {
    "uid": "811367",
    "code": "OLPD5845",
    "subject": "OLPD",
    "number": "5845",
    "honors": false,
    "writing": false,
    "name": "Entrepreneurial Priv College",
    "fullname": "The Entrepreneurial Private College",
    "info": "Financial management/entrepreneurial strategies for private college. Enrollment management, revenue generating strategies, branding/marketing, fundraising, developing/sustaining entrepreneurial institutions. Design strategies for private colleges.\n\nprereq: Must have completed Bachelors degree before taking this course.",
    "prereq": {}
  },
  {
    "uid": "792067",
    "code": "OLPD5851",
    "subject": "OLPD",
    "number": "5851",
    "honors": false,
    "writing": false,
    "name": "Methods for Change",
    "fullname": "Methods for Change in Developing Countries",
    "info": "Sociological and cultural parameters as they pertain to promoting the adoption of improved practices in rural, community, and agricultural development, including formal and informal education institutions. Project planning, implementation, and evaluation related to actual change and development situations in developing countries.",
    "prereq": {}
  },
  {
    "uid": "790677",
    "code": "OLPD5861",
    "subject": "OLPD",
    "number": "5861",
    "honors": false,
    "writing": false,
    "name": "Instr. Methods for  Bus & Ind",
    "fullname": "Instructional Methods for Business and Industry",
    "info": "Theory/practice in instructional methods for career/technical education (CTE) instructors and human resources/development (HRD) professionals. How to select various teaching methods and plan for their delivery. Preparing an instructional methods plan to clarify course content, teaching methods selected, rationale for their selection, and how a student organization might facilitate student learning.",
    "prereq": {}
  },
  {
    "uid": "002315",
    "code": "OLPD5871",
    "subject": "OLPD",
    "number": "5871",
    "honors": false,
    "writing": false,
    "name": "Teach Ent: SBM",
    "fullname": "Teaching Entrepreneurship: Small Business Management",
    "info": "Methods, organization, curriculum development and modification, and implementation of educational programs for entrepreneurs.",
    "prereq": {}
  },
  {
    "uid": "002430",
    "code": "OLPD5890",
    "subject": "OLPD",
    "number": "5890",
    "honors": false,
    "writing": false,
    "name": "Special Topics in OLPD",
    "fullname": "Special Topics in Organizational Leadership, Policy, and Development",
    "info": "Topics vary.",
    "prereq": {}
  },
  {
    "uid": "002442",
    "code": "OLPD5893",
    "subject": "OLPD",
    "number": "5893",
    "honors": false,
    "writing": false,
    "name": "Directed Study in OLPD",
    "fullname": "Directed Study in OLPD",
    "info": "Self-directed study, with faculty advice, in areas not covered by regular courses.",
    "prereq": {}
  },
  {
    "uid": "003457",
    "code": "OLPD5896",
    "subject": "OLPD",
    "number": "5896",
    "honors": false,
    "writing": false,
    "name": "Teaching Internship: Intro",
    "fullname": "Teaching Internship: Introduction",
    "info": "Initial experiences in teaching profession. Observation of school organization/administration, seminars, relationship building with cooperating teachers, reflection on personal involvement as a beginning student teacher.\n\nprereq: Admission to initial licensure program",
    "prereq": {}
  },
  {
    "uid": "003458",
    "code": "OLPD5897",
    "subject": "OLPD",
    "number": "5897",
    "honors": false,
    "writing": false,
    "name": "Teaching Intern:School/Classrm",
    "fullname": "Teaching Internship: School and Classroom Settings",
    "info": "Part-time supervised teaching experience in school. Seminars on managing student learning in context of work/human resource education programs in contemporary schools. Becoming a reflective educator.\n\nprereq: 5696 or WHRE 5696",
    "prereq": {
      "or": [
        "003638"
      ]
    }
  },
  {
    "uid": "003459",
    "code": "OLPD5898",
    "subject": "OLPD",
    "number": "5898",
    "honors": false,
    "writing": false,
    "name": "Teaching Internship",
    "fullname": "Teaching Internship",
    "info": "Teaching experience in a school system that provides programs for grades 5-12.\n\nprereq: Admission to initial licensure program",
    "prereq": {}
  },
  {
    "uid": "003396",
    "code": "OLPD5899",
    "subject": "OLPD",
    "number": "5899",
    "honors": false,
    "writing": false,
    "name": "Teaching Internship: Extended",
    "fullname": "Teaching Internship: Extended",
    "info": "Teaching experience in school system that provides programs for grades 5-12.\n\nprereq: 5898 or WHRE 5698",
    "prereq": {
      "or": [
        "003459"
      ]
    }
  },
  {
    "uid": "811368",
    "code": "OLPD5902",
    "subject": "OLPD",
    "number": "5902",
    "honors": false,
    "writing": false,
    "name": "Leading Change in Priv Collegs",
    "fullname": "Leading Change in Private Colleges",
    "info": "Theories of organizational change process/application for leading private colleges with unique cultures/distinctive missions. Factors impacting change process/implications for leading private colleges.\n\nprereq: Must have Bachelors degree awarded prior to taking this course.",
    "prereq": {}
  },
  {
    "uid": "003628",
    "code": "OLPD5911",
    "subject": "OLPD",
    "number": "5911",
    "honors": false,
    "writing": false,
    "name": "Introduction to HRD",
    "fullname": "Introduction to Human Resource Development",
    "info": "This course is a core requirement for the Mater in Learning and Talent Development (MLTD) degree program. This course introduces the primary foci of the MLTD program, presenting foundational and emerging concepts and theories within the field of Human Resource Development (HRD) and examining how they enhance learning and talent development in organizations. The primary focus of the theory and practice will be:\n● Organization Development\n● Training and Development\n● Career Development",
    "prereq": {}
  },
  {
    "uid": "825898",
    "code": "OLPD5917",
    "subject": "OLPD",
    "number": "5917",
    "honors": false,
    "writing": false,
    "name": "Diver, Eqty, Inclu & Belonging",
    "fullname": "Diversity, Equity, Inclusion, and Belonging",
    "info": "This class will focus on two elements of Diversity, Equity, Inclusion, and Belonging (DEI&B):\n1) awareness of how different social identities intersect to impact experiences in the workplace\n2) skills building/behavior training and other strategies to address DEI&B in an organizational context\nThe primary audience for this class will be graduate students who plan to be Human Resources Development (HRD) leaders and those who are in the online Master in Learning and Talent Development (MLTD) program.",
    "prereq": {}
  },
  {
    "uid": "825899",
    "code": "OLPD5918",
    "subject": "OLPD",
    "number": "5918",
    "honors": false,
    "writing": false,
    "name": "Leadership Development Train",
    "fullname": "Leadership Development Training",
    "info": "The focus of this class is to introduce best practices in leadership development training leveraging adult learning and training theories to develop effective organizational leaders. While this class will look at leadership styles, it will also focus on training strategies that support strong skills in leadership (e.g. developing vision and mission in a purpose driven organizations, developing people and organization-level strategies, and finally creating skills that support the implementation of these strategies). Along with training topics, students will develop expertise in individual leadership assessment instruments commonly used in leadership training functions. The primary audience will be HRD people who develop and implement leadership training programs globally.",
    "prereq": {}
  },
  {
    "uid": "826804",
    "code": "OLPD5919",
    "subject": "OLPD",
    "number": "5919",
    "honors": false,
    "writing": false,
    "name": "Applied Research for HRD Pro.",
    "fullname": "Introduction to Applied Research for HRD Professionals",
    "info": "This course provides an introduction to engaging in applied research for HRD professionals. Specifically, this course will focus on providing an overview of the challenges, issues, and considerations that practitioners face when engaging in research designed to solve real-world, practical problems. The content covered in this course is intended to complement other existing courses that highlight research skills such as framework design, methodological choices and leveraging existing research. Ultimately, this course is intended to position graduate students to understand the complexities and practicalities of engaging in applied HRD research with a particular interest in the role of training, leadership and organizational development in supporting organizational goals.",
    "prereq": {}
  },
  {
    "uid": "005243",
    "code": "OLPD5922",
    "subject": "OLPD",
    "number": "5922",
    "honors": false,
    "writing": false,
    "name": "HRD Evaluation Strategies",
    "fullname": "Human Resource Development Evaluation Strategies",
    "info": "This class will focus on the exploration of evaluation methods for human resource development programs and projects. This includes the systematic collection of data needed to make decisions related to the strengths and weaknesses of selection, adoption, value, and implementation of programs and projects.",
    "prereq": {}
  },
  {
    "uid": "808491",
    "code": "OLPD6402",
    "subject": "OLPD",
    "number": "6402",
    "honors": false,
    "writing": false,
    "name": "Integrative Leadership Seminar",
    "fullname": "Integrative Leadership: Leading Across Sectors to Address Grand Challenges",
    "info": "Are you interested in working across government, business, and the non-profit sector for public good? Are you wondering how you can create sustainable shared leadership on challenges that can best be addressed together? This course explores multisector leadership and related governance and management challenges from a variety of perspectives and provides an opportunity for students to work together to apply what they are learning individually and in teams through in-class exercises and a final team project. The course is taught by a team of interdisciplinary faculty and considers different contexts, forms, and specific examples of multisector leadership that can enable transformative action to tackle a significant societal issue and achieve lasting change. prereq: Doctoral or master's student Credit will not be granted if credit has been received for: GCC 5023, LAW 6623, OLPD 6402PA 5105, PA 5130",
    "prereq": {
      "or": [
        "817692",
        "810718",
        "805014"
      ]
    }
  },
  {
    "uid": "808720",
    "code": "OLPD6490",
    "subject": "OLPD",
    "number": "6490",
    "honors": false,
    "writing": false,
    "name": "Managing Civic Engagement",
    "fullname": "Managing Civic Engagement",
    "info": "Practice/critical assessment of methods for managing participatory/inclusive public policy/program development. Readings, case discussions, analyses of community-based observations.",
    "prereq": {}
  },
  {
    "uid": "000999",
    "code": "OLPD8002",
    "subject": "OLPD",
    "number": "8002",
    "honors": false,
    "writing": false,
    "name": "Crit Issues in Educ",
    "fullname": "Critical Issues in Contemporary Education",
    "info": "Meanings of difference from sociological, psychological, historical and philosophical perspectives as related to current and emerging critical issues in education. Participants help design, facilitate, and present the course.\n\nprereq: EdD or PhD student",
    "prereq": {}
  },
  {
    "uid": "000866",
    "code": "OLPD8011",
    "subject": "OLPD",
    "number": "8011",
    "honors": false,
    "writing": false,
    "name": "Doctoral Research Seminar I",
    "fullname": "Doctoral Research Seminar I",
    "info": "Introduction/planning for individual program development, preliminary examinations, and dissertation prospectus. Modes of inquiry used in current research in education, databases relating to education, recent writings on literature synthesis, key contributions to education literature.\n\nprereq: EdPA or WHRE doctoral student",
    "prereq": {}
  },
  {
    "uid": "000977",
    "code": "OLPD8012",
    "subject": "OLPD",
    "number": "8012",
    "honors": false,
    "writing": false,
    "name": "Doctoral Research Seminar II",
    "fullname": "Doctoral Research Seminar II",
    "info": "Introduction to quantitative/qualitative research approaches/methods. Nature of research, role of researcher, philosophical perspectives on research, ethical issues in conducting research.\n\nprereq: EdPA doctoral student",
    "prereq": {}
  },
  {
    "uid": "000978",
    "code": "OLPD8013",
    "subject": "OLPD",
    "number": "8013",
    "honors": false,
    "writing": false,
    "name": "Doctoral Research Seminar III",
    "fullname": "Doctoral Research Seminar III",
    "info": "Introduction to most important quantitative/qualitative approaches employed in educational policy research.\n\nprereq: EdPA doctoral student",
    "prereq": {}
  },
  {
    "uid": "000979",
    "code": "OLPD8014",
    "subject": "OLPD",
    "number": "8014",
    "honors": false,
    "writing": false,
    "name": "Doctoral Research Seminar IV",
    "fullname": "Doctoral Research Seminar IV",
    "info": "Preparation of thesis prospectus.\n\nprereq: EdPA doctoral student",
    "prereq": {}
  },
  {
    "uid": "796613",
    "code": "OLPD8015",
    "subject": "OLPD",
    "number": "8015",
    "honors": false,
    "writing": false,
    "name": "Inquiry strategies",
    "fullname": "Inquiry strategies in educational and organizational research",
    "info": "Logic of research design, from research questions and audience considerations to selecting a design for collecting/analyzing quantitative, qualitative, and mixed-method data.\n\nprereq: [8011 or EDPA 8011], OLPD PhD student",
    "prereq": {
      "or": [
        "000866"
      ]
    }
  },
  {
    "uid": "806927",
    "code": "OLPD8016",
    "subject": "OLPD",
    "number": "8016",
    "honors": false,
    "writing": false,
    "name": "Research Design and Ed Policy",
    "fullname": "Research Design and Educational Policy",
    "info": "Logic of research design, from research questions to selecting a design for collecting/analyzing quantitative, qualitative,\nand mixed-method data. Writing proposals that build a reasoned statement of research problem.\n\nprereq: [8015 or EDPA 8015], CEHD doctoral student, instr consent",
    "prereq": {
      "or": [
        "796613"
      ]
    }
  },
  {
    "uid": "794125",
    "code": "OLPD8021",
    "subject": "OLPD",
    "number": "8021",
    "honors": false,
    "writing": false,
    "name": "Leadership: Theory to Practice",
    "fullname": "Leadership: From Theory to Reflective Practice",
    "info": "Leadership theory. Emphasizes seminal scholars' work from related social science disciplines. Implications of theory for practice of leadership. Knowledge, behaviors, values, and skills needed in educational and other public settings.",
    "prereq": {}
  },
  {
    "uid": "802246",
    "code": "OLPD8022",
    "subject": "OLPD",
    "number": "8022",
    "honors": false,
    "writing": false,
    "name": "Ed/Globalization: Anthro Persp",
    "fullname": "Education and Globalization: Anthropological Perspectives",
    "info": "Contemporary educational institutions are characterized by rapid movements of people, knowledge, ideologies, and media, and are increasingly shaped by market-based reforms. Populism and stricter migration controls further prompt a rethinking of globalization and its effects on formal and non-formal education. This course enhances students' theoretical and contextual knowledge of globalization and demonstrates the advantages of a translocal view of educational processes and problems.",
    "prereq": {}
  },
  {
    "uid": "000996",
    "code": "OLPD8087",
    "subject": "OLPD",
    "number": "8087",
    "honors": false,
    "writing": false,
    "name": "Seminar: OLPD",
    "fullname": "Seminar: Organizational Leadership, Policy, and Development",
    "info": "Topical issues.",
    "prereq": {}
  },
  {
    "uid": "000998",
    "code": "OLPD8095",
    "subject": "OLPD",
    "number": "8095",
    "honors": false,
    "writing": false,
    "name": "Problems: OLPD",
    "fullname": "Problems: Organizational Leadership, Policy, and Development",
    "info": "Independent study on issues of educational policy/administration. Arranged with instructor.",
    "prereq": {}
  },
  {
    "uid": "000997",
    "code": "OLPD8096",
    "subject": "OLPD",
    "number": "8096",
    "honors": false,
    "writing": false,
    "name": "Internship: OLPD",
    "fullname": "Internship: Organizational Leadership, Policy, and Development",
    "info": "Internship on issues of educational policy/administration. Arranged with instructor.",
    "prereq": {}
  },
  {
    "uid": "805640",
    "code": "OLPD8101",
    "subject": "OLPD",
    "number": "8101",
    "honors": false,
    "writing": false,
    "name": "International Ed & Development",
    "fullname": "International Education and Development",
    "info": "This seminar explores theories, debates, discourses, and practices that have historically linked international development (or simply \"development\") and education (both formal-schooling and non-formal education). We will consider this linkage from different disciplinary perspectives, including anthropology, economics, history, political science, and sociology as well as interdisciplinary research that seeks to transcend these boundaries. We will examine the intertwined histories of colonialism, development, and education; efforts to promote national development through the expansion of schooling; the role of development institutions in shaping education policy and practice; and several current issues in the field of IED today. Throughout, we will consider different perspectives on how, and whether, education can foster better lives for people around the world.",
    "prereq": {}
  },
  {
    "uid": "818581",
    "code": "OLPD8102",
    "subject": "OLPD",
    "number": "8102",
    "honors": false,
    "writing": false,
    "name": "Intercultural Communication",
    "fullname": "Dynamics of Intercultural Communication in Education",
    "info": "This course provides participants with a background to the history, approaches, theories, and applications in the field of intercultural communication. The principal goal is for each participant to be able to better apply theory and research from intercultural communication to inform participant's research, to improve a current project or program, or to enhance the ability to make an impact in a variety of organizational contexts.  ",
    "prereq": {}
  },
  {
    "uid": "805654",
    "code": "OLPD8103",
    "subject": "OLPD",
    "number": "8103",
    "honors": false,
    "writing": false,
    "name": "Comparative Education",
    "fullname": "Comparative Education",
    "info": "Doctoral-level course. History, methodologies, and major debates in the field of comparative education. Major research paper or extensive literature review.",
    "prereq": {}
  },
  {
    "uid": "000649",
    "code": "OLPD8104",
    "subject": "OLPD",
    "number": "8104",
    "honors": false,
    "writing": false,
    "name": "Innovative Systems Thinking",
    "fullname": "Innovative Systems Thinking in Education and Culture",
    "info": "Critical aspects of historical/contemporary systems philosophy, thinking, and analysis. Development of concepts/skills applicable to understanding multiple dimensions of educational systems in diverse contexts.\nImplications for leadership and fostering organizational and systemic change.",
    "prereq": {}
  },
  {
    "uid": "818582",
    "code": "OLPD8105",
    "subject": "OLPD",
    "number": "8105",
    "honors": false,
    "writing": false,
    "name": "Qual Longitudinal Research",
    "fullname": "Qualitative Longitudinal Research Methods and Analysis in Education",
    "info": "This course introduces students to paradigmatic assumptions, approaches, and the knowledge and skills, needed to undertake qualitative longitudinal research and analyses in education. The course first introduces students to the distinctions of qualitative longitudinal research, and the types of research problems and questions that this approach can address. The course explores the unique contributions of longitudinal research to understanding change, time and continuity. The course then focuses on several research methods' ethnography, life histories, and multiple interviews/observations that are used in qualitative longitudinal research, and the distinct and unique questions that longitudinal approaches using these methods can address. Using existing qualitative longitudinal datasets, students will then engage in different approaches and levels of qualitative longitudinal analyses. The course supports students in the analysis processes of qualitative data that they may use for their own research studies. Students will also produce a final paper of a mini-research project, including the qualitative longitudinal research questions, theoretical framework, approach and analyses they have used.\nprereq: Graduate Student. Requires foundational qualitative research knowledge eg., OLPD 5056 Case Studies; OLPD 5061 Ethnographic Research Methods or CI 8148 Conducting Qualitative Studies in Educat Contexts",
    "prereq": {
      "or": [
        "000987",
        "000988",
        "014784"
      ]
    }
  },
  {
    "uid": "000653",
    "code": "OLPD8121",
    "subject": "OLPD",
    "number": "8121",
    "honors": false,
    "writing": false,
    "name": "Cmprtv Int'l Dvlp Ed Seminar",
    "fullname": "Doctoral Seminar: Comparative and International Development Education",
    "info": "Three-semester sequence beginning the second semester of PhD program aimed at guiding students through the development of a critical issue for the dissertation; review of relevant literature; and methodology for doctoral research; supports students as they prepare for written and oral qualifying examinations and prospectus meeting.\n\nprereq: OLPD PhD candidate",
    "prereq": {}
  },
  {
    "uid": "004437",
    "code": "OLPD8124",
    "subject": "OLPD",
    "number": "8124",
    "honors": false,
    "writing": false,
    "name": "Readings in Anthro",
    "fullname": "Classic Readings in Anthropology and Education",
    "info": "Major contributions to theory or working paradigms.",
    "prereq": {}
  },
  {
    "uid": "799624",
    "code": "OLPD8143",
    "subject": "OLPD",
    "number": "8143",
    "honors": false,
    "writing": false,
    "name": "GYPL Integrative Seminar",
    "fullname": "Integrative Seminar in Global Youth Policy and Leadership",
    "info": "Integrates ideas/concepts from 5141 and 5142 into alternative knowledge, policy, and futures profiles. Students use WebCT Vista and beyond to interact with each other, with students abroad, and with global experts to apply perspectives, theories, methods, and research to real-world situations.\n\nprereq: CIDE student or instr consent",
    "prereq": {}
  },
  {
    "uid": "000949",
    "code": "OLPD8301",
    "subject": "OLPD",
    "number": "8301",
    "honors": false,
    "writing": false,
    "name": "Contexts of Learning",
    "fullname": "Contexts of Learning",
    "info": "Study of long-term contextual understanding of education as a social institution. Development of perspective-driven explanation.",
    "prereq": {}
  },
  {
    "uid": "000951",
    "code": "OLPD8302",
    "subject": "OLPD",
    "number": "8302",
    "honors": false,
    "writing": false,
    "name": "Educ Policy Perspectives",
    "fullname": "Educational Policy Perspectives",
    "info": "Public policy issues in education. Historical, international, political, research perspectives. Current policy strategies for reforming U.S. public schools.",
    "prereq": {}
  },
  {
    "uid": "000953",
    "code": "OLPD8303",
    "subject": "OLPD",
    "number": "8303",
    "honors": false,
    "writing": false,
    "name": "Modeling Learning Organization",
    "fullname": "Modeling the Learning Organization",
    "info": "Computer software, perspectives on learning organization used to study global education, human service organizations.",
    "prereq": {}
  },
  {
    "uid": "000955",
    "code": "OLPD8304",
    "subject": "OLPD",
    "number": "8304",
    "honors": false,
    "writing": false,
    "name": "Leadership & Ethics",
    "fullname": "Leadership and Ethics",
    "info": "Review of major leadership theories, their application to problems of practice in educational organizations. Studies of leadership behavior illustrate major emerging issues in educational management.",
    "prereq": {}
  },
  {
    "uid": "804100",
    "code": "OLPD8311",
    "subject": "OLPD",
    "number": "8311",
    "honors": false,
    "writing": false,
    "name": "Research for Educ Improvement",
    "fullname": "Understanding and Using Research for Educational Improvement",
    "info": "Research design principles to identify when findings best contribute to local decisions. Frameworks for evaluating/synthesizing findings to incorporate research in personal/team decision-making.\n\nprereq: Statistics",
    "prereq": {}
  },
  {
    "uid": "804109",
    "code": "OLPD8312",
    "subject": "OLPD",
    "number": "8312",
    "honors": false,
    "writing": false,
    "name": "Inquiry for Improvement Part I",
    "fullname": "Inquiry for School Improvement Part I",
    "info": "First of two-course sequence. How to draw upon data sources, select/design data-collection instruments, and synthesize data to guide action planning. Role of leader in creating conditions for collaborative inquiry.\n\nprereq: 8311 or EDPA 8311",
    "prereq": {
      "or": [
        "804100"
      ]
    }
  },
  {
    "uid": "804110",
    "code": "OLPD8313",
    "subject": "OLPD",
    "number": "8313",
    "honors": false,
    "writing": false,
    "name": "Inquiry fr Improvement Part II",
    "fullname": "Inquiry for School Improvement Part II",
    "info": "Continuation of 8312. Data collection/analysis techniques that carry out realistically/effectively alongside improvement efforts within school/district. Role of leader in sustaining collaborative inquiry.\n\nprereq: 8312 or EDPA 8312",
    "prereq": {
      "or": [
        "804109"
      ]
    }
  },
  {
    "uid": "000974",
    "code": "OLPD8314",
    "subject": "OLPD",
    "number": "8314",
    "honors": false,
    "writing": false,
    "name": "Data Analysis",
    "fullname": "Data Analysis for Educational Management",
    "info": "Managers of educational organizations are faced with problems that require analysis of a wide range of information. Outlines a frame for data analysis and introduces a set of computer-based tools suited to the practice of educational administration.\n\n",
    "prereq": {}
  },
  {
    "uid": "788103",
    "code": "OLPD8333",
    "subject": "OLPD",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788340",
    "code": "OLPD8444",
    "subject": "OLPD",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "002424",
    "code": "OLPD8495",
    "subject": "OLPD",
    "number": "8495",
    "honors": false,
    "writing": false,
    "name": "Research Prob in BIE",
    "fullname": "Research Problems: Business and Industry",
    "info": "Individual research in business and industry education.\n\nprereq: Adviser approval",
    "prereq": {}
  },
  {
    "uid": "000943",
    "code": "OLPD8502",
    "subject": "OLPD",
    "number": "8502",
    "honors": false,
    "writing": false,
    "name": "Advanced Evaluation Theory",
    "fullname": "Advanced Evaluation Theory and Theory crafting",
    "info": "This advanced course will provide students with an in-depth understanding of major evaluation theories, systems for organizing evaluation theories, and propose ways of expanding current theory.\n\nprereq: Doctoral standing OR instructor’s permission (enforced) Recommend OLPD 5502 (can be taken concurrently)",
    "prereq": {
      "or": [
        "808490"
      ]
    }
  },
  {
    "uid": "000945",
    "code": "OLPD8595",
    "subject": "OLPD",
    "number": "8595",
    "honors": false,
    "writing": false,
    "name": "Problems: Evaluation",
    "fullname": "Evaluation Problems",
    "info": "Independent study of an issue in theory or practice of program evaluation.\n\nprereq: [5501 or EDPA 5501 or EPSY 5243],  instr consent",
    "prereq": {
      "or": [
        "000942",
        "792018"
      ]
    }
  },
  {
    "uid": "000944",
    "code": "OLPD8596",
    "subject": "OLPD",
    "number": "8596",
    "honors": false,
    "writing": false,
    "name": "Internship: Eval",
    "fullname": "Evaluation Internship",
    "info": "Hands-on experience in conducting program evaluation in real-world setting under supervision of evaluation professional.\n\nprereq: [5501 or EDPA 5501 or EPSY 5243],  instr consent",
    "prereq": {
      "or": [
        "000942",
        "792018"
      ]
    }
  },
  {
    "uid": "791052",
    "code": "OLPD8601",
    "subject": "OLPD",
    "number": "8601",
    "honors": false,
    "writing": false,
    "name": "Advanced Training & Dev of HR",
    "fullname": "Advanced Training and Development of Human Resources",
    "info": "Personnel training/development research. Critical review of selected/innovative practices.\n\nprereq: 5615 or HRD 5201",
    "prereq": {
      "or": [
        "003643",
        "003052"
      ]
    }
  },
  {
    "uid": "791053",
    "code": "OLPD8602",
    "subject": "OLPD",
    "number": "8602",
    "honors": false,
    "writing": false,
    "name": "Adv. Organization Development",
    "fullname": "Advanced Organization Development",
    "info": "Organization development research. Critical review of selected, innovative practices.",
    "prereq": {}
  },
  {
    "uid": "817795",
    "code": "OLPD8603",
    "subject": "OLPD",
    "number": "8603",
    "honors": false,
    "writing": false,
    "name": "Capstone Research Experience",
    "fullname": "HRD Capstone Research Experience",
    "info": "The goal of this course is to assist doctoral students in developing their ability to conduct research and theory building in human resource development (HRD). Designed as a capstone experience for students in their second year of doctoral studies, the course will not only strengthen their understanding of approaches to disciplined inquiry and knowledge of current theories and advanced scholarly work in HRD, but will also provide them with an opportunity to develop practical research skills, by developing proposals for research projects aimed at addressing real-life needs of various organizations, and conducting these projects.  \n\nThrough this course students will be able to: \n\n1.\tFurther develop their understanding of the philosophical foundations of theory and theory development \n2.\tUnderstand and discuss current approaches to research and theory building, used in HRD and related fields \n3.\tExamine different perspectives on research and theory building \n4.\tDevelop and demonstrate critical thinking skills necessary to understand, interpret, and evaluate research and theories in HRD \n5.\tIdentify, compare and critique examples of cutting-edge HRD research and theory building efforts \n6.\tBecome part of a community of scholars and contribute to the viability and productivity of this community \n7.\tUnderstand issues of research ethics and apply ethics principles in their own scholarly work \n8.\tGain hands-on experience conducting HRD research in organizations \n9.\tLearn how to write successful research proposals and practice developing proposals for dissertation research  \n10.\tUnderstand how to develop research reports for submission to industry clients and to academic publications, and practice writing and submitting papers to academic publications.\n\nThis course will be offered over two semesters. During the fall semester sessions will consist of lectures and discussions, and during spring semester, in addition to regular class meetings, students will be working on their field research projects on-site with client organizations. Students will be expected to make one presentation in each of the two semesters: present a proposal for a dissertation research project in fall, and present the results of the field project at the end of the spring semester.   \n",
    "prereq": {}
  },
  {
    "uid": "788465",
    "code": "OLPD8666",
    "subject": "OLPD",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr*",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Pre-thesis credit\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "000930",
    "code": "OLPD8702",
    "subject": "OLPD",
    "number": "8702",
    "honors": false,
    "writing": false,
    "name": "Admin & Leader/HiEd",
    "fullname": "Administration and Leadership in Higher Education",
    "info": "Leadership, governance, and administration in higher education through theoretical perspectives and practical analysis. Planning, change, decision making, organizational culture, budgets, conflict.\n\nprereq: [5001 or EDPA 5001], [5701 or EDPA 5701]",
    "prereq": {
      "and": [
        {
          "or": [
            "000865"
          ]
        },
        {
          "or": [
            "000929"
          ]
        }
      ]
    }
  },
  {
    "uid": "000931",
    "code": "OLPD8703",
    "subject": "OLPD",
    "number": "8703",
    "honors": false,
    "writing": false,
    "name": "Public Policy in Higher Educ",
    "fullname": "Public Policy in Higher Education",
    "info": "Theories, analytic methods, and critical issues in postsecondary education policy at national/state levels. Equality of educational opportunity, affirmative action, system governance/coordination, research funding, student financial aid, public accountability.\n\nprereq: [5001 or EDPA 5001], [5701 or EDPA 5701]",
    "prereq": {
      "and": [
        {
          "or": [
            "000865"
          ]
        },
        {
          "or": [
            "000929"
          ]
        }
      ]
    }
  },
  {
    "uid": "803118",
    "code": "OLPD8715",
    "subject": "OLPD",
    "number": "8715",
    "honors": false,
    "writing": false,
    "name": "Plan B Capstone Seminar",
    "fullname": "Plan B Capstone Seminar",
    "info": "Determining topic, creating timeline, and initiating project in conjunction with year 2 internship.\n\nprereq: 5206, grad student admitted to master's program in multicultural college teaching/learning; if Plan B project includes research with human subjects, application to Institutional Review Board is required",
    "prereq": {}
  },
  {
    "uid": "000938",
    "code": "OLPD8721",
    "subject": "OLPD",
    "number": "8721",
    "honors": false,
    "writing": false,
    "name": "Inst & Lrning/ HiEd",
    "fullname": "Instruction and Learning in Higher Education",
    "info": "Theory/practice of teaching strategies. Implications of student differences (learning style, ethnicity, gender, age) for teaching. Evaluation and professional development of teaching. Context/nature of faculty work, ethical issues, teaching portfolio development.",
    "prereq": {}
  },
  {
    "uid": "000941",
    "code": "OLPD8724",
    "subject": "OLPD",
    "number": "8724",
    "honors": false,
    "writing": false,
    "name": "Strategic Planning in HigherEd",
    "fullname": "Strategic Planning in Higher Education",
    "info": "Strategic planning principles, their application to higher education. Pitfalls encountered by planners. Tools of strategic planning/management. Case studies.\n\nprereq: 5701 or EDPA 5701",
    "prereq": {
      "or": [
        "000929"
      ]
    }
  },
  {
    "uid": "000939",
    "code": "OLPD8728",
    "subject": "OLPD",
    "number": "8728",
    "honors": false,
    "writing": false,
    "name": "Economics of Hi Ed",
    "fullname": "Economics of Higher Education",
    "info": "Institutional responses to changing external economic factors. Economic effects resulting from higher education's output in teaching, research, and service. Research on institutional and governmental policies.",
    "prereq": {}
  },
  {
    "uid": "000940",
    "code": "OLPD8732",
    "subject": "OLPD",
    "number": "8732",
    "honors": false,
    "writing": false,
    "name": "Financing Higher Education",
    "fullname": "Financing Higher Education",
    "info": "Theories and critical issues in financing postsecondary education. Budgeting, cost-effectiveness, state/federal funding policies, tuition policies, student financial aid, financing educational opportunity.\n\nprereq: 5701",
    "prereq": {
      "and": [
        "000929"
      ]
    }
  },
  {
    "uid": "788593",
    "code": "OLPD8777",
    "subject": "OLPD",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "803117",
    "code": "OLPD8796",
    "subject": "OLPD",
    "number": "8796",
    "honors": false,
    "writing": false,
    "name": "PsTL Internship",
    "fullname": "Supervised Internship in Postsecondary Teaching and Learning",
    "info": "Classroom-based or online group supervision. Weekly supervised experiences. Internship settings based on students' interests/goals.\n\nprereq: 5196, [grad student admitted to Multicultural College Teaching and Learning MA or College Student Development and Counseling Psychology PhD]",
    "prereq": {}
  },
  {
    "uid": "003179",
    "code": "OLPD8800",
    "subject": "OLPD",
    "number": "8800",
    "honors": false,
    "writing": false,
    "name": "Colloquium",
    "fullname": "Organizational Leadership, Policy, and Development Colloquium",
    "info": "Selected topics regarding work/human resource education professionals. Topics based on interest/demand.",
    "prereq": {}
  },
  {
    "uid": "792131",
    "code": "OLPD8801",
    "subject": "OLPD",
    "number": "8801",
    "honors": false,
    "writing": false,
    "name": "Adv Theory HRD/AE",
    "fullname": "Advanced Theory in Human Resource Development and Adult Education",
    "info": "Theory of individuals/organizations as adaptive entities. Roles of human resource development and adult education in mediating complex demands.\n\nprereq: 5801 or ADED 5001 or WHRE 5001",
    "prereq": {
      "or": [
        "792074",
        "000865"
      ]
    }
  },
  {
    "uid": "003006",
    "code": "OLPD8811",
    "subject": "OLPD",
    "number": "8811",
    "honors": false,
    "writing": false,
    "name": "Foundations of Inquiry in OLPD",
    "fullname": "Foundations of Inquiry in Organizational Leadership, Policy, and Development",
    "info": "Practice of inquiry in Organizational Leadership, Policy, Development. Identify research problem/research questions. Quantitative/qualitative methods of research. Issues related to ethics of research.",
    "prereq": {}
  },
  {
    "uid": "002372",
    "code": "OLPD8812",
    "subject": "OLPD",
    "number": "8812",
    "honors": false,
    "writing": false,
    "name": "Quantitative Research in Educ",
    "fullname": "Quantitative Research in Education",
    "info": "Assumptions, procedures for, considerations in planning/conducting quantitative research in education.",
    "prereq": {}
  },
  {
    "uid": "015637",
    "code": "OLPD8815",
    "subject": "OLPD",
    "number": "8815",
    "honors": false,
    "writing": false,
    "name": "Ethics & Responsible Research",
    "fullname": "Ethics and Responsible Research",
    "info": "Introduction to ethical/legal issues involved in practicing responsible educational research. Key issues, formal/informal codes of conduct, ethical reasoning.",
    "prereq": {}
  },
  {
    "uid": "003402",
    "code": "OLPD8841",
    "subject": "OLPD",
    "number": "8841",
    "honors": false,
    "writing": false,
    "name": "Foundations of OLPD",
    "fullname": "Foundations of Organizational Leadership, Policy, and Development",
    "info": "Key historical/philosophical concepts in work, career, adult development. Individual/organizational change. Learning through experience.",
    "prereq": {}
  },
  {
    "uid": "002444",
    "code": "OLPD8842",
    "subject": "OLPD",
    "number": "8842",
    "honors": false,
    "writing": false,
    "name": "Comparative Systems in OLPD",
    "fullname": "Comparative Systems in Organizational Leadership, Policy, and Development",
    "info": "Looking critically across/within countries/regions at structures intended to deliver work-/career-relatd education/training.\n\nprereq: 8141 or WHRE 8141",
    "prereq": {}
  },
  {
    "uid": "798081",
    "code": "OLPD8843",
    "subject": "OLPD",
    "number": "8843",
    "honors": false,
    "writing": false,
    "name": "Workforce & Workplace Issues",
    "fullname": "Contemporary Workforce and Workplace Issues",
    "info": "Workforce preparation/retraining. Impact of cultural, political, and economic changes.",
    "prereq": {}
  },
  {
    "uid": "787851",
    "code": "OLPD8888",
    "subject": "OLPD",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "002949",
    "code": "OLPD8890",
    "subject": "OLPD",
    "number": "8890",
    "honors": false,
    "writing": false,
    "name": "Research Seminar",
    "fullname": "Research Seminar",
    "info": "Developing, reporting, and evaluating research. Participants make/react to presentations.\n\nprereq: [[8811 or WHRE 8911] [8812 or WHRE 8912 or WHRE 8913 or WHRE 8914]] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "003006"
          ]
        },
        {
          "or": [
            "002372"
          ]
        }
      ]
    }
  },
  {
    "uid": "002377",
    "code": "OLPD8896",
    "subject": "OLPD",
    "number": "8896",
    "honors": false,
    "writing": false,
    "name": "Internship",
    "fullname": "Internship",
    "info": "Student applies for position in professional practice; individual arrangements describe specific responsibilities during internship. Ed.D. program requirement.",
    "prereq": {}
  }
]