[
  {
    "uid": "012749",
    "code": "OTOL5101",
    "subject": "OTOL",
    "number": "5101",
    "honors": false,
    "writing": false,
    "name": "Basic Sci. I: Ear",
    "fullname": "Introduction to the Basic Sciences in Otolaryngology I: Ear",
    "info": "Multidisciplinary introduction to the basic sciences of the ear. Acoustics and psychoacoustics, temporal bone anatomy, external and middle ear mechanisms, cochlear physiology, auditory neurophysiology, ear embryology, ear biochemistry, immunology, fine structures, vestibular mechanisms and measurement. S-N grading option for nonmajors only.\n\nprereq: Otolaryngology major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012750",
    "code": "OTOL5102",
    "subject": "OTOL",
    "number": "5102",
    "honors": false,
    "writing": false,
    "name": "Basic Sci II: H&N",
    "fullname": "Introduction to the Basic Sciences in Otolaryngology II: Head and Neck",
    "info": "Multidisciplinary introduction to the basic sciences of the head and neck. Laryngeal anatomy and physiology, nasal anatomy and physiology, immune biology, embryology of head and neck. S-N grading option for nonmajors only.\n\nprereq: Otol major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012751",
    "code": "OTOL5993",
    "subject": "OTOL",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed readings and preparation of reports on selected topics.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "011758",
    "code": "OTOL7200",
    "subject": "OTOL",
    "number": "7200",
    "honors": false,
    "writing": false,
    "name": "Intro to Otolaryngology",
    "fullname": "Introduction to Otolaryngology",
    "info": "This elective is intended for early 3rd-year students interested in exploring the specialty of ENT. This course will include clinical experiences in the specialty and interactive presentations emphasizing primary care problems related to the field.",
    "prereq": {}
  },
  {
    "uid": "796096",
    "code": "OTOL7400",
    "subject": "OTOL",
    "number": "7400",
    "honors": false,
    "writing": false,
    "name": "SURG SPEC: OTOL",
    "fullname": "Surgical Specialty: Otolaryngology Elective",
    "info": "Clinical experiences in specialty. Emphasizes primary care problems related to field. Clinical opportunities may include day travel to a rural site.\n",
    "prereq": {}
  },
  {
    "uid": "011759",
    "code": "OTOL7501",
    "subject": "OTOL",
    "number": "7501",
    "honors": false,
    "writing": false,
    "name": "Acting Intern Otolaryngology",
    "fullname": "Acting Internship Otolaryngology",
    "info": "This advanced elective is designed for the late third-year or early fourth-year student wanting to be competitive for residency selection. Working closely with residents, the student will have increased responsibility in patient care and management. ",
    "prereq": {}
  },
  {
    "uid": "011760",
    "code": "OTOL7503",
    "subject": "OTOL",
    "number": "7503",
    "honors": false,
    "writing": false,
    "name": "Otolaryngology Research",
    "fullname": "Otolaryngology Research",
    "info": "Opportunities are provided to work with otolaryngology faculty and basic scientists within the Department of Otolaryngology. Additional opportunities for clinical otolaryngology are provided if relevant. ",
    "prereq": {}
  },
  {
    "uid": "818420",
    "code": "OTOL7550",
    "subject": "OTOL",
    "number": "7550",
    "honors": false,
    "writing": false,
    "name": "Ortho/ENT for Primary Care",
    "fullname": "Orthopaedic Surgery and Otolaryngology for the Primary Care Provider",
    "info": "The orthopaedic surgery component of the Ortho/ENT selective is two weeks and concentrates on the areas of general orthopaedics, sports medicine, and pediatrics. This course is designed for students entering careers in primary care specialties and will provide students with perspective on the diagnosis and management of orthopaedic conditions. Each selective will be geared toward the student's desired orthopaedic interest. In all rotations, the student is expected to be involved in the clinic setting, pre-operative planning, assisting in the operating room, and post-operative call of patients. Each student will be expected to learn the objectives as outlined in the course description. The student will be expected to attend conferences that are currently active in the residency curriculum. He or she may be requested to present cases as part of these conferences. The experience will be a mixture of diverse clinical exposure in addition to operating room activity. Under direct supervision by orthopaedic surgery faculty, the student will create and optimize patient care/management plans, write notes and orders and perform orthopaedic examinations and assist in surgical procedures. The medical student is expected to take call during the rotation.\n\nThe ENT component of the Ortho/ENT selective is two weeks and focuses on general ENT. This course is designed for students entering careers in primary care specialties and will allow students to become familiar with common ENT conditions that they are likely to see in primary care. During the two weeks, students will gain perspective and knowledge on the diagnosis and management of these ENT conditions, including but not limited to middle ear disease, acute and chronic sinusitis, tonsillitis, hoarseness, and epistaxis.  Students are expected to be involved in the clinic setting and assisting in the operating room. Each student will be expected to learn the objectives as outlined in the course description. The student will be expected to attend conferences that are currently active in the residency curriculum. The experience will be a mixture of clinic exposure and operating room exposure, though the majority of time will be weighted toward the clinic experience. Under the direct supervision of the ENT faculty, the student will create and optimize patient care/management plans, write notes, gain proficiency in the head and neck physical exam, and assist in surgical procedures. The student is not expected to take call during the rotation since it will be mostly a clinic experience.",
    "prereq": {}
  },
  {
    "uid": "820538",
    "code": "OTOL7551",
    "subject": "OTOL",
    "number": "7551",
    "honors": false,
    "writing": false,
    "name": "Virtual Ortho/ENT Primary Care",
    "fullname": "Virtual Orthopedic Surgery and Otolaryngology for the Primary Care Provider",
    "info": "The orthopedic surgery component of the Ortho/ENT selective is two weeks. This course is designed for students entering careers in primary care specialties and will provide students with perspective on the diagnosis and management of orthopedic conditions. Each selective will be geared toward the student's desired orthopedic interest. In all rotations, the student is expected to be involved in the clinic setting, pre-operative planning, assisting in the operating room, and post-operative call of patients. Each student will be expected to learn the objectives as outlined in the course description. The student will be expected to attend conferences that are currently active in the residency curriculum. He or she may be requested to present cases as part of these conferences. The experience will be a mixture of diverse clinical exposure in addition to operating room activity. Under direct supervision by orthopedic surgery faculty, the student will create and optimize patient care/management plans, write notes and orders and perform orthopedic examinations and assist in surgical procedures. The medical student is expected to take call during the rotation; call shall not be scheduled more frequently than once per week.\n\nThe ENT component of the Ortho/ENT selective is two weeks and focuses on general ENT. This course is designed for students entering careers in primary care specialties and will allow students to become familiar with common ENT conditions that they are likely to see in primary care. During the two weeks, students will gain perspective and knowledge on the diagnosis and management of these ENT conditions, including but not limited to middle ear disease, acute and chronic sinusitis, tonsillitis, hoarseness, and epistaxis. Each student will be expected to learn the objectives as outlined in the course description. The student will be expected to attend conferences that are currently active in the residency curriculum. For the virtual cirriculum, each student is expected to read about common ENT conditions (middle ear disease, acute and chronic sinusiti, acute and chronic tonsillitis, epistaxis, globus and chronic cough, hoarseness, and neck mass).  The student is not expected to take call during the rotation since it will be mostly a clinic experience.\n\nprereq: SURG 7500 or combination of SURG 7520 and SURG 7521\n\n\n\n\n",
    "prereq": {
      "or": [
        "012253",
        "820020",
        "820022"
      ]
    }
  },
  {
    "uid": "804423",
    "code": "OTOL7800",
    "subject": "OTOL",
    "number": "7800",
    "honors": false,
    "writing": false,
    "name": "Otolaryngology Residency",
    "fullname": "Otolaryngology Residency",
    "info": "Graduate medical education in otolaryngology.",
    "prereq": {}
  },
  {
    "uid": "804646",
    "code": "OTOL7801",
    "subject": "OTOL",
    "number": "7801",
    "honors": false,
    "writing": false,
    "name": "Neurotology Fellowship",
    "fullname": "Neurotology Fellowship",
    "info": "Otolaryngology subspecialty of neurotology.",
    "prereq": {}
  },
  {
    "uid": "805716",
    "code": "OTOL7910",
    "subject": "OTOL",
    "number": "7910",
    "honors": false,
    "writing": false,
    "name": "Otolaryngology Med Residency",
    "fullname": "Otolaryngology Medical Residency",
    "info": "Otolaryngology medical residency.",
    "prereq": {}
  },
  {
    "uid": "805717",
    "code": "OTOL7930",
    "subject": "OTOL",
    "number": "7930",
    "honors": false,
    "writing": false,
    "name": "Otolaryngology Med Fellowship",
    "fullname": "Otolaryngology Medical Fellowship",
    "info": "Otolaryngology medical fellowship.",
    "prereq": {}
  },
  {
    "uid": "805892",
    "code": "OTOL8224",
    "subject": "OTOL",
    "number": "8224",
    "honors": false,
    "writing": false,
    "name": "Temp Bone Diss Non-Surgeons",
    "fullname": "Temporal Bone Anatomy and Dissection for Non-Surgeons",
    "info": "Temporal bone anatomy studied from cadaver through programmed learning. Temporal bone dissection.",
    "prereq": {}
  },
  {
    "uid": "012709",
    "code": "OTOL8230",
    "subject": "OTOL",
    "number": "8230",
    "honors": false,
    "writing": false,
    "name": "Clinical ENT",
    "fullname": "Clinical Otorhinolaryngology",
    "info": "Diagnostic and management instruction and experience in all phases of clinical otorhinolaryngology. Both inpatient and outpatient services are provided at Fairview-University Medical Center, St. Paul Ramsey Medical Center, Veterans Administration Medical Center, and Hennepin County Medical Center. Clinical practica and weekly special group conferences.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012710",
    "code": "OTOL8231",
    "subject": "OTOL",
    "number": "8231",
    "honors": false,
    "writing": false,
    "name": "Surgery, ENT",
    "fullname": "Surgery of the Ear, Nose, and Throat",
    "info": "Surgical training and experience with broad scope of surgical problems encountered in otorhinolaryngology provided at Fairview-University Medical Center, St. Paul Ramsey Medical Center, Veterans Administration Medical Center, and Hennepin County Medical Center. Clinical practica and weekly special group conferences.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012711",
    "code": "OTOL8232",
    "subject": "OTOL",
    "number": "8232",
    "honors": false,
    "writing": false,
    "name": "Maxillofacial Surg.",
    "fullname": "Maxillofacial Surgery",
    "info": "Basic science and management principles of maxillofacial diseases. Problems of maxillofacial trauma. Experience with these problems in the hospitals of the training program, especially the county hospitals.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012712",
    "code": "OTOL8233",
    "subject": "OTOL",
    "number": "8233",
    "honors": false,
    "writing": false,
    "name": "Plastic Surg: Head",
    "fullname": "Plastic and Reconstructive Surgery: Head and Neck",
    "info": "Otolaryngologic cosmetic surgery emphasizing rhinoplasty and otoplasty.\n\nprereq: Otol major",
    "prereq": {}
  },
  {
    "uid": "012713",
    "code": "OTOL8234",
    "subject": "OTOL",
    "number": "8234",
    "honors": false,
    "writing": false,
    "name": "Temporal Bone Diss",
    "fullname": "Anatomy of the Head and Neck and Temporal Bone Dissection",
    "info": "Head and neck anatomy studied from cadaver through programmed learning.  Temporal bones dissected to learn anatomy and to practice otologic surgical procedures. S/N for nonmajors only.\n\nprereq: Grad otol major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012714",
    "code": "OTOL8235",
    "subject": "OTOL",
    "number": "8235",
    "honors": false,
    "writing": false,
    "name": "Roentgenology, ENT",
    "fullname": "Roentgenology of the Head and Neck",
    "info": "Principles and procedures in roentgenology for otolaryngologic and head and neck problems.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012715",
    "code": "OTOL8236",
    "subject": "OTOL",
    "number": "8236",
    "honors": false,
    "writing": false,
    "name": "Pharmacology in ENT",
    "fullname": "Pharmacology in Otolaryngology",
    "info": "Principles of pharmacology as they relate to otolaryngology.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012716",
    "code": "OTOL8237",
    "subject": "OTOL",
    "number": "8237",
    "honors": false,
    "writing": false,
    "name": "Endoscopy",
    "fullname": "Endoscopy",
    "info": "Didactic and practical instruction in laryngoscopy, esophagoscopy, bronchoscopy, and mediastinoscopy. General management principles emphasized.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012717",
    "code": "OTOL8238",
    "subject": "OTOL",
    "number": "8238",
    "honors": false,
    "writing": false,
    "name": "Pathology, ENT",
    "fullname": "Pathology of the Ear, Nose, and Throat",
    "info": "Gross pathology and histopathology of diseases of the ear, nose, throat, and related regions.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012718",
    "code": "OTOL8239",
    "subject": "OTOL",
    "number": "8239",
    "honors": false,
    "writing": false,
    "name": "Otoneurology",
    "fullname": "Otoneurology",
    "info": "Instruction and experience in diagnosis and management of otoneurologic problems, including training in electronystagmographic analysis of vestibular function.\n\nprereq: Grad otol major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012719",
    "code": "OTOL8240",
    "subject": "OTOL",
    "number": "8240",
    "honors": false,
    "writing": false,
    "name": "Allergy",
    "fullname": "Allergy",
    "info": "Concepts and management of otolaryngologic allergy.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012720",
    "code": "OTOL8241",
    "subject": "OTOL",
    "number": "8241",
    "honors": false,
    "writing": false,
    "name": "Cancer, Head & Neck",
    "fullname": "Cancer of the Head and Neck",
    "info": "Clinical head and neck oncology; etiology, treatment (both surgical and nonsurgical), and other principles of management.\n\nprereq: Grad otol major",
    "prereq": {}
  },
  {
    "uid": "012721",
    "code": "OTOL8242",
    "subject": "OTOL",
    "number": "8242",
    "honors": false,
    "writing": false,
    "name": "Audiol, Speech Path",
    "fullname": "Audiology and Speech Pathology",
    "info": "Clinical audiology and speech-language pathology, including diagnosis and treatment of conductive, sensorineural, and central hearing loss; voice disorders; swallowing disorders; velopharyngeal insufficiency related to cleft lip/palate and craniofacial anomalies; alaryngeal speech; and speech disorders related to head and neck cancer.\n\nprereq: Grad otol major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012722",
    "code": "OTOL8243",
    "subject": "OTOL",
    "number": "8243",
    "honors": false,
    "writing": false,
    "name": "Research Methods",
    "fullname": "Introduction to Research Methodology",
    "info": "Statistical methods, experimental design, and execution of otolaryngologic research. Ethics of research with human and animal subjects.\n\nprereq: Grad otol major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012723",
    "code": "OTOL8244",
    "subject": "OTOL",
    "number": "8244",
    "honors": false,
    "writing": false,
    "name": "Sem: Current Lit",
    "fullname": "Seminar: Current Literature",
    "info": "Presentation and discussion of selected articles. Required for all otolaryngology graduate students.\n\nprereq: Grad otol major or instr consent",
    "prereq": {}
  },
  {
    "uid": "012725",
    "code": "OTOL8247",
    "subject": "OTOL",
    "number": "8247",
    "honors": false,
    "writing": false,
    "name": "Anat/Phys Hrg Bal",
    "fullname": "Anatomy and Physiology of Hearing and Balance",
    "info": "Structure and function of auditory and vestibular systems. Network analysis of middle and inner ear mechanics, hair cell biophysics, auditory nerve and CNS electrophysiology, information processing, neural mechanisms subserving balance and gaze, cellular morphology, and computer models.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "012726",
    "code": "OTOL8248",
    "subject": "OTOL",
    "number": "8248",
    "honors": false,
    "writing": false,
    "name": "Auditory Physiology",
    "fullname": "Directed Readings in Auditory Physiology",
    "info": "Current research on biophysics and physiology of auditory system; topics selected for each student. Written reviews prepared and discussed.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "012727",
    "code": "OTOL8249",
    "subject": "OTOL",
    "number": "8249",
    "honors": false,
    "writing": false,
    "name": "Cochlear Anatomy",
    "fullname": "Current Topics in Cochlear Anatomy",
    "info": "Review of current research papers concerning cochlear anatomy and pathology.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "012728",
    "code": "OTOL8250",
    "subject": "OTOL",
    "number": "8250",
    "honors": false,
    "writing": false,
    "name": "Auditory Biochem",
    "fullname": "Advanced Biochemistry of the Auditory System",
    "info": "Review of recent progress in biochemical aspects of auditory end organs.\n\nprereq: MdBc 6100, MdBc 6101 or equiv or instr consent",
    "prereq": {}
  },
  {
    "uid": "805900",
    "code": "OTOL8251",
    "subject": "OTOL",
    "number": "8251",
    "honors": false,
    "writing": false,
    "name": "Squamous Cell Carcinogenesis",
    "fullname": "Molecular Carcinogenesis of Head and Neck Squamous Cell Carcinoma",
    "info": "Current topics in molecular carcinogenesis of head and neck squamous cell carcinoma.\n\nprereq: MICA 8009 or concurrent registration is required (or allowed) in MICA 8009 or instr consent",
    "prereq": {
      "or": [
        "014212"
      ]
    }
  },
  {
    "uid": "012724",
    "code": "OTOL8262",
    "subject": "OTOL",
    "number": "8262",
    "honors": false,
    "writing": false,
    "name": "Adv Clin Audiology",
    "fullname": "Advanced Clinical Audiology",
    "info": "Comprehensive reading and practicum in auditory evaluation of patients. Assumes basic knowledge of clinical audiology. Each session devoted to aspect of auditory evaluation or aural rehabilitation, including behavioral audiometry, electrophysiologic evaluation, hearing aid selection, and cochlear implants.\n\nprereq: Grad otol major, 8242 or instr consent",
    "prereq": {
      "or": [
        "012721"
      ]
    }
  },
  {
    "uid": "788254",
    "code": "OTOL8333",
    "subject": "OTOL",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788385",
    "code": "OTOL8444",
    "subject": "OTOL",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "788507",
    "code": "OTOL8666",
    "subject": "OTOL",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "Doctoral Pre-Thesis Credits\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "788636",
    "code": "OTOL8777",
    "subject": "OTOL",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "787902",
    "code": "OTOL8888",
    "subject": "OTOL",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  }
]