[
  {
    "uid": "806997",
    "code": "PDES2702",
    "subject": "PDES",
    "number": "2702",
    "honors": false,
    "writing": false,
    "name": "Concept Sketching",
    "fullname": "Concept Sketching",
    "info": "This class is an introduction to manual sketching techniques, specifically for the communication of conceptual product ideas. The focus of this class is on free-hand perspective drawing. Students begin with basic principles, simple shapes, light and shadow, and later learn how to combine forms to create conceptual objects with realistic perspective. In this class, there are weekly drawing assignments and presentations. ",
    "prereq": {}
  },
  {
    "uid": "815475",
    "code": "PDES2703",
    "subject": "PDES",
    "number": "2703",
    "honors": false,
    "writing": false,
    "name": "Concept Visualization 1",
    "fullname": "Concept Visualization and Presentation 1",
    "info": "This class builds upon the fundamentals taught in PDES 2702 Concept Sketching. Students learn to draw complex geometries and organic forms and how to add shading, shadow, text and backgrounds to enhance their drawings. Markers and other physical tools are introduced in this class as a means of further refining a sketch. In the second half of the semester, students learn to digitally improve their sketches and are introduced to the fundamentals of digital sketching with a drawing tablet and digital sketching software. As this class is taught in smaller sections, there are many opportunities for students to present and critique work. The basics of design portfolios are covered at the end of this class.",
    "prereq": {}
  },
  {
    "uid": "817425",
    "code": "PDES2704",
    "subject": "PDES",
    "number": "2704",
    "honors": false,
    "writing": false,
    "name": "Visualization & Presentation 2",
    "fullname": "Concept Visualization and Presentation 2",
    "info": "This class is a continuation of Visualization and Presentation 1 focusing on concept sketching and digital rendering execution. Emphasis is placed on developing refined renderings for presentation using digital tools [photoshop]. Additional emphasis will be placed on the process of concept development using industry-standard practices that include research, storyboarding, refinement of concepts, collaboration, and presenting your work to your peers.",
    "prereq": {}
  },
  {
    "uid": "817424",
    "code": "PDES2771",
    "subject": "PDES",
    "number": "2771",
    "honors": false,
    "writing": false,
    "name": "Product Design Studio 1",
    "fullname": "Product Design Studio 1",
    "info": "This is the first design studio for product design majors. It is an introduction to user-centered design using industry-standard practices. Students will apply skills learned in their prior core classes towards several individual product design challenges. The deliverables focus on user research, market research, concept development, lo-fidelity prototyping, and concept presentation.",
    "prereq": {}
  },
  {
    "uid": "817438",
    "code": "PDES2772",
    "subject": "PDES",
    "number": "2772",
    "honors": false,
    "writing": false,
    "name": "Product Design Studio 2",
    "fullname": "Product Design Studio 2",
    "info": "This is the second studio course for product design majors. This studio explores physical prototype development using industry-standard practices. Students will apply skills learned in their prior core classes towards several individual product design challenges. The deliverables cover human factors and ergonomics, prototype craftsmanship, aesthetics, form giving, functionality, design for manufacture, and presentation skills.  ",
    "prereq": {}
  },
  {
    "uid": "808394",
    "code": "PDES2777",
    "subject": "PDES",
    "number": "2777",
    "honors": false,
    "writing": false,
    "name": "Product Form & Model Making",
    "fullname": "Product Form and Model Making",
    "info": "This class is a hands-on introduction to prototyping tools, materials, and techniques for product design. Students learn the basics of working with foam-board, foam, and wood to create physical models and will be introduced to different surface treatments and finishes. Assignments are designed to build a sense of craftsmanship and attention to detail. There are multiple individual projects focusing on different materials and techniques. Each project involves practicing oral presentation and group critique.",
    "prereq": {}
  },
  {
    "uid": "810020",
    "code": "PDES3170",
    "subject": "PDES",
    "number": "3170",
    "honors": false,
    "writing": false,
    "name": "Topics in Product Design",
    "fullname": "Topics in Product Design",
    "info": "In-depth investigation of single specific topic announced in advance.",
    "prereq": {}
  },
  {
    "uid": "815456",
    "code": "PDES3196",
    "subject": "PDES",
    "number": "3196",
    "honors": false,
    "writing": false,
    "name": "Product Design Internship",
    "fullname": "Product Design Internship",
    "info": "This course is designed to meet the product design internship requirements. Students will undertake supervised industry experience in industrial design/product design or related design fields. The course will address product design career topics, and professional competencies required for career readiness. Students will summarize their internship experience in a presentation. Integrative paper or project may be required. This course can be completed concurrently with an internship or could be completed in the subsequent term, immediately following the internship.",
    "prereq": {}
  },
  {
    "uid": "810113",
    "code": "PDES3704",
    "subject": "PDES",
    "number": "3704",
    "honors": false,
    "writing": false,
    "name": "CAD 1: Solid Model & Render",
    "fullname": "Computer-Aided Design 1: Solid Modeling and Rendering",
    "info": "This class provides an overview of computer-aided design (CAD) methods for product designers. The primary software covered in this course include Solidworks and Keyshot. These programs are used to make three-dimensional computer generated models of product concepts and render the models to appear photo-realistic. This class may also cover additional 2D and interaction design software.",
    "prereq": {}
  },
  {
    "uid": "813324",
    "code": "PDES3705",
    "subject": "PDES",
    "number": "3705",
    "honors": false,
    "writing": false,
    "name": "History/Future of Product Dsgn",
    "fullname": "History and Future of Product Design",
    "info": "This class covers critical milestones in the history, evolution, and trajectory of modern product design as well as the human relationships to consumer goods, including production and consumption. In some assignments, students have the opportunity to apply the topics discussed towards imagining the future of the product design industry.",
    "prereq": {}
  },
  {
    "uid": "814150",
    "code": "PDES3706",
    "subject": "PDES",
    "number": "3706",
    "honors": false,
    "writing": false,
    "name": "Designing for Manufacture",
    "fullname": "Designing for Manufacture",
    "info": "This class is a hands-on overview of common manufacturing methods, tools, and considerations for product designers. The focus is placed on plastic and metal related processes specifically machining, forming, casting, and molding. Throughout the course students apply the theory of design for manufacturing (DFM) and design for assembly (DFA) to a series of design projects. This course also covers related topics such as material identification, bill of material, cost estimation, part drawings, tolerances, fasteners, part finishing, and sourcing parts.",
    "prereq": {}
  },
  {
    "uid": "807000",
    "code": "PDES3711",
    "subject": "PDES",
    "number": "3711",
    "honors": false,
    "writing": false,
    "name": "Product Innovation Lab",
    "fullname": "Product Innovation Lab",
    "info": "A hands-on experience in integrated product design and development processes. Elements of industrial design, engineering, business, and humanities are applied to a semester-long product design project. Cross-functional teams of students in different majors work together to design and develop new consumer product concepts with guidance from a community of industry mentors.\n\nprereq: PDes 2772 OR Junior/Senior (any major) or permission from instructor",
    "prereq": {
      "or": [
        "817438"
      ]
    }
  },
  {
    "uid": "819154",
    "code": "PDES3714",
    "subject": "PDES",
    "number": "3714",
    "honors": false,
    "writing": false,
    "name": "CAD Methods 2",
    "fullname": "Computer-Aided Design Methods 2: Surface Modeling and Rendering",
    "info": "This class provides an overview of the digital surface modeling of existing products and conceptual objects with complex curves. Students will learn how to use the 3D surfacing software (e.g., Alias or Rhino) and apply material and texture with the rendering software (e.g., KeyShot). They will also gain a basic understanding of the science and logic behind the software. In addition, students will gain hands-on experience with topics closely related to this field including lighting, background, and render post-processing.",
    "prereq": {}
  },
  {
    "uid": "809535",
    "code": "PDES3715",
    "subject": "PDES",
    "number": "3715",
    "honors": false,
    "writing": false,
    "name": "Design and Food",
    "fullname": "Design and Food",
    "info": "This class is a hands-on introduction to principles of design applied to the food industry. Students develop new food concepts working in a kitchen classroom with regular advising from local chefs and food industry experts. The class is structured into four modules: creative design process, flavor and texture, visual aesthetics, and user experience. In each module students learn different design and food preparation methods and apply them to a design challenge. Several restaurant outings are incorporated into the curriculum. ",
    "prereq": {}
  },
  {
    "uid": "820222",
    "code": "PDES3737",
    "subject": "PDES",
    "number": "3737",
    "honors": false,
    "writing": false,
    "name": "Product Design Portfolio",
    "fullname": "Product Design Portfolio",
    "info": "Portfolio skills specific to the field of product/industrial design. Development and critique of verbal and visual presentation skills.  Overview of the breadth and expectations of the profession.",
    "prereq": {}
  },
  {
    "uid": "817441",
    "code": "PDES3771",
    "subject": "PDES",
    "number": "3771",
    "honors": false,
    "writing": false,
    "name": "Product Design Studio 3",
    "fullname": "Product Design Studio 3",
    "info": "This is the third studio course for product design majors in which students will further develop skills specific to their selected track/sub-plan. Students will apply skills learned in their prior core classes towards several individual product design challenges. Students in the user experience section may explore topics in service design, immersive environments, IoT, digital/physical integration, or smart products. Students in the integrated product development section may explore topics in furniture, medical devices, electromechanical products, consumer electronics, digital/physical integration, or smart products. Both sections will further develop presentation skills. ",
    "prereq": {}
  },
  {
    "uid": "818017",
    "code": "PDES3790",
    "subject": "PDES",
    "number": "3790",
    "honors": false,
    "writing": false,
    "name": "Prodct Desgn Experience Abroad",
    "fullname": "Product Design Experience Abroad",
    "info": "Faculty-led study abroad course. Destinations vary by semester offered.",
    "prereq": {}
  },
  {
    "uid": "807881",
    "code": "PDES4193",
    "subject": "PDES",
    "number": "4193",
    "honors": false,
    "writing": false,
    "name": "Dir Study in Product Design",
    "fullname": "Directed Study in Product Design",
    "info": "Independent study in product design under tutorial guidance.\n\nprereq: Undergrad, instr consent",
    "prereq": {}
  },
  {
    "uid": "827080",
    "code": "PDES4312",
    "subject": "PDES",
    "number": "4312",
    "honors": false,
    "writing": false,
    "name": "Intro to Footwear Design",
    "fullname": "Introduction to Footwear Design and Construction",
    "info": "This class is an introduction to fundamentals of footwear design. Students will develop skills in overall conceptualization, illustrating footwear, understanding construction types and assembly, footwear anatomy, pattern development, material types, creating technical packets, prototyping, industry terminology and fit/size standards. ",
    "prereq": {}
  },
  {
    "uid": "815698",
    "code": "PDES4701W",
    "subject": "PDES",
    "number": "4701",
    "honors": false,
    "writing": true,
    "name": "Product Design Studio 4",
    "fullname": "Product Design Studio 4",
    "info": "Students will explore several design research methods, understand the basis of these methods, and directly apply methods within a design project. Students will have the opportunity to demonstrate their facility with a wide range of exploratory, generative, and evaluative research methods. This course will cover field study, contextual inquiries, archival research, participatory codesign, research synthesis techniques, insights identification, early-stage prototyping, usability testing, and ways to communicate research in a visually compelling manner.",
    "prereq": {}
  },
  {
    "uid": "815970",
    "code": "PDES4702W",
    "subject": "PDES",
    "number": "4702",
    "honors": false,
    "writing": true,
    "name": "Capstone Design Studio",
    "fullname": "Capstone Design Studio",
    "info": "Students synthesize and apply design and research techniques to a senior capstone project. Projects can be student-directed or client-sponsored and are intended to demonstrate competency in fundamental design skills, communicating and documenting design processes, and the ability to apply design processes to develop new products and services while addressing real-world constraints. \n\n",
    "prereq": {}
  },
  {
    "uid": "807882",
    "code": "PDES5170",
    "subject": "PDES",
    "number": "5170",
    "honors": false,
    "writing": false,
    "name": "Topics in Product Design",
    "fullname": "Topics in Product Design",
    "info": "In-depth investigation of specific topic, announced in advance.\n\nprereq: Jr or sr or grad student",
    "prereq": {}
  },
  {
    "uid": "807883",
    "code": "PDES5193",
    "subject": "PDES",
    "number": "5193",
    "honors": false,
    "writing": false,
    "name": "Dir Study in Product Design",
    "fullname": "Directed Study in Product Design",
    "info": "Independent study in product design under tutorial guidance.\n\nprereq: Grad, instr consent",
    "prereq": {}
  },
  {
    "uid": "806998",
    "code": "PDES5701",
    "subject": "PDES",
    "number": "5701",
    "honors": false,
    "writing": false,
    "name": "User-Centered Design Studio",
    "fullname": "User-Centered Design Studio",
    "info": "This class provides a studio-based overview of user-centered product design and development processes. Students will practice both user and market research, creativity and idea generation tools, concept evaluation/selection techniques, prototyping methods for concept development and communication, and user testing. This class will also cover fundamentals of intellectual property and manufacturing. In this studio,  students will apply these skills towards the development of a product concept. ",
    "prereq": {}
  },
  {
    "uid": "806999",
    "code": "PDES5702",
    "subject": "PDES",
    "number": "5702",
    "honors": false,
    "writing": false,
    "name": "Visual Communication",
    "fullname": "Visual Communication",
    "info": "This class provides an overview of sketching, manual rendering and Adobe Photoshop, Illustrator, and InDesign for communication of conceptual product design. Topics covered will include free-hand perspective drawing of simple/complex geometries, line weight/quality, shading/shadow, design details and annotations, as well as image editing, vector graphics, and multi-page layout design. There will be weekly drawing assignments and critique of work.",
    "prereq": {}
  },
  {
    "uid": "808395",
    "code": "PDES5703",
    "subject": "PDES",
    "number": "5703",
    "honors": false,
    "writing": false,
    "name": "Prototyping Methods",
    "fullname": "Prototyping Methods",
    "info": "This class is a hands-on introduction to traditional and digitally interactive prototyping tools and techniques. Through a series of projects students will gain experience with building product models using different materials and tools related to foam core, foam, wood, Arduino, and digital fabrication. In the process, the course covers design topics related to form and function, ergonomics, visual aesthetics, and design critique.",
    "prereq": {}
  },
  {
    "uid": "810114",
    "code": "PDES5704",
    "subject": "PDES",
    "number": "5704",
    "honors": false,
    "writing": false,
    "name": "Computer-Aided Design Methods",
    "fullname": "Computer-Aided Design Methods",
    "info": "This class provides an overview of how to make high-quality digital computer-based models of existing and conceptual products and interactions. Students will learn Adobe Photoshop, Adobe Illustrator, and Axure for two-dimensional design and digital prototyping. Students will also learn SolidWorks and KeyShot for three-dimensional solid modeling and rendering. prereq: Senior or grad student",
    "prereq": {}
  },
  {
    "uid": "813129",
    "code": "PDES5705",
    "subject": "PDES",
    "number": "5705",
    "honors": false,
    "writing": false,
    "name": "History/Future of Product Dsgn",
    "fullname": "History and Future of Product Design",
    "info": "This class covers critical milestones in the history, evolution, and trajectory of modern product design as well as the human relationships to consumer goods, including production and consumption. In some assignments, students have the opportunity to apply the topics discussed towards imagining the future of the product design industry. ",
    "prereq": {}
  },
  {
    "uid": "814073",
    "code": "PDES5706",
    "subject": "PDES",
    "number": "5706",
    "honors": false,
    "writing": false,
    "name": "Designing for Manufacture",
    "fullname": "Designing for Manufacture",
    "info": "Hands-on exposure to a number of common manufacturing methods and the considerations in product design. Students will be able to apply the theory of design for manufacturing (DFM) and design for assembly (DFA) to other methods that may not be taught in this course.",
    "prereq": {}
  },
  {
    "uid": "807001",
    "code": "PDES5711",
    "subject": "PDES",
    "number": "5711",
    "honors": false,
    "writing": false,
    "name": "Product Innovation Lab",
    "fullname": "Product Innovation Lab",
    "info": "A hands-on experience in integrated product design and development processes. Elements of industrial design, engineering, business, and humanities are applied to a semester-long product design project. Cross-functional teams of students in different majors work together to design and develop new consumer product concepts with guidance from a community of industry mentors",
    "prereq": {}
  },
  {
    "uid": "807884",
    "code": "PDES8192",
    "subject": "PDES",
    "number": "8192",
    "honors": false,
    "writing": false,
    "name": "Readings",
    "fullname": "Readings in Product Design",
    "info": "Independent study; review of books and periodicals under tutorial guidance.\n\nprereq: Grad, instr consent",
    "prereq": {}
  },
  {
    "uid": "807885",
    "code": "PDES8193",
    "subject": "PDES",
    "number": "8193",
    "honors": false,
    "writing": false,
    "name": "Dir Study in Product Design",
    "fullname": "Directed Study in Product Design",
    "info": "Independent study in product design under tutorial guidance.\n\nprereq: Grad, instr consent",
    "prereq": {}
  },
  {
    "uid": "819123",
    "code": "PDES8721",
    "subject": "PDES",
    "number": "8721",
    "honors": false,
    "writing": false,
    "name": "Product Des & Business Devel I",
    "fullname": "New Product Design and Business Development I",
    "info": "This is a 2-semester course. PDES 8722 must be taken in sequence in the Spring of the same year. Students and faculty work with company representatives to develop a product concept, a working physical prototype, and an extensive business plan. Concept design, detail design, manufacturing, marketing, introduction strategy, and profit forecasting. Sponsoring company intends to bring product to market. Engineering and design students must enroll for both semesters. Business students may enroll for one, the other or both semesters.",
    "prereq": {}
  },
  {
    "uid": "819124",
    "code": "PDES8722",
    "subject": "PDES",
    "number": "8722",
    "honors": false,
    "writing": false,
    "name": "Prod Des & Business Devel II",
    "fullname": "New Product Design and Business Development II",
    "info": "This is a 2-semester course sequence. PDES 8721 must be taken prior to this class in the Fall of the same year. Students and faculty work with company representatives to develop a product concept, a working physical prototype, and an extensive business plan. Concept design, detail design, manufacturing, marketing, introduction strategy, and profit forecasting. Sponsoring company intends to bring product to market. Engineering and design students must enroll for both semesters. Business students may enroll for one, the other or both semesters.",
    "prereq": {}
  }
]