[
  {
    "uid": "803176",
    "code": "PHAR1",
    "subject": "PHAR",
    "number": null,
    "honors": false,
    "writing": false,
    "name": "CoP - PNC",
    "fullname": "CoP - Phillips Neighborhood Clinic",
    "info": "Teaching laboratories to community/clinic-based interprofessional patient care model at Phillips Neighborhood Clinic.\n\nprereq: Current Student Pharmacist in the College of Pharmacy",
    "prereq": {}
  },
  {
    "uid": "015443",
    "code": "PHAR1001",
    "subject": "PHAR",
    "number": "1001",
    "honors": false,
    "writing": false,
    "name": "Orientation to Pharmacy",
    "fullname": "Orientation to Pharmacy",
    "info": "You may know that pharmacists are responsible for the dispensation of medications, but did you know that pharmacists play a critical role in the healthcare process by ensuring that their patients receive the best overall care? Designed to help you better understand the world of pharmacy, this online pharmacy course will introduce you to this exciting profession and help you gain an understanding of the impact pharmacists have in the patient care process. This course examines what training is necessary for success in the pharmacy field, demonstrates the roles a pharmacist can have in patient care, research and academia, and provides virtual tours of various settings in which pharmacists work.\n\nThis is not a self-study course. While it is completely online, there are deadlines for assignments throughout the semester. No late registrations will be accepted. Course information is sent to the U of M email addresses of registered students shortly before, and/or on, the first day of classes each Fall, Spring, and Summer term. For more information, contact phar1001@umn.edu or 612-624-7976.",
    "prereq": {}
  },
  {
    "uid": "014955",
    "code": "PHAR1002",
    "subject": "PHAR",
    "number": "1002",
    "honors": false,
    "writing": false,
    "name": "Medical Terminology",
    "fullname": "Medical Terminology",
    "info": "Interested in learning the difference between an antigen and an antibiotic? During this course, you will not only increase your medical vocabulary by more than 2500 words at your own pace, you will also learn to identify and articulately describe a wide variety of medical conditions and processes. Communication related to disease states, procedures, and diagnostics in health care can sometimes seem like another language. This course will help you recognize medical abbreviations, relate terms to procedures and diagnostics, and comprehend the meaning of medical terminology by using word elements. If you are interested in the health care field or would like to understand more about your own medical care, this course is a great place to start.",
    "prereq": {}
  },
  {
    "uid": "792028",
    "code": "PHAR1003",
    "subject": "PHAR",
    "number": "1003",
    "honors": false,
    "writing": false,
    "name": "Nonprescrip Meds & Self-Care",
    "fullname": "Nonprescription Medications and Self-Care: Treating Minor Conditions",
    "info": "Nonprescription medications and dietary supplements comprise a large market within the health care industry. Throughout this course, you'll learn about these medications and other self care remedies available to treat many different medical conditions. For each condition discussed, you will learn basic causes, signs, and symptoms; self care guidelines; and when to see a health care provider. For each medication discussed, you will learn the basic mechanism of action, uses, and potential side effects. This course will help you gain a better understanding of how nonprescription and self care products can be used safely and effectively.",
    "prereq": {}
  },
  {
    "uid": "798174",
    "code": "PHAR1004",
    "subject": "PHAR",
    "number": "1004",
    "honors": false,
    "writing": false,
    "name": "Common Prescrip Drugs & Dis",
    "fullname": "Common Prescription Drugs and Diseases",
    "info": "Are you interested in understanding how some of the most common prescription medications work, why they are used, and how they should be used when treating common ailments? Perhaps you would like to recognize the most common causes of specific diseases, identify their symptoms, and recognize the diagnostic criteria associated with them. Throughout this course, you will learn why some medications can\u0092t be used by certain people, understand how prescription drugs are regulated, and examine the correlation between common prescription drugs and diseases. Additionally, you will explore various drug information resources and learn how to find reliable sources of drug information.\n\nThis online class is primarily self-paced with due dates for certain aspects at times throughout the semester. Students may choose to work ahead in the course. Course information is sent to the University of Minnesota email addresses of registered students shortly before, and/or on, the first day of classes each fall, spring, and summer term. For more information, contact phar1004@umn.edu or 612-624-7976.",
    "prereq": {}
  },
  {
    "uid": "804249",
    "code": "PHAR1005",
    "subject": "PHAR",
    "number": "1005",
    "honors": false,
    "writing": false,
    "name": "Intro Drug Therapies Addiction",
    "fullname": "Introduction to Drug Therapies of Addiction: Medicine or Menace?",
    "info": "Drug therapies of addiction. Rationale behind drug regulation. Strategies to treat pain. How concepts of tolerance, physical dependence, and addiction influence care. Mechanisms of action of illicit/prescription medications.",
    "prereq": {}
  },
  {
    "uid": "807761",
    "code": "PHAR1006",
    "subject": "PHAR",
    "number": "1006",
    "honors": false,
    "writing": false,
    "name": "Health Literacy & Commun",
    "fullname": "Orientation to Health Literacy and Communication",
    "info": "Issues associated with health literacy. Dimensions associated with misunderstandings that occur in health-related communication.",
    "prereq": {}
  },
  {
    "uid": "794307",
    "code": "PHAR1905",
    "subject": "PHAR",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Caring For Yourself",
    "fullname": "Seminar: What Your Mom Didn't Tell You About Caring for Yourself",
    "info": "Making independent decisions about self-care. Tools for being an educated health consumer.",
    "prereq": {}
  },
  {
    "uid": "827138",
    "code": "PHAR2001",
    "subject": "PHAR",
    "number": "2001",
    "honors": false,
    "writing": false,
    "name": "Health Sciences Calculations",
    "fullname": "Health Sciences Calculations and Patient Safety",
    "info": "This course focuses on learning and practicing common health sciences calculations, with the goal to be able to demonstrate accurate completion and clear communication of a calculation. We will also explore the context surrounding health sciences calculations as many health professions either directly perform health sciences calculations or incorporate that information into patient care. The course will prepare students to examine the systemic, interpersonal, and individual factors that can contribute to medical errors in the healthcare system. With this context, students will be able to explain the importance of not only accurate health sciences calculations but also appropriate documentation with clear and consistent communication to other healthcare professionals. Students will also discuss the approach to handling medical errors based on \"just culture\" and consider how to prevent medical errors, especially around the use of medications. The intended audience of this course is pre-health students including pre-pharmacy, pre-medicine, pre-dentistry, pre-physician’s assistant, and pre-veterinary medicine.",
    "prereq": {}
  },
  {
    "uid": "820333",
    "code": "PHAR2002",
    "subject": "PHAR",
    "number": "2002",
    "honors": false,
    "writing": false,
    "name": "Precision Medicine and Health",
    "fullname": "Precision Medicine and Health: Understanding the Personal Genome",
    "info": "This course is intended for students who want to understand the basic concepts of Precision Medicine. It will help students understand how individuality impacts disease predisposition, diagnosis, treatment, and health. We will begin with the creation of an individualized full genome sequence and show how this information can be used to predict, diagnose, and treat disease. We will also discuss the ethical use of this information.\n\nThis course is intended for undergraduate non-science majors who are interested in the impact of genetics on different aspects of medicine, however science majors may also take the course. The course will provide a brief introduction to molecular biology and then introduce different areas of precision medicine, with an emphasis on the contribution of genetics for understanding predisposition, disease diagnosis, and drug treatment. An important part of the class will be exercises which help the student better understand concepts presented in the lectures.\n\nPrerequisites: None. The course is directed towards undergraduate non-science majors, however science majors may take the course.\nClass time: 2 x 75 minute in person lectures (50 minute lecture and 25 minute class exercise)\nSupplemental Textbook (Not Required)\n\nClasses will begin with a traditional lecture/discussion or seminar format, followed by in class discussion of assigned materials, and hands on activities using databases and case studies where the discussion in based around a situation (problem) that a clinician may encounter that requires application of precision medicine knowledge.",
    "prereq": {}
  },
  {
    "uid": "807137",
    "code": "PHAR3101",
    "subject": "PHAR",
    "number": "3101",
    "honors": false,
    "writing": false,
    "name": "A pill for every problem",
    "fullname": "A Pill for Every Problem or Problem Pills",
    "info": "Do pills deliver what they promise? Are neuroscientists as certain of the causes of mental illness and mental anguish as the medical community and pharmaceutical companies seem to be? What are the societal implications of this turn toward psychopharmaceutical solutions? Neurochemical theories of behavior and emotion.",
    "prereq": {}
  },
  {
    "uid": "809284",
    "code": "PHAR3206",
    "subject": "PHAR",
    "number": "3206",
    "honors": false,
    "writing": false,
    "name": "Foundations of Health Literacy",
    "fullname": "Foundations of Health Literacy",
    "info": "In this course, we will focus on health literacy and its implications for patients, health care providers, and the health care system at large. We will discuss the consequences of poor health literacy and practical strategies for improving health literacy. This will include steps that individual patients can take and communication strategies for future health care providers. You will explore disparities in health and health care and the relationship to health literacy. We will discuss cultural competency through both student discussions and a book club and consider the impact on the patient experience. Functional health literacy includes being able to navigate the health care system and health insurance. As a class, we will discuss choosing a health insurance policy and controversies therein.",
    "prereq": {}
  },
  {
    "uid": "808983",
    "code": "PHAR3207",
    "subject": "PHAR",
    "number": "3207",
    "honors": false,
    "writing": false,
    "name": "Leadership in Health Care",
    "fullname": "Leadership in Health Care",
    "info": "Leadership skills/theories to create positive change in health care settings.",
    "prereq": {}
  },
  {
    "uid": "810161",
    "code": "PHAR3208",
    "subject": "PHAR",
    "number": "3208",
    "honors": false,
    "writing": false,
    "name": "DS: Wellness Communication",
    "fullname": "Directed Study: Wellness Communication and Behavior Change in Patient Populations",
    "info": "Theories/models of health education/individual behavior change. Factors that impact health/habitual behavior. Solutions. Health campaigns/patient compliance.",
    "prereq": {}
  },
  {
    "uid": "805456",
    "code": "PHAR3601",
    "subject": "PHAR",
    "number": "3601",
    "honors": false,
    "writing": false,
    "name": "Basic Human Physiology",
    "fullname": "Basic Human Physiology for the Health Professions",
    "info": "Are you interested in understanding the function of the human body? This course will expose you to normal functions of the major organ systems and diseases in those systems. Not only will this course prepare you for a future career in the health sciences, you'll also gain knowledge about the physical, mechanical and biochemical functions of various human systems. Also, this course includes an online lab, an innovative tool designed to further your examination of the human body. Human systems discussed during this class include cellular, cardiovascular, respiratory, renal, gastrointestinal, and endocrine systems. A simulated lab experience will be included with this course.\n\nThis is a completely online course with due dates throughout the semester, though students have the option to work ahead if they choose. Course information is sent to the University email addresses of registered students shortly before, and/or on, the first day of classes each fall, spring, and summer term. For more information, contact phar3601@umn.edu or 612-624-7976.\n\nprereq: Anatomy required. Medical terminology recommended.",
    "prereq": {}
  },
  {
    "uid": "799935",
    "code": "PHAR3700",
    "subject": "PHAR",
    "number": "3700",
    "honors": false,
    "writing": false,
    "name": "Fundamental Pharmacotherapy",
    "fullname": "Fundamentals of Pharmacotherapy",
    "info": "Pharmacotherapy\u0097the treatment of disease through the administration of medications\u0097is a field particularly interesting to many healthcare workers. This course is designed to introduce you to some of the main drug classes available for the treatment of particular diseases. You will also learn about basic pharmacology, recognize brand and generic drug names, and explore their common uses and therapeutic classes. A basic understanding of treatment options available for common disease states will also be developed during this course. Additionally, the course develops basic proficiency in the use of drug information resources.\n\nThis is a completely online course with due dates throughout the semester though students have the option to work ahead if they choose. Course information is sent to the University of Minnesota email addresses of registered students shortly before, and/or on, the first day of classes each fall, spring, and summer term. For more information, contact phar3700@umn.edu or 612-624-7976.\n\nPrereq: Medical terminology recommended",
    "prereq": {}
  },
  {
    "uid": "795174",
    "code": "PHAR3801",
    "subject": "PHAR",
    "number": "3801",
    "honors": false,
    "writing": false,
    "name": "Pharmacotherapy Health Prof",
    "fullname": "Pharmacotherapy for the Health Professions",
    "info": "Pharmacotherapy, the treatment of disease through the administration of medications, is a topic central to the practice of nursing. This course is designed to introduce you to the main drug classes available for the treatment of particular diseases and the monitoring parameters for patients taking these medications. You will also learn about basic pharmacology, recognize brand and generic drug names, and explore their common uses and therapeutic classes. A basic understanding of contraindications and precautions related to various classes of medications will also be covered. Additionally, the course develops basic proficiency in the use of drug information resources. \n\nThis is a completely online course with weekly due dates. Course information is sent to the University of Minnesota email addresses of registered students shortly before and/or on the first day of classes each fall and spring term. For more information, contact 3801@umn.edu.\n\nprereq or coreq: Anatomy and physiology",
    "prereq": {}
  },
  {
    "uid": "798487",
    "code": "PHAR4204W",
    "subject": "PHAR",
    "number": "4204",
    "honors": false,
    "writing": true,
    "name": "Drugs & the US Healthcare Sys",
    "fullname": "Drugs and the U.S. Healthcare System",
    "info": "Being an empowered patient is important when discussing ethics-driven issues within the U.S. healthcare system. This course will expose students to current controversial issues surrounding medications and national healthcare and help students examine their own role as a participant in this system. Students will learn to draw comparisons between medication use systems around the world and analyze other controversies related to access, choice, and quality of healthcare. During this course, students will explore how their choices, ethics, and behavior affect societal decisions surrounding the availability of medications in the U.S. and what their rights are as a citizen-participant during the healthcare debate.\n\nStudents are expected to have completed the first-year writing requirement (https://cla.umn.edu/writing-studies/first-year-writing), or equivalent, prior to registering for this class.  \n\nThis is a completely online course with weekly due dates and is offered each Fall and Spring term. For more information, contact phar4204@umn.edu or 612-624-7976.",
    "prereq": {}
  },
  {
    "uid": "804948",
    "code": "PHAR4248",
    "subject": "PHAR",
    "number": "4248",
    "honors": false,
    "writing": false,
    "name": "Drugs of Abuse",
    "fullname": "Drugs of Abuse",
    "info": "Medicinal chemistry/pharmacology/toxicology of substances of abuse. Synthesis/natural product extraction of illicit drugs. Dangers of clandestine lab practices. Sociological aspects of abuse.",
    "prereq": {}
  },
  {
    "uid": "805939",
    "code": "PHAR4293",
    "subject": "PHAR",
    "number": "4293",
    "honors": false,
    "writing": false,
    "name": "Directed Research I",
    "fullname": "Directed Research I for Undergraduates",
    "info": "Work with College of Pharmacy faculty.\n\nprereq: undergrad, instr consent",
    "prereq": {}
  },
  {
    "uid": "800741",
    "code": "PHAR4294",
    "subject": "PHAR",
    "number": "4294",
    "honors": false,
    "writing": false,
    "name": "Directed Study I - UG",
    "fullname": "Directed Study I for Undergraduates",
    "info": "Individualized study. Students work with faculty on special projects.\n\nprereq: Undergrad, instr consent",
    "prereq": {}
  },
  {
    "uid": "014956",
    "code": "PHAR5201",
    "subject": "PHAR",
    "number": "5201",
    "honors": false,
    "writing": false,
    "name": "Applied Medical Terminology",
    "fullname": "Applied Medical Terminology",
    "info": "Interested in learning the difference between an antigen and an antibiotic? During this course, you will not only increase your medical vocabulary by more than 2500 words at your own pace, you will also learn to identify and articulately describe a wide variety of medical conditions and processes. Communication related to disease states, procedures, and diagnostics in health care can sometimes seem like another language. This course will help you recognize medical abbreviations, relate terms to procedures and diagnostics, and comprehend the meaning of medical terminology by using word elements. If you are interested in the health care field or would like to understand more about your own medical care, this course is a great place to start. \n\nprereq: Basic knowledge of human anatomy/physiology",
    "prereq": {}
  },
  {
    "uid": "799290",
    "code": "PHAR5204",
    "subject": "PHAR",
    "number": "5204",
    "honors": false,
    "writing": false,
    "name": "Drugs & US Healthcare System",
    "fullname": "Drugs and the US Healthcare System",
    "info": "Being an empowered patient is important when discussing ethics-driven issues within the U.S. healthcare system. This course will expose students to current controversial issues surrounding medications and national healthcare and help students examine their own role as a participant in this system. Students will learn to draw comparisons between medication use systems around the world and analyze other controversies related to access, choice, and quality of healthcare. During this course, students will explore how their choices, ethics, and behavior affect societal decisions surrounding the availability of medications in the U.S. and what their rights are as a citizen-participant during the healthcare debate.\n\nStudents are expected to have completed the first-year writing requirement (https://cla.umn.edu/writing-studies/first-year-writing), or equivalent, prior to registering for this class.  \n\nThis is a completely online course with weekly due dates and is offered each Fall and Spring term. For more information, contact phar4204@umn.edu or 612-624-7976.",
    "prereq": {}
  },
  {
    "uid": "807762",
    "code": "PHAR5205",
    "subject": "PHAR",
    "number": "5205",
    "honors": false,
    "writing": false,
    "name": "Obesity: Issues, Interventions",
    "fullname": "Obesity: Issues, Interventions, Innovations",
    "info": "This course will focus on the role of the pharmacist in treating obesity. Students will learn the pharmacology of past and current medications to treat obesity, as well as the pathophysiology of the disease to understand why more options aren’t available. Students will explore drug information sources for dietary supplements for weight loss, discuss the care of an obese patient including non-pharmacologic treatments for obesity, as well as recognizing the potential for bias and its effect on patient care. Finally, students will look at bariatric surgery and discuss some specific adjustments in care for bariatric patients.\n\nThis is a completely online course with weekly due dates offered each Fall and Spring term. For more information, contact phar5205@umn.edu or 612-624-7976.\n\nPrereq: Second or third year pharmacy student, or student enrolled in a graduate science or health-related program. Biochemistry and physiology suggested.",
    "prereq": {}
  },
  {
    "uid": "807763",
    "code": "PHAR5206",
    "subject": "PHAR",
    "number": "5206",
    "honors": false,
    "writing": false,
    "name": "Applied Health Literacy & Comm",
    "fullname": "Applied Health Literacy and Communication",
    "info": "Issues associated with health literacy. Dimensions associated with misunderstandings that occur in health-related communication.",
    "prereq": {}
  },
  {
    "uid": "808984",
    "code": "PHAR5207",
    "subject": "PHAR",
    "number": "5207",
    "honors": false,
    "writing": false,
    "name": "App Ldrshp in Health Care",
    "fullname": "Applied Leadership in Health Care",
    "info": "Leadership skills/theories to create positive change in health care settings. \n\nprereq: advanced undergraduates or professional health care students or grad students",
    "prereq": {}
  },
  {
    "uid": "799331",
    "code": "PHAR5210",
    "subject": "PHAR",
    "number": "5210",
    "honors": false,
    "writing": false,
    "name": "Dimin Health Disp Cult Comp",
    "fullname": "Diminishing Health Disparities Through Cultural Competence: Community Engagement",
    "info": "Various dynamics of health disparities, cultural competencies. Uses sociological framework.",
    "prereq": {}
  },
  {
    "uid": "808264",
    "code": "PHAR5212",
    "subject": "PHAR",
    "number": "5212",
    "honors": false,
    "writing": false,
    "name": "Survey: Pediatric Disease",
    "fullname": "Survey of Pediatric Metabolic, Genetic, and Oncologic Disease",
    "info": "Appraisal of major genetic/metabolic disorders and oncologic diseases of childhood. Disease state epidemiology, pharmacotherapy, monitoring, practical applications.\n\nprereq: Second year or higher in College of Pharmacy or instr consent",
    "prereq": {}
  },
  {
    "uid": "811311",
    "code": "PHAR5230",
    "subject": "PHAR",
    "number": "5230",
    "honors": false,
    "writing": false,
    "name": "Princ Clinical Phar Research",
    "fullname": "Principles of Clinical Pharmacology Research",
    "info": "Drug therapy investigation. Topics include experimental design of drug studies in human research subject volunteers. Topics related to individualization of therapy including effects of genetic polymorphisms, demographic variables, physiologic variables, age on drug disposition treatment outcomes.\n\nprereq: 3rd Year Pharmacy Student or instr consent",
    "prereq": {}
  },
  {
    "uid": "015464",
    "code": "PHAR5270",
    "subject": "PHAR",
    "number": "5270",
    "honors": false,
    "writing": false,
    "name": "Herbal and Natural Medicinals",
    "fullname": "Therapeutics of Herbal and Other Natural Medicinals",
    "info": "Herbal products/supplements. Pharmacology/clinical indications/drug interactions of common products in nontraditional complementary health care. Historical significance/evidenced-based role of products in health care. Case studies of clinical applications.\n\nprereq: organic chemistry, pathophysiology of disease states, 3rd or 4th yr PHAR",
    "prereq": {}
  },
  {
    "uid": "015873",
    "code": "PHAR5280",
    "subject": "PHAR",
    "number": "5280",
    "honors": false,
    "writing": false,
    "name": "Princ Health Care Counseling",
    "fullname": "Principles of Health Care Counseling",
    "info": "Basic counseling theory/practice. Means of bringing about behavioral change from perspective of pharmacy/health care practitioner. Application of course principles through interactive small group exercises. Case presentations by experienced pharmaceutical care practitioners.",
    "prereq": {}
  },
  {
    "uid": "820253",
    "code": "PHAR5310",
    "subject": "PHAR",
    "number": "5310",
    "honors": false,
    "writing": false,
    "name": "Topics in Pharmacy Ethics",
    "fullname": "Topics in Pharmacy Ethics (Pandemics)",
    "info": "Using COVID-19 as a pandemic model, students in this elective course will explore the ethical considerations informing personal, public policy, and biomedical research decisions during a pandemic.  Students will apply ethical principles and selected schools of ethical thought to discuss and debate those decisions.",
    "prereq": {}
  },
  {
    "uid": "799954",
    "code": "PHAR5700",
    "subject": "PHAR",
    "number": "5700",
    "honors": false,
    "writing": false,
    "name": "Applied Fund. Pharmacotherapy",
    "fullname": "Applied Fundamentals of Pharmacotherapy",
    "info": "Pharmacotherapy, the treatment of disease through the administration of medications, is a field particularly interesting to many health care workers. This course is designed to introduce students to some of the main drug classes available for the treatment of particular diseases. Students will also learn about basic pharmacology, recognize brand and generic drug names, and explore their common uses and therapeutic classes. A basic understanding of treatment options available for common disease states will also be developed during this course. Additionally, the course develops basic proficiency in the use of drug information resources.\n \nThis is a completely online course with due dates throughout the semester, though students have the option to work ahead if they choose. This course is offered each Fall, Spring, and Summer term. For more information, contact phar3700@umn.edu or 612-624-7976.\n\nPrereq: Medical terminology recommended",
    "prereq": {}
  },
  {
    "uid": "800822",
    "code": "PHAR5803",
    "subject": "PHAR",
    "number": "5803",
    "honors": false,
    "writing": false,
    "name": "Pharmacotherapy Health Profess",
    "fullname": "Pharmacotherapy for the Health Professions",
    "info": "Pharmacotherapy, the treatment of disease through the administration of medications, is a topic central to the practice of nursing. This course is designed to introduce you to the main drug classes available for the treatment of particular diseases and the monitoring parameters for patients taking these medications. You will also learn about basic pharmacology, recognize brand and generic drug names, and explore their common uses and therapeutic classes. A basic understanding of contraindications and precautions related to various classes of medications will also be covered. Additionally, the course develops basic proficiency in the use of drug information resources.\n\nThis is a completely online course with weekly due dates offered each Fall term. For more information, contact phar3801@umn.edu.\n\nprereq: Anatomy and physiology",
    "prereq": {}
  },
  {
    "uid": "016563",
    "code": "PHAR6001",
    "subject": "PHAR",
    "number": "6001",
    "honors": false,
    "writing": false,
    "name": "Immunology Transition",
    "fullname": "Immunology Transition",
    "info": "Transition course for semester conversion.",
    "prereq": {}
  },
  {
    "uid": "014245",
    "code": "PHAR6002",
    "subject": "PHAR",
    "number": "6002",
    "honors": false,
    "writing": false,
    "name": "Ther Agents II Transition",
    "fullname": "Ther Agents II Transition",
    "info": "Basic priniciples of drug design, metabolism, mechanism of action and receptor interaction.  Therapeutic properties and uses of autonomic, antihistaminic, renal and cardiovascular drugs.",
    "prereq": {}
  },
  {
    "uid": "016568",
    "code": "PHAR6003",
    "subject": "PHAR",
    "number": "6003",
    "honors": false,
    "writing": false,
    "name": "Neuropsych PT Transition",
    "fullname": "Neuropsychiatric Pharmacotherapy Transition",
    "info": "Transition course for semester conversion.",
    "prereq": {}
  },
  {
    "uid": "014209",
    "code": "PHAR6004",
    "subject": "PHAR",
    "number": "6004",
    "honors": false,
    "writing": false,
    "name": "Biopharm II Transition",
    "fullname": "Biopharmaceutics II Transition",
    "info": "Applied theory of dosage form design for optimal drug activity and bioavailability for all routes of drug administration.",
    "prereq": {}
  },
  {
    "uid": "016572",
    "code": "PHAR6005",
    "subject": "PHAR",
    "number": "6005",
    "honors": false,
    "writing": false,
    "name": "Oncology-Toxicology PT Trans",
    "fullname": "Oncology-Toxicology Pharmacotherapy Transition",
    "info": "Transition course for semester conversion.",
    "prereq": {}
  },
  {
    "uid": "014233",
    "code": "PHAR6006",
    "subject": "PHAR",
    "number": "6006",
    "honors": false,
    "writing": false,
    "name": "Pharmacotherapy I Transition",
    "fullname": "Pharmacotherapy I  Transition",
    "info": "Transition course for semester conversion.",
    "prereq": {}
  },
  {
    "uid": "788909",
    "code": "PHAR6007",
    "subject": "PHAR",
    "number": "6007",
    "honors": false,
    "writing": false,
    "name": "Cardiovascular PT Transition",
    "fullname": "Cardiovascular Pharmacotherapy Transition",
    "info": "Comprehensive review of pathophysiology/therapeutics of common cardiovascular diseases/syndroms. Emphasizes key issues surrounding pharmacotherapy associated with these conditions.",
    "prereq": {}
  },
  {
    "uid": "789759",
    "code": "PHAR6008",
    "subject": "PHAR",
    "number": "6008",
    "honors": false,
    "writing": false,
    "name": "Neuro, Psych, & Gero PT Trans",
    "fullname": "Neurologic, Psychiatric, & Geriatric Pharmacotherapy Transition",
    "info": "Pathophysiology/pharmacotherapy of common neurologic, psychiatric & geriatric disorders.",
    "prereq": {}
  },
  {
    "uid": "014683",
    "code": "PHAR6009",
    "subject": "PHAR",
    "number": "6009",
    "honors": false,
    "writing": false,
    "name": "Therapeutic Agents IV Trans",
    "fullname": "Therapeutic Agents IV Transition",
    "info": "Transition course for anti-infectives.",
    "prereq": {}
  },
  {
    "uid": "802053",
    "code": "PHAR6061",
    "subject": "PHAR",
    "number": "6061",
    "honors": false,
    "writing": false,
    "name": "Physiological Systems",
    "fullname": "Physiological Systems as Targets for Drug Action",
    "info": "Physiology/neurophysiology systems. Relation to pharmacy.",
    "prereq": {}
  },
  {
    "uid": "016936",
    "code": "PHAR6100",
    "subject": "PHAR",
    "number": "6100",
    "honors": false,
    "writing": false,
    "name": "Computer/Internet Skills Pharm",
    "fullname": "Computer and Internet Skills in Pharmacy",
    "info": "Computer applications in pharmacy.",
    "prereq": {}
  },
  {
    "uid": "799536",
    "code": "PHAR6105",
    "subject": "PHAR",
    "number": "6105",
    "honors": false,
    "writing": false,
    "name": "Neurophysiology for Pharmacy",
    "fullname": "Neurophysiology for Pharmacy",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "014220",
    "code": "PHAR6111",
    "subject": "PHAR",
    "number": "6111",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Pract I",
    "fullname": "The Practice of Pharmaceutical Care I",
    "info": "Pharmaceutical care, pharmacy profession, drug information retrieval. Professional communications, problem-solving skills, introductory clerkship.",
    "prereq": {}
  },
  {
    "uid": "014222",
    "code": "PHAR6112",
    "subject": "PHAR",
    "number": "6112",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Pract II",
    "fullname": "The Practice of Pharmaceutical Care II",
    "info": "Comprehensive pharmaceutical care, health belief model, legal issues, prescription processing, clerkship continued and introduction to pharmacotherapy issues",
    "prereq": {}
  },
  {
    "uid": "788221",
    "code": "PHAR6121",
    "subject": "PHAR",
    "number": "6121",
    "honors": false,
    "writing": false,
    "name": "Pharmacotherapy I",
    "fullname": "Pharmacotherapy I: Patient-centered Pathophysiologic Approach",
    "info": "Pathophysiology/pharmacotherapy of common fluid-electrolyte, renal, acid-base, immunologic, hematologic disorders.",
    "prereq": {}
  },
  {
    "uid": "014234",
    "code": "PHAR6122",
    "subject": "PHAR",
    "number": "6122",
    "honors": false,
    "writing": false,
    "name": "Pharmacotherapy II",
    "fullname": "Pharmacotherapy II: Patient-Centered Pathophysiologic Approach",
    "info": "Pathophysiology/pharmacotherapy of common cardiovascular, endocrine, gastrointestinal disorders.\n\nprereq: 6121, concurrent registration is required (or allowed) in 6131, 6154, 6163, 6173, PHCL 5101, PHCL 5102",
    "prereq": {
      "and": [
        "788221",
        "014241",
        "788223",
        "014219",
        "014223",
        "016705",
        "016706"
      ]
    }
  },
  {
    "uid": "788222",
    "code": "PHAR6123",
    "subject": "PHAR",
    "number": "6123",
    "honors": false,
    "writing": false,
    "name": "Pharmacotherapy III",
    "fullname": "Pharmacotherapy III: Patient-centered Pathophysiologic Approach",
    "info": "Pathophysiology/pharmacotherapy of common neurologic, psychiatric, pulmonary, geriatric disorders.\n\nprereq: 6122, 6163, concurrent registration is required (or allowed) in 6175, PHCL 5101, PHCL 5102",
    "prereq": {
      "and": [
        "014234",
        "014219",
        "014217",
        "016705",
        "016706"
      ]
    }
  },
  {
    "uid": "014236",
    "code": "PHAR6124",
    "subject": "PHAR",
    "number": "6124",
    "honors": false,
    "writing": false,
    "name": "Pharmacotherapy IV",
    "fullname": "Pharmacotherapy IV: Patient-centered Pathophysiologic Approach",
    "info": "Pathophysiology/pharmacotherapy of common infectious diseases, oncologic/toxicologic disorders.\n\nprereq: 6121, 6122, 6123, 6155, 6163",
    "prereq": {
      "and": [
        "788221",
        "014234",
        "788222",
        "014246",
        "014219"
      ]
    }
  },
  {
    "uid": "014241",
    "code": "PHAR6131",
    "subject": "PHAR",
    "number": "6131",
    "honors": false,
    "writing": false,
    "name": "Pharmacy and Hlth Care System",
    "fullname": "Pharmacy and the Health Care System",
    "info": "Delivery of pharmaceuticals/pharmacy services in U.S. health care system. Issues in hospital/community practice, characteristics of pharmaceutical industry. Economic/financial issues in delivering pharmaceutical services.\n\nprereq: 2nd year pharmacy student",
    "prereq": {}
  },
  {
    "uid": "014719",
    "code": "PHAR6132",
    "subject": "PHAR",
    "number": "6132",
    "honors": false,
    "writing": false,
    "name": "Biostatistics & Drug Lit Eval",
    "fullname": "Biostatistics and Drug Literature Evaluation",
    "info": "Biostatistical methods for data analysis and principles of study design for clinical research.  Use of small computers to analyze and present data.  Methods of searching for and evaluating drug-related information.",
    "prereq": {}
  },
  {
    "uid": "014250",
    "code": "PHAR6133",
    "subject": "PHAR",
    "number": "6133",
    "honors": false,
    "writing": false,
    "name": "Pharmacy Practice Mgmt",
    "fullname": "Pharmacy Practice Management",
    "info": "Principles of pharmacy management, including inventory control, purchasing, pricing, financial analysis, personnel management.\n\nprereq: 3rd year pharmacy student",
    "prereq": {}
  },
  {
    "uid": "014252",
    "code": "PHAR6134",
    "subject": "PHAR",
    "number": "6134",
    "honors": false,
    "writing": false,
    "name": "Law and Ethics",
    "fullname": "Law and Ethics in Pharmacy Practice",
    "info": "Minnesota and federal laws, rules, regulations and court decisions affecting pharmacy practice.  Moral and ethical considerations that affect and influence pharmacy practice.",
    "prereq": {}
  },
  {
    "uid": "795368",
    "code": "PHAR6135",
    "subject": "PHAR",
    "number": "6135",
    "honors": false,
    "writing": false,
    "name": "Pharmacy Outcomes",
    "fullname": "Pharmacy Outcomes",
    "info": "How to integrate knowledge of basic sciences, pharmacotherapy, pharmacy practice management, pharmaceutical care, written communication, literature evaluation, drug information retrieval, law/ethics, and pharmacoeconomics to manage patients with multiple medical conditions.\n\nprereq: 6123, 6175",
    "prereq": {
      "and": [
        "788222",
        "014217"
      ]
    }
  },
  {
    "uid": "804735",
    "code": "PHAR6137",
    "subject": "PHAR",
    "number": "6137",
    "honors": false,
    "writing": false,
    "name": "Ethics in Pharmacy Practice",
    "fullname": "Ethics in Pharmacy Practice",
    "info": "Theories of ethics, ethical analysis of practical ethical issues experienced by pharmacists. Relationship of ethical reasoning to public policy and law. Readings from peer-reviewed publications and popular media. Case studies.\n\nprereq: 3rd yr pharmacy student",
    "prereq": {}
  },
  {
    "uid": "790744",
    "code": "PHAR6141",
    "subject": "PHAR",
    "number": "6141",
    "honors": false,
    "writing": false,
    "name": "Med Microbiology & Immuns",
    "fullname": "Medical Microbiology and Immunizations",
    "info": "Background knowledge in medical microbiology. Evaluating information on emerging infectious diseases, recommending immunization schedules for childhood/adult vaccines.",
    "prereq": {}
  },
  {
    "uid": "014726",
    "code": "PHAR6142",
    "subject": "PHAR",
    "number": "6142",
    "honors": false,
    "writing": false,
    "name": "Pharmacology I",
    "fullname": "Pharmacology I",
    "info": "Action and fate of drugs in the body. General mechanisms of drug action, signal transduction/receptors, peripheral neuroeffector mechanisms (autonomic and peripheral nervous systems), local hormones, renal and cardiovascular pharmacology.",
    "prereq": {}
  },
  {
    "uid": "014727",
    "code": "PHAR6143",
    "subject": "PHAR",
    "number": "6143",
    "honors": false,
    "writing": false,
    "name": "XXXXXXX",
    "fullname": "XXXXXXX",
    "info": "Action and fate of drugs affecting the endocrine system and central nervous system as well as actions of antiflammatory drugs.",
    "prereq": {}
  },
  {
    "uid": "015891",
    "code": "PHAR6150",
    "subject": "PHAR",
    "number": "6150",
    "honors": false,
    "writing": false,
    "name": "Medicinal Chemistry Seminar",
    "fullname": "Medicinal Chemistry Seminar",
    "info": "Current topics in medicinal chemistry. prereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "014238",
    "code": "PHAR6151",
    "subject": "PHAR",
    "number": "6151",
    "honors": false,
    "writing": false,
    "name": "Biochem Medicinals I",
    "fullname": "Biochemistry of Medicinals I",
    "info": "Biochemistry topics required for understanding pharmacodynamic action/therapeutic use of medicinal agents.\n\nprereq: 1st yr PHAR, 6171",
    "prereq": {
      "and": [
        "014239"
      ]
    }
  },
  {
    "uid": "014243",
    "code": "PHAR6152",
    "subject": "PHAR",
    "number": "6152",
    "honors": false,
    "writing": false,
    "name": "Biochem Medicinals  II",
    "fullname": "Biochemistry of Medicinals II",
    "info": "Intermediary metabolism of carbohydrates, lipids, amino acids and nucleic acids and how these pathways are affected by therapeutic agents.  Introduction to bioenergetics and  drug metabolism.",
    "prereq": {}
  },
  {
    "uid": "014244",
    "code": "PHAR6153",
    "subject": "PHAR",
    "number": "6153",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Immunology",
    "fullname": "Pharmaceutical Immunology",
    "info": "Basic biological mechanisms of immune system. Emphasizes drug allergies, immunosuppressives, monoclonal antibodies, and preparation/use of immunologic derived agents in diagnosing/treating disease.\n\nprereq: 6151",
    "prereq": {
      "and": [
        "014238"
      ]
    }
  },
  {
    "uid": "788223",
    "code": "PHAR6154",
    "subject": "PHAR",
    "number": "6154",
    "honors": false,
    "writing": false,
    "name": "Medicinal Agents I",
    "fullname": "Medicinal Agents I",
    "info": "Basic principles of drug design, metabolism of action, and receptor interaction. Chemical/biological properties and therapeutic uses of autonomic, antihistaminic, renal, and cardiovascular drugs.",
    "prereq": {}
  },
  {
    "uid": "014246",
    "code": "PHAR6155",
    "subject": "PHAR",
    "number": "6155",
    "honors": false,
    "writing": false,
    "name": "Medicinal Agents II",
    "fullname": "Medicinal Agents II",
    "info": "Chemical/biological properties and therapeutic uses of drugs affecting central nervous, endocrine, and intermediary metabolism systems.\n\nprereq: 6154, concurrent registration is required (or allowed) in  6174 and  Phcl 5102",
    "prereq": {
      "and": [
        "788223",
        "014225",
        "016706"
      ]
    }
  },
  {
    "uid": "014247",
    "code": "PHAR6156",
    "subject": "PHAR",
    "number": "6156",
    "honors": false,
    "writing": false,
    "name": "Medicinal Agents III",
    "fullname": "Medicinal Agents III",
    "info": "Therapeutic properties/uses of antiviral, anti-infective, antineoplastic agents.\n\nprereq: 6151, 6141",
    "prereq": {
      "and": [
        "014238",
        "790744"
      ]
    }
  },
  {
    "uid": "014253",
    "code": "PHAR6157",
    "subject": "PHAR",
    "number": "6157",
    "honors": false,
    "writing": false,
    "name": "Nutrition & Drug Therapy",
    "fullname": "Human Nutrition and Drug Therapy",
    "info": "Basic concepts of human nutrition and clinical application.\n\nprereq: 6152",
    "prereq": {
      "and": [
        "014243"
      ]
    }
  },
  {
    "uid": "016937",
    "code": "PHAR6158",
    "subject": "PHAR",
    "number": "6158",
    "honors": false,
    "writing": false,
    "name": "Recombinant DNA-Derived Drugs",
    "fullname": "Recombinant DNA-Derived Drugs",
    "info": "Biotechnology as it relates to basic/clinical pharmaceutical sciences. Emphasizes recombinant DNA techniques and preparation/use of biotechnology-derived agents in diagnosing/treating disease.\n\nprereq: 6151",
    "prereq": {
      "and": [
        "014238"
      ]
    }
  },
  {
    "uid": "790727",
    "code": "PHAR6159",
    "subject": "PHAR",
    "number": "6159",
    "honors": false,
    "writing": false,
    "name": "Pharm Immunology & Biotech",
    "fullname": "Pharmaceutical Immunology and Biotechnology",
    "info": "Basic biological mechanisms of immune system. Emphasizes drug allergies, immunosuppressives, monoclonal antibodies, and preparation/use of immunologic derived agents in diagnosing/treating disease. Biotechnology as it relates to basic/clinical pharmaceutical sciences. Emphasizes recombinant DNA techniques and preparation/use of biotechnology-derived agents in diagnosing/treating disease.",
    "prereq": {}
  },
  {
    "uid": "799788",
    "code": "PHAR6160",
    "subject": "PHAR",
    "number": "6160",
    "honors": false,
    "writing": false,
    "name": "Experimental & Clinical Pharm",
    "fullname": "Experimental and Clinical Pharmacology Seminar",
    "info": "Selected topics in experimental/clinical pharmacology.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "014237",
    "code": "PHAR6161",
    "subject": "PHAR",
    "number": "6161",
    "honors": false,
    "writing": false,
    "name": "Drug Delivery I",
    "fullname": "Drug Delivery I",
    "info": "Mathematics associated with drug dispensing; technology of common pharmaceutical dosage forms.  Phenomenological and theoretical basis of equilibrium and steady-state processes controlling drugs and dosage forms.",
    "prereq": {}
  },
  {
    "uid": "014242",
    "code": "PHAR6162",
    "subject": "PHAR",
    "number": "6162",
    "honors": false,
    "writing": false,
    "name": "Drug Delivery II",
    "fullname": "Drug Delivery II",
    "info": "Phenomenological and theoretical basis of kinetic and dynamic processes controlling drugs and dosage forms. ",
    "prereq": {}
  },
  {
    "uid": "014219",
    "code": "PHAR6163",
    "subject": "PHAR",
    "number": "6163",
    "honors": false,
    "writing": false,
    "name": "Pharmacokinetics",
    "fullname": "Pharmacokinetics",
    "info": "Physiological basis for drug absorption, distribution, metabolism and excretion; use of mathematical principles and equations to describe these processes as well as design dosage regimens for individual patients.",
    "prereq": {}
  },
  {
    "uid": "788224",
    "code": "PHAR6164",
    "subject": "PHAR",
    "number": "6164",
    "honors": false,
    "writing": false,
    "name": "Biopharmaceutics",
    "fullname": "Biopharmaceutics",
    "info": "Applied theory of dosage form design for optimal drug activity/bioavailability for all routes of drug administration.\n\nprereq: 6161, 6162, 6163",
    "prereq": {
      "and": [
        "014237",
        "014242",
        "014219"
      ]
    }
  },
  {
    "uid": "794234",
    "code": "PHAR6165",
    "subject": "PHAR",
    "number": "6165",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Calculations",
    "fullname": "Pharmaceutical Calculations",
    "info": "Performing pharmaceutical calculations for patient care in all pharmacy practice environments.",
    "prereq": {}
  },
  {
    "uid": "014239",
    "code": "PHAR6171",
    "subject": "PHAR",
    "number": "6171",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Skills I",
    "fullname": "Pharmaceutical Care Skills I",
    "info": "Integrating basic/clinical science curriculum in lab setting.",
    "prereq": {}
  },
  {
    "uid": "014240",
    "code": "PHAR6172",
    "subject": "PHAR",
    "number": "6172",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Skills II",
    "fullname": "Pharmaceutical Care Skills II",
    "info": "Basic/clinical science curriculum in lab setting. Longitudinal care.",
    "prereq": {}
  },
  {
    "uid": "014223",
    "code": "PHAR6173",
    "subject": "PHAR",
    "number": "6173",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Skills III",
    "fullname": "Pharmaceutical Care Skills III",
    "info": "Integrating basic/clinical science curriculum in lab setting.",
    "prereq": {}
  },
  {
    "uid": "014225",
    "code": "PHAR6174",
    "subject": "PHAR",
    "number": "6174",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Skills IV",
    "fullname": "Pharmaceutical Care Skills IV",
    "info": "Basic/clinical science curriculum in lab setting. Longitudinal care in lab setting.\n\nprereq: concurrent registration is required (or allowed) in 6122",
    "prereq": {
      "and": [
        "014234"
      ]
    }
  },
  {
    "uid": "014217",
    "code": "PHAR6175",
    "subject": "PHAR",
    "number": "6175",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Skills V",
    "fullname": "Pharmaceutical Care Skills V",
    "info": "Integrates basic/clinical science curriculum lab setting.\n\nprereq: [concurrent registration is required (or allowed) in 6171, 6172, 6173, 6174, 6111, 6112] or instr consent",
    "prereq": {
      "and": [
        "014239",
        "014240",
        "014223",
        "014225",
        "014220",
        "014222"
      ]
    }
  },
  {
    "uid": "014255",
    "code": "PHAR6176",
    "subject": "PHAR",
    "number": "6176",
    "honors": false,
    "writing": false,
    "name": "Patient Assessment",
    "fullname": "Patient Assessment",
    "info": "Physical/patient assessment skills as they relate to provision of pharmaceutical care.",
    "prereq": {}
  },
  {
    "uid": "792029",
    "code": "PHAR6177",
    "subject": "PHAR",
    "number": "6177",
    "honors": false,
    "writing": false,
    "name": "Patient Assessment",
    "fullname": "Patient Assessment",
    "info": "How to obtain accurate health histories/perform  systemic physical assessments of adult patients in pharmacy practice.",
    "prereq": {}
  },
  {
    "uid": "014218",
    "code": "PHAR6181",
    "subject": "PHAR",
    "number": "6181",
    "honors": false,
    "writing": false,
    "name": "Pharm.D. Paper & Seminar",
    "fullname": "Pharm.D. Paper & Seminar",
    "info": "Research paper/research project plan. Professional behavior, patient confidentiality, universal precautions.\n\nprereq: 3rd yr Pharmacy student",
    "prereq": {}
  },
  {
    "uid": "014701",
    "code": "PHAR6182",
    "subject": "PHAR",
    "number": "6182",
    "honors": false,
    "writing": false,
    "name": "Pharm.D. IV Seminar",
    "fullname": "Pharm.D. IV Seminar",
    "info": "Students present thesis topics to peers and faculty evaluators.\n\nprereq: 4th yr pharmacy student, 6181",
    "prereq": {
      "and": [
        "014218"
      ]
    }
  },
  {
    "uid": "014702",
    "code": "PHAR6183",
    "subject": "PHAR",
    "number": "6183",
    "honors": false,
    "writing": false,
    "name": "Pharm.D. IV Paper",
    "fullname": "Pharm.D. IV Paper",
    "info": "Final paper describing hypothesis-driven research project, patient-care oriented project, management project, drug-usage evaluation, or extensive literature review.\n\nprereq: 6181",
    "prereq": {
      "and": [
        "014218"
      ]
    }
  },
  {
    "uid": "800025",
    "code": "PHAR6200",
    "subject": "PHAR",
    "number": "6200",
    "honors": false,
    "writing": false,
    "name": "Drugs & the US Healthcare Sys",
    "fullname": "Drugs and the U.S. Healthcare System",
    "info": "Being an empowered patient is important when discussing ethics-driven issues within the U.S. healthcare system. This course will expose students to current controversial issues surrounding medications and national healthcare, and help students examine their own role as a participant in this system. Students will learn to draw comparisons between medication use systems around the world and analyze other controversies related to access, choice and quality of healthcare. During this course, students will understand how their choices, ethics and behavior affect societal decisions surrounding the availability of medications in the US and what their rights are as a citizen-participant during the healthcare debate.\n\nThis is a completely online course with weekly due dates. Course information is sent to the U of M email addresses of registered students shortly before, and/or on, the first day of classes each Fall and Spring term. For more information, contact phar4200@umn.edu or 612-624-7976.\n\nprereq: Pharmacy student",
    "prereq": {}
  },
  {
    "uid": "805735",
    "code": "PHAR6203",
    "subject": "PHAR",
    "number": "6203",
    "honors": false,
    "writing": false,
    "name": "Pharmacy Community Outreach",
    "fullname": "College of Pharmacy Community Outreach",
    "info": "Apply knowledge gained in classroom and teaching laboratories to community-based patient care activities.\n\nprereq: Current student pharmacist in College of Pharmacy",
    "prereq": {}
  },
  {
    "uid": "802054",
    "code": "PHAR6205",
    "subject": "PHAR",
    "number": "6205",
    "honors": false,
    "writing": false,
    "name": "Interprofess Teamwork",
    "fullname": "Interprofessional Teamwork for the Health Professions",
    "info": "Interprofessional education that provides an introductory experience to interprofessional teamwork skills with a focus on patient-centered care, especially end of life care.\n\nprereq: Major in [public health or nursing or medicine or dentistry or social work or pharmacy]",
    "prereq": {}
  },
  {
    "uid": "800819",
    "code": "PHAR6208",
    "subject": "PHAR",
    "number": "6208",
    "honors": false,
    "writing": false,
    "name": "Commun Base Immun Deliv",
    "fullname": "Community-based Immunization Delivery",
    "info": "Students will learn about, plan, and implement influenza immunization clinics.",
    "prereq": {}
  },
  {
    "uid": "800820",
    "code": "PHAR6209",
    "subject": "PHAR",
    "number": "6209",
    "honors": false,
    "writing": false,
    "name": "Operation Immunization",
    "fullname": "Operation Immunization",
    "info": "Students partner with local pharmacist to plan/implement influenza vaccination program at pharmacist's practice setting.",
    "prereq": {}
  },
  {
    "uid": "014259",
    "code": "PHAR6211",
    "subject": "PHAR",
    "number": "6211",
    "honors": false,
    "writing": false,
    "name": "OTC Drug Therapy",
    "fullname": "Non-Prescription Drug Therapy: Focus on Patient Self-Care",
    "info": "Over-the-counter medications. Diagnostic/durable medical equipment available in community pharmacies. Use of alternative medications.\n\nprereq: 6112",
    "prereq": {
      "and": [
        "014222"
      ]
    }
  },
  {
    "uid": "014262",
    "code": "PHAR6212",
    "subject": "PHAR",
    "number": "6212",
    "honors": false,
    "writing": false,
    "name": "Dermatology",
    "fullname": "Dermatology",
    "info": "Pathophysiology/pharmacotherapy of dermatologic disorders.\n\nprereq: 3rd yr Pharmacy student",
    "prereq": {}
  },
  {
    "uid": "014263",
    "code": "PHAR6213",
    "subject": "PHAR",
    "number": "6213",
    "honors": false,
    "writing": false,
    "name": "Pharm Practice in Amb Setting",
    "fullname": "Pharmacy Practice in Ambulatory Setting",
    "info": "Pharmaceutical care in an ambulatory (community) setting, and the role of a general pharmacy practitioner.",
    "prereq": {}
  },
  {
    "uid": "789766",
    "code": "PHAR6214",
    "subject": "PHAR",
    "number": "6214",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Clinic",
    "fullname": "Pharmaceutical Care Clinic",
    "info": "Patients make appointments for pharmacy students to provide pharmaceutical care in presence of practitioner. Second/third year students learn \"gold standard\" for patient care. First year students participate in patient assessments as care plan team members. Weekly student case presentations/discussions.",
    "prereq": {}
  },
  {
    "uid": "014257",
    "code": "PHAR6215",
    "subject": "PHAR",
    "number": "6215",
    "honors": false,
    "writing": false,
    "name": "Applied Pharmacokinetics",
    "fullname": "Applied Pharmacokinetics",
    "info": "Applying clinical pharmacokinetics and assay methodologies to patient care. Assessing drug therapy outcomes.\n\nprereq: 6163",
    "prereq": {
      "and": [
        "014219"
      ]
    }
  },
  {
    "uid": "787607",
    "code": "PHAR6216",
    "subject": "PHAR",
    "number": "6216",
    "honors": false,
    "writing": false,
    "name": "Phar Data Analysis Sim SAAM II",
    "fullname": "Pharmacokinetic Data Analysis and Simulation With SAAM II",
    "info": "Introduction to SAAM II: an application for modeling, simulating, and analyzing pharmacokinetic/pharmacodynamic data.",
    "prereq": {}
  },
  {
    "uid": "789873",
    "code": "PHAR6217",
    "subject": "PHAR",
    "number": "6217",
    "honors": false,
    "writing": false,
    "name": "Adv Pharmaceutical Care Clinic",
    "fullname": "Advanced Pharmaceutical Care Clinic",
    "info": "Expanded, direct patient care opportunities. Students conduct comprehensive pharmaceutical care assessments in presence of practitioners. Weekly student case presentations/discussions.\n\nprereq: [6230] or 3rd yr pharmacy student",
    "prereq": {
      "and": [
        "795334"
      ]
    }
  },
  {
    "uid": "790112",
    "code": "PHAR6218",
    "subject": "PHAR",
    "number": "6218",
    "honors": false,
    "writing": false,
    "name": "Interdisciplinary Health Care",
    "fullname": "Essentials of Interdisciplinary Health Care",
    "info": "Work in interdisciplinary health care. Through Web interaction, students simulate work of multidisciplinary teams in solving \"real life\" patient and community-oriented health care dilemmas. Web-based course.",
    "prereq": {}
  },
  {
    "uid": "794308",
    "code": "PHAR6219",
    "subject": "PHAR",
    "number": "6219",
    "honors": false,
    "writing": false,
    "name": "Building a Pharmaceut Practice",
    "fullname": "Building a Pharmaceutical Care Practice",
    "info": "Initiating pharmaceutical care practice. Building personal practice plan.\n\nprereq: 2nd or 3rd year pharmacy student",
    "prereq": {}
  },
  {
    "uid": "787991",
    "code": "PHAR6220",
    "subject": "PHAR",
    "number": "6220",
    "honors": false,
    "writing": false,
    "name": "Pediatric Drug Therapy",
    "fullname": "Pediatric Drug Therapy",
    "info": "Pathophysiology/therapeutics of disease states. Common issues encountered in providing pharmaceutical care to pediatric patients.",
    "prereq": {}
  },
  {
    "uid": "014256",
    "code": "PHAR6222",
    "subject": "PHAR",
    "number": "6222",
    "honors": false,
    "writing": false,
    "name": "Adv Pharmaceutical Compounding",
    "fullname": "Advanced Pharmaceutical Compounding",
    "info": "Expands skills gained in pharmaceutical care lab.\n\nprereq: 2nd or 3rd year pharmacy student",
    "prereq": {}
  },
  {
    "uid": "791204",
    "code": "PHAR6223",
    "subject": "PHAR",
    "number": "6223",
    "honors": false,
    "writing": false,
    "name": "PK Research Seminar",
    "fullname": "Pharmacokinetics Research Seminar",
    "info": "Evaluate literature in pharmacokinetics/pharmacodynamics/drug metabolism.\n\nprereq: 6163 with grade of \"B\" or better",
    "prereq": {
      "or": [
        "014219"
      ]
    }
  },
  {
    "uid": "797921",
    "code": "PHAR6224",
    "subject": "PHAR",
    "number": "6224",
    "honors": false,
    "writing": false,
    "name": "Adv Pharmacogenomics/Prec Med",
    "fullname": "Advanced Pharmacogenomics and Precision Medicine",
    "info": "This course is for individuals wanting advanced knowledge in PGx and an introduction to the broader field of precision medicine. It consists of lectures, homework assignments and class discussions designed to introduce precision medicine as it relates to the impact of genetic variation on health and the advanced practice of pharmacogenomics. Students will learn diagnostic methods to identify germline and somatic mutations, how algorithms and equations are used for predictions and the relationships between genes and environment. How these concepts apply in the clinical settings, forecast health and drug response will be presented. Emerging tools in genetics and pharmacogenomics will be presented. The course will also address clinical implementation and the ethical, legal, and social issues presented by precision medicine and PGx.\n\nPrerequisite: 3rd year PharmD student, graduate student in healthcare or related program, or equivalent experience or instructor consent",
    "prereq": {}
  },
  {
    "uid": "801496",
    "code": "PHAR6225",
    "subject": "PHAR",
    "number": "6225",
    "honors": false,
    "writing": false,
    "name": "Diabetes Experience",
    "fullname": "Diabetes Experience",
    "info": "Diabetes mellitus. Student presentations, hands-on learning.",
    "prereq": {}
  },
  {
    "uid": "807823",
    "code": "PHAR6226",
    "subject": "PHAR",
    "number": "6226",
    "honors": false,
    "writing": false,
    "name": "IPE Diabetes Experience",
    "fullname": "Interprofessional Diabetes Experience",
    "info": "Diabetes mellitus through active, hands-on learning in  interprofessional environment. Participate in week-long experience of living with diabetes. Online learning activities.\n\nprereq: 2nd year or later pharmacy student",
    "prereq": {}
  },
  {
    "uid": "801559",
    "code": "PHAR6227",
    "subject": "PHAR",
    "number": "6227",
    "honors": false,
    "writing": false,
    "name": "Leading Adaptive Change",
    "fullname": "Leading Adaptive Change",
    "info": "Hands-on experience leading change initiative. Create vision for change, plan approach, implement plan, evaluate outcomes. Project focuses on area of pharmacy practice or education.",
    "prereq": {}
  },
  {
    "uid": "795334",
    "code": "PHAR6230",
    "subject": "PHAR",
    "number": "6230",
    "honors": false,
    "writing": false,
    "name": "Ambulatory PC Clinic",
    "fullname": "Ambulatory Pharmaceutical Care Clinic",
    "info": "How to conduct pharmaceutical care assessments, for patients with actual drug-related needs, in a controlled clinic setting.\n\nprereq: Enrolled pharmacy student",
    "prereq": {}
  },
  {
    "uid": "014264",
    "code": "PHAR6231",
    "subject": "PHAR",
    "number": "6231",
    "honors": false,
    "writing": false,
    "name": "Community Pharmacy Management",
    "fullname": "Community Pharmacy Management",
    "info": "Management techniques needed in community pharmacy practice. Emphasizes marketing/service.",
    "prereq": {}
  },
  {
    "uid": "014265",
    "code": "PHAR6232",
    "subject": "PHAR",
    "number": "6232",
    "honors": false,
    "writing": false,
    "name": "Health System Pharmacy Mgmt",
    "fullname": "Health System Pharmacy Management",
    "info": "Management techniques needed in various institutional pharmacy settings. Integrating distributive/clinical components of institutional practice.\n\nprereq: 2nd or 3rd yr pharmacy student",
    "prereq": {}
  },
  {
    "uid": "014696",
    "code": "PHAR6233",
    "subject": "PHAR",
    "number": "6233",
    "honors": false,
    "writing": false,
    "name": "Drug Use Review & Mgmt",
    "fullname": "Drug Use Review and Management",
    "info": "Principles of drug use review in various health care settings. Optimizing quality, minimizing cost. prereq: second or third year PharmD student",
    "prereq": {}
  },
  {
    "uid": "014697",
    "code": "PHAR6234",
    "subject": "PHAR",
    "number": "6234",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Econ & Policy",
    "fullname": "Pharmaceutical Economics and Public Policy",
    "info": "Economic and public policy aspects of the U.S. health care system. Health economic principles and trends applied to the pharmaceutical market.",
    "prereq": {}
  },
  {
    "uid": "795335",
    "code": "PHAR6235",
    "subject": "PHAR",
    "number": "6235",
    "honors": false,
    "writing": false,
    "name": "Pharm Industry: Bus & Policy",
    "fullname": "Pharmaceutical Industry: Business and Policy",
    "info": "Developing, manufacturing, distributing, economically evaluating, purchasing, managing, and ordering pharmaceuticals in health sector. Unique market characteristics, complex regulatory processes, rapid technological change, high expense growth, public policy issues.",
    "prereq": {}
  },
  {
    "uid": "799444",
    "code": "PHAR6236",
    "subject": "PHAR",
    "number": "6236",
    "honors": false,
    "writing": false,
    "name": "Clinical & Pharmacy Mgmt US",
    "fullname": "Clinical/Pharmacy Management in Modern U.S. Health-Care and Regulatory Landscape",
    "info": "This interactive course provides diverse introductory exposure to key non-traditional pharmacy topics within the broader, complex, and evolving US healthcare and managed care landscape. Class entails expertise and critical evaluation of clinical and pharmacy management topics such as utilization & care management, formulary, clinical planning, HEOR, healthcare policy and strategy, clinical account management, specialty pharmacy, Medicare, benefits consulting, pharmaceutical industry, business issues in managed care, and clinical pharmacy leadership. Relevant regulatory topics such as drug development are included as complementary topics, time permitting.",
    "prereq": {}
  },
  {
    "uid": "800821",
    "code": "PHAR6237",
    "subject": "PHAR",
    "number": "6237",
    "honors": false,
    "writing": false,
    "name": "Leading Change in Pharm I",
    "fullname": "Leading Change in Pharmacy I",
    "info": "Mini-curriculum. Leadership development, its relation to advancing the profession of pharmacy.",
    "prereq": {}
  },
  {
    "uid": "801432",
    "code": "PHAR6238",
    "subject": "PHAR",
    "number": "6238",
    "honors": false,
    "writing": false,
    "name": "Leading Change in Pharm II",
    "fullname": "Leading Change in Pharmacy II",
    "info": "Mini-curriculum. Leadership development, its relation to advancing the profession of pharmacy.",
    "prereq": {}
  },
  {
    "uid": "789787",
    "code": "PHAR6240",
    "subject": "PHAR",
    "number": "6240",
    "honors": false,
    "writing": false,
    "name": "Gen Princ of Med Chem",
    "fullname": "General Principles of Medicinal Chemistry",
    "info": "Drug receptors as therapeutic targets, drug-receptor interactions, enzyme inhibitors, drug metabolism/disposition.",
    "prereq": {}
  },
  {
    "uid": "015872",
    "code": "PHAR6241",
    "subject": "PHAR",
    "number": "6241",
    "honors": false,
    "writing": false,
    "name": "Prin Biomolecular Simulation",
    "fullname": "Principles of Biomolecular Simulation",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "015874",
    "code": "PHAR6242",
    "subject": "PHAR",
    "number": "6242",
    "honors": false,
    "writing": false,
    "name": "New Drug Development Process",
    "fullname": "New Drug Development Process",
    "info": "New drug development process in U.S. pharmaceutical industry.",
    "prereq": {}
  },
  {
    "uid": "015875",
    "code": "PHAR6243",
    "subject": "PHAR",
    "number": "6243",
    "honors": false,
    "writing": false,
    "name": "Vistas Med Chem Research",
    "fullname": "Vistas in Medicinal Chemistry Research",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "015876",
    "code": "PHAR6244",
    "subject": "PHAR",
    "number": "6244",
    "honors": false,
    "writing": false,
    "name": "Adv Method Quant Drug Analysis",
    "fullname": "Advanced Methods in Quantitative Drug Analysis",
    "info": "Quantitative methods (HPLC, GC, TLC, and immunoassays) for analysis of drugs and metabolites in biological fluids. Advanced techniques such as capillary electrophoresis, supercritical fluid chromatography, GC-MS, LC-MS, and tandem mass spectrometry. Chromatographic theory and statistical approaches to method validation.",
    "prereq": {}
  },
  {
    "uid": "015889",
    "code": "PHAR6245",
    "subject": "PHAR",
    "number": "6245",
    "honors": false,
    "writing": false,
    "name": "Intro Drug Design",
    "fullname": "Introduction to Drug Design",
    "info": "Basic concepts that govern design/discovery of drugs. Physical, bioorganic, medicinal chemical principles applied to explain rational design, mechanism of action drugs.",
    "prereq": {}
  },
  {
    "uid": "802015",
    "code": "PHAR6249",
    "subject": "PHAR",
    "number": "6249",
    "honors": false,
    "writing": false,
    "name": "Addiction Medicine",
    "fullname": "Addiction Medicine, Substance Abuse, and Chemical Dependency",
    "info": "Addiction, chemical abuse, chemical dependency. How pharmacists can impact those affected.\n\nprereq: 2nd or 3rd yr Pharmacy student",
    "prereq": {}
  },
  {
    "uid": "015460",
    "code": "PHAR6250",
    "subject": "PHAR",
    "number": "6250",
    "honors": false,
    "writing": false,
    "name": "Social & Administrative Ph Sem",
    "fullname": "Social and Administrative Pharmacy Seminar",
    "info": "Current topics in hospital pharmacy. prereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "799329",
    "code": "PHAR6255",
    "subject": "PHAR",
    "number": "6255",
    "honors": false,
    "writing": false,
    "name": "Medicating the Soul",
    "fullname": "Medicating the Soul: Advanced Issues in Psychopharmacology",
    "info": "New developments in study of major psychiatric disorders. Potential of findings for development of novel pharmacological treatments.",
    "prereq": {}
  },
  {
    "uid": "015888",
    "code": "PHAR6260",
    "subject": "PHAR",
    "number": "6260",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutics Seminar",
    "fullname": "Pharmaceutics Seminar",
    "info": "Contemporary topics in pharmaceutics research.prereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "015878",
    "code": "PHAR6261",
    "subject": "PHAR",
    "number": "6261",
    "honors": false,
    "writing": false,
    "name": "Basic Pharmacokinetic Modeling",
    "fullname": "Basic Pharmacokinetic Modeling",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "015886",
    "code": "PHAR6262",
    "subject": "PHAR",
    "number": "6262",
    "honors": false,
    "writing": false,
    "name": "Honors: Basic PK Modeling",
    "fullname": "Honors Course: Basic Pharmacokinetic Modeling",
    "info": "See Phar 6262. An additional project is required.",
    "prereq": {}
  },
  {
    "uid": "820293",
    "code": "PHAR6272",
    "subject": "PHAR",
    "number": "6272",
    "honors": false,
    "writing": false,
    "name": "Antiracist Future Healthcare",
    "fullname": "Shaping an Antiracist Future for Healthcare",
    "info": "The goal of this course is to provide a safe space for study and raising self-awareness of racism and antiracism in the US, sharing and discussion of personal development, how racism plays out in healthcare, and how to combat it through evidence-based allyship. ",
    "prereq": {}
  },
  {
    "uid": "015466",
    "code": "PHAR6293",
    "subject": "PHAR",
    "number": "6293",
    "honors": false,
    "writing": false,
    "name": "Directed Research I",
    "fullname": "Directed Research I",
    "info": "Directed research in pharmacy practice, pharmaceutics, medicinal chemistry, or experimental and clinical pharmacology.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "015467",
    "code": "PHAR6294",
    "subject": "PHAR",
    "number": "6294",
    "honors": false,
    "writing": false,
    "name": "Directed Study I",
    "fullname": "Directed Study I",
    "info": "Directed studies in pharmacy practice, pharmaceutics, medicinal chemistry, experimental or clinical pharmacology.",
    "prereq": {}
  },
  {
    "uid": "808609",
    "code": "PHAR6301",
    "subject": "PHAR",
    "number": "6301",
    "honors": false,
    "writing": false,
    "name": "Veterinary Pharmacotherapy",
    "fullname": "Veterinary Pharmacotherapy",
    "info": "Pharmacotherapy of common medical conditions of small animals.\n\nprereq: 3rd year pharmacy student",
    "prereq": {}
  },
  {
    "uid": "820294",
    "code": "PHAR6310",
    "subject": "PHAR",
    "number": "6310",
    "honors": false,
    "writing": false,
    "name": "Topics in Pharmacy Ethics",
    "fullname": "Topics in Pharmacy Ethics (Pandemics)",
    "info": "Using COVID-19 as a pandemic model, students in this elective course will explore the ethical considerations informing personal, public policy, and biomedical research decisions during a pandemic.  Students will apply ethical principles and selected schools of ethical thought to discuss and debate those decisions.",
    "prereq": {}
  },
  {
    "uid": "807443",
    "code": "PHAR6320",
    "subject": "PHAR",
    "number": "6320",
    "honors": false,
    "writing": false,
    "name": "Fundamentals of Epidemiology",
    "fullname": "Fundamentals of Epidemiology",
    "info": "Evidence-based medicine. Identifying factors that can cause disease. Health patterns in society. Infectious disease outbreaks. Disparities in health outcomes between populations. Methods to evaluate association, risks, and overall health of populations.",
    "prereq": {}
  },
  {
    "uid": "015879",
    "code": "PHAR6393",
    "subject": "PHAR",
    "number": "6393",
    "honors": false,
    "writing": false,
    "name": "Directed Research II",
    "fullname": "Directed Research II",
    "info": "Directed research in pharmacy practice, pharmaceutics, medicinal chemistry, or experimental and clinical pharmacology.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "015881",
    "code": "PHAR6394",
    "subject": "PHAR",
    "number": "6394",
    "honors": false,
    "writing": false,
    "name": "Directed Study II",
    "fullname": "Directed Study II",
    "info": "Directed studies in pharmacy practice, pharmaceutics, medicinal chemistry, and experimental or clinical pharmacology.",
    "prereq": {}
  },
  {
    "uid": "015880",
    "code": "PHAR6493",
    "subject": "PHAR",
    "number": "6493",
    "honors": false,
    "writing": false,
    "name": "Directed Research III",
    "fullname": "Directed Research III",
    "info": "Directed research in pharmacy practice, pharmaceutics, medicinal chemistry, or experimental and clinical pharmacology.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "015882",
    "code": "PHAR6494",
    "subject": "PHAR",
    "number": "6494",
    "honors": false,
    "writing": false,
    "name": "Directed Study III",
    "fullname": "Directed Study III",
    "info": "Directed studies in pharmacy practice, pharmaceutics, medicinal chemistry, and experimental or clinical pharmacology.",
    "prereq": {}
  },
  {
    "uid": "826662",
    "code": "PHAR6511",
    "subject": "PHAR",
    "number": "6511",
    "honors": false,
    "writing": false,
    "name": "Molecules to Medicines 1",
    "fullname": "Molecules to Medicines 1",
    "info": "This course will guide students through learning experiences rooted in the daily work of a pharmacist in order to build knowledge, skills, and attitudes needed for patient-centered, team-based care. Each Area of Science is represented with emphasis on developing and integrating knowledge to evaluate the scientific literature, explain drug action, solve therapeutic problems, and advance population health and systems of care. This module establishes pharmaceutical care as the basis for the patient care responsibility of a pharmacist, relates core concepts from each area of science to the assessment process utilized by the pharmacist and begins to establish the professional identity of a pharmacist. Students will develop knowledge and skills necessary to accomplish pharmacist tasks involving: community pharmacy, nutrition, conception care, pain/tension headaches, and pain from minor injuries.\n\nPrerequisite: First-year PharmD std ",
    "prereq": {}
  },
  {
    "uid": "826663",
    "code": "PHAR6512",
    "subject": "PHAR",
    "number": "6512",
    "honors": false,
    "writing": false,
    "name": "Molecules to Medicines 2",
    "fullname": "Molecules to Medicines 2",
    "info": "This course will guide students through learning experiences rooted in the daily work of a pharmacist in order to build knowledge, skills, and attitudes needed for patient-centered, team-based care. Each Area of Science is represented with emphasis on developing and integrating knowledge to evaluate the scientific literature, explain drug action, solve therapeutic problems, and advance population health and systems of care. This module establishes pharmaceutical care as the basis for the patient care responsibility of a pharmacist, relates core concepts from each area of science to the assessment process utilized by the pharmacist and begins to establish the professional identity of a pharmacist. Students will develop knowledge and skills necessary to accomplish pharmacist tasks involving:  immunizations, over-the-counter fever and cold, and non-sterile compounding.\n\nPrerequisite: First-year PharmD std ",
    "prereq": {}
  },
  {
    "uid": "826664",
    "code": "PHAR6513",
    "subject": "PHAR",
    "number": "6513",
    "honors": false,
    "writing": false,
    "name": "Pro Skills Development 1",
    "fullname": "Professional Skills Development 1",
    "info": "This course provides procedural information (i.e. how to) and repetition/practice related to the professional skills of the pharmacist, including interprofessional communication, evidence-based medicine, compounding, and dispensing. Students will participate in exercises and simulated situations, using a patient-centered approach and a unique process of care. Students will work to build the skills necessary to establish relationships with patients, understand the patient’s medication experience and take responsibility for drug-related outcomes. Repeated practice and feedback supports the development of automaticity and an ingrained approach to care, which is then adapted to each patient. ",
    "prereq": {}
  },
  {
    "uid": "826665",
    "code": "PHAR6514",
    "subject": "PHAR",
    "number": "6514",
    "honors": false,
    "writing": false,
    "name": "3C 1",
    "fullname": "Conversations on Critical Challenges in Pharmacy",
    "info": "3C is designed to immerse students in an engaging, discussion-oriented learning environment aimed at addressing critical challenges in the pharmacy profession. These offerings will allow students to explore real-world issues, participate in a close-knit learning community, develop skills that will enhance success in the pharmacy program, and build autonomy in the exploration of authentic and complex challenges. The small course size will enhance the development of stronger student-faculty and student-student connections as students enter the pharmacy program. Small class sizes in these courses allows for more personalized feedback to students in order to help them build skills in self-reflection and individual competencies.",
    "prereq": {}
  },
  {
    "uid": "826715",
    "code": "PHAR6521",
    "subject": "PHAR",
    "number": "6521",
    "honors": false,
    "writing": false,
    "name": "WTL 3",
    "fullname": "Whole Task Learning 3",
    "info": "This course will combine use of multimodal approaches to empower collaborative learning. Instructors will guide students through learning experiences rooted in the daily work of a pharmacist in order to build knowledge, skills, and attitudes needed for patient-centered, team-based care. Each Area of Science is represented with emphasis on developing and integrating knowledge to evaluate the scientific literature, explain drug action, solve therapeutic problems, and advance population health and systems of care. The whole task learning approach is used and emphasize[s] the importance of real-life tasks as the basis for the design of learning tasks, and thus, for fruitful learning. Within this approach, the instructional design provides learning activities and task practice that will foster students' use of efficient problem-solving strategies in variable and complex settings. Prerequisite: First-year PharmD student, successful completion of Phar 6511 and 6512.",
    "prereq": {}
  },
  {
    "uid": "826714",
    "code": "PHAR6522",
    "subject": "PHAR",
    "number": "6522",
    "honors": false,
    "writing": false,
    "name": "WTL 4",
    "fullname": "Whole Task Learning 4",
    "info": "This course will combine use of multimodal approaches to empower collaborative learning. Instructors will guide students through learning experiences rooted in the daily work of a pharmacist in order to build knowledge, skills, and attitudes needed for patient-centered, team-based care. Each Area of Science is represented with emphasis on developing and integrating knowledge to evaluate the scientific literature, explain drug action, solve therapeutic problems and advance population health and systems of care. The whole task learning approach is used, and emphasize[s] the importance of real-life tasks as the basis for the design of learning tasks, and thus, for fruitful learning. Within this approach, the instructional design provides learning activities and task practice that will foster students' use of efficient problem-solving strategies in variable and complex settings. Prerequisite: First-year PharmD student, successful completion of Phar 6521.",
    "prereq": {}
  },
  {
    "uid": "826713",
    "code": "PHAR6523",
    "subject": "PHAR",
    "number": "6523",
    "honors": false,
    "writing": false,
    "name": "PSD 2",
    "fullname": "Professional Skills Development 2",
    "info": "This course provides procedural information (i.e. how to) and repetition/practice related to the professional skills of the pharmacist, including interprofessional communication, evidence-based medicine, compounding, and dispensing. Students will participate in exercises and simulated situations, using a patient-centered approach and a unique process of care. Students will work to build the skills necessary to establish relationships with patients, understand the patients' medication experience and take responsibility for drug-related outcomes. Repeated practice and feedback supports the development of automaticity and an ingrained approach to care, which is then adapted to each patient. ",
    "prereq": {}
  },
  {
    "uid": "826712",
    "code": "PHAR6524",
    "subject": "PHAR",
    "number": "6524",
    "honors": false,
    "writing": false,
    "name": "3C 2",
    "fullname": "Conversations on Critical Challenges in Pharmacy 2",
    "info": "3C is designed to immerse students in an engaging, discussion-oriented learning environment aimed at addressing critical challenges in the pharmacy profession. These offerings will allow students to explore real-world issues, participate in a close-knit learning community, develop skills that will enhance success in the pharmacy program, and build autonomy in the exploration of authentic and complex challenges. The small course size will enhance the development of stronger student-faculty and student-student connections as students enter the pharmacy program. Small class sizes in these courses allows for more personalized feedback to students in order to help them build skills in self-reflection and individual competencies.",
    "prereq": {}
  },
  {
    "uid": "826942",
    "code": "PHAR6531",
    "subject": "PHAR",
    "number": "6531",
    "honors": false,
    "writing": false,
    "name": "Spectrum of Chronic Care 1",
    "fullname": "Spectrum of Chronic Care 1",
    "info": "This course will guide students through learning experiences rooted in the daily work of a pharmacist in order to build knowledge, skills, and attitudes needed for patient-centered, team-based care. Each Area of Science is represented with emphasis on developing and integrating knowledge to evaluate the scientific literature, explain drug action, solve therapeutic problems, and advance population health and systems of care. This module applies pharmaceutical science and care concepts to patient medication-related problems encountered in chronic conditions, formulating medication therapy problems and care plans taking into account social determinants of health and the economics of medication choices. Students will develop knowledge and skills necessary to accomplish pharmacist tasks involving: cardiovascular conditions, kidney disease, and endocrine conditions.\n\nPrerequisites: Second-year PharmD student, successful completion of Phar 6521, 6522 and 6523.",
    "prereq": {}
  },
  {
    "uid": "826943",
    "code": "PHAR6532",
    "subject": "PHAR",
    "number": "6532",
    "honors": false,
    "writing": false,
    "name": "Spectrum of Chronic Care 2",
    "fullname": "Spectrum of Chronic Care 2",
    "info": "This course will guide students through learning experiences rooted in the daily work of a pharmacist in order to build knowledge, skills, and attitudes needed for patient-centered, team-based care. Each Area of Science is represented with emphasis on developing and integrating knowledge to evaluate the scientific literature, explain drug action, solve therapeutic problems, and advance population health and systems of care. This module applies pharmaceutical science and care concepts to patient medication-related problems encountered in chronic conditions, formulating medication therapy problems and care plans taking into account social determinants of health and the economics of medication choices. Students will develop knowledge and skills necessary to accomplish pharmacist tasks involving: cardiovascular conditions, kidney disease, and endocrine conditions.\n\nPrerequisites: Second-year PharmD student, successful completion of Phar 6521, 6522 and 6523.",
    "prereq": {}
  },
  {
    "uid": "826944",
    "code": "PHAR6533",
    "subject": "PHAR",
    "number": "6533",
    "honors": false,
    "writing": false,
    "name": "Pro Skills Development 3",
    "fullname": "Professional Skills Development 3",
    "info": "This course provides procedural information (i.e. how to) and repetition/practice related to the professional skills of the pharmacist, including interprofessional communication, evidence-based medicine, compounding, and dispensing. Students will participate in exercises and simulated situations, using a patient-centered approach and a unique process of care. Students will work to build the skills necessary to establish relationships with patients, understand the patients' medication experience, and take responsibility for drug-related outcomes. Repeated practice and feedback supports the development of automaticity and an ingrained approach to care, which is then adapted to each patient. \n\nprereq: Second-year PharmD student, successful completion of Phar 6521 and 6522, Phar 6523.",
    "prereq": {
      "and": [
        "826715",
        "826714",
        "826713"
      ]
    }
  },
  {
    "uid": "807451",
    "code": "PHAR6610",
    "subject": "PHAR",
    "number": "6610",
    "honors": false,
    "writing": false,
    "name": "Spiders, Scorps & Snakes",
    "fullname": "Spiders, Scorpions, and Snakes: Clinical Toxinology",
    "info": "Spiders, scorpions, snakes. Delivery of venom. Toxins in venoms/pharmacological actions. Consequences of envenomation/relevance of toxin uses in clinical medicine/biomedical research. Clinical toxinology relating to envenomation.",
    "prereq": {}
  },
  {
    "uid": "807452",
    "code": "PHAR6611",
    "subject": "PHAR",
    "number": "6611",
    "honors": false,
    "writing": false,
    "name": "Obesity: More than a Prescript",
    "fullname": "Obesity: More Than Just a Prescription",
    "info": "Prevention, treatment, and management of obesity from the individual adipose cell to the entire public health community. Etiology, contributing mechanisms, nutrition assessment, medical nutrition therapy. ",
    "prereq": {}
  },
  {
    "uid": "807445",
    "code": "PHAR6612",
    "subject": "PHAR",
    "number": "6612",
    "honors": false,
    "writing": false,
    "name": "Survey of Pediatric Diseases",
    "fullname": "Survey of Pediatric Metabolic, Genetic, and Oncologic Disease",
    "info": "Major metabolic/genetic disorders. Oncologic diseases of childhood. Disease state epidemiology, pertinent background, pharmacotherapy, monitoring, practical application.",
    "prereq": {}
  },
  {
    "uid": "810282",
    "code": "PHAR6700",
    "subject": "PHAR",
    "number": "6700",
    "honors": false,
    "writing": false,
    "name": "Becoming a Pharmacist",
    "fullname": "Becoming a Pharmacist",
    "info": "Introduction to knowledge, skills, attitudes necessary for success in professional pharmacy curriculum/practice of pharmacy.",
    "prereq": {}
  },
  {
    "uid": "816041",
    "code": "PHAR6701",
    "subject": "PHAR",
    "number": "6701",
    "honors": false,
    "writing": false,
    "name": "CoP Community Outreach",
    "fullname": "CoP Community Outreach",
    "info": "Teaching laboratories to community/clinic-based interprofessional patient care model.",
    "prereq": {}
  },
  {
    "uid": "810283",
    "code": "PHAR6702",
    "subject": "PHAR",
    "number": "6702",
    "honors": false,
    "writing": false,
    "name": "Integrated Biochem Sciences",
    "fullname": "Integrated Biochemical Sciences",
    "info": "Foundation in structure/function of medicinals. Familiarize students with structural/physical properties of proteins, nucleic acids, lipids, carbohydrates, ligands/drugs. Basic concepts central to structure-function relationships of therapeutics.\n\nprereq: Successful completion of Becoming a Pharmacist (BaP)",
    "prereq": {}
  },
  {
    "uid": "810284",
    "code": "PHAR6704",
    "subject": "PHAR",
    "number": "6704",
    "honors": false,
    "writing": false,
    "name": "Foundations of SAPh",
    "fullname": "Foundations of Social and Administrative Pharmacy",
    "info": "Foundation for how one should think about rational use of drugs in system of care. Content/skills learned will be applied in subsequent courses continuing through 4th year of curriculum. Module focused on Drug Literature Evaluation(DLE).\n\nprereq: Successful completion of Becoming a Pharmacist (BaP)",
    "prereq": {}
  },
  {
    "uid": "810285",
    "code": "PHAR6706",
    "subject": "PHAR",
    "number": "6706",
    "honors": false,
    "writing": false,
    "name": "Foundations of Pharm Care",
    "fullname": "Foundations of Pharmaceutical Care",
    "info": "How pharmacist should think about rational use of drugs in caring for patients. Content/skills learned will be applied in/provide framework for all subsequent courses continuing through 4th year of curriculum/lifelong into practice.\n\nprereq: Successful completion of Becoming a Pharmacist (BaP)",
    "prereq": {}
  },
  {
    "uid": "810286",
    "code": "PHAR6708",
    "subject": "PHAR",
    "number": "6708",
    "honors": false,
    "writing": false,
    "name": "Drug Delivery I",
    "fullname": "Drug Delivery I",
    "info": "Fundamental physicochemical principles applicable to dosage forms. Foundational scientific principles (continued in DDII) illuminated with examples of solution drug dosage forms. Concepts relevant to current/future dosage forms.\n\nprereq: Successful completion of Becoming a Pharmacist (BaP)",
    "prereq": {}
  },
  {
    "uid": "810287",
    "code": "PHAR6710",
    "subject": "PHAR",
    "number": "6710",
    "honors": false,
    "writing": false,
    "name": "Pharm Care Skills Lab I",
    "fullname": "Pharmaceutical Care Skills Lab I",
    "info": "Introduction to profession/building skills necessary to become competent, caring pharmaceutical care practitioner. Course consists of laboratory section and lecture.\n\nprereq: Successful completion of Becoming a Pharmacist (BaP)",
    "prereq": {}
  },
  {
    "uid": "810752",
    "code": "PHAR6715",
    "subject": "PHAR",
    "number": "6715",
    "honors": false,
    "writing": false,
    "name": "Career and Pro Fdn I",
    "fullname": "Career and Professional Foundations I",
    "info": "Knowledge acquisition. Career/professional development.\n\nprereq: Successful completion of Becoming a Pharmacist",
    "prereq": {}
  },
  {
    "uid": "810612",
    "code": "PHAR6716",
    "subject": "PHAR",
    "number": "6716",
    "honors": false,
    "writing": false,
    "name": "Applied Pharmaceutical Care",
    "fullname": "Applied Pharmaceutical Care",
    "info": "Common medical conditions/medications students are likely to encounter during their introductory pharmacy practice experiences (IPPEs).\n\nprereq: Successful completion of Becoming a Pharmacist",
    "prereq": {}
  },
  {
    "uid": "810613",
    "code": "PHAR6718",
    "subject": "PHAR",
    "number": "6718",
    "honors": false,
    "writing": false,
    "name": "Drug Delivery II",
    "fullname": "Drug Delivery II",
    "info": "Builds on Drug Delivery I. Dosage forms, mostly solid/ dispersed. Chemical kinetics, chemical stability, buffer systems, polymers/proteins, rheology. Physiochemical principles relevant to design, preparation, storage, use, efficacy, evaluation of pharmaceutical dosage forms.\n\nprereq: Successful completion of Drug Delivery I",
    "prereq": {}
  },
  {
    "uid": "810614",
    "code": "PHAR6720",
    "subject": "PHAR",
    "number": "6720",
    "honors": false,
    "writing": false,
    "name": "Pharm Care Skills Lab II",
    "fullname": "Pharmaceutical Care Skills Lab II",
    "info": "Part of pharmaceutical care learning center curriculum spanning six semesters. Introduction to profession. Begin building skills necessary to become competent/caring pharmaceutical care practitioner.\n\nprereq: Successful completion of Pharmaceutical Care Skills Lab I",
    "prereq": {}
  },
  {
    "uid": "810615",
    "code": "PHAR6722",
    "subject": "PHAR",
    "number": "6722",
    "honors": false,
    "writing": false,
    "name": "Principles of Med Chem",
    "fullname": "Principles of Medicinal Chemistry",
    "info": "Discipline of medicinal chemistry. Principles of drug design/drug metabolism.\n\nprereq: Successful completion of Integrated Biochemical Sciences",
    "prereq": {}
  },
  {
    "uid": "810619",
    "code": "PHAR6724",
    "subject": "PHAR",
    "number": "6724",
    "honors": false,
    "writing": false,
    "name": "Immune Sys & Infect Disease",
    "fullname": "Immune System and Infectious Disease",
    "info": "Immunological, epidemiological, pathogenic basis of viral, bacterial, protozoal, fungal, helminthic disease.  Biological composition of vaccines/immunologic response to live attenuated pathogens/microbial extracts. Chemical, cellular, biological principles of immune system.\n\nprereq: Successful completion of Integrated Biochemical Sciences",
    "prereq": {}
  },
  {
    "uid": "810624",
    "code": "PHAR6726",
    "subject": "PHAR",
    "number": "6726",
    "honors": false,
    "writing": false,
    "name": "Principles of Pharmacology",
    "fullname": "Principles of Pharmacology",
    "info": "Builds on information in basic science courses offered in first semester of PharmD program. Foundational content necessary for comprehension/application of all subsequent pharmacotherapy modules that require application of pharmacological concepts/knowledge.\n\nprereq: Successful completion of Foundations of SAPh",
    "prereq": {}
  },
  {
    "uid": "810625",
    "code": "PHAR6728",
    "subject": "PHAR",
    "number": "6728",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Calculations",
    "fullname": "Pharmaceutical Calculations",
    "info": "Accurately performing pharmaceutical calculations is a critical component of patient care in every pharmacy practice environment. Calculations contribute just as much to good patient outcomes as the newest methods and guidelines for diagnosis, treatment, and prevention. The challenge of pharmacy calculations lies not in the cutting edge of science or their mathematical complexity, but in the need for consistent accuracy to prevent patient harm and possible fatality. To obtain this level of accuracy, an understanding of methods and deliberate, undivided attention to detail is required. Students must understand and master the basic concepts of pharmaceutical calculations with organization, consistency, and accuracy in order to provide optimal care to their future patients every day. Students should be committed to becoming a competent generalist practitioner who assumes responsibility and is willing to be held accountable for their patients\u0092 medication outcomes.\n\nprereq: enrolled in the Pharm.D. program, successful completion of Phar 6700",
    "prereq": {
      "and": [
        "810282"
      ]
    }
  },
  {
    "uid": "811915",
    "code": "PHAR6730",
    "subject": "PHAR",
    "number": "6730",
    "honors": false,
    "writing": false,
    "name": "Career & Prof Foundations II",
    "fullname": "Career and Professional Foundations II",
    "info": "Emphasis on reinforcing, supporting, developing, assessing competencies/skills exercised in multiple courses. Includes work in career/professional development.\n\nprereq: PDconcurrent registration is required (or allowed) in A I",
    "prereq": {}
  },
  {
    "uid": "811312",
    "code": "PHAR6732",
    "subject": "PHAR",
    "number": "6732",
    "honors": false,
    "writing": false,
    "name": "Med Chem and Pharmacology",
    "fullname": "Medicinal Chemistry and Pharmacology of Cardiovascular Agents",
    "info": "Builds upon foundational concepts learned in Principles of Pharmacology/Principles of Medicinal Chemistry, applies them to drug classes primarily used for treatment of cardiovascular diseases.\n\nprereq: Principles of Pharmacology, Principles of Medicinal Chemistry",
    "prereq": {}
  },
  {
    "uid": "811313",
    "code": "PHAR6734",
    "subject": "PHAR",
    "number": "6734",
    "honors": false,
    "writing": false,
    "name": "Cellular Metabolism/Nutrition",
    "fullname": "Cellular Metabolism and Nutrition",
    "info": "Basic principles of intermediary metabolism/how such processes are used by body. Basic nutrients used by body/their roles as OTC products in community pharmacies.\n\nprereq: Integrated Biochemical Sciences",
    "prereq": {}
  },
  {
    "uid": "811314",
    "code": "PHAR6736",
    "subject": "PHAR",
    "number": "6736",
    "honors": false,
    "writing": false,
    "name": "Cardiovascular Pharmacotherapy",
    "fullname": "Cardiovascular Pharmacotherapy",
    "info": "Key topics critical to preparing generalist practitioner to have input on optimizing care of patients with common conditions such as hypertension, dyslipidemia, ischemic heart disease (angina, acute myocardial infarction) supraventricular arrythmias (atrial fibrillation), chronic heart failure.\n\nprereq: All PharmD year one coursework, Physiology Competency Exam",
    "prereq": {}
  },
  {
    "uid": "811315",
    "code": "PHAR6738",
    "subject": "PHAR",
    "number": "6738",
    "honors": false,
    "writing": false,
    "name": "Pharmacokinetics",
    "fullname": "Pharmacokinetics",
    "info": "Designed to give generalist practitioners fundamental skills to solve pharmacokinetically-based problems in patient care, particularly in regards to dosage regimen design/adjustment.  Builds on concepts learned in Drug Delivery I/II. Follows path of drug molecule from incorporation into dosage form to release/disposition in biological system.\n\nprereq: Drug Delivery I concurrent registration is required (or allowed) in  II",
    "prereq": {}
  },
  {
    "uid": "811302",
    "code": "PHAR6740",
    "subject": "PHAR",
    "number": "6740",
    "honors": false,
    "writing": false,
    "name": "Pharm Care Skills Lab III",
    "fullname": "Pharmaceutical Care Skills Lab III",
    "info": "Designed for second year pharmacy students to continue to build skills necessary to become pharmaceutical care practitioner. Laboratory section/discussion.\n\nprereq: Pharmaceutical Care Skills Lab I concurrent registration is required (or allowed) in  II, Applied Pharmaceutical Care",
    "prereq": {}
  },
  {
    "uid": "811316",
    "code": "PHAR6742",
    "subject": "PHAR",
    "number": "6742",
    "honors": false,
    "writing": false,
    "name": "Problem Analysis I",
    "fullname": "Evidence based problem analysis I",
    "info": "Practice skills necessary to research, prepare, present scholarly paper/seminar. Builds on Biostatistics/Drug Literature Evaluation material from \"Becoming a Pharmacist, Foundations of Social/Administrative Pharmacy, Foundations of Pharmaceutical Care.\"\n\nprereq: Becoming a Pharmacist, Foundations of Social and Administrative Pharmacy, Foundations of Pharmaceutical Care",
    "prereq": {}
  },
  {
    "uid": "813313",
    "code": "PHAR6745",
    "subject": "PHAR",
    "number": "6745",
    "honors": false,
    "writing": false,
    "name": "Career and Pro Fdn III",
    "fullname": "Career and Professional Foundations III",
    "info": "For the second year of the Professional Development and Assessment Sequence, the emphasis is on knowledge comprehension. Class includes work in career and professional development.\n\nprereq: Successful completion of Professional Development and Assessment I concurrent registration is required (or allowed) in  II",
    "prereq": {}
  },
  {
    "uid": "812717",
    "code": "PHAR6748",
    "subject": "PHAR",
    "number": "6748",
    "honors": false,
    "writing": false,
    "name": "Biopharmaceutics",
    "fullname": "Biopharmaceutics",
    "info": "Biopharmaceutics is the final course in a four-course sequence that comprises the curriculum in pharmaceutics. Biopharmaceutics integrates core knowledge obtained in the previous three courses (Drug Delivery I & II and Pharmacokinetics), and also relies on general knowledge in anatomy, physiology, mathematics, general chemistry, and pharmacology.\n\nprereq: Courses and/or content: Calculus, thermodynamics, viscosity, sedimentation, diffusion, chemical kinetics, novice to developing level understanding of dosage forms, developing understanding of pharmacokinetics/ pharmacodynamics, physiology, general chemistry, physics, biochemistry, enzyme kinetics, and metabolic pathways. It is strongly recommended that students review course materials in Drug Delivery I concurrent registration is required (or allowed) in  II and Pharmacokinetics as well as anatomy, physiology, calculus, and physics with consideration of the application of the concepts to the delivery of drugs to patients.",
    "prereq": {}
  },
  {
    "uid": "812718",
    "code": "PHAR6750",
    "subject": "PHAR",
    "number": "6750",
    "honors": false,
    "writing": false,
    "name": "Pharm Care Skills Lab IV",
    "fullname": "Pharmaceutical Care Skills Lab IV",
    "info": "This course is designed for second-year pharmacy students to continue to build the skills necessary to become a competent, caring pharmaceutical care practitioner. \n\nprereq: Students must have successfully completed Pharm Care Skills 1, 2, and 3, and Applied Pharmaceutical Care. Students must be concomitantly registered in all required PD2 courses in order to have the content required to complete integrated activities, e.g., students must be enrolled in Diabetes in order to successfully complete the patient care sequence utilizing diabetes content in this course. Exceptions may be made on a case by case basis.",
    "prereq": {}
  },
  {
    "uid": "812719",
    "code": "PHAR6752",
    "subject": "PHAR",
    "number": "6752",
    "honors": false,
    "writing": false,
    "name": "Integrated Endocrinology",
    "fullname": "Integrated Endocrinology",
    "info": "This course will integrate all pertinent endocrinology topics (excluding diabetes) into one course. Specifically, the pathophysiology, medicinal chemistry, pharmacology and the therapeutic application of the this knowledge will be covered in an integrated approach via specific modules. All major endocrine pathways will be taught including:\nhypothalamic/pituitary, steroids, female sex hormones, hormonal contraception, menopause/hormone therapy, bone health, male gonadal hormones, drugs in pregnancy and lactation, sexual dysfunction and thyroid hormone.\n\nprereq: Students will need to have successfully completed: \n- Cellular Metabolism/Nutrition, \n- Cardiovascular Pharmacotherapy \n- Pharmaceutical Care Skills Labs 1-3. \n\nStudents should be concurrently enrolled in Kidney, Fluids, and Electrolytes, and Diabetes and Metabolic Syndrome.\n\nStudents should be able to describe the function of the overall endocrine systems and the multiple roles of hormones in the body.",
    "prereq": {}
  },
  {
    "uid": "812720",
    "code": "PHAR6754",
    "subject": "PHAR",
    "number": "6754",
    "honors": false,
    "writing": false,
    "name": "Diabetes & Metabolic Syndrome",
    "fullname": "Diabetes and Metabolic Syndrome",
    "info": "In this course, students will learn the principles of the pathophysiology of diabetes, pharmacology of the antidiabetic agents, evaluate key research on diabetes, interpret and apply clinical guidelines for diabetes, assess socioeconomic aspects of diabetes, and apply this information to patient cases. Special populations with diabetes will also be discussed including pediatric, gestational, and geriatric diabetes.\n\nStudents will also learn the the pathophysiology of metabolic syndrome, pharmacology of obesity treatments, nonpharmacological and pharmacological ways to treat metabolic syndrome, including the implications of bariatric surgery on use of pharmacologic agents in general, and apply this information to patient cases.\n\nprereq: Students will need to have successfully completed: Molecular Metabolism/Nutrition, Cardiovascular Pharmacotherapy concurrent registration is required (or allowed) in  Pharmaceutical Care Skills Lab 1-3.\n\nStudents should be able to describe the physiology of insulin action, incretin hormones, amylin, and the fasting and fed states. \n\nStudents should be able to describe how insulin is designed and manufactured.\n\nStudents should be able to describe the following biochemistry topics: carbohydrate metabolism and lipid metabolism, and protein.\n\nStudents should be able to assess a patient and determine most appropriate pharmacotherapy treatment options for a patient's hypertension and dyslipidemia treatments, including ability to describe, interpret and apply evidence-based guidelines.\n\nStudents should be able to describe how nutrition impacts energy production, utilization and storage, and obesity.\n\nStudents need to be able to describe the caloric content of carbohydrates, proteins and lipids and be able to apply that knowledge to reading food labels and evaluating a patient's nutritional status.",
    "prereq": {}
  },
  {
    "uid": "812721",
    "code": "PHAR6756",
    "subject": "PHAR",
    "number": "6756",
    "honors": false,
    "writing": false,
    "name": "Kidney, Fluid, & Electrolytes",
    "fullname": "Kidney, Fluid, and Electrolytes",
    "info": "About 75% of new cases of chronic kidney disease (CKD) are due to diabetes and hypertension. Patients with CKD often experience congestive heart failure and anemia. In addition, the kidney is the main excretory route for many drugs. Thus, this course offers an opportunity to integrate material learned in previous and concurrent courses. \n\nIn this course, students will learn key concepts and develop specific skills in the management of common fluid and electrolyte and single acid/base disorders and in prevention and management of chronic kidney disease and associated conditions.\n\nprereq: Students must have completed the following courses successfully: \n- Applied Pharmaceutical Care,\n- Foundations of Social and Administrative Pharmacy,\n- Medicinal Chemistry and Pharmacology of Cardiovascular Agents,\n- Pharmacokinetics,\n- Cardiovascular Pharmacotherapy,\n- Cellular Metabolism and Nutrition\n\nSee the course syllabus for more detailed prerequisites.",
    "prereq": {}
  },
  {
    "uid": "812722",
    "code": "PHAR6758",
    "subject": "PHAR",
    "number": "6758",
    "honors": false,
    "writing": false,
    "name": "Pulmonary Pharmacotherapy",
    "fullname": "Pulmonary Pharmacotherapy",
    "info": "This course will provide students with the requisite pathophysiology and pharmacotherapeutic knowledge to care for patients with common pulmonary diseases. It will integrate concepts of pediatric and geriatric pulmonary dosing and infectious diseases.\n\nprereq: Students must have completed the following courses successfully: \n- Applied Pharmaceutical Care\n- Foundations of Social and Administrative Pharmacy\n- Medicinal Chemistry and Pharmacology of Cardiovascular Agents\n- Pharmacokinetics,\n- Cardiovascular Pharmacotherapy,\n- Cellular Metabolism and Nutrition\n\nSee the course syllabus for more detailed prerequisites.",
    "prereq": {}
  },
  {
    "uid": "814656",
    "code": "PHAR6760",
    "subject": "PHAR",
    "number": "6760",
    "honors": false,
    "writing": false,
    "name": "Career & Prof Foundations IV",
    "fullname": "Career and Professional Foundations IV",
    "info": "For the third year of the Professional Development and Assessment sequence, the emphasis will be on deeper exploration into career options, as well as the tools needed for contemporary pharmacy practice. Students will have the opportunity to engage with their peers as well as practicing pharmacists as they learn about the expectations of contemporary professional practice.\n\nprereq: Phar 6715, 6730, 6745",
    "prereq": {
      "and": [
        "810752",
        "811915",
        "813313"
      ]
    }
  },
  {
    "uid": "813745",
    "code": "PHAR6762",
    "subject": "PHAR",
    "number": "6762",
    "honors": false,
    "writing": false,
    "name": "Med Chem & Neuropharmacology",
    "fullname": "Medicinal Chemistry and Neuropharmacology",
    "info": "Neuropharmacology and Medicinal Chemistry of Neurological Treatments builds upon the foundational concepts learned in Principles of Pharmacology and Principles of Medicinal Chemistry, and applies them to drug classes primarily used for the treatment of central nervous system (CNS) and peripheral nervous system (PNS) dysfunction.\n\nprereq: Phar 6722, 6726, and 6732",
    "prereq": {
      "and": [
        "810615",
        "810624",
        "811312"
      ]
    }
  },
  {
    "uid": "813746",
    "code": "PHAR6766",
    "subject": "PHAR",
    "number": "6766",
    "honors": false,
    "writing": false,
    "name": "Biotechnology",
    "fullname": "Biotechnology-Derived Drugs",
    "info": "Biotechnology-derived drugs are where the future is, and pharmacy students need to understand how they are made, how they act and what special considerations are involved. This course will provide the foundational knowledge necessary to dispense current biotechnology-derived drugs and provide the basis for self-education needed to understand the biotechnology-derived drugs of the future.\n\nprereq: Phar 6702, 6722, 6726, 6724, 6734, and 6752",
    "prereq": {
      "and": [
        "810283",
        "810615",
        "810624",
        "810619",
        "811313",
        "812719"
      ]
    }
  },
  {
    "uid": "814275",
    "code": "PHAR6768",
    "subject": "PHAR",
    "number": "6768",
    "honors": false,
    "writing": false,
    "name": "Infectious Diseases",
    "fullname": "Infectious Diseases",
    "info": "Course will focus on the pharmacology, pharmacokinetics, and pharmacodynamics of antibiotics and the pharmacotherapy of infectious diseases. \n\nprereq: Phar 6702, 6706, 6718, 6724, 6736, 6738, 6748, 6756, 6758",
    "prereq": {
      "and": [
        "810283",
        "810285",
        "810613",
        "810619",
        "811314",
        "811315",
        "812717",
        "812721",
        "812722"
      ]
    }
  },
  {
    "uid": "814068",
    "code": "PHAR6770",
    "subject": "PHAR",
    "number": "6770",
    "honors": false,
    "writing": false,
    "name": "Pharm Care Skills Lab V",
    "fullname": "Pharmaceutical Care Skills Lab V",
    "info": "This course is designed for third year pharmacy students to continue to build the skills necessary to become a competent, caring pharmaceutical care practitioner. The course consists of two components: a laboratory section and a discussion.\n\nprereq: Pharmaceutical Care Skills Labs I, II, III, and IV, and Applied Pharmaceutical Care",
    "prereq": {}
  },
  {
    "uid": "813747",
    "code": "PHAR6772",
    "subject": "PHAR",
    "number": "6772",
    "honors": false,
    "writing": false,
    "name": "Topics: P'therapy / P'genomics",
    "fullname": "Topics in Pharmacotherapy and Pharmacogenomics",
    "info": "Course provides students with the pharmacologic, pharmacotherapeutic, and pharmaceutics knowledge they need to understand therapies for dermatologic, gastrointestinal, and genitourinary conditions, and arthritis and gout. Prepares future generalist pharmacists to be knowledgeable about common conditions of aforementioned topics and appropriate pharmacotherapy options for treatment. It will focus primarily on pharmacotherapy, but will have an overview of pathophysiology of these conditions. Students will be expected to apply knowledge to design and monitor a patient-centered pharmaceutical care plan and to appropriately educate patients regarding proper use of medications covered in the course. This course prepares students to identify clinically relevant information in the modern healthcare setting, learn it at a depth beyond memorization, and apply and interpret its application to relevant patient case vignettes.\n\nprereq: All required PharmD year two coursework",
    "prereq": {}
  },
  {
    "uid": "813748",
    "code": "PHAR6774",
    "subject": "PHAR",
    "number": "6774",
    "honors": false,
    "writing": false,
    "name": "Neuro/Psych Disorders",
    "fullname": "Pharmacotherapy of Neurologic and Psychiatric Disorders",
    "info": "Course prepares future generalist pharmacists to be knowledgeable about common psychiatric and neurologic disorders and about the appropriate use of medications used to treat them. Course primarily focuses on the pharmacotherapies used to treat psychiatric and neurologic disorders. This course will additionally provide an overview of the presentation and pathophysiology of specific psychiatric and neurologic disorders, an overview of the differences between the practices of psychiatry and neurology and a discussion of stigmas associated with mental illness. An overview of non-pharmacologic therapies will be introduced to the extent relevant to the generalist pharmacists. At the conclusion of the course students will be expected to apply knowledge learned in the course in order to design and monitor a pharmacotherapeutic plan for specific patients and to appropriately counsel patients regarding proper use of the various psychiatric and neurologic medications covered in the course.\n\nprereq: All required PharmD year two coursework",
    "prereq": {}
  },
  {
    "uid": "804734",
    "code": "PHAR6778",
    "subject": "PHAR",
    "number": "6778",
    "honors": false,
    "writing": false,
    "name": "Pharmacy Law",
    "fullname": "Pharmacy Law",
    "info": "The course covers both federal and state laws that impact and regulate the practice of pharmacy including federal regulation of medications, regulation of controlled substances, and the Minnesota Pharmacy Practice Act. The course will be offered entirely online.",
    "prereq": {}
  },
  {
    "uid": "814277",
    "code": "PHAR6780",
    "subject": "PHAR",
    "number": "6780",
    "honors": false,
    "writing": false,
    "name": "Pharmacy Outcomes",
    "fullname": "Pharmacy Outcomes",
    "info": "Course facilitates integration of knowledge of basic sciences, pharmacotherapy, pharmacy practice management, pharmaceutical care, written communication, literature evaluation, drug information retrieval, law and ethics, and pharmacoeconomics to manage patients with multiple medical conditions. This course is where students are required to perform and demonstrate knowledge during curricular assessments. \n\nprereq: Phar 6700, 6702, 6704, 6706, 6708, 6710, 7310, 6716, 6718, 6720, 6722, 6724, 6726, 7325, 6732, 6734, 6736, 6738, 6740, 6742, 7330, 6748, 6750, 6752, 6754, 6756, 6758, 7340, 7345, 6770, 6774, 6768, 6762",
    "prereq": {
      "and": [
        "810282",
        "810283",
        "810284",
        "810285",
        "810286",
        "810287",
        "810288",
        "810612",
        "810613",
        "810614",
        "810615",
        "810619",
        "810624",
        "813143",
        "811312",
        "811313",
        "811314",
        "811315",
        "811302",
        "811316",
        "812449",
        "812717",
        "812718",
        "812719",
        "812720",
        "812721",
        "812722",
        "813144",
        "813142",
        "814068",
        "813748",
        "814275",
        "813745"
      ]
    }
  },
  {
    "uid": "814284",
    "code": "PHAR6782",
    "subject": "PHAR",
    "number": "6782",
    "honors": false,
    "writing": false,
    "name": "Evidence Based Practice",
    "fullname": "Evidence Based Practice",
    "info": "The Evidence Based Practice has been designed to facilitate acquisition and application of evidence based practice knowledge and skills. Evidence based practice involves the use fo the best available evidence, clinical expertise and patients' values to make complex pharmacy related decisions. \n\nprereq: Phar 6700, 6704, 6706, 6742",
    "prereq": {
      "and": [
        "810282",
        "810284",
        "810285",
        "811316"
      ]
    }
  },
  {
    "uid": "814367",
    "code": "PHAR6784",
    "subject": "PHAR",
    "number": "6784",
    "honors": false,
    "writing": false,
    "name": "Integrated Oncology",
    "fullname": "Integrated Oncology",
    "info": "This course focuses on the etiology and molecular biology of tumorigenesis, medicinal agents, and pharmacology of anticancer agents, treatment of the most common cancers, supportive care of the patient with cancer, and social and ethical considerations of the treatment of the patient with cancer including end of life directives. prereq: PD3 in good academic standing, students will find it helpful to review the following topic areas: Principles of Biochemistry (Lipids [Structure/Function], Proteins [Folding/Conformation]), Cellular Physiology Molecular Biology, Genetics (Cell Biology [signal transduction, DNA replication, transcription, protein translation, cell cycle, apoptosis], Immunology, Tumorigenesis, Angiogenesis, Genetics principles, Anatomy/Physiology [GI tract, pulmonary, hormone and feedback regulation])",
    "prereq": {}
  },
  {
    "uid": "814705",
    "code": "PHAR6786",
    "subject": "PHAR",
    "number": "6786",
    "honors": false,
    "writing": false,
    "name": "Acute Patient Care",
    "fullname": "Acute Patient Care Pharmacotherapy",
    "info": "Course prepares students to approach patients with multiple medical problems and the dynamic changes that patients can experience in the acute care settings. Students will then learn about the pharmacotherapy approach related to managing those disease states/conditions. Students will be expected to develop therapeutic plans for patient case scenarios at the onset of a hospital admission as well as additional problem that could present over the course of a hospitalization or result in readmission. Additional scenario problems will be incorporated into the cases as the course progresses and the cases and problems will become more complex. By the end of the course, students will have had an opportunity to address multiple medical problems and make pharmacotherapy decisions and will be evaluated based on those decisions. Knowledge gained in this course will prepare students for the APPE acute care/institutional rotation.\n\nprereq: successful completion of all 1st year, 2nd year, and fall 3rd year coursework",
    "prereq": {}
  },
  {
    "uid": "820181",
    "code": "PHAR6797",
    "subject": "PHAR",
    "number": "6797",
    "honors": false,
    "writing": false,
    "name": "APPLE 1",
    "fullname": "Advanced Pharmacy Practice Learning Experience 1",
    "info": "This course is the first in a series of 3 courses (summer, fall, and spring) designed to align with and augment learning occurring on Advanced Pharmacy Practice Experiences (APPEs). In the first course (summer semester), students will complete the top 200 drug modules and drug administration CORE Readiness modules to solidify learning from year 1-3 of the curriculum. \n\nIn addition to these requirements, students will complete additional activities specific to their current rotation placement. For example, students completing their ambulatory care rotation will participate in topic discussions specific to ambulatory care practice with faculty. \n\nAdditionally, various optional learning activities will be made available to students to complement their rotations based on students’ personal interests or based on direction from their preceptor.  ",
    "prereq": {}
  },
  {
    "uid": "820295",
    "code": "PHAR6798",
    "subject": "PHAR",
    "number": "6798",
    "honors": false,
    "writing": false,
    "name": "Adv Phar Pract Learning Exp 2",
    "fullname": "Advanced Pharmacy Practice Learning Experience (APPLE) 2",
    "info": "This course is the second in a series of 3 courses (summer, fall, and spring) designed to align with and augment learning occurring on Advanced Pharmacy Practice Experiences (APPEs). In the first course (summer semester), students will complete the top 200 drug modules and drug administration CORE Readiness modules to solidify learning from year 1-3 of the curriculum.  In this second course (fall semester), students will focus on preparing for residency/job searching and health inequities.\n\nIn addition to these requirements, students will complete additional activities specific to their current rotation placement. For example, students completing their ambulatory care rotation will participate in a journal club specific to ambulatory care practice. \n\nAdditionally, various optional learning activities will be made available to students to complement their rotations based on students’ personal interests or based on direction from their preceptors.",
    "prereq": {}
  },
  {
    "uid": "816981",
    "code": "PHAR6799",
    "subject": "PHAR",
    "number": "6799",
    "honors": false,
    "writing": false,
    "name": "APPLE",
    "fullname": "Applied Pharmacy Practice Learning Experiences",
    "info": "This course is designed to align with and augment learning occurring on Advanced Pharmacy Practice Experiences (APPEs). This course focuses on preparing students for the beginning of their career as a pharmacist. Students will design a study plan for licensure, review law content, and reflect on their journey in pharmacy education. In addition to these requirements, students will complete additional activities specific to their current rotation placement. For example, students completing their ambulatory care rotation will participate in a journal club specific to ambulatory care practice. Additionally, various optional learning activities will be made available to students to complement their rotations based on students' personal interests or based on direction from their preceptors.",
    "prereq": {}
  },
  {
    "uid": "794000",
    "code": "PHAR6800",
    "subject": "PHAR",
    "number": "6800",
    "honors": false,
    "writing": false,
    "name": "Rehabilitation Pharmacotherapy",
    "fullname": "Rehabilitation Pharmacotherapy",
    "info": "The goal of this course is to equip physical therapy students with a general understanding of the impact of medications on rehabilitation and how rehabilitation affects medication use. Students will practice applying content through patient cases and writing a patient care plan.\n\nThis is a completely online course with weekly due dates offered each Summer term. For more information, contact phar6800@umn.edu or 612-624-7976.",
    "prereq": {}
  },
  {
    "uid": "817280",
    "code": "PHAR6900",
    "subject": "PHAR",
    "number": "6900",
    "honors": false,
    "writing": false,
    "name": "Intern for Pharmacy Employment",
    "fullname": "Curricular Studies for Internship and Pharmacy Employment",
    "info": "This course is designed for students pursuing an internship or pharmacy-related employment to receive course credit (typically for visa requirements). The course does NOT count toward elective credit requirements. If applicable, students must remain visa compliant and are solely responsible for doing so. The vast majority of the course is the hours a student spends at their internship/employment site. A written assignment is required at the end of the course. Students will meet once during the semester, which is arranged with instructors. ",
    "prereq": {}
  },
  {
    "uid": "815500",
    "code": "PHAR6901",
    "subject": "PHAR",
    "number": "6901",
    "honors": false,
    "writing": false,
    "name": "Pharmaceutical Care Experience",
    "fullname": "Pharmaceutical Care Experience",
    "info": "The Pharmaceutical Care Experience builds on Foundations of Pharmaceutical Care and provides an early opportunity to practice pharmaceutical care in a primary care clinic setting. This elective will allow students to assess each patient\u0092s unique medication experience and drug-related needs through patient interviews. Students will use this information to develop a patient-centered care plan under the guidance of a practitioner mentor. The pharmaceutical care process will be applied and assessed in all future coursework, including, but not limited to, pharmacotherapy patient case work-ups, applied learning in the Pharmaceutical Care Learning Center, and during experiential education experiences.",
    "prereq": {}
  },
  {
    "uid": "817112",
    "code": "PHAR6902",
    "subject": "PHAR",
    "number": "6902",
    "honors": false,
    "writing": false,
    "name": "Integrative Mental Hlth Psych",
    "fullname": "Foundations for Integrative Mental Health and Psychiatric Practice",
    "info": "This course is design to allow students to examine concepts, theories, and paradigms foundational to psychiatric/mental health practice and interprofessional integrative mental health care. Students develop clinical interviewing methods that elicit a client\u0092s health narrative and facilitate the therapeutic relationship. Students also practice techniques that promote beginning skills important in reflective clinical practice. \n\nThe course is primarily online, with 3 required 3-hr patient care simulations. There will be content posted on the course website for student learning. Activities and assessments include quizzes, patient scenario cases, reflective papers (upon re-watching the video of their interactions with the interprofessional teams and standardized patients during the simulation sessions), and individual and interprofessional group.\n\nPharmacy students need to be PD3 students committed to earning the Interprofessional Integrative Mental Health Focus Area designation. We ask pharmacy students to commit to the entire series (fall and spring electives, and mental health APPE)\n",
    "prereq": {}
  },
  {
    "uid": "816815",
    "code": "PHAR6903",
    "subject": "PHAR",
    "number": "6903",
    "honors": false,
    "writing": false,
    "name": "Assmnt & Mgmt Psych Disorders",
    "fullname": "Assessment and Management of Psychiatric Disorders",
    "info": "This course is design to allow students to apply advanced concepts from integrative mental health theory and research, social sciences, neuropsychology, and neurophysiology in the differentiation and explanation of psychiatric symptoms and disorders across the age continuum.",
    "prereq": {}
  },
  {
    "uid": "818515",
    "code": "PHAR6904",
    "subject": "PHAR",
    "number": "6904",
    "honors": false,
    "writing": false,
    "name": "Health Coaching",
    "fullname": "Health Coaching for Pharmacists: Creating a Culture of Change for Patients",
    "info": "Health coaching for Pharmacists will examine current foundations for health and wellbeing, including definitions and standards. Students will learn health coaching models, theories and associated components. We will develop students' self-awareness through mindfulness exploration and self-assessments. Students will learn skills and techniques for coaching patients such as motivational interviewing, non-violent communication, active listening, appreciative inquiry, emotional intelligence, and coaching presence. Students will apply learned skills through peer practice during in-person sessions.",
    "prereq": {}
  },
  {
    "uid": "818417",
    "code": "PHAR6905",
    "subject": "PHAR",
    "number": "6905",
    "honors": false,
    "writing": false,
    "name": "Applied Psych Pharmacotherapy",
    "fullname": "Applied Psych Pharmacotherapy",
    "info": "This course provides a semester-long application of the PD3 fall semester psych pharmacotherapy content through complex scenarios and exploration of advances psychiatric pharmacy topics. Students developed case presentations will be worked-up using a standardized format, and shared with a designated visiting expert prior to class session. Class session each week will begin with a discussion of the case and work-up that is primarily student-led, with a visiting psych/behavioral health clinician providing expert feedback and guidance for the second half of the class session. The course will be structured to make visiting clinician involvement as simple and non-disruptive as possible, including participating from office at work with online video conference option Cisco Meeting Server (formerly Acano). Pharmacy students need to be PD3 students who have passed the Core Psychiatric and Neurology Pharmacotherapy with a grade of B or better. Student must be in good academic standing within the pharmacy program. ",
    "prereq": {}
  },
  {
    "uid": "810927",
    "code": "PHAR6906",
    "subject": "PHAR",
    "number": "6906",
    "honors": false,
    "writing": false,
    "name": "Intro to Pharmacy Research",
    "fullname": "Introduction to Pharmacy Research",
    "info": "This course will provide an overview of principles to research in particular research topic areas. It will also provide a forum for scientists involved in research in particular topic areas to discuss their research, environment, and careers with students.",
    "prereq": {}
  },
  {
    "uid": "818418",
    "code": "PHAR6907",
    "subject": "PHAR",
    "number": "6907",
    "honors": false,
    "writing": false,
    "name": "Collab Practice in HIV Care",
    "fullname": "Interprofessional Collaborative Practice in HIV Care",
    "info": "Interprofessional Collaborative Practice has the potential to positively affect the lives of persons living with HIV/AIDS. This short-semester course is designed to provide learners with foundational knowledge of HIV prevention and care and to develop the ability to work as a member of an interprofessional collaborative health care team. Learners will explore options for involvement in HIV care as part of their health care career and will be inspired to lifelong learning related to HIV care and interprofessional collaborative practice. The methods of instruction include lectures with small group discussion incorporated throughout. The course exercises are designed to provide hands on experience with some of the tools and concepts covered in the course. ",
    "prereq": {}
  },
  {
    "uid": "799313",
    "code": "PHAR6908",
    "subject": "PHAR",
    "number": "6908",
    "honors": false,
    "writing": false,
    "name": "Drugs of Abuse",
    "fullname": "Drugs of Abuse",
    "info": "Basic medicinal chemistry of substances of abuse, associated paraphernalia. \n\nPrereq: Organic chemistry I and Phar 6702",
    "prereq": {}
  },
  {
    "uid": "819607",
    "code": "PHAR6909",
    "subject": "PHAR",
    "number": "6909",
    "honors": false,
    "writing": false,
    "name": "Applied Cultural Competence",
    "fullname": "Applied Cultural Competence in Patient Care and Pharmacy Practice",
    "info": "This course builds on content learned in PharmD program - to provide students with fundamental knowledge, skills and attitudes required of culturally competent, caring general pharmacist practitioners. Content is integrated with didactic courses and prepares students for IPPE and APPE experiences, as well as for their future careers. \nSteady changes in the demographics of the U.S. and the state of Minnesota highlight the demand for cultural awareness and sensitivity in the clinical environment as the percentage of racial, ethnic and cultural minorities in America is projected to continue to outpace the number of minority health care professionals. \nRacial and ethnic disparities in health and health care access have been recognized in the United States for over 30 years. Despite an improved life expectancy for all races and ethnicities, inequities in morbidity and mortality rates and utilization of preventative and necessary health care services persist for various segments of the population. As the United States’ population becomes increasingly diverse, pharmacists are becoming progressively more responsible for the health care management of people from various races, ethnicities, languages and cultures. Providing culturally and linguistically competent health care to these patients has the potential to reduce ever important disparities in health and health care services and to improve the nation’s overall health outcomes. \n",
    "prereq": {}
  },
  {
    "uid": "820373",
    "code": "PHAR6910",
    "subject": "PHAR",
    "number": "6910",
    "honors": false,
    "writing": false,
    "name": "Foundations of Biomedical NLP",
    "fullname": "Foundations of Biomedical Natural Language Processing",
    "info": "The course will provide a systematic introduction to basic knowledge methods used in natural language processing (NLP) research. It will introduce biomedical NLP tasks and methods as well as their resources and applications in the biomedical domain. The course will also provide hands-on experience with existing NLP tools and systems. Students will gain basic knowledge and skills in handling with main biomedical NLP tasks. Recommended: basic understanding of data mining concepts, basic knowledge of computational linguistics. Students should have taken HINF 5502 Python for Health Sciences or have equivalent experience.",
    "prereq": {}
  },
  {
    "uid": "825356",
    "code": "PHAR6911",
    "subject": "PHAR",
    "number": "6911",
    "honors": false,
    "writing": false,
    "name": "EDI & Antiracism GoodReads",
    "fullname": "CI Cooper, RPh: Equity, Diversity, Inclusion & Antiracism GoodReads",
    "info": "This course is designed to support students in finding ways to actively participate in equity, diversity, inclusion (EDI), and antiracism work in healthcare and life through reading and critical thinking. Students examine concepts, theories, and paradigms foundational to EDI and antiracism and apply what they have learned to real-life situations. One title is assigned to students in their enrolling semester followed by three subsequent books of their choice. Each student will create their own study plan and progress through the course at a contracted pace. Students have up to one year to complete the course. Learning is primarily self-directed to meet unique interests and career goals. This course is remote online with one arranged Zoom session in the first semester. Students are invited to enroll in the fall or spring semester; there is no summer registration.",
    "prereq": {}
  },
  {
    "uid": "813749",
    "code": "PHAR6913",
    "subject": "PHAR",
    "number": "6913",
    "honors": false,
    "writing": false,
    "name": "Science & Spirit of Wellbeing",
    "fullname": "The Science and Spirit of Wellbeing",
    "info": "Care, in general, and healthcare in particular, requires a certain degree of wellbeing on the part of the provider. This elective survey course introduces students to evidence based wellbeing. The course explores individual wellbeing as well as implications for practice and the health and wellbeing of others.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "811894",
    "code": "PHAR6937",
    "subject": "PHAR",
    "number": "6937",
    "honors": false,
    "writing": false,
    "name": "Foundations of Leadership",
    "fullname": "Foundations of Leadership",
    "info": "Leadership development/its relation to advancing the profession of pharmacy. \n\nprereq: PDII Pharmacy student",
    "prereq": {}
  },
  {
    "uid": "813070",
    "code": "PHAR6938",
    "subject": "PHAR",
    "number": "6938",
    "honors": false,
    "writing": false,
    "name": "Developing Adaptive Leadership",
    "fullname": "Developing Adaptive Leadership",
    "info": "Directed Study: Developing Adaptive Leadership\n\nprereq: Pharm.D. student",
    "prereq": {}
  },
  {
    "uid": "815012",
    "code": "PHAR6939",
    "subject": "PHAR",
    "number": "6939",
    "honors": false,
    "writing": false,
    "name": "Leading Change Experience I",
    "fullname": "Leading Change Experience I",
    "info": "In collaboration with a faculty advisor, students implement a change that requires adaptive leadership. Work will focus on building a \"short term win\" and a team that can continue efforts into the future. Students will also gain experience in collecting and managing data to assist the change process (e.g., needs assessment and/or outcomes assessment).\n \nIn addition, working with their faculty advisor, students will create and implement an individualized plan for their own personal leadership development. Students will also gain experience in supporting the leadership development of others. To support individualized development, a leadership networking partner (pharmacist) is assigned and periodic networking events and/or meetings are held.\n\nprereq: PHAR 6937 and 6938",
    "prereq": {
      "and": [
        "811894",
        "813070"
      ]
    }
  },
  {
    "uid": "815013",
    "code": "PHAR6940",
    "subject": "PHAR",
    "number": "6940",
    "honors": false,
    "writing": false,
    "name": "Leading Change Experience II",
    "fullname": "Leading Change Experience II",
    "info": "Continues leading change and development work initiated in Leading Change Experience I. During this term, students continue with their networking partners, present their leading change work, facilitate transition of the work to new leaders, conduct a critical appraisal of their leadership development, and support second year students as they initiate their projects.\n \nStudents will also evolve their roles into shifting from personal development to the development of others. Assisting in a mentoring role in several capacities 1) transitioning new leaders into the leading change experience and 2) providing guidance, ideas and encouragement to those students interested in change initiatives. \n\nprereq: PHAR 6937 and 6938",
    "prereq": {
      "and": [
        "811894",
        "813070"
      ]
    }
  },
  {
    "uid": "805514",
    "code": "PHAR6941",
    "subject": "PHAR",
    "number": "6941",
    "honors": false,
    "writing": false,
    "name": "Leadership Best Sellers Pharm",
    "fullname": "Leadership Best Sellers for Pharmacists",
    "info": "Part of the leadership track in pharmacy.",
    "prereq": {}
  },
  {
    "uid": "801560",
    "code": "PHAR6942",
    "subject": "PHAR",
    "number": "6942",
    "honors": false,
    "writing": false,
    "name": "Leadership Capstone",
    "fullname": "Leadership Capstone",
    "info": "Supports completion of Leadership Emphasis Designation. Documentation/self-reflection of leadership learning experiences pursued inside/outside of classroom.\n\nPrerequisites:\nThis course is for students who are in the fourth year of the Leadership Emphasis Area. Successful completion of Phar 6937, 6938, 6939 and 6940. Completion or concurrent enrollment in 6941 (Leadership Best Sellers).",
    "prereq": {}
  },
  {
    "uid": "813150",
    "code": "PHAR6961",
    "subject": "PHAR",
    "number": "6961",
    "honors": false,
    "writing": false,
    "name": "Women's Health",
    "fullname": "Women's Health",
    "info": "During this course, students will have the opportunity to actively learn and discuss women's health issues taught in the core curriculum to a greater extent. The core curriculum focuses on the pharmacotherapy around women's health, we will focus on the patient's perspective, pathophysiology, and other quality care considerations specific to women including cultural, religious, psychosocial, and socioeconomic factors effecting health. Health topics will range from social issues to menstrual health, breast cancer to eating disorders, with a specific focus on preparing students for professional practice and the pharmacist's role.\n\nprereq courses: Endocrinology pharmacotherapy sequence in the PD2 year; \nprereq topics: Contraceptive agents, emergency contraception, hormonal contraception.",
    "prereq": {}
  },
  {
    "uid": "796968",
    "code": "PHAR6962",
    "subject": "PHAR",
    "number": "6962",
    "honors": false,
    "writing": false,
    "name": "Ethics in Pharmacy Practice",
    "fullname": "Ethics in Pharmacy Practice",
    "info": "Ethical principles, selected schools of ethical thought. Students discuss/debate ethical dilemmas in pharmacy practice/health care. prereq: Pharm.D. 3rd year student",
    "prereq": {}
  },
  {
    "uid": "816520",
    "code": "PHAR6964",
    "subject": "PHAR",
    "number": "6964",
    "honors": false,
    "writing": false,
    "name": "Clinical Toxicology",
    "fullname": "Clinical Toxicology",
    "info": "This course will cover the clinical signs/ symptoms, general management and treatment of poisonings and toxicologic emergencies that are not covered in the main curriculum. It will also cover decontamination and laboratory principles associated with poisonings and toxicologics emergencies. This class will be comprised of lecture format presentations. Students will be given 1 hour to complete the final exam and midterm.\n\nprereqs: All students will have successfully completed the first year professional pharmacy program, as well as successfully completed fall semester of the second year. All students will have also successfully completed or be in the process of completing anatomy, physiology, pathophysiology, and pharmacology. The student is responsible for this material to the extent necessary as a framework for toxicologic therapeutics. Thus, students are encouraged to review basic anatomy and physiology and specifically encouraged to review the section of the pharmacology textbook relevant to the classes of drugs covered.",
    "prereq": {}
  },
  {
    "uid": "816553",
    "code": "PHAR6966",
    "subject": "PHAR",
    "number": "6966",
    "honors": false,
    "writing": false,
    "name": "Food Medicine Contemp Issues",
    "fullname": "Food Medicine: Contemporary Issues",
    "info": "Food contributes to the prevention, and conversely, the development of disease processes. I n order to better understand the interrelatedness of food and health, this course offers a critical perspective on how the ubiquity of food; race, class, gender; and indigeneity; colonization and corporatization affect people\u0092s food experiences; and subsequently, individual and population health.\n\nStudents will examine modern food systems and describe implications for social determinants of health, health promotion, chronic disease management and IP collaborative practice. We will address questions such as: How do food systems impact our health? What makes food a political and environmental issue? Are we what we eat? Why do we categorize things that are not food as food? What is food sovereignty?",
    "prereq": {}
  },
  {
    "uid": "790622",
    "code": "PHAR6968",
    "subject": "PHAR",
    "number": "6968",
    "honors": false,
    "writing": false,
    "name": "Critical Care",
    "fullname": "Critical Care",
    "info": "Critical Care is an elective that consists of two main components: a faculty/clinician presentation on an important topic to contemporary critical care practice, followed by a student evaluation and presentation on a selected primary literature topic that applies and integrates the presentation with current practice challenges. Key topics that are covered include discussion of the Surviving Sepsis Guidelines with discussion on the role of corticosteroids, identification and management of the anxious or delirious ICU patient, and application of the updated PAD guidelines, systems of the second 50-minutes a student (or pair of students) present the faculty-selected study using PowerPoint slides, and encourage group discussion of the paper?s merits and application to current critical care practice or future research. Challenges of critical care research are incorporated into the weekly discussions. \n\nprereq: Successful completion of P1, P2, and Fall of P3 professional pharmacy program. Interest in critical care pharmacy practice and/or clinical research.",
    "prereq": {}
  },
  {
    "uid": "791440",
    "code": "PHAR6970",
    "subject": "PHAR",
    "number": "6970",
    "honors": false,
    "writing": false,
    "name": "Immunization Tour",
    "fullname": "Immunization Tour",
    "info": "Role of health care practitioners. Population based disease prevention. Planning/delivering influenza vaccination clinics. Collaborative public health intervention.\n\nprereq: 6175, Completion of CPR",
    "prereq": {
      "and": [
        "014217"
      ]
    }
  },
  {
    "uid": "789767",
    "code": "PHAR6971",
    "subject": "PHAR",
    "number": "6971",
    "honors": false,
    "writing": false,
    "name": "Geriatric Pharmacotherapy",
    "fullname": "Geriatric Pharmacotherapy",
    "info": "Pharmacokinetic/pharmacodynamic changes and their implications in elders. Effects of drug-drug/drug-disease interactions. Drug adherence barriers to provide optimum pharmacotherapy to elderly persons.\n\nPrerequisite: 3rd year Pharmacy student",
    "prereq": {}
  },
  {
    "uid": "796561",
    "code": "PHAR7001",
    "subject": "PHAR",
    "number": "7001",
    "honors": false,
    "writing": false,
    "name": "EPPE I",
    "fullname": "Early Pharmacy Practice Experience I",
    "info": "First in series of four courses. Focuses on patient perspective in managing/living with chronic conditions/ chronic medication use. Community-based instruction, mentor program.\n\nprereq: Criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "796562",
    "code": "PHAR7002",
    "subject": "PHAR",
    "number": "7002",
    "honors": false,
    "writing": false,
    "name": "EPPE II",
    "fullname": "Early Pharmacy Practice Experience II",
    "info": "Patient perspective in managing/living with chronic conditions/chronic medication use. Community-based instruction, mentor program.\n\nprereq: 7001 or instr consent, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {
      "or": [
        "796561"
      ]
    }
  },
  {
    "uid": "796563",
    "code": "PHAR7003",
    "subject": "PHAR",
    "number": "7003",
    "honors": false,
    "writing": false,
    "name": "EPPE III",
    "fullname": "Early Pharmacy Practice Experience III",
    "info": "Third in series of four courses. Patient perspective in managing/living with chronic conditions/chronic medication use. Community-based instruction, mentoring.\n\nprereq: 7002 or instr consent, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {
      "or": [
        "796562"
      ]
    }
  },
  {
    "uid": "796564",
    "code": "PHAR7004",
    "subject": "PHAR",
    "number": "7004",
    "honors": false,
    "writing": false,
    "name": "EPPE IV",
    "fullname": "Early Pharmacy Practice Experience IV",
    "info": "Patient perspective in managing/living with chronic conditions/chronic medication use. Community-based instruction, mentoring. Upcoming patient care opportunities.\n\nprereq: 7003 or instr consent, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {
      "or": [
        "796563"
      ]
    }
  },
  {
    "uid": "802971",
    "code": "PHAR7005",
    "subject": "PHAR",
    "number": "7005",
    "honors": false,
    "writing": false,
    "name": "Community Practice IPPE",
    "fullname": "Introductory Community-Practice Pharmacy Experience",
    "info": "Experience in patient care at community practice setting.  \nThree weeks, 40 hrs/week.\n\nprereq: 6111, 6171, 7001, 1st year pharmacy student",
    "prereq": {
      "and": [
        "014220",
        "014239",
        "796561"
      ]
    }
  },
  {
    "uid": "802972",
    "code": "PHAR7006",
    "subject": "PHAR",
    "number": "7006",
    "honors": false,
    "writing": false,
    "name": "Institutional IPPE",
    "fullname": "Introductory Institutional-Pharmacy Practice Experience",
    "info": "Experience in patient care in hospital setting. Three-week, 40 hours/week.\n\nprereq: College of Pharmacy student completed 6121, 6122, 6131, 6132, 6173, 6174, 7003 and 7004 with passing grade, registered with Minnesota Board of Pharmacy as intern",
    "prereq": {
      "and": [
        "788221",
        "014234",
        "014241",
        "014719",
        "014223",
        "014225",
        "796563",
        "796564"
      ]
    }
  },
  {
    "uid": "805518",
    "code": "PHAR7010",
    "subject": "PHAR",
    "number": "7010",
    "honors": false,
    "writing": false,
    "name": "APPE CPD Portfolio",
    "fullname": "APPE Continuing Professional Development Portfolio",
    "info": "Continuing professional development. Systematic maintenance, development, and broadening of knowledge, skills, and attitudes. Students self-assess performance/learning needs and create/follow/evaluate a learning plan. Documentation for peer review/support, regulatory review.\n\nprereq: 3rd yr pharmacy student",
    "prereq": {}
  },
  {
    "uid": "014251",
    "code": "PHAR7111",
    "subject": "PHAR",
    "number": "7111",
    "honors": false,
    "writing": false,
    "name": "Longitudinal Patient Care I",
    "fullname": "Longitudinal Patient Care I",
    "info": "Longitudinal part-time patient care experience that focuses on interprofessional relationships and cultural issues.  Students develop a therapeutic relationship with patient and/or family.",
    "prereq": {}
  },
  {
    "uid": "014788",
    "code": "PHAR7112",
    "subject": "PHAR",
    "number": "7112",
    "honors": false,
    "writing": false,
    "name": "Longitudinal Patient Care II",
    "fullname": "Longitudinal Patient Care II",
    "info": "Continuation of Phar 7111. Longitudinal part-time patient care experience that focuses on interprofessional relationships and cultural issues. Students develop a therapeutic relationship with patient and/or family.",
    "prereq": {}
  },
  {
    "uid": "014680",
    "code": "PHAR7121",
    "subject": "PHAR",
    "number": "7121",
    "honors": false,
    "writing": false,
    "name": "Institutional Practice Exper",
    "fullname": "Institutional Practice Exper",
    "info": "Students assigned to participating hospital pharmacies. Participate in drug distribution, IV compounding, clinical services, administrative activities. Full-time for 5 weeks.",
    "prereq": {}
  },
  {
    "uid": "016570",
    "code": "PHAR7124",
    "subject": "PHAR",
    "number": "7124",
    "honors": false,
    "writing": false,
    "name": "Geriatrics Patient Care Pract",
    "fullname": "Geriatrics Patient Care Practice Experience",
    "info": "Evaluation/pharmacotherapy of geriatric patients. Students work with other healthcare professionals/caregivers in outpatient and long-term care settings. Full-time for five weeks.",
    "prereq": {}
  },
  {
    "uid": "014686",
    "code": "PHAR7125",
    "subject": "PHAR",
    "number": "7125",
    "honors": false,
    "writing": false,
    "name": "Pediatric Patient Care Pract",
    "fullname": "Pediatrics Patient Care Practice Experience",
    "info": "Students responsible for drug-related needs of individual pediatric patients.  Pharmacokinetic/pharmacodynamic differences between adult and pediatric patients. Full-time for five weeks.",
    "prereq": {}
  },
  {
    "uid": "788197",
    "code": "PHAR7128",
    "subject": "PHAR",
    "number": "7128",
    "honors": false,
    "writing": false,
    "name": "Acute Patient Care Pract  II",
    "fullname": "Acute Patient Care Practice Experience II",
    "info": "Experience in an inpatient setting. Students responsible for all drug-related needs of individual patients. Full-time for five weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "014911",
    "code": "PHAR7213",
    "subject": "PHAR",
    "number": "7213",
    "honors": false,
    "writing": false,
    "name": "Elective Pract Exper  III",
    "fullname": "Elective Practice Experience III",
    "info": "Experience in inpatient or outpatient pharmacy practices where direct patient contact/care occurs for 5 weeks, or experience in non-patient care setting. Sites vary widely from governmental agencies to pharmacy associations to specialized practices for 5 weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "015883",
    "code": "PHAR7214",
    "subject": "PHAR",
    "number": "7214",
    "honors": false,
    "writing": false,
    "name": "Elective Practice Exper IV",
    "fullname": "Elective Practice Experience IV",
    "info": "Experience in inpatient or outpatient pharmacy practices where direct patient contact/care occurs for 5 weeks, or experience in non-patient care setting. Sites vary from governmental agencies to pharmacy associations to specialized practices for 5 weeks.\n\nprereq: Pharm.D. IV, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "015884",
    "code": "PHAR7215",
    "subject": "PHAR",
    "number": "7215",
    "honors": false,
    "writing": false,
    "name": "Community Patient Care Clerk",
    "fullname": "Community Patient Care Clerkship",
    "info": "Patient care experience in a community pharmacy in which student is responsible for assessing drug-related needs of patients, developing care plans and performing follow-up evaluations full-time for 5 weeks.",
    "prereq": {}
  },
  {
    "uid": "795798",
    "code": "PHAR7216",
    "subject": "PHAR",
    "number": "7216",
    "honors": false,
    "writing": false,
    "name": "Elective Practice Exper IV",
    "fullname": "Elective Practice Experience IV",
    "info": "Experience in an inpatient setting. Students responsible for all drug-related needs of individual patients full-time for five weeks. ",
    "prereq": {}
  },
  {
    "uid": "795799",
    "code": "PHAR7217",
    "subject": "PHAR",
    "number": "7217",
    "honors": false,
    "writing": false,
    "name": "Elective Practice Experience V",
    "fullname": "Elective Practice Experience V",
    "info": "Experience in inpatient or outpatient pharmacy practices where direct patient contact/care occurs for 5 weeks, or experience in non-patient care setting. Sites vary widely from governmental agencies to pharmacy associations to specialized practices for 5 weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "014917",
    "code": "PHAR7221",
    "subject": "PHAR",
    "number": "7221",
    "honors": false,
    "writing": false,
    "name": "Community Management Clkshp",
    "fullname": "Community Pharmacy Management Clerkship",
    "info": "Experience using management techniques in a community pharmacy full-time for 5 weeks.",
    "prereq": {}
  },
  {
    "uid": "014922",
    "code": "PHAR7222",
    "subject": "PHAR",
    "number": "7222",
    "honors": false,
    "writing": false,
    "name": "Institutional Managmnt Clkshp",
    "fullname": "Institutional Pharmacy Management Clerkship",
    "info": "Experience using management techniques in an institutional pharmacy full-time for 5 weeks.",
    "prereq": {}
  },
  {
    "uid": "014926",
    "code": "PHAR7223",
    "subject": "PHAR",
    "number": "7223",
    "honors": false,
    "writing": false,
    "name": "Specialty Managmnt Clerk I",
    "fullname": "Specialty Management Clerkship I",
    "info": "Experience using management techniques in any pharmacy setting full-time for 5 weeks.",
    "prereq": {}
  },
  {
    "uid": "014930",
    "code": "PHAR7224",
    "subject": "PHAR",
    "number": "7224",
    "honors": false,
    "writing": false,
    "name": "Specialty Managmnt Clerk II",
    "fullname": "Specialty Management Clerkship II",
    "info": "Experience using management techniques in any pharmacy setting full-time for 5 weeks.",
    "prereq": {}
  },
  {
    "uid": "014931",
    "code": "PHAR7225",
    "subject": "PHAR",
    "number": "7225",
    "honors": false,
    "writing": false,
    "name": "Spec ialty Managmnt Clerk III",
    "fullname": "Specialty Management Clerkship III",
    "info": "Experience using management techniques in any pharmacy setting full-time for 5 weeks.",
    "prereq": {}
  },
  {
    "uid": "014944",
    "code": "PHAR7231",
    "subject": "PHAR",
    "number": "7231",
    "honors": false,
    "writing": false,
    "name": "Research Practice Exper I",
    "fullname": "Research Practice Experience I",
    "info": "Experience using research techniques in basic or clinical sciences or pharmacy practice. Full-time for five weeks.",
    "prereq": {}
  },
  {
    "uid": "014946",
    "code": "PHAR7232",
    "subject": "PHAR",
    "number": "7232",
    "honors": false,
    "writing": false,
    "name": "Research Practice Exper II",
    "fullname": "Research Practice Experience II",
    "info": "Experience using research techniques in basic or clinical sciences or pharmacy practice. Full-time for five weeks.",
    "prereq": {}
  },
  {
    "uid": "014949",
    "code": "PHAR7233",
    "subject": "PHAR",
    "number": "7233",
    "honors": false,
    "writing": false,
    "name": "Research Practice Exper III",
    "fullname": "Research Practice Experience III",
    "info": "Experience using research techniques in basic or clinical sciences or pharmacy practice. Full-time for five weeks.",
    "prereq": {}
  },
  {
    "uid": "795800",
    "code": "PHAR7234",
    "subject": "PHAR",
    "number": "7234",
    "honors": false,
    "writing": false,
    "name": "Research Practice Exper IV",
    "fullname": "Research Practice Experience IV",
    "info": "Experience using research techniques in basic or clinical sciences or pharmacy practice full-time for 5 weeks. ",
    "prereq": {}
  },
  {
    "uid": "795801",
    "code": "PHAR7235",
    "subject": "PHAR",
    "number": "7235",
    "honors": false,
    "writing": false,
    "name": "Research Practice Exper V",
    "fullname": "Research Practice Experience V",
    "info": "Experience using research techniques in basic or clinical sciences or pharmacy practice full-time for five weeks.",
    "prereq": {}
  },
  {
    "uid": "015885",
    "code": "PHAR7241",
    "subject": "PHAR",
    "number": "7241",
    "honors": false,
    "writing": false,
    "name": "Clerkship Elective I",
    "fullname": "Clerkship Elective I",
    "info": "Clerkship experience in one of many pharmacy-related areas full-time for 5 weeks.",
    "prereq": {}
  },
  {
    "uid": "015468",
    "code": "PHAR7242",
    "subject": "PHAR",
    "number": "7242",
    "honors": false,
    "writing": false,
    "name": "Clerkship Elective II",
    "fullname": "Clerkship Elective II",
    "info": "Clerkship experience in pharmacy-related area full-time. Five weeks.",
    "prereq": {}
  },
  {
    "uid": "015469",
    "code": "PHAR7243",
    "subject": "PHAR",
    "number": "7243",
    "honors": false,
    "writing": false,
    "name": "Specialty Clerkship Elective",
    "fullname": "Specialty Clerkship Elective",
    "info": "Clerkship experience in one of many pharmacy-related areas full-time for 1-12 weeks.",
    "prereq": {}
  },
  {
    "uid": "810288",
    "code": "PHAR7310",
    "subject": "PHAR",
    "number": "7310",
    "honors": false,
    "writing": false,
    "name": "Intro Community Hlth & Engmnt",
    "fullname": "Introduction to Community Health and Interprofessional Engagement",
    "info": "Course builds on content learned in Becoming a Pharmacist to provide students with fundamental knowledge, skills, and attitudes required of competent, caring general pharmacist practitioners. Content is integrated with concurrent first year didactic courses and prepares students for Pre-APPE.\n\nprereq: Successful completion of Becoming a Pharmacist (BaP)",
    "prereq": {}
  },
  {
    "uid": "810753",
    "code": "PHAR7320",
    "subject": "PHAR",
    "number": "7320",
    "honors": false,
    "writing": false,
    "name": "Early Pharm Practice Exp II",
    "fullname": "Early Pharmacy Practice Experience II: Planning and Implementing a Community Health Project",
    "info": "Series of interconnected active learning activities spanning first two years of professional program. Builds on learning from previous semester/informs learning experiences. Continue into EPPE III (in following semester).\n\nprereq: Successful completion of EPPE I",
    "prereq": {}
  },
  {
    "uid": "813143",
    "code": "PHAR7325",
    "subject": "PHAR",
    "number": "7325",
    "honors": false,
    "writing": false,
    "name": "Community IPPE",
    "fullname": "Introductory Community-Practice Pharmacy Experience",
    "info": "The purpose of the Community IPPE is to introduce you to the fundamentals of pharmacy practice and developing professional attitude and behavior in the community pharmacy setting. The course will build upon knowledge gained in the first year didactic curriculum, specifically Foundations of SAPh and Foundations of Pharmaceutical Care. The format of the IPPE course includes: in person, online and an experiential components. The experiential component is a combination of observation, application of current knowledge, and feedback and assessment between you, the preceptor, and others.\n\nprereq: College of Pharmacy students must complete PHAR 6700 (Becoming a Pharmacist), 6706 (Foundations in Pharmaceutical Care), 6716 (Applied Pharmaceutical Care), 6728 (Pharmaceutical Calculations), 6710 (Pharmaceutical Care Skills Lab 1), 6720 (Pharmaceutical Care Skills lab 2), 6704 (foundations of SAPh), 6730 (first year seminar), 6718 (drug delivery), 6722 (med chem), 6726 (pharmacology) with a passing grade. You must be registered with the Minnesota Board of Pharmacy as an intern prior to the onsite experiential component of this course.",
    "prereq": {
      "or": [
        "810282",
        "810285",
        "810612",
        "810625",
        "810287",
        "810614",
        "810284",
        "811915",
        "810613",
        "810615",
        "810624"
      ]
    }
  },
  {
    "uid": "812449",
    "code": "PHAR7330",
    "subject": "PHAR",
    "number": "7330",
    "honors": false,
    "writing": false,
    "name": "Community Teacher Experience I",
    "fullname": "Community Teachers I",
    "info": "EPhECT is a service learning experience which pairs second year students with a volunteer Community Teacher (CT). Students develop a working/professional relationship with their CT and learn from CT's health and life experiences. Students will work with their CT to choose and complete activities unique to each CT's health profile. CTs benefit by gaining better understanding of their health by discussing and evaluating their health profile with professional students. CTs will also better understand the pharmacist's role in healthcare.\n\nprereq: Students must have completed or be currently enrolled in the following courses: Becoming a Pharmacist, Foundations of Pharmaceutical Care, Applied Pharmaceutical Care, Pharmaceutical Skills Lab I and II",
    "prereq": {}
  },
  {
    "uid": "813144",
    "code": "PHAR7340",
    "subject": "PHAR",
    "number": "7340",
    "honors": false,
    "writing": false,
    "name": "Community Teacher Experience 2",
    "fullname": "Community Teacher Experience II",
    "info": "EPhECT is a service learning experience which pairs second year students with a volunteer Community Teacher (CT). Through this course students develop a working/professional relationship with their CT and learn from their CTâ¿¿s health and life experiences. Students will work with their CT to choose and complete activities unique to each CTâ¿¿s health profile.\n\nprereq: Students must have completed or be currently enrolled in the following courses: Becoming a Pharmacist, Foundations of Pharmaceutical Care, Applied Pharmaceutical Care, Pharmaceutical Skills Lab I, II, and III, EPhECT I, and Foundations of SAPh",
    "prereq": {}
  },
  {
    "uid": "813142",
    "code": "PHAR7345",
    "subject": "PHAR",
    "number": "7345",
    "honors": false,
    "writing": false,
    "name": "Institutional IPPE",
    "fullname": "Introductory Institutional-Practice Pharmacy Experience",
    "info": "The purpose of the Institutional IPPE is to introduce students to the fundamentals of pharmacy practice in the institutional pharmacy setting. The course will build upon knowledge gained in the first two years of the didactic curriculum. The student will spend 120 hours at the institutional site with their preceptor (who is approved by the MN BOP) and the College. An Additional 36 hours is allocated between assignments and online course materials.\n\nprereq: Students must have successfully completed Phar 7325 (Community IPPE), Phar 6730 (Professional Development and Assessment II), Phar 6736 (Cardiovascular Pharmacotherapy), Phar 6738 (Pharmacokinetics), Phar 6740 (Pharmaceutical Care Skills III), Phar 6742 (Colloquium I: Scholarly Presentation Skills). Students must be enrolled concurrently in PD2 Spring semester courses. Students must also be registered interns in the state of Minnesota.",
    "prereq": {
      "and": [
        "813143",
        "811915",
        "811314",
        "811315",
        "811302",
        "811316"
      ]
    }
  },
  {
    "uid": "825458",
    "code": "PHAR7351",
    "subject": "PHAR",
    "number": "7351",
    "honors": false,
    "writing": false,
    "name": "IPPE 1 - Community",
    "fullname": "Introductory Pharmacy Practice Experience 1 - Community",
    "info": "The purpose of the Community IPPE is to introduce students to the fundamentals of pharmacy practice, and professional attitude and behavior in the community pharmacy setting. The course will build upon knowledge and skills gained in the first year didactic curriculum, particularly Pharmaceutical Care Skills Lab, Foundations of Pharmaceutical Care, and Applied Pharmaceutical Care. While there is significant overlap across semesters, there will be greater concentration on different topics by semester driven by the activities in workbooks. The fall semester will focus more on patient education and pharmacy workflow. The spring semester will focus more OTC medications and self-care, and pharmacy operations.",
    "prereq": {}
  },
  {
    "uid": "825459",
    "code": "PHAR7352",
    "subject": "PHAR",
    "number": "7352",
    "honors": false,
    "writing": false,
    "name": "IPPE 2 - Community",
    "fullname": "Introductory Pharmacy Practice Experience 2 - Community",
    "info": "The purpose of the Community IPPE is to introduce students to the fundamentals of pharmacy practice, and professional attitude and behavior in the community pharmacy setting. The course will build upon knowledge and skills gained in the first year didactic curriculum, particularly Pharmaceutical Care Skills Lab, Foundations of Pharmaceutical Care, and Applied Pharmaceutical Care. While there is significant overlap across semesters, there will be greater concentration on different topics by semester driven by the activities in workbooks. The fall semester will focus more on patient education and pharmacy workflow. The spring semester will focus more OTC medications and self-care, and pharmacy operations.",
    "prereq": {}
  },
  {
    "uid": "825460",
    "code": "PHAR7353",
    "subject": "PHAR",
    "number": "7353",
    "honors": false,
    "writing": false,
    "name": "IPPE 3 - Institutional",
    "fullname": "Introductory Pharmacy Practice Experience 3 - Institutional",
    "info": "The purpose of the Institutional Introductory Pharmacy Experiences (I-IPPE) is to introduce pharmacy students to the fundamentals of pharmacy practice in the hospital setting. To complement their didactic curriculum, experiential experiences allow them to see pharmacy in action. The I-IPPE should be their opportunity to focus on the distributive and operational side of hospital pharmacy. While exposure to clinical services is an important part of hospital pharmacy, we can all agree even the most appropriately designed medication regimen is of no benefit to the patient, if it cannot be safely dispensed and administered.",
    "prereq": {}
  },
  {
    "uid": "825461",
    "code": "PHAR7354",
    "subject": "PHAR",
    "number": "7354",
    "honors": false,
    "writing": false,
    "name": "IPPE 4 - Institutional",
    "fullname": "Introductory Pharmacy Practice Experience 4 - Institutional",
    "info": "The purpose of the Institutional Introductory Pharmacy Experiences (I-IPPE) is to introduce pharmacy students to the fundamentals of pharmacy practice in the hospital setting. To complement their didactic curriculum, experiential experiences allow them to see pharmacy in action. The I-IPPE should be their opportunity to focus on the distributive and operational side of hospital pharmacy. While exposure to clinical services is an important part of hospital pharmacy, we can all agree even the most appropriately designed medication regimen is of no benefit to the patient, if it cannot be safely dispensed and administered.",
    "prereq": {}
  },
  {
    "uid": "825462",
    "code": "PHAR7355",
    "subject": "PHAR",
    "number": "7355",
    "honors": false,
    "writing": false,
    "name": "IPPE 5 – AS/IMUS",
    "fullname": "Introductory Pharmacy Practice Experience 5 – AS/IMUS",
    "info": "Improving Medication Use Systems Introductory Pharmacy Practice Experience (IMUS-IPPE) is an 80-hour early experiential offering that exposes and advances student understanding of quality improvement in patient care in one of many possible pharmacy practice settings.  All students will complete an IMUS-IPPE during one of the semesters during their P3 year.\n\nThe purpose of the IMUS-IPPE is to give students the opportunity to develop continuous quality improvement (CQI) knowledge and skills via self-directed learning and participation in CQI initiatives projects in practice under the preceptorship of a pharmacist.  Students will contribute to CQI initiatives improving patient care by participating on a project while learning about the organizations collective efforts related to quality improvement.\nAdvanced Selective Introductory Pharmacy Practice Experience (AS-IPPE) is an 80-hour early experiential offering that exposes and advances student understanding of direct patient care in one of many possible pharmacy practice settings.  All students will complete an AS-IPPE during one of the semesters during their P3 year.\n\nThe purpose of the AS-IPPE is to introduce pharmacy students to direct patient care unique from dispensing functions in any pharmacy setting providing direct patient care.  To complement their didactic curriculum, experiential rotations allow students to see pharmacy in action.  Students completing an AS-IPPE will have the opportunity to focus their learning on a specific pharmacy interest area and related patient care clinical skills under the guidance of a preceptor.\n",
    "prereq": {}
  },
  {
    "uid": "825463",
    "code": "PHAR7356",
    "subject": "PHAR",
    "number": "7356",
    "honors": false,
    "writing": false,
    "name": "IPPE 6 – AS/IMUS",
    "fullname": "Introductory Pharmacy Practice Experience 6 – AS/IMUS",
    "info": "Improving Medication Use Systems Introductory Pharmacy Practice Experience (IMUS-IPPE) is an 80-hour early experiential offering that exposes and advances student understanding of quality improvement in patient care in one of many possible pharmacy practice settings.  All students will complete an IMUS-IPPE during one of the semesters during their P3 year.\n\nThe purpose of the IMUS-IPPE is to give students the opportunity to develop continuous quality improvement (CQI) knowledge and skills via self-directed learning and participation in CQI initiatives projects in practice under the preceptorship of a pharmacist.  Students will contribute to CQI initiatives improving patient care by participating on a project while learning about the organizations collective efforts related to quality improvement.\nAdvanced Selective Introductory Pharmacy Practice Experience (AS-IPPE) is an 80-hour early experiential offering that exposes and advances student understanding of direct patient care in one of many possible pharmacy practice settings.  All students will complete an AS-IPPE during one of the semesters during their P3 year.\n\nThe purpose of the AS-IPPE is to introduce pharmacy students to direct patient care unique from dispensing functions in any pharmacy setting providing direct patient care.  To complement their didactic curriculum, experiential rotations allow students to see pharmacy in action.  Students completing an AS-IPPE will have the opportunity to focus their learning on a specific pharmacy interest area and related patient care clinical skills under the guidance of a preceptor.\n",
    "prereq": {}
  },
  {
    "uid": "014682",
    "code": "PHAR7401",
    "subject": "PHAR",
    "number": "7401",
    "honors": false,
    "writing": false,
    "name": "Acute Patient Care Pract Exp",
    "fullname": "Acute Patient Care Practice Experience",
    "info": "Experience in an inpatient setting. Students responsible for all drug-related needs of individual patients. Full-time for twelve weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "014684",
    "code": "PHAR7411",
    "subject": "PHAR",
    "number": "7411",
    "honors": false,
    "writing": false,
    "name": "Ambulatory Patient Care Pract",
    "fullname": "Ambulatory Patient Care Practice Experience I",
    "info": "Experience in an ambulatory setting. Students responsible for drug-related needs of individual patients. Full-time for five weeks.\n\nprereq: Pharm.D. IV, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "815823",
    "code": "PHAR7412",
    "subject": "PHAR",
    "number": "7412",
    "honors": false,
    "writing": false,
    "name": "Ambulatory Care 2",
    "fullname": "Ambulatory Care 2",
    "info": "Experience in an ambulatory setting. Students responsible for drug-related needs of individual patients. Full-time for five weeks.\n\nprereq: Pharm.D. IV, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "014679",
    "code": "PHAR7413",
    "subject": "PHAR",
    "number": "7413",
    "honors": false,
    "writing": false,
    "name": "Community Pharm Practice Exper",
    "fullname": "Community Pharmacy Practice Experience",
    "info": "Students assigned to participating community pharmacies. Community practice activities full-time for 5 weeks.\n\nprereq: Pharm.D. IV, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "014786",
    "code": "PHAR7421",
    "subject": "PHAR",
    "number": "7421",
    "honors": false,
    "writing": false,
    "name": "Elective Practice Exper  I",
    "fullname": "Elective Practice Experience I",
    "info": "Experience in inpatient or outpatient pharmacy practices where direct patient contact/care occurs for five weeks, or experience in non-patient care setting. Sites vary from governmental agencies to pharmacy associations to specialized practices for five weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "014906",
    "code": "PHAR7422",
    "subject": "PHAR",
    "number": "7422",
    "honors": false,
    "writing": false,
    "name": "Elective Pract Exper  II",
    "fullname": "Elective Practice Experience II",
    "info": "Experience in inpatient or outpatient pharmacy practices where direct patient contact/care occurs for five weeks, or experience in non-patient care setting. Sites vary from governmental agencies to pharmacy associations to specialized practices for five weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "014687",
    "code": "PHAR7431",
    "subject": "PHAR",
    "number": "7431",
    "honors": false,
    "writing": false,
    "name": "Elective 1",
    "fullname": "Elective Experience 1",
    "info": "Patient care experience in any setting. Students responsible for drug-related needs of individual patients. Full-time for five weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "815824",
    "code": "PHAR7432",
    "subject": "PHAR",
    "number": "7432",
    "honors": false,
    "writing": false,
    "name": "Elective Experience 2",
    "fullname": "Elective Experience 2",
    "info": "Patient care experience in any setting. Students responsible for drug-related needs of individual patients. Full-time for five weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy intern, criminal background check, BLS CPR certification, negative Mantoux test (or explanation of positive test), chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "815946",
    "code": "PHAR7433",
    "subject": "PHAR",
    "number": "7433",
    "honors": false,
    "writing": false,
    "name": "Elective 3",
    "fullname": "Elective Experience 3",
    "info": "Patient care experience in any setting. Students responsible for drug-related needs of individual patients. Full-time for five weeks.\n\nprereq: Pharm.D. I-III, MN Board of Pharmacy  intern, criminal background check, BLS CPR certification, proof of negative Mantoux test [or explanation of positive test], proof of chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820094",
    "code": "PHAR7501",
    "subject": "PHAR",
    "number": "7501",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 1",
    "fullname": "Advanced Pharmacy Practice Experience 1",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820100",
    "code": "PHAR7502",
    "subject": "PHAR",
    "number": "7502",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 2",
    "fullname": "Advanced Pharmacy Practice Experience 2",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820101",
    "code": "PHAR7503",
    "subject": "PHAR",
    "number": "7503",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 3",
    "fullname": "Advanced Pharmacy Practice Experience 3",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820102",
    "code": "PHAR7504",
    "subject": "PHAR",
    "number": "7504",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 4",
    "fullname": "Advanced Pharmacy Practice Experience 4",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity\n",
    "prereq": {}
  },
  {
    "uid": "820103",
    "code": "PHAR7505",
    "subject": "PHAR",
    "number": "7505",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 5",
    "fullname": "Advanced Pharmacy Practice Experience 5",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820104",
    "code": "PHAR7506",
    "subject": "PHAR",
    "number": "7506",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 6",
    "fullname": "Advanced Pharmacy Practice Experience 6",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820105",
    "code": "PHAR7507",
    "subject": "PHAR",
    "number": "7507",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 7",
    "fullname": "Advanced Pharmacy Practice Experience 7",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820106",
    "code": "PHAR7508",
    "subject": "PHAR",
    "number": "7508",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 8",
    "fullname": "Advanced Pharmacy Practice Experience 8",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820107",
    "code": "PHAR7509",
    "subject": "PHAR",
    "number": "7509",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 9",
    "fullname": "Advanced Pharmacy Practice Experience 9",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity",
    "prereq": {}
  },
  {
    "uid": "820108",
    "code": "PHAR7510",
    "subject": "PHAR",
    "number": "7510",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience10",
    "fullname": "Advanced Pharmacy Practice Experience 10",
    "info": "This course is an experiential rotation in any setting (acute care, institutional practice, community practice, ambulatory care, and electives). Students are responsible for drug-related needs of individuals (patients, etc.). Full-time for four weeks. Prereq: PharmD I-III; MN Board of Pharmacy intern; criminal background check; BLS CPR certification; negative Mantoux test (or explanation of positive test); chicken pox immunity\n",
    "prereq": {}
  },
  {
    "uid": "820524",
    "code": "PHAR7511",
    "subject": "PHAR",
    "number": "7511",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 1",
    "fullname": "Advanced Pharmacy Practice Experience 1",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "825900",
    "code": "PHAR7512",
    "subject": "PHAR",
    "number": "7512",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 2",
    "fullname": "Advanced Pharmacy Practice Experience 2",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "825901",
    "code": "PHAR7513",
    "subject": "PHAR",
    "number": "7513",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 3",
    "fullname": "Advanced Pharmacy Practice Experience 3",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "825902",
    "code": "PHAR7514",
    "subject": "PHAR",
    "number": "7514",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 4",
    "fullname": "Advanced Pharmacy Practice Experience 4",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "825903",
    "code": "PHAR7515",
    "subject": "PHAR",
    "number": "7515",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 5",
    "fullname": "Advanced Pharmacy Practice Experience 5",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "825904",
    "code": "PHAR7516",
    "subject": "PHAR",
    "number": "7516",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 6",
    "fullname": "Advanced Pharmacy Practice Experience 6",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "825905",
    "code": "PHAR7517",
    "subject": "PHAR",
    "number": "7517",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 7",
    "fullname": "Advanced Pharmacy Practice Experience 7",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "825906",
    "code": "PHAR7518",
    "subject": "PHAR",
    "number": "7518",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 8",
    "fullname": "Advanced Pharmacy Practice Experience 8",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "825907",
    "code": "PHAR7519",
    "subject": "PHAR",
    "number": "7519",
    "honors": false,
    "writing": false,
    "name": "Advanced Practice Experience 9",
    "fullname": "Advanced Pharmacy Practice Experience 9",
    "info": "This course is an experiential rotation in a pharmacy practice setting (acute care, institutional, community, ambulatory patient care, elective). Students are responsible for drug-related needs of individuals and populations. This is a five-week, full-time rotation. Students must be in good standing in the fourth year of the PharmD program and have met all institutional standards and requirements for practicing on-site prior to the start of their rotation.",
    "prereq": {}
  },
  {
    "uid": "016976",
    "code": "PHAR7700",
    "subject": "PHAR",
    "number": "7700",
    "honors": false,
    "writing": false,
    "name": "Internet in Pharmacy",
    "fullname": "Using the Internet in Pharmacy",
    "info": "Optimal use of e-mail, discussion groups, Web, and real-time chat for pharmacy applications such as disease specific discussion, resolution of patient cases, online consults, and online journal clubs.",
    "prereq": {}
  },
  {
    "uid": "016938",
    "code": "PHAR7701",
    "subject": "PHAR",
    "number": "7701",
    "honors": false,
    "writing": false,
    "name": "Phar Care & Practice Enhance",
    "fullname": "Pharmaceutical Care and Practice Enhancement",
    "info": "Pharmaceutical care, applications to patient cases. Standard workups  including problem descriptions, measurable outcomes, and monitoring plans. Support/management systems for pharmaceutical care practice. Proposals are  prepared outlining practice enhancement projects.",
    "prereq": {}
  },
  {
    "uid": "787626",
    "code": "PHAR7702",
    "subject": "PHAR",
    "number": "7702",
    "honors": false,
    "writing": false,
    "name": "Therapeutic Drug Monitoring",
    "fullname": "Therapeutic Drug Monitoring",
    "info": "Interpreting/applying basic pharmacokinetic/pharmacodynamic data  for commonly monitored drugs. Pharmacokinetic characteristics of digoxin, amnioglycosides, vancomycin, theophylline, and phenytoin. Pharmacokinetic assessment/monitoring for these drugs.",
    "prereq": {}
  },
  {
    "uid": "016977",
    "code": "PHAR7703",
    "subject": "PHAR",
    "number": "7703",
    "honors": false,
    "writing": false,
    "name": "Drug Literature",
    "fullname": "Drug Literature Evaluation and Statistics",
    "info": "Classifying studies by design. Bias/confounding. Statistical portions of research articles. Applying skills to evaluation of pharmacy literature.",
    "prereq": {}
  },
  {
    "uid": "017002",
    "code": "PHAR7704",
    "subject": "PHAR",
    "number": "7704",
    "honors": false,
    "writing": false,
    "name": "Advanced Renal and Fluid",
    "fullname": "Advanced Therapeutics of Renal and Fluid/Electrolyte Disorders",
    "info": "Pathophysiology/pharmacotherapy of common cardiovascular, endocrine, and gastrointestinal disorders.",
    "prereq": {}
  },
  {
    "uid": "787627",
    "code": "PHAR7705",
    "subject": "PHAR",
    "number": "7705",
    "honors": false,
    "writing": false,
    "name": "Pharmacoeconomics",
    "fullname": "Pharmacoeconomics",
    "info": "Overview of concepts/methods of pharmacoeconomics. How to understand, interpret, evaluate, and apply information from pharmacoeconomic literature.",
    "prereq": {}
  },
  {
    "uid": "788169",
    "code": "PHAR7706",
    "subject": "PHAR",
    "number": "7706",
    "honors": false,
    "writing": false,
    "name": "Psych and Neuro Disorders",
    "fullname": "Advanced Therapeutics of Psych and Neuro Disorders",
    "info": "Introduction to neuropsych terminology, neuronanatomy, Parkinson's Disease, seizure disorders, Depression/Pharmacotherapy, sleep disorders, pain/headache pharmacotherapy. Bipolar disorder/mood stabilization.",
    "prereq": {}
  },
  {
    "uid": "788559",
    "code": "PHAR7707",
    "subject": "PHAR",
    "number": "7707",
    "honors": false,
    "writing": false,
    "name": "Infectious Diseases",
    "fullname": "Advanced Therapeutics of Infectious Diseases",
    "info": "Pathophysiology/pharmacotherapy of common infectious diseases.",
    "prereq": {}
  },
  {
    "uid": "788874",
    "code": "PHAR7708",
    "subject": "PHAR",
    "number": "7708",
    "honors": false,
    "writing": false,
    "name": "Patient Assessment I",
    "fullname": "Patient Assessment I",
    "info": "Systematic method to collect health information required to prepare pharmaceutical care plan. Key components of systematic physical assessment of adult patient. Terminology.",
    "prereq": {}
  },
  {
    "uid": "788875",
    "code": "PHAR7709",
    "subject": "PHAR",
    "number": "7709",
    "honors": false,
    "writing": false,
    "name": "Patient Assessment II",
    "fullname": "Patient Assessment II",
    "info": "Students describe role, use various physical-assessment instruments; apply patient/physical assessment skills in monitoring drug therapy.",
    "prereq": {}
  },
  {
    "uid": "789691",
    "code": "PHAR7710",
    "subject": "PHAR",
    "number": "7710",
    "honors": false,
    "writing": false,
    "name": "Endocrine",
    "fullname": "Endocrine",
    "info": "Action/fate of drugs affecting endocrine system and central nervous system.",
    "prereq": {}
  },
  {
    "uid": "789692",
    "code": "PHAR7711",
    "subject": "PHAR",
    "number": "7711",
    "honors": false,
    "writing": false,
    "name": "Respiratory",
    "fullname": "Respiratory",
    "info": "Pathophysiology/pharmacotherapy of common respiratory/pulmonary disorders.",
    "prereq": {}
  },
  {
    "uid": "790177",
    "code": "PHAR7712",
    "subject": "PHAR",
    "number": "7712",
    "honors": false,
    "writing": false,
    "name": "Gastrointestinal",
    "fullname": "Gastrointestinal",
    "info": "Pathophysiology/pharmacotherapy of common gastrointestinal diseases/disorders.",
    "prereq": {}
  },
  {
    "uid": "790178",
    "code": "PHAR7713",
    "subject": "PHAR",
    "number": "7713",
    "honors": false,
    "writing": false,
    "name": "Cardiovascular",
    "fullname": "Cardiovascular",
    "info": "Pathophysiology/pharmacotherapy of commong cardiovascular disorders/diseases.",
    "prereq": {}
  },
  {
    "uid": "017006",
    "code": "PHAR7731",
    "subject": "PHAR",
    "number": "7731",
    "honors": false,
    "writing": false,
    "name": "Geriatric Pharmacotherapy",
    "fullname": "Geriatric Pharmacotherapy I",
    "info": "Basic principles/issues in pharmacology. Therapeutics in care of elderly.",
    "prereq": {}
  },
  {
    "uid": "017007",
    "code": "PHAR7732",
    "subject": "PHAR",
    "number": "7732",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed studies in pharmacy practice.",
    "prereq": {}
  },
  {
    "uid": "789026",
    "code": "PHAR7733",
    "subject": "PHAR",
    "number": "7733",
    "honors": false,
    "writing": false,
    "name": "Elderly Drug Therapy Part II",
    "fullname": "Basic Principles of Drug Therapy for the Elderly--Part II",
    "info": "Principles of pharmacology/therapeutics in care of elderly. Social, environmental, medical factors affecting health care/drug therapy in elderly.",
    "prereq": {}
  },
  {
    "uid": "789828",
    "code": "PHAR7734",
    "subject": "PHAR",
    "number": "7734",
    "honors": false,
    "writing": false,
    "name": "JC Directed Studies",
    "fullname": "JC Directed Studies",
    "info": "Journal directed studies in pharmacy practice, pharmaceutics, medicinal chemistry, or experimental/clinical pharmacology.",
    "prereq": {}
  },
  {
    "uid": "789846",
    "code": "PHAR7735",
    "subject": "PHAR",
    "number": "7735",
    "honors": false,
    "writing": false,
    "name": "Nutrition",
    "fullname": "Clinical Nutrition",
    "info": "Provide nutrition support for neonatal, pediatric, and adult patients.",
    "prereq": {}
  },
  {
    "uid": "789847",
    "code": "PHAR7736",
    "subject": "PHAR",
    "number": "7736",
    "honors": false,
    "writing": false,
    "name": "Natural Medicinals",
    "fullname": "Natural Medicinals",
    "info": "Use of natural medicinals in pharmacy practice.",
    "prereq": {}
  },
  {
    "uid": "790728",
    "code": "PHAR7739",
    "subject": "PHAR",
    "number": "7739",
    "honors": false,
    "writing": false,
    "name": "Natural Medicinals II",
    "fullname": "Natural Medicinals II",
    "info": "Science/application of nutraceuticals in managing inflammatory disorders and gastro-intestinal complaints. Dosages, interactions, and side effects of nutraceutical and other natural medicinals.",
    "prereq": {}
  },
  {
    "uid": "791248",
    "code": "PHAR7740",
    "subject": "PHAR",
    "number": "7740",
    "honors": false,
    "writing": false,
    "name": "Natural Medicinals III",
    "fullname": "Natural Medicinals III",
    "info": "Use of natural medicinals in pharmacy practice.",
    "prereq": {}
  },
  {
    "uid": "791462",
    "code": "PHAR7741",
    "subject": "PHAR",
    "number": "7741",
    "honors": false,
    "writing": false,
    "name": "Clinical Toxicology I",
    "fullname": "Clinical Toxicology I",
    "info": "Management of toxicology issues.",
    "prereq": {}
  },
  {
    "uid": "791463",
    "code": "PHAR7742",
    "subject": "PHAR",
    "number": "7742",
    "honors": false,
    "writing": false,
    "name": "Clinical Toxicology 2",
    "fullname": "Clinical Toxicology II",
    "info": "Management of toxicology issues.",
    "prereq": {}
  },
  {
    "uid": "789027",
    "code": "PHAR7751",
    "subject": "PHAR",
    "number": "7751",
    "honors": false,
    "writing": false,
    "name": "Acute Care",
    "fullname": "Acute Care",
    "info": "Experience in inpatient setting. Students responsible for all drug-related needs of individual patients.",
    "prereq": {}
  },
  {
    "uid": "789297",
    "code": "PHAR7752",
    "subject": "PHAR",
    "number": "7752",
    "honors": false,
    "writing": false,
    "name": "Ambulatory Care",
    "fullname": "Ambulatory Care",
    "info": "Experience in ambulatory setting. Students responsible for drug-related needs of individual patients.",
    "prereq": {}
  },
  {
    "uid": "790897",
    "code": "PHAR7753",
    "subject": "PHAR",
    "number": "7753",
    "honors": false,
    "writing": false,
    "name": "Ambulatory Care II",
    "fullname": "Ambulatory Care II",
    "info": "Experience in ambulatory setting. Students responsible for drug-related needs of individual patients.",
    "prereq": {}
  },
  {
    "uid": "791031",
    "code": "PHAR7754",
    "subject": "PHAR",
    "number": "7754",
    "honors": false,
    "writing": false,
    "name": "Acute Care II",
    "fullname": "Acute Care IIAcute Care II",
    "info": "Experience in an inpatient setting. Students responsible for all drug-related needs of individual patients full-time.",
    "prereq": {}
  },
  {
    "uid": "787608",
    "code": "PHAR7761",
    "subject": "PHAR",
    "number": "7761",
    "honors": false,
    "writing": false,
    "name": "Direct Patient Care",
    "fullname": "Elective Patient Care Clerkship",
    "info": "Supervised clinical pharmacy experience in various patient care settings.\nLearners are responsible for drug related needs of individual patients.",
    "prereq": {}
  },
  {
    "uid": "787791",
    "code": "PHAR7762",
    "subject": "PHAR",
    "number": "7762",
    "honors": false,
    "writing": false,
    "name": "Longitudinal Patient Care",
    "fullname": "Longitudinal Patient Care",
    "info": "Experience using management techniques full time, in pharmacy setting.",
    "prereq": {}
  },
  {
    "uid": "787793",
    "code": "PHAR7763",
    "subject": "PHAR",
    "number": "7763",
    "honors": false,
    "writing": false,
    "name": "Management Clerkship",
    "fullname": "Specialized Management Clerkship",
    "info": "Experience using management techniques full time in a pharmacy setting.",
    "prereq": {}
  },
  {
    "uid": "789353",
    "code": "PHAR7764",
    "subject": "PHAR",
    "number": "7764",
    "honors": false,
    "writing": false,
    "name": "Practice Enhancement",
    "fullname": "Practice Enhancement",
    "info": "Students design a practice enhancement project. Can be completed at regular work site, with project activities that are distinct from regular responsibilities.",
    "prereq": {}
  },
  {
    "uid": "789768",
    "code": "PHAR7765",
    "subject": "PHAR",
    "number": "7765",
    "honors": false,
    "writing": false,
    "name": "Special Mgmt Clerkship II",
    "fullname": "Special Mgmt Clerkship II",
    "info": "Continuation of 7763. Experience using management techniques full time in pharmacy setting.",
    "prereq": {}
  },
  {
    "uid": "790405",
    "code": "PHAR7766",
    "subject": "PHAR",
    "number": "7766",
    "honors": false,
    "writing": false,
    "name": "Patient Care II",
    "fullname": "Elective Patient Care Clerkship II",
    "info": "Supervised clinical pharmacy experience in various patient care settings.  Students are responsible for drug related needs of individual patients.",
    "prereq": {}
  },
  {
    "uid": "790573",
    "code": "PHAR7767",
    "subject": "PHAR",
    "number": "7767",
    "honors": false,
    "writing": false,
    "name": "Clerkship Elective I",
    "fullname": "Clerkship Elective I",
    "info": "Pharm.D. clerkship experience in pharmacy-related areas.",
    "prereq": {}
  },
  {
    "uid": "790574",
    "code": "PHAR7768",
    "subject": "PHAR",
    "number": "7768",
    "honors": false,
    "writing": false,
    "name": "Patient Care III",
    "fullname": "Direct Patient Care III",
    "info": "Patient care experience in any patient care setting. Students are responsible for drug-related needs of individual patients.",
    "prereq": {}
  },
  {
    "uid": "790759",
    "code": "PHAR7769",
    "subject": "PHAR",
    "number": "7769",
    "honors": false,
    "writing": false,
    "name": "Elective Clerkship II",
    "fullname": "Elective Clerkship II",
    "info": "Pharm.D. clerkship experience in pharmacy-related areas. ",
    "prereq": {}
  },
  {
    "uid": "791249",
    "code": "PHAR7770",
    "subject": "PHAR",
    "number": "7770",
    "honors": false,
    "writing": false,
    "name": "Research  Clerkship 1",
    "fullname": "Research  Clerkship 1",
    "info": "Experience using research techniques in basic/clinical sciences or pharmacy practice.",
    "prereq": {}
  }
]