[
  {
    "uid": "002041",
    "code": "PHYS1001W",
    "subject": "PHYS",
    "number": "1001",
    "honors": false,
    "writing": true,
    "name": "Energy and the Environment",
    "fullname": "Energy and the Environment",
    "info": "Fundamental principles governing physical world in context of energy/environment. Lab.\n\nprereq: 1 yr high school algebra",
    "prereq": {}
  },
  {
    "uid": "016130",
    "code": "PHYS1011",
    "subject": "PHYS",
    "number": "1011",
    "honors": false,
    "writing": false,
    "name": "Physcl Wrld",
    "fullname": "Physical World",
    "info": "Fundamental laws and principles governing the physical world, discussed in the context in which encountered in modern science and technology.\n\nprereq: 1  yr high school algebra",
    "prereq": {}
  },
  {
    "uid": "016435",
    "code": "PHYS1012",
    "subject": "PHYS",
    "number": "1012",
    "honors": false,
    "writing": false,
    "name": "Elemen Phys",
    "fullname": "Elementary Physics",
    "info": "Topics represented in context of real world situations. Motion, forces, momentum, energy, heat, vibrations, sound, light, electricity, magnetism. Emphasizes development of logical reasoning skills. Lab.",
    "prereq": {}
  },
  {
    "uid": "807425",
    "code": "PHYS1021",
    "subject": "PHYS",
    "number": "1021",
    "honors": false,
    "writing": false,
    "name": "Intro Phys",
    "fullname": "Intro Phys",
    "info": "",
    "prereq": {}
  },
  {
    "uid": "825884",
    "code": "PHYS1051W",
    "subject": "PHYS",
    "number": "1051",
    "honors": false,
    "writing": true,
    "name": "Quantum Worlds",
    "fullname": "Quantum Worlds",
    "info": "This course consists of two parts that we’ll pursue in parallel. The first is an\nalgebra-based introduction to the basic formalism of quantum mechanics,\npresupposing no more than some high-school algebra and geometry. This part\nwill conclude with a gentle introduction to quantum computing. The other part will\ntrack the debate over the interpretation of quantum mechanics. A century after\nthe introduction of the theory, which underlies much of the technology we now\ntake for granted, there is still no consensus among the experts about how to\npicture the quantum world.",
    "prereq": {}
  },
  {
    "uid": "002066",
    "code": "PHYS1101W",
    "subject": "PHYS",
    "number": "1101",
    "honors": false,
    "writing": true,
    "name": "Intro College Phys I",
    "fullname": "Introductory College Physics I",
    "info": "Fundamental principles of physics in the context of everyday world. Use of kinematics/dynamics principles and quantitative/qualitative problem solving techniques to understand natural phenomena. Lecture, recitation, lab.\n\nprereq: High school algebra, plane geometry, trigonometry; primarily for students interested in technical areas",
    "prereq": {}
  },
  {
    "uid": "002067",
    "code": "PHYS1102W",
    "subject": "PHYS",
    "number": "1102",
    "honors": false,
    "writing": true,
    "name": "Intro College Physics II",
    "fullname": "Introductory College Physics II",
    "info": "Fundamental principles of physics in context of everyday world. Use of conservation principles and quantitative/qualitative problem solving techniques to understand natural phenomena. Lecture, recitation, lab.\n\nprereq: 1101W or 1107",
    "prereq": {
      "or": [
        "002066",
        "798903"
      ]
    }
  },
  {
    "uid": "798903",
    "code": "PHYS1107",
    "subject": "PHYS",
    "number": "1107",
    "honors": false,
    "writing": false,
    "name": "Introductory Physics Online I",
    "fullname": "Introductory Physics Online I",
    "info": "Principles of physics in context of everyday world. Use of kinematics/dynamics principles together with quantitative/qualitative problem solving techniques to understand natural phenomena.\n\nprereq: High school algebra, plane geometry, trigonometry",
    "prereq": {}
  },
  {
    "uid": "800797",
    "code": "PHYS1108",
    "subject": "PHYS",
    "number": "1108",
    "honors": false,
    "writing": false,
    "name": "Introductory Physics Online II",
    "fullname": "Introductory Physics Online II",
    "info": "Fundamental principles of physics in context of everyday world. Use of conservation principles and quantitative/qualitative problem solving techniques to understand natural phenomena. \n\nprereq: 1107; primarily for students interested in technical areas",
    "prereq": {
      "or": [
        "798903"
      ]
    }
  },
  {
    "uid": "016427",
    "code": "PHYS1111",
    "subject": "PHYS",
    "number": "1111",
    "honors": false,
    "writing": false,
    "name": "Basic Phys I",
    "fullname": "Basic Physics I",
    "info": "Algebra-based. Motion of a body in one dimension. Newton's laws of motion. Emphasizes developing systematic approach to problem solving and applying it to problems. Experiments. No lab component.",
    "prereq": {}
  },
  {
    "uid": "016433",
    "code": "PHYS1112",
    "subject": "PHYS",
    "number": "1112",
    "honors": false,
    "writing": false,
    "name": "Basic Phys II",
    "fullname": "Basic Physics II",
    "info": "Algebra-based. Work, energy, momentum, collisions, circular motion, universal gravitation, heat, electricity. Systematic approach to problem solving. Experiments. No lab component. ",
    "prereq": {}
  },
  {
    "uid": "016131",
    "code": "PHYS1114",
    "subject": "PHYS",
    "number": "1114",
    "honors": false,
    "writing": false,
    "name": "Gen Phys Transition",
    "fullname": "General Physics, Transition",
    "info": "Principles of physics for pre-med/biological science students. Description of motion, forces, conservation principles, fields, structures of matter. Forces/effects.",
    "prereq": {}
  },
  {
    "uid": "016155",
    "code": "PHYS1115",
    "subject": "PHYS",
    "number": "1115",
    "honors": false,
    "writing": false,
    "name": "Gen Phys Transition",
    "fullname": "General Physics, Transition",
    "info": "Principles of physics for pre-med/biological science students. Description of motion, forces, conservation principles, fields, structure of matter. Heat, electricity, magnetism.",
    "prereq": {}
  },
  {
    "uid": "016160",
    "code": "PHYS1116",
    "subject": "PHYS",
    "number": "1116",
    "honors": false,
    "writing": false,
    "name": "Gen Phys Transition",
    "fullname": "General Physics, Transition",
    "info": "Principles of physics for pre-med/biological science students. Description of motion, forces, conservation principles, fields, structure of matter. Waves, light modern physics.",
    "prereq": {}
  },
  {
    "uid": "811682",
    "code": "PHYS1181",
    "subject": "PHYS",
    "number": "1181",
    "honors": false,
    "writing": false,
    "name": "Intro College Phys I",
    "fullname": "Introductory College Physics I",
    "info": "Intended only to be used to recognize proficiency in material of PHYS 1101W.\n\nprereq: Proficiency in the material of PHYS 1101W",
    "prereq": {
      "and": [
        "002066"
      ]
    }
  },
  {
    "uid": "811683",
    "code": "PHYS1182",
    "subject": "PHYS",
    "number": "1182",
    "honors": false,
    "writing": false,
    "name": "Intro College Phys II",
    "fullname": "Introductory College Physics II",
    "info": "Intended only to be used to recognize proficiency in material of PHYS 1102W.\n\nprereq: Proficiency in the material of PHYS 1102W",
    "prereq": {
      "and": [
        "002067"
      ]
    }
  },
  {
    "uid": "002068",
    "code": "PHYS1201W",
    "subject": "PHYS",
    "number": "1201",
    "honors": false,
    "writing": true,
    "name": "Intro Phys Biol and Pre-med I",
    "fullname": "Introductory Physics for Biology and Pre-medicine I",
    "info": "Fundamental principles of physics. Description of motion, forces, conservation principles, structure of matter. Applications to mechanical systems, including fluids, waves, heat. Lab.\n\nprereq: [High school or college calculus], trigonometry, algebra",
    "prereq": {}
  },
  {
    "uid": "002069",
    "code": "PHYS1202W",
    "subject": "PHYS",
    "number": "1202",
    "honors": false,
    "writing": true,
    "name": "Phys for Biol and Pre-med II",
    "fullname": "Introductory Physics for Biology and Pre-medicine II",
    "info": "Fundamental principles of physics. Motion, forces, conservation principles, structure of matter. Applications to electromagnetic phenomena, including optics, atomic structure. Lab.\n\nprereq: 1201W",
    "prereq": {
      "and": [
        "002068"
      ]
    }
  },
  {
    "uid": "789553",
    "code": "PHYS1211",
    "subject": "PHYS",
    "number": "1211",
    "honors": false,
    "writing": false,
    "name": "Gen Phys wlab",
    "fullname": "General Physics With Lab",
    "info": "Fundamental principles of physics. Description of motion, forces, conservation principles, structure of matter. Applications to mechanical systems, including fluids, waves, heat. Includes lab. Offered only through CCE Independent and Distance Learning.",
    "prereq": {}
  },
  {
    "uid": "789554",
    "code": "PHYS1212",
    "subject": "PHYS",
    "number": "1212",
    "honors": false,
    "writing": false,
    "name": "Gen Phys II w lab",
    "fullname": "General Physics II With Lab",
    "info": "Fundamental principles of physics. Description of motion, forces, conservation principles, structure of matter. Applications to electromagnetic phenomena, including optics, atomic structure. Includes lab. Offered only through CCE Independent and Distance Learning.",
    "prereq": {}
  },
  {
    "uid": "817964",
    "code": "PHYS1221",
    "subject": "PHYS",
    "number": "1221",
    "honors": false,
    "writing": false,
    "name": "Intro Phys for Life Sci I",
    "fullname": "Introductory Physics for Life Science Majors I",
    "info": "The class exposes the student to physical principles and concepts, demonstrates how these principles can be applied to quantitatively describe natural phenomena, and provides the student with an opportunity to perform hands-on experiments and measurements that model how physical knowledge is obtained. The living world exists in the physical universe, and a complete understanding of biological processes is impossible without a firm foundation in the basic physical principles to which all systems, living and inorganic, must adhere. The basic principles of classical mechanics, fluid mechanics, and oscillations and waves will be examined, with particular emphasis to their application in biological systems, using mathematical analysis at the level of basic calculus.\n\nprereq: High School or College Calculus",
    "prereq": {}
  },
  {
    "uid": "817965",
    "code": "PHYS1222",
    "subject": "PHYS",
    "number": "1222",
    "honors": false,
    "writing": false,
    "name": "Intro Physics Life Science II",
    "fullname": "Introductory Physics for Life Science Majors II",
    "info": "This is the second course in the introductory physics sequence for life science majors. The class exposes the student to physical principles and concepts, demonstrates how these principles can be applied to quantitatively describe natural phenomena, and provides the student with an opportunity to perform hands-on experiments and measurements that model how physical knowledge is obtained. The fundamental principles of thermal physics, electricity and magnetism, optics, and nuclear physics are considered.\n\nprereq: PHYS 1221 or equivalent",
    "prereq": {
      "or": [
        "817964"
      ]
    }
  },
  {
    "uid": "811672",
    "code": "PHYS1281",
    "subject": "PHYS",
    "number": "1281",
    "honors": false,
    "writing": false,
    "name": "Intro Phys for Bio & Pre-med I",
    "fullname": "Introductory Physics for Biology and Pre-medicine I",
    "info": "Intended only to be used to recognize proficiency in material of PHYS 1201W.\n\nprereq: Proficiency in the material of PHYS1201W",
    "prereq": {
      "and": [
        "002068"
      ]
    }
  },
  {
    "uid": "811673",
    "code": "PHYS1282",
    "subject": "PHYS",
    "number": "1282",
    "honors": false,
    "writing": false,
    "name": "Intro Phys Bio & Pre-med II",
    "fullname": "Introductory Physics for Biology and Pre-medicine II",
    "info": "Intended only to be used to recognize proficiency in material of PHYS 1202W.\n\nprereq: Proficiency in the material of PHYS1202W",
    "prereq": {
      "and": [
        "002069"
      ]
    }
  },
  {
    "uid": "002070",
    "code": "PHYS1301W",
    "subject": "PHYS",
    "number": "1301",
    "honors": false,
    "writing": true,
    "name": "Phys for Sci and Engr I",
    "fullname": "Introductory Physics for Science and Engineering I",
    "info": "Use of fundamental principles to solve quantitative problems. Motion, forces, conservation principles, structure of matter. Applications to mechanical systems. \n\nprereq or concurrent: MATH 1271/1371/1371H or equivalent",
    "prereq": {
      "or": [
        "000120",
        "003692"
      ]
    }
  },
  {
    "uid": "002071",
    "code": "PHYS1302W",
    "subject": "PHYS",
    "number": "1302",
    "honors": false,
    "writing": true,
    "name": "Physics for Sci and Engr II",
    "fullname": "Introductory Physics for Science and Engineering II",
    "info": "Use of fundamental principles to solve quantitative problems. Motion, forces, conservation principles, fields, structure of matter. Applications to electromagnetic phenomena. \n\nprereq: PHYS 1301 or equivalent, Prereq or Concurrent: MATH 1272/1372/1572H or equivalent",
    "prereq": {
      "or": [
        "002070",
        "000121",
        "003693"
      ]
    }
  },
  {
    "uid": "811674",
    "code": "PHYS1381",
    "subject": "PHYS",
    "number": "1381",
    "honors": false,
    "writing": false,
    "name": "Intro Phys Sci & Eng I",
    "fullname": "Introductory Physics for Science and Engineering I",
    "info": "Intended only to be used to recognize proficiency in material of PHYS 1301W.\n\nprereq: Proficiency in the material of PHYS1301W",
    "prereq": {
      "and": [
        "002070"
      ]
    }
  },
  {
    "uid": "811675",
    "code": "PHYS1382",
    "subject": "PHYS",
    "number": "1382",
    "honors": false,
    "writing": false,
    "name": "Intro Phys Sci & Eng II",
    "fullname": "Introductory Physics for Science and Engineering II",
    "info": "Intended only to be used to recognize proficiency in material of PHYS 1302W.\n\nprereq: Proficiency in the material of PHYS1302W",
    "prereq": {
      "and": [
        "002071"
      ]
    }
  },
  {
    "uid": "790047",
    "code": "PHYS1901",
    "subject": "PHYS",
    "number": "1901",
    "honors": false,
    "writing": false,
    "name": "Global Warming Solutions",
    "fullname": "Global Warming Solutions",
    "info": "In this seminar, we will consider various possible solutions to the current and future global warming problem. This is a topic of intense global importance. Topics will include efficiency and conservation, reduced carbon in electricity production and transportation, wind and solar power, nuclear power, policy changes, third world solutions, reforestation, and more.",
    "prereq": {}
  },
  {
    "uid": "817090",
    "code": "PHYS1902",
    "subject": "PHYS",
    "number": "1902",
    "honors": false,
    "writing": false,
    "name": "Nanotechnology",
    "fullname": "Nanotechnology",
    "info": "Nanotechnology is increasingly important in our modern world, and now a part of our daily lives. For example, clear sunblock uses nanoparticles. In this course, we will discuss real-world applications and consequences of nanotechnology today, such as the ethical debate around CRISPR-CAS9 editing of human genomes, and the impact of nano in medicine. We will also discuss nanobiology, applications to drugs and energy, as well as new nanomaterials with unique properties. We will also tour the nanofabrication facility in our building. This seminar will be accessible to first year students.",
    "prereq": {}
  },
  {
    "uid": "817072",
    "code": "PHYS1903",
    "subject": "PHYS",
    "number": "1903",
    "honors": false,
    "writing": false,
    "name": "Quantum Mechanics",
    "fullname": "Quantum Mechanics for Everyone",
    "info": "One of the greatest intellectual accomplishments of the twentieth century was the development of quantum mechanics, a field of physics which describes the counter-intuitive behavior of molecules, atoms, light, and subatomic particles. Can you pass through a solid wall without disturbing yourself or the wall? An electron can and does repeatedly in many common semiconductor devices. Without an understanding of quantum mechanics, neither the transistor nor the laser could have been invented. A significant fraction of the entire economy is based on technological developments that derive directly from quantum mechanics. This class will examine, with a bare minimum of mathematics, the conceptual foundations of the strange world of the quantum as well as its connection with devices and systems that we take for granted in our everyday lives.",
    "prereq": {}
  },
  {
    "uid": "790350",
    "code": "PHYS1904",
    "subject": "PHYS",
    "number": "1904",
    "honors": false,
    "writing": false,
    "name": "Conquest of Cold",
    "fullname": "Conquest of Cold",
    "info": "The mastery of cold has yielded innumerable advances, from the\ndevelopment of refrigeration and air-conditioning to phenomenal leaps in examine methods of scientific thought and experimentation that led us to understand thermodynamics, the subject that developed hand-in-hand with the major technologies that involve cold. The latter include refrigeration, frozen food preparation, air conditioning, and the handling of liquefied gases (currently more than a $10 billion industry). Modern scientific developments that will be discussed include superconductors and new states of matter, such as the Quantum Hall liquids and Bose-Einstein condensates, all of which have resulted in Nobel Prizes in physics for their discoverers. \n\nUpon completion of this seminar you will have some understanding of the laws of thermodynamics, you will know what entropy is, and you will appreciate the reality that Minnesota winters are not all that cold on an absolute scale.",
    "prereq": {}
  },
  {
    "uid": "790048",
    "code": "PHYS1905",
    "subject": "PHYS",
    "number": "1905",
    "honors": false,
    "writing": false,
    "name": "Aurora Myths to Modern Science",
    "fullname": "Aurora: From Myths to Modern Science",
    "info": "The aurora, or northern lights, have long fascinated humans. We now know that aurora occur on many other planets, including Jupiter, Neptune, and Uranus. We will examine the myths from both northern and southern hemisphere that were devised to explain this beautiful natural phenomenon. We have not yet developed a complete understanding of the physical process that create the aurora. Many very prominent scientists through the ages have struggled to explain what they observed. It is only with the new measurements made after the space age that we have finally begun to understand the aurora – both on the Earth and on other planets. If the weather and the space weather cooperates, we will try to observe the aurora and related phenomena including sunspots.\n\n",
    "prereq": {}
  },
  {
    "uid": "817386",
    "code": "PHYS1906",
    "subject": "PHYS",
    "number": "1906",
    "honors": false,
    "writing": false,
    "name": "What is Space Weather?",
    "fullname": "What is Space Weather (and Why Should You Care)?",
    "info": "In this class, we will explore the way our sun changes over the eleven-year solar cycle and how this can affect events from GPS signals, airline travel, cell phone coverage, and power outages to beautiful aurora and manned spaceflight to Mars. We will also touch on space weather and the possible impact on development of life on other planets (and exoplanets). If the space weather cooperates, we will try to observe the aurora and related phenomena including sunspots.",
    "prereq": {}
  },
  {
    "uid": "817387",
    "code": "PHYS1907",
    "subject": "PHYS",
    "number": "1907",
    "honors": false,
    "writing": false,
    "name": "The Physics of Warfare",
    "fullname": "The Physics of Warfare",
    "info": "Throughout history and even today, military leaders contemplating war, or involved in it, are always looking for some advantage over their enemies. Most have searched for a new type of wonder weapon, one that the enemy does not have. It is frequently physics that provides a path to this new weapon. Physics and science and technology in general have been of tremendous value to contemporary military leaders. They have given them an understanding of the electromagnetic spectrum so that radiation can be used in various military applications. They have also given them an understanding of rocketry and jet engines, and knowledge of the secrets of the atom so that it is possible to engineer weapons of mass destruction. This course will provide an overview of most branches of physics and in the process of doing so will show how physics has been used for military applications. It will to some extent provide a summary of the history of warfare from the first bows and arrows and chariots, through contemporary weapon systems. Students enrolled in this seminar will learn some physics, and hopefully they will take away enough understanding of contemporary military technology to be informed citizens on issues that command such a large fraction of the national budget.",
    "prereq": {}
  },
  {
    "uid": "790049",
    "code": "PHYS1910W",
    "subject": "PHYS",
    "number": "1910",
    "honors": false,
    "writing": true,
    "name": "What is Time?",
    "fullname": "What is Time?",
    "info": "The precise meaning and use of the concept of time has evoked serious study and debate among the most able of human thinkers for more than 2,000 years. In this seminar, we will review several of the current perspectives as well as some of this history of the concept of time from the points of view of philosophers, biologists, psychologists, and physicists.",
    "prereq": {}
  },
  {
    "uid": "817483",
    "code": "PHYS1911W",
    "subject": "PHYS",
    "number": "1911",
    "honors": false,
    "writing": true,
    "name": "How Likely is Extraterrestrial",
    "fullname": "How Likely is Extraterrestrial Life?",
    "info": "The goal of this course is to familiarize students with the main available scientific facts and arguments which bear on the question of the likelihood of extraterrestrial life. A second goal is to familiarize students with aspects of the various relevant disciplines early in their university careers when they may still be selecting a major. The third goal is to provide familiarity with information resources at the university, particularly through the library, as well as improved reasoning, writing, and speaking skills.",
    "prereq": {}
  },
  {
    "uid": "002077",
    "code": "PHYS2201",
    "subject": "PHYS",
    "number": "2201",
    "honors": false,
    "writing": false,
    "name": "Thermodynamics & Stat Physics",
    "fullname": "Introductory Thermodynamics and Statistical Physics",
    "info": "Thermodynamics and its underlying statistical nature. \n\nPrereq: PHYS 1302W or equivalent",
    "prereq": {}
  },
  {
    "uid": "002072",
    "code": "PHYS2303",
    "subject": "PHYS",
    "number": "2303",
    "honors": false,
    "writing": false,
    "name": "Physics III: Physics of Matter",
    "fullname": "Physics III: Physics of Matter",
    "info": "Thermodynamics, mechanical/electromagnetic waves, optics, quantum theory. Applications of quantum nature of solids.\n\nprereq: 1302, [MATH 1272 or MATH 1372 or MATH 1572H], [MatSci or EE] student",
    "prereq": {
      "and": [
        "002071",
        {
          "or": [
            "000121",
            "003693"
          ]
        }
      ]
    }
  },
  {
    "uid": "016434",
    "code": "PHYS2311",
    "subject": "PHYS",
    "number": "2311",
    "honors": false,
    "writing": false,
    "name": "Modern Physics",
    "fullname": "Modern Physics",
    "info": "Broad overview of physical concepts developed in twentieth century. Special relativity, wave-particle duality, Schrodinger equation, Bohr atom, hydrogen atom in wave mechanics, many-electron atoms, x-rays, nuclear structure, radioactivity, nuclear reactions, statistical physics.\n\nprereq: [1302 or 1402], Chem 1022, Math 2243",
    "prereq": {
      "and": [
        {
          "or": [
            "002071"
          ]
        },
        "002385",
        "000280"
      ]
    }
  },
  {
    "uid": "790541",
    "code": "PHYS2503",
    "subject": "PHYS",
    "number": "2503",
    "honors": false,
    "writing": false,
    "name": "Intro Physics: Sci & Eng III",
    "fullname": "Introductory Physics for Science and Engineering III",
    "info": "Physics 2503 is the third semester of a calculus-based introduction to physics principles, with emphasis on Wave Phenomena, particularly diffraction and interference, the Special Theory of Relativity and Quantum Physics. The course is intended for those students who will go on to study one of the physical sciences or an engineering discipline.\n\nprereq: 1302W or equivalent",
    "prereq": {
      "or": [
        "002071"
      ]
    }
  },
  {
    "uid": "002078",
    "code": "PHYS2601",
    "subject": "PHYS",
    "number": "2601",
    "honors": false,
    "writing": false,
    "name": "Quantum Physics",
    "fullname": "Quantum Physics",
    "info": "Introduction to quantum mechanics. Applications to atomic, molecular, condensed-matter, nuclear, elementary-particle, and statistical physics. \n\nprereq: PHYS2503/2503H, Recommended Concurrent: Phys 3041",
    "prereq": {
      "or": [
        "790541",
        "817153"
      ]
    }
  },
  {
    "uid": "002094",
    "code": "PHYS2605",
    "subject": "PHYS",
    "number": "2605",
    "honors": false,
    "writing": false,
    "name": "Quantum Phys Lab",
    "fullname": "Quantum Physics Laboratory",
    "info": "Laboratory experiments in atomic, solid state, and nuclear physics offered in conjunction with 2601.\n\nprereq: concurrent registration is required (or allowed) in  2601",
    "prereq": {
      "and": [
        "002078"
      ]
    }
  },
  {
    "uid": "799451",
    "code": "PHYS3022",
    "subject": "PHYS",
    "number": "3022",
    "honors": false,
    "writing": false,
    "name": "Introduction to Cosmology",
    "fullname": "Introduction to Cosmology",
    "info": "Large-scale structure and history of universe. Dark matter, cosmic microwave background. Newtonian/relativistic world models. Physics of early universe. Cosmological tests. \n\nPrereq: PHYS 2601",
    "prereq": {}
  },
  {
    "uid": "817153",
    "code": "PHYS3041",
    "subject": "PHYS",
    "number": "3041",
    "honors": false,
    "writing": false,
    "name": "Math Methods for Physicists",
    "fullname": "Mathematical Methods for Physicists",
    "info": "This course introduces additional mathematical topics that physics majors need to properly handle upper division physics classes.\n\nPHYS 1302W, \nPrereq or CC: MATH 2263/2374/2573H or equivalent, Recommended Prereq: 2503/2503H, \nRecommended CC: PHYS 2601",
    "prereq": {}
  },
  {
    "uid": "002076",
    "code": "PHYS3071W",
    "subject": "PHYS",
    "number": "3071",
    "honors": false,
    "writing": true,
    "name": "Lab-Based Physics for Teachers",
    "fullname": "Laboratory-Based Physics for Teachers",
    "info": "Laboratory-based introductory physics. Topics selected to apply to elementary school curriculum: earth's motion, properties of matter, heat and temperature, kinematics, and electric current.\n\nprereq: College algebra; no credit for CSE students or students who have completed PHYS 1201/1202, PHYS 1301/1301, PHYS 1401/1402, or PHYS 1501/1502.",
    "prereq": {
      "or": [
        "002068",
        "002069",
        "002070"
      ]
    }
  },
  {
    "uid": "799723",
    "code": "PHYS3201",
    "subject": "PHYS",
    "number": "3201",
    "honors": false,
    "writing": false,
    "name": "Stat and Thermal Phys",
    "fullname": "Statistical and Thermal Physics",
    "info": "Principles of thermodynamics and statistical mechanics.  Selected applications such as kinetic theory, transport theory, phase transitions.",
    "prereq": {}
  },
  {
    "uid": "817275",
    "code": "PHYS3605W",
    "subject": "PHYS",
    "number": "3605",
    "honors": false,
    "writing": true,
    "name": "Modern Physics Laboratory",
    "fullname": "Modern Physics Laboratory",
    "info": "Laboratory experiments in atomic, solid state, and nuclear physics.  Introduction to data analysis techniques as well as the communication of scientific results through maintaining a logbook and writing papers.\n\nPrerequisites:  completion (or concurrent registration) in PHYS 2503 or 2503H.",
    "prereq": {}
  },
  {
    "uid": "004507",
    "code": "PHYS3993",
    "subject": "PHYS",
    "number": "3993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed study in Physics in areas arranged by the student and a faculty member.\n\nprereq: instr consent, dept  consent",
    "prereq": {}
  },
  {
    "uid": "004511",
    "code": "PHYS3994",
    "subject": "PHYS",
    "number": "3994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Independent, directed study in physics in areas arranged by the student and a faculty member.\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "002079",
    "code": "PHYS4001",
    "subject": "PHYS",
    "number": "4001",
    "honors": false,
    "writing": false,
    "name": "Analytical Mechanics",
    "fullname": "Analytical Mechanics",
    "info": "Analytic Newtonian mechanics. Mathematics beyond prerequisites developed as required. \n\nprereq: PHYS 2503/2503H or equivalent, PHYS 304",
    "prereq": {
      "or": [
        "790541"
      ]
    }
  },
  {
    "uid": "002080",
    "code": "PHYS4002",
    "subject": "PHYS",
    "number": "4002",
    "honors": false,
    "writing": false,
    "name": "Electricity and Magnetism",
    "fullname": "Electricity and Magnetism",
    "info": "Classical theory of electromagnetic fields using vector algebra and vector calculus. \n\nprereq: PHYS 3041, PHYS 2503/2503H or equivalent",
    "prereq": {
      "or": [
        "817153",
        "790541"
      ]
    }
  },
  {
    "uid": "806865",
    "code": "PHYS4041",
    "subject": "PHYS",
    "number": "4041",
    "honors": false,
    "writing": false,
    "name": "Computational Methods",
    "fullname": "Computational Methods in the Physical Sciences",
    "info": "Introduction to using computer programs to solve problems in physical sciences. Selected numerical methods, mapping problems onto computational algorithms. Arranged lab. \n\nPrereq: PHYS 3041",
    "prereq": {}
  },
  {
    "uid": "002081",
    "code": "PHYS4051",
    "subject": "PHYS",
    "number": "4051",
    "honors": false,
    "writing": false,
    "name": "Experimental Physics I",
    "fullname": "Methods of Experimental Physics I",
    "info": "Contemporary experimental techniques. Introduction to modern analog and digital electronics from an experimental viewpoint. Use of computers for data acquisition and experimental control. Statistics of data analysis. \n\nPrereq or Concurrent PHYS 3605W, PHYS 3041",
    "prereq": {}
  },
  {
    "uid": "002082",
    "code": "PHYS4052W",
    "subject": "PHYS",
    "number": "4052",
    "honors": false,
    "writing": true,
    "name": "Experimental Physics II",
    "fullname": "Methods of Experimental Physics II",
    "info": "Second semester of laboratory sequence. Contemporary experimental techniques illustrated by experiments with data analysis. Students design and execute an experimental project. Lectures on specialized topics of professional concern. \n\nprereq: PHYS 4051",
    "prereq": {
      "and": [
        "002081"
      ]
    }
  },
  {
    "uid": "002105",
    "code": "PHYS4071",
    "subject": "PHYS",
    "number": "4071",
    "honors": false,
    "writing": false,
    "name": "Concepts in Phys",
    "fullname": "Concepts in Physics",
    "info": "Overview of physics with emphasis on 20th-century developments. Primarily for secondary teachers and science majors wishing to understand the conceptual connections within physics.\n\nprereq: 2201, 2303",
    "prereq": {
      "and": [
        "002077",
        "002072"
      ]
    }
  },
  {
    "uid": "002095",
    "code": "PHYS4101",
    "subject": "PHYS",
    "number": "4101",
    "honors": false,
    "writing": false,
    "name": "Quantum Mechanics",
    "fullname": "Quantum Mechanics",
    "info": "Mathematical techniques of quantum mechanics. Schrodinger Equation and simple applications. General structure of wave mechanics. Operator methods, perturbation theory, radiation from atoms. \n\nprereq: PHYS 3041, PHYS 2601",
    "prereq": {
      "and": [
        "817153",
        "002078"
      ]
    }
  },
  {
    "uid": "797105",
    "code": "PHYS4111",
    "subject": "PHYS",
    "number": "4111",
    "honors": false,
    "writing": false,
    "name": "Hist 19th-C Phys",
    "fullname": "History of 19th-Century Physics",
    "info": "Legacy of 17th-century experimental and theoretical physics especially light, electricity, magnetism, and heat. Experimental and theoretical discoveries in 19th-century physics set within the context of concurrent educational, institutional, and political developments in Europe and the United States.  Heritage of 19th-century physics.\n",
    "prereq": {}
  },
  {
    "uid": "797185",
    "code": "PHYS4121W",
    "subject": "PHYS",
    "number": "4121",
    "honors": false,
    "writing": true,
    "name": "History 20th-Century Physics",
    "fullname": "History of 20th-Century Physics",
    "info": "The transition from classical to modern physics (relativity, quantum) and its architects (from Planck and Einstein to Heisenberg and Schrödinger). The WWII bomb projects in the US and in Germany. Post-war developments (solid state, particle physics).\nPrereq: calculus or permission from the instructor.",
    "prereq": {}
  },
  {
    "uid": "002096",
    "code": "PHYS4201",
    "subject": "PHYS",
    "number": "4201",
    "honors": false,
    "writing": false,
    "name": "Statistical & Thermal Physics",
    "fullname": "Statistical and Thermal Physics",
    "info": "Principles of thermodynamics and statistical mechanics. Selected applications such as kinetic theory, transport theory, and phase transitions. \n\nprereq: PHYS 3041, PHYS 2201, PHYS 2601",
    "prereq": {
      "and": [
        "817153",
        "002077",
        "002078"
      ]
    }
  },
  {
    "uid": "002097",
    "code": "PHYS4211",
    "subject": "PHYS",
    "number": "4211",
    "honors": false,
    "writing": false,
    "name": "Intro Solid State",
    "fullname": "Introduction to Solid-State Physics",
    "info": "A modern presentation of the properties of solids. Topics include vibrational and electronic properties of solids; diffraction of waves in solids and electron band structure. Other possible topics include optical properties, magnetic phenomena, and superconductivity.\n\nprereq: 2201, 4101",
    "prereq": {
      "and": [
        "002077",
        "002095"
      ]
    }
  },
  {
    "uid": "005430",
    "code": "PHYS4221",
    "subject": "PHYS",
    "number": "4221",
    "honors": false,
    "writing": false,
    "name": "Applied Magnetism",
    "fullname": "Application of Magnetism in the Natural Sciences and Engineering",
    "info": "Multidisciplinary application of magnetism and magnetic phenomena.  Survey for nonspecialists covers fundamental principles of magnetism and how this ubiquitous phenomenon is used in a variety of science and engineering disciplines. Physics of magnetism, rock magnetism, biomagnetism, magnetic sensors, and magnetic recording.",
    "prereq": {}
  },
  {
    "uid": "826595",
    "code": "PHYS4223",
    "subject": "PHYS",
    "number": "4223",
    "honors": false,
    "writing": false,
    "name": "Quantum Computation & Info",
    "fullname": "The Physics of Quantum Computation and Quantum Information",
    "info": "This course is intended to introduce physics majors and graduate students to the tools and concepts underlying quantum information science and quantum computing.  The course will focus on aspects of quantum mechanics central to quantum information science, such as entanglement, quantum measurements, and noise in quantum systems.  Students will learn how the unique features of quantum mechanics can be harnessed for computational power, as well as about the many experimental challenges of doing so. \nPrerequisite - PHYS 2601 (Quantum Physics) or equivalent or instructor permission",
    "prereq": {}
  },
  {
    "uid": "004928",
    "code": "PHYS4303",
    "subject": "PHYS",
    "number": "4303",
    "honors": false,
    "writing": false,
    "name": "Electrodynamics & Waves",
    "fullname": "Electrodynamics and Waves",
    "info": "Analytical mechanics. Electricity/magnetism, including mechanical/electromagnetic wave phenomena. Physical/geometrical optics.\n\nPrereq: PHYS 4002",
    "prereq": {}
  },
  {
    "uid": "002098",
    "code": "PHYS4311",
    "subject": "PHYS",
    "number": "4311",
    "honors": false,
    "writing": false,
    "name": "Intro Nuc Phys",
    "fullname": "Introduction to Nuclear Physics",
    "info": "Survey course for non-specialists and an introductory course for those planning to specialize in nuclear physics. Topics include models of nuclei, interactions between nuclei and between particles and nuclei, tests of conservation laws, fission and fusion, and astrophysical applications.",
    "prereq": {}
  },
  {
    "uid": "002099",
    "code": "PHYS4411",
    "subject": "PHYS",
    "number": "4411",
    "honors": false,
    "writing": false,
    "name": "Elem Partcle Phys",
    "fullname": "Introduction to Elementary Particle Physics",
    "info": "Properties and interactions of the fundamental constituents of nature. Survey for nonspecialists and an introductory course for those intending to specialize in elementary particle physics.",
    "prereq": {}
  },
  {
    "uid": "002100",
    "code": "PHYS4501",
    "subject": "PHYS",
    "number": "4501",
    "honors": false,
    "writing": false,
    "name": "Experimental Proj",
    "fullname": "Experimental Project",
    "info": "Research project in physics area of contemporary interest. Project must be approved by faculty coordinator before registration.\n\nprereq: 4052, instr consent",
    "prereq": {
      "and": [
        "002082"
      ]
    }
  },
  {
    "uid": "790670",
    "code": "PHYS4511",
    "subject": "PHYS",
    "number": "4511",
    "honors": false,
    "writing": false,
    "name": "Intro Nuc and Part Phys",
    "fullname": "Introduction to Nuclear and Particle Physics",
    "info": "Fundamental particles and Standard Model. Symmetries/quarks, models of nuclei, interactions between particles/nuclei, tests of conservation laws, fission/fusion.\n\nprereq: 4101",
    "prereq": {
      "and": [
        "002095"
      ]
    }
  },
  {
    "uid": "002102",
    "code": "PHYS4611",
    "subject": "PHYS",
    "number": "4611",
    "honors": false,
    "writing": false,
    "name": "Intro to Space Physics",
    "fullname": "Introduction to Space Physics",
    "info": "Dynamics of charged particles/plasmas in space. Physics of the Sun and solar wind. Solar/galactic cosmic rays.  Interactions of solar wind with planetary magnetospheres.  Dynamics of Magnetosphere. Formation of the aurora. Physics of radiation belts.\n\nprereq: PHYS 4001, PHYS 4002",
    "prereq": {
      "and": [
        "002079",
        "002080"
      ]
    }
  },
  {
    "uid": "002101",
    "code": "PHYS4621",
    "subject": "PHYS",
    "number": "4621",
    "honors": false,
    "writing": false,
    "name": "Intro to Plasma Physics",
    "fullname": "Introduction to Plasma Physics",
    "info": "Basic properties of collisionless, magnetized plasmas, single particle motion, plasmas as fluids, magnetohydrodynamics, waves in plasmas, equilibrium, instabilities, kinetic theory/shocks.\n\nPrereq: PHYS 4001, PHYS 4002",
    "prereq": {}
  },
  {
    "uid": "002103",
    "code": "PHYS4623",
    "subject": "PHYS",
    "number": "4623",
    "honors": false,
    "writing": false,
    "name": "Modern Optics",
    "fullname": "Introduction to Modern Optics",
    "info": "Modern optics broadly defined as geometrical, physical, and quantum optics, including interference and diffraction, optical polarization, Fourier optics, cavity optics, optical propagation, optical coherence, lasers, optical detection, and optical instruments.",
    "prereq": {}
  },
  {
    "uid": "002104",
    "code": "PHYS4811",
    "subject": "PHYS",
    "number": "4811",
    "honors": false,
    "writing": false,
    "name": "Intro to General Relativity",
    "fullname": "Introduction to General Relativity",
    "info": "Introduction to general relativity for undergraduate students. The course will introduce basic concepts of differential geometry and use them to motivate Einstein's Equation. It will then solve Einstein's equation to study particle orbits, gravitational lensing of light, black holes, and gravitational waves. Brief introduction to cosmology and evolution of the universe will be included.\n\nprereq: PHYS 4001 and (PHYS 2503 or 2503H)",
    "prereq": {
      "and": [
        "002079",
        {
          "or": [
            "790541"
          ]
        }
      ]
    }
  },
  {
    "uid": "791928",
    "code": "PHYS4894",
    "subject": "PHYS",
    "number": "4894",
    "honors": false,
    "writing": false,
    "name": "Thesis - Directed Research",
    "fullname": "Thesis - Directed Research",
    "info": "Thesis research/writing under direction of a faculty member. Students plan/implement scientific study while gaining experience in research methods. Details of work are determined in consultation with faculty thesis adviser selected based on availability/topic. Final grade (S/N) will be based on the completed thesis. \n\nStudents enrolling in this directed research course will complete the University's common Directed Study/Research contract with the faculty mentor/evaluator.",
    "prereq": {}
  },
  {
    "uid": "791407",
    "code": "PHYS4911",
    "subject": "PHYS",
    "number": "4911",
    "honors": false,
    "writing": false,
    "name": "Intro to Biopolymer Physics",
    "fullname": "Introduction to Biopolymer Physics",
    "info": "Introduction to biological and soft condensed matter physics. Emphasizes physical ideas necessary to understand behavior of macromolecules and other biological materials. Elements of thermodynamics and statistical mechanics are presented as needed.\n\nPrereq: PHYS 2201 or equivalent",
    "prereq": {}
  },
  {
    "uid": "796333",
    "code": "PHYS4993",
    "subject": "PHYS",
    "number": "4993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Directed study in Physics in areas arranged by student and faculty member.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "796334",
    "code": "PHYS4994",
    "subject": "PHYS",
    "number": "4994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Independent, directed study in physics in areas arranged by student and a faculty member.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004563",
    "code": "PHYS5001",
    "subject": "PHYS",
    "number": "5001",
    "honors": false,
    "writing": false,
    "name": "Quantum Mechanics I",
    "fullname": "Quantum Mechanics I",
    "info": "Schrodinger equation: bound state and scattering problems in one dimension. Spherically symmetric problems in three dimensions, angular momentum, and the hydrogen atom. Approximation methods for stationary states. Time-dependent perturbation theory. Operators and state vectors: general formalism of quantum theory.\n\nprereq: 4101 or equiv or instr consent",
    "prereq": {
      "or": [
        "002095"
      ]
    }
  },
  {
    "uid": "004564",
    "code": "PHYS5002",
    "subject": "PHYS",
    "number": "5002",
    "honors": false,
    "writing": false,
    "name": "Quantum Mechanics II",
    "fullname": "Quantum Mechanics II",
    "info": "Symmetry in quantum mechanics, space-time symmetries and the rotation group, Clebsch-Gordan coefficients and the Wigner-Eckart theorem. Scattering theory. Method of second quantization with elementary applications. Relativistic wave equations including Dirac equation.\n\nprereq: 5001 or equiv",
    "prereq": {
      "or": [
        "004563"
      ]
    }
  },
  {
    "uid": "004565",
    "code": "PHYS5011",
    "subject": "PHYS",
    "number": "5011",
    "honors": false,
    "writing": false,
    "name": "Classical Phys I",
    "fullname": "Classical Physics I",
    "info": "Classical mechanics: Lagrangian/Hamiltonian mechanics, orbital dynamics, rigid body motion, special relativity.\n\nprereq: 4001, 4002 or instr consent",
    "prereq": {
      "or": [
        "002079",
        "002080"
      ]
    }
  },
  {
    "uid": "004566",
    "code": "PHYS5012",
    "subject": "PHYS",
    "number": "5012",
    "honors": false,
    "writing": false,
    "name": "Classical Phys II",
    "fullname": "Classical Physics II",
    "info": "Classical electromagnetism: electrostatics, magnetostatics, Maxwell's equations, electromagnetic waves, radiation, interaction of charged particles with matter.\n\nprereq: 5011 or instr consent",
    "prereq": {
      "or": [
        "004565"
      ]
    }
  },
  {
    "uid": "791301",
    "code": "PHYS5022",
    "subject": "PHYS",
    "number": "5022",
    "honors": false,
    "writing": false,
    "name": "Cosmology, Universe",
    "fullname": "Relativity, Cosmology, and the Universe",
    "info": "Large-scale structure and history of universe. Introduction to Newtonian and relativistic world models. Physics of early universe. Cosmological tests. Formation of galaxies.\n\nprereq: 2601 or instr consent",
    "prereq": {
      "or": [
        "002078"
      ]
    }
  },
  {
    "uid": "015898",
    "code": "PHYS5024",
    "subject": "PHYS",
    "number": "5024",
    "honors": false,
    "writing": false,
    "name": "Intro to Elec and Mag Flds",
    "fullname": "Introduction to Electric and Magnetic Fields -- Transitional Course",
    "info": "Classical theory of electromagnetic fields using vector algebra and vector calculus. This is a transitional course taught in fall 1999 only. It is open to students who completed Phys 5023 under quarters and need to finish the sequence under semesters.",
    "prereq": {}
  },
  {
    "uid": "004567",
    "code": "PHYS5041",
    "subject": "PHYS",
    "number": "5041",
    "honors": false,
    "writing": false,
    "name": "Mathematical Meth for Physics",
    "fullname": "Mathematical Methods for Physics",
    "info": "Survey of mathematical techniques needed in analysis of physical problems. Emphasizes analytical methods.\n\nprereq: 2601 or grad student",
    "prereq": {
      "or": [
        "002078"
      ]
    }
  },
  {
    "uid": "004568",
    "code": "PHYS5042",
    "subject": "PHYS",
    "number": "5042",
    "honors": false,
    "writing": false,
    "name": "Analyt Num Meth II",
    "fullname": "Analytical and Numerical Methods of Physics II",
    "info": "Survey of mathematical techniques, both analytic and numerical, needed for physics. Application to physical problems.\n\nprereq: 5041 or instr consent",
    "prereq": {
      "or": [
        "004567"
      ]
    }
  },
  {
    "uid": "004617",
    "code": "PHYS5071",
    "subject": "PHYS",
    "number": "5071",
    "honors": false,
    "writing": false,
    "name": "Phys HS Teachers",
    "fullname": "Physics for High School Teachers: Experimental Foundations and Historical Perspectives",
    "info": "In-depth examination of a conceptual theme in physics, its experimental foundations and historical perspectives. Kinematics and dynamics from Aristotle through Einstein; nature of charge and light; energy and thermodynamics; electricity, magnetism, and quantized fields; structure of matter.\n\nprereq: Gen physics, instr consent; no cr for physics grad or grad physics minor",
    "prereq": {}
  },
  {
    "uid": "799432",
    "code": "PHYS5072",
    "subject": "PHYS",
    "number": "5072",
    "honors": false,
    "writing": false,
    "name": "Best Practices in Phys Teach.",
    "fullname": "Best Practices in College Physics Teaching",
    "info": "Pedagogies for introductory physics classes. Topics from educational research/practice as applied to classroom.",
    "prereq": {}
  },
  {
    "uid": "791465",
    "code": "PHYS5081",
    "subject": "PHYS",
    "number": "5081",
    "honors": false,
    "writing": false,
    "name": "Intro to Biopolymer Physics",
    "fullname": "Introduction to Biopolymer Physics",
    "info": "Introduction to biological and soft condensed matter physics. Emphasizes physical ideas necessary to understand behavior of macromolecules and other biological materials.\n\nprereq: PHYS 2201 or equivalent",
    "prereq": {
      "or": [
        "002077"
      ]
    }
  },
  {
    "uid": "791952",
    "code": "PHYS5201",
    "subject": "PHYS",
    "number": "5201",
    "honors": false,
    "writing": false,
    "name": "Thermal and Stat Phys",
    "fullname": "Thermal and Statistical Physics",
    "info": "Equilibrium Statistical Mechanics.  General Principles of Statistical Mechanics:  Ensembles. Derivation of Thermodynamics from statistical principles. Classical Systems. Quantum Statistical Mechanics:  Fundamentals.  Photons.   Ideal Fermi & Bose Gases.  Non-ideal gases. Introduction to Phase Transitions.\n\nprereq: [[4101, 4201] or equiv] previous exposure to thermodynamics, introductory statistical physics",
    "prereq": {
      "and": [
        "002095",
        "002096"
      ]
    }
  },
  {
    "uid": "826396",
    "code": "PHYS5223",
    "subject": "PHYS",
    "number": "5223",
    "honors": false,
    "writing": false,
    "name": "Quantum Computation & Info",
    "fullname": "The Physics of Quantum Computation and Quantum Information",
    "info": "This course is intended to introduce physics majors and graduate students to the tools and concepts underlying quantum information science and quantum computing.  The course will focus on aspects of quantum mechanics central to quantum information science, such as entanglement, quantum measurements, and noise in quantum systems.  Students will learn how the unique features of quantum mechanics can be harnessed for computational power, as well as about the many experimental challenges of doing so. \nPrerequisite - PHYS 2601 (Quantum Physics) or equivalent or instructor permission",
    "prereq": {}
  },
  {
    "uid": "002106",
    "code": "PHYS5401",
    "subject": "PHYS",
    "number": "5401",
    "honors": false,
    "writing": false,
    "name": "Physio Phys",
    "fullname": "Physiological Physics",
    "info": "Musculoskeletal system, circulatory system/membrane transport, biological control systems, propagation/action potential in nervous system, biomagnetism, electromagnetism at cellular level.\n\nprereq: One semester of introductory calculus-based physics, such as PHYS1301W. Students not sure if they meet prerequisites should consult instructor.",
    "prereq": {}
  },
  {
    "uid": "002107",
    "code": "PHYS5402",
    "subject": "PHYS",
    "number": "5402",
    "honors": false,
    "writing": false,
    "name": "Radiological Physics",
    "fullname": "Radiological Physics",
    "info": "Signal analysis, medical imaging, medical x-rays, tomography, radiation therapy, nuclear medicine, MRI, similar topics.\n\nprereq: Two semesters of introductory calculus-based physics, such as PHYS1302W. Students not sure if they meet prerequisites should consult instructor.",
    "prereq": {}
  },
  {
    "uid": "808499",
    "code": "PHYS5621",
    "subject": "PHYS",
    "number": "5621",
    "honors": false,
    "writing": false,
    "name": "Intro Plasma Phys",
    "fullname": "Introduction to Plasma Physics",
    "info": "Basic properties of collisionless, magnetized plasmas, single particle motion, plasmas as fluids, magnetohydrodynamics, waves in plasmas, equilibrium, instabilities, kinetic theory/shocks.\n\nprereq: CSE grad student, working knowledge of waves/electromagnetism",
    "prereq": {}
  },
  {
    "uid": "004204",
    "code": "PHYS5701",
    "subject": "PHYS",
    "number": "5701",
    "honors": false,
    "writing": false,
    "name": "Solid State Eng I",
    "fullname": "Solid-State Physics for Engineers and Scientists",
    "info": "Crystal structure and binding; diffraction; phonons; thermal and dielectric properties of insulators; free electron model; band structure; \nsemiconductors.\n\nprereq: Grad or advanced undergrad in physics or engineering or the sciences",
    "prereq": {}
  },
  {
    "uid": "004205",
    "code": "PHYS5702",
    "subject": "PHYS",
    "number": "5702",
    "honors": false,
    "writing": false,
    "name": "Solid State Eng II",
    "fullname": "Solid State Physics for Engineers and Scientists",
    "info": "Diamagnetism and paramagnetism; ferromagnetism and antiferromagnetism; optical phenomena; lasers; superconductivity; surface properties; ferroelectricity.\n\nprereq: 5701 or instr consent",
    "prereq": {
      "or": [
        "004204"
      ]
    }
  },
  {
    "uid": "825168",
    "code": "PHYS5750",
    "subject": "PHYS",
    "number": "5750",
    "honors": false,
    "writing": false,
    "name": "Adv. Topic Quantum Mech & Info",
    "fullname": "Advanced Topics in Quantum Mechanics and Quantum Information",
    "info": "Topics may include quantum circuits and algorithms, hardware considerations for quantum computing, quantum information theory, and open quantum systems.",
    "prereq": {}
  },
  {
    "uid": "004514",
    "code": "PHYS5950",
    "subject": "PHYS",
    "number": "5950",
    "honors": false,
    "writing": false,
    "name": "Colloquium Seminar",
    "fullname": "Colloquium Seminar",
    "info": "Colloquium of School of Physics and Astronomy.\n\nprereq: [Grad student or advanced undergrad in physics], dept consent",
    "prereq": {}
  },
  {
    "uid": "804737",
    "code": "PHYS5970",
    "subject": "PHYS",
    "number": "5970",
    "honors": false,
    "writing": false,
    "name": "Physics Journal Club",
    "fullname": "Physics Journal Club",
    "info": "Weekly student-led presentation, discussion, and critical analysis of important papers.\n\nprereq: 2601, 2605 or equiv; intended for 2nd-yr grad students in physics",
    "prereq": {
      "or": [
        "002078",
        "002094"
      ]
    }
  },
  {
    "uid": "004509",
    "code": "PHYS5980",
    "subject": "PHYS",
    "number": "5980",
    "honors": false,
    "writing": false,
    "name": "Research Seminar",
    "fullname": "Introduction to Research Seminar",
    "info": "Introduction to the research activities of the School of Physics and Astronomy.\n\nprereq: Grad or upper div phys major",
    "prereq": {}
  },
  {
    "uid": "004508",
    "code": "PHYS5993",
    "subject": "PHYS",
    "number": "5993",
    "honors": false,
    "writing": false,
    "name": "Directed Studies",
    "fullname": "Directed Studies",
    "info": "Independent, directed study in physics in areas arranged by the student and a faculty member.\n\nprereq: instr consent, dept consent",
    "prereq": {}
  },
  {
    "uid": "004510",
    "code": "PHYS5994",
    "subject": "PHYS",
    "number": "5994",
    "honors": false,
    "writing": false,
    "name": "Directed Research",
    "fullname": "Directed Research",
    "info": "Problems, experimental or theoretical, of special interest to students. Written reports.\n\nprereq: Jr, dept consent",
    "prereq": {}
  },
  {
    "uid": "004599",
    "code": "PHYS8001",
    "subject": "PHYS",
    "number": "8001",
    "honors": false,
    "writing": false,
    "name": "Adv Quant Mech",
    "fullname": "Advanced Quantum Mechanics",
    "info": "Topics in non-relativistic quantum mechanics; second quantization. Introduction to Diagrammatic and Green's function techniques and to relativistic wave equations. Application of relativistic perturbation theory to particle interactions with electromagnetic field. Invariant interactions of elementary particles.\n\nprereq: 5002 or instr consent",
    "prereq": {
      "or": [
        "004564"
      ]
    }
  },
  {
    "uid": "004601",
    "code": "PHYS8011",
    "subject": "PHYS",
    "number": "8011",
    "honors": false,
    "writing": false,
    "name": "Quant Field Thy I",
    "fullname": "Quantum Field Theory I",
    "info": "Second quantization of relativistic wave equations: canonical quantization of the free scalar and Dirac fields. Fields in interaction: interaction picture. Quantum electrodynamics: quantization of the electromagnetic field, propagators and Feynman rules, tree-level processes. Higher-order processes and renormalization.\n\nprereq: 8001 or instr consent",
    "prereq": {
      "or": [
        "004599"
      ]
    }
  },
  {
    "uid": "009927",
    "code": "PHYS8012",
    "subject": "PHYS",
    "number": "8012",
    "honors": false,
    "writing": false,
    "name": "Quant Field Thy II",
    "fullname": "Quantum Field Theory II",
    "info": "Aspects of general theory of quantized fields, including space-time and discrete transformation properties, the CPT theorem, and the spin-statistics connection. Introduction to functional and path-integral methods. Renormalization group and asymptotic freedom. Semi-classical methods and instantons in gauge theories.\n\nprereq: 8011 or instr consent",
    "prereq": {
      "or": [
        "004601"
      ]
    }
  },
  {
    "uid": "009933",
    "code": "PHYS8013",
    "subject": "PHYS",
    "number": "8013",
    "honors": false,
    "writing": false,
    "name": "Spec Top Quant Fld",
    "fullname": "Special Topics in Quantum Field Theory",
    "info": "Includes non-perturbative methods in quantum field theory, supersymmetry, two-dimensional quantum field theories and their applications, lattice simulations of quantum fields, topological quantum field theories, quantum field theory methods applied to condensed matter physics, and string theory.\n\nprereq: 8012 or instr consent",
    "prereq": {
      "or": [
        "009927"
      ]
    }
  },
  {
    "uid": "818818",
    "code": "PHYS8014",
    "subject": "PHYS",
    "number": "8014",
    "honors": false,
    "writing": false,
    "name": "Quantum Many Body Systems",
    "fullname": "Quantum many Body Systems",
    "info": "Applications of quantum field theory to systems at finite density and temperature.  Perturbative field theory of the interacting electron gas and its response functions.  Instabilities of interacting fermions at finite density using renormalization group and diagrammatic methods. ",
    "prereq": {}
  },
  {
    "uid": "004583",
    "code": "PHYS8100",
    "subject": "PHYS",
    "number": "8100",
    "honors": false,
    "writing": false,
    "name": "Sem: Phys Teach",
    "fullname": "Seminar: Problems of Physics Teaching and Higher Education",
    "info": "Lectures and informal discussions of courses and curricula, techniques, and materials important in undergraduate physics instruction; relation to general problems of higher education.",
    "prereq": {}
  },
  {
    "uid": "796885",
    "code": "PHYS8161",
    "subject": "PHYS",
    "number": "8161",
    "honors": false,
    "writing": false,
    "name": "Atomic and Molecular Structure",
    "fullname": "Atomic and Molecular Structure",
    "info": "Emphasizes interpretation of quantum numbers and selection rules in terms of symmetry. Experimental data summarized and compared with theoretical predictions.\n\nprereq: Level of mathematics associated with BS in physical sciences",
    "prereq": {}
  },
  {
    "uid": "794054",
    "code": "PHYS8200",
    "subject": "PHYS",
    "number": "8200",
    "honors": false,
    "writing": false,
    "name": "Cos/High En Astro Seminar",
    "fullname": "Seminar: Cosmology and High Energy Astrophysics",
    "info": "Current topics in cosmology and high energy astrophysics.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "804846",
    "code": "PHYS8300",
    "subject": "PHYS",
    "number": "8300",
    "honors": false,
    "writing": false,
    "name": "Biophysics Seminar",
    "fullname": "Seminar: Biological and Medical Physics.",
    "info": "Current research in biological and medical physics\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004592",
    "code": "PHYS8301",
    "subject": "PHYS",
    "number": "8301",
    "honors": false,
    "writing": false,
    "name": "Symmetry",
    "fullname": "Symmetry and Its Application to Physical Problems",
    "info": "Fundamental invariance principles obeyed by laws of physics. Group theory as tool for using symmetry and invariance to help understand behavior of physical systems. Applications made to atomic, molecular, nuclear, condensed-matter, and elementary particle physics.\n\nprereq: 5002 or instr consent",
    "prereq": {
      "or": [
        "004564"
      ]
    }
  },
  {
    "uid": "800044",
    "code": "PHYS8311",
    "subject": "PHYS",
    "number": "8311",
    "honors": false,
    "writing": false,
    "name": "Molecular Biophysics",
    "fullname": "Biological Physics of Single Molecules",
    "info": "Biological molecules, based on statistical mechanics, kinetics, optics, and other physics ideas. Physics of DNA/proteins, their interactions. Force spectroscopy (optical tweezers, atomic force microscopy). Concepts of optical spectroscopy. Single molecule fluorescence/imaging.\n\nprereq: [[5201 or Chen 4707], 5011] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "791952",
            "789543"
          ]
        },
        "004565"
      ]
    }
  },
  {
    "uid": "800045",
    "code": "PHYS8312",
    "subject": "PHYS",
    "number": "8312",
    "honors": false,
    "writing": false,
    "name": "Macroscopic Biophysics",
    "fullname": "Biological Physics of Macroscopic Systems",
    "info": "Macroscopic systems, based on physics such as fluid dynamics, statistical mechanics, non-linear dynamics, and chaos theory. Super-molecular aggregates. Biological physics of the cell. Biological physics of populations/evolution.\n\nprereq: [[5201 or CHEN 4707], 5011] or instr consent",
    "prereq": {
      "and": [
        {
          "or": [
            "791952",
            "789543"
          ]
        },
        "004565"
      ]
    }
  },
  {
    "uid": "788261",
    "code": "PHYS8333",
    "subject": "PHYS",
    "number": "8333",
    "honors": false,
    "writing": false,
    "name": "FTE: Master's",
    "fullname": "FTE: Master's",
    "info": "(No description)\n\nprereq: Master's student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "004593",
    "code": "PHYS8401",
    "subject": "PHYS",
    "number": "8401",
    "honors": false,
    "writing": false,
    "name": "Atom Molec Struc",
    "fullname": "Atomic and Molecular Structure",
    "info": "Understanding behavior of atoms and molecules in terms of basic interactions between electrons and nuclei and electromagnetic radiation.  Applications made to condensed-matter physics, astrophysics, biophysics, and physical chemistry.",
    "prereq": {}
  },
  {
    "uid": "788401",
    "code": "PHYS8444",
    "subject": "PHYS",
    "number": "8444",
    "honors": false,
    "writing": false,
    "name": "FTE: Doctoral",
    "fullname": "FTE: Doctoral",
    "info": "(No description)\n\nprereq: Doctoral student, adviser and DGS consent",
    "prereq": {}
  },
  {
    "uid": "004594",
    "code": "PHYS8500",
    "subject": "PHYS",
    "number": "8500",
    "honors": false,
    "writing": false,
    "name": "Plan B Proj",
    "fullname": "Plan B Project",
    "info": "Project topic arranged between student and instructor. Written report required.\n\nprereq: instr consent; may be taken once to satisfy Plan B master's project requirement; no cr toward PhD",
    "prereq": {}
  },
  {
    "uid": "004569",
    "code": "PHYS8501",
    "subject": "PHYS",
    "number": "8501",
    "honors": false,
    "writing": false,
    "name": "Gen Rel Cosmol I",
    "fullname": "General Relativity and Cosmology I",
    "info": "Tensor analysis and differential geometry. Special relativity leading to formulation of principles of general relativity and Einstein's equations. Tests of general relativity and thorough discussion of various black hole solutions, including Schwarzschild, Reissner-Nordstom, and Kerr solutions.\n\nprereq: 5012 or instr consent",
    "prereq": {
      "or": [
        "004566"
      ]
    }
  },
  {
    "uid": "004570",
    "code": "PHYS8502",
    "subject": "PHYS",
    "number": "8502",
    "honors": false,
    "writing": false,
    "name": "Gen Rel Cosmol II",
    "fullname": "General Relativity and Cosmology II",
    "info": "Gravitational radiation. Applications of general relativity to stellar structure of white dwarfs and neutron stars, action principle, and symmetric spaces. Big-bang cosmology, strongly emphasizing particle physics.\n\nprereq: 8501 or instr consent",
    "prereq": {
      "or": [
        "004569"
      ]
    }
  },
  {
    "uid": "819799",
    "code": "PHYS8581",
    "subject": "PHYS",
    "number": "8581",
    "honors": false,
    "writing": false,
    "name": "Big Data in Astrophysics",
    "fullname": "Big Data in Astrophysics",
    "info": "This course will introduce key concepts and techniques used to work with large datasets, in the context of the field of astrophysics.\n\nPrerequisites: MATH 2263 and MATH 2243, or equivalent; or instructor consent.\nSuggested: familiarity with astrophysics topics such as star formation and evolution, galaxies and clusters, composition and expansion of the universe, gravitational wave sources and waveforms, and high-energy astrophysics.",
    "prereq": {}
  },
  {
    "uid": "004584",
    "code": "PHYS8600",
    "subject": "PHYS",
    "number": "8600",
    "honors": false,
    "writing": false,
    "name": "Space Phys Seminar",
    "fullname": "Seminar: Space Physics",
    "info": "Current topics in space physics and plasma physics.",
    "prereq": {}
  },
  {
    "uid": "004571",
    "code": "PHYS8601",
    "subject": "PHYS",
    "number": "8601",
    "honors": false,
    "writing": false,
    "name": "Plasma Physics I",
    "fullname": "Plasma Physics I",
    "info": "Theory of plasma waves and instabilities in plasmas, magnetohydrodynamics, nonlinear waves in plasmas, wave propagation in inhomogeneous plasmas.\n\nprereq: 4621, 5012 or instr consent",
    "prereq": {
      "or": [
        "002101",
        "004566"
      ]
    }
  },
  {
    "uid": "004572",
    "code": "PHYS8602",
    "subject": "PHYS",
    "number": "8602",
    "honors": false,
    "writing": false,
    "name": "Plasma Physics II",
    "fullname": "Plasma Physics II",
    "info": "Theory of plasma waves and instabilities, collisions, radiation, transport, nonlinear wave-particle and wave-wave interactions, instabilities in inhomogeneous plasmas.\n\nprereq: 8601 or instr consent",
    "prereq": {
      "or": [
        "004571"
      ]
    }
  },
  {
    "uid": "004582",
    "code": "PHYS8611",
    "subject": "PHYS",
    "number": "8611",
    "honors": false,
    "writing": false,
    "name": "Cosmic Rays and Plasma Astro",
    "fullname": "Cosmic Rays and Plasma Astrophysics",
    "info": "Properties of energetic particles in heliosphere and in astrophysical environments; solar physics, including radiation and magnetic effects; solar wind and magnetospheric physics; physics of radiation belts.\n\nprereq: 5012 or instr consent",
    "prereq": {
      "or": [
        "004566"
      ]
    }
  },
  {
    "uid": "004588",
    "code": "PHYS8650",
    "subject": "PHYS",
    "number": "8650",
    "honors": false,
    "writing": false,
    "name": "Adv Top Space Phys",
    "fullname": "Advanced Topics in Space and Plasma Physics",
    "info": "Topics in plasma waves and instabilities, solar physics, cosmic ray physics, atmospheric physics or planetary physics.\n\nprereq: 8602 or 8611 or instr consent",
    "prereq": {
      "or": [
        "004572",
        "004582"
      ]
    }
  },
  {
    "uid": "788514",
    "code": "PHYS8666",
    "subject": "PHYS",
    "number": "8666",
    "honors": false,
    "writing": false,
    "name": "Doct Pre-Thesis Cr",
    "fullname": "Doctoral Pre-Thesis Credits",
    "info": "TBD\n\nprereq: Doctoral student who has not passed prelim oral; no required consent for 1st/2nd registrations, up to 12 combined cr; dept consent for 3rd/4th registrations, up to 24 combined cr; doctoral student admitted before summer 2007 may register up to four times, up to 60 combined cr",
    "prereq": {}
  },
  {
    "uid": "004585",
    "code": "PHYS8700",
    "subject": "PHYS",
    "number": "8700",
    "honors": false,
    "writing": false,
    "name": "Cond Matter Seminar",
    "fullname": "Seminar: Condensed Matter Physics",
    "info": "Current research.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "004573",
    "code": "PHYS8701",
    "subject": "PHYS",
    "number": "8701",
    "honors": false,
    "writing": false,
    "name": "Stat Mech Trans I",
    "fullname": "Statistical Mechanics and Transport Theory I",
    "info": "Equilibrium properties of macroscopic classical and quantum systems. Phase transitions and Renormalization Group. Transport theory. Applications to soft condensed matter systems.    ",
    "prereq": {}
  },
  {
    "uid": "004574",
    "code": "PHYS8702",
    "subject": "PHYS",
    "number": "8702",
    "honors": false,
    "writing": false,
    "name": "Stat Mech Trans",
    "fullname": "Statistical Mechanics and Transport Theory",
    "info": "Equilibrium properties of macroscopic classical and quantum systems. Phase transitions and Renormalization Group. Transport theory. Applications to soft condensed matter systems.\n\nprereq: 5201 or instr consent",
    "prereq": {
      "or": [
        "791952"
      ]
    }
  },
  {
    "uid": "004575",
    "code": "PHYS8711",
    "subject": "PHYS",
    "number": "8711",
    "honors": false,
    "writing": false,
    "name": "Solid St Phys I",
    "fullname": "Solid-State Physics I",
    "info": "Fundamental properties of solids. Electronic structure and transport in metals and semiconductors. Properties of disordered materials.\n\nprereq: 4211, 5002 or instr consent",
    "prereq": {
      "or": [
        "002097",
        "004564"
      ]
    }
  },
  {
    "uid": "004576",
    "code": "PHYS8712",
    "subject": "PHYS",
    "number": "8712",
    "honors": false,
    "writing": false,
    "name": "Solid St Phys II",
    "fullname": "Solid-State Physics II",
    "info": "Fundamental properties of solids. Electronic structure and transport in metals and semiconductors. Properties of disordered materials.\n\nprereq: 8711 or instr consent",
    "prereq": {
      "or": [
        "004575"
      ]
    }
  },
  {
    "uid": "004589",
    "code": "PHYS8750",
    "subject": "PHYS",
    "number": "8750",
    "honors": false,
    "writing": false,
    "name": "Adv Top Cond Matter",
    "fullname": "Advanced Topics in Condensed Matter Physics",
    "info": "Sample research topics: magnetism, superconductivity, low temperature physics, superfluid helium.\n\nprereq: 8712 or instr consent",
    "prereq": {
      "or": [
        "004576"
      ]
    }
  },
  {
    "uid": "788642",
    "code": "PHYS8777",
    "subject": "PHYS",
    "number": "8777",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Mast*",
    "fullname": "Thesis Credits: Master's",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 10 cr total required [Plan A only]",
    "prereq": {}
  },
  {
    "uid": "004586",
    "code": "PHYS8800",
    "subject": "PHYS",
    "number": "8800",
    "honors": false,
    "writing": false,
    "name": "Nuc Phys Seminar",
    "fullname": "Seminar: Nuclear Physics",
    "info": "Current research topics.",
    "prereq": {}
  },
  {
    "uid": "004577",
    "code": "PHYS8801",
    "subject": "PHYS",
    "number": "8801",
    "honors": false,
    "writing": false,
    "name": "Nuc Physics I",
    "fullname": "Nuclear Physics I",
    "info": "Nuclear/neutrino astrophysics. Thermonuclear reactions. Processes of nucleosynthesis. Origin of the elements. Stellar evolution. Theory of supernovae. Exotic stars. Chemical evolution of galaxies.\n\nprereq: 5001, 5002, 5011, 5012, 5201; AST 4001 recommended",
    "prereq": {
      "and": [
        "004563",
        "004564",
        "004565",
        "004566",
        "791952",
        "795355"
      ]
    }
  },
  {
    "uid": "004579",
    "code": "PHYS8802",
    "subject": "PHYS",
    "number": "8802",
    "honors": false,
    "writing": false,
    "name": "Nuc Physics II",
    "fullname": "Nuclear Physics II",
    "info": "Properties of nuclei based on hadronic and quark-gluon degrees of freedom.  Relativistic field theory at finite temperatures and density applied to many-body problems, especially nuclear matter and quark-gluon plasma.  Applications to lepton and hadron scattering, nucleus-nucleus collisions, astrophysics and cosmology.\n\nprereq: 8801 or instr consent",
    "prereq": {
      "or": [
        "004577"
      ]
    }
  },
  {
    "uid": "004590",
    "code": "PHYS8850",
    "subject": "PHYS",
    "number": "8850",
    "honors": false,
    "writing": false,
    "name": "Adv Top Nuc Phys",
    "fullname": "Advanced Topics in Nuclear Physics",
    "info": "Research topics.\n\nprereq: 8802 or instr consent",
    "prereq": {
      "or": [
        "004579"
      ]
    }
  },
  {
    "uid": "787920",
    "code": "PHYS8888",
    "subject": "PHYS",
    "number": "8888",
    "honors": false,
    "writing": false,
    "name": "Thesis Credit:Doct*",
    "fullname": "Thesis Credit: Doctoral",
    "info": "(No description)\n\nprereq: Max 18 cr per semester or summer; 24 cr required",
    "prereq": {}
  },
  {
    "uid": "004587",
    "code": "PHYS8900",
    "subject": "PHYS",
    "number": "8900",
    "honors": false,
    "writing": false,
    "name": "Elem Particle Sem",
    "fullname": "Seminar: Elementary Particle Physics",
    "info": "Elementary particle physics, high energy physics, particle astrophysics and cosmology.",
    "prereq": {}
  },
  {
    "uid": "004580",
    "code": "PHYS8901",
    "subject": "PHYS",
    "number": "8901",
    "honors": false,
    "writing": false,
    "name": "Elem Part Phys I",
    "fullname": "Elementary Particle Physics I",
    "info": "Types of fundamental interactions. Exact and approximate symmetries and conservation laws. Gauge quanta: gluons, photons, W and Z bosons, gravitons.  Fundamental fermions: leptons and quarks. Isotopic and flavor SU(3) symmetries of strong interaction. Heavy hadrons. Amplitudes and probabilities. Quantum chromodynamics.\n\nprereq: 8001 or instr consent",
    "prereq": {
      "or": [
        "004599"
      ]
    }
  },
  {
    "uid": "004581",
    "code": "PHYS8902",
    "subject": "PHYS",
    "number": "8902",
    "honors": false,
    "writing": false,
    "name": "Elem Part Phys II",
    "fullname": "Elementary Particle Physics II",
    "info": "Deep inelastic scattering. Weak interactions of leptons. Semileptonic and nonleptonic weak processes with hadons. Oscillations of neutral Kaons. Violation of CP symmetry in Kaons. Neutrino masses and oscillations. Standard model of the electroweak interaction. Grand unification.  Unitarity of the S matrix. Properties of soft pions.\n\nprereq: 8901 or instr consent",
    "prereq": {
      "or": [
        "004580"
      ]
    }
  },
  {
    "uid": "796886",
    "code": "PHYS8911",
    "subject": "PHYS",
    "number": "8911",
    "honors": false,
    "writing": false,
    "name": "Introduction to Supersymmetry",
    "fullname": "Introduction to Supersymmetry",
    "info": "Motivation. Coleman-Mandula theorem. Supersymmetric Quantum Mechanics. 4D supersymmetry algebra and representations. Extended supersymmetry. N=1 superspace and superfields. Supersymmetric guage theories. Chiral/vector multiplets. Non-renormalization theorems. Supersymmetry breaking. Supersymmetric Standard Model. Phenomenology. Nonperturbative supersymmetry. Supergravity.\n\nprereq: 8011 or instr consent",
    "prereq": {
      "or": [
        "004601"
      ]
    }
  },
  {
    "uid": "004591",
    "code": "PHYS8950",
    "subject": "PHYS",
    "number": "8950",
    "honors": false,
    "writing": false,
    "name": "Adv Top Elem Part",
    "fullname": "Advanced Topics in Elementary Particle Physics",
    "info": "Research topics.\n\nprereq: 8902 or instr consent",
    "prereq": {
      "or": [
        "004581"
      ]
    }
  },
  {
    "uid": "004598",
    "code": "PHYS8994",
    "subject": "PHYS",
    "number": "8994",
    "honors": false,
    "writing": false,
    "name": "Phys Research",
    "fullname": "Research in Physics",
    "info": "Research under faculty direction.\n\nprereq: instr consent",
    "prereq": {}
  },
  {
    "uid": "825979",
    "code": "PHYS8996",
    "subject": "PHYS",
    "number": "8996",
    "honors": false,
    "writing": false,
    "name": "Curricular Practical Training",
    "fullname": "Curricular Practical Training",
    "info": "Phys8996 CPT is a one-credit course taken pass/fail by international students engaging in an internship at an industrial work environment. Grade is based on final report/presentation covering work assignment. The presentation is to be coordinated with the Director of Career Education.\nThe course will not count toward credit requirements in the School of Physics and Astronomy graduate programs.\n\n",
    "prereq": {}
  }
]